{
    "title": "How to Celebrate Saraswati Puja at Home",
    "url": "https://www.wikihow.com/Celebrate-Saraswati-Puja-at-Home",
    "category_hierarchy": [
        "Food and Entertaining",
        "Parties"
    ],
    "parts": [
        {
            "name": "Performing Morning Rituals",
            "steps": [
                {
                    "headline": "Wake up between 5:00 - 8:00 a.m.",
                    "description": "When performing the Saraswati puja at home, waking up early in the day is traditional practice. You can set an alarm for 5:00 - 8:00 a.m., or you can wake up when the sunshine comes through your window. Give yourself at least 1 hour to complete the ritual, though some people spend longer."
                },
                {
                    "headline": "Rub a paste made of neem and turmeric over all of your body.",
                    "description": "To make the paste, soak 20 or so neem leaves in hot water until they are soft, strain the leaves, and then grind the leaves with a mortar and pestle. Then, pour in about ¼ teaspoon (1.23 g) of ground turmeric into the mortar and pestle. Grind up the paste, then rub a thin, even layer over your face, chest, arms, torso, and legs. This paste is believed to have therapeutic and medicinal effects. For example, neem and turmeric paste works great to treat acne and maintain healthy skin. Make more paste as needed."
                },
                {
                    "headline": "Soak in a bath with neem and tulsi leaves.",
                    "description": "After you’ve applied the neem and turmeric paste over your body, fill up your bathtub with warm water, and sprinkle 1–3 grams (0.035–0.11 oz) of both neem and tulsi leaves into the water. Soak in the tub for 15-30 minutes, and scrub off the neem and turmeric paste. The bath purifies the body and protects you against infection."
                },
                {
                    "headline": "Wear white or yellow colored clothing.",
                    "description": "After your bath, it is custom to dress in these hues to perform the puja. You can wear a pair of pants, a skirt, a blouse, or a dress in these hues. Typically, those performing the puja dress in 1 of these colors, rather than dressing with some hues of both. For example, you may dress head-to-toe in white linens or you may adorn yourself in yellow clothing. Yellow is the color of knowledge and learning in Hinduism. White represents purity, peace, and knowledge."
                }
            ]
        },
        {
            "name": "Setting up the Idol and Kalash",
            "steps": [
                {
                    "headline": "Clean your home the day before you perform the Saraswati puja.",
                    "description": "Before you perform the puja, clean your house thoroughly. Tidy up your spaces, and in particular, arrange all of your books upright on your shelves. Use a natural cleaning product like castile soap, vinegar solution, or essential oil to clean your tools, computer, and laptop. If you can’t clean the day before, do this after you purify yourself. If you are performing the puja as part of your Navratri celebration, everything must be cleaned by the 8th day of Navratri. If you can't use natural cleaning products, you can use an all-purpose cleaner. Natural cleaning products are safer for the environment and more pleasing to Goddess Saraswati than harsh chemicals. Since Saraswati is the Goddess of learning, it is suggested that she appreciates arranging your library properly."
                },
                {
                    "headline": "Lay a white cloth on a raised platform and place your idol on top.",
                    "description": "This is the base of your altar. You can use any piece of white fabric, such as silk or linen. Smooth out the cloth with your hand so there are no folds or wrinkles. Then, place your idol of Goddess Saraswati in the center. You can use a small table as your raised platform, for example. Statues or figures of Saraswati are commonly used as the idol. If you don’t have a statue, you can use a photograph."
                },
                {
                    "headline": "Place an idol of Lord Ganesha beside Goddess Saraswati.",
                    "description": "In addition to worshipping Saraswati, Ganesha is often idolized as well during the at-home puja. Ganesha is the God of beginnings, and he is often honored at the beginning of ceremonies. After you’ve placed your idol of Saraswati, place an idol of Ganesha by her side. Ganesha is also celebrated as the remover of obstacles and the patron of arts and sciences."
                },
                {
                    "headline": "Decorate your platform with turmeric, kumkum, rice, and flowers.",
                    "description": "Sprinkle these ingredients around both idol figures. You can use your fingers to spread the rice, garlands, and flowers, and you can use a spoon to include the turmeric and kumkum. Use flowers in colors like white, yellow, red, blue, and green. In addition, you can place these items in small bowls and place them around your idol. These ingredients are commonly used to invoke Saraswati. Each color has a particular meaning in the Hindu faith. For example, red is the color of celebration and power. Yellow represents knowledge and wisdom. Green stabilizes the mind. White embodies purity, peace, and wisdom. Finally, blue represents nature, bravery, depth, and power."
                },
                {
                    "headline": "Place books, musical instruments, and art supplies near the altar.",
                    "description": "Since Goddess Saraswati is affiliated with learning and art, it is custom to adorn the idol space with scholarly and artistic items. You can place these underneath the table or nearby the idols. You can also include journals, pens, ink, and paint brushes, for example."
                },
                {
                    "headline": "Fill the kalash, add mango leaves, and place a betel leaf on top.",
                    "description": "A kalash is a brass or copper pot with a large base and small mouth often used in Hindu rituals. Place the kalash on your platform, and fill it up with water. Place a sprig with at least 5 mango leaves inside the pot. Then, drape a betel leaf over top of the opening. The kalash represents creation. The mango leaves are said to act as the deity's seat during the ritual, and the water keeps the seat pure."
                }
            ]
        },
        {
            "name": "Completing the Puja",
            "steps": [
                {
                    "headline": "Chant the Saraswati puja mantra to invoke Goddess Saraswati.",
                    "description": "Take a deep breath in, and as you exhale, say the mantra: “Yaa kundendu tushaaradhawala, yaa shubhra vastravrutha, yaa veena varadanda manditakara yaa shweta padmasanaa. Yaa brahmachyuta shankara prabhrutibhi devai sadaa vandita, saa maama pathu saraswati bhagavati nishshesha, jadyapaha. Aum saraswathyae namah, dhyanartham, pushpam samarpayami.”"
                },
                {
                    "headline": "Light a small lamp and incense sticks in front of the idols.",
                    "description": "Place a lamp in front of the raised platform, and place an incense burner next to it. Using a lighter or match, light both the lamp and the incense. If using an oil lamp, handle the lamp with care to avoid starting a fire. The light from the lamp protects you during the invocation, and the incense is an offering to Saraswati."
                },
                {
                    "headline": "Offer Goddess Saraswati prasad in the form of sweets and fruits.",
                    "description": "Prasad is a typical religious food offering given during Hindu ceremonies. When completing the puja, you can offer Saraswati items like mango leaves, fruits, and desserts. This is said to draw the Goddess near so she can grant you blessings and prosperity. The prasad is the act of giving a food offering, rather than a particular food."
                },
                {
                    "headline": "Sit silently for 5-15 minutes while asking Saraswati for blessings.",
                    "description": "You can close your eyes and meditate during this period. In your mind, focus on Goddess Saraswati and ask her to bless you and your scholarly or creative pursuits. You can sit in silence until your incense stick finishes burning, for example."
                },
                {
                    "headline": "Consume the prasad and offer it to friends and family.",
                    "description": "When you finish the ritual, eat some of the fruits and/or desserts you offered as prasad, and share it with your family members and friends. This is said to share the good fortune and blessing with your community."
                }
            ]
        }
    ],
    "tyn": [
        "Neem and turmeric paste",
        "Neem and and tulsi leaves",
        "Bathtub",
        "White or yellow clothing",
        "White cloth",
        "Idol of Goddess Saraswati",
        "Idol of Lord Ganesha",
        "Turmeric",
        "Kumkum",
        "Rice",
        "Garland",
        "Flowers",
        "Kalash",
        "Mango leaves",
        "Betel leaf",
        "Lamp",
        "Incense",
        "Prasad"
    ],
    "text": " Performing Morning Rituals Wake up between 5:00 - 8:00 a.m. When performing the Saraswati puja at home, waking up early in the day is traditional practice. You can set an alarm for 5:00 - 8:00 a.m., or you can wake up when the sunshine comes through your window. Give yourself at least 1 hour to complete the ritual, though some people spend longer. Rub a paste made of neem and turmeric over all of your body. To make the paste, soak 20 or so neem leaves in hot water until they are soft, strain the leaves, and then grind the leaves with a mortar and pestle. Then, pour in about ¼ teaspoon (1.23 g) of ground turmeric into the mortar and pestle. Grind up the paste, then rub a thin, even layer over your face, chest, arms, torso, and legs. This paste is believed to have therapeutic and medicinal effects. For example, neem and turmeric paste works great to treat acne and maintain healthy skin. Make more paste as needed. Soak in a bath with neem and tulsi leaves. After you’ve applied the neem and turmeric paste over your body, fill up your bathtub with warm water, and sprinkle 1–3 grams (0.035–0.11 oz) of both neem and tulsi leaves into the water. Soak in the tub for 15-30 minutes, and scrub off the neem and turmeric paste. The bath purifies the body and protects you against infection. Wear white or yellow colored clothing. After your bath, it is custom to dress in these hues to perform the puja. You can wear a pair of pants, a skirt, a blouse, or a dress in these hues. Typically, those performing the puja dress in 1 of these colors, rather than dressing with some hues of both. For example, you may dress head-to-toe in white linens or you may adorn yourself in yellow clothing. Yellow is the color of knowledge and learning in Hinduism. White represents purity, peace, and knowledge. Setting up the Idol and Kalash Clean your home the day before you perform the Saraswati puja. Before you perform the puja, clean your house thoroughly. Tidy up your spaces, and in particular, arrange all of your books upright on your shelves. Use a natural cleaning product like castile soap, vinegar solution, or essential oil to clean your tools, computer, and laptop. If you can’t clean the day before, do this after you purify yourself. If you are performing the puja as part of your Navratri celebration, everything must be cleaned by the 8th day of Navratri. If you can't use natural cleaning products, you can use an all-purpose cleaner. Natural cleaning products are safer for the environment and more pleasing to Goddess Saraswati than harsh chemicals. Since Saraswati is the Goddess of learning, it is suggested that she appreciates arranging your library properly. Lay a white cloth on a raised platform and place your idol on top. This is the base of your altar. You can use any piece of white fabric, such as silk or linen. Smooth out the cloth with your hand so there are no folds or wrinkles. Then, place your idol of Goddess Saraswati in the center. You can use a small table as your raised platform, for example. Statues or figures of Saraswati are commonly used as the idol. If you don’t have a statue, you can use a photograph. Place an idol of Lord Ganesha beside Goddess Saraswati. In addition to worshipping Saraswati, Ganesha is often idolized as well during the at-home puja. Ganesha is the God of beginnings, and he is often honored at the beginning of ceremonies. After you’ve placed your idol of Saraswati, place an idol of Ganesha by her side. Ganesha is also celebrated as the remover of obstacles and the patron of arts and sciences. Decorate your platform with turmeric, kumkum, rice, and flowers. Sprinkle these ingredients around both idol figures. You can use your fingers to spread the rice, garlands, and flowers, and you can use a spoon to include the turmeric and kumkum. Use flowers in colors like white, yellow, red, blue, and green. In addition, you can place these items in small bowls and place them around your idol. These ingredients are commonly used to invoke Saraswati. Each color has a particular meaning in the Hindu faith. For example, red is the color of celebration and power. Yellow represents knowledge and wisdom. Green stabilizes the mind. White embodies purity, peace, and wisdom. Finally, blue represents nature, bravery, depth, and power. Place books, musical instruments, and art supplies near the altar. Since Goddess Saraswati is affiliated with learning and art, it is custom to adorn the idol space with scholarly and artistic items. You can place these underneath the table or nearby the idols. You can also include journals, pens, ink, and paint brushes, for example. Fill the kalash, add mango leaves, and place a betel leaf on top. A kalash is a brass or copper pot with a large base and small mouth often used in Hindu rituals. Place the kalash on your platform, and fill it up with water. Place a sprig with at least 5 mango leaves inside the pot. Then, drape a betel leaf over top of the opening. The kalash represents creation. The mango leaves are said to act as the deity's seat during the ritual, and the water keeps the seat pure. Completing the Puja Chant the Saraswati puja mantra to invoke Goddess Saraswati. Take a deep breath in, and as you exhale, say the mantra: “Yaa kundendu tushaaradhawala, yaa shubhra vastravrutha, yaa veena varadanda manditakara yaa shweta padmasanaa. Yaa brahmachyuta shankara prabhrutibhi devai sadaa vandita, saa maama pathu saraswati bhagavati nishshesha, jadyapaha. Aum saraswathyae namah, dhyanartham, pushpam samarpayami.” Light a small lamp and incense sticks in front of the idols. Place a lamp in front of the raised platform, and place an incense burner next to it. Using a lighter or match, light both the lamp and the incense. If using an oil lamp, handle the lamp with care to avoid starting a fire. The light from the lamp protects you during the invocation, and the incense is an offering to Saraswati. Offer Goddess Saraswati prasad in the form of sweets and fruits. Prasad is a typical religious food offering given during Hindu ceremonies. When completing the puja, you can offer Saraswati items like mango leaves, fruits, and desserts. This is said to draw the Goddess near so she can grant you blessings and prosperity. The prasad is the act of giving a food offering, rather than a particular food. Sit silently for 5-15 minutes while asking Saraswati for blessings. You can close your eyes and meditate during this period. In your mind, focus on Goddess Saraswati and ask her to bless you and your scholarly or creative pursuits. You can sit in silence until your incense stick finishes burning, for example. Consume the prasad and offer it to friends and family. When you finish the ritual, eat some of the fruits and/or desserts you offered as prasad, and share it with your family members and friends. This is said to share the good fortune and blessing with your community.",
    "sentences": [
        " Performing Morning Rituals Wake up between 5:00 - 8:00 a.m.",
        "When performing the Saraswati puja at home, waking up early in the day is traditional practice.",
        "You can set an alarm for 5:00 - 8:00 a.m., or you can wake up when the sunshine comes through your window.",
        "Give yourself at least 1 hour to complete the ritual, though some people spend longer.",
        "Rub a paste made of neem and turmeric over all of your body.",
        "To make the paste, soak 20 or so neem leaves in hot water until they are soft, strain the leaves, and then grind the leaves with a mortar and pestle.",
        "Then, pour in about ¼ teaspoon (1.23 g) of ground turmeric into the mortar and pestle.",
        "Grind up the paste, then rub a thin, even layer over your face, chest, arms, torso, and legs.",
        "This paste is believed to have therapeutic and medicinal effects.",
        "For example, neem and turmeric paste works great to treat acne and maintain healthy skin.",
        "Make more paste as needed.",
        "Soak in a bath with neem and tulsi leaves.",
        "After you’ve applied the neem and turmeric paste over your body, fill up your bathtub with warm water, and sprinkle 1–3 grams (0.035–0.11 oz) of both neem and tulsi leaves into the water.",
        "Soak in the tub for 15-30 minutes, and scrub off the neem and turmeric paste.",
        "The bath purifies the body and protects you against infection.",
        "Wear white or yellow colored clothing.",
        "After your bath, it is custom to dress in these hues to perform the puja.",
        "You can wear a pair of pants, a skirt, a blouse, or a dress in these hues.",
        "Typically, those performing the puja dress in 1 of these colors, rather than dressing with some hues of both.",
        "For example, you may dress head-to-toe in white linens or you may adorn yourself in yellow clothing.",
        "Yellow is the color of knowledge and learning in Hinduism.",
        "White represents purity, peace, and knowledge.",
        "Setting up the Idol and Kalash Clean your home the day before you perform the Saraswati puja.",
        "Before you perform the puja, clean your house thoroughly.",
        "Tidy up your spaces, and in particular, arrange all of your books upright on your shelves.",
        "Use a natural cleaning product like castile soap, vinegar solution, or essential oil to clean your tools, computer, and laptop.",
        "If you can’t clean the day before, do this after you purify yourself.",
        "If you are performing the puja as part of your Navratri celebration, everything must be cleaned by the 8th day of Navratri.",
        "If you can't use natural cleaning products, you can use an all-purpose cleaner.",
        "Natural cleaning products are safer for the environment and more pleasing to Goddess Saraswati than harsh chemicals.",
        "Since Saraswati is the Goddess of learning, it is suggested that she appreciates arranging your library properly.",
        "Lay a white cloth on a raised platform and place your idol on top.",
        "This is the base of your altar.",
        "You can use any piece of white fabric, such as silk or linen.",
        "Smooth out the cloth with your hand so there are no folds or wrinkles.",
        "Then, place your idol of Goddess Saraswati in the center.",
        "You can use a small table as your raised platform, for example.",
        "Statues or figures of Saraswati are commonly used as the idol.",
        "If you don’t have a statue, you can use a photograph.",
        "Place an idol of Lord Ganesha beside Goddess Saraswati.",
        "In addition to worshipping Saraswati, Ganesha is often idolized as well during the at-home puja.",
        "Ganesha is the God of beginnings, and he is often honored at the beginning of ceremonies.",
        "After you’ve placed your idol of Saraswati, place an idol of Ganesha by her side.",
        "Ganesha is also celebrated as the remover of obstacles and the patron of arts and sciences.",
        "Decorate your platform with turmeric, kumkum, rice, and flowers.",
        "Sprinkle these ingredients around both idol figures.",
        "You can use your fingers to spread the rice, garlands, and flowers, and you can use a spoon to include the turmeric and kumkum.",
        "Use flowers in colors like white, yellow, red, blue, and green.",
        "In addition, you can place these items in small bowls and place them around your idol.",
        "These ingredients are commonly used to invoke Saraswati.",
        "Each color has a particular meaning in the Hindu faith.",
        "For example, red is the color of celebration and power.",
        "Yellow represents knowledge and wisdom.",
        "Green stabilizes the mind.",
        "White embodies purity, peace, and wisdom.",
        "Finally, blue represents nature, bravery, depth, and power.",
        "Place books, musical instruments, and art supplies near the altar.",
        "Since Goddess Saraswati is affiliated with learning and art, it is custom to adorn the idol space with scholarly and artistic items.",
        "You can place these underneath the table or nearby the idols.",
        "You can also include journals, pens, ink, and paint brushes, for example.",
        "Fill the kalash, add mango leaves, and place a betel leaf on top.",
        "A kalash is a brass or copper pot with a large base and small mouth often used in Hindu rituals.",
        "Place the kalash on your platform, and fill it up with water.",
        "Place a sprig with at least 5 mango leaves inside the pot.",
        "Then, drape a betel leaf over top of the opening.",
        "The kalash represents creation.",
        "The mango leaves are said to act as the deity's seat during the ritual, and the water keeps the seat pure.",
        "Completing the Puja Chant the Saraswati puja mantra to invoke Goddess Saraswati.",
        "Take a deep breath in, and as you exhale, say the mantra: “Yaa kundendu tushaaradhawala, yaa shubhra vastravrutha, yaa veena varadanda manditakara yaa shweta padmasanaa.",
        "Yaa brahmachyuta shankara prabhrutibhi devai sadaa vandita, saa maama pathu saraswati bhagavati nishshesha, jadyapaha.",
        "Aum saraswathyae namah, dhyanartham, pushpam samarpayami.” Light a small lamp and incense sticks in front of the idols.",
        "Place a lamp in front of the raised platform, and place an incense burner next to it.",
        "Using a lighter or match, light both the lamp and the incense.",
        "If using an oil lamp, handle the lamp with care to avoid starting a fire.",
        "The light from the lamp protects you during the invocation, and the incense is an offering to Saraswati.",
        "Offer Goddess Saraswati prasad in the form of sweets and fruits.",
        "Prasad is a typical religious food offering given during Hindu ceremonies.",
        "When completing the puja, you can offer Saraswati items like mango leaves, fruits, and desserts.",
        "This is said to draw the Goddess near so she can grant you blessings and prosperity.",
        "The prasad is the act of giving a food offering, rather than a particular food.",
        "Sit silently for 5-15 minutes while asking Saraswati for blessings.",
        "You can close your eyes and meditate during this period.",
        "In your mind, focus on Goddess Saraswati and ask her to bless you and your scholarly or creative pursuits.",
        "You can sit in silence until your incense stick finishes burning, for example.",
        "Consume the prasad and offer it to friends and family.",
        "When you finish the ritual, eat some of the fruits and/or desserts you offered as prasad, and share it with your family members and friends.",
        "This is said to share the good fortune and blessing with your community."
    ]
}