{
    "title": "How to Deal with Exposed Tree Roots",
    "url": "https://www.wikihow.com/Deal-with-Exposed-Tree-Roots",
    "category_hierarchy": [
        "Home and Garden",
        "Gardening"
    ],
    "methods": [
        {
            "name": "Covering Exposed Roots with Mulch",
            "steps": [
                {
                    "headline": "Select an organic mulch material.",
                    "description": "A layer of mulch around the tree’s roots can cushion and insulate the roots and minimize soil erosion. Pick a material that won’t absorb too much moisture from the soil around the base of the tree. A few options include:\nPine straw. This material is not absorbent, and will allow moisture to reach your tree’s roots easily. Pine bark nuggets. If you choose this material, make sure to remove old nuggets before laying down new ones, or the old mulch may absorb too much moisture from around the tree’s roots. Shredded wood mulch. Because this material absorbs moisture easily, avoid putting too much at the base of your tree. Use a layer only about 1 inch (2.5 cm) thick."
                },
                {
                    "headline": "Put down a layer of mulch no more than 3-4 inches (7.6-10.2 cm) thick.",
                    "description": "You will need to put down enough mulch to cover the exposed roots, but take care not to put down so much that you smother the roots. Use thinner layers when applying more absorbent mulches (such as shredded wood), and take care that the pile doesn’t become too thick when you refresh the mulch."
                },
                {
                    "headline": "Make the area of mulch wide enough to cover the exposed roots.",
                    "description": "Your mulched area may need to be up to 2/3rds the diameter of the tree’s canopy. Don’t worry if the mulch covers up part of the lawn around the tree. Allowing your roots to compete with your grass will only lead to further soil erosion."
                },
                {
                    "headline": "Avoid piling mulch against the trunk of the tree.",
                    "description": "If you pile up too much mulch around the base of the tree, it may cause the bark at the bottom of the tree to become diseased. Leave a little space between your mulched area and the base of the tree."
                }
            ]
        },
        {
            "name": "Planting Ground Cover over the Roots",
            "steps": [
                {
                    "headline": "Break up the top 1 inch (2.5 cm) layer of soil around the roots.",
                    "description": "Use a spading fork to very carefully break up the compacted topsoil between the surface roots. Take care not to damage the roots themselves, and go no deeper than 1 inch (2.5 cm)."
                },
                {
                    "headline": "Spread no more than 2 inches (5 cm) of garden soil over the topsoil.",
                    "description": "Add garden soil to your newly broken-up topsoil layer, being very careful not to layer on more than 2 inches (5 cm) of new soil. If you add too much new soil, your tree’s roots will suffocate, and the tree will eventually die. While you may need to replenish the new soil each year, do not add more than 2 inches (5 cm) of soil to the base of your tree per year."
                },
                {
                    "headline": "Add a light application of general-purpose granular fertilizer.",
                    "description": "Adding some fertilizer will help keep your tree healthy and prevent the ground cover plants from using up too many valuable nutrients. Following the package directions, sprinkle a little 15-5-10 or 13-13-13 NPK fertilizer over the exposed root area."
                },
                {
                    "headline": "Plant a shade-loving ground cover plant around the base of the tree.",
                    "description": "Pick a hearty plant that doesn’t need a lot of sunlight or moisture. In general, the best times to plant ground cover plants are early spring and late fall. A few good options include:\nWild violets\nAjuga\nPeriwinkle (vinca)\nAsiatic jasmine\nMonkey grass"
                }
            ]
        },
        {
            "name": "Preventing Root Exposure",
            "steps": [
                {
                    "headline": "Avoid planting shade trees too close to buildings and paths.",
                    "description": "Surface roots mainly become a problem when they interfere with footpaths, sidewalks, and structures such as house foundations. Try to plant shade trees no closer than 6 feet (2 meters) from sidewalks and pavements, and 15 feet (5 meters) from house foundations."
                },
                {
                    "headline": "Plant tree species that are less prone to root exposure.",
                    "description": "Root exposure problems are often associated with fast-growing shade trees, such as Arizona ash, silver maple, poplar, and willow. When selecting trees to plant on your property, consider choosing slower-growing species instead. A few good options include:\nLinden\nColorado blue spruce\nSugar maple\nJapanese maple\nRed buckeye"
                },
                {
                    "headline": "Take measures to prevent soil erosion on your property.",
                    "description": "Tree roots are often exposed by soil erosion. If your property has serious erosion problems, you may need to bring in a landscaping expert to install erosion barriers. Other measures you can take include:\nCovering bare patches of soil with mulch or ground cover plants, especially on slopes. Not over-watering your plants so that you do not wash away too much soil. Using jute netting or coconut fiber mats to keep soil in place until cover plants can become established. Putting a layer of mulch around the bases of newly-planted trees to prevent erosion as the tree grows."
                }
            ]
        }
    ],
    "tyn": [
        "Covering Exposed Roots with Mulch",
        "Organic mulch, such as pine straw, shredded wood, or pine bark nuggets",
        "Planting Ground Cover over the Roots",
        "Spading fork",
        "Garden soil mix",
        "General-purpose granular fertilizer (15-5-10 or 13-13-13)",
        "Shade-loving ground cover plants, such as violets, vinca, or Asiatic jasmine",
        "Trimming Exposed Roots",
        "Garden spade",
        "Root saw (for larger roots) or shears or loppers (for smaller roots)",
        "Root barrier to prevent regrowth",
        "Preventing Root Exposure",
        "Slow-growing shade trees, such as blue spruce, linden, or red buckeye",
        "Mulch",
        "Soil-retention materials, such as jute netting or coconut fiber mats"
    ],
    "text": " Covering Exposed Roots with Mulch Select an organic mulch material. A layer of mulch around the tree’s roots can cushion and insulate the roots and minimize soil erosion. Pick a material that won’t absorb too much moisture from the soil around the base of the tree. A few options include:\nPine straw. This material is not absorbent, and will allow moisture to reach your tree’s roots easily. Pine bark nuggets. If you choose this material, make sure to remove old nuggets before laying down new ones, or the old mulch may absorb too much moisture from around the tree’s roots. Shredded wood mulch. Because this material absorbs moisture easily, avoid putting too much at the base of your tree. Use a layer only about 1 inch (2.5 cm) thick. Put down a layer of mulch no more than 3-4 inches (7.6-10.2 cm) thick. You will need to put down enough mulch to cover the exposed roots, but take care not to put down so much that you smother the roots. Use thinner layers when applying more absorbent mulches (such as shredded wood), and take care that the pile doesn’t become too thick when you refresh the mulch. Make the area of mulch wide enough to cover the exposed roots. Your mulched area may need to be up to 2/3rds the diameter of the tree’s canopy. Don’t worry if the mulch covers up part of the lawn around the tree. Allowing your roots to compete with your grass will only lead to further soil erosion. Avoid piling mulch against the trunk of the tree. If you pile up too much mulch around the base of the tree, it may cause the bark at the bottom of the tree to become diseased. Leave a little space between your mulched area and the base of the tree. Planting Ground Cover over the Roots Break up the top 1 inch (2.5 cm) layer of soil around the roots. Use a spading fork to very carefully break up the compacted topsoil between the surface roots. Take care not to damage the roots themselves, and go no deeper than 1 inch (2.5 cm). Spread no more than 2 inches (5 cm) of garden soil over the topsoil. Add garden soil to your newly broken-up topsoil layer, being very careful not to layer on more than 2 inches (5 cm) of new soil. If you add too much new soil, your tree’s roots will suffocate, and the tree will eventually die. While you may need to replenish the new soil each year, do not add more than 2 inches (5 cm) of soil to the base of your tree per year. Add a light application of general-purpose granular fertilizer. Adding some fertilizer will help keep your tree healthy and prevent the ground cover plants from using up too many valuable nutrients. Following the package directions, sprinkle a little 15-5-10 or 13-13-13 NPK fertilizer over the exposed root area. Plant a shade-loving ground cover plant around the base of the tree. Pick a hearty plant that doesn’t need a lot of sunlight or moisture. In general, the best times to plant ground cover plants are early spring and late fall. A few good options include:\nWild violets\nAjuga\nPeriwinkle (vinca)\nAsiatic jasmine\nMonkey grass Preventing Root Exposure Avoid planting shade trees too close to buildings and paths. Surface roots mainly become a problem when they interfere with footpaths, sidewalks, and structures such as house foundations. Try to plant shade trees no closer than 6 feet (2 meters) from sidewalks and pavements, and 15 feet (5 meters) from house foundations. Plant tree species that are less prone to root exposure. Root exposure problems are often associated with fast-growing shade trees, such as Arizona ash, silver maple, poplar, and willow. When selecting trees to plant on your property, consider choosing slower-growing species instead. A few good options include:\nLinden\nColorado blue spruce\nSugar maple\nJapanese maple\nRed buckeye Take measures to prevent soil erosion on your property. Tree roots are often exposed by soil erosion. If your property has serious erosion problems, you may need to bring in a landscaping expert to install erosion barriers. Other measures you can take include:\nCovering bare patches of soil with mulch or ground cover plants, especially on slopes. Not over-watering your plants so that you do not wash away too much soil. Using jute netting or coconut fiber mats to keep soil in place until cover plants can become established. Putting a layer of mulch around the bases of newly-planted trees to prevent erosion as the tree grows.",
    "sentences": [
        " Covering Exposed Roots with Mulch Select an organic mulch material.",
        "A layer of mulch around the tree’s roots can cushion and insulate the roots and minimize soil erosion.",
        "Pick a material that won’t absorb too much moisture from the soil around the base of the tree.",
        "A few options include:\nPine straw.",
        "This material is not absorbent, and will allow moisture to reach your tree’s roots easily.",
        "Pine bark nuggets.",
        "If you choose this material, make sure to remove old nuggets before laying down new ones, or the old mulch may absorb too much moisture from around the tree’s roots.",
        "Shredded wood mulch.",
        "Because this material absorbs moisture easily, avoid putting too much at the base of your tree.",
        "Use a layer only about 1 inch (2.5 cm) thick.",
        "Put down a layer of mulch no more than 3-4 inches (7.6-10.2 cm) thick.",
        "You will need to put down enough mulch to cover the exposed roots, but take care not to put down so much that you smother the roots.",
        "Use thinner layers when applying more absorbent mulches (such as shredded wood), and take care that the pile doesn’t become too thick when you refresh the mulch.",
        "Make the area of mulch wide enough to cover the exposed roots.",
        "Your mulched area may need to be up to 2/3rds the diameter of the tree’s canopy.",
        "Don’t worry if the mulch covers up part of the lawn around the tree.",
        "Allowing your roots to compete with your grass will only lead to further soil erosion.",
        "Avoid piling mulch against the trunk of the tree.",
        "If you pile up too much mulch around the base of the tree, it may cause the bark at the bottom of the tree to become diseased.",
        "Leave a little space between your mulched area and the base of the tree.",
        "Planting Ground Cover over the Roots Break up the top 1 inch (2.5 cm) layer of soil around the roots.",
        "Use a spading fork to very carefully break up the compacted topsoil between the surface roots.",
        "Take care not to damage the roots themselves, and go no deeper than 1 inch (2.5 cm).",
        "Spread no more than 2 inches (5 cm) of garden soil over the topsoil.",
        "Add garden soil to your newly broken-up topsoil layer, being very careful not to layer on more than 2 inches (5 cm) of new soil.",
        "If you add too much new soil, your tree’s roots will suffocate, and the tree will eventually die.",
        "While you may need to replenish the new soil each year, do not add more than 2 inches (5 cm) of soil to the base of your tree per year.",
        "Add a light application of general-purpose granular fertilizer.",
        "Adding some fertilizer will help keep your tree healthy and prevent the ground cover plants from using up too many valuable nutrients.",
        "Following the package directions, sprinkle a little 15-5-10 or 13-13-13 NPK fertilizer over the exposed root area.",
        "Plant a shade-loving ground cover plant around the base of the tree.",
        "Pick a hearty plant that doesn’t need a lot of sunlight or moisture.",
        "In general, the best times to plant ground cover plants are early spring and late fall.",
        "A few good options include:\nWild violets\nAjuga\nPeriwinkle (vinca)\nAsiatic jasmine\nMonkey grass Preventing Root Exposure Avoid planting shade trees too close to buildings and paths.",
        "Surface roots mainly become a problem when they interfere with footpaths, sidewalks, and structures such as house foundations.",
        "Try to plant shade trees no closer than 6 feet (2 meters) from sidewalks and pavements, and 15 feet (5 meters) from house foundations.",
        "Plant tree species that are less prone to root exposure.",
        "Root exposure problems are often associated with fast-growing shade trees, such as Arizona ash, silver maple, poplar, and willow.",
        "When selecting trees to plant on your property, consider choosing slower-growing species instead.",
        "A few good options include:\nLinden\nColorado blue spruce\nSugar maple\nJapanese maple\nRed buckeye Take measures to prevent soil erosion on your property.",
        "Tree roots are often exposed by soil erosion.",
        "If your property has serious erosion problems, you may need to bring in a landscaping expert to install erosion barriers.",
        "Other measures you can take include:\nCovering bare patches of soil with mulch or ground cover plants, especially on slopes.",
        "Not over-watering your plants so that you do not wash away too much soil.",
        "Using jute netting or coconut fiber mats to keep soil in place until cover plants can become established.",
        "Putting a layer of mulch around the bases of newly-planted trees to prevent erosion as the tree grows."
    ]
}