{
  "title":"How to Advertise a Moving Sale",
  "url":"https://www.wikihow.com/Advertise-a-Moving-Sale",
  "category_hierarchy":[
    "Home and Garden",
    "Garages"
  ],
  "methods":[
    {
      "name":"Creating an Online Classified Ad",
      "steps":[
        {
          "headline":"Write a catchy headline to grab reader’s attention.",
          "description":"Be concise yet descriptive. This could be your only chance to reel the reader in. If the headline doesn’t get their attention, they may not read the rest of the ad either. Include your general location in the headline. You can list the name of your town, the part of town you live in, the subdivision, or you can be as specific as the street name. Including this information in the headline helps your ad show up in search results. Try saying something like, “We have to go. . .And our stuff does too! North End moving sale.”"
        },
        {
          "headline":"Include the general information about the sale in the body of the ad.",
          "description":"This is where readers can decide if they want or are even able to attend your sale. Make sure you state all of the information clearly so that shoppers can make a plan. If they have questions, they may not bother to ask and might just move on to the next ad. Put the date, including the day of the week. Ex: Saturday, June 10th\nAdd the start and end times, including a.m. or p.m., and state if you will not accept early birds or latecomers. If you don’t state that it’s not allowed, expect a few stragglers. Ex: 8:00 a.m. - 4:00 p.m. No early birds, please! Give your full address to make it easy for shoppers to plan their trip. Alternatively, list only the general neighborhood and use large signs to direct traffic."
        },
        {
          "headline":"List examples of some of your items so shoppers know what to expect.",
          "description":"List items that are high in demand, rare, or that would be a great deal because it is significantly lower than retail price. Include the price and use descriptive words so shoppers know why your coffee table is better than another one listed down the street. Furniture, appliances, baby items, power tools, and electronics are popular items that people that look for. If you are selling any types of these items, consider listing them as examples. Be sure to include descriptive words such as, “like new,” “one of a kind,” or “still in the box.” Don’t be afraid to use brand names if you know it is popular. Tell shoppers if you are firm on your pricing, or put OBO (or best offer) to indicate that you may accept offers lower than the listing price. Mention if your items come from a smoke and/or pet-free home. Ex: \"Fisher Price deluxe baby swing with 5 speeds. Like new—only used 2 times! Smoke-free home. $50 OBO\" or \"Gently-used Coach Purse. Purchased for $400, sacrifice for $75 firm.\""
        },
        {
          "headline":"Include pictures of some of your best items if the site allows you to.",
          "description":"Take a few good pictures of some of your items to use in your ad. Pictures are easier than text to recognize and remember, so they make a bigger impact. It’s also much easier to post a picture of your couch, than to write out a lengthy description about the style."
        },
        {
          "headline":"Put your contact information if you want people to be able to reach you.",
          "description":"If you are interested in making potential early sales, then list your phone number with the area code and/or an email address at the bottom of the ad. You don’t have to do this. If you would rather not deal with questions, requests to hold items or come early, etc. you can just leave your address for people to show up on the day of the sale."
        },
        {
          "headline":"Post your ad on an online classified advertisement website.",
          "description":"Posting on multiple sites will get you the best results. Choose a few sites that are popular in your area. Craigslist is the most popular site in the US, but it is available throughout the world as well. Try Gumtree if you live in the UK or Australia."
        }
      ]
    },
    {
      "name":"Advertising via Other Online Methods",
      "steps":[
        {
          "headline":"Use Facebook Marketplace to promote your sale.",
          "description":"This is a great option no matter where you live. It allows you to post the general information about your sale as well as unlimited pictures for free."
        },
        {
          "headline":"Place an ad on your local newspaper’s website to reach more people.",
          "description":"There may be a fee for this service and you may have the option to customize your posting. For instance, the cost to create an ad may vary depending on how many lines of print you want, if you are including pictures, and how long you want the ad to be posted. Check the websites for the newspapers in your area to find out more information."
        },
        {
          "headline":"Post about your sale on your personal social media accounts.",
          "description":"Facebook, Instagram, Twitter—anything goes. The more places you can post the information, the more interest you will have. Remember that people like visuals. Pictures are easier to recognize and remember. Including a picture of the flyer or of the items will be more eye-catching and effective. Once you have created your own post, let your friends and family know about it and ask them to hit the “share” button to post the information on their own pages."
        },
        {
          "headline":"Send an email to all of your contacts to personally invite them.",
          "description":"Write up an email that includes all of the information about your sale—the time, date, location, and some examples of the best items you will be selling. Don’t forget to include a few pictures. Because an email will be sent to your personal contacts, feel free to use a more casual tone and include a funny meme."
        }
      ]
    },
    {
      "name":"Advertising Your Sale in Person or in Print",
      "steps":[
        {
          "headline":"Use word of mouth to inform the people you know.",
          "description":"Still one of the best ways to get information out is to talk about it. Tell all of your friends, family, acquaintances, and neighbors about the sale. Let them know the time, date, location, and some items that you think they may be interested in. Ask them to tell their friends and family, too. If someone says they aren’t able to come, and if it works for you, offer them another time that they can stop by to look."
        },
        {
          "headline":"Create flyers to target shoppers and drivers.",
          "description":"Use a software program on your computer like Microsoft Word, or an online program like Canvas or Google Docs. Make a flyer that has big, bold print and pictures. Include the time, date, location, and some of the interesting items you are selling. Hang the flyers in places around your town that are sure to be seen. You can print the flyers from your home computer and printer, but making copies at a print shop is fast and will only cost you a few cents per copy. Hang the flyers on community bulletin boards at your church or work, and in local restaurants, coffee shops, and grocery stores. Also hang the flyers on posts in your neighborhood and nearby streets if your local government and homeowners association allow it."
        },
        {
          "headline":"Put an ad in a newspaper or newsletter to inform those who aren’t online.",
          "description":"Many churches, groups, and clubs distribute newsletters. If you are involved in any of these types of programs, ask someone in charge how you can list your moving sale in their next letter. Call or visit your local newspaper’s website for information on posting a classified ad in their next printing. Be sure to include the time, date, location, and some of the items you are selling. Ask if you can include pictures. There may be a fee to create an ad in the newspaper. Ask for this information when you call."
        }
      ]
    }
  ],
  "text":" Creating an Online Classified Ad Write a catchy headline to grab reader’s attention. Be concise yet descriptive. This could be your only chance to reel the reader in. If the headline doesn’t get their attention, they may not read the rest of the ad either. Include your general location in the headline. You can list the name of your town, the part of town you live in, the subdivision, or you can be as specific as the street name. Including this information in the headline helps your ad show up in search results. Try saying something like, “We have to go. . .And our stuff does too! North End moving sale.” Include the general information about the sale in the body of the ad. This is where readers can decide if they want or are even able to attend your sale. Make sure you state all of the information clearly so that shoppers can make a plan. If they have questions, they may not bother to ask and might just move on to the next ad. Put the date, including the day of the week. Ex: Saturday, June 10th\nAdd the start and end times, including a.m. or p.m., and state if you will not accept early birds or latecomers. If you don’t state that it’s not allowed, expect a few stragglers. Ex: 8:00 a.m. - 4:00 p.m. No early birds, please! Give your full address to make it easy for shoppers to plan their trip. Alternatively, list only the general neighborhood and use large signs to direct traffic. List examples of some of your items so shoppers know what to expect. List items that are high in demand, rare, or that would be a great deal because it is significantly lower than retail price. Include the price and use descriptive words so shoppers know why your coffee table is better than another one listed down the street. Furniture, appliances, baby items, power tools, and electronics are popular items that people that look for. If you are selling any types of these items, consider listing them as examples. Be sure to include descriptive words such as, “like new,” “one of a kind,” or “still in the box.” Don’t be afraid to use brand names if you know it is popular. Tell shoppers if you are firm on your pricing, or put OBO (or best offer) to indicate that you may accept offers lower than the listing price. Mention if your items come from a smoke and/or pet-free home. Ex: \"Fisher Price deluxe baby swing with 5 speeds. Like new—only used 2 times! Smoke-free home. $50 OBO\" or \"Gently-used Coach Purse. Purchased for $400, sacrifice for $75 firm.\" Include pictures of some of your best items if the site allows you to. Take a few good pictures of some of your items to use in your ad. Pictures are easier than text to recognize and remember, so they make a bigger impact. It’s also much easier to post a picture of your couch, than to write out a lengthy description about the style. Put your contact information if you want people to be able to reach you. If you are interested in making potential early sales, then list your phone number with the area code and/or an email address at the bottom of the ad. You don’t have to do this. If you would rather not deal with questions, requests to hold items or come early, etc. you can just leave your address for people to show up on the day of the sale. Post your ad on an online classified advertisement website. Posting on multiple sites will get you the best results. Choose a few sites that are popular in your area. Craigslist is the most popular site in the US, but it is available throughout the world as well. Try Gumtree if you live in the UK or Australia. Advertising via Other Online Methods Use Facebook Marketplace to promote your sale. This is a great option no matter where you live. It allows you to post the general information about your sale as well as unlimited pictures for free. Place an ad on your local newspaper’s website to reach more people. There may be a fee for this service and you may have the option to customize your posting. For instance, the cost to create an ad may vary depending on how many lines of print you want, if you are including pictures, and how long you want the ad to be posted. Check the websites for the newspapers in your area to find out more information. Post about your sale on your personal social media accounts. Facebook, Instagram, Twitter—anything goes. The more places you can post the information, the more interest you will have. Remember that people like visuals. Pictures are easier to recognize and remember. Including a picture of the flyer or of the items will be more eye-catching and effective. Once you have created your own post, let your friends and family know about it and ask them to hit the “share” button to post the information on their own pages. Send an email to all of your contacts to personally invite them. Write up an email that includes all of the information about your sale—the time, date, location, and some examples of the best items you will be selling. Don’t forget to include a few pictures. Because an email will be sent to your personal contacts, feel free to use a more casual tone and include a funny meme. Advertising Your Sale in Person or in Print Use word of mouth to inform the people you know. Still one of the best ways to get information out is to talk about it. Tell all of your friends, family, acquaintances, and neighbors about the sale. Let them know the time, date, location, and some items that you think they may be interested in. Ask them to tell their friends and family, too. If someone says they aren’t able to come, and if it works for you, offer them another time that they can stop by to look. Create flyers to target shoppers and drivers. Use a software program on your computer like Microsoft Word, or an online program like Canvas or Google Docs. Make a flyer that has big, bold print and pictures. Include the time, date, location, and some of the interesting items you are selling. Hang the flyers in places around your town that are sure to be seen. You can print the flyers from your home computer and printer, but making copies at a print shop is fast and will only cost you a few cents per copy. Hang the flyers on community bulletin boards at your church or work, and in local restaurants, coffee shops, and grocery stores. Also hang the flyers on posts in your neighborhood and nearby streets if your local government and homeowners association allow it. Put an ad in a newspaper or newsletter to inform those who aren’t online. Many churches, groups, and clubs distribute newsletters. If you are involved in any of these types of programs, ask someone in charge how you can list your moving sale in their next letter. Call or visit your local newspaper’s website for information on posting a classified ad in their next printing. Be sure to include the time, date, location, and some of the items you are selling. Ask if you can include pictures. There may be a fee to create an ad in the newspaper. Ask for this information when you call.",
  "tyn_model":[
    "flyers",
    "“we",
    "” include",
    "coffee table",
    "furniture",
    "appliances",
    "electronics",
    "“like",
    "” “",
    "” or",
    "“still",
    "” do",
    "—only",
    "coach purse",
    "classified advertisement website.",
    "craigslist",
    "gumtree",
    "newspaper",
    "—anything",
    "“share",
    "” button",
    "—the",
    "flyer",
    "classified ad"
  ],
  "tyn_section":[

  ]
}