{
  "title":"How to Buy Jackfruit",
  "url":"https://www.wikihow.com/Buy-Jackfruit",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Finding Jackfruit",
      "steps":[
        {
          "headline":"Look for jackfruit at specialty supermarkets or Asian food stores first.",
          "description":"These spots are almost guaranteed to have jackfruit. It’s best to check an Asian food store first, if possible, as jackfruit is widely cultivated in southeast Asia. Call a specialty grocery store near you to ask if they have jackfruit beforehand, if desired. Asian markets tend to sell green jackfruit in brine, as well as ripe jackfruit in syrup."
        },
        {
          "headline":"Check out your local grocery store to see if they have jackfruit.",
          "description":"While not all grocery stores carry jackfruit, the fruit has become much more popular, and many grocery stores are starting to provide it. The next time you’re at a grocery store, check the produce section or ask an employee if they sell jackfruit. Some health food stores have been known to sell jackfruit. You can also call grocery stores in your area to ask if they have jackfruit, either ripe or canned."
        },
        {
          "headline":"Purchase jackfruit online if you can't find it in stores.",
          "description":"Online retailers will actually let you buy jackfruit online and ship it to you. It’s easiest to buy canned jackfruit, preserved in a liquid such as water or brine, but buying dried jackfruit is also a popular online option. Pull up your web browser and type “buy jackfruit online” into the search box to see what options are available. Check several different websites to see who has the best quality jackfruit as well as the most reasonable prices—especially when shipping is involved."
        }
      ]
    },
    {
      "name":"Deciding Between Packaged and Fresh Fruit",
      "steps":[
        {
          "headline":"Choose canned jackfruit to use in recipes.",
          "description":"Canned jackfruit is the type that’s easiest to find in grocery stores. You’ll find the fruit canned in water, which is great for savory recipes, and in syrup, perfect for desserts. Be aware that there may be added sugars in canned jackfruit, and it won’t have the same flavor as a fresh, ripe one. Unripe (green) jackfruit is the type used in most recipes."
        },
        {
          "headline":"Select pre-cut, fresh jackfruit for an easy, quick snack.",
          "description":"Check the pre-cut fresh fruit section of your grocery store to see if they have jackfruit as an option. When selecting a pre-cut package, look for slices of jackfruit that are bright yellow and look soft. Avoid pieces that have lots of dark spots on them. If you don’t need (or want) to have to bring home and cut up an entire jackfruit, selecting pre-cut pieces is a great option."
        },
        {
          "headline":"Pick out a whole fruit for the fresh, ripe taste.",
          "description":"If you’re going for the whole jackfruit—which can be anywhere from 10–100 pounds (4.5–45.4 kg)—be prepared to spend some time cutting it up. Select a ripe jackfruit to eat immediately, or an unripe, green jackfruit to save for later or use in recipes."
        }
      ]
    },
    {
      "name":"Picking Ripe Jackfruit",
      "steps":[
        {
          "headline":"Smell the jackfruit to check for a strong scent.",
          "description":"The smell a jackfruit gives off is the easiest and most accurate way of telling whether it’s ripe or not. When the jackfruit is ripe, you’ll smell a strong, delicious fragrance. Many people say that a ripe jackfruit smells like Juicy Fruit gum."
        },
        {
          "headline":"Look for yellowing skin, possibly with dark spots.",
          "description":"While a young jackfruit will have a green exterior, as the fruit ripens, the skin should turn yellow. If brown spots start popping up, it’s ripe and ready to be eaten. If the jackfruit is mostly brown and covered in dark spots, it’s most likely overripe and starting to turn bad."
        },
        {
          "headline":"Feel the jackfruit to see if it’s soft.",
          "description":"The skin of jackfruit will feel tough when it’s young, softening once it starts to ripen. Feel the jackfruit’s skin with your hand, pressing gently to see if the exterior yields under a little bit of pressure. If it does, it’s ripe. The jackfruit’s spikes will have softened when it’s ripe as well."
        },
        {
          "headline":"Listen for a hollow sound when tapping on the jackfruit.",
          "description":"Gently knock on the jackfruit—if you hear a dull, hollow sound, it’s likely ripe. It’s best if you use this method along with the others, just to ensure you select a ripe jackfruit, as sometimes the sound can be hard to recognize."
        },
        {
          "headline":"Choose a green jackfruit to let it ripen for a few days.",
          "description":"If you don’t want to cut open your jackfruit for a few days, or you want to use the young jackfruit for a recipe, choose a green one. Let it ripen at room temperature for a couple of days, checking for the signs of ripeness."
        }
      ]
    }
  ],
  "text":" Finding Jackfruit Look for jackfruit at specialty supermarkets or Asian food stores first. These spots are almost guaranteed to have jackfruit. It’s best to check an Asian food store first, if possible, as jackfruit is widely cultivated in southeast Asia. Call a specialty grocery store near you to ask if they have jackfruit beforehand, if desired. Asian markets tend to sell green jackfruit in brine, as well as ripe jackfruit in syrup. Check out your local grocery store to see if they have jackfruit. While not all grocery stores carry jackfruit, the fruit has become much more popular, and many grocery stores are starting to provide it. The next time you’re at a grocery store, check the produce section or ask an employee if they sell jackfruit. Some health food stores have been known to sell jackfruit. You can also call grocery stores in your area to ask if they have jackfruit, either ripe or canned. Purchase jackfruit online if you can't find it in stores. Online retailers will actually let you buy jackfruit online and ship it to you. It’s easiest to buy canned jackfruit, preserved in a liquid such as water or brine, but buying dried jackfruit is also a popular online option. Pull up your web browser and type “buy jackfruit online” into the search box to see what options are available. Check several different websites to see who has the best quality jackfruit as well as the most reasonable prices—especially when shipping is involved. Deciding Between Packaged and Fresh Fruit Choose canned jackfruit to use in recipes. Canned jackfruit is the type that’s easiest to find in grocery stores. You’ll find the fruit canned in water, which is great for savory recipes, and in syrup, perfect for desserts. Be aware that there may be added sugars in canned jackfruit, and it won’t have the same flavor as a fresh, ripe one. Unripe (green) jackfruit is the type used in most recipes. Select pre-cut, fresh jackfruit for an easy, quick snack. Check the pre-cut fresh fruit section of your grocery store to see if they have jackfruit as an option. When selecting a pre-cut package, look for slices of jackfruit that are bright yellow and look soft. Avoid pieces that have lots of dark spots on them. If you don’t need (or want) to have to bring home and cut up an entire jackfruit, selecting pre-cut pieces is a great option. Pick out a whole fruit for the fresh, ripe taste. If you’re going for the whole jackfruit—which can be anywhere from 10–100 pounds (4.5–45.4 kg)—be prepared to spend some time cutting it up. Select a ripe jackfruit to eat immediately, or an unripe, green jackfruit to save for later or use in recipes. Picking Ripe Jackfruit Smell the jackfruit to check for a strong scent. The smell a jackfruit gives off is the easiest and most accurate way of telling whether it’s ripe or not. When the jackfruit is ripe, you’ll smell a strong, delicious fragrance. Many people say that a ripe jackfruit smells like Juicy Fruit gum. Look for yellowing skin, possibly with dark spots. While a young jackfruit will have a green exterior, as the fruit ripens, the skin should turn yellow. If brown spots start popping up, it’s ripe and ready to be eaten. If the jackfruit is mostly brown and covered in dark spots, it’s most likely overripe and starting to turn bad. Feel the jackfruit to see if it’s soft. The skin of jackfruit will feel tough when it’s young, softening once it starts to ripen. Feel the jackfruit’s skin with your hand, pressing gently to see if the exterior yields under a little bit of pressure. If it does, it’s ripe. The jackfruit’s spikes will have softened when it’s ripe as well. Listen for a hollow sound when tapping on the jackfruit. Gently knock on the jackfruit—if you hear a dull, hollow sound, it’s likely ripe. It’s best if you use this method along with the others, just to ensure you select a ripe jackfruit, as sometimes the sound can be hard to recognize. Choose a green jackfruit to let it ripen for a few days. If you don’t want to cut open your jackfruit for a few days, or you want to use the young jackfruit for a recipe, choose a green one. Let it ripen at room temperature for a couple of days, checking for the signs of ripeness.",
  "tyn_model":[
    "jackfruit",
    "water",
    "brine",
    "“buy",
    "” into",
    "—especially",
    "fruit",
    "—which",
    "juicy fruit gum",
    "—if"
  ],
  "tyn_section":[

  ]
}