{
  "title":"How to Check Starbucks Gift Card Balance on PC or Mac",
  "url":"https://www.wikihow.com/Check-Starbucks-Gift-Card-Balance-on-PC-or-Mac",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee",
    "Commercial Coffee",
    "Starbucks Coffee"
  ],
  "steps":[
    {
      "headline":"Go to https://www.starbucks.com/card in a web browser.",
      "description":"You can use any web browser on PC or Mac."
    },
    {
      "headline":"Scroll down to the \"Check Balance\" section.",
      "description":"Towards the bottom of the web page, there is a section where you can check the balance of a gift card."
    },
    {
      "headline":"Enter the card's number.",
      "description":"Use the text box labeled \"Card number\" to type the full card number without any spaces or dashes. It's a 16-digit number on the back of the Starbucks gift card."
    },
    {
      "headline":"Scratch the security sticker to reveal the security code.",
      "description":"Using a coin or your fingernail, scratch away the metallic security sticker to reveal the security code located on the back of the gift card."
    },
    {
      "headline":"Enter the security code.",
      "description":"Type the security pin in the text box labeled \"Security Code\" on the website."
    },
    {
      "headline":"Click Check Balance.",
      "description":"It's the green button below the section that says \"Check Balance\". This displays the remaining balance on the card."
    }
  ],
  "text":" Go to https://www.starbucks.com/card in a web browser. You can use any web browser on PC or Mac. Scroll down to the \"Check Balance\" section. Towards the bottom of the web page, there is a section where you can check the balance of a gift card. Enter the card's number. Use the text box labeled \"Card number\" to type the full card number without any spaces or dashes. It's a 16-digit number on the back of the Starbucks gift card. Scratch the security sticker to reveal the security code. Using a coin or your fingernail, scratch away the metallic security sticker to reveal the security code located on the back of the gift card. Enter the security code. Type the security pin in the text box labeled \"Security Code\" on the website. Click Check Balance. It's the green button below the section that says \"Check Balance\". This displays the remaining balance on the card.",
  "tyn_model":[
    "coin"
  ],
  "tyn_section":[

  ]
}