{
  "title":"How to Decorate Grey Walls",
  "url":"https://www.wikihow.com/Decorate-Grey-Walls",
  "category_hierarchy":[
    "Home and Garden",
    "Home Decorating"
  ],
  "parts":[
    {
      "name":"Selecting Color Schemes",
      "steps":[
        {
          "headline":"Brighten up a grey room with white accents.",
          "description":"White is a great color to use in your room to create an open, bright atmosphere, no matter the shade of grey you’re working with. If you want the colors in the room to be white and grey only, pick out white couches, bed linens, drapes, pillows, or other accessories. If your walls are a darker grey, decorating in all whites will be a great way to bring in light. Paint the molding in the room a white or off-white color, or purchase a large white area rug to cover a darker flooring. Choose accessories such as white picture frames, table lamps, or paintings. The glossiness of your white accents also helps create the look you want. For example, shiny white frames or fixtures can create a glamorous look. Alternatively, scuffed matte white frames and fixtures will look more rustic."
        },
        {
          "headline":"Choose shades of light blue to create a subdued and calm atmosphere.",
          "description":"Grey and light blue look great together, and it’s easy to find things like couch covers or pillows in these shades. Choose light or pastel tones to create a calming vibe in the room. You can also add in a pale turquoise or green with the blue for more accent colors. A grey and blue combo works well in a rooms where you typically want to calm down, such as in your bedroom or bathroom."
        },
        {
          "headline":"Keep the room monochromatic by choosing similar shades of grey.",
          "description":"This gives the room a futuristic feel. While you can choose varying shades of a darker grey to decorate the room, this works especially well with a lighter grey so that the room doesn’t become too dark. For example, select dark grey furniture to go with a light grey rug that matches light grey walls. Hang super light grey curtains (almost white) to add some light into the room. Choosing slightly different shades of grey will give the room added depth. You may enjoy monochromatic grey if you'd like your room to look masculine or minimalist. However, you can warm it up by varying the shades and textures you use. For example, you could use a plush, dark grey rug and a soft silver grey throw as warming accents."
        },
        {
          "headline":"Play with golds and yellows for a lively grey room.",
          "description":"Yellow and grey go very well together and create a fun, modern feel. If your room is painted a rich or dark grey, opt for more saturated, bright yellows. For a paler grey room, go with softer yellows for a pastel look. Use the yellow as an accent color, picking out a yellow couch or striped yellow rug. Use bold yellow pillows on a white couch or white bedding for a small focal point. You can create trendy, youthful looks with yellow and grey, which are currently a very popular combo."
        },
        {
          "headline":"Create a royal look by decorating grey walls with purple or red accents.",
          "description":"A deep purple looks great with a rich grey, while ruby red accents add sophistication to a lighter grey room. Both of these colors create an elegant color scheme and are perfect for smaller accessories. Pick out a large purple vase for an indoor plant, or hang a red light fixture. When using red, avoid choosing a bright shade, which can make your grey take on a muddy effect."
        },
        {
          "headline":"Pick out varying bold colors to create a playful and fun vibe.",
          "description":"If you don’t want to stick with one color to offset your grey walls, pick out several different bold colors to create lots of different accents. Colors that look particularly great with grey walls include yellows, blues, oranges, and bright pinks. For example, choose pink accent pillows, a yellow large picture frame, and blue light fixtures to go with a striped area rug made of all of those colors. It's a good idea to consider the undertone of your grey. If you have a warm grey on your walls, your other colors should have warm undertones, as well. If you have a cool grey, use other cool shades for your accents."
        }
      ]
    },
    {
      "name":"Choosing Wall Decor",
      "steps":[
        {
          "headline":"Hang curtains that emphasize your natural light source.",
          "description":"Natural light is super important for making sure a grey room isn’t too dark. If you have windows in your room, hang light, airy curtains to ensure sunlight brightens up the room. Sheer white curtains are a great addition to a grey room and bring in lots of light. If you’d like your curtains to have color, go with a pastel such as blue, pink, or yellow."
        },
        {
          "headline":"Pick out a focal point item in the room to provide a pop of color.",
          "description":"To make decorating super easy, select one item in the room that will stand out from everything else. It should be in a bold color, such as turquoise, royal blue, or yellow. This one item will make the grey room more lively. For example, a bright fuschia headboard looks great in a grey bedroom with grey and white bedding. Hang a large mirror with a golden frame in a grey living room with wooden furniture. One of the great things about grey is that it looks very neutral. This means you can choose very bold pieces with bright colors and textures, and they'll look great! For example, you might opt for a stunning velvet couch in a bright shade like teal or purple. You can also feature textured items, like an ornate frame."
        },
        {
          "headline":"Choose artwork to hang depending on the mood you want to create.",
          "description":"If you're going for a calm, soothing environment, select artwork in lots of whites and light greys with a few touches of dark grey or black. To add energy to the room, pick out art with bright, bold colors such as reds, oranges, greens, and yellows. An abstract painting made of whites, greys, and light blues would look great on a grey wall. A painting of a beach sunset with lots of oranges, pinks, and yellows would bring color and life to a grey room. If you prefer a classic look, you could opt for black and white photos in black frames."
        },
        {
          "headline":"Install white shelving to contrast the grey walls.",
          "description":"No matter the color of grey, white will brighten up the room while also making it look sophisticated. Choose white shelving that reaches the ceiling for lots of storage, or install small floating shelves for displaying just a few things. If you want your shelves to blend in more, paint the shelves the same grey as the walls. You can leave your shelves minimal for a classic, clean look. Alternatively, you could add a bold pop of color to make the room brighter."
        },
        {
          "headline":"Select picture frames to go with your color scheme.",
          "description":"If you want your grey room to stick to a white, grey, and black color palette, opt for picture frames that are one of these colors. If you want to create a more colorful room, pick out picture frames in colors such as pastel yellow, light blue, or light purple. For a bright and cheerful room, paint all of your picture frames a different color. If you're not sure what the color scheme for the grey room will be, pick out white picture frames, as these will go with anything."
        },
        {
          "headline":"Opt for a large mirror to create light reflections.",
          "description":"Mirrors will reflect the light, making your grey room even brighter if you have lots of natural sunlight. Choose a mirror in a decorative frame, either made of natural wood or painted a certain color. Hang a round mirror over your fireplace to create a focal point. Choose mirrors in bronze, gold, or silver frames for a touch of sophistication."
        }
      ]
    },
    {
      "name":"Adding Furniture and Accessories",
      "steps":[
        {
          "headline":"Add table lamps, sconces, and floor lamps to create the right lighting.",
          "description":"When you have grey walls, overhead lighting can cast harsh shadows. To avoid this, add lots of table and floor lighting to create a well-lit and warm room. Put a floor lamp next to each end of a couch, or install wall sconces as an alternative to using ceiling lights."
        },
        {
          "headline":"Select wood furniture to bring out warm undertones.",
          "description":"Grey can sometimes cause a room to look and feel cold, and using lots of wood can help offset this. Show off a wood floor, set up wooden tables or chairs, or hang pictures made of natural wooden frames. If your walls are a lighter grey, you can work with darker wood. For darker grey walls, opt for wooden furniture that’s a bit lighter. Make sure the furniture isn’t painted—you want to show off the natural wood color. You can create contrast by choosing wood that is textured or embellished."
        },
        {
          "headline":"Play with patterns to add texture to the room.",
          "description":"Patterns are a great way to make a monochromatic or neutral-colored room look more interesting. Choose rugs, pillows, chairs, and other decorations in different styles of patterns and fabrics. Select a couch with grey and white stripes on it, or put pillows with floral patterns on solid-colored chairs. Pick out a patterned comforter to go with grey walls."
        },
        {
          "headline":"Choose a statement rug to set the mood for the room.",
          "description":"Your rug is a great way to either add color to a grey room or keep the room in neutral tones. A striped rug made of bold colors will add color to a light grey room, while a white or cream rug will help lighten a darker grey room,\nA rug of the same grey that’s on the walls will create a neutral backdrop for you to emphasize your furniture and accessories."
        },
        {
          "headline":"Create an outdoorsy atmosphere using natural materials.",
          "description":"Choose furniture such as a leather couch or woven twine coffee table to give the grey room a natural feel. You can also find accessories and decorations made of wool, wood, linen, or knits. Pick out pillows made of a knit fabric, or use a wool blanket to drape over a sofa. Hang curtains made of linen for a light, natural look. Use macrame or tapestries to soften the hardness of the grey and add visual interest."
        }
      ]
    }
  ],
  "text":" Selecting Color Schemes Brighten up a grey room with white accents. White is a great color to use in your room to create an open, bright atmosphere, no matter the shade of grey you’re working with. If you want the colors in the room to be white and grey only, pick out white couches, bed linens, drapes, pillows, or other accessories. If your walls are a darker grey, decorating in all whites will be a great way to bring in light. Paint the molding in the room a white or off-white color, or purchase a large white area rug to cover a darker flooring. Choose accessories such as white picture frames, table lamps, or paintings. The glossiness of your white accents also helps create the look you want. For example, shiny white frames or fixtures can create a glamorous look. Alternatively, scuffed matte white frames and fixtures will look more rustic. Choose shades of light blue to create a subdued and calm atmosphere. Grey and light blue look great together, and it’s easy to find things like couch covers or pillows in these shades. Choose light or pastel tones to create a calming vibe in the room. You can also add in a pale turquoise or green with the blue for more accent colors. A grey and blue combo works well in a rooms where you typically want to calm down, such as in your bedroom or bathroom. Keep the room monochromatic by choosing similar shades of grey. This gives the room a futuristic feel. While you can choose varying shades of a darker grey to decorate the room, this works especially well with a lighter grey so that the room doesn’t become too dark. For example, select dark grey furniture to go with a light grey rug that matches light grey walls. Hang super light grey curtains (almost white) to add some light into the room. Choosing slightly different shades of grey will give the room added depth. You may enjoy monochromatic grey if you'd like your room to look masculine or minimalist. However, you can warm it up by varying the shades and textures you use. For example, you could use a plush, dark grey rug and a soft silver grey throw as warming accents. Play with golds and yellows for a lively grey room. Yellow and grey go very well together and create a fun, modern feel. If your room is painted a rich or dark grey, opt for more saturated, bright yellows. For a paler grey room, go with softer yellows for a pastel look. Use the yellow as an accent color, picking out a yellow couch or striped yellow rug. Use bold yellow pillows on a white couch or white bedding for a small focal point. You can create trendy, youthful looks with yellow and grey, which are currently a very popular combo. Create a royal look by decorating grey walls with purple or red accents. A deep purple looks great with a rich grey, while ruby red accents add sophistication to a lighter grey room. Both of these colors create an elegant color scheme and are perfect for smaller accessories. Pick out a large purple vase for an indoor plant, or hang a red light fixture. When using red, avoid choosing a bright shade, which can make your grey take on a muddy effect. Pick out varying bold colors to create a playful and fun vibe. If you don’t want to stick with one color to offset your grey walls, pick out several different bold colors to create lots of different accents. Colors that look particularly great with grey walls include yellows, blues, oranges, and bright pinks. For example, choose pink accent pillows, a yellow large picture frame, and blue light fixtures to go with a striped area rug made of all of those colors. It's a good idea to consider the undertone of your grey. If you have a warm grey on your walls, your other colors should have warm undertones, as well. If you have a cool grey, use other cool shades for your accents. Choosing Wall Decor Hang curtains that emphasize your natural light source. Natural light is super important for making sure a grey room isn’t too dark. If you have windows in your room, hang light, airy curtains to ensure sunlight brightens up the room. Sheer white curtains are a great addition to a grey room and bring in lots of light. If you’d like your curtains to have color, go with a pastel such as blue, pink, or yellow. Pick out a focal point item in the room to provide a pop of color. To make decorating super easy, select one item in the room that will stand out from everything else. It should be in a bold color, such as turquoise, royal blue, or yellow. This one item will make the grey room more lively. For example, a bright fuschia headboard looks great in a grey bedroom with grey and white bedding. Hang a large mirror with a golden frame in a grey living room with wooden furniture. One of the great things about grey is that it looks very neutral. This means you can choose very bold pieces with bright colors and textures, and they'll look great! For example, you might opt for a stunning velvet couch in a bright shade like teal or purple. You can also feature textured items, like an ornate frame. Choose artwork to hang depending on the mood you want to create. If you're going for a calm, soothing environment, select artwork in lots of whites and light greys with a few touches of dark grey or black. To add energy to the room, pick out art with bright, bold colors such as reds, oranges, greens, and yellows. An abstract painting made of whites, greys, and light blues would look great on a grey wall. A painting of a beach sunset with lots of oranges, pinks, and yellows would bring color and life to a grey room. If you prefer a classic look, you could opt for black and white photos in black frames. Install white shelving to contrast the grey walls. No matter the color of grey, white will brighten up the room while also making it look sophisticated. Choose white shelving that reaches the ceiling for lots of storage, or install small floating shelves for displaying just a few things. If you want your shelves to blend in more, paint the shelves the same grey as the walls. You can leave your shelves minimal for a classic, clean look. Alternatively, you could add a bold pop of color to make the room brighter. Select picture frames to go with your color scheme. If you want your grey room to stick to a white, grey, and black color palette, opt for picture frames that are one of these colors. If you want to create a more colorful room, pick out picture frames in colors such as pastel yellow, light blue, or light purple. For a bright and cheerful room, paint all of your picture frames a different color. If you're not sure what the color scheme for the grey room will be, pick out white picture frames, as these will go with anything. Opt for a large mirror to create light reflections. Mirrors will reflect the light, making your grey room even brighter if you have lots of natural sunlight. Choose a mirror in a decorative frame, either made of natural wood or painted a certain color. Hang a round mirror over your fireplace to create a focal point. Choose mirrors in bronze, gold, or silver frames for a touch of sophistication. Adding Furniture and Accessories Add table lamps, sconces, and floor lamps to create the right lighting. When you have grey walls, overhead lighting can cast harsh shadows. To avoid this, add lots of table and floor lighting to create a well-lit and warm room. Put a floor lamp next to each end of a couch, or install wall sconces as an alternative to using ceiling lights. Select wood furniture to bring out warm undertones. Grey can sometimes cause a room to look and feel cold, and using lots of wood can help offset this. Show off a wood floor, set up wooden tables or chairs, or hang pictures made of natural wooden frames. If your walls are a lighter grey, you can work with darker wood. For darker grey walls, opt for wooden furniture that’s a bit lighter. Make sure the furniture isn’t painted—you want to show off the natural wood color. You can create contrast by choosing wood that is textured or embellished. Play with patterns to add texture to the room. Patterns are a great way to make a monochromatic or neutral-colored room look more interesting. Choose rugs, pillows, chairs, and other decorations in different styles of patterns and fabrics. Select a couch with grey and white stripes on it, or put pillows with floral patterns on solid-colored chairs. Pick out a patterned comforter to go with grey walls. Choose a statement rug to set the mood for the room. Your rug is a great way to either add color to a grey room or keep the room in neutral tones. A striped rug made of bold colors will add color to a light grey room, while a white or cream rug will help lighten a darker grey room,\nA rug of the same grey that’s on the walls will create a neutral backdrop for you to emphasize your furniture and accessories. Create an outdoorsy atmosphere using natural materials. Choose furniture such as a leather couch or woven twine coffee table to give the grey room a natural feel. You can also find accessories and decorations made of wool, wood, linen, or knits. Pick out pillows made of a knit fabric, or use a wool blanket to drape over a sofa. Hang curtains made of linen for a light, natural look. Use macrame or tapestries to soften the hardness of the grey and add visual interest.",
  "tyn_model":[
    "curtains",
    "pillows",
    "mirror",
    "picture frames",
    "rug",
    "mirrors",
    "bed linens",
    "vase",
    "artwork",
    "art",
    "shelving",
    "table lamps",
    "floor lamps",
    "floor lamp",
    "wall sconces",
    "—you",
    "rugs",
    "chairs",
    "decorations",
    "couch",
    "comforter",
    "woven twine coffee table",
    "sofa",
    "linen",
    "tapestries"
  ],
  "tyn_section":[

  ]
}