{
  "title":"How to Make Cornflake Chocolate Chip Peppermint Cookies",
  "url":"https://www.wikihow.com/Make-Cornflake-Chocolate-Chip-Peppermint-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Making the Cornflake Crunch",
      "steps":[
        {
          "headline":"Preheat the oven to 270 °F (132 °C) and prepare a cookie sheet pan.",
          "description":"Use parchment/wax paper for lining the pan."
        },
        {
          "headline":"Crush the cornflakes.",
          "description":"You can either use a bowl or plastic bag. Put the cornflakes into either container and crush with your hands to create pieces that are about 1/4 the original size of the flakes. Using a rolling pin or object might result in cornflake dust, so be careful."
        },
        {
          "headline":"Add dried milk powder, sugar, salt, and melted butter to the cornflakes.",
          "description":"Toss the mixture; your mixture should be forming clusters. If it's too dry, add a bit more melted butter. If too moist, add a bit more crushed cornflake."
        },
        {
          "headline":"Place the clusters on your cookie sheet pan.",
          "description":"Spread them out evenly so that there is no overlap, because otherwise your clusters won't cook evenly and become crispy."
        },
        {
          "headline":"Bake your clusters for 20 minutes or when they look ready.",
          "description":"They should be golden brown, slightly crunchy when cooled, and smell like butter."
        },
        {
          "headline":"Cool your cornflake crunch completely before using, and store if needed.",
          "description":"You should leave them out on your pan to cool before storing; putting them straight into a container will cause them to become soggy. You may store in an airtight container at room temperature for 1 week or in the freezer for a month."
        }
      ]
    },
    {
      "name":"Making the Cookies",
      "steps":[
        {
          "headline":"Preheat the oven to 375 °F (191 °C) and prepare a baking sheet with parchment.",
          "description":""
        },
        {
          "headline":"Crush your peppermint candies or candy canes.",
          "description":"Place unwrapped candy into a sealable plastic bag. Use a rolling pin or mallet to crush the candy into pieces about the size of your pinky nail. Don't make powdered peppermints!"
        },
        {
          "headline":"Cream the butter and white/brown sugar.",
          "description":"Using a stand mixer with a paddle attachment, beat these ingredients on high for about 2-3 minutes until fluffy. Creaming the butter and sugar is very important, as it incorporates the ingredients well and creates a nice texture in the finished product."
        },
        {
          "headline":"Scrape down the bowl and add an egg and peppermint extract.",
          "description":"Scraping the bowl down ensures all the butter/sugar will be mixed with the egg and peppermint extract. Beat on high for about 7-8 minutes."
        },
        {
          "headline":"Add flour, baking soda, baking powder, and salt and beat on low.",
          "description":"You only have to mix for as long until the ingredients are incorporated well."
        },
        {
          "headline":"Slowly pour in the cornflake crunch, chocolate chips, and marshmallows while your mixer is still going at low speed.",
          "description":"Just mix until the marshmallows are just well-incorporated."
        },
        {
          "headline":"Use an ice cream scoop or cup measure to portion the dough onto the baking sheet.",
          "description":"The ice cream scoop should be 2 3/4 oz while the cup should measure 1/3 cup. Lightly flatten the tops of the dough portions so that they are not domes anymore, and refrigerate for an hour. Chilling the dough produces a chewy texture."
        },
        {
          "headline":"Arrange your dough properly and bake.",
          "description":"Move the cookie portions at least four inches apart from each other; they will spread out when baking, so you don't want any cookies to merge! Bake for 18 minutes."
        },
        {
          "headline":"Enjoy!",
          "description":"The finished product should be golden brown and smell wonderfully buttery and peppermint-like, like the holidays. You can store in an airtight container for about a week; warm the cookies for a few minutes in a 350 °F (177 °C) oven to soften them if needed (sprinkle some water on top of them before). This is a delicious, unique holiday gift. The crispiness of these cookies with marshmallow, peppermint, and chocolate mixed together is a wonderful surprise!"
        }
      ]
    }
  ],
  "text":" Making the Cornflake Crunch Preheat the oven to 270 °F (132 °C) and prepare a cookie sheet pan. Use parchment/wax paper for lining the pan. Crush the cornflakes. You can either use a bowl or plastic bag. Put the cornflakes into either container and crush with your hands to create pieces that are about 1/4 the original size of the flakes. Using a rolling pin or object might result in cornflake dust, so be careful. Add dried milk powder, sugar, salt, and melted butter to the cornflakes. Toss the mixture; your mixture should be forming clusters. If it's too dry, add a bit more melted butter. If too moist, add a bit more crushed cornflake. Place the clusters on your cookie sheet pan. Spread them out evenly so that there is no overlap, because otherwise your clusters won't cook evenly and become crispy. Bake your clusters for 20 minutes or when they look ready. They should be golden brown, slightly crunchy when cooled, and smell like butter. Cool your cornflake crunch completely before using, and store if needed. You should leave them out on your pan to cool before storing; putting them straight into a container will cause them to become soggy. You may store in an airtight container at room temperature for 1 week or in the freezer for a month. Making the Cookies Preheat the oven to 375 °F (191 °C) and prepare a baking sheet with parchment.  Crush your peppermint candies or candy canes. Place unwrapped candy into a sealable plastic bag. Use a rolling pin or mallet to crush the candy into pieces about the size of your pinky nail. Don't make powdered peppermints! Cream the butter and white/brown sugar. Using a stand mixer with a paddle attachment, beat these ingredients on high for about 2-3 minutes until fluffy. Creaming the butter and sugar is very important, as it incorporates the ingredients well and creates a nice texture in the finished product. Scrape down the bowl and add an egg and peppermint extract. Scraping the bowl down ensures all the butter/sugar will be mixed with the egg and peppermint extract. Beat on high for about 7-8 minutes. Add flour, baking soda, baking powder, and salt and beat on low. You only have to mix for as long until the ingredients are incorporated well. Slowly pour in the cornflake crunch, chocolate chips, and marshmallows while your mixer is still going at low speed. Just mix until the marshmallows are just well-incorporated. Use an ice cream scoop or cup measure to portion the dough onto the baking sheet. The ice cream scoop should be 2 3/4 oz while the cup should measure 1/3 cup. Lightly flatten the tops of the dough portions so that they are not domes anymore, and refrigerate for an hour. Chilling the dough produces a chewy texture. Arrange your dough properly and bake. Move the cookie portions at least four inches apart from each other; they will spread out when baking, so you don't want any cookies to merge! Bake for 18 minutes. Enjoy! The finished product should be golden brown and smell wonderfully buttery and peppermint-like, like the holidays. You can store in an airtight container for about a week; warm the cookies for a few minutes in a 350 °F (177 °C) oven to soften them if needed (sprinkle some water on top of them before). This is a delicious, unique holiday gift. The crispiness of these cookies with marshmallow, peppermint, and chocolate mixed together is a wonderful surprise!",
  "tyn_model":[
    "butter",
    "oven",
    "bowl",
    "cookie sheet pan",
    "rolling pin",
    "sugar",
    "salt",
    "melted butter",
    "airtight container",
    "baking sheet",
    "egg",
    "parchment/wax paper",
    "milk powder",
    "parchment",
    "candy canes",
    "mallet",
    "white/brown sugar",
    "stand mixer",
    "flour",
    "baking soda",
    "baking powder",
    "chocolate chips",
    "marshmallows",
    "mixer",
    "ice cream scoop",
    "ice cream",
    "water",
    "marshmallow",
    "chocolate"
  ],
  "tyn_section":[

  ]
}