{
  "title":"How to Store Nectarines",
  "url":"https://www.wikihow.com/Store-Nectarines",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "methods":[
    {
      "name":"Storing Fresh Nectarines",
      "steps":[
        {
          "headline":"Store nectarines at room temperature until they’re ripe.",
          "description":"Push down on the skin with your finger. If it’s soft and bounces back then it is ripe. They should also emit a fragrant smell when they’ve reached ripeness. If you need them sooner, put your nectarines in a paper bag to ripen faster. Nectarines produce a gas called ethylene which ripens them faster when stored in a paper bag. Putting nectarines in the fridge too early causes the flavor and texture to change drastically."
        },
        {
          "headline":"Move ripe nectarines to the fridge.",
          "description":"Put them in a plastic sealed bag in the crisper. This will give you a few extra days to eat or use them."
        },
        {
          "headline":"Use any nectarines that have become overripe.",
          "description":"Overripe fruit tends to be the sweetest which makes it great for dessert. There are several recipes that overripe nectarines will work well in. Smoothies and shakes. Bread and muffins. Cobbler and pie\nJams and compote\nJuice and popsicles\nSauce for meat"
        }
      ]
    },
    {
      "name":"Freezing Nectarines",
      "steps":[
        {
          "headline":"Cut nectarines in sizes that will serve you best.",
          "description":"Slice your nectarines down the middle. Remove the pit. Cut the nectarines into cubes or slices. Toss the pieces in a bowl with lemon juice to prevent them from browning."
        },
        {
          "headline":"Roll the nectarines around in white sugar.",
          "description":"Make sure all sides are coated evenly. Sugar helps the fruit to retain its shape when it is thawed later."
        },
        {
          "headline":"Spread coated pieces onto a baking sheet.",
          "description":"Put them in the freezer overnight. After they are frozen store them in an airtight container or ziplock bags. Freezing them on a baking sheet individually makes it much easier to use later on. Frozen nectarines will last up to a year, which means you can enjoy a little taste of summer in the winter months."
        }
      ]
    },
    {
      "name":"Canning Nectarines",
      "steps":[
        {
          "headline":"Wash and cut ripe nectarines.",
          "description":"Use a soft-bristled brush with cool water to make cleaning a bit easier. Slice them in half and remove the pit. You can cut them into any size you wish but keep them around the same size."
        },
        {
          "headline":"Make a sugar syrup.",
          "description":"Mix 1 ¼ cups of sugar to five cups of water and bring to a boil. Let the water boil for at least five minutes to dissolve all the sugar. If you like your fruit a little sweeter you can always add more sugar to the syrup mixture."
        },
        {
          "headline":"Prepare your water bath canner.",
          "description":"You can do this while the syrup is heating up. Heat your jars, lids, and rings up to at least 180 degrees."
        },
        {
          "headline":"Fill the jars with nectarines and syrup.",
          "description":"Make sure the jars are still warm. Pack your nectarines into the jars tightly and cover them with the sugar syrup. Remove any air bubbles with a utensil. Skewers work great to remove them. Use a clean towel to wipe the outside of the rims clean. Put the lids on and hand tighten the bands. Always leave a ½ inch of room at the top to allow for expansion when the jars are heated up."
        },
        {
          "headline":"Place the jars in the water bath canner.",
          "description":"Bring the water up to a boil and set a timer. After the timer is done carefully remove the jars from the canner. Gently place them on a dry kitchen towel to cool. The time to boil is 25 minutes for pint jars and 30 minutes for quart jars. After the jars are cool to the touch, test the seal on top of the jars. If any of the seals didn’t set make sure to use them up within a week, otherwise most canned goods last at least two years."
        }
      ]
    }
  ],
  "text":" Storing Fresh Nectarines Store nectarines at room temperature until they’re ripe. Push down on the skin with your finger. If it’s soft and bounces back then it is ripe. They should also emit a fragrant smell when they’ve reached ripeness. If you need them sooner, put your nectarines in a paper bag to ripen faster. Nectarines produce a gas called ethylene which ripens them faster when stored in a paper bag. Putting nectarines in the fridge too early causes the flavor and texture to change drastically. Move ripe nectarines to the fridge. Put them in a plastic sealed bag in the crisper. This will give you a few extra days to eat or use them. Use any nectarines that have become overripe. Overripe fruit tends to be the sweetest which makes it great for dessert. There are several recipes that overripe nectarines will work well in. Smoothies and shakes. Bread and muffins. Cobbler and pie\nJams and compote\nJuice and popsicles\nSauce for meat Freezing Nectarines Cut nectarines in sizes that will serve you best. Slice your nectarines down the middle. Remove the pit. Cut the nectarines into cubes or slices. Toss the pieces in a bowl with lemon juice to prevent them from browning. Roll the nectarines around in white sugar. Make sure all sides are coated evenly. Sugar helps the fruit to retain its shape when it is thawed later. Spread coated pieces onto a baking sheet. Put them in the freezer overnight. After they are frozen store them in an airtight container or ziplock bags. Freezing them on a baking sheet individually makes it much easier to use later on. Frozen nectarines will last up to a year, which means you can enjoy a little taste of summer in the winter months. Canning Nectarines Wash and cut ripe nectarines. Use a soft-bristled brush with cool water to make cleaning a bit easier. Slice them in half and remove the pit. You can cut them into any size you wish but keep them around the same size. Make a sugar syrup. Mix 1 ¼ cups of sugar to five cups of water and bring to a boil. Let the water boil for at least five minutes to dissolve all the sugar. If you like your fruit a little sweeter you can always add more sugar to the syrup mixture. Prepare your water bath canner. You can do this while the syrup is heating up. Heat your jars, lids, and rings up to at least 180 degrees. Fill the jars with nectarines and syrup. Make sure the jars are still warm. Pack your nectarines into the jars tightly and cover them with the sugar syrup. Remove any air bubbles with a utensil. Skewers work great to remove them. Use a clean towel to wipe the outside of the rims clean. Put the lids on and hand tighten the bands. Always leave a ½ inch of room at the top to allow for expansion when the jars are heated up. Place the jars in the water bath canner. Bring the water up to a boil and set a timer. After the timer is done carefully remove the jars from the canner. Gently place them on a dry kitchen towel to cool. The time to boil is 25 minutes for pint jars and 30 minutes for quart jars. After the jars are cool to the touch, test the seal on top of the jars. If any of the seals didn’t set make sure to use them up within a week, otherwise most canned goods last at least two years.",
  "tyn_model":[
    "nectarines",
    "sugar",
    "water",
    "fridge",
    "baking sheet",
    "sugar syrup",
    "ethylene",
    "crisper",
    "bread",
    "cobbler",
    "compote",
    "juice",
    "popsicles",
    "sauce",
    "bowl",
    "lemon juice",
    "white sugar",
    "freezer",
    "airtight container",
    "ziplock bags",
    "canning nectarines",
    "water bath canner",
    "jars",
    "syrup",
    "water bath",
    "canner",
    "canned goods"
  ],
  "tyn_section":[

  ]
}