{
  "title":"How to Clean Raspberries",
  "url":"https://www.wikihow.com/Clean-Raspberries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Berries"
  ],
  "methods":[
    {
      "name":"Cleaning Your Raspberries with Water",
      "steps":[
        {
          "headline":"Fill up a cool water bath in your sink.",
          "description":"Make sure that your sink is large enough so that you can fit a colander or sieve in it. If this isn’t the case, try using a large bowl or pot. The water level should also be high enough such that it will be able to cover the raspberries after having had the sieve/colander put in. Discard any already moldy or mushy berries."
        },
        {
          "headline":"Place a single layer of raspberries in your colander.",
          "description":"This will minimize the downward pressure that the raspberries experience. If you overfill the colander you risk bruising the berries or making them mushy."
        },
        {
          "headline":"Lower the colander into the water bath.",
          "description":"Make sure that the berries are completely submerged in the water in order to effectively clean them."
        },
        {
          "headline":"Swish the berries around the water.",
          "description":"This will help remove any dirt from the berries. It’s very important to do this gently, however, as failure to do so may result in bruising of the berries. You can use your hands or some other soft utensil like a silicone spatula."
        },
        {
          "headline":"Remove the colander from the water.",
          "description":"Let the water drain off naturally from the berries. If you shake the colander around you may bruise or ruin some of the berries."
        },
        {
          "headline":"Place the berries onto a baking sheet lined with paper towels.",
          "description":"Avoid dumping all the berries onto the tray and instead place them gently and make sure they’re spread out across the sheet. Your berries are now ready to be frozen, chilled, or eaten immediately."
        }
      ]
    },
    {
      "name":"Using a Vinegar Solution and Salad Spinner",
      "steps":[
        {
          "headline":"Make the solution.",
          "description":"The solution is made up of 3 parts water to every 1 part white vinegar. The vinegar kills any spores or bacteria that may be forming on the berries. This prevents any mold forming on the berries which would render them inedible. The container you have the solution in should be wide enough such that the berries won’t be stacked on top of each other. The vinegar will not get rid of mold that is already on any berries so discard berries that are already moldy."
        },
        {
          "headline":"Place the raspberries into the solution.",
          "description":"Do not drop them in the solution as this may cause bruising. While they’re sitting in the solution, feel free to move the berries around occasionally and delicately so you may remove any dirt/grime from the berries."
        },
        {
          "headline":"Remove the berries and place into a salad spinner lined with paper towels.",
          "description":"Ensure that this is done gently and in small batches. Use a soft utensil like a plastic serving spoon to avoid bruising."
        },
        {
          "headline":"Spin the berries gently.",
          "description":"This will ensure that the vinegar solution is completely removed from the berries. If any of it is left on the berries you will likely end up tasting the vinegar. Be gentle with this step but also thorough. If you are concerned about vinegar remaining on the berries then you do have the option of very gently rinsing the berries in water while in the salad spinner."
        },
        {
          "headline":"Remove berries from the salad spinner and place in container.",
          "description":"Take your clean berries and place them into a bowl for serving, a bag for freezing or, if you are planning on keeping them in your fridge, put them on a paper towel lined dish on a single layer."
        }
      ]
    }
  ],
  "text":" Cleaning Your Raspberries with Water Fill up a cool water bath in your sink. Make sure that your sink is large enough so that you can fit a colander or sieve in it. If this isn’t the case, try using a large bowl or pot. The water level should also be high enough such that it will be able to cover the raspberries after having had the sieve/colander put in. Discard any already moldy or mushy berries. Place a single layer of raspberries in your colander. This will minimize the downward pressure that the raspberries experience. If you overfill the colander you risk bruising the berries or making them mushy. Lower the colander into the water bath. Make sure that the berries are completely submerged in the water in order to effectively clean them. Swish the berries around the water. This will help remove any dirt from the berries. It’s very important to do this gently, however, as failure to do so may result in bruising of the berries. You can use your hands or some other soft utensil like a silicone spatula. Remove the colander from the water. Let the water drain off naturally from the berries. If you shake the colander around you may bruise or ruin some of the berries. Place the berries onto a baking sheet lined with paper towels. Avoid dumping all the berries onto the tray and instead place them gently and make sure they’re spread out across the sheet. Your berries are now ready to be frozen, chilled, or eaten immediately. Using a Vinegar Solution and Salad Spinner Make the solution. The solution is made up of 3 parts water to every 1 part white vinegar. The vinegar kills any spores or bacteria that may be forming on the berries. This prevents any mold forming on the berries which would render them inedible. The container you have the solution in should be wide enough such that the berries won’t be stacked on top of each other. The vinegar will not get rid of mold that is already on any berries so discard berries that are already moldy. Place the raspberries into the solution. Do not drop them in the solution as this may cause bruising. While they’re sitting in the solution, feel free to move the berries around occasionally and delicately so you may remove any dirt/grime from the berries. Remove the berries and place into a salad spinner lined with paper towels. Ensure that this is done gently and in small batches. Use a soft utensil like a plastic serving spoon to avoid bruising. Spin the berries gently. This will ensure that the vinegar solution is completely removed from the berries. If any of it is left on the berries you will likely end up tasting the vinegar. Be gentle with this step but also thorough. If you are concerned about vinegar remaining on the berries then you do have the option of very gently rinsing the berries in water while in the salad spinner. Remove berries from the salad spinner and place in container. Take your clean berries and place them into a bowl for serving, a bag for freezing or, if you are planning on keeping them in your fridge, put them on a paper towel lined dish on a single layer.",
  "tyn_model":[
    "water",
    "colander",
    "vinegar",
    "salad spinner",
    "sieve",
    "bowl",
    "raspberries",
    "paper towels",
    "baking sheet",
    "tray",
    "vinegar solution",
    "white vinegar",
    "berries",
    "container",
    "paper towel lined dish"
  ],
  "tyn_section":[

  ]
}