{
  "title":"How to Recycle an iPad",
  "url":"https://www.wikihow.com/Recycle-an-iPad",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Household Waste Disposal",
    "Recycling"
  ],
  "methods":[
    {
      "name":"Backing up and Clearing Your Device",
      "steps":[
        {
          "headline":"Make sure your iPad is connected to Wi-Fi and a power source.",
          "description":"Plug your iPad's power cord into a wall outlet or other power source. On your iPad home screen, click \"Settings\" and select \"Wi-Fi.\" If your iPad is connected to a network you will see a blue check mark next to the network name. If you are not connected to your preferred network, re-enter the password and try to connect again. If you have difficulty connecting to a viable Wi-Fi network, try restarting your iPad and try again."
        },
        {
          "headline":"Tap the iCloud banner and initiate a back up of your device.",
          "description":"In the Settings app, select the iCloud banner and click \"This iPad.\" Tap \"iCloud Backup\" and \"Back Up Now.\" Wait for a message telling you that the back up is completed before closing the app.The iCloud backup stores your information on remote online servers in case it is lost or erased from your device."
        },
        {
          "headline":"Reset your iPad to erase all the content and settings.",
          "description":"Launch the Settings app again and tap \"General.\" Scroll down to the bottom of the screen and click \"Reset.\" Select \"Erase All Content and Settings\" and confirm your selection when prompted.Your iPad should return to its original factory settings once the process is complete."
        }
      ]
    },
    {
      "name":"Trading Back to Apple",
      "steps":[
        {
          "headline":"Visit the Apple trade-in website.",
          "description":"Apple will recycle any old Apple devices that can be repaired and refurbished. In return for trading in your used iPad, you will receive an Apple gift card. To sign up, access the company's recycling website at https://www.apple.com/shop/trade-in. The gift card amount will depend on the estimated value of your iPad. If your iPad is not eligible for refurbishing, Apple will recycle it for you free of charge, but will not send you a gift card."
        },
        {
          "headline":"Select your device and enter the serial number.",
          "description":"On the main page, select the \"Tablet\" icon. Enter the serial number of your specific device when prompted to. The serial number should be engraved on the back of your iPad. The serial number will help Apple identify your device and prevent fraud."
        },
        {
          "headline":"Specify the condition of your iPad.",
          "description":"Once you identify your device, you will be asked to provide information about what state it is in. Confirm that you have erased the content and settings on your iPad and indicate that the device is in good condition. Indicate whether or not your iPad has screen damage, cracks, or LCD bruising by selecting \"yes\" or \"no.\" Note that it is unlikely that you will receive an Apple gift card if your iPad is damaged."
        },
        {
          "headline":"Enter your contact information to receive a box and prepaid shipping label.",
          "description":"Once you have completed the registration process, you will be prompted to write your personal information. Enter your full name, shipping address, and phone number as requested. Apple will then mail you a box and prepaid shipping label for your iPad."
        },
        {
          "headline":"Pack your iPad and mail it to Apple.",
          "description":"Place your iPad in the box provided and seal the box securely. Attach the prepaid mailing label to the box as indicated. Bring the box to your local post office for delivery. Be sure to get a receipt for the package including a tracking number for reference."
        },
        {
          "headline":"Expect your gift card several weeks after mailing the package.",
          "description":"It will take at least a few weeks for Apple to receive your iPad, process it, and send out your gift card. Expect to receive it in the mail at least 2-3 weeks after you ship your iPad. You will be able to use the gift card at any Apple retail store or their online store. You will receive a confirmation email that your gift card is on the way once your iPad has been inspected and approved for the trade."
        },
        {
          "headline":"Bring your iPad into an Apple store for an instant exchange.",
          "description":"You can trade your iPad in to an Apple boutique for store credit or to have it recycled for free. An Apple employee will inspect the device and calculate its value based on the model and condition. To avoid long wait times, make an appointment at an Apple store ahead of time. Search for an Apple store near you at https://www.apple.com/retail/."
        }
      ]
    },
    {
      "name":"Selling or Donating Your IPad",
      "steps":[
        {
          "headline":"Sell your iPad to an online electronics re-seller.",
          "description":"There are many websites that buy used electronics and resell them for a profit. Compare different sites by filling out details about your iPad on each site and generating offers. Once you accept an offer, pack and ship your device as directed to receive your payment. Note that your offers will be higher if your device is in good condition and if you have the original box and charger. Read online reviews of these sites to ensure that they are reliable. For instance, you can buy and sell pre-owned electronic devices at popular sites like https://www.gazelle.com/. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tIf your iPad is destroyed, look for an e-waste recycling facility. Kathryn Kellogg, author of 101 Ways to Go Zero Waste, says: \"Go to the E-Steward website and look at their list of e-waste recyclers to find the facility that's nearest you. They can handle disposing of the hazardous materials found in tablets and other devices.\""
        },
        {
          "headline":"Sell your iPad on an online classifieds website.",
          "description":"Sites like Craigslist allow you to sell items directly and locally. Create an ad on one of these sites that includes a description of your iPad as well as a photo and your asking price. Specify your location and add a contact phone number, if desired. Look up asking prices for other used iPads to gauge how much you should sell your device for. Avoid listing personal information, such as your phone number or address, when posting publicly on a site like Craigslist. You can also list your iPad on an online auction site like eBay or on Facebook Marketplace."
        },
        {
          "headline":"Donate your iPad to a charity or educational program.",
          "description":"Call charities in your area to see if they would accept your iPad as a donation. Certain charities collect technology donations to give to individuals or families in need. A local school or after-school program may also benefit from an iPad. Some state-based non-profit organizations will accept iPad donations for schools."
        }
      ]
    }
  ],
  "text":" Backing up and Clearing Your Device Make sure your iPad is connected to Wi-Fi and a power source. Plug your iPad's power cord into a wall outlet or other power source. On your iPad home screen, click \"Settings\" and select \"Wi-Fi.\" If your iPad is connected to a network you will see a blue check mark next to the network name. If you are not connected to your preferred network, re-enter the password and try to connect again. If you have difficulty connecting to a viable Wi-Fi network, try restarting your iPad and try again. Tap the iCloud banner and initiate a back up of your device. In the Settings app, select the iCloud banner and click \"This iPad.\" Tap \"iCloud Backup\" and \"Back Up Now.\" Wait for a message telling you that the back up is completed before closing the app.The iCloud backup stores your information on remote online servers in case it is lost or erased from your device. Reset your iPad to erase all the content and settings. Launch the Settings app again and tap \"General.\" Scroll down to the bottom of the screen and click \"Reset.\" Select \"Erase All Content and Settings\" and confirm your selection when prompted.Your iPad should return to its original factory settings once the process is complete. Trading Back to Apple Visit the Apple trade-in website. Apple will recycle any old Apple devices that can be repaired and refurbished. In return for trading in your used iPad, you will receive an Apple gift card. To sign up, access the company's recycling website at https://www.apple.com/shop/trade-in. The gift card amount will depend on the estimated value of your iPad. If your iPad is not eligible for refurbishing, Apple will recycle it for you free of charge, but will not send you a gift card. Select your device and enter the serial number. On the main page, select the \"Tablet\" icon. Enter the serial number of your specific device when prompted to. The serial number should be engraved on the back of your iPad. The serial number will help Apple identify your device and prevent fraud. Specify the condition of your iPad. Once you identify your device, you will be asked to provide information about what state it is in. Confirm that you have erased the content and settings on your iPad and indicate that the device is in good condition. Indicate whether or not your iPad has screen damage, cracks, or LCD bruising by selecting \"yes\" or \"no.\" Note that it is unlikely that you will receive an Apple gift card if your iPad is damaged. Enter your contact information to receive a box and prepaid shipping label. Once you have completed the registration process, you will be prompted to write your personal information. Enter your full name, shipping address, and phone number as requested. Apple will then mail you a box and prepaid shipping label for your iPad. Pack your iPad and mail it to Apple. Place your iPad in the box provided and seal the box securely. Attach the prepaid mailing label to the box as indicated. Bring the box to your local post office for delivery. Be sure to get a receipt for the package including a tracking number for reference. Expect your gift card several weeks after mailing the package. It will take at least a few weeks for Apple to receive your iPad, process it, and send out your gift card. Expect to receive it in the mail at least 2-3 weeks after you ship your iPad. You will be able to use the gift card at any Apple retail store or their online store. You will receive a confirmation email that your gift card is on the way once your iPad has been inspected and approved for the trade. Bring your iPad into an Apple store for an instant exchange. You can trade your iPad in to an Apple boutique for store credit or to have it recycled for free. An Apple employee will inspect the device and calculate its value based on the model and condition. To avoid long wait times, make an appointment at an Apple store ahead of time. Search for an Apple store near you at https://www.apple.com/retail/. Selling or Donating Your IPad Sell your iPad to an online electronics re-seller. There are many websites that buy used electronics and resell them for a profit. Compare different sites by filling out details about your iPad on each site and generating offers. Once you accept an offer, pack and ship your device as directed to receive your payment. Note that your offers will be higher if your device is in good condition and if you have the original box and charger. Read online reviews of these sites to ensure that they are reliable. For instance, you can buy and sell pre-owned electronic devices at popular sites like https://www.gazelle.com/. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tIf your iPad is destroyed, look for an e-waste recycling facility. Kathryn Kellogg, author of 101 Ways to Go Zero Waste, says: \"Go to the E-Steward website and look at their list of e-waste recyclers to find the facility that's nearest you. They can handle disposing of the hazardous materials found in tablets and other devices.\" Sell your iPad on an online classifieds website. Sites like Craigslist allow you to sell items directly and locally. Create an ad on one of these sites that includes a description of your iPad as well as a photo and your asking price. Specify your location and add a contact phone number, if desired. Look up asking prices for other used iPads to gauge how much you should sell your device for. Avoid listing personal information, such as your phone number or address, when posting publicly on a site like Craigslist. You can also list your iPad on an online auction site like eBay or on Facebook Marketplace. Donate your iPad to a charity or educational program. Call charities in your area to see if they would accept your iPad as a donation. Certain charities collect technology donations to give to individuals or families in need. A local school or after-school program may also benefit from an iPad. Some state-based non-profit organizations will accept iPad donations for schools.",
  "tyn_model":[
    "ipad",
    "apple store",
    "icloud backup",
    "icloud banner",
    "apple trade-in website.",
    "apple gift card",
    "apple",
    "apple gift",
    "box",
    "prepaid mailing label",
    "apple boutique",
    "charger",
    "electronic devices",
    "eco-friendly living",
    "e-waste recycling facility",
    "e-steward",
    "e-waste recyclers",
    "ipads"
  ],
  "tyn_section":[

  ]
}