{
  "title":"How to Harvest Scallops",
  "url":"https://www.wikihow.com/Harvest-Scallops",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "methods":[
    {
      "name":"Collecting Scallops by Hand",
      "steps":[
        {
          "headline":"Get the proper permits.",
          "description":"Collecting scallops for your personal use may only require a local fishing license. However, as hand-collected scallops have become more commercially popular due to their low-environmental impact, you will need to contact your local Game and Wildlife department to find out about catch limits and proper permits. In some areas, license only allow about 2 gallons worth of catch for non-commercial use. Be sure to know your limits so you do not get ticketed."
        },
        {
          "headline":"Get your gear.",
          "description":"Most recreational harvesting by hand is done while snorkeling (as opposed to scuba diving), so you will generally just need a good pair of goggles, a snorkel with a “purge valve,” and a netted diving bag. The “purge valve” allows you to dive frequently for collecting without letting water go down into your snorkel. This makes for easier breathing and less frequent stops. The netted diving bag should have a drawstring closure because caught scallops may try to swim and escape. US laws often require a “diver down” flag aboard your boat to let people know there are divers in the water. Make sure you have one as well, if needed."
        },
        {
          "headline":"Find a good anchoring spot.",
          "description":"Scalloping is best and easiest in clear water. You may be able to spot overturned scallops from the boat, but you may need to drop in occasionally to see if you are in a good location. The easiest sign of scallops are a few turned upside down with the brighter side facing up. This usually means a good number of additional scallops in the area turned with the darker, more camouflaged-side up. Seek out a clear, sandy floor with short grasses. Not only will it be easier to pick from, but you will be able to see collections of scallops well in these conditions."
        },
        {
          "headline":"Start diving for scallops.",
          "description":"Once you’ve found some scallops, the hard work is done. Now comes the fun part of diving and collecting them. Since scallops don’t bite, the only thing you have to worry about is making sure to keep them in your diving bag. Come up often to measure your catch on board. Depending on where you are scalloping, patrols may come by to monitor that you are within your permitted limit. When you bring the scallops up to the boat, have ice ready to put the scallops on immediately. This will help to keep them fresh before you go on to clean and process them."
        }
      ]
    },
    {
      "name":"Trawling for Scallops",
      "steps":[
        {
          "headline":"Get proper permits for trawling.",
          "description":"Since trawling (or dredging) is done more often for commercial purposes, there will be different permits required from hand-collection. The National Oceanic and Atmospheric Administration (NOAA) handles permitting for these instances."
        },
        {
          "headline":"Plot your route.",
          "description":"Trawling typically can last from 1-2 hours in a single pull. This allows you to cover a large amount of seabed without having to continually pull equipment in to clean out. Scallops are most frequent between depths of 20-40 meters, so consider working parallel to a coastline so as not to be working in and out of appropriate depths too much. Be sure to also plan for enough storage capacity on the boat with ice for as many successful passes as you plan to make in a day - plan for a best case scenario! Be prepared to travel to a well-populated area because often environmental impact surveys will monitor population levels and whether or not they are kept within limits. US scalloping is divided into permit “zones.”"
        },
        {
          "headline":"Start trawling the seas.",
          "description":"Trawling for scallops should never need to be done at speeds above 1 knot. Whether you are dredging the floor or are trawling your net just above the floor, the scallops will either be laying motionless or swimming very slowly away. Trawling faster than this can increase the number of “by-catches” of other species. This will just increase the workload to filter later on. Dredging on the seafloor is also advised against as it often does more harm to the surviving sea life and vegetation. Catches can be just as successful pulling slightly above the seafloor as pulling the floor itself. As you pull in scallops, it can be wise to do filtering, a first wash and measuring immediately on the boat so that you do not end up out of permitted catch limits."
        }
      ]
    },
    {
      "name":"Processing the Scallops",
      "steps":[
        {
          "headline":"Filter unwanted catches and sediment.",
          "description":"As you pull up a catch of scallops, it makes processing much quicker to go ahead and filter out what you want to keep and what you don’t. Additionally, if you need to return catch that was too small, they can survive by getting them back into the water as soon as possible. Filtering as you catch will also make sure you can accurately measure as you work. As there will be plenty of sand and sediment no matter your method, washing some out immediately before putting on ice or into your storage will be another burden saved."
        },
        {
          "headline":"Ice the scallops if processing immediately.",
          "description":"Temperature irregularity in scallops is the quickest way to compromise the freshness, quality and texture of your product. By putting the scallops on ice immediately, or, if able, flash-freezing them will kill the scallops and make them easier to crack open and clean. If you plan to haul to the scallops around for multiple days, as is common for commercial fishing vessels, it is better advised to hold them alive in cool saltwater, preserving their freshness."
        },
        {
          "headline":"Clean your scallops.",
          "description":"The next step will be to actually clean your scallops out. This can be a quick and relatively painless process depending on how you’ve handled the catch up to this point. If you’ve opted to freeze, thawing by open air (for smaller quantities) or water thawing (for larger) is best. Heating too fast can toughen the muscle, creating discoloration and loss of flavor. Un-shucked scallops will start to lose flavor after 4-7 days in ice. Shucked scallops will lose flavor in half the time on ice, so handle them accordingly."
        },
        {
          "headline":"Enjoy a hard-earned feast.",
          "description":"Approximately 2 gallons of caught scallops will equate to 1 pint of meat. Make sure you either cook and enjoy them as soon as you can, or else, keep the meat frozen to enjoy or transport at a later time."
        }
      ]
    }
  ],
  "text":" Collecting Scallops by Hand Get the proper permits. Collecting scallops for your personal use may only require a local fishing license. However, as hand-collected scallops have become more commercially popular due to their low-environmental impact, you will need to contact your local Game and Wildlife department to find out about catch limits and proper permits. In some areas, license only allow about 2 gallons worth of catch for non-commercial use. Be sure to know your limits so you do not get ticketed. Get your gear. Most recreational harvesting by hand is done while snorkeling (as opposed to scuba diving), so you will generally just need a good pair of goggles, a snorkel with a “purge valve,” and a netted diving bag. The “purge valve” allows you to dive frequently for collecting without letting water go down into your snorkel. This makes for easier breathing and less frequent stops. The netted diving bag should have a drawstring closure because caught scallops may try to swim and escape. US laws often require a “diver down” flag aboard your boat to let people know there are divers in the water. Make sure you have one as well, if needed. Find a good anchoring spot. Scalloping is best and easiest in clear water. You may be able to spot overturned scallops from the boat, but you may need to drop in occasionally to see if you are in a good location. The easiest sign of scallops are a few turned upside down with the brighter side facing up. This usually means a good number of additional scallops in the area turned with the darker, more camouflaged-side up. Seek out a clear, sandy floor with short grasses. Not only will it be easier to pick from, but you will be able to see collections of scallops well in these conditions. Start diving for scallops. Once you’ve found some scallops, the hard work is done. Now comes the fun part of diving and collecting them. Since scallops don’t bite, the only thing you have to worry about is making sure to keep them in your diving bag. Come up often to measure your catch on board. Depending on where you are scalloping, patrols may come by to monitor that you are within your permitted limit. When you bring the scallops up to the boat, have ice ready to put the scallops on immediately. This will help to keep them fresh before you go on to clean and process them. Trawling for Scallops Get proper permits for trawling. Since trawling (or dredging) is done more often for commercial purposes, there will be different permits required from hand-collection. The National Oceanic and Atmospheric Administration (NOAA) handles permitting for these instances. Plot your route. Trawling typically can last from 1-2 hours in a single pull. This allows you to cover a large amount of seabed without having to continually pull equipment in to clean out. Scallops are most frequent between depths of 20-40 meters, so consider working parallel to a coastline so as not to be working in and out of appropriate depths too much. Be sure to also plan for enough storage capacity on the boat with ice for as many successful passes as you plan to make in a day - plan for a best case scenario! Be prepared to travel to a well-populated area because often environmental impact surveys will monitor population levels and whether or not they are kept within limits. US scalloping is divided into permit “zones.” Start trawling the seas. Trawling for scallops should never need to be done at speeds above 1 knot. Whether you are dredging the floor or are trawling your net just above the floor, the scallops will either be laying motionless or swimming very slowly away. Trawling faster than this can increase the number of “by-catches” of other species. This will just increase the workload to filter later on. Dredging on the seafloor is also advised against as it often does more harm to the surviving sea life and vegetation. Catches can be just as successful pulling slightly above the seafloor as pulling the floor itself. As you pull in scallops, it can be wise to do filtering, a first wash and measuring immediately on the boat so that you do not end up out of permitted catch limits. Processing the Scallops Filter unwanted catches and sediment. As you pull up a catch of scallops, it makes processing much quicker to go ahead and filter out what you want to keep and what you don’t. Additionally, if you need to return catch that was too small, they can survive by getting them back into the water as soon as possible. Filtering as you catch will also make sure you can accurately measure as you work. As there will be plenty of sand and sediment no matter your method, washing some out immediately before putting on ice or into your storage will be another burden saved. Ice the scallops if processing immediately. Temperature irregularity in scallops is the quickest way to compromise the freshness, quality and texture of your product. By putting the scallops on ice immediately, or, if able, flash-freezing them will kill the scallops and make them easier to crack open and clean. If you plan to haul to the scallops around for multiple days, as is common for commercial fishing vessels, it is better advised to hold them alive in cool saltwater, preserving their freshness. Clean your scallops. The next step will be to actually clean your scallops out. This can be a quick and relatively painless process depending on how you’ve handled the catch up to this point. If you’ve opted to freeze, thawing by open air (for smaller quantities) or water thawing (for larger) is best. Heating too fast can toughen the muscle, creating discoloration and loss of flavor. Un-shucked scallops will start to lose flavor after 4-7 days in ice. Shucked scallops will lose flavor in half the time on ice, so handle them accordingly. Enjoy a hard-earned feast. Approximately 2 gallons of caught scallops will equate to 1 pint of meat. Make sure you either cook and enjoy them as soon as you can, or else, keep the meat frozen to enjoy or transport at a later time.",
  "tyn_model":[
    "scallops",
    "ice",
    "water",
    "snorkel",
    "“purge",
    "netted diving bag",
    "trawling",
    "scuba diving",
    "goggles",
    "” and",
    "” allows",
    "“diver",
    "” flag",
    "divers",
    "diving",
    "boat",
    "dredging",
    "seabed",
    "“zones",
    "” start",
    "net",
    "“by",
    "” of",
    "sediment"
  ],
  "tyn_section":[

  ]
}