{
  "title":"How to Wash Velour",
  "url":"https://www.wikihow.com/Wash-Velour",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Cleaning Fabric"
  ],
  "methods":[
    {
      "name":"Using a Washing Machine",
      "steps":[
        {
          "headline":"Read the care tag to ensure that the item can be machine-washed.",
          "description":"Most blankets, pillows, and clothing will have a tag on the fabric that explains how to care for the item. Check along the seam for the tag, and read it carefully. If the fabric doesn’t have a care tag, you may want to hand wash it just to be safe."
        },
        {
          "headline":"Place the fabric in a mesh laundry bag.",
          "description":"For velour clothing and other fabric items, a trip through the washing machine with other clothes can damage the fabric. Putting the item in a laundry bag will protect it from buttons, zippers, and clasps on other clothes in the machine. If you don’t have a laundry bag, use a clean cotton pillowcase as a protective cover for the item."
        },
        {
          "headline":"Add half of a capful of mild or gentle laundry detergent to the machine.",
          "description":"Try to look for a detergent that is labeled as mild or gentle. Use the right amount of detergent for the size of the load that you’re washing. Try to avoid pouring laundry detergent directly onto the velour, especially if the detergent is blue or green colored. The detergent can stick to the fabric and leave a mark."
        },
        {
          "headline":"Select the “warm” and “gentle” settings on the washing machine.",
          "description":"Warm water on a gentle cycle will help to loosen dirt and lint from the fabric without harming the delicate fibers. Use the dial or buttons on the panel of the washing machine to select the right settings. For heavier fabrics, like curtains, you can use the normal cycle to ensure that they are thoroughly washed."
        },
        {
          "headline":"Place the fabric in the dryer on low heat to tumble dry.",
          "description":"Velour is a lot sturdier than other velvet-like fabrics, so it can stand up to time in the dryer. Depending on the size of the item, you may need to add extra time to ensure that it’s completely dry. Alternatively, you can hang the item in indirect sunlight to dry. This process takes longer, but is also safe for the fabric."
        }
      ]
    },
    {
      "name":"Washing Velour by Hand",
      "steps":[
        {
          "headline":"Fill a laundry tub with cool water and mild laundry detergent.",
          "description":"Add about 1 tablespoon (15 mL) of laundry detergent to the tub of water, and mix it around to create bubbles in the water. The water should be cool, but not so cold that you can’t hold your hand in the water for a minute or so. If you end up making the water too cold, add a bit of warm water to heat it up quickly without having to drain the tub."
        },
        {
          "headline":"Let the fabric soak for 10 minutes in the water.",
          "description":"Push the fabric into the water until it’s completely submerged. Leave it in the water to absorb the cleaning detergent and loosen any mats and dirt in the fabric. If the fabric is visibly dirty or dusty, swirl it around in the tub for 1-2 minutes before letting it soak. This will help to remove most of the dirt!"
        },
        {
          "headline":"Rub the fabric gently with a piece of muslin to remove dirt and lint.",
          "description":"After the fabric has absorbed the detergent, take a piece of muslin fabric and rub it over the velour fabric. Be sure not to press too hard, as that can flatten the fibers. For a larger item, you may need 2-3 pieces of muslin to pick up all of the dirt and lint from the fabric."
        },
        {
          "headline":"Rinse the fabric with cool water until the water runs clear.",
          "description":"Drain the tub or sink and run the fabric under running water. Make sure that every part of the fabric is rinsed thoroughly and that all of the detergent is removed from the velour."
        },
        {
          "headline":"Roll the fabric in a clean towel to remove excess moisture.",
          "description":"Using a large towel, like a bath towel, blot the water off of the velour. Don’t wring or press the fabric, which can cause damage and flat areas. It’s best to use an older towel because velour can sometimes bleed dye from its fibers when the fabric is wet."
        },
        {
          "headline":"Hang the fabric to air dry completely.",
          "description":"Let the fabric dry for at least 6 hours on a hanger or clothesline. If you don’t have a clothesline, lay the fabric on a flat surface, and flip it over halfway through the drying time to ensure that it dries evenly on both sides. After 6 hours, touch the fibers to make sure they’re completely dry on the front and back of the fabric."
        }
      ]
    },
    {
      "name":"Cleaning Velour Upholstery",
      "steps":[
        {
          "headline":"Vacuum velour upholstery with the brush attachment to remove dirt and mats.",
          "description":"Using a back and forth motion, run the brush up and down the fabric while the vacuum is on. If you have a mat in the fabric, try brushing the spot vigorously a few times to loosen it before turning the vacuum on. Many cars are upholstered with velour, and even some couches. It’s easiest to use the brush attachment to reach crevices in these areas before cleaning the fabric."
        },
        {
          "headline":"Spray dry shampoo on stains if you only need a spot treatment.",
          "description":"Dry shampoo is great for absorbing a variety of stains and marks on velour. Purchase a bottle of the shampoo at the grocery or beauty supply store, and spray it onto the stain. When you’re spraying, hold the bottle close to the stain to make sure it’s concentrated in the one area. Make sure you’re using regular dry shampoo, which should look white when you spray it. Remember to work the dry shampoo into the fabric before applying upholstery cleaner to the area if you plan on doing a deeper clean."
        },
        {
          "headline":"Select a velour-safe upholstery cleaner if you’re washing a large area.",
          "description":"If you need to clean an entire couch cushion or seat in your car, go to a car repair store and look for cleaner that is safe for velour. Spray the cleaner liberally over the area. If there are any stains, make sure they’re treated first. Then, you can apply the general upholstery cleaner over the stain remover."
        },
        {
          "headline":"Let the cleaning agent sit on the fabric for 5 minutes.",
          "description":"Whether you’re using an upholstery cleaner or spot treatment, the cleaner has to soak into the fabric. After 5 minutes, you can resume your cleaning. If you’re cleaning a larger area, you may want to spray small areas at a time to prevent the cleaner from drying before you get to that area."
        },
        {
          "headline":"Work the cleaner into the fabric with a soft-bristle brush.",
          "description":"After 5 minutes, use  the brush from the vacuum or a different brush to gently rub the cleaner into the fabric. Scrub in small circles and focus on small areas at a time. If you’re using the brush from the vacuum, make sure the vacuum is off during this process. Depending on the type of cleaner you use, it might damage the inside of the vacuum."
        },
        {
          "headline":"Blot the excess cleaning agent with a clean, dry towel.",
          "description":"Once the cleaner is worked into the upholstery, press a towel onto the surface to soak up the cleaner, dirt, and lint. Then, wait for the fabric to air dry completely. Air drying can take up to 12 hours in humid weather, so be patient! Check the fabric with your hand to make sure it’s dry before sitting on the upholstery."
        }
      ]
    }
  ],
  "text":" Using a Washing Machine Read the care tag to ensure that the item can be machine-washed. Most blankets, pillows, and clothing will have a tag on the fabric that explains how to care for the item. Check along the seam for the tag, and read it carefully. If the fabric doesn’t have a care tag, you may want to hand wash it just to be safe. Place the fabric in a mesh laundry bag. For velour clothing and other fabric items, a trip through the washing machine with other clothes can damage the fabric. Putting the item in a laundry bag will protect it from buttons, zippers, and clasps on other clothes in the machine. If you don’t have a laundry bag, use a clean cotton pillowcase as a protective cover for the item. Add half of a capful of mild or gentle laundry detergent to the machine. Try to look for a detergent that is labeled as mild or gentle. Use the right amount of detergent for the size of the load that you’re washing. Try to avoid pouring laundry detergent directly onto the velour, especially if the detergent is blue or green colored. The detergent can stick to the fabric and leave a mark. Select the “warm” and “gentle” settings on the washing machine. Warm water on a gentle cycle will help to loosen dirt and lint from the fabric without harming the delicate fibers. Use the dial or buttons on the panel of the washing machine to select the right settings. For heavier fabrics, like curtains, you can use the normal cycle to ensure that they are thoroughly washed. Place the fabric in the dryer on low heat to tumble dry. Velour is a lot sturdier than other velvet-like fabrics, so it can stand up to time in the dryer. Depending on the size of the item, you may need to add extra time to ensure that it’s completely dry. Alternatively, you can hang the item in indirect sunlight to dry. This process takes longer, but is also safe for the fabric. Washing Velour by Hand Fill a laundry tub with cool water and mild laundry detergent. Add about 1 tablespoon (15 mL) of laundry detergent to the tub of water, and mix it around to create bubbles in the water. The water should be cool, but not so cold that you can’t hold your hand in the water for a minute or so. If you end up making the water too cold, add a bit of warm water to heat it up quickly without having to drain the tub. Let the fabric soak for 10 minutes in the water. Push the fabric into the water until it’s completely submerged. Leave it in the water to absorb the cleaning detergent and loosen any mats and dirt in the fabric. If the fabric is visibly dirty or dusty, swirl it around in the tub for 1-2 minutes before letting it soak. This will help to remove most of the dirt! Rub the fabric gently with a piece of muslin to remove dirt and lint. After the fabric has absorbed the detergent, take a piece of muslin fabric and rub it over the velour fabric. Be sure not to press too hard, as that can flatten the fibers. For a larger item, you may need 2-3 pieces of muslin to pick up all of the dirt and lint from the fabric. Rinse the fabric with cool water until the water runs clear. Drain the tub or sink and run the fabric under running water. Make sure that every part of the fabric is rinsed thoroughly and that all of the detergent is removed from the velour. Roll the fabric in a clean towel to remove excess moisture. Using a large towel, like a bath towel, blot the water off of the velour. Don’t wring or press the fabric, which can cause damage and flat areas. It’s best to use an older towel because velour can sometimes bleed dye from its fibers when the fabric is wet. Hang the fabric to air dry completely. Let the fabric dry for at least 6 hours on a hanger or clothesline. If you don’t have a clothesline, lay the fabric on a flat surface, and flip it over halfway through the drying time to ensure that it dries evenly on both sides. After 6 hours, touch the fibers to make sure they’re completely dry on the front and back of the fabric. Cleaning Velour Upholstery Vacuum velour upholstery with the brush attachment to remove dirt and mats. Using a back and forth motion, run the brush up and down the fabric while the vacuum is on. If you have a mat in the fabric, try brushing the spot vigorously a few times to loosen it before turning the vacuum on. Many cars are upholstered with velour, and even some couches. It’s easiest to use the brush attachment to reach crevices in these areas before cleaning the fabric. Spray dry shampoo on stains if you only need a spot treatment. Dry shampoo is great for absorbing a variety of stains and marks on velour. Purchase a bottle of the shampoo at the grocery or beauty supply store, and spray it onto the stain. When you’re spraying, hold the bottle close to the stain to make sure it’s concentrated in the one area. Make sure you’re using regular dry shampoo, which should look white when you spray it. Remember to work the dry shampoo into the fabric before applying upholstery cleaner to the area if you plan on doing a deeper clean. Select a velour-safe upholstery cleaner if you’re washing a large area. If you need to clean an entire couch cushion or seat in your car, go to a car repair store and look for cleaner that is safe for velour. Spray the cleaner liberally over the area. If there are any stains, make sure they’re treated first. Then, you can apply the general upholstery cleaner over the stain remover. Let the cleaning agent sit on the fabric for 5 minutes. Whether you’re using an upholstery cleaner or spot treatment, the cleaner has to soak into the fabric. After 5 minutes, you can resume your cleaning. If you’re cleaning a larger area, you may want to spray small areas at a time to prevent the cleaner from drying before you get to that area. Work the cleaner into the fabric with a soft-bristle brush. After 5 minutes, use  the brush from the vacuum or a different brush to gently rub the cleaner into the fabric. Scrub in small circles and focus on small areas at a time. If you’re using the brush from the vacuum, make sure the vacuum is off during this process. Depending on the type of cleaner you use, it might damage the inside of the vacuum. Blot the excess cleaning agent with a clean, dry towel. Once the cleaner is worked into the upholstery, press a towel onto the surface to soak up the cleaner, dirt, and lint. Then, wait for the fabric to air dry completely. Air drying can take up to 12 hours in humid weather, so be patient! Check the fabric with your hand to make sure it’s dry before sitting on the upholstery.",
  "tyn_model":[
    "water",
    "fabric",
    "vacuum",
    "dry shampoo",
    "laundry bag",
    "washing machine",
    "detergent",
    "laundry detergent",
    "towel",
    "upholstery cleaner",
    "dryer",
    "velour",
    "tub",
    "muslin",
    "velour upholstery",
    "cleaner",
    "blankets",
    "mild or gentle laundry detergent",
    "“warm",
    "” and",
    "“gentle",
    "” settings",
    "laundry tub",
    "cleaning detergent",
    "muslin fabric",
    "bath towel",
    "brush",
    "shampoo",
    "general upholstery cleaner",
    "stain remover",
    "soft-bristle brush",
    "cleaning agent"
  ],
  "tyn_section":[

  ]
}