{
  "title":"How to Remove Oil from Wood",
  "url":"https://www.wikihow.com/Remove-Oil-from-Wood",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Stain Removal"
  ],
  "methods":[
    {
      "name":"Removing Oil from Recent Spills",
      "steps":[
        {
          "headline":"Soak up the oil with a paper towel.",
          "description":"Treat oil stains on wood as soon as they occur to prevent the oil from sinking deep into the wood and causing stains. Blot the stain with paper towels, newspaper or blotting paper, pressing the paper firmly until you’re sure you have soaked up the oil. Wear rubber gloves throughout this technique to avoid any skin irritation, especially if you have sensitive skin."
        },
        {
          "headline":"Mix up a mild detergent solution in a bowl.",
          "description":"Place some warm water in a bowl and add some mild detergent. Use your hands to mix the solution and create soapsuds."
        },
        {
          "headline":"Clean the oily area with your solution.",
          "description":"Place some of the soapsuds onto the stained area with a clean cloth and rub onto the affected area. Be gentle enough to avoid scratching the wood, but firm enough to work the suds into the wood grain. For more stubborn or deeper stains, scrub the soapsuds in with a soft brush. Avoid harsher abrasives like steel brushes, as they may scratch your wooden surface."
        },
        {
          "headline":"Rinse the wood with clean water.",
          "description":"Once you have finished cleaning, rinse the area with clean water, or wipe it down with a clean damp cloth. This will remove any remaining oily residue or soapsuds."
        },
        {
          "headline":"Pat dry the wood with a clean cloth or towel.",
          "description":"Drying the wood removes moisture so you are better able to determine if the stain has been removed. Allow the wood to air dry if it is still not completely dry. Once the wood is completely dry, check to see if the stain is still there. If still evident, you’ll need to apply further treatment."
        }
      ]
    },
    {
      "name":"Using Mineral Spirits for Stubborn Oil Stains",
      "steps":[
        {
          "headline":"Apply mineral spirits to the stain.",
          "description":"Dampen one corner of a clean cloth with some mineral spirits. Rub firmly in a circular motion over the stained area in small sections at a time, being careful not to saturate the wood. If the stain is light, the mineral spirits should clear the stain away. Mineral spirits is a solvent commonly used for paint thinning. It is readily available at hardware stores. Mineral spirits is very strong and can cause skin irritation, so be sure to ventilate the room, wear rubber gloves and be very careful in this step. If the stain is particularly stubborn, you may need to repeat this step a few times."
        },
        {
          "headline":"Wash off the mineral spirits with detergent, and pat dry.",
          "description":"Using a clean cloth, wipe off the mineral spirits with a solution of detergent and warm water, rinse with clean water, and then dry with a cloth or towel."
        },
        {
          "headline":"Allow the wood to dry completely.",
          "description":"When the wood is dry you will be able to tell if you have removed the stain. If the mineral spirits have not done the job, you may need to repeat these steps."
        },
        {
          "headline":"Polish the wood with a soft cloth.",
          "description":"Once the surface is dry and the stain has been removed, it’s a good idea to polish the wood to restore its luster. Apply wood polish sparingly with a soft cloth. Rub in a circular motion until all the polish is absorbed by the wood."
        }
      ]
    },
    {
      "name":"Removing Hand Oil from Wooden Furniture",
      "steps":[
        {
          "headline":"Apply a small amount of turpentine to the corner of a white cloth.",
          "description":"Turpentine is a common solvent that can be useful for cleaning oily build up on surfaces. This method will work on all kinds of wood furniture or surfaces that have built up hand oils and dirt, such as cabinets, doors and door frames. Avoid using abrasives like hard brushes or baking soda, as they can damage the finish of the furniture."
        },
        {
          "headline":"Rub the furniture gently with the turpentine in a circular motion.",
          "description":"Rub for a few moments until the built up oil and dirt is removed from the wood. You should see the cloth begin to discolour as it picks up oil and grime."
        },
        {
          "headline":"Clean the area with a damp cloth.",
          "description":"Giving the furniture a final wipe with a clean, damp cloth will remove any remaining turpentine or oily residue from your wooden furniture."
        }
      ]
    }
  ],
  "text":" Removing Oil from Recent Spills Soak up the oil with a paper towel. Treat oil stains on wood as soon as they occur to prevent the oil from sinking deep into the wood and causing stains. Blot the stain with paper towels, newspaper or blotting paper, pressing the paper firmly until you’re sure you have soaked up the oil. Wear rubber gloves throughout this technique to avoid any skin irritation, especially if you have sensitive skin. Mix up a mild detergent solution in a bowl. Place some warm water in a bowl and add some mild detergent. Use your hands to mix the solution and create soapsuds. Clean the oily area with your solution. Place some of the soapsuds onto the stained area with a clean cloth and rub onto the affected area. Be gentle enough to avoid scratching the wood, but firm enough to work the suds into the wood grain. For more stubborn or deeper stains, scrub the soapsuds in with a soft brush. Avoid harsher abrasives like steel brushes, as they may scratch your wooden surface. Rinse the wood with clean water. Once you have finished cleaning, rinse the area with clean water, or wipe it down with a clean damp cloth. This will remove any remaining oily residue or soapsuds. Pat dry the wood with a clean cloth or towel. Drying the wood removes moisture so you are better able to determine if the stain has been removed. Allow the wood to air dry if it is still not completely dry. Once the wood is completely dry, check to see if the stain is still there. If still evident, you’ll need to apply further treatment. Using Mineral Spirits for Stubborn Oil Stains Apply mineral spirits to the stain. Dampen one corner of a clean cloth with some mineral spirits. Rub firmly in a circular motion over the stained area in small sections at a time, being careful not to saturate the wood. If the stain is light, the mineral spirits should clear the stain away. Mineral spirits is a solvent commonly used for paint thinning. It is readily available at hardware stores. Mineral spirits is very strong and can cause skin irritation, so be sure to ventilate the room, wear rubber gloves and be very careful in this step. If the stain is particularly stubborn, you may need to repeat this step a few times. Wash off the mineral spirits with detergent, and pat dry. Using a clean cloth, wipe off the mineral spirits with a solution of detergent and warm water, rinse with clean water, and then dry with a cloth or towel. Allow the wood to dry completely. When the wood is dry you will be able to tell if you have removed the stain. If the mineral spirits have not done the job, you may need to repeat these steps. Polish the wood with a soft cloth. Once the surface is dry and the stain has been removed, it’s a good idea to polish the wood to restore its luster. Apply wood polish sparingly with a soft cloth. Rub in a circular motion until all the polish is absorbed by the wood. Removing Hand Oil from Wooden Furniture Apply a small amount of turpentine to the corner of a white cloth. Turpentine is a common solvent that can be useful for cleaning oily build up on surfaces. This method will work on all kinds of wood furniture or surfaces that have built up hand oils and dirt, such as cabinets, doors and door frames. Avoid using abrasives like hard brushes or baking soda, as they can damage the finish of the furniture. Rub the furniture gently with the turpentine in a circular motion. Rub for a few moments until the built up oil and dirt is removed from the wood. You should see the cloth begin to discolour as it picks up oil and grime. Clean the area with a damp cloth. Giving the furniture a final wipe with a clean, damp cloth will remove any remaining turpentine or oily residue from your wooden furniture.",
  "tyn_model":[
    "mineral spirits",
    "water",
    "turpentine",
    "mild detergent",
    "bowl",
    "detergent",
    "paper towel",
    "paper towels",
    "newspaper",
    "rubber gloves",
    "wood polish",
    "baking soda"
  ],
  "tyn_section":[

  ]
}