{
  "title":"How to Make Jalapeño Popper Egg Rolls",
  "url":"https://www.wikihow.com/Make-Jalape%C3%B1o-Popper-Egg-Rolls",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Snacks",
    "Cheese Party Snacks"
  ],
  "parts":[
    {
      "name":"Making the Jalapeño Poppers",
      "steps":[
        {
          "headline":"Remove the seeds and the ends of the jalapeños.",
          "description":"Set aside for later use."
        },
        {
          "headline":"Mix the three cheeses with the bacon and garlic powder.",
          "description":"In a medium-sized bowl, combine the cream cheese, shredded mozzarella cheese, shredded cheddar cheese, bacon, and garlic powder together with a wooden spoon. Mix well until fully incorporated together."
        },
        {
          "headline":"Season and combine the ingredients once more.",
          "description":"Add a desired amount of kosher salt and black pepper. Mix once more until well-combined."
        },
        {
          "headline":"Stuff the jalapeños with the cheese mixture.",
          "description":"Using a small spoon, scoop the cheese mixture into each jalapeño. Set aside on a plate."
        }
      ]
    },
    {
      "name":"Making the Egg Rolls",
      "steps":[
        {
          "headline":"Put the stuffed jalapeños into the egg roll wrappers.",
          "description":"Place a stuffed jalapeño on an egg roll wrapper. Close the bottom half and then fold over the sides."
        },
        {
          "headline":"Close and seal the egg rolls.",
          "description":"Roll over the egg roll and seal it with a bit of water. Repeat with the rest of the egg rolls and set aside on a plate."
        },
        {
          "headline":"Heat the vegetable oil up until it starts to bubble.",
          "description":"Pour the vegetable oil into a large skillet over medium heat. Allow it to preheat and use when it begins to bubble."
        },
        {
          "headline":"Fry the egg rolls until they are golden brown.",
          "description":"Cook each side for about a minute."
        },
        {
          "headline":"Remove the egg rolls from the oil.",
          "description":"Place them on a plate covered with a napkin."
        },
        {
          "headline":"Serve.",
          "description":"Eat the egg rolls with ranch or ranch dressing on the side. Enjoy!"
        }
      ]
    }
  ],
  "text":" Making the Jalapeño Poppers Remove the seeds and the ends of the jalapeños. Set aside for later use. Mix the three cheeses with the bacon and garlic powder. In a medium-sized bowl, combine the cream cheese, shredded mozzarella cheese, shredded cheddar cheese, bacon, and garlic powder together with a wooden spoon. Mix well until fully incorporated together. Season and combine the ingredients once more. Add a desired amount of kosher salt and black pepper. Mix once more until well-combined. Stuff the jalapeños with the cheese mixture. Using a small spoon, scoop the cheese mixture into each jalapeño. Set aside on a plate. Making the Egg Rolls Put the stuffed jalapeños into the egg roll wrappers. Place a stuffed jalapeño on an egg roll wrapper. Close the bottom half and then fold over the sides. Close and seal the egg rolls. Roll over the egg roll and seal it with a bit of water. Repeat with the rest of the egg rolls and set aside on a plate. Heat the vegetable oil up until it starts to bubble. Pour the vegetable oil into a large skillet over medium heat. Allow it to preheat and use when it begins to bubble. Fry the egg rolls until they are golden brown. Cook each side for about a minute. Remove the egg rolls from the oil. Place them on a plate covered with a napkin. Serve. Eat the egg rolls with ranch or ranch dressing on the side. Enjoy!",
  "tyn_model":[
    "plate",
    "bacon",
    "garlic powder",
    "egg roll",
    "vegetable oil",
    "jalapeño poppers",
    "cream cheese",
    "mozzarella cheese",
    "cheddar cheese",
    "wooden spoon",
    "kosher salt",
    "black pepper",
    "water",
    "large skillet",
    "oil",
    "napkin",
    "ranch or ranch dressing"
  ],
  "tyn_section":[

  ]
}