{
  "title":"How to Play Punch Buggy",
  "url":"https://www.wikihow.com/Play-Punch-Buggy",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "parts":[
    {
      "name":"Playing the Game",
      "steps":[
        {
          "headline":"Identify a “Buggy.”  While you are in the car, keep your eyes focused on the cars that pass by.",
          "description":"You are looking for a “bug” or Volkswagen Beetle. It can be an old or new version, but it should be a VW Beetle. These are the cars that you need to point out. Make sure that you don’t mistake other cars for a “bug.” A VW Bug is a small car that will typically have rounded features, and the VW logo on the back of the car. Remember, you are looking for a car that resembles a traditional Volkswagen Beetle. This does not include all Volkswagen cars. For example, a Volkswagen Cabriolet would not count."
        },
        {
          "headline":"Punch the person closest to you and call out \"Punch Buggy!\"",
          "description":"At this point, you’ve seen a “bug” so now you can gently punch the person next to you. You should punch them in the upper arm. As you punch them, make sure to yell “Punch Buggy.”  This will confirm that you have actually seen a Beetle. When you hit them, don’t be too aggressive. You cannot punch a person back if they say “Punch Buggy” and punch you first. You can call out the color of the “bug” as well. This is not required. This just helps the other person know what type of car you saw. If you go by a Volkswagen dealership, you are not allowed to punch anyone."
        },
        {
          "headline":"Keep score.",
          "description":"You want to make sure that you know who is winning. The best way to do this is to keep score during the duration of the game. Though there are no official rules for Punch Buggy, you can adopt some general guidelines, like what amount of points wins the game. Each proper identification of a bug gives you one point. However, each time you are mistaken, you lose one point. Designate someone to keep score with a pencil and sheet of paper, or on a notepad on a mobile phone."
        },
        {
          "headline":"Be careful.",
          "description":"It is best to avoid punching the driver of the car. You should only punch other passengers in the car. If it is only you and the driver in the car, play a contactless game of Punch Buggy, or save the game for a time when there will be more passengers. Don’t hit anyone harder than they should be hit. Hit lighter if the other player asks you to. Avoid hitting very young players. Tap them lightly, or keep them out of the game."
        }
      ]
    },
    {
      "name":"Learning Extra Rules",
      "steps":[
        {
          "headline":"Call a time-out.",
          "description":"You can pause or stop the game if you feel overwhelmed. All you need to do is ask for a time-out. Just say \"time-out!\" The game will not resume until you say “time in.” You cannot say “Time in - Punch Buggy - Time-out.” Saying this within one sentence will result in a deduction of points.</ref>\nThe amount of points deducted should be decided at the beginning of the game, or by a parent or driver of the car. The deduction is typically 25 points."
        },
        {
          "headline":"Punch twice for a previously called out car.",
          "description":"A car that has been previously called out by another player can’t be called out again. If it is called out, the person that called it the second time should submit to two punches by the player that initially called the “bug.” Another option is to deduct points. If you didn’t hear the initial “Punch Buggy,” you can argue to not have your call held against you. This should be decided by all of the players together."
        },
        {
          "headline":"Deliver the punch within five seconds.",
          "description":"If you call out “Punch Buggy,” you should punch another passenger within five seconds. You forfeit your rights to punch after the five seconds is over. This rule applies to all players. The other players have the right to attempt to dodge the punch within the five second span. Since the game has no official rules, you can choose to expand or shorter the amount of time to deliver a punch once “Punch Buggy” is called. A punch that is dodged results in no points for the player that called the “Punch Buggy.”"
        },
        {
          "headline":"Call the same bug after a stop.",
          "description":"A VW bug that has been seen before can be called again thirty minutes later if the car has been stopped in the intervening time between the first and second call. This is because the car being put in the park position cancels out any cars that have been previously called. The car, however, must come to a full stop, not just a temporary stop at a drive-thru. It can be decided that a car is eligible in less than thirty minutes if everyone agrees on that rule."
        },
        {
          "headline":"Avoid hitting unwilling passengers.",
          "description":"The driver should be exempt from the game, as well as any other passengers that do not want to participate. Decide who is playing before the game starts. Punching a passenger that is not playing can result in a deduction of points, or a returned punch. The punishment for hitting an unwilling person can be decided by the players."
        }
      ]
    },
    {
      "name":"Selecting Variations",
      "steps":[
        {
          "headline":"Playing with no contact.",
          "description":"Punch Buggy can also be played without the punches. The rules are exactly the same as the punching version of the game, but no contact is allowed. The other player can choose to acknowledge the call by saying something like “I see it,” or simply “okay.” Keep track of the points on a notepad. This version of the game is ideal when there are only two people in the car."
        },
        {
          "headline":"Expanding the type of car.",
          "description":"You can choose to include other types of cars in the game if there aren’t enough VW Beetles on the road. You can choose to limit the allowed car types to “Beetle-like” built cars, like the Hebmuller or Karmann Cabriolet. Or, you can limit the car type to small, compact cars."
        },
        {
          "headline":"Create exemptions from the game.",
          "description":"You can create rules to be exempt from punches in the game. For example, for the first sighting, it can be decided that anyone wearing black socks is exempt from a punch. Change the rule as the game progresses for each sighting. Another exemption can be for anyone who is wearing a green shirt."
        }
      ]
    }
  ],
  "text":" Playing the Game Identify a “Buggy.”  While you are in the car, keep your eyes focused on the cars that pass by. You are looking for a “bug” or Volkswagen Beetle. It can be an old or new version, but it should be a VW Beetle. These are the cars that you need to point out. Make sure that you don’t mistake other cars for a “bug.” A VW Bug is a small car that will typically have rounded features, and the VW logo on the back of the car. Remember, you are looking for a car that resembles a traditional Volkswagen Beetle. This does not include all Volkswagen cars. For example, a Volkswagen Cabriolet would not count. Punch the person closest to you and call out \"Punch Buggy!\" At this point, you’ve seen a “bug” so now you can gently punch the person next to you. You should punch them in the upper arm. As you punch them, make sure to yell “Punch Buggy.”  This will confirm that you have actually seen a Beetle. When you hit them, don’t be too aggressive. You cannot punch a person back if they say “Punch Buggy” and punch you first. You can call out the color of the “bug” as well. This is not required. This just helps the other person know what type of car you saw. If you go by a Volkswagen dealership, you are not allowed to punch anyone. Keep score. You want to make sure that you know who is winning. The best way to do this is to keep score during the duration of the game. Though there are no official rules for Punch Buggy, you can adopt some general guidelines, like what amount of points wins the game. Each proper identification of a bug gives you one point. However, each time you are mistaken, you lose one point. Designate someone to keep score with a pencil and sheet of paper, or on a notepad on a mobile phone. Be careful. It is best to avoid punching the driver of the car. You should only punch other passengers in the car. If it is only you and the driver in the car, play a contactless game of Punch Buggy, or save the game for a time when there will be more passengers. Don’t hit anyone harder than they should be hit. Hit lighter if the other player asks you to. Avoid hitting very young players. Tap them lightly, or keep them out of the game. Learning Extra Rules Call a time-out. You can pause or stop the game if you feel overwhelmed. All you need to do is ask for a time-out. Just say \"time-out!\" The game will not resume until you say “time in.” You cannot say “Time in - Punch Buggy - Time-out.” Saying this within one sentence will result in a deduction of points.</ref>\nThe amount of points deducted should be decided at the beginning of the game, or by a parent or driver of the car. The deduction is typically 25 points. Punch twice for a previously called out car. A car that has been previously called out by another player can’t be called out again. If it is called out, the person that called it the second time should submit to two punches by the player that initially called the “bug.” Another option is to deduct points. If you didn’t hear the initial “Punch Buggy,” you can argue to not have your call held against you. This should be decided by all of the players together. Deliver the punch within five seconds. If you call out “Punch Buggy,” you should punch another passenger within five seconds. You forfeit your rights to punch after the five seconds is over. This rule applies to all players. The other players have the right to attempt to dodge the punch within the five second span. Since the game has no official rules, you can choose to expand or shorter the amount of time to deliver a punch once “Punch Buggy” is called. A punch that is dodged results in no points for the player that called the “Punch Buggy.” Call the same bug after a stop. A VW bug that has been seen before can be called again thirty minutes later if the car has been stopped in the intervening time between the first and second call. This is because the car being put in the park position cancels out any cars that have been previously called. The car, however, must come to a full stop, not just a temporary stop at a drive-thru. It can be decided that a car is eligible in less than thirty minutes if everyone agrees on that rule. Avoid hitting unwilling passengers. The driver should be exempt from the game, as well as any other passengers that do not want to participate. Decide who is playing before the game starts. Punching a passenger that is not playing can result in a deduction of points, or a returned punch. The punishment for hitting an unwilling person can be decided by the players. Selecting Variations Playing with no contact. Punch Buggy can also be played without the punches. The rules are exactly the same as the punching version of the game, but no contact is allowed. The other player can choose to acknowledge the call by saying something like “I see it,” or simply “okay.” Keep track of the points on a notepad. This version of the game is ideal when there are only two people in the car. Expanding the type of car. You can choose to include other types of cars in the game if there aren’t enough VW Beetles on the road. You can choose to limit the allowed car types to “Beetle-like” built cars, like the Hebmuller or Karmann Cabriolet. Or, you can limit the car type to small, compact cars. Create exemptions from the game. You can create rules to be exempt from punches in the game. For example, for the first sighting, it can be decided that anyone wearing black socks is exempt from a punch. Change the rule as the game progresses for each sighting. Another exemption can be for anyone who is wearing a green shirt.",
  "tyn_model":[
    "“punch",
    "“bug",
    "” you",
    "”  ",
    "” or",
    "“time",
    "punches",
    "“buggy",
    "volkswagen beetle",
    "vw beetle",
    "” a",
    "vw bug",
    "” so",
    "beetle",
    "” and",
    "” as",
    "pencil",
    "” saying",
    "punch",
    "” another",
    "” is",
    "” call",
    "“i",
    "“okay",
    "” keep",
    "notepad",
    "“beetle",
    "” built"
  ],
  "tyn_section":[

  ]
}