{
  "title":"How to Observe Variable Stars",
  "url":"https://www.wikihow.com/Observe-Variable-Stars",
  "category_hierarchy":[
    "Hobbies and Crafts"
  ],
  "parts":[
    {
      "name":"Finding Variable Stars",
      "steps":[
        {
          "headline":"Go out stargazing.",
          "description":"It sounds obvious, but this will be easier if you go out a few times and familiarise yourself with the stars and constellations."
        },
        {
          "headline":"Identify a star that you want to observe.",
          "description":"Decent variable stars have been studied for hundreds of years. Algol, Mira and Delta Cephei (δ Cep) are all good (if common) choices. For this article, we're going to be observing δ Cep."
        },
        {
          "headline":"Find a couple of non-variable stars (guide stars) near your star.",
          "description":"This works with one, but two is better, and three or more (if possible) is even better. These stars should be of a similar brightness to the star you are observing. For δ Cep, you can use ζ Cep, which is slightly brighter than δ Cep at max brightness, and ε Cep, which is slightly brighter than δ Cep at min brightness."
        },
        {
          "headline":"Compare how bright the variable star is to the guide stars every night.",
          "description":"You should see it change brightness over time. δ Cep changes on a constant 5.37 day period."
        }
      ]
    },
    {
      "name":"Recording Your Observations",
      "steps":[
        {
          "headline":"Get yourself a small notebook and a pencil.",
          "description":"If you need a flashlight, place a red filter over the top of the lens when the light shines through; using a flashlight without doing this will ruin your night vision and make observation of these stars seem impossible."
        },
        {
          "headline":"At the top, write down the name of the star you are observing.",
          "description":"If you want, write down it's co-ordinates and how much it is meant to vary by. You can find the magnitudes quite easily by searching for the star on Wikipedia."
        },
        {
          "headline":"Underneath, write down your guide stars.",
          "description":"Again, you can write down their positions and brightness."
        },
        {
          "headline":"Every night, record how bright your target star is compared to the guide stars.",
          "description":"Write down the date and time as well, so you know when you took the observation."
        },
        {
          "headline":"Try drawing a light curve.",
          "description":"This is a graph of how your star varies over time. A light curve can help you to identify what type of variable star you are observing. If your star has regular variations, it can help you predict how bright it is going to be on the next night."
        },
        {
          "headline":"Prepare to take lots of observations.",
          "description":"δ Cep varies through visible brightness over 5.37 days, so it is quite easy to observe. Mira varies on a 332 day period, and most of the time it requires a telescope to see, so it requires drastically more observations."
        }
      ]
    },
    {
      "name":"Identifying What Type of Variable You are Observing",
      "steps":[
        {
          "headline":"Understand the main types of variable star.",
          "description":"These types generally have regular and predictable variations. Cepheid variables have well-defined, stable periods and amplitudes. They oscillate between fixed maxima and minima, and take a fixed amount of time to do it. Cepheids can have periods between 1 and 50 days. They have something called a period-luminosity relationship: how long it takes to complete one cycle depends on the intrinsic brightness of the star. This makes it possible to calculate how far away the star is. RR Lyrae variables are similar to Cepheids, but they are dimmer, and have smaller periods and amplitudes. They follow a period-luminosity relationship in the infrared, not in visible light. Mira variables are red in colour, and have long periods, over 100 days, and very large variations. The maxima and minima also vary, so one cycle can be slightly brighter or dimmer than another. Mira variables are typically very dim, and need a telescope to see. Algol variables are a type of binary star. On occasion, the dimmer star eclipses the brighter one, causing the brightness to drop for a short period. Slow irregular variables, as the name suggests, vary slowly and irregularly. These stars don't have a period. They are typically large, red stars at the end of their life, which causes them to flicker irregularly. TX Piscium is a slow irregular variable."
        },
        {
          "headline":"Understand the rarer types of variable stars.",
          "description":"These typically need a telescope or some binoculars to see. Also, they don't usually vary all the time, but spend most of their time at one brightness, and rarely and unpredictably change in brightness. they are sometimes known, as a whole, as eruptive variables. Flare stars spend most of their time at a dim brightness, and occasionally, for a few minutes, jump up in brightness. It is believed that this is caused by a similar mechanism to solar flares. Proxima Centauri and Barnard's star are flare stars. Recurrent novae are similar to flare stars, but they have much greater jumps in brightness, and flare-ups are a lot rarer. T Coronae Borealis, the Blaze Star, is a recurrent nova. It has been seen to flare twice, once in 1886 and once in 1946. Some activity was seen in 2016 that suggests it may flare again soon. R Coronae Borealis variables spend most of their time at maximum brightness. At unpredictable intervals, their brightness plummets, then slowly works its way back up. This is caused by carbon dust forming into soot, blotting out the light from the star. Supernovae are rare, transient events caused by exploding stars. Supernovae are incredibly bright, but seeing one with the naked eye can be a once in a lifetime event."
        }
      ]
    }
  ],
  "text":" Finding Variable Stars Go out stargazing. It sounds obvious, but this will be easier if you go out a few times and familiarise yourself with the stars and constellations. Identify a star that you want to observe. Decent variable stars have been studied for hundreds of years. Algol, Mira and Delta Cephei (δ Cep) are all good (if common) choices. For this article, we're going to be observing δ Cep. Find a couple of non-variable stars (guide stars) near your star. This works with one, but two is better, and three or more (if possible) is even better. These stars should be of a similar brightness to the star you are observing. For δ Cep, you can use ζ Cep, which is slightly brighter than δ Cep at max brightness, and ε Cep, which is slightly brighter than δ Cep at min brightness. Compare how bright the variable star is to the guide stars every night. You should see it change brightness over time. δ Cep changes on a constant 5.37 day period. Recording Your Observations Get yourself a small notebook and a pencil. If you need a flashlight, place a red filter over the top of the lens when the light shines through; using a flashlight without doing this will ruin your night vision and make observation of these stars seem impossible. At the top, write down the name of the star you are observing. If you want, write down it's co-ordinates and how much it is meant to vary by. You can find the magnitudes quite easily by searching for the star on Wikipedia. Underneath, write down your guide stars. Again, you can write down their positions and brightness. Every night, record how bright your target star is compared to the guide stars. Write down the date and time as well, so you know when you took the observation. Try drawing a light curve. This is a graph of how your star varies over time. A light curve can help you to identify what type of variable star you are observing. If your star has regular variations, it can help you predict how bright it is going to be on the next night. Prepare to take lots of observations. δ Cep varies through visible brightness over 5.37 days, so it is quite easy to observe. Mira varies on a 332 day period, and most of the time it requires a telescope to see, so it requires drastically more observations. Identifying What Type of Variable You are Observing Understand the main types of variable star. These types generally have regular and predictable variations. Cepheid variables have well-defined, stable periods and amplitudes. They oscillate between fixed maxima and minima, and take a fixed amount of time to do it. Cepheids can have periods between 1 and 50 days. They have something called a period-luminosity relationship: how long it takes to complete one cycle depends on the intrinsic brightness of the star. This makes it possible to calculate how far away the star is. RR Lyrae variables are similar to Cepheids, but they are dimmer, and have smaller periods and amplitudes. They follow a period-luminosity relationship in the infrared, not in visible light. Mira variables are red in colour, and have long periods, over 100 days, and very large variations. The maxima and minima also vary, so one cycle can be slightly brighter or dimmer than another. Mira variables are typically very dim, and need a telescope to see. Algol variables are a type of binary star. On occasion, the dimmer star eclipses the brighter one, causing the brightness to drop for a short period. Slow irregular variables, as the name suggests, vary slowly and irregularly. These stars don't have a period. They are typically large, red stars at the end of their life, which causes them to flicker irregularly. TX Piscium is a slow irregular variable. Understand the rarer types of variable stars. These typically need a telescope or some binoculars to see. Also, they don't usually vary all the time, but spend most of their time at one brightness, and rarely and unpredictably change in brightness. they are sometimes known, as a whole, as eruptive variables. Flare stars spend most of their time at a dim brightness, and occasionally, for a few minutes, jump up in brightness. It is believed that this is caused by a similar mechanism to solar flares. Proxima Centauri and Barnard's star are flare stars. Recurrent novae are similar to flare stars, but they have much greater jumps in brightness, and flare-ups are a lot rarer. T Coronae Borealis, the Blaze Star, is a recurrent nova. It has been seen to flare twice, once in 1886 and once in 1946. Some activity was seen in 2016 that suggests it may flare again soon. R Coronae Borealis variables spend most of their time at maximum brightness. At unpredictable intervals, their brightness plummets, then slowly works its way back up. This is caused by carbon dust forming into soot, blotting out the light from the star. Supernovae are rare, transient events caused by exploding stars. Supernovae are incredibly bright, but seeing one with the naked eye can be a once in a lifetime event.",
  "tyn_model":[
    "δ cep",
    "mira",
    "telescope",
    "stars",
    "algol",
    "flashlight",
    "supernovae",
    "ζ cep",
    "ε cep",
    "notebook",
    "pencil",
    "cepheid",
    "cepheids",
    "star",
    "binoculars",
    "solar flares",
    "barnard's star",
    "carbon dust"
  ],
  "tyn_section":[

  ]
}