{
  "title":"How to Reduce Mold Spores in the Air",
  "url":"https://www.wikihow.com/Reduce-Mold-Spores-in-the-Air",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Mold and Mildew Treatment"
  ],
  "methods":[
    {
      "name":"Purifying the Air in Your Home",
      "steps":[
        {
          "headline":"Use mold remover to kill visible spots of mold.",
          "description":"Mold spores in the air are often directly caused by mold growing inside your home. By eliminating spots of visible mold, you will significantly reduce the amount of invisible mold spores in the air. To identify visible mold, look for fuzzy stains that are black, green, or white in color, in enclosed spaces and rooms with a lot of moisture, such as the basement. Use sprayable mold remover to kill mold on hard surfaces, such as glass or tile. For mold on surfaces that are more difficult to clean, such as drywall, consider seeking professional help."
        },
        {
          "headline":"Place air purifiers throughout your home to kill mold in the air.",
          "description":"The only way to directly kill mold spores in the air is to use an air purifier. For best results, place purifiers in each room of your house to ensure maximum efficiency in killing the spores. You can get a quality air purifier at any home improvement store and at most mass retailers. Closely follow the instructions on the air purifier for effective results. Be sure to use air purifiers with HEPA (high efficiency particulate air) filters, as these capture more than 99% of particles in the air. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAmy Mikhaiel\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Business Owner & Former Executive Housekeeper\t\t\t\t\t\t\t\tAmy Mikhaiel is a cleaning guru and the CEO of Amy's Angels Cleaning Inc., a residential and commercial cleaning company in Los Angeles, California. Amy's Angels was voted Best Cleaning Service by Angie’s Lists in 2018 and was the most requested cleaning company by Yelp in 2019. Amy's mission is to help women achieve their financial goals by establishing empowerment through cleaning. Amy Mikhaiel\t\t\tCleaning Business Owner & Former Executive Housekeeper\t\t\t\tStart by cleaning visible mold and then use an air purifier. You can use Bar Keeper's Friend on any visible mold you find. Once you've removed the mold, set up an air purifier. Mold is very dangerous, so you should always take of visible mold and the source of the mold."
        },
        {
          "headline":"Install filters on air-conditioning units and windows.",
          "description":"If mold spores in the air aren’t being caused by mold growth in the house, they are likely coming in from outside. Place HEPA filters on your air conditioners and windows to prevent outside spores from getting into your house. Be sure to also keep the air conditioner’s drip pans and drain lines clean and dry so that mold does not grow in them. Pay special attention to your windows if you live in a humid area. Poorly insulated windows can pick up a great deal of condensation, which makes them very hospitable for mold, while open windows allow easy indoor access for mold spores from outside."
        }
      ]
    },
    {
      "name":"Addressing Problem Areas of Your Home",
      "steps":[
        {
          "headline":"Keep your basement, kitchen, and bathroom as dry as possible.",
          "description":"Damper areas of your house are more likely to see mold growth than others. Monitor these areas for signs of excess water, such as leaks and flooding, and take rapid steps to address these issues to prevent mold growth. Make sure any spills or leaks you come across are dried within 24 to 48 hours. Mold can grow quickly in spaces with even slight amounts of excess moisture. In the kitchen, mold is particularly likely to grow in refrigerator drip pans, door seals, and garbage pans. Watch out for mold growth in these rooms on bedding, clothes, and old papers, as these are common places to find mold. Regularly check under sinks for leaky pipes, as these will create wet environments amenable to mold growth."
        },
        {
          "headline":"Avoid installing carpet in the basement.",
          "description":"Basements are often one of the dampest rooms in the house and as such are a consistent problem area when it comes to mold. Keep carpeting out of the basement to prevent moisture build-up and mold growth in the flooring. Consider using linoleum or concrete flooring in the basement, as these materials don’t hold in as much moisture as carpeting does."
        },
        {
          "headline":"Keep gutters clean of organic debris and decomposing matter.",
          "description":"Organic materials like dead branches and leaves are particularly favorable for mold growth. Keeping your gutters clean will prevent these from accumulating and spreading mold into your house. Be sure that water is able to flow freely through your gutters; mold in your house can easily be the result of a roof leak caused by clogged or damaged gutters. Clean and inspect your gutters regularly, especially after big storms."
        }
      ]
    },
    {
      "name":"Reducing Moisture in Your Home",
      "steps":[
        {
          "headline":"Use dehumidifiers to keep indoor moisture levels low.",
          "description":"As mold thrives in humid environments, eliminating excess moisture in your house goes a long way towards reducing mold spores in the air. Place dehumidifiers in problem areas or rooms with visible mold to reduce or prevent mold growth. If you’re unsure which rooms the mold is coming from, you can also use a whole house dehumidifier linked to your central air system. Set dehumidifiers to 50% humidity or lower; anything higher will encourage mold growth."
        },
        {
          "headline":"Dry wet areas as soon as possible.",
          "description":"In addition to treating large spills, leaks, and floods, take steps to get rid of excess moisture following everyday activities like bathing or dishwashing, as even small amounts of water can enable mold growth. Dry bathroom floors and walls after taking a shower. Don’t leave wet clothes in the washing machine after they’ve been cleaned, and don’t leave wet items lying around the house. Keep your eye out for condensation on windows; dry them immediately and determine the cause of the condensation to prevent mold growth."
        },
        {
          "headline":"Use exhaust fans to keep your home ventilated and remove excess moisture.",
          "description":"Place exhaust fans in the kitchen and bathroom to vent moisture in these problem areas, making sure to place the fans so that they vent outside of the home. Make especially sure appliances that produce moisture, such as clothes dryers and stoves, are ventilated, and that they do not vent into your attic. Clean exhaust fans once every 3 months. Opening a window when cooking or showering will also help to vent excess moisture."
        },
        {
          "headline":"Leave wet shoes and clothes outside to dry.",
          "description":"If you’re entering your home after walking in the rain or through wet grass, don’t place wet shoes or clothes in the closet. Leave them outside until their dry, then make sure they are clean and mold-free before bringing them into the house. For best results, hang these items to dry in areas with good air circulation, if possible."
        }
      ]
    }
  ],
  "text":" Purifying the Air in Your Home Use mold remover to kill visible spots of mold. Mold spores in the air are often directly caused by mold growing inside your home. By eliminating spots of visible mold, you will significantly reduce the amount of invisible mold spores in the air. To identify visible mold, look for fuzzy stains that are black, green, or white in color, in enclosed spaces and rooms with a lot of moisture, such as the basement. Use sprayable mold remover to kill mold on hard surfaces, such as glass or tile. For mold on surfaces that are more difficult to clean, such as drywall, consider seeking professional help. Place air purifiers throughout your home to kill mold in the air. The only way to directly kill mold spores in the air is to use an air purifier. For best results, place purifiers in each room of your house to ensure maximum efficiency in killing the spores. You can get a quality air purifier at any home improvement store and at most mass retailers. Closely follow the instructions on the air purifier for effective results. Be sure to use air purifiers with HEPA (high efficiency particulate air) filters, as these capture more than 99% of particles in the air. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAmy Mikhaiel\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Business Owner & Former Executive Housekeeper\t\t\t\t\t\t\t\tAmy Mikhaiel is a cleaning guru and the CEO of Amy's Angels Cleaning Inc., a residential and commercial cleaning company in Los Angeles, California. Amy's Angels was voted Best Cleaning Service by Angie’s Lists in 2018 and was the most requested cleaning company by Yelp in 2019. Amy's mission is to help women achieve their financial goals by establishing empowerment through cleaning. Amy Mikhaiel\t\t\tCleaning Business Owner & Former Executive Housekeeper\t\t\t\tStart by cleaning visible mold and then use an air purifier. You can use Bar Keeper's Friend on any visible mold you find. Once you've removed the mold, set up an air purifier. Mold is very dangerous, so you should always take of visible mold and the source of the mold. Install filters on air-conditioning units and windows. If mold spores in the air aren’t being caused by mold growth in the house, they are likely coming in from outside. Place HEPA filters on your air conditioners and windows to prevent outside spores from getting into your house. Be sure to also keep the air conditioner’s drip pans and drain lines clean and dry so that mold does not grow in them. Pay special attention to your windows if you live in a humid area. Poorly insulated windows can pick up a great deal of condensation, which makes them very hospitable for mold, while open windows allow easy indoor access for mold spores from outside. Addressing Problem Areas of Your Home Keep your basement, kitchen, and bathroom as dry as possible. Damper areas of your house are more likely to see mold growth than others. Monitor these areas for signs of excess water, such as leaks and flooding, and take rapid steps to address these issues to prevent mold growth. Make sure any spills or leaks you come across are dried within 24 to 48 hours. Mold can grow quickly in spaces with even slight amounts of excess moisture. In the kitchen, mold is particularly likely to grow in refrigerator drip pans, door seals, and garbage pans. Watch out for mold growth in these rooms on bedding, clothes, and old papers, as these are common places to find mold. Regularly check under sinks for leaky pipes, as these will create wet environments amenable to mold growth. Avoid installing carpet in the basement. Basements are often one of the dampest rooms in the house and as such are a consistent problem area when it comes to mold. Keep carpeting out of the basement to prevent moisture build-up and mold growth in the flooring. Consider using linoleum or concrete flooring in the basement, as these materials don’t hold in as much moisture as carpeting does. Keep gutters clean of organic debris and decomposing matter. Organic materials like dead branches and leaves are particularly favorable for mold growth. Keeping your gutters clean will prevent these from accumulating and spreading mold into your house. Be sure that water is able to flow freely through your gutters; mold in your house can easily be the result of a roof leak caused by clogged or damaged gutters. Clean and inspect your gutters regularly, especially after big storms. Reducing Moisture in Your Home Use dehumidifiers to keep indoor moisture levels low. As mold thrives in humid environments, eliminating excess moisture in your house goes a long way towards reducing mold spores in the air. Place dehumidifiers in problem areas or rooms with visible mold to reduce or prevent mold growth. If you’re unsure which rooms the mold is coming from, you can also use a whole house dehumidifier linked to your central air system. Set dehumidifiers to 50% humidity or lower; anything higher will encourage mold growth. Dry wet areas as soon as possible. In addition to treating large spills, leaks, and floods, take steps to get rid of excess moisture following everyday activities like bathing or dishwashing, as even small amounts of water can enable mold growth. Dry bathroom floors and walls after taking a shower. Don’t leave wet clothes in the washing machine after they’ve been cleaned, and don’t leave wet items lying around the house. Keep your eye out for condensation on windows; dry them immediately and determine the cause of the condensation to prevent mold growth. Use exhaust fans to keep your home ventilated and remove excess moisture. Place exhaust fans in the kitchen and bathroom to vent moisture in these problem areas, making sure to place the fans so that they vent outside of the home. Make especially sure appliances that produce moisture, such as clothes dryers and stoves, are ventilated, and that they do not vent into your attic. Clean exhaust fans once every 3 months. Opening a window when cooking or showering will also help to vent excess moisture. Leave wet shoes and clothes outside to dry. If you’re entering your home after walking in the rain or through wet grass, don’t place wet shoes or clothes in the closet. Leave them outside until their dry, then make sure they are clean and mold-free before bringing them into the house. For best results, hang these items to dry in areas with good air circulation, if possible.",
  "tyn_model":[
    "air purifier",
    "water",
    "dehumidifiers",
    "exhaust fans",
    "mold remover",
    "air purifiers",
    "purifiers",
    "home improvement store",
    "hepa (",
    "high efficiency particulate air) filters",
    "cleaning guru",
    "amy's angels cleaning inc.",
    "bar keeper's friend",
    "filters",
    "air-conditioning",
    "hepa filters",
    "air conditioners",
    "air conditioner",
    "mold",
    "sinks",
    "carpet",
    "linoleum",
    "dehumidifier",
    "clothes dryers"
  ],
  "tyn_section":[

  ]
}