{
  "title":"How to Start Leatherworking",
  "url":"https://www.wikihow.com/Start-Leatherworking",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Leatherworking"
  ],
  "parts":[
    {
      "name":"Picking out a Leatherwork Project",
      "steps":[
        {
          "headline":"Start a leatherwork belt for a straightforward project.",
          "description":"Belts are a common, everyday accessory, and a great project to begin leatherworking. They have a relatively simple design, and don’t even require learning a saddle stitch. A belt leatherwork project will take an hour or two at most."
        },
        {
          "headline":"Make a phone case for an introduction to leatherwork skills.",
          "description":"A phone case is a very simple project option for starting leatherwork. It uses a few common and basic leatherwork skills such as cutting, gluing, and stitching the leather. A phone case can also be a thoughtful, handmade gift."
        },
        {
          "headline":"Create a coin purse for a project that doesn’t require gluing.",
          "description":"A coin purse is an easy, beginners leatherwork project which looks impressive too. This project only requires folding, cutting, and sewing the leather."
        }
      ]
    },
    {
      "name":"Learning the Basic Skills for Leatherwork",
      "steps":[
        {
          "headline":"Learn how to cut leather.",
          "description":"Most leatherwork projects will involve cutting the leather at some point. Trace the outline of the project onto the leather using a ruler and scratch awl to scribe an outline for cutting. Then trace over each line with a sharp knife (such as a rotary cutter), holding the blade steady with a ruler. Make sure that the ruler you are using is thick and sturdy, so that it doesn’t slip when cutting the leather."
        },
        {
          "headline":"Practice gluing leather pieces together.",
          "description":"Simply sandpaper down the leather softly where the glue will be. Then put glue on the leather, and use an edge of wax paper to make sure it’s in a straight line. Use binder clips to hold the glued edges of the leather together. Smoothing the leather with sandpaper beforehand makes the glue stick more effectively. The wax paper also protects the rest of the leather from the glue. You can place a cloth beneath the binder clips if you are worried that they will dent the leather."
        },
        {
          "headline":"Study up on sewing a saddle stitch.",
          "description":"The basic and foundation stitch for leatherwork is the saddle stitch. Almost every project will call for a this type of stitch to sew it together, which involves using a diamond awl and two needles. It may seem complicated at first, but you will get the hang of it in no time."
        },
        {
          "headline":"Work on finishing the leather edges.",
          "description":"Leather projects with a smooth, finished edge look complete and sophisticated. Simply trim with scissors or a razor to remove the fuzzy texture that sticks out over the edge of your project. Rub Gum Tragacanth along the edges with a rag to give a wet look, and then use cotton tips to apply a flexible sealant, such as Edge Kote, to the edges. If you accidentally get Gum Tragacanth or Edge Kote on any part of the leather aside from the edge, quickly remove it with a paper towel."
        }
      ]
    },
    {
      "name":"Having the Right Tools for Leatherwork",
      "steps":[
        {
          "headline":"Pick out the leather for your project.",
          "description":"You can buy leather online or from a physical store, such as Tandy Leather Factory. Start with purchasing cheap leather while you are working on your confidence and leatherwork skills."
        },
        {
          "headline":"Find a clean, sharp knife.",
          "description":"Cutting is the most common leatherwork skill, and requires a good knife to get it right. A cutting knife with a medium sized blade is ideal for small cuts, while a larger utility knife makes cutting the majority of the pattern easier. A freshly sharpened knife works best for leatherwork, as this will make sure the cuts you make are clean."
        },
        {
          "headline":"Get a needle and thread.",
          "description":"Many leatherwork projects require at least some form of stitching. You can purchase needles and thread from either craft or specialty leather stores. Thick, triangular needles, and black or brown waxed thread work best for most beginner projects."
        },
        {
          "headline":"Acquire a hole punch.",
          "description":"For leatherwork projects such as belts and dog collars, a hole punch is essential. This will ensure that your project has clean, neat holes to work with, and that you can easily create a variety of different sizes."
        },
        {
          "headline":"Purchase a leatherwork awl.",
          "description":"An awl will neatly pierce through heavy materials such as leather, so that you can stitch it together. They also help immensely to evenly space and tidy up your stitching. A diamond shaped sewing awl is called for in many leatherwork projects."
        }
      ]
    }
  ],
  "text":" Picking out a Leatherwork Project Start a leatherwork belt for a straightforward project. Belts are a common, everyday accessory, and a great project to begin leatherworking. They have a relatively simple design, and don’t even require learning a saddle stitch. A belt leatherwork project will take an hour or two at most. Make a phone case for an introduction to leatherwork skills. A phone case is a very simple project option for starting leatherwork. It uses a few common and basic leatherwork skills such as cutting, gluing, and stitching the leather. A phone case can also be a thoughtful, handmade gift. Create a coin purse for a project that doesn’t require gluing. A coin purse is an easy, beginners leatherwork project which looks impressive too. This project only requires folding, cutting, and sewing the leather. Learning the Basic Skills for Leatherwork Learn how to cut leather. Most leatherwork projects will involve cutting the leather at some point. Trace the outline of the project onto the leather using a ruler and scratch awl to scribe an outline for cutting. Then trace over each line with a sharp knife (such as a rotary cutter), holding the blade steady with a ruler. Make sure that the ruler you are using is thick and sturdy, so that it doesn’t slip when cutting the leather. Practice gluing leather pieces together. Simply sandpaper down the leather softly where the glue will be. Then put glue on the leather, and use an edge of wax paper to make sure it’s in a straight line. Use binder clips to hold the glued edges of the leather together. Smoothing the leather with sandpaper beforehand makes the glue stick more effectively. The wax paper also protects the rest of the leather from the glue. You can place a cloth beneath the binder clips if you are worried that they will dent the leather. Study up on sewing a saddle stitch. The basic and foundation stitch for leatherwork is the saddle stitch. Almost every project will call for a this type of stitch to sew it together, which involves using a diamond awl and two needles. It may seem complicated at first, but you will get the hang of it in no time. Work on finishing the leather edges. Leather projects with a smooth, finished edge look complete and sophisticated. Simply trim with scissors or a razor to remove the fuzzy texture that sticks out over the edge of your project. Rub Gum Tragacanth along the edges with a rag to give a wet look, and then use cotton tips to apply a flexible sealant, such as Edge Kote, to the edges. If you accidentally get Gum Tragacanth or Edge Kote on any part of the leather aside from the edge, quickly remove it with a paper towel. Having the Right Tools for Leatherwork Pick out the leather for your project. You can buy leather online or from a physical store, such as Tandy Leather Factory. Start with purchasing cheap leather while you are working on your confidence and leatherwork skills. Find a clean, sharp knife. Cutting is the most common leatherwork skill, and requires a good knife to get it right. A cutting knife with a medium sized blade is ideal for small cuts, while a larger utility knife makes cutting the majority of the pattern easier. A freshly sharpened knife works best for leatherwork, as this will make sure the cuts you make are clean. Get a needle and thread. Many leatherwork projects require at least some form of stitching. You can purchase needles and thread from either craft or specialty leather stores. Thick, triangular needles, and black or brown waxed thread work best for most beginner projects. Acquire a hole punch. For leatherwork projects such as belts and dog collars, a hole punch is essential. This will ensure that your project has clean, neat holes to work with, and that you can easily create a variety of different sizes. Purchase a leatherwork awl. An awl will neatly pierce through heavy materials such as leather, so that you can stitch it together. They also help immensely to evenly space and tidy up your stitching. A diamond shaped sewing awl is called for in many leatherwork projects.",
  "tyn_model":[
    "knife",
    "phone case",
    "ruler",
    "glue",
    "thread",
    "coin purse",
    "sandpaper",
    "wax paper",
    "binder clips",
    "gum tragacanth",
    "edge kote",
    "needles",
    "hole punch",
    "leatherwork belt",
    "belts",
    "belt",
    "scratch awl",
    "rotary cutter",
    "cloth",
    "diamond awl",
    "scissors",
    "razor",
    "rag",
    "paper towel",
    "leather",
    "cutting knife",
    "needle",
    "leatherwork awl",
    "awl",
    "sewing awl"
  ],
  "tyn_section":[

  ]
}