{
  "title":"How to Hide Plug Sockets",
  "url":"https://www.wikihow.com/Hide-Plug-Sockets",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Electrical Maintenance",
    "Electrical Safety"
  ],
  "methods":[
    {
      "name":"Covering Plug Sockets",
      "steps":[
        {
          "headline":"Conceal the socket with a plant.",
          "description":"Place a large houseplant in front of a plug socket located near the floor, or a large, opaque vase in front of a socket on a table or kitchen worktop."
        },
        {
          "headline":"Store kitchen equipment in front of a kitchen socket.",
          "description":"If you have an attractive piece of kitchenware, you could store it in front of the socket: for example, simply lean a chopping board against the wall. Or if there’s a particular socket you tend to use for a given appliance, like a coffee-maker or stand mixer, simply keep the appliance in front of the socket (with the cable neatly coiled up)."
        },
        {
          "headline":"Hang a painting in front of the socket.",
          "description":"Fit hinges to a framed picture, then screw the hinges to the wall, so the socket is hidden from sight but you can still access it if you need to use it."
        },
        {
          "headline":"Buy furniture designed to conceal electronics.",
          "description":"Furniture stores are increasingly meeting the demand to keep plug sockets out of sight. You can buy open-backed cabinets to mount over a plug socket (particularly useful to hold your TV), and boxes designed to conceal both power strips and cables."
        },
        {
          "headline":"Turn a cardboard box into a socket cover or docking station.",
          "description":"If you don’t have a suitable drawer to contain your power strip and charging electronics, you can make one yourself by cutting a cardboard box to fit. Find a box that is slightly longer than your power strip (a box file from an office supplies store would be great). Use a box-cutter or sturdy scissors to cut a slot in each end of the box large enough to run cables through. Then simply place the power strip inside."
        },
        {
          "headline":"Place power strips in a drawer.",
          "description":"If you want to conceal an inconveniently-placed plug socket but still have a lot of devices to charge, you could plug a power strip into the socket, run it into the back of a unit of drawers, then place the unit in front of the socket. Then you can plug all your devices into the power strip and close the drawer to keep things tidy. This is a great way to keep your office, living-room or bedside area tidy."
        }
      ]
    },
    {
      "name":"Camouflaging Plug Sockets",
      "steps":[
        {
          "headline":"Match sockets to your decor.",
          "description":"You can order socket plates that either match the wall behind them or otherwise complement your color scheme, such as mirrored plate covers for the bathroom or brown covers against a wooden surface. Stainless steel socket plates can look stylish in the kitchen, particularly if they match your appliances."
        },
        {
          "headline":"Work the sockets into the room’s design.",
          "description":"You could cover sockets in wallpaper so that they are camouflaged in the pattern. Or in a tiled bathroom, sockets roughly the same size and orientation as your tiles (for example a horizontal, rectangular socket against horizontal, rectangular tiles) will not stand out."
        },
        {
          "headline":"Paint the outlet plate.",
          "description":"Turn off the power, remove the cover plates, with a screwdriver, and ensure that the uncovered outlets are not left unattended (especially if you have children or pets in the house). Clean and dry the outlet covers. Use a small brush to apply a paint that is labeled as being appropriate for use on plastic: do not use spray paint. Make sure the plate is completely dry before you replace the plate on the wall. You can even find tutorials on YouTube for using trompe l’oeil effects to mimic the surface of your tiles."
        },
        {
          "headline":"Disguise a plug socket with art.",
          "description":"Put together a collection of pictures, photographs or postcards of different sizes, in mismatching frames. Surround the socket with a gallery wall of mix and match framed art: the socket will be hidden in plain sight."
        }
      ]
    }
  ],
  "text":" Covering Plug Sockets Conceal the socket with a plant. Place a large houseplant in front of a plug socket located near the floor, or a large, opaque vase in front of a socket on a table or kitchen worktop. Store kitchen equipment in front of a kitchen socket. If you have an attractive piece of kitchenware, you could store it in front of the socket: for example, simply lean a chopping board against the wall. Or if there’s a particular socket you tend to use for a given appliance, like a coffee-maker or stand mixer, simply keep the appliance in front of the socket (with the cable neatly coiled up). Hang a painting in front of the socket. Fit hinges to a framed picture, then screw the hinges to the wall, so the socket is hidden from sight but you can still access it if you need to use it. Buy furniture designed to conceal electronics. Furniture stores are increasingly meeting the demand to keep plug sockets out of sight. You can buy open-backed cabinets to mount over a plug socket (particularly useful to hold your TV), and boxes designed to conceal both power strips and cables. Turn a cardboard box into a socket cover or docking station. If you don’t have a suitable drawer to contain your power strip and charging electronics, you can make one yourself by cutting a cardboard box to fit. Find a box that is slightly longer than your power strip (a box file from an office supplies store would be great). Use a box-cutter or sturdy scissors to cut a slot in each end of the box large enough to run cables through. Then simply place the power strip inside. Place power strips in a drawer. If you want to conceal an inconveniently-placed plug socket but still have a lot of devices to charge, you could plug a power strip into the socket, run it into the back of a unit of drawers, then place the unit in front of the socket. Then you can plug all your devices into the power strip and close the drawer to keep things tidy. This is a great way to keep your office, living-room or bedside area tidy. Camouflaging Plug Sockets Match sockets to your decor. You can order socket plates that either match the wall behind them or otherwise complement your color scheme, such as mirrored plate covers for the bathroom or brown covers against a wooden surface. Stainless steel socket plates can look stylish in the kitchen, particularly if they match your appliances. Work the sockets into the room’s design. You could cover sockets in wallpaper so that they are camouflaged in the pattern. Or in a tiled bathroom, sockets roughly the same size and orientation as your tiles (for example a horizontal, rectangular socket against horizontal, rectangular tiles) will not stand out. Paint the outlet plate. Turn off the power, remove the cover plates, with a screwdriver, and ensure that the uncovered outlets are not left unattended (especially if you have children or pets in the house). Clean and dry the outlet covers. Use a small brush to apply a paint that is labeled as being appropriate for use on plastic: do not use spray paint. Make sure the plate is completely dry before you replace the plate on the wall. You can even find tutorials on YouTube for using trompe l’oeil effects to mimic the surface of your tiles. Disguise a plug socket with art. Put together a collection of pictures, photographs or postcards of different sizes, in mismatching frames. Surround the socket with a gallery wall of mix and match framed art: the socket will be hidden in plain sight.",
  "tyn_model":[
    "cardboard",
    "paint",
    "plant",
    "vase",
    "chopping board",
    "stand mixer",
    "furniture",
    "socket cover or docking station",
    "box-cutter",
    "scissors",
    "power strips",
    "sockets",
    "socket plates",
    "stainless steel socket plates",
    "wallpaper",
    "screwdriver",
    "spray paint",
    "art"
  ],
  "tyn_section":[

  ]
}