{
  "title":"How to Pack Pots and Pans",
  "url":"https://www.wikihow.com/Pack-Pots-and-Pans",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking Equipment",
    "Cookware",
    "Pots and Pans"
  ],
  "parts":[
    {
      "name":"Preparing to Pack",
      "steps":[
        {
          "headline":"Clean your pans and pots.",
          "description":"A dirty or wet pot could affect the material used to wrap or separate it from other items. Make sure the pots and pans are dry before packing; if the move results in any kind of storage time your items might develop mould. This will also provide an opportunity for you to inspect your pots and pans before you go; therefore, if there is damage in the move you will be sure to notice."
        },
        {
          "headline":"Gather materials for packing.",
          "description":"You will need strong, good quality moving boxes, ideally of a medium size. Get packing tape and not duct tape. Acquire wrapping sheets or newspaper to separate out your items; to effectively secure fragile items, also acquire bubble wrap or use spare clothing or linen (dishtowels are ideal)."
        },
        {
          "headline":"Secure the bottom of the box with tape.",
          "description":"A pot or pan is likely to be damaged if the box collapses. Apply strips of tape along the seams of the box, ensuring that it will be able to cope with the weight of the items. The heavier the box the more tape you should apply."
        }
      ]
    },
    {
      "name":"Protecting Your Pots and Pans",
      "steps":[
        {
          "headline":"Sort pots and pans that can be nested.",
          "description":"Pots and pans take up less space if they are stacked together—i.e. a small pot inside a medium pot inside a large pot. Don’t force this if the pots are too tight a fit, it could cause damage. When nesting, align the handles to further reduce space. If a pot or pan is particularly valuable, or vulnerable to damage, consider packing in a small individual box or at least individually and not in a nest."
        },
        {
          "headline":"Separate pots and pans with newspaper, bubble wrap or dishtowels.",
          "description":"Sturdy as pots and pans might be, if they come into contact with each other directly when moving they could cause damage. Wrap the pots and pans completely in paper, and line the cooking surfaces, the most valuable area of the items, with the bubble wrap or dishtowel. Lining the interiors with dishtowels can also be used to make the pots level when stacking in a nest. When nesting, start by wrapping the interior of the largest pot and then placing the smaller sized pot inside it. Repeat the step with the remaining pots, and then wrap as a whole."
        },
        {
          "headline":"Take care with glass lids.",
          "description":"It is a good idea to include the lids of your pots in the same box, so they don’t get separated in the move. Wrap the lids completely, as per the pots and pans, but take particular care with glass lids as these are easily broken. Wrap with a dishtowel or bubble wrap and then wrap again with paper."
        },
        {
          "headline":"Leave no empty space.",
          "description":"In order to avoid the packaged items moving while the box is in transit, make sure the box is full and items are secure before sealing up the box. Do this either by filling the remainder of the space around the packaged pots with scrunched-up wrapping paper, or using it as an opportunity to pack clothes or cushions. Do not add heavy items to fill the space. Pots and pans are already heavy and additional items could cause the box to become a hazardous weight."
        },
        {
          "headline":"Seal each box and label it clearly.",
          "description":"Use packing tape to seal the box; if the box is heavy take the same care in sealing the box as you did when you secured the bottom. Label the box with the room you want it delivered to, i.e. ‘kitchen’, and its contents. Label the box ‘heavy’ or ‘fragile’ if required."
        }
      ]
    }
  ],
  "text":" Preparing to Pack Clean your pans and pots. A dirty or wet pot could affect the material used to wrap or separate it from other items. Make sure the pots and pans are dry before packing; if the move results in any kind of storage time your items might develop mould. This will also provide an opportunity for you to inspect your pots and pans before you go; therefore, if there is damage in the move you will be sure to notice. Gather materials for packing. You will need strong, good quality moving boxes, ideally of a medium size. Get packing tape and not duct tape. Acquire wrapping sheets or newspaper to separate out your items; to effectively secure fragile items, also acquire bubble wrap or use spare clothing or linen (dishtowels are ideal). Secure the bottom of the box with tape. A pot or pan is likely to be damaged if the box collapses. Apply strips of tape along the seams of the box, ensuring that it will be able to cope with the weight of the items. The heavier the box the more tape you should apply. Protecting Your Pots and Pans Sort pots and pans that can be nested. Pots and pans take up less space if they are stacked together—i.e. a small pot inside a medium pot inside a large pot. Don’t force this if the pots are too tight a fit, it could cause damage. When nesting, align the handles to further reduce space. If a pot or pan is particularly valuable, or vulnerable to damage, consider packing in a small individual box or at least individually and not in a nest. Separate pots and pans with newspaper, bubble wrap or dishtowels. Sturdy as pots and pans might be, if they come into contact with each other directly when moving they could cause damage. Wrap the pots and pans completely in paper, and line the cooking surfaces, the most valuable area of the items, with the bubble wrap or dishtowel. Lining the interiors with dishtowels can also be used to make the pots level when stacking in a nest. When nesting, start by wrapping the interior of the largest pot and then placing the smaller sized pot inside it. Repeat the step with the remaining pots, and then wrap as a whole. Take care with glass lids. It is a good idea to include the lids of your pots in the same box, so they don’t get separated in the move. Wrap the lids completely, as per the pots and pans, but take particular care with glass lids as these are easily broken. Wrap with a dishtowel or bubble wrap and then wrap again with paper. Leave no empty space. In order to avoid the packaged items moving while the box is in transit, make sure the box is full and items are secure before sealing up the box. Do this either by filling the remainder of the space around the packaged pots with scrunched-up wrapping paper, or using it as an opportunity to pack clothes or cushions. Do not add heavy items to fill the space. Pots and pans are already heavy and additional items could cause the box to become a hazardous weight. Seal each box and label it clearly. Use packing tape to seal the box; if the box is heavy take the same care in sealing the box as you did when you secured the bottom. Label the box with the room you want it delivered to, i.e. ‘kitchen’, and its contents. Label the box ‘heavy’ or ‘fragile’ if required.",
  "tyn_model":[
    "pots",
    "pans",
    "pot",
    "bubble wrap",
    "tape",
    "packing tape",
    "newspaper",
    "dishtowels",
    "paper",
    "dishtowel",
    "duct tape",
    "wrapping sheets",
    "—i.e.",
    "pan",
    "pots and pans",
    "‘kitchen",
    "’,",
    "‘heavy",
    "’ or",
    "‘fragile",
    "’ if"
  ],
  "tyn_section":[

  ]
}