{
  "title":"How to Keep Iguanas out of Your Yard or Garden",
  "url":"https://www.wikihow.com/Keep-Iguanas-out-of-Your-Yard-or-Garden",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Pests and Weeds"
  ],
  "parts":[
    {
      "name":"Eliminating Sources of Food",
      "steps":[
        {
          "headline":"Protect plants using chicken wire or mesh.",
          "description":"If iguanas are constantly on your property, it is likely because your yard is an ideal source of food or shelter. Removing vegetation such as flowering plants and shrubs can help tame your iguana problem. Alternatively, protecting your plants using mesh and wiring can help guard them from being a source of food. Make sure to plant wire at least 1 foot underground so that the plants are protected from being accessed from underneath, as well."
        },
        {
          "headline":"Wrap trees in sheet metal to keep iguanas from climbing.",
          "description":"Using sheet metal guards will make your fruit trees difficult for iguanas to find traction and climb. For the best results, start the metal approximately 18-36” from the ground. Although iguanas love all types of foods, citrus fruit seem to be the exception. So if you have these types of trees, you can still protect them, but they will likely not be an iguana food source."
        },
        {
          "headline":"Don’t leave your food unattended.",
          "description":"Although herbivores, iguanas will try to eat just about anything. So make sure not to leave food on your table or patio after meals. Also, pick up any food that may have fallen on the ground or in the yard either via trees, pets or children. Feed pets inside of the house instead of leaving their bowls outside as iguanas are happy to feast on your pet’s food, as well."
        },
        {
          "headline":"Secure trash lids properly or weigh them down.",
          "description":"Iguana have also been known to get into your trash and scavenge for food, sometimes even by lifting or sliding your lid off entirely. So make sure these are tightly secured so they are not used as a food source, either."
        }
      ]
    },
    {
      "name":"Making Your Garden Inhospitable",
      "steps":[
        {
          "headline":"Keep your yard clean and maintained.",
          "description":"If you yard contains dense thickets, overgrown grass and hedges, piles of lumber or overturned canoes, etc., these are very alluring places to seek shelter. Keeping your yard well maintained will provide fewer places for iguanas to hide."
        },
        {
          "headline":"Fill in holes and gaps.",
          "description":"Even if your yard is well maintained and free of debris, holes can still be used as a source of shelter. Iguanas can either burrow to make their own underground shelters or settle in existing holes and cracks on your property. These are called nests. Use cement or gravel and dirt to fill in these nests. Iguanas may be able to burrow through the dirt, but once they reach the rock, they won’t be able to pass. Be careful to make sure the holes are not occupied at the time of filing; however, as this may violate your state’s animal cruelty laws."
        },
        {
          "headline":"Make a loud noise when you see an iguana to quickly scare it away.",
          "description":"Playing loud music or banging pots and pans together can scare them away temporarily, giving you time to continue working on making your yard inhospitable. Additionally, purchasing wind chimes and placing them in your yard may do this trick for you without having you lift a finger."
        }
      ]
    },
    {
      "name":"Using Iguana Repellent",
      "steps":[
        {
          "headline":"Spray biopesticide iguana repellent around the borders of your yard.",
          "description":"This method is controversial to some; however, others swear by it. You can find biopesticide repellents, such as Iguana-Gone, Iguana Rid, neem oil, garlic spray or Coyote pee, online."
        },
        {
          "headline":"Spray repellent in areas iguanas frequent most.",
          "description":"However, be careful not to spray any directly on vegetation as some of the natural ingredients (such as red pepper flakes) can stunt plant growth."
        },
        {
          "headline":"Spray iguanas with water to rid them temporarily.",
          "description":"Although not a repellent, per se, using your water hose to scare them away is also a temporary and natural solution to rid iguanas quickly."
        }
      ]
    }
  ],
  "text":" Eliminating Sources of Food Protect plants using chicken wire or mesh. If iguanas are constantly on your property, it is likely because your yard is an ideal source of food or shelter. Removing vegetation such as flowering plants and shrubs can help tame your iguana problem. Alternatively, protecting your plants using mesh and wiring can help guard them from being a source of food. Make sure to plant wire at least 1 foot underground so that the plants are protected from being accessed from underneath, as well. Wrap trees in sheet metal to keep iguanas from climbing. Using sheet metal guards will make your fruit trees difficult for iguanas to find traction and climb. For the best results, start the metal approximately 18-36” from the ground. Although iguanas love all types of foods, citrus fruit seem to be the exception. So if you have these types of trees, you can still protect them, but they will likely not be an iguana food source. Don’t leave your food unattended. Although herbivores, iguanas will try to eat just about anything. So make sure not to leave food on your table or patio after meals. Also, pick up any food that may have fallen on the ground or in the yard either via trees, pets or children. Feed pets inside of the house instead of leaving their bowls outside as iguanas are happy to feast on your pet’s food, as well. Secure trash lids properly or weigh them down. Iguana have also been known to get into your trash and scavenge for food, sometimes even by lifting or sliding your lid off entirely. So make sure these are tightly secured so they are not used as a food source, either. Making Your Garden Inhospitable Keep your yard clean and maintained. If you yard contains dense thickets, overgrown grass and hedges, piles of lumber or overturned canoes, etc., these are very alluring places to seek shelter. Keeping your yard well maintained will provide fewer places for iguanas to hide. Fill in holes and gaps. Even if your yard is well maintained and free of debris, holes can still be used as a source of shelter. Iguanas can either burrow to make their own underground shelters or settle in existing holes and cracks on your property. These are called nests. Use cement or gravel and dirt to fill in these nests. Iguanas may be able to burrow through the dirt, but once they reach the rock, they won’t be able to pass. Be careful to make sure the holes are not occupied at the time of filing; however, as this may violate your state’s animal cruelty laws. Make a loud noise when you see an iguana to quickly scare it away. Playing loud music or banging pots and pans together can scare them away temporarily, giving you time to continue working on making your yard inhospitable. Additionally, purchasing wind chimes and placing them in your yard may do this trick for you without having you lift a finger. Using Iguana Repellent Spray biopesticide iguana repellent around the borders of your yard. This method is controversial to some; however, others swear by it. You can find biopesticide repellents, such as Iguana-Gone, Iguana Rid, neem oil, garlic spray or Coyote pee, online. Spray repellent in areas iguanas frequent most. However, be careful not to spray any directly on vegetation as some of the natural ingredients (such as red pepper flakes) can stunt plant growth. Spray iguanas with water to rid them temporarily. Although not a repellent, per se, using your water hose to scare them away is also a temporary and natural solution to rid iguanas quickly.",
  "tyn_model":[
    "iguanas",
    "sheet metal",
    "iguana",
    "dirt",
    "chicken wire",
    "mesh",
    "wire",
    "” from",
    "bowls",
    "lumber",
    "canoes",
    "cement",
    "gravel",
    "rock",
    "pots",
    "wind chimes",
    "iguana repellent spray",
    "biopesticide repellents",
    "iguana-gone",
    "neem oil",
    "garlic spray",
    "coyote pee",
    "red pepper flakes",
    "water",
    "water hose"
  ],
  "tyn_section":[

  ]
}