{
  "title":"How to Prune Camellia",
  "url":"https://www.wikihow.com/Prune-Camellia",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "parts":[
    {
      "name":"Getting the Timing and Tools Right",
      "steps":[
        {
          "headline":"Prune immediately after the flowers have finished blooming.",
          "description":"This will be before new growth starts and is likely to be in spring. However, as this can differ between varieties be sure to check. Do some online research, ask a knowledgeable friend or enquire at your local gardening center. Pruning at other times will not harm the plant but there may be fewer flowers the following year."
        },
        {
          "headline":"Use sharp pruning shears and a pruning saw.",
          "description":"Shears are ideal for smaller stems while the saw will be better for larger branches. A sharp cut will heal much more rapidly than a ragged cut made by a blunt tool. Sharp cuts also reduce the likelihood of disease-causing organisms entering through the cuts after pruning. The tools you will need are widely available at garden centers."
        },
        {
          "headline":"Ensure that all tools are clean to avoid transmitting diseases.",
          "description":"Pests and disease can be easily transferred from one plant to another by infected gardening equipment. Remove soil, dirt and other debris from the tools first. Then spray or soak the surface of each tool with disinfectant. Common household disinfectants or liquid bleach can be used for this. It is advisable to wear gloves while disinfecting tools, particularly if you have sensitive skin."
        }
      ]
    },
    {
      "name":"Removing Dead and Overgrown Foliage",
      "steps":[
        {
          "headline":"Make cuts with the blade as close as possible to the remaining branch.",
          "description":"Be careful not to damage the bark as you cut. Also try not to damage the raised ridges at the connection points between branches. After pruning, the plant will grow new material at these ridges to protect itself from potential diseases being introduced through the cuts."
        },
        {
          "headline":"Thin out the inner leaves and stems to help prevent disease.",
          "description":"This improves airflow and allows more light to get to the middle of the plant, controlling pest infestations. Make sure that you cut entire branches off at the point where they meet other branches. Rather than dumping the pruned material, use it as a mulch for the plants themselves."
        },
        {
          "headline":"Cut the ends of branches after blooming to the size you want to achieve.",
          "description":"This will enable you to grow the plant to the size and shape you would like. It will also encourage fuller growth and more flowers. To grow a larger plant, prune back to an inch or less. To grow a smaller plant, prune back to a few inches less than you want as a final result."
        }
      ]
    },
    {
      "name":"Maintaining Camellia",
      "steps":[
        {
          "headline":"Fertilize in spring and again in early summer with an acidic fertilizer.",
          "description":"Camellias are acid-loving plants so will not do well on highly alkaline soils. Pull back the mulch, spread the fertilizer around the plant and water well to prevent the plant from being burnt. Make sure you follow any other special instructions directed on the label. Using controlled-release pellets will mean your plants will not need to be fed until the following year. Organic fertilizers based on seaweed, blood and bone can also be used but as these are mildly alkaline care should be taken to use them only on acid soils."
        },
        {
          "headline":"Do not over-water the plants.",
          "description":"In general, established plants will not require any watering at all except in prolonged dry conditions. It should be planted in well-drained soil. Camellia does not thrive in the wet and is prone to fungal diseases when exposed to too much moisture. Leaf gall, also known as oedema, is a fungal disease of leaves associated with wet conditions. Root rot is another fungal disease caused by too much water and eventually results in plant death."
        },
        {
          "headline":"Remove dead flowers.",
          "description":"Dying blooms can remain attached to branches for a long time and look unsightly. Removing these dead blooms, termed deadheading, will improve the appearance of the plant and encourage growth of new flowers. Deadheading is better carried out by hand rather than with tools. Simply twist the old bloom gently off the stem. Petal blight is a fungal disease that causes flowers to turn brown. It is usually associated with too much water in springtime and can be treated with a fungicide."
        }
      ]
    }
  ],
  "text":" Getting the Timing and Tools Right Prune immediately after the flowers have finished blooming. This will be before new growth starts and is likely to be in spring. However, as this can differ between varieties be sure to check. Do some online research, ask a knowledgeable friend or enquire at your local gardening center. Pruning at other times will not harm the plant but there may be fewer flowers the following year. Use sharp pruning shears and a pruning saw. Shears are ideal for smaller stems while the saw will be better for larger branches. A sharp cut will heal much more rapidly than a ragged cut made by a blunt tool. Sharp cuts also reduce the likelihood of disease-causing organisms entering through the cuts after pruning. The tools you will need are widely available at garden centers. Ensure that all tools are clean to avoid transmitting diseases. Pests and disease can be easily transferred from one plant to another by infected gardening equipment. Remove soil, dirt and other debris from the tools first. Then spray or soak the surface of each tool with disinfectant. Common household disinfectants or liquid bleach can be used for this. It is advisable to wear gloves while disinfecting tools, particularly if you have sensitive skin. Removing Dead and Overgrown Foliage Make cuts with the blade as close as possible to the remaining branch. Be careful not to damage the bark as you cut. Also try not to damage the raised ridges at the connection points between branches. After pruning, the plant will grow new material at these ridges to protect itself from potential diseases being introduced through the cuts. Thin out the inner leaves and stems to help prevent disease. This improves airflow and allows more light to get to the middle of the plant, controlling pest infestations. Make sure that you cut entire branches off at the point where they meet other branches. Rather than dumping the pruned material, use it as a mulch for the plants themselves. Cut the ends of branches after blooming to the size you want to achieve. This will enable you to grow the plant to the size and shape you would like. It will also encourage fuller growth and more flowers. To grow a larger plant, prune back to an inch or less. To grow a smaller plant, prune back to a few inches less than you want as a final result. Maintaining Camellia Fertilize in spring and again in early summer with an acidic fertilizer. Camellias are acid-loving plants so will not do well on highly alkaline soils. Pull back the mulch, spread the fertilizer around the plant and water well to prevent the plant from being burnt. Make sure you follow any other special instructions directed on the label. Using controlled-release pellets will mean your plants will not need to be fed until the following year. Organic fertilizers based on seaweed, blood and bone can also be used but as these are mildly alkaline care should be taken to use them only on acid soils. Do not over-water the plants. In general, established plants will not require any watering at all except in prolonged dry conditions. It should be planted in well-drained soil. Camellia does not thrive in the wet and is prone to fungal diseases when exposed to too much moisture. Leaf gall, also known as oedema, is a fungal disease of leaves associated with wet conditions. Root rot is another fungal disease caused by too much water and eventually results in plant death. Remove dead flowers. Dying blooms can remain attached to branches for a long time and look unsightly. Removing these dead blooms, termed deadheading, will improve the appearance of the plant and encourage growth of new flowers. Deadheading is better carried out by hand rather than with tools. Simply twist the old bloom gently off the stem. Petal blight is a fungal disease that causes flowers to turn brown. It is usually associated with too much water in springtime and can be treated with a fungicide.",
  "tyn_model":[
    "water",
    "tools",
    "mulch",
    "camellia",
    "fertilizer",
    "pruning",
    "pruning shears",
    "pruning saw",
    "shears",
    "saw",
    "garden centers",
    "gardening equipment",
    "liquid bleach",
    "bark",
    "camellias",
    "fertilizers",
    "leaf gall"
  ],
  "tyn_section":[

  ]
}