{
  "title":"How to Recycle a Vacuum Cleaner",
  "url":"https://www.wikihow.com/Recycle-a-Vacuum-Cleaner",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Cleaning Floors"
  ],
  "methods":[
    {
      "name":"Recycling Your Broken Vacuum Cleaner",
      "steps":[
        {
          "headline":"Attempt to repair your vacuum cleaner.",
          "description":"Your appliance may still be functional if you perform maintenance and you don't need any specialized knowledge to do the basics. Open your vacuum cleaner and clean the insides thoroughly. Often regular dust and dirt can impair your vacuum cleaners functionality. Replace the dust bag inside your vacuum cleaner. Sometimes the problem can be as simple as the bag being full. Check the nozzle and any attachments to make sure there are no obstructions. You may have accidentally vacuumed a large object that has blocked the inner tubing. If none of these tips solve your problem, it may be worth consulting a vacuum cleaner specialist who could repair your appliance for you."
        },
        {
          "headline":"Find out if your vacuum cleaner is recyclable.",
          "description":"Although it is increasingly rare for a vacuum cleaner to be non-recyclable, it is still good practice to check before bringing it to your local recycling center. If your vacuum cleaner comes with a plug, batteries, a charging cable or has a picture of a crossed out bin on the interior, your vacuum cleaner is recyclable."
        },
        {
          "headline":"Go to the recycling center.",
          "description":"Around 90% of a vacuum cleaner is recyclable so if it is impossible to repair, much of it will go towards making outdoor furniture, car dashboards and plastic plant pots."
        },
        {
          "headline":"Don't worry if you don't know which bin to put your vacuum cleaner in.",
          "description":"The staff on-site will be able to direct you to wherever you need to go."
        },
        {
          "headline":"Consult a vacuum cleaner company for recycling options.",
          "description":"If you opt to purchase a new vacuum cleaner, the company may pick up your old vacuum cleaner for recycling when they’re delivering your newer model. This means you won’t even need to leave the house to recycle your old vacuum cleaner."
        },
        {
          "headline":"Create environmentally friendly art fixtures.",
          "description":"If you’re a creative type there are some fun and entertaining uses for a broken down vacuum cleaner. You can hollow out the interior of your vacuum cleaner and use it as a quirky container for general storage. If you have kids you can encourage them to decorate the vacuum cleaner with paints and stickers,\nIf possible, you can also dismantle it for parts for other projects or even use it as a quirky plant pot."
        }
      ]
    },
    {
      "name":"Recycling Your Functional Vacuum Cleaner",
      "steps":[
        {
          "headline":"Donate it to a charity shop.",
          "description":"Many charity organisations are swamped by clothing donations, so a donation of a functional appliance would go a long way. If your vacuum cleaner is functional, it will be greatly appreciated in any charity shop. Places like the Salvation Army and Goodwill are huge organizations, and they will frequently pick-up your vacuum right at your home, so you don’t even need to go anywhere to make a donation."
        },
        {
          "headline":"Sell your vacuum cleaner online.",
          "description":"If you think that your vacuum cleaner could still have a life in someone else's home, the internet provides a convenient avenue for making a profit off unwanted goods. Take several pictures of your vacuum cleaner from different angles to give a potential buyer a strong idea of the appliance. Make sure you take the picture in a well lit area and use a tripod if you have one available. A good photograph can really help sell your item. Research what price others are selling your vacuum cleaner for. You don't want to make it too expensive so that no one will buy it, or so inexpensive that you're harming whatever profit you may make. eBay and Gumtree are great websites for selling for profit. If you want to donate your old vacuum cleaner you can also try Freecycle, Freegle or Preloved."
        },
        {
          "headline":"Find local swapping events.",
          "description":"Sometimes local fairs in your community can host swapping events wherein you trade items of roughly equivalent value with each other. Not only can you get rid of an appliance you no longer need, but you can get something useful in return."
        },
        {
          "headline":"Donate your vacuum cleaner to family and friends.",
          "description":"A small gift can go a long way for someone who needs it and you will never know when you'll need something that friends and family will happily provide for you."
        },
        {
          "headline":"Sell your vacuum cleaner to an electronics store.",
          "description":"Some stores will buy functional second-hand vacuum cleaners to sell at a cheaper price to others. If you're uncomfortable buying and selling products online, this is your next best bet. Having someone in-person walking you through the selling process can help salve any worries about the procedure."
        }
      ]
    }
  ],
  "text":" Recycling Your Broken Vacuum Cleaner Attempt to repair your vacuum cleaner. Your appliance may still be functional if you perform maintenance and you don't need any specialized knowledge to do the basics. Open your vacuum cleaner and clean the insides thoroughly. Often regular dust and dirt can impair your vacuum cleaners functionality. Replace the dust bag inside your vacuum cleaner. Sometimes the problem can be as simple as the bag being full. Check the nozzle and any attachments to make sure there are no obstructions. You may have accidentally vacuumed a large object that has blocked the inner tubing. If none of these tips solve your problem, it may be worth consulting a vacuum cleaner specialist who could repair your appliance for you. Find out if your vacuum cleaner is recyclable. Although it is increasingly rare for a vacuum cleaner to be non-recyclable, it is still good practice to check before bringing it to your local recycling center. If your vacuum cleaner comes with a plug, batteries, a charging cable or has a picture of a crossed out bin on the interior, your vacuum cleaner is recyclable. Go to the recycling center. Around 90% of a vacuum cleaner is recyclable so if it is impossible to repair, much of it will go towards making outdoor furniture, car dashboards and plastic plant pots. Don't worry if you don't know which bin to put your vacuum cleaner in. The staff on-site will be able to direct you to wherever you need to go. Consult a vacuum cleaner company for recycling options. If you opt to purchase a new vacuum cleaner, the company may pick up your old vacuum cleaner for recycling when they’re delivering your newer model. This means you won’t even need to leave the house to recycle your old vacuum cleaner. Create environmentally friendly art fixtures. If you’re a creative type there are some fun and entertaining uses for a broken down vacuum cleaner. You can hollow out the interior of your vacuum cleaner and use it as a quirky container for general storage. If you have kids you can encourage them to decorate the vacuum cleaner with paints and stickers,\nIf possible, you can also dismantle it for parts for other projects or even use it as a quirky plant pot. Recycling Your Functional Vacuum Cleaner Donate it to a charity shop. Many charity organisations are swamped by clothing donations, so a donation of a functional appliance would go a long way. If your vacuum cleaner is functional, it will be greatly appreciated in any charity shop. Places like the Salvation Army and Goodwill are huge organizations, and they will frequently pick-up your vacuum right at your home, so you don’t even need to go anywhere to make a donation. Sell your vacuum cleaner online. If you think that your vacuum cleaner could still have a life in someone else's home, the internet provides a convenient avenue for making a profit off unwanted goods. Take several pictures of your vacuum cleaner from different angles to give a potential buyer a strong idea of the appliance. Make sure you take the picture in a well lit area and use a tripod if you have one available. A good photograph can really help sell your item. Research what price others are selling your vacuum cleaner for. You don't want to make it too expensive so that no one will buy it, or so inexpensive that you're harming whatever profit you may make. eBay and Gumtree are great websites for selling for profit. If you want to donate your old vacuum cleaner you can also try Freecycle, Freegle or Preloved. Find local swapping events. Sometimes local fairs in your community can host swapping events wherein you trade items of roughly equivalent value with each other. Not only can you get rid of an appliance you no longer need, but you can get something useful in return. Donate your vacuum cleaner to family and friends. A small gift can go a long way for someone who needs it and you will never know when you'll need something that friends and family will happily provide for you. Sell your vacuum cleaner to an electronics store. Some stores will buy functional second-hand vacuum cleaners to sell at a cheaper price to others. If you're uncomfortable buying and selling products online, this is your next best bet. Having someone in-person walking you through the selling process can help salve any worries about the procedure.",
  "tyn_model":[
    "vacuum cleaner",
    "vacuum cleaners",
    "paints",
    "vacuum",
    "tripod"
  ],
  "tyn_section":[

  ]
}