{
  "title":"How to Measure Your Neck Size and Sleeve Length",
  "url":"https://www.wikihow.com/Measure-Your-Neck-Size-and-Sleeve-Length",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Sewing",
    "Sewing Clothes"
  ],
  "methods":[
    {
      "name":"Neck Measurement",
      "steps":[
        {
          "headline":"Start your measurement.",
          "description":"Wrap the measuring tape around the neck, beginning at about one inch from the meeting of your neck and shoulders. This may also coincide with the bottom part of your Adam's apple."
        },
        {
          "headline":"Hold the tape tight.",
          "description":"Come fully around the neck, leaving no dangling space in between the neck and the tape. Don't pull too tightly so as to create unnecessary tension, just enough so that you are getting a true measurement. Make sure the tape is level and not being held at an angle."
        },
        {
          "headline":"Note the measured number.",
          "description":"This is the actual neck size. The dress shirt size will be half an inch bigger. For example, if you measure your neck to be exactly 15 inches (38 cm) around, then your dress shirt size will be 15½ inches (39.5 cm). If you measured on a 1/4 inch/centimeter, then round up to the nearest 1/2 inch/centimeter. For example, if your neck size was 16.25, round up to 16.5. Your neck size should range between about 14 - 19 inches or 35.5 - 48.3 centimeters."
        }
      ]
    },
    {
      "name":"Sleeve Measurement",
      "steps":[
        {
          "headline":"Get in the proper stance.",
          "description":"Before you begin measuring, stand still with your arms at your sides. Hold your arms slightly bent, with your fingers tucked into your front pockets."
        },
        {
          "headline":"Place your measuring tape.",
          "description":"Begin at the middle of the upper back, slightly below the nape of your neck."
        },
        {
          "headline":"Take your first measurement.",
          "description":"Measure the length from the middle of the upper back to the stitching located at the shoulder of the shirt. Write this measurement down, as you will need it later."
        },
        {
          "headline":"Take your second measurement.",
          "description":"Measure the length from the top stitching on the shoulder to the bottom of the wrist. Aim for hitting your wrist bone with the measuring tape. Be careful not to measure too high above the wrist, or the dress shirt's sleeves will come to be too short."
        },
        {
          "headline":"Determine your sleeve length.",
          "description":"Add these two values together to find your sleeve length. The value should range anywhere from about 32 - 37 inches (81.3 - 94 cm)."
        }
      ]
    },
    {
      "name":"Determining Shirt Size",
      "steps":[
        {
          "headline":"Using your measurements.",
          "description":"Men's shirt sizes come in a two-part number. The first number listed on the tag of the shirt is the neck measurement, and the second one is the sleeve measurement. For example, a shirt may be sized as 16/34. Use both your neck and sleeve measurements to find the right size."
        },
        {
          "headline":"Find a ready-to-wear size.",
          "description":"If the shirts you are browsing don't offer an exact measurement but rather the traditional \"small,\" \"medium,\" or \"large,\" options, you can use your measurements to find the equivalent in this style of sizing. Use the table below to determine the best size of shirt for you."
        }
      ]
    }
  ],
  "text":" Neck Measurement Start your measurement. Wrap the measuring tape around the neck, beginning at about one inch from the meeting of your neck and shoulders. This may also coincide with the bottom part of your Adam's apple. Hold the tape tight. Come fully around the neck, leaving no dangling space in between the neck and the tape. Don't pull too tightly so as to create unnecessary tension, just enough so that you are getting a true measurement. Make sure the tape is level and not being held at an angle. Note the measured number. This is the actual neck size. The dress shirt size will be half an inch bigger. For example, if you measure your neck to be exactly 15 inches (38 cm) around, then your dress shirt size will be 15½ inches (39.5 cm). If you measured on a 1/4 inch/centimeter, then round up to the nearest 1/2 inch/centimeter. For example, if your neck size was 16.25, round up to 16.5. Your neck size should range between about 14 - 19 inches or 35.5 - 48.3 centimeters. Sleeve Measurement Get in the proper stance. Before you begin measuring, stand still with your arms at your sides. Hold your arms slightly bent, with your fingers tucked into your front pockets. Place your measuring tape. Begin at the middle of the upper back, slightly below the nape of your neck. Take your first measurement. Measure the length from the middle of the upper back to the stitching located at the shoulder of the shirt. Write this measurement down, as you will need it later. Take your second measurement. Measure the length from the top stitching on the shoulder to the bottom of the wrist. Aim for hitting your wrist bone with the measuring tape. Be careful not to measure too high above the wrist, or the dress shirt's sleeves will come to be too short. Determine your sleeve length. Add these two values together to find your sleeve length. The value should range anywhere from about 32 - 37 inches (81.3 - 94 cm). Determining Shirt Size Using your measurements. Men's shirt sizes come in a two-part number. The first number listed on the tag of the shirt is the neck measurement, and the second one is the sleeve measurement. For example, a shirt may be sized as 16/34. Use both your neck and sleeve measurements to find the right size. Find a ready-to-wear size. If the shirts you are browsing don't offer an exact measurement but rather the traditional \"small,\" \"medium,\" or \"large,\" options, you can use your measurements to find the equivalent in this style of sizing. Use the table below to determine the best size of shirt for you.",
  "tyn_model":[
    "measuring tape",
    "tape",
    "shirt",
    "dress shirt",
    "shirts"
  ],
  "tyn_section":[

  ]
}