{
  "title":"How to Remove Vertical Blinds",
  "url":"https://www.wikihow.com/Remove-Vertical-Blinds",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Doors and Windows",
    "Window Treatments",
    "Window Blinds"
  ],
  "parts":[
    {
      "name":"Removing Individual Vanes",
      "steps":[
        {
          "headline":"Remove the valance to reveal the top rail.",
          "description":"Most vertical blinds have a valance, which is a decorative border covering the rail at the top where the vanes are attached. Hold the bottom of the valance and gently push it upwards to create a small gap between it and the clips holding each vane. Continue pushing the valance gently until it is no longer touching the clips. The clips holding each vane are also known as the vane carriers. Be sure to remove the valance gently or the clips will break off."
        },
        {
          "headline":"Rotate the blinds so that they are partially open.",
          "description":"To remove the blinds easily, rotate the vanes so that they are not overlapping each other. Pull the bead chain on the side of the blinds to open them. Aim to have the vanes open on an angle rather than fully turned to the side."
        },
        {
          "headline":"Locate the vane carrier at the top of the vane.",
          "description":"Each vane on a set of vertical blinds is attached with a vane carrier. Find the vane carrier at the top of the vane. The side of the vane carrier that faces out will have a hook-like shape to allow you to open it easily."
        },
        {
          "headline":"Slide a plastic card between the vane carrier and the vane.",
          "description":"Position a flat, sturdy card under the bottom of the vane carrier, underneath the hook. Slide the card upwards to wedge it between the vane and the carrier. This will disrupt the grip that holds the vane in place and prevent you from breaking the thin plastic that runs along the top. A credit card is an ideal tool to wedge between the vane and carrier."
        },
        {
          "headline":"Gently detach the vane from the vane carrier.",
          "description":"Once the card is wedged between the vane and the carrier, pull the vane downwards. Do this slowly to prevent damage to the vane. Once the vane is clear of the carrier, remove the card as well. The carriers that hold the vanes should not be removed from the blind rail. Be sure to place the vane in a cleared, clean spot to keep it in good condition."
        }
      ]
    },
    {
      "name":"Taking Down the Blind Hardware",
      "steps":[
        {
          "headline":"Remove the bead chain from the blind rail.",
          "description":"Each set of vertical blinds has a bead chain along the top that allows you to rotate the vanes open and closed. After removing the vanes, gently pull the chain out from the blind rail. If you plan to keep the blinds, be careful not to break the delicate chain while removing it. If your bead chain is broken or damaged, you can buy a new one at a window treatment store or online."
        },
        {
          "headline":"Use a flat head screwdriver to release the spring clips of the rail brackets.",
          "description":"Examine the back of the blind rail to locate the brackets securing it in place. Insert a flat head screwdriver in the spring clips of each bracket. Twist the screwdriver slowly until the spring is released."
        },
        {
          "headline":"Take the blind rail off the wall.",
          "description":"Hold the blind rail firmly once you release the springs in each bracket. Gently pull the rail away from the brackets. If the rail does not come down easily, check the brackets again to make sure that the springs have been released properly."
        },
        {
          "headline":"Remove the brackets and fill the holes if you aren't replacing the blinds.",
          "description":"Use a screwdriver to remove the small screws attaching the brackets to your wall. To hide the holes, use a putty knife to apply plaster or joint compound. Paint over it once the surface is dry. If the screws are very tight, use an electric screwdriver instead of manual screwdriver. If there are wall anchors, you may have to remove them with needle-nose pliers. If you are simply replacing the blinds, check to see if the new brackets are the same as the old ones and leave them there to save yourself time and trouble."
        }
      ]
    }
  ],
  "text":" Removing Individual Vanes Remove the valance to reveal the top rail. Most vertical blinds have a valance, which is a decorative border covering the rail at the top where the vanes are attached. Hold the bottom of the valance and gently push it upwards to create a small gap between it and the clips holding each vane. Continue pushing the valance gently until it is no longer touching the clips. The clips holding each vane are also known as the vane carriers. Be sure to remove the valance gently or the clips will break off. Rotate the blinds so that they are partially open. To remove the blinds easily, rotate the vanes so that they are not overlapping each other. Pull the bead chain on the side of the blinds to open them. Aim to have the vanes open on an angle rather than fully turned to the side. Locate the vane carrier at the top of the vane. Each vane on a set of vertical blinds is attached with a vane carrier. Find the vane carrier at the top of the vane. The side of the vane carrier that faces out will have a hook-like shape to allow you to open it easily. Slide a plastic card between the vane carrier and the vane. Position a flat, sturdy card under the bottom of the vane carrier, underneath the hook. Slide the card upwards to wedge it between the vane and the carrier. This will disrupt the grip that holds the vane in place and prevent you from breaking the thin plastic that runs along the top. A credit card is an ideal tool to wedge between the vane and carrier. Gently detach the vane from the vane carrier. Once the card is wedged between the vane and the carrier, pull the vane downwards. Do this slowly to prevent damage to the vane. Once the vane is clear of the carrier, remove the card as well. The carriers that hold the vanes should not be removed from the blind rail. Be sure to place the vane in a cleared, clean spot to keep it in good condition. Taking Down the Blind Hardware Remove the bead chain from the blind rail. Each set of vertical blinds has a bead chain along the top that allows you to rotate the vanes open and closed. After removing the vanes, gently pull the chain out from the blind rail. If you plan to keep the blinds, be careful not to break the delicate chain while removing it. If your bead chain is broken or damaged, you can buy a new one at a window treatment store or online. Use a flat head screwdriver to release the spring clips of the rail brackets. Examine the back of the blind rail to locate the brackets securing it in place. Insert a flat head screwdriver in the spring clips of each bracket. Twist the screwdriver slowly until the spring is released. Take the blind rail off the wall. Hold the blind rail firmly once you release the springs in each bracket. Gently pull the rail away from the brackets. If the rail does not come down easily, check the brackets again to make sure that the springs have been released properly. Remove the brackets and fill the holes if you aren't replacing the blinds. Use a screwdriver to remove the small screws attaching the brackets to your wall. To hide the holes, use a putty knife to apply plaster or joint compound. Paint over it once the surface is dry. If the screws are very tight, use an electric screwdriver instead of manual screwdriver. If there are wall anchors, you may have to remove them with needle-nose pliers. If you are simply replacing the blinds, check to see if the new brackets are the same as the old ones and leave them there to save yourself time and trouble.",
  "tyn_model":[
    "vane",
    "card",
    "vane carrier",
    "flat head screwdriver",
    "screwdriver",
    "credit card",
    "window treatment store",
    "putty knife",
    "plaster",
    "paint",
    "electric screwdriver",
    "pliers",
    "brackets"
  ],
  "tyn_section":[

  ]
}