{
  "title":"How to Cove Finish Concrete",
  "url":"https://www.wikihow.com/Cove-Finish-Concrete",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Concrete",
    "Working with Concrete and Cement"
  ],
  "parts":[
    {
      "name":"Choosing the Right Tools for the Job",
      "steps":[
        {
          "headline":"Get a steel trowel with serrated edges.",
          "description":"Almost any home improvement store will sell these tools. They are not specific to the cove finish, but it gives the surface the grainy texture needed for the traction once it cures. Avoid wood or homemade trowels because they often don’t have a truly straight edge that is needed to make the cove finish look professional."
        },
        {
          "headline":"Find two solid knee pads or stadium seat cushions.",
          "description":"The finish requires moving across your concrete surface before it is fully dry. You need to have a flat surface under your knees and toes to keep you from accidentally making impressions in the concrete as you move. Be sure your pads are smooth surfaces that won’t absorb or transfer moisture. You need one pad to go beneath both of your knees together and one to go under both of your feet together, in a kneeling position."
        },
        {
          "headline":"Have another trowel handy as leverage.",
          "description":"Your other hand will need something to hold onto as you lean out while your trowel hand works. By choosing another steel trowel, you can be smoothing excess concrete as you move. Never plant your balancing hand where you have already worked. This may be difficult, but you do not want to have to rework an area. If you have a stronger back and are able to keep leaned out and over for the period it takes to work, you can do without something for your non-working hand."
        }
      ]
    },
    {
      "name":"Applying the Cove Finish",
      "steps":[
        {
          "headline":"Work your concrete to the point of floating.",
          "description":"The finish comes after you float the surface, i.e. have compacted and let the surface partially dry. Where you typically see instructions to trowel or broom the surface is where you will do the cove. Lay your concrete, screed it (level the excess concrete), and smooth the surface. Go ahead and run your edges and joints once before the finish so you know your boundaries. Float the surface by hand, compacting and removing moisture from the surface. Refer to your specific concrete mixture instructions for timing on how long it will take to partially dry. Temperature, humidity, and the mixture itself are all variables in determining how the concrete will dry that day."
        },
        {
          "headline":"Start in the upper-left corner of each section.",
          "description":"You will move left-to-right for a row and then right-to-left on the next row (think zig-zag). This will make for the most efficient work since sliding down to the end of a row can take up unnecessary time. If you feel awkward working in the opposite direction of a previous row, you can move in the same way as before (more like reading the words on a page than a zig-zag). Just be careful scooting the pads and yourself around, especially if you are out in the middle of a pad of semi-wet concrete."
        },
        {
          "headline":"Sweep the trowel in a semi-circle motion.",
          "description":"The radius of your semi-circle will be about as wide as your trowel. Make sure the serrated edge is on the trailing end of your motion to leave the texture in the concrete instead of the smoothed-edge. The more practice you have, you can typically do this in a single semi-circle. If it does not look like you want it, simply do another pass over it quickly. Apply gentle pressure with the trailing edge, lifting slightly towards the end of the motion. This will make sure the texture imprints but does not make a mess of the previous section or edge."
        },
        {
          "headline":"Continue down the row overlapping the edges slightly.",
          "description":"It will only need to overlap approximately 1 to 2 in (2.5 to 5.1 cm). The slight overlap will smooth out any over-exaggerated texture between the arcs. Slide your pads carefully as you work. A toe-print down the line may need re-leveling. If you get to your last sweep of a row and don’t have room for a full arc, make one anyways overlapping the previous one. You’re better off texturing everything rather than leaving off an arc."
        },
        {
          "headline":"Move down a row and continue overlapping the first slightly.",
          "description":"Just as you overlapped left-to-right, you will also want a slight overlap with the top of your new row and the bottom of the previous one. Continue overlapping right-to-left or left-to-right as well. Work to the end of that row and repeat the process until you are totally finished with your sections."
        },
        {
          "headline":"Re-edge and groove your joints.",
          "description":"Simply run the edging tool and joint tool you used previously along the seams again. The finishing may have smudged your edges slightly, so giving them another pass will make them clean again. That’s all there is to it! You can now let your concrete cure and finish hardening. This typically involves wetting and covering the concrete with a plastic sheet. Foot traffic is usually permitted after 24 hours, cars after about 2 weeks, and full curing after a month. Refer to your specific mix’s instructions to see what is required. After about a month, you should also apply a sealant to make it more moisture resistant and easy to clean."
        }
      ]
    }
  ],
  "text":" Choosing the Right Tools for the Job Get a steel trowel with serrated edges. Almost any home improvement store will sell these tools. They are not specific to the cove finish, but it gives the surface the grainy texture needed for the traction once it cures. Avoid wood or homemade trowels because they often don’t have a truly straight edge that is needed to make the cove finish look professional. Find two solid knee pads or stadium seat cushions. The finish requires moving across your concrete surface before it is fully dry. You need to have a flat surface under your knees and toes to keep you from accidentally making impressions in the concrete as you move. Be sure your pads are smooth surfaces that won’t absorb or transfer moisture. You need one pad to go beneath both of your knees together and one to go under both of your feet together, in a kneeling position. Have another trowel handy as leverage. Your other hand will need something to hold onto as you lean out while your trowel hand works. By choosing another steel trowel, you can be smoothing excess concrete as you move. Never plant your balancing hand where you have already worked. This may be difficult, but you do not want to have to rework an area. If you have a stronger back and are able to keep leaned out and over for the period it takes to work, you can do without something for your non-working hand. Applying the Cove Finish Work your concrete to the point of floating. The finish comes after you float the surface, i.e. have compacted and let the surface partially dry. Where you typically see instructions to trowel or broom the surface is where you will do the cove. Lay your concrete, screed it (level the excess concrete), and smooth the surface. Go ahead and run your edges and joints once before the finish so you know your boundaries. Float the surface by hand, compacting and removing moisture from the surface. Refer to your specific concrete mixture instructions for timing on how long it will take to partially dry. Temperature, humidity, and the mixture itself are all variables in determining how the concrete will dry that day. Start in the upper-left corner of each section. You will move left-to-right for a row and then right-to-left on the next row (think zig-zag). This will make for the most efficient work since sliding down to the end of a row can take up unnecessary time. If you feel awkward working in the opposite direction of a previous row, you can move in the same way as before (more like reading the words on a page than a zig-zag). Just be careful scooting the pads and yourself around, especially if you are out in the middle of a pad of semi-wet concrete. Sweep the trowel in a semi-circle motion. The radius of your semi-circle will be about as wide as your trowel. Make sure the serrated edge is on the trailing end of your motion to leave the texture in the concrete instead of the smoothed-edge. The more practice you have, you can typically do this in a single semi-circle. If it does not look like you want it, simply do another pass over it quickly. Apply gentle pressure with the trailing edge, lifting slightly towards the end of the motion. This will make sure the texture imprints but does not make a mess of the previous section or edge. Continue down the row overlapping the edges slightly. It will only need to overlap approximately 1 to 2 in (2.5 to 5.1 cm). The slight overlap will smooth out any over-exaggerated texture between the arcs. Slide your pads carefully as you work. A toe-print down the line may need re-leveling. If you get to your last sweep of a row and don’t have room for a full arc, make one anyways overlapping the previous one. You’re better off texturing everything rather than leaving off an arc. Move down a row and continue overlapping the first slightly. Just as you overlapped left-to-right, you will also want a slight overlap with the top of your new row and the bottom of the previous one. Continue overlapping right-to-left or left-to-right as well. Work to the end of that row and repeat the process until you are totally finished with your sections. Re-edge and groove your joints. Simply run the edging tool and joint tool you used previously along the seams again. The finishing may have smudged your edges slightly, so giving them another pass will make them clean again. That’s all there is to it! You can now let your concrete cure and finish hardening. This typically involves wetting and covering the concrete with a plastic sheet. Foot traffic is usually permitted after 24 hours, cars after about 2 weeks, and full curing after a month. Refer to your specific mix’s instructions to see what is required. After about a month, you should also apply a sealant to make it more moisture resistant and easy to clean.",
  "tyn_model":[
    "concrete",
    "trowel",
    "trowels",
    "pads",
    "edging tool",
    "plastic sheet",
    "sealant"
  ],
  "tyn_section":[

  ]
}