{
  "title":"How to Make Flowers from Old Bread",
  "url":"https://www.wikihow.com/Make-Flowers-from-Old-Bread",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts",
    "Leaf and Flower Crafts"
  ],
  "steps":[
    {
      "headline":"Spread the slices of bread on a tray.",
      "description":"Dry them under the sunshine (in the windowsill is fine) for about half an hour. If there is no sun, dry in an oven on very low heat. Make sure that both sides of the slices are dried. When dry, each slice should be very crispy. Separate the middle part from the crust. This is to make sure you get the color you want. The middle part is whiter, while the crust or outer part of the bread is almost brownish. You can use the middle part to make the rose petals and the brownish part for the leaves. You can mix them however, depending on the color you want your flowers to be. So, if you want white roses, use only the middle part for the petals."
    },
    {
      "headline":"Crush the bread to form fine crumbs.",
      "description":"You can use a food processor to do this."
    },
    {
      "headline":"Add in the white glue to the breadcrumbs.",
      "description":"Mix them well to form dough (similar to pastry dough). The texture of this dough should also be similar to pastry dough. At this point, you can add in the oil color of your choice. Again, work the dough well so that the color is evenly spread and mixed with the dough."
    },
    {
      "headline":"Start making the flower of your choice now.",
      "description":"It is recommended that you make thin petals, at least while you're learning. While thick petals are alright, the thin ones dry faster. For a rose:\nWork from the inside first. Create the inner part of the rose, and decide on how big or small you want it to be. Then, use your palm to make each of the rose petals. Alternatively, press the dough over the curve of a bottle or a rolling pin to form the curved shape instantly. Use the artificial stem as the holder or stem for your rose base (or your own choice of flower). When using the artificial stem, bend the edge a little bit to form a curve. This prevents the petals from slipping away from the stems once they are dried."
    },
    {
      "headline":"Wait until you are finished with the roses, and put them in a standing position (vertical upward position) in a vase.",
      "description":"Put these flowers under the sunshine to dry (again, the windowsill is fine). They will harden and dry in a day or two under direct sunshine."
    },
    {
      "headline":"Make sure that the flowers are completely dry before completing this step.",
      "description":"Dip each rose into the wood varnish to cover completely. Then let them dry again. This varnish acts as a protector or a shield for the flowers and helps them to last longer. It also makes dusting them much easier. You can also use spray varnish but it is much more expensive."
    },
    {
      "headline":"Finished.",
      "description":""
    },
    {
      "headline":"Share your results.",
      "description":""
    }
  ],
  "text":" Spread the slices of bread on a tray. Dry them under the sunshine (in the windowsill is fine) for about half an hour. If there is no sun, dry in an oven on very low heat. Make sure that both sides of the slices are dried. When dry, each slice should be very crispy. Separate the middle part from the crust. This is to make sure you get the color you want. The middle part is whiter, while the crust or outer part of the bread is almost brownish. You can use the middle part to make the rose petals and the brownish part for the leaves. You can mix them however, depending on the color you want your flowers to be. So, if you want white roses, use only the middle part for the petals. Crush the bread to form fine crumbs. You can use a food processor to do this. Add in the white glue to the breadcrumbs. Mix them well to form dough (similar to pastry dough). The texture of this dough should also be similar to pastry dough. At this point, you can add in the oil color of your choice. Again, work the dough well so that the color is evenly spread and mixed with the dough. Start making the flower of your choice now. It is recommended that you make thin petals, at least while you're learning. While thick petals are alright, the thin ones dry faster. For a rose:\nWork from the inside first. Create the inner part of the rose, and decide on how big or small you want it to be. Then, use your palm to make each of the rose petals. Alternatively, press the dough over the curve of a bottle or a rolling pin to form the curved shape instantly. Use the artificial stem as the holder or stem for your rose base (or your own choice of flower). When using the artificial stem, bend the edge a little bit to form a curve. This prevents the petals from slipping away from the stems once they are dried. Wait until you are finished with the roses, and put them in a standing position (vertical upward position) in a vase. Put these flowers under the sunshine to dry (again, the windowsill is fine). They will harden and dry in a day or two under direct sunshine. Make sure that the flowers are completely dry before completing this step. Dip each rose into the wood varnish to cover completely. Then let them dry again. This varnish acts as a protector or a shield for the flowers and helps them to last longer. It also makes dusting them much easier. You can also use spray varnish but it is much more expensive. Finished.  Share your results. ",
  "tyn_model":[
    "bread",
    "pastry dough",
    "tray",
    "oven",
    "food processor",
    "white glue",
    "oil",
    "bottle",
    "rolling pin",
    "roses",
    "vase",
    "wood varnish",
    "varnish",
    "spray varnish"
  ],
  "tyn_section":[

  ]
}