{
  "title":"How to Make Asian Noodles",
  "url":"https://www.wikihow.com/Make-Asian-Noodles",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine"
  ],
  "methods":[
    {
      "name":"Making Asian Garlic Noodles",
      "steps":[
        {
          "headline":"Whisk the soy and oyster sauces, garlic, sugar, chili, ginger, and oil.",
          "description":"Get out a bowl or measuring jug and pour in ⁄3 cup (79 ml) of soy sauce, 1 tablespoon (15 ml) of oyster sauce, and 1 teaspoon (4.9 ml) of sesame oil. Whisk in 3 cloves of minced garlic, 2 tablespoon (25 g) of packed brown sugar, 1 tablespoon (17 g) of ground chili paste, and a 1 in (2.5 cm) piece of grated fresh ginger."
        },
        {
          "headline":"Boil ⁄2 pound (230 g) of noodles according to the package directions.",
          "description":"Bring a large pot of water to a boil over high heat. Stir in lo mein, udon, soba, or spaghetti noodles and follow the package directions for the boiling time. Set a colander in the sink and drain the noodles into it once they've finished cooking. Stir the noodles frequently as they cook so they don't clump together."
        },
        {
          "headline":"Heat 1 tablespoon (15 ml) of olive oil over medium-high heat.",
          "description":"Pour the oil into a large skillet and heat the olive oil. The oil should shimmer once it's hot."
        },
        {
          "headline":"Sauté the shrimp in 2 tablespoons (30 ml) of the sauce mixture for 2 to 3 minutes.",
          "description":"Put ⁄4 pound (340 g) of peeled and deveined shrimp in the skillet along with 2 tablespoons (30 ml) of the sauce. Stir and cook the shrimp until it's barely pink."
        },
        {
          "headline":"Cut the mushrooms, pepper, zucchini, and carrot.",
          "description":"Slice ⁄2 pound (230 g) of cremini mushrooms into 1/2 in (1.3 cm) pieces and grate 1 carrot on the coarse side of a box grater. You'll also need to dice 1 red bell pepper and 2 zucchini. If you prefer, substitute yellow or green bell pepper for the red bell pepper."
        },
        {
          "headline":"Add the vegetables to the skillet and sauté them for 3 to 4 minutes.",
          "description":"Use tongs or a spoon to stir the mushrooms, pepper, zucchini, and carrot into the skillet with the shrimp. Stir the mixture frequently until the vegetables become soft and then turn off the burner."
        },
        {
          "headline":"Stir in the cooked noodles and remaining sauce.",
          "description":"Add the drained noodles to the skillet and pour the rest of the sauce over them. Toss the noodles to combine them with the vegetables and the sauce."
        },
        {
          "headline":"Garnish the noodles with cilantro and serve them.",
          "description":"Transfer the noodles to a serving platter and sprinkle 2 tablespoons (2 g) of chopped fresh cilantro leaves across them. Refrigerate leftover noodles in an airtight container for up to 3 to 5 days."
        }
      ]
    },
    {
      "name":"Cooking Shortcut Ramen",
      "steps":[
        {
          "headline":"Sauté the garlic and ginger over medium heat for 1 minute.",
          "description":"Pour 1 tablespoon (15 ml) of olive oil into a large pot and turn the burner to medium heat. Once the oil shimmers, stir in 4 cloves of minced garlic and a 1 in (2.5 cm) piece of freshly grated ginger. Stir the aromatics frequently as they sauté to ensure they don't burn. They should become fragrant."
        },
        {
          "headline":"Whisk in the broth, mushrooms, soy sauce, and water.",
          "description":"Add 4 cups (950 ml) of chicken broth, 3 cups (710 ml) of water, 1 tablespoon (15 ml) of soy sauce, and ⁄4 pound (110 g) of shiitake mushrooms into the pot. Whisk to combine the ingredients with the sautéd aromatics."
        },
        {
          "headline":"Simmer the uncovered mixture for 10 minutes over medium heat.",
          "description":"Turn the burner to high so the liquid begins to boil. Then turn the burner down to medium so the liquid bubbles gently. Simmer the liquid until the mushrooms become soft."
        },
        {
          "headline":"Add the refrigerated yaki-soba and cook it for 2 to 3 minutes.",
          "description":"Open the 17 ounce (480 g) package of refrigerated yaki-soba and discard the seasoning packets that are in it. Stir the noodles into the pot. The noodles should become completely hot. If you can't find a 17 ounce (480 g) package of noodles, you may have to buy several smaller packages."
        },
        {
          "headline":"Stir in the spinach, carrot, chives, and narutomaki (optional).",
          "description":"Grate 1 carrot and add it to the pot along with 3 cups (90 g) of baby spinach and 2 tablespoons (6 g) of chopped chives. If you'd like to add a slightly fishy flavor, include 8 slices of narutomaki. The spinach will wilt after 1 to 2 minutes."
        },
        {
          "headline":"Garnish the ramen with soft-boiled eggs and serve it.",
          "description":"Divide the ramen and broth between 4 serving bowls. Cut 2 soft-boiled eggs in half and put half an egg in each bowl. Serve the shortcut ramen immediately. If you'd like to refrigerate leftover ramen, avoid adding the soft-boiled eggs since these won't keep well. Store the leftover ramen in an airtight container in the refrigerator for up to 3 to 4 days."
        }
      ]
    },
    {
      "name":"Making Vegetable Lo Mein",
      "steps":[
        {
          "headline":"Boil the noodles if you're using fresh white noodles.",
          "description":"Fill a large pot with water and cover it. Turn the burner to high so the water begins to boil. Stir in 1 pound (450 g) of fresh white noodles and boil them for as long as the package instructs. Then drain and rinse the noodles with cold water. Set the noodles aside. You don't need to boil the noodles if you're using fresh lo mein egg noodles."
        },
        {
          "headline":"Mix the soy sauces, sesame oil, sugar, hot water, and five spice powder.",
          "description":"Put 1 teaspoon (4 g) of sugar into a small bowl and pour 1 teaspoon (4.9 ml) of hot water into it. Stir to dissolve the sugar and mix in 1 tablespoon (15 ml) of dark soy sauce, 2 tablespoons (30 ml) of light soy sauce, and 1 teaspoon (4.9 ml) of sesame oil. If you'd like to use five spice powder, stir in just a pinch. Set the lo mein sauce aside while you prepare the vegetables."
        },
        {
          "headline":"Sauté the garlic, mushrooms, and scallions for 30 seconds.",
          "description":"Pour 1 tablespoon (15 ml) of vegetable oil into a wok or large skillet and turn the burner to high heat. Once the oil shimmers, stir in 1 clove of minced garlic, 1 cup (110 g) of sliced mushrooms, and the scallion. For mushrooms, use your choice of shiitakes, button mushrooms, or criminis. The garlic should smell fragrant once it's cooked."
        },
        {
          "headline":"Stir in the pepper, carrots, and wine.",
          "description":"Julienne a bell pepper so it's in thin strips. Add the pepper to your pan along with 1 julienned carrot. Stir the vegetables well and pour in 1 tablespoon (15 ml) of Shaoxing wine. Stir and cook the vegetables for 1 minute."
        },
        {
          "headline":"Add the snow peas and leafy greens and let them wilt.",
          "description":"Take a handful of trimmed snow peas and put them in the pan along with a handful of leafy greens. Stir and cook the peas and greens in the vegetables for about 30 seconds so the greens wilt. For leafy greens, you can use bok choy or choy sum."
        },
        {
          "headline":"Stir the noodles and sauce into the pan.",
          "description":"Use tongs to transfer the noodles into the pan and pour the soy sauce mixture over them. Toss the noodles until they're coated and absorb some of the sauce. Serve the vegetable lo mein immediately. If you had to cook your noodles and they've clumped together, rinse them with warm water to break them up. Refrigerate the leftover noodles in an airtight container for up to 3 to 5 days."
        }
      ]
    }
  ],
  "text":" Making Asian Garlic Noodles Whisk the soy and oyster sauces, garlic, sugar, chili, ginger, and oil. Get out a bowl or measuring jug and pour in ⁄3 cup (79 ml) of soy sauce, 1 tablespoon (15 ml) of oyster sauce, and 1 teaspoon (4.9 ml) of sesame oil. Whisk in 3 cloves of minced garlic, 2 tablespoon (25 g) of packed brown sugar, 1 tablespoon (17 g) of ground chili paste, and a 1 in (2.5 cm) piece of grated fresh ginger. Boil ⁄2 pound (230 g) of noodles according to the package directions. Bring a large pot of water to a boil over high heat. Stir in lo mein, udon, soba, or spaghetti noodles and follow the package directions for the boiling time. Set a colander in the sink and drain the noodles into it once they've finished cooking. Stir the noodles frequently as they cook so they don't clump together. Heat 1 tablespoon (15 ml) of olive oil over medium-high heat. Pour the oil into a large skillet and heat the olive oil. The oil should shimmer once it's hot. Sauté the shrimp in 2 tablespoons (30 ml) of the sauce mixture for 2 to 3 minutes. Put ⁄4 pound (340 g) of peeled and deveined shrimp in the skillet along with 2 tablespoons (30 ml) of the sauce. Stir and cook the shrimp until it's barely pink. Cut the mushrooms, pepper, zucchini, and carrot. Slice ⁄2 pound (230 g) of cremini mushrooms into 1/2 in (1.3 cm) pieces and grate 1 carrot on the coarse side of a box grater. You'll also need to dice 1 red bell pepper and 2 zucchini. If you prefer, substitute yellow or green bell pepper for the red bell pepper. Add the vegetables to the skillet and sauté them for 3 to 4 minutes. Use tongs or a spoon to stir the mushrooms, pepper, zucchini, and carrot into the skillet with the shrimp. Stir the mixture frequently until the vegetables become soft and then turn off the burner. Stir in the cooked noodles and remaining sauce. Add the drained noodles to the skillet and pour the rest of the sauce over them. Toss the noodles to combine them with the vegetables and the sauce. Garnish the noodles with cilantro and serve them. Transfer the noodles to a serving platter and sprinkle 2 tablespoons (2 g) of chopped fresh cilantro leaves across them. Refrigerate leftover noodles in an airtight container for up to 3 to 5 days. Cooking Shortcut Ramen Sauté the garlic and ginger over medium heat for 1 minute. Pour 1 tablespoon (15 ml) of olive oil into a large pot and turn the burner to medium heat. Once the oil shimmers, stir in 4 cloves of minced garlic and a 1 in (2.5 cm) piece of freshly grated ginger. Stir the aromatics frequently as they sauté to ensure they don't burn. They should become fragrant. Whisk in the broth, mushrooms, soy sauce, and water. Add 4 cups (950 ml) of chicken broth, 3 cups (710 ml) of water, 1 tablespoon (15 ml) of soy sauce, and ⁄4 pound (110 g) of shiitake mushrooms into the pot. Whisk to combine the ingredients with the sautéd aromatics. Simmer the uncovered mixture for 10 minutes over medium heat. Turn the burner to high so the liquid begins to boil. Then turn the burner down to medium so the liquid bubbles gently. Simmer the liquid until the mushrooms become soft. Add the refrigerated yaki-soba and cook it for 2 to 3 minutes. Open the 17 ounce (480 g) package of refrigerated yaki-soba and discard the seasoning packets that are in it. Stir the noodles into the pot. The noodles should become completely hot. If you can't find a 17 ounce (480 g) package of noodles, you may have to buy several smaller packages. Stir in the spinach, carrot, chives, and narutomaki (optional). Grate 1 carrot and add it to the pot along with 3 cups (90 g) of baby spinach and 2 tablespoons (6 g) of chopped chives. If you'd like to add a slightly fishy flavor, include 8 slices of narutomaki. The spinach will wilt after 1 to 2 minutes. Garnish the ramen with soft-boiled eggs and serve it. Divide the ramen and broth between 4 serving bowls. Cut 2 soft-boiled eggs in half and put half an egg in each bowl. Serve the shortcut ramen immediately. If you'd like to refrigerate leftover ramen, avoid adding the soft-boiled eggs since these won't keep well. Store the leftover ramen in an airtight container in the refrigerator for up to 3 to 4 days. Making Vegetable Lo Mein Boil the noodles if you're using fresh white noodles. Fill a large pot with water and cover it. Turn the burner to high so the water begins to boil. Stir in 1 pound (450 g) of fresh white noodles and boil them for as long as the package instructs. Then drain and rinse the noodles with cold water. Set the noodles aside. You don't need to boil the noodles if you're using fresh lo mein egg noodles. Mix the soy sauces, sesame oil, sugar, hot water, and five spice powder. Put 1 teaspoon (4 g) of sugar into a small bowl and pour 1 teaspoon (4.9 ml) of hot water into it. Stir to dissolve the sugar and mix in 1 tablespoon (15 ml) of dark soy sauce, 2 tablespoons (30 ml) of light soy sauce, and 1 teaspoon (4.9 ml) of sesame oil. If you'd like to use five spice powder, stir in just a pinch. Set the lo mein sauce aside while you prepare the vegetables. Sauté the garlic, mushrooms, and scallions for 30 seconds. Pour 1 tablespoon (15 ml) of vegetable oil into a wok or large skillet and turn the burner to high heat. Once the oil shimmers, stir in 1 clove of minced garlic, 1 cup (110 g) of sliced mushrooms, and the scallion. For mushrooms, use your choice of shiitakes, button mushrooms, or criminis. The garlic should smell fragrant once it's cooked. Stir in the pepper, carrots, and wine. Julienne a bell pepper so it's in thin strips. Add the pepper to your pan along with 1 julienned carrot. Stir the vegetables well and pour in 1 tablespoon (15 ml) of Shaoxing wine. Stir and cook the vegetables for 1 minute. Add the snow peas and leafy greens and let them wilt. Take a handful of trimmed snow peas and put them in the pan along with a handful of leafy greens. Stir and cook the peas and greens in the vegetables for about 30 seconds so the greens wilt. For leafy greens, you can use bok choy or choy sum. Stir the noodles and sauce into the pan. Use tongs to transfer the noodles into the pan and pour the soy sauce mixture over them. Toss the noodles until they're coated and absorb some of the sauce. Serve the vegetable lo mein immediately. If you had to cook your noodles and they've clumped together, rinse them with warm water to break them up. Refrigerate the leftover noodles in an airtight container for up to 3 to 5 days.",
  "tyn_model":[
    "mushrooms",
    "noodles",
    "garlic",
    "water",
    "carrot",
    "soy sauce",
    "ramen",
    "sugar",
    "shrimp",
    "skillet",
    "pepper",
    "burner",
    "ginger",
    "oil",
    "sesame oil",
    "large pot",
    "olive oil",
    "zucchini",
    "airtight container",
    "pot",
    "red bell pepper",
    "bell pepper",
    "vegetables",
    "cilantro",
    "broth",
    "yaki-soba",
    "spinach",
    "chives",
    "eggs",
    "hot water",
    "five spice powder",
    "snow peas",
    "soy and oyster sauces",
    "chili",
    "bowl",
    "oyster sauce",
    "minced garlic",
    "packed brown sugar",
    "ground chili paste",
    "fresh ginger",
    "lo mein,",
    "spaghetti noodles",
    "colander",
    "large skillet",
    "cremini mushrooms",
    "box grater",
    "spoon",
    "serving platter",
    "cooking shortcut ramen",
    "chicken broth",
    "shiitake mushrooms",
    "baby spinach",
    "narutomaki",
    "soft-boiled eggs",
    "refrigerator",
    "cold water",
    "soy sauces",
    "small bowl",
    "dark soy sauce",
    "lo mein sauce",
    "scallions",
    "vegetable oil",
    "wok or large skillet",
    "scallion",
    "button mushrooms",
    "carrots",
    "wine",
    "shaoxing wine",
    "leafy greens",
    "pan",
    "peas",
    "bok choy",
    "vegetable lo mein"
  ],
  "tyn_section":[

  ]
}