{
  "title":"How to Eat Muesli",
  "url":"https://www.wikihow.com/Eat-Muesli",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Breakfast Cereal",
    "Granola and Muesli"
  ],
  "methods":[
    {
      "name":"Basic Eating Methods",
      "steps":[
        {
          "headline":"Eat it like you would eat cereal as it is widely considered a type of cereal globally.",
          "description":"The most basic and common way to eat muesli is just as you would eat a bowl of cereal, adding about a half cup of your favorite milk to an equal helping of muesli in a bowl. Instead of milk, try your favorite brand of plain yoghurt (or flavoured if your prefer extra sweetness) for probiotic benefits and a different flavor and texture. Try heating the milk, then letting the muesli soak for a few minutes in the hot milk to soften it slightly, making it a bit more like oatmeal. You can also pour cold milk over the cereal in a microwave safe bowl, then heat the whole mixture in the microwave. Like cereal, it's also great to snack on all by itself. Just snack on it like granola."
        },
        {
          "headline":"Add sliced fresh or frozen fruit.",
          "description":"If you want to lively up your bowl of muesli, try chopping up a quarter-cup or so of your favorite fresh fruit, or adding some frozen fruit for a cold treat. Any of the following work great with muesli:\nSliced banana\nBlueberries, blackberries, or raspberries\nKiwi\nStrawberries (the seeds work especially well as they add an extra sour crunch)\nPork Scratchings (ideal if you want a more savoury muesli)\nDiced apple\nChopped pear\nSliced mango\nLychees work especially well as they add a crisp sour flavour, which can't be topped\nPomegranate seeds"
        },
        {
          "headline":"Try dried fruits as well.",
          "description":"Dried fruits or berries are often a component of some muesli recipes already, but if you want to add some extra or add some to a more plain muesli that you've made, all of the following work well:\nCranberries\nApricot\nGoji berries\nRaisins or sultanas\nCurrants"
        },
        {
          "headline":"Try soaking the muesli overnight.",
          "description":"One excellent method of changing up the texture of your muesli is to soak it overnight in milk, yoghurt, or another softener of your choice. Add equal parts of muesli and milk to a bowl, cover with plastic wrap, or a lid, and refrigerate overnight. This can turn the muesli into a cold porridge type mixture that many people really enjoy. Coconut milk makes for a great soaking mixture, adding gentle sweetness and subtle flavor to the muesli. If you're not crazy about the taste, you could also mix it in with a little milk to make it more palatable."
        },
        {
          "headline":"Add some muesli into a smoothie.",
          "description":"If you favor a smoothie instead of cereal, muesli makes for a great addition or topping, either before or after mixing it up. It mixes in quite nicely and helps to add texture and nutrition to any smoothie recipe. Try the following simple mixture:\nA handful of frozen strawberries, or your favorite frozen fruit\nOne half cup of yoghurt or kefir\nOne half cup of shredded coconut\nTwo tablespoons of muesli"
        },
        {
          "headline":"Mix with applesauce.",
          "description":"If you're lactose-intolerant, or just want to mix up your muesli experience with a different texture or flavor, applesauce makes for a great alternative. Try unsweetened natural applesauce, or cook down some over-ripe apples yourself to keep it healthy."
        },
        {
          "headline":"Cook the muesli into porridge.",
          "description":"One of the things some people like about muesli is the thing some people don't like about muesli. The raw oats offer a different texture and nutritional benefits not offered by cooked oatmeal or granola, but also offer the possibility of cooking into a simple porridge, just like basic raw oats. Boil as much milk and water as you want to yield in cooked muesli, then add half as much muesli to the pot. If you want a cup of cooked muesli, in other words, boil a half cup of water and a half cup of milk, then add a half cup of raw muesli to it. Lower the temperature and cook the muesli covered for 10-15 minutes, stirring occasionally, until it reaches the desired consistency. Eat it any time it looks good."
        },
        {
          "headline":"Try soaking it in coffee or orange juice.",
          "description":"While it may sound odd, another good lactose-free possibility is orange juice, apple juice, or even–brace yourself–some coffee. Think of it like a total-breakfast. You might surprise yourself with how good it actually tastes."
        }
      ]
    },
    {
      "name":"Making Your Own Muesli Mixtures",
      "steps":[
        {
          "headline":"Try the original Bircher-Benner recipe.",
          "description":"Muesli was originally invented by a Swiss physicians named Maximilian Bircher-Benner. While most modern versions of muesli have a high oat-to-fruit ratio, the original was more fruit and nut heavy. His original recipe for the healthy mixture used the following ratios:\n1 tablespoon rolled oats, soaked in 2–3 tablespoons water\n1 tablespoon lemon juice\n1 tablespoon cream\n1 large, sour apple, finely grated and mixed in directly before serving\nTop with 1 tablespoon ground hazelnuts or almonds"
        },
        {
          "headline":"Add sweetener, if necessary.",
          "description":"For some people, basic muesli can be a little bland. If you want to sweeten it up a bit, try adding a small amount of sweetener to your mixture to make it more satisfying. Whatever you use, use it conservatively. All of the following make great sweeteners or light seasoning:\nHoney\nMolasses\nBrown sugar\nCinnamon\nToasted coconut\nLemon Juice\nAgave syrup\nMaple syrup\nNutmeg"
        },
        {
          "headline":"Bake or toast the muesli slightly.",
          "description":"If you'd like your muesli mixture to be a little more crunchy, try baking it on a cookie sheet at 325 degrees for about 30 minutes, or until the mixture becomes golden brown. It might be helpful to add a small amount of coconut oil, or melted butter to the muesli, to encourage browning."
        },
        {
          "headline":"Make muesli bars.",
          "description":"One great way of making your muesli mobile is to mold it into bars that you can eat on the go. Mix muesli with a few tablespoons of peanut butter, or your favorite nut butter, to act as a binder, and add whatever add-ins you want. Additional dried fruit, nuts, and other cereals all work great. Press the mixture into a baking pan, about an inch-thick, and let it chill thoroughly in the fridge. Cut into bars and keep them in the refrigerator for a quick snack. You can also use melted butter and honey as a binder, pressing the mixture into a pan and letting it firm up."
        },
        {
          "headline":"Add muesli to baking batters.",
          "description":"Muesli can be used as a replacement for any recipe that calls for rolled oats or oatmeal. Cookies, muffins, and even pancakes can be made a little more healthful and tasty with the addition of a small amount of muesli. Try replacing the oats with muesli in any of the listed recipes below:\nCookies\nPancakes\nCakes\nMuffins"
        }
      ]
    }
  ],
  "text":" Basic Eating Methods Eat it like you would eat cereal as it is widely considered a type of cereal globally. The most basic and common way to eat muesli is just as you would eat a bowl of cereal, adding about a half cup of your favorite milk to an equal helping of muesli in a bowl. Instead of milk, try your favorite brand of plain yoghurt (or flavoured if your prefer extra sweetness) for probiotic benefits and a different flavor and texture. Try heating the milk, then letting the muesli soak for a few minutes in the hot milk to soften it slightly, making it a bit more like oatmeal. You can also pour cold milk over the cereal in a microwave safe bowl, then heat the whole mixture in the microwave. Like cereal, it's also great to snack on all by itself. Just snack on it like granola. Add sliced fresh or frozen fruit. If you want to lively up your bowl of muesli, try chopping up a quarter-cup or so of your favorite fresh fruit, or adding some frozen fruit for a cold treat. Any of the following work great with muesli:\nSliced banana\nBlueberries, blackberries, or raspberries\nKiwi\nStrawberries (the seeds work especially well as they add an extra sour crunch)\nPork Scratchings (ideal if you want a more savoury muesli)\nDiced apple\nChopped pear\nSliced mango\nLychees work especially well as they add a crisp sour flavour, which can't be topped\nPomegranate seeds Try dried fruits as well. Dried fruits or berries are often a component of some muesli recipes already, but if you want to add some extra or add some to a more plain muesli that you've made, all of the following work well:\nCranberries\nApricot\nGoji berries\nRaisins or sultanas\nCurrants Try soaking the muesli overnight. One excellent method of changing up the texture of your muesli is to soak it overnight in milk, yoghurt, or another softener of your choice. Add equal parts of muesli and milk to a bowl, cover with plastic wrap, or a lid, and refrigerate overnight. This can turn the muesli into a cold porridge type mixture that many people really enjoy. Coconut milk makes for a great soaking mixture, adding gentle sweetness and subtle flavor to the muesli. If you're not crazy about the taste, you could also mix it in with a little milk to make it more palatable. Add some muesli into a smoothie. If you favor a smoothie instead of cereal, muesli makes for a great addition or topping, either before or after mixing it up. It mixes in quite nicely and helps to add texture and nutrition to any smoothie recipe. Try the following simple mixture:\nA handful of frozen strawberries, or your favorite frozen fruit\nOne half cup of yoghurt or kefir\nOne half cup of shredded coconut\nTwo tablespoons of muesli Mix with applesauce. If you're lactose-intolerant, or just want to mix up your muesli experience with a different texture or flavor, applesauce makes for a great alternative. Try unsweetened natural applesauce, or cook down some over-ripe apples yourself to keep it healthy. Cook the muesli into porridge. One of the things some people like about muesli is the thing some people don't like about muesli. The raw oats offer a different texture and nutritional benefits not offered by cooked oatmeal or granola, but also offer the possibility of cooking into a simple porridge, just like basic raw oats. Boil as much milk and water as you want to yield in cooked muesli, then add half as much muesli to the pot. If you want a cup of cooked muesli, in other words, boil a half cup of water and a half cup of milk, then add a half cup of raw muesli to it. Lower the temperature and cook the muesli covered for 10-15 minutes, stirring occasionally, until it reaches the desired consistency. Eat it any time it looks good. Try soaking it in coffee or orange juice. While it may sound odd, another good lactose-free possibility is orange juice, apple juice, or even–brace yourself–some coffee. Think of it like a total-breakfast. You might surprise yourself with how good it actually tastes. Making Your Own Muesli Mixtures Try the original Bircher-Benner recipe. Muesli was originally invented by a Swiss physicians named Maximilian Bircher-Benner. While most modern versions of muesli have a high oat-to-fruit ratio, the original was more fruit and nut heavy. His original recipe for the healthy mixture used the following ratios:\n1 tablespoon rolled oats, soaked in 2–3 tablespoons water\n1 tablespoon lemon juice\n1 tablespoon cream\n1 large, sour apple, finely grated and mixed in directly before serving\nTop with 1 tablespoon ground hazelnuts or almonds Add sweetener, if necessary. For some people, basic muesli can be a little bland. If you want to sweeten it up a bit, try adding a small amount of sweetener to your mixture to make it more satisfying. Whatever you use, use it conservatively. All of the following make great sweeteners or light seasoning:\nHoney\nMolasses\nBrown sugar\nCinnamon\nToasted coconut\nLemon Juice\nAgave syrup\nMaple syrup\nNutmeg Bake or toast the muesli slightly. If you'd like your muesli mixture to be a little more crunchy, try baking it on a cookie sheet at 325 degrees for about 30 minutes, or until the mixture becomes golden brown. It might be helpful to add a small amount of coconut oil, or melted butter to the muesli, to encourage browning. Make muesli bars. One great way of making your muesli mobile is to mold it into bars that you can eat on the go. Mix muesli with a few tablespoons of peanut butter, or your favorite nut butter, to act as a binder, and add whatever add-ins you want. Additional dried fruit, nuts, and other cereals all work great. Press the mixture into a baking pan, about an inch-thick, and let it chill thoroughly in the fridge. Cut into bars and keep them in the refrigerator for a quick snack. You can also use melted butter and honey as a binder, pressing the mixture into a pan and letting it firm up. Add muesli to baking batters. Muesli can be used as a replacement for any recipe that calls for rolled oats or oatmeal. Cookies, muffins, and even pancakes can be made a little more healthful and tasty with the addition of a small amount of muesli. Try replacing the oats with muesli in any of the listed recipes below:\nCookies\nPancakes\nCakes\nMuffins",
  "tyn_model":[
    "muesli",
    "milk",
    "cereal",
    "oats",
    "yoghurt",
    "applesauce",
    "granola",
    "strawberries",
    "berries",
    "oatmeal",
    "water",
    "coffee",
    "orange juice",
    "lemon juice",
    "sweetener",
    "honey",
    "butter",
    "microwave safe bowl",
    "microwave",
    "banana",
    "blueberries",
    "blackberries",
    "raspberries",
    "apple",
    "pear",
    "mango",
    "pomegranate",
    "fruits",
    "cranberries",
    "apricot",
    "raisins",
    "currants",
    "bowl",
    "plastic wrap",
    "coconut milk",
    "kefir",
    "shredded coconut",
    "apples",
    "porridge",
    "pot",
    "apple juice",
    "–brace",
    "–some",
    "rolled oats",
    "cream",
    "almonds",
    "molasses",
    "brown sugar",
    "cinnamon",
    "coconut",
    "agave syrup",
    "maple syrup",
    "cookie sheet",
    "coconut oil",
    "peanut butter",
    "nut butter",
    "nuts",
    "baking pan",
    "refrigerator",
    "pan",
    "pancakes",
    "muffins"
  ],
  "tyn_section":[

  ]
}