{
  "title":"How to Format an SD Card on the Nintendo Switch",
  "url":"https://www.wikihow.com/Format-an-SD-Card-on-the-Nintendo-Switch",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles"
  ],
  "steps":[
    {
      "headline":"Insert a micro SD card.",
      "description":"The micro SD card slot is below the kickstand on the back of the Nintendo Switch. Insert it with the label facing away from the console."
    },
    {
      "headline":"Power the Nintendo Switch on.",
      "description":"To power on the Nintendo Switch, press the power button on the top of the Nintendo Switch. It's the button that has an icon of a circle with a line through it. It's on the left side of the Nintendo Switch next to the \"+\" and \"-\" volume buttons. If you insert a micro SD card with previous data on it, you will be asked to format the micro SD card. Select Format to and follow the instructions to format the SD card immediately. Select Later to do it later on through the System Settings menu."
    },
    {
      "headline":"Select the gear icon on the home screen.",
      "description":"The icon that resembles a gear on the Home screen is the System Settings menu. Select this icon to open System Settings. You can select items on the Nintendo Switch by tapping the screen or navigating to it with the controller and pressing \"A\"."
    },
    {
      "headline":"Scroll down and select System.",
      "description":"The \"System\" option is at the very bottom of the System Settings menu."
    },
    {
      "headline":"Scroll down and select Formatting Options.",
      "description":"It's the last option on the System menu in System Settings. If you have parental controls set up, you will be required to enter your parental control PIN to access Formatting Options."
    },
    {
      "headline":"Select Format microSD Card.",
      "description":"It's the second option from the bottom of the Formatting Options menu."
    },
    {
      "headline":"Select Continue.",
      "description":"A warning screen appears advising you to backup all important data from the micro SD card before formatting it. If you don't wish to backup anything from the micro SD card, select Continue. If you want to retrieve data from the micro SD card, select Cancel and remove the micro SD card. Backup the data you want to keep before formatting it. You will not be able to retrieve any data on the micro SD card after formatting it."
    },
    {
      "headline":"Select Format.",
      "description":"It's the red button in the center of the screen. This will erase all the contents of your micro SD card and format it. The micro SD card storage space will be available to use with the Nintendo Switch immediately."
    }
  ],
  "text":" Insert a micro SD card. The micro SD card slot is below the kickstand on the back of the Nintendo Switch. Insert it with the label facing away from the console. Power the Nintendo Switch on. To power on the Nintendo Switch, press the power button on the top of the Nintendo Switch. It's the button that has an icon of a circle with a line through it. It's on the left side of the Nintendo Switch next to the \"+\" and \"-\" volume buttons. If you insert a micro SD card with previous data on it, you will be asked to format the micro SD card. Select Format to and follow the instructions to format the SD card immediately. Select Later to do it later on through the System Settings menu. Select the gear icon on the home screen. The icon that resembles a gear on the Home screen is the System Settings menu. Select this icon to open System Settings. You can select items on the Nintendo Switch by tapping the screen or navigating to it with the controller and pressing \"A\". Scroll down and select System. The \"System\" option is at the very bottom of the System Settings menu. Scroll down and select Formatting Options. It's the last option on the System menu in System Settings. If you have parental controls set up, you will be required to enter your parental control PIN to access Formatting Options. Select Format microSD Card. It's the second option from the bottom of the Formatting Options menu. Select Continue. A warning screen appears advising you to backup all important data from the micro SD card before formatting it. If you don't wish to backup anything from the micro SD card, select Continue. If you want to retrieve data from the micro SD card, select Cancel and remove the micro SD card. Backup the data you want to keep before formatting it. You will not be able to retrieve any data on the micro SD card after formatting it. Select Format. It's the red button in the center of the screen. This will erase all the contents of your micro SD card and format it. The micro SD card storage space will be available to use with the Nintendo Switch immediately.",
  "tyn_model":[
    "micro sd card",
    "nintendo switch",
    "parental control pin",
    "microsd card"
  ],
  "tyn_section":[

  ]
}