{
  "title":"How to Prepare Fresh Citrus Fruit Peel",
  "url":"https://www.wikihow.com/Prepare-Fresh-Citrus-Fruit-Peel",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "steps":[
    {
      "headline":"Choose a fruit that is free of pesticides, dyes, and wax (since you will be eating the outer peel).",
      "description":"If at all possible, start with an organic orange, lemon, or other citrus fruit. While some authorities recommend the use of organic citrus fruit, it is difficult to find. Thoroughly washing and drying the fruit should make the fruit safe to eat. If there is a concern, shop for organic citrus fruit."
    },
    {
      "headline":"Wash and dry the fruit thoroughly, whether it is organic or not.",
      "description":"Cut out any discolorations or bad spots."
    },
    {
      "headline":"Hold the zester in your hand, much like a vegetable peeler, while applying pressure to the fruit.",
      "description":"Pull the the zester across the surface and the zest will appear."
    },
    {
      "headline":"Adopt the same basic technique if using a microplane.",
      "description":"A microplane is like a grater. Pull it across the fruit to separate the zest."
    },
    {
      "headline":"Try the old-fashioned method for grating zest.",
      "description":"If you do not have a zester or microplane, take a vegetable peeler and peel the citrus rind. Once the peel is removed, finely mince the zest using a knife. The food processor can also mince the peel, if a food processor is available."
    },
    {
      "headline":"Freeze the zest.",
      "description":"Once the citrus fruit peel has been zested, freeze it in small freezer storage bags or containers. The zest is available for later cooking."
    },
    {
      "headline":"Alternatively, dry the zest.",
      "description":"Spread it in a single layer on a plate or waxed paper and leave it exposed to the air until it is dry enough to be brittle (a couple of days)."
    },
    {
      "headline":"Store the dried zest it in a sealed jar in a cool, dry place.",
      "description":""
    }
  ],
  "text":" Choose a fruit that is free of pesticides, dyes, and wax (since you will be eating the outer peel). If at all possible, start with an organic orange, lemon, or other citrus fruit. While some authorities recommend the use of organic citrus fruit, it is difficult to find. Thoroughly washing and drying the fruit should make the fruit safe to eat. If there is a concern, shop for organic citrus fruit. Wash and dry the fruit thoroughly, whether it is organic or not. Cut out any discolorations or bad spots. Hold the zester in your hand, much like a vegetable peeler, while applying pressure to the fruit. Pull the the zester across the surface and the zest will appear. Adopt the same basic technique if using a microplane. A microplane is like a grater. Pull it across the fruit to separate the zest. Try the old-fashioned method for grating zest. If you do not have a zester or microplane, take a vegetable peeler and peel the citrus rind. Once the peel is removed, finely mince the zest using a knife. The food processor can also mince the peel, if a food processor is available. Freeze the zest. Once the citrus fruit peel has been zested, freeze it in small freezer storage bags or containers. The zest is available for later cooking. Alternatively, dry the zest. Spread it in a single layer on a plate or waxed paper and leave it exposed to the air until it is dry enough to be brittle (a couple of days). Store the dried zest it in a sealed jar in a cool, dry place. ",
  "tyn_model":[
    "citrus fruit",
    "zester",
    "vegetable peeler",
    "lemon",
    "grater",
    "citrus",
    "knife",
    "food processor",
    "citrus fruit peel"
  ],
  "tyn_section":[

  ]
}