{
  "title":"How to Make Chocolate Toffee Squares",
  "url":"https://www.wikihow.com/Make-Chocolate-Toffee-Squares",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Toffee"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350°/180ºC.",
      "description":"Lightly grease the 9 x 13 inch (23cm x 33cm) cake pan with cooking spray or coconut oil."
    },
    {
      "headline":"Mix all but the chocolate and nuts together in the mixer.",
      "description":"This will make the toffee batter."
    },
    {
      "headline":"Spread the toffee batter in the cake pan using the rubber spatula.",
      "description":"Try to make the batter as even as possible."
    },
    {
      "headline":"Place the toffee batter in the preheated oven.",
      "description":"Bake for 12 to 15 minutes. Take the toffee out of the oven using the oven mitts."
    },
    {
      "headline":"Lay one layer of chocolate over top of the toffee; for the best effect, put the chocolate on the hot toffee as soon as the toffee is taken out of the oven.",
      "description":"Spread the melting chocolate with the rubber spatula until the top of the toffee has been evenly covered."
    },
    {
      "headline":"Sprinkle the chocolate with chopped nuts.",
      "description":"While optional, if you like nuts, this is a tasty and crunchy addition."
    },
    {
      "headline":"Put the chocolate toffee squares in the refrigerator for 2 hours or until chocolate is hard.",
      "description":"After the chocolate has hardened and is firm, cut into squares of about 2\"x2\" or so. Serve and enjoy!"
    }
  ],
  "text":" Preheat the oven to 350°/180ºC. Lightly grease the 9 x 13 inch (23cm x 33cm) cake pan with cooking spray or coconut oil. Mix all but the chocolate and nuts together in the mixer. This will make the toffee batter. Spread the toffee batter in the cake pan using the rubber spatula. Try to make the batter as even as possible. Place the toffee batter in the preheated oven. Bake for 12 to 15 minutes. Take the toffee out of the oven using the oven mitts. Lay one layer of chocolate over top of the toffee; for the best effect, put the chocolate on the hot toffee as soon as the toffee is taken out of the oven. Spread the melting chocolate with the rubber spatula until the top of the toffee has been evenly covered. Sprinkle the chocolate with chopped nuts. While optional, if you like nuts, this is a tasty and crunchy addition. Put the chocolate toffee squares in the refrigerator for 2 hours or until chocolate is hard. After the chocolate has hardened and is firm, cut into squares of about 2\"x2\" or so. Serve and enjoy!",
  "tyn_model":[
    "chocolate",
    "oven",
    "nuts",
    "cake pan",
    "toffee batter",
    "rubber spatula",
    "cooking spray",
    "coconut oil",
    "mixer",
    "oven mitts",
    "chocolate toffee",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}