{
  "title":"How to Get a Rebate",
  "url":"https://www.wikihow.com/Get-a-Rebate",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping"
  ],
  "methods":[
    {
      "name":"Completing a Mail-In Rebate",
      "steps":[
        {
          "headline":"Find offers for mail-in rebates online and in-store.",
          "description":"Take a look at store displays. Products may have a small sticker on them indicating that it has a rebate offer. Also keep an eye out as you’re shopping online. Some items will have a rebate form that you can click on in the details of the product."
        },
        {
          "headline":"Hold on to the receipt.",
          "description":"It'll be required for all mail-in rebates. You may also want to take a picture of the receipt for your own record."
        },
        {
          "headline":"Read the rebate form carefully.",
          "description":"You’ll want to look for any specific information or conditions for the rebate. Oftentimes there will be specific brands, sizes, or even flavors of the product that are needed to get the rebate. Most retailers will have printable rebate forms on their website. You can also search for a more general rebate form online that can be used for things like groceries. When in doubt about where to get a rebate form for an in-store product, feel free to ask a worker at the establishment while you’re there."
        },
        {
          "headline":"Fill out the form for the mail-in rebate.",
          "description":"You'll need to provide your name, mailing address, and possibly an email address or phone number. Make sure and double check that you’re not missing anything else that they may be requesting. Read through the form carefully and make sure that you're not missing anything."
        },
        {
          "headline":"Submit your form.",
          "description":"Purchase an envelope and in it you’ll need to put: your completed mail-in rebate form, your receipt, the UPC barcode for the product, and whatever else the form specifies. Triple check that you have everything in your envelope before sending it off. it."
        },
        {
          "headline":"Be sure to check what the deadline is for the mail-in rebate.",
          "description":"Your rebate form will include dates that tell you when the rebate starts, when you should have the product purchased by, and the date that the rebate needs to be postmarked or received by. To be on the safe side, it's always better to track your mail-in rebates so that you know what's coming."
        }
      ]
    },
    {
      "name":"Getting an Online Cash Rebate",
      "steps":[
        {
          "headline":"Select a cashback site that is compatible with the retailer.",
          "description":"If you're not already signed up with that particular cashback site, you'll have to do so before purchasing anything to get the rebate. Rebates claimed electronically are also processed at a faster pace, resulting in you receiving your rebate faster."
        },
        {
          "headline":"Look at reviews for rebate websites.",
          "description":"There are a lot of scammers out there in the rebate business. You’ll want to be as sure as possible that the company or website you are using is a trustworthy one."
        },
        {
          "headline":"Identify the percentage of cashback for a product.",
          "description":"Online cashback rebates will usually be offered at a range between 1 and 5 percent. Keep track of the percentage of rebate now to ensure that it’s the correct amount that you receive later."
        },
        {
          "headline":"Select a product that comes with a rebate.",
          "description":"Depending on the cashback site that you’ve registered with and synced to your online shopping, you may see your total automatically decrease, indicating that the rebate has been processed. Other cashback sites will simply collect the amount from rebates at their website. The balance will remain there until you’re ready to use it. Make sure you understand how the rebate will be offered before you make your purchase."
        },
        {
          "headline":"Track your rebates.",
          "description":"Just like you would do with any other rebate, it's best to keep track of them. It's important to do this for electronic rebates as they may be harder to keep track of due to the speediness of the transaction. A spreadsheet will be great for this."
        }
      ]
    }
  ],
  "text":" Completing a Mail-In Rebate Find offers for mail-in rebates online and in-store. Take a look at store displays. Products may have a small sticker on them indicating that it has a rebate offer. Also keep an eye out as you’re shopping online. Some items will have a rebate form that you can click on in the details of the product. Hold on to the receipt. It'll be required for all mail-in rebates. You may also want to take a picture of the receipt for your own record. Read the rebate form carefully. You’ll want to look for any specific information or conditions for the rebate. Oftentimes there will be specific brands, sizes, or even flavors of the product that are needed to get the rebate. Most retailers will have printable rebate forms on their website. You can also search for a more general rebate form online that can be used for things like groceries. When in doubt about where to get a rebate form for an in-store product, feel free to ask a worker at the establishment while you’re there. Fill out the form for the mail-in rebate. You'll need to provide your name, mailing address, and possibly an email address or phone number. Make sure and double check that you’re not missing anything else that they may be requesting. Read through the form carefully and make sure that you're not missing anything. Submit your form. Purchase an envelope and in it you’ll need to put: your completed mail-in rebate form, your receipt, the UPC barcode for the product, and whatever else the form specifies. Triple check that you have everything in your envelope before sending it off. it. Be sure to check what the deadline is for the mail-in rebate. Your rebate form will include dates that tell you when the rebate starts, when you should have the product purchased by, and the date that the rebate needs to be postmarked or received by. To be on the safe side, it's always better to track your mail-in rebates so that you know what's coming. Getting an Online Cash Rebate Select a cashback site that is compatible with the retailer. If you're not already signed up with that particular cashback site, you'll have to do so before purchasing anything to get the rebate. Rebates claimed electronically are also processed at a faster pace, resulting in you receiving your rebate faster. Look at reviews for rebate websites. There are a lot of scammers out there in the rebate business. You’ll want to be as sure as possible that the company or website you are using is a trustworthy one. Identify the percentage of cashback for a product. Online cashback rebates will usually be offered at a range between 1 and 5 percent. Keep track of the percentage of rebate now to ensure that it’s the correct amount that you receive later. Select a product that comes with a rebate. Depending on the cashback site that you’ve registered with and synced to your online shopping, you may see your total automatically decrease, indicating that the rebate has been processed. Other cashback sites will simply collect the amount from rebates at their website. The balance will remain there until you’re ready to use it. Make sure you understand how the rebate will be offered before you make your purchase. Track your rebates. Just like you would do with any other rebate, it's best to keep track of them. It's important to do this for electronic rebates as they may be harder to keep track of due to the speediness of the transaction. A spreadsheet will be great for this.",
  "tyn_model":[
    "cashback site",
    "envelope",
    "spreadsheet"
  ],
  "tyn_section":[

  ]
}