{
  "title":"How to Keep Donuts Fresh",
  "url":"https://www.wikihow.com/Keep-Donuts-Fresh",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Donuts and Doughnuts"
  ],
  "methods":[
    {
      "name":"Keeping Donuts at Room Temperature",
      "steps":[
        {
          "headline":"Place the donuts in storage bags or airtight containers.",
          "description":"Freshly baked donuts can be left at room temperature for 1 to 2 days. If the donuts are cream-filled, they must be stored in the refrigerator to prevent the cream filling from spoiling."
        },
        {
          "headline":"Seal the donuts in the storage bag or container.",
          "description":"You want to make sure that the storage bag or container is tightly sealed, otherwise the donuts will get stale. If you are using a storage bag, then just try and squeeze as much air from the bag as possible without damaging the toppings on the donuts."
        },
        {
          "headline":"Store the donuts in a cool, dry area.",
          "description":"Freshly baked donuts will last longer if kept out of direct sunlight. The sunlight will not only cause your donuts to become stale, but it will also melt any icing or glaze on the donuts."
        },
        {
          "headline":"Place the donuts in the microwave for 5 seconds to freshen them up.",
          "description":"When you are ready to eat one of the donuts, you can place the donuts on a plate and microwave for a few seconds. This will soften, warm, and put moisture back into the donuts. Since the donuts are still at room temperature, do not microwave excessively. Any icing or glaze on the donuts will melt, and the donuts might actually become hard if microwaved for too long."
        }
      ]
    },
    {
      "name":"Putting Donuts in the Refrigerator",
      "steps":[
        {
          "headline":"Place the donuts in a storage bag or airtight container.",
          "description":"Make sure that the bag or container you are storing the donuts in is properly sealed. Any air left in the container or bag might cause the donuts to become stale faster."
        },
        {
          "headline":"Put the packed donuts in the refrigerator.",
          "description":"Freshly baked donuts will last about 1 week in the refrigerator before going stale. Storing donuts with an icing or a glaze in the refrigerator will cause the icing to become runny and the glaze to be absorbed by the donuts. So, if this seems unappealing to you, try and eat those donuts first."
        },
        {
          "headline":"Freshen the chilled donuts by microwaving at 15 second intervals.",
          "description":"The microwave will help add moisture back into the donuts and revive them. If the donuts are glazed or topped with icing, it might slightly melt. Be careful if the donuts have jelly or cream inside because it will be hot."
        }
      ]
    },
    {
      "name":"Freezing Unfrosted Donuts",
      "steps":[
        {
          "headline":"Put the donuts in an airtight container and layer it with wax paper.",
          "description":"The wax paper will keep the donuts from freezing together. So, if you just want one donut, you can easily pull them apart without having to defrost the whole container. Powdered and plain donuts will freeze the best. Glazes and icings tend to melt and become tacky when defrosted."
        },
        {
          "headline":"Put the container in a sealed, heavy-duty freezer bag.",
          "description":"The freezer bag will help prevent any ice from forming on the inside of the container, or on the donuts."
        },
        {
          "headline":"Store the donuts in the freezer.",
          "description":"If properly stored, the donuts will remain fresh in the freezer for 2 to 3 months. The donuts will be safe to eat for a few weeks beyond that time, but just won't be as fresh."
        },
        {
          "headline":"Leave the donuts uncovered on the counter for 15 minutes to defrost.",
          "description":"Do not cover the donuts to defrost them. Covering the donuts will only trap the moisture and make your donuts soggy."
        },
        {
          "headline":"Defrost the donuts by microwaving them at 15 second intervals.",
          "description":"The microwave will not only defrost the donuts, but will also put moisture back into the donuts."
        }
      ]
    }
  ],
  "text":" Keeping Donuts at Room Temperature Place the donuts in storage bags or airtight containers. Freshly baked donuts can be left at room temperature for 1 to 2 days. If the donuts are cream-filled, they must be stored in the refrigerator to prevent the cream filling from spoiling. Seal the donuts in the storage bag or container. You want to make sure that the storage bag or container is tightly sealed, otherwise the donuts will get stale. If you are using a storage bag, then just try and squeeze as much air from the bag as possible without damaging the toppings on the donuts. Store the donuts in a cool, dry area. Freshly baked donuts will last longer if kept out of direct sunlight. The sunlight will not only cause your donuts to become stale, but it will also melt any icing or glaze on the donuts. Place the donuts in the microwave for 5 seconds to freshen them up. When you are ready to eat one of the donuts, you can place the donuts on a plate and microwave for a few seconds. This will soften, warm, and put moisture back into the donuts. Since the donuts are still at room temperature, do not microwave excessively. Any icing or glaze on the donuts will melt, and the donuts might actually become hard if microwaved for too long. Putting Donuts in the Refrigerator Place the donuts in a storage bag or airtight container. Make sure that the bag or container you are storing the donuts in is properly sealed. Any air left in the container or bag might cause the donuts to become stale faster. Put the packed donuts in the refrigerator. Freshly baked donuts will last about 1 week in the refrigerator before going stale. Storing donuts with an icing or a glaze in the refrigerator will cause the icing to become runny and the glaze to be absorbed by the donuts. So, if this seems unappealing to you, try and eat those donuts first. Freshen the chilled donuts by microwaving at 15 second intervals. The microwave will help add moisture back into the donuts and revive them. If the donuts are glazed or topped with icing, it might slightly melt. Be careful if the donuts have jelly or cream inside because it will be hot. Freezing Unfrosted Donuts Put the donuts in an airtight container and layer it with wax paper. The wax paper will keep the donuts from freezing together. So, if you just want one donut, you can easily pull them apart without having to defrost the whole container. Powdered and plain donuts will freeze the best. Glazes and icings tend to melt and become tacky when defrosted. Put the container in a sealed, heavy-duty freezer bag. The freezer bag will help prevent any ice from forming on the inside of the container, or on the donuts. Store the donuts in the freezer. If properly stored, the donuts will remain fresh in the freezer for 2 to 3 months. The donuts will be safe to eat for a few weeks beyond that time, but just won't be as fresh. Leave the donuts uncovered on the counter for 15 minutes to defrost. Do not cover the donuts to defrost them. Covering the donuts will only trap the moisture and make your donuts soggy. Defrost the donuts by microwaving them at 15 second intervals. The microwave will not only defrost the donuts, but will also put moisture back into the donuts.",
  "tyn_model":[
    "donuts",
    "microwave",
    "refrigerator",
    "storage bag",
    "airtight container",
    "icing",
    "wax paper",
    "freezer",
    "storage bags",
    "airtight containers",
    "plate",
    "heavy-duty freezer bag",
    "freezer bag"
  ],
  "tyn_section":[

  ]
}