{
  "title":"How to Wash Lululemon Clothing",
  "url":"https://www.wikihow.com/Wash-Lululemon-Clothing",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Cleaning Clothes"
  ],
  "methods":[
    {
      "name":"Washing Luon and Natural Blend Families",
      "steps":[
        {
          "headline":"Separate your garments into color groups.",
          "description":"The luon, swift, silverescent fabrics, and natural blend families should be separated into bright colors, dark colors, and whites. Darker colors tend to bleed the dye when washed, so you’ll definitely want to wash your darker colors together. You may want to pre-soak the clothes that have stains on them."
        },
        {
          "headline":"Machine-wash in cold water.",
          "description":"It’s best to turn your luon fabrics inside out. To avoid any fluff from attaching to the luon fabrics, you’ll want to make sure you’re not mixing luon with cotton. Avoid using fabric softener with luon fabrics so it doesn’t coat the fabric."
        },
        {
          "headline":"Tumble dry on low heat.",
          "description":"Choosing the correct temperature for drying is important to prevent your clothes from shrinking, which is far too common. Make sure your dryer isn't over loaded to ensure that each item of clothing will dry evenly. Adding a dryer sheet will also help prevent wrinkles and static. Being prompt with your laundry will result in cleaner and fresher clothing."
        },
        {
          "headline":"Fold and store your clothing.",
          "description":"Decide on which items you want to hang and which ones you want to fold and put the latter in a dresser. You'll want to fold the clothes right when they’re done drying to prevent wrinkles, which saves you from ironing them later."
        }
      ]
    },
    {
      "name":"Washing Outerwear",
      "steps":[
        {
          "headline":"Close all zippers and fasten any Velcro®.",
          "description":"Doing this will make sure that these materials won’t get caught in your other garments. Keeping these fixtures closed will also help to prevent the zippers or Velcro from wearing out faster."
        },
        {
          "headline":"Wash with cold water.",
          "description":"Outerwear often has more rough fabrics that will require their own wash cycle. Be sure to use the less detergent so that leftover detergent doesn't block water from getting into smaller places."
        },
        {
          "headline":"Hang the clothing to dry.",
          "description":"As soon as your outerwear is done washing, hang them to dry. Pinning them to a clothing line or draping them over a drying rack also works. Items with more dirt on them should be washed separately from other clothing. They will require a longer, stronger wash cycle."
        },
        {
          "headline":"Store your outerwear.",
          "description":"Your outerwear is now ready to be worn and enjoyed. Hang them in a closet along with your other outerwear until it’s time to use them. You may want to separate outerwear by season."
        }
      ]
    },
    {
      "name":"Washing the Exceptions",
      "steps":[
        {
          "headline":"Machine-wash with cold water.",
          "description":"Washing merino wool, boolux and cashlux will require a slightly different cycle. Separate your garments into color groups. They should be separated into bright colors, dark colors, and whites. When in doubt, always check the wash care symbols on the label of your clothing."
        },
        {
          "headline":"Lay clothes flat to dry.",
          "description":"These fabrics won’t work well in a dryer. Find a flat surface to spread out each garment. This way they will all dry evenly and will be ready to worn as soon as they’re done drying."
        },
        {
          "headline":"Put away your clothes.",
          "description":"Store these clothing items as you wish. The quicker you do this, the better it’ll be. Your clothes will retain their freshness and will remain crisp and ready for use."
        }
      ]
    }
  ],
  "text":" Washing Luon and Natural Blend Families Separate your garments into color groups. The luon, swift, silverescent fabrics, and natural blend families should be separated into bright colors, dark colors, and whites. Darker colors tend to bleed the dye when washed, so you’ll definitely want to wash your darker colors together. You may want to pre-soak the clothes that have stains on them. Machine-wash in cold water. It’s best to turn your luon fabrics inside out. To avoid any fluff from attaching to the luon fabrics, you’ll want to make sure you’re not mixing luon with cotton. Avoid using fabric softener with luon fabrics so it doesn’t coat the fabric. Tumble dry on low heat. Choosing the correct temperature for drying is important to prevent your clothes from shrinking, which is far too common. Make sure your dryer isn't over loaded to ensure that each item of clothing will dry evenly. Adding a dryer sheet will also help prevent wrinkles and static. Being prompt with your laundry will result in cleaner and fresher clothing. Fold and store your clothing. Decide on which items you want to hang and which ones you want to fold and put the latter in a dresser. You'll want to fold the clothes right when they’re done drying to prevent wrinkles, which saves you from ironing them later. Washing Outerwear Close all zippers and fasten any Velcro®. Doing this will make sure that these materials won’t get caught in your other garments. Keeping these fixtures closed will also help to prevent the zippers or Velcro from wearing out faster. Wash with cold water. Outerwear often has more rough fabrics that will require their own wash cycle. Be sure to use the less detergent so that leftover detergent doesn't block water from getting into smaller places. Hang the clothing to dry. As soon as your outerwear is done washing, hang them to dry. Pinning them to a clothing line or draping them over a drying rack also works. Items with more dirt on them should be washed separately from other clothing. They will require a longer, stronger wash cycle. Store your outerwear. Your outerwear is now ready to be worn and enjoyed. Hang them in a closet along with your other outerwear until it’s time to use them. You may want to separate outerwear by season. Washing the Exceptions Machine-wash with cold water. Washing merino wool, boolux and cashlux will require a slightly different cycle. Separate your garments into color groups. They should be separated into bright colors, dark colors, and whites. When in doubt, always check the wash care symbols on the label of your clothing. Lay clothes flat to dry. These fabrics won’t work well in a dryer. Find a flat surface to spread out each garment. This way they will all dry evenly and will be ready to worn as soon as they’re done drying. Put away your clothes. Store these clothing items as you wish. The quicker you do this, the better it’ll be. Your clothes will retain their freshness and will remain crisp and ready for use.",
  "tyn_model":[
    "water",
    "luon",
    "natural blend",
    "velcro",
    "cotton",
    "fabric softener",
    "dryer",
    "dryer sheet",
    "laundry",
    "fabrics"
  ],
  "tyn_section":[

  ]
}