{
  "title":"How to Make an Easy Wheat and Rye Bread",
  "url":"https://www.wikihow.com/Make-an-Easy-Wheat-and-Rye-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads"
  ],
  "steps":[
    {
      "headline":"Gather the ingredients and tools.",
      "description":""
    },
    {
      "headline":"Dissolve the yeast in the water, in a large bowl.",
      "description":"Make sure that the water is not warmer than you can comfortably stick your pinky finger in, as that would kill the yeast. On the other hand, if it's too cold, the yeast won't thrive. Certain kinds of yeast might grow somewhat better in a slightly higher water temperature. Check the kind of yeast you are using."
    },
    {
      "headline":"Add the eggs, honey, and salt.",
      "description":"Crack the eggs and add them to your dissolved yeast. Slowly pour the honey and salt. At this stage, you can also consider adding in your nuts or seeds if desired. Stir well with a wooden spoon."
    },
    {
      "headline":"Add both flours and mix well, until dough starts to let go of the edges of the bowl.",
      "description":"Reserve a little flour for the kneading."
    },
    {
      "headline":"Put the dough on a floured surface, dust your hands with flour, and start kneading.",
      "description":"Work in more flour very gradually until the dough sticks more to itself than to the surface or to your hands. Note that the dough will stick to your hands and to the board at first, but add extra flour slowly, and make sure to work in each addition before reaching for even more."
    },
    {
      "headline":".",
      "description":"Knead until the dough is uniform in its consistency, and can be lifted from the surface without getting stuck on the baking board. During the kneading, use a dough scraper regularly to remove stuck dough from hands and baking board. Rye dough behaves differently from wheat dough. One of the most noticeable differences is that it is stickier. Your hands will feel and be sticky, and covered in a layer of dough. This is completely normal, and should not cause you to add large amounts of extra flour."
    },
    {
      "headline":"Prepare the dough for rising.",
      "description":"Divide the dough into four equal pieces. Roll each piece into a roll of length suitable for your baking tray or bread pan. Put the rolls into the bread pans or onto the baking tray."
    },
    {
      "headline":"Cover the four loaves with a towel.",
      "description":"Let them rise for about one hour in a warm spot, until the loaves have about doubled in size. Yes, the bread only rises once. This is one of the reasons why it is so fast to bake. While waiting for the dough to rise, preheat your oven to 425º Fahrenheit (200-225º Celsius). {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/65\\/Make-an-Easy-Wheat-and-Rye-Bread-Step-10.jpg\\/v4-460px-Make-an-Easy-Wheat-and-Rye-Bread-Step-10.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/65\\/Make-an-Easy-Wheat-and-Rye-Bread-Step-10.jpg\\/v4-760px-Make-an-Easy-Wheat-and-Rye-Bread-Step-10.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
    },
    {
      "headline":"Bake.",
      "description":"Place the loves in the oven for 25 minutes or until a medium-brown color. The crust should also be a golden-brown. If you are baking on a tray, cut the loaves apart."
    },
    {
      "headline":"Have cool and serve.",
      "description":"Let the loaves cool on wire racks, covered by a towel. It's now ready to serve. Try spreading butter, jam, sauce, or cream cheese on top. Enjoy!"
    }
  ],
  "text":" Gather the ingredients and tools.  Dissolve the yeast in the water, in a large bowl. Make sure that the water is not warmer than you can comfortably stick your pinky finger in, as that would kill the yeast. On the other hand, if it's too cold, the yeast won't thrive. Certain kinds of yeast might grow somewhat better in a slightly higher water temperature. Check the kind of yeast you are using. Add the eggs, honey, and salt. Crack the eggs and add them to your dissolved yeast. Slowly pour the honey and salt. At this stage, you can also consider adding in your nuts or seeds if desired. Stir well with a wooden spoon. Add both flours and mix well, until dough starts to let go of the edges of the bowl. Reserve a little flour for the kneading. Put the dough on a floured surface, dust your hands with flour, and start kneading. Work in more flour very gradually until the dough sticks more to itself than to the surface or to your hands. Note that the dough will stick to your hands and to the board at first, but add extra flour slowly, and make sure to work in each addition before reaching for even more. . Knead until the dough is uniform in its consistency, and can be lifted from the surface without getting stuck on the baking board. During the kneading, use a dough scraper regularly to remove stuck dough from hands and baking board. Rye dough behaves differently from wheat dough. One of the most noticeable differences is that it is stickier. Your hands will feel and be sticky, and covered in a layer of dough. This is completely normal, and should not cause you to add large amounts of extra flour. Prepare the dough for rising. Divide the dough into four equal pieces. Roll each piece into a roll of length suitable for your baking tray or bread pan. Put the rolls into the bread pans or onto the baking tray. Cover the four loaves with a towel. Let them rise for about one hour in a warm spot, until the loaves have about doubled in size. Yes, the bread only rises once. This is one of the reasons why it is so fast to bake. While waiting for the dough to rise, preheat your oven to 425º Fahrenheit (200-225º Celsius). {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/65\\/Make-an-Easy-Wheat-and-Rye-Bread-Step-10.jpg\\/v4-460px-Make-an-Easy-Wheat-and-Rye-Bread-Step-10.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/65\\/Make-an-Easy-Wheat-and-Rye-Bread-Step-10.jpg\\/v4-760px-Make-an-Easy-Wheat-and-Rye-Bread-Step-10.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Bake. Place the loves in the oven for 25 minutes or until a medium-brown color. The crust should also be a golden-brown. If you are baking on a tray, cut the loaves apart. Have cool and serve. Let the loaves cool on wire racks, covered by a towel. It's now ready to serve. Try spreading butter, jam, sauce, or cream cheese on top. Enjoy!",
  "tyn_model":[
    "flour",
    "water",
    "yeast",
    "wheat",
    "eggs",
    "honey",
    "salt",
    "baking board",
    "baking tray",
    "oven",
    "wooden spoon",
    "flours",
    "bowl",
    "dough scraper",
    "bread pan",
    "bread pans",
    "towel",
    "bread",
    "easy-wheat",
    "butter",
    "jam",
    "cream cheese"
  ],
  "tyn_section":[

  ]
}