{
  "title":"How to Break Bulletproof Glass",
  "url":"https://www.wikihow.com/Break-Bulletproof-Glass",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Glass and Stained Glass Projects",
    "Working with Glass"
  ],
  "methods":[
    {
      "name":"Firing Multiple Handgun Rounds to Shatter Bulletproof Glass",
      "steps":[
        {
          "headline":"Keep at least 30 yards (27 m) from the glass when firing a handgun at it.",
          "description":"Bullets that ricochet off of the bulletproof glass can bounce back in the direction from which they’re fired. Maintain a safe distance from the target to avoid being hit by a ricocheting bullet. Make sure to also wear eye and ear protection when firing a handgun. If you’re firing a high-powered handgun, increase this distance to 40–50 yards (37–46 m)."
        },
        {
          "headline":"Shoot 3–5 rounds of handgun ammunition at the glass.",
          "description":"Some types of relatively thin bulletproof glass are designed to only withstand a single round of gunfire from a firearm. So, keep shooting, since multiple bullets impacting in the same location may be enough to break through a thin sheet of bulletproof glass. If you’re shooting a mid-power handgun like a 9 mm, you may need to fire 3-5 rounds to break through thin bulletproof glass. However, a high-power handgun like a 44 magnum may penetrate with 2 shots. Be sure to wear noise-blocking earplugs and eye protection to avoid damaging your hearing or vision when firing a handgun."
        },
        {
          "headline":"Keep your aim steady and hit the same location on the glass.",
          "description":"Aiming well is relatively straightforward whether you’re shooting a handgun or a rifle. Line up the firearm’s sights on the target and exhale slowly when you aim to keep the sights steady. Gently squeeze the trigger while shooting. Never jerk the trigger, or you’ll ruin the shot. If you fire 8 rounds (a full magazine for most handguns), but they all hit different spots on the bulletproof glass, it’s unlikely that the glass will break. Aiming accurately will prevent this from happening."
        },
        {
          "headline":"Fire 2–3 magazines of ammo at the glass if it doesn’t shatter after 1 magazine.",
          "description":"If you empty a full magazine into the glass and it’s still holding together, keep on firing. Thicker bulletproof glass can withstand quite a few rounds fired into it, so try emptying multiple magazines into the glass. The number of rounds needed to penetrate bulletproof glass can vary widely with the thickness and type of glass."
        }
      ]
    },
    {
      "name":"Using Rifles and High-Power Ammo",
      "steps":[
        {
          "headline":"Keep at least 50 yards (46 m) away from the target to avoid ricochets.",
          "description":"Many of the rounds you fire at the bulletproof glass will not pass through it, and some may ricochet. To avoid these bullets, keep a safe distance from the target. Also wear eye and ear protection whenever you’re firing a gun, no matter the caliber. If you’re shooting a rifle with a scope, you may be able to fire at the glass from as far as 100–200 yards (91–183 m) away. This will increase your safety."
        },
        {
          "headline":"Fire .308 or .30-06 rifle rounds to break most bulletproof glass panes.",
          "description":"While high-powered handguns, like a .44 magnum or a .45, are more powerful than smaller handgun calibers, even these can’t match the power of a rifle. Try using a standard rifle round like a .308 to break the glass. You’ll certainly need a rifle to break tough polycarbonate or glass-clad polycarbonate glass. These rounds can be purchased at most gun or sporting goods stores. You could also shoot rounds of comparable power including the .270 Winchester and the .30-06. When you purchase polycarbonate or glass-clad polycarbonate bulletproof glass, look to see what caliber of ammunition it’s rated to deflect. For example, if your glass will repel a .44 magnum round, rifle rounds more powerful than a .44 handgun should break the glass. Bulletproof glass is manufactured in 3 different types: acrylic, polycarbonate, and glass-clad polycarbonate. To make glass-clad polycarbonate, manufacturers laminate sheets of glass on either side of a sheet of polycarbonate to produce a heavy, effective material. You can identify this material by looking for the thin, laminated layers of plastic and glass that make up the composite polycarbonate."
        },
        {
          "headline":"Try using a high-powered .50 caliber rifle to break bulletproof glass.",
          "description":"If a moderately powerful caliber rifle bullet like the .308 doesn’t break bulletproof glass, try something a little more powerful. For example, a powerful .50 caliber rifle could penetrate thin bulletproof glass with 1 round, and could break thicker glass with several rounds. This should penetrate any type of polycarbonate glass. Other high-powered rifle calibers include the .460 Weatherby Magnum, the .700 Nitro Express, the .475 A&M Magnum, and the .338 Winchester Magnum. Polycarbonate glass is a type of plastic. You can identify polycarbonate by its transparency and weight. It’s clear and weighs only about half as much as both acrylic and glass-clad polycarbonate."
        },
        {
          "headline":"Use armor-piercing rounds to maximize your rifle’s power.",
          "description":"Armor-piercing rounds are commonly used by military and police personnel and are designed to blast through thick, protective armor. While bulletproof glass isn’t the same as armor, the armor-piercing rounds will still be more likely to break it than ordinary bullets. You can purchase armor-piercing rounds at a local gun or sporting goods store."
        },
        {
          "headline":"Shoot an explosive round to break multiple layers of thick bulletproof glass.",
          "description":"As their name suggests, military-grade explosive rounds detonate on impact and will shatter the object they’re fired into. This type of super high-power ammunition will break through even the thickest 5-pane bulletproof glass. Other types of armor-piercing or explosive rounds will also be more effective in shattering bulletproof glass than ordinary rounds. Experiment with various types of high-powered rounds to see what’s most effective. Explosive rounds are harder to acquire than armor-piercing rounds. A gun or sporting-goods store may be able to special order a box."
        }
      ]
    },
    {
      "name":"Shattering Bulletproof Glass without Firearms",
      "steps":[
        {
          "headline":"Hit acrylic bulletproof glass for 5 minutes with a sledgehammer.",
          "description":"Due to differences in their construction, some types of bulletproof glass are vulnerable to blunt objects, while others aren’t. Blunt objects like sledgehammers will not be able to break through polycarbonate or glass-clad polycarbonate bulletproof glass, but can break through acrylic material. If you’re purchasing your own piece of bulletproof glass to break, you should be able to choose the type and thickness of the glass. Otherwise, you can identify acrylic glass by its location and appearance. Acrylic glass is actually made of very hard plastic. It’s most commonly used indoors (e.g., to shield bank tellers) and has a dark, almost tinted, color."
        },
        {
          "headline":"Fire a rocket-propelled grenade (RPG) at bulletproof glass to blow it apart.",
          "description":"While bulletproof glass is great at stopping handgun rounds, it’s ineffective against explosive grenades. So, if you hit the glass with an RPG or any other type of hand-launched explosive device, it’s sure to be utterly destroyed. The RPG can blast through as many as 16 separate layers of bulletproof glass. Unless you’re in the military, there is most likely no safe, legal way to acquire an RPG."
        },
        {
          "headline":"Break bulletproof glass with explosives like dynamite or C4.",
          "description":"Most varieties of detonating materials will almost certainly break through many layers of bulletproof glass. Set these explosives within about 3 feet (0.91 m) of the glass to maximize their effectiveness. While some types of bulletproof glass are rated “Blast resistant,” they’re likely not strong enough to withstand C4 or dynamite exploding only a few feet away. These types of explosives are also difficult—and often illegal—to come by. Unless you’re in a position to legally and safely use dynamite or C4, stick to breaking glass with firearms. Use extreme caution when detonating explosives. After lighting the fuse (or before detonating C4), make sure you’re at least 250 feet (76 m) away from the blast site."
        }
      ]
    }
  ],
  "text":" Firing Multiple Handgun Rounds to Shatter Bulletproof Glass Keep at least 30 yards (27 m) from the glass when firing a handgun at it. Bullets that ricochet off of the bulletproof glass can bounce back in the direction from which they’re fired. Maintain a safe distance from the target to avoid being hit by a ricocheting bullet. Make sure to also wear eye and ear protection when firing a handgun. If you’re firing a high-powered handgun, increase this distance to 40–50 yards (37–46 m). Shoot 3–5 rounds of handgun ammunition at the glass. Some types of relatively thin bulletproof glass are designed to only withstand a single round of gunfire from a firearm. So, keep shooting, since multiple bullets impacting in the same location may be enough to break through a thin sheet of bulletproof glass. If you’re shooting a mid-power handgun like a 9 mm, you may need to fire 3-5 rounds to break through thin bulletproof glass. However, a high-power handgun like a 44 magnum may penetrate with 2 shots. Be sure to wear noise-blocking earplugs and eye protection to avoid damaging your hearing or vision when firing a handgun. Keep your aim steady and hit the same location on the glass. Aiming well is relatively straightforward whether you’re shooting a handgun or a rifle. Line up the firearm’s sights on the target and exhale slowly when you aim to keep the sights steady. Gently squeeze the trigger while shooting. Never jerk the trigger, or you’ll ruin the shot. If you fire 8 rounds (a full magazine for most handguns), but they all hit different spots on the bulletproof glass, it’s unlikely that the glass will break. Aiming accurately will prevent this from happening. Fire 2–3 magazines of ammo at the glass if it doesn’t shatter after 1 magazine. If you empty a full magazine into the glass and it’s still holding together, keep on firing. Thicker bulletproof glass can withstand quite a few rounds fired into it, so try emptying multiple magazines into the glass. The number of rounds needed to penetrate bulletproof glass can vary widely with the thickness and type of glass. Using Rifles and High-Power Ammo Keep at least 50 yards (46 m) away from the target to avoid ricochets. Many of the rounds you fire at the bulletproof glass will not pass through it, and some may ricochet. To avoid these bullets, keep a safe distance from the target. Also wear eye and ear protection whenever you’re firing a gun, no matter the caliber. If you’re shooting a rifle with a scope, you may be able to fire at the glass from as far as 100–200 yards (91–183 m) away. This will increase your safety. Fire .308 or .30-06 rifle rounds to break most bulletproof glass panes. While high-powered handguns, like a .44 magnum or a .45, are more powerful than smaller handgun calibers, even these can’t match the power of a rifle. Try using a standard rifle round like a .308 to break the glass. You’ll certainly need a rifle to break tough polycarbonate or glass-clad polycarbonate glass. These rounds can be purchased at most gun or sporting goods stores. You could also shoot rounds of comparable power including the .270 Winchester and the .30-06. When you purchase polycarbonate or glass-clad polycarbonate bulletproof glass, look to see what caliber of ammunition it’s rated to deflect. For example, if your glass will repel a .44 magnum round, rifle rounds more powerful than a .44 handgun should break the glass. Bulletproof glass is manufactured in 3 different types: acrylic, polycarbonate, and glass-clad polycarbonate. To make glass-clad polycarbonate, manufacturers laminate sheets of glass on either side of a sheet of polycarbonate to produce a heavy, effective material. You can identify this material by looking for the thin, laminated layers of plastic and glass that make up the composite polycarbonate. Try using a high-powered .50 caliber rifle to break bulletproof glass. If a moderately powerful caliber rifle bullet like the .308 doesn’t break bulletproof glass, try something a little more powerful. For example, a powerful .50 caliber rifle could penetrate thin bulletproof glass with 1 round, and could break thicker glass with several rounds. This should penetrate any type of polycarbonate glass. Other high-powered rifle calibers include the .460 Weatherby Magnum, the .700 Nitro Express, the .475 A&M Magnum, and the .338 Winchester Magnum. Polycarbonate glass is a type of plastic. You can identify polycarbonate by its transparency and weight. It’s clear and weighs only about half as much as both acrylic and glass-clad polycarbonate. Use armor-piercing rounds to maximize your rifle’s power. Armor-piercing rounds are commonly used by military and police personnel and are designed to blast through thick, protective armor. While bulletproof glass isn’t the same as armor, the armor-piercing rounds will still be more likely to break it than ordinary bullets. You can purchase armor-piercing rounds at a local gun or sporting goods store. Shoot an explosive round to break multiple layers of thick bulletproof glass. As their name suggests, military-grade explosive rounds detonate on impact and will shatter the object they’re fired into. This type of super high-power ammunition will break through even the thickest 5-pane bulletproof glass. Other types of armor-piercing or explosive rounds will also be more effective in shattering bulletproof glass than ordinary rounds. Experiment with various types of high-powered rounds to see what’s most effective. Explosive rounds are harder to acquire than armor-piercing rounds. A gun or sporting-goods store may be able to special order a box. Shattering Bulletproof Glass without Firearms Hit acrylic bulletproof glass for 5 minutes with a sledgehammer. Due to differences in their construction, some types of bulletproof glass are vulnerable to blunt objects, while others aren’t. Blunt objects like sledgehammers will not be able to break through polycarbonate or glass-clad polycarbonate bulletproof glass, but can break through acrylic material. If you’re purchasing your own piece of bulletproof glass to break, you should be able to choose the type and thickness of the glass. Otherwise, you can identify acrylic glass by its location and appearance. Acrylic glass is actually made of very hard plastic. It’s most commonly used indoors (e.g., to shield bank tellers) and has a dark, almost tinted, color. Fire a rocket-propelled grenade (RPG) at bulletproof glass to blow it apart. While bulletproof glass is great at stopping handgun rounds, it’s ineffective against explosive grenades. So, if you hit the glass with an RPG or any other type of hand-launched explosive device, it’s sure to be utterly destroyed. The RPG can blast through as many as 16 separate layers of bulletproof glass. Unless you’re in the military, there is most likely no safe, legal way to acquire an RPG. Break bulletproof glass with explosives like dynamite or C4. Most varieties of detonating materials will almost certainly break through many layers of bulletproof glass. Set these explosives within about 3 feet (0.91 m) of the glass to maximize their effectiveness. While some types of bulletproof glass are rated “Blast resistant,” they’re likely not strong enough to withstand C4 or dynamite exploding only a few feet away. These types of explosives are also difficult—and often illegal—to come by. Unless you’re in a position to legally and safely use dynamite or C4, stick to breaking glass with firearms. Use extreme caution when detonating explosives. After lighting the fuse (or before detonating C4), make sure you’re at least 250 feet (76 m) away from the blast site.",
  "tyn_model":[
    "bulletproof glass",
    "handgun",
    "rifle",
    "polycarbonate",
    "armor-piercing rounds",
    "dynamite",
    "firearm",
    "handguns",
    "glass-clad polycarbonate",
    "polycarbonate glass",
    "acrylic glass",
    "ammo",
    "magazines",
    "rifles",
    "gun",
    "acrylic",
    "armor-piercing",
    "explosive rounds",
    "5-pane bulletproof glass",
    "armor-piercing or explosive rounds",
    "sledgehammer",
    "sledgehammers",
    "rocket-propelled grenade",
    "rpg",
    "“blast",
    "” they",
    "—and",
    "—to",
    "firearms",
    "explosives",
    "c4"
  ],
  "tyn_section":[

  ]
}