{
  "title":"How to Store Garlic Scapes",
  "url":"https://www.wikihow.com/Store-Garlic-Scapes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices",
    "Garlic"
  ],
  "methods":[
    {
      "name":"Storing Scapes at Room Temperature",
      "steps":[
        {
          "headline":"Fill a glass or jar halfway with cool, filtered water.",
          "description":"Pick a glass or jar that is large enough to fit the scapes and add cool, filtered water. It’s important to used filtered water because nutrients in unfiltered water can cause the scapes to break down quickly in the glass. The glass or jar doesn’t have to have a lid, since you’ll be changing the water frequently to prevent contamination."
        },
        {
          "headline":"Place the scapes in the glass and leave it on the counter.",
          "description":"Position the scapes so that the thickest part of the stalk is at the bottom of the glass, and the thinner part is at the bottom. If your scapes are very long, you might have to cut them in half before you put them in the water. Be aware that if you have too much water in the glass, putting the scapes into the water can cause the level to rise, resulting in a spill. Make sure the glass is not in direct sunlight on the counter. Heat can cause the scapes to go bad quickly."
        },
        {
          "headline":"Replace the water in the glass every day to keep it fresh.",
          "description":"Remove the scapes from the water and pour the old water into the drain. Then, refill the glass with fresh, cool, filtered water and place the scapes back into the glass to use them as needed. You may also need to change the glass or wash it out if it becomes dirty."
        },
        {
          "headline":"Store the scapes at room temperature for 2-3 days.",
          "description":"When you need a scape, simply pull it out of the glass and incorporate it into your recipe. After a few days or if the scapes start to wilt or droop at any point, transfer them to a bag and place them in the fridge."
        }
      ]
    },
    {
      "name":"Refrigerating Garlic Scapes",
      "steps":[
        {
          "headline":"Rinse and dry the scapes to remove dirt and debris.",
          "description":"Hold the stalks under cool, running water to clean them, rotating them in your hands so the water runs over each stalk. Then, lay them out to air dry for about 30 minutes, or pat them with a paper towel to remove the excess moisture. Refrigerating dirty scapes can cause other fruits and vegetables in your fridge to go back quicker than they normally would."
        },
        {
          "headline":"Put the scapes in a plastic bag and leave it slightly open.",
          "description":"Use a plastic bag with an open end or a mesh produce bag to allow air to circulate around the stalks in the refrigerator. Leave the bag open since closing it can cut off air circulation and cause the stalks to wilt. You can use a resealable bag, but make sure you don’t accidentally close the bag."
        },
        {
          "headline":"Place the bag in the crisper drawer of the refrigerator.",
          "description":"Transfer the bag of scapes to the refrigerator, and store them in the same drawer as the rest of your vegetables. Make sure the crispness level of the drawer is as high as possible. Once you put the scapes in the drawer, check to make sure the bag is still open. Move any other vegetables that could fall onto the bag, causing it to close."
        },
        {
          "headline":"Use the scapes within 2 weeks.",
          "description":"After about a week, check on the scapes to make sure they’re still fresh. The stalks should still be crisp and firm, and there should be little to no wilting at the ends of the stalks. Throw the stalks away and purchase new ones if they’ve been in the refrigerator for more than 2 weeks. If the stalks begin to wilt or smell bad at any time before 2 weeks have passed, throw them away immediately."
        }
      ]
    },
    {
      "name":"Freezing for Long-Term Storage",
      "steps":[
        {
          "headline":"Wash the scapes with cool, running water and dry them.",
          "description":"Run the scapes under tap water to remove dirty and debris before you freeze them. Then, lay them out to air dry or pat them dry with a paper towel to remove excess moisture. It’s important to wash the scapes to remove dangerous bacteria before you freeze them. Freezing can slow down the reproduction of bacteria, but they will “reactivate” at a warmer temperature when you remove the scapes from the freezer."
        },
        {
          "headline":"Chop the scapes to fit in your chosen container.",
          "description":"Use a sharp paring knife to cut the scapes into halves or quarters. Try to keep them roughly the same size to make it easier to use them in recipes. Some chefs recommend cutting off the tip of the stalk and the pod at the bottom before freezing the scapes. You can freeze the scapes whole as long as they fit into the container."
        },
        {
          "headline":"Place the scapes in an airtight container and seal it.",
          "description":"Make sure there are no cracks or holes in the container and that it’s closed tightly. The scapes should fit in the container without bending or snapping, which can cause them to wilt. There’s no need to blanch the scapes before you freeze them, since they’ll retain their flavor without being cooked."
        },
        {
          "headline":"Store the scapes in the freezer for up to 12 months.",
          "description":"Scapes are seasonal vegetables, so it might be hard to find them when they’re out of season in the summer, fall, and winter. Use them as needed throughout the year, and make sure to close the container tightly when you return them to the freezer. If the scapes begin to wilt or smell at any point, throw them away immediately to prevent bacteria growth."
        }
      ]
    }
  ],
  "text":" Storing Scapes at Room Temperature Fill a glass or jar halfway with cool, filtered water. Pick a glass or jar that is large enough to fit the scapes and add cool, filtered water. It’s important to used filtered water because nutrients in unfiltered water can cause the scapes to break down quickly in the glass. The glass or jar doesn’t have to have a lid, since you’ll be changing the water frequently to prevent contamination. Place the scapes in the glass and leave it on the counter. Position the scapes so that the thickest part of the stalk is at the bottom of the glass, and the thinner part is at the bottom. If your scapes are very long, you might have to cut them in half before you put them in the water. Be aware that if you have too much water in the glass, putting the scapes into the water can cause the level to rise, resulting in a spill. Make sure the glass is not in direct sunlight on the counter. Heat can cause the scapes to go bad quickly. Replace the water in the glass every day to keep it fresh. Remove the scapes from the water and pour the old water into the drain. Then, refill the glass with fresh, cool, filtered water and place the scapes back into the glass to use them as needed. You may also need to change the glass or wash it out if it becomes dirty. Store the scapes at room temperature for 2-3 days. When you need a scape, simply pull it out of the glass and incorporate it into your recipe. After a few days or if the scapes start to wilt or droop at any point, transfer them to a bag and place them in the fridge. Refrigerating Garlic Scapes Rinse and dry the scapes to remove dirt and debris. Hold the stalks under cool, running water to clean them, rotating them in your hands so the water runs over each stalk. Then, lay them out to air dry for about 30 minutes, or pat them with a paper towel to remove the excess moisture. Refrigerating dirty scapes can cause other fruits and vegetables in your fridge to go back quicker than they normally would. Put the scapes in a plastic bag and leave it slightly open. Use a plastic bag with an open end or a mesh produce bag to allow air to circulate around the stalks in the refrigerator. Leave the bag open since closing it can cut off air circulation and cause the stalks to wilt. You can use a resealable bag, but make sure you don’t accidentally close the bag. Place the bag in the crisper drawer of the refrigerator. Transfer the bag of scapes to the refrigerator, and store them in the same drawer as the rest of your vegetables. Make sure the crispness level of the drawer is as high as possible. Once you put the scapes in the drawer, check to make sure the bag is still open. Move any other vegetables that could fall onto the bag, causing it to close. Use the scapes within 2 weeks. After about a week, check on the scapes to make sure they’re still fresh. The stalks should still be crisp and firm, and there should be little to no wilting at the ends of the stalks. Throw the stalks away and purchase new ones if they’ve been in the refrigerator for more than 2 weeks. If the stalks begin to wilt or smell bad at any time before 2 weeks have passed, throw them away immediately. Freezing for Long-Term Storage Wash the scapes with cool, running water and dry them. Run the scapes under tap water to remove dirty and debris before you freeze them. Then, lay them out to air dry or pat them dry with a paper towel to remove excess moisture. It’s important to wash the scapes to remove dangerous bacteria before you freeze them. Freezing can slow down the reproduction of bacteria, but they will “reactivate” at a warmer temperature when you remove the scapes from the freezer. Chop the scapes to fit in your chosen container. Use a sharp paring knife to cut the scapes into halves or quarters. Try to keep them roughly the same size to make it easier to use them in recipes. Some chefs recommend cutting off the tip of the stalk and the pod at the bottom before freezing the scapes. You can freeze the scapes whole as long as they fit into the container. Place the scapes in an airtight container and seal it. Make sure there are no cracks or holes in the container and that it’s closed tightly. The scapes should fit in the container without bending or snapping, which can cause them to wilt. There’s no need to blanch the scapes before you freeze them, since they’ll retain their flavor without being cooked. Store the scapes in the freezer for up to 12 months. Scapes are seasonal vegetables, so it might be hard to find them when they’re out of season in the summer, fall, and winter. Use them as needed throughout the year, and make sure to close the container tightly when you return them to the freezer. If the scapes begin to wilt or smell at any point, throw them away immediately to prevent bacteria growth.",
  "tyn_model":[
    "water",
    "glass",
    "refrigerator",
    "container",
    "vegetables",
    "freezer",
    "filtered water",
    "paper towel",
    "plastic bag",
    "scapes",
    "glass or",
    "fridge",
    "garlic",
    "produce bag",
    "resealable bag",
    "tap water",
    "freezing",
    "bacteria",
    "“reactivate",
    "” at",
    "paring knife",
    "airtight container"
  ],
  "tyn_section":[

  ]
}