{
  "title":"How to Arrange Towels on a Towel Bar",
  "url":"https://www.wikihow.com/Arrange-Towels-on-a-Towel-Bar",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Hanging Towels in a Basic Way",
      "steps":[
        {
          "headline":"Spread the bath towel out on a flat surface.",
          "description":"Any flat surface you have handy will work. You can use a table, the bed, a counter, or whatever is convenient. It’s important to make sure the towel is spread out flat and evenly so the towel's ends line up as neatly as possible. Make sure the surface you’re using is clean and free of contaminants. The last thing you want after getting clean in the shower is drying with a dirty towel!"
        },
        {
          "headline":"Fold the towel into thirds and drape it over the towel bar.",
          "description":"First, lay the towel flat. Then, fold each long edge toward the middle so both edges are touching in the center. Make sure the tag is inside! You can also fold one long side to the middle, and then fold the other long side on top of the first."
        },
        {
          "headline":"Hang the towel over the bar.",
          "description":"Adjust the hanging ends so that they’re both even. If more than one towel is hanging from the bar, keep them separated from each other to prevent mildew and mold."
        },
        {
          "headline":"Hang a hand towel over a bath towel.",
          "description":"To hang the hand towel, lay it on a flat surface and fold it into thirds vertically. Once it’s folded, drape it over the large towel on the rack. Choose towels that are color-coordinated."
        }
      ]
    },
    {
      "name":"Turning a Towel into a Pocket",
      "steps":[
        {
          "headline":"Fold a large bath towel into thirds lengthwise.",
          "description":"Lay the towel flat on a smooth surface. Fold each of the long sides so that they touch end-to-end in the middle. Then fold the towel in half and drape it over the bar."
        },
        {
          "headline":"Create a lip fold on a smaller towel.",
          "description":"Spread out a hand towel on a flat surface. Fold one of the shorter sides a quarter of the way towards the middle. Fold that edge again in half backwards to create the lip fold."
        },
        {
          "headline":"Flip the small towel over and fold it into thirds lengthwise.",
          "description":"With the lip facing down, fold 1 side of the towel so it meets the middle. Fold the other side so that it tucks into the fold created by the lip. Flip the towel back over and now you have a pocket where you can put items such as soap, lotion, or other toiletries. Hang the hand towel over the bath towel so the pocket is facing out. It’ll look like an apron with a pocket."
        },
        {
          "headline":"Fold a washcloth with an accordion pleat and put it in the pocket.",
          "description":"Lay the washcloth flat on a table and fold the side lengthwise to create pleats that overlap one another. Be sure to hold the washcloth tight so it doesn’t come undone! Fold it in half and carefully place inside of the pocket you created in the hand towel. Fan out the washcloth to make it look like a ruffle in the pocket."
        }
      ]
    },
    {
      "name":"Creating a Bandana Tie with a Washcloth",
      "steps":[
        {
          "headline":"Fold the large towel into thirds.",
          "description":"Place it flat on the table and fold its longer sides so they touch in the middle. Then fold the towel in half and drape it over a towel bar. Straighten out the ends so that they’re all even."
        },
        {
          "headline":"Fold the washcloth into a triangle over the folded towel.",
          "description":"Place the washcloth on a flat surface so it looks like a diamond shape. Fold the top triangular end to the bottom end to create a bandana shape."
        },
        {
          "headline":"Tie the corners of the triangle around the front half of the towel.",
          "description":"Tie both ends of the washcloth around the front-facing flap of the bath towel. If the washcloth is very thick, use a large safety pin or clothes pin to hold it around the bath towel. Get creative and add some silk flowers or other crafty items you might have around to the pocket created by the bandana tie."
        }
      ]
    }
  ],
  "text":" Hanging Towels in a Basic Way Spread the bath towel out on a flat surface. Any flat surface you have handy will work. You can use a table, the bed, a counter, or whatever is convenient. It’s important to make sure the towel is spread out flat and evenly so the towel's ends line up as neatly as possible. Make sure the surface you’re using is clean and free of contaminants. The last thing you want after getting clean in the shower is drying with a dirty towel! Fold the towel into thirds and drape it over the towel bar. First, lay the towel flat. Then, fold each long edge toward the middle so both edges are touching in the center. Make sure the tag is inside! You can also fold one long side to the middle, and then fold the other long side on top of the first. Hang the towel over the bar. Adjust the hanging ends so that they’re both even. If more than one towel is hanging from the bar, keep them separated from each other to prevent mildew and mold. Hang a hand towel over a bath towel. To hang the hand towel, lay it on a flat surface and fold it into thirds vertically. Once it’s folded, drape it over the large towel on the rack. Choose towels that are color-coordinated. Turning a Towel into a Pocket Fold a large bath towel into thirds lengthwise. Lay the towel flat on a smooth surface. Fold each of the long sides so that they touch end-to-end in the middle. Then fold the towel in half and drape it over the bar. Create a lip fold on a smaller towel. Spread out a hand towel on a flat surface. Fold one of the shorter sides a quarter of the way towards the middle. Fold that edge again in half backwards to create the lip fold. Flip the small towel over and fold it into thirds lengthwise. With the lip facing down, fold 1 side of the towel so it meets the middle. Fold the other side so that it tucks into the fold created by the lip. Flip the towel back over and now you have a pocket where you can put items such as soap, lotion, or other toiletries. Hang the hand towel over the bath towel so the pocket is facing out. It’ll look like an apron with a pocket. Fold a washcloth with an accordion pleat and put it in the pocket. Lay the washcloth flat on a table and fold the side lengthwise to create pleats that overlap one another. Be sure to hold the washcloth tight so it doesn’t come undone! Fold it in half and carefully place inside of the pocket you created in the hand towel. Fan out the washcloth to make it look like a ruffle in the pocket. Creating a Bandana Tie with a Washcloth Fold the large towel into thirds. Place it flat on the table and fold its longer sides so they touch in the middle. Then fold the towel in half and drape it over a towel bar. Straighten out the ends so that they’re all even. Fold the washcloth into a triangle over the folded towel. Place the washcloth on a flat surface so it looks like a diamond shape. Fold the top triangular end to the bottom end to create a bandana shape. Tie the corners of the triangle around the front half of the towel. Tie both ends of the washcloth around the front-facing flap of the bath towel. If the washcloth is very thick, use a large safety pin or clothes pin to hold it around the bath towel. Get creative and add some silk flowers or other crafty items you might have around to the pocket created by the bandana tie.",
  "tyn_model":[
    "towel",
    "washcloth",
    "bath towel",
    "hand towel",
    "towels",
    "towel bar",
    "safety pin",
    "clothes pin"
  ],
  "tyn_section":[

  ]
}