{
  "title":"How to Make Chicken Pot Pie",
  "url":"https://www.wikihow.com/Make-Chicken-Pot-Pie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "methods":[
    {
      "name":"Making the Crust",
      "steps":[
        {
          "headline":"Combine the flour and salt.",
          "description":"Place the ingredients in a large mixing bowl and use a whisk to thoroughly combine them."
        },
        {
          "headline":"Cut in the butter and shortening.",
          "description":"Place the chilled butter cubes and shortening in the flour mixture. Use a pastry cutter or two forks to work the butter and shortening into the flour until the dough resembles small lentils or peas. If you have a food processor, you can make this step easier by placing the flour, salt, butter and shortening in the food processor and giving it a few pulses until the dough comes together as described above. Don't overwork the dough, or the crust will come out too tough. Leaving larger pieces of butter will result in a flaky crust."
        },
        {
          "headline":"Add some ice water.",
          "description":"Start with just a tablespoon of ice water. Use a wooden spoon to quickly work it into the dough. Pinch a bit of dough between your fingers. If it holds together, it's ready for the next stage. If it crumbles, add more ice water, mix it in, and test it again."
        },
        {
          "headline":"Form the dough into a disc.",
          "description":"Turn the dough onto a floured cutting board or countertop. Use your hands to form it into a flat disc. Wrap the disc in plastic wrap and put it in the refrigerator while you prepare the chicken pot pie filling."
        }
      ]
    },
    {
      "name":"Preparing the Filling",
      "steps":[
        {
          "headline":"Sauté the vegetables.",
          "description":"Place a large skillet over medium heat. Melt the butter, then add the onions, carrots, and celery. Cook the vegetables until the onions are translucent and the carrots and celery brighten, about 10 minutes."
        },
        {
          "headline":"Add the flour.",
          "description":"Sprinkle the flour evenly over the vegetables. Stir it in with a spoon as the vegetables keep sauteing, making sure that the flour coats them completely."
        },
        {
          "headline":"Add the milk and stock.",
          "description":"Pour the milk and chicken stock into the pan. Stir the mixture and let it simmer until it begins to thicken, which should happen after about 10 minutes. If the mixture boils, turn it down, so that the liquid doesn't cook off too quickly. Add a little more milk or stock if the mixture looks too thick."
        },
        {
          "headline":"Add the remaining ingredients.",
          "description":"Stir in the chicken, peas, thyme, sage, salt and pepper. Stir the filling and let it simmer for another 5 minutes. Taste it and add more salt and pepper if necessary. Remove the filling from heat, cover it, and set it aside."
        }
      ]
    },
    {
      "name":"Assembling the Pot Pies",
      "steps":[
        {
          "headline":"Preheat the oven to 400 degrees.",
          "description":""
        },
        {
          "headline":"Roll out the pie crust.",
          "description":"Remove the dough from the refrigerator and discard the plastic wrap. Set the dough on a floured work surface. Flour a rolling pin and roll the dough into a ⁄4 inch (0.6 cm) circle. If you want to make one large pie, roll the dough into a shape that matches the dish you're going to use. This could be a round pie or cake pan or a casserole dish. If you plan to make individual pies, cut the rolled-out dough into smaller shapes large enough to cover the baking dishes you plan on using."
        },
        {
          "headline":"Pour the filling into a dish.",
          "description":"If you want to make one large pot pie, pour the entire amount of filling into a deep pie dish or cake pan or an 8-inch casserole dish. To make individual pot pies, distribute it evenly among 4 ramekins."
        },
        {
          "headline":"Place the crust over the filling.",
          "description":"Drape the crust over the top of the baking dish, or dishes. Use your fingers to crimp it around the edges so that it stays secured in place. Use a knife to make a few cross hatches in the top of the crust. If you wish, use a fork to make decorative notches around the edge of the pie. If you're making more than one pie, repeat until each pie has a crust."
        },
        {
          "headline":"Bake the pie.",
          "description":"Place the pie (or pies) on a baking sheet, so that the filling won't spill over onto your oven floor as it cooks. Bake for about 20 minutes, until the crust is golden brown and slightly puffed."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Crust Combine the flour and salt. Place the ingredients in a large mixing bowl and use a whisk to thoroughly combine them. Cut in the butter and shortening. Place the chilled butter cubes and shortening in the flour mixture. Use a pastry cutter or two forks to work the butter and shortening into the flour until the dough resembles small lentils or peas. If you have a food processor, you can make this step easier by placing the flour, salt, butter and shortening in the food processor and giving it a few pulses until the dough comes together as described above. Don't overwork the dough, or the crust will come out too tough. Leaving larger pieces of butter will result in a flaky crust. Add some ice water. Start with just a tablespoon of ice water. Use a wooden spoon to quickly work it into the dough. Pinch a bit of dough between your fingers. If it holds together, it's ready for the next stage. If it crumbles, add more ice water, mix it in, and test it again. Form the dough into a disc. Turn the dough onto a floured cutting board or countertop. Use your hands to form it into a flat disc. Wrap the disc in plastic wrap and put it in the refrigerator while you prepare the chicken pot pie filling. Preparing the Filling Sauté the vegetables. Place a large skillet over medium heat. Melt the butter, then add the onions, carrots, and celery. Cook the vegetables until the onions are translucent and the carrots and celery brighten, about 10 minutes. Add the flour. Sprinkle the flour evenly over the vegetables. Stir it in with a spoon as the vegetables keep sauteing, making sure that the flour coats them completely. Add the milk and stock. Pour the milk and chicken stock into the pan. Stir the mixture and let it simmer until it begins to thicken, which should happen after about 10 minutes. If the mixture boils, turn it down, so that the liquid doesn't cook off too quickly. Add a little more milk or stock if the mixture looks too thick. Add the remaining ingredients. Stir in the chicken, peas, thyme, sage, salt and pepper. Stir the filling and let it simmer for another 5 minutes. Taste it and add more salt and pepper if necessary. Remove the filling from heat, cover it, and set it aside. Assembling the Pot Pies Preheat the oven to 400 degrees.  Roll out the pie crust. Remove the dough from the refrigerator and discard the plastic wrap. Set the dough on a floured work surface. Flour a rolling pin and roll the dough into a ⁄4 inch (0.6 cm) circle. If you want to make one large pie, roll the dough into a shape that matches the dish you're going to use. This could be a round pie or cake pan or a casserole dish. If you plan to make individual pies, cut the rolled-out dough into smaller shapes large enough to cover the baking dishes you plan on using. Pour the filling into a dish. If you want to make one large pot pie, pour the entire amount of filling into a deep pie dish or cake pan or an 8-inch casserole dish. To make individual pot pies, distribute it evenly among 4 ramekins. Place the crust over the filling. Drape the crust over the top of the baking dish, or dishes. Use your fingers to crimp it around the edges so that it stays secured in place. Use a knife to make a few cross hatches in the top of the crust. If you wish, use a fork to make decorative notches around the edge of the pie. If you're making more than one pie, repeat until each pie has a crust. Bake the pie. Place the pie (or pies) on a baking sheet, so that the filling won't spill over onto your oven floor as it cooks. Bake for about 20 minutes, until the crust is golden brown and slightly puffed. Finished. ",
  "tyn_model":[
    "flour",
    "butter",
    "shortening",
    "ice water",
    "milk",
    "salt",
    "food processor",
    "plastic wrap",
    "onions",
    "carrots",
    "stock",
    "salt and pepper",
    "oven",
    "cake pan",
    "large mixing bowl",
    "whisk",
    "pastry cutter",
    "forks",
    "wooden spoon",
    "chicken pot pie",
    "large skillet",
    "celery",
    "vegetables",
    "spoon",
    "chicken stock",
    "chicken",
    "peas",
    "thyme",
    "sage",
    "pot pies",
    "pie crust",
    "refrigerator",
    "rolling pin",
    "casserole dish",
    "baking dishes",
    "dish",
    "pie dish",
    "8-inch casserole dish",
    "ramekins",
    "baking dish",
    "dishes",
    "knife",
    "fork",
    "baking sheet"
  ],
  "tyn_section":[

  ]
}