{
  "title":"How to Decorate a Corner",
  "url":"https://www.wikihow.com/Decorate-a-Corner",
  "category_hierarchy":[
    "Home and Garden",
    "Apartment Living",
    "Decorating Apartments"
  ],
  "methods":[
    {
      "name":"Decorating with Furniture",
      "steps":[
        {
          "headline":"Place a desk in the corner to create a workspace.",
          "description":"A desk is one of the most traditional pieces of furniture for a corner. Having your desk in a corner can help you shut out distractions, and you’ll have extra wall space if you want to add shelves to hold your books. A corner desk is a great place to put the family computer if you have kids so you can easily see what they’re doing when they’re online."
        },
        {
          "headline":"Place a sectional sofa in the corner if you want increased seating.",
          "description":"Sectionals are one of the best ways to expand your living room, especially if the empty corner is already near your sofa. A curved sofa will work in this area as well. Just make sure you measure the space before you purchase your couch to make sure it will fit! You can even find unique sofas and chaises that will fit oddly-shaped corners. If you don't want to use a sectional, you could also place a couch against each wall, with an end table tucked into the corner between them."
        },
        {
          "headline":"Use an angled television stand if you'd like to put your TV in the corner.",
          "description":"Just because you can’t miss the latest episode of This is Us doesn’t mean you necessarily want your flatscreen to be the centerpiece of the room. A corner television stand will help you make use of an out-of-the-way corner while finding a solution to where to put your TV. You can find corner TV stands that function as an entire entertainment centers, or you can find standalone units if you want the space to look more open. This is a great option for open floor plans, since the furniture arrangement in these spaces is often angled to make the most of the room."
        },
        {
          "headline":"Add a round table to a corner to create a dining area.",
          "description":"Make the most of an unused corner by giving your family a cozy spot to eat together. Putting a round table in a corner will allow more people to sit comfortably around the table than you would be able to fit with a square or rectangular table. This is perfect if you want to add a breakfast nook but you don’t have much room."
        },
        {
          "headline":"Arrange a comfy chair in a lamp in a corner if you want a reading nook.",
          "description":"If you like to read, or even if you just want a cozy spot to surf the Internet, you’ll love having your very own reading nook. Pick a plush chair, hang a warm light or place a floor lamp nearby, and add an ottoman. For an extra touch of comfort, keep a plush throw draped over the back of the chair. You may want to add a small side table to the space in case you want a cup of tea while you’re reading! Make it a combination reading nook and conversation space by using 2 chairs and a small side table."
        },
        {
          "headline":"Fill a small space with a triangular-shaped cabinet, shelves or table.",
          "description":"The question of what to put in a corner is one that’s been plaguing people for years. Eventually, someone came up with the idea to build triangle-shaped furniture that would fit in a corner. If you want extra storage, opt for a corner cabinet, but if you want the space to still feel open, a small table will work instead. If you want to take advantage of the height of a room, choose a tall cabinet with a combination of shelves and hidden storage. This would also be a good space to put a corner China hutch. If you’re having trouble finding a cabinet that fits your corner, consider having a custom piece built!"
        }
      ]
    },
    {
      "name":"Adding Décor",
      "steps":[
        {
          "headline":"Place a tall houseplant in a corner to bring a touch of nature indoors.",
          "description":"If you have an empty corner, a houseplant can be the perfect addition to your home. In addition to being beautiful to look at, houseplants are great for your household environment. They release oxygen into the air while filtering out harmful toxins. In addition, they can even make you feel less stressed. To draw your eye upward, choose a tall houseplant like a Bird of Paradise, Caryota, or Ficus plant. If you prefer smaller houseplants, like African violets, spider plants, or bromeliads, place them on a small table or a stand."
        },
        {
          "headline":"Hang blankets from a quilt ladder in the corner to add storage space.",
          "description":"If you have a stack of blankets that you can never seem to find a home for, a quilt ladder tucked into a corner could be the answer you need. Just prop it against the wall and hang your extra blankets from the rungs. You can buy a quilt ladder made specifically for this purpose, or you can repurpose an old wooden ladder for a shabby-chic look."
        },
        {
          "headline":"Use the corner as a showcase if you have a big piece that doesn’t fit anywhere else.",
          "description":"Maybe it's a hand-painted surfboard, a coat rack, or a giant globe. If you have a large item that’s too bulky to fit anywhere else, prop it in a corner and surround it by artwork, a rug, and maybe even special lighting. Remember, you can turn almost anything into artwork! The trick here is to make the item look like it’s there intentionally. Pick accent pieces that mimic the style of the larger piece. For instance, if your item is brightly-colored, surround it with pop art and a bright rug. If your piece is more formal, consider placing framed, classical art on the wall around it."
        },
        {
          "headline":"Add a large upright mirror to a corner where you get ready each day.",
          "description":"Upright mirrors are tasteful pieces that are as functional as they are beautiful. After all, there’s nothing better than being able to check your outfit head-to-toe before you walk out the door. Place the mirror in a corner that gets plenty of light, then have a mini fashion show every morning! In addition to looking nice, a mirror will make your room feel larger."
        },
        {
          "headline":"Install shelves in the corner to create a custom display.",
          "description":"If you have a lot of little items you’ve collected in your life, you need somewhere to show them off. You can buy premade shelves, or you can build your own. Once the shelves are installed, decorate them with a combination of your personal items and a few books. You can place decorative boxes on your shelves to provide storage for paperwork, stray cords, batteries, and other miscellaneous items."
        },
        {
          "headline":"Create a corner gallery wall if you have a lot of pictures.",
          "description":"If you love framed art, you can make the most of the wall space in your corner by grouping together your favorite pieces. Choose a mixture of portraits of your family, monograms, inspirational sayings, and art you like to create a beautiful customized display. In addition to using a variety of pictures, you can also mix and match frame sizes, shapes, and colors to create an eclectic feel. If you prefer a more put-together look, use frames that are all the same color in varying sizes."
        },
        {
          "headline":"Place a floor lamp in the corner if you want more light.",
          "description":"If you want to decorate a small, dark corner of your home, a floor lamp is an elegant solution. Most floor lamps look nice even when they’re turned off, and the warm glow of lamplight is beautiful after the sun goes down. You can use a floor lamp alone to bring style to your corner, or you can use it in combination with any other décor! If you need your lighting to be versatile, look for a lamp with a dimmer switch and a pivoting head. Look for a lamp with a sturdy base, especially if you have small children who might knock your lamp over while they’re playing!"
        }
      ]
    }
  ],
  "text":" Decorating with Furniture Place a desk in the corner to create a workspace. A desk is one of the most traditional pieces of furniture for a corner. Having your desk in a corner can help you shut out distractions, and you’ll have extra wall space if you want to add shelves to hold your books. A corner desk is a great place to put the family computer if you have kids so you can easily see what they’re doing when they’re online. Place a sectional sofa in the corner if you want increased seating. Sectionals are one of the best ways to expand your living room, especially if the empty corner is already near your sofa. A curved sofa will work in this area as well. Just make sure you measure the space before you purchase your couch to make sure it will fit! You can even find unique sofas and chaises that will fit oddly-shaped corners. If you don't want to use a sectional, you could also place a couch against each wall, with an end table tucked into the corner between them. Use an angled television stand if you'd like to put your TV in the corner. Just because you can’t miss the latest episode of This is Us doesn’t mean you necessarily want your flatscreen to be the centerpiece of the room. A corner television stand will help you make use of an out-of-the-way corner while finding a solution to where to put your TV. You can find corner TV stands that function as an entire entertainment centers, or you can find standalone units if you want the space to look more open. This is a great option for open floor plans, since the furniture arrangement in these spaces is often angled to make the most of the room. Add a round table to a corner to create a dining area. Make the most of an unused corner by giving your family a cozy spot to eat together. Putting a round table in a corner will allow more people to sit comfortably around the table than you would be able to fit with a square or rectangular table. This is perfect if you want to add a breakfast nook but you don’t have much room. Arrange a comfy chair in a lamp in a corner if you want a reading nook. If you like to read, or even if you just want a cozy spot to surf the Internet, you’ll love having your very own reading nook. Pick a plush chair, hang a warm light or place a floor lamp nearby, and add an ottoman. For an extra touch of comfort, keep a plush throw draped over the back of the chair. You may want to add a small side table to the space in case you want a cup of tea while you’re reading! Make it a combination reading nook and conversation space by using 2 chairs and a small side table. Fill a small space with a triangular-shaped cabinet, shelves or table. The question of what to put in a corner is one that’s been plaguing people for years. Eventually, someone came up with the idea to build triangle-shaped furniture that would fit in a corner. If you want extra storage, opt for a corner cabinet, but if you want the space to still feel open, a small table will work instead. If you want to take advantage of the height of a room, choose a tall cabinet with a combination of shelves and hidden storage. This would also be a good space to put a corner China hutch. If you’re having trouble finding a cabinet that fits your corner, consider having a custom piece built! Adding Décor Place a tall houseplant in a corner to bring a touch of nature indoors. If you have an empty corner, a houseplant can be the perfect addition to your home. In addition to being beautiful to look at, houseplants are great for your household environment. They release oxygen into the air while filtering out harmful toxins. In addition, they can even make you feel less stressed. To draw your eye upward, choose a tall houseplant like a Bird of Paradise, Caryota, or Ficus plant. If you prefer smaller houseplants, like African violets, spider plants, or bromeliads, place them on a small table or a stand. Hang blankets from a quilt ladder in the corner to add storage space. If you have a stack of blankets that you can never seem to find a home for, a quilt ladder tucked into a corner could be the answer you need. Just prop it against the wall and hang your extra blankets from the rungs. You can buy a quilt ladder made specifically for this purpose, or you can repurpose an old wooden ladder for a shabby-chic look. Use the corner as a showcase if you have a big piece that doesn’t fit anywhere else. Maybe it's a hand-painted surfboard, a coat rack, or a giant globe. If you have a large item that’s too bulky to fit anywhere else, prop it in a corner and surround it by artwork, a rug, and maybe even special lighting. Remember, you can turn almost anything into artwork! The trick here is to make the item look like it’s there intentionally. Pick accent pieces that mimic the style of the larger piece. For instance, if your item is brightly-colored, surround it with pop art and a bright rug. If your piece is more formal, consider placing framed, classical art on the wall around it. Add a large upright mirror to a corner where you get ready each day. Upright mirrors are tasteful pieces that are as functional as they are beautiful. After all, there’s nothing better than being able to check your outfit head-to-toe before you walk out the door. Place the mirror in a corner that gets plenty of light, then have a mini fashion show every morning! In addition to looking nice, a mirror will make your room feel larger. Install shelves in the corner to create a custom display. If you have a lot of little items you’ve collected in your life, you need somewhere to show them off. You can buy premade shelves, or you can build your own. Once the shelves are installed, decorate them with a combination of your personal items and a few books. You can place decorative boxes on your shelves to provide storage for paperwork, stray cords, batteries, and other miscellaneous items. Create a corner gallery wall if you have a lot of pictures. If you love framed art, you can make the most of the wall space in your corner by grouping together your favorite pieces. Choose a mixture of portraits of your family, monograms, inspirational sayings, and art you like to create a beautiful customized display. In addition to using a variety of pictures, you can also mix and match frame sizes, shapes, and colors to create an eclectic feel. If you prefer a more put-together look, use frames that are all the same color in varying sizes. Place a floor lamp in the corner if you want more light. If you want to decorate a small, dark corner of your home, a floor lamp is an elegant solution. Most floor lamps look nice even when they’re turned off, and the warm glow of lamplight is beautiful after the sun goes down. You can use a floor lamp alone to bring style to your corner, or you can use it in combination with any other décor! If you need your lighting to be versatile, look for a lamp with a dimmer switch and a pivoting head. Look for a lamp with a sturdy base, especially if you have small children who might knock your lamp over while they’re playing!",
  "tyn_model":[
    "shelves",
    "table",
    "lamp",
    "floor lamp",
    "desk",
    "sofa",
    "cabinet",
    "blankets",
    "quilt ladder",
    "mirror",
    "couch",
    "television stand",
    "tv",
    "rug",
    "computer",
    "sofas",
    "sectional",
    "tv stands",
    "entertainment centers",
    "chair",
    "ottoman",
    "chairs",
    "houseplant",
    "houseplants",
    "ladder",
    "coat rack",
    "mirrors",
    "books",
    "pictures",
    "frames",
    "floor lamps"
  ],
  "tyn_section":[

  ]
}