{
  "title":"How to Make a Logo on Clothes",
  "url":"https://www.wikihow.com/Make-a-Logo-on-Clothes",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects"
  ],
  "steps":[
    {
      "headline":"Buy the paper.",
      "description":"You can't do this with any other paper but special transfer paper."
    },
    {
      "headline":"Get a design made up on Photoshop or Gimp or any other image editing software.",
      "description":"And remember to create it in reverse!"
    },
    {
      "headline":"Print the design or image out on the transfer paper",
      "description":""
    },
    {
      "headline":"Pre-heat the clothing iron to the temperature noted on your package.",
      "description":""
    },
    {
      "headline":"Lay your jeans or t-shirt or other clothing item out on the ironing board.",
      "description":""
    },
    {
      "headline":"Heat it up with the iron for about 5 seconds.",
      "description":""
    },
    {
      "headline":"Place the transfer sheet face down on the area you want to transfer the image to, for the time noted on your package (may vary due to brand or quality).",
      "description":""
    },
    {
      "headline":"Lift up your customized t-shirt.",
      "description":"Bask in the glory and satisfaction of a DIY custom t-shirt. There's only one and it's yours, congrats!"
    }
  ],
  "text":" Buy the paper. You can't do this with any other paper but special transfer paper. Get a design made up on Photoshop or Gimp or any other image editing software. And remember to create it in reverse! Print the design or image out on the transfer paper  Pre-heat the clothing iron to the temperature noted on your package.  Lay your jeans or t-shirt or other clothing item out on the ironing board.  Heat it up with the iron for about 5 seconds.  Place the transfer sheet face down on the area you want to transfer the image to, for the time noted on your package (may vary due to brand or quality).  Lift up your customized t-shirt. Bask in the glory and satisfaction of a DIY custom t-shirt. There's only one and it's yours, congrats!",
  "tyn_model":[
    "t-shirt",
    "paper",
    "image editing software",
    "transfer paper",
    "clothing iron",
    "ironing board",
    "iron"
  ],
  "tyn_section":[

  ]
}