{
  "title":"How to Decorate a Console Table",
  "url":"https://www.wikihow.com/Decorate-a-Console-Table",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "parts":[
    {
      "name":"Creating a Cohesive Display",
      "steps":[
        {
          "headline":"Consider your color palette.",
          "description":"The colors that you include in your console table display should match the room the table is in as well as the physical table. You can opt for color palettes in neutrals, pastels, or bold colors. For example, you might pick a neutral color palette for a white console table, sticking with whites, tans, and very light pastel colors for your objects. Create a display that pops by picking out objects in bold colors, such as bright flowers, red books, or patterned picture frames."
        },
        {
          "headline":"Choose complementary styles for cohesive decorations.",
          "description":"This could include sticking with a certain theme or vibe when selecting your items to display, or even just picking out objects that go with one another in color or material. This is a great way to incorporate a console table into a room that's already decorated a certain way. For example, if your console table is in a room with red accents, pick out red objects to place on the table. You might choose to decorate the console table in a beachy vibe, picking out weathered wooden picture frames, candles with sand in them, or a lamp with seashells on it."
        },
        {
          "headline":"Pick out items in different textures or patterns for an eclectic look.",
          "description":"If you don't want your console table to be too matched up and rigid, opt for selecting items that look good together but are of different styles. This might be items that are similar in color but are all made of different materials or patterns, or items that are all different colors but have an underlying similar look to them. You might have a blue polka dot lamp, light blue striped picture frames, and books in colors such as blue, green, white, and purple. Maybe your console table displays items in every color, but they're all made of a solid-colored material."
        },
        {
          "headline":"Use the console table to display your personality.",
          "description":"You can do this by displaying framed photographs of your family, placing books on the table that you find interesting, or picking out artwork that represents you. By picking out objects and colors schemes that you really like, your console table will automatically look more intriguing. Handmade pottery, such as a ceramic plate that you painted, is also a great object to show off your individualized style."
        },
        {
          "headline":"Display framed photos on the table to add a personalized touch.",
          "description":"If you don’t want to clutter your console table with random objects, choose pictures to have printed and framed. These can be pictures of your family, friends, or experiences that you remember fondly. Display a few of them on the table, making sure to space them out so they’re all clearly visible. Choose frames that go along with your chosen color scheme. If your console table has shelving underneath the table, this is also a good spot to display photos."
        }
      ]
    },
    {
      "name":"Arranging Décor",
      "steps":[
        {
          "headline":"Create a focal point.",
          "description":"This is the object that should catch the viewer’s eye and make them want to examine the console table more closely. These focal points usually hang right above the console table on the wall and are quite large. Pieces of art, such as paintings or photography, are popular choices for creating a focal point. Framed mirrors also work well as focal points. Make sure your console table is wider than your chosen focal point object."
        },
        {
          "headline":"Vary the height of the objects on the table.",
          "description":"Some objects should be short, some should be tall, and others should be right in between. This helps make your table look more balanced and complex while creating a pleasing visual aesthetic. For example, place a small stack of books, a picture frame, and a tall vase on the table. Good tall objects include lamps, flowers, and candlesticks. Shorter objects might include photo albums, pottery, and trinket boxes."
        },
        {
          "headline":"Strike a balance between the objects.",
          "description":"You can create balance by grouping similar items together or putting objects with similar heights and sizes at both ends of the table. This makes the console table look more symmetric and planned. For example, put a tall lamp at one end of the table to balance out a tall candlestick at the other end. Identical chairs look great at either end of the table, as do potted plants."
        },
        {
          "headline":"Make sure you have some negative space.",
          "description":"While you don’t want your console table to be completely bare, it’s important that it doesn’t look overcrowded either. Leave some space cleared out so that the table still looks organized, giving you room to lay something down on the table if needed."
        }
      ]
    },
    {
      "name":"Adding Functional Elements",
      "steps":[
        {
          "headline":"Pick out a lamp to add light.",
          "description":"Lamps add excellent height to your console table while also being useful. Choose a lamp from a home goods or big box store with a shade and stand that you like and that goes with your color scheme for the console table. Make sure your console table is up against a wall that has access to an electrical plug so you’ll be able to plug in the lamp. If you have a lamp in your house that you haven’t been using, consider putting this lamp on the console table and swapping its shade for a new one, if desired."
        },
        {
          "headline":"Add baskets underneath the table for storage.",
          "description":"This works well if your console table doesn’t have very many shelves underneath and you’re left with lots of white space near the floor. Look for storage options, such as braided or woven baskets, to set underneath the table so you can store extra items down there. Measure your table so that you know how much space you have underneath to help you find storage options that are the right size. It’s best to choose a storage option that you can’t see through and has a lid to hide the clutter."
        },
        {
          "headline":"Place a chair in front of the console table to use it as a desk.",
          "description":"If your console table has leg room underneath and is wide enough to be used as a small desk, adding a nice chair is a simple way to make use of it. If you have a mirror as one of your objects, you can even use the console table and chair as a vanity as well. If you're using the console table as a desk, try to keep it uncluttered by only placing a few items on it, such as a lamp, pad of paper, and decorative piece. Console tables with drawers are great for desk use or vanities."
        },
        {
          "headline":"Display books to use the console table as shelving.",
          "description":"If you need an extra place to store books, consider placing your best books on the console table. You can use bookends to position the books if there isn't any shelving, or stack the books on top of one another neatly. Keep in mind that the books you choose to store on the console table are also there for display, so select books with hard covers or aesthetically pleasing binding."
        },
        {
          "headline":"Place plants on the table to enhance the air.",
          "description":"You can choose small green plants, such as succulents, to display on the console table, or opt for a larger item such as a vase of flowers. Adding plants to your table display is a great way to liven up the table and make the area smell fresh. Remember to water the plants as needed so they remain as fresh as possible. Make sure the plants are resting on something that won’t damage the table (especially if water drips from the container)."
        }
      ]
    }
  ],
  "text":" Creating a Cohesive Display Consider your color palette. The colors that you include in your console table display should match the room the table is in as well as the physical table. You can opt for color palettes in neutrals, pastels, or bold colors. For example, you might pick a neutral color palette for a white console table, sticking with whites, tans, and very light pastel colors for your objects. Create a display that pops by picking out objects in bold colors, such as bright flowers, red books, or patterned picture frames. Choose complementary styles for cohesive decorations. This could include sticking with a certain theme or vibe when selecting your items to display, or even just picking out objects that go with one another in color or material. This is a great way to incorporate a console table into a room that's already decorated a certain way. For example, if your console table is in a room with red accents, pick out red objects to place on the table. You might choose to decorate the console table in a beachy vibe, picking out weathered wooden picture frames, candles with sand in them, or a lamp with seashells on it. Pick out items in different textures or patterns for an eclectic look. If you don't want your console table to be too matched up and rigid, opt for selecting items that look good together but are of different styles. This might be items that are similar in color but are all made of different materials or patterns, or items that are all different colors but have an underlying similar look to them. You might have a blue polka dot lamp, light blue striped picture frames, and books in colors such as blue, green, white, and purple. Maybe your console table displays items in every color, but they're all made of a solid-colored material. Use the console table to display your personality. You can do this by displaying framed photographs of your family, placing books on the table that you find interesting, or picking out artwork that represents you. By picking out objects and colors schemes that you really like, your console table will automatically look more intriguing. Handmade pottery, such as a ceramic plate that you painted, is also a great object to show off your individualized style. Display framed photos on the table to add a personalized touch. If you don’t want to clutter your console table with random objects, choose pictures to have printed and framed. These can be pictures of your family, friends, or experiences that you remember fondly. Display a few of them on the table, making sure to space them out so they’re all clearly visible. Choose frames that go along with your chosen color scheme. If your console table has shelving underneath the table, this is also a good spot to display photos. Arranging Décor Create a focal point. This is the object that should catch the viewer’s eye and make them want to examine the console table more closely. These focal points usually hang right above the console table on the wall and are quite large. Pieces of art, such as paintings or photography, are popular choices for creating a focal point. Framed mirrors also work well as focal points. Make sure your console table is wider than your chosen focal point object. Vary the height of the objects on the table. Some objects should be short, some should be tall, and others should be right in between. This helps make your table look more balanced and complex while creating a pleasing visual aesthetic. For example, place a small stack of books, a picture frame, and a tall vase on the table. Good tall objects include lamps, flowers, and candlesticks. Shorter objects might include photo albums, pottery, and trinket boxes. Strike a balance between the objects. You can create balance by grouping similar items together or putting objects with similar heights and sizes at both ends of the table. This makes the console table look more symmetric and planned. For example, put a tall lamp at one end of the table to balance out a tall candlestick at the other end. Identical chairs look great at either end of the table, as do potted plants. Make sure you have some negative space. While you don’t want your console table to be completely bare, it’s important that it doesn’t look overcrowded either. Leave some space cleared out so that the table still looks organized, giving you room to lay something down on the table if needed. Adding Functional Elements Pick out a lamp to add light. Lamps add excellent height to your console table while also being useful. Choose a lamp from a home goods or big box store with a shade and stand that you like and that goes with your color scheme for the console table. Make sure your console table is up against a wall that has access to an electrical plug so you’ll be able to plug in the lamp. If you have a lamp in your house that you haven’t been using, consider putting this lamp on the console table and swapping its shade for a new one, if desired. Add baskets underneath the table for storage. This works well if your console table doesn’t have very many shelves underneath and you’re left with lots of white space near the floor. Look for storage options, such as braided or woven baskets, to set underneath the table so you can store extra items down there. Measure your table so that you know how much space you have underneath to help you find storage options that are the right size. It’s best to choose a storage option that you can’t see through and has a lid to hide the clutter. Place a chair in front of the console table to use it as a desk. If your console table has leg room underneath and is wide enough to be used as a small desk, adding a nice chair is a simple way to make use of it. If you have a mirror as one of your objects, you can even use the console table and chair as a vanity as well. If you're using the console table as a desk, try to keep it uncluttered by only placing a few items on it, such as a lamp, pad of paper, and decorative piece. Console tables with drawers are great for desk use or vanities. Display books to use the console table as shelving. If you need an extra place to store books, consider placing your best books on the console table. You can use bookends to position the books if there isn't any shelving, or stack the books on top of one another neatly. Keep in mind that the books you choose to store on the console table are also there for display, so select books with hard covers or aesthetically pleasing binding. Place plants on the table to enhance the air. You can choose small green plants, such as succulents, to display on the console table, or opt for a larger item such as a vase of flowers. Adding plants to your table display is a great way to liven up the table and make the area smell fresh. Remember to water the plants as needed so they remain as fresh as possible. Make sure the plants are resting on something that won’t damage the table (especially if water drips from the container).",
  "tyn_model":[
    "lamp",
    "books",
    "console table",
    "plants",
    "pottery",
    "lamps",
    "baskets",
    "chair",
    "water",
    "candles",
    "ceramic plate",
    "pictures",
    "photos",
    "décor",
    "photography",
    "mirrors",
    "picture frame",
    "vase",
    "flowers",
    "candlesticks",
    "photo albums",
    "candlestick",
    "chairs",
    "mirror",
    "console tables",
    "bookends",
    "container"
  ],
  "tyn_section":[

  ]
}