{
  "title":"How to Dispose of a Fridge",
  "url":"https://www.wikihow.com/Dispose-of-a-Fridge",
  "category_hierarchy":[
    "Home and Garden",
    "Home Appliances"
  ],
  "methods":[
    {
      "name":"Throwing the Fridge Away",
      "steps":[
        {
          "headline":"Hire a professional to evacuate the freon from the fridge.",
          "description":"Freon is a refrigerant used to keep your fridge cold that needs to be removed before it can be thrown away. Only those certified by the Environmental Protection Agency (EPA) can evacuate freon with special tools. Call an appliance store or an air conditioning company to see if they can properly remove the freon. Freon removal usually costs around $35-50 USD. Freon is a greenhouse gas that can damage the ozone if it gets into the air. Some cities offer freon removal services by appointment. Venting freon on your own could lead to a fine of up to $25,000 USD."
        },
        {
          "headline":"Call your local waste removal service to schedule a bulk trash pick-up.",
          "description":"Bulk pick-ups are used to pick up heavy items that don't fit inside your regular trash bin. Make the call at least 24 hours in advance of when you want to throw away the fridge. Let them know you're disposing of a fridge that already has the refrigerant emptied. Some cities have scheduled bulk trash days. Look at your local waste management's website to see when the scheduled days are. If you're okay with having the fridge until that day, you can wait without scheduling an appointment."
        },
        {
          "headline":"Move the fridge to the curb the morning of your scheduled pick-up.",
          "description":"Have a friend or two help you maneuver the fridge outside to the curb. Make sure the back of the fridge faces the street so waste collection can see that it's ready for pick-up. If you're busy the morning of the pick-up, move the fridge outside the night before. Don't try to move the fridge by yourself since you could get injured by trying to lift it or it falling on you."
        },
        {
          "headline":"Take the fridge to the waste facility yourself if a pick-up is not possible.",
          "description":"Rent a truck or van if you don't already have one. Have someone help you load the fridge into the vehicle and drive to the facility. You can find your nearest bulk drop-off facility here: https://www.wmsolutions.com/facilities/."
        }
      ]
    },
    {
      "name":"Recycling Your Fridge",
      "steps":[
        {
          "headline":"Resell the fridge if it's still in working condition.",
          "description":"List the fridge online or in local ads to let others know your old fridge is available. Include details like the size, how old it is, and any other features it has. Explicitly state whether you can drop off the fridge or if the buyer needs to pick it up from you. Websites like Craigslist or Facebook Marketplace are great places to list your fridge locally. Keep the fridge plugged in so the buyer can see it's in working order."
        },
        {
          "headline":"Call your electric company to see if they offer a bounty program for reimbursement.",
          "description":"A bounty program collects older, inefficient appliances and often gives a rebate towards purchasing a new fridge. See if your utility company has pick-ups available for the fridge you want to get rid of. Some bounty programs require the fridge to be of a certain size and in working condition. Ask about the specifications that your fridge needs to meet."
        },
        {
          "headline":"Look for a Responsible Appliance Disposal partner to safely get rid of the appliance.",
          "description":"The Responsible Appliance Disposal (RAD) program recycles the pieces from your fridge safely to avoid any contaminants from entering the environment. Most RAD partners can pick up your fridge directly from your home and take them to a recycling facility to break them down. Locate your nearest RAD Partner Program here: https://www.epa.gov/rad/find-rad-partner-programs. Refrigerators can be broken down for their metals, plastics, and glass, and can be reused in other products."
        },
        {
          "headline":"Ask your local appliance store if they'll accept the fridge as a trade-in.",
          "description":"Some stores will offer discounts or rebates towards new appliances when you take in your old fridge. Call the nearest store to see what their policy is for any drop-offs or trade-ins. Some places may offer to pick up old appliances if you have new ones delivered to your home."
        }
      ]
    }
  ],
  "text":" Throwing the Fridge Away Hire a professional to evacuate the freon from the fridge. Freon is a refrigerant used to keep your fridge cold that needs to be removed before it can be thrown away. Only those certified by the Environmental Protection Agency (EPA) can evacuate freon with special tools. Call an appliance store or an air conditioning company to see if they can properly remove the freon. Freon removal usually costs around $35-50 USD. Freon is a greenhouse gas that can damage the ozone if it gets into the air. Some cities offer freon removal services by appointment. Venting freon on your own could lead to a fine of up to $25,000 USD. Call your local waste removal service to schedule a bulk trash pick-up. Bulk pick-ups are used to pick up heavy items that don't fit inside your regular trash bin. Make the call at least 24 hours in advance of when you want to throw away the fridge. Let them know you're disposing of a fridge that already has the refrigerant emptied. Some cities have scheduled bulk trash days. Look at your local waste management's website to see when the scheduled days are. If you're okay with having the fridge until that day, you can wait without scheduling an appointment. Move the fridge to the curb the morning of your scheduled pick-up. Have a friend or two help you maneuver the fridge outside to the curb. Make sure the back of the fridge faces the street so waste collection can see that it's ready for pick-up. If you're busy the morning of the pick-up, move the fridge outside the night before. Don't try to move the fridge by yourself since you could get injured by trying to lift it or it falling on you. Take the fridge to the waste facility yourself if a pick-up is not possible. Rent a truck or van if you don't already have one. Have someone help you load the fridge into the vehicle and drive to the facility. You can find your nearest bulk drop-off facility here: https://www.wmsolutions.com/facilities/. Recycling Your Fridge Resell the fridge if it's still in working condition. List the fridge online or in local ads to let others know your old fridge is available. Include details like the size, how old it is, and any other features it has. Explicitly state whether you can drop off the fridge or if the buyer needs to pick it up from you. Websites like Craigslist or Facebook Marketplace are great places to list your fridge locally. Keep the fridge plugged in so the buyer can see it's in working order. Call your electric company to see if they offer a bounty program for reimbursement. A bounty program collects older, inefficient appliances and often gives a rebate towards purchasing a new fridge. See if your utility company has pick-ups available for the fridge you want to get rid of. Some bounty programs require the fridge to be of a certain size and in working condition. Ask about the specifications that your fridge needs to meet. Look for a Responsible Appliance Disposal partner to safely get rid of the appliance. The Responsible Appliance Disposal (RAD) program recycles the pieces from your fridge safely to avoid any contaminants from entering the environment. Most RAD partners can pick up your fridge directly from your home and take them to a recycling facility to break them down. Locate your nearest RAD Partner Program here: https://www.epa.gov/rad/find-rad-partner-programs. Refrigerators can be broken down for their metals, plastics, and glass, and can be reused in other products. Ask your local appliance store if they'll accept the fridge as a trade-in. Some stores will offer discounts or rebates towards new appliances when you take in your old fridge. Call the nearest store to see what their policy is for any drop-offs or trade-ins. Some places may offer to pick up old appliances if you have new ones delivered to your home.",
  "tyn_model":[
    "fridge",
    "freon",
    "appliance store",
    "environmental protection agency",
    "air conditioning",
    "greenhouse gas",
    "waste removal service",
    "bulk trash pick-up",
    "refrigerant",
    "waste collection",
    "electric company",
    "utility company",
    "rad partner",
    "refrigerators",
    "appliances"
  ],
  "tyn_section":[

  ]
}