{
  "title":"How to Wash Avocados",
  "url":"https://www.wikihow.com/Wash-Avocados",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Cleaning the Avocado Skins",
      "steps":[
        {
          "headline":"Place the avocados under cool or lukewarm running water.",
          "description":"Do not fill the sink with water and leave the avocados in it, as this does not effectively remove dirt. Simply turn on the water and hold the avocados under it. Make sure that your water is potable, or suitable for drinking or washing food. If possible, use distilled water or bottled water, which has been filtered to get rid of contaminants."
        },
        {
          "headline":"Clean dirt and other residues off the avocado skins with a vegetable brush.",
          "description":"As you hold the avocado under running water, take a clean vegetable brush and scrub the surface of the avocado gently. Do this until there is no longer any dirt or other visible residues on the skin. Do not use soap, bleach, or specialty fruit washes. They are not more effective than running water. If you do not have a vegetable brush, use a new toothbrush. Do not use your hands. Avocado skins are grooved and may be covered with artificial wax that can trap pathogens. It is impossible to get all the trapped bacteria out with only your hands."
        },
        {
          "headline":"Dry the avocados thoroughly.",
          "description":"Moisture is one of the conditions that bacteria need in order to grow. After you have removed all the dirt and residue, pat your avocados completely dry with a paper towel and set them on the cutting board to slice."
        }
      ]
    },
    {
      "name":"Maintaining a Clean Working Surface",
      "steps":[
        {
          "headline":"Select avocados without brown spots or bruises.",
          "description":"Decide what type of avocados you need and how ripe you want them to be, then check each fruit for brown spots or bruises. Brown spots and bruises are conducive to bacterial growth, so picking avocados with unblemished skins will help you avoid overly contaminated fruits. Make sure to avoid bruising your avocados after you buy them so that you are not introducing bacteria into the fruit. Do not place heavy objects on or around avocados in the shopping bag, and store them somewhere where they will not be crushed."
        },
        {
          "headline":"Wash your hands with water and hand soap.",
          "description":"This will help prevent bacteria on your hands from transferring to the fruit. Turn on running water, lather your hands with soap, and scrub for 20 seconds. Then rinse your hands and dry them thoroughly."
        },
        {
          "headline":"Wash your knife after every use with hot water and dish soap.",
          "description":"Bacteria from other food that you’ve cut can transfer from your knife to the avocados. After you are done using a knife, run it under hot water and wash it with dish soap. Then rinse it until all the soap is gone and dry it completely with a clean dish rag."
        },
        {
          "headline":"Wash your cutting board after every use and sanitize it regularly.",
          "description":"Cutting boards contain bacteria from the food placed on them. After using a cutting board, place it under running water and wash it with dish soap. Then rinse the cutting board and dry it completely on both sides with a paper towel or dish rag, or set it on its side to air dry. Plastic cutting boards accumulate knife grooves over time, and these grooves can trap bacteria. It is impossible to clean this bacteria out by hand, so use the dishwasher to clean plastic cutting boards after every use. Wooden cutting boards cannot be put in the dishwasher, but they are more sanitary because bacteria is absorbed into the wood and eventually dies. In addition to washing with soap and water after every use, sanitize your cutting board at least once a month."
        },
        {
          "headline":"Use separate cutting boards for raw meat, raw poultry, and vegetables.",
          "description":"Even if you wash your cutting boards after every use, the bacteria from raw meat, poultry, and seafood may still spread to other food that you place on the cutting board. Keep a separate cutting board that you only use for your avocados and other fruit."
        }
      ]
    }
  ],
  "text":" Cleaning the Avocado Skins Place the avocados under cool or lukewarm running water. Do not fill the sink with water and leave the avocados in it, as this does not effectively remove dirt. Simply turn on the water and hold the avocados under it. Make sure that your water is potable, or suitable for drinking or washing food. If possible, use distilled water or bottled water, which has been filtered to get rid of contaminants. Clean dirt and other residues off the avocado skins with a vegetable brush. As you hold the avocado under running water, take a clean vegetable brush and scrub the surface of the avocado gently. Do this until there is no longer any dirt or other visible residues on the skin. Do not use soap, bleach, or specialty fruit washes. They are not more effective than running water. If you do not have a vegetable brush, use a new toothbrush. Do not use your hands. Avocado skins are grooved and may be covered with artificial wax that can trap pathogens. It is impossible to get all the trapped bacteria out with only your hands. Dry the avocados thoroughly. Moisture is one of the conditions that bacteria need in order to grow. After you have removed all the dirt and residue, pat your avocados completely dry with a paper towel and set them on the cutting board to slice. Maintaining a Clean Working Surface Select avocados without brown spots or bruises. Decide what type of avocados you need and how ripe you want them to be, then check each fruit for brown spots or bruises. Brown spots and bruises are conducive to bacterial growth, so picking avocados with unblemished skins will help you avoid overly contaminated fruits. Make sure to avoid bruising your avocados after you buy them so that you are not introducing bacteria into the fruit. Do not place heavy objects on or around avocados in the shopping bag, and store them somewhere where they will not be crushed. Wash your hands with water and hand soap. This will help prevent bacteria on your hands from transferring to the fruit. Turn on running water, lather your hands with soap, and scrub for 20 seconds. Then rinse your hands and dry them thoroughly. Wash your knife after every use with hot water and dish soap. Bacteria from other food that you’ve cut can transfer from your knife to the avocados. After you are done using a knife, run it under hot water and wash it with dish soap. Then rinse it until all the soap is gone and dry it completely with a clean dish rag. Wash your cutting board after every use and sanitize it regularly. Cutting boards contain bacteria from the food placed on them. After using a cutting board, place it under running water and wash it with dish soap. Then rinse the cutting board and dry it completely on both sides with a paper towel or dish rag, or set it on its side to air dry. Plastic cutting boards accumulate knife grooves over time, and these grooves can trap bacteria. It is impossible to clean this bacteria out by hand, so use the dishwasher to clean plastic cutting boards after every use. Wooden cutting boards cannot be put in the dishwasher, but they are more sanitary because bacteria is absorbed into the wood and eventually dies. In addition to washing with soap and water after every use, sanitize your cutting board at least once a month. Use separate cutting boards for raw meat, raw poultry, and vegetables. Even if you wash your cutting boards after every use, the bacteria from raw meat, poultry, and seafood may still spread to other food that you place on the cutting board. Keep a separate cutting board that you only use for your avocados and other fruit.",
  "tyn_model":[
    "water",
    "avocados",
    "vegetable brush",
    "dish soap",
    "avocado",
    "paper towel",
    "cutting board",
    "soap",
    "dish rag",
    "cutting boards",
    "poultry",
    "distilled water",
    "bottled water",
    "running water",
    "hand soap",
    "hot water",
    "knife",
    "vegetables",
    "seafood"
  ],
  "tyn_section":[

  ]
}