{
  "title":"How to Play Long Shot",
  "url":"https://www.wikihow.com/Play-Long-Shot",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "parts":[
    {
      "name":"Setting Up the Game",
      "steps":[
        {
          "headline":"Unfold the board and place it in the centre of your game playing space.",
          "description":"Take out the horse dice, number dice, and horses. Set the horses up at the starting line."
        },
        {
          "headline":"Take out the playing cards and shuffle them.",
          "description":"Deal three cards to each player. Place the cards in the card slot on the board."
        },
        {
          "headline":"Give each player $25 dollars to start the game with.",
          "description":""
        },
        {
          "headline":"Determine the play order.",
          "description":"Next, let each player roll the dice. The player with the highest roll starts the game."
        }
      ]
    },
    {
      "name":"Taking Your Turn",
      "steps":[
        {
          "headline":"Roll both the horse and number dice.",
          "description":"Whichever horse you roll, you will move that horse the number you rolled on the number dice. For example, if you roll \"10\" on the horse die and \"1\" on the number die, then the ten horse moves up 1 space. If you roll a zero, then you do not move the horse. Instead, you steal a card from the horse's owner. You can also move a horse by playing a card."
        },
        {
          "headline":"Decide on one action for your turn.",
          "description":"On your turn, you can do one of the following actions:\nBuy a horse. Play a card. Bet on a horse. Discard 2 cards for $5. Do nothing."
        },
        {
          "headline":"Consider buying a horse.",
          "description":"To do this, look at their price tag on the side, and pay the bank that amount. Take the horse and place it in front of you. You now own this horse. This purchase counts as your one action for your turn."
        },
        {
          "headline":"Play a card if desired.",
          "description":"You can only do one action per turn, so if you choose to play a card that will count as your one action. You can play any card you want on your turn. You can play a moving horse card or a money card. If you play a money card, you get the amount of money that the card says. If you play a moving horse card, you move the horse as described on the card."
        },
        {
          "headline":"Make a bet if you want to.",
          "description":"To place a $5 bet, take a betting chip, and place it on top of the five dollars. This shows you have bet five dollars. When you bet in the game, if the horse you've bet on wins or places, you get extra money! For example, if the horse you've bet on is worth '9' and you've bet $10, you now own an extra $90! If you've bet $10 on horse number 7, who is worth 8 when he wins, you have now made $80. Making a bet counts as your one action for your turn."
        },
        {
          "headline":"Complete your turn.",
          "description":"After doing one of the aforementioned actions, you pick up a card from the bank and pass the die to the next player. This is the end of your turn."
        }
      ]
    },
    {
      "name":"Winning the Game",
      "steps":[
        {
          "headline":"Aim to get the most money you can.",
          "description":"You can get money in four ways:\nPlacing a bet on a winning horse. Getting money off of cards. Having your horse win a placing. Discarding two cards for $5."
        },
        {
          "headline":"End the game once three horses have crossed the line.",
          "description":"Whoever has the most money now wins the game. If any players have bet on horses that have not won the game, all the money they bet on those horses is lost."
        }
      ]
    }
  ],
  "text":" Setting Up the Game Unfold the board and place it in the centre of your game playing space. Take out the horse dice, number dice, and horses. Set the horses up at the starting line. Take out the playing cards and shuffle them. Deal three cards to each player. Place the cards in the card slot on the board. Give each player $25 dollars to start the game with.  Determine the play order. Next, let each player roll the dice. The player with the highest roll starts the game. Taking Your Turn Roll both the horse and number dice. Whichever horse you roll, you will move that horse the number you rolled on the number dice. For example, if you roll \"10\" on the horse die and \"1\" on the number die, then the ten horse moves up 1 space. If you roll a zero, then you do not move the horse. Instead, you steal a card from the horse's owner. You can also move a horse by playing a card. Decide on one action for your turn. On your turn, you can do one of the following actions:\nBuy a horse. Play a card. Bet on a horse. Discard 2 cards for $5. Do nothing. Consider buying a horse. To do this, look at their price tag on the side, and pay the bank that amount. Take the horse and place it in front of you. You now own this horse. This purchase counts as your one action for your turn. Play a card if desired. You can only do one action per turn, so if you choose to play a card that will count as your one action. You can play any card you want on your turn. You can play a moving horse card or a money card. If you play a money card, you get the amount of money that the card says. If you play a moving horse card, you move the horse as described on the card. Make a bet if you want to. To place a $5 bet, take a betting chip, and place it on top of the five dollars. This shows you have bet five dollars. When you bet in the game, if the horse you've bet on wins or places, you get extra money! For example, if the horse you've bet on is worth '9' and you've bet $10, you now own an extra $90! If you've bet $10 on horse number 7, who is worth 8 when he wins, you have now made $80. Making a bet counts as your one action for your turn. Complete your turn. After doing one of the aforementioned actions, you pick up a card from the bank and pass the die to the next player. This is the end of your turn. Winning the Game Aim to get the most money you can. You can get money in four ways:\nPlacing a bet on a winning horse. Getting money off of cards. Having your horse win a placing. Discarding two cards for $5. End the game once three horses have crossed the line. Whoever has the most money now wins the game. If any players have bet on horses that have not won the game, all the money they bet on those horses is lost.",
  "tyn_model":[
    "cards",
    "card",
    "horse",
    "board",
    "horses",
    "playing cards",
    "dice"
  ],
  "tyn_section":[

  ]
}