{
  "title":"How to Arrange a Kid's Craft Party",
  "url":"https://www.wikihow.com/Arrange-a-Kid%27s-Craft-Party",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Parties for Children"
  ],
  "methods":[
    {
      "name":"Choosing Crafts",
      "steps":[
        {
          "headline":"Choose age-appropriate crafts.",
          "description":"Before you decide on what crafts to make at the party, you will need to think about how old the guests will be. You will also need to consider their skill level. This will help guide your craft choices. Consider multiple crafts for groups of mixed-age children. Avoid crafts that require sharp tools if your crafters are under the age of five."
        },
        {
          "headline":"Pick crafts the children can do independently.",
          "description":"You will want the kids to be able to complete the crafts on their own, with only a little bit of help from the adults. For example, if you are hosting a group of five-year-olds, try making DIY bunny ears or small sheep made of cotton balls."
        },
        {
          "headline":"Choose crafts that the guest of honor will like.",
          "description":"If you are hosting a craft party for your child, or if you will be making crafts as part of a child’s birthday party, think about what your child enjoys the most. If they like fabric arts, consider a tie-dye craft party. If they love sending mail, try making themed greeting cards with the children."
        },
        {
          "headline":"Consider the location of the party.",
          "description":"When deciding where you will host a kids’ craft party, think about the crafts you will be making and the space needed for supplies, guests, and crafting. For example, if you are inviting a total of four children to the party, your kitchen table might be the perfect place for crafting. If you are hosting ten children, however, you might need to rent a larger space."
        }
      ]
    },
    {
      "name":"Setting up for the Party",
      "steps":[
        {
          "headline":"Send out invitations.",
          "description":"Once you decide on the date and location of your kids’ craft party, you will want to send out invitations. You can send traditional paper invitations in the mail. You can also invite guests via social media, email, or telephone. Make sure you ask guests to RSVP by a certain date so that you will know how many crafters to plan on. Send out the invitations 2-4 weeks before the party."
        },
        {
          "headline":"Gather your supplies.",
          "description":"Make a list of all the tools and supplies you will need for the craft party. Buy what you need, but also plan on purchasing extra. Having extra supplies and tools on hand can be helpful if you end up with unexpected guests or accidents that ruin supplies."
        },
        {
          "headline":"Create the craft on your own before the party.",
          "description":"A children’s craft party will go more smoothly if you test the crafts ahead of time. Before the party, make each craft and resolve any issues before the guests arrive. For example, if the paint takes too long to dry between steps of the craft, children might not be able to take their completed craft home with them at the end of the party."
        },
        {
          "headline":"Set up craft stations the day of the party.",
          "description":"Before your guests arrive, set up individual craft stations for each of the children. The stations should each have their own set of supplies and the tools necessary for completing the crafts. For example, you can set up individual stations along your dining room table."
        },
        {
          "headline":"Prepare snacks for the party.",
          "description":"Most crafters will be hard at work on their creations, so an elaborate meal is probably not the best choice. Instead, stick to finger foods and easy-to-eat snacks. For example, try a fruit and veggie tray, cookies, or crackers and cheese. Keep it simple so your guests can focus on the crafts."
        }
      ]
    },
    {
      "name":"Hosting the Party",
      "steps":[
        {
          "headline":"Supervise the kids.",
          "description":"As the kids are making their crafts, walk around the room and ask everyone how they are doing. This will let the kids know you are there to help them if necessary. You can also let the kids know you are ready to refill supplies if they run out."
        },
        {
          "headline":"Ask other adults to help.",
          "description":"If your guests’ parents are staying for the craft party, ask them to help out. You can assign them different roles, like refilling supply stations or checking in with individual kids to make sure their crafting is going smoothly."
        },
        {
          "headline":"Incorporate some games.",
          "description":"You can have even more fun at a kids’ craft party by playing games. This is a great way to spend time in between craft steps, like while the kids are waiting for the glue to dry. Try a game like musical chairs or duck, duck, goose. For older kids, try a game like pin the tail on the donkey."
        },
        {
          "headline":"Set a time limit for the party.",
          "description":"You don’t want the party to go on too long, so it’s important that there is an end time. For example, if you are hosting a group of 3-year-olds, an hour will generally be long enough for the craft party. A group of 4-6-year-olds, on the other hand, can enjoy a party that lasts a couple of hours."
        }
      ]
    }
  ],
  "text":" Choosing Crafts Choose age-appropriate crafts. Before you decide on what crafts to make at the party, you will need to think about how old the guests will be. You will also need to consider their skill level. This will help guide your craft choices. Consider multiple crafts for groups of mixed-age children. Avoid crafts that require sharp tools if your crafters are under the age of five. Pick crafts the children can do independently. You will want the kids to be able to complete the crafts on their own, with only a little bit of help from the adults. For example, if you are hosting a group of five-year-olds, try making DIY bunny ears or small sheep made of cotton balls. Choose crafts that the guest of honor will like. If you are hosting a craft party for your child, or if you will be making crafts as part of a child’s birthday party, think about what your child enjoys the most. If they like fabric arts, consider a tie-dye craft party. If they love sending mail, try making themed greeting cards with the children. Consider the location of the party. When deciding where you will host a kids’ craft party, think about the crafts you will be making and the space needed for supplies, guests, and crafting. For example, if you are inviting a total of four children to the party, your kitchen table might be the perfect place for crafting. If you are hosting ten children, however, you might need to rent a larger space. Setting up for the Party Send out invitations. Once you decide on the date and location of your kids’ craft party, you will want to send out invitations. You can send traditional paper invitations in the mail. You can also invite guests via social media, email, or telephone. Make sure you ask guests to RSVP by a certain date so that you will know how many crafters to plan on. Send out the invitations 2-4 weeks before the party. Gather your supplies. Make a list of all the tools and supplies you will need for the craft party. Buy what you need, but also plan on purchasing extra. Having extra supplies and tools on hand can be helpful if you end up with unexpected guests or accidents that ruin supplies. Create the craft on your own before the party. A children’s craft party will go more smoothly if you test the crafts ahead of time. Before the party, make each craft and resolve any issues before the guests arrive. For example, if the paint takes too long to dry between steps of the craft, children might not be able to take their completed craft home with them at the end of the party. Set up craft stations the day of the party. Before your guests arrive, set up individual craft stations for each of the children. The stations should each have their own set of supplies and the tools necessary for completing the crafts. For example, you can set up individual stations along your dining room table. Prepare snacks for the party. Most crafters will be hard at work on their creations, so an elaborate meal is probably not the best choice. Instead, stick to finger foods and easy-to-eat snacks. For example, try a fruit and veggie tray, cookies, or crackers and cheese. Keep it simple so your guests can focus on the crafts. Hosting the Party Supervise the kids. As the kids are making their crafts, walk around the room and ask everyone how they are doing. This will let the kids know you are there to help them if necessary. You can also let the kids know you are ready to refill supplies if they run out. Ask other adults to help. If your guests’ parents are staying for the craft party, ask them to help out. You can assign them different roles, like refilling supply stations or checking in with individual kids to make sure their crafting is going smoothly. Incorporate some games. You can have even more fun at a kids’ craft party by playing games. This is a great way to spend time in between craft steps, like while the kids are waiting for the glue to dry. Try a game like musical chairs or duck, duck, goose. For older kids, try a game like pin the tail on the donkey. Set a time limit for the party. You don’t want the party to go on too long, so it’s important that there is an end time. For example, if you are hosting a group of 3-year-olds, an hour will generally be long enough for the craft party. A group of 4-6-year-olds, on the other hand, can enjoy a party that lasts a couple of hours.",
  "tyn_model":[
    "crafts",
    "’ craft",
    "games",
    "tie-dye craft party",
    "tools",
    "paint",
    "cookies",
    "crackers",
    "cheese",
    "’ parents",
    "glue",
    "musical chairs",
    "donkey"
  ],
  "tyn_section":[

  ]
}