{
  "title":"How to Eat Korean BBQ",
  "url":"https://www.wikihow.com/Eat-Korean-BBQ",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Korean Dishes"
  ],
  "methods":[
    {
      "name":"Ordering and Following Etiquette",
      "steps":[
        {
          "headline":"Order food from your server, and ask lots of questions.",
          "description":"Korean BBQ is an all-you-can-eat style, but it is not a buffet, meaning that you will order food from a server who brings it to your table. Different restaurants have different payment methods, so check ahead of time to see if you will be expected to pay a flat rate per person or pay for each course. Your server will have great advice for people new to Korean BBQ, so don't be afraid to ask them any questions you have about the cuisine. You can expect to spend up to 2 hours at a Korean BBQ restaurant if you want to get the full experience, try every meat, and drink to your heart's content. Some Korean BBQ experts suggest bringing cash rather than using your card, as it can be difficult for your server to split a bill between multiple guests on cards."
        },
        {
          "headline":"Use the grill at your table for meats and veggies.",
          "description":"The grill is typically circular, and often has special areas for heating up sides and cooking small items around the rim. The center of the grill is hottest and is where you cook meats, while the edges of the center are used to keep food warm before eating. Your server will bring you your food unheated and you will use the grill in the middle of your table to prepare everything. Korean BBQ is an all-you-can-eat style cuisine, but it is not the same as a buffet. It is not disrespectful at all to request a cleaner grill if yours becomes grimy and charred — the restaurant wants you to have the most authentic and delicious experience possible."
        },
        {
          "headline":"Let your server flip your food for you if you are new to the cuisine.",
          "description":"It is traditional for guests to flip and grill their meats and veggies at the table, but if you are new to Korean BBQ, it is normal to ask your server to guide you and cook for you. Most upscale Korean BBQ places will do this without asking you first, to ensure you get the best quality meat possible. If they insist, be their guest."
        },
        {
          "headline":"Ensure your guests' drinks are filled before yours, but don't pour your own.",
          "description":"There are not many rules of conduct when it comes to Korean BBQ, but if there is one rule you should try to follow, it is this. If you want to pour your own drink, nobody will call you out for it, but an authentic Korean BBQ experience is one based on sharing with others. Wait for your friends to fill your drink, or if you are impatient, top everyone else's glass off to send the hint that you would like yours filled too. If you are with people who are also new to the cuisine, consider letting everybody know of this one rule for Korean BBQ — you will find that sharing drinks and taking care of each other's is a fun bonding experience!"
        }
      ]
    },
    {
      "name":"Grilling Meats and Veggies",
      "steps":[
        {
          "headline":"Lay the meats you want to try first flat on the grill.",
          "description":"The grill is usually at a set temperature, but your server can change the heat if so desired. Laying your meats on the grill before veggies ensures that everything will finish cooking at about the same time."
        },
        {
          "headline":"Know when to flip your meats, if your server doesn't do it for you.",
          "description":"Look for \"sweating\" on the top of thicker meats such as Kalbi or Samgyupsal, and regularly check the underside of lighter cuts such as spicy pork or bulgogi for a slight char before flipping. Your server will offer to grill your meats for you, but if you prefer to do it yourself, your server will not be offended. If you are new to Korean BBQ, it is best to let your server operate the grill so you can learn the correct procedures for yourself."
        },
        {
          "headline":"Add veggies after you have flipped the meats, watching for charring.",
          "description":"Veggies char easier than meats on the grill, and will cook faster than meat too. Keep your veggies and meats separated as best as you can to ensure the marinades and flavors don't mix. Bell peppers, mushrooms, carrots, zucchinis, cucumbers, potatoes and onions are used in Korean cooking and are usually available for grilling."
        },
        {
          "headline":"Remove your meats and veggies from the grill once they have cooked.",
          "description":"Place them on separate plates, so you and your group can pick and choose foods to mix together according to your own tastes. Some grills will have special containers on the side meant for keeping meats and veggies warm while you prepare more food on the grill. If you won't be eating your food as soon as it is ready, it's recommended to keep it in these side containers so it stays hot and fresh."
        }
      ]
    },
    {
      "name":"Trying Traditional Korean Foods and Sides",
      "steps":[
        {
          "headline":"Check out the restaurant's traditional Korean meat options.",
          "description":"Beef brisket, grilled chicken, and spicy pork are common in Asian cuisine, but Korean BBQ restaurants will always have a variety of traditional Korean meats as well. Samgyupsal, Kalbi, and Bulgogi are some of the most common meats available. Sample some plain or flavored Samgyupsal, a Korean pork belly. This can be eaten plain or marinated in garlic, miso, wine, and red pepper. Try Kalbi, a Korean marinated beef short rib. Kalbi is different from European short ribs as it is cut with the bone on the outside, rather than through the middle. Cut the Kalbi into thin strips to speed up the grilling process. Try some Bulgogi, a thinly sliced beef with a soy marinade. Often used in stir-fry, Bulgogi is a savory and relatively light meat, a good choice to start your feast with."
        },
        {
          "headline":"Pair traditional Korean soups alongside your meats.",
          "description":"Korean chefs are famous for their huge variety of delicious soups, so be sure to try some alongside your meats and other sides. Some common soups you can ask for include the following. Dwenjang Jjigae: Made with zucchini, onion, and tofu, this soup is hot, bubbly, and complex. Soondubu Jjigae: Made with an assortment of veggies and tofu, the ingredients of this spicy soup melt in your mouth. Cold Beef Broth Noodles: Order this after you have finished your feast, so you can mix in any leftovers you have. Kalbi is particularly delicious with the cold noodles, as the heat of the meat and the cold noodles play off of each other in unexpected ways."
        },
        {
          "headline":"Ask about banchan, side dishes that come with your order.",
          "description":"Served on small plates, banchan are free side dishes that are meant to be shared. The type and number of banchan will vary from restaurant to restaurant, but don't hesitate to ask for more — refills are free too. Some common side dishes include the following. Kimchi: One of the more well-known Korean foods, kimchi is made with fermented cabbage as well as an assortment of veggies. It has been compared to sauerkraut and pickles. Bean sprouts: Usually dressed in a savory sauce, such as sesame oil, bean sprouts are great for a refreshing bite between meats. Seaweed salad: Seaweed is a traditional ingredient in many coastal countries, and a seaweed salad will help to offset all the meat you've eaten. Daikon radish: Sometimes called oriental radish, this mild winter radish tastes sweet and crisp."
        },
        {
          "headline":"Look for Korean condiments and seasonings made in-house.",
          "description":"A Korean BBQ is enhanced by condiments and seasonings from the region. Look for ssamjang, a bright soybean paste used on meats, sesame oil for veggies, and red pepper paste for both meats and veggies."
        },
        {
          "headline":"Try Korean imported beer, soju, or makgeolli alongside your meal.",
          "description":"While it is perfectly acceptable to not drink alcohol with your Korean BBQ, Korean cuisine is often made to be eaten with beer or rice wine. Don't worry about drinking too much, as Soju and Makgeolli have a relatively low alcohol content, while Korean beer is light like Coors or Budweiser in the U.S.\nTwo great beer brands often available at Korean BBQ restaurants are Hite and OB. These are considered to be the \"working man's beer\" of Korea. Soju is a Korean liquor that tastes sweeter than European clear liquors, but is also milder. Because of its relatively low alcohol content, it is easy and encouraged to do soju shots throughout your dining experience. Flavored soju, such as mango, peach, kiwi, and others, are often available for a little variety. Makgeolli, sometimes called Makkoli, is a slightly sparkling rice wine that is is light in alcohol but robust in flavor. A tasty choice to sip over the course of your first course."
        }
      ]
    }
  ],
  "text":" Ordering and Following Etiquette Order food from your server, and ask lots of questions. Korean BBQ is an all-you-can-eat style, but it is not a buffet, meaning that you will order food from a server who brings it to your table. Different restaurants have different payment methods, so check ahead of time to see if you will be expected to pay a flat rate per person or pay for each course. Your server will have great advice for people new to Korean BBQ, so don't be afraid to ask them any questions you have about the cuisine. You can expect to spend up to 2 hours at a Korean BBQ restaurant if you want to get the full experience, try every meat, and drink to your heart's content. Some Korean BBQ experts suggest bringing cash rather than using your card, as it can be difficult for your server to split a bill between multiple guests on cards. Use the grill at your table for meats and veggies. The grill is typically circular, and often has special areas for heating up sides and cooking small items around the rim. The center of the grill is hottest and is where you cook meats, while the edges of the center are used to keep food warm before eating. Your server will bring you your food unheated and you will use the grill in the middle of your table to prepare everything. Korean BBQ is an all-you-can-eat style cuisine, but it is not the same as a buffet. It is not disrespectful at all to request a cleaner grill if yours becomes grimy and charred — the restaurant wants you to have the most authentic and delicious experience possible. Let your server flip your food for you if you are new to the cuisine. It is traditional for guests to flip and grill their meats and veggies at the table, but if you are new to Korean BBQ, it is normal to ask your server to guide you and cook for you. Most upscale Korean BBQ places will do this without asking you first, to ensure you get the best quality meat possible. If they insist, be their guest. Ensure your guests' drinks are filled before yours, but don't pour your own. There are not many rules of conduct when it comes to Korean BBQ, but if there is one rule you should try to follow, it is this. If you want to pour your own drink, nobody will call you out for it, but an authentic Korean BBQ experience is one based on sharing with others. Wait for your friends to fill your drink, or if you are impatient, top everyone else's glass off to send the hint that you would like yours filled too. If you are with people who are also new to the cuisine, consider letting everybody know of this one rule for Korean BBQ — you will find that sharing drinks and taking care of each other's is a fun bonding experience! Grilling Meats and Veggies Lay the meats you want to try first flat on the grill. The grill is usually at a set temperature, but your server can change the heat if so desired. Laying your meats on the grill before veggies ensures that everything will finish cooking at about the same time. Know when to flip your meats, if your server doesn't do it for you. Look for \"sweating\" on the top of thicker meats such as Kalbi or Samgyupsal, and regularly check the underside of lighter cuts such as spicy pork or bulgogi for a slight char before flipping. Your server will offer to grill your meats for you, but if you prefer to do it yourself, your server will not be offended. If you are new to Korean BBQ, it is best to let your server operate the grill so you can learn the correct procedures for yourself. Add veggies after you have flipped the meats, watching for charring. Veggies char easier than meats on the grill, and will cook faster than meat too. Keep your veggies and meats separated as best as you can to ensure the marinades and flavors don't mix. Bell peppers, mushrooms, carrots, zucchinis, cucumbers, potatoes and onions are used in Korean cooking and are usually available for grilling. Remove your meats and veggies from the grill once they have cooked. Place them on separate plates, so you and your group can pick and choose foods to mix together according to your own tastes. Some grills will have special containers on the side meant for keeping meats and veggies warm while you prepare more food on the grill. If you won't be eating your food as soon as it is ready, it's recommended to keep it in these side containers so it stays hot and fresh. Trying Traditional Korean Foods and Sides Check out the restaurant's traditional Korean meat options. Beef brisket, grilled chicken, and spicy pork are common in Asian cuisine, but Korean BBQ restaurants will always have a variety of traditional Korean meats as well. Samgyupsal, Kalbi, and Bulgogi are some of the most common meats available. Sample some plain or flavored Samgyupsal, a Korean pork belly. This can be eaten plain or marinated in garlic, miso, wine, and red pepper. Try Kalbi, a Korean marinated beef short rib. Kalbi is different from European short ribs as it is cut with the bone on the outside, rather than through the middle. Cut the Kalbi into thin strips to speed up the grilling process. Try some Bulgogi, a thinly sliced beef with a soy marinade. Often used in stir-fry, Bulgogi is a savory and relatively light meat, a good choice to start your feast with. Pair traditional Korean soups alongside your meats. Korean chefs are famous for their huge variety of delicious soups, so be sure to try some alongside your meats and other sides. Some common soups you can ask for include the following. Dwenjang Jjigae: Made with zucchini, onion, and tofu, this soup is hot, bubbly, and complex. Soondubu Jjigae: Made with an assortment of veggies and tofu, the ingredients of this spicy soup melt in your mouth. Cold Beef Broth Noodles: Order this after you have finished your feast, so you can mix in any leftovers you have. Kalbi is particularly delicious with the cold noodles, as the heat of the meat and the cold noodles play off of each other in unexpected ways. Ask about banchan, side dishes that come with your order. Served on small plates, banchan are free side dishes that are meant to be shared. The type and number of banchan will vary from restaurant to restaurant, but don't hesitate to ask for more — refills are free too. Some common side dishes include the following. Kimchi: One of the more well-known Korean foods, kimchi is made with fermented cabbage as well as an assortment of veggies. It has been compared to sauerkraut and pickles. Bean sprouts: Usually dressed in a savory sauce, such as sesame oil, bean sprouts are great for a refreshing bite between meats. Seaweed salad: Seaweed is a traditional ingredient in many coastal countries, and a seaweed salad will help to offset all the meat you've eaten. Daikon radish: Sometimes called oriental radish, this mild winter radish tastes sweet and crisp. Look for Korean condiments and seasonings made in-house. A Korean BBQ is enhanced by condiments and seasonings from the region. Look for ssamjang, a bright soybean paste used on meats, sesame oil for veggies, and red pepper paste for both meats and veggies. Try Korean imported beer, soju, or makgeolli alongside your meal. While it is perfectly acceptable to not drink alcohol with your Korean BBQ, Korean cuisine is often made to be eaten with beer or rice wine. Don't worry about drinking too much, as Soju and Makgeolli have a relatively low alcohol content, while Korean beer is light like Coors or Budweiser in the U.S.\nTwo great beer brands often available at Korean BBQ restaurants are Hite and OB. These are considered to be the \"working man's beer\" of Korea. Soju is a Korean liquor that tastes sweeter than European clear liquors, but is also milder. Because of its relatively low alcohol content, it is easy and encouraged to do soju shots throughout your dining experience. Flavored soju, such as mango, peach, kiwi, and others, are often available for a little variety. Makgeolli, sometimes called Makkoli, is a slightly sparkling rice wine that is is light in alcohol but robust in flavor. A tasty choice to sip over the course of your first course.",
  "tyn_model":[
    "grill",
    "soju",
    "bbq",
    "veggies",
    "bulgogi",
    "pork",
    "red pepper",
    "kalbi",
    "tofu",
    "noodles",
    "kimchi",
    "bean sprouts",
    "seaweed salad",
    "seasonings",
    "beer",
    "— the",
    "drinks",
    "glass",
    "— you",
    "meats",
    "bell peppers",
    "mushrooms",
    "carrots",
    "zucchinis",
    "cucumbers",
    "potatoes",
    "onions",
    "plates",
    "grills",
    "beef brisket",
    "grilled chicken",
    "garlic",
    "zucchini",
    "onion",
    "beef broth noodles",
    "banchan",
    "— refills",
    "sauerkraut",
    "pickles",
    "sesame oil",
    "seaweed"
  ],
  "tyn_section":[

  ]
}