{
  "title":"How to Decorate Your Home Without Spending Money",
  "url":"https://www.wikihow.com/Decorate-Your-Home-Without-Spending-Money",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping"
  ],
  "methods":[
    {
      "name":"Reorganizing Your Space",
      "steps":[
        {
          "headline":"Pile throw pillows onto your couch to make the room more inviting.",
          "description":"Find a room with a couch as the main focus, such as the living room or guest room. Gather enough pillows to cover the entire horizontal length of the couch and arrange them on the sofa to provide comfort. Choose pillows with varying patterns to create a mismatched look. Select complementary colors for a more cohesive look."
        },
        {
          "headline":"Lay mirrors against your walls if you can't put holes in them.",
          "description":"For homes with brick walls or people that don't want to use a hammer and nails, lay large mirrors against the walls. Angle them a bit to create the visual illusion that the ceiling line is higher than it actually is. Mirrors also brighten rooms by reflecting light and create the illusion of an additional window. Use mirrors in living rooms or spaces that need additional light."
        },
        {
          "headline":"Move cluttered furniture away from the wall to make the room seem larger.",
          "description":"If all your wall space is taken up by furniture, move some of the furniture 2 to 4 feet (0.61 to 1.22 m) from the wall to make the room seem larger. Group them together to create focal points that encourage different activities. Try and ensure that there are at least a few open spaces on the wall without furniture. Group chairs near the coffee table to encourage conversation. For couches, pull them a bit forward. This makes it easier to move around them and encourages people to take a quick seat and leave as they please."
        },
        {
          "headline":"Select a color scheme for the items on your mantle to create a room theme.",
          "description":"Choosing a common color for items on your mantle is a great way to unify unrelated objects with a theme. Select a color that stands out among the furniture in the room and begin searching your home for items in this color family. Books, plates, pottery, and pitchers are all great choices. Consider the other colors in the room. For example, if your home has a black and white theme, select these colors for items like plates, picture frames, vases, and small bowls."
        },
        {
          "headline":"Organize your plants creatively to make them stand out.",
          "description":"Find smaller plants that you can grow and nurture and cluster them together to give the illusion of space. Display and hang them at different heights. When they start getting bigger, transfer them into larger pots. Cheap indoor plants include pothos, aloe, spider plants, jade plants, and rubber trees. Ask friends with succulents if you can use their cuttings to propagate new ones and save some money."
        },
        {
          "headline":"Group your displays in odd numbers to liven them up.",
          "description":"Odd numbers are more visually appealing than even because they force your eyes to explore the grouping. Place any objects or frames you have on display in odd-numbered groups like threes or fives. For example, if you have 4 picture frames above your fireplace, remove one! You can also apply this rule to your furniture groupings, objects on countertops, and the number of patterns in each room."
        },
        {
          "headline":"Install a curtain rod above your window frame if you have a low ceiling.",
          "description":"This is a great way to make the room seem taller. Select rods that extend 2 to 3 inches (5.1 to 7.6 cm) beyond the sides of the window frame for a traditional look. To make the window look wider, extend the rod 10 to 15 inches (25 to 38 cm) beyond the edges. Use 95 in (240 cm) curtains so that they are long enough to touch the floor and place the rod brackets about 8 inches (20 cm) above the window frame. Measure window width horizontally at 3 points and take note of the longest measurement. Sketch it prior to purchasing your curtains for reference. Install wall anchors if the bracket installation locations don’t line up with wall studs."
        }
      ]
    },
    {
      "name":"Getting Creative with Household Items",
      "steps":[
        {
          "headline":"Create artwork using old picture frames for aesthetic appeal.",
          "description":"Gather your old picture frames and select the ones that match the theme of your home or room. Print out a picture or saying from the internet that you like and display it in your living room. You can also draw a picture or find an artistic picture in a magazine to display. If you have picture wires, tie them across your old frames and hang some jewelry from them. Add additional wires to create more levels for the jewelry. For longer earrings, place the wires to the higher end of the frames."
        },
        {
          "headline":"Add a makeshift table runner to update a small, plain table.",
          "description":"Table runners are long, narrow cloths typically laid on top of a bare table or tablecloth. Find an old window treatment panel, a scrap piece of patterned fabric, or an oversized scarf. Lay it down horizontally across the width of the table to act as a makeshift table runner. Place candles, flowers, and mason jars with candy and snacks onto the table runner."
        },
        {
          "headline":"Stack up hardcover books to create a cheap side table.",
          "description":"If you have enough hardcover books on the larger side, stack them up to create a unique side table. Try using books that are all the same size for more stability. Position them between chairs in the living area and top them off with a vase of flowers. This is especially useful if you have too many books to fit in your bookshelves. Select books with similar color schemes to create a nice theme. Avoid using paperback books since they are more prone to fall over."
        },
        {
          "headline":"Tie back your curtains with old belts or scarves for an elegant look.",
          "description":"Curtain tiebacks are a great way to add some elegance and style to a window dressing. Search your closet for some old scarves and belts with similar shades or colors as your curtains. Install two ⁄4 inch (1.9 cm) cup hooks on each side of your curtains to hold your tiebacks in place. You can purchase them from hardware stores. Install your curtain tiebacks about halfway to 2/3 of the way down the curtain, and around 3 inches (7.6 cm) from the edge of the window."
        },
        {
          "headline":"Decorate your home with glass fruit jars for a natural appearance.",
          "description":"Take any whole fruits you have in your kitchen and place them in glass jars. Try using jars with a width that can fit two fruits across. Fill each jar with water and place them around your home. Place similar colors together to create nice accents. For example, place lemons in one glass jar and limes in another. Place the two next to each other for a nice contrast. Grab some branches with leaves from outside and place them into the glass jars with your fruits."
        }
      ]
    },
    {
      "name":"Finding Free Items to Decorate With",
      "steps":[
        {
          "headline":"Gather some decorations on a nature walk for earthy themes.",
          "description":"Take a walk around the local park or nature reserve and look for some nice natural items. Look for sticks, flowers, and plants that would look nice in your home. Keep an eye out for twisting branches and things with a unique shape that you wouldn't find anywhere else. White and ivory colors are great additions to natural themes. Ask officials if you are allowed to take items when visiting nature reserves and conservation areas."
        },
        {
          "headline":"Keep on the lookout for free furniture whenever possible.",
          "description":"Look for couches and furniture that people are throwing out in your neighborhood. Scour the free section of online classifieds. If you have friends looking to get rid of furniture, take them! Post on social media to let your friends and followers know you are interested in used furniture. You never know what people are prepared to throw away!"
        },
        {
          "headline":"Visit a thrift store for cheap furniture as a last resort.",
          "description":"If you're having trouble finding furniture and decorations, visit a thrift store. Look for chairs, couches, tables, plates, and anything else that you have on your mind. Keep your expectations low and remain open-minded and you'll have an easier time finding things. Keep visiting on a regular basis—you never know what will pop up!"
        }
      ]
    }
  ],
  "text":" Reorganizing Your Space Pile throw pillows onto your couch to make the room more inviting. Find a room with a couch as the main focus, such as the living room or guest room. Gather enough pillows to cover the entire horizontal length of the couch and arrange them on the sofa to provide comfort. Choose pillows with varying patterns to create a mismatched look. Select complementary colors for a more cohesive look. Lay mirrors against your walls if you can't put holes in them. For homes with brick walls or people that don't want to use a hammer and nails, lay large mirrors against the walls. Angle them a bit to create the visual illusion that the ceiling line is higher than it actually is. Mirrors also brighten rooms by reflecting light and create the illusion of an additional window. Use mirrors in living rooms or spaces that need additional light. Move cluttered furniture away from the wall to make the room seem larger. If all your wall space is taken up by furniture, move some of the furniture 2 to 4 feet (0.61 to 1.22 m) from the wall to make the room seem larger. Group them together to create focal points that encourage different activities. Try and ensure that there are at least a few open spaces on the wall without furniture. Group chairs near the coffee table to encourage conversation. For couches, pull them a bit forward. This makes it easier to move around them and encourages people to take a quick seat and leave as they please. Select a color scheme for the items on your mantle to create a room theme. Choosing a common color for items on your mantle is a great way to unify unrelated objects with a theme. Select a color that stands out among the furniture in the room and begin searching your home for items in this color family. Books, plates, pottery, and pitchers are all great choices. Consider the other colors in the room. For example, if your home has a black and white theme, select these colors for items like plates, picture frames, vases, and small bowls. Organize your plants creatively to make them stand out. Find smaller plants that you can grow and nurture and cluster them together to give the illusion of space. Display and hang them at different heights. When they start getting bigger, transfer them into larger pots. Cheap indoor plants include pothos, aloe, spider plants, jade plants, and rubber trees. Ask friends with succulents if you can use their cuttings to propagate new ones and save some money. Group your displays in odd numbers to liven them up. Odd numbers are more visually appealing than even because they force your eyes to explore the grouping. Place any objects or frames you have on display in odd-numbered groups like threes or fives. For example, if you have 4 picture frames above your fireplace, remove one! You can also apply this rule to your furniture groupings, objects on countertops, and the number of patterns in each room. Install a curtain rod above your window frame if you have a low ceiling. This is a great way to make the room seem taller. Select rods that extend 2 to 3 inches (5.1 to 7.6 cm) beyond the sides of the window frame for a traditional look. To make the window look wider, extend the rod 10 to 15 inches (25 to 38 cm) beyond the edges. Use 95 in (240 cm) curtains so that they are long enough to touch the floor and place the rod brackets about 8 inches (20 cm) above the window frame. Measure window width horizontally at 3 points and take note of the longest measurement. Sketch it prior to purchasing your curtains for reference. Install wall anchors if the bracket installation locations don’t line up with wall studs. Getting Creative with Household Items Create artwork using old picture frames for aesthetic appeal. Gather your old picture frames and select the ones that match the theme of your home or room. Print out a picture or saying from the internet that you like and display it in your living room. You can also draw a picture or find an artistic picture in a magazine to display. If you have picture wires, tie them across your old frames and hang some jewelry from them. Add additional wires to create more levels for the jewelry. For longer earrings, place the wires to the higher end of the frames. Add a makeshift table runner to update a small, plain table. Table runners are long, narrow cloths typically laid on top of a bare table or tablecloth. Find an old window treatment panel, a scrap piece of patterned fabric, or an oversized scarf. Lay it down horizontally across the width of the table to act as a makeshift table runner. Place candles, flowers, and mason jars with candy and snacks onto the table runner. Stack up hardcover books to create a cheap side table. If you have enough hardcover books on the larger side, stack them up to create a unique side table. Try using books that are all the same size for more stability. Position them between chairs in the living area and top them off with a vase of flowers. This is especially useful if you have too many books to fit in your bookshelves. Select books with similar color schemes to create a nice theme. Avoid using paperback books since they are more prone to fall over. Tie back your curtains with old belts or scarves for an elegant look. Curtain tiebacks are a great way to add some elegance and style to a window dressing. Search your closet for some old scarves and belts with similar shades or colors as your curtains. Install two ⁄4 inch (1.9 cm) cup hooks on each side of your curtains to hold your tiebacks in place. You can purchase them from hardware stores. Install your curtain tiebacks about halfway to 2/3 of the way down the curtain, and around 3 inches (7.6 cm) from the edge of the window. Decorate your home with glass fruit jars for a natural appearance. Take any whole fruits you have in your kitchen and place them in glass jars. Try using jars with a width that can fit two fruits across. Fill each jar with water and place them around your home. Place similar colors together to create nice accents. For example, place lemons in one glass jar and limes in another. Place the two next to each other for a nice contrast. Grab some branches with leaves from outside and place them into the glass jars with your fruits. Finding Free Items to Decorate With Gather some decorations on a nature walk for earthy themes. Take a walk around the local park or nature reserve and look for some nice natural items. Look for sticks, flowers, and plants that would look nice in your home. Keep an eye out for twisting branches and things with a unique shape that you wouldn't find anywhere else. White and ivory colors are great additions to natural themes. Ask officials if you are allowed to take items when visiting nature reserves and conservation areas. Keep on the lookout for free furniture whenever possible. Look for couches and furniture that people are throwing out in your neighborhood. Scour the free section of online classifieds. If you have friends looking to get rid of furniture, take them! Post on social media to let your friends and followers know you are interested in used furniture. You never know what people are prepared to throw away! Visit a thrift store for cheap furniture as a last resort. If you're having trouble finding furniture and decorations, visit a thrift store. Look for chairs, couches, tables, plates, and anything else that you have on your mind. Keep your expectations low and remain open-minded and you'll have an easier time finding things. Keep visiting on a regular basis—you never know what will pop up!",
  "tyn_model":[
    "mirrors",
    "furniture",
    "plants",
    "curtains",
    "pillows",
    "plates",
    "flowers",
    "chairs",
    "books",
    "jewelry",
    "belts",
    "glass jars",
    "decorations",
    "hammer",
    "nails",
    "couches",
    "pottery",
    "pitchers",
    "vases",
    "bowls",
    "aloe",
    "succulents",
    "curtain rod",
    "rods",
    "picture frames",
    "table runner",
    "table runners",
    "candles",
    "mason jars",
    "vase",
    "window dressing",
    "curtain tiebacks",
    "glass fruit jars",
    "jars",
    "water",
    "lemons",
    "limes",
    "branches",
    "nature reserves",
    "tables",
    "—you"
  ],
  "tyn_section":[

  ]
}