{
  "title":"How to Bend a Paper Clip to Hang Light Objects on Cubicle Walls",
  "url":"https://www.wikihow.com/Bend-a-Paper-Clip-to-Hang-Light-Objects-on-Cubicle-Walls",
  "category_hierarchy":[
    "Home and Garden",
    "Tools",
    "Fastening Tools"
  ],
  "steps":[
    {
      "headline":"Arrange a small, wire-loop paper clip as shown, so that there are two loops on top and one loop on the bottom.",
      "description":""
    },
    {
      "headline":"Twist the taller loop out to one side.",
      "description":""
    },
    {
      "headline":"Twist the shorter loop out to the other side.",
      "description":""
    },
    {
      "headline":"If you would like a hook, bend the bottom loop up.",
      "description":""
    },
    {
      "headline":"Poke the loose ends through the woven fabric on the cube wall.",
      "description":"They will sit flat against the impermeable metal below. You may have to put the taller end in first."
    },
    {
      "headline":"Hang papers, photos, and postcards without puncturing them by slipping them under the \"hook\" portion.",
      "description":"There is no need to bend up a hook if you are using this configuration."
    },
    {
      "headline":"Hang calendars and anything else equipped with a hole by placing the hole over the hook.",
      "description":""
    }
  ],
  "text":" Arrange a small, wire-loop paper clip as shown, so that there are two loops on top and one loop on the bottom.  Twist the taller loop out to one side.  Twist the shorter loop out to the other side.  If you would like a hook, bend the bottom loop up.  Poke the loose ends through the woven fabric on the cube wall. They will sit flat against the impermeable metal below. You may have to put the taller end in first. Hang papers, photos, and postcards without puncturing them by slipping them under the \"hook\" portion. There is no need to bend up a hook if you are using this configuration. Hang calendars and anything else equipped with a hole by placing the hole over the hook. ",
  "tyn_model":[
    "fabric",
    "papers",
    "postcards",
    "calendars"
  ],
  "tyn_section":[

  ]
}