{
  "title":"How to Drink Rumchata",
  "url":"https://www.wikihow.com/Drink-Rumchata",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks"
  ],
  "methods":[
    {
      "name":"Mixing RumChata with Other Alcoholic Drinks",
      "steps":[
        {
          "headline":"Combine RumChata and cinnamon-flavored liqueur for a spicy drink.",
          "description":"Take equal portions of RumChata and cinnamon-flavored liqueur and stir them together in a mixing glass with ice until a frost forms on the glass exterior. Serve in shot glasses or in a single rocks glass for yourself. For garnish, add freshly grated cinnamon or allspice to the drink. This drink is also known as a RumBall."
        },
        {
          "headline":"Use orange liqueur to make Orange Creamsicle RumChata.",
          "description":"To make this drink, fill a lowball glass with ice. Then, mix 1  fl oz (30 mL) of orange liqueur with 2  fl oz (59 mL) of RumChata. You can also make a similar drink by using orange-flavored vodka instead of orange liqueur."
        },
        {
          "headline":"Mix equal parts grenadine, tequila, and RumChata to make French Kiss Shots.",
          "description":"Pour the grenadine in the bottom of a shot glass, then carefully pour your RumChata on top of that. Finally, add your tequila to the top of the drink and enjoy! For added sweetness, you can also garnish this drink with whipped cream or sprinkles. Note that many people who drink French Kiss Shots say that they barely taste like alcohol, so make sure you drink responsibly when you have them."
        },
        {
          "headline":"Make a Cinnamon Roll Cocktail out of RumChata and coffee-flavored liqueur.",
          "description":"Fill a shaker and two small shot glasses with ice. Then, pour 3 parts RumChata to 1 part coffee-flavored liqueur in the shaker and shake them. Finally, pour your mixed drink into the shot glasses. You may also see this referred to as a “Cinnamon Bun Cocktail.”\nNote that this is NOT the same drink as a Cinnamon Toast Crunch Shot; that drink uses cinnamon-flavored liqueur instead of coffee-flavored liqueur."
        },
        {
          "headline":"Blend a fruity drink with RumChata, banana rum, ice, and cream.",
          "description":"Mix 1 banana, 2  fl oz (59 mL) of banana rum, 4  fl oz (120 mL) of RumChata, 4  fl oz (120 mL) of cream, and 1 cup (240 mL) of ice in a blender and blend them until the mixture is smooth and there are no large chunks of ice. Then, sprinkle cinnamon on top of the mixture and garnish with banana slices and cherries. If the mixture is too thick after it’s been blended, you can make it smoother by adding more cream and re-blending. This drink is often referred to as a “Banana RumChata Colada.”"
        },
        {
          "headline":"Combine apple liqueur, ice, and RumChata to make Apple RumChata.",
          "description":"Mix 1  fl oz (30 mL) of apple liqueur, 2  fl oz (59 mL) of RumChata, and ice in a cocktail shaker. Shake the ingredients together, then use a strainer to strain them into a martini glass rimmed with sea salt. You can also make a similar drink by mixing equal parts of RumChata and sour apple schnapps."
        }
      ]
    },
    {
      "name":"Making Drinks with RumChata and Non-Alcoholic Ingredients",
      "steps":[
        {
          "headline":"Spice up your cold brew coffee by adding RumChata to it.",
          "description":"Because RumChata is made with cream, it’s a ready substitute for milk or creamer in coffee. Pour 3 fluid ounces (89 mL) of RumChata over ice in a highball glass and top with your cold brew coffee. Garnish with grated cinnamon to taste. You can make this drink even stronger by adding rum, allspice dram liqueur, or Angostura bitters to it. You can also mix RumChata with hot coffee; most people, however, seem to prefer to use it in cold brew or iced coffee."
        },
        {
          "headline":"Use ice cream to make RumChata milkshakes.",
          "description":"RumChata can essentially serve as a replacement for milk in a traditional milkshake. Blend 2 fluid ounces (59 mL) of RumChata with a scoop of ice cream in a blender until smooth. Then, garnish with grated nutmeg, crushed pistachios, almonds, or crumbled cookies. Most recipes for RumChata milkshakes use vanilla ice cream, although you can use any flavor of ice cream you like for this drink. If you’re not pleased with the consistency of your milkshake, try adding crushed ice to the mix."
        },
        {
          "headline":"Pour RumChata into your eggnog for a festive holiday drink.",
          "description":"Fill a highball glass with ice and add 4  fl oz (120 mL) of eggnog. Then, pour in 2  fl oz (59 mL) of RumChata and stir with a spoon. To garnish, grate fresh nutmeg across the top of your drink."
        },
        {
          "headline":"Mix milk, RumChata, and pudding mix to make shots.",
          "description":"Stir 1  c (0.24 L) of milk, 1  c (0.24 L) of RumChata, and 1 package of instant pudding mix in a bowl together until thickened. Add 8  fl oz (240 mL) of whipped cream to the mixture, then pour into disposable shot cups and freeze for at least 3 hours. For best results, use a package of instant pudding mix that is no larger than 4 ounces (110 g). Add whipped cream to the top of the frozen shot for garnish. You may see this type of drink referred to as a RumChata Pudding Shot."
        },
        {
          "headline":"Make a delicious dessert drink out of RumChata and hot chocolate.",
          "description":"Pour 2  fl oz (59 mL) of RumChata into a coffee mug and top with hot chocolate. For a stronger drink, try using 3  fl oz (89 mL) of RumChata instead. You can garnish this drink with whipped cream and freshly shaved dark chocolate. RumChata hot chocolate is a delectable drink to have on cold nights, but can also easily complement a summer brunch."
        },
        {
          "headline":"Add blue cream soda to iced RumChata to make a creamy float.",
          "description":"Put some ice in a highball glass and pour 1.5  fl oz (44 mL) to 2  fl oz (59 mL) of RumChata into the glass. Then, slowly pour a bottle of blue cream soda into the glass until it’s filled. For an even sweeter experience, add sugar to the rim of your glass. This drink is sometimes referred to as an Abominable Snowman Cocktail."
        }
      ]
    }
  ],
  "text":" Mixing RumChata with Other Alcoholic Drinks Combine RumChata and cinnamon-flavored liqueur for a spicy drink. Take equal portions of RumChata and cinnamon-flavored liqueur and stir them together in a mixing glass with ice until a frost forms on the glass exterior. Serve in shot glasses or in a single rocks glass for yourself. For garnish, add freshly grated cinnamon or allspice to the drink. This drink is also known as a RumBall. Use orange liqueur to make Orange Creamsicle RumChata. To make this drink, fill a lowball glass with ice. Then, mix 1  fl oz (30 mL) of orange liqueur with 2  fl oz (59 mL) of RumChata. You can also make a similar drink by using orange-flavored vodka instead of orange liqueur. Mix equal parts grenadine, tequila, and RumChata to make French Kiss Shots. Pour the grenadine in the bottom of a shot glass, then carefully pour your RumChata on top of that. Finally, add your tequila to the top of the drink and enjoy! For added sweetness, you can also garnish this drink with whipped cream or sprinkles. Note that many people who drink French Kiss Shots say that they barely taste like alcohol, so make sure you drink responsibly when you have them. Make a Cinnamon Roll Cocktail out of RumChata and coffee-flavored liqueur. Fill a shaker and two small shot glasses with ice. Then, pour 3 parts RumChata to 1 part coffee-flavored liqueur in the shaker and shake them. Finally, pour your mixed drink into the shot glasses. You may also see this referred to as a “Cinnamon Bun Cocktail.”\nNote that this is NOT the same drink as a Cinnamon Toast Crunch Shot; that drink uses cinnamon-flavored liqueur instead of coffee-flavored liqueur. Blend a fruity drink with RumChata, banana rum, ice, and cream. Mix 1 banana, 2  fl oz (59 mL) of banana rum, 4  fl oz (120 mL) of RumChata, 4  fl oz (120 mL) of cream, and 1 cup (240 mL) of ice in a blender and blend them until the mixture is smooth and there are no large chunks of ice. Then, sprinkle cinnamon on top of the mixture and garnish with banana slices and cherries. If the mixture is too thick after it’s been blended, you can make it smoother by adding more cream and re-blending. This drink is often referred to as a “Banana RumChata Colada.” Combine apple liqueur, ice, and RumChata to make Apple RumChata. Mix 1  fl oz (30 mL) of apple liqueur, 2  fl oz (59 mL) of RumChata, and ice in a cocktail shaker. Shake the ingredients together, then use a strainer to strain them into a martini glass rimmed with sea salt. You can also make a similar drink by mixing equal parts of RumChata and sour apple schnapps. Making Drinks with RumChata and Non-Alcoholic Ingredients Spice up your cold brew coffee by adding RumChata to it. Because RumChata is made with cream, it’s a ready substitute for milk or creamer in coffee. Pour 3 fluid ounces (89 mL) of RumChata over ice in a highball glass and top with your cold brew coffee. Garnish with grated cinnamon to taste. You can make this drink even stronger by adding rum, allspice dram liqueur, or Angostura bitters to it. You can also mix RumChata with hot coffee; most people, however, seem to prefer to use it in cold brew or iced coffee. Use ice cream to make RumChata milkshakes. RumChata can essentially serve as a replacement for milk in a traditional milkshake. Blend 2 fluid ounces (59 mL) of RumChata with a scoop of ice cream in a blender until smooth. Then, garnish with grated nutmeg, crushed pistachios, almonds, or crumbled cookies. Most recipes for RumChata milkshakes use vanilla ice cream, although you can use any flavor of ice cream you like for this drink. If you’re not pleased with the consistency of your milkshake, try adding crushed ice to the mix. Pour RumChata into your eggnog for a festive holiday drink. Fill a highball glass with ice and add 4  fl oz (120 mL) of eggnog. Then, pour in 2  fl oz (59 mL) of RumChata and stir with a spoon. To garnish, grate fresh nutmeg across the top of your drink. Mix milk, RumChata, and pudding mix to make shots. Stir 1  c (0.24 L) of milk, 1  c (0.24 L) of RumChata, and 1 package of instant pudding mix in a bowl together until thickened. Add 8  fl oz (240 mL) of whipped cream to the mixture, then pour into disposable shot cups and freeze for at least 3 hours. For best results, use a package of instant pudding mix that is no larger than 4 ounces (110 g). Add whipped cream to the top of the frozen shot for garnish. You may see this type of drink referred to as a RumChata Pudding Shot. Make a delicious dessert drink out of RumChata and hot chocolate. Pour 2  fl oz (59 mL) of RumChata into a coffee mug and top with hot chocolate. For a stronger drink, try using 3  fl oz (89 mL) of RumChata instead. You can garnish this drink with whipped cream and freshly shaved dark chocolate. RumChata hot chocolate is a delectable drink to have on cold nights, but can also easily complement a summer brunch. Add blue cream soda to iced RumChata to make a creamy float. Put some ice in a highball glass and pour 1.5  fl oz (44 mL) to 2  fl oz (59 mL) of RumChata into the glass. Then, slowly pour a bottle of blue cream soda into the glass until it’s filled. For an even sweeter experience, add sugar to the rim of your glass. This drink is sometimes referred to as an Abominable Snowman Cocktail.",
  "tyn_model":[
    "rumchata",
    "ice",
    "whipped cream",
    "cream",
    "milk",
    "ice cream",
    "liqueur",
    "shot glasses",
    "cinnamon",
    "orange liqueur",
    "grenadine",
    "tequila",
    "french kiss shots",
    "coffee-flavored liqueur",
    "shaker",
    "banana rum",
    "blender",
    "apple liqueur",
    "cold brew coffee",
    "eggnog",
    "hot chocolate",
    "blue cream soda",
    "cinnamon-flavored liqueur",
    "mixing glass",
    "orange creamsicle rumchata",
    "orange-flavored vodka",
    "shot glass",
    "cinnamon roll cocktail",
    "“cinnamon",
    "”\n",
    "cinnamon toast crunch shot",
    "banana",
    "banana slices",
    "cherries",
    "“banana",
    "” combine",
    "cocktail shaker",
    "strainer",
    "martini glass",
    "sea salt",
    "sour apple schnapps",
    "creamer",
    "rum",
    "allspice dram liqueur",
    "angostura bitters",
    "coffee",
    "cold brew or",
    "nutmeg",
    "pistachios",
    "almonds",
    "crushed ice",
    "spoon",
    "instant pudding",
    "bowl",
    "disposable shot cups",
    "instant pudding mix",
    "coffee mug",
    "dark chocolate",
    "sugar"
  ],
  "tyn_section":[

  ]
}