{
  "title":"How to Drink Jameson",
  "url":"https://www.wikihow.com/Drink-Jameson",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks"
  ],
  "methods":[
    {
      "name":"Drinking Jameson without a Mixer",
      "steps":[
        {
          "headline":"Choose a rocks glass for a smooth drinking ritual.",
          "description":"A rocks glass is a small glass tumbler that holds between 6 to 10  fl oz (180 to 300 mL). These are often decorative and you can purchase them alone or as part of a whiskey decanter set. Drinking your Jameson from a rocks glass will promote a smooth drinking experience. Keep in mind that you can drink whiskey out of any glass you want. For example, you could pour it into a ceramic coffee mug, a tin cup, or even a disposable plastic cup if that’s what you want to use."
        },
        {
          "headline":"Drink the Jameson neat to experience all of the flavors.",
          "description":"If you want to experience the full spectrum of flavors in the whiskey, then don’t add anything to it. Simply pour a 1.5  fl oz (44 mL) serving of room temperature Jameson into a rocks glass or other drinking vessel, and enjoy! You can pour a larger serving if you prefer. Just remember that whiskey is a very strong drink so it is best to drink only a small amount at a time."
        },
        {
          "headline":"Add 1 large ice cube to chill your Jameson.",
          "description":"If you want to chill your Jameson, use a large ice cube. Using multiple small ice cubes will quickly dilute the Jameson and cool down the alcohol which this will mute the flavor. To make Jameson cold without adding too much water, add a large cube-shaped or spherical ice cube to the glass. You can purchase special ice cube trays for whiskey. Check culinary stores and online retailers to find a large spherical or cube-shaped ice tray. If you want to chill Jameson without water, then purchase a set of whiskey rocks. These are granite or stainless steel cubes that you freeze and add to whiskey in place of ice."
        },
        {
          "headline":"Pour in a small amount of water to dilute the Jameson.",
          "description":"Add about 0.5  fl oz (15 ml) of water, then taste the Jameson to see if this makes it easier for you to drink. If it still tastes too strong, add another 0.5  fl oz (15 ml) of water and taste it again. Repeat until the Jameson tastes how you want it to. You may find it easier to detect subtle flavors in the whiskey even after adding a few drops of water."
        },
        {
          "headline":"Inhale the aroma and then take a small sip.",
          "description":"Put your mouth on the glass as if you are going to take a sip and tip the glass so that your nose is in it. Then, take a deep breath in through your nose to inhale the scent of the Jameson. Take a small sip and let the sip linger on your tongue for a moment before you swallow. Common scents and flavors you might notice include toffee, vanilla, and caramel."
        },
        {
          "headline":"Continue to smell and sip slowly for 30 to 60 minutes.",
          "description":"Because Jameson is so strong, it is best to sip the entire drink slowly. Take your time and savor the flavors and scent of the Jameson. You can hold the glass in your hands while drinking to keep it warm or set it down if you have added ice to your drink."
        }
      ]
    },
    {
      "name":"Making Jameson Mixed Drinks",
      "steps":[
        {
          "headline":"Mix ginger ale with Jameson for a sweet pick-me-up.",
          "description":"Jameson goes great with ginger ale. Pour a 1.5  fl oz (44 mL) serving of Jameson into a glass filled with ice, then pour in 4.5  fl oz (130 mL) of ginger ale. You can also squeeze a lime or lemon wedge into your drink for some extra zing."
        },
        {
          "headline":"Add a shot of Jameson to coffee for a caffeinated whiskey drink.",
          "description":"Try adding a 1.5  fl oz (44 mL) shot of Jameson to a mug, then pour in coffee and stir. Add cream, sugar, a sprinkle of cinnamon, or whatever you like in your coffee. This drink is often called an Irish coffee. You can drink it hot, or pour your Irish coffee over a cup filled with ice for a cold coffee drink."
        },
        {
          "headline":"Pour a shot of Jameson into your tea for an extra strong cup of tea.",
          "description":"If you are more of a tea-drinker, pour a 1.5  fl oz (44 mL) shot of Jameson into a cup of your favorite brewed tea. Then, flavor your tea however you like, such as with a lemon wedge and sugar. To make iced tea, pour the tea and Jameson mixture into a glass filled with ice."
        },
        {
          "headline":"Create a Middleton mule for a whiskey version of the Moscow Mule.",
          "description":"The Moscow Mule is a popular vodka drink made with ginger ale and lime. You can make a whiskey version of this drink by swapping out Jameson for the vodka. Combine 6  fl oz (180 mL) of ginger beer, 3  fl oz (89 mL) of Jameson, 0.5  fl oz (15 mL) of lime juice, and 0.5  fl oz (15 mL) of sugar syrup. Add a lime wedge for garnish and serve the drink in a copper mug for an authentic mule!"
        },
        {
          "headline":"Make a Tipperary for a whiskey version of a martini.",
          "description":"This drink is named for a region of Ireland famous for breeding racehorses and Irish musicians. To make this drink, fill a shaker halfway with ice, and then pour in 1.5  fl oz (44 mL) of Jameson, 1.5  fl oz (44 mL) of chartreuse, and 1.5  fl oz (44 mL) of Italian vermouth. Stir the ingredients to combine them, then strain the drink into a rocks glass. If desired, you can also serve this drink over ice."
        },
        {
          "headline":"Combine Jameson with lemonade and ginger ale for a sweet, fizzy drink.",
          "description":"Jameson lemonade is a refreshing drink for summer. Place 1.5  fl oz (44 mL) of Jameson, 3  fl oz (89 mL) of lemonade, and 3  fl oz (89 mL) of ginger ale into a glass filled with ice. Stir to combine the ingredients and enjoy! Garnish this drink with lemon wedges or mint for extra flavor."
        },
        {
          "headline":"Whip up a Jameson Old Fashioned for a fun twist on a classic cocktail.",
          "description":"Put a sugar cube in a shaker and muddle it. Then add ice, 1.5  fl oz (44 mL) Jameson, 2 dashes each of regular bitters, and 2 dashes of orange bitters. Stir until the ingredients are well-combined. Strain the liquid into a rocks glass and enjoy. For best results, use Jameson Black Barrel."
        }
      ]
    },
    {
      "name":"Creating Jameson Shots",
      "steps":[
        {
          "headline":"Mix Jameson and Irish cream for a creamy whiskey shot.",
          "description":"Add 0.75  fl oz (22 mL) of Jameson to a shaker filled with ice, then add 0.75  fl oz (22 mL) of Irish cream to the shaker. Shake to combine the ingredients, and then strain the liquid into a shot glass. Drink the shot all in 1 gulp, or sip it if you prefer."
        },
        {
          "headline":"Create a shot with Jameson and amaretto for a caramel-flavored shot.",
          "description":"Combine 0.75  fl oz (22 mL) Jameson with 0.25  fl oz (7.4 mL) amaretto. Add the Jameson and amaretto to a shaker filled with ice. Then, cover the shaker and shake the ingredients. Strain the liquid into a shot glass and enjoy! Amaretto brings out the caramel and toffee notes of Jameson."
        },
        {
          "headline":"Mix Jameson with cola and a cherry if you are a fan of cherry cola.",
          "description":"Add 0.5  fl oz (15 mL) of Jameson and 0.5  fl oz (15 mL) of cola to an ice-filled shaker. Mix the Jameson and cola in the shaker. Then, strain the liquid into a shot glass and top it with a maraschino cherry! Make sure to chew the cherry before you swallow it. Don’t try to swallow it whole!"
        },
        {
          "headline":"Make a duck fart for an attractive-looking layered shot.",
          "description":"In a shot glass, pour in 0.5  fl oz (15 mL) of coffee liqueur. Then, slowly pour 0.5  fl oz (15 mL) of Irish cream on top of the coffee liqueur. Next, slowly pour 0.5  fl oz (15 mL) of Jameson into the shot glass for the top layer. Do not stir or shake the shot in a shaker! It will ruin the layered effect."
        }
      ]
    }
  ],
  "text":" Drinking Jameson without a Mixer Choose a rocks glass for a smooth drinking ritual. A rocks glass is a small glass tumbler that holds between 6 to 10  fl oz (180 to 300 mL). These are often decorative and you can purchase them alone or as part of a whiskey decanter set. Drinking your Jameson from a rocks glass will promote a smooth drinking experience. Keep in mind that you can drink whiskey out of any glass you want. For example, you could pour it into a ceramic coffee mug, a tin cup, or even a disposable plastic cup if that’s what you want to use. Drink the Jameson neat to experience all of the flavors. If you want to experience the full spectrum of flavors in the whiskey, then don’t add anything to it. Simply pour a 1.5  fl oz (44 mL) serving of room temperature Jameson into a rocks glass or other drinking vessel, and enjoy! You can pour a larger serving if you prefer. Just remember that whiskey is a very strong drink so it is best to drink only a small amount at a time. Add 1 large ice cube to chill your Jameson. If you want to chill your Jameson, use a large ice cube. Using multiple small ice cubes will quickly dilute the Jameson and cool down the alcohol which this will mute the flavor. To make Jameson cold without adding too much water, add a large cube-shaped or spherical ice cube to the glass. You can purchase special ice cube trays for whiskey. Check culinary stores and online retailers to find a large spherical or cube-shaped ice tray. If you want to chill Jameson without water, then purchase a set of whiskey rocks. These are granite or stainless steel cubes that you freeze and add to whiskey in place of ice. Pour in a small amount of water to dilute the Jameson. Add about 0.5  fl oz (15 ml) of water, then taste the Jameson to see if this makes it easier for you to drink. If it still tastes too strong, add another 0.5  fl oz (15 ml) of water and taste it again. Repeat until the Jameson tastes how you want it to. You may find it easier to detect subtle flavors in the whiskey even after adding a few drops of water. Inhale the aroma and then take a small sip. Put your mouth on the glass as if you are going to take a sip and tip the glass so that your nose is in it. Then, take a deep breath in through your nose to inhale the scent of the Jameson. Take a small sip and let the sip linger on your tongue for a moment before you swallow. Common scents and flavors you might notice include toffee, vanilla, and caramel. Continue to smell and sip slowly for 30 to 60 minutes. Because Jameson is so strong, it is best to sip the entire drink slowly. Take your time and savor the flavors and scent of the Jameson. You can hold the glass in your hands while drinking to keep it warm or set it down if you have added ice to your drink. Making Jameson Mixed Drinks Mix ginger ale with Jameson for a sweet pick-me-up. Jameson goes great with ginger ale. Pour a 1.5  fl oz (44 mL) serving of Jameson into a glass filled with ice, then pour in 4.5  fl oz (130 mL) of ginger ale. You can also squeeze a lime or lemon wedge into your drink for some extra zing. Add a shot of Jameson to coffee for a caffeinated whiskey drink. Try adding a 1.5  fl oz (44 mL) shot of Jameson to a mug, then pour in coffee and stir. Add cream, sugar, a sprinkle of cinnamon, or whatever you like in your coffee. This drink is often called an Irish coffee. You can drink it hot, or pour your Irish coffee over a cup filled with ice for a cold coffee drink. Pour a shot of Jameson into your tea for an extra strong cup of tea. If you are more of a tea-drinker, pour a 1.5  fl oz (44 mL) shot of Jameson into a cup of your favorite brewed tea. Then, flavor your tea however you like, such as with a lemon wedge and sugar. To make iced tea, pour the tea and Jameson mixture into a glass filled with ice. Create a Middleton mule for a whiskey version of the Moscow Mule. The Moscow Mule is a popular vodka drink made with ginger ale and lime. You can make a whiskey version of this drink by swapping out Jameson for the vodka. Combine 6  fl oz (180 mL) of ginger beer, 3  fl oz (89 mL) of Jameson, 0.5  fl oz (15 mL) of lime juice, and 0.5  fl oz (15 mL) of sugar syrup. Add a lime wedge for garnish and serve the drink in a copper mug for an authentic mule! Make a Tipperary for a whiskey version of a martini. This drink is named for a region of Ireland famous for breeding racehorses and Irish musicians. To make this drink, fill a shaker halfway with ice, and then pour in 1.5  fl oz (44 mL) of Jameson, 1.5  fl oz (44 mL) of chartreuse, and 1.5  fl oz (44 mL) of Italian vermouth. Stir the ingredients to combine them, then strain the drink into a rocks glass. If desired, you can also serve this drink over ice. Combine Jameson with lemonade and ginger ale for a sweet, fizzy drink. Jameson lemonade is a refreshing drink for summer. Place 1.5  fl oz (44 mL) of Jameson, 3  fl oz (89 mL) of lemonade, and 3  fl oz (89 mL) of ginger ale into a glass filled with ice. Stir to combine the ingredients and enjoy! Garnish this drink with lemon wedges or mint for extra flavor. Whip up a Jameson Old Fashioned for a fun twist on a classic cocktail. Put a sugar cube in a shaker and muddle it. Then add ice, 1.5  fl oz (44 mL) Jameson, 2 dashes each of regular bitters, and 2 dashes of orange bitters. Stir until the ingredients are well-combined. Strain the liquid into a rocks glass and enjoy. For best results, use Jameson Black Barrel. Creating Jameson Shots Mix Jameson and Irish cream for a creamy whiskey shot. Add 0.75  fl oz (22 mL) of Jameson to a shaker filled with ice, then add 0.75  fl oz (22 mL) of Irish cream to the shaker. Shake to combine the ingredients, and then strain the liquid into a shot glass. Drink the shot all in 1 gulp, or sip it if you prefer. Create a shot with Jameson and amaretto for a caramel-flavored shot. Combine 0.75  fl oz (22 mL) Jameson with 0.25  fl oz (7.4 mL) amaretto. Add the Jameson and amaretto to a shaker filled with ice. Then, cover the shaker and shake the ingredients. Strain the liquid into a shot glass and enjoy! Amaretto brings out the caramel and toffee notes of Jameson. Mix Jameson with cola and a cherry if you are a fan of cherry cola. Add 0.5  fl oz (15 mL) of Jameson and 0.5  fl oz (15 mL) of cola to an ice-filled shaker. Mix the Jameson and cola in the shaker. Then, strain the liquid into a shot glass and top it with a maraschino cherry! Make sure to chew the cherry before you swallow it. Don’t try to swallow it whole! Make a duck fart for an attractive-looking layered shot. In a shot glass, pour in 0.5  fl oz (15 mL) of coffee liqueur. Then, slowly pour 0.5  fl oz (15 mL) of Irish cream on top of the coffee liqueur. Next, slowly pour 0.5  fl oz (15 mL) of Jameson into the shot glass for the top layer. Do not stir or shake the shot in a shaker! It will ruin the layered effect.",
  "tyn_model":[
    "jameson",
    "ice",
    "shaker",
    "water",
    "rocks glass",
    "glass",
    "ginger ale",
    "shot glass",
    "whiskey",
    "ice cube",
    "lime",
    "irish cream",
    "cola",
    "sugar",
    "tea",
    "lemon",
    "lemonade",
    "amaretto",
    "coffee liqueur",
    "mixer",
    "tumbler",
    "whiskey decanter set",
    "ice cubes",
    "ice cube trays",
    "ice tray",
    "whiskey rocks",
    "stainless steel cubes",
    "mug",
    "coffee",
    "cream",
    "cinnamon",
    "iced tea",
    "vodka",
    "ginger beer",
    "lime juice",
    "sugar syrup",
    "chartreuse",
    "italian vermouth",
    "jameson lemonade",
    "mint",
    "sugar cube",
    "regular bitters",
    "orange bitters",
    "cherry",
    "cherry cola",
    "ice-filled shaker"
  ],
  "tyn_section":[

  ]
}