{
  "title":"How to Decorate a Dining Table when It's Not in Use",
  "url":"https://www.wikihow.com/Decorate-a-Dining-Table-when-It%27s-Not-in-Use",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping"
  ],
  "methods":[
    {
      "name":"Choosing Functional Pieces",
      "steps":[
        {
          "headline":"Place a tray in the middle of the table to group objects together.",
          "description":"Choose a tray that contrasts well with the material and color of your dining room table. You can place things on the tray such as candles, coasters, or small decorative objects. Trays are a great option as they let you pick up everything that's on the table at once. Opt for a lazy Susan in the middle of your table for a super functional tray. If you have a wooden table, you might opt for a marble tray, while a wooden tray looks great with a sleek metal table. Trays work for holding decorative items as well as for serving your table a meal."
        },
        {
          "headline":"Fill a bowl with fresh fruit to place on the table.",
          "description":"Choose a bowl that you like and that matches your dining room. Place fresh fruit in it, such as apples, oranges, bananas, or pears. This is a great way to store snacks while creating an aesthetically-pleasing centerpiece. It's best to choose a bowl that will display all of the fruit well, so avoid huge bowls unless you're going to fill them to the top with fruit. Pay attention to the ripeness of the fruit to make sure you replace it when necessary. Use plastic fruit as an alternative, if desired. Make sure to use a large, decorative bowl so it doesn't look like someone forgot to clean up their dishes."
        },
        {
          "headline":"Keep a stack of clean plates on the table so it's ready to be set.",
          "description":"This keeps your table functional and uncluttered, yet it's ready for dinner. Stack your dinner plates in the middle of the table, adding utensils on top if desired. Make sure all of your dishes are matching to keep the display looking nice. You can also do this with drinking glasses or bowls. Use colorful plates to add texture and colors to your table."
        },
        {
          "headline":"Pick out candles for the table to add lighting to the room.",
          "description":"A set of elegant candlesticks are a good option for your dining room table, as are a group of votive candles. You can light the candles when you're eating a meal, working at the table, or just want a fresh scent in the room. Place a large candlestick near each end of the table, or set out small votive candles along the entire center of the table. Try flameless, battery-operated candles if you don't want a fire risk in your home."
        },
        {
          "headline":"Dress your table with decorative fabrics.",
          "description":"A traditional tablecloth in a fabric that compliments the décor of your dining room is a good choice. If you want to leave some of the tabletop on display, choose a table runner or placemats, or both. Neutral fabric coloured white, beige, grey, stone etc with textures compliment most rooms, you can make a statement with bold colours or patterns if you prefer. Table linens are very practical, protecting the table from spills during meals. Try using placemats on top of your tablecloth to add layers to your table. Put table runners the opposite direction of any placemats you have."
        },
        {
          "headline":"Show off a beautiful table by leaving it bare.",
          "description":"If you have a naturally gorgeous dining room table, such as one made of natural wood that shows the grain and unique coloring, consider leaving the table completely bare. This will draw attention to the piece while leaving it super functional. Hang decorative lighting above the table for an added element. Make sure to clean and polish your table weekly to protect it from dust and scratches."
        }
      ]
    },
    {
      "name":"Selecting Decorative Objects",
      "steps":[
        {
          "headline":"Find a decorative vase to fill with fresh flowers.",
          "description":"This will immediately make your dining room look more lively and smell fresh. Use a vase you have around the house, or look for a new one that matches your dining room. Replenish the flowers once they start to wilt to keep your decoration looking its best. For example, fill a clear glass vase with roses, or purchase daisies to go in a colorful marbled vase. Consider using fake flowers as the centerpiece instead of real ones, if desired. Switch out the flowers depending on the season or holiday."
        },
        {
          "headline":"Show off decorative urns and vases in the center of your table.",
          "description":"This could be a beautiful glass vase that you place in the center of your table or a cluster of smaller vessels that you spread throughout the middle. This is a great way to show off urns, vases, or other similar items that work well with your dining room. For example, use silver vases as a centerpiece, or set out decorative metal urns on the table. Place a layer or mat between the object and the table so it doesn't dent the surface."
        },
        {
          "headline":"Stack books on the table to create a unique focal point.",
          "description":"Choose books that are sturdy, have aesthetically pleasing spines or covers, or that are written on an interesting topic. Stack the books in the middle of the table with the largest book on the bottom for a simple centerpiece. Hardcover books that are often viewed as coffee table books are great options for placing on your dining room table. Choose books in similar sizes, or arrange the stack so that it goes from the smallest to the largest with the smallest books on top. Set a small decoration or flameless candle on top of the books for added decor."
        },
        {
          "headline":"Pick out a cluster of potted plants to add greenery.",
          "description":"Select a potted plant, such as a small fern, succulents, or even a cactus. This will bring naturalistic elements to your dining room, and putting the plant in a decorative pot that matches your room will bring the whole look together. Place 1-2 taller potted plants in the center of the table, or choose a group of shorter potted plants to spread down the middle. If you're using real plants, make sure you water them so that they stay green and healthy. Place a tray or other material under the pot to catch any water that leaks out so that you don't ruin your dining room table."
        },
        {
          "headline":"Use a piece of art as a centerpiece for the table.",
          "description":"If you have a piece of art that you love and that works in your dining room, place it in the middle as a unique centerpiece. This could be a sculpture that you made yourself or one that you picked out, as well as a piece of pottery. For example, place an abstract sculpture made of wood on your dining room table. If you have a super long table, consider placing multiple pieces along the center. Choose art that's 3-dimensional so that it can be viewed from every angle."
        },
        {
          "headline":"Keep themed centerpieces on the table depending on the season.",
          "description":"Change your simple centerpiece every month depending on holidays, or choose a centerpiece that will last the entire season. This could be a bowl full of pinecones for the fall, or a red and pink flower vase for Valentine's Day. Create a display of seashells from the beach for the summer months. Place a cluster of tiny pumpkins on the table for Halloween or Thanksgiving. Changing out designs based on the season or holiday helps keep your dining room looking fresh."
        },
        {
          "headline":"Spread a decorative tablecloth over the table when it's not in use.",
          "description":"This is a simple way to make your dining room table look more elegant while also protecting it from normal wear and tear. Choose a tablecloth or table runner that matches your dining room and spread it across your dining room table so that the cloth is even on each side. Remove the tablecloth or table runner before eating, if desired. For example, choose a navy blue tablecloth to go on the dining room table if the room has blue accents in it."
        }
      ]
    }
  ],
  "text":" Choosing Functional Pieces Place a tray in the middle of the table to group objects together. Choose a tray that contrasts well with the material and color of your dining room table. You can place things on the tray such as candles, coasters, or small decorative objects. Trays are a great option as they let you pick up everything that's on the table at once. Opt for a lazy Susan in the middle of your table for a super functional tray. If you have a wooden table, you might opt for a marble tray, while a wooden tray looks great with a sleek metal table. Trays work for holding decorative items as well as for serving your table a meal. Fill a bowl with fresh fruit to place on the table. Choose a bowl that you like and that matches your dining room. Place fresh fruit in it, such as apples, oranges, bananas, or pears. This is a great way to store snacks while creating an aesthetically-pleasing centerpiece. It's best to choose a bowl that will display all of the fruit well, so avoid huge bowls unless you're going to fill them to the top with fruit. Pay attention to the ripeness of the fruit to make sure you replace it when necessary. Use plastic fruit as an alternative, if desired. Make sure to use a large, decorative bowl so it doesn't look like someone forgot to clean up their dishes. Keep a stack of clean plates on the table so it's ready to be set. This keeps your table functional and uncluttered, yet it's ready for dinner. Stack your dinner plates in the middle of the table, adding utensils on top if desired. Make sure all of your dishes are matching to keep the display looking nice. You can also do this with drinking glasses or bowls. Use colorful plates to add texture and colors to your table. Pick out candles for the table to add lighting to the room. A set of elegant candlesticks are a good option for your dining room table, as are a group of votive candles. You can light the candles when you're eating a meal, working at the table, or just want a fresh scent in the room. Place a large candlestick near each end of the table, or set out small votive candles along the entire center of the table. Try flameless, battery-operated candles if you don't want a fire risk in your home. Dress your table with decorative fabrics. A traditional tablecloth in a fabric that compliments the décor of your dining room is a good choice. If you want to leave some of the tabletop on display, choose a table runner or placemats, or both. Neutral fabric coloured white, beige, grey, stone etc with textures compliment most rooms, you can make a statement with bold colours or patterns if you prefer. Table linens are very practical, protecting the table from spills during meals. Try using placemats on top of your tablecloth to add layers to your table. Put table runners the opposite direction of any placemats you have. Show off a beautiful table by leaving it bare. If you have a naturally gorgeous dining room table, such as one made of natural wood that shows the grain and unique coloring, consider leaving the table completely bare. This will draw attention to the piece while leaving it super functional. Hang decorative lighting above the table for an added element. Make sure to clean and polish your table weekly to protect it from dust and scratches. Selecting Decorative Objects Find a decorative vase to fill with fresh flowers. This will immediately make your dining room look more lively and smell fresh. Use a vase you have around the house, or look for a new one that matches your dining room. Replenish the flowers once they start to wilt to keep your decoration looking its best. For example, fill a clear glass vase with roses, or purchase daisies to go in a colorful marbled vase. Consider using fake flowers as the centerpiece instead of real ones, if desired. Switch out the flowers depending on the season or holiday. Show off decorative urns and vases in the center of your table. This could be a beautiful glass vase that you place in the center of your table or a cluster of smaller vessels that you spread throughout the middle. This is a great way to show off urns, vases, or other similar items that work well with your dining room. For example, use silver vases as a centerpiece, or set out decorative metal urns on the table. Place a layer or mat between the object and the table so it doesn't dent the surface. Stack books on the table to create a unique focal point. Choose books that are sturdy, have aesthetically pleasing spines or covers, or that are written on an interesting topic. Stack the books in the middle of the table with the largest book on the bottom for a simple centerpiece. Hardcover books that are often viewed as coffee table books are great options for placing on your dining room table. Choose books in similar sizes, or arrange the stack so that it goes from the smallest to the largest with the smallest books on top. Set a small decoration or flameless candle on top of the books for added decor. Pick out a cluster of potted plants to add greenery. Select a potted plant, such as a small fern, succulents, or even a cactus. This will bring naturalistic elements to your dining room, and putting the plant in a decorative pot that matches your room will bring the whole look together. Place 1-2 taller potted plants in the center of the table, or choose a group of shorter potted plants to spread down the middle. If you're using real plants, make sure you water them so that they stay green and healthy. Place a tray or other material under the pot to catch any water that leaks out so that you don't ruin your dining room table. Use a piece of art as a centerpiece for the table. If you have a piece of art that you love and that works in your dining room, place it in the middle as a unique centerpiece. This could be a sculpture that you made yourself or one that you picked out, as well as a piece of pottery. For example, place an abstract sculpture made of wood on your dining room table. If you have a super long table, consider placing multiple pieces along the center. Choose art that's 3-dimensional so that it can be viewed from every angle. Keep themed centerpieces on the table depending on the season. Change your simple centerpiece every month depending on holidays, or choose a centerpiece that will last the entire season. This could be a bowl full of pinecones for the fall, or a red and pink flower vase for Valentine's Day. Create a display of seashells from the beach for the summer months. Place a cluster of tiny pumpkins on the table for Halloween or Thanksgiving. Changing out designs based on the season or holiday helps keep your dining room looking fresh. Spread a decorative tablecloth over the table when it's not in use. This is a simple way to make your dining room table look more elegant while also protecting it from normal wear and tear. Choose a tablecloth or table runner that matches your dining room and spread it across your dining room table so that the cloth is even on each side. Remove the tablecloth or table runner before eating, if desired. For example, choose a navy blue tablecloth to go on the dining room table if the room has blue accents in it.",
  "tyn_model":[
    "tray",
    "candles",
    "bowl",
    "tablecloth",
    "books",
    "dining room table",
    "table runner",
    "flowers",
    "vases",
    "trays",
    "bowls",
    "dishes",
    "plates",
    "water",
    "lazy susan",
    "apples",
    "oranges",
    "bananas",
    "pears",
    "dinner plates",
    "drinking glasses",
    "candlesticks",
    "candlestick",
    "votive candles",
    "fabric",
    "table linens",
    "placemats",
    "table runners",
    "decorative vase",
    "vase",
    "clear glass vase",
    "roses",
    "daisies",
    "potted plants",
    "potted plant",
    "succulents",
    "pot",
    "pottery",
    "art",
    "pinecones",
    "pumpkins"
  ],
  "tyn_section":[

  ]
}