{
  "title":"How to Build a Stock Library for Compositing",
  "url":"https://www.wikihow.com/Build-a-Stock-Library-for-Compositing",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photographic Techniques"
  ],
  "methods":[
    {
      "name":"Gathering Images for Compositing",
      "steps":[
        {
          "headline":"Gather images from a variety of sources.",
          "description":"There are several sources for stock images, online. They range widely in cost, so look around. Some of the options include:\n\nFlickr Creative Commons photographs (be sure that the license matches your intended purpose)\nStock websites - there are quite a few of these to search through; the cost and licensing agreements vary from agency to agency\nYour own photographs"
        },
        {
          "headline":"Always keep perspective in mind.",
          "description":"When searching for images for a particular composition, you want to make sure that the perspectives match for all the images you're combining. Believe it or not, even a novice viewer can tell if the perspective matches or not. Watch where the horizon of your image is, in perspective to any particular subject in the planned composition."
        },
        {
          "headline":"Pay attention to the lighting.",
          "description":"Consider both the type of light and the direction of the light. While the type of light can be edited and changed, the direction of the light is more difficult to change."
        }
      ]
    },
    {
      "name":"Photographing Your Own Stock Images",
      "steps":[
        {
          "headline":"Take a lot of photographs.",
          "description":"You will want to have a lot of images to choose from."
        },
        {
          "headline":"Shoot from the right perspective in the right location.",
          "description":"For animals and children, shoot from their perspective. That means you will need to get down on your knees to get a lot of your shots. Put some thought into your location, too. Spend some time checking out where you want to shoot your images from. It will be a lot more difficult to separate components of an image if you are shooting ocean waves or you are in a forest."
        },
        {
          "headline":"Use the equipment that you have.",
          "description":"If 'all' you have is a smartphone, then use a smartphone. If possible, though, some additional tools will help:\nHave a green screen. There are some images that you are going to be able to shoot using a green screen. For instance, consider a piece where you want the subject to appear to be climbing something. If you shoot this kind of image outside, you will have difficulty cleaning that up to use in your composition. It's better to shoot a green screen version so you can isolate the subject easily. Use a tripod. While a tripod isn't absolutely necessary, it will certainly help you. This is especially important if you plan on being in the composition yourself."
        },
        {
          "headline":"Use some type of backlighting to separate your subject from the background, if possible.",
          "description":"This will make it easier to separate image components."
        },
        {
          "headline":"Photograph backgrounds.",
          "description":"For the most part, backgrounds are generic enough that they can be used in a wide variety of compositions. For the background, you will want images with horizons, without horizons, forests, beaches, parks, etc."
        },
        {
          "headline":"Shoot under cloudy skies.",
          "description":"Don't shoot when it's raining, but when your skies are overcast, it reduces shadows so that you can use your images in a lot more compositions."
        },
        {
          "headline":"Look through your old images.",
          "description":"See if you can find elements there to use in your compositions."
        }
      ]
    }
  ],
  "text":" Gathering Images for Compositing Gather images from a variety of sources. There are several sources for stock images, online. They range widely in cost, so look around. Some of the options include:\n\nFlickr Creative Commons photographs (be sure that the license matches your intended purpose)\nStock websites - there are quite a few of these to search through; the cost and licensing agreements vary from agency to agency\nYour own photographs Always keep perspective in mind. When searching for images for a particular composition, you want to make sure that the perspectives match for all the images you're combining. Believe it or not, even a novice viewer can tell if the perspective matches or not. Watch where the horizon of your image is, in perspective to any particular subject in the planned composition. Pay attention to the lighting. Consider both the type of light and the direction of the light. While the type of light can be edited and changed, the direction of the light is more difficult to change. Photographing Your Own Stock Images Take a lot of photographs. You will want to have a lot of images to choose from. Shoot from the right perspective in the right location. For animals and children, shoot from their perspective. That means you will need to get down on your knees to get a lot of your shots. Put some thought into your location, too. Spend some time checking out where you want to shoot your images from. It will be a lot more difficult to separate components of an image if you are shooting ocean waves or you are in a forest. Use the equipment that you have. If 'all' you have is a smartphone, then use a smartphone. If possible, though, some additional tools will help:\nHave a green screen. There are some images that you are going to be able to shoot using a green screen. For instance, consider a piece where you want the subject to appear to be climbing something. If you shoot this kind of image outside, you will have difficulty cleaning that up to use in your composition. It's better to shoot a green screen version so you can isolate the subject easily. Use a tripod. While a tripod isn't absolutely necessary, it will certainly help you. This is especially important if you plan on being in the composition yourself. Use some type of backlighting to separate your subject from the background, if possible. This will make it easier to separate image components. Photograph backgrounds. For the most part, backgrounds are generic enough that they can be used in a wide variety of compositions. For the background, you will want images with horizons, without horizons, forests, beaches, parks, etc. Shoot under cloudy skies. Don't shoot when it's raining, but when your skies are overcast, it reduces shadows so that you can use your images in a lot more compositions. Look through your old images. See if you can find elements there to use in your compositions.",
  "tyn_model":[
    "photographs",
    "tripod",
    "creative commons photographs",
    "images"
  ],
  "tyn_section":[

  ]
}