{
  "title":"How to Make Good Divisions to Win WW2 in Hearts of Iron IV",
  "url":"https://www.wikihow.com/Make-Good-Divisions-to-Win-WW2-in-Hearts-of-Iron-IV",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games"
  ],
  "parts":[
    {
      "name":"Understanding Concepts",
      "steps":[
        {
          "headline":"Understand the generations of divisions, from early to late war, in HOI4.",
          "description":"They will be shown in the bullet points below. They will be three years apart from each other, so you'll be able to have enough time to upgrade and produce equipment. First Generation, aka Pre War: These are the divisions you should be able to get in the start of the game, assuming you chose a 1936 start. Second Generation, aka Early War: These are the divisions you should be able to get by 1939 (it'll be the first generation if you chose a 1939 start, minus 1 for each generation). Third Generation, aka Mid War: These are the divisions you should be able to get by the time it's 1942. Fourth Generation, aka Late War: These are the divisions you should be able to get by the time it's 1945. Fifth Generation, aka Post War: These are the divisions you should be able to get by the time the end screen is looming, at around 1948 (but it can be delayed if there is a war which involves 3 or more major powers)."
        },
        {
          "headline":"Realize the limitations of XP, especially in the early game.",
          "description":"In 1936, the only ways that you can get army XP is by getting involved in the Second Italo-Abyssinian War and the Spanish Civil War. Various civil wars and wars can also start, like Bolivia declaring war on Paraguay (which often happens). You can also train new divisions and put them on exercises to get them to regular. In 1937, a new war will be opened, which is the Second Sino-Japanese War. World tensions may go over 25% percent (which is the minimum world tension for Allies to go to war with Axis). In 1939, WW2 will start, resulting in a humongous source of all types of XP (one faction will be defeated). Just make sure your divisions and equipment don't run low, though. Potentially, if only one faction has been utterly destroyed by the second world war, a third world war will start, somewhere in 1946-1947. This is a more humongous source of all types of XP if you're lucky enough to get it."
        },
        {
          "headline":"Understand the differences between land doctrines.",
          "description":"Mobile Warfare is if you want the juicy +5% recruitable population boost, and if you want to place emphasis on tanks and speedy breakthroughs. Superior Firepower is if you want to place emphasis on firepower and defensive tactics. Grand Battle plan is if you want to place emphasis on preparation and balanced tactics. Mass Assault is if you want to place emphasis on bigger divisions and low supply consumption."
        },
        {
          "headline":"Understand division width-reducing traits and perks.",
          "description":"Assigning your divisions to a field marshal with the Offensive trait will reduce the combat width by 10%, so 20 width divisions should be 22 width and 40 width divisions should be 44 wide. If you go either way in Mass Assault Doctrine, you will get infantry combat width of -0.4, though it'll take 2100 days (300 weeks, 68 484/487 Julian or 68.9952565761 Gregorian months, 5 365/487 Julian or 5.74960471468 Gregorian years)."
        }
      ]
    },
    {
      "name":"First Generation Divisions",
      "steps":[
        {
          "headline":"Make your defensive, and offensive INF divisions.",
          "description":"Defensive INF division should be composed of 10/11 battalions of infantry, which will make a 20/22 width division. Offensive INF division should be either 7/8 INF and 2 ART or 6/7 INF, 2 ART and 1 LTD (HTD's aren't worth it). You can change 1 ART for 3 AT or 1 INF for 2 AT if you're facing hordes of tanks, trading not that much soft attack for loads of hard attack. You should put engineer, recon, artillery, and optionally, AT in your infantry divisions."
        },
        {
          "headline":"Make your motorized division for encirclements and for dealing with attacks quickly.",
          "description":"The ideal template will be 6/7 MOT, 2 LSPART and 1 LTD for speed, like a motorized version of leg infantry. You should put engineer, recon, maintenance, and optionally, AT support in your motorized divisions."
        },
        {
          "headline":"Make your armoured divisions for breakthroughs and for encirclements.",
          "description":"The ideal template will be 5 LT and 5/6 MOT, to make sure the organization is at least mediocre; otherwise, this division will not last for a day. If you want more hard attack, change 1 LT to a LTD. If you want more soft attack, change 1 LT to a LSPART. You should put engineer, recon, maintenance, and optionally, AT support in your armoured divisions."
        },
        {
          "headline":"Pay attention to these nuances for special forces:",
          "description":"For marines, you basically just change out the infantry to marines in an infantry division. For Paratroopers, you have 10/11 paratroopers, with engineer, recon, logistics, artillery and AT support in paratrooper divisions. If you really want to make OP special forces divisions that has really OP bonuses, then you can change the 6 marines in an INF division to 3 marines and 4 mountaineers, to get both OP bonuses in attacking rivers, movement and defence in mountains. As usual, put the same support as if you're making an infantry division."
        }
      ]
    },
    {
      "name":"Second Generation Divisions",
      "steps":[
        {
          "headline":"Upgrade your divisions to 40 width.",
          "description":"To compensate for the lower reinforce rate, add signal companies in your divisions. Trust the pros: you only need them for 40 width divisions, because small divisions have OP reinforce rates. Logistics is also good for 40 width divisions, but you don't need them for small divisions except paratroopers."
        },
        {
          "headline":"Upgrade your defensive INF divisions from 10/11 to 20/22 INF.",
          "description":"You don't need to add signal and logistics companies since they're only used for defending and garrisoning."
        },
        {
          "headline":"Double your offensive INF divisions to make sure they have 12/14 INF, 4 ART and 2 LTDs.",
          "description":"Replace the LTD's with MTD's. Put engineer, recon, ART, AT and signal as support."
        },
        {
          "headline":"Double your motorized division to 12/14 MOT, 4 LSPART and 2 LTDs.",
          "description":"Replace the Ls with Ms and the MOT with MECH. Put engineer, recon, ART, AT and maintenance as support."
        },
        {
          "headline":"Double your armoured division to 10/12 MOT and 10 LT.",
          "description":"Do the same as with the motorized divisions. Put the same support as with your motorized divisions."
        },
        {
          "headline":"Add on signal companies for your special forces.",
          "description":""
        }
      ]
    },
    {
      "name":"Third Generation Divisions",
      "steps":[
        {
          "headline":"Upgrade your defensive INF divisions, especially if you chose MA as your land doctrine.",
          "description":"For your defensive INF, you'll have 20/22/25/28 INF in your divisions. 28 INF is only if you have MA plus Offensive Doctrine field marshal. The actual combat width for 28 INF with MA and Offensive Doctrine field marshal is 40.32, but the combat width penalty is so small because you just exceed combat width by 0.64 (assuming you attack a province from 1 side). 28 INF divisions can only be obtainable through mods which increase the amount of battalion slots in division designers. You can actually slightly exceed the combat width, so don't worry. For your support equipment, change support ART to support RART."
        },
        {
          "headline":"Upgrade your offensive INF divisions, especially if you chose MA as your land doctrine.",
          "description":"In your INF divisions, you'll have 12/14/15/17 INF in your divisions. The combat width penalty will be pretty small, because you're only exceeding combat width by 0.96 (assuming you attack a province from 1 side). Change support ART to support RART."
        },
        {
          "headline":"Keep your MECH divisions the same.",
          "description":"However, if you have gone through a good portion of your doctrine (especially SF and MW), you can trade some MECH for MSPART and MTDs, and end up with a good amount of ORG."
        },
        {
          "headline":"Keep your armoured divisions the same.",
          "description":"However, if you have gone through a good portion of your doctrine (especially SF and MW), you can trade some MECH for MT, and end up with OKish ORG."
        },
        {
          "headline":"Understand that it's the same for marine divisions as well as infantry.",
          "description":"However, they don't benefit from the -0.4 width/battalion reduction. If you've gone in doctrines like SF and MW, you may be able to change a marine/mountaineer for a MTD and still have good organization."
        }
      ]
    },
    {
      "name":"Fourth Generation Divisions",
      "steps":[
        {
          "headline":"Upgrade your offensive INF divisions.",
          "description":"Assuming you've completed most of your doctrine, you should be able to trade more INF for MTDs, but you'll have to decide if you want more hard attack or ORG. Change mediums into moderns."
        },
        {
          "headline":"Upgrade your MECH divisions.",
          "description":"Doctrines like SF and MW increase ORG for MECH, so you should be able to change some MECH to MoTDs."
        },
        {
          "headline":"Upgrade your armoured divisions.",
          "description":"You may be able to trade more MECH for MoT and still end up with about 40-50 ORG."
        },
        {
          "headline":"Upgrade your SF divisions.",
          "description":"Now, you should be able to have 10 SF, 4 MoSPART and 4 MoTDs in your marine and mountaineer divisions."
        }
      ]
    },
    {
      "name":"Fifth Generation Divisions",
      "steps":[
        {
          "headline":"Understand that by this time, there will be very few tech to research (unless you installed mods like Road to 56).",
          "description":"You should have completed the whole doctrine by now, so you would have made your ultimate divisions by now. By now, you should have like hundreds of factories, so don't worry about production cost."
        },
        {
          "headline":"Upgrade your offensive INF divisions.",
          "description":"By now, the ORG of INF divisions are so high that you can basically have 10 INF, 4 MoSPART and 4 MoTDs in your divisions, and still have 50-60 ORG. You can produce tons of these OP space INF divisions to lash out on your few remaining enemies."
        },
        {
          "headline":"Upgrade your MECH divisions.",
          "description":"By now, the ORG of MECH is so OP that you can basically have 10 MECH, 4 MoSPART and 4 MoTDs in your divisions, and still have 50-60 ORG."
        },
        {
          "headline":"Upgrade your armoured divisions.",
          "description":"By now, the ORG of MECH is so OP that you can have 5 MECH and 15 MoT in your divisions and still have 40-50 ORG."
        }
      ]
    }
  ],
  "text":" Understanding Concepts Understand the generations of divisions, from early to late war, in HOI4. They will be shown in the bullet points below. They will be three years apart from each other, so you'll be able to have enough time to upgrade and produce equipment. First Generation, aka Pre War: These are the divisions you should be able to get in the start of the game, assuming you chose a 1936 start. Second Generation, aka Early War: These are the divisions you should be able to get by 1939 (it'll be the first generation if you chose a 1939 start, minus 1 for each generation). Third Generation, aka Mid War: These are the divisions you should be able to get by the time it's 1942. Fourth Generation, aka Late War: These are the divisions you should be able to get by the time it's 1945. Fifth Generation, aka Post War: These are the divisions you should be able to get by the time the end screen is looming, at around 1948 (but it can be delayed if there is a war which involves 3 or more major powers). Realize the limitations of XP, especially in the early game. In 1936, the only ways that you can get army XP is by getting involved in the Second Italo-Abyssinian War and the Spanish Civil War. Various civil wars and wars can also start, like Bolivia declaring war on Paraguay (which often happens). You can also train new divisions and put them on exercises to get them to regular. In 1937, a new war will be opened, which is the Second Sino-Japanese War. World tensions may go over 25% percent (which is the minimum world tension for Allies to go to war with Axis). In 1939, WW2 will start, resulting in a humongous source of all types of XP (one faction will be defeated). Just make sure your divisions and equipment don't run low, though. Potentially, if only one faction has been utterly destroyed by the second world war, a third world war will start, somewhere in 1946-1947. This is a more humongous source of all types of XP if you're lucky enough to get it. Understand the differences between land doctrines. Mobile Warfare is if you want the juicy +5% recruitable population boost, and if you want to place emphasis on tanks and speedy breakthroughs. Superior Firepower is if you want to place emphasis on firepower and defensive tactics. Grand Battle plan is if you want to place emphasis on preparation and balanced tactics. Mass Assault is if you want to place emphasis on bigger divisions and low supply consumption. Understand division width-reducing traits and perks. Assigning your divisions to a field marshal with the Offensive trait will reduce the combat width by 10%, so 20 width divisions should be 22 width and 40 width divisions should be 44 wide. If you go either way in Mass Assault Doctrine, you will get infantry combat width of -0.4, though it'll take 2100 days (300 weeks, 68 484/487 Julian or 68.9952565761 Gregorian months, 5 365/487 Julian or 5.74960471468 Gregorian years). First Generation Divisions Make your defensive, and offensive INF divisions. Defensive INF division should be composed of 10/11 battalions of infantry, which will make a 20/22 width division. Offensive INF division should be either 7/8 INF and 2 ART or 6/7 INF, 2 ART and 1 LTD (HTD's aren't worth it). You can change 1 ART for 3 AT or 1 INF for 2 AT if you're facing hordes of tanks, trading not that much soft attack for loads of hard attack. You should put engineer, recon, artillery, and optionally, AT in your infantry divisions. Make your motorized division for encirclements and for dealing with attacks quickly. The ideal template will be 6/7 MOT, 2 LSPART and 1 LTD for speed, like a motorized version of leg infantry. You should put engineer, recon, maintenance, and optionally, AT support in your motorized divisions. Make your armoured divisions for breakthroughs and for encirclements. The ideal template will be 5 LT and 5/6 MOT, to make sure the organization is at least mediocre; otherwise, this division will not last for a day. If you want more hard attack, change 1 LT to a LTD. If you want more soft attack, change 1 LT to a LSPART. You should put engineer, recon, maintenance, and optionally, AT support in your armoured divisions. Pay attention to these nuances for special forces: For marines, you basically just change out the infantry to marines in an infantry division. For Paratroopers, you have 10/11 paratroopers, with engineer, recon, logistics, artillery and AT support in paratrooper divisions. If you really want to make OP special forces divisions that has really OP bonuses, then you can change the 6 marines in an INF division to 3 marines and 4 mountaineers, to get both OP bonuses in attacking rivers, movement and defence in mountains. As usual, put the same support as if you're making an infantry division. Second Generation Divisions Upgrade your divisions to 40 width. To compensate for the lower reinforce rate, add signal companies in your divisions. Trust the pros: you only need them for 40 width divisions, because small divisions have OP reinforce rates. Logistics is also good for 40 width divisions, but you don't need them for small divisions except paratroopers. Upgrade your defensive INF divisions from 10/11 to 20/22 INF. You don't need to add signal and logistics companies since they're only used for defending and garrisoning. Double your offensive INF divisions to make sure they have 12/14 INF, 4 ART and 2 LTDs. Replace the LTD's with MTD's. Put engineer, recon, ART, AT and signal as support. Double your motorized division to 12/14 MOT, 4 LSPART and 2 LTDs. Replace the Ls with Ms and the MOT with MECH. Put engineer, recon, ART, AT and maintenance as support. Double your armoured division to 10/12 MOT and 10 LT. Do the same as with the motorized divisions. Put the same support as with your motorized divisions. Add on signal companies for your special forces.  Third Generation Divisions Upgrade your defensive INF divisions, especially if you chose MA as your land doctrine. For your defensive INF, you'll have 20/22/25/28 INF in your divisions. 28 INF is only if you have MA plus Offensive Doctrine field marshal. The actual combat width for 28 INF with MA and Offensive Doctrine field marshal is 40.32, but the combat width penalty is so small because you just exceed combat width by 0.64 (assuming you attack a province from 1 side). 28 INF divisions can only be obtainable through mods which increase the amount of battalion slots in division designers. You can actually slightly exceed the combat width, so don't worry. For your support equipment, change support ART to support RART. Upgrade your offensive INF divisions, especially if you chose MA as your land doctrine. In your INF divisions, you'll have 12/14/15/17 INF in your divisions. The combat width penalty will be pretty small, because you're only exceeding combat width by 0.96 (assuming you attack a province from 1 side). Change support ART to support RART. Keep your MECH divisions the same. However, if you have gone through a good portion of your doctrine (especially SF and MW), you can trade some MECH for MSPART and MTDs, and end up with a good amount of ORG. Keep your armoured divisions the same. However, if you have gone through a good portion of your doctrine (especially SF and MW), you can trade some MECH for MT, and end up with OKish ORG. Understand that it's the same for marine divisions as well as infantry. However, they don't benefit from the -0.4 width/battalion reduction. If you've gone in doctrines like SF and MW, you may be able to change a marine/mountaineer for a MTD and still have good organization. Fourth Generation Divisions Upgrade your offensive INF divisions. Assuming you've completed most of your doctrine, you should be able to trade more INF for MTDs, but you'll have to decide if you want more hard attack or ORG. Change mediums into moderns. Upgrade your MECH divisions. Doctrines like SF and MW increase ORG for MECH, so you should be able to change some MECH to MoTDs. Upgrade your armoured divisions. You may be able to trade more MECH for MoT and still end up with about 40-50 ORG. Upgrade your SF divisions. Now, you should be able to have 10 SF, 4 MoSPART and 4 MoTDs in your marine and mountaineer divisions. Fifth Generation Divisions Understand that by this time, there will be very few tech to research (unless you installed mods like Road to 56). You should have completed the whole doctrine by now, so you would have made your ultimate divisions by now. By now, you should have like hundreds of factories, so don't worry about production cost. Upgrade your offensive INF divisions. By now, the ORG of INF divisions are so high that you can basically have 10 INF, 4 MoSPART and 4 MoTDs in your divisions, and still have 50-60 ORG. You can produce tons of these OP space INF divisions to lash out on your few remaining enemies. Upgrade your MECH divisions. By now, the ORG of MECH is so OP that you can basically have 10 MECH, 4 MoSPART and 4 MoTDs in your divisions, and still have 50-60 ORG. Upgrade your armoured divisions. By now, the ORG of MECH is so OP that you can have 5 MECH and 15 MoT in your divisions and still have 40-50 ORG.",
  "tyn_model":[
    "divisions",
    "marines",
    "tanks",
    "engineer, recon",
    "xp",
    "artillery",
    "at",
    "at support",
    "special forces divisions",
    "mountaineers",
    "signal companies",
    "ma",
    "infantry",
    "marine"
  ],
  "tyn_section":[

  ]
}