{
  "title":"How to Eat Natto",
  "url":"https://www.wikihow.com/Eat-Natto",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Japanese Dishes"
  ],
  "methods":[
    {
      "name":"Preparing the Natto",
      "steps":[
        {
          "headline":"Purchase a package of natto at an Asian supermarket near you.",
          "description":"Natto is relatively inexpensive to buy, and can be purchased for as little as $0.89 USD (0.77 Euro) or as much as $3.00 USD (2.58 Euro). It is typically offered in small, round single packs, or bundled into 3 medium, square packages. Natto is a refrigerated item and can spoil. Make sure to check the expiration date before purchasing."
        },
        {
          "headline":"Choose between a large, medium, and small soybean size.",
          "description":"The different types of natto are usually distinguished by the soybeans’ size, variety, and processing method. Recipes including natto do not typically specify the soybean size, so pick one that you think you will enjoy eating the most. Large soybeans will give you a bigger bite of the fermented flavor and sticky texture, while smaller soybeans can mix more subtly with rice and other dishes. The packaging may not indicate the bean size directly, but the small bean is the one that is most commercially used. If you purchase a package of natto, it will most likely use the small to medium bean variety. The larger beans are traditionally black or red soybeans. If the packaging mentions using either of those, then know that the soybean size will be large. Natto is also offered as a spread. Hikiwari natto involves pulverizing the soybeans prior to fermenting them. If you are considering using the natto as a spread, pick up some hikiwari natto instead of the traditional natto."
        },
        {
          "headline":"Take off the packing lid, and remove the two sauce packets.",
          "description":"There will be a small arrow on one of the corners of the lid to indicate where to open it. Pre-made natto containers usually come with a small packet of tare, or sweetened soy sauce, and a spicy Japanese mustard that you can use to mix with your natto. You are not obligated to use these sauces, but both will complement the natto nicely. Make sure to keep the lid of the packaging nearby as it will give you a place to rest the sticky packaging film later on."
        },
        {
          "headline":"Tear off the clear film from the packaging to expose the natto.",
          "description":"Natto is extremely gooey, so if you aren’t careful with taking off the clear film, you can wind up with sticky hands really quickly. Common methods of removing the film are by pinching the center of the film, or by carefully sliding the film off. Pinch the center of the clear film, and slowly lift it away from the natto. As you lift the film, move your hand in circles over the container. This will help gather the sticky strings from the natto that have stuck to the film. Once the strings are contained, rest the clear film on the lid of the packaging. This method of removing the packaging is often referred to as the tornado method because of the circling motion you make with your hand. For the slide method, grab an edge of the clear film, and slide it until it overhangs one side of the container. Put the lid back on the container, and pull the film out through the seam."
        },
        {
          "headline":"Use a spoon or chopsticks to thoroughly mix the natto.",
          "description":"The natto will be hard to stir at first, but will eventually soften and loosen. Don't be alarmed if the mixture begins to turn white or develop bubbles, as this is normal for the natto as it aerates. Stop mixing the natto when you have reached a consistency you are satisfied with. Most recommendations are to stir the natto in one direction to avoid spilling it, and to stir it for at least 50 turns or 60 seconds."
        }
      ]
    },
    {
      "name":"Seasoning the Natto",
      "steps":[
        {
          "headline":"Mix in the packets of soy sauce and mustard for a simple flavoring.",
          "description":"You can squeeze in as much or as little of both sauces as you want. Just make sure to thoroughly mix in the sauces before eating it. Try adding the sauces before your initial stirring of the natto. Some people claim that the natto is more flavorful and less slimy if you add the soy sauce and mustard, and then only thoroughly stir the natto once. Instead of the sauce packets, you can add some of your favorite sauces as well. Experiment by adding sriracha to give the natto some heat, or add teriyaki sauce to make the natto tangy and sweet."
        },
        {
          "headline":"Use vinegar to reduce the bold smell and taste of the natto.",
          "description":"Just adding 1–2 teaspoons (4.9–9.9 mL) of vinegar to the natto will help round out the smell and flavors. Rice vinegar will mellow the natto, but won’t add any noticeable flavors. Balsamic vinegar will pair nicely with the natto, and add extra flavor to it. A few drops of sesame oil will also add flavor to the natto, and reduce the smell."
        },
        {
          "headline":"Add diced green onions and eggs for a traditional Japanese taste.",
          "description":"While it is custom to eat a raw egg or a raw egg yolk with the natto, you can recreate a similar experience with a poached, over-easy, or sunny-side up egg instead. The gooeyness of the egg yolk and the crunch from the green onions will mellow and round out the unique flavor of the natto. Other standard toppings that pair nicely with the green onions and eggs include sesame seeds for an added crunch; katsuobushi or bonito flakes, which is dried, fermented, and smoked skipjack tuna; and kimchi, which is Napa cabbage or Korean radishes seasoned with chili powder, scallions, garlic, and ginger."
        },
        {
          "headline":"Heat the natto to soften the texture and bring out the natural flavors.",
          "description":"If you don’t enjoy the texture of the cold natto, try eating it warm. Rest the lid on the container, and place it in the microwave for 20 seconds, and then stir the mixture to redistribute the heat. Hot or warm natto will have a stronger smell, but some people have found that the heat also enhances the flavors of the fermented soybeans. Make sure to remove the clear film before warming the natto in the microwave. The thin plastic of the film may melt when heated."
        }
      ]
    },
    {
      "name":"Pairing with Other Foods",
      "steps":[
        {
          "headline":"Pair natto with plain white rice for a simple traditional Japanese dish.",
          "description":"You can either eat the natto and white rice plain, or you can add additional seasonings and toppings. If you choose to season the natto, do so before adding it to the rice to make mixing the flavors easier. Consider adding the complimentary packets of soy sauce or mustard, or adding chopped green onion, and a cooked egg for a quick breakfast dish. Instead of white rice, add natto to your favorite pasta shape to create a mixed noodle salad. Mix in some chopped green onions and bell peppers to round out the flavors. Make a stir-fry using fried brown rice and natto. Add chunks of roasted pork, chopped carrots, and even scrambled eggs."
        },
        {
          "headline":"Mix up a natto salad to create a filling lunch.",
          "description":"Pick bold flavors that will either contrast the fermented taste like perilla leaves, which are of the mint variety and have notes of anise or licorice, or pick subtle flavors as found in sweet, earthy root vegetables. How much of an ingredient you add is completely up to your taste and texture preferences. For hearty, tangy salad, mix ingredients like wasabi, your favorite shredded cheese like cheddar or pepper-jack, mayonnaise, nori (seaweed), pickled plums, and perilla leaves. Season the salad with some black pepper to taste, and dice up some cooked tuna for added protein. For a light and refreshing taste, marinate your prepared natto with shredded root vegetables like carrots, beets, kelp, and daikon, which is a mild-flavored winter radish; seaweed soaked in rice vinegar; mirin, which is a tangy, sweet rice wine; and sesame oil for 30 minutes. Before serving, give the salad a final stir to redistribute the stickiness of the natto, and enjoy."
        },
        {
          "headline":"Make natto toast if you are looking for a quick snack.",
          "description":"This is a simple snack that can be eaten plain, or dressed up with other toppings. And if you throw on some cheese, and a second slice of toasted bread, you can even turn it into a grilled cheese sandwich. Toast up your favorite type of bread like a classic white bread or a hearty whole grain for an extra crunch. Thick slices of bread work better than thin ones. The natto and any other toppings you add can easily oversaturate or become too heavy for thinner pieces of bread. Spoon your desired amount of natto onto the bread. This is a good time to use the hikiwari natto that is spreadable, but you can just as easily cover the toast with normal natto as well. For added sweetness or texture, drizzle on some honey, or sprinkle cheese on the toast while it is still hot."
        },
        {
          "headline":"Cook the natto on the stovetop with eggs for an omelet packed with protein.",
          "description":"A standard package of natto can be cooked with 1 to 3 eggs depending on the ratio you want. Then get creative and add more complementary ingredients like cheese, spinach, or green onions, either into the egg mixture or on top of the cooked omelet."
        },
        {
          "headline":"Top your favorite meat with natto for added texture.",
          "description":"Natto doesn’t just go well with eggs; it actually nicely complements just about any cut of meat. Try pairing the natto with slices of grilled chicken, or chunks of pork that is seasoned with sesame oil and ginger. If you are feeling adventurous, mix some barbeque sauce in with the natto, and spoon the mixture onto slices of seared steak. The warmth of the meat will melt the natto mixture into a thin glaze. As a side dish to cooked salmon, mix the natto with kale, tamari, and lemon juice. These neutral flavors will meld together, and the lemon juice will help cut the bold taste of the natto."
        }
      ]
    }
  ],
  "text":" Preparing the Natto Purchase a package of natto at an Asian supermarket near you. Natto is relatively inexpensive to buy, and can be purchased for as little as $0.89 USD (0.77 Euro) or as much as $3.00 USD (2.58 Euro). It is typically offered in small, round single packs, or bundled into 3 medium, square packages. Natto is a refrigerated item and can spoil. Make sure to check the expiration date before purchasing. Choose between a large, medium, and small soybean size. The different types of natto are usually distinguished by the soybeans’ size, variety, and processing method. Recipes including natto do not typically specify the soybean size, so pick one that you think you will enjoy eating the most. Large soybeans will give you a bigger bite of the fermented flavor and sticky texture, while smaller soybeans can mix more subtly with rice and other dishes. The packaging may not indicate the bean size directly, but the small bean is the one that is most commercially used. If you purchase a package of natto, it will most likely use the small to medium bean variety. The larger beans are traditionally black or red soybeans. If the packaging mentions using either of those, then know that the soybean size will be large. Natto is also offered as a spread. Hikiwari natto involves pulverizing the soybeans prior to fermenting them. If you are considering using the natto as a spread, pick up some hikiwari natto instead of the traditional natto. Take off the packing lid, and remove the two sauce packets. There will be a small arrow on one of the corners of the lid to indicate where to open it. Pre-made natto containers usually come with a small packet of tare, or sweetened soy sauce, and a spicy Japanese mustard that you can use to mix with your natto. You are not obligated to use these sauces, but both will complement the natto nicely. Make sure to keep the lid of the packaging nearby as it will give you a place to rest the sticky packaging film later on. Tear off the clear film from the packaging to expose the natto. Natto is extremely gooey, so if you aren’t careful with taking off the clear film, you can wind up with sticky hands really quickly. Common methods of removing the film are by pinching the center of the film, or by carefully sliding the film off. Pinch the center of the clear film, and slowly lift it away from the natto. As you lift the film, move your hand in circles over the container. This will help gather the sticky strings from the natto that have stuck to the film. Once the strings are contained, rest the clear film on the lid of the packaging. This method of removing the packaging is often referred to as the tornado method because of the circling motion you make with your hand. For the slide method, grab an edge of the clear film, and slide it until it overhangs one side of the container. Put the lid back on the container, and pull the film out through the seam. Use a spoon or chopsticks to thoroughly mix the natto. The natto will be hard to stir at first, but will eventually soften and loosen. Don't be alarmed if the mixture begins to turn white or develop bubbles, as this is normal for the natto as it aerates. Stop mixing the natto when you have reached a consistency you are satisfied with. Most recommendations are to stir the natto in one direction to avoid spilling it, and to stir it for at least 50 turns or 60 seconds. Seasoning the Natto Mix in the packets of soy sauce and mustard for a simple flavoring. You can squeeze in as much or as little of both sauces as you want. Just make sure to thoroughly mix in the sauces before eating it. Try adding the sauces before your initial stirring of the natto. Some people claim that the natto is more flavorful and less slimy if you add the soy sauce and mustard, and then only thoroughly stir the natto once. Instead of the sauce packets, you can add some of your favorite sauces as well. Experiment by adding sriracha to give the natto some heat, or add teriyaki sauce to make the natto tangy and sweet. Use vinegar to reduce the bold smell and taste of the natto. Just adding 1–2 teaspoons (4.9–9.9 mL) of vinegar to the natto will help round out the smell and flavors. Rice vinegar will mellow the natto, but won’t add any noticeable flavors. Balsamic vinegar will pair nicely with the natto, and add extra flavor to it. A few drops of sesame oil will also add flavor to the natto, and reduce the smell. Add diced green onions and eggs for a traditional Japanese taste. While it is custom to eat a raw egg or a raw egg yolk with the natto, you can recreate a similar experience with a poached, over-easy, or sunny-side up egg instead. The gooeyness of the egg yolk and the crunch from the green onions will mellow and round out the unique flavor of the natto. Other standard toppings that pair nicely with the green onions and eggs include sesame seeds for an added crunch; katsuobushi or bonito flakes, which is dried, fermented, and smoked skipjack tuna; and kimchi, which is Napa cabbage or Korean radishes seasoned with chili powder, scallions, garlic, and ginger. Heat the natto to soften the texture and bring out the natural flavors. If you don’t enjoy the texture of the cold natto, try eating it warm. Rest the lid on the container, and place it in the microwave for 20 seconds, and then stir the mixture to redistribute the heat. Hot or warm natto will have a stronger smell, but some people have found that the heat also enhances the flavors of the fermented soybeans. Make sure to remove the clear film before warming the natto in the microwave. The thin plastic of the film may melt when heated. Pairing with Other Foods Pair natto with plain white rice for a simple traditional Japanese dish. You can either eat the natto and white rice plain, or you can add additional seasonings and toppings. If you choose to season the natto, do so before adding it to the rice to make mixing the flavors easier. Consider adding the complimentary packets of soy sauce or mustard, or adding chopped green onion, and a cooked egg for a quick breakfast dish. Instead of white rice, add natto to your favorite pasta shape to create a mixed noodle salad. Mix in some chopped green onions and bell peppers to round out the flavors. Make a stir-fry using fried brown rice and natto. Add chunks of roasted pork, chopped carrots, and even scrambled eggs. Mix up a natto salad to create a filling lunch. Pick bold flavors that will either contrast the fermented taste like perilla leaves, which are of the mint variety and have notes of anise or licorice, or pick subtle flavors as found in sweet, earthy root vegetables. How much of an ingredient you add is completely up to your taste and texture preferences. For hearty, tangy salad, mix ingredients like wasabi, your favorite shredded cheese like cheddar or pepper-jack, mayonnaise, nori (seaweed), pickled plums, and perilla leaves. Season the salad with some black pepper to taste, and dice up some cooked tuna for added protein. For a light and refreshing taste, marinate your prepared natto with shredded root vegetables like carrots, beets, kelp, and daikon, which is a mild-flavored winter radish; seaweed soaked in rice vinegar; mirin, which is a tangy, sweet rice wine; and sesame oil for 30 minutes. Before serving, give the salad a final stir to redistribute the stickiness of the natto, and enjoy. Make natto toast if you are looking for a quick snack. This is a simple snack that can be eaten plain, or dressed up with other toppings. And if you throw on some cheese, and a second slice of toasted bread, you can even turn it into a grilled cheese sandwich. Toast up your favorite type of bread like a classic white bread or a hearty whole grain for an extra crunch. Thick slices of bread work better than thin ones. The natto and any other toppings you add can easily oversaturate or become too heavy for thinner pieces of bread. Spoon your desired amount of natto onto the bread. This is a good time to use the hikiwari natto that is spreadable, but you can just as easily cover the toast with normal natto as well. For added sweetness or texture, drizzle on some honey, or sprinkle cheese on the toast while it is still hot. Cook the natto on the stovetop with eggs for an omelet packed with protein. A standard package of natto can be cooked with 1 to 3 eggs depending on the ratio you want. Then get creative and add more complementary ingredients like cheese, spinach, or green onions, either into the egg mixture or on top of the cooked omelet. Top your favorite meat with natto for added texture. Natto doesn’t just go well with eggs; it actually nicely complements just about any cut of meat. Try pairing the natto with slices of grilled chicken, or chunks of pork that is seasoned with sesame oil and ginger. If you are feeling adventurous, mix some barbeque sauce in with the natto, and spoon the mixture onto slices of seared steak. The warmth of the meat will melt the natto mixture into a thin glaze. As a side dish to cooked salmon, mix the natto with kale, tamari, and lemon juice. These neutral flavors will meld together, and the lemon juice will help cut the bold taste of the natto.",
  "tyn_model":[
    "natto",
    "green onions",
    "eggs",
    "soybeans",
    "soy sauce",
    "mustard",
    "rice",
    "sesame oil",
    "clear film",
    "container",
    "vinegar",
    "rice vinegar",
    "ginger",
    "microwave",
    "white rice",
    "carrots",
    "perilla leaves",
    "lemon",
    "’ size",
    "spoon",
    "sriracha",
    "teriyaki sauce",
    "balsamic vinegar",
    "bonito flakes",
    "chili powder",
    "scallions",
    "garlic",
    "green onion",
    "cooked egg",
    "pasta",
    "mixed noodle salad",
    "bell peppers",
    "fried brown rice",
    "scrambled eggs",
    "natto salad",
    "pepper-jack",
    "mayonnaise",
    "pickled plums",
    "black pepper",
    "tuna",
    "beets",
    "daikon",
    "seaweed",
    "mirin",
    "natto toast",
    "toasted bread",
    "grilled cheese sandwich",
    "honey",
    "spinach",
    "egg",
    "barbeque sauce",
    "salmon",
    "kale",
    "tamari"
  ],
  "tyn_section":[

  ]
}