{
  "title":"How to Make Pumpkin Craisin Bread",
  "url":"https://www.wikihow.com/Make-Pumpkin-Craisin-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Vegetable Bread"
  ],
  "steps":[
    {
      "headline":"Preheat your oven to 350˚F.",
      "description":""
    },
    {
      "headline":"Using either butter or a no-stick spray, grease two 9 x 5 inch bread pans.",
      "description":""
    },
    {
      "headline":"Coat the sides of the pans with flour.",
      "description":""
    },
    {
      "headline":"Pour the flour, pumpkin pie spice, salt, and baking soda into a large bowl.",
      "description":"Set aside for later use."
    },
    {
      "headline":"Take the eggs, sugar, pumpkin, vegetable oil, and orange juice and put them into a mixing bowl.",
      "description":"Using an electric or hand mixer, beat the mixture until it is just blended (this should take between two and three minutes)."
    },
    {
      "headline":"Pour the ingredients from step 4 into the mixing bowl and stir until the two mixtures are evenly combined.",
      "description":""
    },
    {
      "headline":"Fold in the cranberries.",
      "description":""
    },
    {
      "headline":"Put in the oven and bake for an hour to an hour and five minutes, or until a toothpick stuck in the center comes out clean.",
      "description":""
    },
    {
      "headline":"Cool for at least ten minutes before eating.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat your oven to 350˚F.  Using either butter or a no-stick spray, grease two 9 x 5 inch bread pans.  Coat the sides of the pans with flour.  Pour the flour, pumpkin pie spice, salt, and baking soda into a large bowl. Set aside for later use. Take the eggs, sugar, pumpkin, vegetable oil, and orange juice and put them into a mixing bowl. Using an electric or hand mixer, beat the mixture until it is just blended (this should take between two and three minutes). Pour the ingredients from step 4 into the mixing bowl and stir until the two mixtures are evenly combined.  Fold in the cranberries.  Put in the oven and bake for an hour to an hour and five minutes, or until a toothpick stuck in the center comes out clean.  Cool for at least ten minutes before eating.  Finished. ",
  "tyn_model":[
    "oven",
    "flour",
    "mixing bowl",
    "butter",
    "no-stick spray",
    "bread pans",
    "pumpkin pie spice",
    "salt",
    "baking soda",
    "large bowl",
    "eggs",
    "sugar",
    "pumpkin",
    "vegetable oil",
    "orange juice",
    "electric or hand mixer",
    "cranberries"
  ],
  "tyn_section":[

  ]
}