{
  "title":"How to Eat Zucchini",
  "url":"https://www.wikihow.com/Eat-Zucchini",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Squash"
  ],
  "methods":[
    {
      "name":"Eating Zucchini Raw",
      "steps":[
        {
          "headline":"Snack on zucchini slices.",
          "description":"You don't need to cook zucchini before you eat it! Chop up your zucchini to make an easy, convenient snack. If you don't like the taste of plain zucchini, you can dip your slices in hummus for more flavor. You don't need to peel zucchini. It's okay to eat the skin, which is packed full of nutrients. However, don't eat the ends of the zucchini."
        },
        {
          "headline":"Add chopped zucchini to your salad or wrap.",
          "description":"Use a chopping knife to cut your zucchini into slices or cubes. Top your salad with the zucchini pieces to add a little extra nutrition and flavor. Similarly, you can add sliced or chopped zucchini to salad wraps as a convenient filling. Discard the ends of the zucchini."
        },
        {
          "headline":"Make a raw zucchini salad.",
          "description":"Slice off the ends of 2 zucchini. Next, use a potato peeler, mandoline, or cheese grater to shave the zucchini into slim strips. Put the strips in a bowl and add a handful of parsley. Add the juice from 1 lemon and 1 lime to the bowl. Drizzle olive oil over the zucchini, then season it with salt and pepper. You'll need the following ingredients to make your salad: 2 zucchini, 1 handful of parsley, 1 lemon, 1 lime, olive oil, salt, and pepper."
        },
        {
          "headline":"Top your pizza with zucchini.",
          "description":"You can add raw zucchini on top of your pizza. If you prefer your zucchini cooked, add slices of zucchini onto your pizza before you cook it. Bake the pizza according to your recipe."
        }
      ]
    },
    {
      "name":"Steaming or Boiling Zucchini",
      "steps":[
        {
          "headline":"Cut your zucchini into ⁄4 to ⁄2 in (0.64 to 1.27 cm) slices.",
          "description":"Hold your chopping knife perpendicular to the zucchini, then make small chops down the length of it. Your slices should be relatively even so they cook thoroughly. Discard the ends of your zucchini."
        },
        {
          "headline":"Place the zucchini in a metal steaming basket.",
          "description":"The zucchini can be in a pile inside the basket. It will still cook thoroughly. If you don't have a steaming basket, you can add the zucchini directly to the water and boil it. Boiling the zucchini will create a softer texture."
        },
        {
          "headline":"Fill your pot with just enough water to reach the bottom of the basket.",
          "description":"You only need about ⁄2 to 1 inch (1.3 to 2.5 cm) of water in your pot. The zucchini will not be covered in water. Instead, the steam from the boiling water will cook the zucchini. If you're boiling the zucchini, fill about ⅔ of the pot with fresh water. Then, add salt to the water."
        },
        {
          "headline":"Boil your water, place the basket in it, and put on the cover.",
          "description":"The cover will trap in the steam to help cook the zucchini. Use the handle on the basket to maneuver it so you don't get burned. If you're boiling the zucchini, add it directly into the water once it's boiling."
        },
        {
          "headline":"Cook the zucchini for 3-6 minutes, until the zucchini is tender.",
          "description":"Set a timer or watch the clock to ensure you don't overcook the zucchini. You can check that it's ready by spearing a piece of zucchini with a fork. It should be soft but not soggy."
        },
        {
          "headline":"Drain the zucchini, if you boiled it.",
          "description":"Pour the zucchini into a colander to drain away the excess water. Then, discard the water. You don't need to drain steamed zucchini, as it wasn't in water."
        },
        {
          "headline":"Add salt and pepper to taste.",
          "description":"After you plate the zucchini, sprinkle salt and pepper over it. You only need a little bit to enhance the flavor of the zucchini. Start with a little seasoning and add more if desired."
        },
        {
          "headline":"Add zucchini to your favorite vegetable soup, as another option.",
          "description":"Add your zucchini to a broth, along with your other soup ingredients. Bring your soup to a boil over high heat, then reduce the heat to medium-low. Simmer your soup for about 40 minutes or until the veggies are tender."
        }
      ]
    },
    {
      "name":"Baking Zucchini",
      "steps":[
        {
          "headline":"Cut the zucchini into ⁄8 to ⁄4 inch (0.32 to 0.64 cm) slices or cubes.",
          "description":"Hold your chopping knife perpendicular to the zucchini. Then, make slices into the zucchini, working your way down its length. Discard the ends of the zucchini. As an alternative, you can cut off the ends, then cut your zucchini once lengthwise. This will create two long zucchini halves."
        },
        {
          "headline":"Coat the zucchini in olive oil or melted butter.",
          "description":"Spray the oil onto the zucchini or toss the zucchini in the oil or butter. Every side of the zucchini should have oil on it before you bake it."
        },
        {
          "headline":"Sprinkle seasoning onto your zucchini, to taste.",
          "description":"You can cook the zucchini without seasoning, but adding a little extra flavor can create a delicious dish! Simply sprinkle on your seasoning after you coat the zucchini in oil. Here are some seasoning ideas:\nUse salt and pepper. Add oregano or Italian seasoning for more flavor. Use fresh thyme or dill instead, as another option. Opt for red pepper for added zest."
        },
        {
          "headline":"Place the zucchini on a baking sheet in a single layer.",
          "description":"Use your fingers or a spoon to spread out the zucchini. It needs to be in a single layer so it will cook evenly. Use a nonstick pan or spray your pan with nonstick spray."
        },
        {
          "headline":"Sprinkle Parmesan cheese onto your zucchini for added flavor.",
          "description":"Use your fingers or a spoon to lightly distribute the Parmesan cheese onto the zucchini. Make several passes over the zucchini, adding a little cheese at a time until you've reached your desired amount. You can use grated or Parmesan cheese. Parmesan cheese can give your zucchini a rich, savory taste."
        },
        {
          "headline":"Bake the zucchini at 350 °F (177 °C) for 35-40 minutes.",
          "description":"Place your baking sheet on the center rack of your oven. Then, set a timer or watch the clock to make sure you don't overcook your zucchini. Use an oven mitt to remove the pan from the oven. Let your zucchini cool for about 2-3 minutes before you serve it."
        },
        {
          "headline":"Mix zucchini into baked goods, as an alternative.",
          "description":"You can mix zucchini into bread or muffins to increase your vegetable consumption. Shred your zucchini into small pieces using a grater or potato peeler. Then, press the zucchini with a clean towel to remove excess liquids. Stir the zucchini into the wet ingredients, like butter, oil, or eggs, in your recipe before combining it with the dry ingredients. Patting the zucchini dry helps keep your baked goods from being soggy. You can find a recipe for zucchini bread or muffins, or you can simply add the zucchini to a traditional recipe."
        }
      ]
    },
    {
      "name":"Sauteing Zucchini",
      "steps":[
        {
          "headline":"Slice your zucchini into thin coins.",
          "description":"Hold a sharp chopping knife perpendicular to your zucchini. Start about ⁄8 inch (0.32 cm) from the end of your zucchini. Cut through the zucchini, then work your way down the length of your zucchini. Discard the ends of your zucchini."
        },
        {
          "headline":"Heat about 1 tablespoon (15 mL) of olive oil over medium-high heat.",
          "description":"Pour the oil into the pan before you turn on the burner. Wait about 30 seconds for the oil to get warm before you add the zucchini to the pan."
        },
        {
          "headline":"Add your zucchini to the pan and saute it for about 5 minutes.",
          "description":"Stir the zucchini to coat it in the olive oil. Make sure the oil and the zucchini are evenly distributed across the pan. Continue stirring the zucchini so it cooks evenly. Set a timer or watch the clock to make sure you don't overcook it. Your zucchini will be soft when it's ready. The color of the skin will also deepen."
        },
        {
          "headline":"Season the zucchini to taste.",
          "description":"Sprinkle a little seasoning onto the zucchini while it's still hot. You can season it in the pan or on your plate. Here are some ways to season your zucchini:\nSprinkle with salt and pepper. Add Parmesan on top of the salt and pepper. Spritz the zucchini with lemon juice, then sprinkle on dill weed, cilantro, and chopped scallions."
        },
        {
          "headline":"Stir zucchini into your stir fry for another option.",
          "description":"Use zucchini along with other vegetables to make a savory, healthy stir fry. Simply heat oil on the stove, then saute your vegetables over medium-high heat. Serve your stir fry as a side dish or add it to a protein to make an entree."
        }
      ]
    },
    {
      "name":"Grilling Zucchini",
      "steps":[
        {
          "headline":"Cut off the ends of your zucchini and slice it lengthwise or into coins.",
          "description":"Hold the zucchini with one hand while you cut with the other, using a sharp chopping knife. To cut lengthwise, slice down the zucchini from end to end. To make coins, position your knife perpendicular to the zucchini, then make small slices until your entire zucchini is cut into round pieces. Discard the ends of the zucchini in your trash or compost. For grilling zucchini, it's best to cut lengthwise for easy grilling."
        },
        {
          "headline":"Apply your oil and seasoning.",
          "description":"Oils like olive oil are necessary for grilling. Coat the zucchini in the oil using a brush or by tossing in a bowl, then sprinkle on your seasoning. Here are some delicious ways to season your zucchini:\nCombine 2 tablespoons (30 mL) melted butter, 1 tablespoon (15 mL) olive oil, and 1 tablespoon (15 mL) of lemon juice. Coat the zucchini in the mixture, then sprinkle on powdered garlic. Mix 2 teaspoons (9.9 mL) olive oil and 2 tablespoons (30 mL) of balsamic vinaigrette. Coat your zucchini in the mixture, then sprinkle Italian seasoning, garlic powder, and a pinch of salt to taste. Coat your zucchini with olive oil, then sprinkle on garlic powder, red pepper flakes, and lemon zest. Lightly season with salt and pepper, to taste."
        },
        {
          "headline":"Heat your grill or pan over medium-high heat.",
          "description":"Get the pan warm before you put the zucchini on to cook. You can check to see it's warm by flicking water onto the grill or pan. The water should sizzle when it hits the heat. You can use a barbeque, stove-top grill, countertop grill, or grilling pan."
        },
        {
          "headline":"Grill each side of your zucchini for 2 minutes or until golden brown.",
          "description":"Lay the zucchini onto the grill or pan. Set a timer or watch the clock to make sure it doesn't overcook. Check the zucchini after 2 minutes to see if it's ready. If it's not, continue to grill it, checking every few seconds. Then, flip the zucchini. Your zucchini should turn brown when it's ready. It might have grill lines, but don't wait for grill lines to form. Flip or remove the zucchini as soon as it turns golden brown."
        },
        {
          "headline":"Serve your zucchini while it's still warm.",
          "description":"It's tastiest when warm! Your zucchini will make a delicious  side dish. If you'd like, you can sprinkle a little Parmesan onto your zucchini."
        }
      ]
    },
    {
      "name":"Using Zucchini in Pasta Dishes",
      "steps":[
        {
          "headline":"Use a mandoline or spiralizer to slice the zucchini into thin strands.",
          "description":"Secure your zucchini in the device, then turn it on. The mandoline or spiralizer will create long, thin threads of zucchini that look like spaghetti. You can find a mandoline or spiralizer at your local department store, home goods store, or online. As an alternative, you can use a grater. Zucchini noodles are commonly called “zoodles.”"
        },
        {
          "headline":"Leave the zucchini raw for cold pasta salads.",
          "description":"Depending on the recipe, you can use the long threads or chop them up into smaller pieces. Simply substitute the zucchini for pasta in your recipe. You can use regular pasta salad recipes."
        },
        {
          "headline":"Cook the zucchini 2-4 minutes for warm pasta recipes.",
          "description":"This will make the zucchini al dente. Use the zucchini threads instead of regular pasta to cut back on calories! Pour your pasta sauce over the zucchini threads before serving. If you want your noodles to be soft, cook them 4-5 minutes."
        },
        {
          "headline":"Add chopped zucchini to your regular pasta dishes for more veggies.",
          "description":"You can add raw zucchini to your cooked or cold pasta dish. If you prefer cooked zucchini, stir the zucchini into your sauce or cook it with the other veggies you're adding to your pasta."
        }
      ]
    }
  ],
  "text":" Eating Zucchini Raw Snack on zucchini slices. You don't need to cook zucchini before you eat it! Chop up your zucchini to make an easy, convenient snack. If you don't like the taste of plain zucchini, you can dip your slices in hummus for more flavor. You don't need to peel zucchini. It's okay to eat the skin, which is packed full of nutrients. However, don't eat the ends of the zucchini. Add chopped zucchini to your salad or wrap. Use a chopping knife to cut your zucchini into slices or cubes. Top your salad with the zucchini pieces to add a little extra nutrition and flavor. Similarly, you can add sliced or chopped zucchini to salad wraps as a convenient filling. Discard the ends of the zucchini. Make a raw zucchini salad. Slice off the ends of 2 zucchini. Next, use a potato peeler, mandoline, or cheese grater to shave the zucchini into slim strips. Put the strips in a bowl and add a handful of parsley. Add the juice from 1 lemon and 1 lime to the bowl. Drizzle olive oil over the zucchini, then season it with salt and pepper. You'll need the following ingredients to make your salad: 2 zucchini, 1 handful of parsley, 1 lemon, 1 lime, olive oil, salt, and pepper. Top your pizza with zucchini. You can add raw zucchini on top of your pizza. If you prefer your zucchini cooked, add slices of zucchini onto your pizza before you cook it. Bake the pizza according to your recipe. Steaming or Boiling Zucchini Cut your zucchini into ⁄4 to ⁄2 in (0.64 to 1.27 cm) slices. Hold your chopping knife perpendicular to the zucchini, then make small chops down the length of it. Your slices should be relatively even so they cook thoroughly. Discard the ends of your zucchini. Place the zucchini in a metal steaming basket. The zucchini can be in a pile inside the basket. It will still cook thoroughly. If you don't have a steaming basket, you can add the zucchini directly to the water and boil it. Boiling the zucchini will create a softer texture. Fill your pot with just enough water to reach the bottom of the basket. You only need about ⁄2 to 1 inch (1.3 to 2.5 cm) of water in your pot. The zucchini will not be covered in water. Instead, the steam from the boiling water will cook the zucchini. If you're boiling the zucchini, fill about ⅔ of the pot with fresh water. Then, add salt to the water. Boil your water, place the basket in it, and put on the cover. The cover will trap in the steam to help cook the zucchini. Use the handle on the basket to maneuver it so you don't get burned. If you're boiling the zucchini, add it directly into the water once it's boiling. Cook the zucchini for 3-6 minutes, until the zucchini is tender. Set a timer or watch the clock to ensure you don't overcook the zucchini. You can check that it's ready by spearing a piece of zucchini with a fork. It should be soft but not soggy. Drain the zucchini, if you boiled it. Pour the zucchini into a colander to drain away the excess water. Then, discard the water. You don't need to drain steamed zucchini, as it wasn't in water. Add salt and pepper to taste. After you plate the zucchini, sprinkle salt and pepper over it. You only need a little bit to enhance the flavor of the zucchini. Start with a little seasoning and add more if desired. Add zucchini to your favorite vegetable soup, as another option. Add your zucchini to a broth, along with your other soup ingredients. Bring your soup to a boil over high heat, then reduce the heat to medium-low. Simmer your soup for about 40 minutes or until the veggies are tender. Baking Zucchini Cut the zucchini into ⁄8 to ⁄4 inch (0.32 to 0.64 cm) slices or cubes. Hold your chopping knife perpendicular to the zucchini. Then, make slices into the zucchini, working your way down its length. Discard the ends of the zucchini. As an alternative, you can cut off the ends, then cut your zucchini once lengthwise. This will create two long zucchini halves. Coat the zucchini in olive oil or melted butter. Spray the oil onto the zucchini or toss the zucchini in the oil or butter. Every side of the zucchini should have oil on it before you bake it. Sprinkle seasoning onto your zucchini, to taste. You can cook the zucchini without seasoning, but adding a little extra flavor can create a delicious dish! Simply sprinkle on your seasoning after you coat the zucchini in oil. Here are some seasoning ideas:\nUse salt and pepper. Add oregano or Italian seasoning for more flavor. Use fresh thyme or dill instead, as another option. Opt for red pepper for added zest. Place the zucchini on a baking sheet in a single layer. Use your fingers or a spoon to spread out the zucchini. It needs to be in a single layer so it will cook evenly. Use a nonstick pan or spray your pan with nonstick spray. Sprinkle Parmesan cheese onto your zucchini for added flavor. Use your fingers or a spoon to lightly distribute the Parmesan cheese onto the zucchini. Make several passes over the zucchini, adding a little cheese at a time until you've reached your desired amount. You can use grated or Parmesan cheese. Parmesan cheese can give your zucchini a rich, savory taste. Bake the zucchini at 350 °F (177 °C) for 35-40 minutes. Place your baking sheet on the center rack of your oven. Then, set a timer or watch the clock to make sure you don't overcook your zucchini. Use an oven mitt to remove the pan from the oven. Let your zucchini cool for about 2-3 minutes before you serve it. Mix zucchini into baked goods, as an alternative. You can mix zucchini into bread or muffins to increase your vegetable consumption. Shred your zucchini into small pieces using a grater or potato peeler. Then, press the zucchini with a clean towel to remove excess liquids. Stir the zucchini into the wet ingredients, like butter, oil, or eggs, in your recipe before combining it with the dry ingredients. Patting the zucchini dry helps keep your baked goods from being soggy. You can find a recipe for zucchini bread or muffins, or you can simply add the zucchini to a traditional recipe. Sauteing Zucchini Slice your zucchini into thin coins. Hold a sharp chopping knife perpendicular to your zucchini. Start about ⁄8 inch (0.32 cm) from the end of your zucchini. Cut through the zucchini, then work your way down the length of your zucchini. Discard the ends of your zucchini. Heat about 1 tablespoon (15 mL) of olive oil over medium-high heat. Pour the oil into the pan before you turn on the burner. Wait about 30 seconds for the oil to get warm before you add the zucchini to the pan. Add your zucchini to the pan and saute it for about 5 minutes. Stir the zucchini to coat it in the olive oil. Make sure the oil and the zucchini are evenly distributed across the pan. Continue stirring the zucchini so it cooks evenly. Set a timer or watch the clock to make sure you don't overcook it. Your zucchini will be soft when it's ready. The color of the skin will also deepen. Season the zucchini to taste. Sprinkle a little seasoning onto the zucchini while it's still hot. You can season it in the pan or on your plate. Here are some ways to season your zucchini:\nSprinkle with salt and pepper. Add Parmesan on top of the salt and pepper. Spritz the zucchini with lemon juice, then sprinkle on dill weed, cilantro, and chopped scallions. Stir zucchini into your stir fry for another option. Use zucchini along with other vegetables to make a savory, healthy stir fry. Simply heat oil on the stove, then saute your vegetables over medium-high heat. Serve your stir fry as a side dish or add it to a protein to make an entree. Grilling Zucchini Cut off the ends of your zucchini and slice it lengthwise or into coins. Hold the zucchini with one hand while you cut with the other, using a sharp chopping knife. To cut lengthwise, slice down the zucchini from end to end. To make coins, position your knife perpendicular to the zucchini, then make small slices until your entire zucchini is cut into round pieces. Discard the ends of the zucchini in your trash or compost. For grilling zucchini, it's best to cut lengthwise for easy grilling. Apply your oil and seasoning. Oils like olive oil are necessary for grilling. Coat the zucchini in the oil using a brush or by tossing in a bowl, then sprinkle on your seasoning. Here are some delicious ways to season your zucchini:\nCombine 2 tablespoons (30 mL) melted butter, 1 tablespoon (15 mL) olive oil, and 1 tablespoon (15 mL) of lemon juice. Coat the zucchini in the mixture, then sprinkle on powdered garlic. Mix 2 teaspoons (9.9 mL) olive oil and 2 tablespoons (30 mL) of balsamic vinaigrette. Coat your zucchini in the mixture, then sprinkle Italian seasoning, garlic powder, and a pinch of salt to taste. Coat your zucchini with olive oil, then sprinkle on garlic powder, red pepper flakes, and lemon zest. Lightly season with salt and pepper, to taste. Heat your grill or pan over medium-high heat. Get the pan warm before you put the zucchini on to cook. You can check to see it's warm by flicking water onto the grill or pan. The water should sizzle when it hits the heat. You can use a barbeque, stove-top grill, countertop grill, or grilling pan. Grill each side of your zucchini for 2 minutes or until golden brown. Lay the zucchini onto the grill or pan. Set a timer or watch the clock to make sure it doesn't overcook. Check the zucchini after 2 minutes to see if it's ready. If it's not, continue to grill it, checking every few seconds. Then, flip the zucchini. Your zucchini should turn brown when it's ready. It might have grill lines, but don't wait for grill lines to form. Flip or remove the zucchini as soon as it turns golden brown. Serve your zucchini while it's still warm. It's tastiest when warm! Your zucchini will make a delicious  side dish. If you'd like, you can sprinkle a little Parmesan onto your zucchini. Using Zucchini in Pasta Dishes Use a mandoline or spiralizer to slice the zucchini into thin strands. Secure your zucchini in the device, then turn it on. The mandoline or spiralizer will create long, thin threads of zucchini that look like spaghetti. You can find a mandoline or spiralizer at your local department store, home goods store, or online. As an alternative, you can use a grater. Zucchini noodles are commonly called “zoodles.” Leave the zucchini raw for cold pasta salads. Depending on the recipe, you can use the long threads or chop them up into smaller pieces. Simply substitute the zucchini for pasta in your recipe. You can use regular pasta salad recipes. Cook the zucchini 2-4 minutes for warm pasta recipes. This will make the zucchini al dente. Use the zucchini threads instead of regular pasta to cut back on calories! Pour your pasta sauce over the zucchini threads before serving. If you want your noodles to be soft, cook them 4-5 minutes. Add chopped zucchini to your regular pasta dishes for more veggies. You can add raw zucchini to your cooked or cold pasta dish. If you prefer cooked zucchini, stir the zucchini into your sauce or cook it with the other veggies you're adding to your pasta.",
  "tyn_model":[
    "zucchini",
    "water",
    "oil",
    "olive oil",
    "salt and pepper",
    "chopping knife",
    "mandoline",
    "salt",
    "parmesan cheese",
    "bowl",
    "pot",
    "butter",
    "potato peeler",
    "parsley",
    "lemon",
    "steaming basket",
    "basket",
    "italian seasoning",
    "red pepper",
    "baking sheet",
    "spoon",
    "oven",
    "parmesan",
    "garlic powder",
    "grill or pan",
    "grill",
    "pasta",
    "hummus",
    "salad",
    "salad wraps",
    "cheese grater",
    "lime",
    "pepper",
    "⅔ of",
    "fork",
    "colander",
    "vegetable soup",
    "broth",
    "oregano",
    "nonstick pan",
    "nonstick spray",
    "oven mitt",
    "baked goods",
    "eggs",
    "dill weed",
    "cilantro",
    "scallions",
    "stir fry",
    "knife",
    "seasoning",
    "melted butter",
    "lemon juice",
    "garlic",
    "balsamic vinaigrette",
    "lemon zest",
    "barbeque, stove-top grill",
    "grilling pan",
    "spiralizer",
    "grater",
    "“zoodles",
    "” leave",
    "zucchini threads",
    "pasta sauce"
  ],
  "tyn_section":[

  ]
}