{
  "title":"How to Eat Swiss Chard",
  "url":"https://www.wikihow.com/Eat-Swiss-Chard",
  "category_hierarchy":[
    "Food and Entertaining",
    "Appreciation of Food",
    "Eating Techniques"
  ],
  "methods":[
    {
      "name":"Washing and Cutting Swiss Chard",
      "steps":[
        {
          "headline":"Rinse the leaves under running water.",
          "description":"Start by washing your hands first. Run each leaf under the water, using your hands to rub off any dirt, and then set it on a towel to drip-dry. Always wash your greens right before eating them. If you wash them before storing them, you can encourage bacterial growth."
        },
        {
          "headline":"Stack the leaves together.",
          "description":"Shake off any excess water left over from washing the leaves. Layer several leaves together on a cutting board, lining up the stems as you do. Don't stack more together than you can comfortably cut through."
        },
        {
          "headline":"Trim the stems off.",
          "description":"Cut off the very end of the stems first, and discard them. Then, slice along the stems on both sides, cutting them out of the leaf. If you're not using the stems in your current recipe, save them for later. To save the stems for a later, put them in a perforated bag and then store them in your veggie drawer. Use them up within a couple of days. The stems require more cooking time than the leaves, so not every recipe calls for them. However, they are tasty in many dishes. You can cut the stems into pieces for soup, for instance."
        },
        {
          "headline":"Slice the chard leaves into pieces or ribbons.",
          "description":"With a sharp knife, cut through all the leaves at once. For recipes where the chard needs to cook quickly, try thin ribbons. Otherwise, cut the chard into bite-sized pieces."
        }
      ]
    },
    {
      "name":"Using Raw Swiss Chard",
      "steps":[
        {
          "headline":"Slice Swiss chard for the base of a salad.",
          "description":"Swiss chard is a hearty green, so it holds up well in salads. Slice it into ribbons or pieces for the foundation of a salad. It will work particularly well in place of spinach or kale, so swap in chard when a recipe calls for one of these greens. For instance, try it tossed with honey mustard, feta, pecans, and dried cranberries."
        },
        {
          "headline":"Add Swiss chard to a smoothie.",
          "description":"Any smoothie recipe that calls for greens like spinach or kale will be just as amazing with Swiss chard. It can be a little bitter, though, so just add a couple of leaves at first. For a berry smoothie, mix 2 chard leaves in a blender with 2 cups (470 mL) of water or other liquid. Once the chard is well blended, add in 1 cup (110 grams) each of blackberries and blueberries, as well as 1 medium banana (sliced). Sprinkle in a dash of salt, a couple of grates of lemon zest, and a small nub (the size of a shelled peanut) of ginger. Add in maple syrup to taste, and blend."
        },
        {
          "headline":"Use Swiss chard leaves in place of taco shells or buns.",
          "description":"Swiss chard is a very sturdy green, so it does well as a replacement for bread or other carbs. Try making your favorite taco recipe, and use the chard for the tortillas, as an example."
        },
        {
          "headline":"Make pickled Swiss chard stems in the refrigerator.",
          "description":"Mix together a brine in the following proportions: 1 cup (240 mL) of distilled white vinegar, 2 cups (470 mL) of sugar, 1/2 onion (slice it thinly), 3 generous squirts of Sriracha, and 1/2 teaspoon (1 gram) of celery seeds. Make enough to cover your stems in a jar, and place them in the fridge for 2-3 days to marinate. Stir enough to completely dissolve the sugar in the vinegar. You can increase or decrease the sriracha to your liking. Keep the pickles in your fridge for up to a month."
        }
      ]
    },
    {
      "name":"Cooking Swiss Chard",
      "steps":[
        {
          "headline":"Saute Swiss chard with garlic for an easy, tasty side dish.",
          "description":"In a pan over medium heat, pour in 1 to 2 tablespoons (15 to 30 mL) of olive oil. Add a few cloves of chopped garlic and a couple of dashes black pepper. Let the garlic cook for about 1 minute until it starts to turn golden, then add a couple of thinly sliced chard stems. Let them cook for another minute or so before adding 2-3 chard leaves. Cook until the leaves wilt. If you have a lot of chard that won't all fit in the pan at once, let some of the chard wilt before adding more to the pan. It will cook down. Sprinkle on a dash of salt at the end."
        },
        {
          "headline":"Boil Swiss chard for a healthier side dish.",
          "description":"Bring a pot of water to boil on the stove, and add several generous pinches of salt. Add the chopped stems from 3-4 leaves, and cook for 2-4 minutes until they're mostly tender. Place the leaves in the pot, and cover for 1-2 minutes. The leaves should be wilted. If they're not, cook them another 1-2 minutes. Drain the greens over a colander, and use a spatula to squeeze out any excess water. Add flavor at the end, if you'd like. For instance, add a dash of black pepper and a few splashes of apple cider vinegar."
        },
        {
          "headline":"Roast Swiss chard for a sweeter flavor.",
          "description":"Leave the stem in the main part of the leaf, but cut off the end that extends past the leaf. Dry the leaves off so they're just damp instead of soaking, and then drizzle them with olive oil. Sprinkle on salt and pepper, and place 4-5 leaves in a flat layer on 1-2 cookie sheets. Put them in an oven preheated to 450 °F (232 °C), and let them cook for 3-4 minutes. At this point, switch the bottom and top pans in the oven if you are using more than one. Cook the leaves until they start to form dry spots, but don't let them dry out completely. Swapping the pans out helps the chard cook more evenly. Roasting draws out the moisture and caramelizes the natural sugar in the chard."
        },
        {
          "headline":"Steam the whole Swiss chard stems by themselves.",
          "description":"If you've used the leaves in another recipe, the stems can make a delicious side all by themselves. Place 5-10 stems in a saucepan with a sprinkle of salt and enough water to cover the bottom, and then cover them for 3-5 minutes. Check to see if they are tender. If they're not, cook them a few minutes more. Serve them like you would asparagus, as a side dish with a small pat of butter and a sprinkle of salt and pepper. Alternatively, boil the stems for 5-10 minutes, and serve them the same way you would steamed stems."
        }
      ]
    },
    {
      "name":"Adding Swiss Chard to Other Dishes",
      "steps":[
        {
          "headline":"Wilt Swiss chard into scrambled eggs.",
          "description":"Start with 1 to 2 tablespoons (15 to 30 mL) of oil or a pat of butter in the pan over medium heat. Add 1-2 generous handfuls of shredded Swiss chard to the pan, and stir it until it has wilted. Pour in 2-3 well-beaten eggs, and cook until they form curds. Add a clove or two of garlic at the beginning for a burst of flavor."
        },
        {
          "headline":"Make chard the star of a pasta.",
          "description":"Boil 0.5 pounds (0.23 kg) of pasta as you normally would, and drain it. Put the pasta back in the pot, and add several handfuls of chard cut into ribbons, the juice of half a lemon, and 1 to 2 tablespoons (15 to 30 mL) of olive oil. Sprinkle in salt and pepper, then stir to combine. The hot pasta will help cook the chard, and you'll have a simple, delicious pasta. Try sprinkling a bit of Parmesan on the finished pasta. You could also add it as a layer in lasagna."
        },
        {
          "headline":"Try Swiss chard as a pesto.",
          "description":"Most greens can be made into a pesto, and chard is no exception. Use it in place of basil in a standard pesto recipe, or try a new recipe that calls specifically for Swiss chard. For a vegan pesto recipe, wilt 6 ounces (170 g) each of Swiss chard and mustard greens (no stems) in boiling water. Pull them out after a minute to drain and cool. Place the greens in a blender with 1/2 cup (50 grams) of almonds, 2 finely chopped garlic cloves, 5 teaspoons (25 mL) of sherry vinegar, and a dash of salt and pepper. Start blending the mixture, and pour in 6 tablespoons (89 mL) of walnut oil in a steady stream as you blend it to a smooth paste."
        },
        {
          "headline":"Boost the nutritional value of soups and stews by adding chard.",
          "description":"A simple way to use chard is to use it in place of spinach or kale if a soup calls for it. Alternatively, add it to thick stews or chilis for freshness and a nutritional boost. Add the chard in the last 10 minutes of cooking, stirring occasionally."
        }
      ]
    }
  ],
  "text":" Washing and Cutting Swiss Chard Rinse the leaves under running water. Start by washing your hands first. Run each leaf under the water, using your hands to rub off any dirt, and then set it on a towel to drip-dry. Always wash your greens right before eating them. If you wash them before storing them, you can encourage bacterial growth. Stack the leaves together. Shake off any excess water left over from washing the leaves. Layer several leaves together on a cutting board, lining up the stems as you do. Don't stack more together than you can comfortably cut through. Trim the stems off. Cut off the very end of the stems first, and discard them. Then, slice along the stems on both sides, cutting them out of the leaf. If you're not using the stems in your current recipe, save them for later. To save the stems for a later, put them in a perforated bag and then store them in your veggie drawer. Use them up within a couple of days. The stems require more cooking time than the leaves, so not every recipe calls for them. However, they are tasty in many dishes. You can cut the stems into pieces for soup, for instance. Slice the chard leaves into pieces or ribbons. With a sharp knife, cut through all the leaves at once. For recipes where the chard needs to cook quickly, try thin ribbons. Otherwise, cut the chard into bite-sized pieces. Using Raw Swiss Chard Slice Swiss chard for the base of a salad. Swiss chard is a hearty green, so it holds up well in salads. Slice it into ribbons or pieces for the foundation of a salad. It will work particularly well in place of spinach or kale, so swap in chard when a recipe calls for one of these greens. For instance, try it tossed with honey mustard, feta, pecans, and dried cranberries. Add Swiss chard to a smoothie. Any smoothie recipe that calls for greens like spinach or kale will be just as amazing with Swiss chard. It can be a little bitter, though, so just add a couple of leaves at first. For a berry smoothie, mix 2 chard leaves in a blender with 2 cups (470 mL) of water or other liquid. Once the chard is well blended, add in 1 cup (110 grams) each of blackberries and blueberries, as well as 1 medium banana (sliced). Sprinkle in a dash of salt, a couple of grates of lemon zest, and a small nub (the size of a shelled peanut) of ginger. Add in maple syrup to taste, and blend. Use Swiss chard leaves in place of taco shells or buns. Swiss chard is a very sturdy green, so it does well as a replacement for bread or other carbs. Try making your favorite taco recipe, and use the chard for the tortillas, as an example. Make pickled Swiss chard stems in the refrigerator. Mix together a brine in the following proportions: 1 cup (240 mL) of distilled white vinegar, 2 cups (470 mL) of sugar, 1/2 onion (slice it thinly), 3 generous squirts of Sriracha, and 1/2 teaspoon (1 gram) of celery seeds. Make enough to cover your stems in a jar, and place them in the fridge for 2-3 days to marinate. Stir enough to completely dissolve the sugar in the vinegar. You can increase or decrease the sriracha to your liking. Keep the pickles in your fridge for up to a month. Cooking Swiss Chard Saute Swiss chard with garlic for an easy, tasty side dish. In a pan over medium heat, pour in 1 to 2 tablespoons (15 to 30 mL) of olive oil. Add a few cloves of chopped garlic and a couple of dashes black pepper. Let the garlic cook for about 1 minute until it starts to turn golden, then add a couple of thinly sliced chard stems. Let them cook for another minute or so before adding 2-3 chard leaves. Cook until the leaves wilt. If you have a lot of chard that won't all fit in the pan at once, let some of the chard wilt before adding more to the pan. It will cook down. Sprinkle on a dash of salt at the end. Boil Swiss chard for a healthier side dish. Bring a pot of water to boil on the stove, and add several generous pinches of salt. Add the chopped stems from 3-4 leaves, and cook for 2-4 minutes until they're mostly tender. Place the leaves in the pot, and cover for 1-2 minutes. The leaves should be wilted. If they're not, cook them another 1-2 minutes. Drain the greens over a colander, and use a spatula to squeeze out any excess water. Add flavor at the end, if you'd like. For instance, add a dash of black pepper and a few splashes of apple cider vinegar. Roast Swiss chard for a sweeter flavor. Leave the stem in the main part of the leaf, but cut off the end that extends past the leaf. Dry the leaves off so they're just damp instead of soaking, and then drizzle them with olive oil. Sprinkle on salt and pepper, and place 4-5 leaves in a flat layer on 1-2 cookie sheets. Put them in an oven preheated to 450 °F (232 °C), and let them cook for 3-4 minutes. At this point, switch the bottom and top pans in the oven if you are using more than one. Cook the leaves until they start to form dry spots, but don't let them dry out completely. Swapping the pans out helps the chard cook more evenly. Roasting draws out the moisture and caramelizes the natural sugar in the chard. Steam the whole Swiss chard stems by themselves. If you've used the leaves in another recipe, the stems can make a delicious side all by themselves. Place 5-10 stems in a saucepan with a sprinkle of salt and enough water to cover the bottom, and then cover them for 3-5 minutes. Check to see if they are tender. If they're not, cook them a few minutes more. Serve them like you would asparagus, as a side dish with a small pat of butter and a sprinkle of salt and pepper. Alternatively, boil the stems for 5-10 minutes, and serve them the same way you would steamed stems. Adding Swiss Chard to Other Dishes Wilt Swiss chard into scrambled eggs. Start with 1 to 2 tablespoons (15 to 30 mL) of oil or a pat of butter in the pan over medium heat. Add 1-2 generous handfuls of shredded Swiss chard to the pan, and stir it until it has wilted. Pour in 2-3 well-beaten eggs, and cook until they form curds. Add a clove or two of garlic at the beginning for a burst of flavor. Make chard the star of a pasta. Boil 0.5 pounds (0.23 kg) of pasta as you normally would, and drain it. Put the pasta back in the pot, and add several handfuls of chard cut into ribbons, the juice of half a lemon, and 1 to 2 tablespoons (15 to 30 mL) of olive oil. Sprinkle in salt and pepper, then stir to combine. The hot pasta will help cook the chard, and you'll have a simple, delicious pasta. Try sprinkling a bit of Parmesan on the finished pasta. You could also add it as a layer in lasagna. Try Swiss chard as a pesto. Most greens can be made into a pesto, and chard is no exception. Use it in place of basil in a standard pesto recipe, or try a new recipe that calls specifically for Swiss chard. For a vegan pesto recipe, wilt 6 ounces (170 g) each of Swiss chard and mustard greens (no stems) in boiling water. Pull them out after a minute to drain and cool. Place the greens in a blender with 1/2 cup (50 grams) of almonds, 2 finely chopped garlic cloves, 5 teaspoons (25 mL) of sherry vinegar, and a dash of salt and pepper. Start blending the mixture, and pour in 6 tablespoons (89 mL) of walnut oil in a steady stream as you blend it to a smooth paste. Boost the nutritional value of soups and stews by adding chard. A simple way to use chard is to use it in place of spinach or kale if a soup calls for it. Alternatively, add it to thick stews or chilis for freshness and a nutritional boost. Add the chard in the last 10 minutes of cooking, stirring occasionally.",
  "tyn_model":[
    "swiss chard",
    "chard",
    "water",
    "salt",
    "garlic",
    "sugar",
    "olive oil",
    "pot",
    "salt and pepper",
    "pasta",
    "blender",
    "lemon",
    "black pepper",
    "oven",
    "butter",
    "perforated bag",
    "veggie drawer",
    "sharp knife",
    "honey mustard",
    "feta",
    "pecans",
    "cranberries",
    "blackberries",
    "blueberries",
    "banana",
    "ginger",
    "maple syrup",
    "distilled white vinegar",
    "sriracha,",
    "celery seeds",
    "jar",
    "fridge",
    "vinegar",
    "sriracha",
    "colander",
    "spatula",
    "apple cider vinegar",
    "cookie sheets",
    "pans",
    "saucepan",
    "scrambled eggs",
    "oil",
    "eggs",
    "pepper",
    "parmesan",
    "basil",
    "mustard greens",
    "almonds",
    "sherry vinegar",
    "walnut oil",
    "spinach",
    "kale"
  ],
  "tyn_section":[

  ]
}