{
  "title":"How to Shape a Beret",
  "url":"https://www.wikihow.com/Shape-a-Beret",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Knowing How to Wear Your Beret Properly",
      "steps":[
        {
          "headline":"Learn your organization's dress code.",
          "description":"Although the following can be used as a general guide for uniform berets, you will need to know any unique rules you may be required to follow. If you're wearing a beret for fashion, there is really no limit to how it may be worn (as long as it's sitting on top of your head). The most popular casual method of wearing a beret is to wear it without a fold and tilted so that the brim sits diagonally across your forehead. Usually casual berets need no shaping other than fuzz removal."
        },
        {
          "headline":"Align your beret properly.",
          "description":"This typically means to wear your beret with the brim straight across your forehead. The United States Army requires the edge to sit one inch above the eyebrows. If your organization requires a \"flash\" insignia, it should be aligned over your left eye. Excess material will be folded and draped towards the right side of your head. This is typically why a beret must be shaped, as it will most likely resist holding this shape when brand new."
        },
        {
          "headline":"Keep an appropriate hairstyle.",
          "description":"Do not wear hairstyles that may distort the shape of the beret, such as high buns or ponytails. Your bangs should not extend below the front brim of the beret. Some organizations, such as the United Kingdom's Royal Air Force, require that those with long hair keep it in a hairnet most closely matching their hair color."
        }
      ]
    },
    {
      "name":"Learning the Basics for Beret Shaping",
      "steps":[
        {
          "headline":"Fit the beret to your head.",
          "description":"If the beret is adjustable, place it on your head and adjust to the right size. Be sure to complete this step before getting the beret wet, since a wet beret can stretch or shrink. If you are unable to adjust your beret to fit snugly on your head, you may need one of a different size."
        },
        {
          "headline":"Remove the lining.",
          "description":"Cut out the black inner lining of the beret, but be careful not to damage the fuzzy outer layer. Removing this lining will help you more easily shape the beret. Keep in mind that not all berets will have this component."
        },
        {
          "headline":"Remove any fuzz.",
          "description":"This is typically done after you've finished shaping your beret. However, if your beret is already visible pilled before being shaped, shave it before wetting in addition to after it's dry. In the case of casual berets, this may be the only step you need to take. There are many ways to remove fuzz from your beret:\nUse a disposable razor. This is the easiest and most common method. Gently run the razor in a single direction over your beret. Make sure not to go over the same spot multiple times, as you risk wearing down the material too much. Carefully clip with scissors. This method is best if there are only a handful of obvious pills. Clip them off at the base, placing the scissors flush with the beret. Use cuticle scissors for the most precise control possible. Burn off the fuzz with a lighter. Hold the lighter in place and carefully run your beret just over the flame without touching it. Instead of \"shaving\" the entire cap, go over just the areas with visible fuzz. Although this method can damage your beret if done improperly, it is sometimes considered to be the traditional way to de-pill a military beret. Exercise caution when using a lighter."
        }
      ]
    },
    {
      "name":"Shaping a Military Uniform Beret",
      "steps":[
        {
          "headline":"Wet the beret.",
          "description":"Soak the beret in warm water. If your beret has a flash, keep it away from the water as much as possible. Note: Using hot water on the black rim will shrink the beret. If your beret is slightly too large, using hot water is a good idea. If your beret already fits your head snugly, be sure to avoid hot water."
        },
        {
          "headline":"Wring out the excess water.",
          "description":"Get rid of all the extra water you can by gently wringing out the beret. It will still be damp, but make sure there is no more dripping water."
        },
        {
          "headline":"Shape the beret.",
          "description":"Place the damp beret on your head. Pull the beret up to make it stand. If your organization uses the standard beret shape discussed in Method 1, pull all excess fabric down on the right side of your head by folding it with your hands. Repeat this action several times, making sure the fabric on top is completely smooth."
        },
        {
          "headline":"Allow the beret to dry on your head.",
          "description":"Doing this will keep the beret from shrinking too much and will form the beret more closely to the exact shape of your head. If necessary, you may need to hold the fold down with one hand until it becomes secure. You may take the beret off if it's still slightly damp after a few hours."
        }
      ]
    }
  ],
  "text":" Knowing How to Wear Your Beret Properly Learn your organization's dress code. Although the following can be used as a general guide for uniform berets, you will need to know any unique rules you may be required to follow. If you're wearing a beret for fashion, there is really no limit to how it may be worn (as long as it's sitting on top of your head). The most popular casual method of wearing a beret is to wear it without a fold and tilted so that the brim sits diagonally across your forehead. Usually casual berets need no shaping other than fuzz removal. Align your beret properly. This typically means to wear your beret with the brim straight across your forehead. The United States Army requires the edge to sit one inch above the eyebrows. If your organization requires a \"flash\" insignia, it should be aligned over your left eye. Excess material will be folded and draped towards the right side of your head. This is typically why a beret must be shaped, as it will most likely resist holding this shape when brand new. Keep an appropriate hairstyle. Do not wear hairstyles that may distort the shape of the beret, such as high buns or ponytails. Your bangs should not extend below the front brim of the beret. Some organizations, such as the United Kingdom's Royal Air Force, require that those with long hair keep it in a hairnet most closely matching their hair color. Learning the Basics for Beret Shaping Fit the beret to your head. If the beret is adjustable, place it on your head and adjust to the right size. Be sure to complete this step before getting the beret wet, since a wet beret can stretch or shrink. If you are unable to adjust your beret to fit snugly on your head, you may need one of a different size. Remove the lining. Cut out the black inner lining of the beret, but be careful not to damage the fuzzy outer layer. Removing this lining will help you more easily shape the beret. Keep in mind that not all berets will have this component. Remove any fuzz. This is typically done after you've finished shaping your beret. However, if your beret is already visible pilled before being shaped, shave it before wetting in addition to after it's dry. In the case of casual berets, this may be the only step you need to take. There are many ways to remove fuzz from your beret:\nUse a disposable razor. This is the easiest and most common method. Gently run the razor in a single direction over your beret. Make sure not to go over the same spot multiple times, as you risk wearing down the material too much. Carefully clip with scissors. This method is best if there are only a handful of obvious pills. Clip them off at the base, placing the scissors flush with the beret. Use cuticle scissors for the most precise control possible. Burn off the fuzz with a lighter. Hold the lighter in place and carefully run your beret just over the flame without touching it. Instead of \"shaving\" the entire cap, go over just the areas with visible fuzz. Although this method can damage your beret if done improperly, it is sometimes considered to be the traditional way to de-pill a military beret. Exercise caution when using a lighter. Shaping a Military Uniform Beret Wet the beret. Soak the beret in warm water. If your beret has a flash, keep it away from the water as much as possible. Note: Using hot water on the black rim will shrink the beret. If your beret is slightly too large, using hot water is a good idea. If your beret already fits your head snugly, be sure to avoid hot water. Wring out the excess water. Get rid of all the extra water you can by gently wringing out the beret. It will still be damp, but make sure there is no more dripping water. Shape the beret. Place the damp beret on your head. Pull the beret up to make it stand. If your organization uses the standard beret shape discussed in Method 1, pull all excess fabric down on the right side of your head by folding it with your hands. Repeat this action several times, making sure the fabric on top is completely smooth. Allow the beret to dry on your head. Doing this will keep the beret from shrinking too much and will form the beret more closely to the exact shape of your head. If necessary, you may need to hold the fold down with one hand until it becomes secure. You may take the beret off if it's still slightly damp after a few hours.",
  "tyn_model":[
    "water",
    "beret",
    "razor",
    "scissors",
    "lighter",
    "fabric",
    "cuticle scissors"
  ],
  "tyn_section":[

  ]
}