{
  "title":"How to Eat Burrata",
  "url":"https://www.wikihow.com/Eat-Burrata",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Cheese"
  ],
  "methods":[
    {
      "name":"Enjoying Burrata on Its Own",
      "steps":[
        {
          "headline":"Choose the freshest possible burrata.",
          "description":"This cheese contains a lot of water, which evaporates quickly. Your burrata will be less creamy the longer you wait to eat it. Try to find cheese that was made within the past day, if possible. Burrata can be found in specialty grocery stores or cheese shops. If your local store has a dairy counter, ask them when the burrata was made so you know it’s fresh."
        },
        {
          "headline":"Store the cheese in the fridge and eat it within 48 hours for the best flavor.",
          "description":"Burrata will stay fresh longer if it’s stored at 40 °F (4 °C). Even stored in the fridge, however, burrata is best eaten within 48 hours. You can eat it past this point, but it might not be as good. If you need to store it longer, keep burrata in its own brine and store it in your fridge for up to a week."
        },
        {
          "headline":"Take the cheese out of the fridge 30 minutes before serving it.",
          "description":"A half hour to an hour before you want to enjoy the burrata, set it out at room temperature so it can warm up a little. This will ensure that the creamy center of the burrata is not too solid. You can also put your cheese in a bowl of warm water for 10 minutes to warm it up. Most burrata comes in a small bag, so you can place that directly in the water. Make sure to drain it well before you serve the cheese!"
        },
        {
          "headline":"Place your burrata in a bowl, and top with olive oil and salt.",
          "description":"It’s better to serve this cheese in a bowl rather than a plate, because when you cut into it the curd at the center will spill out. Drizzle a small amount of high-quality olive oil onto the burrata and sprinkle a bit of salt on top to enhance the burrata’s flavor. Wait to cut into the burrata until you serve it so everyone can immediately dig in to the fresh curd. Adjust the amount of salt you add based on your own preferences. Burrata doesn’t have a strong flavor to begin with, but if you’re only getting a mild milk flavor and not much else, a small amount of salt can help the flavor stand out more."
        },
        {
          "headline":"Serve burrata with cured meats and a slice of crusty bread.",
          "description":"For a simple snack or light meal, just spread the cheese on a piece of bread. Use toasted bread, or one with a tougher crust, to get a nice contrast in textures with the creamy burrata. The cheese’s mild flavor also pairs excellently with the saltiness of cured meats like prosciutto. To toast bread, slice a baguette into ⁄2 inch (1.3 cm) slices and bake for 5 minutes at 400 °F (204 °C). Flip over each slice, bake another 5 minutes, and brush with olive oil once it’s done. You can also brush slices of bread with olive oil and heat them in a griddle pan or skillet until they’re lightly browned."
        }
      ]
    },
    {
      "name":"Using Burrata in Recipes",
      "steps":[
        {
          "headline":"Pair burrata with meats, fruits, or vegetables on a piece of crostini.",
          "description":"For an easy appetizer, snack, or light meal, toast or grill slices of baguette or ciabatta bread, and add burrata and any other toppings you might like. Try to find ingredients with contrasting flavors or textures. Add burrata, roasted eggplant slices, chorizo, and chili peppers to toast. Sprinkle salt, pepper, thyme, and lemon zest on top. Layer prosciutto slices, burrata, and a slice of fresh fig. Pile burrata, chopped Brussels sprouts, radicchio, pine nuts, and apple pieces on a crostini slice. Smear burrata onto a piece of toast, and top with honey or fruit jam."
        },
        {
          "headline":"Top a traditional salad with burrata.",
          "description":"Burrata’s mild, buttery flavor and creamy texture works great with a wide variety of fresh vegetables. Try slicing up some in-season produce, sprinkle with salt and pepper, and add a few pieces of hand-torn burrata. Create an easy caprese salad by topping fresh tomato slices with pieces of burrata. Finish off the dish with salt, pepper, basil leaves, and drizzles of olive oil and balsamic vinegar. Shave raw fennel and radishes into thin slices, add to a bowl, and top with burrata."
        },
        {
          "headline":"Add burrata to fruit dishes for a savory kick.",
          "description":"Think of burrata like you would other soft cheeses and dairy products, like cottage cheese or even yogurt. Add fruits, granola, and honey to make a sweet breakfast dish. You can also combine burrata with fresh fruit salad for a simple snack or dessert. Burrata works especially well as a topping for sliced stone fruit, such as peaches and plums. Try making sweet summer salad by roasting beets and blanching peaches, then add burrata, olive oil, and salt. Top it all off with pistachios for a crunchy finish."
        },
        {
          "headline":"Top grilled veggies with burrata.",
          "description":"For example, you can add burrata pieces to freshly grilled asparagus for a creamy finish. Try roasting up some squash with spicy curry seasonings, and add burrata after the cooking process is finished. Add burrata and pesto to roasted carrots."
        },
        {
          "headline":"Top pizza with burrata when the pizza is almost finished cooking.",
          "description":"Add pizza sauce, other cheeses, and toppings to rolled-out pizza dough. Bake at 500 °F (260 °C) for 10 minutes. Then, tear the burrata into small pieces, sprinkle them on top of the pizza, and bake for another 3 or 4 minutes. Using 1 cup (120 g) of cheese to top a pizza is pretty typical, but you can adjust the amount depending on your preference. Try also adding prosciutto, fresh chopped basil, and red pepper flakes once you’re done baking the pizza. Try burrata on a pizza along with pancetta, roasted tomatoes, onions, and arugula."
        },
        {
          "headline":"Add chunks of burrata to pasta dishes.",
          "description":"Cook pasta according to package directions, and then add your preferred sauce. Once the pasta is done, tear pieces of burrata into chunks and sprinkle them on top of your pasta. Finish pasta with a basic tomato sauce, burrata, and fresh basil leaves. Use burrata in lasagna for extra creaminess. When making the lasagna, top your ricotta cheese layer with burrata chunks."
        },
        {
          "headline":"Add burrata to egg dishes at the end of the cooking process.",
          "description":"Use burrata like you would other cheeses, keeping in mind that it doesn’t need much time to melt. The cheese’s creaminess can enhance soft, custardy eggs. Place a couple small pieces of burrata on top of or inside of an omelet. Serve burrata balls along side poached eggs."
        }
      ]
    }
  ],
  "text":" Enjoying Burrata on Its Own Choose the freshest possible burrata. This cheese contains a lot of water, which evaporates quickly. Your burrata will be less creamy the longer you wait to eat it. Try to find cheese that was made within the past day, if possible. Burrata can be found in specialty grocery stores or cheese shops. If your local store has a dairy counter, ask them when the burrata was made so you know it’s fresh. Store the cheese in the fridge and eat it within 48 hours for the best flavor. Burrata will stay fresh longer if it’s stored at 40 °F (4 °C). Even stored in the fridge, however, burrata is best eaten within 48 hours. You can eat it past this point, but it might not be as good. If you need to store it longer, keep burrata in its own brine and store it in your fridge for up to a week. Take the cheese out of the fridge 30 minutes before serving it. A half hour to an hour before you want to enjoy the burrata, set it out at room temperature so it can warm up a little. This will ensure that the creamy center of the burrata is not too solid. You can also put your cheese in a bowl of warm water for 10 minutes to warm it up. Most burrata comes in a small bag, so you can place that directly in the water. Make sure to drain it well before you serve the cheese! Place your burrata in a bowl, and top with olive oil and salt. It’s better to serve this cheese in a bowl rather than a plate, because when you cut into it the curd at the center will spill out. Drizzle a small amount of high-quality olive oil onto the burrata and sprinkle a bit of salt on top to enhance the burrata’s flavor. Wait to cut into the burrata until you serve it so everyone can immediately dig in to the fresh curd. Adjust the amount of salt you add based on your own preferences. Burrata doesn’t have a strong flavor to begin with, but if you’re only getting a mild milk flavor and not much else, a small amount of salt can help the flavor stand out more. Serve burrata with cured meats and a slice of crusty bread. For a simple snack or light meal, just spread the cheese on a piece of bread. Use toasted bread, or one with a tougher crust, to get a nice contrast in textures with the creamy burrata. The cheese’s mild flavor also pairs excellently with the saltiness of cured meats like prosciutto. To toast bread, slice a baguette into ⁄2 inch (1.3 cm) slices and bake for 5 minutes at 400 °F (204 °C). Flip over each slice, bake another 5 minutes, and brush with olive oil once it’s done. You can also brush slices of bread with olive oil and heat them in a griddle pan or skillet until they’re lightly browned. Using Burrata in Recipes Pair burrata with meats, fruits, or vegetables on a piece of crostini. For an easy appetizer, snack, or light meal, toast or grill slices of baguette or ciabatta bread, and add burrata and any other toppings you might like. Try to find ingredients with contrasting flavors or textures. Add burrata, roasted eggplant slices, chorizo, and chili peppers to toast. Sprinkle salt, pepper, thyme, and lemon zest on top. Layer prosciutto slices, burrata, and a slice of fresh fig. Pile burrata, chopped Brussels sprouts, radicchio, pine nuts, and apple pieces on a crostini slice. Smear burrata onto a piece of toast, and top with honey or fruit jam. Top a traditional salad with burrata. Burrata’s mild, buttery flavor and creamy texture works great with a wide variety of fresh vegetables. Try slicing up some in-season produce, sprinkle with salt and pepper, and add a few pieces of hand-torn burrata. Create an easy caprese salad by topping fresh tomato slices with pieces of burrata. Finish off the dish with salt, pepper, basil leaves, and drizzles of olive oil and balsamic vinegar. Shave raw fennel and radishes into thin slices, add to a bowl, and top with burrata. Add burrata to fruit dishes for a savory kick. Think of burrata like you would other soft cheeses and dairy products, like cottage cheese or even yogurt. Add fruits, granola, and honey to make a sweet breakfast dish. You can also combine burrata with fresh fruit salad for a simple snack or dessert. Burrata works especially well as a topping for sliced stone fruit, such as peaches and plums. Try making sweet summer salad by roasting beets and blanching peaches, then add burrata, olive oil, and salt. Top it all off with pistachios for a crunchy finish. Top grilled veggies with burrata. For example, you can add burrata pieces to freshly grilled asparagus for a creamy finish. Try roasting up some squash with spicy curry seasonings, and add burrata after the cooking process is finished. Add burrata and pesto to roasted carrots. Top pizza with burrata when the pizza is almost finished cooking. Add pizza sauce, other cheeses, and toppings to rolled-out pizza dough. Bake at 500 °F (260 °C) for 10 minutes. Then, tear the burrata into small pieces, sprinkle them on top of the pizza, and bake for another 3 or 4 minutes. Using 1 cup (120 g) of cheese to top a pizza is pretty typical, but you can adjust the amount depending on your preference. Try also adding prosciutto, fresh chopped basil, and red pepper flakes once you’re done baking the pizza. Try burrata on a pizza along with pancetta, roasted tomatoes, onions, and arugula. Add chunks of burrata to pasta dishes. Cook pasta according to package directions, and then add your preferred sauce. Once the pasta is done, tear pieces of burrata into chunks and sprinkle them on top of your pasta. Finish pasta with a basic tomato sauce, burrata, and fresh basil leaves. Use burrata in lasagna for extra creaminess. When making the lasagna, top your ricotta cheese layer with burrata chunks. Add burrata to egg dishes at the end of the cooking process. Use burrata like you would other cheeses, keeping in mind that it doesn’t need much time to melt. The cheese’s creaminess can enhance soft, custardy eggs. Place a couple small pieces of burrata on top of or inside of an omelet. Serve burrata balls along side poached eggs.",
  "tyn_model":[
    "burrata",
    "olive oil",
    "salt",
    "bowl",
    "water",
    "cheese",
    "prosciutto",
    "basil",
    "eggs",
    "cheese shops",
    "dairy counter",
    "fridge",
    "bread",
    "baguette",
    "griddle pan",
    "skillet",
    "baguette or",
    "ciabatta bread",
    "chorizo",
    "chili peppers",
    "pepper",
    "thyme",
    "lemon",
    "fig",
    "brussels sprouts",
    "radicchio",
    "pine nuts",
    "apple",
    "honey or fruit jam",
    "vegetables",
    "salt and pepper",
    "salt, pepper",
    "balsamic vinegar",
    "fennel",
    "radishes",
    "cottage cheese",
    "yogurt",
    "fruits",
    "granola",
    "honey",
    "plums",
    "beets",
    "peaches",
    "pistachios",
    "asparagus",
    "squash",
    "pesto",
    "carrots",
    "pizza sauce",
    "pizza dough",
    "red pepper",
    "pizza",
    "pancetta",
    "roasted tomatoes",
    "onions",
    "arugula",
    "pasta dishes",
    "pasta",
    "tomato sauce",
    "ricotta cheese"
  ],
  "tyn_section":[

  ]
}