{
  "title":"How to Cook for Kids",
  "url":"https://www.wikihow.com/Cook-for-Kids",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking for Children"
  ],
  "methods":[
    {
      "name":"Making Kid-Friendly Meals",
      "steps":[
        {
          "headline":"Offer them some finger foods.",
          "description":"Foods that kids can easily grasp and eat without a fork or a spoon are often a big hit with kids. Look up recipes for finger foods or see what you have on hand to make that would be utensil-free. Some finger food options include:\n\nChicken nuggets or tofu nuggets and sweet potato fries with their favorite dipping sauces. Chicken, beef, or tofu and veggie kabobs (skewers). Grilled cheese sandwiches with baby carrots and ranch dressing. You could even cut the sandwiches into fun shapes to help make them more interesting to kids."
        },
        {
          "headline":"Stick with simple flavors and cuisine types.",
          "description":"Most kids don’t have sophisticated palates, so they prefer simple flavors and cuisine-types that they recognize. Avoid offering something that includes too many different flavors or that might seem unusual to them. For example, you might enjoy spicy or vinegary pasta sauce, but a child might be put off by this. If you make spaghetti, stick with a simple tomato sauce with just 1 or 2 herbs added to it. Likewise, you might love Indian food, but a child who has never tried it before might not be as excited if you put a plate of chana masala and saag paneer in front of them."
        },
        {
          "headline":"Try making a face with the food.",
          "description":"Adding a touch of whimsy to your cooking is a great way to get kids interested in their meal. Some ways you can do this include:\nUsing berries and whipped cream to make a face on a pancake. Creating a pizza face with pepperoni eyes, a black olive nose, and a sweet pepper strip mouth. Placing 2 meatballs on a plate of spaghetti for eyes and then using sauce to create a big smile."
        },
        {
          "headline":"Create a do-it-yourself meal.",
          "description":"Allowing the kids to assemble their food before or after you cook it can also be a great way to get them interested in eating it. Some options to try include:\nHaving kids put toppings on their own mini pizzas before you put the pizzas in the oven. Letting kids choose the condiments, meat, cheese, and veggies that you put on their sandwich, or even letting them make the sandwich themselves with your help. Serving tacos with an array of different items they can add to them as they like, such as seasoned ground beef or vegetarian crumbles, shredded cheese, shredded lettuce, chopped tomatoes, sour cream, guacamole, and salsa."
        }
      ]
    },
    {
      "name":"Involving Kids in the Cooking Process",
      "steps":[
        {
          "headline":"Choose kid-friendly recipes to make together.",
          "description":"Don’t try to tackle an advanced recipe the first time you have the kids helping you in the kitchen. Select recipes that are kid-friendly and that will be relatively quick to make. This will reduce the chances that the kids will lose interest in the cooking process. To ensure that recipes are kid-friendly, try getting a cookbook meant for kids or browse kid-friendly recipes online."
        },
        {
          "headline":"Assign the kids age specific tasks.",
          "description":"Cooking with kids is a great way to help them learn an important life skill, encourage them to eat healthy foods, and build their confidence. However, not all cooking tasks are suitable for younger kids. Make sure to set the kids to a task that will be safe and realistic for them to tackle. For example, you could involve younger kids in making tacos by having them rinse the lettuce in a colander, while an older child could chop the onions and tomatoes. Have kids help with measuring ingredients for cooking and baking by giving them measuring cups and spoons and having them place 1 ingredient into a small bowl at a time, then handing it to you to add to the recipe. Kids who are old enough to read could help by calling out ingredients to you from the recipe."
        },
        {
          "headline":"Teach kids how to stay safe in the kitchen.",
          "description":"There are lots of ways that kids can get hurt in a kitchen, so it is important to watch them carefully and provide frequent reminders to keep them safe. This is important for young kids as well as older kids. Make sure kids know to use a potholder to touch anything that might be hot. Err on the side of caution and do not let younger kids touch hot things in the kitchen. Teach them to be careful when chopping veggies. Show them how to hold a knife to protect their fingers, and don’t let them do this until they are old enough to do so safely. Also, make sure that they keep their fingers clear of the mixer when it is switched on."
        },
        {
          "headline":"Give kids a break if the recipe will take a while.",
          "description":"If you do decide to tackle a more time-intensive recipe, make sure to give the kids breaks from helping you. This will help to ensure that they do not start to associate the kitchen with drudgery. Cooking should feel like a fun activity for kids, not a punishment! For example, if the kids finish their tasks and you do not have anything that they can do for about 30 minutes, let them go play outside or in their room until you need their help again. If you want to keep kids occupied in the kitchen, but do not have a cooking task for them to do at the moment, have them set the table or organize your spice rack."
        }
      ]
    },
    {
      "name":"Deciding What to Cook for Kids",
      "steps":[
        {
          "headline":"Ask the kids about their favorite foods.",
          "description":"Talking with kids before you decide what to make may increase the chances that they will want to eat it! Take a moment to ask the kids what they want to eat. If you are babysitting, make sure to ask the parents what the kids like to eat. They might even have meals already prepared for their kids that you will only have to heat up. If you know what your kids will most likely enjoy and they are not home yet to ask them what they want, then go with the safest option."
        },
        {
          "headline":"Provide only 2 or 3 options make the decision easier for kids.",
          "description":"To avoid getting responses that you cannot satisfy, try offering them a few options that you can make and that you know they will like. This will make it easier for the kids to decide what they want. For example, you could say to the kids, “We have a choice of chicken fingers and sweet potato chips or veggie mac n’ cheese for dinner tonight. Which would you rather have?”"
        },
        {
          "headline":"Look at cookbooks with the kids to plan meals for the week.",
          "description":"You can invite the kids to browse through cookbooks to get new ideas for cooking for them. Pull out a few cookbooks and set the kids to the task of finding recipes they would like to try. Give younger kids a stack of cookbooks and sticky notes and ask them to place a note on the pages with foods they want to try. Make sure the cookbooks have pictures so they will be able to see the recipes even if they cannot read them yet. For older kids, give them a pen and pencil to write down recipes they would like to make, along with the page number, and any ingredients you will need."
        },
        {
          "headline":"Visit cooking websites and pull up some kid-friendly recipes.",
          "description":"You can also search for recipes online to find something to make for the kids. Search by dish or type, such as  “soups” or “healthy recipes for kids”. Then, show the options to the kids to see what they might be interested in. You can also involve kids in searching for recipes by asking them what they want to eat, and then searching for recipes. For example, if the kids say they want to eat spaghetti and meatballs, then search for “spaghetti and meatball recipes.”\nYou can involve older kids by having them find recipes on their own and having them print out the recipes they want to try."
        }
      ]
    },
    {
      "name":"Getting Your Kids to Try New Foods",
      "steps":[
        {
          "headline":"Let your kids pick out a new fruit or vegetable when you go shopping.",
          "description":"You can tap into your kids’ natural curiosity by inviting them to find a new fruit or veggie in the produce department each time you visit the store and then prepare that for them as part of a meal. This can be a fun way to get your kids to try new things and keep them entertained for a few minutes in the grocery store! For example, if your child chooses rhubarb, you could make a rhubarb pie with them. If your child chooses oyster mushrooms, you could add them into a vegetable stir-fry. If they choose apple, then you can try making homemade jello for them with apples. Keep in mind that your kids may search out the strangest looking item they can find, but this is a good thing! Encourage their adventurous nature by showing excitement about what they picked, even if you are not quite sure what it is."
        },
        {
          "headline":"Work some new foods into the recipes you choose.",
          "description":"Whether you are making an old favorite for your kids or trying out something totally different. Make sure to work some new foods into your kids’ meals, even if you are just adding a new vegetable as a side dish. Make sure to offer new foods when your child is relaxed and in a good mood. Avoid offering a new food when your child is very hungry. Act casual and model for your kids when you offer the new food. Try the food, offer some to your kids, and say something like, “Mmm. This garlicky broccoli is fantastic!”"
        },
        {
          "headline":"Be aware that it may take 10 tries before your kids like a new food.",
          "description":"Don’t give up if you offer a new food and your kids reject it. Keep offering the food! It may take 10 or more times of offering the food before your child finally enjoys the food! For example, if you offer red cabbage as a side dish 1 night, and your kids say they don’t like it, don’t stop making and offering it. Keep making it, eat and enjoy it yourself, and keep offering it to your kids. Make sure that you do not force your kids to try a new food. Just put it out and offer it to them."
        }
      ]
    }
  ],
  "text":" Making Kid-Friendly Meals Offer them some finger foods. Foods that kids can easily grasp and eat without a fork or a spoon are often a big hit with kids. Look up recipes for finger foods or see what you have on hand to make that would be utensil-free. Some finger food options include:\n\nChicken nuggets or tofu nuggets and sweet potato fries with their favorite dipping sauces. Chicken, beef, or tofu and veggie kabobs (skewers). Grilled cheese sandwiches with baby carrots and ranch dressing. You could even cut the sandwiches into fun shapes to help make them more interesting to kids. Stick with simple flavors and cuisine types. Most kids don’t have sophisticated palates, so they prefer simple flavors and cuisine-types that they recognize. Avoid offering something that includes too many different flavors or that might seem unusual to them. For example, you might enjoy spicy or vinegary pasta sauce, but a child might be put off by this. If you make spaghetti, stick with a simple tomato sauce with just 1 or 2 herbs added to it. Likewise, you might love Indian food, but a child who has never tried it before might not be as excited if you put a plate of chana masala and saag paneer in front of them. Try making a face with the food. Adding a touch of whimsy to your cooking is a great way to get kids interested in their meal. Some ways you can do this include:\nUsing berries and whipped cream to make a face on a pancake. Creating a pizza face with pepperoni eyes, a black olive nose, and a sweet pepper strip mouth. Placing 2 meatballs on a plate of spaghetti for eyes and then using sauce to create a big smile. Create a do-it-yourself meal. Allowing the kids to assemble their food before or after you cook it can also be a great way to get them interested in eating it. Some options to try include:\nHaving kids put toppings on their own mini pizzas before you put the pizzas in the oven. Letting kids choose the condiments, meat, cheese, and veggies that you put on their sandwich, or even letting them make the sandwich themselves with your help. Serving tacos with an array of different items they can add to them as they like, such as seasoned ground beef or vegetarian crumbles, shredded cheese, shredded lettuce, chopped tomatoes, sour cream, guacamole, and salsa. Involving Kids in the Cooking Process Choose kid-friendly recipes to make together. Don’t try to tackle an advanced recipe the first time you have the kids helping you in the kitchen. Select recipes that are kid-friendly and that will be relatively quick to make. This will reduce the chances that the kids will lose interest in the cooking process. To ensure that recipes are kid-friendly, try getting a cookbook meant for kids or browse kid-friendly recipes online. Assign the kids age specific tasks. Cooking with kids is a great way to help them learn an important life skill, encourage them to eat healthy foods, and build their confidence. However, not all cooking tasks are suitable for younger kids. Make sure to set the kids to a task that will be safe and realistic for them to tackle. For example, you could involve younger kids in making tacos by having them rinse the lettuce in a colander, while an older child could chop the onions and tomatoes. Have kids help with measuring ingredients for cooking and baking by giving them measuring cups and spoons and having them place 1 ingredient into a small bowl at a time, then handing it to you to add to the recipe. Kids who are old enough to read could help by calling out ingredients to you from the recipe. Teach kids how to stay safe in the kitchen. There are lots of ways that kids can get hurt in a kitchen, so it is important to watch them carefully and provide frequent reminders to keep them safe. This is important for young kids as well as older kids. Make sure kids know to use a potholder to touch anything that might be hot. Err on the side of caution and do not let younger kids touch hot things in the kitchen. Teach them to be careful when chopping veggies. Show them how to hold a knife to protect their fingers, and don’t let them do this until they are old enough to do so safely. Also, make sure that they keep their fingers clear of the mixer when it is switched on. Give kids a break if the recipe will take a while. If you do decide to tackle a more time-intensive recipe, make sure to give the kids breaks from helping you. This will help to ensure that they do not start to associate the kitchen with drudgery. Cooking should feel like a fun activity for kids, not a punishment! For example, if the kids finish their tasks and you do not have anything that they can do for about 30 minutes, let them go play outside or in their room until you need their help again. If you want to keep kids occupied in the kitchen, but do not have a cooking task for them to do at the moment, have them set the table or organize your spice rack. Deciding What to Cook for Kids Ask the kids about their favorite foods. Talking with kids before you decide what to make may increase the chances that they will want to eat it! Take a moment to ask the kids what they want to eat. If you are babysitting, make sure to ask the parents what the kids like to eat. They might even have meals already prepared for their kids that you will only have to heat up. If you know what your kids will most likely enjoy and they are not home yet to ask them what they want, then go with the safest option. Provide only 2 or 3 options make the decision easier for kids. To avoid getting responses that you cannot satisfy, try offering them a few options that you can make and that you know they will like. This will make it easier for the kids to decide what they want. For example, you could say to the kids, “We have a choice of chicken fingers and sweet potato chips or veggie mac n’ cheese for dinner tonight. Which would you rather have?” Look at cookbooks with the kids to plan meals for the week. You can invite the kids to browse through cookbooks to get new ideas for cooking for them. Pull out a few cookbooks and set the kids to the task of finding recipes they would like to try. Give younger kids a stack of cookbooks and sticky notes and ask them to place a note on the pages with foods they want to try. Make sure the cookbooks have pictures so they will be able to see the recipes even if they cannot read them yet. For older kids, give them a pen and pencil to write down recipes they would like to make, along with the page number, and any ingredients you will need. Visit cooking websites and pull up some kid-friendly recipes. You can also search for recipes online to find something to make for the kids. Search by dish or type, such as  “soups” or “healthy recipes for kids”. Then, show the options to the kids to see what they might be interested in. You can also involve kids in searching for recipes by asking them what they want to eat, and then searching for recipes. For example, if the kids say they want to eat spaghetti and meatballs, then search for “spaghetti and meatball recipes.”\nYou can involve older kids by having them find recipes on their own and having them print out the recipes they want to try. Getting Your Kids to Try New Foods Let your kids pick out a new fruit or vegetable when you go shopping. You can tap into your kids’ natural curiosity by inviting them to find a new fruit or veggie in the produce department each time you visit the store and then prepare that for them as part of a meal. This can be a fun way to get your kids to try new things and keep them entertained for a few minutes in the grocery store! For example, if your child chooses rhubarb, you could make a rhubarb pie with them. If your child chooses oyster mushrooms, you could add them into a vegetable stir-fry. If they choose apple, then you can try making homemade jello for them with apples. Keep in mind that your kids may search out the strangest looking item they can find, but this is a good thing! Encourage their adventurous nature by showing excitement about what they picked, even if you are not quite sure what it is. Work some new foods into the recipes you choose. Whether you are making an old favorite for your kids or trying out something totally different. Make sure to work some new foods into your kids’ meals, even if you are just adding a new vegetable as a side dish. Make sure to offer new foods when your child is relaxed and in a good mood. Avoid offering a new food when your child is very hungry. Act casual and model for your kids when you offer the new food. Try the food, offer some to your kids, and say something like, “Mmm. This garlicky broccoli is fantastic!” Be aware that it may take 10 tries before your kids like a new food. Don’t give up if you offer a new food and your kids reject it. Keep offering the food! It may take 10 or more times of offering the food before your child finally enjoys the food! For example, if you offer red cabbage as a side dish 1 night, and your kids say they don’t like it, don’t stop making and offering it. Keep making it, eat and enjoy it yourself, and keep offering it to your kids. Make sure that you do not force your kids to try a new food. Just put it out and offer it to them.",
  "tyn_model":[
    "spaghetti",
    "tomatoes",
    "fork",
    "spoon",
    "finger food",
    "sweet potato fries",
    "dipping sauces",
    "baby carrots",
    "ranch dressing",
    "pasta sauce",
    "chana masala",
    "saag paneer",
    "berries",
    "whipped cream",
    "pancake",
    "sweet pepper",
    "oven",
    "tacos",
    "sour cream",
    "guacamole",
    "salsa",
    "lettuce",
    "colander",
    "measuring cups",
    "spoons",
    "potholder",
    "knife",
    "mixer",
    "cooking",
    "spice rack",
    "“we",
    "chicken fingers",
    "sweet potato chips",
    "’ cheese",
    "” look",
    "cookbooks",
    "sticky notes",
    "pen",
    "pencil",
    "cooking websites",
    "“soups",
    "” or",
    "“healthy",
    "”.",
    "“spaghetti",
    "”\n",
    "’ natural",
    "rhubarb",
    "rhubarb pie",
    "oyster mushrooms",
    "vegetable stir-fry",
    "apple",
    "jello",
    "apples",
    "’ meals",
    "vegetable",
    "“mmm",
    "broccoli",
    "” be",
    "red cabbage"
  ],
  "tyn_section":[

  ]
}