{
  "title":"How to Draw a Great White Shark",
  "url":"https://www.wikihow.com/Draw-a-Great-White-Shark",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "steps":[
    {
      "headline":"Draw a large almond shape in the center of the paper this will be the body of the Great White.",
      "description":"Be sure to make the almond about 4-5 inches long and about 2 inches tall. Do not make it too rounded."
    },
    {
      "headline":"Draw a dot half an inch outside of the body.",
      "description":"This will be the start of the back fin also known as the caudal fin."
    },
    {
      "headline":"Draw a diagonal line going to the top left and bottom left corners coming from the dot.",
      "description":"Make sure it is slanted at about a 60-degree angle and extend the lines about an inch each."
    },
    {
      "headline":"Draw a line coming from the last diagonal lines until met with the body of the shark to create the caudal fin.",
      "description":"Be sure to slant the lines inwards to meet the body."
    },
    {
      "headline":"Draw a triangle on top of the oval with a curved left side to create the dorsal fin.",
      "description":"Draw the curve just slightly facing inward to the triangle."
    },
    {
      "headline":"Add a long slender triangle off the bottom of the body.",
      "description":"This triangle will have a pointed but rounded tip and begin with a half line coming from the body."
    },
    {
      "headline":"Draw another triangle on the bottom of the oval to the right of the pectoral fin.",
      "description":"Notice this triangle will be a bit smaller than the last, to keep perspective accurate as it is located on the opposite side of the body."
    },
    {
      "headline":"Draw a small dot on the right side of the oval placed towards the top to create the eye.",
      "description":"Draw this dot just a little larger than the tip of the pencil."
    },
    {
      "headline":"Draw a straight line from the right side of the oval until it's even with the eye.it",
      "description":"Begin this line by following the curve of the nose and hooking it inward."
    },
    {
      "headline":"Make a small curved line below the mouth, towards the body, to create the bottom jaw.",
      "description":"Make this line about 1 cm off the upper jaw bone."
    },
    {
      "headline":"Add tiny triangles all along the bottom of the horizontal line to create the teeth.",
      "description":"There should be about 5-7 teeth added in."
    },
    {
      "headline":"Draw to the left of the mouth 4 vertical lines, these will be the gills.",
      "description":"Draw these lines a little bit jagged and leave a space between each line."
    },
    {
      "headline":"Draw from the nose a jagged horizontal line along the lower half of the body until met with the caudal fin.",
      "description":"This will create the separation for shading the great white."
    },
    {
      "headline":"Erase additional lines.",
      "description":"Erase lines where fins meet the body, and erase where we shortened the lower jaw."
    },
    {
      "headline":"Shade the great white shark.",
      "description":"Hold your pencil lightly and shade the shark in one direction on the upper half of the jagged line."
    }
  ],
  "text":" Draw a large almond shape in the center of the paper this will be the body of the Great White. Be sure to make the almond about 4-5 inches long and about 2 inches tall. Do not make it too rounded. Draw a dot half an inch outside of the body. This will be the start of the back fin also known as the caudal fin. Draw a diagonal line going to the top left and bottom left corners coming from the dot. Make sure it is slanted at about a 60-degree angle and extend the lines about an inch each. Draw a line coming from the last diagonal lines until met with the body of the shark to create the caudal fin. Be sure to slant the lines inwards to meet the body. Draw a triangle on top of the oval with a curved left side to create the dorsal fin. Draw the curve just slightly facing inward to the triangle. Add a long slender triangle off the bottom of the body. This triangle will have a pointed but rounded tip and begin with a half line coming from the body. Draw another triangle on the bottom of the oval to the right of the pectoral fin. Notice this triangle will be a bit smaller than the last, to keep perspective accurate as it is located on the opposite side of the body. Draw a small dot on the right side of the oval placed towards the top to create the eye. Draw this dot just a little larger than the tip of the pencil. Draw a straight line from the right side of the oval until it's even with the eye.it Begin this line by following the curve of the nose and hooking it inward. Make a small curved line below the mouth, towards the body, to create the bottom jaw. Make this line about 1 cm off the upper jaw bone. Add tiny triangles all along the bottom of the horizontal line to create the teeth. There should be about 5-7 teeth added in. Draw to the left of the mouth 4 vertical lines, these will be the gills. Draw these lines a little bit jagged and leave a space between each line. Draw from the nose a jagged horizontal line along the lower half of the body until met with the caudal fin. This will create the separation for shading the great white. Erase additional lines. Erase lines where fins meet the body, and erase where we shortened the lower jaw. Shade the great white shark. Hold your pencil lightly and shade the shark in one direction on the upper half of the jagged line.",
  "tyn_model":[
    "great white",
    "triangle",
    "pencil",
    "paper",
    "almond",
    "shark",
    "great white shark"
  ],
  "tyn_section":[

  ]
}