{
  "title":"How to Make Samosa Chaat",
  "url":"https://www.wikihow.com/Make-Samosa-Chaat",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Vegetarian Indian Dishes"
  ],
  "parts":[
    {
      "name":"Making the Samosa Dough",
      "steps":[
        {
          "headline":"Put 2 cups of all-purpose flour in a big mixing bowl.",
          "description":"This will form the base of the samosa dough."
        },
        {
          "headline":"Add ½ tsp of vegetable oil, 1 tsp of salt and ½ cup of water to it.",
          "description":"Use your hand to mix in the wet ingredients."
        },
        {
          "headline":"Mix the flour with your hand.",
          "description":"Keep mixing until the dough begins to form a ball. It should be dry and a little flaky."
        },
        {
          "headline":"Add water as needed to make the dough soft.",
          "description":"The dough should be pliable as it will be rolled out later. Do not add too much water or it will be too thin."
        },
        {
          "headline":"Add additional vegetable oil.",
          "description":"When the dough is mixed up and is consistent in texture, add ½ tsp of vegetable oil and mix it again."
        },
        {
          "headline":"Leave the dough to rest for 30 minutes.",
          "description":"This helps it to achieve a better structure by allowing gluten molecules to form. This allows the dough to stretch."
        }
      ]
    },
    {
      "name":"Making the Samosa Filling",
      "steps":[
        {
          "headline":"Put 2 tablespoons olive oil to a frying pan.",
          "description":"Heat over medium flame for 3 minutes. Make sure the oil does not smoke and burn."
        },
        {
          "headline":"Add ½ tsp of the cumin seed to the pan.",
          "description":"Toast it until the seeds start to crackle."
        },
        {
          "headline":"Saute ½ cup of finely chopped onions with the seeds for about 5 minutes until the onion turns light pink.",
          "description":"Stir the mix well while cooking."
        },
        {
          "headline":"Mix in the potatoes and ½ cup of boiled peas in the pan.",
          "description":"Again stir the mix well while cooking."
        },
        {
          "headline":"Add additional spices.",
          "description":"Once the vegetables are well mixed, add red chili powder, turmeric powder, garam masala powder, coriander powder and chopped green chili. Mix it all together for one minute."
        },
        {
          "headline":"Remove it from heat and cool it.",
          "description":"The filling is easier to use and less likely to separate when it is cooled."
        }
      ]
    },
    {
      "name":"Making the Samosa",
      "steps":[
        {
          "headline":"Divide the dough in about 12 equal parts.",
          "description":"Roll it into a ball and flatten each one."
        },
        {
          "headline":"Roll each round into a thin base.",
          "description":"Use a rolling pin or firmly press it with fingers to form a circle."
        },
        {
          "headline":"Cut each base into two halves using a knife.",
          "description":"There will be 2 semicircles of dough."
        },
        {
          "headline":"Spoon 2 tablespoons of the filling into the center of the base.",
          "description":"Position the cut edge up and place the filling in a V shape. Leave space at the edge for sealing up the dough."
        },
        {
          "headline":"Seal the edges using a little water.",
          "description":"Form the dough and filling into a cone shape. Pinch together the edges to seal in the filling. A little water on the dough will help the seam to stick."
        },
        {
          "headline":"Repeat the process with the remaining dough.",
          "description":"Use a little flour to prevent samosas from sticking to the each other."
        },
        {
          "headline":"Heat the oil in a frying pan.",
          "description":"Do not let the oil smoke as it will then be too hot. Putting cold food in over hot oil can cause it to spatter."
        },
        {
          "headline":"Fry the filled samosa in the oil.",
          "description":"Fry it until the crust becomes a light golden brown."
        },
        {
          "headline":"Drain off excess oil.",
          "description":"Place the samosa on absorbent material to maximise crispy texture. They will become soggy and greasy tasting if excess oil is not removed."
        }
      ]
    },
    {
      "name":"Preparing Chole Masala",
      "steps":[
        {
          "headline":"Heat the oil in a wide skillet.",
          "description":"Make sure the oil does not smoke and burn."
        },
        {
          "headline":"Sauté the onion.",
          "description":"Cook until the onion is translucent."
        },
        {
          "headline":"Add the garlic.",
          "description":"Continue to sauté until the onion is golden. This can happen quickly as the onions are already cooked. Make sure you watch the onions or it can get burned."
        },
        {
          "headline":"Add the remaining ingredients.",
          "description":"Add the chickpeas, garam masala, turmeric, ginger, tomatoes, lemon juice and about 1/4 cup water into the pan."
        },
        {
          "headline":"Bring to a simmer.",
          "description":"Turn down the heat and stir frequently. Cook over medium heat for 10 minutes. Make sure the chickpeas are soft and ready to eat. This should be moist and stew-like, not soupy."
        },
        {
          "headline":"Stir in the cilantro and season with salt to taste.",
          "description":"Flavor according to personal preference."
        }
      ]
    },
    {
      "name":"Assembling the Chaat Samosa",
      "steps":[
        {
          "headline":"Pour the chana masala in a plate.",
          "description":"Use a plate with a lip edge to avoid spillage."
        },
        {
          "headline":"Place the samosa on top of it.",
          "description":"These should be drained of oil to keep them crispy."
        },
        {
          "headline":"Break or smash the samosa.",
          "description":"With a spoon or other utensil, press down on the samosa."
        },
        {
          "headline":"Flavor with condiments.",
          "description":"Add green chutney, red garlic chutney and sweet tamarind chutney on top of it if you like it spicier."
        },
        {
          "headline":"Add some chopped onions and tomatoes.",
          "description":"Add extra relish with more chopped onion and tomato."
        },
        {
          "headline":"Garnish it with cilantro.",
          "description":"The samosa chaat is ready to serve. Enjoy."
        }
      ]
    }
  ],
  "text":" Making the Samosa Dough Put 2 cups of all-purpose flour in a big mixing bowl. This will form the base of the samosa dough. Add ½ tsp of vegetable oil, 1 tsp of salt and ½ cup of water to it. Use your hand to mix in the wet ingredients. Mix the flour with your hand. Keep mixing until the dough begins to form a ball. It should be dry and a little flaky. Add water as needed to make the dough soft. The dough should be pliable as it will be rolled out later. Do not add too much water or it will be too thin. Add additional vegetable oil. When the dough is mixed up and is consistent in texture, add ½ tsp of vegetable oil and mix it again. Leave the dough to rest for 30 minutes. This helps it to achieve a better structure by allowing gluten molecules to form. This allows the dough to stretch. Making the Samosa Filling Put 2 tablespoons olive oil to a frying pan. Heat over medium flame for 3 minutes. Make sure the oil does not smoke and burn. Add ½ tsp of the cumin seed to the pan. Toast it until the seeds start to crackle. Saute ½ cup of finely chopped onions with the seeds for about 5 minutes until the onion turns light pink. Stir the mix well while cooking. Mix in the potatoes and ½ cup of boiled peas in the pan. Again stir the mix well while cooking. Add additional spices. Once the vegetables are well mixed, add red chili powder, turmeric powder, garam masala powder, coriander powder and chopped green chili. Mix it all together for one minute. Remove it from heat and cool it. The filling is easier to use and less likely to separate when it is cooled. Making the Samosa Divide the dough in about 12 equal parts. Roll it into a ball and flatten each one. Roll each round into a thin base. Use a rolling pin or firmly press it with fingers to form a circle. Cut each base into two halves using a knife. There will be 2 semicircles of dough. Spoon 2 tablespoons of the filling into the center of the base. Position the cut edge up and place the filling in a V shape. Leave space at the edge for sealing up the dough. Seal the edges using a little water. Form the dough and filling into a cone shape. Pinch together the edges to seal in the filling. A little water on the dough will help the seam to stick. Repeat the process with the remaining dough. Use a little flour to prevent samosas from sticking to the each other. Heat the oil in a frying pan. Do not let the oil smoke as it will then be too hot. Putting cold food in over hot oil can cause it to spatter. Fry the filled samosa in the oil. Fry it until the crust becomes a light golden brown. Drain off excess oil. Place the samosa on absorbent material to maximise crispy texture. They will become soggy and greasy tasting if excess oil is not removed. Preparing Chole Masala Heat the oil in a wide skillet. Make sure the oil does not smoke and burn. Sauté the onion. Cook until the onion is translucent. Add the garlic. Continue to sauté until the onion is golden. This can happen quickly as the onions are already cooked. Make sure you watch the onions or it can get burned. Add the remaining ingredients. Add the chickpeas, garam masala, turmeric, ginger, tomatoes, lemon juice and about 1/4 cup water into the pan. Bring to a simmer. Turn down the heat and stir frequently. Cook over medium heat for 10 minutes. Make sure the chickpeas are soft and ready to eat. This should be moist and stew-like, not soupy. Stir in the cilantro and season with salt to taste. Flavor according to personal preference. Assembling the Chaat Samosa Pour the chana masala in a plate. Use a plate with a lip edge to avoid spillage. Place the samosa on top of it. These should be drained of oil to keep them crispy. Break or smash the samosa. With a spoon or other utensil, press down on the samosa. Flavor with condiments. Add green chutney, red garlic chutney and sweet tamarind chutney on top of it if you like it spicier. Add some chopped onions and tomatoes. Add extra relish with more chopped onion and tomato. Garnish it with cilantro. The samosa chaat is ready to serve. Enjoy.",
  "tyn_model":[
    "oil",
    "water",
    "vegetable oil",
    "onions",
    "salt",
    "flour",
    "frying pan",
    "chickpeas",
    "tomatoes",
    "cilantro",
    "plate",
    "all-purpose flour",
    "big mixing bowl",
    "olive oil",
    "cumin",
    "potatoes",
    "boiled peas",
    "pan",
    "spices",
    "red chili powder",
    "turmeric powder",
    "garam masala powder",
    "coriander",
    "green chili",
    "rolling pin",
    "knife",
    "wide skillet",
    "onion",
    "garlic",
    "garam masala",
    "turmeric",
    "ginger",
    "lemon",
    "chana masala",
    "spoon",
    "green chutney",
    "red garlic chutney",
    "sweet tamarind chutney",
    "chopped onions",
    "tomato"
  ],
  "tyn_section":[

  ]
}