{
  "title":"How to Shrink Joggers",
  "url":"https://www.wikihow.com/Shrink-Joggers",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry"
  ],
  "methods":[
    {
      "name":"Hot-washing Your Joggers",
      "steps":[
        {
          "headline":"Place your joggers in the washing machine on a hot wash.",
          "description":"Remove any tissues, coins, or other objects from the pockets and place your joggers into the washing machine. Turn the machine on, select the hot wash option, and press start. If you’re joggers are dirty, read the instructions on your laundry detergent packet and add the powder or liquid as directed. If the joggers are clean, there is no need to add detergent. This method is most effective for joggers made from natural fibres such as cotton, linen, or wool. Choose the longest wash cycle available. This will give the joggers more exposure to hot water which will help encourage them to shrink."
        },
        {
          "headline":"Squeeze any excess water out of the joggers.",
          "description":"This will help to speed up the drying process. Don’t worry about squeezing all the water from the joggers, just squeeze them enough to remove drips."
        },
        {
          "headline":"Place the joggers into the dryer for 20 minutes on the hottest setting.",
          "description":"Check the joggers after 20 minutes and if they are still wet, place them back in the dryer for a further 10 minutes. Remove the joggers once they are completely dry. If your joggers have any prints on them, turn the pants inside out before placing them in the dryer. This will help to protect the prints from being damaged by the heat and agitation of the dryer."
        },
        {
          "headline":"Try your joggers on and repeat the above steps if they are still too big.",
          "description":"Wait for your joggers to cool down to room temperature before trying them on. Walk around in them for a few minutes to determine if they are still too baggy. If you are unhappy with the size, put them through another hot wash and drying cycle. Continue to repeat the process until you are happy with the size of the joggers or until they stop shrinking. The joggers will not normally shrink more than 1 size."
        }
      ]
    },
    {
      "name":"Using a Steam Iron",
      "steps":[
        {
          "headline":"Lay your joggers flat on an ironing board.",
          "description":"Place your ironing board in a location close to a power jack. Open out your joggers so that both legs lie flat on the ironing board and remove any objects from the pockets. If you don’t have an ironing board, lay a thick towel onto a wooden or concrete floor and use this surface to iron on instead."
        },
        {
          "headline":"Fill your steam iron up with water and set it to the “high” setting.",
          "description":"Make sure not to fill the iron past the “maximum” line as this can cause it to leak onto the fabric and cause watermarks. Wait 5 minutes for the iron to heat up. This method is not suitable for silk or rayon joggers as the heat and steam of the iron will damage the fabric and cause watermarks. It is important to use a steam iron as it is the combination of heat and steam that causes the joggers to shrink."
        },
        {
          "headline":"Rub the steam iron over both sides of the joggers.",
          "description":"Press the iron onto the joggers and rub it over the joggers. Once all the fabric has been exposed to the heat of the iron, turn the joggers over and iron the other side. This will take about 5 minutes. The combination of the steam and heat will help to shrink the joggers. If the joggers have any prints on them, turn them inside out before you iron them."
        },
        {
          "headline":"Iron the joggers again if they are still too big.",
          "description":"Wait for the joggers to cool down to room temperature and then try them on again. If they still feel a bit roomy, steam iron them again to shrink them further. The joggers will not generally shrink more than 1 size. If the joggers are not shrinking any further with extra ironing, this shows that they have reached their smallest size."
        }
      ]
    }
  ],
  "text":" Hot-washing Your Joggers Place your joggers in the washing machine on a hot wash. Remove any tissues, coins, or other objects from the pockets and place your joggers into the washing machine. Turn the machine on, select the hot wash option, and press start. If you’re joggers are dirty, read the instructions on your laundry detergent packet and add the powder or liquid as directed. If the joggers are clean, there is no need to add detergent. This method is most effective for joggers made from natural fibres such as cotton, linen, or wool. Choose the longest wash cycle available. This will give the joggers more exposure to hot water which will help encourage them to shrink. Squeeze any excess water out of the joggers. This will help to speed up the drying process. Don’t worry about squeezing all the water from the joggers, just squeeze them enough to remove drips. Place the joggers into the dryer for 20 minutes on the hottest setting. Check the joggers after 20 minutes and if they are still wet, place them back in the dryer for a further 10 minutes. Remove the joggers once they are completely dry. If your joggers have any prints on them, turn the pants inside out before placing them in the dryer. This will help to protect the prints from being damaged by the heat and agitation of the dryer. Try your joggers on and repeat the above steps if they are still too big. Wait for your joggers to cool down to room temperature before trying them on. Walk around in them for a few minutes to determine if they are still too baggy. If you are unhappy with the size, put them through another hot wash and drying cycle. Continue to repeat the process until you are happy with the size of the joggers or until they stop shrinking. The joggers will not normally shrink more than 1 size. Using a Steam Iron Lay your joggers flat on an ironing board. Place your ironing board in a location close to a power jack. Open out your joggers so that both legs lie flat on the ironing board and remove any objects from the pockets. If you don’t have an ironing board, lay a thick towel onto a wooden or concrete floor and use this surface to iron on instead. Fill your steam iron up with water and set it to the “high” setting. Make sure not to fill the iron past the “maximum” line as this can cause it to leak onto the fabric and cause watermarks. Wait 5 minutes for the iron to heat up. This method is not suitable for silk or rayon joggers as the heat and steam of the iron will damage the fabric and cause watermarks. It is important to use a steam iron as it is the combination of heat and steam that causes the joggers to shrink. Rub the steam iron over both sides of the joggers. Press the iron onto the joggers and rub it over the joggers. Once all the fabric has been exposed to the heat of the iron, turn the joggers over and iron the other side. This will take about 5 minutes. The combination of the steam and heat will help to shrink the joggers. If the joggers have any prints on them, turn them inside out before you iron them. Iron the joggers again if they are still too big. Wait for the joggers to cool down to room temperature and then try them on again. If they still feel a bit roomy, steam iron them again to shrink them further. The joggers will not generally shrink more than 1 size. If the joggers are not shrinking any further with extra ironing, this shows that they have reached their smallest size.",
  "tyn_model":[
    "iron",
    "joggers",
    "steam iron",
    "water",
    "dryer",
    "ironing board",
    "washing machine",
    "laundry detergent",
    "detergent",
    "pants",
    "“high",
    "” setting",
    "“maximum",
    "” line",
    "fabric",
    "ironing"
  ],
  "tyn_section":[

  ]
}