{
  "title":"How to Connect a Nintendo Switch to WiFi",
  "url":"https://www.wikihow.com/Connect-a-Nintendo-Switch-to-WiFi",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles"
  ],
  "steps":[
    {
      "headline":"Go to the Home screen.",
      "description":"If you are running software on the Nintendo Switch, press the button with the icon that resembles a home on the right joy con controller to return to the home screen. Or power on the Nintendo Switch, press \"A\" on the right joy-con and then press the same button three times. You can also connect to a Wi-Fi network during the initial setup of the Nintendo Switch. Read \"How to Set Up the Nintendo Switch\" to learn more about how to set up a brand new Nintendo Switch."
    },
    {
      "headline":"Select the gear icon.",
      "description":"The System Settings menu is the icon that resembles a gear on the home screen of the Nintendo Switch. To select items on the Nintendo Switch, navigate to them using the directional buttons, or analogue stick on the left joy-con controller, and then press \"A\" on the right joy-con controller. You can select items by tapping them on the Nintendo Switch touch screen."
    },
    {
      "headline":"Select Internet.",
      "description":"It's the sixth option in the System Settings menu. This displays your internet options and connection settings."
    },
    {
      "headline":"Select Internet Settings.",
      "description":"This searches for Wi-Fi networks that you can connect to."
    },
    {
      "headline":"Select a Wi-Fi network.",
      "description":"When you see the network you want to connect to, tap it or select it using the joy-con controllers."
    },
    {
      "headline":"Select Connect to this Network.",
      "description":"This either prompts you to enter the Wi-Fi password, or connects to the network if no password is required."
    },
    {
      "headline":"Type the network password and press +.",
      "description":"Use the on-screen keyboard to type the Wi-Fi password. Press the \"+\" button on the right joy-con controller, or tap \"Ok\" on the screen when you are finished. Allow a few moments for the Nintendo Switch to connect to the network. A message that says \"Successfully connected\" when the Nintendo Switch is connected to the Wi-Fi network."
    },
    {
      "headline":"Click Ok.",
      "description":"This takes you back to the Internet menu in System Settings. You are now connected to a Wi-Fi network."
    }
  ],
  "text":" Go to the Home screen. If you are running software on the Nintendo Switch, press the button with the icon that resembles a home on the right joy con controller to return to the home screen. Or power on the Nintendo Switch, press \"A\" on the right joy-con and then press the same button three times. You can also connect to a Wi-Fi network during the initial setup of the Nintendo Switch. Read \"How to Set Up the Nintendo Switch\" to learn more about how to set up a brand new Nintendo Switch. Select the gear icon. The System Settings menu is the icon that resembles a gear on the home screen of the Nintendo Switch. To select items on the Nintendo Switch, navigate to them using the directional buttons, or analogue stick on the left joy-con controller, and then press \"A\" on the right joy-con controller. You can select items by tapping them on the Nintendo Switch touch screen. Select Internet. It's the sixth option in the System Settings menu. This displays your internet options and connection settings. Select Internet Settings. This searches for Wi-Fi networks that you can connect to. Select a Wi-Fi network. When you see the network you want to connect to, tap it or select it using the joy-con controllers. Select Connect to this Network. This either prompts you to enter the Wi-Fi password, or connects to the network if no password is required. Type the network password and press +. Use the on-screen keyboard to type the Wi-Fi password. Press the \"+\" button on the right joy-con controller, or tap \"Ok\" on the screen when you are finished. Allow a few moments for the Nintendo Switch to connect to the network. A message that says \"Successfully connected\" when the Nintendo Switch is connected to the Wi-Fi network. Click Ok. This takes you back to the Internet menu in System Settings. You are now connected to a Wi-Fi network.",
  "tyn_model":[
    "nintendo switch",
    "wi-fi network",
    "wi-fi password",
    "joy con controller",
    "joy-con",
    "joy-con controller",
    "joy-con controllers"
  ],
  "tyn_section":[

  ]
}