{
  "title":"How to Peel a Turnip",
  "url":"https://www.wikihow.com/Peel-a-Turnip",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Peeling Food"
  ],
  "methods":[
    {
      "name":"Peeling Your Turnip With a Paring Knife",
      "steps":[
        {
          "headline":"Cut away the top and bottom sections of the turnip with a knife.",
          "description":"After removing both domed ends, the turnip will have two flat sides. This both removes the skin and provides more stability for chopping."
        },
        {
          "headline":"Use a paring knife to slice away the top layer of skin.",
          "description":"Begin at the top of the turnip and slowly work your way around the sides using a spiral motion. This method is similar to peeling an apple. Stand over a trash can or sink while peeling to catch the discarded peels. Make sure to press firmly enough with your knife to remove the skin as well as the top layer of flesh, which produces a strong, bitter flavor when cooked."
        },
        {
          "headline":"Remove dark spots with your knife.",
          "description":"You may notice a few dark spots on the turnip's flesh as you peel. This is normal. Use your knife to gently slice off the imperfections."
        },
        {
          "headline":"Rinse the peeled turnip with cold water.",
          "description":"Your turnip is now skin-free and ready to be cooked! Consult your recipe before slicing the turnip into smaller chunks."
        }
      ]
    },
    {
      "name":"Removing Turnip Skin With a Vegetable Peeler",
      "steps":[
        {
          "headline":"Place the vegetable peeler in the hand with which you write.",
          "description":"While holding the turnip in your other hand, position the peeler blade-side down onto the surface of the turnip. Stand over a garbage can or sink as you work to collect the peelings for disposal."
        },
        {
          "headline":"Drag the peeler across the turnip’s skin.",
          "description":"Beginning at the base of the turnip, move the peeler in an outward motion away from your body. The peeler should be tracing the length of the turnip."
        },
        {
          "headline":"Continue the dragging motion while rotating the turnip.",
          "description":"After each pass of the peeler from the base to the top of the turnip, rotate it slightly to peel a new section. Gradually you will remove all of the skin, one small strip at a time."
        },
        {
          "headline":"Pass the peeler over the entire turnip a second time.",
          "description":"After removing the skin, you will need to remove the bitter underlayer of turnip flesh along with any dark spots. This second layer of flesh may appear slightly more yellow than the white turnip flesh. Be careful not to remove too much of the white flesh. You'll want to have plenty of delicious turnip left to cook later!"
        },
        {
          "headline":"Use a paring knife to slice off the top and bottom of the turnip.",
          "description":"This will remove the remaining skin that was not taken off by the vegetable peeler. You will eventually be able to place one of the flat ends on a cutting board to facilitate easier chopping. Chopping a round, wobbly object can lead to accidental cuts."
        },
        {
          "headline":"Rinse the peeled turnip.",
          "description":"Place the turnip under cold, running water to rinse away any remaining dirt. Your turnip is now ready to be chopped and cooked!"
        }
      ]
    }
  ],
  "text":" Peeling Your Turnip With a Paring Knife Cut away the top and bottom sections of the turnip with a knife. After removing both domed ends, the turnip will have two flat sides. This both removes the skin and provides more stability for chopping. Use a paring knife to slice away the top layer of skin. Begin at the top of the turnip and slowly work your way around the sides using a spiral motion. This method is similar to peeling an apple. Stand over a trash can or sink while peeling to catch the discarded peels. Make sure to press firmly enough with your knife to remove the skin as well as the top layer of flesh, which produces a strong, bitter flavor when cooked. Remove dark spots with your knife. You may notice a few dark spots on the turnip's flesh as you peel. This is normal. Use your knife to gently slice off the imperfections. Rinse the peeled turnip with cold water. Your turnip is now skin-free and ready to be cooked! Consult your recipe before slicing the turnip into smaller chunks. Removing Turnip Skin With a Vegetable Peeler Place the vegetable peeler in the hand with which you write. While holding the turnip in your other hand, position the peeler blade-side down onto the surface of the turnip. Stand over a garbage can or sink as you work to collect the peelings for disposal. Drag the peeler across the turnip’s skin. Beginning at the base of the turnip, move the peeler in an outward motion away from your body. The peeler should be tracing the length of the turnip. Continue the dragging motion while rotating the turnip. After each pass of the peeler from the base to the top of the turnip, rotate it slightly to peel a new section. Gradually you will remove all of the skin, one small strip at a time. Pass the peeler over the entire turnip a second time. After removing the skin, you will need to remove the bitter underlayer of turnip flesh along with any dark spots. This second layer of flesh may appear slightly more yellow than the white turnip flesh. Be careful not to remove too much of the white flesh. You'll want to have plenty of delicious turnip left to cook later! Use a paring knife to slice off the top and bottom of the turnip. This will remove the remaining skin that was not taken off by the vegetable peeler. You will eventually be able to place one of the flat ends on a cutting board to facilitate easier chopping. Chopping a round, wobbly object can lead to accidental cuts. Rinse the peeled turnip. Place the turnip under cold, running water to rinse away any remaining dirt. Your turnip is now ready to be chopped and cooked!",
  "tyn_model":[
    "peeler",
    "knife",
    "paring knife",
    "vegetable peeler",
    "water",
    "apple",
    "turnip flesh",
    "cutting board"
  ],
  "tyn_section":[

  ]
}