{
  "title":"How to Make a Beaded Flower",
  "url":"https://www.wikihow.com/Make-a-Beaded-Flower",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts"
  ],
  "parts":[
    {
      "name":"Making the Petals",
      "steps":[
        {
          "headline":"Gather your materials.",
          "description":"You’ll need a cord or a string, beads, scissors, and a ruler. Use the ruler to measure out the string. You may cut it to about 48 inches. For the colour of the petals, you can choose any colour that you want, but for simplicity of this task, the colour will be pink. For the middle part of the flower, also known as the disk, you might as well stick to using yellow beads. Lastly, the stem will have green beads."
        },
        {
          "headline":"Add the first set of beads for the first petal.",
          "description":"Take the string and thread through at least 8 pink beads. This will become the petal. Take 2 yellow beads and thread them with the string. You should see that you have 10 beads total on the same string."
        },
        {
          "headline":"Begin to create the first petal.",
          "description":"You will create a loop that will complete this petal. Just take one side of the string that has the pink beads and thread it through the 2 yellow beads in the opposite direction to how the yellow beads were initially threaded. You’ve created your first loop, which is now the first petal."
        },
        {
          "headline":"Start out with the second petal by adding more beads.",
          "description":"Since you’ve completed the first petal, take one side of a string and thread that with 2 yellow beads. Add 7 more beads that is the consistent colour of the first petal. You should leave out only one bead for this petal, because this will play a role for the later step."
        },
        {
          "headline":"Complete the second petal.",
          "description":"You’re going to create a second loop, but this step will be different. Use the eighth bead from the first petal, which is the last bead that has been threaded. Thread the string into that bead, then pull it through. String through the yellow beads for the second petal going in the same direction as you've already had threaded. You’ve now created the second petal. The reason why one extra bead has been left out for this petal, is that both petals are going to share that same bead. This will give the flower an “uplifting” look."
        },
        {
          "headline":"Create the rest of the petals.",
          "description":"Simply repeat the previous steps for making the petal above. Start finishing on the left side of the flower. After you've created the second petal, just complete the third petal: add two yellow beads, then seven beads, string the last bead from the previous petal, and string through the yellow beads. Stop using the string once you've completed the third petal. For the right side, you'll start by repeating the steps for the 4th and 5th petals. Once you've finished the petals on both sides of the flower, you should see that you have two strings coming from each side of the beads. They should be at least of the same length, since you should have enough string to move on to the other steps."
        }
      ]
    },
    {
      "name":"Finishing the Flower",
      "steps":[
        {
          "headline":"Complete the flower.",
          "description":"When you’ve got the flower, you’ll see that you have 2 strings coming from each side. Take one yellow bead and thread that with one string from any side. Then, take the string that is opposite from the other string and thread it to the different direction. You should be able to see that you've made a criss-cross looking pattern within that bead. Tie it with a single knot. Do not cut the strings."
        },
        {
          "headline":"Begin making half of the stem.",
          "description":"Take at least 7 green beads and thread them with two strings that must go in the same direction."
        },
        {
          "headline":"Begin the leaf.",
          "description":"Even though you’re making the stem, you’re also about to start making the leaf. Take only one string and set that aside. Add 5 green beads to thread it through that string. Thread a loop around the fifth bead. After looping around the fifth bead, use the string to thread it through the fourth bead, going in the opposite direction. Release the thread from the fourth bead."
        },
        {
          "headline":"Complete the leaf.",
          "description":"First, add two green beads to the string. Take the string and starting from the fifth bead of the stem, thread that bead, then through the sixth and seventh beads. This string should go in the same direction as the other string that has not been used."
        },
        {
          "headline":"Make the second leaf (optional).",
          "description":"Simply repeat the steps above for the first leaf. However, you have to use the other string that has not been used. Simply separate the string, add the beads, loop it around the 5th bead, thread it through the 4th bead going in the opposite direction, and then add 2 more beads and thread the string through the beads of the stem."
        },
        {
          "headline":"Complete the stem.",
          "description":"Just thread 1 green bead with the two strings facing in the same direction. Take one more green bead. Then use one string to thread it, and use the other side of the string and thread it in the opposite direction. This should also follow a criss-cross pattern."
        },
        {
          "headline":"Tie the two strings with two loops.",
          "description":"Make sure that the strings have been pulled tightly. Use the scissors to cut off the excess string and voila! You’ve completed your first flower!"
        }
      ]
    }
  ],
  "text":" Making the Petals Gather your materials. You’ll need a cord or a string, beads, scissors, and a ruler. Use the ruler to measure out the string. You may cut it to about 48 inches. For the colour of the petals, you can choose any colour that you want, but for simplicity of this task, the colour will be pink. For the middle part of the flower, also known as the disk, you might as well stick to using yellow beads. Lastly, the stem will have green beads. Add the first set of beads for the first petal. Take the string and thread through at least 8 pink beads. This will become the petal. Take 2 yellow beads and thread them with the string. You should see that you have 10 beads total on the same string. Begin to create the first petal. You will create a loop that will complete this petal. Just take one side of the string that has the pink beads and thread it through the 2 yellow beads in the opposite direction to how the yellow beads were initially threaded. You’ve created your first loop, which is now the first petal. Start out with the second petal by adding more beads. Since you’ve completed the first petal, take one side of a string and thread that with 2 yellow beads. Add 7 more beads that is the consistent colour of the first petal. You should leave out only one bead for this petal, because this will play a role for the later step. Complete the second petal. You’re going to create a second loop, but this step will be different. Use the eighth bead from the first petal, which is the last bead that has been threaded. Thread the string into that bead, then pull it through. String through the yellow beads for the second petal going in the same direction as you've already had threaded. You’ve now created the second petal. The reason why one extra bead has been left out for this petal, is that both petals are going to share that same bead. This will give the flower an “uplifting” look. Create the rest of the petals. Simply repeat the previous steps for making the petal above. Start finishing on the left side of the flower. After you've created the second petal, just complete the third petal: add two yellow beads, then seven beads, string the last bead from the previous petal, and string through the yellow beads. Stop using the string once you've completed the third petal. For the right side, you'll start by repeating the steps for the 4th and 5th petals. Once you've finished the petals on both sides of the flower, you should see that you have two strings coming from each side of the beads. They should be at least of the same length, since you should have enough string to move on to the other steps. Finishing the Flower Complete the flower. When you’ve got the flower, you’ll see that you have 2 strings coming from each side. Take one yellow bead and thread that with one string from any side. Then, take the string that is opposite from the other string and thread it to the different direction. You should be able to see that you've made a criss-cross looking pattern within that bead. Tie it with a single knot. Do not cut the strings. Begin making half of the stem. Take at least 7 green beads and thread them with two strings that must go in the same direction. Begin the leaf. Even though you’re making the stem, you’re also about to start making the leaf. Take only one string and set that aside. Add 5 green beads to thread it through that string. Thread a loop around the fifth bead. After looping around the fifth bead, use the string to thread it through the fourth bead, going in the opposite direction. Release the thread from the fourth bead. Complete the leaf. First, add two green beads to the string. Take the string and starting from the fifth bead of the stem, thread that bead, then through the sixth and seventh beads. This string should go in the same direction as the other string that has not been used. Make the second leaf (optional). Simply repeat the steps above for the first leaf. However, you have to use the other string that has not been used. Simply separate the string, add the beads, loop it around the 5th bead, thread it through the 4th bead going in the opposite direction, and then add 2 more beads and thread the string through the beads of the stem. Complete the stem. Just thread 1 green bead with the two strings facing in the same direction. Take one more green bead. Then use one string to thread it, and use the other side of the string and thread it in the opposite direction. This should also follow a criss-cross pattern. Tie the two strings with two loops. Make sure that the strings have been pulled tightly. Use the scissors to cut off the excess string and voila! You’ve completed your first flower!",
  "tyn_model":[
    "thread",
    "string",
    "beads",
    "scissors",
    "ruler",
    "“uplifting",
    "” look",
    "green beads"
  ],
  "tyn_section":[

  ]
}