{
  "title":"How to Make Nazook Pastries",
  "url":"https://www.wikihow.com/Make-Nazook-Pastries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "European Cuisine",
    "Russian and Slavic Cuisine"
  ],
  "steps":[
    {
      "headline":"Combine yeast and sour cream in a large mixing bowl.",
      "description":"Set aside for 10 minutes."
    },
    {
      "headline":"Add the other ingredients in order.",
      "description":"Start with the butter, mix well. Then the egg, oil, and vinegar, mix again. Then gradually add the flour, one cup at a time, mixing after each addition."
    },
    {
      "headline":"Knead the dough for about 15 minutes.",
      "description":"You want a smooth, firm dough that does not stick to your hands."
    },
    {
      "headline":"Roll the dough into a ball.",
      "description":"Wrap it tightly with plastic wrap."
    },
    {
      "headline":"Refrigerate the dough for at least 4 hours.",
      "description":"It is better to refrigerate overnight, but 4 hours will do the trick."
    },
    {
      "headline":"Meanwhile, make the filling.",
      "description":"Mix 1 cup of the melted butter and the flour, then add the sugar and vanilla. Stir constantly for 1 minute, or until you have a smooth, even mixture that doesn't stick to your hand."
    },
    {
      "headline":"Preheat the oven to 350 Fahrenheit.",
      "description":""
    },
    {
      "headline":"Remove the dough from the refrigerator.",
      "description":"Divide it into 8 equal balls. Place each ball on a lightly floured board."
    },
    {
      "headline":"Roll each ball out to a rectangle measuring 10-by-6 inches (15.2 cm).",
      "description":"This doesn't have to be exact, but you want the dough as thin as possible. Then paint each rectangle with melted butter."
    },
    {
      "headline":"Spread 1 rounded tablespoon of the filling onto each rectangle.",
      "description":"It can help to use the back of the spoon to press it into place."
    },
    {
      "headline":"Form each rectangle into a cylinder.",
      "description":"Lift each side, and pinch the dough together on top."
    },
    {
      "headline":"Slightly flatten each roll.",
      "description":"Use your hands, just put the 'seam' side down, and press gently."
    },
    {
      "headline":"Cut the roll into 2 inch (5.1 cm) long slices.",
      "description":"This is easiest with a serrated knife."
    },
    {
      "headline":"Arrange the slices, pastry up, on the baking sheet.",
      "description":"It's best to have 2 inches (5.1 cm) between them so they can bake evenly. Be careful not to let the filling spill out."
    },
    {
      "headline":"Paint each nazook with the glaze mixture.",
      "description":""
    },
    {
      "headline":"Bake for 15-25 minutes.",
      "description":"The time will depend on haw many baking sheets are in the oven, but they are done when they turn golden brown."
    },
    {
      "headline":"Allow the nazooks to cool.",
      "description":"Remove from the tray and enjoy!"
    }
  ],
  "text":" Combine yeast and sour cream in a large mixing bowl. Set aside for 10 minutes. Add the other ingredients in order. Start with the butter, mix well. Then the egg, oil, and vinegar, mix again. Then gradually add the flour, one cup at a time, mixing after each addition. Knead the dough for about 15 minutes. You want a smooth, firm dough that does not stick to your hands. Roll the dough into a ball. Wrap it tightly with plastic wrap. Refrigerate the dough for at least 4 hours. It is better to refrigerate overnight, but 4 hours will do the trick. Meanwhile, make the filling. Mix 1 cup of the melted butter and the flour, then add the sugar and vanilla. Stir constantly for 1 minute, or until you have a smooth, even mixture that doesn't stick to your hand. Preheat the oven to 350 Fahrenheit.  Remove the dough from the refrigerator. Divide it into 8 equal balls. Place each ball on a lightly floured board. Roll each ball out to a rectangle measuring 10-by-6 inches (15.2 cm). This doesn't have to be exact, but you want the dough as thin as possible. Then paint each rectangle with melted butter. Spread 1 rounded tablespoon of the filling onto each rectangle. It can help to use the back of the spoon to press it into place. Form each rectangle into a cylinder. Lift each side, and pinch the dough together on top. Slightly flatten each roll. Use your hands, just put the 'seam' side down, and press gently. Cut the roll into 2 inch (5.1 cm) long slices. This is easiest with a serrated knife. Arrange the slices, pastry up, on the baking sheet. It's best to have 2 inches (5.1 cm) between them so they can bake evenly. Be careful not to let the filling spill out. Paint each nazook with the glaze mixture.  Bake for 15-25 minutes. The time will depend on haw many baking sheets are in the oven, but they are done when they turn golden brown. Allow the nazooks to cool. Remove from the tray and enjoy!",
  "tyn_model":[
    "butter",
    "flour",
    "oven",
    "yeast",
    "sour cream",
    "large mixing bowl",
    "egg",
    "oil",
    "vinegar",
    "plastic wrap",
    "sugar",
    "vanilla",
    "refrigerator",
    "spoon",
    "serrated knife",
    "pastry",
    "baking sheet",
    "glaze",
    "baking sheets",
    "tray"
  ],
  "tyn_section":[

  ]
}