{
  "title":"How to Cook Grilled Salmon with a Warm Orzo Salad",
  "url":"https://www.wikihow.com/Cook-Grilled-Salmon-with-a-Warm-Orzo-Salad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Salmon"
  ],
  "parts":[
    {
      "name":"Preparing the Ingredients",
      "steps":[
        {
          "headline":"Heat an outdoor grill to medium-high.",
          "description":"Preheating the grill allows you to place the meat on the grill as soon as you are ready, instead of having to wait."
        },
        {
          "headline":"Cook the orzo.",
          "description":"Boil salted water in a large saucepan. Add the orzo and cook for about 8 minutes, or until tender. Strain the pasta using a fine mesh strainer and set aside."
        },
        {
          "headline":"Make the orzo salad.",
          "description":"Combine the vinegar, shallots, and garlic in a bowl. Gradually mix in the olive oil. Add salt and pepper. In a separate large bowl, toss the orzo, spinach, tomatoes, basil and vinaigrette mixture. Season with salt and pepper. Set aside."
        },
        {
          "headline":"Prep the salmon for cooking.",
          "description":"Coat salmon with olive oil. Season with salt and pepper."
        }
      ]
    },
    {
      "name":"Cooking the Salmon",
      "steps":[
        {
          "headline":"Oil the grill.",
          "description":"Use any type of non-stick spray. Since the salmon is being cooked directly on the grill, using grill spray will prevent sticking and ruining the meat."
        },
        {
          "headline":"Place the salmon on the grill.",
          "description":"Put fillets at the top right corner of the grill. Cook for 4 minutes without moving the salmon. If your fillet has skin, cooking skin side first will make for easy removal once cooked."
        },
        {
          "headline":"Flip fillets over to cook the other side.",
          "description":"Cook for 2 more minutes, or until it has a rosy center when flaked in the thickest part. Notice the color change from a deep red/orange to a light rosy color. This indicates it is being cooked correctly."
        },
        {
          "headline":"Remove from the grill.",
          "description":"Using a metal spatula, remove the fillets from the grill, put them on a separate plate or platter and cover it while you complete the next steps."
        }
      ]
    },
    {
      "name":"Putting it All Together",
      "steps":[
        {
          "headline":"Position orzo salad on plates.",
          "description":"Mound on a large platter or smaller dinner plates."
        },
        {
          "headline":"Sprinkle on the feta cheese.",
          "description":""
        },
        {
          "headline":"Place salmon on top and decorate with chives.",
          "description":""
        },
        {
          "headline":"Serve while hot and enjoy!",
          "description":"Refrigerate any leftovers and enjoy again the next day."
        }
      ]
    }
  ],
  "text":" Preparing the Ingredients Heat an outdoor grill to medium-high. Preheating the grill allows you to place the meat on the grill as soon as you are ready, instead of having to wait. Cook the orzo. Boil salted water in a large saucepan. Add the orzo and cook for about 8 minutes, or until tender. Strain the pasta using a fine mesh strainer and set aside. Make the orzo salad. Combine the vinegar, shallots, and garlic in a bowl. Gradually mix in the olive oil. Add salt and pepper. In a separate large bowl, toss the orzo, spinach, tomatoes, basil and vinaigrette mixture. Season with salt and pepper. Set aside. Prep the salmon for cooking. Coat salmon with olive oil. Season with salt and pepper. Cooking the Salmon Oil the grill. Use any type of non-stick spray. Since the salmon is being cooked directly on the grill, using grill spray will prevent sticking and ruining the meat. Place the salmon on the grill. Put fillets at the top right corner of the grill. Cook for 4 minutes without moving the salmon. If your fillet has skin, cooking skin side first will make for easy removal once cooked. Flip fillets over to cook the other side. Cook for 2 more minutes, or until it has a rosy center when flaked in the thickest part. Notice the color change from a deep red/orange to a light rosy color. This indicates it is being cooked correctly. Remove from the grill. Using a metal spatula, remove the fillets from the grill, put them on a separate plate or platter and cover it while you complete the next steps. Putting it All Together Position orzo salad on plates. Mound on a large platter or smaller dinner plates. Sprinkle on the feta cheese.  Place salmon on top and decorate with chives.  Serve while hot and enjoy! Refrigerate any leftovers and enjoy again the next day.",
  "tyn_model":[
    "grill",
    "salmon",
    "orzo salad",
    "olive oil",
    "salt",
    "outdoor grill",
    "salted water",
    "large saucepan",
    "fine mesh strainer",
    "vinegar",
    "shallots",
    "garlic",
    "bowl",
    "pepper",
    "spinach",
    "tomatoes",
    "basil",
    "vinaigrette mixture",
    "salt and pepper",
    "non-stick spray",
    "grill spray",
    "spatula",
    "plate",
    "plates",
    "dinner plates",
    "feta cheese",
    "chives"
  ],
  "tyn_section":[

  ]
}