{
  "title":"How to Control Midges",
  "url":"https://www.wikihow.com/Control-Midges",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control",
    "Fly Control"
  ],
  "methods":[
    {
      "name":"Managing the Environment",
      "steps":[
        {
          "headline":"Introduce predatory species to the midges’ habitat.",
          "description":"Many types of fish, especially bottom-feeders like carp and catfish, eat large quantities of midge larvae. Other organisms, like dragonfly nymphs and diving beetles, also eat midge larvae. You can buy many kinds of midge-eating fish like koi, goldfish, and guppies at most pet stores. Attract other species that prey on adult midges. Dragonflies, bats, or frogs will eat adult midges and help you control the population. Build shelters and plant vegetation that attracts these animals. Keep in mind that using chemicals to kill midges might also harm the animals that eat them."
        },
        {
          "headline":"Eliminate standing water.",
          "description":"Drain anything that holds water. This is especially important to do before and during the winter. Midges hibernate in the muck that accumulates at the bottom of standing water. Empty out bird-baths, decorative ponds, and other structures that retain water to reduce the spring midge population. If you are unable to reduce standing water, consider treating that water with a larvicide."
        },
        {
          "headline":"Reduce the light output of your home or business.",
          "description":"Close your blinds and turn off outside lighting at night during the hotter, wetter months in your region. Move lamps away from your windows. Avoid running lamp posts or floodlights unless necessary. You might consider using high-pressure sodium lamps for outside lighting. This type of light is less attractive to midges than the typical metal halide lights used for exterior lighting."
        },
        {
          "headline":"Reduce fertilizer runoff and waste disposal in nearby bodies of water.",
          "description":"Farm runoff containing fertilizers and retention ponds near human habitats are rich in the nutrients that midge larvae need to develop. Midge larvae love these nutrients, but the animals that eat midges usually can't live in habitats with a lot of fertilizer or waste contamination. While you may be able to divert waste and fertilizer runoff on your own property, getting your community involved will be much more effective for controlling midge populations in larger bodies of water. Raising awareness in your community about proper waste disposal and the effects of excessive fertilizer runoff might help reduce your area's midge population. It is also a great opportunity to meet your neighbors!"
        }
      ]
    },
    {
      "name":"Applying Chemical Solutions",
      "steps":[
        {
          "headline":"Apply larvicide insecticide to the midges’ water habitats.",
          "description":"These types of chemicals will kill off some of the larval population, preventing the adult flies from developing and hatching. Chemicals like granular temephos, BTI (Bacillus thuringiensis var. israelensis), and methoprene have been used to control midge populations. Larvicides are only a temporary measure for dealing with midge populations. Repeated and prolonged use of larvicides can cause the development of chemical-resistant midges and potentially harm the local environment. To maximize the effectiveness of larvicide, apply the chemical just before the hottest, wettest months in your region. This will kill off the midges before the biggest swarms hatch. Using larvicides can be very expensive for larger bodies of water. Midge larvae live in the organic matter at the bottom of a body of water. The amount of chemicals necessary to reach the midge population is very high and likely impossible in larger habitats. For example, BTI is only effective against midges at 10 times the rate needed for mosquitoes."
        },
        {
          "headline":"Spray adulticide insecticides where you see adult midge flies.",
          "description":"Target areas like walls, surfaces surrounding outside light sources, and vegetation where you have seen adult midge flies resting. You can even spray swarms of midge flies directly. Adulticide insecticides can help you eliminate a swarm of midges temporarily, but won't affect the midges’ rapid re-population cycles very much. Adulticides can be useful for exterminating a single swarm of midges, but they will return in a matter of days when the new generation matures. A thermal fogger, also known as a cold aerosol generator, will spray a mist of insecticide that can reduce the adult  midge population in a specific area. Typically thermal foggers are used to eliminate midges near your house or backyard. Some large thermal foggers can be mounted on trucks or boats to kill midges along a shoreline or in dense vegetation. Area sprays targeting adult midges do not last long in the environment and you will probably need to use it daily."
        },
        {
          "headline":"Apply insect repellent to your exposed skin.",
          "description":"Midges are attracted to skin and can cause irritating and painful bites. Spray any exposed skin with DEET-based insect repellent. Make sure you apply the insect repellent as often as its instructions suggest for the best result."
        }
      ]
    },
    {
      "name":"Using Traps and Diversions",
      "steps":[
        {
          "headline":"Build high intensity white-light sources to attract adult midges.",
          "description":"These lights should be placed strategically: near the midge population, but away from residential and recreational areas. With some luck and proper placement, midges will be drawn to this light source and their population will be reduced in areas that humans frequent."
        },
        {
          "headline":"Set up an electrocution trap near a major light source or midge habitat.",
          "description":"Electrocution traps can kill large numbers of midges. Electrocution traps, however,will not affect the larvae population or the reproduction cycle. If you are dealing with big swarms of midges, an electrocution trap can become clogged and malfunction. This can be a serious fire hazard! Clean the trap regularly or turn it off if the swarms are really bad."
        },
        {
          "headline":"Use a CO2 trap to attract and eliminate midges.",
          "description":"Midges, mosquitoes, and other insect pests are attracted to the carbon dioxide that humans exhale. Similar to an electrocution trap, a CO2 trap lures in midges with a light source, but it also discharges CO2 into the surrounding environment. When midges come near the CO2 trap, a small fan pulls them into a container inside. Many consider CO2 traps to be superior to electrocution traps because they can cover a wide area. Some CO2 traps advertise that they will draw in the vast majority of midges and other insect pests in an area as large as 300 feet (91 m)."
        },
        {
          "headline":"Install mosquito nets or fine-mesh screens to your windows and doors.",
          "description":"This will help prevent midges from entering your home. Midges can be very small, so make sure you patch any holes or tears in the mesh."
        },
        {
          "headline":"Run a fan or air conditioner to block midges from entering your home.",
          "description":"The air flow from a fan, especially if it is placed near a window or door, can disrupt midges’ ability to fly. Using an air conditioner and shutting all windows and doors will prevent midges from coming inside. Adult midges are weak fliers and often seek refuge from the wind. You might consider closing windows on the side of your house that is the most protected from wind. Similarly, installing ceiling fans on patios and decks where air is typically calm will help deter midges from resting there."
        }
      ]
    }
  ],
  "text":" Managing the Environment Introduce predatory species to the midges’ habitat. Many types of fish, especially bottom-feeders like carp and catfish, eat large quantities of midge larvae. Other organisms, like dragonfly nymphs and diving beetles, also eat midge larvae. You can buy many kinds of midge-eating fish like koi, goldfish, and guppies at most pet stores. Attract other species that prey on adult midges. Dragonflies, bats, or frogs will eat adult midges and help you control the population. Build shelters and plant vegetation that attracts these animals. Keep in mind that using chemicals to kill midges might also harm the animals that eat them. Eliminate standing water. Drain anything that holds water. This is especially important to do before and during the winter. Midges hibernate in the muck that accumulates at the bottom of standing water. Empty out bird-baths, decorative ponds, and other structures that retain water to reduce the spring midge population. If you are unable to reduce standing water, consider treating that water with a larvicide. Reduce the light output of your home or business. Close your blinds and turn off outside lighting at night during the hotter, wetter months in your region. Move lamps away from your windows. Avoid running lamp posts or floodlights unless necessary. You might consider using high-pressure sodium lamps for outside lighting. This type of light is less attractive to midges than the typical metal halide lights used for exterior lighting. Reduce fertilizer runoff and waste disposal in nearby bodies of water. Farm runoff containing fertilizers and retention ponds near human habitats are rich in the nutrients that midge larvae need to develop. Midge larvae love these nutrients, but the animals that eat midges usually can't live in habitats with a lot of fertilizer or waste contamination. While you may be able to divert waste and fertilizer runoff on your own property, getting your community involved will be much more effective for controlling midge populations in larger bodies of water. Raising awareness in your community about proper waste disposal and the effects of excessive fertilizer runoff might help reduce your area's midge population. It is also a great opportunity to meet your neighbors! Applying Chemical Solutions Apply larvicide insecticide to the midges’ water habitats. These types of chemicals will kill off some of the larval population, preventing the adult flies from developing and hatching. Chemicals like granular temephos, BTI (Bacillus thuringiensis var. israelensis), and methoprene have been used to control midge populations. Larvicides are only a temporary measure for dealing with midge populations. Repeated and prolonged use of larvicides can cause the development of chemical-resistant midges and potentially harm the local environment. To maximize the effectiveness of larvicide, apply the chemical just before the hottest, wettest months in your region. This will kill off the midges before the biggest swarms hatch. Using larvicides can be very expensive for larger bodies of water. Midge larvae live in the organic matter at the bottom of a body of water. The amount of chemicals necessary to reach the midge population is very high and likely impossible in larger habitats. For example, BTI is only effective against midges at 10 times the rate needed for mosquitoes. Spray adulticide insecticides where you see adult midge flies. Target areas like walls, surfaces surrounding outside light sources, and vegetation where you have seen adult midge flies resting. You can even spray swarms of midge flies directly. Adulticide insecticides can help you eliminate a swarm of midges temporarily, but won't affect the midges’ rapid re-population cycles very much. Adulticides can be useful for exterminating a single swarm of midges, but they will return in a matter of days when the new generation matures. A thermal fogger, also known as a cold aerosol generator, will spray a mist of insecticide that can reduce the adult  midge population in a specific area. Typically thermal foggers are used to eliminate midges near your house or backyard. Some large thermal foggers can be mounted on trucks or boats to kill midges along a shoreline or in dense vegetation. Area sprays targeting adult midges do not last long in the environment and you will probably need to use it daily. Apply insect repellent to your exposed skin. Midges are attracted to skin and can cause irritating and painful bites. Spray any exposed skin with DEET-based insect repellent. Make sure you apply the insect repellent as often as its instructions suggest for the best result. Using Traps and Diversions Build high intensity white-light sources to attract adult midges. These lights should be placed strategically: near the midge population, but away from residential and recreational areas. With some luck and proper placement, midges will be drawn to this light source and their population will be reduced in areas that humans frequent. Set up an electrocution trap near a major light source or midge habitat. Electrocution traps can kill large numbers of midges. Electrocution traps, however,will not affect the larvae population or the reproduction cycle. If you are dealing with big swarms of midges, an electrocution trap can become clogged and malfunction. This can be a serious fire hazard! Clean the trap regularly or turn it off if the swarms are really bad. Use a CO2 trap to attract and eliminate midges. Midges, mosquitoes, and other insect pests are attracted to the carbon dioxide that humans exhale. Similar to an electrocution trap, a CO2 trap lures in midges with a light source, but it also discharges CO2 into the surrounding environment. When midges come near the CO2 trap, a small fan pulls them into a container inside. Many consider CO2 traps to be superior to electrocution traps because they can cover a wide area. Some CO2 traps advertise that they will draw in the vast majority of midges and other insect pests in an area as large as 300 feet (91 m). Install mosquito nets or fine-mesh screens to your windows and doors. This will help prevent midges from entering your home. Midges can be very small, so make sure you patch any holes or tears in the mesh. Run a fan or air conditioner to block midges from entering your home. The air flow from a fan, especially if it is placed near a window or door, can disrupt midges’ ability to fly. Using an air conditioner and shutting all windows and doors will prevent midges from coming inside. Adult midges are weak fliers and often seek refuge from the wind. You might consider closing windows on the side of your house that is the most protected from wind. Similarly, installing ceiling fans on patios and decks where air is typically calm will help deter midges from resting there.",
  "tyn_model":[
    "water",
    "fertilizer",
    "larvicides",
    "co2 trap",
    "fish",
    "mosquitoes",
    "adulticide insecticides",
    "thermal foggers",
    "insect repellent",
    "electrocution trap",
    "co2 traps",
    "fan",
    "air conditioner",
    "’ habitat",
    "carp",
    "koi",
    "goldfish",
    "guppies",
    "bats",
    "frogs",
    "bird-baths",
    "lamps",
    "larvicide insecticide",
    "’ water",
    "methoprene",
    "larvicide",
    "’ rapid",
    "thermal fogger",
    "insecticide that",
    "deet-based insect repellent",
    "traps",
    "white-light",
    "electrocution traps",
    "midges",
    "carbon dioxide",
    "co2",
    "mosquito nets",
    "fine-mesh screens",
    "’ ability",
    "fans"
  ],
  "tyn_section":[

  ]
}