{
  "title":"How to Tell if Steak Is Done",
  "url":"https://www.wikihow.com/Tell-if-Steak-Is-Done",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Beef and Lamb",
    "Steak Dishes"
  ],
  "methods":[
    {
      "name":"Using a Meat Thermometer",
      "steps":[
        {
          "headline":"Get a thermometer designed for meat and poultry.",
          "description":"Some thermometers are meant for candy and other types of food. Be sure you have a thermometer meant for meat to get the most accurate reading."
        },
        {
          "headline":"Use an instant-read thermometer for best results.",
          "description":"An instant-read thermometer is perfect for when you’re grilling steaks. You won’t be able to use it in the oven, but you can take your steak out of the oven to check the temperature. You’ll get an immediate temperature reading when you insert the thermometer into the meat. Instant-read thermometers usually come either with a dial or a digital readout to show the temperature. Most digital thermometers can read the temperature accurately when inserted only ⁄2 inch (1.3 cm) into the meat."
        },
        {
          "headline":"Insert the thermometer into the thickest part of the steak.",
          "description":"The thickest part of the steak is what has been cooked the least, so this is the best reading to take if you want to know if it’s done. To do this, insert the thermometer into the side of the steak until it is in the thickest part of the meat (usually the center). If you are cooking steak on the bone, make sure the thermometer isn’t touching the bone when you take the reading. Bone is an excellent heat conductor, so it’s usually hotter than the rest of the meat. If you’re not sure you’re in the thickest part, try poking the thermometer all the way through to the other side first. As you pull it slowly back out, the temperature will rise as the tip of the thermometer enters the meat again, and then gradually drop as you get closer and closer to the center. The lowest temperature you see is the number you should go by."
        },
        {
          "headline":"Find your favorite temperature with practice.",
          "description":"With some practice, you can find out what temperature corresponds to your ideal level of doneness. Remember that the recommended minimum temperature for a steak to be safe to eat is 145 °F (63 °C). People who prefer rare or medium rare steak sometimes enjoy their steak at a lower temperature, but they do this at their own risk. For a rare steak, aim for 125 °F (52 °C). For medium rare, aim for 135 °F (57 °C). For medium, aim for 145 °F (63 °C). For medium well, aim for 150 °F (66 °C). A steak is well-done above 160 °F (71 °C)."
        },
        {
          "headline":"Remove the steak from the heat when it’s 5 degrees lower than your goal temperature.",
          "description":"Remember that your steak will continue to cook even after you take it off the pan or grill. This means you will want to remove it from the heat when the thermometer reads 5 degrees below your goal temperature."
        }
      ]
    },
    {
      "name":"Estimating without a Thermometer",
      "steps":[
        {
          "headline":"Cut into the thickest part of the steak to check the color inside.",
          "description":"Slice into a spot on the thickest part of the steak and peek inside. A rare steak will have a cool red center. Medium rare should have a warm red center. Medium should have a warm pink center. Medium well should have a slightly pink center. Well done should have little to no pink inside. Although it is true that you will lose some juice from the steak where you make the cut, the loss is negligible because you are only nicking one small area of the steak. Remember that a steak continues to cook after you take it off the heat. So if you want your steak cooked to medium, take it off the heat when it looks medium rare inside. Color alone is not a foolproof indicator of doneness. It’s best to double check with a meat thermometer if you have one."
        },
        {
          "headline":"Check the doneness of your steak using the finger test.",
          "description":"In general, the firmer the steak feels, the more done it is. You can estimate the degree of doneness by comparing it to the firmness of the muscle below your thumb. Touch your thumb and index finger together and poke the muscle below your thumb. This is what a rare steak will feel like. For a medium rare steak, touch your thumb and middle finger and poke below your thumb. For medium touch your thumb and ring finger, and for well done touch your thumb and pinky finger. The finger test is not nearly as accurate as using a meat thermometer. In general, they are not as practical for a home cook as for a restaurant chef, who cooks many steaks one after another. However, you can get better at using these techniques with practice."
        },
        {
          "headline":"Compare the firmness of the steak to various parts of your face to estimate doneness.",
          "description":"You can use a method similar to the finger test to estimate how cooked your steak is using your face as a guide. A rare steak is soft like your cheek when your face is relaxed. A medium steak should feel like your chin. A well-done steak will feel very firm like your forehead. Just like the finger test, the face test is not an accurate measurement and you should confirm your results with a meat thermometer if you have one available."
        },
        {
          "headline":"Use size as an indicator of whether your steak is done.",
          "description":"Your steak will shrink slightly as it cooks. Note the size of your steak when you start to grill it. Even when it starts to look charred on the outside, if it is still the same size, it is probably still underdone. When it starts to shrink, it’s probably almost done. If it shrinks quite a bit, it may be overcooked. The size test is a very general estimate. For best results, combine this technique with using a meat thermometer or cutting into the steak to check its degree of doneness."
        }
      ]
    }
  ],
  "text":" Using a Meat Thermometer Get a thermometer designed for meat and poultry. Some thermometers are meant for candy and other types of food. Be sure you have a thermometer meant for meat to get the most accurate reading. Use an instant-read thermometer for best results. An instant-read thermometer is perfect for when you’re grilling steaks. You won’t be able to use it in the oven, but you can take your steak out of the oven to check the temperature. You’ll get an immediate temperature reading when you insert the thermometer into the meat. Instant-read thermometers usually come either with a dial or a digital readout to show the temperature. Most digital thermometers can read the temperature accurately when inserted only ⁄2 inch (1.3 cm) into the meat. Insert the thermometer into the thickest part of the steak. The thickest part of the steak is what has been cooked the least, so this is the best reading to take if you want to know if it’s done. To do this, insert the thermometer into the side of the steak until it is in the thickest part of the meat (usually the center). If you are cooking steak on the bone, make sure the thermometer isn’t touching the bone when you take the reading. Bone is an excellent heat conductor, so it’s usually hotter than the rest of the meat. If you’re not sure you’re in the thickest part, try poking the thermometer all the way through to the other side first. As you pull it slowly back out, the temperature will rise as the tip of the thermometer enters the meat again, and then gradually drop as you get closer and closer to the center. The lowest temperature you see is the number you should go by. Find your favorite temperature with practice. With some practice, you can find out what temperature corresponds to your ideal level of doneness. Remember that the recommended minimum temperature for a steak to be safe to eat is 145 °F (63 °C). People who prefer rare or medium rare steak sometimes enjoy their steak at a lower temperature, but they do this at their own risk. For a rare steak, aim for 125 °F (52 °C). For medium rare, aim for 135 °F (57 °C). For medium, aim for 145 °F (63 °C). For medium well, aim for 150 °F (66 °C). A steak is well-done above 160 °F (71 °C). Remove the steak from the heat when it’s 5 degrees lower than your goal temperature. Remember that your steak will continue to cook even after you take it off the pan or grill. This means you will want to remove it from the heat when the thermometer reads 5 degrees below your goal temperature. Estimating without a Thermometer Cut into the thickest part of the steak to check the color inside. Slice into a spot on the thickest part of the steak and peek inside. A rare steak will have a cool red center. Medium rare should have a warm red center. Medium should have a warm pink center. Medium well should have a slightly pink center. Well done should have little to no pink inside. Although it is true that you will lose some juice from the steak where you make the cut, the loss is negligible because you are only nicking one small area of the steak. Remember that a steak continues to cook after you take it off the heat. So if you want your steak cooked to medium, take it off the heat when it looks medium rare inside. Color alone is not a foolproof indicator of doneness. It’s best to double check with a meat thermometer if you have one. Check the doneness of your steak using the finger test. In general, the firmer the steak feels, the more done it is. You can estimate the degree of doneness by comparing it to the firmness of the muscle below your thumb. Touch your thumb and index finger together and poke the muscle below your thumb. This is what a rare steak will feel like. For a medium rare steak, touch your thumb and middle finger and poke below your thumb. For medium touch your thumb and ring finger, and for well done touch your thumb and pinky finger. The finger test is not nearly as accurate as using a meat thermometer. In general, they are not as practical for a home cook as for a restaurant chef, who cooks many steaks one after another. However, you can get better at using these techniques with practice. Compare the firmness of the steak to various parts of your face to estimate doneness. You can use a method similar to the finger test to estimate how cooked your steak is using your face as a guide. A rare steak is soft like your cheek when your face is relaxed. A medium steak should feel like your chin. A well-done steak will feel very firm like your forehead. Just like the finger test, the face test is not an accurate measurement and you should confirm your results with a meat thermometer if you have one available. Use size as an indicator of whether your steak is done. Your steak will shrink slightly as it cooks. Note the size of your steak when you start to grill it. Even when it starts to look charred on the outside, if it is still the same size, it is probably still underdone. When it starts to shrink, it’s probably almost done. If it shrinks quite a bit, it may be overcooked. The size test is a very general estimate. For best results, combine this technique with using a meat thermometer or cutting into the steak to check its degree of doneness.",
  "tyn_model":[
    "thermometer",
    "steak",
    "meat thermometer",
    "thermometers",
    "oven",
    "grill",
    "bone",
    "pan"
  ],
  "tyn_section":[

  ]
}