{
  "title":"How to Make Medivnyk (Honey Cakes)",
  "url":"https://www.wikihow.com/Make-Medivnyk-(Honey-Cakes)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "European Cuisine",
    "Russian and Slavic Cuisine"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 325 degrees Fahrenheit (162 degrees Celsius).",
      "description":""
    },
    {
      "headline":"Grease and flour two (2) 8 1/2 x 4 1/2\" loaf pans.",
      "description":""
    },
    {
      "headline":"In a large bowl, beat together the eggs, sugar, honey, oil, orange juice, sour cream and marmalade until well blended.",
      "description":"Set aside."
    },
    {
      "headline":"In a separate large bowl, combine the dry ingredients (flour, baking soda, baking powder, cinnamon and cloves) until blended well.",
      "description":""
    },
    {
      "headline":"Carefully add the dry ingredients to the wet ingredients, and mix until a batter consistency is reached.",
      "description":""
    },
    {
      "headline":"Pour the batter into each of the loaf pans and bake for 45 minutes.",
      "description":""
    },
    {
      "headline":"Lower the temperature to 300 degrees Fahrenheit (148 degrees Celsius), and bake for an additional 20-25 minutes.",
      "description":""
    },
    {
      "headline":"Remove cakes from the oven and allow cooling before removing the cakes from the pans.",
      "description":""
    },
    {
      "headline":"Slice into pieces however preferred and serve.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 325 degrees Fahrenheit (162 degrees Celsius).  Grease and flour two (2) 8 1/2 x 4 1/2\" loaf pans.  In a large bowl, beat together the eggs, sugar, honey, oil, orange juice, sour cream and marmalade until well blended. Set aside. In a separate large bowl, combine the dry ingredients (flour, baking soda, baking powder, cinnamon and cloves) until blended well.  Carefully add the dry ingredients to the wet ingredients, and mix until a batter consistency is reached.  Pour the batter into each of the loaf pans and bake for 45 minutes.  Lower the temperature to 300 degrees Fahrenheit (148 degrees Celsius), and bake for an additional 20-25 minutes.  Remove cakes from the oven and allow cooling before removing the cakes from the pans.  Slice into pieces however preferred and serve. ",
  "tyn_model":[
    "oven",
    "flour",
    "loaf pans",
    "large bowl",
    "eggs",
    "sugar",
    "honey",
    "oil",
    "orange juice",
    "sour cream",
    "marmalade",
    "baking soda",
    "baking powder",
    "cinnamon",
    "cloves"
  ],
  "tyn_section":[

  ]
}