{
  "title":"How to Solve Slide Puzzles",
  "url":"https://www.wikihow.com/Solve-Slide-Puzzles",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Puzzles and Memory Games"
  ],
  "parts":[
    {
      "name":"Solving the Top Row",
      "steps":[
        {
          "headline":"Draw a grid that shows how the tiles should be ordered.",
          "description":"To keep track of where to put the tiles, it’s useful to draw a grid on a separate sheet of paper. Mark each square of the grid with numbers reflecting the order that the tiles will be in when you have solved the puzzle. Many slide puzzles already have numbered tiles, which makes it easier to know the order they belong in. In most cases, you will need to put the tiles in numerical order, starting with no. 1 at the top-left corner, and moving down each row left-to-right. Slide puzzles with images may not have numbers on the tiles. In this case, assign your own numbers to the tiles. For example, if a tile has the top-left corner of a face, make that tile no. 1 on your grid. Starting with the corners and working your way to the middle is a good way of figuring out numbers for image tiles."
        },
        {
          "headline":"Move the first tile to the top-left corner.",
          "description":"Once you have numbered your tiles, your first move will be to place tile no. 1 in its proper space. Using the one empty space, move surrounding tiles around until the no. 1 tile is where it belongs. Once it is there, keep it there for the remainder of the puzzle. When moving tiles, look ahead to how far your tile is from where you want it to be. This will help you strategize how to get to the destination in the fewest number of moves possible."
        },
        {
          "headline":"Arrange all but the two rightmost tiles of the top row.",
          "description":"If you are solving a 3x3 puzzle, you may skip this step. On all larger puzzles, you will need to arrange all but the final two pieces of the top row. Do this until you have placed all but the final two tiles on this row. For a 4x4 puzzle, move the no. 2 tile to the spot immediately to the right of the no. 1 tile. For a 5x5 puzzle, move the no. 2 and no. 3 tiles to their respective positions on the top row."
        },
        {
          "headline":"Take the last tile out of the top row.",
          "description":"If the last tile is on the top row, it will be difficult to place the tile immediately to its left. If your puzzle has the top-right tile on the top row, temporarily move it away. On a 3x3 grid, the last tile is no. 3. On a 4x4 grid, the last tile is no. 4. On a 5x5 grid, the last tile is no. 5."
        },
        {
          "headline":"Move the next-to-last tile into the top-right corner.",
          "description":"The next-to-last tile needs to be in the top row before the last tile can be placed. On a 3x3 grid, the next-to-last tile is no. 2. On a 4x4 grid, the next-to-last tile is no. 3. On a 5x5 grid, the next-to-last tile is no. 4."
        },
        {
          "headline":"Move the last tile directly below the top-right corner.",
          "description":"This sets up the puzzle so that you can easily move the final two tiles into the top row, in order."
        },
        {
          "headline":"Move the two last tiles into their positions.",
          "description":"Move tiles around until the empty space is immediately to the left of the top-right corner. Now bring the next-to-last tile into this space. Now the top-right corner is open, and you can move the last tile into this corner. You’ve now solved the top row! Leave it untouched for the remainder of the puzzle."
        }
      ]
    },
    {
      "name":"Solving the Left Column",
      "steps":[
        {
          "headline":"Move the second tile of the left column directly beneath the first tile.",
          "description":"Now that the top row is set, it’s time to work on the left column. If you are working with a 3x3 puzzle, you may skip down to “Solving the Remaining 3x2 Puzzle.” Otherwise, we will proceed the same way we did with the top row, only now we’re working on the opposite axis. Move the second tile of the left column into the space immediately below the top-left corner. On a 4x4 grid, the next tile of the left column is no. 5. On a 5x5 grid, the next tile of the left column is no. 6."
        },
        {
          "headline":"Set all but the last two tiles of the left column.",
          "description":"Just as you did with the top row, you need to arrange the left column so that all but the last two pieces are in place. If the grid is 4x4, you have already accomplished this on the previous step. Otherwise, continue to arrange the left column until there are only two tiles left to set this column. If your grid is 5x5, these two tiles will be nos. 16 and 21."
        },
        {
          "headline":"Remove the last tile from the left column.",
          "description":"We’re doing the same thing with the left column that we did with the top row. That means that the last tile (the one that will eventually inhabit the bottom-left corner) cannot be in this column until we’re ready to set the last two tiles together."
        },
        {
          "headline":"Move next-to-last tile into the bottom-left corner.",
          "description":"This tile will eventually be placed in the space immediately above the bottom-left corner. If your grid is 4x4, the next-to-last tile is no. 9. If your grid is 5x5, the next-to-last tile is no. 16."
        },
        {
          "headline":"Move the last tile directly to the right of bottom-left corner.",
          "description":"This will make it easy to arrange the last two tiles of this column column the same way we arranged the top row."
        },
        {
          "headline":"Move the last two tiles into their positions.",
          "description":"Let’s finish this column! Move the tiles until you can transfer the next-to-last tile up one space. Now you have an open corner for the last tile of the column. Move it into the empty bottom-left corner. Leave the left column untouched for the remainder of the puzzle, just as you are leaving the top row untouched."
        }
      ]
    },
    {
      "name":"Solving the Remaining 3x2 Puzzle",
      "steps":[
        {
          "headline":"Repeat the first two methods until only a 3x2 grid remains.",
          "description":"If you start with the top row and the left column, you can solve slide puzzles of any size by breaking them into smaller and smaller grids. Keep solving the top row and leftmost column as many times as necessary until you have a 3x2 grid, with five tiles left to arrange. If your grid is 4x4, you will have a 3x3 grid to solve after taking care of the first two methods. Repeating the first method (“Solving the Top Row”) will leave you with a 3x2 grid. If your grid is 5x5, your new grid will be 4x4, and you will have to repeat each of the first two methods (“Solving the Top Row” and “Solving the Left Column”) once more."
        },
        {
          "headline":"Arrange the top-left tile in the bottom-left space.",
          "description":"At this point, the puzzle gets a bit trickier. Fortunately, there are only five pieces and a limited number of ways that they can be moved. Setting the left-most column is a good place to start. On a 3x3 grid, the top-left tile tile of the 3x2 grid is no. 4. On a 4x4 grid, the top-left tile tile of the 3x2 grid is no. 10. On a 5x5 grid, the top-left tile tile of the 3x2 grid is no. 18."
        },
        {
          "headline":"Place the bottom-left tile to the right of its space.",
          "description":"If we move the bottom-left tile into the space immediately to the right of where it must go, we can set the left-most column of our 3x2 grid the same way we finished rows and columns in previous methods. On a 3x3 grid, the bottom-left tile of the 3x2 grid is no. 7. On a 4x4 grid, the bottom-left tile of the 3x2 grid is no. 14. On a 5x5 grid, the bottom-left tile of the 3x2 grid is no. 23."
        },
        {
          "headline":"Move the left-most tiles into place.",
          "description":"Arrange the 3x2 grid so that the top-left corner is empty. Move the top-left tile up, and then move the bottom-left tile into its place. At this point, we only have a 2x2 puzzle to organize."
        },
        {
          "headline":"Move the remaining pieces into their places.",
          "description":"There are now only three tiles left, and it does not take many moves to set them properly. Rotate them around until they are all in their proper place. Congratulations! You’ve solved a slide puzzle!"
        }
      ]
    }
  ],
  "text":" Solving the Top Row Draw a grid that shows how the tiles should be ordered. To keep track of where to put the tiles, it’s useful to draw a grid on a separate sheet of paper. Mark each square of the grid with numbers reflecting the order that the tiles will be in when you have solved the puzzle. Many slide puzzles already have numbered tiles, which makes it easier to know the order they belong in. In most cases, you will need to put the tiles in numerical order, starting with no. 1 at the top-left corner, and moving down each row left-to-right. Slide puzzles with images may not have numbers on the tiles. In this case, assign your own numbers to the tiles. For example, if a tile has the top-left corner of a face, make that tile no. 1 on your grid. Starting with the corners and working your way to the middle is a good way of figuring out numbers for image tiles. Move the first tile to the top-left corner. Once you have numbered your tiles, your first move will be to place tile no. 1 in its proper space. Using the one empty space, move surrounding tiles around until the no. 1 tile is where it belongs. Once it is there, keep it there for the remainder of the puzzle. When moving tiles, look ahead to how far your tile is from where you want it to be. This will help you strategize how to get to the destination in the fewest number of moves possible. Arrange all but the two rightmost tiles of the top row. If you are solving a 3x3 puzzle, you may skip this step. On all larger puzzles, you will need to arrange all but the final two pieces of the top row. Do this until you have placed all but the final two tiles on this row. For a 4x4 puzzle, move the no. 2 tile to the spot immediately to the right of the no. 1 tile. For a 5x5 puzzle, move the no. 2 and no. 3 tiles to their respective positions on the top row. Take the last tile out of the top row. If the last tile is on the top row, it will be difficult to place the tile immediately to its left. If your puzzle has the top-right tile on the top row, temporarily move it away. On a 3x3 grid, the last tile is no. 3. On a 4x4 grid, the last tile is no. 4. On a 5x5 grid, the last tile is no. 5. Move the next-to-last tile into the top-right corner. The next-to-last tile needs to be in the top row before the last tile can be placed. On a 3x3 grid, the next-to-last tile is no. 2. On a 4x4 grid, the next-to-last tile is no. 3. On a 5x5 grid, the next-to-last tile is no. 4. Move the last tile directly below the top-right corner. This sets up the puzzle so that you can easily move the final two tiles into the top row, in order. Move the two last tiles into their positions. Move tiles around until the empty space is immediately to the left of the top-right corner. Now bring the next-to-last tile into this space. Now the top-right corner is open, and you can move the last tile into this corner. You’ve now solved the top row! Leave it untouched for the remainder of the puzzle. Solving the Left Column Move the second tile of the left column directly beneath the first tile. Now that the top row is set, it’s time to work on the left column. If you are working with a 3x3 puzzle, you may skip down to “Solving the Remaining 3x2 Puzzle.” Otherwise, we will proceed the same way we did with the top row, only now we’re working on the opposite axis. Move the second tile of the left column into the space immediately below the top-left corner. On a 4x4 grid, the next tile of the left column is no. 5. On a 5x5 grid, the next tile of the left column is no. 6. Set all but the last two tiles of the left column. Just as you did with the top row, you need to arrange the left column so that all but the last two pieces are in place. If the grid is 4x4, you have already accomplished this on the previous step. Otherwise, continue to arrange the left column until there are only two tiles left to set this column. If your grid is 5x5, these two tiles will be nos. 16 and 21. Remove the last tile from the left column. We’re doing the same thing with the left column that we did with the top row. That means that the last tile (the one that will eventually inhabit the bottom-left corner) cannot be in this column until we’re ready to set the last two tiles together. Move next-to-last tile into the bottom-left corner. This tile will eventually be placed in the space immediately above the bottom-left corner. If your grid is 4x4, the next-to-last tile is no. 9. If your grid is 5x5, the next-to-last tile is no. 16. Move the last tile directly to the right of bottom-left corner. This will make it easy to arrange the last two tiles of this column column the same way we arranged the top row. Move the last two tiles into their positions. Let’s finish this column! Move the tiles until you can transfer the next-to-last tile up one space. Now you have an open corner for the last tile of the column. Move it into the empty bottom-left corner. Leave the left column untouched for the remainder of the puzzle, just as you are leaving the top row untouched. Solving the Remaining 3x2 Puzzle Repeat the first two methods until only a 3x2 grid remains. If you start with the top row and the left column, you can solve slide puzzles of any size by breaking them into smaller and smaller grids. Keep solving the top row and leftmost column as many times as necessary until you have a 3x2 grid, with five tiles left to arrange. If your grid is 4x4, you will have a 3x3 grid to solve after taking care of the first two methods. Repeating the first method (“Solving the Top Row”) will leave you with a 3x2 grid. If your grid is 5x5, your new grid will be 4x4, and you will have to repeat each of the first two methods (“Solving the Top Row” and “Solving the Left Column”) once more. Arrange the top-left tile in the bottom-left space. At this point, the puzzle gets a bit trickier. Fortunately, there are only five pieces and a limited number of ways that they can be moved. Setting the left-most column is a good place to start. On a 3x3 grid, the top-left tile tile of the 3x2 grid is no. 4. On a 4x4 grid, the top-left tile tile of the 3x2 grid is no. 10. On a 5x5 grid, the top-left tile tile of the 3x2 grid is no. 18. Place the bottom-left tile to the right of its space. If we move the bottom-left tile into the space immediately to the right of where it must go, we can set the left-most column of our 3x2 grid the same way we finished rows and columns in previous methods. On a 3x3 grid, the bottom-left tile of the 3x2 grid is no. 7. On a 4x4 grid, the bottom-left tile of the 3x2 grid is no. 14. On a 5x5 grid, the bottom-left tile of the 3x2 grid is no. 23. Move the left-most tiles into place. Arrange the 3x2 grid so that the top-left corner is empty. Move the top-left tile up, and then move the bottom-left tile into its place. At this point, we only have a 2x2 puzzle to organize. Move the remaining pieces into their places. There are now only three tiles left, and it does not take many moves to set them properly. Rotate them around until they are all in their proper place. Congratulations! You’ve solved a slide puzzle!",
  "tyn_model":[
    "“solving",
    "tiles",
    "slide puzzles",
    "”)",
    "paper",
    "puzzle",
    "” otherwise",
    "” and",
    "slide puzzle"
  ],
  "tyn_section":[

  ]
}