{
  "title":"How to Get Calcium As a Vegan",
  "url":"https://www.wikihow.com/Get-Calcium-As-a-Vegan",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan"
  ],
  "methods":[
    {
      "name":"Choosing Vegan Calcium Sources",
      "steps":[
        {
          "headline":"Go for calcium-fortified cereals that don’t contain wheat bran.",
          "description":"Check labels and nutrition facts when you go grocery shopping, and choose products with added calcium. Depending on the variety, fortified cereals contain 10 to 100% of your daily calcium needs per 1 cup (25 g) serving. While wheat bran is healthy, it can prevent your body from absorbing calcium. Read the ingredients, and choose fortified corn, oat, or rice cereals."
        },
        {
          "headline":"Drink fortified juices and non-dairy milks.",
          "description":"Typically, fortified orange juice and soy milk contain about 30% of your daily requirement per 8 fluid-ounce (240 mL) glass. If you have a bowl of cereal that contains 250 mg of calcium per serving, top it with soy milk, and drink a glass of orange juice, you’ll consume about 850 mg of calcium, or 85% of your daily requirement. You can also find calcium-fortified yogurt and frozen yogurt, which contain 20 to 30% of your daily requirement per 1 cup (240 mL) serving. Shake fortified beverages well before use to make sure added calcium hasn’t settled on the bottom of the carton."
        },
        {
          "headline":"Eat plenty of broccoli, kale, bok choy, and turnip greens.",
          "description":"While they don’t contain as much calcium as fortified foods, dark greens can still help you add the mineral to your diet. To add about 100 to 200 mg of calcium to your daily total, have a salad for lunch with 1 cup (67 g) of kale, and include 1⁄2 cup (78 g) of steamed broccoli with dinner. While spinach, rhubarb, and arugula are dark greens and contain a lot of calcium, they’re also high in oxalic acid. Oxalic acid can prevent your body from absorbing calcium. Eat a variety of calcium-rich foods, including dark greens, instead of just relying on fortified products. Varying your diet can help ensure your body is actually absorbing the nutrients contained in the foods and beverages you consume."
        },
        {
          "headline":"Include calcium-set tofu in your diet.",
          "description":"Read labels and be sure to purchase calcium-set tofu instead of regular tofu. Calcium-set tofu contains about 150 to 250 mg of calcium per  1⁄2 cup (225 g) serving, or 15 to 25% of the  daily value recommended for most people. Salt is used to set, or coagulate, tofu; calcium-set tofu is set with food-grade calcium sulfate."
        },
        {
          "headline":"Snack on dried figs and unsalted nuts.",
          "description":"Pack extra calcium, along with other nutrients, into your diet with healthy snacks. Just 8 or 9 dried figs, or ½ cup (80 g), contain about 50 mg of calcium. Almonds, peanuts, and Brazil nuts are also good sources of calcium, but be sure to stick with unsalted products. Too much salt can interfere with calcium absorption, and it’s bad for your overall health."
        },
        {
          "headline":"Add sesame seeds to your meals.",
          "description":"Sesame seeds are packed with calcium; just a tablespoon (8.75 g) contains about 8% of your daily requirement. From salads to salmon, you can top virtually any meal with raw or toasted sesame seeds. You can also dress your salads with sesame tahini, or pair it with crackers and low-sodium pita. Additionally, sesame seeds and tahini, as well as almonds and peanuts, contain lots of iron and protein. If you follow a plant-based diet, you’re also prone to developing deficiencies in these nutrients."
        }
      ]
    },
    {
      "name":"Maximizing Your Calcium Absorption",
      "steps":[
        {
          "headline":"Steam or sauté veggies instead of boiling them.",
          "description":"Cooking vegetables in a lot of water for a long period of time washes away calcium and other nutrients. Instead, cook calcium-rich veggies for as little time as possible, or until they’re just tender.Tip: For best results, use a steam basket to keep veggies from touching the surface of the water. In addition, try to eat a mix of raw and cooked vegetables. For instance, toss raw broccoli and bok choy with lettuce or kale to make a raw, nutritious salad."
        },
        {
          "headline":"Avoid eating wheat bran and high-oxalate foods with calcium-rich meals.",
          "description":"These foods are still healthy, and you shouldn’t avoid them altogether. However, skip these items during your high-calcium meals. Wheat bran, sweet potatoes, and leafy greens that are high in oxalic acid can block over 80% of a meal’s available calcium from absorption."
        },
        {
          "headline":"Choose products that are fortified with vitamin D. Your body can’t process calcium without vitamin D. Fortunately, vitamin D is also added to many calcium-fortified products, such as orange juice and non-dairy milks.",
          "description":"Check labels when you grocery shop, and make sure the fortified products you purchase contain vitamin D.\nFortified cereals contain 10 to 25% of your daily vitamin D requirement per serving. Orange juice, non-dairy milks, and non-dairy yogurt contain between 20 and 40%. The only natural sources of vitamin D are animal products, mushrooms, and sunlight. If you don’t get much sun exposure, or if you don’t consume enough fortified foods and beverages, consider taking a daily vitamin D supplement."
        },
        {
          "headline":"Limit your salt intake.",
          "description":"Most healthy adults should limit their daily salt intake to 2300 mg, or about a teaspoon. Excessive salt increases the amount of calcium that gets flushed from your body when you urinate. Avoid adding salt to your meals, and try substituting dried or fresh herbs, citrus juice, and citrus zest when you cook. Check the sodium content of canned veggies, sauces, and condiments, and go for low-sodium options."
        },
        {
          "headline":"Avoid drinking alcohol excessively.",
          "description":"In general, men should drink no more than 1 to 2 alcoholic beverages per day, and women should limit their consumption to 1 drink per day. Drinking in excess can block substances in the liver that activate vitamin D, which leads to reduced calcium absorption. One serving of alcohol equals 12  fl oz (350 ml) of beer, 5  fl oz (150 ml) of wine, or 1 ⁄2  fl oz (44 ml) of hard liquor."
        }
      ]
    },
    {
      "name":"Taking Dietary Supplements",
      "steps":[
        {
          "headline":"Consult your doctor if you have a medical condition.",
          "description":"Calcium and vitamin D supplements can make prescription drugs less effective or cause unwanted side effects. Before using a dietary supplement, ask your doctor how it could affect your medical condition or interact with any prescription medications you take. For instance, calcium and vitamin D supplements may interact with some diuretics, thyroid medications, antibiotics, and cholesterol-lowering medications. Unwanted side effects may include weakened bones, decreased blood circulation, dehydration, and kidney stones."
        },
        {
          "headline":"Go for calcium citrate if you want the most efficiently absorbed option.",
          "description":"Of the 2 most popular supplement forms, your body has the easiest time absorbing calcium citrate. It’s more expensive, but you can take it with or without food. Find calcium citrate and other dietary supplements online, at your local pharmacy, or at health supply stores."
        },
        {
          "headline":"Choose calcium carbonate for the least expensive option.",
          "description":"Calcium carbonate is cheaper than calcium citrate, but it must be taken with food. Antacid tablets, such as Tums and Rolaids, contain calcium carbonate and can be taken as calcium supplements. Since it neutralizes stomach acid, calcium carbonate isn’t the best choice if you have low levels of stomach acid (achlorhydria) or inflammatory bowel disease."
        },
        {
          "headline":"Take 200 to 500 mg doses of calcium 1 to 2 times per day.",
          "description":"Whether you choose calcium citrate or calcium carbonate, take smaller doses throughout the day instead of 1 large dose. If you’re eating plenty of fortified products and other calcium-rich foods, take a maximum dose of 200 mg 1 to 2 times per day. Talk to your doctor about your diet and ask them to recommend the right dosage amount. Remember that getting vitamins and minerals from nutritious foods is better than taking dietary supplements. Your body just flushes excess calcium in doses higher than 500 mg. Additionally, taking doses of 500 mg or higher at once may lead to gas, bloating, kidney stones, or constipation, especially if you take calcium carbonate. Excessive calcium can also interfere with how your body absorbs iron or zinc."
        },
        {
          "headline":"Include a vitamin D supplement if your diet is low in vitamin D. Lichen-based vitamin D supplements aren’t made with animal products, so they’re vegan-friendly.",
          "description":"If you don’t consume enough vitamin D through fortified products, consider taking a 400 IU daily supplement. Take a vitamin D supplement with food. Most people need 600 to 1000 IU (15 to 25 mcg) of vitamin D per day. Discuss your diet with your doctor, ask if they recommend taking a vitamin D supplement, and consult them about the right dosage amount."
        }
      ]
    }
  ],
  "text":" Choosing Vegan Calcium Sources Go for calcium-fortified cereals that don’t contain wheat bran. Check labels and nutrition facts when you go grocery shopping, and choose products with added calcium. Depending on the variety, fortified cereals contain 10 to 100% of your daily calcium needs per 1 cup (25 g) serving. While wheat bran is healthy, it can prevent your body from absorbing calcium. Read the ingredients, and choose fortified corn, oat, or rice cereals. Drink fortified juices and non-dairy milks. Typically, fortified orange juice and soy milk contain about 30% of your daily requirement per 8 fluid-ounce (240 mL) glass. If you have a bowl of cereal that contains 250 mg of calcium per serving, top it with soy milk, and drink a glass of orange juice, you’ll consume about 850 mg of calcium, or 85% of your daily requirement. You can also find calcium-fortified yogurt and frozen yogurt, which contain 20 to 30% of your daily requirement per 1 cup (240 mL) serving. Shake fortified beverages well before use to make sure added calcium hasn’t settled on the bottom of the carton. Eat plenty of broccoli, kale, bok choy, and turnip greens. While they don’t contain as much calcium as fortified foods, dark greens can still help you add the mineral to your diet. To add about 100 to 200 mg of calcium to your daily total, have a salad for lunch with 1 cup (67 g) of kale, and include 1⁄2 cup (78 g) of steamed broccoli with dinner. While spinach, rhubarb, and arugula are dark greens and contain a lot of calcium, they’re also high in oxalic acid. Oxalic acid can prevent your body from absorbing calcium. Eat a variety of calcium-rich foods, including dark greens, instead of just relying on fortified products. Varying your diet can help ensure your body is actually absorbing the nutrients contained in the foods and beverages you consume. Include calcium-set tofu in your diet. Read labels and be sure to purchase calcium-set tofu instead of regular tofu. Calcium-set tofu contains about 150 to 250 mg of calcium per  1⁄2 cup (225 g) serving, or 15 to 25% of the  daily value recommended for most people. Salt is used to set, or coagulate, tofu; calcium-set tofu is set with food-grade calcium sulfate. Snack on dried figs and unsalted nuts. Pack extra calcium, along with other nutrients, into your diet with healthy snacks. Just 8 or 9 dried figs, or ½ cup (80 g), contain about 50 mg of calcium. Almonds, peanuts, and Brazil nuts are also good sources of calcium, but be sure to stick with unsalted products. Too much salt can interfere with calcium absorption, and it’s bad for your overall health. Add sesame seeds to your meals. Sesame seeds are packed with calcium; just a tablespoon (8.75 g) contains about 8% of your daily requirement. From salads to salmon, you can top virtually any meal with raw or toasted sesame seeds. You can also dress your salads with sesame tahini, or pair it with crackers and low-sodium pita. Additionally, sesame seeds and tahini, as well as almonds and peanuts, contain lots of iron and protein. If you follow a plant-based diet, you’re also prone to developing deficiencies in these nutrients. Maximizing Your Calcium Absorption Steam or sauté veggies instead of boiling them. Cooking vegetables in a lot of water for a long period of time washes away calcium and other nutrients. Instead, cook calcium-rich veggies for as little time as possible, or until they’re just tender.Tip: For best results, use a steam basket to keep veggies from touching the surface of the water. In addition, try to eat a mix of raw and cooked vegetables. For instance, toss raw broccoli and bok choy with lettuce or kale to make a raw, nutritious salad. Avoid eating wheat bran and high-oxalate foods with calcium-rich meals. These foods are still healthy, and you shouldn’t avoid them altogether. However, skip these items during your high-calcium meals. Wheat bran, sweet potatoes, and leafy greens that are high in oxalic acid can block over 80% of a meal’s available calcium from absorption. Choose products that are fortified with vitamin D. Your body can’t process calcium without vitamin D. Fortunately, vitamin D is also added to many calcium-fortified products, such as orange juice and non-dairy milks. Check labels when you grocery shop, and make sure the fortified products you purchase contain vitamin D.\nFortified cereals contain 10 to 25% of your daily vitamin D requirement per serving. Orange juice, non-dairy milks, and non-dairy yogurt contain between 20 and 40%. The only natural sources of vitamin D are animal products, mushrooms, and sunlight. If you don’t get much sun exposure, or if you don’t consume enough fortified foods and beverages, consider taking a daily vitamin D supplement. Limit your salt intake. Most healthy adults should limit their daily salt intake to 2300 mg, or about a teaspoon. Excessive salt increases the amount of calcium that gets flushed from your body when you urinate. Avoid adding salt to your meals, and try substituting dried or fresh herbs, citrus juice, and citrus zest when you cook. Check the sodium content of canned veggies, sauces, and condiments, and go for low-sodium options. Avoid drinking alcohol excessively. In general, men should drink no more than 1 to 2 alcoholic beverages per day, and women should limit their consumption to 1 drink per day. Drinking in excess can block substances in the liver that activate vitamin D, which leads to reduced calcium absorption. One serving of alcohol equals 12  fl oz (350 ml) of beer, 5  fl oz (150 ml) of wine, or 1 ⁄2  fl oz (44 ml) of hard liquor. Taking Dietary Supplements Consult your doctor if you have a medical condition. Calcium and vitamin D supplements can make prescription drugs less effective or cause unwanted side effects. Before using a dietary supplement, ask your doctor how it could affect your medical condition or interact with any prescription medications you take. For instance, calcium and vitamin D supplements may interact with some diuretics, thyroid medications, antibiotics, and cholesterol-lowering medications. Unwanted side effects may include weakened bones, decreased blood circulation, dehydration, and kidney stones. Go for calcium citrate if you want the most efficiently absorbed option. Of the 2 most popular supplement forms, your body has the easiest time absorbing calcium citrate. It’s more expensive, but you can take it with or without food. Find calcium citrate and other dietary supplements online, at your local pharmacy, or at health supply stores. Choose calcium carbonate for the least expensive option. Calcium carbonate is cheaper than calcium citrate, but it must be taken with food. Antacid tablets, such as Tums and Rolaids, contain calcium carbonate and can be taken as calcium supplements. Since it neutralizes stomach acid, calcium carbonate isn’t the best choice if you have low levels of stomach acid (achlorhydria) or inflammatory bowel disease. Take 200 to 500 mg doses of calcium 1 to 2 times per day. Whether you choose calcium citrate or calcium carbonate, take smaller doses throughout the day instead of 1 large dose. If you’re eating plenty of fortified products and other calcium-rich foods, take a maximum dose of 200 mg 1 to 2 times per day. Talk to your doctor about your diet and ask them to recommend the right dosage amount. Remember that getting vitamins and minerals from nutritious foods is better than taking dietary supplements. Your body just flushes excess calcium in doses higher than 500 mg. Additionally, taking doses of 500 mg or higher at once may lead to gas, bloating, kidney stones, or constipation, especially if you take calcium carbonate. Excessive calcium can also interfere with how your body absorbs iron or zinc. Include a vitamin D supplement if your diet is low in vitamin D. Lichen-based vitamin D supplements aren’t made with animal products, so they’re vegan-friendly. If you don’t consume enough vitamin D through fortified products, consider taking a 400 IU daily supplement. Take a vitamin D supplement with food. Most people need 600 to 1000 IU (15 to 25 mcg) of vitamin D per day. Discuss your diet with your doctor, ask if they recommend taking a vitamin D supplement, and consult them about the right dosage amount.",
  "tyn_model":[
    "calcium",
    "vitamin d",
    "salt",
    "calcium carbonate",
    "calcium citrate",
    "wheat bran",
    "orange juice",
    "calcium-set tofu",
    "vitamin d.",
    "kale",
    "sesame seeds",
    "vitamin d supplements",
    "soy milk",
    "yogurt",
    "broccoli",
    "tofu",
    "nuts",
    "peanuts",
    "vegetables",
    "water",
    "vitamin d supplement",
    "alcohol",
    "dietary supplements",
    "rice cereals",
    "frozen yogurt",
    "bok choy,",
    "turnip greens",
    "dark greens",
    "steamed broccoli",
    "spinach",
    "rhubarb",
    "arugula",
    "oxalic acid",
    "calcium sulfate",
    "sesame",
    "sesame tahini",
    "crackers",
    "almonds",
    "steam basket",
    "lettuce",
    "sweet potatoes",
    "mushrooms",
    "beer",
    "wine",
    "hard liquor",
    "dietary supplement",
    "antibiotics",
    "calcium supplements"
  ],
  "tyn_section":[

  ]
}