{
  "title":"How to Cook Acorn Squash",
  "url":"https://www.wikihow.com/Cook-Acorn-Squash",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Squash"
  ],
  "methods":[
    {
      "name":"Baked Acorn Squash",
      "steps":[
        {
          "headline":"Preheat oven to 400 degrees F (204 degrees C).",
          "description":"On a cutting board, use a chef's knife to cut the acorn squash in half, from stem to end."
        },
        {
          "headline":"Scoop out the seeds and stringy portion from the center of each half.",
          "description":"Place each half in a baking pan, skin-side down. Butter the pan or use a non-stick spray to prevent the bottom of the squash from sticking to the pan."
        },
        {
          "headline":"Spread 1/2 tablespoon (29.6 ml) of butter onto each half of the squash.",
          "description":"Sprinkle the brown sugar and maple syrup evenly onto each half."
        },
        {
          "headline":"Bake in the oven for about one hour.",
          "description":"The squash should be very soft, and the tops browned. Remove from the oven and allow to cool before serving."
        }
      ]
    },
    {
      "name":"Microwaved Acorn Squash",
      "steps":[
        {
          "headline":"Place whole squash on a plate and microwave for 4 minutes.",
          "description":"Remove the plate, turn the squash over, and microwave for another 4 minutes."
        },
        {
          "headline":"Remove the squash from the microwave.",
          "description":"Use a chef's knife to cut it in half, from stem to end. Use a spoon to scoop out the seeds and stringy portion in the center."
        },
        {
          "headline":"Spread butter onto each half.",
          "description":"Sprinkle 2 teaspoons of brown sugar onto each half."
        },
        {
          "headline":"Microwave the squash, skin-side down, for another 3 minutes.",
          "description":"Remove from the microwave. Allow to cool and then serve."
        }
      ]
    },
    {
      "name":"Whipped Acorn Squash",
      "steps":[
        {
          "headline":"Fill a large pot with water.",
          "description":"Add the squash, and bring it to a boil. Lower the heat to a simmer."
        },
        {
          "headline":"Continue to cook for another 15 minutes.",
          "description":"Squash should be soft when finished."
        },
        {
          "headline":"Drain the pot.",
          "description":"On a cutting board, cut the skin off of each cube of squash. Return to the pot."
        },
        {
          "headline":"Add butter, sugar, and nutmeg.",
          "description":"Use a fork to mash the squash, and then whip until smooth."
        }
      ]
    },
    {
      "name":"Acorn Squash Soup with Apples and Horseradish",
      "steps":[
        {
          "headline":"Preheat oven to 450 degrees F (232 degrees C).",
          "description":""
        },
        {
          "headline":"Cut the acorn squash in half lengthwise, scoop out seeds, and place on a baking tray.",
          "description":"Make sure that the baking tray is adequately covered with cooking spray before placing squash, cut-side down, onto the tray."
        },
        {
          "headline":"Bake squash for 45 minutes, or until tender and browning.",
          "description":""
        },
        {
          "headline":"In a large saucepan, combine chicken stock, apple cider, 1 teaspoon horseradish, salt, and pepper.",
          "description":"Bring these ingredients to a simmer."
        },
        {
          "headline":"Scoop flesh of squash from its skin and add to the chicken broth mixture.",
          "description":""
        },
        {
          "headline":"With a hand blender, puree the stock mixture.",
          "description":"Make sure to break up any large squash pieces. Alternately, if you don't have a hand blender, before adding squash to the chicken stock mixture, place squash in a food processor with 1 cup of the chicken stock. Puree until any large chunks are fully removed."
        },
        {
          "headline":"Peel, core, and dice your apples into a 1/4\" dice.",
          "description":""
        },
        {
          "headline":"Add diced apples, lemon juice, and remaining horseradish into a small bowl.",
          "description":"Combine thoroughly."
        },
        {
          "headline":"In a medium pan coated with olive oil spray, sauté diced apple mixture until golden brown.",
          "description":"Remove from heat once a golden brown coat emerges."
        },
        {
          "headline":"Serve acorn squash soup with apple dice as garnish on top.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Baked Acorn Squash Preheat oven to 400 degrees F (204 degrees C). On a cutting board, use a chef's knife to cut the acorn squash in half, from stem to end. Scoop out the seeds and stringy portion from the center of each half. Place each half in a baking pan, skin-side down. Butter the pan or use a non-stick spray to prevent the bottom of the squash from sticking to the pan. Spread 1/2 tablespoon (29.6 ml) of butter onto each half of the squash. Sprinkle the brown sugar and maple syrup evenly onto each half. Bake in the oven for about one hour. The squash should be very soft, and the tops browned. Remove from the oven and allow to cool before serving. Microwaved Acorn Squash Place whole squash on a plate and microwave for 4 minutes. Remove the plate, turn the squash over, and microwave for another 4 minutes. Remove the squash from the microwave. Use a chef's knife to cut it in half, from stem to end. Use a spoon to scoop out the seeds and stringy portion in the center. Spread butter onto each half. Sprinkle 2 teaspoons of brown sugar onto each half. Microwave the squash, skin-side down, for another 3 minutes. Remove from the microwave. Allow to cool and then serve. Whipped Acorn Squash Fill a large pot with water. Add the squash, and bring it to a boil. Lower the heat to a simmer. Continue to cook for another 15 minutes. Squash should be soft when finished. Drain the pot. On a cutting board, cut the skin off of each cube of squash. Return to the pot. Add butter, sugar, and nutmeg. Use a fork to mash the squash, and then whip until smooth. Acorn Squash Soup with Apples and Horseradish Preheat oven to 450 degrees F (232 degrees C).  Cut the acorn squash in half lengthwise, scoop out seeds, and place on a baking tray. Make sure that the baking tray is adequately covered with cooking spray before placing squash, cut-side down, onto the tray. Bake squash for 45 minutes, or until tender and browning.  In a large saucepan, combine chicken stock, apple cider, 1 teaspoon horseradish, salt, and pepper. Bring these ingredients to a simmer. Scoop flesh of squash from its skin and add to the chicken broth mixture.  With a hand blender, puree the stock mixture. Make sure to break up any large squash pieces. Alternately, if you don't have a hand blender, before adding squash to the chicken stock mixture, place squash in a food processor with 1 cup of the chicken stock. Puree until any large chunks are fully removed. Peel, core, and dice your apples into a 1/4\" dice.  Add diced apples, lemon juice, and remaining horseradish into a small bowl. Combine thoroughly. In a medium pan coated with olive oil spray, sauté diced apple mixture until golden brown. Remove from heat once a golden brown coat emerges. Serve acorn squash soup with apple dice as garnish on top.  Finished. ",
  "tyn_model":[
    "squash",
    "oven",
    "butter",
    "microwave",
    "apples",
    "chicken stock",
    "chef's knife",
    "acorn squash",
    "brown sugar",
    "plate",
    "pot",
    "baking tray",
    "horseradish",
    "cutting board",
    "baking pan",
    "non-stick spray",
    "maple syrup",
    "spoon",
    "whipped acorn squash",
    "large pot",
    "water",
    "sugar",
    "nutmeg",
    "fork",
    "cooking spray",
    "large saucepan",
    "apple cider",
    "salt",
    "pepper",
    "chicken broth",
    "hand blender",
    "stock",
    "blender",
    "food processor",
    "lemon juice",
    "small bowl",
    "olive oil",
    "apple",
    "acorn squash soup",
    "apple dice"
  ],
  "tyn_section":[

  ]
}