{
  "title":"How to Cover Windows Without Curtains",
  "url":"https://www.wikihow.com/Cover-Windows-Without-Curtains",
  "category_hierarchy":[
    "Home and Garden",
    "Home Decorating",
    "Home Decor"
  ],
  "methods":[
    {
      "name":"Placing Blinds or Shades over Your Windows",
      "steps":[
        {
          "headline":"Install blinds for a clean, adjustable look.",
          "description":"Blinds are a great substitute for curtains. If you'd like to try blinds, you'll first need to measure the width and height of your window. Then, purchase sets of blinds at a local home-improvement store. Begin the installation by hanging the brackets at the top corners of each window. Then, hang the head rail and attach the valence over it once the rail is in place. Blinds allow complete control over the amount of light that comes in. You can raise blinds during the day and lower them at night, and can also adjust the positioning of the slats to allow more or less daylight into your home. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCindy Hofen, MBA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organizer & Home Staging Specialist\t\t\t\t\t\t\t\tCindy Hofen is a Certified Relocation Specialist and the founder of Managing Moves & More, a San Francisco Bay Area-based professional move management company specializing in start-to-finish moving solutions, home clearouts, estate sales, and home staging. Since 2009, her team has helped over 2,500 clients to simplify their transitions. Cindy has over 10 years of professional moving and organizing experience, is a member of the National Association of Senior Move Managers (NASMM), holds an A+ Accreditation, and belongs to the Diamond Society. She has a Master of Business Administration from Arizona State University and a BA in Business Economics from the University of California, Santa Barbara. Cindy Hofen, MBA\t\t\tProfessional Organizer & Home Staging Specialist\t\t\t\tOur Expert Agrees: Blinds are a great option to cover your windows when you still want plenty of natural light. Just open them in the morning, then close them at night for more privacy."
        },
        {
          "headline":"Choose wood blinds for your office, den, or study.",
          "description":"Wood blinds are darker than vinyl blinds (which are typically white) and can bring a rustic look to the rooms of your home. They come in a variety of stained or painted colors, so can be customized to suit your décor. As with other types of blinds, they can be adjusted throughout the day (and night) to allow natural light or close of visibility. Do not install wooden blinds in the kitchen or bathroom, since the moisture could damage the wood."
        },
        {
          "headline":"Opt for vertical blinds in a window that’s wider than it is tall.",
          "description":"Vertical blinds work well in tall, narrow hallway or entranceway windows that are less than 1 foot (30 cm) wide. They cannot be raised and lowered, since the slats are vertical. However, you can still adjust the slats to let in more or less light depending on the time of day. Installing traditional horizontal blinds in a tall, narrow window would be impractical and look odd."
        },
        {
          "headline":"Use shades for a soft covering that allows ambient light.",
          "description":"If you don't want your window coverings to block out too much ambient light, choose shades. Shades are typically made of soft cloth and can be raised or lowered during the day or night, respectively. They also allow more ambient light than blinds and come in a larger variety of styles. Purchase shades at any home-improvement store. Install honeycomb shades if you live in a cold climate. Honeycomb shades contain many small tubes of air that hold warm air and keep your home warm overnight. Try woven wood shades in rooms that receive overly bright sunlight. Woven shades are typically made from bamboo. They block a great deal of light, but can still be raised and lowered depending on how bright the room needs to be."
        },
        {
          "headline":"Select Roman shades in more formal dining or living rooms.",
          "description":"Roman shades are made of billowy fabric that you can raise or lower to let in more or less light, or to block the inside of your home from view at night. They’re considered a sleek option and are typically custom-ordered for individual windows. Also order blackout Roman shades if you’d like the option to shut out all light from a room. If you like the idea of fabric shades but don’t have a formal room, try an opaque twill tight-weave shade."
        }
      ]
    },
    {
      "name":"Applying Coverings to the Glass",
      "steps":[
        {
          "headline":"Attach faux stained glass to your windows for a colorful look.",
          "description":"If you’d like to cover your windows while adding a burst of color to your home, faux stained glass is the way to go. Purchase pre-made faux stained glass windows at a hobby or craft-supply store. Depending on the window’s location, either lean the faux stained glass up against it or attach the glass to the window frame with mirror hanging hardware. Or, you can make your own faux stained glass panes. You’ll need to purchase a glass pane the same size as the window you’re covering, and color it using stencils and glass paint. You can purchase all the items at a craft store or hobby-supply shop."
        },
        {
          "headline":"Layer gallery glass over your windows to create an opaque surface.",
          "description":"If you want to make the surface of your windows translucent but don’t want to completely block visibility and natural light, try gallery glass. Gallery glass is a liquid that you can apply directly to your windows that dries opaque but still lets in some natural light. Follow the directions to apply the gallery glass to your window, and add texture by running a toothpick through the material before it dries. Purchase gallery glass at a local art-supply store or hobby shop."
        },
        {
          "headline":"Apply window insulation film to the windows to keep in warm air.",
          "description":"Window insulation film adds an insulating layer over your windows and will trap warm air in your home during chilly winter months. To apply it, stick the adhesive side of the insulation film directly onto the surface of the window. Then, blow hot air onto the film using a hair dryer. After 3-5 minutes, the film will shrink and fully adhere to the window. Purchase window insulation film at a local hardware store or any major home-improvement store. The package should clearly state how much glass the insulation film will cover."
        }
      ]
    },
    {
      "name":"Covering Windows with Shutters",
      "steps":[
        {
          "headline":"Mount panel shutters over your windows to block visibility at night.",
          "description":"Shutters are a common alternative to curtains and blinds. The horizontal slats allow partial visibility, and you can open or close the shutters depending on the time of day and intensity of the natural outdoor light. Purchase shutters at your local home-improvement store. They come in a variety of colors, sizes, and materials, so choose an option that suits the size of your windows. The shutters will come with directions for how to install them. If you’d rather not install the shutters yourself, the home-improvement store can send professionals to install them for you."
        },
        {
          "headline":"Install interior barn door shutters for a rustic look.",
          "description":"Indoor barn door shutters are both practical and aesthetic. They give your home a rustic, rural appeal and, like traditional shutters, can be adjusted to let in more or less light throughout the day. Most styles of barn door shutters slide back and forth on track mounts. Purchase barn door shutters at a home-improvement store near you. Many large online retailers and general home-supply stores also sell barn door shutters, although these may be a lower quality."
        },
        {
          "headline":"Set up plantation shutters for full control over visibility.",
          "description":"Unlike panel shutters, plantation shutters can be minutely adjusted from inside of the house by raising or lowering a bar that controls the shutter slats. This allows you to make slight adjustments to the amount of natural light that enters your home as the position of the sun changes. Plantation shutters also fully reduce visibility in at night. Buy plantation shutters at any major home-improvement store. As with other shutter types, you can either install them yourself or ask the store to send a technician to install the shutters for you."
        }
      ]
    },
    {
      "name":"Covering the Window with Objects",
      "steps":[
        {
          "headline":"Mount a shelf in front of a window for partial coverage.",
          "description":"A shelf is a great way to partially cover a window without blocking out natural light. Measure the width of your window, and buy a shelf that’s about 4 inches (10 cm) wider at a local home-improvement store. Mount the shelf as directed in the instructions that come with the shelf. Then, decorate the shelf as you like: for example, add a few houseplants, a couple of books, and a decorative vase. As an added bonus, you’ll increase the amount of storage space in your home."
        },
        {
          "headline":"Hang a DIY valence made of draped fabric in front of the window.",
          "description":"Drive 2 nails (or push pins) into the wall, 1 on each side of the top of your window. Tie a piece of twine or string between the nails. Then, hang 15–20 pieces of fabric over it. Each strip should be between 20–25 inches (51–64 cm) long. Use bandanas, scarves, or a leftover fabric garland. The valence will fully cover the top portion of your window but still allow some visibility and natural light. For a more refined-looking valence, hang a curtain rod over your window, and drape pieces of fabric over the rod."
        },
        {
          "headline":"Place 3–5 tall potted plants in front of a window.",
          "description":"While plants aren’t technically a window covering, they’re effective at partially blocking visibility while allowing in natural light. Try setting a few houseplants on the windowsill of a kitchen window. Or, if you want to cover a tall, narrow window (e.g., in a hall or entranceway), set a single tall houseplant directly in front of it. Purchase house plants at a plant nursery or gardening center."
        }
      ]
    }
  ],
  "text":" Placing Blinds or Shades over Your Windows Install blinds for a clean, adjustable look. Blinds are a great substitute for curtains. If you'd like to try blinds, you'll first need to measure the width and height of your window. Then, purchase sets of blinds at a local home-improvement store. Begin the installation by hanging the brackets at the top corners of each window. Then, hang the head rail and attach the valence over it once the rail is in place. Blinds allow complete control over the amount of light that comes in. You can raise blinds during the day and lower them at night, and can also adjust the positioning of the slats to allow more or less daylight into your home. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCindy Hofen, MBA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organizer & Home Staging Specialist\t\t\t\t\t\t\t\tCindy Hofen is a Certified Relocation Specialist and the founder of Managing Moves & More, a San Francisco Bay Area-based professional move management company specializing in start-to-finish moving solutions, home clearouts, estate sales, and home staging. Since 2009, her team has helped over 2,500 clients to simplify their transitions. Cindy has over 10 years of professional moving and organizing experience, is a member of the National Association of Senior Move Managers (NASMM), holds an A+ Accreditation, and belongs to the Diamond Society. She has a Master of Business Administration from Arizona State University and a BA in Business Economics from the University of California, Santa Barbara. Cindy Hofen, MBA\t\t\tProfessional Organizer & Home Staging Specialist\t\t\t\tOur Expert Agrees: Blinds are a great option to cover your windows when you still want plenty of natural light. Just open them in the morning, then close them at night for more privacy. Choose wood blinds for your office, den, or study. Wood blinds are darker than vinyl blinds (which are typically white) and can bring a rustic look to the rooms of your home. They come in a variety of stained or painted colors, so can be customized to suit your décor. As with other types of blinds, they can be adjusted throughout the day (and night) to allow natural light or close of visibility. Do not install wooden blinds in the kitchen or bathroom, since the moisture could damage the wood. Opt for vertical blinds in a window that’s wider than it is tall. Vertical blinds work well in tall, narrow hallway or entranceway windows that are less than 1 foot (30 cm) wide. They cannot be raised and lowered, since the slats are vertical. However, you can still adjust the slats to let in more or less light depending on the time of day. Installing traditional horizontal blinds in a tall, narrow window would be impractical and look odd. Use shades for a soft covering that allows ambient light. If you don't want your window coverings to block out too much ambient light, choose shades. Shades are typically made of soft cloth and can be raised or lowered during the day or night, respectively. They also allow more ambient light than blinds and come in a larger variety of styles. Purchase shades at any home-improvement store. Install honeycomb shades if you live in a cold climate. Honeycomb shades contain many small tubes of air that hold warm air and keep your home warm overnight. Try woven wood shades in rooms that receive overly bright sunlight. Woven shades are typically made from bamboo. They block a great deal of light, but can still be raised and lowered depending on how bright the room needs to be. Select Roman shades in more formal dining or living rooms. Roman shades are made of billowy fabric that you can raise or lower to let in more or less light, or to block the inside of your home from view at night. They’re considered a sleek option and are typically custom-ordered for individual windows. Also order blackout Roman shades if you’d like the option to shut out all light from a room. If you like the idea of fabric shades but don’t have a formal room, try an opaque twill tight-weave shade. Applying Coverings to the Glass Attach faux stained glass to your windows for a colorful look. If you’d like to cover your windows while adding a burst of color to your home, faux stained glass is the way to go. Purchase pre-made faux stained glass windows at a hobby or craft-supply store. Depending on the window’s location, either lean the faux stained glass up against it or attach the glass to the window frame with mirror hanging hardware. Or, you can make your own faux stained glass panes. You’ll need to purchase a glass pane the same size as the window you’re covering, and color it using stencils and glass paint. You can purchase all the items at a craft store or hobby-supply shop. Layer gallery glass over your windows to create an opaque surface. If you want to make the surface of your windows translucent but don’t want to completely block visibility and natural light, try gallery glass. Gallery glass is a liquid that you can apply directly to your windows that dries opaque but still lets in some natural light. Follow the directions to apply the gallery glass to your window, and add texture by running a toothpick through the material before it dries. Purchase gallery glass at a local art-supply store or hobby shop. Apply window insulation film to the windows to keep in warm air. Window insulation film adds an insulating layer over your windows and will trap warm air in your home during chilly winter months. To apply it, stick the adhesive side of the insulation film directly onto the surface of the window. Then, blow hot air onto the film using a hair dryer. After 3-5 minutes, the film will shrink and fully adhere to the window. Purchase window insulation film at a local hardware store or any major home-improvement store. The package should clearly state how much glass the insulation film will cover. Covering Windows with Shutters Mount panel shutters over your windows to block visibility at night. Shutters are a common alternative to curtains and blinds. The horizontal slats allow partial visibility, and you can open or close the shutters depending on the time of day and intensity of the natural outdoor light. Purchase shutters at your local home-improvement store. They come in a variety of colors, sizes, and materials, so choose an option that suits the size of your windows. The shutters will come with directions for how to install them. If you’d rather not install the shutters yourself, the home-improvement store can send professionals to install them for you. Install interior barn door shutters for a rustic look. Indoor barn door shutters are both practical and aesthetic. They give your home a rustic, rural appeal and, like traditional shutters, can be adjusted to let in more or less light throughout the day. Most styles of barn door shutters slide back and forth on track mounts. Purchase barn door shutters at a home-improvement store near you. Many large online retailers and general home-supply stores also sell barn door shutters, although these may be a lower quality. Set up plantation shutters for full control over visibility. Unlike panel shutters, plantation shutters can be minutely adjusted from inside of the house by raising or lowering a bar that controls the shutter slats. This allows you to make slight adjustments to the amount of natural light that enters your home as the position of the sun changes. Plantation shutters also fully reduce visibility in at night. Buy plantation shutters at any major home-improvement store. As with other shutter types, you can either install them yourself or ask the store to send a technician to install the shutters for you. Covering the Window with Objects Mount a shelf in front of a window for partial coverage. A shelf is a great way to partially cover a window without blocking out natural light. Measure the width of your window, and buy a shelf that’s about 4 inches (10 cm) wider at a local home-improvement store. Mount the shelf as directed in the instructions that come with the shelf. Then, decorate the shelf as you like: for example, add a few houseplants, a couple of books, and a decorative vase. As an added bonus, you’ll increase the amount of storage space in your home. Hang a DIY valence made of draped fabric in front of the window. Drive 2 nails (or push pins) into the wall, 1 on each side of the top of your window. Tie a piece of twine or string between the nails. Then, hang 15–20 pieces of fabric over it. Each strip should be between 20–25 inches (51–64 cm) long. Use bandanas, scarves, or a leftover fabric garland. The valence will fully cover the top portion of your window but still allow some visibility and natural light. For a more refined-looking valence, hang a curtain rod over your window, and drape pieces of fabric over the rod. Place 3–5 tall potted plants in front of a window. While plants aren’t technically a window covering, they’re effective at partially blocking visibility while allowing in natural light. Try setting a few houseplants on the windowsill of a kitchen window. Or, if you want to cover a tall, narrow window (e.g., in a hall or entranceway), set a single tall houseplant directly in front of it. Purchase house plants at a plant nursery or gardening center.",
  "tyn_model":[
    "blinds",
    "shutters",
    "gallery glass",
    "shades",
    "barn door shutters",
    "window insulation film",
    "plantation shutters",
    "shelf",
    "fabric",
    "curtains",
    "insulation film",
    "plants",
    "relocation specialist",
    "managing moves & more",
    "honeycomb shades",
    "stained glass",
    "glass paint",
    "hair dryer",
    "books",
    "decorative vase",
    "nails",
    "push pins",
    "twine",
    "bandanas",
    "scarves",
    "curtain rod",
    "potted plants",
    "houseplants",
    "plant nursery",
    "gardening center"
  ],
  "tyn_section":[

  ]
}