{
  "title":"How to Crochet Borders",
  "url":"https://www.wikihow.com/Crochet-Borders",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Knitting and Crochet",
    "Crochet"
  ],
  "methods":[
    {
      "name":"Adding a Single Crochet Border",
      "steps":[
        {
          "headline":"Make a chain of 1 to begin the border.",
          "description":"Anchor the yarn to the border if needed by tying the yarn through a stitch on the edge of the item. Then, insert the hook into the same stitch, loop the yarn over the hook, and pull it through the stitch to create a new loop on the hook. Repeat this 1 more time to begin the row. Note that you will not have to chain 1 again unless you single crochet another row around the outside of the first row. How to Choose Yarn for the Border\nStick with the same color and type of yarn if you want it to blend in with the item, such as a white border on a white item. Opt for a contrasting color yarn if you want the border to stand out, such as a hot pink border with a lime green item. Try a textured yarn, such as a soft, fluffy yarn, if you want the border to feel different than the rest of the item."
        },
        {
          "headline":"Insert the hook through the stitch and yarn over.",
          "description":"Push the end of the hook into the first stitch. This is the stitch next to the yarn where you anchored the chain of 1. Loop the yarn over the end of the hook 1 time after you push it through the stitch. Do not wrap the yarn all the way around the hook, just bring it up and over the top of the hook. Use your thumb and forefinger to keep this yarn taut."
        },
        {
          "headline":"Pull through the first loop and yarn over again.",
          "description":"Pull the hook back through the stitch with the new loop of yarn over it. Then, loop the yarn over the end of the hook again. Make sure to keep the yarn taut to hold the new loop in place."
        },
        {
          "headline":"Pull the yarn through both loops.",
          "description":"Bring this new loop through the 2 loops that are on the hook. This will complete the stitch and leave you with 1 loop on the hook. This completes the first stitch."
        },
        {
          "headline":"Repeat all the way around the border.",
          "description":"Continue to single crochet into each of the stitches along the border of your item. Continue doing this until you get back to the beginning of the border or until you have added the desired amount of border. For example, add a single crochet border all the way around the edge of a blanket, or only along 2 sides of the blanket."
        },
        {
          "headline":"Slipstitch and tie off to complete the border.",
          "description":"When you get back to the beginning, insert the hook through the top of the first crochet stitch you made. Then, yarn over and pull through to complete the border. Tie off the last stitch by making a knot through it with the tail of the yarn. Cut the yarn 0.5 in (1.3 cm) from the knot or weave the end into the back of your project using a yarn needle."
        }
      ]
    },
    {
      "name":"Working the Crab Stitch Border",
      "steps":[
        {
          "headline":"Do not turn your work after you finish your last row.",
          "description":"The crab stitch is also known as the reverse single crochet stitch. This stitch works best as a border for an item that you have just finished since you need to crochet back across the last row you worked. If you are right handed, you will need to work the stitch with your left hand. If you are left handed, you will need to work the stitch with your right hand."
        },
        {
          "headline":"Insert the hook into the first stitch in the row.",
          "description":"Push the end of the hook into the last stitch you worked in the previous row. Make sure to insert the hook under both bars of the stitch, and not through the top of the stitch. Remember that this stitch uses the same sequence as the single crochet stitch, but you work it in reverse."
        },
        {
          "headline":"Wrap the yarn over the hook and pull through 1.",
          "description":"Loop the yarn over your hook once, and then pull this loop through the stitch 1 time. Remember that you will be doing this using your non-dominant hand and working backwards across the row. The crab stitch may feel a bit awkward at first, but it should become easier as you keep going."
        },
        {
          "headline":"Loop the yarn over the hook and pull through 2.",
          "description":"Loop the yarn over the hook again. Then, use the hook to pull this new loop through both stitches on your hook. This completes the stitch."
        },
        {
          "headline":"Repeat this stitch sequence all the way around your border.",
          "description":"Keep working reverse single crochet stitches into the border of your item. Do this until you are back at the beginning or until you have finished the edge you wanted to add a border onto. For example, if you are adding a single crochet border to a sweater sleeve, go all the way around the edge. If you are adding a border onto a scarf or shawl, work the border into 1 or more edges of the item. How to Choose a Border Stitch\nTry a simple option, such as the slipstitch or single crochet stitch, to add a simple border to an item. This is also ideal if you want to keep the edges from curling up. Use a wide stitch, such as double crochet or triple crochet, if you want to add a wide border. Go with a fancy stitch, such as the shell stitch or petal cone edging, if you want to make a simple crocheted item look more intricate."
        },
        {
          "headline":"Slipstitch to finish the border.",
          "description":"To make a continuous border around the item, crochet the border until you are back at the beginning. Then, insert the hook into the top of the first stitch in the border. Yarn over and pull through both stitches on the hook to complete the border. Cut the yarn 6 in (15 cm) from the last stitch, and make a knot through the last stitch with the tail of the yarn. Cut the yarn 0.5 in (1.3 cm) from the knot or thread the yarn through a yarn needle and weave in the end."
        }
      ]
    },
    {
      "name":"Crocheting a Picot Stitch Border",
      "steps":[
        {
          "headline":"Chain 3 extending from the border of the item.",
          "description":"Yarn over the hook and pull through to make the first chain. Repeat 2 more times. Start a new row after you finish crocheting your item, or anchor the yarn to the edge of the item before you do this. To attach a new strand of yarn to the item, tie the yarn through a stitch on the edge of the item. This is the starting point for your border."
        },
        {
          "headline":"Insert the hook into the first chain and single crochet.",
          "description":"Loop the yarn over the hook, and pull through the first loop. Yarn over again and pull through both loops on the hook. This will secure the chain of 3 you made into a loop."
        },
        {
          "headline":"Skip a stitch, then single crochet.",
          "description":"Do not work into the next stitch on the border. Skip over this one, and then single crochet again. Skipping a stitch helps to make the border look more decorative."
        },
        {
          "headline":"Repeat this sequence to the end of the row.",
          "description":"Continue to chain 3, single crochet into the first chain, skip 1, and single crochet again. Do this all the way to the end of the row or until you get back to the beginning of the border. The picots will look like little loops divided by single crochet stitches."
        },
        {
          "headline":"Finish the border with a slipstitch and tie off the end.",
          "description":"To finish the border, slipstitch into the base of the first picot. Insert the hook into the base of the stitch, yarn over, and pull through both. Then, tie off the yarn by making a knot through the stitch. Cut the excess yarn about 0.5 in (1.3 cm) from the last stitch or thread the tail through a yarn needle and weave it into the back side of your item."
        }
      ]
    }
  ],
  "text":" Adding a Single Crochet Border Make a chain of 1 to begin the border. Anchor the yarn to the border if needed by tying the yarn through a stitch on the edge of the item. Then, insert the hook into the same stitch, loop the yarn over the hook, and pull it through the stitch to create a new loop on the hook. Repeat this 1 more time to begin the row. Note that you will not have to chain 1 again unless you single crochet another row around the outside of the first row. How to Choose Yarn for the Border\nStick with the same color and type of yarn if you want it to blend in with the item, such as a white border on a white item. Opt for a contrasting color yarn if you want the border to stand out, such as a hot pink border with a lime green item. Try a textured yarn, such as a soft, fluffy yarn, if you want the border to feel different than the rest of the item. Insert the hook through the stitch and yarn over. Push the end of the hook into the first stitch. This is the stitch next to the yarn where you anchored the chain of 1. Loop the yarn over the end of the hook 1 time after you push it through the stitch. Do not wrap the yarn all the way around the hook, just bring it up and over the top of the hook. Use your thumb and forefinger to keep this yarn taut. Pull through the first loop and yarn over again. Pull the hook back through the stitch with the new loop of yarn over it. Then, loop the yarn over the end of the hook again. Make sure to keep the yarn taut to hold the new loop in place. Pull the yarn through both loops. Bring this new loop through the 2 loops that are on the hook. This will complete the stitch and leave you with 1 loop on the hook. This completes the first stitch. Repeat all the way around the border. Continue to single crochet into each of the stitches along the border of your item. Continue doing this until you get back to the beginning of the border or until you have added the desired amount of border. For example, add a single crochet border all the way around the edge of a blanket, or only along 2 sides of the blanket. Slipstitch and tie off to complete the border. When you get back to the beginning, insert the hook through the top of the first crochet stitch you made. Then, yarn over and pull through to complete the border. Tie off the last stitch by making a knot through it with the tail of the yarn. Cut the yarn 0.5 in (1.3 cm) from the knot or weave the end into the back of your project using a yarn needle. Working the Crab Stitch Border Do not turn your work after you finish your last row. The crab stitch is also known as the reverse single crochet stitch. This stitch works best as a border for an item that you have just finished since you need to crochet back across the last row you worked. If you are right handed, you will need to work the stitch with your left hand. If you are left handed, you will need to work the stitch with your right hand. Insert the hook into the first stitch in the row. Push the end of the hook into the last stitch you worked in the previous row. Make sure to insert the hook under both bars of the stitch, and not through the top of the stitch. Remember that this stitch uses the same sequence as the single crochet stitch, but you work it in reverse. Wrap the yarn over the hook and pull through 1. Loop the yarn over your hook once, and then pull this loop through the stitch 1 time. Remember that you will be doing this using your non-dominant hand and working backwards across the row. The crab stitch may feel a bit awkward at first, but it should become easier as you keep going. Loop the yarn over the hook and pull through 2. Loop the yarn over the hook again. Then, use the hook to pull this new loop through both stitches on your hook. This completes the stitch. Repeat this stitch sequence all the way around your border. Keep working reverse single crochet stitches into the border of your item. Do this until you are back at the beginning or until you have finished the edge you wanted to add a border onto. For example, if you are adding a single crochet border to a sweater sleeve, go all the way around the edge. If you are adding a border onto a scarf or shawl, work the border into 1 or more edges of the item. How to Choose a Border Stitch\nTry a simple option, such as the slipstitch or single crochet stitch, to add a simple border to an item. This is also ideal if you want to keep the edges from curling up. Use a wide stitch, such as double crochet or triple crochet, if you want to add a wide border. Go with a fancy stitch, such as the shell stitch or petal cone edging, if you want to make a simple crocheted item look more intricate. Slipstitch to finish the border. To make a continuous border around the item, crochet the border until you are back at the beginning. Then, insert the hook into the top of the first stitch in the border. Yarn over and pull through both stitches on the hook to complete the border. Cut the yarn 6 in (15 cm) from the last stitch, and make a knot through the last stitch with the tail of the yarn. Cut the yarn 0.5 in (1.3 cm) from the knot or thread the yarn through a yarn needle and weave in the end. Crocheting a Picot Stitch Border Chain 3 extending from the border of the item. Yarn over the hook and pull through to make the first chain. Repeat 2 more times. Start a new row after you finish crocheting your item, or anchor the yarn to the edge of the item before you do this. To attach a new strand of yarn to the item, tie the yarn through a stitch on the edge of the item. This is the starting point for your border. Insert the hook into the first chain and single crochet. Loop the yarn over the hook, and pull through the first loop. Yarn over again and pull through both loops on the hook. This will secure the chain of 3 you made into a loop. Skip a stitch, then single crochet. Do not work into the next stitch on the border. Skip over this one, and then single crochet again. Skipping a stitch helps to make the border look more decorative. Repeat this sequence to the end of the row. Continue to chain 3, single crochet into the first chain, skip 1, and single crochet again. Do this all the way to the end of the row or until you get back to the beginning of the border. The picots will look like little loops divided by single crochet stitches. Finish the border with a slipstitch and tie off the end. To finish the border, slipstitch into the base of the first picot. Insert the hook into the base of the stitch, yarn over, and pull through both. Then, tie off the yarn by making a knot through the stitch. Cut the excess yarn about 0.5 in (1.3 cm) from the last stitch or thread the tail through a yarn needle and weave it into the back side of your item.",
  "tyn_model":[
    "yarn",
    "yarn needle",
    "blanket",
    "scarf",
    "picot stitch border"
  ],
  "tyn_section":[

  ]
}