{
  "title":"How to Drink Vermouth",
  "url":"https://www.wikihow.com/Drink-Vermouth",
  "category_hierarchy":[
    "Food and Entertaining",
    "Appreciation of Food",
    "Eating Techniques"
  ],
  "parts":[
    {
      "name":"Choosing a Vermouth",
      "steps":[
        {
          "headline":"Try a white vermouth for a balance of sweet and bitter.",
          "description":"White vermouth has a hint of sweet alongside a slight bitterness. Dry vermouth – a type of white vermouth – has a fresher flavor and noticeably less residual sugar than other white vermouths."
        },
        {
          "headline":"Try an Italian-style red vermouth for a sweeter and spicier taste.",
          "description":"As all modern vermouths originate from white wine, red vermouth gets its distinct color and flavor from various aromatics. The traditional red vermouth has a sugar content of at least 14% (in contrast to dry vermouth’s less than 5%), yet also has an edge of bitterness and spice that adds to the sweet."
        },
        {
          "headline":"Ask a bartender or alcohol connoisseur for vermouth recommendations.",
          "description":"A bottle of vermouth usually ranges between $15-$30 USD, with higher-quality vermouths costing a bit more. If you're on a budget, you can always ask for affordable options that are good for drinking plain."
        }
      ]
    },
    {
      "name":"Drinking Vermouth Plain",
      "steps":[
        {
          "headline":"Drink vermouth on the rocks.",
          "description":"With such rich flavors, both red and white vermouths are delicious on their own. Put one large chunk or several small cubes of ice in a small glass or tumbler and add 3 fluid ounces (89 mL) of chilled or room-temperature vermouth. For dark red vermouths, garnish with an orange peel. For lighter vermouths, use a lemon slice or a skewered olive."
        },
        {
          "headline":"Add equal parts carbonated water for a vermouth spritzer.",
          "description":"Some bars in Spain will provide a bottle of soda water when you order vermouth. Simply add equal parts vermouth and carbonated water for a refreshing twist."
        },
        {
          "headline":"Store the bottle of vermouth in a refrigerator.",
          "description":"Vermouth is a type of wine, so it will turn to vinegar if left at room temperature. If properly chilled, a good bottle of vermouth can last 4 to 6 weeks after it’s opened."
        }
      ]
    },
    {
      "name":"Drinking Vermouth in a Cocktail",
      "steps":[
        {
          "headline":"Try a Gibson for a savory twist on a classic martini.",
          "description":"Vermouth is commonly associated with   martinis or Manhattans. For a twist on a classic, pour 2.5 fluid ounces (74 mL) of gin and .5 fluid ounces (15 mL) of dry vermouth in a mixing glass with ice cubes. Stir well, then strain into a cocktail glass. Garnish with a cocktail onion to make a Gibson. Don’t let the terminology confuse you – a ‘dry’ cocktail is one with less (or no) dry vermouth, while a ‘wet’ cocktail is one with more dry vermouth. A ‘perfect’ is made with equal parts dry and sweet vermouth."
        },
        {
          "headline":"Add Scotch whiskey to make a Rob Roy.",
          "description":"Mix 1  fl oz (30 mL) of sweet vermouth with 2 fluid ounces (59 mL) of Scotch whiskey and 2 dashes of bitters in a shaker filled with ice. Stir, then strain into a martini glass and top with a lemon peel. For a sweeter garnish, use two skewered brandied cherries balanced on the cocktail glass."
        },
        {
          "headline":"Make an Italian-style negroni with sweet vermouth.",
          "description":"In a cocktail shaker, combine equal parts sweet vermouth, Campari and gin. Pour over ice in a lowball glass and serve with an orange peel. A variation of the negroni called negroni sbagliato uses sparkling wine or Prosecco instead of gin for a bubbly fizz. Serve it in a champagne flute for extra class."
        },
        {
          "headline":"Use pineapple juice for a fruity Algonquin.",
          "description":"Stir together 1.5 fluid ounces (44 mL)  of whiskey, .75 fluid ounces (22 mL) of dry vermouth, and .75 fluid ounces (22 mL) of pineapple juice with ice. Strain into a cocktail glass. Add a couple dashes of bitters to bring out the flavor even more."
        },
        {
          "headline":"Use both red and white vermouth to make a Bronx.",
          "description":"The addition of sweet vermouth and orange juice make a Bronx less dry than a classic martini. Mix 2 fluid ounces (59 mL) of gin, .25  fl oz (7.4 mL) of dry vermouth, .25  fl oz (7.4 mL) of sweet vermouth, and 1  fl oz (30 mL) of orange juice to a shaker filled with ice. Shake, then strain into a cocktail glass and garnish with an orange slice. The Bronx is considered a more refreshing day drink than an evening cocktail, so enjoy it outside on a warm afternoon."
        }
      ]
    }
  ],
  "text":" Choosing a Vermouth Try a white vermouth for a balance of sweet and bitter. White vermouth has a hint of sweet alongside a slight bitterness. Dry vermouth – a type of white vermouth – has a fresher flavor and noticeably less residual sugar than other white vermouths. Try an Italian-style red vermouth for a sweeter and spicier taste. As all modern vermouths originate from white wine, red vermouth gets its distinct color and flavor from various aromatics. The traditional red vermouth has a sugar content of at least 14% (in contrast to dry vermouth’s less than 5%), yet also has an edge of bitterness and spice that adds to the sweet. Ask a bartender or alcohol connoisseur for vermouth recommendations. A bottle of vermouth usually ranges between $15-$30 USD, with higher-quality vermouths costing a bit more. If you're on a budget, you can always ask for affordable options that are good for drinking plain. Drinking Vermouth Plain Drink vermouth on the rocks. With such rich flavors, both red and white vermouths are delicious on their own. Put one large chunk or several small cubes of ice in a small glass or tumbler and add 3 fluid ounces (89 mL) of chilled or room-temperature vermouth. For dark red vermouths, garnish with an orange peel. For lighter vermouths, use a lemon slice or a skewered olive. Add equal parts carbonated water for a vermouth spritzer. Some bars in Spain will provide a bottle of soda water when you order vermouth. Simply add equal parts vermouth and carbonated water for a refreshing twist. Store the bottle of vermouth in a refrigerator. Vermouth is a type of wine, so it will turn to vinegar if left at room temperature. If properly chilled, a good bottle of vermouth can last 4 to 6 weeks after it’s opened. Drinking Vermouth in a Cocktail Try a Gibson for a savory twist on a classic martini. Vermouth is commonly associated with   martinis or Manhattans. For a twist on a classic, pour 2.5 fluid ounces (74 mL) of gin and .5 fluid ounces (15 mL) of dry vermouth in a mixing glass with ice cubes. Stir well, then strain into a cocktail glass. Garnish with a cocktail onion to make a Gibson. Don’t let the terminology confuse you – a ‘dry’ cocktail is one with less (or no) dry vermouth, while a ‘wet’ cocktail is one with more dry vermouth. A ‘perfect’ is made with equal parts dry and sweet vermouth. Add Scotch whiskey to make a Rob Roy. Mix 1  fl oz (30 mL) of sweet vermouth with 2 fluid ounces (59 mL) of Scotch whiskey and 2 dashes of bitters in a shaker filled with ice. Stir, then strain into a martini glass and top with a lemon peel. For a sweeter garnish, use two skewered brandied cherries balanced on the cocktail glass. Make an Italian-style negroni with sweet vermouth. In a cocktail shaker, combine equal parts sweet vermouth, Campari and gin. Pour over ice in a lowball glass and serve with an orange peel. A variation of the negroni called negroni sbagliato uses sparkling wine or Prosecco instead of gin for a bubbly fizz. Serve it in a champagne flute for extra class. Use pineapple juice for a fruity Algonquin. Stir together 1.5 fluid ounces (44 mL)  of whiskey, .75 fluid ounces (22 mL) of dry vermouth, and .75 fluid ounces (22 mL) of pineapple juice with ice. Strain into a cocktail glass. Add a couple dashes of bitters to bring out the flavor even more. Use both red and white vermouth to make a Bronx. The addition of sweet vermouth and orange juice make a Bronx less dry than a classic martini. Mix 2 fluid ounces (59 mL) of gin, .25  fl oz (7.4 mL) of dry vermouth, .25  fl oz (7.4 mL) of sweet vermouth, and 1  fl oz (30 mL) of orange juice to a shaker filled with ice. Shake, then strain into a cocktail glass and garnish with an orange slice. The Bronx is considered a more refreshing day drink than an evening cocktail, so enjoy it outside on a warm afternoon.",
  "tyn_model":[
    "vermouth",
    "sweet vermouth",
    "ice",
    "gin",
    "cocktail glass",
    "– a",
    "red vermouth",
    "orange peel",
    "lemon",
    "carbonated water",
    "’ cocktail",
    "scotch whiskey",
    "bitters",
    "shaker",
    "pineapple juice",
    "dry vermouth",
    "orange juice",
    "white vermouth",
    "– has",
    "sugar",
    "white vermouths",
    "vermouths",
    "tumbler",
    "vermouth spritzer",
    "soda water",
    "refrigerator",
    "wine",
    "mixing glass",
    "ice cubes",
    "cocktail onion",
    "‘dry",
    "‘wet",
    "‘perfect",
    "’ is",
    "martini glass",
    "brandied cherries",
    "cocktail shaker",
    "campari",
    "lowball glass",
    "sparkling wine",
    "prosecco instead",
    "champagne flute",
    "whiskey",
    "orange slice"
  ],
  "tyn_section":[

  ]
}