{
  "title":"How to Pack an Emergency Case for a Camping Trip",
  "url":"https://www.wikihow.com/Pack-an-Emergency-Case-for-a-Camping-Trip",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness",
    "Hazard Survival Equipment"
  ],
  "steps":[
    {
      "headline":"Pack a whole pack of bandages.",
      "description":"You will need them in case you get a cut."
    },
    {
      "headline":"Pack a pair of tweezers.",
      "description":"This is a good idea, in case someone gets an splinter. You don't want to get an infection!"
    },
    {
      "headline":"Bring a few walkie-talkies.",
      "description":"The number of walkie-talkies you need to bring depends on how many people are in your family."
    },
    {
      "headline":"Pack some flashlights and few spare batteries.",
      "description":"You will need them when you're outside in the dark."
    },
    {
      "headline":"Bring a few medicines, like cough syrup or aspirin, in case you get sick during the camping trip.",
      "description":"Use the medicine until you get to the hospital."
    },
    {
      "headline":"Bring along antiseptics in case of a cut or scrape.",
      "description":""
    },
    {
      "headline":"Bring a notebook and pen, in case you really need to write somethingdown.",
      "description":""
    },
    {
      "headline":"Include a knife.",
      "description":"It can come in handy when in an emergency situation as long as you stay safe."
    },
    {
      "headline":"Make sure to bring a snakebite kit and know how to use it.",
      "description":"This is especially important if you are camping in an area known for snakes."
    }
  ],
  "text":" Pack a whole pack of bandages. You will need them in case you get a cut. Pack a pair of tweezers. This is a good idea, in case someone gets an splinter. You don't want to get an infection! Bring a few walkie-talkies. The number of walkie-talkies you need to bring depends on how many people are in your family. Pack some flashlights and few spare batteries. You will need them when you're outside in the dark. Bring a few medicines, like cough syrup or aspirin, in case you get sick during the camping trip. Use the medicine until you get to the hospital. Bring along antiseptics in case of a cut or scrape.  Bring a notebook and pen, in case you really need to write somethingdown.  Include a knife. It can come in handy when in an emergency situation as long as you stay safe. Make sure to bring a snakebite kit and know how to use it. This is especially important if you are camping in an area known for snakes.",
  "tyn_model":[
    "walkie-talkies",
    "bandages",
    "tweezers",
    "flashlights",
    "cough syrup",
    "notebook",
    "pen",
    "knife"
  ],
  "tyn_section":[

  ]
}