{
  "title":"How to Season Black‐Eyed Peas",
  "url":"https://www.wikihow.com/Season-Black%E2%80%90Eyed-Peas",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Making Spicy Black-Eyed Peas",
      "steps":[
        {
          "headline":"Chop 4 slices of bacon and fry them until they are crispy.",
          "description":"The bacon provides a delicious crispy topping for the peas. Cut the bacon with a sharp knife on a chopping board. Place the bacon into a large saucepan with a dash of oil and fry it on a medium heat. Use a spatula to move the bacon around to stop it from sticking to the pan. Rice bran oil or olive oil are good frying options for this recipe. Place the bacon into a small bowl once it is cooked. Any sized bacon pieces will work fine for this recipe. Try cutting the slices into thin strips or into 0.5 in (1.3 cm) squares. It will take about 5 minutes to fry the bacon."
        },
        {
          "headline":"Saute the onion until it is light in colour and tender.",
          "description":"Place the chopped onion into the large saucepan that you cooked the bacon in. The bacon drippings will give the onion a delicious meaty flavour. Stir the onion occasionally with a spatula to stop if from sticking to the pan. Cut the onion into 0.5 in (1.3 cm) cubes. If you don’t like onion, skip this step."
        },
        {
          "headline":"Mix the rest of the ingredients into the saucepan.",
          "description":"If you like chilli, you’ll enjoy this seasoning! Measure 1 teaspoon (2.8 grams) of salt, ½ teaspoon (1.1 grams) of black pepper, 1 teaspoon (2.7 grams) of chilli powder, 3 cups (750 mL) of water, a 12 oz (340 grams) can of diced tomatoes and green chiles, and a 16 oz (45 grams) can of dried black-eyed peas into the saucepan. Stir the ingredients with a wooden spoon until they are thoroughly combined. If you like your black-eyed peas extra spicy, add a dash more chilli powder."
        },
        {
          "headline":"Leave the black-eyed peas to cook for 1 hour.",
          "description":"Leave the pot over a medium heat to lightly simmer for 1 hour. If the dish starts to vigorously boil, turn the heat down. If you notice that the sauce in the dish has dried up, add ½ cup (125 mL) of water. Leave the dish uncovered as it cooks."
        },
        {
          "headline":"Sprinkle bacon over the dish and enjoy the meal while it is hot.",
          "description":"Spoon the spicy black-eyed peas into bowls and sprinkle the bacon you prepared earlier over each bowl of food. Enjoy the dish by itself or serve it with your favourite salad. If you find the dish is too spicy for your liking, drink a glass of milk with your meal to help your palate adjust to the spice. Keep any leftovers in an airtight container for up to 5 days in the fridge or up to 6 months in the freezer."
        }
      ]
    },
    {
      "name":"Cooking Southern Black-Eyed Peas",
      "steps":[
        {
          "headline":"Fry the onion, celery, and garlic until they are tender.",
          "description":"These vegetables will help to flavour the soup and add a nice texture. Place a large soup pot onto a medium heat and add 1 tablespoon (15 mL) of oil. Add 1 large chopped onion, 1 stalk of diced celery, and 4 minced garlic cloves. Stir the vegetables with a spatula or wooden spoon while they cook to avoid them sticking to the pan. Cook the vegetables for 5 minutes or until they are tender. If you don’t like one of the vegetables, just leave it out. Chop the vegetables into 0.5 in (1.3 cm) cubes."
        },
        {
          "headline":"Stir the broth, salt, pepper, and peas into the vegetables.",
          "description":"Measure 6 cups (1.5 L) of chicken broth, 1⁄2 teaspoon (2.1 grams) of salt, 1⁄4 teaspoon (0.5 grams) of ground black pepper, and 4 cups (680 grams) of fresh or frozen black-eyed peas into the pot of vegetables. Mix the ingredients with a wooden spoon until they are thoroughly combined. Leave the pot on the stove while you add the ingredients. The chicken broth provides the liquid for the dish and adds a delicious meaty flavour. If you prefer beef or vegetable broth, use that instead."
        },
        {
          "headline":"Turn the temperature up to high and wait for the dish to boil.",
          "description":"Place a lid on the pot to help the broth to boil faster. Don’t worry about stirring the dish as the liquid in the pot will prevent the ingredients from sticking."
        },
        {
          "headline":"Cook the black-eyed peas on a low heat for a further 45 minutes.",
          "description":"Decrease the heat to low so that the dish is lightly simmering. Leave the lid on the dish to keep the peas nice and moist. After 45 minutes, use a teaspoon to taste the dish. If the peas still feel a little crunchy, cook them for a further 15 minutes. If the dish tastes a little bland, add an extra pinch of salt and pepper. It is safe to eat the beans when they are still crunchy; however, some people prefer them softer."
        },
        {
          "headline":"Enjoy the dish by itself or serve it with your favourite side.",
          "description":"This dish is substantial enough to eat by itself; however, if you want to bulk it out, serve it with bread and butter or your favourite side salad. For another Southern classic, try serving these black-eyed peas with cornmeal dumplings. This meal is best enjoyed hot. Store leftovers in an airtight container for up to 5 days in the fridge or up to 6 months in the freezer."
        }
      ]
    }
  ],
  "text":" Making Spicy Black-Eyed Peas Chop 4 slices of bacon and fry them until they are crispy. The bacon provides a delicious crispy topping for the peas. Cut the bacon with a sharp knife on a chopping board. Place the bacon into a large saucepan with a dash of oil and fry it on a medium heat. Use a spatula to move the bacon around to stop it from sticking to the pan. Rice bran oil or olive oil are good frying options for this recipe. Place the bacon into a small bowl once it is cooked. Any sized bacon pieces will work fine for this recipe. Try cutting the slices into thin strips or into 0.5 in (1.3 cm) squares. It will take about 5 minutes to fry the bacon. Saute the onion until it is light in colour and tender. Place the chopped onion into the large saucepan that you cooked the bacon in. The bacon drippings will give the onion a delicious meaty flavour. Stir the onion occasionally with a spatula to stop if from sticking to the pan. Cut the onion into 0.5 in (1.3 cm) cubes. If you don’t like onion, skip this step. Mix the rest of the ingredients into the saucepan. If you like chilli, you’ll enjoy this seasoning! Measure 1 teaspoon (2.8 grams) of salt, ½ teaspoon (1.1 grams) of black pepper, 1 teaspoon (2.7 grams) of chilli powder, 3 cups (750 mL) of water, a 12 oz (340 grams) can of diced tomatoes and green chiles, and a 16 oz (45 grams) can of dried black-eyed peas into the saucepan. Stir the ingredients with a wooden spoon until they are thoroughly combined. If you like your black-eyed peas extra spicy, add a dash more chilli powder. Leave the black-eyed peas to cook for 1 hour. Leave the pot over a medium heat to lightly simmer for 1 hour. If the dish starts to vigorously boil, turn the heat down. If you notice that the sauce in the dish has dried up, add ½ cup (125 mL) of water. Leave the dish uncovered as it cooks. Sprinkle bacon over the dish and enjoy the meal while it is hot. Spoon the spicy black-eyed peas into bowls and sprinkle the bacon you prepared earlier over each bowl of food. Enjoy the dish by itself or serve it with your favourite salad. If you find the dish is too spicy for your liking, drink a glass of milk with your meal to help your palate adjust to the spice. Keep any leftovers in an airtight container for up to 5 days in the fridge or up to 6 months in the freezer. Cooking Southern Black-Eyed Peas Fry the onion, celery, and garlic until they are tender. These vegetables will help to flavour the soup and add a nice texture. Place a large soup pot onto a medium heat and add 1 tablespoon (15 mL) of oil. Add 1 large chopped onion, 1 stalk of diced celery, and 4 minced garlic cloves. Stir the vegetables with a spatula or wooden spoon while they cook to avoid them sticking to the pan. Cook the vegetables for 5 minutes or until they are tender. If you don’t like one of the vegetables, just leave it out. Chop the vegetables into 0.5 in (1.3 cm) cubes. Stir the broth, salt, pepper, and peas into the vegetables. Measure 6 cups (1.5 L) of chicken broth, 1⁄2 teaspoon (2.1 grams) of salt, 1⁄4 teaspoon (0.5 grams) of ground black pepper, and 4 cups (680 grams) of fresh or frozen black-eyed peas into the pot of vegetables. Mix the ingredients with a wooden spoon until they are thoroughly combined. Leave the pot on the stove while you add the ingredients. The chicken broth provides the liquid for the dish and adds a delicious meaty flavour. If you prefer beef or vegetable broth, use that instead. Turn the temperature up to high and wait for the dish to boil. Place a lid on the pot to help the broth to boil faster. Don’t worry about stirring the dish as the liquid in the pot will prevent the ingredients from sticking. Cook the black-eyed peas on a low heat for a further 45 minutes. Decrease the heat to low so that the dish is lightly simmering. Leave the lid on the dish to keep the peas nice and moist. After 45 minutes, use a teaspoon to taste the dish. If the peas still feel a little crunchy, cook them for a further 15 minutes. If the dish tastes a little bland, add an extra pinch of salt and pepper. It is safe to eat the beans when they are still crunchy; however, some people prefer them softer. Enjoy the dish by itself or serve it with your favourite side. This dish is substantial enough to eat by itself; however, if you want to bulk it out, serve it with bread and butter or your favourite side salad. For another Southern classic, try serving these black-eyed peas with cornmeal dumplings. This meal is best enjoyed hot. Store leftovers in an airtight container for up to 5 days in the fridge or up to 6 months in the freezer.",
  "tyn_model":[
    "bacon",
    "onion",
    "black-eyed peas",
    "peas",
    "pot",
    "spatula",
    "salt",
    "wooden spoon",
    "large saucepan",
    "oil",
    "saucepan",
    "chilli powder",
    "water",
    "airtight container",
    "celery",
    "garlic",
    "broth",
    "vegetables",
    "chicken broth",
    "sharp knife",
    "rice bran oil",
    "olive oil",
    "chilli",
    "black pepper",
    "diced tomatoes",
    "green chiles",
    "milk",
    "soup pot",
    "pepper",
    "ground black pepper",
    "stove",
    "vegetable broth",
    "dish",
    "salt and pepper",
    "beans",
    "bread and butter",
    "cornmeal dumplings"
  ],
  "tyn_section":[

  ]
}