{
  "title":"How to Cut a Prickly Pear",
  "url":"https://www.wikihow.com/Cut-a-Prickly-Pear",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Peeling a Prickly Pear",
      "steps":[
        {
          "headline":"Wear gloves when you handle a prickly pear.",
          "description":"Avoid getting poked by those sharp glochids. These tiny thorns can be practically invisible and will easily stick in your skin for the rest of the day. Choose thick, leather gloves if you have them. The thicker the glove, the better for your skin’s protection."
        },
        {
          "headline":"Pick the pear up with a fork and hold it under running water.",
          "description":"Use the fork to keep the prickly pear in the stream of water and rotate it. The water’s force will knock off most of the glochids. Don’t prick the pear with the fork multiple times. You’ll break up too much of the fruit inside and make it harder to peel after. Empty your sink before washing off the prickly pear so that the needles don’t fall on any dishes."
        },
        {
          "headline":"Put the pear down and cut off about ⁄2 inch (1.3 cm) from each end.",
          "description":"Place the fruit on a plate or cutting board. Hold it steady with either the fork or your gloved hand. Use a paring knife to slice off the ends. There’s an indentation in the bottom of prickly pears. Be sure to cut all of it off when you slice that end. Whenever you cut any food with a knife, make sure to curl your fingers inward on the hand that’s holding the food steady. This way, if the knife slips while you’re slicing, you’ll graze your knuckles instead of chopping into the tips of your fingers."
        },
        {
          "headline":"Make a vertical slit in the pear skin no more than ⁄4 inch (0.64 cm) deep.",
          "description":"Use your paring knife to slice into the pear’s skin lengthwise. Slit the whole length of the fruit. Avoid cutting into the inner fruit."
        },
        {
          "headline":"Peel the skin away from the fruit.",
          "description":"Insert the tip of the paring knife into the vertical slit. Lift the skin off the inner fruit. Then use your gloved hands to gently pull the skin off the fruit. It usually comes away in one piece. Some inner flesh may get stuck to the skin and come off while you peel. If you don’t want to peel the fruit with your hands, use the paring knife to separate the skin from the inner flesh. Do one side and then the other, using your gloved hand or a fork to steady the fruit while you peel."
        }
      ]
    },
    {
      "name":"Burning Away the Glochids",
      "steps":[
        {
          "headline":"Sear your pear over charcoal.",
          "description":"Set the chimney of a charcoal grill on the grill grate. Ignite it, and then hold the pear with tongs over the open flame for a minute or two. Rotate the tongs occasionally to get all sides of the pear."
        },
        {
          "headline":"Use a kitchen blowtorch if you have one to burn away the thorns.",
          "description":"Put the pears on a metal baking sheet. Light the torch. Once the flame has turned blue, sear the spines off by passing the torch flame over the skin of the fruit. The spines will burn off long before the skin of the fruit starts to singe."
        },
        {
          "headline":"Hold your pear over an open flame if you don’t have a torch or charcoal.",
          "description":"Light a fire in your fireplace, if you have one, or simply light a candle. Use metal tongs to pass the pear through the open flame."
        },
        {
          "headline":"Peel the pear.",
          "description":"With the spines removed, use a paring knife to cut about ⁄2 inch (1.3 cm) off each end of the fruit. Then make a vertical incision with the knife the whole length of the pear, about ⁄4 inch (0.64 cm) deep or less. Starting at the incision, use the knife or your hands to gently peel the skin away from the inner fruit. Eat the pear whole or try juicing it. Experiment with using prickly pear juice in different ways. You can drink it plain or mix it into refreshing beverages, like lemonade, ginger ale, or other juices. You can also use prickly pear juice to make salad dressings, marmalades, jellies, and conserves."
        }
      ]
    },
    {
      "name":"Juicing the Pear Without Cutting or Peeling",
      "steps":[
        {
          "headline":"Wash the fruit in cool water.",
          "description":"Fill your sink with water and put the fruit in. Swish the pear around in the water using a large spoon. Make sure that the sink is empty of all dishes first so that glochids don't wash off onto them. Rinse out the sink after washing the pears in it."
        },
        {
          "headline":"Put the pear into a blender or food processor.",
          "description":"Place the entire, unpeeled pear in. Blend the fruit on a 'mix' or 'puree' setting until it forms a thick liquid. Blending time will depend on how many pears you put in at once, but it shouldn't take longer than a minute."
        },
        {
          "headline":"Strain the blended pear.",
          "description":"Pour the contents of the blender through a fine mesh strainer, or a colander lined with cloth into a waiting bowl. Press a spoon against the seeds and skin trapped in the strainer to get all the juice out. Let the strained juice settle. A clean, old T-shirt or pillow case lining your colander often works better than cheesecloth for straining prickly pear."
        },
        {
          "headline":"Pour the juice from the bowl into a glass or other receptacle.",
          "description":"Pour the juice slowly and gently to leave most of the settled sediment behind in the bottom of the bowl. Drink the juice right away or put it in the fridge or the freezer for later. To freeze the prickly pear juice, pour it into ice cube trays. Place these in airtight freezer bags and put in the freezer. Prickly pear juice can be refrigerated for up to a month or frozen for up to a year. Depending on their size, 6 to 12 prickly pears will yield about 1 cup (240 mL) of juice."
        }
      ]
    }
  ],
  "text":" Peeling a Prickly Pear Wear gloves when you handle a prickly pear. Avoid getting poked by those sharp glochids. These tiny thorns can be practically invisible and will easily stick in your skin for the rest of the day. Choose thick, leather gloves if you have them. The thicker the glove, the better for your skin’s protection. Pick the pear up with a fork and hold it under running water. Use the fork to keep the prickly pear in the stream of water and rotate it. The water’s force will knock off most of the glochids. Don’t prick the pear with the fork multiple times. You’ll break up too much of the fruit inside and make it harder to peel after. Empty your sink before washing off the prickly pear so that the needles don’t fall on any dishes. Put the pear down and cut off about ⁄2 inch (1.3 cm) from each end. Place the fruit on a plate or cutting board. Hold it steady with either the fork or your gloved hand. Use a paring knife to slice off the ends. There’s an indentation in the bottom of prickly pears. Be sure to cut all of it off when you slice that end. Whenever you cut any food with a knife, make sure to curl your fingers inward on the hand that’s holding the food steady. This way, if the knife slips while you’re slicing, you’ll graze your knuckles instead of chopping into the tips of your fingers. Make a vertical slit in the pear skin no more than ⁄4 inch (0.64 cm) deep. Use your paring knife to slice into the pear’s skin lengthwise. Slit the whole length of the fruit. Avoid cutting into the inner fruit. Peel the skin away from the fruit. Insert the tip of the paring knife into the vertical slit. Lift the skin off the inner fruit. Then use your gloved hands to gently pull the skin off the fruit. It usually comes away in one piece. Some inner flesh may get stuck to the skin and come off while you peel. If you don’t want to peel the fruit with your hands, use the paring knife to separate the skin from the inner flesh. Do one side and then the other, using your gloved hand or a fork to steady the fruit while you peel. Burning Away the Glochids Sear your pear over charcoal. Set the chimney of a charcoal grill on the grill grate. Ignite it, and then hold the pear with tongs over the open flame for a minute or two. Rotate the tongs occasionally to get all sides of the pear. Use a kitchen blowtorch if you have one to burn away the thorns. Put the pears on a metal baking sheet. Light the torch. Once the flame has turned blue, sear the spines off by passing the torch flame over the skin of the fruit. The spines will burn off long before the skin of the fruit starts to singe. Hold your pear over an open flame if you don’t have a torch or charcoal. Light a fire in your fireplace, if you have one, or simply light a candle. Use metal tongs to pass the pear through the open flame. Peel the pear. With the spines removed, use a paring knife to cut about ⁄2 inch (1.3 cm) off each end of the fruit. Then make a vertical incision with the knife the whole length of the pear, about ⁄4 inch (0.64 cm) deep or less. Starting at the incision, use the knife or your hands to gently peel the skin away from the inner fruit. Eat the pear whole or try juicing it. Experiment with using prickly pear juice in different ways. You can drink it plain or mix it into refreshing beverages, like lemonade, ginger ale, or other juices. You can also use prickly pear juice to make salad dressings, marmalades, jellies, and conserves. Juicing the Pear Without Cutting or Peeling Wash the fruit in cool water. Fill your sink with water and put the fruit in. Swish the pear around in the water using a large spoon. Make sure that the sink is empty of all dishes first so that glochids don't wash off onto them. Rinse out the sink after washing the pears in it. Put the pear into a blender or food processor. Place the entire, unpeeled pear in. Blend the fruit on a 'mix' or 'puree' setting until it forms a thick liquid. Blending time will depend on how many pears you put in at once, but it shouldn't take longer than a minute. Strain the blended pear. Pour the contents of the blender through a fine mesh strainer, or a colander lined with cloth into a waiting bowl. Press a spoon against the seeds and skin trapped in the strainer to get all the juice out. Let the strained juice settle. A clean, old T-shirt or pillow case lining your colander often works better than cheesecloth for straining prickly pear. Pour the juice from the bowl into a glass or other receptacle. Pour the juice slowly and gently to leave most of the settled sediment behind in the bottom of the bowl. Drink the juice right away or put it in the fridge or the freezer for later. To freeze the prickly pear juice, pour it into ice cube trays. Place these in airtight freezer bags and put in the freezer. Prickly pear juice can be refrigerated for up to a month or frozen for up to a year. Depending on their size, 6 to 12 prickly pears will yield about 1 cup (240 mL) of juice.",
  "tyn_model":[
    "water",
    "fork",
    "pear",
    "paring knife",
    "knife",
    "prickly pear",
    "charcoal",
    "torch",
    "blender",
    "colander",
    "bowl",
    "gloves",
    "plate",
    "cutting board",
    "charcoal grill",
    "grill grate",
    "kitchen blowtorch",
    "baking sheet",
    "torch flame",
    "candle",
    "metal tongs",
    "ginger ale",
    "food processor",
    "fine mesh strainer",
    "spoon",
    "strainer",
    "glass",
    "ice cube trays",
    "freezer bags"
  ],
  "tyn_section":[

  ]
}