{
  "title":"How to Cook Striped Bass",
  "url":"https://www.wikihow.com/Cook-Striped-Bass",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "methods":[
    {
      "name":"Broiling Striped Bass with Ginger-Scallion Oil",
      "steps":[
        {
          "headline":"Preheat your broiler at the maximum setting.",
          "description":"Place the cooking rack as close to the broiler as possible. Most broilers don’t have a temperature setting, but instead simply a setting labeled “broiler” or “max.” If you’re not sure about your model, check the user’s manual or the company’s website."
        },
        {
          "headline":"Add the scallions, ginger, garlic and red pepper to a medium bowl.",
          "description":"Stir them quickly to combine. Use 4 scallions, 1 clove of minced garlic, a pinch of red pepper, and 2 tbsp (30 g) of fresh minced ginger. You’ll be adding hot oil to the mixture, so use a heat-resistant bowl made of ceramic, glass, metal, or other material."
        },
        {
          "headline":"Heat 0.25  c (59 mL) of vegetable oil in a small saucepan.",
          "description":"Place the saucepan over medium heat and watch for a shimmer to appear on the oil’s surface. When this happens, remove the oil from the heat. Don’t wait until the oil starts smoking—this will negatively impact its flavor."
        },
        {
          "headline":"Pour the oil and other ingredients into the bowl.",
          "description":"Carefully pour the hot oil from the saucepan into the bowl. Follow this by adding 2 US tbsp (30 mL) of lemon juice, 1  tsp (4.9 mL) of soy sauce, and 1 tsp (5 g) of salt to the mixture. Stir everything to combine. Wear oven mitts to protect your hands while pouring the oil, and pour slowly so the hot oil doesn’t splatter. Allow the oil mixture to cool slightly before proceeding."
        },
        {
          "headline":"Brush some of the oil mixture onto each bass filet.",
          "description":"Use a basting brush to coat all sides of each filet. When all the filets are coated, place them on a broiling pan skin side down. Reserve about 4  tsp (20 mL) of the oil so you can spoon it onto the finished filets before serving."
        },
        {
          "headline":"Broil the fillets for around 5 minutes.",
          "description":"Cook them until the edges just turn from translucent to opaque, or until an inserted probe thermometer reads 120 °F (49 °C). Remove them from the broiler at this point. The fish will also flake easily with a fork when cooked through."
        },
        {
          "headline":"Plate, sauce, and serve the bass.",
          "description":"Place the filets on individual serving plates, and spoon about 1  tsp (4.9 mL) of the reserved oil mixture over each filet. Add a few more thinly sliced scallions as a garnish, if desired. This dish pairs well with asparagus. Refrigerate any leftovers and use them within 3 days."
        }
      ]
    },
    {
      "name":"Sauteing Striped Bass with Lemon and Herbs",
      "steps":[
        {
          "headline":"Salt and pepper the fillets and let them rest for 20 minutes.",
          "description":"Set aside 0.25 tsp (1.25 g) of the kosher salt, then sprinkle the remaining 0.75 tsp (3.75 g) of salt and 0.25 tsp (1.25 g) of pepper on top of the 4 bass fillets. Leave the fillets at room temperature for 20 minutes. This will allow the flavors of the salt and pepper to absorb into the fish."
        },
        {
          "headline":"Char the lemon halves lightly in a large skillet.",
          "description":"Place a large nonstick skillet over medium-high heat. Lay the 2 lemon halves cut side down in the skillet. Check the lemon halves every 1-2 minutes until the cut sides are lightly charred. It will take around 5 minutes total to lightly char the lemons."
        },
        {
          "headline":"Add the olive oil and bass fillets to the skillet.",
          "description":"Leave the lemons in the skillet, and pour in 3 US tbsp (44 mL) of olive oil. Then place the 4 fillets in the skillet, skin side down. Cook the fillets for 5-7 minutes without turning or moving them at all. The goal at this point is to nearly (about 90%), but not completely, cook the fish through. It should be slightly translucent around the edges."
        },
        {
          "headline":"Shake the skillet to loosen the fish, then flip them to finish cooking.",
          "description":"Once they’ve cooked to this point, a gentle shake of the pan should be enough to release the fillets from the bottom of the pan. If they release freely, use a spatula to gently flip each filet over. Cook them for 1 additional minute. If the fish doesn’t release with a gentle shake, cook the filets for 1 minute more, then give them another shake before trying to flip them. The filets will just have turned opaque along the edges when they’re fully cooked. They’ll also be fork tender, and an inserted probe thermometer should read 120 °F (49 °C)."
        },
        {
          "headline":"Plate the fish and lemon, and wipe the skillet.",
          "description":"Remove the fillets and place each on an individual serving plate. Cut each lemon half in 2 (so there are 4 wedges total), and place a wedge on each plate. Use a wad of clean paper towels to quickly wipe the pan clean, then return it to the heat. Just give the skillet a quick wipe to get rid of any charred bits of fish or lemon. Use a good-sized wad of paper towels to protect your fingers. For added protection, grip the paper towels with tongs and wipe the skillet."
        },
        {
          "headline":"Create the sauce in the skillet.",
          "description":"Reduce the heat to medium-low, then add 2 US tbsp (30 mL) of dry white wine, 0.25 tsp (1.25 g) of salt, and 2 tbsp (30 g) of cold, unsalted butter to the skillet. Once the butter starts to melt, use a whisk to blend the mixture and create an emulsion (in this case, a slightly thickened sauce). Turn off the heat at this point."
        },
        {
          "headline":"Sauce and serve the bass.",
          "description":"Spoon some of the butter emulsion onto each plated bass filet. Then, sprinkle on some chopped fresh parsley as a garnish. Keep a lemon wedge on each plate as an additional garnish. Leftovers will keep for 3 days in the fridge."
        }
      ]
    },
    {
      "name":"Poaching Striped Bass in Soy Sauce",
      "steps":[
        {
          "headline":"Combine all ingredients but the fish in a skillet.",
          "description":"Choose a skillet that’s just large enough to fit the fish into (but don’t add it yet). Pour 0.67  c (160 mL) of water and 0.5  c (120 mL) of soy sauce into the skillet, then add 2 tsp (10 g) of sugar, most of the 15 chopped scallions, and 1 chopped chile pepper (if you’re using it). Stir everything quickly to combine it. If your chosen skillet is too small to easily fit that amount of liquid, you can reduce the soy sauce to 0.33  c (78 mL) and water to 0.5  c (120 mL). Hold back just enough of the scallion pieces to use as a garnish at the end."
        },
        {
          "headline":"Bring the mixture to a boil.",
          "description":"Turn your stovetop to medium heat and place the skillet on the burner. Wait several minutes until the mixture is bubbling rapidly. You can stir the mixture occasionally, but it’s not necessary."
        },
        {
          "headline":"Add the striped bass and reduce the heat.",
          "description":"Use tongs or a spatula to carefully place the striped bass filet flesh-side down into the boiling mixture. Then, turn down the heat on the burner until the liquid is only occasionally bubbling. Make sure you don’t splatter the boiling liquid on yourself."
        },
        {
          "headline":"Cook the bass 8-10 minutes, turning once or twice.",
          "description":"Use tongs or a spatula to carefully flip the bass filet over every 4 minutes or so. A 1 in (2.5 cm) bass filet will typically cook through in 8 minutes. You’ll know the fish is done when it’s just gone from translucent to opaque at the edges and it flakes easily with a fork. Or, use a probe thermometer to check for an internal temperature of 120 °F (49 °C)."
        },
        {
          "headline":"Serve the bass coated in the pan sauce.",
          "description":"Remove the cooked bass from the pan and cut it into up to 4 individual servings. Plate each portion over a bed of cooked white rice (if desired), then pour some of the pan sauce over top. Add a few fresh scallion pieces on top as a garnish. Or, you can serve the entire filet family-style on a platter over a larger bed of rice. Put any leftovers in the fridge right away, and use them within 3 days."
        }
      ]
    }
  ],
  "text":" Broiling Striped Bass with Ginger-Scallion Oil Preheat your broiler at the maximum setting. Place the cooking rack as close to the broiler as possible. Most broilers don’t have a temperature setting, but instead simply a setting labeled “broiler” or “max.” If you’re not sure about your model, check the user’s manual or the company’s website. Add the scallions, ginger, garlic and red pepper to a medium bowl. Stir them quickly to combine. Use 4 scallions, 1 clove of minced garlic, a pinch of red pepper, and 2 tbsp (30 g) of fresh minced ginger. You’ll be adding hot oil to the mixture, so use a heat-resistant bowl made of ceramic, glass, metal, or other material. Heat 0.25  c (59 mL) of vegetable oil in a small saucepan. Place the saucepan over medium heat and watch for a shimmer to appear on the oil’s surface. When this happens, remove the oil from the heat. Don’t wait until the oil starts smoking—this will negatively impact its flavor. Pour the oil and other ingredients into the bowl. Carefully pour the hot oil from the saucepan into the bowl. Follow this by adding 2 US tbsp (30 mL) of lemon juice, 1  tsp (4.9 mL) of soy sauce, and 1 tsp (5 g) of salt to the mixture. Stir everything to combine. Wear oven mitts to protect your hands while pouring the oil, and pour slowly so the hot oil doesn’t splatter. Allow the oil mixture to cool slightly before proceeding. Brush some of the oil mixture onto each bass filet. Use a basting brush to coat all sides of each filet. When all the filets are coated, place them on a broiling pan skin side down. Reserve about 4  tsp (20 mL) of the oil so you can spoon it onto the finished filets before serving. Broil the fillets for around 5 minutes. Cook them until the edges just turn from translucent to opaque, or until an inserted probe thermometer reads 120 °F (49 °C). Remove them from the broiler at this point. The fish will also flake easily with a fork when cooked through. Plate, sauce, and serve the bass. Place the filets on individual serving plates, and spoon about 1  tsp (4.9 mL) of the reserved oil mixture over each filet. Add a few more thinly sliced scallions as a garnish, if desired. This dish pairs well with asparagus. Refrigerate any leftovers and use them within 3 days. Sauteing Striped Bass with Lemon and Herbs Salt and pepper the fillets and let them rest for 20 minutes. Set aside 0.25 tsp (1.25 g) of the kosher salt, then sprinkle the remaining 0.75 tsp (3.75 g) of salt and 0.25 tsp (1.25 g) of pepper on top of the 4 bass fillets. Leave the fillets at room temperature for 20 minutes. This will allow the flavors of the salt and pepper to absorb into the fish. Char the lemon halves lightly in a large skillet. Place a large nonstick skillet over medium-high heat. Lay the 2 lemon halves cut side down in the skillet. Check the lemon halves every 1-2 minutes until the cut sides are lightly charred. It will take around 5 minutes total to lightly char the lemons. Add the olive oil and bass fillets to the skillet. Leave the lemons in the skillet, and pour in 3 US tbsp (44 mL) of olive oil. Then place the 4 fillets in the skillet, skin side down. Cook the fillets for 5-7 minutes without turning or moving them at all. The goal at this point is to nearly (about 90%), but not completely, cook the fish through. It should be slightly translucent around the edges. Shake the skillet to loosen the fish, then flip them to finish cooking. Once they’ve cooked to this point, a gentle shake of the pan should be enough to release the fillets from the bottom of the pan. If they release freely, use a spatula to gently flip each filet over. Cook them for 1 additional minute. If the fish doesn’t release with a gentle shake, cook the filets for 1 minute more, then give them another shake before trying to flip them. The filets will just have turned opaque along the edges when they’re fully cooked. They’ll also be fork tender, and an inserted probe thermometer should read 120 °F (49 °C). Plate the fish and lemon, and wipe the skillet. Remove the fillets and place each on an individual serving plate. Cut each lemon half in 2 (so there are 4 wedges total), and place a wedge on each plate. Use a wad of clean paper towels to quickly wipe the pan clean, then return it to the heat. Just give the skillet a quick wipe to get rid of any charred bits of fish or lemon. Use a good-sized wad of paper towels to protect your fingers. For added protection, grip the paper towels with tongs and wipe the skillet. Create the sauce in the skillet. Reduce the heat to medium-low, then add 2 US tbsp (30 mL) of dry white wine, 0.25 tsp (1.25 g) of salt, and 2 tbsp (30 g) of cold, unsalted butter to the skillet. Once the butter starts to melt, use a whisk to blend the mixture and create an emulsion (in this case, a slightly thickened sauce). Turn off the heat at this point. Sauce and serve the bass. Spoon some of the butter emulsion onto each plated bass filet. Then, sprinkle on some chopped fresh parsley as a garnish. Keep a lemon wedge on each plate as an additional garnish. Leftovers will keep for 3 days in the fridge. Poaching Striped Bass in Soy Sauce Combine all ingredients but the fish in a skillet. Choose a skillet that’s just large enough to fit the fish into (but don’t add it yet). Pour 0.67  c (160 mL) of water and 0.5  c (120 mL) of soy sauce into the skillet, then add 2 tsp (10 g) of sugar, most of the 15 chopped scallions, and 1 chopped chile pepper (if you’re using it). Stir everything quickly to combine it. If your chosen skillet is too small to easily fit that amount of liquid, you can reduce the soy sauce to 0.33  c (78 mL) and water to 0.5  c (120 mL). Hold back just enough of the scallion pieces to use as a garnish at the end. Bring the mixture to a boil. Turn your stovetop to medium heat and place the skillet on the burner. Wait several minutes until the mixture is bubbling rapidly. You can stir the mixture occasionally, but it’s not necessary. Add the striped bass and reduce the heat. Use tongs or a spatula to carefully place the striped bass filet flesh-side down into the boiling mixture. Then, turn down the heat on the burner until the liquid is only occasionally bubbling. Make sure you don’t splatter the boiling liquid on yourself. Cook the bass 8-10 minutes, turning once or twice. Use tongs or a spatula to carefully flip the bass filet over every 4 minutes or so. A 1 in (2.5 cm) bass filet will typically cook through in 8 minutes. You’ll know the fish is done when it’s just gone from translucent to opaque at the edges and it flakes easily with a fork. Or, use a probe thermometer to check for an internal temperature of 120 °F (49 °C). Serve the bass coated in the pan sauce. Remove the cooked bass from the pan and cut it into up to 4 individual servings. Plate each portion over a bed of cooked white rice (if desired), then pour some of the pan sauce over top. Add a few fresh scallion pieces on top as a garnish. Or, you can serve the entire filet family-style on a platter over a larger bed of rice. Put any leftovers in the fridge right away, and use them within 3 days.",
  "tyn_model":[
    "skillet",
    "oil",
    "lemon",
    "bass",
    "soy sauce",
    "broiler",
    "scallions",
    "bowl",
    "salt",
    "spatula",
    "paper towels",
    "bass filet",
    "ginger",
    "garlic",
    "red pepper",
    "saucepan",
    "fork",
    "pepper",
    "olive oil",
    "fish",
    "probe thermometer",
    "butter",
    "water",
    "tongs",
    "pan sauce",
    "ginger-scallion oil",
    "cooking rack",
    "broilers",
    "“broiler",
    "” or",
    "“max",
    "” if",
    "medium bowl",
    "hot oil",
    "vegetable oil",
    "small saucepan",
    "—this",
    "lemon juice",
    "oven mitts",
    "basting brush",
    "broiling pan",
    "serving plates",
    "asparagus",
    "kosher salt",
    "salt and pepper",
    "large skillet",
    "large nonstick skillet",
    "pan",
    "dry white wine",
    "cold, unsalted butter",
    "whisk",
    "parsley",
    "sugar",
    "chile pepper",
    "stovetop",
    "striped bass",
    "striped bass filet",
    "burner",
    "white rice",
    "rice"
  ],
  "tyn_section":[

  ]
}