{
  "title":"How to Season Scallops",
  "url":"https://www.wikihow.com/Season-Scallops",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "methods":[
    {
      "name":"Lemon and Garlic Pan-Seared Scallops",
      "steps":[
        {
          "headline":"Remove the side muscles and wash and dry your scallops.",
          "description":"Use your thumb and forefinger to pinch and pull off any small tags of muscle tissue remaining on the sides of the scallops. Rinse the scallops in cold water and pat them thoroughly dry with paper towel. Don't worry if you miss some of the side muscles. They're tough to chew, but edible."
        },
        {
          "headline":"Heat the olive oil in a large frying pan over medium-high heat.",
          "description":"Season scallops generously with salt and pepper. When the pan is hot enough, place the scallops in it in a single layer. Leave about 1 inch (2.5 cm) separating one from the other. The pan is hot enough when a couple of drops of water evaporate on contact. The first scallop should make a sizzling noise when you put it in the pan. If it doesn't, wait a few seconds before putting in more. Cook the scallops in batches if the pan is too crowded."
        },
        {
          "headline":"Sear the scallops for 2 minutes on one side, then flip them over.",
          "description":"Sear them for another 2-3 minutes on the other side. They should be golden-brown and opaque. Remove them from the pan to a plate. If the scallops stick to the pan a bit when you try to flip them, let them cook for another few seconds and then attempt the flip."
        },
        {
          "headline":"Sauté the garlic in butter.",
          "description":"Melt 2 tablespoons (30 mL) of butter in the same pan you cooked the scallops in. Scrape up any browned bits left over from the scallops and stir them into the butter. Add the minced garlic cloves and cook for 1 minute, until they're fragrant."
        },
        {
          "headline":"Pour in the wine and simmer.",
          "description":"Let the wine cook for about 2 minutes, or until the liquid reduces by half. Then stir in another 1 tablespoon (15 mL) of butter and the lemon juice."
        },
        {
          "headline":"Remove the pan from the heat and replace the scallops in it.",
          "description":"Let them warm through slightly. Garnish with the chopped parsley and serve immediately. Cooked scallops will keep in the fridge for 1-2 days, if they're sealed in airtight containers or carefully wrapped in aluminum foil."
        }
      ]
    },
    {
      "name":"Grilled Grapefruit, Orange, and Scallop Kabobs",
      "steps":[
        {
          "headline":"Grate the orange peel to make a zest.",
          "description":"Shred the peel of one of the oranges through a grater to create a pile of shavings. Set this aside."
        },
        {
          "headline":"Cut the oranges and grapefruits.",
          "description":"Cut one of the oranges and one of the grapefruits in half. Squeeze the juice out of them and set it aside. Cut the remaining orange and the remaining grapefruit into wedges, leaving them unpeeled. Set the wedges aside."
        },
        {
          "headline":"Make a marinade with the olive oil, tarragon, orange peel, and juice.",
          "description":"In a medium-sized bowl, whisk these ingredients together. Put the scallops in the bowl and cover them thoroughly with the marinade. Cover the bowl and let the scallops stand for 10 minutes, then drain. When you drain the scallops, save the leftover marinade."
        },
        {
          "headline":"Pierce the scallops on skewers.",
          "description":"Use skewers of 2.5 inches (6.4 cm), made of metal or wood. Alternate the scallops with chunks of orange and grapefruit. If you're using wood skewers, soak them first for an hour in a shallow dish filled with enough water to cover them."
        },
        {
          "headline":"Place the skewers on an indoor grill on its highest setting.",
          "description":"Grill the kabobs until the scallops are opaque. Brush them once with the remaining marinade. It should take about 4-7 minutes to  grill the scallops on a covered grill, and 8-10 minutes on an uncovered grill. Turn the scallops once if the grill is uncovered. Leftovers can be kept in the fridge for a maximum of 1-2 days, if they're placed in an airtight container or thoroughly wrapped in aluminum foil."
        }
      ]
    },
    {
      "name":"Cheese and Butter Baked Scallops",
      "steps":[
        {
          "headline":"Pour the melted butter into a casserole dish.",
          "description":"Put the scallops inside. Make sure the scallops are evenly spaced and coated in the butter."
        },
        {
          "headline":"Create the gratin crust.",
          "description":"In a bowl, combine the bread crumbs, onion powder, garlic powder, paprika, parsley, minced garlic, and Parmesan cheese. Sprinkle this mixture evenly over top of the scallops. Cover the casserole dish with aluminum foil."
        },
        {
          "headline":"Bake at 400 °F (204 °C) for about 20 minutes.",
          "description":"Put the casserole dish in a pre-heated oven and bake until the scallops are firm. The crust should be golden brown. Serve immediately. Place your oven rack in the second-from-the-top position. For a crispier topping, remove the aluminum foil after baking and set the oven to broil. With the oven door ajar, let the dish brown for about 2-3 minutes, keeping an eye on it constantly to make sure it isn't burning. Keep any leftovers refrigerated, with aluminum wrap tightly covering the dish, for a maximum of 1-2 days."
        }
      ]
    }
  ],
  "text":" Lemon and Garlic Pan-Seared Scallops Remove the side muscles and wash and dry your scallops. Use your thumb and forefinger to pinch and pull off any small tags of muscle tissue remaining on the sides of the scallops. Rinse the scallops in cold water and pat them thoroughly dry with paper towel. Don't worry if you miss some of the side muscles. They're tough to chew, but edible. Heat the olive oil in a large frying pan over medium-high heat. Season scallops generously with salt and pepper. When the pan is hot enough, place the scallops in it in a single layer. Leave about 1 inch (2.5 cm) separating one from the other. The pan is hot enough when a couple of drops of water evaporate on contact. The first scallop should make a sizzling noise when you put it in the pan. If it doesn't, wait a few seconds before putting in more. Cook the scallops in batches if the pan is too crowded. Sear the scallops for 2 minutes on one side, then flip them over. Sear them for another 2-3 minutes on the other side. They should be golden-brown and opaque. Remove them from the pan to a plate. If the scallops stick to the pan a bit when you try to flip them, let them cook for another few seconds and then attempt the flip. Sauté the garlic in butter. Melt 2 tablespoons (30 mL) of butter in the same pan you cooked the scallops in. Scrape up any browned bits left over from the scallops and stir them into the butter. Add the minced garlic cloves and cook for 1 minute, until they're fragrant. Pour in the wine and simmer. Let the wine cook for about 2 minutes, or until the liquid reduces by half. Then stir in another 1 tablespoon (15 mL) of butter and the lemon juice. Remove the pan from the heat and replace the scallops in it. Let them warm through slightly. Garnish with the chopped parsley and serve immediately. Cooked scallops will keep in the fridge for 1-2 days, if they're sealed in airtight containers or carefully wrapped in aluminum foil. Grilled Grapefruit, Orange, and Scallop Kabobs Grate the orange peel to make a zest. Shred the peel of one of the oranges through a grater to create a pile of shavings. Set this aside. Cut the oranges and grapefruits. Cut one of the oranges and one of the grapefruits in half. Squeeze the juice out of them and set it aside. Cut the remaining orange and the remaining grapefruit into wedges, leaving them unpeeled. Set the wedges aside. Make a marinade with the olive oil, tarragon, orange peel, and juice. In a medium-sized bowl, whisk these ingredients together. Put the scallops in the bowl and cover them thoroughly with the marinade. Cover the bowl and let the scallops stand for 10 minutes, then drain. When you drain the scallops, save the leftover marinade. Pierce the scallops on skewers. Use skewers of 2.5 inches (6.4 cm), made of metal or wood. Alternate the scallops with chunks of orange and grapefruit. If you're using wood skewers, soak them first for an hour in a shallow dish filled with enough water to cover them. Place the skewers on an indoor grill on its highest setting. Grill the kabobs until the scallops are opaque. Brush them once with the remaining marinade. It should take about 4-7 minutes to  grill the scallops on a covered grill, and 8-10 minutes on an uncovered grill. Turn the scallops once if the grill is uncovered. Leftovers can be kept in the fridge for a maximum of 1-2 days, if they're placed in an airtight container or thoroughly wrapped in aluminum foil. Cheese and Butter Baked Scallops Pour the melted butter into a casserole dish. Put the scallops inside. Make sure the scallops are evenly spaced and coated in the butter. Create the gratin crust. In a bowl, combine the bread crumbs, onion powder, garlic powder, paprika, parsley, minced garlic, and Parmesan cheese. Sprinkle this mixture evenly over top of the scallops. Cover the casserole dish with aluminum foil. Bake at 400 °F (204 °C) for about 20 minutes. Put the casserole dish in a pre-heated oven and bake until the scallops are firm. The crust should be golden brown. Serve immediately. Place your oven rack in the second-from-the-top position. For a crispier topping, remove the aluminum foil after baking and set the oven to broil. With the oven door ajar, let the dish brown for about 2-3 minutes, keeping an eye on it constantly to make sure it isn't burning. Keep any leftovers refrigerated, with aluminum wrap tightly covering the dish, for a maximum of 1-2 days.",
  "tyn_model":[
    "butter",
    "pan",
    "garlic",
    "scallops",
    "grill",
    "water",
    "orange",
    "oranges",
    "aluminum foil",
    "oven",
    "olive oil",
    "wine",
    "parsley",
    "orange peel",
    "grapefruits",
    "grapefruit",
    "bowl",
    "skewers",
    "casserole dish",
    "paper towel",
    "large frying pan",
    "salt and pepper",
    "plate",
    "lemon juice",
    "scallop",
    "grater",
    "tarragon",
    "medium-sized bowl",
    "shallow dish",
    "airtight container",
    "cheese and butter",
    "bread crumbs",
    "onion powder",
    "garlic powder",
    "paprika",
    "parmesan cheese",
    "oven rack",
    "aluminum wrap"
  ],
  "tyn_section":[

  ]
}