{
  "title":"How to Paint Tile Floors",
  "url":"https://www.wikihow.com/Paint-Tile-Floors",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "parts":[
    {
      "name":"Preparing Your Tiles",
      "steps":[
        {
          "headline":"Sand the floor to help the primer adhere better.",
          "description":"Use a hand-held electric sander to make the job easier and quicker than sanding by hand with sandpaper. Plug in the sander and place it on the tiles. Hold it firmly, turn it on, and move it back and forth in smooth, consistent strokes. You can buy a hand-held electric sander online or at your local home improvement store. If you choose to sand by hand, use a 180-220 grit synthetic sandpaper, such as silicon carbide or aluminum oxide."
        },
        {
          "headline":"Vacuum and wash your floor thoroughly.",
          "description":"First use a vacuum to suck up all the dust and debris left over from sanding. Next, spread a heavy-duty stripper and cleaner onto the floor with a mop. Let the cleaner sit for about 15 minutes, and then scrub the entire floor, including the grout lines, with a nylon scrub brush. Mop away the cleaner using a bucket of warm water, and repeat the process to ensure your floor is as clean as possible. Check the instructions on your cleaning product to see if it should be mixed with water first. You can also make your own homemade cleaning solution by mixing equal parts bleach and warm water."
        },
        {
          "headline":"Repair any visible cracks in the tiles and grout with caulk.",
          "description":"Squeeze caulk out of a caulk gun into any cracks and missing chunks in the tiles and grout. Smooth the caulk with a wet finger or plastic spoon. Leave the caulk to cure for at least 48 hours."
        },
        {
          "headline":"Put painter’s tape on your baseboards.",
          "description":"Protect them from paint splatter by applying painter’s tape everywhere that the baseboards meet the floor. Apply the tape as close to the floor as possible without covering the tiles. Cover your grout lines with acrylic masking tape if you don’t want to paint them."
        }
      ]
    },
    {
      "name":"Choosing Your Paint",
      "steps":[
        {
          "headline":"Use chalk paint if you don't want to put on primer.",
          "description":"Chalk paint is a decorative water-based paint that produces a matte white finish with chalk-white undertones. It will give your floor an antique, distressed, shabby-chic vibe. You can use chalk paint for one solid color or as a base coat for a pattern."
        },
        {
          "headline":"Pick a latex paint for a fast-drying, colorfast option.",
          "description":"Latex paints are the most common type used for home improvement projects. They're relatively cheap and they clean up quickly. Latex paint can be used for both solid and patterned tile floors. Use a semi-gloss or high-gloss paint for solid colors, and a high-gloss paint for patterns."
        },
        {
          "headline":"Consider an oil-based paint to reduce chipping.",
          "description":"Oil-based paints are more resistant to chips and damage than latex paints. However, they're also more expensive, take longer to dry, and are worse for the environment. Avoid oil-based paints unless you're working on a small project. They aren't recommended for large-scale painting because they're expensive and they give off volatile organic compounds (VOCs), which can harm the atmosphere and your family's health."
        }
      ]
    },
    {
      "name":"Painting the Floor",
      "steps":[
        {
          "headline":"Apply primer to your floor if you aren’t using chalk paint.",
          "description":"Use a paint brush to prime the tile edges and grout lines, and a roller brush to roll primer over the tiles. Begin at the far end of the room and work towards the door so that you aren’t trapped in a corner. Let the primer dry and apply a second coat if necessary using the same technique. Most primers dry to the touch in about 30 minutes to 1 hour. It can take up to 3 hours for the primer to dry thoroughly enough to paint over it. High humidity and temperatures cooler than 77 °F (25 °C) can prolong drying times."
        },
        {
          "headline":"Paint the floor with a paint brush and roller brush.",
          "description":"Use a roller brush to apply paint to the tiles and a paint brush to do the edges and grout lines. Roll in smooth, continuous motions. Check the instructions on your paint can for how long to let the paint dry in between coats. Apply as many coats as necessary to achieve the color you want."
        },
        {
          "headline":"Let the paint dry for 2 to 3 days.",
          "description":"Don’t walk on the floor during this time. Don’t put any furniture, carpets, mats, or other objects on the tiles while the paint dries."
        },
        {
          "headline":"Seal the floor with polyurethane if you’re not adding a pattern.",
          "description":"Stir the can of polyurethane. If the consistency is too thick, use mineral spirits to thin it out. Apply a thin coat to the floor with a bristle brush, using long, broad strokes. Make sure to spread it evenly, with no pools or drips. Let it dry for 4 to 6 hours and apply another coat. Use 2 to 3 coats. Use a water-based polyurethane rather than an oil-based one, which can yellow the color of your tiles. Don’t shake the polyurethane can, as this can create air bubbles that leave tiny bumps on the surface of your floor. If you’re adding a pattern to your tiles, don’t seal yet."
        },
        {
          "headline":"Try adding a pattern with a stencil for a more interesting design.",
          "description":"Tape your stencil to one tile with painter's tape, making sure that the edges of the tile and the stencil line up precisely. Don't cover any part of the stencil graphic with the tape. Use a foam roller to paint over the stencil in sections, rather than in broad strokes across the entire graphic. Move your stencil to the next tile and repeat. Allow the paint to dry completely and seal with a water-based polyurethane sealant. Find a stencil in a pattern you like at your local home improvement store or online. Make sure that it fits the dimensions of your tile. The outer tips of the stencil graphic should touch the outer edges of your tile. Start stenciling with a tile on the far side of the room and work towards the door so that you don't paint yourself into a corner. If there are any partial tiles at your floor edges, just paint partial sections of the stencil over them."
        }
      ]
    }
  ],
  "text":" Preparing Your Tiles Sand the floor to help the primer adhere better. Use a hand-held electric sander to make the job easier and quicker than sanding by hand with sandpaper. Plug in the sander and place it on the tiles. Hold it firmly, turn it on, and move it back and forth in smooth, consistent strokes. You can buy a hand-held electric sander online or at your local home improvement store. If you choose to sand by hand, use a 180-220 grit synthetic sandpaper, such as silicon carbide or aluminum oxide. Vacuum and wash your floor thoroughly. First use a vacuum to suck up all the dust and debris left over from sanding. Next, spread a heavy-duty stripper and cleaner onto the floor with a mop. Let the cleaner sit for about 15 minutes, and then scrub the entire floor, including the grout lines, with a nylon scrub brush. Mop away the cleaner using a bucket of warm water, and repeat the process to ensure your floor is as clean as possible. Check the instructions on your cleaning product to see if it should be mixed with water first. You can also make your own homemade cleaning solution by mixing equal parts bleach and warm water. Repair any visible cracks in the tiles and grout with caulk. Squeeze caulk out of a caulk gun into any cracks and missing chunks in the tiles and grout. Smooth the caulk with a wet finger or plastic spoon. Leave the caulk to cure for at least 48 hours. Put painter’s tape on your baseboards. Protect them from paint splatter by applying painter’s tape everywhere that the baseboards meet the floor. Apply the tape as close to the floor as possible without covering the tiles. Cover your grout lines with acrylic masking tape if you don’t want to paint them. Choosing Your Paint Use chalk paint if you don't want to put on primer. Chalk paint is a decorative water-based paint that produces a matte white finish with chalk-white undertones. It will give your floor an antique, distressed, shabby-chic vibe. You can use chalk paint for one solid color or as a base coat for a pattern. Pick a latex paint for a fast-drying, colorfast option. Latex paints are the most common type used for home improvement projects. They're relatively cheap and they clean up quickly. Latex paint can be used for both solid and patterned tile floors. Use a semi-gloss or high-gloss paint for solid colors, and a high-gloss paint for patterns. Consider an oil-based paint to reduce chipping. Oil-based paints are more resistant to chips and damage than latex paints. However, they're also more expensive, take longer to dry, and are worse for the environment. Avoid oil-based paints unless you're working on a small project. They aren't recommended for large-scale painting because they're expensive and they give off volatile organic compounds (VOCs), which can harm the atmosphere and your family's health. Painting the Floor Apply primer to your floor if you aren’t using chalk paint. Use a paint brush to prime the tile edges and grout lines, and a roller brush to roll primer over the tiles. Begin at the far end of the room and work towards the door so that you aren’t trapped in a corner. Let the primer dry and apply a second coat if necessary using the same technique. Most primers dry to the touch in about 30 minutes to 1 hour. It can take up to 3 hours for the primer to dry thoroughly enough to paint over it. High humidity and temperatures cooler than 77 °F (25 °C) can prolong drying times. Paint the floor with a paint brush and roller brush. Use a roller brush to apply paint to the tiles and a paint brush to do the edges and grout lines. Roll in smooth, continuous motions. Check the instructions on your paint can for how long to let the paint dry in between coats. Apply as many coats as necessary to achieve the color you want. Let the paint dry for 2 to 3 days. Don’t walk on the floor during this time. Don’t put any furniture, carpets, mats, or other objects on the tiles while the paint dries. Seal the floor with polyurethane if you’re not adding a pattern. Stir the can of polyurethane. If the consistency is too thick, use mineral spirits to thin it out. Apply a thin coat to the floor with a bristle brush, using long, broad strokes. Make sure to spread it evenly, with no pools or drips. Let it dry for 4 to 6 hours and apply another coat. Use 2 to 3 coats. Use a water-based polyurethane rather than an oil-based one, which can yellow the color of your tiles. Don’t shake the polyurethane can, as this can create air bubbles that leave tiny bumps on the surface of your floor. If you’re adding a pattern to your tiles, don’t seal yet. Try adding a pattern with a stencil for a more interesting design. Tape your stencil to one tile with painter's tape, making sure that the edges of the tile and the stencil line up precisely. Don't cover any part of the stencil graphic with the tape. Use a foam roller to paint over the stencil in sections, rather than in broad strokes across the entire graphic. Move your stencil to the next tile and repeat. Allow the paint to dry completely and seal with a water-based polyurethane sealant. Find a stencil in a pattern you like at your local home improvement store or online. Make sure that it fits the dimensions of your tile. The outer tips of the stencil graphic should touch the outer edges of your tile. Start stenciling with a tile on the far side of the room and work towards the door so that you don't paint yourself into a corner. If there are any partial tiles at your floor edges, just paint partial sections of the stencil over them.",
  "tyn_model":[
    "paint",
    "primer",
    "chalk paint",
    "polyurethane",
    "water",
    "paint brush",
    "roller brush",
    "caulk",
    "painter’s tape",
    "latex paint",
    "oil-based paints",
    "electric sander",
    "sandpaper",
    "sander",
    "hand-held electric sander",
    "home improvement store",
    "vacuum",
    "heavy-duty stripper",
    "cleaner",
    "mop",
    "nylon scrub brush",
    "bleach",
    "caulk gun",
    "acrylic masking tape",
    "latex paints",
    "oil-based paint",
    "paints",
    "primers",
    "paint can",
    "mineral spirits",
    "bristle brush",
    "painter's tape",
    "foam roller",
    "water-based polyurethane sealant"
  ],
  "tyn_section":[

  ]
}