{
  "title":"How to Use Binoculars",
  "url":"https://www.wikihow.com/Use-Binoculars",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Optical Devices",
    "Binoculars"
  ],
  "parts":[
    {
      "name":"Adjusting the Barrels and Eyecups",
      "steps":[
        {
          "headline":"Adjust the distance between the binocular barrels.",
          "description":"Grasp the barrels with your hands and press them inward toward each other to decrease the distance between them. Conversely, pull them outward away from each other to increase this distance. Keep adjusting your barrel distance until your view is a perfect circle. If you see black edges in your field of vision, the barrels are too far apart—press them downward. Each pair of binoculars is made up of two barrels, which contain both contain an eyepiece with a prism inside and an objective lens at the end. If your binoculars have an interpupillary distance (IPD) scale, note the value after adjusting the barrels for future reference."
        },
        {
          "headline":"Retract your eyecups for a wider field of view.",
          "description":"If you're going to be looking at a large, expansive area or fixating on an object that's located at the periphery of your image, fully retract your eyecups by pressing them down as far to the barrels as possible. This position is also best for people with deep-set eyes, as it lets you place the retracted cups onto your pronounced brows. Keep an eye out for grit and dust, as this position is more exposed to the elements. Use the retracted position if you wear eyeglasses."
        },
        {
          "headline":"Extend your eyecups for a more focused view.",
          "description":"Fully extending your eyecups places your eye closer to the optic lenses, blocks peripheral light, and protects the lenses from dirt and dust. Extend them by pulling them as far away from the barrels as possible. Although it limits your field of view, it's the best choice for getting a close look at a specific object in the center of your view. Be wary of fogging during cold weather when your eyecups are extended. If you don't wear eyeglasses, use the extended position."
        },
        {
          "headline":"Place your eyecups in the middle position for the most flexibility.",
          "description":"If you're going to be traveling somewhere with a variety of views and conditions, the middle eyecup position is ideal. Press or pull them until they sit in the middle of fully extended and fully retracted. It will give you a nice field of view, block out a good deal of peripheral light, and protect the ocular lens from dirt and dust."
        }
      ]
    },
    {
      "name":"Tweaking the Diopter",
      "steps":[
        {
          "headline":"Locate the diopter adjustment on your binoculars.",
          "description":"A diopter is a unit of magnifying power, and many lenses have a diopter adjustment on a specific lens that lets you compensate if you don't see as well out of one of your eyes. The diopter adjustment runs on a scale with \"+\" at on side and \"-\" on the other. On most binoculars, the diopter adjustment is located on the right eyepiece. On others, the diopter adjustment is located on the left eyepiece."
        },
        {
          "headline":"Focus the non-diopter side of your lens.",
          "description":"First, find a distant object that contains lots of detail, such as a tree. Once you do, stop and cover the lens with the diopter setting, using your hand or a lens cover. Now, turn the center focus wheel until you can see the object in as much detail as possible. Don't adjust the diopter setting just yet."
        },
        {
          "headline":"Adjust the diopter setting on the other lens.",
          "description":"Remove your hand or lens cover and place it onto the objective lens that you just focused. Now, focus on the tree again with the diopter lens using your other eye. Adjust the diopter setting until the details of the tree are as sharp and clear as possible. Once you're finished adjusting the diopter, test the lens with your other eye—the tree should still appear sharp. If not, repeat the process. Note the final diopter scale for future reference. Don't adjust the center focus wheel while adjusting the diopter."
        },
        {
          "headline":"Look through both lenses at the same time to test the clarity.",
          "description":"After adjusting the central focus wheel and diopter gauge, the image should now be clearly focused in both eyes. If you're still noticing some blurriness, repeat the process—adjusting the central focus wheel followed by the diopter—until the image is crystal clear. The final view through your binoculars should seem three-dimensional. If you feel a strain in your eyes, the binoculars might be out of alignment. Contact your manufacturer if adjustments don't make a difference."
        }
      ]
    },
    {
      "name":"Learning Proper Technique",
      "steps":[
        {
          "headline":"Practice aiming your binoculars on distant objects and locations.",
          "description":"The biggest challenge with binoculars, especially if you're watching small animals like birds, is aiming them properly. Take a walk and look for distant objects to practice on, such as bright leaves on distant trees or a broken window on a building. Start by locking your eyes onto to the object and then—without looking away—bring up your binoculars. Keep doing this until you have no problem aiming your binoculars right at the object in question. As you get better, practice on moving animals, such as squirrels, rabbits, and birds. When you lock your eyes onto a distant animal, take note of features or landmarks around them and use them as points of reference when you look through your binoculars."
        },
        {
          "headline":"Target birds and animals without your binoculars.",
          "description":"Many beginners make the mistake of raising their binoculars right to their eyes after spotting an animal—don't do this! Always look for animal movement with your naked eyes and lock onto them for a few seconds to give you a complete field of vision. Only after following the target for a few seconds should you raise your binoculars to your eyes. Scan around any bird you spot for other birds in its company. Try looking back and forward along its flight path for the best odds."
        },
        {
          "headline":"Scan open areas with your binoculars occasionally.",
          "description":"When you reach an open region—such as a large field—and have yet to locate or target a specific animal, occasionally scanning with your binoculars is beneficial. Focus on edges, such as tree lines, fences, mudflats, and hedgerows, as these are the best perching and resting spots for birds and animals. If you're scouting for birds, you can also scan the sky. To do this, start by focusing on a distant treetop and then moving right or left across the horizon. Don't scan the sky directly overhead—birds are more likely to disperse across a wide area. Focus on clouds to help birds become more obvious against the background."
        }
      ]
    }
  ],
  "text":" Adjusting the Barrels and Eyecups Adjust the distance between the binocular barrels. Grasp the barrels with your hands and press them inward toward each other to decrease the distance between them. Conversely, pull them outward away from each other to increase this distance. Keep adjusting your barrel distance until your view is a perfect circle. If you see black edges in your field of vision, the barrels are too far apart—press them downward. Each pair of binoculars is made up of two barrels, which contain both contain an eyepiece with a prism inside and an objective lens at the end. If your binoculars have an interpupillary distance (IPD) scale, note the value after adjusting the barrels for future reference. Retract your eyecups for a wider field of view. If you're going to be looking at a large, expansive area or fixating on an object that's located at the periphery of your image, fully retract your eyecups by pressing them down as far to the barrels as possible. This position is also best for people with deep-set eyes, as it lets you place the retracted cups onto your pronounced brows. Keep an eye out for grit and dust, as this position is more exposed to the elements. Use the retracted position if you wear eyeglasses. Extend your eyecups for a more focused view. Fully extending your eyecups places your eye closer to the optic lenses, blocks peripheral light, and protects the lenses from dirt and dust. Extend them by pulling them as far away from the barrels as possible. Although it limits your field of view, it's the best choice for getting a close look at a specific object in the center of your view. Be wary of fogging during cold weather when your eyecups are extended. If you don't wear eyeglasses, use the extended position. Place your eyecups in the middle position for the most flexibility. If you're going to be traveling somewhere with a variety of views and conditions, the middle eyecup position is ideal. Press or pull them until they sit in the middle of fully extended and fully retracted. It will give you a nice field of view, block out a good deal of peripheral light, and protect the ocular lens from dirt and dust. Tweaking the Diopter Locate the diopter adjustment on your binoculars. A diopter is a unit of magnifying power, and many lenses have a diopter adjustment on a specific lens that lets you compensate if you don't see as well out of one of your eyes. The diopter adjustment runs on a scale with \"+\" at on side and \"-\" on the other. On most binoculars, the diopter adjustment is located on the right eyepiece. On others, the diopter adjustment is located on the left eyepiece. Focus the non-diopter side of your lens. First, find a distant object that contains lots of detail, such as a tree. Once you do, stop and cover the lens with the diopter setting, using your hand or a lens cover. Now, turn the center focus wheel until you can see the object in as much detail as possible. Don't adjust the diopter setting just yet. Adjust the diopter setting on the other lens. Remove your hand or lens cover and place it onto the objective lens that you just focused. Now, focus on the tree again with the diopter lens using your other eye. Adjust the diopter setting until the details of the tree are as sharp and clear as possible. Once you're finished adjusting the diopter, test the lens with your other eye—the tree should still appear sharp. If not, repeat the process. Note the final diopter scale for future reference. Don't adjust the center focus wheel while adjusting the diopter. Look through both lenses at the same time to test the clarity. After adjusting the central focus wheel and diopter gauge, the image should now be clearly focused in both eyes. If you're still noticing some blurriness, repeat the process—adjusting the central focus wheel followed by the diopter—until the image is crystal clear. The final view through your binoculars should seem three-dimensional. If you feel a strain in your eyes, the binoculars might be out of alignment. Contact your manufacturer if adjustments don't make a difference. Learning Proper Technique Practice aiming your binoculars on distant objects and locations. The biggest challenge with binoculars, especially if you're watching small animals like birds, is aiming them properly. Take a walk and look for distant objects to practice on, such as bright leaves on distant trees or a broken window on a building. Start by locking your eyes onto to the object and then—without looking away—bring up your binoculars. Keep doing this until you have no problem aiming your binoculars right at the object in question. As you get better, practice on moving animals, such as squirrels, rabbits, and birds. When you lock your eyes onto a distant animal, take note of features or landmarks around them and use them as points of reference when you look through your binoculars. Target birds and animals without your binoculars. Many beginners make the mistake of raising their binoculars right to their eyes after spotting an animal—don't do this! Always look for animal movement with your naked eyes and lock onto them for a few seconds to give you a complete field of vision. Only after following the target for a few seconds should you raise your binoculars to your eyes. Scan around any bird you spot for other birds in its company. Try looking back and forward along its flight path for the best odds. Scan open areas with your binoculars occasionally. When you reach an open region—such as a large field—and have yet to locate or target a specific animal, occasionally scanning with your binoculars is beneficial. Focus on edges, such as tree lines, fences, mudflats, and hedgerows, as these are the best perching and resting spots for birds and animals. If you're scouting for birds, you can also scan the sky. To do this, start by focusing on a distant treetop and then moving right or left across the horizon. Don't scan the sky directly overhead—birds are more likely to disperse across a wide area. Focus on clouds to help birds become more obvious against the background.",
  "tyn_model":[
    "binoculars",
    "diopter",
    "birds",
    "eyeglasses",
    "binocular",
    "—press",
    "prism",
    "eyecups",
    "barrels",
    "diopter adjustment",
    "diopter setting",
    "diopter lens",
    "—the",
    "—adjusting",
    "—until",
    "—without",
    "—bring",
    "rabbits",
    "—don't",
    "—such",
    "—and",
    "—birds",
    "clouds"
  ],
  "tyn_section":[

  ]
}