{
  "title":"How to Season a Smoker",
  "url":"https://www.wikihow.com/Season-a-Smoker",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "methods":[
    {
      "name":"Seasoning Electric and Gas Smokers",
      "steps":[
        {
          "headline":"Use mild dish soap and water to clean the interior of the smoker.",
          "description":"Dip a sponge into warm water and mild soap and use it to wipe down the racks, grates, pans, and interior surfaces of the grill. This will get rid of any grime, oil, or harmful substances that got onto your smoker during manufacturing. Once you’re done, rinse off the soapy residue with water. Don’t scrub the smoker with too much force; you may accidentally scratch the surface. You can also use water by itself to clean the interior of your smoker, if you’re nervous about using dish soap. However, dish soap does a much better job of removing grease that may be on the inner surface of the grill."
        },
        {
          "headline":"Let the smoker air dry, then coat the interior surface with cooking oil.",
          "description":"Take the chip tray, grease tray, and water pan out of the smoker first, since you don’t need to put oil on these. Make sure you use an oil with a high smoke point, so that the smoke leaves behind a fine black coating on the smoker that will help keep rust from forming on the interior. Try using vegetable oil, peanut oil, or canola oil for the best results. It should take around 2-3 hours for your smoker to completely dry. Don’t put so much oil in the smoker that the inside is dripping. Simply give the interior surface a light coating. Use a spray bottle or a small amount of oil on a cloth to apply the oil onto the interior surface of the smoker."
        },
        {
          "headline":"Open the top vent and put the accessories back inside the smoker.",
          "description":"Having the top vent open is very important, since it enables the smoker to burn properly by ensuring there’s enough air moving through the interior. Although filling the water pan with water is necessary when you actually cook with your smoker, you don’t have to fill it during the seasoning process. Having the accessories, such as the grilling racks, grates, and water pan, inside the smoker when you season it will ensure that these components are fully sanitized before you cook with them. If you want to give foods cooked in your smoker a stronger flavor, consider filling the water pan with a flavorful juice or beer."
        },
        {
          "headline":"Set the temperature on the smoker to 275 °F (135 °C) and let it run for 2 hours.",
          "description":"Make sure the smoker is plugged in if it’s electric or hooked up to a gas tank if it it’s a gas smoker. Wait for the smoker to reach 275 °F (135 °C) before you start the 2-hour run time. It should take about 15 minutes for your grill to reach this temperature. Make sure you turn off your grill after 3 hours have passed."
        },
        {
          "headline":"Add wood chips to your smoker and run it for another hour.",
          "description":"Putting wood in the wood chips tray during the last hour of the seasoning process will ensure that the interior of the smoker is completely sanitized and will also give it a nice woody flavor. The tray is typically located on the side of the smoker on most models. You’ll only need to use about a handful of wood chips during the seasoning process. There’s no particular type of wood chip that you should use for seasoning your smoker, other than whatever flavor you prefer. Any type of wood chip will work for sanitizing the grill’s interior. You can buy these wood chips at any retailer that sells grilling equipment. 2 of the more common types of wood chips used when seasoning a smoker are mesquite-flavored and maple-flavored."
        }
      ]
    },
    {
      "name":"Seasoning a Charcoal Smoker",
      "steps":[
        {
          "headline":"Clean the interior of the smoker with soap and water.",
          "description":"This will get rid of any grime, oil, or harmful substances that your smoker picked up during the manufacturing process. Use a damp sponge soaked in warm water and mild dish soap to wipe down the smoker’s racks, grates, and pans, as well as the entire interior. Rinse off the soapy residue with water once you’re done. Avoid scrubbing with too much force, since this may cause you to accidentally scratch the surface of the smoker. If you’re nervous about using dish soap in your smoker, you can also just use water and a sponge to clean it off. However, the dish soap will do a better job of removing any grease on the inside of the grill."
        },
        {
          "headline":"Allow the smoker to air dry, then coat the interior with cooking oil.",
          "description":"Burning the oil inside your smoker will leave a layer of soot on the interior that will help prevent the formation of rust. Remove the chip tray, grease tray, and water tray first, since these don’t need to be covered with oil. Use an oil with a high smoke point for the best results, such as vegetable oil, peanut oil, or canola oil. It may take a few hours for the smoker to completely air dry. The interior doesn’t need to be dripping with oil. You only need to cover it with a light coating. You can apply the oil either by spraying it directly onto the interior surface or by using a small amount of oil on a cloth."
        },
        {
          "headline":"Place the accessories back inside the smoker and open the top vent.",
          "description":"Having the vent open will ensure that there’s enough airflow moving through the smoker to allow it to burn properly. You don’t need to fill the water pan when you put the trays back inside the smoker. Although this is necessary when you actually cook foods on your grill, you don’t have to do it during the seasoning process. Some people say you not only should fill the water pan when you season your smoker, but that you should even fill it with a flavorful juice or beer. This will infuse these flavors into whatever foods you first cook in your smoker, so don’t try this if you don’t want the foods you cook to taste like beer."
        },
        {
          "headline":"Fill your chimney starter with charcoal and light it.",
          "description":"Chimney starters are metal cylinders that are used to get charcoal burning before adding it to the smoker. Once you light the charcoal in the chimney starter, wait for it to become fully heated, which should take 10-15 minutes. If your smoker didn’t come with its own chimney starter, you can find one at any hardware store that sells grilling equipment. Be sure to follow the instructions that come with your chimney starter to use it properly."
        },
        {
          "headline":"Pour cold charcoal in the firebox, then pour the lit ones on top of them.",
          "description":"Make sure the lit charcoal is fully heated before you add it to the firebox. Be very careful when adding the lit charcoal; pour it at a slow and steady pace while wearing safety goggles and heat-resistant gloves. You can visually determine whether the charcoal is heated by checking to see if it’s completely red in color."
        },
        {
          "headline":"Let the temperature of the smoker reach 275 °F (135 °C) and burn it for 3 hours.",
          "description":"Close the lid and check the thermometer on the outer surface of the smoker to gauge its internal temperature. Wait until the temperature reaches 275 °F (135 °C) before setting a timer for 3 hours. If the internal temperature of the smoker doesn’t reach 275 °F (135 °C), you may need to add more charcoal to the firebox or clean out the vent to make sure enough air is getting to the coals. The charcoal should burn itself out after 3 hours. However, if the smoker is still burning after 3 hours, simply close the top vent to starve the charcoal of oxygen and put out the fire."
        }
      ]
    }
  ],
  "text":" Seasoning Electric and Gas Smokers Use mild dish soap and water to clean the interior of the smoker. Dip a sponge into warm water and mild soap and use it to wipe down the racks, grates, pans, and interior surfaces of the grill. This will get rid of any grime, oil, or harmful substances that got onto your smoker during manufacturing. Once you’re done, rinse off the soapy residue with water. Don’t scrub the smoker with too much force; you may accidentally scratch the surface. You can also use water by itself to clean the interior of your smoker, if you’re nervous about using dish soap. However, dish soap does a much better job of removing grease that may be on the inner surface of the grill. Let the smoker air dry, then coat the interior surface with cooking oil. Take the chip tray, grease tray, and water pan out of the smoker first, since you don’t need to put oil on these. Make sure you use an oil with a high smoke point, so that the smoke leaves behind a fine black coating on the smoker that will help keep rust from forming on the interior. Try using vegetable oil, peanut oil, or canola oil for the best results. It should take around 2-3 hours for your smoker to completely dry. Don’t put so much oil in the smoker that the inside is dripping. Simply give the interior surface a light coating. Use a spray bottle or a small amount of oil on a cloth to apply the oil onto the interior surface of the smoker. Open the top vent and put the accessories back inside the smoker. Having the top vent open is very important, since it enables the smoker to burn properly by ensuring there’s enough air moving through the interior. Although filling the water pan with water is necessary when you actually cook with your smoker, you don’t have to fill it during the seasoning process. Having the accessories, such as the grilling racks, grates, and water pan, inside the smoker when you season it will ensure that these components are fully sanitized before you cook with them. If you want to give foods cooked in your smoker a stronger flavor, consider filling the water pan with a flavorful juice or beer. Set the temperature on the smoker to 275 °F (135 °C) and let it run for 2 hours. Make sure the smoker is plugged in if it’s electric or hooked up to a gas tank if it it’s a gas smoker. Wait for the smoker to reach 275 °F (135 °C) before you start the 2-hour run time. It should take about 15 minutes for your grill to reach this temperature. Make sure you turn off your grill after 3 hours have passed. Add wood chips to your smoker and run it for another hour. Putting wood in the wood chips tray during the last hour of the seasoning process will ensure that the interior of the smoker is completely sanitized and will also give it a nice woody flavor. The tray is typically located on the side of the smoker on most models. You’ll only need to use about a handful of wood chips during the seasoning process. There’s no particular type of wood chip that you should use for seasoning your smoker, other than whatever flavor you prefer. Any type of wood chip will work for sanitizing the grill’s interior. You can buy these wood chips at any retailer that sells grilling equipment. 2 of the more common types of wood chips used when seasoning a smoker are mesquite-flavored and maple-flavored. Seasoning a Charcoal Smoker Clean the interior of the smoker with soap and water. This will get rid of any grime, oil, or harmful substances that your smoker picked up during the manufacturing process. Use a damp sponge soaked in warm water and mild dish soap to wipe down the smoker’s racks, grates, and pans, as well as the entire interior. Rinse off the soapy residue with water once you’re done. Avoid scrubbing with too much force, since this may cause you to accidentally scratch the surface of the smoker. If you’re nervous about using dish soap in your smoker, you can also just use water and a sponge to clean it off. However, the dish soap will do a better job of removing any grease on the inside of the grill. Allow the smoker to air dry, then coat the interior with cooking oil. Burning the oil inside your smoker will leave a layer of soot on the interior that will help prevent the formation of rust. Remove the chip tray, grease tray, and water tray first, since these don’t need to be covered with oil. Use an oil with a high smoke point for the best results, such as vegetable oil, peanut oil, or canola oil. It may take a few hours for the smoker to completely air dry. The interior doesn’t need to be dripping with oil. You only need to cover it with a light coating. You can apply the oil either by spraying it directly onto the interior surface or by using a small amount of oil on a cloth. Place the accessories back inside the smoker and open the top vent. Having the vent open will ensure that there’s enough airflow moving through the smoker to allow it to burn properly. You don’t need to fill the water pan when you put the trays back inside the smoker. Although this is necessary when you actually cook foods on your grill, you don’t have to do it during the seasoning process. Some people say you not only should fill the water pan when you season your smoker, but that you should even fill it with a flavorful juice or beer. This will infuse these flavors into whatever foods you first cook in your smoker, so don’t try this if you don’t want the foods you cook to taste like beer. Fill your chimney starter with charcoal and light it. Chimney starters are metal cylinders that are used to get charcoal burning before adding it to the smoker. Once you light the charcoal in the chimney starter, wait for it to become fully heated, which should take 10-15 minutes. If your smoker didn’t come with its own chimney starter, you can find one at any hardware store that sells grilling equipment. Be sure to follow the instructions that come with your chimney starter to use it properly. Pour cold charcoal in the firebox, then pour the lit ones on top of them. Make sure the lit charcoal is fully heated before you add it to the firebox. Be very careful when adding the lit charcoal; pour it at a slow and steady pace while wearing safety goggles and heat-resistant gloves. You can visually determine whether the charcoal is heated by checking to see if it’s completely red in color. Let the temperature of the smoker reach 275 °F (135 °C) and burn it for 3 hours. Close the lid and check the thermometer on the outer surface of the smoker to gauge its internal temperature. Wait until the temperature reaches 275 °F (135 °C) before setting a timer for 3 hours. If the internal temperature of the smoker doesn’t reach 275 °F (135 °C), you may need to add more charcoal to the firebox or clean out the vent to make sure enough air is getting to the coals. The charcoal should burn itself out after 3 hours. However, if the smoker is still burning after 3 hours, simply close the top vent to starve the charcoal of oxygen and put out the fire.",
  "tyn_model":[
    "smoker",
    "water",
    "oil",
    "charcoal",
    "grill",
    "dish soap",
    "water pan",
    "wood chips",
    "chimney starter",
    "sponge",
    "cooking oil",
    "vegetable oil",
    "peanut oil",
    "canola oil",
    "wood chip",
    "mild soap",
    "spray bottle",
    "grilling racks",
    "gas smoker",
    "charcoal smoker",
    "soap",
    "trays",
    "grilling equipment",
    "thermometer"
  ],
  "tyn_section":[

  ]
}