{
  "title":"How to Make Soft Ice",
  "url":"https://www.wikihow.com/Make-Soft-Ice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Water Ice and Sports Drinks"
  ],
  "parts":[
    {
      "name":"Using Club Soda to Make Ice",
      "steps":[
        {
          "headline":"Choose an ice cube tray with medium-sized molds.",
          "description":"For the perfect nugget size, look for a tray that makes square cubes that are between ⁄2 and ⁄4 inch (1.3 and 1.9 cm) wide. You can buy ice cube trays, which can be plastic or silicone, from a grocery store, kitchen store, or online retailer. If you don’t plan on crushing your soft ice, you can also use a tray that makes fun shapes, like stars or hearts."
        },
        {
          "headline":"Pour club soda into all of the molds, filling each one halfway.",
          "description":"Take a bottle of club soda and carefully pour it into the tray so that each mold is only half full to make small, soft cubes. Use fresh club soda that’s very carbonated, checking that it hasn’t gone flat if it’s a previously opened bottle. For larger ice cubes, you can fill the molds all the way to the top.Tip: Instead of club soda, you can also use carbonated water. Choose a flavored one, like lemon sparkling water, to add a fruity twist."
        },
        {
          "headline":"Place the tray in the freezer for at least 6 hours.",
          "description":"After filling the tray, set it in the freezer so it sits flat. Leave it for at least 6 hours, or even overnight to be safe. The ice will be cloudy when it’s finished freezing. Test the ice to see if it’s frozen by pressing firmly on one of the molds. If it cracks or gives at all, leave the ice in the freezer for longer."
        },
        {
          "headline":"Remove the ice from the freezer and pop the cubes out of the tray.",
          "description":"Once the ice is completely frozen, take the tray out of the freezer. Carefully bend the tray back and forth to loosen the cubes from the individual pockets. Set them aside in glasses or a bowl. If you’re having trouble removing the ice, try tapping the bottom of the tray gently against a hard surface."
        }
      ]
    },
    {
      "name":"Crushing the Ice",
      "steps":[
        {
          "headline":"Put the cubes in a blender if you have one that can handle ice.",
          "description":"Check your blender’s user manual to see if your model is made for crushing ice. If it has a glass bowl, stainless steel blades and a power setting of at least 400 watts, the blender is likely ice-friendly. Place the cubes inside and turn it on the smoothie or crush setting. Don’t try to crush ice in a blender with a plastic bowl or plastic blades. The ice could shatter them. Avoid packing the cubes tightly in the blender. Give them room to move around."
        },
        {
          "headline":"Use a muddler if you're only crushing a small amount of ice.",
          "description":"Fill a glass with ice cubes, then firmly press the muddler into the ice, rotating it as you do so. Repeat this 4 to 6 times, or until the ice is crushed. You can use a metal, plastic, or wood muddler. Don’t muddle in a plastic drinking glass or you could crack it.Tip: If you don't have a muddler, you can use the end of a wooden spoon instead."
        },
        {
          "headline":"Place the cubes in a Lewis bag to crush them if you're making a lot of ice.",
          "description":"Use a Lewis bag, which is a sturdy, canvas sack that won’t break while you’re hitting the ice and will also soak up any excess moisture. Fold over the flap of the bag once the cubes are inside, then pound the ice with a rolling pin until it’s the desired texture. You can buy a Lewis bag from a kitchen store or an online retailer."
        },
        {
          "headline":"Crush the ice just enough so there are still chunks left.",
          "description":"Avoid over-smashing the ice. Instead of completely grinding the cubes into flakes, stop breaking up the ice once it's in tiny pieces. Play around with how much you crush the ice based on the texture you prefer. If you like bigger chunks, for example, crush it less."
        },
        {
          "headline":"Serve the crushed soft ice in a glass along with the drink of your choice.",
          "description":"Once you've crushed the ice, place it into a glass. Then, pour whatever beverage you'd like over the ice. Serve immediately before the ice melts. Be aware that crushed ice will melt faster than cubes of ice because it's in smaller pieces.Tip: Crushed soft ice is most commonly served with soft drinks or certain cocktails, like mint juleps or Moscow Mules."
        }
      ]
    }
  ],
  "text":" Using Club Soda to Make Ice Choose an ice cube tray with medium-sized molds. For the perfect nugget size, look for a tray that makes square cubes that are between ⁄2 and ⁄4 inch (1.3 and 1.9 cm) wide. You can buy ice cube trays, which can be plastic or silicone, from a grocery store, kitchen store, or online retailer. If you don’t plan on crushing your soft ice, you can also use a tray that makes fun shapes, like stars or hearts. Pour club soda into all of the molds, filling each one halfway. Take a bottle of club soda and carefully pour it into the tray so that each mold is only half full to make small, soft cubes. Use fresh club soda that’s very carbonated, checking that it hasn’t gone flat if it’s a previously opened bottle. For larger ice cubes, you can fill the molds all the way to the top.Tip: Instead of club soda, you can also use carbonated water. Choose a flavored one, like lemon sparkling water, to add a fruity twist. Place the tray in the freezer for at least 6 hours. After filling the tray, set it in the freezer so it sits flat. Leave it for at least 6 hours, or even overnight to be safe. The ice will be cloudy when it’s finished freezing. Test the ice to see if it’s frozen by pressing firmly on one of the molds. If it cracks or gives at all, leave the ice in the freezer for longer. Remove the ice from the freezer and pop the cubes out of the tray. Once the ice is completely frozen, take the tray out of the freezer. Carefully bend the tray back and forth to loosen the cubes from the individual pockets. Set them aside in glasses or a bowl. If you’re having trouble removing the ice, try tapping the bottom of the tray gently against a hard surface. Crushing the Ice Put the cubes in a blender if you have one that can handle ice. Check your blender’s user manual to see if your model is made for crushing ice. If it has a glass bowl, stainless steel blades and a power setting of at least 400 watts, the blender is likely ice-friendly. Place the cubes inside and turn it on the smoothie or crush setting. Don’t try to crush ice in a blender with a plastic bowl or plastic blades. The ice could shatter them. Avoid packing the cubes tightly in the blender. Give them room to move around. Use a muddler if you're only crushing a small amount of ice. Fill a glass with ice cubes, then firmly press the muddler into the ice, rotating it as you do so. Repeat this 4 to 6 times, or until the ice is crushed. You can use a metal, plastic, or wood muddler. Don’t muddle in a plastic drinking glass or you could crack it.Tip: If you don't have a muddler, you can use the end of a wooden spoon instead. Place the cubes in a Lewis bag to crush them if you're making a lot of ice. Use a Lewis bag, which is a sturdy, canvas sack that won’t break while you’re hitting the ice and will also soak up any excess moisture. Fold over the flap of the bag once the cubes are inside, then pound the ice with a rolling pin until it’s the desired texture. You can buy a Lewis bag from a kitchen store or an online retailer. Crush the ice just enough so there are still chunks left. Avoid over-smashing the ice. Instead of completely grinding the cubes into flakes, stop breaking up the ice once it's in tiny pieces. Play around with how much you crush the ice based on the texture you prefer. If you like bigger chunks, for example, crush it less. Serve the crushed soft ice in a glass along with the drink of your choice. Once you've crushed the ice, place it into a glass. Then, pour whatever beverage you'd like over the ice. Serve immediately before the ice melts. Be aware that crushed ice will melt faster than cubes of ice because it's in smaller pieces.Tip: Crushed soft ice is most commonly served with soft drinks or certain cocktails, like mint juleps or Moscow Mules.",
  "tyn_model":[
    "ice",
    "tray",
    "club soda",
    "freezer",
    "blender",
    "glass",
    "ice cubes",
    "soft ice",
    "ice cube tray",
    "ice cube trays",
    "carbonated water",
    "glasses",
    "bowl",
    "wooden spoon",
    "lewis bag",
    "rolling pin",
    "crushed ice",
    "soft drinks",
    "mint juleps",
    "moscow mules"
  ],
  "tyn_section":[

  ]
}