{
  "title":"How to Peel a Grapefruit",
  "url":"https://www.wikihow.com/Peel-a-Grapefruit",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Peeling Food"
  ],
  "parts":[
    {
      "name":"Peeling a Grapefruit with a Knife",
      "steps":[
        {
          "headline":"Slice off the north and south poles of the grapefruit using a sharp knife.",
          "description":"This provides a stable base for peeling. Make sure you slice enough off the ends to expose the flesh."
        },
        {
          "headline":"Carve downwards in small sections.",
          "description":"Place your knife between the flesh and the pith at an angle. Gently whittle down a small section of rind, following the curve of the fruit. Continue cutting off sections until the entire fruit is exposed."
        },
        {
          "headline":"Cut off any remaining pith.",
          "description":"While the pith is edible, it has an unpleasant, bitter taste. Carve away any large white areas of pith until only the flesh remains."
        },
        {
          "headline":"Cut into the center of the fruit to begin segmenting.",
          "description":"Hold the grapefruit in one hand and find the white vertical lines than run from north to south poles. Slice into the center with your knife along the one of the lines until your blade reaches the center of the fruit. Alternatively, once you have removed the rind and pith, you can cut the grapefruit into disks or even smaller pieces to use in cooking or salads."
        },
        {
          "headline":"Cut the other side of the segment.",
          "description":"Cut into the fruit again lengthwise on the other side of the same segment. Try to place your blade as close to the inside of the membrane line as possible."
        },
        {
          "headline":"Remove the segment with your knife.",
          "description":"With the knife still at the center of the fruit, gently twist and lift out the segment."
        },
        {
          "headline":"Scoop out the remaining segments.",
          "description":"After removing the first segment, make another incision on the other side of the next segment’s membrane. Hold your knife vertically along the spine of the segment, with the blade sandwiched between the flesh and the membrane. Twist in an outward motion with gentle pressure to scoop out the segment, leaving behind the membrane. Continue scooping until the entire fruit is segmented. Alternatively, you can continue to cut along either side of each segment membrane, as with the first segment. This technique is easier but wastes more flesh than scooping. If you like, squeeze out and collect any remaining juice from the cut away pieces."
        }
      ]
    },
    {
      "name":"Peeling a Grapefruit by Hand",
      "steps":[
        {
          "headline":"Cut off the stem end using using a sharp knife.",
          "description":"The thick layer of rind is difficult to penetrate without a knife, though your hands can do the rest of the peeling. Slice off just the very top of the fruit; try not to cut into the fruit flesh."
        },
        {
          "headline":"Peel the rind with your hands.",
          "description":"Begin by digging your thumb underneath the thick part of rind near the stem end. Peel back the rind and work your way around the entire fruit until no skin remains. Before peeling, it may help to prep the rind by “scoring” or gently marking lines with a knife along the skin from the stem end to the bottom of the fruit."
        },
        {
          "headline":"Peel the pith with your hands.",
          "description":"Peel away the layer of pith to expose the fruit in its membrane. Try to remove the majority of the pith, but do not worry if some of it remains on the fruit."
        },
        {
          "headline":"Separate the fruit into halves to begin segmenting.",
          "description":"Place your thumb in the hole of the fruit where the stem end used to be, then pry the grapefruit apart into two halves."
        },
        {
          "headline":"Puncture the membrane.",
          "description":"Use your fingertips to tear the membrane near the spine of the segment while leaving the flesh intact. If any membrane peeled off on its own when you halved the fruit, begin segmenting there. You can also use a knife to puncture the membrane, making a slit near the segment spine. A knife may be necessary if your grapefruit’s skin is very tough."
        },
        {
          "headline":"Remove the flesh from the membrane.",
          "description":"Pinch the loosened membrane and peel it back until the entire fleshy side of the segment is exposed. Slide your finger or thumb underneath the unexposed side of the same segment, between the flesh and the membrane, and pull the segment out. Some seeds may fall out as you peel. Remove larger seeds before eating."
        }
      ]
    },
    {
      "name":"Peeling a Grapefruit in Quarters",
      "steps":[
        {
          "headline":"Quarter the grapefruit.",
          "description":"Using a sharp knife, cut the grapefruit in half from top to bottom, not the center. Cut the halves again the same way to make four quarters."
        },
        {
          "headline":"Score the quarters.",
          "description":"At the stem end, make an shallow incision between the membrane and the flesh. Score the remaining the quarters this way."
        },
        {
          "headline":"Remove the rind.",
          "description":"Using your hands, peel back the rind as you would peel a banana. Use your thumb to hold down the fruit as you peel. Try to slide your thumb between the pith and the fruit before you peel back the rind. You can also perforate the pith by sliding your thumb all the way around the outer edge of the quarter. Peel the skin off the remaining quarters."
        },
        {
          "headline":"Remove the pith.",
          "description":"Peel off any large portions of remaining pith."
        }
      ]
    }
  ],
  "text":" Peeling a Grapefruit with a Knife Slice off the north and south poles of the grapefruit using a sharp knife. This provides a stable base for peeling. Make sure you slice enough off the ends to expose the flesh. Carve downwards in small sections. Place your knife between the flesh and the pith at an angle. Gently whittle down a small section of rind, following the curve of the fruit. Continue cutting off sections until the entire fruit is exposed. Cut off any remaining pith. While the pith is edible, it has an unpleasant, bitter taste. Carve away any large white areas of pith until only the flesh remains. Cut into the center of the fruit to begin segmenting. Hold the grapefruit in one hand and find the white vertical lines than run from north to south poles. Slice into the center with your knife along the one of the lines until your blade reaches the center of the fruit. Alternatively, once you have removed the rind and pith, you can cut the grapefruit into disks or even smaller pieces to use in cooking or salads. Cut the other side of the segment. Cut into the fruit again lengthwise on the other side of the same segment. Try to place your blade as close to the inside of the membrane line as possible. Remove the segment with your knife. With the knife still at the center of the fruit, gently twist and lift out the segment. Scoop out the remaining segments. After removing the first segment, make another incision on the other side of the next segment’s membrane. Hold your knife vertically along the spine of the segment, with the blade sandwiched between the flesh and the membrane. Twist in an outward motion with gentle pressure to scoop out the segment, leaving behind the membrane. Continue scooping until the entire fruit is segmented. Alternatively, you can continue to cut along either side of each segment membrane, as with the first segment. This technique is easier but wastes more flesh than scooping. If you like, squeeze out and collect any remaining juice from the cut away pieces. Peeling a Grapefruit by Hand Cut off the stem end using using a sharp knife. The thick layer of rind is difficult to penetrate without a knife, though your hands can do the rest of the peeling. Slice off just the very top of the fruit; try not to cut into the fruit flesh. Peel the rind with your hands. Begin by digging your thumb underneath the thick part of rind near the stem end. Peel back the rind and work your way around the entire fruit until no skin remains. Before peeling, it may help to prep the rind by “scoring” or gently marking lines with a knife along the skin from the stem end to the bottom of the fruit. Peel the pith with your hands. Peel away the layer of pith to expose the fruit in its membrane. Try to remove the majority of the pith, but do not worry if some of it remains on the fruit. Separate the fruit into halves to begin segmenting. Place your thumb in the hole of the fruit where the stem end used to be, then pry the grapefruit apart into two halves. Puncture the membrane. Use your fingertips to tear the membrane near the spine of the segment while leaving the flesh intact. If any membrane peeled off on its own when you halved the fruit, begin segmenting there. You can also use a knife to puncture the membrane, making a slit near the segment spine. A knife may be necessary if your grapefruit’s skin is very tough. Remove the flesh from the membrane. Pinch the loosened membrane and peel it back until the entire fleshy side of the segment is exposed. Slide your finger or thumb underneath the unexposed side of the same segment, between the flesh and the membrane, and pull the segment out. Some seeds may fall out as you peel. Remove larger seeds before eating. Peeling a Grapefruit in Quarters Quarter the grapefruit. Using a sharp knife, cut the grapefruit in half from top to bottom, not the center. Cut the halves again the same way to make four quarters. Score the quarters. At the stem end, make an shallow incision between the membrane and the flesh. Score the remaining the quarters this way. Remove the rind. Using your hands, peel back the rind as you would peel a banana. Use your thumb to hold down the fruit as you peel. Try to slide your thumb between the pith and the fruit before you peel back the rind. You can also perforate the pith by sliding your thumb all the way around the outer edge of the quarter. Peel the skin off the remaining quarters. Remove the pith. Peel off any large portions of remaining pith.",
  "tyn_model":[
    "knife",
    "grapefruit",
    "fruit",
    "sharp knife",
    "rind",
    "“scoring",
    "” or",
    "banana"
  ],
  "tyn_section":[

  ]
}