{
  "title":"How to Avoid Theft While Driving in Your Car",
  "url":"https://www.wikihow.com/Avoid-Theft-While-Driving-in-Your-Car",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "steps":[
    {
      "headline":"Make sure that all your belongings are safely put away and none are visible to anyone outside the car",
      "description":""
    },
    {
      "headline":"Put valuable items such as handbags underneath your seat so that any thieves will not have easy access to them.",
      "description":""
    },
    {
      "headline":"Lock all doors of the car and make sure that all the windows are shut.",
      "description":""
    },
    {
      "headline":"Look around when stopping at a junction to make sure that there is nobody approaching your car.",
      "description":""
    },
    {
      "headline":"Avoid taking routes that have little traffic or none at all - these are often the most targeted areas, leaving you more vulnerable.",
      "description":""
    },
    {
      "headline":"Have the anti-smash and grab feature installed on your car for extra safety - you can never be too careful.",
      "description":""
    },
    {
      "headline":"Stay alert at all times while driving.",
      "description":"Look in your rear-view mirror every six seconds."
    }
  ],
  "text":" Make sure that all your belongings are safely put away and none are visible to anyone outside the car  Put valuable items such as handbags underneath your seat so that any thieves will not have easy access to them.  Lock all doors of the car and make sure that all the windows are shut.  Look around when stopping at a junction to make sure that there is nobody approaching your car.  Avoid taking routes that have little traffic or none at all - these are often the most targeted areas, leaving you more vulnerable.  Have the anti-smash and grab feature installed on your car for extra safety - you can never be too careful.  Stay alert at all times while driving. Look in your rear-view mirror every six seconds.",
  "tyn_model":[

  ],
  "tyn_section":[

  ]
}