{
  "title":"How to Get a Room Like Zoey 101's",
  "url":"https://www.wikihow.com/Get-a-Room-Like-Zoey-101%27s",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "parts":[
    {
      "name":"Planning the change",
      "steps":[
        {
          "headline":"Look at images on the web or when watching Zoey 101.",
          "description":"This will give you inspiration on the color scheme, layout, accessories, and design of your future room."
        },
        {
          "headline":"Make a list of specific things you like from what you find.",
          "description":"For example, do you like the color of Zoey's dorm? Chase's bed? Cut any pictures you find of the items you like on your list, or items that remind you of them."
        },
        {
          "headline":"Note what you need to change in your room, and what you can keep (ex: do you need to change the wall color?",
          "description":"Can you keep the bed you have?) It is important to realize that the rooms on Zoey 101 are a set, so you many not be able to replicate the lighting and some of the accessories seen on the show. If you are in a dorm at a school, there may be certain limitations on what you can change."
        },
        {
          "headline":"Aim to lay out your room in a very open manner.",
          "description":"Strategically place each item so that it looks decorated yet clean."
        },
        {
          "headline":"Create a budget.",
          "description":"Make sure you have a realistic amount of money set for each new item you want to buy. Talk to your parents to come up with a plan."
        },
        {
          "headline":"Find a place to buy the room accessories from.",
          "description":"The furniture on Zoey 101 is modern, sleek, simple, and well suitable for teenagers. A good place to find items like this is large modular furniture and soft furnishings stores that don't charge a lot. All of the dorms have many pillows, duvets, pictures, and rugs throughout the room."
        }
      ]
    },
    {
      "name":"Making the change",
      "steps":[
        {
          "headline":"Paint the room.",
          "description":"Paint two-thirds of the wall lilac/lavender. If you can, paint the bottom of the wall a darker purple. Do that for all the other walls. Or, choose a funky blue, pink, green or orange. The color has a great effect on the room, so choose one that you think suits you. Do not use wallpaper or a pattern."
        },
        {
          "headline":"Add the bed.",
          "description":"Either get a double bed or a bunk bed and prop the chosen bed up against any wall you please. Avoid placing under a window. Choices could be:\nA bunk bed with colourful duvets and a lot of cushions\nA double bed with colourful duvets (orange) and fluffy, orange cushions."
        },
        {
          "headline":"Get some other furniture and decorative items.",
          "description":"Choose such things as:\nA small, green dresser\nOrange, purple and blue furry beanbags\nA furry stool\nPictures on the wall\nMini fridge\nAn orange netted washing basket\nFairy lights\nA small 30 centimeter (11.8 in) orange bin\nA glass desk with a computer on it and a chair. A bedside table with a pink clock and a lamp on it\n(Against window) A yellow and green two-person sofa with fluffy yellow cushion\nA glass table next to it\nA coffee table in-front of it\nAnother fluffy stool near its legs\nYellow and orange curtains in the windows\nA slightly bigger dresser with TV on it and girly stuff, such as: flowers, body spray/perfume, ornaments, clock etc. A small shelf on the dresser (black and pink)."
        },
        {
          "headline":"Enjoy your room or dorm!",
          "description":"Overall, it should be a place that you find relaxing and interesting to you."
        }
      ]
    }
  ],
  "text":" Planning the change Look at images on the web or when watching Zoey 101. This will give you inspiration on the color scheme, layout, accessories, and design of your future room. Make a list of specific things you like from what you find. For example, do you like the color of Zoey's dorm? Chase's bed? Cut any pictures you find of the items you like on your list, or items that remind you of them. Note what you need to change in your room, and what you can keep (ex: do you need to change the wall color? Can you keep the bed you have?) It is important to realize that the rooms on Zoey 101 are a set, so you many not be able to replicate the lighting and some of the accessories seen on the show. If you are in a dorm at a school, there may be certain limitations on what you can change. Aim to lay out your room in a very open manner. Strategically place each item so that it looks decorated yet clean. Create a budget. Make sure you have a realistic amount of money set for each new item you want to buy. Talk to your parents to come up with a plan. Find a place to buy the room accessories from. The furniture on Zoey 101 is modern, sleek, simple, and well suitable for teenagers. A good place to find items like this is large modular furniture and soft furnishings stores that don't charge a lot. All of the dorms have many pillows, duvets, pictures, and rugs throughout the room. Making the change Paint the room. Paint two-thirds of the wall lilac/lavender. If you can, paint the bottom of the wall a darker purple. Do that for all the other walls. Or, choose a funky blue, pink, green or orange. The color has a great effect on the room, so choose one that you think suits you. Do not use wallpaper or a pattern. Add the bed. Either get a double bed or a bunk bed and prop the chosen bed up against any wall you please. Avoid placing under a window. Choices could be:\nA bunk bed with colourful duvets and a lot of cushions\nA double bed with colourful duvets (orange) and fluffy, orange cushions. Get some other furniture and decorative items. Choose such things as:\nA small, green dresser\nOrange, purple and blue furry beanbags\nA furry stool\nPictures on the wall\nMini fridge\nAn orange netted washing basket\nFairy lights\nA small 30 centimeter (11.8 in) orange bin\nA glass desk with a computer on it and a chair. A bedside table with a pink clock and a lamp on it\n(Against window) A yellow and green two-person sofa with fluffy yellow cushion\nA glass table next to it\nA coffee table in-front of it\nAnother fluffy stool near its legs\nYellow and orange curtains in the windows\nA slightly bigger dresser with TV on it and girly stuff, such as: flowers, body spray/perfume, ornaments, clock etc. A small shelf on the dresser (black and pink). Enjoy your room or dorm! Overall, it should be a place that you find relaxing and interesting to you.",
  "tyn_model":[
    "furniture",
    "rugs",
    "lavender",
    "wallpaper",
    "bunk bed",
    "double bed",
    "fairy lights",
    "lamp",
    "coffee table",
    "fluffy stool",
    "body spray",
    "dresser"
  ],
  "tyn_section":[

  ]
}