{
  "title":"How to Season a Roast",
  "url":"https://www.wikihow.com/Season-a-Roast",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat"
  ],
  "methods":[
    {
      "name":"Using Rubs Made of Herbs and Spices",
      "steps":[
        {
          "headline":"Sprinkle salt and pepper over your roast to keep it simple.",
          "description":"Oftentimes, if you’re cooking your roast with other ingredients like sliced vegetables or mushrooms, a little salt and pepper is all you need to add for seasoning. Try sprinkling 1 tablespoon (17 grams) each of salt and pepper over the entire roast before cooking it. If you feel this isn’t enough salt and pepper, it’s perfectly fine to add a little more. However, you probably shouldn’t add more than 3 tablespoons (51 grams) each of salt and pepper for less than 8 pounds (3.6 kg) of roast. If your roast is a little dry, rub some olive oil over the surface before adding your salt and pepper, so that the seasoning will stick to the surface."
        },
        {
          "headline":"Use any combination of garlic powder, basil, thyme, or rosemary.",
          "description":"These tried and true seasonings are often used in roast recipes, especially when the meat being cooked is beef. Most recipes call for you to combine equal parts of each seasoning into a mixture, then rub that mixture over the entire roast. However, feel free to experiment with different ratios to find the combination you like the most! For best results, try using about 1 tablespoon (17 grams) of each of these spices for every 4 pounds (1.8 kg) of meat you’re roasting. Onion powder is also a reliable seasoning, although you may not want to use it if the recipe you’re cooking already involves onions."
        },
        {
          "headline":"Rub oregano, coriander, or lemon zest on your roast for a bolder flavor.",
          "description":"These seasonings will give your roast a much stronger flavor and are particularly good with roast lamb. Use these seasonings separately or combine them, but don’t use more than 3 teaspoons (17 grams) of the seasonings in total for an average roast, unless you want the flavor profile to be particularly strong. Cumin and mint are 2 other seasonings that will also give your roast a stronger flavor than more traditional additives."
        },
        {
          "headline":"Try using chili powder and cayenne pepper to make a spicy roast.",
          "description":"These are especially good for spicier cuisines, like Mexican or South Asian dishes. You can use around 1 tablespoon (17 grams) of chili powder for around 2 pounds (0.91 kg), but you should probably only use about ¼ teaspoon (1.5 grams) of cayenne pepper for the same amount of meat. As with other dry rubs, combine your seasonings into a mixture, then rub that mixture all over your roast before you go to cook it."
        }
      ]
    },
    {
      "name":"Marinating Your Roast",
      "steps":[
        {
          "headline":"Mix chili powder, cilantro, and Italian dressing for a spicy marinade.",
          "description":"Combine 1 tablespoon (50 grams) of chili powder, 2 tablespoons (100 grams) of chopped cilantro, and ⁄3 cup (160 mL) of Italian dressing in a small bowl to make this marinade. This sort of spicy flavoring goes particular well with beef and pork. You can increase or decrease the amount of chili powder you add to the marinade to make it more or less spicy."
        },
        {
          "headline":"Go with soy sauce and lemon juice for a zesty, savory flavor.",
          "description":"Whisk together about ⁄4 cup (180 mL) of soy sauce and ⁄2 cup (120 mL) of lemon juice in a small bowl for this marinade. If you’re making roast chicken, this might be the right marinade for you. You can also add a little bit of mustard to this marinade to make it a little spicier."
        },
        {
          "headline":"Opt for wine or Worcestershire sauce for a marinade with kick.",
          "description":"Go with ⁄2 to 1 cup (120 to 240 mL) of either wine or Worcestershire sauce, but you probably don’t want to mix them together. You can use either red or white wine as a marinade; they’re both good! Red and white wine are especially good marinades if you’re cooking with beef."
        },
        {
          "headline":"Whisk together 3 cups (710 mL) of marinade ingredients.",
          "description":"Whatever ingredients you decide to use in your marinade, whisk them together in a bowl in an amount no greater than 3 cups (710 mL). There is unfortunately a limit to how much flavor the meat can soak up from the marinade, so you don’t want to use (and waste) any more than you need to. 3 cups (710 mL) of marinade will be enough liquids for up to 8 pounds (3.6 kg) of meat."
        },
        {
          "headline":"Place your roast in a zippable bag and pour your marinade over it.",
          "description":"Shake the bag up and down and side to side once you’ve poured the marinade into it, so that all of the meat is covered in the liquid. Make sure you use an airtight bag when you do this to avoid any of the marinade splashing out. Using an airtight bag will also make sure that the meat stays fresh while you let it marinate."
        },
        {
          "headline":"Put the bag in the refrigerator and leave it for 24-48 hours.",
          "description":"This will give the marinade enough time to seep into the meat itself. You should at least leave it to marinate overnight, but 24-48 hours is ideal. Once this is done, cook your marinated roast according to your recipe’s instructions and enjoy!"
        }
      ]
    },
    {
      "name":"Slow Cooker Seasoned Roast",
      "steps":[
        {
          "headline":"Mix your spices together in a bowl and set them aside.",
          "description":"Whisk together 1½ teaspoons (25 grams) each of pepper, onion powder, and garlic powder, ½ teaspoon (8 grams) each of parsley flakes and espresso powder, and 2 teaspoons (34 grams) each of salt and brown sugar in a small bowl. You can use less salt if you prefer, but the other spices should be kept to these portions if possible. If you’re using a marinade instead of a spice rub, mix your marinade ingredients together, pour them into a zippable bag, and place your meat inside the bag to marinate. Place this bag in the refrigerator and leave it for at least 6-8 hours."
        },
        {
          "headline":"Spray the slow cooker with cooking spray and add the other food items.",
          "description":"You only need to spray the bottom of the slow cooker, so that the ingredients you put in first don’t stick. Toss 1 package of baby carrots, 2-3 potatoes cut into 1 inch (2.5 cm) cubes, and 1 chopped onion into the slow cooker after you’ve sprayed it. For added seasoning, you can also add 2 bay leaves to the top of these ingredients."
        },
        {
          "headline":"Rub your roast with the spice mixture, then place it in the slow cooker.",
          "description":"Rub the spice mixture generously over the entire body of the roast before you put it in the slow cooker. You’ll want to make sure the delicious flavor of the spice mix is rubbed into every bite of your roast. Gently place the roast on top of the other ingredients once you’ve rubbed it. If you marinated your roast, you can skip the first part of this step."
        },
        {
          "headline":"Cook the roast for 6-8 hours on low, then remove and serve.",
          "description":"Be careful when you remove your finished dish from the slow cooker, since it will be very hot. If you added bay leaves to the slow cooker before you began cooking, make sure you discard them before you serve the roast."
        }
      ]
    }
  ],
  "text":" Using Rubs Made of Herbs and Spices Sprinkle salt and pepper over your roast to keep it simple. Oftentimes, if you’re cooking your roast with other ingredients like sliced vegetables or mushrooms, a little salt and pepper is all you need to add for seasoning. Try sprinkling 1 tablespoon (17 grams) each of salt and pepper over the entire roast before cooking it. If you feel this isn’t enough salt and pepper, it’s perfectly fine to add a little more. However, you probably shouldn’t add more than 3 tablespoons (51 grams) each of salt and pepper for less than 8 pounds (3.6 kg) of roast. If your roast is a little dry, rub some olive oil over the surface before adding your salt and pepper, so that the seasoning will stick to the surface. Use any combination of garlic powder, basil, thyme, or rosemary. These tried and true seasonings are often used in roast recipes, especially when the meat being cooked is beef. Most recipes call for you to combine equal parts of each seasoning into a mixture, then rub that mixture over the entire roast. However, feel free to experiment with different ratios to find the combination you like the most! For best results, try using about 1 tablespoon (17 grams) of each of these spices for every 4 pounds (1.8 kg) of meat you’re roasting. Onion powder is also a reliable seasoning, although you may not want to use it if the recipe you’re cooking already involves onions. Rub oregano, coriander, or lemon zest on your roast for a bolder flavor. These seasonings will give your roast a much stronger flavor and are particularly good with roast lamb. Use these seasonings separately or combine them, but don’t use more than 3 teaspoons (17 grams) of the seasonings in total for an average roast, unless you want the flavor profile to be particularly strong. Cumin and mint are 2 other seasonings that will also give your roast a stronger flavor than more traditional additives. Try using chili powder and cayenne pepper to make a spicy roast. These are especially good for spicier cuisines, like Mexican or South Asian dishes. You can use around 1 tablespoon (17 grams) of chili powder for around 2 pounds (0.91 kg), but you should probably only use about ¼ teaspoon (1.5 grams) of cayenne pepper for the same amount of meat. As with other dry rubs, combine your seasonings into a mixture, then rub that mixture all over your roast before you go to cook it. Marinating Your Roast Mix chili powder, cilantro, and Italian dressing for a spicy marinade. Combine 1 tablespoon (50 grams) of chili powder, 2 tablespoons (100 grams) of chopped cilantro, and ⁄3 cup (160 mL) of Italian dressing in a small bowl to make this marinade. This sort of spicy flavoring goes particular well with beef and pork. You can increase or decrease the amount of chili powder you add to the marinade to make it more or less spicy. Go with soy sauce and lemon juice for a zesty, savory flavor. Whisk together about ⁄4 cup (180 mL) of soy sauce and ⁄2 cup (120 mL) of lemon juice in a small bowl for this marinade. If you’re making roast chicken, this might be the right marinade for you. You can also add a little bit of mustard to this marinade to make it a little spicier. Opt for wine or Worcestershire sauce for a marinade with kick. Go with ⁄2 to 1 cup (120 to 240 mL) of either wine or Worcestershire sauce, but you probably don’t want to mix them together. You can use either red or white wine as a marinade; they’re both good! Red and white wine are especially good marinades if you’re cooking with beef. Whisk together 3 cups (710 mL) of marinade ingredients. Whatever ingredients you decide to use in your marinade, whisk them together in a bowl in an amount no greater than 3 cups (710 mL). There is unfortunately a limit to how much flavor the meat can soak up from the marinade, so you don’t want to use (and waste) any more than you need to. 3 cups (710 mL) of marinade will be enough liquids for up to 8 pounds (3.6 kg) of meat. Place your roast in a zippable bag and pour your marinade over it. Shake the bag up and down and side to side once you’ve poured the marinade into it, so that all of the meat is covered in the liquid. Make sure you use an airtight bag when you do this to avoid any of the marinade splashing out. Using an airtight bag will also make sure that the meat stays fresh while you let it marinate. Put the bag in the refrigerator and leave it for 24-48 hours. This will give the marinade enough time to seep into the meat itself. You should at least leave it to marinate overnight, but 24-48 hours is ideal. Once this is done, cook your marinated roast according to your recipe’s instructions and enjoy! Slow Cooker Seasoned Roast Mix your spices together in a bowl and set them aside. Whisk together 1½ teaspoons (25 grams) each of pepper, onion powder, and garlic powder, ½ teaspoon (8 grams) each of parsley flakes and espresso powder, and 2 teaspoons (34 grams) each of salt and brown sugar in a small bowl. You can use less salt if you prefer, but the other spices should be kept to these portions if possible. If you’re using a marinade instead of a spice rub, mix your marinade ingredients together, pour them into a zippable bag, and place your meat inside the bag to marinate. Place this bag in the refrigerator and leave it for at least 6-8 hours. Spray the slow cooker with cooking spray and add the other food items. You only need to spray the bottom of the slow cooker, so that the ingredients you put in first don’t stick. Toss 1 package of baby carrots, 2-3 potatoes cut into 1 inch (2.5 cm) cubes, and 1 chopped onion into the slow cooker after you’ve sprayed it. For added seasoning, you can also add 2 bay leaves to the top of these ingredients. Rub your roast with the spice mixture, then place it in the slow cooker. Rub the spice mixture generously over the entire body of the roast before you put it in the slow cooker. You’ll want to make sure the delicious flavor of the spice mix is rubbed into every bite of your roast. Gently place the roast on top of the other ingredients once you’ve rubbed it. If you marinated your roast, you can skip the first part of this step. Cook the roast for 6-8 hours on low, then remove and serve. Be careful when you remove your finished dish from the slow cooker, since it will be very hot. If you added bay leaves to the slow cooker before you began cooking, make sure you discard them before you serve the roast.",
  "tyn_model":[
    "slow cooker",
    "salt and pepper",
    "seasonings",
    "chili powder",
    "wine",
    "garlic powder",
    "onion powder",
    "cayenne pepper",
    "cilantro",
    "italian dressing",
    "soy sauce",
    "lemon juice",
    "worcestershire sauce",
    "bowl",
    "marinade",
    "airtight bag",
    "refrigerator",
    "salt",
    "bay leaves",
    "spice mixture",
    "olive oil",
    "basil",
    "thyme",
    "rosemary",
    "spices",
    "seasoning",
    "onions",
    "oregano",
    "coriander",
    "lemon",
    "cumin",
    "mint",
    "mustard",
    "beef",
    "slow cooker seasoned roast",
    "pepper",
    "parsley flakes",
    "espresso powder",
    "brown sugar",
    "spice rub",
    "cooking spray",
    "baby carrots",
    "potatoes",
    "onion",
    "spice mix"
  ],
  "tyn_section":[

  ]
}