{
  "title":"How to Get Cleaner Dishes from Your Dishwasher",
  "url":"https://www.wikihow.com/Get-Cleaner-Dishes-from-Your-Dishwasher",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "House Cleaning"
  ],
  "parts":[
    {
      "name":"Washing Your Dishwasher",
      "steps":[
        {
          "headline":"Clean the drain filter.",
          "description":"The dirt and grime from your dirty dishes doesn’t magically disappear after you run a dishwasher cycle. Make sure the filter isn't full of gunk from your last cycle. If it is, check your owner’s manual about how to remove it. Then simply wash it in the sink with some dish soap and a sponge, rinse off the soapy water, and put it back in place. A clogged filter is one of the most common culprits behind dishes that come out dirty after a cycle. That’s because the dirty water from the last cycle didn’t drain entirely. This means you’re washing the next batch with the same icky water. If your filter looks really foul after you take out, you may want to soak it in hot water and dish soap for up to an hour. Also, instead of a sponge, use something more abrasive, like a nylon bristle brush. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tOur Expert Agrees: A dishwasher stops running well when it isn't cleaned often enough, especially when food debris and mineral buildup get stuck in the machine. First, clean the drain of any food particles. Then, run a cycle using a cup of white vinegar. You should also clean the dishwasher once a month to keep the dishwasher running smoothly."
        },
        {
          "headline":"Clear clogs from the spray arms.",
          "description":"Like the filter, a clogged spray arm can lower your machine’s performance. That's because the clogs will block the fresh water that's supposed to be washing your dishes. Check your owner’s manual on how to detach the spray arms. Then, once you have them out, check all the holes along each arm to make sure they’re clear. If they’re gunked up:\nUse steel wire, cable, or even a wire hanger to poke the clog out. Then give the hole a quick flossing. Follow that up by soaking them in distilled white vinegar. That will break up any gunk that your flossing couldn’t dislodge."
        },
        {
          "headline":"Wash the doors’ seals.",
          "description":"Over time, gunk is going to build up around the main door’s interior, as well as the rubber gasket that forms its seal. This can cause a yucky odor, so give the door and gasket a quick clean. Wipe them down with a damp cloth or paper towels. Do the same with the soap door inside the machine, too."
        },
        {
          "headline":"Run an empty cycle with vinegar.",
          "description":"Now that you’ve cleaned the more out-of-the-way places where gunk and grime like to hide, give your machine a general clean. Just dump a cup (237 ml) of distilled white vinegar in the bottom of the machine. Then start a normal wash cycle and let the dishwasher clean itself."
        }
      ]
    },
    {
      "name":"Loading the Machine",
      "steps":[
        {
          "headline":"Scrape excess food off of your dishes first.",
          "description":"After all that hard work spent on cleaning your machine, don’t undo it all by clogging everything up again with loose food. Dump any crumbs and whatnot into your garbage can or disposal unit before you load them in your washer. Save yourself the time and effort of having to clean the filter and arms all over again!"
        },
        {
          "headline":"Don't rinse or soak your dishes unless you really need to.",
          "description":"If little bits of food have crusted over and stuck to your dishes, don’t worry about getting rid of those before putting them into the washer. Many dishwasher detergents are designed to stick to those bits of food, so you actually want to leave them! Only rinse them off or give them a soak if you don’t have enough for a full load just yet and you’re worried about attracting pests. In that case, it’s usually better to run them through a rinse-only cycle in your machine if it offers that option. If you rinse or soak them in the sink, don’t use dish soap. Traces of it may end up in your machine and leave a soapy film behind."
        },
        {
          "headline":"Divide dishes by how dirty they are.",
          "description":"If you’re going to need to run more than one load, sort your dishes out first. Group the really dirty ones that will need a heavy wash together, and keep the ones that only need a light or normal cycle by themselves. This way you won't have to run two heavy cycles. If you have only enough for one load, but there are one or two that are way dirtier than the others, set those aside and wash them by hand instead."
        },
        {
          "headline":"Avoid putting too many dishes into one load.",
          "description":"Keep in mind that just because you can fit x-amount of dishes inside your machine, that doesn’t mean each will come out equally clean. Space dishes out so there’s room for water to pass up and down in between. For instance, angling bowls so they’re at a 45-degree angle means you can fit more inside than if you lay them upside down. But crowding them too close together could result in one bowl blocking the one behind it. The same goes for your utensils. Don’t cram the utensil rack full."
        },
        {
          "headline":"Put cups, bowls, and other deep dishes in the top rack.",
          "description":"If you put these in the bottom, they'll block the spray arms. This means water won’t reach whatever you have up top. So use the bottom rack for flat dishes, like plates and baking sheets. For larger deep dishes that won’t fit in the top rack, wash them by hand. If you do put larger dishes in the bottom rack, don't bother putting anything else on top. Odds are that you'd just have to wash whatever's up there again!"
        }
      ]
    },
    {
      "name":"Running Your Machine",
      "steps":[
        {
          "headline":"Double-check your water heater first.",
          "description":"Make sure your water heater is set somewhere between 120 and 125 degrees Fahrenheit (49 and 52 degrees Celsius). Many come preset to such a temperature, but go give it a look-see if you adjusted it for any reason, or if you’ve never checked its temperature before. Readjust it if needed, especially if it’s set any higher than that. Higher temperatures may cause water to evaporate before it has a chance to drain off your dishes. This means that the water’s gone, but the dirt that it was supposed to wash off is still there."
        },
        {
          "headline":"Clear your garbage disposal.",
          "description":"If your sink has a disposal unit, there’s a good chance that it’s also hooked up to your dishwasher. Before you run your load, run some cold water from the faucet and switch the disposal on. Get rid of any blockage in the unit, because that can cause dirty water from draining into the machine."
        },
        {
          "headline":"Run hot water from your kitchen sink’s faucet.",
          "description":"You know how you have to give the shower a minute to warm up before you can step inside with freezing your butt off? Expect the same thing to happen with your dishwasher. Before you run it:\nTurn on the hot tap to your kitchen sink and let the faucet run until the water turns hot. Once hot water is in the line, switch the faucet off and start your machine."
        },
        {
          "headline":"Don’t go overboard with detergent.",
          "description":"Only use the amount recommended by your particular brand’s instructions. Using more might seem like a sure-fire way to get your dishes extra-clean, but that can actually backfire. That's because the more detergent you use, the more residue it will leave behind, which can trap gunk that's supposed to rinse off. If you intend on using a rinse-aid in addition to your detergent, double-check your detergent to make sure it doesn’t include its own rinse-aid. Using a stand-alone aid on top of an all-in-one detergent is a just waste of product."
        },
        {
          "headline":"Run the right cycle for your load.",
          "description":"Dishwashers use both water and electricity, but don’t cheat yourself by trying to save money on utilities. If your load needs a heavy wash, don’t skimp and run a light or normal cycle instead. If you do, you're probably going to have to run it a second time to get them clean, so save yourself the time and money."
        }
      ]
    }
  ],
  "text":" Washing Your Dishwasher Clean the drain filter. The dirt and grime from your dirty dishes doesn’t magically disappear after you run a dishwasher cycle. Make sure the filter isn't full of gunk from your last cycle. If it is, check your owner’s manual about how to remove it. Then simply wash it in the sink with some dish soap and a sponge, rinse off the soapy water, and put it back in place. A clogged filter is one of the most common culprits behind dishes that come out dirty after a cycle. That’s because the dirty water from the last cycle didn’t drain entirely. This means you’re washing the next batch with the same icky water. If your filter looks really foul after you take out, you may want to soak it in hot water and dish soap for up to an hour. Also, instead of a sponge, use something more abrasive, like a nylon bristle brush. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tOur Expert Agrees: A dishwasher stops running well when it isn't cleaned often enough, especially when food debris and mineral buildup get stuck in the machine. First, clean the drain of any food particles. Then, run a cycle using a cup of white vinegar. You should also clean the dishwasher once a month to keep the dishwasher running smoothly. Clear clogs from the spray arms. Like the filter, a clogged spray arm can lower your machine’s performance. That's because the clogs will block the fresh water that's supposed to be washing your dishes. Check your owner’s manual on how to detach the spray arms. Then, once you have them out, check all the holes along each arm to make sure they’re clear. If they’re gunked up:\nUse steel wire, cable, or even a wire hanger to poke the clog out. Then give the hole a quick flossing. Follow that up by soaking them in distilled white vinegar. That will break up any gunk that your flossing couldn’t dislodge. Wash the doors’ seals. Over time, gunk is going to build up around the main door’s interior, as well as the rubber gasket that forms its seal. This can cause a yucky odor, so give the door and gasket a quick clean. Wipe them down with a damp cloth or paper towels. Do the same with the soap door inside the machine, too. Run an empty cycle with vinegar. Now that you’ve cleaned the more out-of-the-way places where gunk and grime like to hide, give your machine a general clean. Just dump a cup (237 ml) of distilled white vinegar in the bottom of the machine. Then start a normal wash cycle and let the dishwasher clean itself. Loading the Machine Scrape excess food off of your dishes first. After all that hard work spent on cleaning your machine, don’t undo it all by clogging everything up again with loose food. Dump any crumbs and whatnot into your garbage can or disposal unit before you load them in your washer. Save yourself the time and effort of having to clean the filter and arms all over again! Don't rinse or soak your dishes unless you really need to. If little bits of food have crusted over and stuck to your dishes, don’t worry about getting rid of those before putting them into the washer. Many dishwasher detergents are designed to stick to those bits of food, so you actually want to leave them! Only rinse them off or give them a soak if you don’t have enough for a full load just yet and you’re worried about attracting pests. In that case, it’s usually better to run them through a rinse-only cycle in your machine if it offers that option. If you rinse or soak them in the sink, don’t use dish soap. Traces of it may end up in your machine and leave a soapy film behind. Divide dishes by how dirty they are. If you’re going to need to run more than one load, sort your dishes out first. Group the really dirty ones that will need a heavy wash together, and keep the ones that only need a light or normal cycle by themselves. This way you won't have to run two heavy cycles. If you have only enough for one load, but there are one or two that are way dirtier than the others, set those aside and wash them by hand instead. Avoid putting too many dishes into one load. Keep in mind that just because you can fit x-amount of dishes inside your machine, that doesn’t mean each will come out equally clean. Space dishes out so there’s room for water to pass up and down in between. For instance, angling bowls so they’re at a 45-degree angle means you can fit more inside than if you lay them upside down. But crowding them too close together could result in one bowl blocking the one behind it. The same goes for your utensils. Don’t cram the utensil rack full. Put cups, bowls, and other deep dishes in the top rack. If you put these in the bottom, they'll block the spray arms. This means water won’t reach whatever you have up top. So use the bottom rack for flat dishes, like plates and baking sheets. For larger deep dishes that won’t fit in the top rack, wash them by hand. If you do put larger dishes in the bottom rack, don't bother putting anything else on top. Odds are that you'd just have to wash whatever's up there again! Running Your Machine Double-check your water heater first. Make sure your water heater is set somewhere between 120 and 125 degrees Fahrenheit (49 and 52 degrees Celsius). Many come preset to such a temperature, but go give it a look-see if you adjusted it for any reason, or if you’ve never checked its temperature before. Readjust it if needed, especially if it’s set any higher than that. Higher temperatures may cause water to evaporate before it has a chance to drain off your dishes. This means that the water’s gone, but the dirt that it was supposed to wash off is still there. Clear your garbage disposal. If your sink has a disposal unit, there’s a good chance that it’s also hooked up to your dishwasher. Before you run your load, run some cold water from the faucet and switch the disposal on. Get rid of any blockage in the unit, because that can cause dirty water from draining into the machine. Run hot water from your kitchen sink’s faucet. You know how you have to give the shower a minute to warm up before you can step inside with freezing your butt off? Expect the same thing to happen with your dishwasher. Before you run it:\nTurn on the hot tap to your kitchen sink and let the faucet run until the water turns hot. Once hot water is in the line, switch the faucet off and start your machine. Don’t go overboard with detergent. Only use the amount recommended by your particular brand’s instructions. Using more might seem like a sure-fire way to get your dishes extra-clean, but that can actually backfire. That's because the more detergent you use, the more residue it will leave behind, which can trap gunk that's supposed to rinse off. If you intend on using a rinse-aid in addition to your detergent, double-check your detergent to make sure it doesn’t include its own rinse-aid. Using a stand-alone aid on top of an all-in-one detergent is a just waste of product. Run the right cycle for your load. Dishwashers use both water and electricity, but don’t cheat yourself by trying to save money on utilities. If your load needs a heavy wash, don’t skimp and run a light or normal cycle instead. If you do, you're probably going to have to run it a second time to get them clean, so save yourself the time and money.",
  "tyn_model":[
    "water",
    "dishes",
    "detergent",
    "dishwasher",
    "dish soap",
    "sponge",
    "distilled white vinegar",
    "washer",
    "bowls",
    "water heater",
    "dishwasher cycle",
    "nylon bristle brush",
    "baruch college.",
    "white vinegar",
    "flossing",
    "’ seals",
    "paper towels",
    "vinegar",
    "dishwasher clean",
    "garbage can",
    "dishwasher detergents",
    "bowl",
    "utensils",
    "utensil",
    "cups",
    "plates",
    "baking sheets",
    "garbage disposal",
    "tap",
    "dishwashers"
  ],
  "tyn_section":[

  ]
}