{
  "title":"How to Make Corn Stalk Decorations",
  "url":"https://www.wikihow.com/Make-Corn-Stalk-Decorations",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts"
  ],
  "methods":[
    {
      "name":"From a magazine",
      "steps":[
        {
          "headline":"Get a magazine.",
          "description":""
        },
        {
          "headline":"Remove the staples.",
          "description":""
        },
        {
          "headline":"Take one of the pages and lay it on the table.",
          "description":""
        },
        {
          "headline":"Overlap a second page near the end of the first one.",
          "description":"Overlap only about 2 inches (5.1 cm)."
        },
        {
          "headline":"Start loosely (about one inch diameter) rolling paper #1 and when you get to paper #2 it will be rolled up as well.",
          "description":""
        },
        {
          "headline":"Before paper #2 is completely rolled, get another sheet (paper #3) from the magazine and overlap paper #2 with paper #3 about two inches before the end of paper #2.",
          "description":""
        },
        {
          "headline":"Continue and repeat the above steps, overlapping until you have done about 20 sheets of paper.",
          "description":""
        },
        {
          "headline":"When all the paper is rolled up, it should be about one to two inches in diameter.",
          "description":""
        },
        {
          "headline":"Tape the outer paper (the last one you rolled) to the roll, so that it stays together like a baton.",
          "description":""
        },
        {
          "headline":"Carefully take scissors and cut 1/2-inch-wide, 1 1/2-inch-long sections in one of the ends of the \"baton.\"",
          "description":""
        },
        {
          "headline":"Insert your finger into the cut end of the paper, and pull out the inner papers so it comes out like a long cone (or light saber, if you're into sci-fi!",
          "description":")."
        },
        {
          "headline":"Bend down the \"leaves\" along the entire length of the \"Cornstalk.\"",
          "description":""
        },
        {
          "headline":"Your final product can be folded at the wide end (the base of the \"stalk\") to provide support.",
          "description":"Lean it against a wall or another way is to put it inside a planting pot along with other \"corn stalks.\""
        }
      ]
    },
    {
      "name":"From kraft paper (6' tall and bold)",
      "steps":[
        {
          "headline":"Procure a roll of brown Kraft paper.",
          "description":"The roll should be 24\" tall, available at Office Depot on clearance for $3. The label says 40LB Kraft Roll 24 in. x 900 feet (274.3 m). 47002-OD. Use the technique with that. The result will look fantastic and be six foot tall."
        },
        {
          "headline":"Unroll at least  a six foot length of paper.",
          "description":""
        },
        {
          "headline":"Curl the sheet into a roll about one and a half to two inches in outer diameter with an inside diameter of at least one inch (two finger widths).",
          "description":"Make at least 11 turns. You can use up to 20 turns-- any more and you cannot complete cuts."
        },
        {
          "headline":"Make three eight inch cuts down from the top evenly spaced around the sleeve.",
          "description":""
        },
        {
          "headline":"Secure the bottom with glue.",
          "description":"(Rubber bands should  also work.)"
        },
        {
          "headline":"Twist the paper a bit, then pull the sleeve out from the top.",
          "description":""
        },
        {
          "headline":"Spray paint as desired with deep fall colors.",
          "description":""
        },
        {
          "headline":"Make 30 or so and bind them at the top and flare at the bottom to make tepee shaped corn stands as a fall church decoration.",
          "description":""
        }
      ]
    }
  ],
  "text":" From a magazine Get a magazine.  Remove the staples.  Take one of the pages and lay it on the table.  Overlap a second page near the end of the first one. Overlap only about 2 inches (5.1 cm). Start loosely (about one inch diameter) rolling paper #1 and when you get to paper #2 it will be rolled up as well.  Before paper #2 is completely rolled, get another sheet (paper #3) from the magazine and overlap paper #2 with paper #3 about two inches before the end of paper #2.  Continue and repeat the above steps, overlapping until you have done about 20 sheets of paper.  When all the paper is rolled up, it should be about one to two inches in diameter.  Tape the outer paper (the last one you rolled) to the roll, so that it stays together like a baton.  Carefully take scissors and cut 1/2-inch-wide, 1 1/2-inch-long sections in one of the ends of the \"baton.\"  Insert your finger into the cut end of the paper, and pull out the inner papers so it comes out like a long cone (or light saber, if you're into sci-fi! ). Bend down the \"leaves\" along the entire length of the \"Cornstalk.\"  Your final product can be folded at the wide end (the base of the \"stalk\") to provide support. Lean it against a wall or another way is to put it inside a planting pot along with other \"corn stalks.\" From kraft paper (6' tall and bold) Procure a roll of brown Kraft paper. The roll should be 24\" tall, available at Office Depot on clearance for $3. The label says 40LB Kraft Roll 24 in. x 900 feet (274.3 m). 47002-OD. Use the technique with that. The result will look fantastic and be six foot tall. Unroll at least  a six foot length of paper.  Curl the sheet into a roll about one and a half to two inches in outer diameter with an inside diameter of at least one inch (two finger widths). Make at least 11 turns. You can use up to 20 turns-- any more and you cannot complete cuts. Make three eight inch cuts down from the top evenly spaced around the sleeve.  Secure the bottom with glue. (Rubber bands should  also work.) Twist the paper a bit, then pull the sleeve out from the top.  Spray paint as desired with deep fall colors.  Make 30 or so and bind them at the top and flare at the bottom to make tepee shaped corn stands as a fall church decoration. ",
  "tyn_model":[
    "paper",
    "magazine",
    "kraft paper",
    "scissors",
    "light saber",
    "kraft roll",
    "glue",
    "paint"
  ],
  "tyn_section":[

  ]
}