{
  "title":"How to Cut a Glass Bottle",
  "url":"https://www.wikihow.com/Cut-a-Glass-Bottle",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Glass and Stained Glass Projects",
    "Working with Glass"
  ],
  "methods":[
    {
      "name":"With a Flame",
      "steps":[
        {
          "headline":"Score the bottle.",
          "description":"To create the line that the bottle will break off at, use a glass cutter or a glass drill bit to score a line. If you want, you can use a support system so that you get a perfect line around the bottle, otherwise you can just freehand it."
        },
        {
          "headline":"Heat the bottle.",
          "description":"Heat the line that you made with the glass cutter. You can use a small candle or a small butane torch. Focus the heat directly along the score line, and constantly rotate the bottle to get even coverage."
        },
        {
          "headline":"Dip the bottle in cold water.",
          "description":"When you have spent around 5 minutes heating the bottle, dip the end you are breaking off in cold water. Do this in a sink or pot full of cold water, with optional ice."
        },
        {
          "headline":"Repeat the process.",
          "description":"The bottle might require more stress than a single round of heating and cooling in order to break. Simply repeat the process of heating the bottle and dipping it in cold water until it snaps."
        },
        {
          "headline":"Sand the edges.",
          "description":"Use a rough square of sandpaper to clean off the edges of the glass. As you remove any sharp points, alternate to a finer grit sandpaper. You should do this as soon as you are finished, to avoid cutting yourself."
        },
        {
          "headline":"Enjoy your cleanly broken bottle.",
          "description":"Use the bottle to store pens, drink out of, or make a pretty vase. The options are endless!"
        }
      ]
    },
    {
      "name":"With Boiling Water",
      "steps":[
        {
          "headline":"Score the bottle.",
          "description":"You need to create a tension line for the bottle to crack along, and you do this by scoring a clean line at the desired breaking point. Use a glass cutter or a glass drill bit to create a single, even line wrapping around the glass. Don’t overlap score lines, as this will make your cut more jagged than a single line."
        },
        {
          "headline":"Get the water ready.",
          "description":"You will need to be working at a sink with cold water running, and also boil a teakettle of hot water. The process works by pouring boiling and cold water back and forth over the bottle until it snaps at the score line."
        },
        {
          "headline":"Pour the hot water.",
          "description":"Hold the bottle over the sink, and slowly pour the hot water over the score line. Avoid pouring it in a wide area, as you want only the score line to be placed under tension from the heat."
        },
        {
          "headline":"Move the bottle into the cold water.",
          "description":"As you finish pouring hot water over the entire line around the bottle, put it under the cold water running in the sink. The first time you do this, the bottle likely will not break."
        },
        {
          "headline":"Continue adding hot and cold water.",
          "description":"Take the bottle from the cold water and add another pour of the boiling water over the stress line. Pour the water around the entire bottle, and then dip it in the cold water again. After the second or third time of doing this, the bottle should snap cleanly off along the score line."
        },
        {
          "headline":"Sand the edges.",
          "description":"Use a rough grit of sandpaper to sand the edges of the glass down. When they are no longer jagged at all, you can use a fine grit sandpaper to smooth the edges to a soft finish."
        }
      ]
    },
    {
      "name":"With Yarn",
      "steps":[
        {
          "headline":"Wrap your yarn.",
          "description":"If you don’t have yarn available, you can use any thick cotton string. At the location of where you would like the bottle to break, wrap a piece of yarn around the bottle 3-5 times. Tie the ends together and cut off any excess string."
        },
        {
          "headline":"Soak the yarn in acetone.",
          "description":"Slide the yarn off the end of the bottle, and place it in a small dish or lid. Pour a bit of nail polish remover or straight-up acetone over the yarn until it is completely soaked. You can pour the excess acetone back into the bottle afterwards."
        },
        {
          "headline":"Wrap the bottle again.",
          "description":"Take the yarn and replace it back on the bottle in the exact location you want it to break. Try to make sure that the loops of yarn are placed close together and are tight so that you get a level, clean break."
        },
        {
          "headline":"Light the yarn on fire.",
          "description":"Use a match or a lighter to catch the yarn (on the bottle) on fire. Rotate the bottle slowly so that the yarn burns at a consistent speed around the entire bottle."
        },
        {
          "headline":"Dunk the bottle in cold water.",
          "description":"Have your sink or a pot filled with cold water - you can add ice as well if you would like. Wait until the fire on the yarn has burnt out, and then stick the end of the bottle with the yarn directly into the water. The bottle should break cleanly off where the yarn was wrapped around it."
        },
        {
          "headline":"Sand the edges.",
          "description":"Use a rough sandpaper to smooth down the jagged edges on the broken section of the bottle. When you have removed any sharp corners, switch to a fine grit sandpaper to give the bottle a smooth, soft finish. You’re done!"
        }
      ]
    },
    {
      "name":"With a Dremel",
      "steps":[
        {
          "headline":"Mask off the bottle.",
          "description":"The dremel will be doing all the cutting in this method, but you need to know where to cut. Use two strips of masking tape placed very close together (but not touching!) to form a thin line around the bottle where you want to cut."
        },
        {
          "headline":"Cut the bottle.",
          "description":"Attach a glass-cutting bit to the end of the dremel. Work your way around, slowly cutting the glass along the taped line. You may have to go over the same section multiple times in order to get a clean cut. There should be a cautionary note here on using a Dremel wheel on glass because glass dust is very dangerous to our respiratory system. Use proper protective wear over nose and mouth, and eyes. Safer to use a glass cutting machine where water is running to prevent dust from blowing into the air; even so the residual glass-dust-infused-water in the tray must be discarded carefully, NOT down any household drain."
        },
        {
          "headline":"Sand the edges.",
          "description":"When the bottle snaps along the line, you will probably have some jagged edges that need smoothing. Use a rough grit of sandpaper to smooth down the sharp pieces, and then transition into using a fine grit to make a soft surface. You're finished!"
        }
      ]
    }
  ],
  "text":" With a Flame Score the bottle. To create the line that the bottle will break off at, use a glass cutter or a glass drill bit to score a line. If you want, you can use a support system so that you get a perfect line around the bottle, otherwise you can just freehand it. Heat the bottle. Heat the line that you made with the glass cutter. You can use a small candle or a small butane torch. Focus the heat directly along the score line, and constantly rotate the bottle to get even coverage. Dip the bottle in cold water. When you have spent around 5 minutes heating the bottle, dip the end you are breaking off in cold water. Do this in a sink or pot full of cold water, with optional ice. Repeat the process. The bottle might require more stress than a single round of heating and cooling in order to break. Simply repeat the process of heating the bottle and dipping it in cold water until it snaps. Sand the edges. Use a rough square of sandpaper to clean off the edges of the glass. As you remove any sharp points, alternate to a finer grit sandpaper. You should do this as soon as you are finished, to avoid cutting yourself. Enjoy your cleanly broken bottle. Use the bottle to store pens, drink out of, or make a pretty vase. The options are endless! With Boiling Water Score the bottle. You need to create a tension line for the bottle to crack along, and you do this by scoring a clean line at the desired breaking point. Use a glass cutter or a glass drill bit to create a single, even line wrapping around the glass. Don’t overlap score lines, as this will make your cut more jagged than a single line. Get the water ready. You will need to be working at a sink with cold water running, and also boil a teakettle of hot water. The process works by pouring boiling and cold water back and forth over the bottle until it snaps at the score line. Pour the hot water. Hold the bottle over the sink, and slowly pour the hot water over the score line. Avoid pouring it in a wide area, as you want only the score line to be placed under tension from the heat. Move the bottle into the cold water. As you finish pouring hot water over the entire line around the bottle, put it under the cold water running in the sink. The first time you do this, the bottle likely will not break. Continue adding hot and cold water. Take the bottle from the cold water and add another pour of the boiling water over the stress line. Pour the water around the entire bottle, and then dip it in the cold water again. After the second or third time of doing this, the bottle should snap cleanly off along the score line. Sand the edges. Use a rough grit of sandpaper to sand the edges of the glass down. When they are no longer jagged at all, you can use a fine grit sandpaper to smooth the edges to a soft finish. With Yarn Wrap your yarn. If you don’t have yarn available, you can use any thick cotton string. At the location of where you would like the bottle to break, wrap a piece of yarn around the bottle 3-5 times. Tie the ends together and cut off any excess string. Soak the yarn in acetone. Slide the yarn off the end of the bottle, and place it in a small dish or lid. Pour a bit of nail polish remover or straight-up acetone over the yarn until it is completely soaked. You can pour the excess acetone back into the bottle afterwards. Wrap the bottle again. Take the yarn and replace it back on the bottle in the exact location you want it to break. Try to make sure that the loops of yarn are placed close together and are tight so that you get a level, clean break. Light the yarn on fire. Use a match or a lighter to catch the yarn (on the bottle) on fire. Rotate the bottle slowly so that the yarn burns at a consistent speed around the entire bottle. Dunk the bottle in cold water. Have your sink or a pot filled with cold water - you can add ice as well if you would like. Wait until the fire on the yarn has burnt out, and then stick the end of the bottle with the yarn directly into the water. The bottle should break cleanly off where the yarn was wrapped around it. Sand the edges. Use a rough sandpaper to smooth down the jagged edges on the broken section of the bottle. When you have removed any sharp corners, switch to a fine grit sandpaper to give the bottle a smooth, soft finish. You’re done! With a Dremel Mask off the bottle. The dremel will be doing all the cutting in this method, but you need to know where to cut. Use two strips of masking tape placed very close together (but not touching!) to form a thin line around the bottle where you want to cut. Cut the bottle. Attach a glass-cutting bit to the end of the dremel. Work your way around, slowly cutting the glass along the taped line. You may have to go over the same section multiple times in order to get a clean cut. There should be a cautionary note here on using a Dremel wheel on glass because glass dust is very dangerous to our respiratory system. Use proper protective wear over nose and mouth, and eyes. Safer to use a glass cutting machine where water is running to prevent dust from blowing into the air; even so the residual glass-dust-infused-water in the tray must be discarded carefully, NOT down any household drain. Sand the edges. When the bottle snaps along the line, you will probably have some jagged edges that need smoothing. Use a rough grit of sandpaper to smooth down the sharp pieces, and then transition into using a fine grit to make a soft surface. You're finished!",
  "tyn_model":[
    "water",
    "bottle",
    "yarn",
    "sandpaper",
    "glass cutter",
    "glass drill bit",
    "ice",
    "cold water",
    "fine grit sandpaper",
    "acetone",
    "dremel",
    "butane torch",
    "vase",
    "boiling water",
    "teakettle",
    "hot water",
    "small dish",
    "nail polish remover",
    "straight-up acetone",
    "match",
    "lighter",
    "dremel mask",
    "masking tape",
    "glass-cutting",
    "dremel wheel",
    "glass cutting machine"
  ],
  "tyn_section":[

  ]
}