{
  "title":"How to Design a Backyard",
  "url":"https://www.wikihow.com/Design-a-Backyard",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Landscaping"
  ],
  "methods":[
    {
      "name":"Working with the Natural Elements",
      "steps":[
        {
          "headline":"Embrace your natural landscape instead of trying to change it.",
          "description":"Even if it's hard to see the potential in your backyard, chances are it just needs a little love. Spend some time sitting in the yard during the design phase, and really familiarize yourself with the layout of your land. Pay attention to different areas, and envision yourself relaxing and enjoying the space. Then, try to incorporate the features you want into the land as naturally as possible. Great backyard design should enhance the natural beauty of your environment. For instance, if you have a really cool tree, you might want to place a table and chairs beneath it to create a shady spot for afternoon tea! You can use the design to fix areas that are naturally less desirable, too, like putting a rock garden in an area where grass is patchy."
        },
        {
          "headline":"Take into account the sun and wind patterns in your yard.",
          "description":"As you're planning out your backyard, pay attention to how the sun and wind will affect you when you're spending time outside. Keep in mind, though, that these will change throughout the year, so the only way to really understand them is to spend a lot of time outside through all of the different seasons. For example, If the sun beats down on a certain section of your yard during the summertime, that wouldn't be a good place to set up a kids' play area. Similarly, an area where wind gets funneled through, like between 2 buildings, would be a bad location for a fire pit or a grill, since you'll probably have trouble keeping the fire lit."
        },
        {
          "headline":"Leave trees in place if they don't pose a danger to your home.",
          "description":"Trees add beauty to your yard, and they're great for the environment. They also provide a home to local wildlife. If you have the option, try to leave as many trees in your yard as you can, and design your landscaping around them. If a tree doesn't pose an immediate damage to your home, but some of the branches are growing near your roof or power lines, have the tree trimmed rather than removing the whole thing. Some trees, like tall pines, are a danger to a home because they could snap during periods of high winds. If that's the case, hire a professional to remove the tree for you. Even dead trees can provide a home for wildlife. In some places, you may need permission from the city before you can remove certain trees from your property."
        },
        {
          "headline":"Work with natural slopes whenever possible.",
          "description":"It's very rare for a piece of land to be perfectly flat, so you probably have some hills or dips in your backyard. While you might need to dig out a flat surface if you're building a structure like a deck or a patio, it's probably not practical to level the whole yard. Instead,  use stone steps, raised or lowered garden beds, and retaining walls to make the slopes part of your design. This will often result in a beautiful, natural-looking landscape, whereas trying to flatten out your whole yard can result in a very artificial look. Leaving the natural slope of your land may also help drain water away from your home. However, if the slope directs water toward your home, it may be worth having a professional landscaper evaluate your property."
        }
      ]
    },
    {
      "name":"Landscaping and Gardening",
      "steps":[
        {
          "headline":"Allow 5 ft (1.5 m) for main walkways.",
          "description":"To ensure you can safely navigate through your yard, it's a good idea to include walkways in your design. If you use paving stones, choose a slightly coarse material so they won't be slippery when it rains. Also, when you install the materials, set them at a 1-2% slope so water will run off of them. Stone, brick, gravel, and concrete are all popular materials for walkways, and depending on the design you choose, they can be a relatively inexpensive investment that add a big dose of comfort and style to your backyard. Secondary walkways, like those leading out into a garden, should be at least 3 ft (0.91 m) wide."
        },
        {
          "headline":"Create borders from rock walls, fences, and shrubbery.",
          "description":"If you have a small backyard and you already have a fence, you might not need to add any extra borders to your space. However, if you have a larger backyard, you can help make it feel more cohesive by creating defined spaces. For instance, you might plant a wall of shrubs at the outside edge of your play area so it feels more enclosed. Rock walls and wooden fences are a great way to get extra privacy from neighbors or passers-by, and they'll also add a beautiful touch to your backyard."
        },
        {
          "headline":"Include flower gardens to add pretty pops of color throughout your yard.",
          "description":"A flower garden is a simple way to add big impact to your backyard. Depending on your gardening experience and your budget, your flower garden can be anything from a simple bed running along the side of your patio to an extensive network of exotic plants. For the most low-maintenance option, choose perennial plants that will come back year after year! Plant nectar-producing flowers to attract butterflies to your backyard. Grow vegetables and herbs in your garden to enjoy your own home-grown food. If you live somewhere where bugs are a constant outdoor nuisance, consider planting lavender near your seating areas. The scent will repel insects.Gardening Tip: When you're choosing plants and deciding how far apart to space them, don't forget to account for the size of the mature plant."
        },
        {
          "headline":"Add shrubs if you want extra greenery.",
          "description":"Create the feel of a lush escape by including shrubbery throughout your yard and gardens. Once a year, either in the spring or the fall, prune your shrubs with shears to maintain their shape and size. Create a topiary by pruning your shrubs into unique shapes. Good shrubs for topiaries include boxwood, yews, and holly. In addition to being beautiful, shrubbery will give your yard an extra layer of privacy and security."
        },
        {
          "headline":"Plant trees for a long-term addition to your backyard.",
          "description":"If you're designing a backyard that you can enjoy now and into the future, trees can be a wonderful addition. Plant trees that will have a sprawling canopy, like maple, oak, or aspen, if you want to add shade to your yard. If you're more interested in decorative trees, opt for a smaller flowering variety, like magnolias or the Eastern redbud. Fruit trees are a beautiful way to enjoy fresh produce you grew yourself!"
        },
        {
          "headline":"Opt for native plants and grass for a healthier ecosystem.",
          "description":"By choosing plants which are native to your area, you'll cut down on how much time you have to spend caring for the plant. That's because native plants are typically the best-suited for your soil and climate, so you usually won't need to worry much about adjusting the soil and constantly adding fertilizer. Native grass is also a more low-maintenance option if you're reseeding your lawn."
        },
        {
          "headline":"Use planters to add greenery to a small space.",
          "description":"There's no need to skip gardening just because you have a small backyard. Planters will allow you to make the use of your compact space, and the planters themselves often add a nice decorative touch. Tiered planters are a great way to make the most of vertical space. Try placing matching planters on either side of a small patio to make it feel cohesive."
        }
      ]
    },
    {
      "name":"Creating Areas to Relax and Play",
      "steps":[
        {
          "headline":"Include plenty of comfortable seating.",
          "description":"Whether you're planning to entertain often or you just want a cozy place to hide away, the seating will be one of the most important aspects of how comfortable you'll be. The types of seating you'll choose will depend on how you plan to use the space. If you'll have a lot of people over, consider folding chairs that you can hang from pegs when they're not in use. If you don't have a lot of space, you might opt for an outdoor couch or bench that conceals a storage compartment. Other options for seating might include lounge chairs, bistro chairs, or even outdoor daybeds. For long afternoons relaxing in the shade, you might want to string up a comfy hammock! Leave 3 ft (0.91 m) of space around your patio furniture to ensure you have plenty of room to walk around it."
        },
        {
          "headline":"Choose a large outdoor table if you'll be dining outside.",
          "description":"If you love the idea of eating a freshly-grilled burger on your back patio, you'll need a sturdy outdoor table. Pick a table that has room for an extra person or 2, so you'll always have room for guests! For instance, if you have a family of 4, you'd probably want an outdoor table with room for about 6 people. If you don't care to eat outdoors, you may still want some smaller accent tables for your space, so you'll have a place to set your drink, book, or anything else you take outside with you."
        },
        {
          "headline":"Add a fire pit for a fun way to stay warm.",
          "description":"To enjoy your outdoor space when the weather gets chilly, consider adding a fire pit to your backyard. These provide a safer way to contain a fire than just having one in the open. You can buy pre-made fire pits, or you can make one yourself from fire-safe materials like brick or field stone. You can even arrange your seating around the fire pit so everyone can enjoy the warmth. For instance, you could build or purchase a large circular\nOf course, always prioritize fire safety! Don't light a fire on a day with high winds, and keep children and pets at a safe distance from the fire pit. Also, never throw anything combustible into the fire pit."
        },
        {
          "headline":"Build a deck or a patio to keep your feet out of the dirt.",
          "description":"If you place your lawn furniture directly in your backyard, you'll have to deal with dirt, mud, and insects when you're relaxing. To avoid that, you can pour a concrete patio or build a wooden deck near your home, then use that space for entertaining, grilling, and more. You can even make a patio out of stone pavers, if you'd like. Tip: For overhead protection from the elements, you could install an awning, or you could build a pergola or gazebo. Be sure to make them at least 7 ft (2.1 m) tall so you'll have plenty of clearance to walk underneath!"
        },
        {
          "headline":"Create a grilling area if you love to cook outside.",
          "description":"It's best to have a designated area for your grill, since you'll need to store it when it's not in use. If you use your grill a lot, you might even want to make a built-in grilling area where you can store your grilling tools and any other supplies you might need while you're cooking. You may want to build a small awning over this space to protect your grill from the elements."
        },
        {
          "headline":"Don't forget to include lighting in your design.",
          "description":"If your entertaining area is close to your house, a porch light might be adequate. If not, you'll have to use outdoor lighting in order to be able to enjoy your backyard after the sun goes down. Place solar-powered lights along a walkway for an eco-friendly way to light your path at night. Drape string lights across a patio or wrap them around the base of a tree for a festive touch. Use motion-activated flood lights for added security in your backyard."
        },
        {
          "headline":"Build a pool in your backyard if you love to swim.",
          "description":"A pool will take up a lot of space, so you should decide early on whether you want to have one. Pick a sunny spot for your pool, away from any trees or shrubs. This will lessen the amount of leaves you have to clean out of your pool each day. You could also include a hot tub if you'd prefer to have a warm, relaxing soak. These typically take up less space than a pool. Pools take a lot of maintenance, and they're an expensive addition to your backyard, so don't feel like you have to include one! If you love water but you don't want to swim, you could add a koi pond or a fountain instead!"
        },
        {
          "headline":"Make an area for the kids to play if you have children at home.",
          "description":"No matter what your budget, you can create a fun place for your kids to play outside. For instance, you could hang a rope swing from a sturdy tree branch or build a sandbox for next to nothing! If you have a larger budget, you could build a playhouse or a treehouse for your kids. Kids love to play outside, and it's a great way for them to get exercise! By creating a special space for them, you'll be encouraging them to be active and healthy. To keep animals out of your sandbox, build or make a cover to go over it when the kids are finished playing."
        },
        {
          "headline":"Leave space for outdoor games if you're athletic.",
          "description":"When you're planning your outdoor space, sometimes it's best to leave a wide-open area in your yard. That way, if you want room to toss a ball around, run sprints, or build an obstacle course, you won't risk crushing your flower garden, and you'll lessen the chance of accidentally hurting yourself or damaging your home. If you have enough space and you really love sports, you could even build a ball court!"
        }
      ]
    },
    {
      "name":"Putting the Design Together",
      "steps":[
        {
          "headline":"Prioritize the features that are most important to you.",
          "description":"Before you get started building or even sketching your backyard design, you'll need to decide what features you feel are the most essential for you to enjoy your space. Make a list of what's most important, then include those priority features first when you start planning the layout. For instance, if you love to grill on the weekends, you'd want to include space for grilling high on your list. Other features might include a play space for children, a vegetable garden, an entertaining area, or a pool. The number of features you can include will depend on the size of your backyard. If you have a large, open space, you might be able to include everything you want. For smaller backyards, you might choose 2 or 3 elements to focus on."
        },
        {
          "headline":"Sketch out your backyard plan to see how everything fits together.",
          "description":"Once you've decided which backyard features are most important to you, draw a rough sketch planning where everything will go. You don't have to spend a lot of time on this sketch, since you might change your mind or want to rearrange something later on. You can even use simple circles as shrubbery, a square for your outdoor table, wavy lines for a flower bed, and so on. You can also use a backyard design tool on the computer or your phone, such as SmartDraw, Garden Planner, or Garden Visualizer, if you prefer. This is a good time to measure your yard so you'll know exactly how much space you have to work with. Tip: Unless you're absolutely certain where your property stops, it's a good idea to double-check your property lines using a survey map or deed, or have your land surveyed professionally."
        },
        {
          "headline":"Create multi-functional areas if you have a smaller backyard.",
          "description":"If you don't have a lot of free space in your backyard, try designating spaces that you can use in different ways. For instance, use tiered planters along a wall to combine your entertaining space with room for an herb garden. Look for ways to make use of out-of-the-way spaces, as well. A small gap between the edge of your deck and the corner of your house might be the perfect spot for a storage bench, for instance."
        },
        {
          "headline":"Incorporate repeating elements to make a larger backyard feel more cohesive.",
          "description":"If you have a lot of land, it can be hard to make your backyard feel like an intentional space. To make everything feel like it belongs together, try to find a way to bring similar colors and shapes to different areas of the yard. This can be through landscaping, structures, or even decorative items placed throughout your space. For instance, you might plant groups of the same type of flower or bush in gardens throughout the yard, or you might build a pergola and a patio from the same type of wood. You could also use the same pavers to create a network of walkways through the backyard."
        },
        {
          "headline":"Start small if you're doing the work yourself.",
          "description":"Unless you can afford a landscaping company to come in and build your backyard for you, you'll probably end up doing a lot of the work on your own. To make the process easier, break your backyard design into smaller projects, and take them on one at a time. If you try to take on the whole project at once, you'll probably end up with a big, overwhelming mess on your hands, and you might end up rushing through projects just to get done. Planting a flower bed is a great place to start. It's typically a relatively inexpensive project, and depending on the size, you can usually complete it over the course of 1 or 2 weekends. Then, seeing the finished result can help motivate you to take on the next project, and so on until you finish."
        }
      ]
    }
  ],
  "text":" Working with the Natural Elements Embrace your natural landscape instead of trying to change it. Even if it's hard to see the potential in your backyard, chances are it just needs a little love. Spend some time sitting in the yard during the design phase, and really familiarize yourself with the layout of your land. Pay attention to different areas, and envision yourself relaxing and enjoying the space. Then, try to incorporate the features you want into the land as naturally as possible. Great backyard design should enhance the natural beauty of your environment. For instance, if you have a really cool tree, you might want to place a table and chairs beneath it to create a shady spot for afternoon tea! You can use the design to fix areas that are naturally less desirable, too, like putting a rock garden in an area where grass is patchy. Take into account the sun and wind patterns in your yard. As you're planning out your backyard, pay attention to how the sun and wind will affect you when you're spending time outside. Keep in mind, though, that these will change throughout the year, so the only way to really understand them is to spend a lot of time outside through all of the different seasons. For example, If the sun beats down on a certain section of your yard during the summertime, that wouldn't be a good place to set up a kids' play area. Similarly, an area where wind gets funneled through, like between 2 buildings, would be a bad location for a fire pit or a grill, since you'll probably have trouble keeping the fire lit. Leave trees in place if they don't pose a danger to your home. Trees add beauty to your yard, and they're great for the environment. They also provide a home to local wildlife. If you have the option, try to leave as many trees in your yard as you can, and design your landscaping around them. If a tree doesn't pose an immediate damage to your home, but some of the branches are growing near your roof or power lines, have the tree trimmed rather than removing the whole thing. Some trees, like tall pines, are a danger to a home because they could snap during periods of high winds. If that's the case, hire a professional to remove the tree for you. Even dead trees can provide a home for wildlife. In some places, you may need permission from the city before you can remove certain trees from your property. Work with natural slopes whenever possible. It's very rare for a piece of land to be perfectly flat, so you probably have some hills or dips in your backyard. While you might need to dig out a flat surface if you're building a structure like a deck or a patio, it's probably not practical to level the whole yard. Instead,  use stone steps, raised or lowered garden beds, and retaining walls to make the slopes part of your design. This will often result in a beautiful, natural-looking landscape, whereas trying to flatten out your whole yard can result in a very artificial look. Leaving the natural slope of your land may also help drain water away from your home. However, if the slope directs water toward your home, it may be worth having a professional landscaper evaluate your property. Landscaping and Gardening Allow 5 ft (1.5 m) for main walkways. To ensure you can safely navigate through your yard, it's a good idea to include walkways in your design. If you use paving stones, choose a slightly coarse material so they won't be slippery when it rains. Also, when you install the materials, set them at a 1-2% slope so water will run off of them. Stone, brick, gravel, and concrete are all popular materials for walkways, and depending on the design you choose, they can be a relatively inexpensive investment that add a big dose of comfort and style to your backyard. Secondary walkways, like those leading out into a garden, should be at least 3 ft (0.91 m) wide. Create borders from rock walls, fences, and shrubbery. If you have a small backyard and you already have a fence, you might not need to add any extra borders to your space. However, if you have a larger backyard, you can help make it feel more cohesive by creating defined spaces. For instance, you might plant a wall of shrubs at the outside edge of your play area so it feels more enclosed. Rock walls and wooden fences are a great way to get extra privacy from neighbors or passers-by, and they'll also add a beautiful touch to your backyard. Include flower gardens to add pretty pops of color throughout your yard. A flower garden is a simple way to add big impact to your backyard. Depending on your gardening experience and your budget, your flower garden can be anything from a simple bed running along the side of your patio to an extensive network of exotic plants. For the most low-maintenance option, choose perennial plants that will come back year after year! Plant nectar-producing flowers to attract butterflies to your backyard. Grow vegetables and herbs in your garden to enjoy your own home-grown food. If you live somewhere where bugs are a constant outdoor nuisance, consider planting lavender near your seating areas. The scent will repel insects.Gardening Tip: When you're choosing plants and deciding how far apart to space them, don't forget to account for the size of the mature plant. Add shrubs if you want extra greenery. Create the feel of a lush escape by including shrubbery throughout your yard and gardens. Once a year, either in the spring or the fall, prune your shrubs with shears to maintain their shape and size. Create a topiary by pruning your shrubs into unique shapes. Good shrubs for topiaries include boxwood, yews, and holly. In addition to being beautiful, shrubbery will give your yard an extra layer of privacy and security. Plant trees for a long-term addition to your backyard. If you're designing a backyard that you can enjoy now and into the future, trees can be a wonderful addition. Plant trees that will have a sprawling canopy, like maple, oak, or aspen, if you want to add shade to your yard. If you're more interested in decorative trees, opt for a smaller flowering variety, like magnolias or the Eastern redbud. Fruit trees are a beautiful way to enjoy fresh produce you grew yourself! Opt for native plants and grass for a healthier ecosystem. By choosing plants which are native to your area, you'll cut down on how much time you have to spend caring for the plant. That's because native plants are typically the best-suited for your soil and climate, so you usually won't need to worry much about adjusting the soil and constantly adding fertilizer. Native grass is also a more low-maintenance option if you're reseeding your lawn. Use planters to add greenery to a small space. There's no need to skip gardening just because you have a small backyard. Planters will allow you to make the use of your compact space, and the planters themselves often add a nice decorative touch. Tiered planters are a great way to make the most of vertical space. Try placing matching planters on either side of a small patio to make it feel cohesive. Creating Areas to Relax and Play Include plenty of comfortable seating. Whether you're planning to entertain often or you just want a cozy place to hide away, the seating will be one of the most important aspects of how comfortable you'll be. The types of seating you'll choose will depend on how you plan to use the space. If you'll have a lot of people over, consider folding chairs that you can hang from pegs when they're not in use. If you don't have a lot of space, you might opt for an outdoor couch or bench that conceals a storage compartment. Other options for seating might include lounge chairs, bistro chairs, or even outdoor daybeds. For long afternoons relaxing in the shade, you might want to string up a comfy hammock! Leave 3 ft (0.91 m) of space around your patio furniture to ensure you have plenty of room to walk around it. Choose a large outdoor table if you'll be dining outside. If you love the idea of eating a freshly-grilled burger on your back patio, you'll need a sturdy outdoor table. Pick a table that has room for an extra person or 2, so you'll always have room for guests! For instance, if you have a family of 4, you'd probably want an outdoor table with room for about 6 people. If you don't care to eat outdoors, you may still want some smaller accent tables for your space, so you'll have a place to set your drink, book, or anything else you take outside with you. Add a fire pit for a fun way to stay warm. To enjoy your outdoor space when the weather gets chilly, consider adding a fire pit to your backyard. These provide a safer way to contain a fire than just having one in the open. You can buy pre-made fire pits, or you can make one yourself from fire-safe materials like brick or field stone. You can even arrange your seating around the fire pit so everyone can enjoy the warmth. For instance, you could build or purchase a large circular\nOf course, always prioritize fire safety! Don't light a fire on a day with high winds, and keep children and pets at a safe distance from the fire pit. Also, never throw anything combustible into the fire pit. Build a deck or a patio to keep your feet out of the dirt. If you place your lawn furniture directly in your backyard, you'll have to deal with dirt, mud, and insects when you're relaxing. To avoid that, you can pour a concrete patio or build a wooden deck near your home, then use that space for entertaining, grilling, and more. You can even make a patio out of stone pavers, if you'd like. Tip: For overhead protection from the elements, you could install an awning, or you could build a pergola or gazebo. Be sure to make them at least 7 ft (2.1 m) tall so you'll have plenty of clearance to walk underneath! Create a grilling area if you love to cook outside. It's best to have a designated area for your grill, since you'll need to store it when it's not in use. If you use your grill a lot, you might even want to make a built-in grilling area where you can store your grilling tools and any other supplies you might need while you're cooking. You may want to build a small awning over this space to protect your grill from the elements. Don't forget to include lighting in your design. If your entertaining area is close to your house, a porch light might be adequate. If not, you'll have to use outdoor lighting in order to be able to enjoy your backyard after the sun goes down. Place solar-powered lights along a walkway for an eco-friendly way to light your path at night. Drape string lights across a patio or wrap them around the base of a tree for a festive touch. Use motion-activated flood lights for added security in your backyard. Build a pool in your backyard if you love to swim. A pool will take up a lot of space, so you should decide early on whether you want to have one. Pick a sunny spot for your pool, away from any trees or shrubs. This will lessen the amount of leaves you have to clean out of your pool each day. You could also include a hot tub if you'd prefer to have a warm, relaxing soak. These typically take up less space than a pool. Pools take a lot of maintenance, and they're an expensive addition to your backyard, so don't feel like you have to include one! If you love water but you don't want to swim, you could add a koi pond or a fountain instead! Make an area for the kids to play if you have children at home. No matter what your budget, you can create a fun place for your kids to play outside. For instance, you could hang a rope swing from a sturdy tree branch or build a sandbox for next to nothing! If you have a larger budget, you could build a playhouse or a treehouse for your kids. Kids love to play outside, and it's a great way for them to get exercise! By creating a special space for them, you'll be encouraging them to be active and healthy. To keep animals out of your sandbox, build or make a cover to go over it when the kids are finished playing. Leave space for outdoor games if you're athletic. When you're planning your outdoor space, sometimes it's best to leave a wide-open area in your yard. That way, if you want room to toss a ball around, run sprints, or build an obstacle course, you won't risk crushing your flower garden, and you'll lessen the chance of accidentally hurting yourself or damaging your home. If you have enough space and you really love sports, you could even build a ball court! Putting the Design Together Prioritize the features that are most important to you. Before you get started building or even sketching your backyard design, you'll need to decide what features you feel are the most essential for you to enjoy your space. Make a list of what's most important, then include those priority features first when you start planning the layout. For instance, if you love to grill on the weekends, you'd want to include space for grilling high on your list. Other features might include a play space for children, a vegetable garden, an entertaining area, or a pool. The number of features you can include will depend on the size of your backyard. If you have a large, open space, you might be able to include everything you want. For smaller backyards, you might choose 2 or 3 elements to focus on. Sketch out your backyard plan to see how everything fits together. Once you've decided which backyard features are most important to you, draw a rough sketch planning where everything will go. You don't have to spend a lot of time on this sketch, since you might change your mind or want to rearrange something later on. You can even use simple circles as shrubbery, a square for your outdoor table, wavy lines for a flower bed, and so on. You can also use a backyard design tool on the computer or your phone, such as SmartDraw, Garden Planner, or Garden Visualizer, if you prefer. This is a good time to measure your yard so you'll know exactly how much space you have to work with. Tip: Unless you're absolutely certain where your property stops, it's a good idea to double-check your property lines using a survey map or deed, or have your land surveyed professionally. Create multi-functional areas if you have a smaller backyard. If you don't have a lot of free space in your backyard, try designating spaces that you can use in different ways. For instance, use tiered planters along a wall to combine your entertaining space with room for an herb garden. Look for ways to make use of out-of-the-way spaces, as well. A small gap between the edge of your deck and the corner of your house might be the perfect spot for a storage bench, for instance. Incorporate repeating elements to make a larger backyard feel more cohesive. If you have a lot of land, it can be hard to make your backyard feel like an intentional space. To make everything feel like it belongs together, try to find a way to bring similar colors and shapes to different areas of the yard. This can be through landscaping, structures, or even decorative items placed throughout your space. For instance, you might plant groups of the same type of flower or bush in gardens throughout the yard, or you might build a pergola and a patio from the same type of wood. You could also use the same pavers to create a network of walkways through the backyard. Start small if you're doing the work yourself. Unless you can afford a landscaping company to come in and build your backyard for you, you'll probably end up doing a lot of the work on your own. To make the process easier, break your backyard design into smaller projects, and take them on one at a time. If you try to take on the whole project at once, you'll probably end up with a big, overwhelming mess on your hands, and you might end up rushing through projects just to get done. Planting a flower bed is a great place to start. It's typically a relatively inexpensive project, and depending on the size, you can usually complete it over the course of 1 or 2 weekends. Then, seeing the finished result can help motivate you to take on the next project, and so on until you finish.",
  "tyn_model":[
    "trees",
    "planters",
    "pool",
    "grill",
    "shrubs",
    "fire pit",
    "plants",
    "tree",
    "water",
    "patio",
    "flower garden",
    "shrubbery",
    "grass",
    "sandbox",
    "garden beds",
    "retaining walls",
    "stones",
    "stone",
    "gravel",
    "concrete",
    "rock walls",
    "fence",
    "flower gardens",
    "vegetables",
    "herbs",
    "lavender",
    "shears",
    "yews",
    "holly",
    "maple",
    "aspen",
    "magnolias",
    "fertilizer",
    "chairs",
    "lounge chairs",
    "patio furniture",
    "table",
    "fire pits",
    "lawn furniture",
    "grilling area",
    "grilling tools",
    "solar-powered lights",
    "hot tub",
    "pools",
    "koi pond",
    "fountain",
    "garden planner",
    "garden visualizer",
    "landscaping company",
    "flower bed"
  ],
  "tyn_section":[

  ]
}