{
  "title":"How to Download Fortnite on Chromebook",
  "url":"https://www.wikihow.com/Download-Fortnite-on-Chromebook",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games"
  ],
  "parts":[
    {
      "name":"Setting Up Your Chromebook",
      "steps":[
        {
          "headline":"Click the time on the bottom-right.",
          "description":"You can find your Chromebook's time indicator in the lower-right corner of your screen. It will open a pop-up menu."
        },
        {
          "headline":"Click Settings on the menu.",
          "description":"This option is listed next to a {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/6\\/68\\/Android7settings.png\",\"bigUrl\":\"\\/images\\/thumb\\/6\\/68\\/Android7settings.png\\/30px-Android7settings.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":\"30\",\"bigHeight\":\"30\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of an Android icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a><br>\\n<\\/p><\\/div>\"} icon. It will open your computer settings."
        },
        {
          "headline":"Select Turn on next to \"Install apps and games from Google Play on your Chromebook.\"",
          "description":"You can find it in the \"Google Play Store\" section of your settings. This will open a pop-up window. If you don't see this option, make sure your Chromebook is up-to-date with the latest Chrome OS software. If you still don't see it with the latest OS update, your Chromebook doesn't work with Android apps."
        },
        {
          "headline":"Click More in the pop-up window.",
          "description":"This will prompt you to read and agree to Google's Terms of Service."
        },
        {
          "headline":"Click I agree.",
          "description":"This will enable Google Play on your Chromebook. You can now download apps from the Play Store."
        },
        {
          "headline":"Click the blue App Settings link under \"Android Apps.\"",
          "description":"This will open your app settings and options on a new page."
        },
        {
          "headline":"Click Security in App Settings.",
          "description":"You can change your computer's security settings here."
        },
        {
          "headline":"Turn on Unknown sources in Security.",
          "description":"Click the Unknown sources option under the Device administration heading, and make sure it's set to \"Allow installation of apps from unknown sources.\""
        },
        {
          "headline":"Open the Google Play Store app on your Chromebook.",
          "description":"Find and click the {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/1e\\/Androidgoogleplay.png\",\"bigUrl\":\"\\/images\\/thumb\\/1\\/1e\\/Androidgoogleplay.png\\/26px-Androidgoogleplay.png\",\"smallWidth\":460,\"smallHeight\":531,\"bigWidth\":\"26\",\"bigHeight\":\"30\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of an Android icon\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a><br>\\n<\\/p><\\/div>\"} icon on your computer to open the Play Store."
        },
        {
          "headline":"Download a file manager app from the Play Store.",
          "description":"You can browse the Store categories or use the search bar at the top to find a file manager. Any free or paid file manager app will do. Make sure to find one that you like and trust before downloading."
        }
      ]
    },
    {
      "name":"Downloading Fortnite",
      "steps":[
        {
          "headline":"Open your internet browser.",
          "description":"You can use your browser of choice on your computer."
        },
        {
          "headline":"Go to fortnite.com/android in your internet browser.",
          "description":"This link will automatically determine the best version of the Fortnite's Android beta available for your computer, and redirect you to the download page."
        },
        {
          "headline":"Scroll down and click the yellow DOWNLOAD button.",
          "description":"This will download Fortnite's APK installation file to your computer. You can use this APK file to install the app. If the website doesn't work on your computer, open it from an Android phone or tablet, download the installation file (APK) on your Android, and transfer it to your Chromebook via email, cloud storage, or flash drive."
        },
        {
          "headline":"Open the file manager app on your Chromebook.",
          "description":"Find and click the file manager app you've downloaded from the Play Store."
        },
        {
          "headline":"Find and select the Fortnite APK file in the file manager.",
          "description":"You can navigate to your downloads folder here, and click on the Fortnite APK file to select it."
        },
        {
          "headline":"Click the Install button in the file manager.",
          "description":"This will run the selected APK file, and install the Fortnite app on your computer. You can open and play the game after the installation is finished."
        }
      ]
    }
  ],
  "text":" Setting Up Your Chromebook Click the time on the bottom-right. You can find your Chromebook's time indicator in the lower-right corner of your screen. It will open a pop-up menu. Click Settings on the menu. This option is listed next to a {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/6\\/68\\/Android7settings.png\",\"bigUrl\":\"\\/images\\/thumb\\/6\\/68\\/Android7settings.png\\/30px-Android7settings.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":\"30\",\"bigHeight\":\"30\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of an Android icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a><br>\\n<\\/p><\\/div>\"} icon. It will open your computer settings. Select Turn on next to \"Install apps and games from Google Play on your Chromebook.\" You can find it in the \"Google Play Store\" section of your settings. This will open a pop-up window. If you don't see this option, make sure your Chromebook is up-to-date with the latest Chrome OS software. If you still don't see it with the latest OS update, your Chromebook doesn't work with Android apps. Click More in the pop-up window. This will prompt you to read and agree to Google's Terms of Service. Click I agree. This will enable Google Play on your Chromebook. You can now download apps from the Play Store. Click the blue App Settings link under \"Android Apps.\" This will open your app settings and options on a new page. Click Security in App Settings. You can change your computer's security settings here. Turn on Unknown sources in Security. Click the Unknown sources option under the Device administration heading, and make sure it's set to \"Allow installation of apps from unknown sources.\" Open the Google Play Store app on your Chromebook. Find and click the {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/1\\/1e\\/Androidgoogleplay.png\",\"bigUrl\":\"\\/images\\/thumb\\/1\\/1e\\/Androidgoogleplay.png\\/26px-Androidgoogleplay.png\",\"smallWidth\":460,\"smallHeight\":531,\"bigWidth\":\"26\",\"bigHeight\":\"30\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of an Android icon\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a><br>\\n<\\/p><\\/div>\"} icon on your computer to open the Play Store. Download a file manager app from the Play Store. You can browse the Store categories or use the search bar at the top to find a file manager. Any free or paid file manager app will do. Make sure to find one that you like and trust before downloading. Downloading Fortnite Open your internet browser. You can use your browser of choice on your computer. Go to fortnite.com/android in your internet browser. This link will automatically determine the best version of the Fortnite's Android beta available for your computer, and redirect you to the download page. Scroll down and click the yellow DOWNLOAD button. This will download Fortnite's APK installation file to your computer. You can use this APK file to install the app. If the website doesn't work on your computer, open it from an Android phone or tablet, download the installation file (APK) on your Android, and transfer it to your Chromebook via email, cloud storage, or flash drive. Open the file manager app on your Chromebook. Find and click the file manager app you've downloaded from the Play Store. Find and select the Fortnite APK file in the file manager. You can navigate to your downloads folder here, and click on the Fortnite APK file to select it. Click the Install button in the file manager. This will run the selected APK file, and install the Fortnite app on your computer. You can open and play the game after the installation is finished.",
  "tyn_model":[
    "chromebook",
    "file manager",
    "fortnite",
    "google play",
    "file manager app",
    "fortnite apk",
    "chrome os software",
    "android apps",
    "google play store app",
    "fortnite app"
  ],
  "tyn_section":[

  ]
}