{
  "title":"How to Be a Good Hider",
  "url":"https://www.wikihow.com/Be-a-Good-Hider",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games",
    "Hiding Games"
  ],
  "steps":[
    {
      "headline":"Hide fast.",
      "description":"If someone is counting to a short number you have to hide pretty fast to make sure they don't run into you."
    },
    {
      "headline":"Hide quietly.",
      "description":"You don't want to make a lot of noises while hiding, they'll hear you. And if you see them you can sneak over to somewhere else."
    },
    {
      "headline":"Choose somewhere they don't know of.",
      "description":"Go to some place where nobody really goes like in a laundry basket or in a cabinet, it will be harder to find you."
    },
    {
      "headline":"Don't hide with someone.",
      "description":"Don't hide with somebody because it will not be that hard to find you, they'll find you both together and it will be one person left of fun!"
    },
    {
      "headline":"Try a dark room.",
      "description":"Dark rooms may be easier to hide in, since with rooms full of light, you will have to find a good hiding spot. Sitting in the dark will probably make them outlook you, and if they do see you, think you are an object. Maybe somewhere dark like a closet or under your bed."
    },
    {
      "headline":"Try not to wear pants with buttons on the sides.",
      "description":"If you do, if you are near the seeker, he/she can hear you. Try wearing shorts or pants with no buttons or zippers."
    },
    {
      "headline":"Set your phone to vibrate(if you have one).",
      "description":"It helps when people are near you because they can't really hear you."
    }
  ],
  "text":" Hide fast. If someone is counting to a short number you have to hide pretty fast to make sure they don't run into you. Hide quietly. You don't want to make a lot of noises while hiding, they'll hear you. And if you see them you can sneak over to somewhere else. Choose somewhere they don't know of. Go to some place where nobody really goes like in a laundry basket or in a cabinet, it will be harder to find you. Don't hide with someone. Don't hide with somebody because it will not be that hard to find you, they'll find you both together and it will be one person left of fun! Try a dark room. Dark rooms may be easier to hide in, since with rooms full of light, you will have to find a good hiding spot. Sitting in the dark will probably make them outlook you, and if they do see you, think you are an object. Maybe somewhere dark like a closet or under your bed. Try not to wear pants with buttons on the sides. If you do, if you are near the seeker, he/she can hear you. Try wearing shorts or pants with no buttons or zippers. Set your phone to vibrate(if you have one). It helps when people are near you because they can't really hear you.",
  "tyn_model":[
    "phone"
  ],
  "tyn_section":[

  ]
}