{
  "title":"How to Use Truffle Oil",
  "url":"https://www.wikihow.com/Use-Truffle-Oil",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "methods":[
    {
      "name":"Adding Truffle Oil to Main Dishes",
      "steps":[
        {
          "headline":"Drizzle truffle oil over cooked meat fillets to create a rich, full flavor.",
          "description":"Truffle oil pairs wonderfully with cuts of fish, beef, duck, and lamb. Lightly drizzle the truffle oil over fillet mignon, beef Wellington, pan-fried game meats, or turbot fillets. Approximately ⁄4  tsp (1.2 ml) of truffle oil per serving.You only need a tiny amount of truffle oil, as the flavor is very strong! Use white truffle oil for lighter meats like fish and black truffle oil for heavier, red meat dishes."
        },
        {
          "headline":"Add white truffle oil to pasta dishes to create a rich, hearty flavor.",
          "description":"Make your favorite pasta dish and simply stir through ⁄4–⁄2 US tbsp (3.7–7.4 ml) of truffle oil per serving when the dish is complete. Linguine, orzo, penne, and spaghetti dishes with either a tomato or cream-based sauce are ideal.Truffle oil works especially well with mushroom pasta dishes."
        },
        {
          "headline":"Drizzle white truffle oil over mushroom pizza for a new twist.",
          "description":"Truffle oil can give regular pizza a gourmet flavor! Make your favorite pizza with plenty of mushrooms and drizzle ⁄2 US tbsp (7.4 ml) of truffle oil over each 12 in (30 cm) pizza once its cooked.Truffle oil is especially good on pizzas with plenty of mozzarella."
        }
      ]
    },
    {
      "name":"Using Truffle Oil in Side Dishes and Snacks",
      "steps":[
        {
          "headline":"Stir truffle oil through cooked vegetables, squash, and potatoes as a butter alternative.",
          "description":"Truffle oil is a great way to upgrade a standard vegetable dish. Try roasting pumpkin, yams, carrots, asparagus, or parsnips until they are tender. Then add 1 US tbsp (15 ml) of white or black truffle oil to every 1 cup (176 g) of roasted vegetables.Truffle oil is also a good alternative to olive oil."
        },
        {
          "headline":"Add black or white truffle oil to potatoes to transform a plain dish.",
          "description":"Roast white, red, or sweet potatoes in the oven until they are tender. Instead of olive oil, drizzle 1 US tbsp (15 ml) of truffle oil over every 1 cup (325 g) of potatoes. Add salt to taste.Truffle oil also goes well stirred through mashed potatoes."
        },
        {
          "headline":"Add white truffle oil to scrambled eggs or omelettes.",
          "description":"Eggs and truffles pair well together, so using truffle oil instead is an inexpensive way to get the same flavor. Make scrambled eggs or an omelette and use ⁄2  tsp (2.5 ml) of white truffle oil for every 3 eggs. Simply drizzle the truffle oil over the cooked eggs!Freshly chopped chives also go well with truffle oil and eggs."
        },
        {
          "headline":"Drizzle truffle oil over popcorn, French fries, or chips for a new flavor.",
          "description":"Upgrade your regular snacks to something exciting, luxurious, and new! Stir truffle oil and sea salt through freshly popped popcorn, cooked French fries, or your favorite chips. Use approximately 1 US tbsp (15 ml) of white truffle oil for every 4 cups (44 g) of popcorn, French fries, or chips.You can use microwave or kettle popcorn."
        }
      ]
    },
    {
      "name":"Infusing Sauces with Truffle Oil",
      "steps":[
        {
          "headline":"Make a truffle oil vinaigrette to use over salads.",
          "description":"In a medium bowl, place 2 US tbsp (30 ml) of white truffle oil, 1.5 US tbsp (22 ml) of extra virgin olive oil, 1 US tbsp (15 ml) of champagne wine vinegar, ⁄4  tsp (1.2 ml) of lemon juice, 1/2 tsp (2.84 g) of sea salt, and ground black pepper to taste. Mix the ingredients thoroughly with a whisk and drizzle the vinaigrette over a fresh, green salad. Store the vinaigrette in the refrigerator when it’s not in use.Enjoy the salad and vinaigrette dressing with cured meats, mushrooms, and cheeses."
        },
        {
          "headline":"Try truffle oil hummus for a luxurious appetizer.",
          "description":"Blend together 1 can (254 g) of chickpeas, 2 cloves of garlic, 2 US tbsp (36 g) of tahini, 1 US tbsp (15 ml) of lemon juice, 1.5 tsp (8.53 g) of salt, and ½ tsp (1.15 g) of pepper in a food processor. Blend the hummus until it’s smooth and then add 2 US tbsp (30 ml) of white truffle oil to the food processor. Blend the hummus again and then try it before adding any more truffle oil.Truffle hummus is great paired with baked pita chips, crackers, or vegetable sticks."
        },
        {
          "headline":"Make truffle oil aioli to pair with fries.",
          "description":"Place ½ cup (116 g) of mayonnaise, ½ cup (115 g) of sour cream, 1 US tbsp (15 ml) of white truffle oil, 1 grated clove of garlic, the zest of 1 lemon, and salt and pepper to taste in a large bowl. Whisk the ingredients together until they are smooth.Keep the aioli refrigerated until it’s ready to use."
        }
      ]
    },
    {
      "name":"Purchasing and Storing Truffle Oil",
      "steps":[
        {
          "headline":"Pick black truffle oil for an earthy, full flavor.",
          "description":"Black truffle oil is infused with black truffles and this tends to be more inexpensive than white truffle oil. Pick black truffle oil if you want a full, rich, and strong flavor."
        },
        {
          "headline":"Choose white truffle oil for a mild flavor.",
          "description":"White truffle oil is milder and more delicate than black truffle oil. It tends to be the more expensive option."
        },
        {
          "headline":"Buy truffle oil from gourmet food stores or online.",
          "description":"Truffle oil is a specialty food product that's unlikely to be sold in local grocery stores, so it will pay to look around at gourmet and natural food stores. It tends to be between $2.50 USD and $10.35 USD per ounce, however, a little goes a long way!Truffle oil is usually an infused olive or grapeseed oil. This is because oil from truffles doesn’t have a long shelf life. Most truffle oil is made with the flavor of truffles rather than actual truffles. Synthetic truffle oils will be labeled as “truffle essence” or “truffle aroma”, whereas natural oils will state “infused with truffles”. Both options have a good flavor!"
        },
        {
          "headline":"Store truffle oil in the refrigerator for 3-6 months.",
          "description":"Tightly seal the truffle oil after each use so it keeps for as long as possible. The oil may lose aroma over time.Discard the oil after 6 months or if it smells rancid."
        }
      ]
    }
  ],
  "text":" Adding Truffle Oil to Main Dishes Drizzle truffle oil over cooked meat fillets to create a rich, full flavor. Truffle oil pairs wonderfully with cuts of fish, beef, duck, and lamb. Lightly drizzle the truffle oil over fillet mignon, beef Wellington, pan-fried game meats, or turbot fillets. Approximately ⁄4  tsp (1.2 ml) of truffle oil per serving.You only need a tiny amount of truffle oil, as the flavor is very strong! Use white truffle oil for lighter meats like fish and black truffle oil for heavier, red meat dishes. Add white truffle oil to pasta dishes to create a rich, hearty flavor. Make your favorite pasta dish and simply stir through ⁄4–⁄2 US tbsp (3.7–7.4 ml) of truffle oil per serving when the dish is complete. Linguine, orzo, penne, and spaghetti dishes with either a tomato or cream-based sauce are ideal.Truffle oil works especially well with mushroom pasta dishes. Drizzle white truffle oil over mushroom pizza for a new twist. Truffle oil can give regular pizza a gourmet flavor! Make your favorite pizza with plenty of mushrooms and drizzle ⁄2 US tbsp (7.4 ml) of truffle oil over each 12 in (30 cm) pizza once its cooked.Truffle oil is especially good on pizzas with plenty of mozzarella. Using Truffle Oil in Side Dishes and Snacks Stir truffle oil through cooked vegetables, squash, and potatoes as a butter alternative. Truffle oil is a great way to upgrade a standard vegetable dish. Try roasting pumpkin, yams, carrots, asparagus, or parsnips until they are tender. Then add 1 US tbsp (15 ml) of white or black truffle oil to every 1 cup (176 g) of roasted vegetables.Truffle oil is also a good alternative to olive oil. Add black or white truffle oil to potatoes to transform a plain dish. Roast white, red, or sweet potatoes in the oven until they are tender. Instead of olive oil, drizzle 1 US tbsp (15 ml) of truffle oil over every 1 cup (325 g) of potatoes. Add salt to taste.Truffle oil also goes well stirred through mashed potatoes. Add white truffle oil to scrambled eggs or omelettes. Eggs and truffles pair well together, so using truffle oil instead is an inexpensive way to get the same flavor. Make scrambled eggs or an omelette and use ⁄2  tsp (2.5 ml) of white truffle oil for every 3 eggs. Simply drizzle the truffle oil over the cooked eggs!Freshly chopped chives also go well with truffle oil and eggs. Drizzle truffle oil over popcorn, French fries, or chips for a new flavor. Upgrade your regular snacks to something exciting, luxurious, and new! Stir truffle oil and sea salt through freshly popped popcorn, cooked French fries, or your favorite chips. Use approximately 1 US tbsp (15 ml) of white truffle oil for every 4 cups (44 g) of popcorn, French fries, or chips.You can use microwave or kettle popcorn. Infusing Sauces with Truffle Oil Make a truffle oil vinaigrette to use over salads. In a medium bowl, place 2 US tbsp (30 ml) of white truffle oil, 1.5 US tbsp (22 ml) of extra virgin olive oil, 1 US tbsp (15 ml) of champagne wine vinegar, ⁄4  tsp (1.2 ml) of lemon juice, 1/2 tsp (2.84 g) of sea salt, and ground black pepper to taste. Mix the ingredients thoroughly with a whisk and drizzle the vinaigrette over a fresh, green salad. Store the vinaigrette in the refrigerator when it’s not in use.Enjoy the salad and vinaigrette dressing with cured meats, mushrooms, and cheeses. Try truffle oil hummus for a luxurious appetizer. Blend together 1 can (254 g) of chickpeas, 2 cloves of garlic, 2 US tbsp (36 g) of tahini, 1 US tbsp (15 ml) of lemon juice, 1.5 tsp (8.53 g) of salt, and ½ tsp (1.15 g) of pepper in a food processor. Blend the hummus until it’s smooth and then add 2 US tbsp (30 ml) of white truffle oil to the food processor. Blend the hummus again and then try it before adding any more truffle oil.Truffle hummus is great paired with baked pita chips, crackers, or vegetable sticks. Make truffle oil aioli to pair with fries. Place ½ cup (116 g) of mayonnaise, ½ cup (115 g) of sour cream, 1 US tbsp (15 ml) of white truffle oil, 1 grated clove of garlic, the zest of 1 lemon, and salt and pepper to taste in a large bowl. Whisk the ingredients together until they are smooth.Keep the aioli refrigerated until it’s ready to use. Purchasing and Storing Truffle Oil Pick black truffle oil for an earthy, full flavor. Black truffle oil is infused with black truffles and this tends to be more inexpensive than white truffle oil. Pick black truffle oil if you want a full, rich, and strong flavor. Choose white truffle oil for a mild flavor. White truffle oil is milder and more delicate than black truffle oil. It tends to be the more expensive option. Buy truffle oil from gourmet food stores or online. Truffle oil is a specialty food product that's unlikely to be sold in local grocery stores, so it will pay to look around at gourmet and natural food stores. It tends to be between $2.50 USD and $10.35 USD per ounce, however, a little goes a long way!Truffle oil is usually an infused olive or grapeseed oil. This is because oil from truffles doesn’t have a long shelf life. Most truffle oil is made with the flavor of truffles rather than actual truffles. Synthetic truffle oils will be labeled as “truffle essence” or “truffle aroma”, whereas natural oils will state “infused with truffles”. Both options have a good flavor! Store truffle oil in the refrigerator for 3-6 months. Tightly seal the truffle oil after each use so it keeps for as long as possible. The oil may lose aroma over time.Discard the oil after 6 months or if it smells rancid.",
  "tyn_model":[
    "truffle oil",
    "white truffle oil",
    "potatoes",
    "eggs",
    "french fries",
    "oil",
    "mushrooms",
    "olive oil",
    "salt",
    "scrambled eggs",
    "sea salt",
    "popcorn",
    "lemon juice",
    "garlic",
    "food processor",
    "“truffle",
    "beef wellington",
    "turbot",
    "penne",
    "squash",
    "butter",
    "pumpkin",
    "yams",
    "carrots",
    "asparagus",
    "parsnips",
    "vegetables",
    "sweet potatoes",
    "oven",
    "extra virgin olive oil",
    "champagne wine vinegar",
    "ground black pepper",
    "whisk",
    "vinaigrette dressing",
    "cured meats",
    "truffle oil hummus",
    "chickpeas",
    "tahini",
    "pepper",
    "truffle hummus",
    "vegetable sticks",
    "mayonnaise",
    "sour cream",
    "lemon",
    "salt and pepper",
    "large bowl",
    "natural food stores",
    "grapeseed oil",
    "truffle oils",
    "” or",
    "”,",
    "“infused",
    "”."
  ],
  "tyn_section":[

  ]
}