{
  "title":"How to Season Zucchini",
  "url":"https://www.wikihow.com/Season-Zucchini",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Using Spices, Herbs, and Garlic",
      "steps":[
        {
          "headline":"Keep to the basics and season with salt and pepper.",
          "description":"For a quick and easy dish, seasoning zucchini with sea salt and freshly ground black pepper is a classic option. After tossing zucchini slices in olive oil and cooking, just sprinkle them with salt and pepper to your taste. Use 1 tablespoon (15 mL) olive oil for 2 medium zucchini."
        },
        {
          "headline":"Sprinkle your zucchini with a single spice before grilling.",
          "description":"You don’t need to overload your zucchini with dozens of ingredients to make a scrumptious dish. Using just one aromatic spice is enough. Cumin, for instance, compliments zucchini perfectly well on its own. To season with a single spice, you can drizzle 4 zucchini halves with 3 tablespoons (44 mL) of olive oil. Then sprinkle the oil-coated zucchini with salt, pepper, and the spice of your choice. If using ground cumin, ½ tablespoon (3.5 grams) should suffice. Score the surface of the zucchini halves before drizzling with olive oil to let the flavor really sink in."
        },
        {
          "headline":"Explode your taste buds with a spicy medley.",
          "description":"You can also shower your zucchini with as many spices as you’d like. For a spicy treat, combine ¼ teaspoon (0.6 grams) cumin powder, ¼ teaspoon (0.5 grams) coriander powder, ¼ teaspoon (0.6 grams) ground paprika, a pinch of cayenne pepper, ½ teaspoon (2.4 grams) salt, and 1/8 teaspoon (0.3 grams) black pepper in a bowl with 2 teaspoons (9.9 mL) olive oil and 2 finely chopped garlic cloves. Mix well and then add sliced zucchini rounds to the mixture. You can add other spices to this concoction, or substitute any of the spices listed above, according to your taste. Use 2 medium zucchini for the amounts listed above."
        },
        {
          "headline":"Douse your zucchini in a garlicky herb mixture.",
          "description":"For garlic lovers, combining garlic with a mixture of herbs is also a delicious option. Chop 2 tablespoons (3.4 grams) fresh rosemary and 2 tablespoons (7.4 grams) fresh parsley leaves, and place in a small bowl. Add 3 tablespoons (44 mL) olive oil, ¼ cup minced shallot (4 medium shallots), 2 minced garlic cloves, salt, and black pepper, and whisk the ingredients together. Drizzle your zucchini slices with 1 tablespoon (15 mL) olive oil and grill. Then finish by pouring your garlicky sauce on the grilled slices and serve. This recipe will make enough sauce to season 3 medium zucchini."
        }
      ]
    },
    {
      "name":"Adding Parmesan, Lemon, or Sriracha",
      "steps":[
        {
          "headline":"Grate Parmesan on your zucchini before baking.",
          "description":"Parmesan cheese is a popular companion to baked and roasted zucchini. For a garlicky and herbal flavor, mix ½ cup (47 grams) freshly grated Parmesan cheese, ½ teaspoon (0.7 grams) dried thyme, ½ teaspoon (0.6 grams) dried oregano, ½ teaspoon (0.6 grams) dried basil, ¼ teaspoon (0.8 grams) garlic powder, salt, and pepper in a small bowl. Drizzle 4 quartered zucchini with 2 tablespoons (30 mL) olive oil before sprinkling with your herb mixture."
        },
        {
          "headline":"Marinate your zucchini with lemon and garlic for grilling.",
          "description":"For a citrusy flavor, whisk 2 tablespoons (30 mL) olive oil, 1 tablespoon (15 mL) freshly squeezed lemon juice, 4 minced garlic cloves, ¾ teaspoon (3.5 grams sea salt), and ½ teaspoon (1.2 grams) freshly ground black pepper together in a small bowl. Slice two medium zucchini into rounds and add them to your lemon garlic mixture. Cover the bowl with saran wrap and let the zucchini marinate for at least 4 hours before grilling."
        },
        {
          "headline":"Flavor your zucchini with sriracha.",
          "description":"Melt 1 tablespoon (14.2 grams) of butter and mix with 2 tablespoons (30 mL) sriracha. Brush the sriracha and butter mix on thinly cut zucchini slices. Let the zucchini marinate in the sriracha and butter mix before grilling. 1 tablespoon (14.2 grams) butter and 2 tablespoons (30 mL) sriracha should be enough to season 2 zucchini."
        }
      ]
    },
    {
      "name":"Cooking Your Seasoned Zucchini",
      "steps":[
        {
          "headline":"Roast your zucchini to release its natural flavors.",
          "description":"After tossing your zucchini with the spice or herbal mixture of your choice, preheat your oven to 400 °F (204 °C). As the oven is heating up, place your seasoned zucchini slices on a lined baking sheet. When the oven is ready, place the baking sheet in the oven, and roast for 15-17 minutes, or until the edges of the zucchini start to brown."
        },
        {
          "headline":"Grill your zucchini for a rich, smoky flavor.",
          "description":"After covering your zucchini in an olive oil and spice mixture of your choice, preheat your grill on high. When the grill is hot, use your tongs to place the zucchini rounds on the grill. Cover the grill, and cook the zucchini rounds for 2 minutes on each side. You can increase the grilling time if you’d like your zucchini to be crispier."
        },
        {
          "headline":"Sauté your zucchini to make a savory dish.",
          "description":"Heat 4 tablespoons (59 mL) of olive oil in a large nonstick skillet on your stove at medium heat. Once the oil is hot, add the zucchini rounds and sauté until they become tender. Then add minced garlic and cook for another 1 minute. Turn off the stove. Stir in the seasoning sauce of your choice. Then add salt, pepper, and any other dry seasonings. Taste your zucchini. If needed, add additional spices according to your preference."
        }
      ]
    }
  ],
  "text":" Using Spices, Herbs, and Garlic Keep to the basics and season with salt and pepper. For a quick and easy dish, seasoning zucchini with sea salt and freshly ground black pepper is a classic option. After tossing zucchini slices in olive oil and cooking, just sprinkle them with salt and pepper to your taste. Use 1 tablespoon (15 mL) olive oil for 2 medium zucchini. Sprinkle your zucchini with a single spice before grilling. You don’t need to overload your zucchini with dozens of ingredients to make a scrumptious dish. Using just one aromatic spice is enough. Cumin, for instance, compliments zucchini perfectly well on its own. To season with a single spice, you can drizzle 4 zucchini halves with 3 tablespoons (44 mL) of olive oil. Then sprinkle the oil-coated zucchini with salt, pepper, and the spice of your choice. If using ground cumin, ½ tablespoon (3.5 grams) should suffice. Score the surface of the zucchini halves before drizzling with olive oil to let the flavor really sink in. Explode your taste buds with a spicy medley. You can also shower your zucchini with as many spices as you’d like. For a spicy treat, combine ¼ teaspoon (0.6 grams) cumin powder, ¼ teaspoon (0.5 grams) coriander powder, ¼ teaspoon (0.6 grams) ground paprika, a pinch of cayenne pepper, ½ teaspoon (2.4 grams) salt, and 1/8 teaspoon (0.3 grams) black pepper in a bowl with 2 teaspoons (9.9 mL) olive oil and 2 finely chopped garlic cloves. Mix well and then add sliced zucchini rounds to the mixture. You can add other spices to this concoction, or substitute any of the spices listed above, according to your taste. Use 2 medium zucchini for the amounts listed above. Douse your zucchini in a garlicky herb mixture. For garlic lovers, combining garlic with a mixture of herbs is also a delicious option. Chop 2 tablespoons (3.4 grams) fresh rosemary and 2 tablespoons (7.4 grams) fresh parsley leaves, and place in a small bowl. Add 3 tablespoons (44 mL) olive oil, ¼ cup minced shallot (4 medium shallots), 2 minced garlic cloves, salt, and black pepper, and whisk the ingredients together. Drizzle your zucchini slices with 1 tablespoon (15 mL) olive oil and grill. Then finish by pouring your garlicky sauce on the grilled slices and serve. This recipe will make enough sauce to season 3 medium zucchini. Adding Parmesan, Lemon, or Sriracha Grate Parmesan on your zucchini before baking. Parmesan cheese is a popular companion to baked and roasted zucchini. For a garlicky and herbal flavor, mix ½ cup (47 grams) freshly grated Parmesan cheese, ½ teaspoon (0.7 grams) dried thyme, ½ teaspoon (0.6 grams) dried oregano, ½ teaspoon (0.6 grams) dried basil, ¼ teaspoon (0.8 grams) garlic powder, salt, and pepper in a small bowl. Drizzle 4 quartered zucchini with 2 tablespoons (30 mL) olive oil before sprinkling with your herb mixture. Marinate your zucchini with lemon and garlic for grilling. For a citrusy flavor, whisk 2 tablespoons (30 mL) olive oil, 1 tablespoon (15 mL) freshly squeezed lemon juice, 4 minced garlic cloves, ¾ teaspoon (3.5 grams sea salt), and ½ teaspoon (1.2 grams) freshly ground black pepper together in a small bowl. Slice two medium zucchini into rounds and add them to your lemon garlic mixture. Cover the bowl with saran wrap and let the zucchini marinate for at least 4 hours before grilling. Flavor your zucchini with sriracha. Melt 1 tablespoon (14.2 grams) of butter and mix with 2 tablespoons (30 mL) sriracha. Brush the sriracha and butter mix on thinly cut zucchini slices. Let the zucchini marinate in the sriracha and butter mix before grilling. 1 tablespoon (14.2 grams) butter and 2 tablespoons (30 mL) sriracha should be enough to season 2 zucchini. Cooking Your Seasoned Zucchini Roast your zucchini to release its natural flavors. After tossing your zucchini with the spice or herbal mixture of your choice, preheat your oven to 400 °F (204 °C). As the oven is heating up, place your seasoned zucchini slices on a lined baking sheet. When the oven is ready, place the baking sheet in the oven, and roast for 15-17 minutes, or until the edges of the zucchini start to brown. Grill your zucchini for a rich, smoky flavor. After covering your zucchini in an olive oil and spice mixture of your choice, preheat your grill on high. When the grill is hot, use your tongs to place the zucchini rounds on the grill. Cover the grill, and cook the zucchini rounds for 2 minutes on each side. You can increase the grilling time if you’d like your zucchini to be crispier. Sauté your zucchini to make a savory dish. Heat 4 tablespoons (59 mL) of olive oil in a large nonstick skillet on your stove at medium heat. Once the oil is hot, add the zucchini rounds and sauté until they become tender. Then add minced garlic and cook for another 1 minute. Turn off the stove. Stir in the seasoning sauce of your choice. Then add salt, pepper, and any other dry seasonings. Taste your zucchini. If needed, add additional spices according to your preference.",
  "tyn_model":[
    "zucchini",
    "olive oil",
    "garlic",
    "salt",
    "sriracha",
    "butter",
    "oven",
    "grill",
    "pepper",
    "small bowl",
    "salt and pepper",
    "sea salt",
    "freshly ground black pepper",
    "cumin",
    "spices",
    "black pepper",
    "parmesan",
    "parmesan cheese",
    "baking sheet",
    "stove",
    "cumin powder",
    "coriander",
    "ground paprika",
    "cayenne pepper",
    "bowl",
    "herbs",
    "rosemary",
    "parsley",
    "shallot",
    "dried thyme",
    "dried oregano",
    "dried basil",
    "garlic powder",
    "lemon",
    "freshly squeezed lemon juice",
    "lemon garlic",
    "saran wrap",
    "large nonstick skillet",
    "oil",
    "seasoning sauce"
  ],
  "tyn_section":[

  ]
}