{
  "title":"How to Thin Paint",
  "url":"https://www.wikihow.com/Thin-Paint",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "parts":[
    {
      "name":"Thinning Latex Paint",
      "steps":[
        {
          "headline":"Pour the paint into a large container.",
          "description":"Remove and discard any dried paint chunks. If you have a large painting project, a 5-gallon bucket (19 l) is a good choice since you will eliminate the need for multiple mixing sessions."
        },
        {
          "headline":"Add water to the paint.",
          "description":"The general rule is to add 1/2 cup (118 ml) of water for each gallon (3.7 l) of paint you use. Never add all the water at one time. Gradually mix it in at a slow pace while you stir. You can also revive old, dried out paint by adding the same ratio of water and gradually mixing."
        },
        {
          "headline":"Mix the paint and water by stirring.",
          "description":"Stir thoroughly and continuously while keeping an eye on how the paint texture changes. Periodically remove the stick from the can to observe the consistency of the paint. Keep stirring until the paint reaches a creamy texture."
        },
        {
          "headline":"Conduct a funnel test.",
          "description":"To check the paint’s viscosity, hold a funnel over the paint bucket and run some paint through it using a ladle or spoon. This is an important step if you are going to use a paint sprayer for your project. The paint should flow through the funnel freely and without clogging or backing up. If the funnel becomes clogged, the paint is not ready to be used and needs additional thinning. Continue gradually stirring and adding small amounts of water to the paint until it passes the funnel test."
        }
      ]
    },
    {
      "name":"Thinning Oil Paint",
      "steps":[
        {
          "headline":"Put on gloves.",
          "description":"Gloves are necessary to protect your hands from staining. Choose a pair of gloves that can be dedicated exclusively to paint purposes because the paint will not wash out. Thinning oil paint requires a few additional steps that differ from the thinning process for latex paint. Oil paint will permanently stain nearly any surface it comes in contact with so take care to not spill any while you are working."
        },
        {
          "headline":"Pour oil paint into a large container.",
          "description":"It’s important to use a container dedicated to this purpose since stains are irreversible. Discard of any dried pieces you see. For big projects, using a large container will help reduce the number of times you will need to repeat the thinning process."
        },
        {
          "headline":"Add one part turpentine for every three parts of paint you use.",
          "description":"A “part” refers to the specific unit of measurement you are using during this process. It can be in gallons, milliliters, liters, or ounces. Don’t worry if you are unsure how to correctly measure in parts. You can always check the measurements of your mixing container and adjust your other measurements accordingly."
        },
        {
          "headline":"Stir the paint.",
          "description":"Use a stick that will never be used for anything else and mix for several minutes. Monitor the consistency as you stir and stop when the paint appears to have a creamy texture. There may be some trial and error during the mixing phase. Slowly add additional thinner to the paint if you feel it is not the texture how you would prefer."
        }
      ]
    },
    {
      "name":"Testing if Your Paint is Ready for Use",
      "steps":[
        {
          "headline":"Brush a thin layer paint onto a test surface.",
          "description":"A wooden panel or piece of drywall are good testing materials to determine if your paint is ready for your project. Allow the paint to dry completely and then add a second coat. Once the second coat has dried, notice how the paint looks. The goal is for the paint to have a dry, smooth texture on the test surface."
        },
        {
          "headline":"Add more water or a thinning agent if desired.",
          "description":"If your paint still hasn’t reached the right consistency, try stirring in small amounts of water or turpentine depending on the type of paint you are using. Carefully monitor the texture while you are mixing so your paint doesn’t become oversaturated. A paint thinning product for latex paint can also be purchased at a hardware store if you are unable to achieve your desired results using water."
        },
        {
          "headline":"Begin work on your painting project.",
          "description":"Depending on your project’s needs, chose either a paint sprayer, brush, or roller to apply the paint to your intended surface. Check the quality of the paint between coats and re-mix materials as often as needed."
        }
      ]
    },
    {
      "name":"Judging if Your Paint is too Thick",
      "steps":[
        {
          "headline":"Choose the right workspace.",
          "description":"Working in a well-ventilated room will make a noticeable difference during the paint thinning process. Latex paint produces potent fumes that can be dangerous if over inhaled. Your work area should include windows or vents if working indoors. Outdoor workspaces are usually your best option to avoid fume irritation."
        },
        {
          "headline":"Determine the type of paint you are using.",
          "description":"Household paint generally comes in latex or oil-based options. Depending on which type you use, the steps for thinning will be different. Latex paint is water based and is typically easier to mix. Oil-based paint requires specific mixing agents that are not usually found around the house. Check the label on the can to confirm what kind of paint you have."
        },
        {
          "headline":"Open your can of paint.",
          "description":"If you don’t have a paint can opener tool, a standard flat head screwdriver is a good substitute. Insert the head of the screwdriver between the lid and rim at the top of the can, and gently lever the handle in a downward direction. Turn the can in a clockwise direction to loosen the seal and drive the can open. Avoid prying the entire lid off at one time so it can be preserved to seal the can again after use."
        },
        {
          "headline":"Stir the paint thoroughly.",
          "description":"Using a paint stirrer or stick, stir for 5 to 10-minutes. Use full and deep rotations so the paint molecules are properly combined. Your goal with stirring is to combine the heavier molecules that settle at the bottom of the can with the lighter molecules at the top."
        },
        {
          "headline":"Observe the thickness of the paint.",
          "description":"Lift the stirrer from the can and allow the paint to drip over a paint tray. Notice the paint as it drips off the stirrer. It should have an even flow as it falls and a consistency that resembles heavy cream. If you notice it falls off the stick in globs then it will need thinning before use."
        }
      ]
    }
  ],
  "text":" Thinning Latex Paint Pour the paint into a large container. Remove and discard any dried paint chunks. If you have a large painting project, a 5-gallon bucket (19 l) is a good choice since you will eliminate the need for multiple mixing sessions. Add water to the paint. The general rule is to add 1/2 cup (118 ml) of water for each gallon (3.7 l) of paint you use. Never add all the water at one time. Gradually mix it in at a slow pace while you stir. You can also revive old, dried out paint by adding the same ratio of water and gradually mixing. Mix the paint and water by stirring. Stir thoroughly and continuously while keeping an eye on how the paint texture changes. Periodically remove the stick from the can to observe the consistency of the paint. Keep stirring until the paint reaches a creamy texture. Conduct a funnel test. To check the paint’s viscosity, hold a funnel over the paint bucket and run some paint through it using a ladle or spoon. This is an important step if you are going to use a paint sprayer for your project. The paint should flow through the funnel freely and without clogging or backing up. If the funnel becomes clogged, the paint is not ready to be used and needs additional thinning. Continue gradually stirring and adding small amounts of water to the paint until it passes the funnel test. Thinning Oil Paint Put on gloves. Gloves are necessary to protect your hands from staining. Choose a pair of gloves that can be dedicated exclusively to paint purposes because the paint will not wash out. Thinning oil paint requires a few additional steps that differ from the thinning process for latex paint. Oil paint will permanently stain nearly any surface it comes in contact with so take care to not spill any while you are working. Pour oil paint into a large container. It’s important to use a container dedicated to this purpose since stains are irreversible. Discard of any dried pieces you see. For big projects, using a large container will help reduce the number of times you will need to repeat the thinning process. Add one part turpentine for every three parts of paint you use. A “part” refers to the specific unit of measurement you are using during this process. It can be in gallons, milliliters, liters, or ounces. Don’t worry if you are unsure how to correctly measure in parts. You can always check the measurements of your mixing container and adjust your other measurements accordingly. Stir the paint. Use a stick that will never be used for anything else and mix for several minutes. Monitor the consistency as you stir and stop when the paint appears to have a creamy texture. There may be some trial and error during the mixing phase. Slowly add additional thinner to the paint if you feel it is not the texture how you would prefer. Testing if Your Paint is Ready for Use Brush a thin layer paint onto a test surface. A wooden panel or piece of drywall are good testing materials to determine if your paint is ready for your project. Allow the paint to dry completely and then add a second coat. Once the second coat has dried, notice how the paint looks. The goal is for the paint to have a dry, smooth texture on the test surface. Add more water or a thinning agent if desired. If your paint still hasn’t reached the right consistency, try stirring in small amounts of water or turpentine depending on the type of paint you are using. Carefully monitor the texture while you are mixing so your paint doesn’t become oversaturated. A paint thinning product for latex paint can also be purchased at a hardware store if you are unable to achieve your desired results using water. Begin work on your painting project. Depending on your project’s needs, chose either a paint sprayer, brush, or roller to apply the paint to your intended surface. Check the quality of the paint between coats and re-mix materials as often as needed. Judging if Your Paint is too Thick Choose the right workspace. Working in a well-ventilated room will make a noticeable difference during the paint thinning process. Latex paint produces potent fumes that can be dangerous if over inhaled. Your work area should include windows or vents if working indoors. Outdoor workspaces are usually your best option to avoid fume irritation. Determine the type of paint you are using. Household paint generally comes in latex or oil-based options. Depending on which type you use, the steps for thinning will be different. Latex paint is water based and is typically easier to mix. Oil-based paint requires specific mixing agents that are not usually found around the house. Check the label on the can to confirm what kind of paint you have. Open your can of paint. If you don’t have a paint can opener tool, a standard flat head screwdriver is a good substitute. Insert the head of the screwdriver between the lid and rim at the top of the can, and gently lever the handle in a downward direction. Turn the can in a clockwise direction to loosen the seal and drive the can open. Avoid prying the entire lid off at one time so it can be preserved to seal the can again after use. Stir the paint thoroughly. Using a paint stirrer or stick, stir for 5 to 10-minutes. Use full and deep rotations so the paint molecules are properly combined. Your goal with stirring is to combine the heavier molecules that settle at the bottom of the can with the lighter molecules at the top. Observe the thickness of the paint. Lift the stirrer from the can and allow the paint to drip over a paint tray. Notice the paint as it drips off the stirrer. It should have an even flow as it falls and a consistency that resembles heavy cream. If you notice it falls off the stick in globs then it will need thinning before use.",
  "tyn_model":[
    "paint",
    "water",
    "oil paint",
    "funnel",
    "paint sprayer",
    "turpentine",
    "latex paint",
    "stirrer",
    "thinning latex paint",
    "5-gallon bucket",
    "paint bucket",
    "ladle",
    "spoon",
    "gloves",
    "“part",
    "” refers",
    "mixing container",
    "thinner",
    "paint thinning product",
    "roller",
    "paint can opener",
    "flat head screwdriver",
    "screwdriver",
    "paint stirrer",
    "paint tray",
    "heavy cream"
  ],
  "tyn_section":[

  ]
}