{
  "title":"How to Teach Someone to Jump Rope",
  "url":"https://www.wikihow.com/Teach-Someone-to-Jump-Rope",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games"
  ],
  "parts":[
    {
      "name":"Selecting the Right Rope",
      "steps":[
        {
          "headline":"Ask your student to hold each rope handle in both hands.",
          "description":"They can rest their arms at their sides as they normally would. Start by offering a few different sizes for them to try. They may need to experiment at first to find the right fit."
        },
        {
          "headline":"Instruct them to place both feet in the center of the rope.",
          "description":"Make sure they hold on to both of the handles. Both hands can remain at their sides. Double check to ensure the rope hasn’t bunched up under their feet."
        },
        {
          "headline":"Tell them they are ready to lift both handles toward their shoulders.",
          "description":"Ensure they keep both feet on the ground. The handles should reach slightly below their shoulders to ensure they are using the correct size. If all the available ropes are all too long, they can tie a small knot above each handle to shorten it to the desired length."
        }
      ]
    },
    {
      "name":"Teaching the Basics",
      "steps":[
        {
          "headline":"Tape out an “X” on the floor to help keep your student focused.",
          "description":"This helps with staying grounded and improves coordination. The “X” is generally only needed for a short period of time before your student is able to keep balanced without additional help."
        },
        {
          "headline":"Teach them to jump to music.",
          "description":"Music helps keep students in rhythm and aids in gaining a sense of timing. Have them jump with both feet together and in time with the music. It can occasionally be helpful for new jumpers to have a few practice rounds without a rope just to get a hang of the movement. Select a variety of music styles to challenge your student and encourage improvement"
        },
        {
          "headline":"Share and create jumping games.",
          "description":"Games can be a great tool to teach students to jump keeping both feet together. Fun options can include mimicking animal movements or engaging in timed jumping relays. You and your student can create games together that assist in strengthening their jumping abilities."
        },
        {
          "headline":"Encourage skip walking with the rope.",
          "description":"Point out the natural pattern of your student’s arm and feet movements. Gradually incorporate the need for them to move their arms over their heads before stepping over the rope. Keeping with your students personal pace, encourage them to alternate between skip walking and another one of their favorite basic techniques."
        }
      ]
    },
    {
      "name":"Moving to Advanced Techniques",
      "steps":[
        {
          "headline":"Guide your student to mastering the single bounce skill.",
          "description":"Keeping both feet together, start out having them jump in time to the beat of a song. Adjust their speed according to their development."
        },
        {
          "headline":"Incorporate the double bounce into their training.",
          "description":"Building on the skills of the single bounce, have them layer in an additional rebound bounce after a single jump. Music can be added once your student is comfortable. For advanced students, create exercises that alternate quickly between a series of single and double bounces."
        },
        {
          "headline":"Add the bell jump.",
          "description":"This is a good option for keeping in time and developing balance. Give your student a 1-2/1-2 count and have them jump backwards and forwards with the rope. Have them start at a slow pace and gradually increase the speed. Bell jumps are great exercises for jump rope rhymes. Try saying a classic rhyme or creating a new one with your student."
        },
        {
          "headline":"Teach the skier jump technique to increase endurance.",
          "description":"This consists of jumping side to side in quick succession. It may help your student if you put down a marked line for them to use guide. Games can be created around the skier jump and rhymes can be used to help students keep in time."
        },
        {
          "headline":"Challenge your student with face-to-face exercises.",
          "description":"Once they’ve gotten the hang of the basics and are comfortable with more advance jumps, it’s time to add partnered jumps. This helps build trust and strengthen communication skills. Face-to-face exercises work best with jumpers of similar heights."
        }
      ]
    },
    {
      "name":"Jumping Rope for Good Health",
      "steps":[
        {
          "headline":"Spend 5 to ten-minutes a day jumping without interruption.",
          "description":"Depending on your student’s health goals, jumping offers a great cardio workout with the added benefit of building upper body strength. Studies also show that engaging in a daily jumping routine is a great substitute for those unable to run or jog."
        },
        {
          "headline":"Use a jump rope as part of a warm-up routine.",
          "description":"A slow paced warm-up to music is a great way to prepare for the gym, track, or other fitness activity. Consider adding it to a list of recommendations for health conscious jump rope students. Mix-up the warm-up with alternating jumping exercises including the skier, bell, and single bounce jumps."
        },
        {
          "headline":"Strengthen bone density with low impact jumps.",
          "description":"Doing ten easy jumps a few times a week is shown to improve bone density in the legs and lower portions of the spine. For students learning to jump for health reasons, this technique can be taught as an added bonus to the material you are already covering."
        }
      ]
    }
  ],
  "text":" Selecting the Right Rope Ask your student to hold each rope handle in both hands. They can rest their arms at their sides as they normally would. Start by offering a few different sizes for them to try. They may need to experiment at first to find the right fit. Instruct them to place both feet in the center of the rope. Make sure they hold on to both of the handles. Both hands can remain at their sides. Double check to ensure the rope hasn’t bunched up under their feet. Tell them they are ready to lift both handles toward their shoulders. Ensure they keep both feet on the ground. The handles should reach slightly below their shoulders to ensure they are using the correct size. If all the available ropes are all too long, they can tie a small knot above each handle to shorten it to the desired length. Teaching the Basics Tape out an “X” on the floor to help keep your student focused. This helps with staying grounded and improves coordination. The “X” is generally only needed for a short period of time before your student is able to keep balanced without additional help. Teach them to jump to music. Music helps keep students in rhythm and aids in gaining a sense of timing. Have them jump with both feet together and in time with the music. It can occasionally be helpful for new jumpers to have a few practice rounds without a rope just to get a hang of the movement. Select a variety of music styles to challenge your student and encourage improvement Share and create jumping games. Games can be a great tool to teach students to jump keeping both feet together. Fun options can include mimicking animal movements or engaging in timed jumping relays. You and your student can create games together that assist in strengthening their jumping abilities. Encourage skip walking with the rope. Point out the natural pattern of your student’s arm and feet movements. Gradually incorporate the need for them to move their arms over their heads before stepping over the rope. Keeping with your students personal pace, encourage them to alternate between skip walking and another one of their favorite basic techniques. Moving to Advanced Techniques Guide your student to mastering the single bounce skill. Keeping both feet together, start out having them jump in time to the beat of a song. Adjust their speed according to their development. Incorporate the double bounce into their training. Building on the skills of the single bounce, have them layer in an additional rebound bounce after a single jump. Music can be added once your student is comfortable. For advanced students, create exercises that alternate quickly between a series of single and double bounces. Add the bell jump. This is a good option for keeping in time and developing balance. Give your student a 1-2/1-2 count and have them jump backwards and forwards with the rope. Have them start at a slow pace and gradually increase the speed. Bell jumps are great exercises for jump rope rhymes. Try saying a classic rhyme or creating a new one with your student. Teach the skier jump technique to increase endurance. This consists of jumping side to side in quick succession. It may help your student if you put down a marked line for them to use guide. Games can be created around the skier jump and rhymes can be used to help students keep in time. Challenge your student with face-to-face exercises. Once they’ve gotten the hang of the basics and are comfortable with more advance jumps, it’s time to add partnered jumps. This helps build trust and strengthen communication skills. Face-to-face exercises work best with jumpers of similar heights. Jumping Rope for Good Health Spend 5 to ten-minutes a day jumping without interruption. Depending on your student’s health goals, jumping offers a great cardio workout with the added benefit of building upper body strength. Studies also show that engaging in a daily jumping routine is a great substitute for those unable to run or jog. Use a jump rope as part of a warm-up routine. A slow paced warm-up to music is a great way to prepare for the gym, track, or other fitness activity. Consider adding it to a list of recommendations for health conscious jump rope students. Mix-up the warm-up with alternating jumping exercises including the skier, bell, and single bounce jumps. Strengthen bone density with low impact jumps. Doing ten easy jumps a few times a week is shown to improve bone density in the legs and lower portions of the spine. For students learning to jump for health reasons, this technique can be taught as an added bonus to the material you are already covering.",
  "tyn_model":[
    "rope",
    "jump rope",
    "“x",
    "music",
    "ropes",
    "” on",
    "” is",
    "jumping games",
    "skip walking",
    "jumpers",
    "jumping"
  ],
  "tyn_section":[

  ]
}