{
  "title":"How to Have a Mii Race on Your Wii",
  "url":"https://www.wikihow.com/Have-a-Mii-Race-on-Your-Wii",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo Miis"
  ],
  "methods":[
    {
      "name":"Racing on the Mii Plaza",
      "steps":[
        {
          "headline":"From the Wii Menu, select the Mii channel.",
          "description":""
        },
        {
          "headline":"Ensure you have at least two Miis.",
          "description":"If you do not have enough, create some by clicking one of the tabs on the left hand side."
        },
        {
          "headline":"Select the whistle to arrange your Miis.",
          "description":""
        },
        {
          "headline":"Grab a Mii by scrolling over it, and pressing the A and B buttons at the same time.",
          "description":""
        },
        {
          "headline":"Put your Mii in a corner or in the side of the Mii Plaza.",
          "description":""
        },
        {
          "headline":"Repeat the above 2 steps until all of your Miis are in the same corner or side of the Mii Plaza.",
          "description":""
        },
        {
          "headline":"Select any of the arrange patterns, and watch your Miis run!",
          "description":""
        }
      ]
    },
    {
      "name":"Racing in Mario Kart",
      "steps":[
        {
          "headline":"Power on a copy of Mario Kart Wii.",
          "description":""
        },
        {
          "headline":"Beat Special Cup on 100cc.",
          "description":"This will unlock the Mii as a playable character!"
        },
        {
          "headline":"Go into a multiplayer mode of your choice.",
          "description":"All players select the Mii."
        },
        {
          "headline":"Now your Miis can race, but this time in motor vehicles!",
          "description":""
        }
      ]
    }
  ],
  "text":" Racing on the Mii Plaza From the Wii Menu, select the Mii channel.  Ensure you have at least two Miis. If you do not have enough, create some by clicking one of the tabs on the left hand side. Select the whistle to arrange your Miis.  Grab a Mii by scrolling over it, and pressing the A and B buttons at the same time.  Put your Mii in a corner or in the side of the Mii Plaza.  Repeat the above 2 steps until all of your Miis are in the same corner or side of the Mii Plaza.  Select any of the arrange patterns, and watch your Miis run!  Racing in Mario Kart Power on a copy of Mario Kart Wii.  Beat Special Cup on 100cc. This will unlock the Mii as a playable character! Go into a multiplayer mode of your choice. All players select the Mii. Now your Miis can race, but this time in motor vehicles! ",
  "tyn_model":[
    "wii menu",
    "whistle",
    "mii",
    "mario kart power",
    "mario kart wii"
  ],
  "tyn_section":[

  ]
}