{
  "title":"How to Cite Video Games",
  "url":"https://www.wikihow.com/Cite-Video-Games",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "methods":[
    {
      "name":"MLA",
      "steps":[
        {
          "headline":"Start your Works Cited entry with the title of the game.",
          "description":"Type the title of the game in italics, exactly as it appears on the game's title screen. Use numerals wherever the game does, without spelling out the word for the number. Place a period after the title of the game. Example: Fortnite."
        },
        {
          "headline":"Include the version and platform.",
          "description":"When citing a video game, the version of the game and the platform you played it on are typically the most important information. This allows your readers to access the same game that you did, even though they'd have to play it themselves to retrieve the content you're talking about. Add the year the game came out. Separate the version, platform, and year with commas. Place a period after the year. Example: Fortnite. Battle Royale Mode, PS4 Pro, 2017."
        },
        {
          "headline":"Close with any additional information.",
          "description":"At the end of your citation, add any information that is relevant to the reasons you're citing the game. This might include designers, voice actors, or other people involved with producing the game. For example, if you discussed the score of the game \"Fortnite\" in your paper, you might add the name of the score's composer to your Works Cited entry: Fortnite. Battle Royale Mode, PS4 Pro, 2018. Toprak, Pinar, composer. MLA Works Cited Format:\nTitle of Game. Version, Platform, Year of Release. Additional Information as Necessary."
        },
        {
          "headline":"Use in-text citations to refer readers to specific parts of the game.",
          "description":"In-text parenthetical citations normally aren't required when you're discussing the content of a video game in your paper. Your readers already know what game you're talking about, and there aren't pages or timestamps you can use. However, you can use in-text citations if you need to point your readers to a particular level or part of the game. For example, you might write \"Although originally Fortnite players only got bragging rights for reaching the maximum level, Epic Games eventually started providing additional rewards (season 6).\""
        }
      ]
    },
    {
      "name":"APA",
      "steps":[
        {
          "headline":"List the title of the game and a description.",
          "description":"Using regular font, type the title of the game as it appears on the game's title screen, using the same capitalization, symbols, or numbers. Type a space after the end of the title, then add the words \"Video game\" in square brackets. Place a period on the outside of the closing brackets. Example: God of War [Video game]."
        },
        {
          "headline":"Provide the year the game was released.",
          "description":"The year the game was released may be on the game's title screen, or you can look it up online. Put the year in parentheses, placing a period outside the closing parentheses. Example: God of War [Video game]. (2018)."
        },
        {
          "headline":"Include the name and location of the publisher.",
          "description":"For a video game, the publisher is the production company. Their name and the location of their headquarters may be displayed on the game's title page, or you can look it up on the production company's website. Type the location (city and state for US locations, city and country for all others), then a colon, then the name of the production company. Place a period after the production company's name. Example: God of War [Video game]. (2018). San Mateo, CA: Sony Interactive Entertainment. APA Reference List Format:\nTitle of Game [Video game]. (Year Released). Location: Publisher."
        },
        {
          "headline":"Use the version number for in-text citations.",
          "description":"Video games, like other computer software, is often frequently updated. Your standard in-text citation would include the title of the game and the year it came out. However, you may have some or all of this information in the body of your paper. Add the version number (if available) to let your readers know the specific iteration of the game you were playing. If the game is available on multiple platforms, you might also want to include the platform you played the game on in your in-text parenthetical citation."
        }
      ]
    },
    {
      "name":"Chicago",
      "steps":[
        {
          "headline":"Start your citation with the production company.",
          "description":"A basic multimedia bibliographic entry in Chicago Style would start with the name of the author. For video games, the production company is considered the author of the work. Type a period at the end of the production company's name. Example: Rovio Entertainment."
        },
        {
          "headline":"Provide the title of the game and version number.",
          "description":"Type the title of the game in italics, followed by a period. If you played a particular version of the game, include that number in regular font after the game title. If there is no specific version number, simply move on to the next element. Example: Rovio Entertainment. Angry Birds Transformers. V. 1.4.25."
        },
        {
          "headline":"Include the platform and publication information.",
          "description":"Type the name of the production company again as the publisher of the game, followed by a comma. Then add the year that the game was released. Type a period, then type the platform on which you played the game. Example: Rovio Entertainment. Angry Birds Transformers. V. 1.4.25. Rovio Entertainment, 2014. Android 4.0 or later."
        },
        {
          "headline":"Close with any other information that may be important.",
          "description":"If there is anything about the game that is relevant to your reasons for citing it, you should include that information in both your bibliographic entry and your footnote. This may include names of directors, voice actors, composers, designers, or other people who worked on the game. Example: Rovio Entertainment. Angry Birds Transformers. V. 1.4.25. Rovio Entertainment, 2014. Android 4.0 or later. Soundtrack by Vince DiCola and Kenny Meriedeth. Chicago Style Bibliography Format:\nProduction Company. Title of Game. Version #. Production Company, Release Year. Platform. Other Information."
        },
        {
          "headline":"Separate elements with commas instead of periods in footnotes.",
          "description":"Place a superscripted number at the end of any sentence where you reference the game, outside the closing punctuation. Include the same information in your footnote as you did in your bibliographic entry. However, instead of separating elements with periods, you'll use commas. The only period in your footnote should be at the very end. Example: Rovio Entertainment, Angry Birds Transformers, v. 1.4.25, Rovio Entertainment, 2014, Android 4.0 or later, soundtrack by Vince DiCola and Kenny Meriedeth."
        }
      ]
    }
  ],
  "text":" MLA Start your Works Cited entry with the title of the game. Type the title of the game in italics, exactly as it appears on the game's title screen. Use numerals wherever the game does, without spelling out the word for the number. Place a period after the title of the game. Example: Fortnite. Include the version and platform. When citing a video game, the version of the game and the platform you played it on are typically the most important information. This allows your readers to access the same game that you did, even though they'd have to play it themselves to retrieve the content you're talking about. Add the year the game came out. Separate the version, platform, and year with commas. Place a period after the year. Example: Fortnite. Battle Royale Mode, PS4 Pro, 2017. Close with any additional information. At the end of your citation, add any information that is relevant to the reasons you're citing the game. This might include designers, voice actors, or other people involved with producing the game. For example, if you discussed the score of the game \"Fortnite\" in your paper, you might add the name of the score's composer to your Works Cited entry: Fortnite. Battle Royale Mode, PS4 Pro, 2018. Toprak, Pinar, composer. MLA Works Cited Format:\nTitle of Game. Version, Platform, Year of Release. Additional Information as Necessary. Use in-text citations to refer readers to specific parts of the game. In-text parenthetical citations normally aren't required when you're discussing the content of a video game in your paper. Your readers already know what game you're talking about, and there aren't pages or timestamps you can use. However, you can use in-text citations if you need to point your readers to a particular level or part of the game. For example, you might write \"Although originally Fortnite players only got bragging rights for reaching the maximum level, Epic Games eventually started providing additional rewards (season 6).\" APA List the title of the game and a description. Using regular font, type the title of the game as it appears on the game's title screen, using the same capitalization, symbols, or numbers. Type a space after the end of the title, then add the words \"Video game\" in square brackets. Place a period on the outside of the closing brackets. Example: God of War [Video game]. Provide the year the game was released. The year the game was released may be on the game's title screen, or you can look it up online. Put the year in parentheses, placing a period outside the closing parentheses. Example: God of War [Video game]. (2018). Include the name and location of the publisher. For a video game, the publisher is the production company. Their name and the location of their headquarters may be displayed on the game's title page, or you can look it up on the production company's website. Type the location (city and state for US locations, city and country for all others), then a colon, then the name of the production company. Place a period after the production company's name. Example: God of War [Video game]. (2018). San Mateo, CA: Sony Interactive Entertainment. APA Reference List Format:\nTitle of Game [Video game]. (Year Released). Location: Publisher. Use the version number for in-text citations. Video games, like other computer software, is often frequently updated. Your standard in-text citation would include the title of the game and the year it came out. However, you may have some or all of this information in the body of your paper. Add the version number (if available) to let your readers know the specific iteration of the game you were playing. If the game is available on multiple platforms, you might also want to include the platform you played the game on in your in-text parenthetical citation. Chicago Start your citation with the production company. A basic multimedia bibliographic entry in Chicago Style would start with the name of the author. For video games, the production company is considered the author of the work. Type a period at the end of the production company's name. Example: Rovio Entertainment. Provide the title of the game and version number. Type the title of the game in italics, followed by a period. If you played a particular version of the game, include that number in regular font after the game title. If there is no specific version number, simply move on to the next element. Example: Rovio Entertainment. Angry Birds Transformers. V. 1.4.25. Include the platform and publication information. Type the name of the production company again as the publisher of the game, followed by a comma. Then add the year that the game was released. Type a period, then type the platform on which you played the game. Example: Rovio Entertainment. Angry Birds Transformers. V. 1.4.25. Rovio Entertainment, 2014. Android 4.0 or later. Close with any other information that may be important. If there is anything about the game that is relevant to your reasons for citing it, you should include that information in both your bibliographic entry and your footnote. This may include names of directors, voice actors, composers, designers, or other people who worked on the game. Example: Rovio Entertainment. Angry Birds Transformers. V. 1.4.25. Rovio Entertainment, 2014. Android 4.0 or later. Soundtrack by Vince DiCola and Kenny Meriedeth. Chicago Style Bibliography Format:\nProduction Company. Title of Game. Version #. Production Company, Release Year. Platform. Other Information. Separate elements with commas instead of periods in footnotes. Place a superscripted number at the end of any sentence where you reference the game, outside the closing punctuation. Include the same information in your footnote as you did in your bibliographic entry. However, instead of separating elements with periods, you'll use commas. The only period in your footnote should be at the very end. Example: Rovio Entertainment, Angry Birds Transformers, v. 1.4.25, Rovio Entertainment, 2014, Android 4.0 or later, soundtrack by Vince DiCola and Kenny Meriedeth.",
  "tyn_model":[
    "angry birds",
    "fortnite.",
    "video game",
    "fortnite players",
    "epic games eventually",
    "regular font",
    "angry birds transformers"
  ],
  "tyn_section":[

  ]
}