{
  "title":"How to Clean Plant Leaves",
  "url":"https://www.wikihow.com/Clean-Plant-Leaves",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Indoor and Patio Plants"
  ],
  "methods":[
    {
      "name":"Removing Dust and Grime",
      "steps":[
        {
          "headline":"Wipe large, shiny leaves with a damp cloth.",
          "description":"This is the best way to clean large plants, such as rubber plants, that are difficult to move. Dunk your cloth in water and then squeeze out any excess liquid. Gently wipe both sides of all of the leaves to remove any dust and grime. Microfiber cloths or cheesecloths work well for cleaning plants. Clean the leaves each time that you notice dust or dirt building up. This works well for both indoor and outdoor plants such as Gunnera, Plantain Lillies, and Elephant Ears. Place a drop of dishwashing liquid on the cloth if you notice insects eating or landing on your plant."
        },
        {
          "headline":"Use a soft paintbrush to remove dust from plants with fuzzy leaves.",
          "description":"Plants with fluffy leaves, such as African Violets, are quite delicate and shouldn’t be wiped. Instead, gently brush any dust or insects off the leaves with a clean, soft paintbrush. If you don’t have a soft paintbrush on-hand, use a pipe cleaner or soft toothbrush instead. Avoid wetting the leaves of fuzzy plants, as this can cause water spots to appear."
        },
        {
          "headline":"Rinse indoor plant leaves with warm water to remove insects and dust.",
          "description":"Place your indoor plant in the sink or shower and use the pressure of the water stream to remove any dust and dirt from the plant. The mist from the shower will also help to hydrate the plant’s leaves. Leave the plants to drip-dry and then take them outside to dry in the sunshine. Always use warm water, as cold water can leave spots on the leaves. Don’t wash plants, such as cacti and African Violets, that are sensitive to water. This method works well for Peace Lilies, Sword Ferns, and Devils Ivy."
        },
        {
          "headline":"Dunk small plants into water to quickly get rid of dust.",
          "description":"Place your hand over the soil to keep it in place and then turn the plant upside down and submerge the plant in room temperature water. This is a great option for small houseplants and outdoor plants. Allow the plants to drip-dry out of direct light."
        },
        {
          "headline":"Spray compressed air onto cacti to avoid getting them wet.",
          "description":"Cacti are used to desert conditions and will often wilt and die if they are over-watered. Spray air from an air compressor can over the spikes to dislodge any dust or dirt from the cacti. Hold the can 10 centimetres (3.9 in) away from the cacti to avoid damaging the spikes. Purchase an air-compressor can from a hardware store or a plant nursery. This works well for both spiky and smooth cacti."
        }
      ]
    },
    {
      "name":"Adding Shine",
      "steps":[
        {
          "headline":"Rub a thin coat of mayonnaise over the leaves to keep them shiny.",
          "description":"Squeeze a little mayonnaise onto a paper towel and wipe it over the leaves. Cover the entire leave with a light enough coat that it cannot be seen. Remove any excess mayonnaise with a clean paper towel. This shiny coating will last for approximately 2 weeks. Simply reapply the mayonnaise to restore the shine of the leaves. This method works for all types of plants."
        },
        {
          "headline":"Cover the leaves in a thin layer of mineral oil for a long-lasting glow.",
          "description":"Mineral oil provides a shiny coating for the leaves and helps to prevent dust from accumulating quickly. Simply place a drop of mineral oil onto each leaf and use your fingers to evenly spread it over the top side of the leaf. Use this method on any type of plant. Avoid using coconut or olive oil on the leaves, as this can block the pores of the plant. Keep plants with mineral oil on them out of the direct sun to avoid the leaves from getting burnt. Reapply the mineral oil once or twice per year."
        },
        {
          "headline":"Spray a commercial plant shining product onto the leaves to add sheen.",
          "description":"These sprays are specially formulated to keep your plant leaves looking shiny. Liberally spray the product over all the leaves on your plants. If you are spraying outdoor plants, choose a product that is designed for outdoor plants. Purchase a plant shining spray from a plant store. Follow the application instructions on the packet. This is a great option for cacti, as you don’t have to touch the plant."
        }
      ]
    }
  ],
  "text":" Removing Dust and Grime Wipe large, shiny leaves with a damp cloth. This is the best way to clean large plants, such as rubber plants, that are difficult to move. Dunk your cloth in water and then squeeze out any excess liquid. Gently wipe both sides of all of the leaves to remove any dust and grime. Microfiber cloths or cheesecloths work well for cleaning plants. Clean the leaves each time that you notice dust or dirt building up. This works well for both indoor and outdoor plants such as Gunnera, Plantain Lillies, and Elephant Ears. Place a drop of dishwashing liquid on the cloth if you notice insects eating or landing on your plant. Use a soft paintbrush to remove dust from plants with fuzzy leaves. Plants with fluffy leaves, such as African Violets, are quite delicate and shouldn’t be wiped. Instead, gently brush any dust or insects off the leaves with a clean, soft paintbrush. If you don’t have a soft paintbrush on-hand, use a pipe cleaner or soft toothbrush instead. Avoid wetting the leaves of fuzzy plants, as this can cause water spots to appear. Rinse indoor plant leaves with warm water to remove insects and dust. Place your indoor plant in the sink or shower and use the pressure of the water stream to remove any dust and dirt from the plant. The mist from the shower will also help to hydrate the plant’s leaves. Leave the plants to drip-dry and then take them outside to dry in the sunshine. Always use warm water, as cold water can leave spots on the leaves. Don’t wash plants, such as cacti and African Violets, that are sensitive to water. This method works well for Peace Lilies, Sword Ferns, and Devils Ivy. Dunk small plants into water to quickly get rid of dust. Place your hand over the soil to keep it in place and then turn the plant upside down and submerge the plant in room temperature water. This is a great option for small houseplants and outdoor plants. Allow the plants to drip-dry out of direct light. Spray compressed air onto cacti to avoid getting them wet. Cacti are used to desert conditions and will often wilt and die if they are over-watered. Spray air from an air compressor can over the spikes to dislodge any dust or dirt from the cacti. Hold the can 10 centimetres (3.9 in) away from the cacti to avoid damaging the spikes. Purchase an air-compressor can from a hardware store or a plant nursery. This works well for both spiky and smooth cacti. Adding Shine Rub a thin coat of mayonnaise over the leaves to keep them shiny. Squeeze a little mayonnaise onto a paper towel and wipe it over the leaves. Cover the entire leave with a light enough coat that it cannot be seen. Remove any excess mayonnaise with a clean paper towel. This shiny coating will last for approximately 2 weeks. Simply reapply the mayonnaise to restore the shine of the leaves. This method works for all types of plants. Cover the leaves in a thin layer of mineral oil for a long-lasting glow. Mineral oil provides a shiny coating for the leaves and helps to prevent dust from accumulating quickly. Simply place a drop of mineral oil onto each leaf and use your fingers to evenly spread it over the top side of the leaf. Use this method on any type of plant. Avoid using coconut or olive oil on the leaves, as this can block the pores of the plant. Keep plants with mineral oil on them out of the direct sun to avoid the leaves from getting burnt. Reapply the mineral oil once or twice per year. Spray a commercial plant shining product onto the leaves to add sheen. These sprays are specially formulated to keep your plant leaves looking shiny. Liberally spray the product over all the leaves on your plants. If you are spraying outdoor plants, choose a product that is designed for outdoor plants. Purchase a plant shining spray from a plant store. Follow the application instructions on the packet. This is a great option for cacti, as you don’t have to touch the plant.",
  "tyn_model":[
    "water",
    "mineral oil",
    "mayonnaise",
    "paper towel",
    "cloth",
    "microfiber cloths",
    "dishwashing liquid",
    "pipe cleaner",
    "sword ferns",
    "devils ivy",
    "compressed air",
    "air",
    "air compressor",
    "air-compressor can",
    "plant nursery",
    "plant shining product",
    "plant shining spray"
  ],
  "tyn_section":[

  ]
}