{
  "title":"How to Filter Light with Different Materials",
  "url":"https://www.wikihow.com/Filter-Light-with-Different-Materials",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting"
  ],
  "methods":[
    {
      "name":"Finding Filtering Options",
      "steps":[
        {
          "headline":"See if you can find objects in your house that are color filters.",
          "description":"Many people don’t realize it, but they may have certain plastic objects sitting around that are light filters. As long as you can see through it light can pass through it. The more transparent, the better and more vivid result. Try buying some cheap things online that just happen to filter light, such as certain folders."
        },
        {
          "headline":"Get some cellophane gift wrap.",
          "description":"Cellophane is a flexible material for craft purposes, but it also works well as a light filter, because it is a colored flexible film. Try putting it in front of a light and see how the color changes. You can save money by using existing objects made of cellophane instead of buying rolls or sheets of cellophane individually. Look at a craft or party store. Many of these stores sell cellophane in a range of colors, and you can pick the ones you need\nMany candy wrappers are made out of the same material, so you can try those as well."
        },
        {
          "headline":"Try using lighting gel.",
          "description":"This is a more expensive and professional solution, but it works great. Lighting gel is used in the studio to slip onto cameras and change the color that a camera receives. Keep in mind that this is not very flexible and will not bend around lights. If you use lighting gel, make sure that your keep it away from a flame so it doesn’t start melting! Make sure the set includes red, yellow, and blue."
        },
        {
          "headline":"Try watercolor.",
          "description":"You can watercolor plastic and get many effects other than one solid color. Watercolor can easily be removed, but make sure you color plastic that is not already colored."
        },
        {
          "headline":"Find a solid, rigid plastic around your home and cut it into the shape you need.",
          "description":"Check and see how transparent it is. Opaque plastic will not work. If you can only find colored plastic, try seeing if you can find a red, yellow, and blue. If you plan to watercolor tape, be careful as it is a flexible material and you could stain something! It will not do a good job at filtering if you just color tape. It might be a good idea to also remove the adhesive as well."
        }
      ]
    },
    {
      "name":"Experimenting",
      "steps":[
        {
          "headline":"Know how to make certain colors.",
          "description":"The RYB model works in this situation and can help you combine filters for all sorts of purposes. Align red and blue to make purple, yellow and red to make orange, and blue and yellow to make green. Keep in mind that mixing red and blue filters will not work great, and you are likely to get something that is close to black. Know what colors you will get using a traditional RYB color model. The RGB color model does not apply to filters because they subtract light."
        },
        {
          "headline":"Experiment with all of the uses!",
          "description":"Color filters can be used for many things, so be sure to try some different things. Try putting your filter in front of a light to change its color. You can use this to turn a light red, for example. If you have a reading disability, it may help to place one of these in front of paper. Try using them for filming. Try making cool lighting effects or using them for light experiments."
        },
        {
          "headline":"Ensure you take care of your filters.",
          "description":"Remove any smudging; this could ruin the clarity of the filters. You should also remove plastic covering to make sure they are clear. Make sure you never put them near an open flame, and that you store them in a place they won’t get scratched."
        },
        {
          "headline":"Try cutting them to satisfy your needs.",
          "description":"If you haven’t spent a lot of time and effort getting the filters, consider cutting them to meet your needs. For example, you could make some glasses my getting a frame and then cutting the filters to fit in the frame. You can cut the filters fit around a light if you want to temporarily change its color. Your light source might also require that you cut the filters. Keep in mind that if you cut the filters you can’t uncut them. Be sure that they can still be used for larger light sources."
        },
        {
          "headline":"Try using them for UV light experiments.",
          "description":"Filters that are blue and purple when overlapped can filter enough light to leave just UV light behind. Use one layer blue, to layers purple and overlap them. Tape these on to your light source. Now, find many things that are fluorescent such as highlighter ink, and shine it on them to see them glow! The only way you can know if something truly is fluorescent is to test."
        }
      ]
    }
  ],
  "text":" Finding Filtering Options See if you can find objects in your house that are color filters. Many people don’t realize it, but they may have certain plastic objects sitting around that are light filters. As long as you can see through it light can pass through it. The more transparent, the better and more vivid result. Try buying some cheap things online that just happen to filter light, such as certain folders. Get some cellophane gift wrap. Cellophane is a flexible material for craft purposes, but it also works well as a light filter, because it is a colored flexible film. Try putting it in front of a light and see how the color changes. You can save money by using existing objects made of cellophane instead of buying rolls or sheets of cellophane individually. Look at a craft or party store. Many of these stores sell cellophane in a range of colors, and you can pick the ones you need\nMany candy wrappers are made out of the same material, so you can try those as well. Try using lighting gel. This is a more expensive and professional solution, but it works great. Lighting gel is used in the studio to slip onto cameras and change the color that a camera receives. Keep in mind that this is not very flexible and will not bend around lights. If you use lighting gel, make sure that your keep it away from a flame so it doesn’t start melting! Make sure the set includes red, yellow, and blue. Try watercolor. You can watercolor plastic and get many effects other than one solid color. Watercolor can easily be removed, but make sure you color plastic that is not already colored. Find a solid, rigid plastic around your home and cut it into the shape you need. Check and see how transparent it is. Opaque plastic will not work. If you can only find colored plastic, try seeing if you can find a red, yellow, and blue. If you plan to watercolor tape, be careful as it is a flexible material and you could stain something! It will not do a good job at filtering if you just color tape. It might be a good idea to also remove the adhesive as well. Experimenting Know how to make certain colors. The RYB model works in this situation and can help you combine filters for all sorts of purposes. Align red and blue to make purple, yellow and red to make orange, and blue and yellow to make green. Keep in mind that mixing red and blue filters will not work great, and you are likely to get something that is close to black. Know what colors you will get using a traditional RYB color model. The RGB color model does not apply to filters because they subtract light. Experiment with all of the uses! Color filters can be used for many things, so be sure to try some different things. Try putting your filter in front of a light to change its color. You can use this to turn a light red, for example. If you have a reading disability, it may help to place one of these in front of paper. Try using them for filming. Try making cool lighting effects or using them for light experiments. Ensure you take care of your filters. Remove any smudging; this could ruin the clarity of the filters. You should also remove plastic covering to make sure they are clear. Make sure you never put them near an open flame, and that you store them in a place they won’t get scratched. Try cutting them to satisfy your needs. If you haven’t spent a lot of time and effort getting the filters, consider cutting them to meet your needs. For example, you could make some glasses my getting a frame and then cutting the filters to fit in the frame. You can cut the filters fit around a light if you want to temporarily change its color. Your light source might also require that you cut the filters. Keep in mind that if you cut the filters you can’t uncut them. Be sure that they can still be used for larger light sources. Try using them for UV light experiments. Filters that are blue and purple when overlapped can filter enough light to leave just UV light behind. Use one layer blue, to layers purple and overlap them. Tape these on to your light source. Now, find many things that are fluorescent such as highlighter ink, and shine it on them to see them glow! The only way you can know if something truly is fluorescent is to test.",
  "tyn_model":[
    "filters",
    "cellophane",
    "plastic",
    "lighting gel",
    "tape",
    "watercolor",
    "color filters",
    "paper",
    "highlighter ink"
  ],
  "tyn_section":[

  ]
}