{
  "title":"How to Make Portuguese Rice",
  "url":"https://www.wikihow.com/Make-Portuguese-Rice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Rice and Beans"
  ],
  "steps":[
    {
      "headline":"Saute the vegetables.",
      "description":"Heat oil in a medium-sized pan. Add the onions, capsicum and garlic. Fry for 2 minutes or until the onions become soft. Add chopped tomatoes (optional) and cook for another 2-3 minutes."
    },
    {
      "headline":"Add the turmeric powder, cumin, paprika, and chili flakes.",
      "description":"Stir to combine."
    },
    {
      "headline":"Add the washed rice to the pan.",
      "description":"Stir. Fry for 2 minutes."
    },
    {
      "headline":"Add the chicken stock cube, water, and lemon juice.",
      "description":"Season with salt. Stir well. When it boils, reduce heat to low, and cook for 3-4 minutes or until the rice is nearly done."
    },
    {
      "headline":"Add green peas.",
      "description":"Add green peas to the pan and stir gently."
    },
    {
      "headline":"Cook until rice is tender and water is absorbed.",
      "description":"The cooking time of rice vary depends on the type of rice you used. Long grain rice usually take about 20 minutes to cook and basmati rice will take about 10 minutes to cook. The Portuguese rice is ready to enjoy."
    }
  ],
  "text":" Saute the vegetables. Heat oil in a medium-sized pan. Add the onions, capsicum and garlic. Fry for 2 minutes or until the onions become soft. Add chopped tomatoes (optional) and cook for another 2-3 minutes. Add the turmeric powder, cumin, paprika, and chili flakes. Stir to combine. Add the washed rice to the pan. Stir. Fry for 2 minutes. Add the chicken stock cube, water, and lemon juice. Season with salt. Stir well. When it boils, reduce heat to low, and cook for 3-4 minutes or until the rice is nearly done. Add green peas. Add green peas to the pan and stir gently. Cook until rice is tender and water is absorbed. The cooking time of rice vary depends on the type of rice you used. Long grain rice usually take about 20 minutes to cook and basmati rice will take about 10 minutes to cook. The Portuguese rice is ready to enjoy.",
  "tyn_model":[
    "rice",
    "water",
    "green peas",
    "oil",
    "medium-sized pan",
    "onions",
    "capsicum",
    "garlic",
    "tomatoes",
    "turmeric powder",
    "cumin",
    "paprika",
    "chili flakes",
    "chicken stock",
    "lemon juice",
    "salt",
    "basmati rice"
  ],
  "tyn_section":[

  ]
}