{
  "title":"How to Play Vanguard",
  "url":"https://www.wikihow.com/Play-Vanguard",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "parts":[
    {
      "name":"Understanding the Cards and Playmat",
      "steps":[
        {
          "headline":"Buy starter decks or booster packs to get new cards.",
          "description":"Starter decks are pre-built decks that you can use straight out of the box. If you want to change your deck, buy booster packs to get more cards to use. Each booster pack contains 5 random cards that you can add to your deck or collect."
        },
        {
          "headline":"Check the unit’s grade and power numbers.",
          "description":"Every card, known as a unit, has a number in the top left corner called the grade and power number in the bottom left. Grades range from 0-3, with grade 0 being the weakest. Grades are used to determine which cards you can play during your turn. The unit’s power refers to how well it does during an attack. Stronger cards usually have a higher power and grade than weaker cards, but they cannot be played until later in the game. Balance the unit grades in your deck so you have about 17 grade 0, 15 grade 1, 10 grade 2, and 8 grade 3 units."
        },
        {
          "headline":"Look for skills underneath the unit’s grade.",
          "description":"You can use skills throughout the battle to help give you a tactical advantage during your turn. Each skill can only be activated at specific times during the game, but you don’t have to use them if you don’t want to. There are 4 different skills that a unit may have. The boost skill has an arrow pointing up and means the unit can be used to boost the power of another unit that’s attacking. The intercept skill looks like a checkmark and allows a unit in play to guard an incoming attack. The twin drive and triple drive skills look like interweaving arrows and give you the potential to add effects during a battle."
        },
        {
          "headline":"Read the card’s ability near the bottom of the card.",
          "description":"You can activate a unit’s ability once per turn at the time listed in the text. These abilities can help your units gain power or allow you to perform a special action during the game, but you don’t have to use the ability if you don’t want to. Follow the text on the card carefully to activate the ability. Many abilities only affect certain zones on the playmat and require a cost, such as discarding cards from the top or bottom of your deck. Abilities labeled ACT can be activated at any time – and for any number of times – as long as you pay the cost each time. If the ability says AUTO, then the ability triggers automatically when the conditions listed on the card are met. For units with a CONT ability, the ability is active as long as the card stays in play. Some CONT abilities require certain conditions to activate."
        },
        {
          "headline":"Locate the clan and race of your unit.",
          "description":"Look for the names listed near the bottom right corner of each unit. The clan and race of your card may be important for activating certain unit abilities, but they don’t affect the gameplay otherwise. As of February 2019, there are 24 different clans and 69 unique and shared races. Each clan has a unique play mechanic as well as their own strengths and weaknesses.Tip: You can have any number of clans in your deck, but you may want to select one that you use for a majority of your deck."
        },
        {
          "headline":"Find the trigger icon in the top right corner of trigger units.",
          "description":"Units with a yellow strip on the bottom of the card are called trigger units, and they can affect the outcome of a battle. The symbol in the top left corner of trigger units shows the effect that happens when they are revealed. Each trigger lets you choose 1 unit to gain 10,000 power, but there are 4 different effects that can happen after. Critical triggers allow you to choose a card and increase the damage it deals by 1. Draw triggers let you draw 1 card from your deck and add it to your hand. Front triggers give all the units in the front row of your playmat an additional 10,000 power. Heal triggers allow you to remove 1 damage from your playmat if you have more damage cards than your opponent."
        },
        {
          "headline":"Familiarize yourself with the zones where you place units on the playmat.",
          "description":"Vanguard has a unique playmat where you place units throughout the match. The space with the letter V is referred to as the vanguard circle, while the 5 other spaces with the letter R are known as rear-guard circles. When you play units during your turn, they must go in these zones. The G at the top of the playmat is the guardian circle and is used to defend against enemy attacks."
        },
        {
          "headline":"Learn the other zones on the sides of the playmat.",
          "description":"Besides the zones where you can play units, there are 5 other zones where cards go throughout the match. These zones are used for cards that you draw, discard, or track damage throughout the game. Place your deck face down on the deck zone on the right side of the playmat at the start of the game. The drop zone on the right side of the playmat is where you will discard cards after they’ve been defeated in battle. The damage zone is where you’ll stack your damage cards when your vanguard is attacked. The top left of the playmat is the G zone, where you can keep 0-8 G units, stronger units that you can access later in the game. Units in the G zone are separate from the units in your deck. Place any G units there face down at the start of the game. The trigger zone is directly above your deck and is used during battle checks. Everything except for your deck, hand, and the cards in your G zone is public information."
        }
      ]
    },
    {
      "name":"Beginning a Match of Vanguard",
      "steps":[
        {
          "headline":"Place a grade 0 unit from your deck in the vanguard circle.",
          "description":"Search through your deck and locate a unit that has a 0 in the top left corner. It does not matter which grade 0 unit you play. Place that card face down in the vanguard zone in the middle of the playmat. This card is your starting vanguard, but you will be able to make it more powerful each turn. Don’t reveal your vanguard right away since it may affect your opponent’s strategy when drawing cards."
        },
        {
          "headline":"Shuffle your deck and draw 5 cards.",
          "description":"Once you and your opponent have selected a vanguard, shuffle your deck so it’s thoroughly mixed. Place your deck in the Deck zone on the right side of your playmat before drawing 5 cards from the top. Those cards are your starting hand.Tip: During your first draw, you may place any number of cards on the bottom of your deck and draw the same number of cards from the top of your deck. If you do, shuffle your deck again."
        },
        {
          "headline":"Play rock paper scissors to determine who goes first and reveal your vanguards.",
          "description":"Whoever wins the game of rock paper scissors takes the first turn. As soon as the player is determined, flip over your vanguards at the same time to reveal them. The game starts with the first player as soon as vanguards are flipped."
        }
      ]
    },
    {
      "name":"Starting Your Turn",
      "steps":[
        {
          "headline":"Turn any horizontal cards on the field vertical before drawing 1 card from your deck.",
          "description":"If you have any cards that are horizontal, or rested, turn them vertical to “stand” them so they can be used during your turn. Once all rested cards are standing, then draw a card from the top of your deck and add it to your hand. You will not have to stand any cards during the first turn. Some units might have an ability that triggers at the beginning of your turn or the Stand Phase. If so, you can choose to activate them if you want."
        },
        {
          "headline":"Play a unit from your hand on top of your vanguard.",
          "description":"Use a card from your hand that has the same grade or a grade that’s 1 more than your vanguard, and place it on top of your current vanguard vertically. This action is known as “riding.” Riding allows you to play stronger cards later during your turn and makes your vanguard more difficult to defeat. This action is referred to as the Ride Phase. Choose to activate any unit abilities that occur at the beginning of the ride phase or when a card rides. The cards underneath your vanguard are referred to as your vanguard’s soul. You do not have to ride during your turn if you don’t want to."
        },
        {
          "headline":"Summon units in the rear-guard circles.",
          "description":"Choose any number of units from your hand to play on any of the rear-guard zones in the vertical position. The units you play must have a grade equal to or less than the grade of your vanguard. If you already have units on the field, you can move or exchange them between rear-guard zones vertically, but not horizontally. This part is known as the Main Phase of your turn. Activate any abilities that occur during the main phase or when a card is played on a rear-guard zone. If you play a unit on a rear-guard zone that already has a unit, put the unit that was there into your drop zone."
        }
      ]
    },
    {
      "name":"Attacking and Damaging Your Opponent’s Units",
      "steps":[
        {
          "headline":"Attack your opponent’s cards by turning a front row unit horizontal.",
          "description":"When you want to initiate a battle, turn the unit you want to use sideways so it’s horizontal in its zone. The unit has to either be your vanguard or the other units in the front row of the field. Choose an opponent’s unit in their front row and declare your attack so your opponent knows what you’re targeting. Choose to activate any unit abilities that trigger during Battle Phase or when a card attacks. You can not initiate battle during the first turn of the game. You can attack multiple times as long as you still have standing units in the front row. You do not have to battle during your turn if you don’t want to."
        },
        {
          "headline":"Place the top card of your deck in the trigger zone if you’re attacking with your vanguard.",
          "description":"When your vanguard attacks, reveal the top card of your deck and place it in the trigger zone. This is known as a drive check. If the revealed card has a trigger symbol in the top right corner, then apply the effects of the trigger. If it isn’t a trigger unit, then no effect is applied. You may choose to activate any abilities that trigger during the drive check. If your vanguard has a twin drive or triple drive skill below its grade, then it must perform 2 or 3 drive checks respectively. The trigger effects resolve in the order they’re revealed."
        },
        {
          "headline":"Compare power levels between your unit and the card you attacked.",
          "description":"Check the power level of the unit you’re attacking with to see if it equals more than the unit you targeted. If your power levels are higher or equal, the hit will land and a unit in a rear-guard zone is moved into the drop zone. If your power is lower than your opponent’s unit, the attack doesn’t hit and the battle is over. Trigger any abilities that activate at the start of the damage step or when attacks hit."
        },
        {
          "headline":"Deal damage if you attacked your opponent’s vanguard.",
          "description":"If the attack hit your opponent’s vanguard, look at the number in the bottom center of the unit you attacked with. Your opponent must perform a damage check by taking the number of cards listed from the top of their deck and placing it in their trigger zone. If it has a symbol in the top right corner, your opponent chooses which cards are affected by the effects. Then, they place the card they drew in the top-most slot of the damage zone on their playmat. Activate any effects that occur during a damage check. If the card revealed during a damage check has an AUTO effect that occurs during the damage check, then the ability is activated before the card goes in the damage zone. After damage is dealt, play switches to your opponent."
        },
        {
          "headline":"Turn the unit that attacked horizontal to rest it.",
          "description":"Whenever a unit battles another unit, it cannot be used again during that turn. Turn the unit sideways so it’s in the resting position. Rested cards can be used again after your next Stand phase. If an ability on a rested unit triggers, you can still use that ability."
        },
        {
          "headline":"Continue playing until a player takes 6 damage or runs out of cards.",
          "description":"Keep alternating turns and battling for the rest of the game. If you ever receive 6 or more damage in their damage zone, they lose. If you ever run out of cards in your deck and you’re unable to draw at the start of your turn, you also lose."
        }
      ]
    },
    {
      "name":"Boosting Your Power",
      "steps":[
        {
          "headline":"Place units in the guardian circle to add power to a unit that’s being attacked.",
          "description":"If you are attacked by an opponent’s unit, you can use cards from your hand to help defend. Check on the left side of the card to see if it has a shield value. Play the card horizontally on the guardian circle and add the shield value to the power of the unit that’s being attacked. You may also use any units in rear-guard circles that have the intercept skill below their grade.Tip: You can use any number of units to guard, but they are placed in the drop zone once the battle is over."
        },
        {
          "headline":"Rest units with skill icons to get boosts during your turn.",
          "description":"If you initiate battle, you can use a card with the Boost ability in the same column as the attacking unit. Look in the top left corner under the grade to see if it has a boost skill and turn the card sideways if you want to use it. Take the power from the unit you used to boost and add it to the power of the unit that’s attacking. You can only boost power during your own turn."
        },
        {
          "headline":"Activate a Stride ability to play a G unit from your G zone.",
          "description":"If you and your opponent both have vanguards that are grade 3, you can choose to “stride” a card after your Ride Phase. Choose a card from the G zone at the top left of the playmat and place it on top of your vanguard. Add the power of the G unit and the vanguard underneath it together. G units are extremely powerful and can help you make a game-changing play during your match. When your turn is over, the G unit is placed back in the G zone face up. Units in your G zone are separate from your deck."
        }
      ]
    }
  ],
  "text":" Understanding the Cards and Playmat Buy starter decks or booster packs to get new cards. Starter decks are pre-built decks that you can use straight out of the box. If you want to change your deck, buy booster packs to get more cards to use. Each booster pack contains 5 random cards that you can add to your deck or collect. Check the unit’s grade and power numbers. Every card, known as a unit, has a number in the top left corner called the grade and power number in the bottom left. Grades range from 0-3, with grade 0 being the weakest. Grades are used to determine which cards you can play during your turn. The unit’s power refers to how well it does during an attack. Stronger cards usually have a higher power and grade than weaker cards, but they cannot be played until later in the game. Balance the unit grades in your deck so you have about 17 grade 0, 15 grade 1, 10 grade 2, and 8 grade 3 units. Look for skills underneath the unit’s grade. You can use skills throughout the battle to help give you a tactical advantage during your turn. Each skill can only be activated at specific times during the game, but you don’t have to use them if you don’t want to. There are 4 different skills that a unit may have. The boost skill has an arrow pointing up and means the unit can be used to boost the power of another unit that’s attacking. The intercept skill looks like a checkmark and allows a unit in play to guard an incoming attack. The twin drive and triple drive skills look like interweaving arrows and give you the potential to add effects during a battle. Read the card’s ability near the bottom of the card. You can activate a unit’s ability once per turn at the time listed in the text. These abilities can help your units gain power or allow you to perform a special action during the game, but you don’t have to use the ability if you don’t want to. Follow the text on the card carefully to activate the ability. Many abilities only affect certain zones on the playmat and require a cost, such as discarding cards from the top or bottom of your deck. Abilities labeled ACT can be activated at any time – and for any number of times – as long as you pay the cost each time. If the ability says AUTO, then the ability triggers automatically when the conditions listed on the card are met. For units with a CONT ability, the ability is active as long as the card stays in play. Some CONT abilities require certain conditions to activate. Locate the clan and race of your unit. Look for the names listed near the bottom right corner of each unit. The clan and race of your card may be important for activating certain unit abilities, but they don’t affect the gameplay otherwise. As of February 2019, there are 24 different clans and 69 unique and shared races. Each clan has a unique play mechanic as well as their own strengths and weaknesses.Tip: You can have any number of clans in your deck, but you may want to select one that you use for a majority of your deck. Find the trigger icon in the top right corner of trigger units. Units with a yellow strip on the bottom of the card are called trigger units, and they can affect the outcome of a battle. The symbol in the top left corner of trigger units shows the effect that happens when they are revealed. Each trigger lets you choose 1 unit to gain 10,000 power, but there are 4 different effects that can happen after. Critical triggers allow you to choose a card and increase the damage it deals by 1. Draw triggers let you draw 1 card from your deck and add it to your hand. Front triggers give all the units in the front row of your playmat an additional 10,000 power. Heal triggers allow you to remove 1 damage from your playmat if you have more damage cards than your opponent. Familiarize yourself with the zones where you place units on the playmat. Vanguard has a unique playmat where you place units throughout the match. The space with the letter V is referred to as the vanguard circle, while the 5 other spaces with the letter R are known as rear-guard circles. When you play units during your turn, they must go in these zones. The G at the top of the playmat is the guardian circle and is used to defend against enemy attacks. Learn the other zones on the sides of the playmat. Besides the zones where you can play units, there are 5 other zones where cards go throughout the match. These zones are used for cards that you draw, discard, or track damage throughout the game. Place your deck face down on the deck zone on the right side of the playmat at the start of the game. The drop zone on the right side of the playmat is where you will discard cards after they’ve been defeated in battle. The damage zone is where you’ll stack your damage cards when your vanguard is attacked. The top left of the playmat is the G zone, where you can keep 0-8 G units, stronger units that you can access later in the game. Units in the G zone are separate from the units in your deck. Place any G units there face down at the start of the game. The trigger zone is directly above your deck and is used during battle checks. Everything except for your deck, hand, and the cards in your G zone is public information. Beginning a Match of Vanguard Place a grade 0 unit from your deck in the vanguard circle. Search through your deck and locate a unit that has a 0 in the top left corner. It does not matter which grade 0 unit you play. Place that card face down in the vanguard zone in the middle of the playmat. This card is your starting vanguard, but you will be able to make it more powerful each turn. Don’t reveal your vanguard right away since it may affect your opponent’s strategy when drawing cards. Shuffle your deck and draw 5 cards. Once you and your opponent have selected a vanguard, shuffle your deck so it’s thoroughly mixed. Place your deck in the Deck zone on the right side of your playmat before drawing 5 cards from the top. Those cards are your starting hand.Tip: During your first draw, you may place any number of cards on the bottom of your deck and draw the same number of cards from the top of your deck. If you do, shuffle your deck again. Play rock paper scissors to determine who goes first and reveal your vanguards. Whoever wins the game of rock paper scissors takes the first turn. As soon as the player is determined, flip over your vanguards at the same time to reveal them. The game starts with the first player as soon as vanguards are flipped. Starting Your Turn Turn any horizontal cards on the field vertical before drawing 1 card from your deck. If you have any cards that are horizontal, or rested, turn them vertical to “stand” them so they can be used during your turn. Once all rested cards are standing, then draw a card from the top of your deck and add it to your hand. You will not have to stand any cards during the first turn. Some units might have an ability that triggers at the beginning of your turn or the Stand Phase. If so, you can choose to activate them if you want. Play a unit from your hand on top of your vanguard. Use a card from your hand that has the same grade or a grade that’s 1 more than your vanguard, and place it on top of your current vanguard vertically. This action is known as “riding.” Riding allows you to play stronger cards later during your turn and makes your vanguard more difficult to defeat. This action is referred to as the Ride Phase. Choose to activate any unit abilities that occur at the beginning of the ride phase or when a card rides. The cards underneath your vanguard are referred to as your vanguard’s soul. You do not have to ride during your turn if you don’t want to. Summon units in the rear-guard circles. Choose any number of units from your hand to play on any of the rear-guard zones in the vertical position. The units you play must have a grade equal to or less than the grade of your vanguard. If you already have units on the field, you can move or exchange them between rear-guard zones vertically, but not horizontally. This part is known as the Main Phase of your turn. Activate any abilities that occur during the main phase or when a card is played on a rear-guard zone. If you play a unit on a rear-guard zone that already has a unit, put the unit that was there into your drop zone. Attacking and Damaging Your Opponent’s Units Attack your opponent’s cards by turning a front row unit horizontal. When you want to initiate a battle, turn the unit you want to use sideways so it’s horizontal in its zone. The unit has to either be your vanguard or the other units in the front row of the field. Choose an opponent’s unit in their front row and declare your attack so your opponent knows what you’re targeting. Choose to activate any unit abilities that trigger during Battle Phase or when a card attacks. You can not initiate battle during the first turn of the game. You can attack multiple times as long as you still have standing units in the front row. You do not have to battle during your turn if you don’t want to. Place the top card of your deck in the trigger zone if you’re attacking with your vanguard. When your vanguard attacks, reveal the top card of your deck and place it in the trigger zone. This is known as a drive check. If the revealed card has a trigger symbol in the top right corner, then apply the effects of the trigger. If it isn’t a trigger unit, then no effect is applied. You may choose to activate any abilities that trigger during the drive check. If your vanguard has a twin drive or triple drive skill below its grade, then it must perform 2 or 3 drive checks respectively. The trigger effects resolve in the order they’re revealed. Compare power levels between your unit and the card you attacked. Check the power level of the unit you’re attacking with to see if it equals more than the unit you targeted. If your power levels are higher or equal, the hit will land and a unit in a rear-guard zone is moved into the drop zone. If your power is lower than your opponent’s unit, the attack doesn’t hit and the battle is over. Trigger any abilities that activate at the start of the damage step or when attacks hit. Deal damage if you attacked your opponent’s vanguard. If the attack hit your opponent’s vanguard, look at the number in the bottom center of the unit you attacked with. Your opponent must perform a damage check by taking the number of cards listed from the top of their deck and placing it in their trigger zone. If it has a symbol in the top right corner, your opponent chooses which cards are affected by the effects. Then, they place the card they drew in the top-most slot of the damage zone on their playmat. Activate any effects that occur during a damage check. If the card revealed during a damage check has an AUTO effect that occurs during the damage check, then the ability is activated before the card goes in the damage zone. After damage is dealt, play switches to your opponent. Turn the unit that attacked horizontal to rest it. Whenever a unit battles another unit, it cannot be used again during that turn. Turn the unit sideways so it’s in the resting position. Rested cards can be used again after your next Stand phase. If an ability on a rested unit triggers, you can still use that ability. Continue playing until a player takes 6 damage or runs out of cards. Keep alternating turns and battling for the rest of the game. If you ever receive 6 or more damage in their damage zone, they lose. If you ever run out of cards in your deck and you’re unable to draw at the start of your turn, you also lose. Boosting Your Power Place units in the guardian circle to add power to a unit that’s being attacked. If you are attacked by an opponent’s unit, you can use cards from your hand to help defend. Check on the left side of the card to see if it has a shield value. Play the card horizontally on the guardian circle and add the shield value to the power of the unit that’s being attacked. You may also use any units in rear-guard circles that have the intercept skill below their grade.Tip: You can use any number of units to guard, but they are placed in the drop zone once the battle is over. Rest units with skill icons to get boosts during your turn. If you initiate battle, you can use a card with the Boost ability in the same column as the attacking unit. Look in the top left corner under the grade to see if it has a boost skill and turn the card sideways if you want to use it. Take the power from the unit you used to boost and add it to the power of the unit that’s attacking. You can only boost power during your own turn. Activate a Stride ability to play a G unit from your G zone. If you and your opponent both have vanguards that are grade 3, you can choose to “stride” a card after your Ride Phase. Choose a card from the G zone at the top left of the playmat and place it on top of your vanguard. Add the power of the G unit and the vanguard underneath it together. G units are extremely powerful and can help you make a game-changing play during your match. When your turn is over, the G unit is placed back in the G zone face up. Units in your G zone are separate from your deck.",
  "tyn_model":[
    "units",
    "unit",
    "card",
    "cards",
    "rock paper scissors",
    "– and",
    "– as",
    "vanguard",
    "deck",
    "“stand",
    "” them",
    "“riding",
    "” riding",
    "“stride",
    "” a"
  ],
  "tyn_section":[

  ]
}