{
  "title":"How to Cover a Box Spring",
  "url":"https://www.wikihow.com/Cover-a-Box-Spring",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "methods":[
    {
      "name":"Using a Fitted Sheet",
      "steps":[
        {
          "headline":"Measure your box spring.",
          "description":"The size of your box spring is important and usually correlates to the size of your mattress. Use a tape measure and measure the length and width of your box spring to determine what size sheet you will need to cover it."
        },
        {
          "headline":"Find the appropriately sized sheet.",
          "description":"Sheets are different sizes according to your mattress size. Pay attention to the size of the sheet you're buying, especially if it is a fitted sheet. If your mattress and box spring are a King size, a Queen sized sheet will be too small. Here are a few common mattress sizes. King: 76” x 80”\nQueen: 60” x 80”\nFull: 53” x 75”\nTwin: 38” x 75”"
        },
        {
          "headline":"Choose a color or pattern for your sheet.",
          "description":"If your room is styled a certain way or has a specific color scheme, you want to make sure the sheet you choose reflects that. If you're not sure what style you have or want, choose a neutral color like gray or white. Materials are just as important when styling your bed. Consider what textures you'd like, such as cotton or silk, as well as color. If you want to be bolder, choose a sheet in a hue that contrasts your duvet."
        },
        {
          "headline":"Cover your box spring with your chosen sheet.",
          "description":"Most people find fitted sheets challenging at best and impossible at worst. To simplify using a fitted sheet, locate the tags on the sheet. Make sure to apply that corner to the bottom right-hand corner of the box spring. The rest of the sheet should be easier to handle."
        }
      ]
    },
    {
      "name":"Upholstering Your Box Spring",
      "steps":[
        {
          "headline":"Cut 4 squares of fabric and wrap these around the corners.",
          "description":"Each square should be 1 square foot. Once you wrap these around the corners, staple them to the top and the bottom of the box spring. If the box spring is not wood, you can use upholstery twist pins, which you can find at most craft stores. Washing and drying your fabric beforehand isn't required, but if you're unsure if washing it will shrink it, you can do so before cutting it."
        },
        {
          "headline":"Cut 4 longer pieces of fabric for the sides of the box spring.",
          "description":"These panels should be 2 inches longer and 6 inches wider than the side of the box spring. You will need those extra inches to ensure the edges are appropriately and neatly covered. Use a sharp tool to cut the fabric, as a dull tool will cause snags and damage your material."
        },
        {
          "headline":"Lay one panel along the edge of the box spring's underside.",
          "description":"This panel should overhang the edge by 1 inch. Position this fabric so that 3 sides overhang the edge. Do this is as straight a line as possible, using a tape measure if necessary. This will make it easier to secure."
        },
        {
          "headline":"Apply upholstery tape 1 inch from the edge of the box spring.",
          "description":"Be careful when working with strong upholstery tape. Once the tape is securely in place it will be difficult to remove, and may possibly damage the fabric you are using."
        },
        {
          "headline":"Secure the fabric and the tape by stapling every few inches.",
          "description":"Apply a staple or pin straight through the layer of tape and fabric every few inches, from one end of the box spring to the other. If using a staple gun for this step, practice safety measures by wearing protective eyewear and avoid pointing the gun towards yourself or anyone else."
        },
        {
          "headline":"Flip the inner edge of the fabric so it hangs over the long side of the box.",
          "description":"The sides should now be covered in the hanging fabric, and you're almost done upholstering your box spring. Repeat steps 3-6 for each side of the box spring."
        },
        {
          "headline":"Turn the box spring upside down and staple the rest of the fabric.",
          "description":"Be sure to pull the fabric tight and staple or pin it to the underside of the box spring. This will result in a clean and sophisticated look for your newly upholstered box spring."
        }
      ]
    }
  ],
  "text":" Using a Fitted Sheet Measure your box spring. The size of your box spring is important and usually correlates to the size of your mattress. Use a tape measure and measure the length and width of your box spring to determine what size sheet you will need to cover it. Find the appropriately sized sheet. Sheets are different sizes according to your mattress size. Pay attention to the size of the sheet you're buying, especially if it is a fitted sheet. If your mattress and box spring are a King size, a Queen sized sheet will be too small. Here are a few common mattress sizes. King: 76” x 80”\nQueen: 60” x 80”\nFull: 53” x 75”\nTwin: 38” x 75” Choose a color or pattern for your sheet. If your room is styled a certain way or has a specific color scheme, you want to make sure the sheet you choose reflects that. If you're not sure what style you have or want, choose a neutral color like gray or white. Materials are just as important when styling your bed. Consider what textures you'd like, such as cotton or silk, as well as color. If you want to be bolder, choose a sheet in a hue that contrasts your duvet. Cover your box spring with your chosen sheet. Most people find fitted sheets challenging at best and impossible at worst. To simplify using a fitted sheet, locate the tags on the sheet. Make sure to apply that corner to the bottom right-hand corner of the box spring. The rest of the sheet should be easier to handle. Upholstering Your Box Spring Cut 4 squares of fabric and wrap these around the corners. Each square should be 1 square foot. Once you wrap these around the corners, staple them to the top and the bottom of the box spring. If the box spring is not wood, you can use upholstery twist pins, which you can find at most craft stores. Washing and drying your fabric beforehand isn't required, but if you're unsure if washing it will shrink it, you can do so before cutting it. Cut 4 longer pieces of fabric for the sides of the box spring. These panels should be 2 inches longer and 6 inches wider than the side of the box spring. You will need those extra inches to ensure the edges are appropriately and neatly covered. Use a sharp tool to cut the fabric, as a dull tool will cause snags and damage your material. Lay one panel along the edge of the box spring's underside. This panel should overhang the edge by 1 inch. Position this fabric so that 3 sides overhang the edge. Do this is as straight a line as possible, using a tape measure if necessary. This will make it easier to secure. Apply upholstery tape 1 inch from the edge of the box spring. Be careful when working with strong upholstery tape. Once the tape is securely in place it will be difficult to remove, and may possibly damage the fabric you are using. Secure the fabric and the tape by stapling every few inches. Apply a staple or pin straight through the layer of tape and fabric every few inches, from one end of the box spring to the other. If using a staple gun for this step, practice safety measures by wearing protective eyewear and avoid pointing the gun towards yourself or anyone else. Flip the inner edge of the fabric so it hangs over the long side of the box. The sides should now be covered in the hanging fabric, and you're almost done upholstering your box spring. Repeat steps 3-6 for each side of the box spring. Turn the box spring upside down and staple the rest of the fabric. Be sure to pull the fabric tight and staple or pin it to the underside of the box spring. This will result in a clean and sophisticated look for your newly upholstered box spring.",
  "tyn_model":[
    "fabric",
    "sheet",
    "” x",
    "”\n",
    "tape",
    "tape measure",
    "fitted sheet",
    "upholstery tape",
    "sheets",
    "” choose",
    "duvet",
    "upholstery twist pins",
    "staple",
    "staple gun",
    "box spring"
  ],
  "tyn_section":[

  ]
}