{
  "title":"How to Roll an Enchilada",
  "url":"https://www.wikihow.com/Roll-an-Enchilada",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine",
    "Enchiladas"
  ],
  "parts":[
    {
      "name":"Choosing a Filling",
      "steps":[
        {
          "headline":"Choose the filling for your enchiladas.",
          "description":"Enchiladas can be stuffed with just about anything you would like. Meats, poultry, beans, and various types of cheeses work well. Seafoods like fish, lobster, crab, and shrimp also create succulent dishes. You can also enjoy vegetarian enchiladas, like ones filled with mushrooms, tofu, and various grilled peppers."
        },
        {
          "headline":"Estimate the quantity of tortillas and filling you will need.",
          "description":"Based on how many people you will serve, prepare enough so that everyone can enjoy your enchiladas. Plan for each person to eat at least 2 enchiladas. One casserole dish may serve a small family, while multiple dishes may be needed to accommodate a mid-to-large-sized group."
        },
        {
          "headline":"Prepare the filling.",
          "description":"Slow-cooked and braised meats work well when paired with bean and cheese fillings. Using a slow cooker helps to save on time without having to sacrifice tenderness and flavor. To save even more time and effort, you can purchase prepared meats like grilled chicken strips for chicken enchiladas, or buy de-shelled crab meat and pre-cooked shrimp for seafood enchiladas. Meats that retain lots of savory juices are often popular choices."
        }
      ]
    },
    {
      "name":"Rolling Your Enchilada",
      "steps":[
        {
          "headline":"Heat your tortillas.",
          "description":"Heating your tortillas is important because it makes them more pliable before you roll. You have options when it comes to heating, and the way you choose to heat may depend on time and level of ease. Wrap your tortillas in a damp paper towel and microwave in 30-second intervals. Place your tortillas in a non-stick pan that is lightly coated with olive oil and fry on medium heat for about 30 seconds on each side. In the oven, wrap tortillas in aluminum foil and bake at 350 °F (177 °C) for 15-20 minutes."
        },
        {
          "headline":"Dip both sides of your tortillas in enchilada sauce.",
          "description":"If you choose not to heat your tortillas before rolling, soften them with your enchilada sauce (canned or homemade). Place one side of your tortilla in the enchilada saucepan and allow it to steep for a few seconds. Flip it over and let the other side absorb the sauce. Be sure that both sides are thoroughly coated. You can heat and dip your tortillas if you would like. The texture of the sauce should be consistent with a medium-to-thin gravy."
        },
        {
          "headline":"Place your filling in the center of the tortilla.",
          "description":"Distribute approximately 1/3 cup of filling per tortilla. Be careful not to over stuff. Doing so may make it difficult to fold the enchiladas without their contents spilling out. Overfilling may also make it hard to keep the seams of the enchiladas closed. As you fill the tortillas be mindful that each should receive about the same amount."
        },
        {
          "headline":"Roll the enchilada from end to end.",
          "description":"Pull one end of the tortilla over the filling, and tuck in its contents. Roll the enchilada over onto itself until you reach the other end of the tortilla. Repeat the process for each enchilada. Place your enchiladas into a casserole dish in which enchilada sauce has already been poured. Place the enchiladas on their seams so they don't come unrolled while baking. Pouring sauce into your casserole dish before adding your enchiladas helps to prevent them from sticking."
        },
        {
          "headline":"Pour the remainder of the enchilada sauce evenly over the enchiladas.",
          "description":"Covering the enchiladas with the rest of the sauce helps to keep them moist. If you are topping your enchiladas with shredded cheese, add the cheese first, then pour on the sauce. The sauce will help prevent the cheese from burning before the enchiladas are heated through. Cover your casserole dish with foil and bake at 350 °F (177 °C) for 25 minutes. Depending on your enchilada fillings and personal preferences you can use a tomato-based red enchilada sauce, or a tomatillo sauce that includes tomato verdes (tomatillos/husked green tomatoes) and chiles serranos. There are also white sauces that are perfect for creamy chicken enchiladas."
        }
      ]
    }
  ],
  "text":" Choosing a Filling Choose the filling for your enchiladas. Enchiladas can be stuffed with just about anything you would like. Meats, poultry, beans, and various types of cheeses work well. Seafoods like fish, lobster, crab, and shrimp also create succulent dishes. You can also enjoy vegetarian enchiladas, like ones filled with mushrooms, tofu, and various grilled peppers. Estimate the quantity of tortillas and filling you will need. Based on how many people you will serve, prepare enough so that everyone can enjoy your enchiladas. Plan for each person to eat at least 2 enchiladas. One casserole dish may serve a small family, while multiple dishes may be needed to accommodate a mid-to-large-sized group. Prepare the filling. Slow-cooked and braised meats work well when paired with bean and cheese fillings. Using a slow cooker helps to save on time without having to sacrifice tenderness and flavor. To save even more time and effort, you can purchase prepared meats like grilled chicken strips for chicken enchiladas, or buy de-shelled crab meat and pre-cooked shrimp for seafood enchiladas. Meats that retain lots of savory juices are often popular choices. Rolling Your Enchilada Heat your tortillas. Heating your tortillas is important because it makes them more pliable before you roll. You have options when it comes to heating, and the way you choose to heat may depend on time and level of ease. Wrap your tortillas in a damp paper towel and microwave in 30-second intervals. Place your tortillas in a non-stick pan that is lightly coated with olive oil and fry on medium heat for about 30 seconds on each side. In the oven, wrap tortillas in aluminum foil and bake at 350 °F (177 °C) for 15-20 minutes. Dip both sides of your tortillas in enchilada sauce. If you choose not to heat your tortillas before rolling, soften them with your enchilada sauce (canned or homemade). Place one side of your tortilla in the enchilada saucepan and allow it to steep for a few seconds. Flip it over and let the other side absorb the sauce. Be sure that both sides are thoroughly coated. You can heat and dip your tortillas if you would like. The texture of the sauce should be consistent with a medium-to-thin gravy. Place your filling in the center of the tortilla. Distribute approximately 1/3 cup of filling per tortilla. Be careful not to over stuff. Doing so may make it difficult to fold the enchiladas without their contents spilling out. Overfilling may also make it hard to keep the seams of the enchiladas closed. As you fill the tortillas be mindful that each should receive about the same amount. Roll the enchilada from end to end. Pull one end of the tortilla over the filling, and tuck in its contents. Roll the enchilada over onto itself until you reach the other end of the tortilla. Repeat the process for each enchilada. Place your enchiladas into a casserole dish in which enchilada sauce has already been poured. Place the enchiladas on their seams so they don't come unrolled while baking. Pouring sauce into your casserole dish before adding your enchiladas helps to prevent them from sticking. Pour the remainder of the enchilada sauce evenly over the enchiladas. Covering the enchiladas with the rest of the sauce helps to keep them moist. If you are topping your enchiladas with shredded cheese, add the cheese first, then pour on the sauce. The sauce will help prevent the cheese from burning before the enchiladas are heated through. Cover your casserole dish with foil and bake at 350 °F (177 °C) for 25 minutes. Depending on your enchilada fillings and personal preferences you can use a tomato-based red enchilada sauce, or a tomatillo sauce that includes tomato verdes (tomatillos/husked green tomatoes) and chiles serranos. There are also white sauces that are perfect for creamy chicken enchiladas.",
  "tyn_model":[
    "tortillas",
    "enchilada sauce",
    "casserole dish",
    "shrimp",
    "poultry",
    "lobster",
    "crab",
    "mushrooms",
    "tofu",
    "grilled peppers",
    "slow cooker",
    "meats",
    "grilled chicken",
    "microwave",
    "non-stick pan",
    "olive oil",
    "oven",
    "aluminum foil",
    "enchilada saucepan",
    "tortilla",
    "foil",
    "tomatillo sauce",
    "tomato verdes",
    "chiles serranos"
  ],
  "tyn_section":[

  ]
}