{
  "title":"How to Make a Gameboy or DS Case with Duct Tape",
  "url":"https://www.wikihow.com/Make-a-Gameboy-or-DS-Case-with-Duct-Tape",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo Game Boy"
  ],
  "methods":[
    {
      "name":"Wrapping the Game Boy or DS",
      "steps":[
        {
          "headline":"Get your Game Boy or DS.",
          "description":""
        },
        {
          "headline":"Beginning just below the cartridge slot, start wrapping the Game Boy or DS with duct tape, one wrap at a time, sticky side facing out.",
          "description":"Avoid wrapping too tightly. You want to still be able to slip the Game Boy or DS in and out of the case when needed."
        },
        {
          "headline":"Continue wrapping.",
          "description":"Let each new strip to overlap the previous one slightly."
        }
      ]
    },
    {
      "name":"Creating the Case",
      "steps":[
        {
          "headline":"Make the base.",
          "description":"Once you have reached the bottom, put a strip of duct tape over the bottom, sticky side facing out."
        },
        {
          "headline":"Cover the corners for a smooth finish.",
          "description":""
        },
        {
          "headline":"Strengthen the structure.",
          "description":"Start applying duct tape, sticky side facing down, in vertical strips on the Game Boy or DS."
        },
        {
          "headline":"Once you have done that, do it again cleanly with horizontal strips.",
          "description":"This will give the case that leathery feel. You can cut slits into the front for the screen, buttons, power, and volume."
        }
      ]
    },
    {
      "name":"Adding Finishing Touches",
      "steps":[
        {
          "headline":"Make the strap.",
          "description":"Cut about a foot/30 centimeter (11.8 in) of duct tape. Fold it in half lengthwise. Fold it in half crosswise. Add an extra inch/2.5 centimeter (1.0 in) of tape at the end to be able to attach the strap."
        },
        {
          "headline":"Attach the strap to the case.",
          "description":"It's now complete!"
        },
        {
          "headline":"Finished!",
          "description":""
        }
      ]
    }
  ],
  "text":" Wrapping the Game Boy or DS Get your Game Boy or DS.  Beginning just below the cartridge slot, start wrapping the Game Boy or DS with duct tape, one wrap at a time, sticky side facing out. Avoid wrapping too tightly. You want to still be able to slip the Game Boy or DS in and out of the case when needed. Continue wrapping. Let each new strip to overlap the previous one slightly. Creating the Case Make the base. Once you have reached the bottom, put a strip of duct tape over the bottom, sticky side facing out. Cover the corners for a smooth finish.  Strengthen the structure. Start applying duct tape, sticky side facing down, in vertical strips on the Game Boy or DS. Once you have done that, do it again cleanly with horizontal strips. This will give the case that leathery feel. You can cut slits into the front for the screen, buttons, power, and volume. Adding Finishing Touches Make the strap. Cut about a foot/30 centimeter (11.8 in) of duct tape. Fold it in half lengthwise. Fold it in half crosswise. Add an extra inch/2.5 centimeter (1.0 in) of tape at the end to be able to attach the strap. Attach the strap to the case. It's now complete! Finished! ",
  "tyn_model":[
    "game boy",
    "duct tape",
    "tape"
  ],
  "tyn_section":[

  ]
}