{
  "title":"How to Set an Intermatic Timer",
  "url":"https://www.wikihow.com/Set-an-Intermatic-Timer",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Electrical Maintenance"
  ],
  "methods":[
    {
      "name":"Setting Up an Analog Intermatic Timer",
      "steps":[
        {
          "headline":"Open up the door on the timer’s enclosure.",
          "description":"You don’t need any tools to open the enclosure. Use your hands to pry open the door on the grey box that encloses the timer. This applies to Intermatic Mechanical Time Switch models with an all-metal construction."
        },
        {
          "headline":"Rotate the clock so that the large arrow points to the current time.",
          "description":"Turn the yellow clock dial clockwise with your hand until the large arrow facing down points at the current time. It’s important to set this time as accurately as possible so that the timer works at the exact times you want it to. The dial only turns clockwise, so if you pass the correct time just keep turning it until you get there again. Each line between numbers on the clock represents an interval of 20 minutes. Don’t ever unscrew the arrow for the current time or you will throw off the timer."
        },
        {
          "headline":"Loosen the “on” and “off” arrows with your fingers or pliers.",
          "description":"Turn the knobs on the arrows to the left to loosen them. Use a set of pliers to get them started if they are too tight to loosen with your fingers. These are the arrows you will set at the times you want the timer to turn something on and off."
        },
        {
          "headline":"Slide the “on” and “off” arrows to the times you want them set at.",
          "description":"Slide the arrow that says “on” to the time you want the timer to turn something on at. Slide the “off” arrow to the time you want it to turn off at. If you want your timer to turn your lights on at dawn and dusk, then do a quick Internet search for the dawn and dusk times in your area and set the arrows to those."
        },
        {
          "headline":"Tighten the knobs on the “on” and “off” arrows with your fingers.",
          "description":"Screw the arrows in place as tight as you can with your fingers. Use pliers to tighten them all the way if they still slide after you tighten the knobs with your fingers."
        }
      ]
    },
    {
      "name":"Programming a Digital Intermatic Timer",
      "steps":[
        {
          "headline":"Press and hold the “on/off” button and press the reset button with a paperclip.",
          "description":"Flip open the door that covers the buttons then hold the “on/off” button as you press the reset button in with a paperclip for 3 seconds. Keep holding the “on/off” button for another 3 seconds. This will clear the timer’s memory and let you program it from the beginning."
        },
        {
          "headline":"Press the “mode” button until the screen shows “setup”, then press “on/off”.",
          "description":"This will enter the setup menu. From here you will begin to set the current hour. You should see the hour flashing on the digital display at this point."
        },
        {
          "headline":"Set the current hour and minutes.",
          "description":"Use the plus and minus keys to set the current hour, then hit the “on/off” button. Set the current minutes with the plus and minus keys, followed by the “on/off” button. Make sure to pay attention to whether the time you are setting is AM or PM."
        },
        {
          "headline":"Set the current year, month, and date.",
          "description":"Use the plus key to set the current year, then press “on/off” to move on. Do the same for the month and date. You can hold down the plus or minus keys to change the numbers a bit faster. When you are done with this, you will see a day of the week displayed. If the day is wrong, then you may have set the date wrong and you will have to repeat the steps. If the day is right, hit “on/off” to move on."
        },
        {
          "headline":"Select manual or auto daylight savings and your zone.",
          "description":"Leave the daylight savings setting on auto if you use daylight savings in your area. Change it to manual if you do not use daylight savings. Refer to the map in the instructions to see which zone you fall into and set the correct one. Always use the “on/off” button to move on to the next section of the programming."
        },
        {
          "headline":"Adjust the dawn and dusk times as needed.",
          "description":"The next hour you will see is the timer’s estimated dawn time for your area. Adjust it if it is off, then move on to the dusk time and do the same. These are the times that the timer will follow to turn on and off. This is the end of the basic setup and you will be taken back to the beginning of the setup screen when you are done."
        },
        {
          "headline":"Press the “mode” button until it displays “PGM”, then hit “on/off”.",
          "description":"This will take you into the program menu so you can set the timer’s on and off events. The timer is automatically set to turn on at dusk and off at dawn every day of the week. Change these settings if you want, or leave them the same if this works for you. When you are happy with the settings, simply press “mode” once more to put the timer back in “AUTO” mode and close the cover over the buttons."
        }
      ]
    }
  ],
  "text":" Setting Up an Analog Intermatic Timer Open up the door on the timer’s enclosure. You don’t need any tools to open the enclosure. Use your hands to pry open the door on the grey box that encloses the timer. This applies to Intermatic Mechanical Time Switch models with an all-metal construction. Rotate the clock so that the large arrow points to the current time. Turn the yellow clock dial clockwise with your hand until the large arrow facing down points at the current time. It’s important to set this time as accurately as possible so that the timer works at the exact times you want it to. The dial only turns clockwise, so if you pass the correct time just keep turning it until you get there again. Each line between numbers on the clock represents an interval of 20 minutes. Don’t ever unscrew the arrow for the current time or you will throw off the timer. Loosen the “on” and “off” arrows with your fingers or pliers. Turn the knobs on the arrows to the left to loosen them. Use a set of pliers to get them started if they are too tight to loosen with your fingers. These are the arrows you will set at the times you want the timer to turn something on and off. Slide the “on” and “off” arrows to the times you want them set at. Slide the arrow that says “on” to the time you want the timer to turn something on at. Slide the “off” arrow to the time you want it to turn off at. If you want your timer to turn your lights on at dawn and dusk, then do a quick Internet search for the dawn and dusk times in your area and set the arrows to those. Tighten the knobs on the “on” and “off” arrows with your fingers. Screw the arrows in place as tight as you can with your fingers. Use pliers to tighten them all the way if they still slide after you tighten the knobs with your fingers. Programming a Digital Intermatic Timer Press and hold the “on/off” button and press the reset button with a paperclip. Flip open the door that covers the buttons then hold the “on/off” button as you press the reset button in with a paperclip for 3 seconds. Keep holding the “on/off” button for another 3 seconds. This will clear the timer’s memory and let you program it from the beginning. Press the “mode” button until the screen shows “setup”, then press “on/off”. This will enter the setup menu. From here you will begin to set the current hour. You should see the hour flashing on the digital display at this point. Set the current hour and minutes. Use the plus and minus keys to set the current hour, then hit the “on/off” button. Set the current minutes with the plus and minus keys, followed by the “on/off” button. Make sure to pay attention to whether the time you are setting is AM or PM. Set the current year, month, and date. Use the plus key to set the current year, then press “on/off” to move on. Do the same for the month and date. You can hold down the plus or minus keys to change the numbers a bit faster. When you are done with this, you will see a day of the week displayed. If the day is wrong, then you may have set the date wrong and you will have to repeat the steps. If the day is right, hit “on/off” to move on. Select manual or auto daylight savings and your zone. Leave the daylight savings setting on auto if you use daylight savings in your area. Change it to manual if you do not use daylight savings. Refer to the map in the instructions to see which zone you fall into and set the correct one. Always use the “on/off” button to move on to the next section of the programming. Adjust the dawn and dusk times as needed. The next hour you will see is the timer’s estimated dawn time for your area. Adjust it if it is off, then move on to the dusk time and do the same. These are the times that the timer will follow to turn on and off. This is the end of the basic setup and you will be taken back to the beginning of the setup screen when you are done. Press the “mode” button until it displays “PGM”, then hit “on/off”. This will take you into the program menu so you can set the timer’s on and off events. The timer is automatically set to turn on at dusk and off at dawn every day of the week. Change these settings if you want, or leave them the same if this works for you. When you are happy with the settings, simply press “mode” once more to put the timer back in “AUTO” mode and close the cover over the buttons.",
  "tyn_model":[
    "“on",
    "timer",
    "” button",
    "“off",
    "daylight savings",
    "” and",
    "” arrows",
    "pliers",
    "” to",
    "“mode",
    "clock",
    "”,",
    "”.",
    "” arrow",
    "digital intermatic timer",
    "“setup",
    "“pgm",
    "” once",
    "“auto",
    "” mode"
  ],
  "tyn_section":[

  ]
}