{
  "title":"How to Change Your Team in Pokemon Go",
  "url":"https://www.wikihow.com/Change-Your-Team-in-Pokemon-Go",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Pokemon Video Games",
    "Pokemon GO"
  ],
  "steps":[
    {
      "headline":"Open Pokémon GO on your iPhone or Android.",
      "description":"The Pokemon GO app looks like a red-and-white Pokéball in a blue icon. You can find it on your home screen or on your Apps tray."
    },
    {
      "headline":"Tap the Pokéball icon at the bottom.",
      "description":"You'll see a red-and-white Pokéball icon at the bottom of your screen. It will open your menu options."
    },
    {
      "headline":"Tap SHOP on the menu.",
      "description":"This button looks like a shopping bag icon. It will open the Poké shop on your screen."
    },
    {
      "headline":"Scroll down and tap TEAM MEDALION.",
      "description":"You can find this item in the \"TEAM CHANGE\" section of the shop. It will open the selected item's details. You won't see this item unless you've already reached level 5, and picked a team."
    },
    {
      "headline":"Tap EXCHANGE under the Team Medallion.",
      "description":"This will exchange 1000 coins from your current balance for a Team Medallion. You can use this item to change your team. If you don't have enough coins to buy this, you can purchase coins from the in-app shop page."
    },
    {
      "headline":"Tap OK in the confirmation window.",
      "description":"This will confirm your action, and purchase the Team Medallion. You can find it in your personal items."
    },
    {
      "headline":"Tap the X button at the bottom of the shop.",
      "description":"This is a light-blue \"X\" icon in a dark-blue circle at the bottom of your screen. It will quit the shop, and take you back to the map."
    },
    {
      "headline":"Tap the Pokéball icon at the bottom.",
      "description":"It's a red-and-white Pokéball at the bottom of the map. It will open your menu options."
    },
    {
      "headline":"Tap ITEMS on the menu.",
      "description":"This button looks like a backpack icon in a circle. It will open your ITEMS page."
    },
    {
      "headline":"Find and tap the Team Medalllion in your items.",
      "description":"Tapping on the Team Medallion here will allow you to consume it, and change your team immediately. You can only use this item once every 365 days. If you change your team now, you will have to stick with your team for at least one year. You will have to confirm your action in a new pop-up."
    },
    {
      "headline":"Tap OK in the confirmation window.",
      "description":"This will confirm your action, and allow you to select a new team."
    },
    {
      "headline":"Tap the team you want to switch to.",
      "description":"You'll see all three team leaders on your screen when you consume the Team Medallion. Just tap on a team leader to set this as your new team. You will have to confirm in a new pop-up."
    },
    {
      "headline":"Tap OK in the confirmation window.",
      "description":"This will confirm your selection, and change your Pokémon GO profile to the selected team."
    }
  ],
  "text":" Open Pokémon GO on your iPhone or Android. The Pokemon GO app looks like a red-and-white Pokéball in a blue icon. You can find it on your home screen or on your Apps tray. Tap the Pokéball icon at the bottom. You'll see a red-and-white Pokéball icon at the bottom of your screen. It will open your menu options. Tap SHOP on the menu. This button looks like a shopping bag icon. It will open the Poké shop on your screen. Scroll down and tap TEAM MEDALION. You can find this item in the \"TEAM CHANGE\" section of the shop. It will open the selected item's details. You won't see this item unless you've already reached level 5, and picked a team. Tap EXCHANGE under the Team Medallion. This will exchange 1000 coins from your current balance for a Team Medallion. You can use this item to change your team. If you don't have enough coins to buy this, you can purchase coins from the in-app shop page. Tap OK in the confirmation window. This will confirm your action, and purchase the Team Medallion. You can find it in your personal items. Tap the X button at the bottom of the shop. This is a light-blue \"X\" icon in a dark-blue circle at the bottom of your screen. It will quit the shop, and take you back to the map. Tap the Pokéball icon at the bottom. It's a red-and-white Pokéball at the bottom of the map. It will open your menu options. Tap ITEMS on the menu. This button looks like a backpack icon in a circle. It will open your ITEMS page. Find and tap the Team Medalllion in your items. Tapping on the Team Medallion here will allow you to consume it, and change your team immediately. You can only use this item once every 365 days. If you change your team now, you will have to stick with your team for at least one year. You will have to confirm your action in a new pop-up. Tap OK in the confirmation window. This will confirm your action, and allow you to select a new team. Tap the team you want to switch to. You'll see all three team leaders on your screen when you consume the Team Medallion. Just tap on a team leader to set this as your new team. You will have to confirm in a new pop-up. Tap OK in the confirmation window. This will confirm your selection, and change your Pokémon GO profile to the selected team.",
  "tyn_model":[
    "pokémon go",
    "pokemon go",
    "medallion",
    "pokéball"
  ],
  "tyn_section":[

  ]
}