{
  "title":"How to Shave Brussels Sprouts",
  "url":"https://www.wikihow.com/Shave-Brussels-Sprouts",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Using a Food Processor",
      "steps":[
        {
          "headline":"Rinse the Brussels sprouts with clean, cold water.",
          "description":"Fill a large bowl with cold water and throw the Brussels sprouts in. Stir the sprouts in the water several times with your hand. Pour the sprouts into a colander to drain the water. Brussels sprouts typically don't collect a lot of dirt, but any dust or sediment attached to the vegetable will sink to the bottom."
        },
        {
          "headline":"Trim the end of each sprout and pull off the outer leaves.",
          "description":"Holding the top end firmly against a cutting board, cut a thin slice off the root end of each sprout with a sharp chef's knife or paring knife. The tough outer leaves will start to flake off. Remove any leaves that are bruised, dried-out, or tough. Stop when you reach fresh, tender leaves. Since they're spherical, sprouts are prone to rolling off the cutting board and onto the floor. Keep them in a bowl unless you're actively trimming the end to prevent them from falling."
        },
        {
          "headline":"Fit your food processor with its slicing attachment.",
          "description":"Place the metal slicing disc on top of the food processor bowl, fitting it over the shaft inside the bowl. Then, fit the plastic lid on top of the slicing disc. If your food processor didn't come with a slicing attachment, you can shred your sprouts using just the S-blade. Cut each sprout in half lengthwise, then add them to your food processor and pulse once or twice. It won't result in as fine a shave, however."
        },
        {
          "headline":"Turn on the food processor and drop in the first batch of sprouts.",
          "description":"Place a handful of Brussels sprouts in the feed tube on the lid of the food processor and watch as they are shredded. When the food processor gets full, turn it off."
        },
        {
          "headline":"Empty the processor, then continue shaving in small batches.",
          "description":"Empty out the shaved sprouts into a large bowl, then fit the lid back on the processor. Turn it back on and shred another batch of Brussels sprouts. Repeat until you've shaved them all. A food processor is the fastest method of shaving Brussels sprouts, so it works well for a large volume of sprouts."
        }
      ]
    },
    {
      "name":"Slicing with a Knife",
      "steps":[
        {
          "headline":"Clean the Brussels sprouts with cold water.",
          "description":"Fill a large bowl with cold water and toss in the Brussels sprouts. Stir the sprouts in the water several times with your hand to loosen any surface dirt. Then, pour the sprouts into a colander to drain the dirty water."
        },
        {
          "headline":"Slice off the woody stems and discard the outer leaves with your hands.",
          "description":"Using a sharp chef's knife or paring knife, cut a thin slice off the bottom of each Brussels sprout. The tough outer leaves will start to come off. Remove any leaves that are bruised, dried-out, or tough until you reach the inner, tender leaves. Once you've sliced off the stem, you can transfer the sprouts to a lidded container for a quicker method of removing the outer leaves. Close the container and shake vigorously until the majority of the outer leaves have fallen off. You may have to remove a few stragglers by hand."
        },
        {
          "headline":"Cut each sprout in half lengthwise.",
          "description":"Slice in a straight line from root to top. Keep the Brussels sprouts in a bowl until you're ready to slice them in half, since they are prone to rolling off the cutting board and onto the floor. A sharp knife will make this process easier and safer. Sharpen your knife if you haven't recently."
        },
        {
          "headline":"Place the sprouts cut side down and thinly slice from root to top.",
          "description":"Shave them by thinly slicing from root to top. Hold your hand like a claw and push your knuckle against the knife blade to keep it from cutting your fingers. To keep the sprouts from rolling around the cutting board, make sure you've placed them so the flat side is facing down while you slice."
        },
        {
          "headline":"Break apart the slices with your fingers.",
          "description":"Once you've thinly sliced all of your spouts, transfer them to a bowl and use your fingers to tease apart the leaves. The shaved Brussels sprouts are now ready to be tossed in a salad or sautéed with bacon or garlic."
        }
      ]
    },
    {
      "name":"Using a Mandoline",
      "steps":[
        {
          "headline":"Rinse the Brussels sprouts with clean, cold water.",
          "description":"Fill a large bowl with cold water and toss the Brussels sprouts in. Drain the water by pouring the sprouts into a colander. Brussels sprouts typically don't collect a lot of dirt, but any dust or sediment attached to the vegetable will sink to the bottom."
        },
        {
          "headline":"Stick a fork into the root end of one of a Brussels sprout.",
          "description":"Make sure the fork is firmly lodged in the sprout so you can use it as a sort of handle to move the sprout around. A mandoline is a flat kitchen tool that features a sharp stationary blade in the center, typically used for slicing vegetables. Spearing the sprout with a fork is a safe, easy way to slice it while keeping your hands away from the mandoline blade. You can also use a no-cut glove to protect your hand from getting cut by the blade. In that case, there's no need to use the fork—simply hold the sprout by its root end and slide it back and forth over the mandoline by hand."
        },
        {
          "headline":"Rub the sprout back and forth over the mandoline blade until you reach the root.",
          "description":"Holding the attached fork, move the sprout quickly back and forth over the blade to shave it into fine pieces. Once you've shaved it down to the root, remove the fork from the sprout and throw the woody end away."
        },
        {
          "headline":"Repeat the process with the rest of your Brussels sprouts.",
          "description":"Make sure to firmly spear each sprout with the fork before beginning to shave it with the mandoline. This method results in the most finely-shaved sprouts."
        }
      ]
    }
  ],
  "text":" Using a Food Processor Rinse the Brussels sprouts with clean, cold water. Fill a large bowl with cold water and throw the Brussels sprouts in. Stir the sprouts in the water several times with your hand. Pour the sprouts into a colander to drain the water. Brussels sprouts typically don't collect a lot of dirt, but any dust or sediment attached to the vegetable will sink to the bottom. Trim the end of each sprout and pull off the outer leaves. Holding the top end firmly against a cutting board, cut a thin slice off the root end of each sprout with a sharp chef's knife or paring knife. The tough outer leaves will start to flake off. Remove any leaves that are bruised, dried-out, or tough. Stop when you reach fresh, tender leaves. Since they're spherical, sprouts are prone to rolling off the cutting board and onto the floor. Keep them in a bowl unless you're actively trimming the end to prevent them from falling. Fit your food processor with its slicing attachment. Place the metal slicing disc on top of the food processor bowl, fitting it over the shaft inside the bowl. Then, fit the plastic lid on top of the slicing disc. If your food processor didn't come with a slicing attachment, you can shred your sprouts using just the S-blade. Cut each sprout in half lengthwise, then add them to your food processor and pulse once or twice. It won't result in as fine a shave, however. Turn on the food processor and drop in the first batch of sprouts. Place a handful of Brussels sprouts in the feed tube on the lid of the food processor and watch as they are shredded. When the food processor gets full, turn it off. Empty the processor, then continue shaving in small batches. Empty out the shaved sprouts into a large bowl, then fit the lid back on the processor. Turn it back on and shred another batch of Brussels sprouts. Repeat until you've shaved them all. A food processor is the fastest method of shaving Brussels sprouts, so it works well for a large volume of sprouts. Slicing with a Knife Clean the Brussels sprouts with cold water. Fill a large bowl with cold water and toss in the Brussels sprouts. Stir the sprouts in the water several times with your hand to loosen any surface dirt. Then, pour the sprouts into a colander to drain the dirty water. Slice off the woody stems and discard the outer leaves with your hands. Using a sharp chef's knife or paring knife, cut a thin slice off the bottom of each Brussels sprout. The tough outer leaves will start to come off. Remove any leaves that are bruised, dried-out, or tough until you reach the inner, tender leaves. Once you've sliced off the stem, you can transfer the sprouts to a lidded container for a quicker method of removing the outer leaves. Close the container and shake vigorously until the majority of the outer leaves have fallen off. You may have to remove a few stragglers by hand. Cut each sprout in half lengthwise. Slice in a straight line from root to top. Keep the Brussels sprouts in a bowl until you're ready to slice them in half, since they are prone to rolling off the cutting board and onto the floor. A sharp knife will make this process easier and safer. Sharpen your knife if you haven't recently. Place the sprouts cut side down and thinly slice from root to top. Shave them by thinly slicing from root to top. Hold your hand like a claw and push your knuckle against the knife blade to keep it from cutting your fingers. To keep the sprouts from rolling around the cutting board, make sure you've placed them so the flat side is facing down while you slice. Break apart the slices with your fingers. Once you've thinly sliced all of your spouts, transfer them to a bowl and use your fingers to tease apart the leaves. The shaved Brussels sprouts are now ready to be tossed in a salad or sautéed with bacon or garlic. Using a Mandoline Rinse the Brussels sprouts with clean, cold water. Fill a large bowl with cold water and toss the Brussels sprouts in. Drain the water by pouring the sprouts into a colander. Brussels sprouts typically don't collect a lot of dirt, but any dust or sediment attached to the vegetable will sink to the bottom. Stick a fork into the root end of one of a Brussels sprout. Make sure the fork is firmly lodged in the sprout so you can use it as a sort of handle to move the sprout around. A mandoline is a flat kitchen tool that features a sharp stationary blade in the center, typically used for slicing vegetables. Spearing the sprout with a fork is a safe, easy way to slice it while keeping your hands away from the mandoline blade. You can also use a no-cut glove to protect your hand from getting cut by the blade. In that case, there's no need to use the fork—simply hold the sprout by its root end and slide it back and forth over the mandoline by hand. Rub the sprout back and forth over the mandoline blade until you reach the root. Holding the attached fork, move the sprout quickly back and forth over the blade to shave it into fine pieces. Once you've shaved it down to the root, remove the fork from the sprout and throw the woody end away. Repeat the process with the rest of your Brussels sprouts. Make sure to firmly spear each sprout with the fork before beginning to shave it with the mandoline. This method results in the most finely-shaved sprouts.",
  "tyn_model":[
    "brussels sprouts",
    "water",
    "food processor",
    "fork",
    "bowl",
    "mandoline",
    "colander",
    "large bowl",
    "chef's knife",
    "paring knife",
    "processor",
    "brussels sprout",
    "container",
    "cutting board",
    "knife",
    "cold water",
    "knife blade",
    "garlic",
    "—simply"
  ],
  "tyn_section":[

  ]
}