{
  "title":"How to Dry Silicone Fast",
  "url":"https://www.wikihow.com/Dry-Silicone-Fast",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Speeding up the Drying Process",
      "steps":[
        {
          "headline":"Apply a drying catalyst to accelerate the process.",
          "description":"You can buy a tube of catalyst for less than $10 at your local hardware or home improvement store. To use the catalyst, squeeze out a dab of it from the tube and apply it directly to the silicone adhesive. The catalyst hardens the silicone by removing water from the compound and increasing the purity of the adhesive. You can use 2 dabs of the catalyst to speed up the drying process even more."
        },
        {
          "headline":"Scrape excess adhesive with a putty knife.",
          "description":"If the layer of adhesive is too thick, it will take more time to dry. By scraping off any additional adhesive, you allow the air to get to the adhesive and shorten the drying time. If you don’t have a putty knife, you can use a butter knife to get rid of the excess adhesive. The same goes for sealant. The more sealant you have, the longer it will take to cure. Remove extra sealant with a putty knife."
        },
        {
          "headline":"Open windows near the adhesive to properly ventilate the room.",
          "description":"Your adhesive must dry in room temperature conditions and in a well-ventilated area. Open the windows and doors around the adhesive to ensure there is ample air coming in and out of the room. There is a misconception that the hotter the room is, the quicker the adhesive will dry. The reality is that humidity will halt the drying process, so always keep the room well-ventilated.Did you know? Drying and curing are totally different things. Drying is the initial, rapid process where moisture and water evaporate. Curing is much slower and refers to the chemical changes that take place after silicone gets exposed to oxygen. Your silicone will be a fully functional sealant if it's just dried – you don't necessarily need to wait for it to cure."
        },
        {
          "headline":"Use a fan or heat lamp to dry the adhesive.",
          "description":"Place the fan or lamp about 3 feet (0.91 m) from the adhesive. If you’re using a fan, keep it at a middle setting instead of going right to the highest setting. Keep the fan or lamp by the adhesive for about 1 hour. You can also use a blow dryer to really speed up the process. If you go this route, keep the blow dryer at a moderate temperature and stay at least a foot away from the adhesive when blow drying it. If the adhesive is exposed to extreme temperatures, it can crack. Only use the blow dryer for between 5-10 minutes."
        }
      ]
    },
    {
      "name":"Buying and Preserving Fast-Drying Silicone",
      "steps":[
        {
          "headline":"Buy special low-temperature adhesive if you’re working in the winter.",
          "description":"Silicone-based adhesives don’t freeze in cold weather, so you can use them even if the temperature drops. These adhesives dry faster in cold or damp environments, making them extremely versatile. You can also buy low-temperature sealant, but be wary of using it in very extreme cold. Low-temperature sealant will hold up between 32–40 °F (0–4 °C) degrees, but sealant usually won’t cure well below freezing."
        },
        {
          "headline":"Purchase adhesive that has a “Quick Drying” label on the bottle.",
          "description":"Most brands have a quick-drying version of their product along with the regular version. Some products advertise that the adhesive dries quickly differently than others, so a bottle can be the quick-drying variety even if it doesn’t say that specific phrase. Look for descriptions like “30-minute water-ready” if you can’t find “quick drying”. Another description the product could have is “instant adhesive”. Fast-drying silicone sealant is available as well, and it’s relatively cheap. You can get a tube of sealant for less than $10."
        },
        {
          "headline":"Ensure the adhesive isn’t expired by checking its expiration date.",
          "description":"If the tube is out of date, the adhesive will take longer to dry. If the adhesive takes longer to dry than it says on the tube, this is most likely because it has gone past its shelf life. Sealants, however, are good for about 12 months. Many adhesives say they come with a lifetime guarantee. This isn’t wrong, because expired adhesive will still dry, but it will take much longer than you’d like to do so."
        },
        {
          "headline":"Avoid storing your adhesive in extreme temperatures.",
          "description":"The optimal temperature for storing your adhesive is 68 °F (20 °C). Fortunately, you can store it in a wide range of temperatures. As long as the temperature is between 59–80 °F (15–27 °C), your adhesive should be in good shape. Don’t keep the adhesive in your garage during the summer. If this happens, the adhesive will become thick and lumpy and will not dry quickly.Tip: To extend the shelf life of a big tube of silicone sealant, place a plastic bag over the tube and then screw the nozzle onto the tube."
        }
      ]
    }
  ],
  "text":" Speeding up the Drying Process Apply a drying catalyst to accelerate the process. You can buy a tube of catalyst for less than $10 at your local hardware or home improvement store. To use the catalyst, squeeze out a dab of it from the tube and apply it directly to the silicone adhesive. The catalyst hardens the silicone by removing water from the compound and increasing the purity of the adhesive. You can use 2 dabs of the catalyst to speed up the drying process even more. Scrape excess adhesive with a putty knife. If the layer of adhesive is too thick, it will take more time to dry. By scraping off any additional adhesive, you allow the air to get to the adhesive and shorten the drying time. If you don’t have a putty knife, you can use a butter knife to get rid of the excess adhesive. The same goes for sealant. The more sealant you have, the longer it will take to cure. Remove extra sealant with a putty knife. Open windows near the adhesive to properly ventilate the room. Your adhesive must dry in room temperature conditions and in a well-ventilated area. Open the windows and doors around the adhesive to ensure there is ample air coming in and out of the room. There is a misconception that the hotter the room is, the quicker the adhesive will dry. The reality is that humidity will halt the drying process, so always keep the room well-ventilated.Did you know? Drying and curing are totally different things. Drying is the initial, rapid process where moisture and water evaporate. Curing is much slower and refers to the chemical changes that take place after silicone gets exposed to oxygen. Your silicone will be a fully functional sealant if it's just dried – you don't necessarily need to wait for it to cure. Use a fan or heat lamp to dry the adhesive. Place the fan or lamp about 3 feet (0.91 m) from the adhesive. If you’re using a fan, keep it at a middle setting instead of going right to the highest setting. Keep the fan or lamp by the adhesive for about 1 hour. You can also use a blow dryer to really speed up the process. If you go this route, keep the blow dryer at a moderate temperature and stay at least a foot away from the adhesive when blow drying it. If the adhesive is exposed to extreme temperatures, it can crack. Only use the blow dryer for between 5-10 minutes. Buying and Preserving Fast-Drying Silicone Buy special low-temperature adhesive if you’re working in the winter. Silicone-based adhesives don’t freeze in cold weather, so you can use them even if the temperature drops. These adhesives dry faster in cold or damp environments, making them extremely versatile. You can also buy low-temperature sealant, but be wary of using it in very extreme cold. Low-temperature sealant will hold up between 32–40 °F (0–4 °C) degrees, but sealant usually won’t cure well below freezing. Purchase adhesive that has a “Quick Drying” label on the bottle. Most brands have a quick-drying version of their product along with the regular version. Some products advertise that the adhesive dries quickly differently than others, so a bottle can be the quick-drying variety even if it doesn’t say that specific phrase. Look for descriptions like “30-minute water-ready” if you can’t find “quick drying”. Another description the product could have is “instant adhesive”. Fast-drying silicone sealant is available as well, and it’s relatively cheap. You can get a tube of sealant for less than $10. Ensure the adhesive isn’t expired by checking its expiration date. If the tube is out of date, the adhesive will take longer to dry. If the adhesive takes longer to dry than it says on the tube, this is most likely because it has gone past its shelf life. Sealants, however, are good for about 12 months. Many adhesives say they come with a lifetime guarantee. This isn’t wrong, because expired adhesive will still dry, but it will take much longer than you’d like to do so. Avoid storing your adhesive in extreme temperatures. The optimal temperature for storing your adhesive is 68 °F (20 °C). Fortunately, you can store it in a wide range of temperatures. As long as the temperature is between 59–80 °F (15–27 °C), your adhesive should be in good shape. Don’t keep the adhesive in your garage during the summer. If this happens, the adhesive will become thick and lumpy and will not dry quickly.Tip: To extend the shelf life of a big tube of silicone sealant, place a plastic bag over the tube and then screw the nozzle onto the tube.",
  "tyn_model":[
    "adhesive",
    "silicone",
    "fan",
    "sealant",
    "catalyst",
    "water",
    "putty knife",
    "blow dryer",
    "adhesives",
    "“quick",
    "”.",
    "silicone sealant",
    "drying catalyst",
    "silicone adhesive",
    "butter knife",
    "– you",
    "heat lamp",
    "silicone-based adhesives",
    "” label",
    "bottle",
    "“30",
    "” if",
    "“instant adhesive",
    "plastic bag"
  ],
  "tyn_section":[

  ]
}