{
  "title":"How to Decorate Bookshelves Without Books",
  "url":"https://www.wikihow.com/Decorate-Bookshelves-Without-Books",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture",
    "Shelves"
  ],
  "parts":[
    {
      "name":"Painting and Modifying the Shelves",
      "steps":[
        {
          "headline":"Limit the color scheme of the backdrops and items to create cohesiveness.",
          "description":"When painting, upholstering, or applying wallpaper to your shelves, stick to a predetermined color scheme. Try picking a bright color and mix it with a neutral color so it won't be visually overwhelming. For instance, try mixing tan with blue, white with yellow, or gray with purple. Another option is to take shades of one color, such as all yellows or blues. You could also paint each shelf a different color to create a rainbow effect."
        },
        {
          "headline":"Paint the inside of the shelves a darker color to highlight your favorite items.",
          "description":"The items you feature in your bookshelves will show look more prominent and eye-catching against a backdrop. Try picking a color that matches the rest of the room, but go a shade or two darker to make it stand out. For instance, if the room has light purples, pick a darker purple in the same tones."
        },
        {
          "headline":"Glue fabric on the back panels of the shelves to tie in your furniture.",
          "description":"Fabric can help connect the shelves to the rest of the room if you use similar textures and colors. Cut the fabric to fit with a little extra to fold over on the ends. Then, fold the edges over and use fabric glue to create a hem all around the edges. Use a hot glue gun to add a few dots of glue on the inside of the shelf at the back. Tack the fabric into place so it forms a backdrop for your shelves. You could also wrap the fabric around the shelves themselves instead. Use the same or similar fabric as ones on your throw pillows or blankets to make your space seem cohesive."
        },
        {
          "headline":"Create depth by installing mirrors at the back of the shelves.",
          "description":"Mirrors make the area look bigger by reflecting the space, so try this option instead of painting or fabric if your bookshelves are in a smaller room. Buy mirrors the right size to place as backdrops on the shelves. Use hot glue or silicone to hold them in place. Measure the inside back panel with a tape measure, stretching it across the length and height to get the proper dimensions. If you can't find mirrors that are the correct size, try cutting a larger mirror to shape."
        },
        {
          "headline":"Stick a fun wallpaper on the shelves for a whimsical look.",
          "description":"Use the wallpaper as a backdrop or even to cover the shelves themselves. Cut the paper to fit, then peel off one end. Line it up on the shelf or the backdrop area, then slowly unpeel the rest of the paper off the back as you rub it into place. Pick something fun and playful or try something serious. Draw in colors and themes from the rest of the room. Most wallpaper is self-sticking. You don't need to use adhesive. You can also try using contact paper if you’re working on a budget."
        }
      ]
    },
    {
      "name":"Picking Items for Your Shelves",
      "steps":[
        {
          "headline":"Paint and layer empty picture frames on the shelves for a geometric effect.",
          "description":"Pick frames in all different sizes and shapes and paint them in your theme colors. Put larger ones in the back, leaning them up against the back of the shelf. Put smaller ones in front, choosing different shapes to make it more interesting."
        },
        {
          "headline":"Create a tribute to your family with photos and heirlooms.",
          "description":"Your bookshelves are a great place to display your favorite family photos. Pick interesting frames in different shapes to create interest. Add family heirlooms and a few knickknacks that are special to your family to complete the picture. For instance, if your family loves apples, throw a few decorative apples into the mix. You could also display quotes that are special to your family. Don’t add too much or else your space will look cluttered."
        },
        {
          "headline":"Display personal collections and artistic creations in your bookshelves.",
          "description":"Whether you're showing off a clay statue your kid made in ceramics or a priceless antique, your bookshelves are a great place to keep things you're proud of. Add knickknacks you picked up on your travels or make a collection of family art. Alternatively, show off your collection of antique smoking pipes or your funky collection of vintage paperweights. Try grouping like colors together to make it look intentional. Prop up anything you want to stand out. For example, you may set something on a small pedestal to make it the most important part of the collection."
        },
        {
          "headline":"Let the color shine through if you have interestingly shaped shelves.",
          "description":"In some cases, you can just paint the inside of the shelves and use a single item to display, such as a plant. If the rest of the room is fairly monochromatic, the shelves will act as sort of art piece on their own. This works best for shelves that have arches or other interesting shapes."
        },
        {
          "headline":"Store functional but unconventional items on your shelves.",
          "description":"For instance, you could set up your bar in your shelves, stacking the glasses, alcohol, ice buckets, and any other accoutrements on various shelves. It's a great way to free up space elsewhere, and it adds its own decorative touch. Try using it to store your decorative cookware or your fabric collection (stacked neatly!) Add baskets to the bottom shelves for kid or dog toys to store discretely."
        },
        {
          "headline":"Hit thrift stores and garage sales for unique and funky items to fill in empty spaces.",
          "description":"If you don't have quite enough items to fill the shelves, start scouring your local scene for fun items. Choose things that fit your overall theme and that are funky and unique. For instance, maybe all your items are made of glass. Go thrifting to find similar items made of that same material. If you find something that you like that's not quite the right color, just paint it! This is a great option for dollar store items. For instance, if you have a lot of animal-themed items but your color scheme is black and white, paint tiny plastic toy animals in those colors."
        }
      ]
    },
    {
      "name":"Creating Visual Interest and Balance",
      "steps":[
        {
          "headline":"Mix sizes on your shelves to keep your decor from getting boring.",
          "description":"Pick large items, small items, and medium items to place on your shelves. If all your items are the same size, your displays could become visually dull. For instance, try placing a large item on the back of a shelf with a medium and a small item grouped in front of it. Try getting 3 different objects that are all different sizes to look the most balanced."
        },
        {
          "headline":"Make groups of themed items if you want to break up collections.",
          "description":"A collection of items can be fun to show off, but it also can get a little monotonous if you display the same thing across multiple shelves. Instead, balance those treasures with other items that fit the general theme. For instance, if you're showing off your cookware, add fancy jars of olive oil or baskets of wheat. If you're displaying a vintage smoking pipe collection, add antique tobacco tins, fancy ashtrays, or even a silhouette of Sherlock Holmes. Only display the things that look the best so your shelves don’t get too cluttered with objects."
        },
        {
          "headline":"Create a sense of balance through symmetry.",
          "description":"While you don't want to create perfect symmetry—that can get boring—a general sense of the shelves being symmetrical can make them feel balanced. Try to group some large items on one side and some on the other side of the shelves to balance it out. The same goes for smaller items. For instance, if you have a big globe that you love, set it on one end of a shelf. On the shelf above it, put another large item or group of items on the other end to help balance it out. Take a few steps back every so often so you can see how your arrangement looks at a distance."
        },
        {
          "headline":"Move things around to see what looks best in each area.",
          "description":"Group a set of items over to the left on a shelf, and then try one of those items in the middle of another shelf. Keep moving things around to figure out the best arrangement, as you never know what will look good until you put it together on the shelf. Try stepping back from the shelf to see what it looks like."
        },
        {
          "headline":"Be selective so you don't overcrowd the shelves.",
          "description":"Too many items on the shelves will look messy and can leave you feeling unsettled if it's too busy. Make room for negative space (space with nothing in it) by taking some items off if the shelves are crowded. When you're styling your shelves, try to see it with fresh eyes. Ask yourself if the space makes you feel calm or anxious. If you feel anxious, there may be too much on your shelves. Start with a few objects and add onto them selectively so you don’t overcrowd the space. You don’t need to add everything you originally planned on."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Painting and Modifying the Shelves Limit the color scheme of the backdrops and items to create cohesiveness. When painting, upholstering, or applying wallpaper to your shelves, stick to a predetermined color scheme. Try picking a bright color and mix it with a neutral color so it won't be visually overwhelming. For instance, try mixing tan with blue, white with yellow, or gray with purple. Another option is to take shades of one color, such as all yellows or blues. You could also paint each shelf a different color to create a rainbow effect. Paint the inside of the shelves a darker color to highlight your favorite items. The items you feature in your bookshelves will show look more prominent and eye-catching against a backdrop. Try picking a color that matches the rest of the room, but go a shade or two darker to make it stand out. For instance, if the room has light purples, pick a darker purple in the same tones. Glue fabric on the back panels of the shelves to tie in your furniture. Fabric can help connect the shelves to the rest of the room if you use similar textures and colors. Cut the fabric to fit with a little extra to fold over on the ends. Then, fold the edges over and use fabric glue to create a hem all around the edges. Use a hot glue gun to add a few dots of glue on the inside of the shelf at the back. Tack the fabric into place so it forms a backdrop for your shelves. You could also wrap the fabric around the shelves themselves instead. Use the same or similar fabric as ones on your throw pillows or blankets to make your space seem cohesive. Create depth by installing mirrors at the back of the shelves. Mirrors make the area look bigger by reflecting the space, so try this option instead of painting or fabric if your bookshelves are in a smaller room. Buy mirrors the right size to place as backdrops on the shelves. Use hot glue or silicone to hold them in place. Measure the inside back panel with a tape measure, stretching it across the length and height to get the proper dimensions. If you can't find mirrors that are the correct size, try cutting a larger mirror to shape. Stick a fun wallpaper on the shelves for a whimsical look. Use the wallpaper as a backdrop or even to cover the shelves themselves. Cut the paper to fit, then peel off one end. Line it up on the shelf or the backdrop area, then slowly unpeel the rest of the paper off the back as you rub it into place. Pick something fun and playful or try something serious. Draw in colors and themes from the rest of the room. Most wallpaper is self-sticking. You don't need to use adhesive. You can also try using contact paper if you’re working on a budget. Picking Items for Your Shelves Paint and layer empty picture frames on the shelves for a geometric effect. Pick frames in all different sizes and shapes and paint them in your theme colors. Put larger ones in the back, leaning them up against the back of the shelf. Put smaller ones in front, choosing different shapes to make it more interesting. Create a tribute to your family with photos and heirlooms. Your bookshelves are a great place to display your favorite family photos. Pick interesting frames in different shapes to create interest. Add family heirlooms and a few knickknacks that are special to your family to complete the picture. For instance, if your family loves apples, throw a few decorative apples into the mix. You could also display quotes that are special to your family. Don’t add too much or else your space will look cluttered. Display personal collections and artistic creations in your bookshelves. Whether you're showing off a clay statue your kid made in ceramics or a priceless antique, your bookshelves are a great place to keep things you're proud of. Add knickknacks you picked up on your travels or make a collection of family art. Alternatively, show off your collection of antique smoking pipes or your funky collection of vintage paperweights. Try grouping like colors together to make it look intentional. Prop up anything you want to stand out. For example, you may set something on a small pedestal to make it the most important part of the collection. Let the color shine through if you have interestingly shaped shelves. In some cases, you can just paint the inside of the shelves and use a single item to display, such as a plant. If the rest of the room is fairly monochromatic, the shelves will act as sort of art piece on their own. This works best for shelves that have arches or other interesting shapes. Store functional but unconventional items on your shelves. For instance, you could set up your bar in your shelves, stacking the glasses, alcohol, ice buckets, and any other accoutrements on various shelves. It's a great way to free up space elsewhere, and it adds its own decorative touch. Try using it to store your decorative cookware or your fabric collection (stacked neatly!) Add baskets to the bottom shelves for kid or dog toys to store discretely. Hit thrift stores and garage sales for unique and funky items to fill in empty spaces. If you don't have quite enough items to fill the shelves, start scouring your local scene for fun items. Choose things that fit your overall theme and that are funky and unique. For instance, maybe all your items are made of glass. Go thrifting to find similar items made of that same material. If you find something that you like that's not quite the right color, just paint it! This is a great option for dollar store items. For instance, if you have a lot of animal-themed items but your color scheme is black and white, paint tiny plastic toy animals in those colors. Creating Visual Interest and Balance Mix sizes on your shelves to keep your decor from getting boring. Pick large items, small items, and medium items to place on your shelves. If all your items are the same size, your displays could become visually dull. For instance, try placing a large item on the back of a shelf with a medium and a small item grouped in front of it. Try getting 3 different objects that are all different sizes to look the most balanced. Make groups of themed items if you want to break up collections. A collection of items can be fun to show off, but it also can get a little monotonous if you display the same thing across multiple shelves. Instead, balance those treasures with other items that fit the general theme. For instance, if you're showing off your cookware, add fancy jars of olive oil or baskets of wheat. If you're displaying a vintage smoking pipe collection, add antique tobacco tins, fancy ashtrays, or even a silhouette of Sherlock Holmes. Only display the things that look the best so your shelves don’t get too cluttered with objects. Create a sense of balance through symmetry. While you don't want to create perfect symmetry—that can get boring—a general sense of the shelves being symmetrical can make them feel balanced. Try to group some large items on one side and some on the other side of the shelves to balance it out. The same goes for smaller items. For instance, if you have a big globe that you love, set it on one end of a shelf. On the shelf above it, put another large item or group of items on the other end to help balance it out. Take a few steps back every so often so you can see how your arrangement looks at a distance. Move things around to see what looks best in each area. Group a set of items over to the left on a shelf, and then try one of those items in the middle of another shelf. Keep moving things around to figure out the best arrangement, as you never know what will look good until you put it together on the shelf. Try stepping back from the shelf to see what it looks like. Be selective so you don't overcrowd the shelves. Too many items on the shelves will look messy and can leave you feeling unsettled if it's too busy. Make room for negative space (space with nothing in it) by taking some items off if the shelves are crowded. When you're styling your shelves, try to see it with fresh eyes. Ask yourself if the space makes you feel calm or anxious. If you feel anxious, there may be too much on your shelves. Start with a few objects and add onto them selectively so you don’t overcrowd the space. You don’t need to add everything you originally planned on. Finished. ",
  "tyn_model":[
    "fabric",
    "wallpaper",
    "mirrors",
    "shelf",
    "paper",
    "apples",
    "fabric glue",
    "hot glue gun",
    "glue",
    "throw pillows",
    "hot glue",
    "silicone",
    "tape measure",
    "mirror",
    "contact paper",
    "smoking pipes",
    "glasses",
    "alcohol",
    "ice buckets",
    "baskets",
    "glass",
    "paint",
    "olive oil",
    "ashtrays",
    "—that",
    "—a",
    "globe"
  ],
  "tyn_section":[

  ]
}