{
  "title":"How to Do a Woven Wheel Stitch",
  "url":"https://www.wikihow.com/Do-a-Woven-Wheel-Stitch",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Cross Stitch"
  ],
  "methods":[
    {
      "name":"Creating the Spokes",
      "steps":[
        {
          "headline":"Thread a needle with 2 strands of embroidery floss.",
          "description":"Cut a length of embroidery floss that is about the length of your arm from hand to shoulder. Then, pull 2 strands away from the 6 strands in the floss. Set the other stands aside to use when you run out. Insert the 2 strands through the eye of a tapestry needle and pull the floss until it is about 1/3 of the way through the eye. You may also want to tie a knot in the end of the embroidery floss to ensure that it does not slip through the fabric when you make the first stitch."
        },
        {
          "headline":"Mark your fabric to indicate the centerpoint and ends of the spokes.",
          "description":"If your fabric is not already marked to indicate the center of the wheel and where each of the spokes will end, make these marks yourself. Use a pen or fabric marker. Position the spoke marks so that they are equidistant from the centerpoint. Make an odd number of marks around the centerpoint so that you will end up with an odd number of spokes. For example, you could create a wheel with 9, 13, or 17 spokes."
        },
        {
          "headline":"Insert the needle through the back of your work.",
          "description":"Identify where you want the end of 1 of the spokes of the wheel to be. Then, push the needle up through the fabric at this location until the knot is right up against the back of the fabric. Be careful not to pull the knot through!"
        },
        {
          "headline":"Bring the tip of the needle back down through the centerpoint.",
          "description":"Find where you want the centerpoint of the spoke to be, and then push the needle down through the front side of the fabric at this location. This distance will be half the diameter of the wheel, so consider the desired diameter if you are not using a pattern. For example, if you want a 2 in (5.1 cm) wide wheel, then insert the needle into the fabric 1 in (2.5 cm) from the end point of the spoke. Pull until the thread is taut after you insert it through the center, but don’t pull so hard that the fabric puckers. You should have 1 spoke at this point."
        },
        {
          "headline":"Push the needle back up through another spoke mark.",
          "description":"Identify the end of the next spoke and push your needle up through the back of the fabric at this location. Pull the thread until it is taut. The back of your fabric will look a little messy as you create the foundation for this stitch, but that’s normal."
        },
        {
          "headline":"Insert the needle through the center again and repeat the process.",
          "description":"Bring the needle back down through the center of the wheel and pull the thread taut to create your second spoke. Keep doing this until you have created the desired number of spokes. Remember to make sure that you end up with an odd number of spokes or the stitch won’t work properly. Tip: If you’re following a pattern, then it might feature spokes in different lengths to give the appearance that the design is being overlapped by other elements. Follow the pattern closely and create spokes in the required lengths for the design."
        }
      ]
    },
    {
      "name":"Weaving around the Spokes",
      "steps":[
        {
          "headline":"Insert the needle through the back of the fabric.",
          "description":"Locate the center of the spokes and push the needle through the fabric right along this point. Ensure that the needle comes up near the center, but between 2 of the spokes. Pull until the thread is taut. Don't bring the needle right through the center. Bring it up through the fabric right next to the center."
        },
        {
          "headline":"Weave the thread under the first spoke and over the next.",
          "description":"Insert the needle through the space between the thread and the fabric to weave under the first spoke. Then, bring the needle over the next spoke to weave over. Do not push the needle down through the fabric. Keep it between the thread and fabric as you weave over and under."
        },
        {
          "headline":"Continue weaving over and under going all the way around the wheel.",
          "description":"By making an odd number of spokes, you will weave over certain spokes on 1 round and weave under them on the next round. You do not need to keep track of the rounds. Go over and under the spokes without skipping any or changing direction.Tip: Make sure to keep the tension tight on the thread as you weave over and under the spokes. This will allow you to create more layers and get a fuller looking wheel."
        }
      ]
    },
    {
      "name":"Finishing the Wheel",
      "steps":[
        {
          "headline":"Weave until the spokes are not visible.",
          "description":"If you are working on a wheel that overlaps other designs or that is a standalone design, you can work the woven wheel stitch all the way to the ends of the spokes. Keep weaving in and out of the spokes until the ends are no longer visible. Keep in mind that when the flower underlaps other flowers, you will not be able to weave all the way out to the ends of the spokes. In this case, you will need to use a different stitch, such as a backstitch, to fill in the spaces between the remaining spokes."
        },
        {
          "headline":"Backstitch to fill in and secure the outside of the flower.",
          "description":"Insert the needle into your fabric from the back side and pull the thread taut. Push the needle back down through the front side of the fabric about 0.25 in (0.64 cm) from where it came out of the fabric. Then, bring the needle up through the fabric again about 0.25 in (0.64 cm) ahead of where you pushed it down through the fabric. Insert the needle through the front side of the fabric at the location of your previous stitch. Use this stitch to fill in remaining spokes once you reach the end of the shortest spoke. You can make the stitches longer if you prefer, such as by backstitching from 1 spoke to the next. This will help you to retain the appearance of the woven wheel stitch. Backstitching around the outside of the flower 1 time will make the stitches extra secure and you can also use a contrasting color to add a visible border to your design. For example, you could border a lavender wheel with dark purple, or use white or black thread to add even more contrast."
        },
        {
          "headline":"Insert the needle near the edge of the spokes and tie a knot.",
          "description":"After you are done filling in and outlining your woven wheel design, push the needle into the fabric right along the edge of the woven wheel. Try to get the needle slightly under the edge of the woven wheel to hide this stitch. Tie a knot in the thread on the back side of the fabric to secure it. Your woven wheel is complete! Make more by following the same process. Tip: Try adding French knots to the center of your woven wheel design to make it look more like a flower. Use a contrasting color thread, such as black with bright red or yellow with purple."
        }
      ]
    }
  ],
  "text":" Creating the Spokes Thread a needle with 2 strands of embroidery floss. Cut a length of embroidery floss that is about the length of your arm from hand to shoulder. Then, pull 2 strands away from the 6 strands in the floss. Set the other stands aside to use when you run out. Insert the 2 strands through the eye of a tapestry needle and pull the floss until it is about 1/3 of the way through the eye. You may also want to tie a knot in the end of the embroidery floss to ensure that it does not slip through the fabric when you make the first stitch. Mark your fabric to indicate the centerpoint and ends of the spokes. If your fabric is not already marked to indicate the center of the wheel and where each of the spokes will end, make these marks yourself. Use a pen or fabric marker. Position the spoke marks so that they are equidistant from the centerpoint. Make an odd number of marks around the centerpoint so that you will end up with an odd number of spokes. For example, you could create a wheel with 9, 13, or 17 spokes. Insert the needle through the back of your work. Identify where you want the end of 1 of the spokes of the wheel to be. Then, push the needle up through the fabric at this location until the knot is right up against the back of the fabric. Be careful not to pull the knot through! Bring the tip of the needle back down through the centerpoint. Find where you want the centerpoint of the spoke to be, and then push the needle down through the front side of the fabric at this location. This distance will be half the diameter of the wheel, so consider the desired diameter if you are not using a pattern. For example, if you want a 2 in (5.1 cm) wide wheel, then insert the needle into the fabric 1 in (2.5 cm) from the end point of the spoke. Pull until the thread is taut after you insert it through the center, but don’t pull so hard that the fabric puckers. You should have 1 spoke at this point. Push the needle back up through another spoke mark. Identify the end of the next spoke and push your needle up through the back of the fabric at this location. Pull the thread until it is taut. The back of your fabric will look a little messy as you create the foundation for this stitch, but that’s normal. Insert the needle through the center again and repeat the process. Bring the needle back down through the center of the wheel and pull the thread taut to create your second spoke. Keep doing this until you have created the desired number of spokes. Remember to make sure that you end up with an odd number of spokes or the stitch won’t work properly. Tip: If you’re following a pattern, then it might feature spokes in different lengths to give the appearance that the design is being overlapped by other elements. Follow the pattern closely and create spokes in the required lengths for the design. Weaving around the Spokes Insert the needle through the back of the fabric. Locate the center of the spokes and push the needle through the fabric right along this point. Ensure that the needle comes up near the center, but between 2 of the spokes. Pull until the thread is taut. Don't bring the needle right through the center. Bring it up through the fabric right next to the center. Weave the thread under the first spoke and over the next. Insert the needle through the space between the thread and the fabric to weave under the first spoke. Then, bring the needle over the next spoke to weave over. Do not push the needle down through the fabric. Keep it between the thread and fabric as you weave over and under. Continue weaving over and under going all the way around the wheel. By making an odd number of spokes, you will weave over certain spokes on 1 round and weave under them on the next round. You do not need to keep track of the rounds. Go over and under the spokes without skipping any or changing direction.Tip: Make sure to keep the tension tight on the thread as you weave over and under the spokes. This will allow you to create more layers and get a fuller looking wheel. Finishing the Wheel Weave until the spokes are not visible. If you are working on a wheel that overlaps other designs or that is a standalone design, you can work the woven wheel stitch all the way to the ends of the spokes. Keep weaving in and out of the spokes until the ends are no longer visible. Keep in mind that when the flower underlaps other flowers, you will not be able to weave all the way out to the ends of the spokes. In this case, you will need to use a different stitch, such as a backstitch, to fill in the spaces between the remaining spokes. Backstitch to fill in and secure the outside of the flower. Insert the needle into your fabric from the back side and pull the thread taut. Push the needle back down through the front side of the fabric about 0.25 in (0.64 cm) from where it came out of the fabric. Then, bring the needle up through the fabric again about 0.25 in (0.64 cm) ahead of where you pushed it down through the fabric. Insert the needle through the front side of the fabric at the location of your previous stitch. Use this stitch to fill in remaining spokes once you reach the end of the shortest spoke. You can make the stitches longer if you prefer, such as by backstitching from 1 spoke to the next. This will help you to retain the appearance of the woven wheel stitch. Backstitching around the outside of the flower 1 time will make the stitches extra secure and you can also use a contrasting color to add a visible border to your design. For example, you could border a lavender wheel with dark purple, or use white or black thread to add even more contrast. Insert the needle near the edge of the spokes and tie a knot. After you are done filling in and outlining your woven wheel design, push the needle into the fabric right along the edge of the woven wheel. Try to get the needle slightly under the edge of the woven wheel to hide this stitch. Tie a knot in the thread on the back side of the fabric to secure it. Your woven wheel is complete! Make more by following the same process. Tip: Try adding French knots to the center of your woven wheel design to make it look more like a flower. Use a contrasting color thread, such as black with bright red or yellow with purple.",
  "tyn_model":[
    "fabric",
    "needle",
    "thread",
    "embroidery floss",
    "woven wheel",
    "tapestry needle",
    "floss",
    "pen",
    "fabric marker",
    "flowers"
  ],
  "tyn_section":[

  ]
}