{
  "title":"How to Cook Pumpkin Seeds",
  "url":"https://www.wikihow.com/Cook-Pumpkin-Seeds",
  "category_hierarchy":[
    "Food and Entertaining",
    "Nuts and Seeds"
  ],
  "methods":[
    {
      "name":"Basic Toasted Pumpkin Seeds with Salt",
      "steps":[
        {
          "headline":"Preheat oven to 375 degrees Fahrenheit (190 degrees Celsius).",
          "description":""
        },
        {
          "headline":"Rinse the pumpkin seeds in a colander.",
          "description":"Remove any strings or pulp that are still attached to them. It's easiest to clean the pumpkin seeds immediately after they have been removed from the pumpkin."
        },
        {
          "headline":"Spread the seeds out evenly on an oiled baking sheet.",
          "description":"You can either use olive oil, vegetable oil, or cooking spray to coat the baking sheet."
        },
        {
          "headline":"Sprinkle the seeds with salt and bake for 20-30 minutes, or until golden brown.",
          "description":"Stir the seeds after about 10 minutes so that they cook evenly."
        }
      ]
    },
    {
      "name":"Toasted Pumpkin Seeds with Olive Oil and Pepper",
      "steps":[
        {
          "headline":"Preheat oven to 375 degrees Fahrenheit (190 degrees Celsius).",
          "description":""
        },
        {
          "headline":"Spread pumpkin seeds in an even layer on a baking sheet.",
          "description":"Drizzle the seeds with olive oil, and then sprinkle with salt and freshly ground pepper. Toss the seeds so that they are evenly coated."
        },
        {
          "headline":"Bake for 10-15 minutes.",
          "description":"Seeds should be light brown and crispy."
        }
      ]
    },
    {
      "name":"Sweet and Spicy Pumpkin Seeds",
      "steps":[
        {
          "headline":"Preheat oven to 300 degrees Fahrenheit (150 degrees Celsius).",
          "description":"Use aluminum foil to line a baking sheet."
        },
        {
          "headline":"Stir pumpkin seeds and butter together in a bowl.",
          "description":"Add salt, Worcestershire sauce, hot sauce, and brown sugar. Mix the ingredients together so that the seeds are completely coated."
        },
        {
          "headline":"Spread the seeds out in an even layer on the baking sheet.",
          "description":"Bake for about 45 minutes, or until crispy."
        }
      ]
    }
  ],
  "text":" Basic Toasted Pumpkin Seeds with Salt Preheat oven to 375 degrees Fahrenheit (190 degrees Celsius).  Rinse the pumpkin seeds in a colander. Remove any strings or pulp that are still attached to them. It's easiest to clean the pumpkin seeds immediately after they have been removed from the pumpkin. Spread the seeds out evenly on an oiled baking sheet. You can either use olive oil, vegetable oil, or cooking spray to coat the baking sheet. Sprinkle the seeds with salt and bake for 20-30 minutes, or until golden brown. Stir the seeds after about 10 minutes so that they cook evenly. Toasted Pumpkin Seeds with Olive Oil and Pepper Preheat oven to 375 degrees Fahrenheit (190 degrees Celsius).  Spread pumpkin seeds in an even layer on a baking sheet. Drizzle the seeds with olive oil, and then sprinkle with salt and freshly ground pepper. Toss the seeds so that they are evenly coated. Bake for 10-15 minutes. Seeds should be light brown and crispy. Sweet and Spicy Pumpkin Seeds Preheat oven to 300 degrees Fahrenheit (150 degrees Celsius). Use aluminum foil to line a baking sheet. Stir pumpkin seeds and butter together in a bowl. Add salt, Worcestershire sauce, hot sauce, and brown sugar. Mix the ingredients together so that the seeds are completely coated. Spread the seeds out in an even layer on the baking sheet. Bake for about 45 minutes, or until crispy.",
  "tyn_model":[
    "baking sheet",
    "olive oil",
    "salt",
    "oven",
    "pumpkin seeds",
    "colander",
    "vegetable oil",
    "cooking spray",
    "pepper",
    "freshly ground pepper",
    "aluminum foil",
    "butter",
    "bowl",
    "worcestershire sauce",
    "hot sauce",
    "brown sugar"
  ],
  "tyn_section":[

  ]
}