{
  "title":"How to Measure the Diameter of a Tree",
  "url":"https://www.wikihow.com/Measure-the-Diameter-of-a-Tree",
  "category_hierarchy":[
    "Home and Garden",
    "Tools",
    "Measuring and Marking Tools"
  ],
  "methods":[
    {
      "name":"Using Household Items to Take Quick Measurements",
      "steps":[
        {
          "headline":"Use a common 12 inches (30 cm) ruler to measure a small tree.",
          "description":"This is a great technique for a quick estimate, but not ideal for taking a precise measurement. Hold the ruler against the tree at DBH. Line up the edge of the ruler with the left edge of the tree and read the measurement where the right side of the tree visually lines up with the ruler. This method is best only when you want a very rough and fast estimate of a tree’s diameter."
        },
        {
          "headline":"Find the tree's circumference with a measuring tape and divide by pi.",
          "description":"Just wrap a common measuring tape all the way around the middle of the tree at DBH. Record the circumference at the point where the two ends of the tape meet. Then, all you need to do to calculate the diameter is divide that number by pi (3.1416). Using a cloth measuring tape (like a tailor would use) is better than a common household metal tape measure because it is more flexible and will conform to the shape of the tree."
        },
        {
          "headline":"Measure circumference precisely with a string and calculate diameter.",
          "description":"For this method, wrap a long string around the tree at DBH and cut the string where it meets. Then, measure that length with a measuring tape or yardstick to find the circumference and divide that number by pi (3.1416) to get the diameter. Using a string to take the circumference measurement is more accurate that just using a measuring tape because the string is more flexible and bends easier to the tree. If the tree is very big, you can either recruit a friend to help with this method or bring along a thumb tack to secure the string to the tree."
        }
      ]
    },
    {
      "name":"Measuring with Professional Specialty Tools",
      "steps":[
        {
          "headline":"Take an easy measurement with a tree caliper.",
          "description":"To use a tree caliper, open the caliper wider than the tree, place its arms on either side at DBH, and close the caliper as tight as it will go around the tree. Then, read the number on the caliper at the point where the lower arm stopped on the guide to find the diameter. If the tree is oblong, take two measurements, one on the wide side and one on the narrow side, and calculate the average of both. If the tree is leaning, hold the caliper at the same angle of the lean. It should be perpendicular to the tree."
        },
        {
          "headline":"Hold a tree-scale stick up to the tree for an estimated measurement.",
          "description":"Hold the stick against the tree at DBH and 25 inches (64 cm) from your eyes. Then line up the left edge of the stick to the left edge of the tree and read the number on the stick that lines up with the right edge of the tree. Like the ruler method, this is not the most accurate way of measuring diameter, but is useful if you want a rough estimate."
        },
        {
          "headline":"Get an accurate measurement by wrapping D-Tape around the trunk.",
          "description":"Diameter tape or “D-Tape” is the most common tool that foresters use to measure tree diameters. All you have to do to use the tape is wrap it around the tree at DBH and read the number where the tape meets. This number is the diameter of the tree and there are no further calculations necessary. Even if your tree is irregularly shaped, the D-Tape method provides a close and acceptable estimate."
        }
      ]
    }
  ],
  "text":" Using Household Items to Take Quick Measurements Use a common 12 inches (30 cm) ruler to measure a small tree. This is a great technique for a quick estimate, but not ideal for taking a precise measurement. Hold the ruler against the tree at DBH. Line up the edge of the ruler with the left edge of the tree and read the measurement where the right side of the tree visually lines up with the ruler. This method is best only when you want a very rough and fast estimate of a tree’s diameter. Find the tree's circumference with a measuring tape and divide by pi. Just wrap a common measuring tape all the way around the middle of the tree at DBH. Record the circumference at the point where the two ends of the tape meet. Then, all you need to do to calculate the diameter is divide that number by pi (3.1416). Using a cloth measuring tape (like a tailor would use) is better than a common household metal tape measure because it is more flexible and will conform to the shape of the tree. Measure circumference precisely with a string and calculate diameter. For this method, wrap a long string around the tree at DBH and cut the string where it meets. Then, measure that length with a measuring tape or yardstick to find the circumference and divide that number by pi (3.1416) to get the diameter. Using a string to take the circumference measurement is more accurate that just using a measuring tape because the string is more flexible and bends easier to the tree. If the tree is very big, you can either recruit a friend to help with this method or bring along a thumb tack to secure the string to the tree. Measuring with Professional Specialty Tools Take an easy measurement with a tree caliper. To use a tree caliper, open the caliper wider than the tree, place its arms on either side at DBH, and close the caliper as tight as it will go around the tree. Then, read the number on the caliper at the point where the lower arm stopped on the guide to find the diameter. If the tree is oblong, take two measurements, one on the wide side and one on the narrow side, and calculate the average of both. If the tree is leaning, hold the caliper at the same angle of the lean. It should be perpendicular to the tree. Hold a tree-scale stick up to the tree for an estimated measurement. Hold the stick against the tree at DBH and 25 inches (64 cm) from your eyes. Then line up the left edge of the stick to the left edge of the tree and read the number on the stick that lines up with the right edge of the tree. Like the ruler method, this is not the most accurate way of measuring diameter, but is useful if you want a rough estimate. Get an accurate measurement by wrapping D-Tape around the trunk. Diameter tape or “D-Tape” is the most common tool that foresters use to measure tree diameters. All you have to do to use the tape is wrap it around the tree at DBH and read the number where the tape meets. This number is the diameter of the tree and there are no further calculations necessary. Even if your tree is irregularly shaped, the D-Tape method provides a close and acceptable estimate.",
  "tyn_model":[
    "ruler",
    "measuring tape",
    "string",
    "tree caliper",
    "caliper",
    "d-tape",
    "tape",
    "tape measure",
    "tree-scale stick",
    "stick",
    "diameter tape",
    "“d",
    "” is"
  ],
  "tyn_section":[

  ]
}