{
  "title":"How to Cancel Xbox Live",
  "url":"https://www.wikihow.com/Cancel-Xbox-Live",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox"
  ],
  "steps":[
    {
      "headline":"Open the Xbox website.",
      "description":"Go to http://www.xbox.com/en-US/ in your preferred browser."
    },
    {
      "headline":"Sign into your Xbox LIVE account.",
      "description":"Click Sign in in the top-right corner, then enter your email address and password. This will reload the page with your account logged in, though you may have to click Sign in again and select your account at the bottom of the drop-down menu. If you're already signed into your Xbox LIVE account, skip this step. If your login credentials are saved in your browser, clicking Sign in will prompt a drop-down menu from which you can select your account."
    },
    {
      "headline":"Click your profile picture.",
      "description":"It's in the upper-right corner of the page. If you don't have a profile picture, this will be a silhouette of a person's head and shoulders. Doing so prompts a drop-down menu."
    },
    {
      "headline":"Click Subscriptions.",
      "description":"This option is near the bottom of the drop-down menu."
    },
    {
      "headline":"Scroll down to the \"Xbox Live Gold\" option.",
      "description":"You'll find this green, Xbox logo-shaped option near the middle of the page."
    },
    {
      "headline":"Click Payment & billing.",
      "description":"This link is below the \"Xbox Live Gold\" heading. Doing so will take you to the Xbox Live Gold subscription page."
    },
    {
      "headline":"Click Cancel.",
      "description":"This link is to the right of the \"Xbox Live Gold\" heading near the top of the \"Payment Settings\" section. Clicking Cancel will prompt a pop-up menu. You may have to scroll up to see this option."
    },
    {
      "headline":"Click Confirm cancellation when prompted.",
      "description":"Doing so will stop your Xbox Live membership from auto-renewing (and auto-charging your account) when the subscription's time is up."
    }
  ],
  "text":" Open the Xbox website. Go to http://www.xbox.com/en-US/ in your preferred browser. Sign into your Xbox LIVE account. Click Sign in in the top-right corner, then enter your email address and password. This will reload the page with your account logged in, though you may have to click Sign in again and select your account at the bottom of the drop-down menu. If you're already signed into your Xbox LIVE account, skip this step. If your login credentials are saved in your browser, clicking Sign in will prompt a drop-down menu from which you can select your account. Click your profile picture. It's in the upper-right corner of the page. If you don't have a profile picture, this will be a silhouette of a person's head and shoulders. Doing so prompts a drop-down menu. Click Subscriptions. This option is near the bottom of the drop-down menu. Scroll down to the \"Xbox Live Gold\" option. You'll find this green, Xbox logo-shaped option near the middle of the page. Click Payment & billing. This link is below the \"Xbox Live Gold\" heading. Doing so will take you to the Xbox Live Gold subscription page. Click Cancel. This link is to the right of the \"Xbox Live Gold\" heading near the top of the \"Payment Settings\" section. Clicking Cancel will prompt a pop-up menu. You may have to scroll up to see this option. Click Confirm cancellation when prompted. Doing so will stop your Xbox Live membership from auto-renewing (and auto-charging your account) when the subscription's time is up.",
  "tyn_model":[
    "xbox live gold",
    "xbox live account",
    "xbox live"
  ],
  "tyn_section":[

  ]
}