{
  "title":"How to Make a Photo Collage on Facebook on iPhone or iPad",
  "url":"https://www.wikihow.com/Make-a-Photo-Collage-on-Facebook-on-iPhone-or-iPad",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Collages"
  ],
  "methods":[
    {
      "name":"Using PicCollage",
      "steps":[
        {
          "headline":"Open the App Store app {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/5\\/55\\/Iphoneappstoreicon.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/5\\/55\\/Iphoneappstoreicon.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":760,\"bigHeight\":760,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of an iOS icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a><br>\\n<\\/p><\\/div>\"}.",
          "description":"This has a blue icon with a white “A” in it that can be accessed from the main screen."
        },
        {
          "headline":"Navigate to PicCollage.",
          "description":"Simply type “pic collage” into the search bar to pull it up in your search results. It’ll have a multi-colored icon that looks like a camera."
        },
        {
          "headline":"Tap GET.",
          "description":"This will download and install PicCollage onto your iPhone or iPad."
        },
        {
          "headline":"Open the PicCollage app.",
          "description":""
        },
        {
          "headline":"Tap the blue-green plus (+) button.",
          "description":"This will start a new collage and will direct you to a pop-up dialogue asking for PicCollage to have access to your phone’s camera storage. Tap OK to allow PicCollage access so you can select photos."
        },
        {
          "headline":"Select the photos you want to include in your collage.",
          "description":"You’ll have the option to upload photos from your phone’s gallery, Facebook, or Google Photos along the top of the menu page."
        },
        {
          "headline":"Tap the green button with a white number and check mark in it.",
          "description":"This will appear in the top-right corner once you’ve selected your pictures and will direct you to the next step."
        },
        {
          "headline":"Select an aspect ratio and layout for your collage.",
          "description":"The aspect ratio option appears as a small white circle in the bottom-left of the preview display for your collage. You can select a layout by scrolling through the options listed below the preview display and tapping the button with sliders on it."
        },
        {
          "headline":"Tap Next.",
          "description":""
        },
        {
          "headline":"Edit the pictures’ arrangement and display.",
          "description":"Simply tap on a picture and drag it to rearrange the order of pictures, or tap on the blue double arrow icon that appears on the top-right corner of the picture to pull up more options for editing that picture."
        },
        {
          "headline":"Tap Done.",
          "description":"This is in the bottom-right corner and will save your finished collage."
        },
        {
          "headline":"Select Facebook on the Save or Share page.",
          "description":"Once you’ve completed your collage, you’ll be directed to a menu where you can select a method for saving or sharing your collage, including to Facebook."
        },
        {
          "headline":"Grant PicCollage access to your Facebook profile.",
          "description":"Before you can post any collages, you’ll need to let PicCollage be able to post to your Facebook page. Simply tap Allow in the dialog box that pops up and select the share settings you’d like for your collage, and it’ll be posted to Facebook immediately."
        },
        {
          "headline":"Write a post for your collage.",
          "description":"Once you've selected to share your collage on Facebook, you'll be directed to a new window where you can write a post for it and select who can see it when it's posted."
        },
        {
          "headline":"Tap Share.",
          "description":"This will post your collage on your Facebook timeline."
        }
      ]
    },
    {
      "name":"Using PicsArt Photo Editor",
      "steps":[
        {
          "headline":"Open the App Store app.",
          "description":"This has a blue icon with a white “A” in it that can be accessed from the main screen."
        },
        {
          "headline":"Navigate to the PicsArt Photo Editor app.",
          "description":"Simply type “picsart” into the search bar to pull it up in your search results. It’ll have a multi-colored icon that looks like a camera."
        },
        {
          "headline":"Tap GET.",
          "description":"This will download and install PicsArt Photo Editor onto your iPhone or iPad."
        },
        {
          "headline":"Open the PicsArt Photo Editor app.",
          "description":""
        },
        {
          "headline":"Create a PicsArt account.",
          "description":"You can link a social media account or sign up via email, following the on-screen instructions. You can also tap Skip to continue without an account."
        },
        {
          "headline":"Tap the purple plus (+) button.",
          "description":"This is in the center of a menu pane at the bottom of the screen and will open the menu for starting a new photo editing project."
        },
        {
          "headline":"Scroll down to the Collages heading and select a layout.",
          "description":"The three main layouts are: Grids, Freestyle, and Frames."
        },
        {
          "headline":"Select photos for your collage.",
          "description":"You can search for photos on your phone’s camera or for free images by clicking the magnifying glass icon in the top-left corner of the menu."
        },
        {
          "headline":"Tap the purple Next button in the top-right corner.",
          "description":"This will direct you to the page for editing your collage."
        },
        {
          "headline":"Select your collage’s layout, border, color, and background.",
          "description":"To adjust the layout, tap the Layout icon beneath and toggle through the different options to select your preferred layout. Tap on Border to select your preferred border for your collage. Tap on Color to choose different coloring options to brighten your collage. Tap on Background to customize the image that appears as the background for your collage and how the background is formatted."
        },
        {
          "headline":"Tap the white Next button in the top-right corner.",
          "description":""
        },
        {
          "headline":"Select effects for your collage.",
          "description":"A banner beneath your collage will list different options for customizing the way your photos appear. Once you select an effect, toggle it to your preferred setting and tap the white check icon in the top-right of the effect’s menu to save it to your collage."
        },
        {
          "headline":"Tap the white Next button in the top-right corner.",
          "description":"This will direct you to the page for sharing collage to social media."
        },
        {
          "headline":"Select Facebook as your sharing method.",
          "description":"A pop-up dialog will appear asking for PicsArt to be granted permission to access your Facebook profile. Tap Allow in the pop-up menu and select your profile to post your collage on Facebook."
        },
        {
          "headline":"Write a post for your collage.",
          "description":"Once you've selected to share your collage on Facebook, you'll be directed to a new window where you can write a post for it and select who can see it when it's posted."
        },
        {
          "headline":"Tap Share.",
          "description":"This will post your collage on your Facebook timeline."
        }
      ]
    },
    {
      "name":"Accessing Facebook's Memories Collages",
      "steps":[
        {
          "headline":"Open the Facebook app.",
          "description":"This has a blue icon with a white \"f\" in it."
        },
        {
          "headline":"Tap the menu icon ☰ in the bottom-right.",
          "description":""
        },
        {
          "headline":"Tap Memories.",
          "description":"You should see a list of memories if any are available. This is where you'll be able to view your Friendaversary videos if any are available on that day."
        },
        {
          "headline":"Tap Share below a memory you'd like to share to your timeline.",
          "description":"You'll likely see a number of pictures or posts that you made, and you'll sometimes be able to share a video with a collage of your pictures if one is available. Memories like \"Friendaversarys\" are put together automatically by Facebook, and will only be available for a limited amount of time."
        }
      ]
    }
  ],
  "text":" Using PicCollage Open the App Store app {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/5\\/55\\/Iphoneappstoreicon.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/5\\/55\\/Iphoneappstoreicon.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":760,\"bigHeight\":760,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of an iOS icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a><br>\\n<\\/p><\\/div>\"}. This has a blue icon with a white “A” in it that can be accessed from the main screen. Navigate to PicCollage. Simply type “pic collage” into the search bar to pull it up in your search results. It’ll have a multi-colored icon that looks like a camera. Tap GET. This will download and install PicCollage onto your iPhone or iPad. Open the PicCollage app.  Tap the blue-green plus (+) button. This will start a new collage and will direct you to a pop-up dialogue asking for PicCollage to have access to your phone’s camera storage. Tap OK to allow PicCollage access so you can select photos. Select the photos you want to include in your collage. You’ll have the option to upload photos from your phone’s gallery, Facebook, or Google Photos along the top of the menu page. Tap the green button with a white number and check mark in it. This will appear in the top-right corner once you’ve selected your pictures and will direct you to the next step. Select an aspect ratio and layout for your collage. The aspect ratio option appears as a small white circle in the bottom-left of the preview display for your collage. You can select a layout by scrolling through the options listed below the preview display and tapping the button with sliders on it. Tap Next.  Edit the pictures’ arrangement and display. Simply tap on a picture and drag it to rearrange the order of pictures, or tap on the blue double arrow icon that appears on the top-right corner of the picture to pull up more options for editing that picture. Tap Done. This is in the bottom-right corner and will save your finished collage. Select Facebook on the Save or Share page. Once you’ve completed your collage, you’ll be directed to a menu where you can select a method for saving or sharing your collage, including to Facebook. Grant PicCollage access to your Facebook profile. Before you can post any collages, you’ll need to let PicCollage be able to post to your Facebook page. Simply tap Allow in the dialog box that pops up and select the share settings you’d like for your collage, and it’ll be posted to Facebook immediately. Write a post for your collage. Once you've selected to share your collage on Facebook, you'll be directed to a new window where you can write a post for it and select who can see it when it's posted. Tap Share. This will post your collage on your Facebook timeline. Using PicsArt Photo Editor Open the App Store app. This has a blue icon with a white “A” in it that can be accessed from the main screen. Navigate to the PicsArt Photo Editor app. Simply type “picsart” into the search bar to pull it up in your search results. It’ll have a multi-colored icon that looks like a camera. Tap GET. This will download and install PicsArt Photo Editor onto your iPhone or iPad. Open the PicsArt Photo Editor app.  Create a PicsArt account. You can link a social media account or sign up via email, following the on-screen instructions. You can also tap Skip to continue without an account. Tap the purple plus (+) button. This is in the center of a menu pane at the bottom of the screen and will open the menu for starting a new photo editing project. Scroll down to the Collages heading and select a layout. The three main layouts are: Grids, Freestyle, and Frames. Select photos for your collage. You can search for photos on your phone’s camera or for free images by clicking the magnifying glass icon in the top-left corner of the menu. Tap the purple Next button in the top-right corner. This will direct you to the page for editing your collage. Select your collage’s layout, border, color, and background. To adjust the layout, tap the Layout icon beneath and toggle through the different options to select your preferred layout. Tap on Border to select your preferred border for your collage. Tap on Color to choose different coloring options to brighten your collage. Tap on Background to customize the image that appears as the background for your collage and how the background is formatted. Tap the white Next button in the top-right corner.  Select effects for your collage. A banner beneath your collage will list different options for customizing the way your photos appear. Once you select an effect, toggle it to your preferred setting and tap the white check icon in the top-right of the effect’s menu to save it to your collage. Tap the white Next button in the top-right corner. This will direct you to the page for sharing collage to social media. Select Facebook as your sharing method. A pop-up dialog will appear asking for PicsArt to be granted permission to access your Facebook profile. Tap Allow in the pop-up menu and select your profile to post your collage on Facebook. Write a post for your collage. Once you've selected to share your collage on Facebook, you'll be directed to a new window where you can write a post for it and select who can see it when it's posted. Tap Share. This will post your collage on your Facebook timeline. Accessing Facebook's Memories Collages Open the Facebook app. This has a blue icon with a white \"f\" in it. Tap the menu icon ☰ in the bottom-right.  Tap Memories. You should see a list of memories if any are available. This is where you'll be able to view your Friendaversary videos if any are available on that day. Tap Share below a memory you'd like to share to your timeline. You'll likely see a number of pictures or posts that you made, and you'll sometimes be able to share a video with a collage of your pictures if one is available. Memories like \"Friendaversarys\" are put together automatically by Facebook, and will only be available for a limited amount of time.",
  "tyn_model":[
    "“a",
    "” in",
    "” into",
    "photo editor",
    "“pic",
    "’ arrangement",
    "app store",
    "“picsart",
    "photo editing",
    "photos",
    "magnifying glass",
    "☰ in"
  ],
  "tyn_section":[

  ]
}