{
  "title":"How to Clean Marble Tile",
  "url":"https://www.wikihow.com/Clean-Marble-Tile",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "methods":[
    {
      "name":"Cleaning Every Day",
      "steps":[
        {
          "headline":"Dilute dish soap with warm water.",
          "description":"Cleansers that are too acidic can actually damage marble tile, which means you shouldn’t use products with lemon, vinegar, or bleach on it. That’s why a gentle, non-abrasive dish soap, which has a neutral pH, is the best option for cleaning marble. For the best results, mix approximately 8 ounces of warm water with one tablespoon of the soap in a spray bottle or other container. Shake the mixture well, so the two ingredients are mixed. Don’t use an all-purpose cleanser on your tile unless it’s specifically marked as safe for marble."
        },
        {
          "headline":"Apply solution to the marble.",
          "description":"If you’re using the dish soap and water solution to clean marble tile on countertops, you can apply it directly from the spray bottle. For floors, use a soft mop to apply to the tile. Make sure not to apply too much of the solution to the marble, though -- the tile surface should be damp, but there shouldn’t any pools of liquid. If there is any standing water on your marble tile, wipe it up as quickly as possible."
        },
        {
          "headline":"Wipe off tile and thoroughly dry.",
          "description":"After you’ve applied the soap and water solution to your marble tile, you need to wipe down the surface to remove any dirt and debris. Use a hot, wet cloth to wipe down any tile on your countertops or a mop dampened with hot water for your floors. Next, take a soft, dry towel or mop to thoroughly dry and buff the tile. Make sure the cloth or mop that you’re using to wipe off the soap isn’t too wet. Wring the material out carefully to prevent too much water from sitting on the marble surface."
        },
        {
          "headline":"Use a dust mop.",
          "description":"If you have marble tile on your floor, you may sometimes need to remove dust, dirt, and other debris, such as crumbs or loose tile. However, while a vacuum may be the easiest way to clean up this type of mess, you’re better off using a dust mop to clean the tile. Vacuum cleaners with worn wheels and metal attachments can easily scratch the tile surface. If you want to use a vacuum on marble tile, check the wheels to make sure that they’re not scuffed or rough in any spots. Don’t use metal attachments either."
        }
      ]
    },
    {
      "name":"Removing Stains",
      "steps":[
        {
          "headline":"Use a liquid cleanser.",
          "description":"If the stain on your marble tile is oil-based, such as grease or cosmetics, you can usually remove it with a soft liquid cleanser. Use a gentle household detergent on fresh stains and ammonia or mineral spirits on older, more stubborn stains. Dilute your chosen cleanser with warm water, and use a soft cloth to apply it to the stained area. Use a clean, damp cloth to wipe the cleanser off and a clean, dry towel to dry the marble. You can use the cloth dampened with your cleansing solution to gently scrub at the stain, but don’t be too rough to avoid scratches. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBridgett Price\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Co-Owner, Maid Easy\t\t\t\t\t\t\t\tBridgett Price is a Cleaning Guru and Co-Owner of Maideasy, a maid service company that services the Phoeniz, Arizona metropolitan area. She holds a Master of Management from the University of Phoenix, specializing in digital and traditional marketing. Bridgett Price\t\t\tCleaning Guru & Co-Owner, Maid Easy\t\t\t\tUse products that give your marble a shine. A couple good products include 409 and Granite Gold. They have properties that clean the marble and give it a shine. They're also safer cleaning products to use."
        },
        {
          "headline":"Try hydrogen peroxide.",
          "description":"If your marble tile is stained by an organic material, such as food, coffee, or tea, hydrogen peroxide is usually the most effective cleanser. Mix 12 percent hydrogen peroxide with several drops of ammonia, and apply it to the stained tile with a cloth. Use a clean, damp cloth to wipe the hydrogen peroxide off, and thoroughly dry the surface with a soft, clean towel. You should only use hydrogen peroxide to clean your marble tile if it is a light color. Hydrogen peroxide may bleach dark marble tile."
        },
        {
          "headline":"Apply a poultice.",
          "description":"For stubborn or old stains, you may need a poultice, which is a thick, paste-like cleanser, to get them off your marble tile. You can buy commercially-made poultice powder that you simply combine with water. Follow the instructions to mix the paste, and apply it generously to the stain. Allow it to sit for 1 to 2 days under plastic wrap before removing the plastic and letting it dry. You can then rinse the poultice away with distilled water and buff it dry with a clean, soft cloth. You can find poultice powder at your local hardware, home improvement, or stone supply store. When applying the poultice to the stain, the layer should be approximately ¼ to ½ inch thick. Secure the plastic wrap over the poultice with painter’s tape to ensure that it’s airtight."
        }
      ]
    },
    {
      "name":"Preventing Damage",
      "steps":[
        {
          "headline":"Wipe up spills quickly.",
          "description":"Anytime that a liquid sits on the surface of your tile, it has the potential to stain or discolor the marble. Acidic liquids, such as citrus juices, wine, coffee, and vinegar, are a particular danger to marble, but even a puddle of water that isn’t cleaned up quickly can stain the tile. To avoid discolorations, wipe up any spills on the marble as soon as you see them. You can wipe up water with paper towel or a clean cloth, but if an acidic liquid spills on the tile, wipe it up and then clean the area with a cloth dampened with water and dish soap. Make sure to dry the surface thoroughly when you’re done. If you have marble in your bathroom, remember to dry the tile after every shower and bath."
        },
        {
          "headline":"Use protective coverings.",
          "description":"The best way to protect your marble tile from stains, discoloration, and other damage is to cover it. Use coasters and trivets on tiled countertops to keep any liquids or food that drip over the edge of a glass or pan from falling on the marble. On tile floors, place mats or throw rugs near doorways so you can wipe dirt and debris off your feet before walking across the marble. If you want to protect a marble tile floor from scratches, try placing rubber mats under metal furniture and accessories. It’s also a good idea to place them under plants and flower pots."
        },
        {
          "headline":"Seal the tile monthly.",
          "description":"To protect your marble surface from stains and discoloration, it’s important to apply a sealant approximately once a month. It forms a protective film over the marble so you have more time to wipe up spills and clean stains. You can purchase marble sealer at your local hardware, home improvement, or stone supply store. Follow the directions on the bottle, but you usually mist it on, allow it to soak in, and then wipe down the surface. Make sure to start with clean marble tile before applying the sealer. If you want extra protection, you can apply a second coat of sealer after the first one is completely dry."
        }
      ]
    }
  ],
  "text":" Cleaning Every Day Dilute dish soap with warm water. Cleansers that are too acidic can actually damage marble tile, which means you shouldn’t use products with lemon, vinegar, or bleach on it. That’s why a gentle, non-abrasive dish soap, which has a neutral pH, is the best option for cleaning marble. For the best results, mix approximately 8 ounces of warm water with one tablespoon of the soap in a spray bottle or other container. Shake the mixture well, so the two ingredients are mixed. Don’t use an all-purpose cleanser on your tile unless it’s specifically marked as safe for marble. Apply solution to the marble. If you’re using the dish soap and water solution to clean marble tile on countertops, you can apply it directly from the spray bottle. For floors, use a soft mop to apply to the tile. Make sure not to apply too much of the solution to the marble, though -- the tile surface should be damp, but there shouldn’t any pools of liquid. If there is any standing water on your marble tile, wipe it up as quickly as possible. Wipe off tile and thoroughly dry. After you’ve applied the soap and water solution to your marble tile, you need to wipe down the surface to remove any dirt and debris. Use a hot, wet cloth to wipe down any tile on your countertops or a mop dampened with hot water for your floors. Next, take a soft, dry towel or mop to thoroughly dry and buff the tile. Make sure the cloth or mop that you’re using to wipe off the soap isn’t too wet. Wring the material out carefully to prevent too much water from sitting on the marble surface. Use a dust mop. If you have marble tile on your floor, you may sometimes need to remove dust, dirt, and other debris, such as crumbs or loose tile. However, while a vacuum may be the easiest way to clean up this type of mess, you’re better off using a dust mop to clean the tile. Vacuum cleaners with worn wheels and metal attachments can easily scratch the tile surface. If you want to use a vacuum on marble tile, check the wheels to make sure that they’re not scuffed or rough in any spots. Don’t use metal attachments either. Removing Stains Use a liquid cleanser. If the stain on your marble tile is oil-based, such as grease or cosmetics, you can usually remove it with a soft liquid cleanser. Use a gentle household detergent on fresh stains and ammonia or mineral spirits on older, more stubborn stains. Dilute your chosen cleanser with warm water, and use a soft cloth to apply it to the stained area. Use a clean, damp cloth to wipe the cleanser off and a clean, dry towel to dry the marble. You can use the cloth dampened with your cleansing solution to gently scrub at the stain, but don’t be too rough to avoid scratches. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBridgett Price\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Co-Owner, Maid Easy\t\t\t\t\t\t\t\tBridgett Price is a Cleaning Guru and Co-Owner of Maideasy, a maid service company that services the Phoeniz, Arizona metropolitan area. She holds a Master of Management from the University of Phoenix, specializing in digital and traditional marketing. Bridgett Price\t\t\tCleaning Guru & Co-Owner, Maid Easy\t\t\t\tUse products that give your marble a shine. A couple good products include 409 and Granite Gold. They have properties that clean the marble and give it a shine. They're also safer cleaning products to use. Try hydrogen peroxide. If your marble tile is stained by an organic material, such as food, coffee, or tea, hydrogen peroxide is usually the most effective cleanser. Mix 12 percent hydrogen peroxide with several drops of ammonia, and apply it to the stained tile with a cloth. Use a clean, damp cloth to wipe the hydrogen peroxide off, and thoroughly dry the surface with a soft, clean towel. You should only use hydrogen peroxide to clean your marble tile if it is a light color. Hydrogen peroxide may bleach dark marble tile. Apply a poultice. For stubborn or old stains, you may need a poultice, which is a thick, paste-like cleanser, to get them off your marble tile. You can buy commercially-made poultice powder that you simply combine with water. Follow the instructions to mix the paste, and apply it generously to the stain. Allow it to sit for 1 to 2 days under plastic wrap before removing the plastic and letting it dry. You can then rinse the poultice away with distilled water and buff it dry with a clean, soft cloth. You can find poultice powder at your local hardware, home improvement, or stone supply store. When applying the poultice to the stain, the layer should be approximately ¼ to ½ inch thick. Secure the plastic wrap over the poultice with painter’s tape to ensure that it’s airtight. Preventing Damage Wipe up spills quickly. Anytime that a liquid sits on the surface of your tile, it has the potential to stain or discolor the marble. Acidic liquids, such as citrus juices, wine, coffee, and vinegar, are a particular danger to marble, but even a puddle of water that isn’t cleaned up quickly can stain the tile. To avoid discolorations, wipe up any spills on the marble as soon as you see them. You can wipe up water with paper towel or a clean cloth, but if an acidic liquid spills on the tile, wipe it up and then clean the area with a cloth dampened with water and dish soap. Make sure to dry the surface thoroughly when you’re done. If you have marble in your bathroom, remember to dry the tile after every shower and bath. Use protective coverings. The best way to protect your marble tile from stains, discoloration, and other damage is to cover it. Use coasters and trivets on tiled countertops to keep any liquids or food that drip over the edge of a glass or pan from falling on the marble. On tile floors, place mats or throw rugs near doorways so you can wipe dirt and debris off your feet before walking across the marble. If you want to protect a marble tile floor from scratches, try placing rubber mats under metal furniture and accessories. It’s also a good idea to place them under plants and flower pots. Seal the tile monthly. To protect your marble surface from stains and discoloration, it’s important to apply a sealant approximately once a month. It forms a protective film over the marble so you have more time to wipe up spills and clean stains. You can purchase marble sealer at your local hardware, home improvement, or stone supply store. Follow the directions on the bottle, but you usually mist it on, allow it to soak in, and then wipe down the surface. Make sure to start with clean marble tile before applying the sealer. If you want extra protection, you can apply a second coat of sealer after the first one is completely dry.",
  "tyn_model":[
    "water",
    "hydrogen peroxide",
    "dish soap",
    "soap",
    "mop",
    "towel",
    "spray bottle",
    "dust mop",
    "vacuum",
    "liquid cleanser",
    "ammonia",
    "cleanser",
    "poultice powder",
    "plastic wrap",
    "sealer",
    "warm water",
    "all-purpose cleanser",
    "vacuum cleaners",
    "household detergent",
    "mineral spirits",
    "cleaning guru",
    "maid service company",
    "409",
    "granite gold",
    "cloth",
    "distilled water",
    "painter’s tape",
    "coffee",
    "vinegar",
    "protective coverings",
    "coasters",
    "mats",
    "rugs",
    "rubber mats",
    "sealant",
    "marble sealer",
    "stone supply store"
  ],
  "tyn_section":[

  ]
}