{
  "title":"How to Kill a Tree Stump",
  "url":"https://www.wikihow.com/Kill-a-Tree-Stump",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Trees and Shrubs"
  ],
  "methods":[
    {
      "name":"Using Epsom or Rock Salt",
      "steps":[
        {
          "headline":"Obtain Epsom salt or rock salt.",
          "description":"Using Epsom salt or rock salt is an easy way to kill a stump cheaply. When you use the salt method it takes several months for the stump to die, so it might not be your best bet if you need to get rid of the stump quickly. Do not use regular table salt, which is harmful to the soil surrounding the stump. Use 100 percent Epsom or rock salt with no added ingredients, to make sure the land around the stump doesn't get disturbed. For a stubborn stump you can try a chemical stump remover or an herbicide containing glyphosate or triclopyr instead of salt. While a chemical herbicide will kill the stump faster, keep in mind that it could kill the roots of surrounding trees or shrubs as well."
        },
        {
          "headline":"Drill holes in the stump.",
          "description":"Drill a pattern of holes across the surface of the stump, so the solution will be able to penetrate. The holes should be about ⁄2 to 1 inch (1.3 to 2.5 cm) wide and at least 8 inches (20.3 cm) deep, or 12 inches (30.5 cm) if you have a long enough drill bit. Penetrating deeply will ensure the salt solution saturates the roots below the trunk. If you don't have a drill bit this long, use an ax to chop into the wood and make gouges as deep as you can. If you're working with a stump that has large arial roots, drill holes in those as well."
        },
        {
          "headline":"Pack the holes with salt and top them off with wax.",
          "description":"Fill up the holes 3/4 full with epsom salt or rock salt. Don't forget the holes you drilled in the arial roots. Now light a plain, unscented candle and drop wax into the holes to plug them. It's important to make sure the salt stays in place, rather than scattering over your yard, since excess salt can be harmful to topsoil and the roots of other plants."
        },
        {
          "headline":"Cover the stump.",
          "description":"Put a plastic tarp, trash bag or another nonporous item over the stump to cover it. It will die more quickly without sunlight and rain to continue nourishing any shoots that come up. After six weeks to several months the stump will die. Check it every once in a while to see how things are progressing. When the stump is dead, it should begin falling apart on its own."
        }
      ]
    },
    {
      "name":"Shielding it from the Sun",
      "steps":[
        {
          "headline":"Cover the stump.",
          "description":"This method is free, but can take a long time. The idea is to slowly kill the stump by denying its basic needs. Put a dark tarp or trash bag over the stump so it won’t receive sun or water."
        },
        {
          "headline":"Wait three to six months.",
          "description":"During this time, the stump will slowly die. Check it from time to time to see how things are progressing. It should begin to rot and fall apart. As it dies and rots, you can use stump removal solution to speed the process along. It's available at nurseries and garden centers. You can also add some Epsom salt to cracks that appear in the stump, or see Method One and drill holes in the stump and fill them with salt to make it go faster."
        },
        {
          "headline":"Cut off any saplings that crop up.",
          "description":"Covering the stump should prevent anything from growing, but until the stump is dead, you can cut saplings off the base of the trunk as they sprout, or paint them with a woody brush killer that contains triclopyr. If your goal is to allow one tree to grow from the old stump, cut off additional saplings do not apply an herbicide."
        }
      ]
    },
    {
      "name":"Burning the Stump",
      "steps":[
        {
          "headline":"Drill holes in the stump.",
          "description":"Burning is a good way to remove the stump after you have killed it. Start by drilling plenty of holes across the surface of the stump. The holes should be about ⁄2 to 1 inch (1.3 to 2.5 cm) wide and at least 8 inches (20.3 cm) deep, or 12 inches (30.5 cm) if you have a long enough drill bit. Penetrating deeply will ensure the stump gets burned down to the tips of the roots so that it will be easy to remove."
        },
        {
          "headline":"Pour kerosene into the holes.",
          "description":"Soaking the stump with kerosene will enable you to light it on fire so it will burn into ash. Make sure the stump is fully saturated, or the fire may go out before it reaches the tips of the roots. Another option is to place charcoal on top of the stump and light the charcoal on fire. The coals will slowly burn down through the stump. This method will reduce the chances of burning nearby plants. If you're worried about nearby objects catching fire, you shouldn't use this method. You're going to be setting the stump on fire, and while it's quite effective, it can be dangerous if you don't have plenty of room around the stump. Check local city ordinances to make sure it’s legal to do a controlled burn. Call 411 to find out more information."
        },
        {
          "headline":"Build a fire on top of the stump.",
          "description":"Put scrap wood on top of the stump and use a fire starter to ignite it. As the fire burns down, the stump will catch and burn up. Look closely to make sure the stump actually catches, and add more wood as necessary to keep the fire going. Be sure to monitor the stump as it burns to ash. Don’t leave it unattended, in case the fire gets out of hand. Depending on the size of the stump, the burn may take several hours."
        },
        {
          "headline":"Dig out the ashes and fill in the hole.",
          "description":"Use a shovel to remove all of the ashes, down through where the roots were, and fill in the hole with fresh soil."
        }
      ]
    },
    {
      "name":"Chopping it Up",
      "steps":[
        {
          "headline":"Get a stump grinder.",
          "description":"You can also chop up a stump to remove it. To use this removal method, you will need a stump grinder. You can rent one from a home improvement store. This machine has a rotary cutter that will drill into and grind up the stump. It's a good method to use if you have a huge, stubborn stump you need to remove. Renting a stump grinder is probably the most prudent option, but if you have a lot of stumps to grind, it might be worth it to buy one. Get protective equipment, too. Goggles and a mask will protect you from sawdust and flying wood chips. If you don't enjoy handling heavy machinery, call a local landscaper and explain that you have a stump that needs to be removed. You'll be able to pay someone else to do it."
        },
        {
          "headline":"Cut the stump close to the ground.",
          "description":"Use a chainsaw to level off the stump just a few inches from the ground. Remove any branches or roots that stick up too far off the ground so that the stump grinder will have a stable surface on which to operate."
        },
        {
          "headline":"Grind up the stump.",
          "description":"Put on your goggles and mask, and position the stump grinder over the stump. Then, following the manufacturer’s instruction, move the grinder slowly across the stump's surface to grind it up to bits. Continue along the arial roots to grind those as well until the stump has been fully ground up. Be careful not to get your feet in the way of the grinder. Wear heavy boots so you won't accidentally hurt yourself. Make sure children and pets are safely away from the equipment before you begin operating it."
        },
        {
          "headline":"Shovel out the grindings and fill in the hole.",
          "description":"Remove all of the wood chips and discard them (or use them as mulch, then fill in the hole with soil. You might need to use an ax to chop out remaining roots."
        }
      ]
    }
  ],
  "text":" Using Epsom or Rock Salt Obtain Epsom salt or rock salt. Using Epsom salt or rock salt is an easy way to kill a stump cheaply. When you use the salt method it takes several months for the stump to die, so it might not be your best bet if you need to get rid of the stump quickly. Do not use regular table salt, which is harmful to the soil surrounding the stump. Use 100 percent Epsom or rock salt with no added ingredients, to make sure the land around the stump doesn't get disturbed. For a stubborn stump you can try a chemical stump remover or an herbicide containing glyphosate or triclopyr instead of salt. While a chemical herbicide will kill the stump faster, keep in mind that it could kill the roots of surrounding trees or shrubs as well. Drill holes in the stump. Drill a pattern of holes across the surface of the stump, so the solution will be able to penetrate. The holes should be about ⁄2 to 1 inch (1.3 to 2.5 cm) wide and at least 8 inches (20.3 cm) deep, or 12 inches (30.5 cm) if you have a long enough drill bit. Penetrating deeply will ensure the salt solution saturates the roots below the trunk. If you don't have a drill bit this long, use an ax to chop into the wood and make gouges as deep as you can. If you're working with a stump that has large arial roots, drill holes in those as well. Pack the holes with salt and top them off with wax. Fill up the holes 3/4 full with epsom salt or rock salt. Don't forget the holes you drilled in the arial roots. Now light a plain, unscented candle and drop wax into the holes to plug them. It's important to make sure the salt stays in place, rather than scattering over your yard, since excess salt can be harmful to topsoil and the roots of other plants. Cover the stump. Put a plastic tarp, trash bag or another nonporous item over the stump to cover it. It will die more quickly without sunlight and rain to continue nourishing any shoots that come up. After six weeks to several months the stump will die. Check it every once in a while to see how things are progressing. When the stump is dead, it should begin falling apart on its own. Shielding it from the Sun Cover the stump. This method is free, but can take a long time. The idea is to slowly kill the stump by denying its basic needs. Put a dark tarp or trash bag over the stump so it won’t receive sun or water. Wait three to six months. During this time, the stump will slowly die. Check it from time to time to see how things are progressing. It should begin to rot and fall apart. As it dies and rots, you can use stump removal solution to speed the process along. It's available at nurseries and garden centers. You can also add some Epsom salt to cracks that appear in the stump, or see Method One and drill holes in the stump and fill them with salt to make it go faster. Cut off any saplings that crop up. Covering the stump should prevent anything from growing, but until the stump is dead, you can cut saplings off the base of the trunk as they sprout, or paint them with a woody brush killer that contains triclopyr. If your goal is to allow one tree to grow from the old stump, cut off additional saplings do not apply an herbicide. Burning the Stump Drill holes in the stump. Burning is a good way to remove the stump after you have killed it. Start by drilling plenty of holes across the surface of the stump. The holes should be about ⁄2 to 1 inch (1.3 to 2.5 cm) wide and at least 8 inches (20.3 cm) deep, or 12 inches (30.5 cm) if you have a long enough drill bit. Penetrating deeply will ensure the stump gets burned down to the tips of the roots so that it will be easy to remove. Pour kerosene into the holes. Soaking the stump with kerosene will enable you to light it on fire so it will burn into ash. Make sure the stump is fully saturated, or the fire may go out before it reaches the tips of the roots. Another option is to place charcoal on top of the stump and light the charcoal on fire. The coals will slowly burn down through the stump. This method will reduce the chances of burning nearby plants. If you're worried about nearby objects catching fire, you shouldn't use this method. You're going to be setting the stump on fire, and while it's quite effective, it can be dangerous if you don't have plenty of room around the stump. Check local city ordinances to make sure it’s legal to do a controlled burn. Call 411 to find out more information. Build a fire on top of the stump. Put scrap wood on top of the stump and use a fire starter to ignite it. As the fire burns down, the stump will catch and burn up. Look closely to make sure the stump actually catches, and add more wood as necessary to keep the fire going. Be sure to monitor the stump as it burns to ash. Don’t leave it unattended, in case the fire gets out of hand. Depending on the size of the stump, the burn may take several hours. Dig out the ashes and fill in the hole. Use a shovel to remove all of the ashes, down through where the roots were, and fill in the hole with fresh soil. Chopping it Up Get a stump grinder. You can also chop up a stump to remove it. To use this removal method, you will need a stump grinder. You can rent one from a home improvement store. This machine has a rotary cutter that will drill into and grind up the stump. It's a good method to use if you have a huge, stubborn stump you need to remove. Renting a stump grinder is probably the most prudent option, but if you have a lot of stumps to grind, it might be worth it to buy one. Get protective equipment, too. Goggles and a mask will protect you from sawdust and flying wood chips. If you don't enjoy handling heavy machinery, call a local landscaper and explain that you have a stump that needs to be removed. You'll be able to pay someone else to do it. Cut the stump close to the ground. Use a chainsaw to level off the stump just a few inches from the ground. Remove any branches or roots that stick up too far off the ground so that the stump grinder will have a stable surface on which to operate. Grind up the stump. Put on your goggles and mask, and position the stump grinder over the stump. Then, following the manufacturer’s instruction, move the grinder slowly across the stump's surface to grind it up to bits. Continue along the arial roots to grind those as well until the stump has been fully ground up. Be careful not to get your feet in the way of the grinder. Wear heavy boots so you won't accidentally hurt yourself. Make sure children and pets are safely away from the equipment before you begin operating it. Shovel out the grindings and fill in the hole. Remove all of the wood chips and discard them (or use them as mulch, then fill in the hole with soil. You might need to use an ax to chop out remaining roots.",
  "tyn_model":[
    "salt",
    "stump grinder",
    "epsom salt",
    "rock salt",
    "drill bit",
    "epsom or",
    "triclopyr",
    "wax",
    "kerosene",
    "charcoal",
    "wood",
    "grinder",
    "table salt",
    "glyphosate",
    "candle",
    "trash bag",
    "stump removal solution",
    "woody brush killer",
    "coals",
    "fire starter",
    "shovel",
    "chainsaw",
    "goggles",
    "wood chips",
    "mulch",
    "soil",
    "ax"
  ],
  "tyn_section":[

  ]
}