{
  "title":"How to Advertise a Garage Sale on Facebook on PC or Mac",
  "url":"https://www.wikihow.com/Advertise-a-Garage-Sale-on-Facebook-on-PC-or-Mac",
  "category_hierarchy":[
    "Home and Garden",
    "Garages"
  ],
  "methods":[
    {
      "name":"Advertising on the Facebook Marketplace",
      "steps":[
        {
          "headline":"Login to your Facebook account.",
          "description":"If you don't have one make an account by going to https://www.facebook.com/."
        },
        {
          "headline":"Click on Marketplace from your newsfeed.",
          "description":"It's located on the left side of the page."
        },
        {
          "headline":"Click on Sell Something to list items.",
          "description":"It's located on the left side of the page."
        },
        {
          "headline":"Click on Category and select Garage Sale.",
          "description":"This will let people know you what type of sale you're having."
        },
        {
          "headline":"Create a description under \"What are you Selling?\".",
          "description":"Make your description brief by highlighting bargains or rare items you may be selling."
        },
        {
          "headline":"Set the price to zero.",
          "description":"This will make your Garage Sale come up first when people filter by price. You are not listing all the items for sale so it would be misleading if you wrote the total price. Leaving it open will give buyers a chance to bargain and will attract more people."
        },
        {
          "headline":"Add your sale's location and some pictures.",
          "description":"Add photos of the most desirable items and the location itself to help people find your garage sale. To upload a picture click the photos icon above the text \"10 Photos\". This means that you can upload 10 pictures total and the number will decrease as you add more."
        },
        {
          "headline":"Click Next and then Post.",
          "description":"This will advertise your garage sale to the marketplace. Optionally, before hitting Post you can select private marketplace groups you're already in to share your garage sale with. You can join private marketplace groups by searching for them with the address bar at the top of your newsfeed page."
        }
      ]
    },
    {
      "name":"Advertising via Events",
      "steps":[
        {
          "headline":"Login to your Facebook account.",
          "description":"If you don't have one make an account by going to https://www.facebook.com/."
        },
        {
          "headline":"Click on  Events from your newsfeed page.",
          "description":"This will be listed on the left side of the screen."
        },
        {
          "headline":"Click on  Create Event and choose public event.",
          "description":"This will open a new window. If your event isn't public you will not be able to advertise it as effectively."
        },
        {
          "headline":"Fill in details about your garage sale.",
          "description":"You can list some pictures, the location, and details or a schedule about the event."
        },
        {
          "headline":"Click  Create Event to publish your event.",
          "description":"This will save to your events page but is not posted yet."
        },
        {
          "headline":"Click the  Share button to advertise it.",
          "description":"You can share this event with friends, via messenger, or publish it as a post. You can pay for traditional advertising by clicking  Promote Event at the top. This will allow you to pay for time to promote the visibility of your garage sale across Facebook."
        }
      ]
    },
    {
      "name":"Advertising with Status Updates",
      "steps":[
        {
          "headline":"Login to your Facebook account.",
          "description":"If you don't have one make an account by going to https://www.facebook.com/."
        },
        {
          "headline":"Create a post by click “What's on your Mind?” at the top.",
          "description":""
        },
        {
          "headline":"Click  •••  to add more details about your garage sale.",
          "description":"Consider adding the time, pinging a location, and maybe pictures of items you are thinking of selling. You can add banners or large fonts here to catch your audience's attention as well."
        },
        {
          "headline":"Click  share to post your status and garage sale.",
          "description":"Try tagging some friends who have agreed to help you promote your sale!"
        }
      ]
    }
  ],
  "text":" Advertising on the Facebook Marketplace Login to your Facebook account. If you don't have one make an account by going to https://www.facebook.com/. Click on Marketplace from your newsfeed. It's located on the left side of the page. Click on Sell Something to list items. It's located on the left side of the page. Click on Category and select Garage Sale. This will let people know you what type of sale you're having. Create a description under \"What are you Selling?\". Make your description brief by highlighting bargains or rare items you may be selling. Set the price to zero. This will make your Garage Sale come up first when people filter by price. You are not listing all the items for sale so it would be misleading if you wrote the total price. Leaving it open will give buyers a chance to bargain and will attract more people. Add your sale's location and some pictures. Add photos of the most desirable items and the location itself to help people find your garage sale. To upload a picture click the photos icon above the text \"10 Photos\". This means that you can upload 10 pictures total and the number will decrease as you add more. Click Next and then Post. This will advertise your garage sale to the marketplace. Optionally, before hitting Post you can select private marketplace groups you're already in to share your garage sale with. You can join private marketplace groups by searching for them with the address bar at the top of your newsfeed page. Advertising via Events Login to your Facebook account. If you don't have one make an account by going to https://www.facebook.com/. Click on  Events from your newsfeed page. This will be listed on the left side of the screen. Click on  Create Event and choose public event. This will open a new window. If your event isn't public you will not be able to advertise it as effectively. Fill in details about your garage sale. You can list some pictures, the location, and details or a schedule about the event. Click  Create Event to publish your event. This will save to your events page but is not posted yet. Click the  Share button to advertise it. You can share this event with friends, via messenger, or publish it as a post. You can pay for traditional advertising by clicking  Promote Event at the top. This will allow you to pay for time to promote the visibility of your garage sale across Facebook. Advertising with Status Updates Login to your Facebook account. If you don't have one make an account by going to https://www.facebook.com/. Create a post by click “What's on your Mind?” at the top.  Click  •••  to add more details about your garage sale. Consider adding the time, pinging a location, and maybe pictures of items you are thinking of selling. You can add banners or large fonts here to catch your audience's attention as well. Click  share to post your status and garage sale. Try tagging some friends who have agreed to help you promote your sale!",
  "tyn_model":[
    "“what",
    "” at",
    "•••  "
  ],
  "tyn_section":[

  ]
}