{
  "title":"How to Add a PS4 Player as a Friend in Fortnite on PC",
  "url":"https://www.wikihow.com/Add-a-PS4-Player-as-a-Friend-in-Fortnite-on-PC",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games"
  ],
  "parts":[
    {
      "name":"Adding a PS4 Player on Epic Games",
      "steps":[
        {
          "headline":"Open the Epic Games launcher on your PC.",
          "description":"The icon is black with Epic Games in the center. It can either be found on the desktop or by clicking on {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/07\\/Windowsstart.png\",\"bigUrl\":\"\\/images\\/thumb\\/0\\/07\\/Windowsstart.png\\/30px-Windowsstart.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":\"30\",\"bigHeight\":\"30\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of a Windows icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Public_domain\\\">Public Domain<\\/a><br>\\n<\\/p><\\/div>\"} Start and searching for Epic Games in the search bar. The Epic Games launcher, along with Fortnite, is free to install at www.epicgames.com/store/en-US/download"
        },
        {
          "headline":"Sign in to your Epic Games account with your login information.",
          "description":"If you are already playing Fortnite then you should already have an Epic Games account."
        },
        {
          "headline":"Click on Friends.",
          "description":"This should be the fourth option below Epic Games on the left-hand side of the window."
        },
        {
          "headline":"Click on the center icon on the pop-up window.",
          "description":"The icon is a human silhouette with a plus sign and will say Add friend if you hover the mouse over it."
        },
        {
          "headline":"Enter in the username or email address of the PS4 player.",
          "description":"This will be the information that they use for their Epic Games account, not their PSN username. They must have an Epic Games account to proceed."
        },
        {
          "headline":"Click Send to send the request.",
          "description":"The PS4 player will need to log in to their Epic Games account to accept the friend request. If you are friends with the PS4 player on Steam or Facebook and they have their Epic account linked to either of these accounts, you can also click on Steam or Facebook to add them. You will then be required to sign into these accounts to see your shared friends."
        }
      ]
    },
    {
      "name":"Adding a PS4 Player in Fortnite",
      "steps":[
        {
          "headline":"Launch Fortnite.",
          "description":"You can find the game by going to the Library section on the Epic Games Launcher and clicking on the Fortnite icon."
        },
        {
          "headline":"Click on Battle Royale on the left-hand side of the screen.",
          "description":"This will take you to the Lobby. The time it takes for the Lobby to load will depend on your internet connection."
        },
        {
          "headline":"Select the type of match by clicking on the button above Play.",
          "description":"The default setting is Team Rumble, but there are other options to select, such as Squads or Duo."
        },
        {
          "headline":"Click on Accept at the bottom right-hand corner.",
          "description":""
        },
        {
          "headline":"Click on the  plus sign next to your character in the Lobby.",
          "description":""
        },
        {
          "headline":"Click on Epic Friends on the pop-up menu.",
          "description":""
        },
        {
          "headline":"Select the PS4 player’s name.",
          "description":"They will then need to accept your request. This will be the user that you just added in Part 1 of the article. You can also add other friends if you are playing Squads or Team Rumble or let Fortnite select random players to fill your squad."
        },
        {
          "headline":"Click on Play at the bottom right-hand corner.",
          "description":"You have now added a PS4 player to Fortnite on PC."
        }
      ]
    }
  ],
  "text":" Adding a PS4 Player on Epic Games Open the Epic Games launcher on your PC. The icon is black with Epic Games in the center. It can either be found on the desktop or by clicking on {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/07\\/Windowsstart.png\",\"bigUrl\":\"\\/images\\/thumb\\/0\\/07\\/Windowsstart.png\\/30px-Windowsstart.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":\"30\",\"bigHeight\":\"30\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of a Windows icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Public_domain\\\">Public Domain<\\/a><br>\\n<\\/p><\\/div>\"} Start and searching for Epic Games in the search bar. The Epic Games launcher, along with Fortnite, is free to install at www.epicgames.com/store/en-US/download Sign in to your Epic Games account with your login information. If you are already playing Fortnite then you should already have an Epic Games account. Click on Friends. This should be the fourth option below Epic Games on the left-hand side of the window. Click on the center icon on the pop-up window. The icon is a human silhouette with a plus sign and will say Add friend if you hover the mouse over it. Enter in the username or email address of the PS4 player. This will be the information that they use for their Epic Games account, not their PSN username. They must have an Epic Games account to proceed. Click Send to send the request. The PS4 player will need to log in to their Epic Games account to accept the friend request. If you are friends with the PS4 player on Steam or Facebook and they have their Epic account linked to either of these accounts, you can also click on Steam or Facebook to add them. You will then be required to sign into these accounts to see your shared friends. Adding a PS4 Player in Fortnite Launch Fortnite. You can find the game by going to the Library section on the Epic Games Launcher and clicking on the Fortnite icon. Click on Battle Royale on the left-hand side of the screen. This will take you to the Lobby. The time it takes for the Lobby to load will depend on your internet connection. Select the type of match by clicking on the button above Play. The default setting is Team Rumble, but there are other options to select, such as Squads or Duo. Click on Accept at the bottom right-hand corner.  Click on the  plus sign next to your character in the Lobby.  Click on Epic Friends on the pop-up menu.  Select the PS4 player’s name. They will then need to accept your request. This will be the user that you just added in Part 1 of the article. You can also add other friends if you are playing Squads or Team Rumble or let Fortnite select random players to fill your squad. Click on Play at the bottom right-hand corner. You have now added a PS4 player to Fortnite on PC.",
  "tyn_model":[
    "epic games",
    "fortnite",
    "epic games launcher",
    "ps4 player",
    "fortnite select"
  ],
  "tyn_section":[

  ]
}