{
  "title":"How to Access the Xbox One Cloud",
  "url":"https://www.wikihow.com/Access-the-Xbox-One-Cloud",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Xbox One"
  ],
  "steps":[
    {
      "headline":"Press the Xbox button.",
      "description":"This brings up the Xbox One Guide. If you're not playing on your own console, you can still sign in to your own profile to be able to access your cloud-saved data. Select Add & manage and then Add new, then enter your login information. Once your profile is added, you can select it from the Home screen."
    },
    {
      "headline":"Select the My games & apps tile and press A.",
      "description":"This opens your game library."
    },
    {
      "headline":"Highlight a game and press the Menu button.",
      "description":"This small button is located just to the left of the X button. Pressing it brings up a new menu."
    },
    {
      "headline":"Select Manage game & add-ons.",
      "description":"This brings up a new menu."
    },
    {
      "headline":"Select Saved Data.",
      "description":"This option appears on the left side of the screen."
    },
    {
      "headline":"Highlight the data associated with your gamertag and press A.",
      "description":"This brings up a confirmation menu with two options for deleting your data."
    },
    {
      "headline":"Choose which data to delete.",
      "description":"Once you make your selection, the data will be deleted from the selected location(s):\nSelect Delete everywhere to delete the local and cloud copies of the saved data associated with the game. Select Delete from console if you only want to delete the local copy of the saved data."
    }
  ],
  "text":" Press the Xbox button. This brings up the Xbox One Guide. If you're not playing on your own console, you can still sign in to your own profile to be able to access your cloud-saved data. Select Add & manage and then Add new, then enter your login information. Once your profile is added, you can select it from the Home screen. Select the My games & apps tile and press A. This opens your game library. Highlight a game and press the Menu button. This small button is located just to the left of the X button. Pressing it brings up a new menu. Select Manage game & add-ons. This brings up a new menu. Select Saved Data. This option appears on the left side of the screen. Highlight the data associated with your gamertag and press A. This brings up a confirmation menu with two options for deleting your data. Choose which data to delete. Once you make your selection, the data will be deleted from the selected location(s):\nSelect Delete everywhere to delete the local and cloud copies of the saved data associated with the game. Select Delete from console if you only want to delete the local copy of the saved data.",
  "tyn_model":[
    "xbox one guide"
  ],
  "tyn_section":[

  ]
}