{
  "title":"How to Use Light Umbrellas",
  "url":"https://www.wikihow.com/Use-Light-Umbrellas",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting"
  ],
  "methods":[
    {
      "name":"Choosing a Light Umbrella",
      "steps":[
        {
          "headline":"Choose a shoot-through umbrella if you want broader and softer light.",
          "description":"Shoot-through umbrellas are ideal for shooting groups of people or larger areas. Shoot-through umbrellas are white so they allow light to pass through them. Tip: Photography umbrellas can be used with any light source, so you don’t need to worry about what light source you are going to use when selecting an umbrella. A shoot-through umbrella will be positioned between your subject and the light source when shooting to diffuse the light before it reaches the subject."
        },
        {
          "headline":"Use a reflective umbrella if you want to maximize light output and direct light.",
          "description":"Reflective umbrellas bounce light back directly onto a subject and are best for creating a crisp picture, such as a portrait. Reflective umbrellas have a black top and a silver shade for reflecting light. A reflective umbrella will be placed with a light source between it and the subject to bounce the light back directly onto the subject when you shoot."
        },
        {
          "headline":"Select a convertible umbrella for the most versatile option.",
          "description":"A convertible photography umbrella is white and has a removable black cover. These types of umbrellas can be used as both a shoot-through and a reflective umbrella and are ideal if you want to shoot a variety of subjects. Keep in mind that bigger umbrellas are also more versatile and give you more control than smaller ones. A 6–7 ft (1.8–2.1 m) umbrella will give you the most control over your lighting, but they are also harder to travel with and harder to open in smaller spaces."
        }
      ]
    },
    {
      "name":"Shooting with a Shoot-Through Umbrella",
      "steps":[
        {
          "headline":"Face the shade of the umbrella away from your subject.",
          "description":"Open and set up your umbrella so that the top is pointing at the subject. Make sure you have room to set up your light source on the other side of the umbrella. Remember that shoot-through umbrellas are best when you want to achieve a soft glow instead of directly illuminating your subject. They work well for indoor photography."
        },
        {
          "headline":"Aim your light source directly at your subject through the shade of the umbrella.",
          "description":"Set up your light source on the other side of the umbrella from your subject. Turn on the light source and make sure that it fills up the underside of the umbrella evenly, with no light spilling over the edges. Move your light source further back from the umbrella if there are any spots that are brighter than others. Adjust the distance between the umbrella and the light until you get even coverage."
        },
        {
          "headline":"Adjust the angle of the light if you want to hide shadows.",
          "description":"Change the angle at which the light source and umbrella are aimed at your subject to put the shadows behind the subject. This is especially important when you are shooting portraits. Tip: Smaller light sources create harsher light and shadows, whereas bigger light sources create softer light and shadows. You can play with the angles to create different shadow effects as well if you don’t want to completely get rid of shadows."
        }
      ]
    },
    {
      "name":"Using a Reflective Umbrella",
      "steps":[
        {
          "headline":"Point the shade of the umbrella towards your subject.",
          "description":"Open the umbrella and set it up so the top is pointing away from your subject. Make sure there is room between the umbrella and your subject to put your light source. Remember that reflective umbrellas are best used to brighten a subject by bouncing light back onto it."
        },
        {
          "headline":"Aim your light source away from your subject at the shade of the umbrella.",
          "description":"Place your light source between your subject and the underside of the umbrella. Aim the light directly at the silver shade of the umbrella so it fills the entire underside evenly. Adjust the distance between the light source and the shade if there are any spots that are brighter than others until it is reflected evenly."
        },
        {
          "headline":"Change the position of the umbrella if you want to get stronger or softer light.",
          "description":"Move the light closer to the umbrella to create stronger light and shadows. Move it further away to create softer light and shadows. Tip: Use light umbrellas to create all kinds of different effects by experimenting with different positions, light sources, and even multiple umbrellas. The center of the umbrella has the most light output. You can tilt the umbrella so that the center is aimed directly at your subject for the most direct light, or tilt it away so the sides are aimed at your subject for less direct light."
        }
      ]
    }
  ],
  "text":" Choosing a Light Umbrella Choose a shoot-through umbrella if you want broader and softer light. Shoot-through umbrellas are ideal for shooting groups of people or larger areas. Shoot-through umbrellas are white so they allow light to pass through them. Tip: Photography umbrellas can be used with any light source, so you don’t need to worry about what light source you are going to use when selecting an umbrella. A shoot-through umbrella will be positioned between your subject and the light source when shooting to diffuse the light before it reaches the subject. Use a reflective umbrella if you want to maximize light output and direct light. Reflective umbrellas bounce light back directly onto a subject and are best for creating a crisp picture, such as a portrait. Reflective umbrellas have a black top and a silver shade for reflecting light. A reflective umbrella will be placed with a light source between it and the subject to bounce the light back directly onto the subject when you shoot. Select a convertible umbrella for the most versatile option. A convertible photography umbrella is white and has a removable black cover. These types of umbrellas can be used as both a shoot-through and a reflective umbrella and are ideal if you want to shoot a variety of subjects. Keep in mind that bigger umbrellas are also more versatile and give you more control than smaller ones. A 6–7 ft (1.8–2.1 m) umbrella will give you the most control over your lighting, but they are also harder to travel with and harder to open in smaller spaces. Shooting with a Shoot-Through Umbrella Face the shade of the umbrella away from your subject. Open and set up your umbrella so that the top is pointing at the subject. Make sure you have room to set up your light source on the other side of the umbrella. Remember that shoot-through umbrellas are best when you want to achieve a soft glow instead of directly illuminating your subject. They work well for indoor photography. Aim your light source directly at your subject through the shade of the umbrella. Set up your light source on the other side of the umbrella from your subject. Turn on the light source and make sure that it fills up the underside of the umbrella evenly, with no light spilling over the edges. Move your light source further back from the umbrella if there are any spots that are brighter than others. Adjust the distance between the umbrella and the light until you get even coverage. Adjust the angle of the light if you want to hide shadows. Change the angle at which the light source and umbrella are aimed at your subject to put the shadows behind the subject. This is especially important when you are shooting portraits. Tip: Smaller light sources create harsher light and shadows, whereas bigger light sources create softer light and shadows. You can play with the angles to create different shadow effects as well if you don’t want to completely get rid of shadows. Using a Reflective Umbrella Point the shade of the umbrella towards your subject. Open the umbrella and set it up so the top is pointing away from your subject. Make sure there is room between the umbrella and your subject to put your light source. Remember that reflective umbrellas are best used to brighten a subject by bouncing light back onto it. Aim your light source away from your subject at the shade of the umbrella. Place your light source between your subject and the underside of the umbrella. Aim the light directly at the silver shade of the umbrella so it fills the entire underside evenly. Adjust the distance between the light source and the shade if there are any spots that are brighter than others until it is reflected evenly. Change the position of the umbrella if you want to get stronger or softer light. Move the light closer to the umbrella to create stronger light and shadows. Move it further away to create softer light and shadows. Tip: Use light umbrellas to create all kinds of different effects by experimenting with different positions, light sources, and even multiple umbrellas. The center of the umbrella has the most light output. You can tilt the umbrella so that the center is aimed directly at your subject for the most direct light, or tilt it away so the sides are aimed at your subject for less direct light.",
  "tyn_model":[
    "umbrella",
    "umbrellas",
    "reflective umbrella",
    "light source",
    "shoot-through umbrellas",
    "reflective umbrellas"
  ],
  "tyn_section":[

  ]
}