{
  "title":"How to Polish Bronze",
  "url":"https://www.wikihow.com/Polish-Bronze",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Using Lemon Juice and Baking Soda",
      "steps":[
        {
          "headline":"Create a polishing paste with equal parts baking soda and lemon juice.",
          "description":"Pour the baking soda into a bowl and slowly add in the lemon juice, stirring continuously. Either freshly squeezed or bottled lemon juice will work. Modify the proportions if needed, until the mixture reaches the consistency of toothpaste. For a smaller bronze object, you can start with 2 US tbsp (30 mL) of baking soda and 2 US tbsp (30 mL) of lemon juice. Increase the recipe if you have more area to cover. The chemical reaction between lemon juice and baking soda will work to dissolve the tarnish affecting your bronze."
        },
        {
          "headline":"Spread the lemon-baking soda paste onto the tarnished bronze with a rag.",
          "description":"You can use a cleaning rag, a paper towel, or an old t-shirt to do this. Scoop up some of the polishing paste and apply it to the bronze object. Work in small, circular motions and use steady pressure as you buff the cleaning paste into the bronze. Apply more polishing paste and pressure to the areas that are more heavily tarnished."
        },
        {
          "headline":"Allow the polishing paste to sit on the bronze for at least 30 minutes.",
          "description":"After 30 minutes, do a spot-test and wipe away a small amount of the paste to see how the bronze is doing. If it looks like the patina is gone and the bronze has regained its bright metal gleam, go ahead and finish the polishing process by rinsing and drying the bronze. If you notice the bronze is still tarnished, leave on the paste for another 20 or 30 minutes before wiping it off."
        }
      ]
    },
    {
      "name":"Polishing with a Vinegar, Flour, and Salt Paste",
      "steps":[
        {
          "headline":"Combine vinegar, flour, and salt into a polishing paste.",
          "description":"Stir up a mixture of ⁄3  c (160 mL) of distilled white vinegar, ⁄3  c (160 mL) of all-purpose flour, and ⁄2  c (120 mL) of table salt. You should end up with a thick, gritty paste. It’s ok if there are a few lumps in the mixture."
        },
        {
          "headline":"Apply the polishing paste to the bronze with a rag or gloved hands.",
          "description":"You can use a cleaning rag to buff the paste into the tarnished metal. Or you can put on rubber gloves and smear the paste on directly using your hands. Rub the paste over the smooth areas and down into the grooves of the object. Leave a thin layer of paste over the whole surface of the object to allow the cleaning agents to work on eliminating the patina. This method is effective because the gritty flour and salt scrub away at the patina as the acidic vinegar works to dissolve it."
        },
        {
          "headline":"Let the paste sit on the bronze for up to 1 hour.",
          "description":"You’ll start to see the cleaning work after a few minutes, but you should leave it for at least 30 minutes so the paste has a chance to polish the more heavily tarnished areas. You can check the bronze by wiping away a small amount of paste. If there is still some patina left, leave the paste on for a full hour before rinsing it off."
        }
      ]
    },
    {
      "name":"Cleaning Bronze with Ketchup",
      "steps":[
        {
          "headline":"Place a small bronze object in a bowl and cover it completely with ketchup.",
          "description":"The amount of ketchup you use will depend on the size and surface area of the object you’re polishing. If you’re cleaning a small item, you can place it in a shallow bowl and squeeze a dollop of ordinary ketchup on top of it. Put on some rubber gloves and massage the ketchup into the item with your fingers, making sure every surface is covered. Try starting with 1 US tbsp (15 mL) and increase the amount of ketchup as needed."
        },
        {
          "headline":"Use a cleaning rag to buff ketchup onto a larger bronze object.",
          "description":"For larger bronze items, you can pour a larger quantity of ketchup directly onto the object and then spread it in a thin layer across the entire surface. Use a rag or your gloved hands to spread the ketchup across the smooth and grooved parts of the object. Depending on the size of the object, you could start with ⁄4 to ⁄2  c (59 to 118 mL) and add more if there are still areas left uncovered."
        },
        {
          "headline":"Let the ketchup work on polishing the bronze for up to 1 hour.",
          "description":"Check the polishing progress after about 30 minutes. If the bronze is still discolored, you can leave it in place for another 20 or 30 minutes. Or, if the bronze seems to be free of tarnish, you can proceed to rinse off the ketchup. The high concentration of vinegar and citric acid in ketchup causes the ordinary condiment to eat away at the tarnish."
        }
      ]
    },
    {
      "name":"Finalizing the Polishing Process",
      "steps":[
        {
          "headline":"Wipe off the polishing paste completely with a rag.",
          "description":"Whether you’ve used a homemade paste of vinegar, salt, and flour, applied a mixture of lemon and baking soda, or coated the tarnished object in ketchup, you’ll need to thoroughly wipe off polishing paste. Use a dry or damp rag to remove as much of the residue as you can. You could also use a paper towel or sponge since this process will get your cleaning rag a little messy."
        },
        {
          "headline":"Rinse off the bronze object with hot water.",
          "description":"You can either place the bronze item under running water or soak it in a hot water bath. The hot water will help dissolve the polishing paste and dislodge it from the bronze so you’re left with a clean and polished surface. Use your cleaning rag to wipe off any leftover polishing paste while you rinse off the bronze."
        },
        {
          "headline":"Dry off the bronze object with a soft cloth.",
          "description":"Use a clean, dry microfiber cloth or towel to remove all the moisture from the polished bronze. Make sure you soak up any drops of water that are left within the grooves of the bronze to prevent water spots from forming. Since body oils can get bronze dirty, wear rubber or cotton gloves when you’re drying off and handling bronze. If you notice some areas still have a dirty-looking patina, you can repeat the polishing process."
        },
        {
          "headline":"Burnish the bronze with a few drops of olive oil to restore its shine.",
          "description":"Use a clean cloth or paper towel to rub a small amount of olive oil into the newly polished surface of your bronze item. Work in small, circular motions and apply steady pressure to coat the bronze in a thin layer of olive oil. The olive oil will provide a shiny finish and will seal off the metal from the elements naturally."
        }
      ]
    }
  ],
  "text":" Using Lemon Juice and Baking Soda Create a polishing paste with equal parts baking soda and lemon juice. Pour the baking soda into a bowl and slowly add in the lemon juice, stirring continuously. Either freshly squeezed or bottled lemon juice will work. Modify the proportions if needed, until the mixture reaches the consistency of toothpaste. For a smaller bronze object, you can start with 2 US tbsp (30 mL) of baking soda and 2 US tbsp (30 mL) of lemon juice. Increase the recipe if you have more area to cover. The chemical reaction between lemon juice and baking soda will work to dissolve the tarnish affecting your bronze. Spread the lemon-baking soda paste onto the tarnished bronze with a rag. You can use a cleaning rag, a paper towel, or an old t-shirt to do this. Scoop up some of the polishing paste and apply it to the bronze object. Work in small, circular motions and use steady pressure as you buff the cleaning paste into the bronze. Apply more polishing paste and pressure to the areas that are more heavily tarnished. Allow the polishing paste to sit on the bronze for at least 30 minutes. After 30 minutes, do a spot-test and wipe away a small amount of the paste to see how the bronze is doing. If it looks like the patina is gone and the bronze has regained its bright metal gleam, go ahead and finish the polishing process by rinsing and drying the bronze. If you notice the bronze is still tarnished, leave on the paste for another 20 or 30 minutes before wiping it off. Polishing with a Vinegar, Flour, and Salt Paste Combine vinegar, flour, and salt into a polishing paste. Stir up a mixture of ⁄3  c (160 mL) of distilled white vinegar, ⁄3  c (160 mL) of all-purpose flour, and ⁄2  c (120 mL) of table salt. You should end up with a thick, gritty paste. It’s ok if there are a few lumps in the mixture. Apply the polishing paste to the bronze with a rag or gloved hands. You can use a cleaning rag to buff the paste into the tarnished metal. Or you can put on rubber gloves and smear the paste on directly using your hands. Rub the paste over the smooth areas and down into the grooves of the object. Leave a thin layer of paste over the whole surface of the object to allow the cleaning agents to work on eliminating the patina. This method is effective because the gritty flour and salt scrub away at the patina as the acidic vinegar works to dissolve it. Let the paste sit on the bronze for up to 1 hour. You’ll start to see the cleaning work after a few minutes, but you should leave it for at least 30 minutes so the paste has a chance to polish the more heavily tarnished areas. You can check the bronze by wiping away a small amount of paste. If there is still some patina left, leave the paste on for a full hour before rinsing it off. Cleaning Bronze with Ketchup Place a small bronze object in a bowl and cover it completely with ketchup. The amount of ketchup you use will depend on the size and surface area of the object you’re polishing. If you’re cleaning a small item, you can place it in a shallow bowl and squeeze a dollop of ordinary ketchup on top of it. Put on some rubber gloves and massage the ketchup into the item with your fingers, making sure every surface is covered. Try starting with 1 US tbsp (15 mL) and increase the amount of ketchup as needed. Use a cleaning rag to buff ketchup onto a larger bronze object. For larger bronze items, you can pour a larger quantity of ketchup directly onto the object and then spread it in a thin layer across the entire surface. Use a rag or your gloved hands to spread the ketchup across the smooth and grooved parts of the object. Depending on the size of the object, you could start with ⁄4 to ⁄2  c (59 to 118 mL) and add more if there are still areas left uncovered. Let the ketchup work on polishing the bronze for up to 1 hour. Check the polishing progress after about 30 minutes. If the bronze is still discolored, you can leave it in place for another 20 or 30 minutes. Or, if the bronze seems to be free of tarnish, you can proceed to rinse off the ketchup. The high concentration of vinegar and citric acid in ketchup causes the ordinary condiment to eat away at the tarnish. Finalizing the Polishing Process Wipe off the polishing paste completely with a rag. Whether you’ve used a homemade paste of vinegar, salt, and flour, applied a mixture of lemon and baking soda, or coated the tarnished object in ketchup, you’ll need to thoroughly wipe off polishing paste. Use a dry or damp rag to remove as much of the residue as you can. You could also use a paper towel or sponge since this process will get your cleaning rag a little messy. Rinse off the bronze object with hot water. You can either place the bronze item under running water or soak it in a hot water bath. The hot water will help dissolve the polishing paste and dislodge it from the bronze so you’re left with a clean and polished surface. Use your cleaning rag to wipe off any leftover polishing paste while you rinse off the bronze. Dry off the bronze object with a soft cloth. Use a clean, dry microfiber cloth or towel to remove all the moisture from the polished bronze. Make sure you soak up any drops of water that are left within the grooves of the bronze to prevent water spots from forming. Since body oils can get bronze dirty, wear rubber or cotton gloves when you’re drying off and handling bronze. If you notice some areas still have a dirty-looking patina, you can repeat the polishing process. Burnish the bronze with a few drops of olive oil to restore its shine. Use a clean cloth or paper towel to rub a small amount of olive oil into the newly polished surface of your bronze item. Work in small, circular motions and apply steady pressure to coat the bronze in a thin layer of olive oil. The olive oil will provide a shiny finish and will seal off the metal from the elements naturally.",
  "tyn_model":[
    "ketchup",
    "baking soda",
    "lemon juice",
    "vinegar",
    "flour",
    "salt",
    "olive oil",
    "water",
    "paper towel",
    "polishing paste",
    "rubber gloves",
    "bowl",
    "distilled white vinegar",
    "all-purpose flour",
    "table salt",
    "cleaning agents",
    "cleaning rag",
    "citric acid",
    "rag",
    "lemon",
    "sponge",
    "hot water",
    "microfiber cloth"
  ],
  "tyn_section":[

  ]
}