{
  "title":"How to Get Eyeshadow Out of Carpet",
  "url":"https://www.wikihow.com/Get-Eyeshadow-Out-of-Carpet",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Carpets and Rugs",
    "Cleaning Carpets"
  ],
  "methods":[
    {
      "name":"Getting up the Dry Makeup",
      "steps":[
        {
          "headline":"Vacuum up the makeup with an upholstery attachment.",
          "description":"Attach the upholstery end to the vacuum's hose by clicking it into place. Turn the vacuum on, and then run the upholstery attachment over the stain. This process should get most of the dry powder up. It's best to get as much of the dry powder up as you can, as when you add a stain remover or any wet ingredient, it will spread the stain around a bit."
        },
        {
          "headline":"Blot at the stain with a dry cleaning solvent if you have it.",
          "description":"Pour a little of the cleaner on a white washcloth, and then dab at the stain with the solvent. As the cloth becomes saturated with the makeup, move to a clean spot on the washcloth. This might remove all the stain, and you won't need to take further steps. To get the solvent out of the carpet, blot it with a clean, damp cloth. Work in a ventilated area when using dry cleaning solvent. Even though dry cleaning solvent is a liquid, it doesn't contain water. Therefore, it's less likely to spread the stain around. Plus, it helps get up greasy or messy products like eyeshadow."
        },
        {
          "headline":"Dab a damp washcloth on the stain if you don’t have any solvent.",
          "description":"Dip your washcloth into warm water and wring it out thoroughly. Place it over the stain and press down before lifting up the washcloth again. Rearranging the cloth so you have a clean area to work with, press down again. Repeat this a few times. While water can spread the stain, a barely damp washcloth will pick up some of the powder without spreading it; just make sure you dab and don't rub the stain, which will spread it around."
        }
      ]
    },
    {
      "name":"Using Shaving Cream",
      "steps":[
        {
          "headline":"Dampen the area if you haven't already.",
          "description":"Dip a washcloth in warm water and dab at the stain to get it just barely wet. You don't want to pour too much water on it, though, as that could flush the stain down into the pad or spread the stain around."
        },
        {
          "headline":"Spray enough shaving cream on the carpet to cover the stain.",
          "description":"Hold the can over the stain and begin spraying. Use enough so that the whole area is completely hidden with the shaving cream. Use shaving cream only for this purpose, not gel. Shaving cream's airy texture is perfect for treating carpet. Some people prefer to let the shaving cream sit for a minute or 2 before working it in."
        },
        {
          "headline":"Work the shaving cream into the carpet.",
          "description":"With a clean, damp washcloth, rub the shaving cream into the carpet. Use small, circular motions to work it in, making sure you get down into the carpet as far as you can. You can also use your fingers to massage it in like you're working shampoo into your hair."
        },
        {
          "headline":"Dab up the shaving cream with a clean, damp washcloth.",
          "description":"You can spritz the area with a bit of water to help pick up the shaving cream. You can also add a bit more water and then use a clean towel to pick it up. With the towel over the stain, press down into the carpet as hard as you can, then move to a clean, dry spot on the towel and repeat. If shaving cream doesn't work for you, try another household cleaning solution, such as dishwashing soap or glass cleaner."
        }
      ]
    },
    {
      "name":"Using Other Household Items",
      "steps":[
        {
          "headline":"Dab at the stain with dishwashing soap and water to cut through oily eyeshadows.",
          "description":"Add 1 tablespoon (15 mL) of liquid dishwashing soap to a small glass or jar. Pour in 1 cup (240 mL) of warm water and stir to combine. Dip a washcloth into the mixture and wring it out before dabbing at the stain. Keep going until the stain is gone. Dishwashing soap cuts grease, which may help when removing some eyeshadows. Try other solvents if this one doesn't work."
        },
        {
          "headline":"Spray on some glass cleaner to remove the stain with ammonia.",
          "description":"Glass cleaner contains ammonia, which can work wonders on stains. Spray the stain so it's damp, but don't get it so wet that it's sopping. Rub at the stain with a clean towel until it comes up and you get all of the cleaner out. If you don't have glass cleaner, you can pour 1 tablespoon (15 mL) of ammonia into 0.5 cups (120 mL) of warm water. Use it the same way as the glass cleaner. Always spot check the carpet first, as most glass cleaners do have some dye in them. Never mix ammonia and bleach, as it makes toxic fumes. You may need to call in a professional if ammonia or vinegar doesn't work to get the stain out."
        },
        {
          "headline":"Try a mixture of vinegar and water for a cheap and quick solution.",
          "description":"Add 1 teaspoon (4.9 mL) of white vinegar to a small jar and then pour in 1 cup (240 mL) of warm water. Dampen a clean washcloth or rag with the solution and blot the stain with it until it's gone."
        },
        {
          "headline":"Dab the stain with 2-3 drops of hydrogen peroxide for a stubborn stain.",
          "description":"Apply the hydrogen peroxide to a clean cloth, then blot the stain with the peroxide. Let the peroxide sit for 5 minutes, then blot the stain with a clean cloth. This should bring up the stain. Test the hydrogen peroxide on a hidden part of the carpet first to make sure it won't stain. It's best to only try hydrogen peroxide if you have light colored carpet because it can cause bleaching."
        }
      ]
    }
  ],
  "text":" Getting up the Dry Makeup Vacuum up the makeup with an upholstery attachment. Attach the upholstery end to the vacuum's hose by clicking it into place. Turn the vacuum on, and then run the upholstery attachment over the stain. This process should get most of the dry powder up. It's best to get as much of the dry powder up as you can, as when you add a stain remover or any wet ingredient, it will spread the stain around a bit. Blot at the stain with a dry cleaning solvent if you have it. Pour a little of the cleaner on a white washcloth, and then dab at the stain with the solvent. As the cloth becomes saturated with the makeup, move to a clean spot on the washcloth. This might remove all the stain, and you won't need to take further steps. To get the solvent out of the carpet, blot it with a clean, damp cloth. Work in a ventilated area when using dry cleaning solvent. Even though dry cleaning solvent is a liquid, it doesn't contain water. Therefore, it's less likely to spread the stain around. Plus, it helps get up greasy or messy products like eyeshadow. Dab a damp washcloth on the stain if you don’t have any solvent. Dip your washcloth into warm water and wring it out thoroughly. Place it over the stain and press down before lifting up the washcloth again. Rearranging the cloth so you have a clean area to work with, press down again. Repeat this a few times. While water can spread the stain, a barely damp washcloth will pick up some of the powder without spreading it; just make sure you dab and don't rub the stain, which will spread it around. Using Shaving Cream Dampen the area if you haven't already. Dip a washcloth in warm water and dab at the stain to get it just barely wet. You don't want to pour too much water on it, though, as that could flush the stain down into the pad or spread the stain around. Spray enough shaving cream on the carpet to cover the stain. Hold the can over the stain and begin spraying. Use enough so that the whole area is completely hidden with the shaving cream. Use shaving cream only for this purpose, not gel. Shaving cream's airy texture is perfect for treating carpet. Some people prefer to let the shaving cream sit for a minute or 2 before working it in. Work the shaving cream into the carpet. With a clean, damp washcloth, rub the shaving cream into the carpet. Use small, circular motions to work it in, making sure you get down into the carpet as far as you can. You can also use your fingers to massage it in like you're working shampoo into your hair. Dab up the shaving cream with a clean, damp washcloth. You can spritz the area with a bit of water to help pick up the shaving cream. You can also add a bit more water and then use a clean towel to pick it up. With the towel over the stain, press down into the carpet as hard as you can, then move to a clean, dry spot on the towel and repeat. If shaving cream doesn't work for you, try another household cleaning solution, such as dishwashing soap or glass cleaner. Using Other Household Items Dab at the stain with dishwashing soap and water to cut through oily eyeshadows. Add 1 tablespoon (15 mL) of liquid dishwashing soap to a small glass or jar. Pour in 1 cup (240 mL) of warm water and stir to combine. Dip a washcloth into the mixture and wring it out before dabbing at the stain. Keep going until the stain is gone. Dishwashing soap cuts grease, which may help when removing some eyeshadows. Try other solvents if this one doesn't work. Spray on some glass cleaner to remove the stain with ammonia. Glass cleaner contains ammonia, which can work wonders on stains. Spray the stain so it's damp, but don't get it so wet that it's sopping. Rub at the stain with a clean towel until it comes up and you get all of the cleaner out. If you don't have glass cleaner, you can pour 1 tablespoon (15 mL) of ammonia into 0.5 cups (120 mL) of warm water. Use it the same way as the glass cleaner. Always spot check the carpet first, as most glass cleaners do have some dye in them. Never mix ammonia and bleach, as it makes toxic fumes. You may need to call in a professional if ammonia or vinegar doesn't work to get the stain out. Try a mixture of vinegar and water for a cheap and quick solution. Add 1 teaspoon (4.9 mL) of white vinegar to a small jar and then pour in 1 cup (240 mL) of warm water. Dampen a clean washcloth or rag with the solution and blot the stain with it until it's gone. Dab the stain with 2-3 drops of hydrogen peroxide for a stubborn stain. Apply the hydrogen peroxide to a clean cloth, then blot the stain with the peroxide. Let the peroxide sit for 5 minutes, then blot the stain with a clean cloth. This should bring up the stain. Test the hydrogen peroxide on a hidden part of the carpet first to make sure it won't stain. It's best to only try hydrogen peroxide if you have light colored carpet because it can cause bleaching.",
  "tyn_model":[
    "water",
    "shaving cream",
    "washcloth",
    "glass cleaner",
    "ammonia",
    "dishwashing soap",
    "hydrogen peroxide",
    "upholstery attachment",
    "vacuum",
    "dry cleaning solvent",
    "vinegar",
    "stain remover",
    "dry cleaning",
    "shampoo",
    "towel",
    "household cleaning solution",
    "glass cleaners",
    "bleach",
    "white vinegar",
    "peroxide"
  ],
  "tyn_section":[

  ]
}