{
  "title":"How to Master Robot Unicorn Attack",
  "url":"https://www.wikihow.com/Master-Robot-Unicorn-Attack",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games"
  ],
  "steps":[
    {
      "headline":"The game is simple; hit Z to Jump and X to Dash.",
      "description":"You must Dash into the stars that appear; otherwise, you will combust and lose a wish."
    },
    {
      "headline":"Practice!",
      "description":"The game gets faster as you accumulate points. Every time you collect a fairy, you receive 10 points. For every additional fairy, another 10 is added. So, if you collect three Fairies, the first gives 10 points, the second gives 20, and the third gives 30. Altogether, you receive 60 points. If you miss a fairy, their value resets to 10."
    },
    {
      "headline":"Stars work in the same manner.",
      "description":"They are worth 100 points each, and every additional one that you hit gives 100 more than the last. If you hit four stars in a row, the first gives you 100 points, the second gives 200, the third 300, and the fourth 400. If you miss a star, their value resets to 100."
    },
    {
      "headline":"Watch the screen and listen for signs of stars.",
      "description":"You will hear a magical sound right before a star appears. If you pay attention to the screen and are coming towards a place that has two ways to go, you will know which way has the star."
    },
    {
      "headline":"Once you reach 25,000 points, you will realize that you are in the air most of the time.",
      "description":"After double-jumping, you can dash, double jump, dash, double jump, and dash again before you must touch the ground."
    },
    {
      "headline":"Jump right before you hit a star, although not required.",
      "description":"There is one scene in which you must jump to reach a ledge with a star on it or else you will hit the ledge and combust. Have fun and good luck!"
    }
  ],
  "text":" The game is simple; hit Z to Jump and X to Dash. You must Dash into the stars that appear; otherwise, you will combust and lose a wish. Practice! The game gets faster as you accumulate points. Every time you collect a fairy, you receive 10 points. For every additional fairy, another 10 is added. So, if you collect three Fairies, the first gives 10 points, the second gives 20, and the third gives 30. Altogether, you receive 60 points. If you miss a fairy, their value resets to 10. Stars work in the same manner. They are worth 100 points each, and every additional one that you hit gives 100 more than the last. If you hit four stars in a row, the first gives you 100 points, the second gives 200, the third 300, and the fourth 400. If you miss a star, their value resets to 100. Watch the screen and listen for signs of stars. You will hear a magical sound right before a star appears. If you pay attention to the screen and are coming towards a place that has two ways to go, you will know which way has the star. Once you reach 25,000 points, you will realize that you are in the air most of the time. After double-jumping, you can dash, double jump, dash, double jump, and dash again before you must touch the ground. Jump right before you hit a star, although not required. There is one scene in which you must jump to reach a ledge with a star on it or else you will hit the ledge and combust. Have fun and good luck!",
  "tyn_model":[
    "fairy",
    "stars",
    "fairies",
    "star"
  ],
  "tyn_section":[

  ]
}