{
  "title":"How to Contact Roblox",
  "url":"https://www.wikihow.com/Contact-Roblox",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games",
    "Roblox"
  ],
  "methods":[
    {
      "name":"Calling Roblox Customer Support",
      "steps":[
        {
          "headline":"Dial 888-858-2569 to call Roblox customer service.",
          "description":"The Roblox customer support line is available 24 hours a day, 7 days a week. It uses an automated menu system and will require you to leave a voice message with your account information before they call you back.Tip: The Roblox customer support number is useful if you have a very specific question, but you won't be able to speak to someone directly until they call you back, which may take some time. The customer support number is toll-free."
        },
        {
          "headline":"Press 1 if you're under 18 years of age and need help.",
          "description":"If you're under 18, Roblox customer support will not speak to you over the phone, but they will provide you with information regarding where you can find help online, including instructions on how to get to their customer support page. If you're under 18, enlist an adult to help you call. That way they can talk to someone for you!"
        },
        {
          "headline":"Press 2 if you're a parent or player older than 18 years of age.",
          "description":"Follow the automated menu prompts based on your issue, question, or concern. You can get information about your Roblox account, billing, or software from the automated menu before it gives you the option to leave a voicemail."
        },
        {
          "headline":"Press 0 after pressing 2 to leave a message and get a call back.",
          "description":"Roblox will call you back after you leave a detailed message about your question or concern. You'll be asked to provide your name, your Roblox account name, and your billing information before you explain what you need help with."
        }
      ]
    },
    {
      "name":"Emailing Roblox Customer Support Directly",
      "steps":[
        {
          "headline":"Send your question to info@Roblox.com.",
          "description":"While Roblox promotes their online customer support fillable form, they do have a dedicated email address for general questions. It may take slightly longer for them to respond though.Tip: If you want to appeal a ban or warning, you should email appeals@roblox.com instead."
        },
        {
          "headline":"Draft a detailed explanation of what you need help with.",
          "description":"Include your name, account information, and any relevant billing information in your message. Try to be as detailed as possible about what you need help with."
        },
        {
          "headline":"Wait for a response or additional explanation.",
          "description":"Roblox doesn't offer live support, so you may need to wait some time for a response. Be patient, and be prepared to answer any questions about additional information that customer support may need to assist you."
        }
      ]
    },
    {
      "name":"Using the Roblox Support Form Online",
      "steps":[
        {
          "headline":"Visit the Roblox support page to use the fillable form.",
          "description":"This webpage contains the fillable form that you can use to ask Roblox for help with a specific issue. It is Roblox's primary method for responding to customer complaints and concerns. You can visit the Roblox support page at https://www.roblox.com/support.Tip: Customer service can only help you with billing concerns and account issues. If you need information about development or building in-game, visit the Roblox Developer Hub at developer.Roblox.com."
        },
        {
          "headline":"Fill in your contact information at the top.",
          "description":"You'll need to enter your name, email address, and Roblox username. If you are younger than 13, you'll have to use your parent's email address. Confirm your email address by entering it twice and check the spelling to confirm that it's correct. You don't need to enter your last name in the name section. Your first name is fine."
        },
        {
          "headline":"Select the platform you use and the category of your question.",
          "description":"Because the game is slightly different depending on the platform that you play it on, you'll need to select whether you play the game on a console, PC, or tablet. Beneath that, you'll select the category of your issue or question.Tip: If you want to report someone for cheating, select “exploit report” as your category."
        },
        {
          "headline":"Describe your issue or concern at the bottom of the page.",
          "description":"Be as detailed as possible. Include relevant details like how an issue has occurred or what the details of an error message are. Make a note about when the issue has occurred as well, just in case they need to refer to the game logs from your playing sessions. Roblox customer support will respond to you via email. Check the inbox of the email address that you provided in a few hours for a reply."
        }
      ]
    }
  ],
  "text":" Calling Roblox Customer Support Dial 888-858-2569 to call Roblox customer service. The Roblox customer support line is available 24 hours a day, 7 days a week. It uses an automated menu system and will require you to leave a voice message with your account information before they call you back.Tip: The Roblox customer support number is useful if you have a very specific question, but you won't be able to speak to someone directly until they call you back, which may take some time. The customer support number is toll-free. Press 1 if you're under 18 years of age and need help. If you're under 18, Roblox customer support will not speak to you over the phone, but they will provide you with information regarding where you can find help online, including instructions on how to get to their customer support page. If you're under 18, enlist an adult to help you call. That way they can talk to someone for you! Press 2 if you're a parent or player older than 18 years of age. Follow the automated menu prompts based on your issue, question, or concern. You can get information about your Roblox account, billing, or software from the automated menu before it gives you the option to leave a voicemail. Press 0 after pressing 2 to leave a message and get a call back. Roblox will call you back after you leave a detailed message about your question or concern. You'll be asked to provide your name, your Roblox account name, and your billing information before you explain what you need help with. Emailing Roblox Customer Support Directly Send your question to info@Roblox.com. While Roblox promotes their online customer support fillable form, they do have a dedicated email address for general questions. It may take slightly longer for them to respond though.Tip: If you want to appeal a ban or warning, you should email appeals@roblox.com instead. Draft a detailed explanation of what you need help with. Include your name, account information, and any relevant billing information in your message. Try to be as detailed as possible about what you need help with. Wait for a response or additional explanation. Roblox doesn't offer live support, so you may need to wait some time for a response. Be patient, and be prepared to answer any questions about additional information that customer support may need to assist you. Using the Roblox Support Form Online Visit the Roblox support page to use the fillable form. This webpage contains the fillable form that you can use to ask Roblox for help with a specific issue. It is Roblox's primary method for responding to customer complaints and concerns. You can visit the Roblox support page at https://www.roblox.com/support.Tip: Customer service can only help you with billing concerns and account issues. If you need information about development or building in-game, visit the Roblox Developer Hub at developer.Roblox.com. Fill in your contact information at the top. You'll need to enter your name, email address, and Roblox username. If you are younger than 13, you'll have to use your parent's email address. Confirm your email address by entering it twice and check the spelling to confirm that it's correct. You don't need to enter your last name in the name section. Your first name is fine. Select the platform you use and the category of your question. Because the game is slightly different depending on the platform that you play it on, you'll need to select whether you play the game on a console, PC, or tablet. Beneath that, you'll select the category of your issue or question.Tip: If you want to report someone for cheating, select “exploit report” as your category. Describe your issue or concern at the bottom of the page. Be as detailed as possible. Include relevant details like how an issue has occurred or what the details of an error message are. Make a note about when the issue has occurred as well, just in case they need to refer to the game logs from your playing sessions. Roblox customer support will respond to you via email. Check the inbox of the email address that you provided in a few hours for a reply.",
  "tyn_model":[
    "roblox support",
    "roblox customer support",
    "roblox account",
    "roblox customer service",
    "customer support number",
    "customer support page",
    "roblox will",
    "roblox does",
    "customer support may need to assist you.",
    "roblox developer",
    "“exploit",
    "” as"
  ],
  "tyn_section":[

  ]
}