{
  "title":"How to Make Vanilla Vegan Pudding",
  "url":"https://www.wikihow.com/Make-Vanilla-Vegan-Pudding",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan"
  ],
  "steps":[
    {
      "headline":"Heat the arrowroot, soy milk and soy creamer in a saucepan over medium heat.",
      "description":"Make sure that you mix the mixture frequently to prevent it from burning."
    },
    {
      "headline":"Add the agave syrup and stir it in until it is dissolved.",
      "description":""
    },
    {
      "headline":"Simmer the mixture on a low boil, whisking regularly, until it thickens.",
      "description":"Once it's thick, remove it from the heat immediately."
    },
    {
      "headline":"Add the egg replacer to a small bowl.",
      "description":""
    },
    {
      "headline":"Pour in the hot soy milk and whisk the two together.",
      "description":""
    },
    {
      "headline":"Pour the whisked egg replacer mixture into the the heated mixture and cook them together over medium heat for 3 to 4 minutes.",
      "description":""
    },
    {
      "headline":"Remove the mixture from the heat once it thickens.",
      "description":""
    },
    {
      "headline":"Allow to pudding to cool for 15 minutes and then gently stir in the vanilla extract.",
      "description":"Leave it to cool to room temperature."
    },
    {
      "headline":"Place the pudding in the refrigerator once it reaches a comfortable room temperature.",
      "description":"Refrigerate it for at least 3 hours before serving, although it is best left to chill overnight."
    },
    {
      "headline":"Serve your vegan vanilla pudding with slices of fruit, a suitable sauce, chocolate shavings, or with soy ice cream.",
      "description":""
    }
  ],
  "text":" Heat the arrowroot, soy milk and soy creamer in a saucepan over medium heat. Make sure that you mix the mixture frequently to prevent it from burning. Add the agave syrup and stir it in until it is dissolved.  Simmer the mixture on a low boil, whisking regularly, until it thickens. Once it's thick, remove it from the heat immediately. Add the egg replacer to a small bowl.  Pour in the hot soy milk and whisk the two together.  Pour the whisked egg replacer mixture into the the heated mixture and cook them together over medium heat for 3 to 4 minutes.  Remove the mixture from the heat once it thickens.  Allow to pudding to cool for 15 minutes and then gently stir in the vanilla extract. Leave it to cool to room temperature. Place the pudding in the refrigerator once it reaches a comfortable room temperature. Refrigerate it for at least 3 hours before serving, although it is best left to chill overnight. Serve your vegan vanilla pudding with slices of fruit, a suitable sauce, chocolate shavings, or with soy ice cream. ",
  "tyn_model":[
    "soy milk",
    "arrowroot",
    "soy creamer",
    "saucepan",
    "agave syrup",
    "egg replacer",
    "small bowl",
    "vanilla extract",
    "refrigerator",
    "vanilla pudding",
    "chocolate shavings",
    "soy ice cream"
  ],
  "tyn_section":[

  ]
}