{
  "title":"How to Get CS:GO on Xbox One",
  "url":"https://www.wikihow.com/Get-CS:GO-on-Xbox-One",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Xbox One"
  ],
  "steps":[
    {
      "headline":"Open a browser on your computer and go to CS:GO's page on the Xbox store.",
      "description":""
    },
    {
      "headline":"Click Buy Game.",
      "description":"This option is on the left side of the screen. You'll be prompted to sign in to your Microsoft account here if you're not already signed in."
    },
    {
      "headline":"Move to your Xbox One and press the Xbox button.",
      "description":"The Xbox button is the large silver button in the middle of the controller. This opens the Xbox Guide."
    },
    {
      "headline":"Select the My Games and Apps icon and press X.",
      "description":"This icon looks like a game controller next to a console and is visible on the far left of the row just under the Home option."
    },
    {
      "headline":"Press X again to choose See All.",
      "description":""
    },
    {
      "headline":"Highlight Ready to Install if it's not already highlighted.",
      "description":""
    },
    {
      "headline":"Scroll through the Ready to Install list and select CS:GO.",
      "description":"This brings up a confirmation page."
    },
    {
      "headline":"Press X to select Install All.",
      "description":"CS:GO is downloaded to your Xbox One console."
    }
  ],
  "text":" Open a browser on your computer and go to CS:GO's page on the Xbox store.  Click Buy Game. This option is on the left side of the screen. You'll be prompted to sign in to your Microsoft account here if you're not already signed in. Move to your Xbox One and press the Xbox button. The Xbox button is the large silver button in the middle of the controller. This opens the Xbox Guide. Select the My Games and Apps icon and press X. This icon looks like a game controller next to a console and is visible on the far left of the row just under the Home option. Press X again to choose See All.  Highlight Ready to Install if it's not already highlighted.  Scroll through the Ready to Install list and select CS:GO. This brings up a confirmation page. Press X to select Install All. CS:GO is downloaded to your Xbox One console.",
  "tyn_model":[
    "xbox button",
    "xbox one",
    "xbox guide",
    "game controller",
    "console",
    "xbox one console"
  ],
  "tyn_section":[

  ]
}