{
  "title":"How to Get Recycle Bins",
  "url":"https://www.wikihow.com/Get-Recycle-Bins",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Household Waste Disposal",
    "Recycling"
  ],
  "methods":[
    {
      "name":"Requesting a Container from the City",
      "steps":[
        {
          "headline":"Check your city’s waste management website to see if you can request bins.",
          "description":"Go to your city’s government website to find who’s in charge of waste management in your area. Follow any links to their website to find information about the recycling containers they use. Look for a link or button where you can request a bin for your home and click it. If you have trouble navigating through your city’s website, you can also do a web search for your city’s name followed by “recycling bins.”"
        },
        {
          "headline":"Fill out the online form with your personal information.",
          "description":"When you click the request link for the recycling bin, it will pull up a form asking for your name and address. The form may also ask you to provide the date you moved into your location and if your home is newly constructed. Fill out the form completely before clicking the submit button. If there isn’t an online form to fill out, you may need to call the waste management facility directly to learn how to get a new bin.Tip: Check with your landlord before requesting a bin if you live in a rental property or apartment complex. You may not be able to request individual bins if there’s already a dumpster on site."
        },
        {
          "headline":"Pay any bin replacement fees if you’re prompted to.",
          "description":"You may get your new bin for free from the city if you don’t currently have a recycling bin at your home. However, if you submitted the form and it states you owe a fee, provide your credit card information to pay for the bin. You can also usually write a check for the recycling bin if you prefer to pay that way. Recycling bins can cost anywhere from $11 USD for a bin with an 11 US gal (42 L) capacity up to $70 USD for a 96 US gal (360 L) bin. Large recycling bins usually have a lifespan of 10 years. Some cities may offer a prorated fee for your new bin depending on how old your current one is."
        },
        {
          "headline":"Pick up a bin if you don’t want to pay for delivery.",
          "description":"Some cities will charge you a non-refundable fee for delivering a new bin to your home. Check if you can go directly to the waste management facility to get your new bin if you don’t want to pay for the fee. The delivery fee is not included in the price of a replacement bin. New bins are usually delivered the day after regular recycling collection."
        }
      ]
    },
    {
      "name":"Buying Your Own Container",
      "steps":[
        {
          "headline":"Check the type of container used by your city’s waste management facility.",
          "description":"Go to your city’s website and locate the waste management page. Find the information about the type of recycling bins they use and if they have an option where you can buy your own. Write down the type of bin they use and the maximum capacity they can so you know what to look for. If your city does manual recycling collection, you can use any storage bin that matches the maximum capacity listed. Your city may require a specific brand or style of bin if they use a truck for recycling collection."
        },
        {
          "headline":"Shop online or at hardware stores for the recycling bins your city uses.",
          "description":"Check your local hardware stores to see if they sell bins that match the size and style of what your city uses. If you can’t find any recycling bins at the hardware store, then search online to see what’s available. Get the specific brand or model that the waste management site lists to make sure it’s compatible with their equipment. Many recycling bins come with manufacturer warranties so you can easily replace them."
        },
        {
          "headline":"Return or recycle your old container if you have one.",
          "description":"If you had a recycling bin from the city, contact the waste management facility in your city to see how to properly get rid of it. Recycling collectors may put a sticker on your current bin so they know to recycle it during the next pickup. Otherwise, you may have to drop off the old bin at the facility yourself."
        }
      ]
    }
  ],
  "text":" Requesting a Container from the City Check your city’s waste management website to see if you can request bins. Go to your city’s government website to find who’s in charge of waste management in your area. Follow any links to their website to find information about the recycling containers they use. Look for a link or button where you can request a bin for your home and click it. If you have trouble navigating through your city’s website, you can also do a web search for your city’s name followed by “recycling bins.” Fill out the online form with your personal information. When you click the request link for the recycling bin, it will pull up a form asking for your name and address. The form may also ask you to provide the date you moved into your location and if your home is newly constructed. Fill out the form completely before clicking the submit button. If there isn’t an online form to fill out, you may need to call the waste management facility directly to learn how to get a new bin.Tip: Check with your landlord before requesting a bin if you live in a rental property or apartment complex. You may not be able to request individual bins if there’s already a dumpster on site. Pay any bin replacement fees if you’re prompted to. You may get your new bin for free from the city if you don’t currently have a recycling bin at your home. However, if you submitted the form and it states you owe a fee, provide your credit card information to pay for the bin. You can also usually write a check for the recycling bin if you prefer to pay that way. Recycling bins can cost anywhere from $11 USD for a bin with an 11 US gal (42 L) capacity up to $70 USD for a 96 US gal (360 L) bin. Large recycling bins usually have a lifespan of 10 years. Some cities may offer a prorated fee for your new bin depending on how old your current one is. Pick up a bin if you don’t want to pay for delivery. Some cities will charge you a non-refundable fee for delivering a new bin to your home. Check if you can go directly to the waste management facility to get your new bin if you don’t want to pay for the fee. The delivery fee is not included in the price of a replacement bin. New bins are usually delivered the day after regular recycling collection. Buying Your Own Container Check the type of container used by your city’s waste management facility. Go to your city’s website and locate the waste management page. Find the information about the type of recycling bins they use and if they have an option where you can buy your own. Write down the type of bin they use and the maximum capacity they can so you know what to look for. If your city does manual recycling collection, you can use any storage bin that matches the maximum capacity listed. Your city may require a specific brand or style of bin if they use a truck for recycling collection. Shop online or at hardware stores for the recycling bins your city uses. Check your local hardware stores to see if they sell bins that match the size and style of what your city uses. If you can’t find any recycling bins at the hardware store, then search online to see what’s available. Get the specific brand or model that the waste management site lists to make sure it’s compatible with their equipment. Many recycling bins come with manufacturer warranties so you can easily replace them. Return or recycle your old container if you have one. If you had a recycling bin from the city, contact the waste management facility in your city to see how to properly get rid of it. Recycling collectors may put a sticker on your current bin so they know to recycle it during the next pickup. Otherwise, you may have to drop off the old bin at the facility yourself.",
  "tyn_model":[
    "bin",
    "bins",
    "waste management facility",
    "recycling bins",
    "recycling containers",
    "“recycling",
    "” fill",
    "recycling bin",
    "dumpster",
    "container",
    "waste management site",
    "recycling collectors"
  ],
  "tyn_section":[

  ]
}