{
  "title":"How to Evolve Dusclops",
  "url":"https://www.wikihow.com/Evolve-Dusclops",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Pokemon Video Games",
    "Pokemon GO"
  ],
  "steps":[
    {
      "headline":"Open the Pokémon GO app on your phone or tablet.",
      "description":"The Pokémon GO icon looks like a red-and-white Pokéball in a blue square. You can find it on your home screen or on your Apps tray."
    },
    {
      "headline":"Tap the Pokéball icon at the bottom.",
      "description":"You'll see a red-and-white Pokéball icon at the bottom of your screen. Tapping will expand your menu options."
    },
    {
      "headline":"Tap the POKÉMON button on the menu.",
      "description":"This button looks like a blue Pikachu icon on a white button. You can find it in the lower-left corner of the menu screen. This will open the list of all the Pokémons you have."
    },
    {
      "headline":"Find and tap your Dusclops.",
      "description":"Scroll down the Pokémon list to find the Dusclops you want to evolve and tap on its icon to open the details."
    },
    {
      "headline":"Check if you have enough candies for evolution.",
      "description":"You need 100 Duskull candies to evolve your Pokémon. You can see your Duskull candies below your Pokémon's height and weight information on the right-hand side. You can see the required number of candies next to the EVOLVE button. If you don't have enough candy, try catching more of the Duskulls, or transfer your duplicate Duskulls to Professor Willow."
    },
    {
      "headline":"Tap the EVOLVE button.",
      "description":"You can find it below the green POWER UP  button on the information card. This will prompt you to use your Sinnoh Stone to evolve your Dusclops."
    },
    {
      "headline":"Tap the Sinnoh Stone on your screen.",
      "description":"When you tap the EVOLVE button, a Sinnoh Stone will show up on your screen. This will instantly consume your Sinnoh Stone and 100 Duskull candies to evolve Dusclops. You can only use each Sinnoh Stone in your inventory once. Your Dusclops will now evolve into Dusknoir (Generation IV). You can't evolve Dusclops without a Sinnoh Stone."
    }
  ],
  "text":" Open the Pokémon GO app on your phone or tablet. The Pokémon GO icon looks like a red-and-white Pokéball in a blue square. You can find it on your home screen or on your Apps tray. Tap the Pokéball icon at the bottom. You'll see a red-and-white Pokéball icon at the bottom of your screen. Tapping will expand your menu options. Tap the POKÉMON button on the menu. This button looks like a blue Pikachu icon on a white button. You can find it in the lower-left corner of the menu screen. This will open the list of all the Pokémons you have. Find and tap your Dusclops. Scroll down the Pokémon list to find the Dusclops you want to evolve and tap on its icon to open the details. Check if you have enough candies for evolution. You need 100 Duskull candies to evolve your Pokémon. You can see your Duskull candies below your Pokémon's height and weight information on the right-hand side. You can see the required number of candies next to the EVOLVE button. If you don't have enough candy, try catching more of the Duskulls, or transfer your duplicate Duskulls to Professor Willow. Tap the EVOLVE button. You can find it below the green POWER UP  button on the information card. This will prompt you to use your Sinnoh Stone to evolve your Dusclops. Tap the Sinnoh Stone on your screen. When you tap the EVOLVE button, a Sinnoh Stone will show up on your screen. This will instantly consume your Sinnoh Stone and 100 Duskull candies to evolve Dusclops. You can only use each Sinnoh Stone in your inventory once. Your Dusclops will now evolve into Dusknoir (Generation IV). You can't evolve Dusclops without a Sinnoh Stone.",
  "tyn_model":[
    "sinnoh stone",
    "pokémon go",
    "duskull",
    "pikachu",
    "candy",
    "duskulls",
    "dusclops"
  ],
  "tyn_section":[

  ]
}