{
  "title":"How to Encourage Recycling at Work",
  "url":"https://www.wikihow.com/Encourage-Recycling-at-Work",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Household Waste Disposal",
    "Recycling"
  ],
  "methods":[
    {
      "name":"Educating Your Coworkers",
      "steps":[
        {
          "headline":"Spread the word to your coworkers about recycling.",
          "description":"Try calling for a meeting to discuss recycling or getting the first few minutes of another office get-together. You can also always just bring it up casually over coffee or lunch. The more your coworkers know about the advantages of recycling, the more likely they are to participate in a workplace recycling program! A few simple phrases for talking about it with your colleagues can include:\n”An aluminum recycling bin for soda cans in the break room can really help eliminate some of our waste.”\n”Wouldn’t it make sense for us to have a paper recycling bin next to the printer?”\n“I really think we should focus on recycling more here.”"
        },
        {
          "headline":"Make recycling information readily available with bulletin boards around the office.",
          "description":"Create a permanent resource such as a bulletin board for employees to reference whenever they wish. The bulletin board can have statistics about the office’s impact on waste or more broad statistics. Remember not to get too wordy or else people will be unlikely to read much. Keep the information current and replace it every few weeks with new materials so everyone stays educated and engaged. A few ideas for the bulletin board can include:\nYour office’s amount of recycled goods so far\nInfographics about what happens to items after they’re recycled\nRecommended reading lists of articles or studies regarding recycling\nTips for making recycling easier"
        },
        {
          "headline":"Place literature about recycling around the office.",
          "description":"Try leaving a few pamphlets in the lobby or even installing an entire bookshelf. Hopefully, your coworkers will expand their recycling knowledge in their spare time around the office. Check out the Environmental Protection Agency (EPA) or Planet Aid for some good resources on brochures. If you’re planning on leaving books around, remember to choose accessible ones with quick statistics and facts. A few solid ideas include:\nRecycle Everything: Why We Must, How We Can by Janet Unruh\nShift Your Habit by Elizabeth Rogers\nRecycle: The Essential Guide by Lucy Siegle"
        },
        {
          "headline":"Put up fact sheets near waste receptacles.",
          "description":"Try putting up a sheet with recycling statistics near the waste bins. You can include global statistics or facts specifically about the office’s impact on recycling efforts."
        },
        {
          "headline":"Keep track of the statistics to keep your coworkers motivated.",
          "description":"Count the number of bags of garbage your office produces in an average week before starting. Then, once the recycling initiative has begun, start counting the number of trash bags compared to bags of recycled goods. Being able to quantify their efforts will help employees put their contributions into perspective."
        },
        {
          "headline":"Choose volunteers to keep the workplace recycling program running.",
          "description":"Let those who are truly invested help keep the program running, giving those who wish to participate an active role. Try putting them in charge of rotating recycling informational posters around the office or encouraging them to come up with fun contest ideas of their own. This will help take the load off your back and contribute to an office culture of recycling."
        }
      ]
    },
    {
      "name":"Providing Incentives",
      "steps":[
        {
          "headline":"Offer a reward to the office group with the best recycling record.",
          "description":"Making office recycling a game, at least to begin with, may get those who might not have otherwise been interested involved. Divide your employees into small groups based on department or location. The team that produces the least amount of actual garbage wins. This is most easily done by counting the total number of trash bags. The rewards don’t need to be too outrageous. A few ideas for smaller prizes are:\nGift cards\nMovie tickets\nCandy bars"
        },
        {
          "headline":"Incentivize recycling at home for a bigger reward.",
          "description":"People who already recycle at home may be at an advantage, which may push other employees even harder to get involved. Try offering additional prizes to those who report the least number of non-recycled material from their homes. You may have to use the honor system for this one!"
        },
        {
          "headline":"Host a recycled art competition.",
          "description":"This probably won’t happen every week, but can be a fun change of pace every once in a while. See who can come up with the best piece of art using only recycled goods. Use a lunch break or the last 30 minutes of a workday to host a competition. Let each employee have access to that week’s recycled goods and see what they can create using the recycled material and simple office supplies (glue, scissors, tape) in a limited amount of time. Have everyone in the office vote for their favorite or invite a special guest judge to add some extra hype around the event!"
        },
        {
          "headline":"Set up ongoing rewards for recycling.",
          "description":"Make office-wide benchmarks over the year with incentives along the way, like a pizza party or happy hour. This will help your office avoid only recycling during a contest."
        },
        {
          "headline":"Compete against other local businesses.",
          "description":"Try setting up a contest with a nearby office or shop. The losing office can host a happy hour or dinner for the winning team. Set the time limit (one week, one month, three months) and weigh the total amount of recycled goods. Provide frequent updates about your performance against your competitor to keep your coworkers engaged."
        }
      ]
    },
    {
      "name":"Going “Green” with Your Office’s Supplies",
      "steps":[
        {
          "headline":"Make sure the recycling bins are abundant and clearly marked.",
          "description":"Place them in several areas in the office that are logical to the types of materials you are recycling. For example, put a paper recycling bin in the mailroom and an aluminum can receptacle in the cafeteria and breakroom. Clearly label each bin appropriately, whether it’s for compost, paper, aluminum, or glass."
        },
        {
          "headline":"Set your printers to print on both sides of the page.",
          "description":"Most of a typical office’s waste comes from paper. Simply setting your printers to print on both sides can easily cut your paper waste in half. And don’t forget to keep a well-placed paper recycling bin right there too!"
        },
        {
          "headline":"Encourage management to purchase energy-efficient light bulbs.",
          "description":"Energy-efficient light bulbs are available at most hardware and office supply stores. They typically cost around the same amount as most incandescent light bulbs. Try talking to your office manager or boss about making the switch; it should save you money on electricity costs as well!"
        },
        {
          "headline":"Suggest switching to recycled paper.",
          "description":"This is another easy switch with only a slight difference in cost. Chances are your office goes through a lot of paper. Try to eliminate as much waste as possible by switching to recycled paper for all your needs. Again, the office manager is most likely the person in charge of ordering supplies."
        }
      ]
    }
  ],
  "text":" Educating Your Coworkers Spread the word to your coworkers about recycling. Try calling for a meeting to discuss recycling or getting the first few minutes of another office get-together. You can also always just bring it up casually over coffee or lunch. The more your coworkers know about the advantages of recycling, the more likely they are to participate in a workplace recycling program! A few simple phrases for talking about it with your colleagues can include:\n”An aluminum recycling bin for soda cans in the break room can really help eliminate some of our waste.”\n”Wouldn’t it make sense for us to have a paper recycling bin next to the printer?”\n“I really think we should focus on recycling more here.” Make recycling information readily available with bulletin boards around the office. Create a permanent resource such as a bulletin board for employees to reference whenever they wish. The bulletin board can have statistics about the office’s impact on waste or more broad statistics. Remember not to get too wordy or else people will be unlikely to read much. Keep the information current and replace it every few weeks with new materials so everyone stays educated and engaged. A few ideas for the bulletin board can include:\nYour office’s amount of recycled goods so far\nInfographics about what happens to items after they’re recycled\nRecommended reading lists of articles or studies regarding recycling\nTips for making recycling easier Place literature about recycling around the office. Try leaving a few pamphlets in the lobby or even installing an entire bookshelf. Hopefully, your coworkers will expand their recycling knowledge in their spare time around the office. Check out the Environmental Protection Agency (EPA) or Planet Aid for some good resources on brochures. If you’re planning on leaving books around, remember to choose accessible ones with quick statistics and facts. A few solid ideas include:\nRecycle Everything: Why We Must, How We Can by Janet Unruh\nShift Your Habit by Elizabeth Rogers\nRecycle: The Essential Guide by Lucy Siegle Put up fact sheets near waste receptacles. Try putting up a sheet with recycling statistics near the waste bins. You can include global statistics or facts specifically about the office’s impact on recycling efforts. Keep track of the statistics to keep your coworkers motivated. Count the number of bags of garbage your office produces in an average week before starting. Then, once the recycling initiative has begun, start counting the number of trash bags compared to bags of recycled goods. Being able to quantify their efforts will help employees put their contributions into perspective. Choose volunteers to keep the workplace recycling program running. Let those who are truly invested help keep the program running, giving those who wish to participate an active role. Try putting them in charge of rotating recycling informational posters around the office or encouraging them to come up with fun contest ideas of their own. This will help take the load off your back and contribute to an office culture of recycling. Providing Incentives Offer a reward to the office group with the best recycling record. Making office recycling a game, at least to begin with, may get those who might not have otherwise been interested involved. Divide your employees into small groups based on department or location. The team that produces the least amount of actual garbage wins. This is most easily done by counting the total number of trash bags. The rewards don’t need to be too outrageous. A few ideas for smaller prizes are:\nGift cards\nMovie tickets\nCandy bars Incentivize recycling at home for a bigger reward. People who already recycle at home may be at an advantage, which may push other employees even harder to get involved. Try offering additional prizes to those who report the least number of non-recycled material from their homes. You may have to use the honor system for this one! Host a recycled art competition. This probably won’t happen every week, but can be a fun change of pace every once in a while. See who can come up with the best piece of art using only recycled goods. Use a lunch break or the last 30 minutes of a workday to host a competition. Let each employee have access to that week’s recycled goods and see what they can create using the recycled material and simple office supplies (glue, scissors, tape) in a limited amount of time. Have everyone in the office vote for their favorite or invite a special guest judge to add some extra hype around the event! Set up ongoing rewards for recycling. Make office-wide benchmarks over the year with incentives along the way, like a pizza party or happy hour. This will help your office avoid only recycling during a contest. Compete against other local businesses. Try setting up a contest with a nearby office or shop. The losing office can host a happy hour or dinner for the winning team. Set the time limit (one week, one month, three months) and weigh the total amount of recycled goods. Provide frequent updates about your performance against your competitor to keep your coworkers engaged. Going “Green” with Your Office’s Supplies Make sure the recycling bins are abundant and clearly marked. Place them in several areas in the office that are logical to the types of materials you are recycling. For example, put a paper recycling bin in the mailroom and an aluminum can receptacle in the cafeteria and breakroom. Clearly label each bin appropriately, whether it’s for compost, paper, aluminum, or glass. Set your printers to print on both sides of the page. Most of a typical office’s waste comes from paper. Simply setting your printers to print on both sides can easily cut your paper waste in half. And don’t forget to keep a well-placed paper recycling bin right there too! Encourage management to purchase energy-efficient light bulbs. Energy-efficient light bulbs are available at most hardware and office supply stores. They typically cost around the same amount as most incandescent light bulbs. Try talking to your office manager or boss about making the switch; it should save you money on electricity costs as well! Suggest switching to recycled paper. This is another easy switch with only a slight difference in cost. Chances are your office goes through a lot of paper. Try to eliminate as much waste as possible by switching to recycled paper for all your needs. Again, the office manager is most likely the person in charge of ordering supplies.",
  "tyn_model":[
    "recycling",
    "paper",
    "”\n",
    "printers",
    "”an",
    "”would",
    "printer",
    "“i",
    "” make",
    "environmental protection agency",
    "planet aid",
    "books",
    "recycle",
    "recycled art",
    "glue",
    "scissors",
    "tape",
    "happy hour",
    "“green",
    "” with",
    "recycled paper"
  ],
  "tyn_section":[

  ]
}