{
  "title":"How to Make Tortellini Soup With Tomatoes and Italian Sausage",
  "url":"https://www.wikihow.com/Make-Tortellini-Soup-With-Tomatoes-and-Italian-Sausage",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Soups"
  ],
  "steps":[
    {
      "headline":"If the sausage comes in a casing, remove if desired.",
      "description":"Brown the sausage in a 5 quart Dutch oven over medium heat."
    },
    {
      "headline":"Remove the sausage; reserve 1 tablespoon of drippings in the Dutch oven.",
      "description":"Cook the onions and garlic in the reserved drippings until the onions are tender. Add cooked sausage, broth, water, wine, tomatoes, carrots, basil, oregano and tomato sauce. Bring to a boil. Reduce heat; simmer 30 minutes."
    },
    {
      "headline":"Skim any fat from the soup.",
      "description":"Stir in zucchini, tortellini, parsley and bell pepper."
    },
    {
      "headline":"Simmer an additional 20 to 25 minutes or until the tortellini is tender.",
      "description":"Ladle servings into bowls. Sprinkle each serving with Parmesan cheese."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" If the sausage comes in a casing, remove if desired. Brown the sausage in a 5 quart Dutch oven over medium heat. Remove the sausage; reserve 1 tablespoon of drippings in the Dutch oven. Cook the onions and garlic in the reserved drippings until the onions are tender. Add cooked sausage, broth, water, wine, tomatoes, carrots, basil, oregano and tomato sauce. Bring to a boil. Reduce heat; simmer 30 minutes. Skim any fat from the soup. Stir in zucchini, tortellini, parsley and bell pepper. Simmer an additional 20 to 25 minutes or until the tortellini is tender. Ladle servings into bowls. Sprinkle each serving with Parmesan cheese. Finished. ",
  "tyn_model":[
    "tortellini",
    "5 quart dutch oven",
    "dutch oven",
    "onions",
    "garlic",
    "broth",
    "water",
    "wine",
    "tomatoes",
    "carrots",
    "basil",
    "oregano",
    "tomato sauce",
    "zucchini",
    "parsley",
    "bell pepper",
    "bowls",
    "parmesan cheese"
  ],
  "tyn_section":[

  ]
}