{
  "title":"How to Bake Vegan Chocolate Crackle Cookies",
  "url":"https://www.wikihow.com/Bake-Vegan-Chocolate-Crackle-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan",
    "Vegan Baking"
  ],
  "steps":[
    {
      "headline":"Mix together the dry ingredients.",
      "description":""
    },
    {
      "headline":"Prepare the egg replacer as per the package instructions.",
      "description":"Add the egg replacer to the dry mixture."
    },
    {
      "headline":"Melt the chocolate in a double boiler.",
      "description":"Fold in the melted chocolate. Once mixed in, pour in the vanilla and mix through. Toss in the chocolate chips. Mix through."
    },
    {
      "headline":"Preheat the oven to 350ºF/180ºC.",
      "description":""
    },
    {
      "headline":"Use a teaspoon to drop the cookie dough onto a lined cookie sheet.",
      "description":""
    },
    {
      "headline":"Place in the oven.",
      "description":"Bake for 10-12 minutes until well done. Remove from the oven. Leave the cookies to cool on a wire cooling rack. Serve once cooled or store in an airtight container."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Mix together the dry ingredients.  Prepare the egg replacer as per the package instructions. Add the egg replacer to the dry mixture. Melt the chocolate in a double boiler. Fold in the melted chocolate. Once mixed in, pour in the vanilla and mix through. Toss in the chocolate chips. Mix through. Preheat the oven to 350ºF/180ºC.  Use a teaspoon to drop the cookie dough onto a lined cookie sheet.  Place in the oven. Bake for 10-12 minutes until well done. Remove from the oven. Leave the cookies to cool on a wire cooling rack. Serve once cooled or store in an airtight container. Finished. ",
  "tyn_model":[
    "oven",
    "chocolate",
    "double boiler",
    "vanilla",
    "chocolate chips",
    "cookie sheet",
    "airtight container"
  ],
  "tyn_section":[

  ]
}