{
  "title":"How to Maintain a Precision Measuring Tool",
  "url":"https://www.wikihow.com/Maintain-a-Precision-Measuring-Tool",
  "category_hierarchy":[
    "Home and Garden",
    "Tools",
    "Measuring and Marking Tools"
  ],
  "steps":[
    {
      "headline":"Be sure that the work pieces have stopped.",
      "description":"Measuring work pieces on lathes should be carried out only after the work pieces have stopped; otherwise, the accuracy of the tool may be negatively impaired due to wear of the measuring faces and accidents may occur."
    },
    {
      "headline":"Wipe the measuring faces of a precision measuring tool and the to-be-measured surface of the work piece so as to prevent the measuring accuracy from being negatively affected by dirt or dust.",
      "description":"It is not advisable to use such precision measuring tools as vernier caliper, micrometer and dial indicators to measure those forged roughcasts or abrasive-bearing pieces (like carborundum), because the measuring faces will be abraded and accuracy will fall."
    },
    {
      "headline":"Never put precision measuring tools together with hand tools, such as cutting tools, files, hammers and drills for the fear of bumping the precision measuring tools.",
      "description":"Never put them on lathes either to prevent them from dropping from lathes and breaking down due to vibration of lathes, especially in the case of vernier calipers which should be laid flat in specific cases to avoid distortion."
    },
    {
      "headline":"Use your tools for their purpose.",
      "description":"Precision measuring tools should not be used as substitutes for other tools. So it is not advisable to use vernier caliper as line markers, micrometers as small hammers or steel linear as screw drivers and cutting scrap wipers. It is not proper either to take precision measuring tools as toys, take flinging a micrometer with hands for example. These behaviors will lead to the falling of accuracy of precision measuring tools."
    },
    {
      "headline":"Maintain temperature.",
      "description":"Temperature does have a substantial impact on the measuring results. Precise measurement of work pieces should be carried out only under the condition that the temperature is around 20 °C (68 °F). Generally, measurements can be carried out under room temperature, but the work pieces and the measuring tools should share the same temperature. Otherwise, the result of measurements will not be accurate due to the characteristic of distortion of metals subject to temperature changes. Precision measuring tools are subject to the changes of temperature, too. They should not be put under direct sunshine, because measurements will not be achieved when the temperature rises. Never put precision measuring tools near heat sources such as electric cooker and heat transmitter to protect the tools from being distorted by heat thus disabling accuracy."
    },
    {
      "headline":"Be aware of the immediate area.",
      "description":"Precision measuring tools should never be put near magnetic area, such as magnetic worktable, to avoid being magnetized."
    },
    {
      "headline":"When having discovered some abnormal phenomena on a precision measuring tool, such as rough surface, burr, rusts, distortion of the body or ineffective movements, users should not be allowed to fix it on their own, not to mention fix it with hammers, files or emery cloth for the fear of augmenting errors.",
      "description":"Users should send the flawed tool to the repair depot and use it after it is repaired right!"
    },
    {
      "headline":"Users should clean the tools after use.",
      "description":"Tools except those made of stainless steel or framed by protective materials should be daubed with anti-rust oil, put in a specific case and kept in dry places to be free from being rusted."
    },
    {
      "headline":"Periodic maintenance should be applied to precision measuring tools.",
      "description":"Long-used precision tools should be sent to authorized calibration facilities periodically for test and calibration to avoid product quality problems caused by unreasonable reading errors of the tools."
    }
  ],
  "text":" Be sure that the work pieces have stopped. Measuring work pieces on lathes should be carried out only after the work pieces have stopped; otherwise, the accuracy of the tool may be negatively impaired due to wear of the measuring faces and accidents may occur. Wipe the measuring faces of a precision measuring tool and the to-be-measured surface of the work piece so as to prevent the measuring accuracy from being negatively affected by dirt or dust. It is not advisable to use such precision measuring tools as vernier caliper, micrometer and dial indicators to measure those forged roughcasts or abrasive-bearing pieces (like carborundum), because the measuring faces will be abraded and accuracy will fall. Never put precision measuring tools together with hand tools, such as cutting tools, files, hammers and drills for the fear of bumping the precision measuring tools. Never put them on lathes either to prevent them from dropping from lathes and breaking down due to vibration of lathes, especially in the case of vernier calipers which should be laid flat in specific cases to avoid distortion. Use your tools for their purpose. Precision measuring tools should not be used as substitutes for other tools. So it is not advisable to use vernier caliper as line markers, micrometers as small hammers or steel linear as screw drivers and cutting scrap wipers. It is not proper either to take precision measuring tools as toys, take flinging a micrometer with hands for example. These behaviors will lead to the falling of accuracy of precision measuring tools. Maintain temperature. Temperature does have a substantial impact on the measuring results. Precise measurement of work pieces should be carried out only under the condition that the temperature is around 20 °C (68 °F). Generally, measurements can be carried out under room temperature, but the work pieces and the measuring tools should share the same temperature. Otherwise, the result of measurements will not be accurate due to the characteristic of distortion of metals subject to temperature changes. Precision measuring tools are subject to the changes of temperature, too. They should not be put under direct sunshine, because measurements will not be achieved when the temperature rises. Never put precision measuring tools near heat sources such as electric cooker and heat transmitter to protect the tools from being distorted by heat thus disabling accuracy. Be aware of the immediate area. Precision measuring tools should never be put near magnetic area, such as magnetic worktable, to avoid being magnetized. When having discovered some abnormal phenomena on a precision measuring tool, such as rough surface, burr, rusts, distortion of the body or ineffective movements, users should not be allowed to fix it on their own, not to mention fix it with hammers, files or emery cloth for the fear of augmenting errors. Users should send the flawed tool to the repair depot and use it after it is repaired right! Users should clean the tools after use. Tools except those made of stainless steel or framed by protective materials should be daubed with anti-rust oil, put in a specific case and kept in dry places to be free from being rusted. Periodic maintenance should be applied to precision measuring tools. Long-used precision tools should be sent to authorized calibration facilities periodically for test and calibration to avoid product quality problems caused by unreasonable reading errors of the tools.",
  "tyn_model":[
    "precision measuring",
    "precision measuring tools",
    "vernier caliper",
    "hammers",
    "tools",
    "lathes",
    "precision measuring tool",
    "drills",
    "vernier calipers",
    "micrometers",
    "screw drivers",
    "micrometer",
    "electric cooker",
    "heat transmitter",
    "emery cloth",
    "anti-rust oil",
    "precision tools"
  ],
  "tyn_section":[

  ]
}