{
  "title":"How to Carve a Spiral Ham",
  "url":"https://www.wikihow.com/Carve-a-Spiral-Ham",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Pork"
  ],
  "methods":[
    {
      "name":"Removing Pre-cut Slices",
      "steps":[
        {
          "headline":"Set the ham on a cutting board so the bone points to the side.",
          "description":"Locate the shank bone running through the center of the spiral ham. Turn the ham around so the bone points to the sides of the cutting board. Look for the side of the ham that is already sliced and make sure it is on the same side as your dominant hand so it’s easier for you to cut. Most spiral hams are precooked, so you can cut them while they’re hot or cold."
        },
        {
          "headline":"Hold the ham steady with your nondominant hand using a carving fork.",
          "description":"Stick the tines of a carving fork into the ham about 3–4 inches (7.6–10.2 cm) from the end you’re cutting. Make sure the fork is in the center of the ham and that it doesn’t slip around if you try to move it around. Hold the fork in place with your nondominant hand so the ham doesn’t move around while you’re cutting it. If you don’t have a carving fork, then any large fork will work to hold the ham in place."
        },
        {
          "headline":"Slice around the bone in the middle of the ham with a paring knife.",
          "description":"While you hold the ham steady with the carving fork, stick the end of a flexible paring knife into the ham right next to the bone. You can cut off 1 slice at a time, or push the knife deeper to cut off multiple. Work the blade around the bone, and cut as close to the bone as you can with your knife so you don’t leave any ham behind. Avoid using a knife that doesn’t easily bend since it won’t be able to cut as close to the bone.Warning: Never point the knife blade toward your body since you could accidentally cut yourself if it slips."
        },
        {
          "headline":"Pull the pieces of ham off of the bone.",
          "description":"Once you cut around the bone, use your carving fork or your fingers to pull the slices off of the bone. The pieces will easily slide off of the bone so you can serve them. Place the slices on a plate if they’re ready to serve, or leave them on your cutting board if you want to cut them into smaller pieces. If you have trouble pulling a slice off of the bone, go around it with your paring knife again to remove any fat or ligaments holding it in place."
        },
        {
          "headline":"Separate the pieces of ham by the fat lines if you want them smaller.",
          "description":"Look at the slices of ham for white or clear lines holding them together. If you want to have smaller pieces rather than large slices, use your paring knife or a chef’s knife to cut along the lines of fat to separate them. That way, you have more manageable slices and your ham won’t be as fatty. You can remove some of the fat off of the ham if you want."
        }
      ]
    },
    {
      "name":"Carving the Unsliced Portion",
      "steps":[
        {
          "headline":"Hold the ham against the cutting board with a carving fork.",
          "description":"Set the ham on your cutting board so the portion you’re cutting is closest to your dominant hand. Stick the tines of the carving fork into the ham so it’s about ⁄4–⁄2 inch (0.64–1.27 cm) from the end. Make sure the fork doesn’t slip out of place or else it will be difficult to cut. If you can’t get a good grip on the ham with a carving fork, hold the bone against your cutting board with your nondominant hand."
        },
        {
          "headline":"Slice down toward the bone using a chef’s knife.",
          "description":"Place your chef’s knife against the carving fork so the blade rests on top of the ham. Slowly saw into the ham with your knife, keeping it as straight as you can so the slice is a consistent thickness. Once you hit the bone in the middle of the ham, pull the knife out of the meat.Tip: Since the end of the ham isn’t pre-sliced, you can cut it however thick you want. If you want thicker slices, move the fork further back."
        },
        {
          "headline":"Cut around the bone with a paring knife to remove the pieces.",
          "description":"Stick the end of the paring knife into the end of the ham so the blade is against the bone. Hold the ham in place with the carving fork so it doesn’t move around while you’re cutting it. Slowly work your knife around the bone so the slice comes loose from the rest of the ham. Pull the slice away from the bone with your carving fork or your fingers."
        },
        {
          "headline":"Keep carving the ham until you remove all of the pieces.",
          "description":"Continue cutting more slices off the ham, working down the bone until you reach the end. Slice the ham to whatever thickness you want and break it down into smaller pieces by cutting along the fatty lines. Try to get as much ham as you can off of the bone so you don’t leave any behind. If you can’t hold the ham steady with your carving fork, hold onto the bone so it doesn’t move while you cut it."
        }
      ]
    }
  ],
  "text":" Removing Pre-cut Slices Set the ham on a cutting board so the bone points to the side. Locate the shank bone running through the center of the spiral ham. Turn the ham around so the bone points to the sides of the cutting board. Look for the side of the ham that is already sliced and make sure it is on the same side as your dominant hand so it’s easier for you to cut. Most spiral hams are precooked, so you can cut them while they’re hot or cold. Hold the ham steady with your nondominant hand using a carving fork. Stick the tines of a carving fork into the ham about 3–4 inches (7.6–10.2 cm) from the end you’re cutting. Make sure the fork is in the center of the ham and that it doesn’t slip around if you try to move it around. Hold the fork in place with your nondominant hand so the ham doesn’t move around while you’re cutting it. If you don’t have a carving fork, then any large fork will work to hold the ham in place. Slice around the bone in the middle of the ham with a paring knife. While you hold the ham steady with the carving fork, stick the end of a flexible paring knife into the ham right next to the bone. You can cut off 1 slice at a time, or push the knife deeper to cut off multiple. Work the blade around the bone, and cut as close to the bone as you can with your knife so you don’t leave any ham behind. Avoid using a knife that doesn’t easily bend since it won’t be able to cut as close to the bone.Warning: Never point the knife blade toward your body since you could accidentally cut yourself if it slips. Pull the pieces of ham off of the bone. Once you cut around the bone, use your carving fork or your fingers to pull the slices off of the bone. The pieces will easily slide off of the bone so you can serve them. Place the slices on a plate if they’re ready to serve, or leave them on your cutting board if you want to cut them into smaller pieces. If you have trouble pulling a slice off of the bone, go around it with your paring knife again to remove any fat or ligaments holding it in place. Separate the pieces of ham by the fat lines if you want them smaller. Look at the slices of ham for white or clear lines holding them together. If you want to have smaller pieces rather than large slices, use your paring knife or a chef’s knife to cut along the lines of fat to separate them. That way, you have more manageable slices and your ham won’t be as fatty. You can remove some of the fat off of the ham if you want. Carving the Unsliced Portion Hold the ham against the cutting board with a carving fork. Set the ham on your cutting board so the portion you’re cutting is closest to your dominant hand. Stick the tines of the carving fork into the ham so it’s about ⁄4–⁄2 inch (0.64–1.27 cm) from the end. Make sure the fork doesn’t slip out of place or else it will be difficult to cut. If you can’t get a good grip on the ham with a carving fork, hold the bone against your cutting board with your nondominant hand. Slice down toward the bone using a chef’s knife. Place your chef’s knife against the carving fork so the blade rests on top of the ham. Slowly saw into the ham with your knife, keeping it as straight as you can so the slice is a consistent thickness. Once you hit the bone in the middle of the ham, pull the knife out of the meat.Tip: Since the end of the ham isn’t pre-sliced, you can cut it however thick you want. If you want thicker slices, move the fork further back. Cut around the bone with a paring knife to remove the pieces. Stick the end of the paring knife into the end of the ham so the blade is against the bone. Hold the ham in place with the carving fork so it doesn’t move around while you’re cutting it. Slowly work your knife around the bone so the slice comes loose from the rest of the ham. Pull the slice away from the bone with your carving fork or your fingers. Keep carving the ham until you remove all of the pieces. Continue cutting more slices off the ham, working down the bone until you reach the end. Slice the ham to whatever thickness you want and break it down into smaller pieces by cutting along the fatty lines. Try to get as much ham as you can off of the bone so you don’t leave any behind. If you can’t hold the ham steady with your carving fork, hold onto the bone so it doesn’t move while you cut it.",
  "tyn_model":[
    "ham",
    "carving fork",
    "knife",
    "paring knife",
    "cutting board",
    "fork",
    "chef’s knife",
    "flexible paring knife",
    "plate",
    "saw",
    "meat"
  ],
  "tyn_section":[

  ]
}