{
  "title":"How to Remove Paint from Your Shirt",
  "url":"https://www.wikihow.com/Remove-Paint-from-Your-Shirt",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Removing Water, Acrylic, or Latex Paints",
      "steps":[
        {
          "headline":"Wear gloves and painting clothes.",
          "description":"You don’t want to stain any more clothing or get your hands dirty. So wear gloves and clothing that you wouldn’t mind getting paint on."
        },
        {
          "headline":"Remove excess paint as soon as possible.",
          "description":"You can use a kitchen utensil like a knife or spoon or a scraper such as a popsicle stick."
        },
        {
          "headline":"Let the rest of the paint dry and crumble.",
          "description":"For the paint that you can’t quite remove manually, don’t force it. There’s a good chance that some or most of the paint will crumble off after it dries. After you’ve removed the dry paint, you can clean the remainder of the paint that has seeped into the fabric. After the paint dries, use your hands to make gentle creases in the fabric that is stained to help make the paint crumble off."
        },
        {
          "headline":"Use a cleaning soap.",
          "description":"A dish soap/hand soap combination (1:1 ration) should work well when used with these steps. You might also consider fabric soap as well. Test your cleaner of choice. You may want to test a small amount of your cleaning liquid on the inside or hidden part of your shirt, so you are sure it won't harm the shirt further. Dab the area with a sponge. Soak the sponge in your soap solution. Pat the stained area with soap and then rinse under warm water. Repeat this process until you get out as much of the stain as possible."
        },
        {
          "headline":"Saturate the stained area with alcohol.",
          "description":"Saturate the painted area in either isopropyl rubbing alcohol or hairspray. Hairspray is slightly more effective, but more expensive, and alcohol is less expensive, but slightly less effective. Remember, you need to soak the area with product, so rubbing alcohol may be a better choice."
        },
        {
          "headline":"Wait 10-15 minutes.",
          "description":"This time period will allow the alcohol to soak in and effectively saturate the fabric and paint."
        },
        {
          "headline":"Scrub the area.",
          "description":"Using an old cloth, rub the area in circular motions, so you don't just smear the now soft paint. Use some elbow grease."
        },
        {
          "headline":"Launder the shirt as usual.",
          "description":"You’ve now done as much as you can to clean the shirt yourself by hand. You can run the shirt in the laundry machine. Be sure to run it alone so that the shirt doesn’t potentially expose your other clothes to stains."
        },
        {
          "headline":"Repeat the process if necessary.",
          "description":"Look at the stained area. If it looks good, you’re all set. If not, repeat the process, as needed, starting with the alcohol step. Maybe you need to use more alcohol or let it soak in the fabric for a longer time period this time."
        }
      ]
    },
    {
      "name":"Removing Oil Paints",
      "steps":[
        {
          "headline":"Do not apply water.",
          "description":"This won’t help, and it might just dilute the other cleaning liquids you plan on using."
        },
        {
          "headline":"Apply an oil paint solvent to the stained area.",
          "description":"This would include distilled turpentine. Alternatively, you can use WD-40, which is a spray that displaces oil and water. Rub the stained area with your first rag. Try to gently scrub out the stain. Wipe down with the second rag. Examine to see how much of the stain has been removed."
        },
        {
          "headline":"Reapply solvent, if needed.",
          "description":"If the stain isn’t gone, reapply the solvent, and repeat the scrubbing and wiping steps."
        },
        {
          "headline":"Add dish soap to the bucket of warm water.",
          "description":"Soak the shirt in the bucket for about an hour. This will help cut both the paint grease and the solvent you used as a cleaner."
        },
        {
          "headline":"Launder your shirt.",
          "description":"Immediately after soaking, launder the shirt alone in a washing machine."
        }
      ]
    }
  ],
  "text":" Removing Water, Acrylic, or Latex Paints Wear gloves and painting clothes. You don’t want to stain any more clothing or get your hands dirty. So wear gloves and clothing that you wouldn’t mind getting paint on. Remove excess paint as soon as possible. You can use a kitchen utensil like a knife or spoon or a scraper such as a popsicle stick. Let the rest of the paint dry and crumble. For the paint that you can’t quite remove manually, don’t force it. There’s a good chance that some or most of the paint will crumble off after it dries. After you’ve removed the dry paint, you can clean the remainder of the paint that has seeped into the fabric. After the paint dries, use your hands to make gentle creases in the fabric that is stained to help make the paint crumble off. Use a cleaning soap. A dish soap/hand soap combination (1:1 ration) should work well when used with these steps. You might also consider fabric soap as well. Test your cleaner of choice. You may want to test a small amount of your cleaning liquid on the inside or hidden part of your shirt, so you are sure it won't harm the shirt further. Dab the area with a sponge. Soak the sponge in your soap solution. Pat the stained area with soap and then rinse under warm water. Repeat this process until you get out as much of the stain as possible. Saturate the stained area with alcohol. Saturate the painted area in either isopropyl rubbing alcohol or hairspray. Hairspray is slightly more effective, but more expensive, and alcohol is less expensive, but slightly less effective. Remember, you need to soak the area with product, so rubbing alcohol may be a better choice. Wait 10-15 minutes. This time period will allow the alcohol to soak in and effectively saturate the fabric and paint. Scrub the area. Using an old cloth, rub the area in circular motions, so you don't just smear the now soft paint. Use some elbow grease. Launder the shirt as usual. You’ve now done as much as you can to clean the shirt yourself by hand. You can run the shirt in the laundry machine. Be sure to run it alone so that the shirt doesn’t potentially expose your other clothes to stains. Repeat the process if necessary. Look at the stained area. If it looks good, you’re all set. If not, repeat the process, as needed, starting with the alcohol step. Maybe you need to use more alcohol or let it soak in the fabric for a longer time period this time. Removing Oil Paints Do not apply water. This won’t help, and it might just dilute the other cleaning liquids you plan on using. Apply an oil paint solvent to the stained area. This would include distilled turpentine. Alternatively, you can use WD-40, which is a spray that displaces oil and water. Rub the stained area with your first rag. Try to gently scrub out the stain. Wipe down with the second rag. Examine to see how much of the stain has been removed. Reapply solvent, if needed. If the stain isn’t gone, reapply the solvent, and repeat the scrubbing and wiping steps. Add dish soap to the bucket of warm water. Soak the shirt in the bucket for about an hour. This will help cut both the paint grease and the solvent you used as a cleaner. Launder your shirt. Immediately after soaking, launder the shirt alone in a washing machine.",
  "tyn_model":[
    "paint",
    "water",
    "alcohol",
    "solvent",
    "dish soap",
    "sponge",
    "soap",
    "hairspray",
    "popsicle stick",
    "cleaning soap",
    "hand soap",
    "fabric soap",
    "isopropyl rubbing alcohol",
    "rubbing alcohol",
    "fabric",
    "laundry machine",
    "oil paints",
    "oil paint"
  ],
  "tyn_section":[

  ]
}