{
  "title":"How to Get Vaseline Out of Clothes",
  "url":"https://www.wikihow.com/Get-Vaseline-Out-of-Clothes",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Cleaning Clothes"
  ],
  "methods":[
    {
      "name":"Rubbing with Dishwashing Soap",
      "steps":[
        {
          "headline":"Scrape any excess Vaseline off the fabric with a dull edge.",
          "description":"It’s important to remove as much Vaseline as possible from the get-go to prevent excess oil from setting into the fabric. Use a butter knife or something similar to scrape it away. Go slowly and be careful not to spread the Vaseline any further."
        },
        {
          "headline":"Rub the fabric with dishwashing soap.",
          "description":"Put a small amount of dishwashing soap (like Dawn) onto the stain and rub it around. Put both hands on both the inside and outside of the cloth and rub them together to make sure it goes through the fabric and reaches the entire surface of the stain. You can also use a soft-bristled toothbrush to really get into those fibers! But this isn’t recommended for thin fabrics (like pima cotton) as it can tear or stretch the threads."
        },
        {
          "headline":"Rinse the soap away from the stained area with warm or hot water.",
          "description":"Run the warm or hot faucet over the area of the clothing that you’ve just cleansed to get all the soap (and hopefully the oil) out. You should see that the stain has lifted a little and the fabric feels less oily. If a lot of Vaseline got into the fabric or if it has been there for a while, you may need to rub it with dishwashing soap a few times to see a difference."
        },
        {
          "headline":"Apply a stain remover to the fabric and let it sit for 10 minutes.",
          "description":"Pretreating the fabric with a stain remover will help remove any stubborn oil stains that may have set in over a longer period of time. Just make sure to read the particular stain remover’s instructions to prevent any discoloration (especially if the formula contains bleach). If you don’t have any stain remover, you can also put liquid laundry detergent on the stain or rub a wet bar of regular soap on it."
        },
        {
          "headline":"Rinse the stain under the sink with hot water after treating it.",
          "description":"Get all of the soap or stain remover out with hot water. Let the hot water tap heat up for a while so you don't accidentally put cold water on it. Cold water won't help oil stains and might seal them into the cloth. If the garment’s care label calls for cold water, it’s still okay to use very warm water on the area with the stain."
        },
        {
          "headline":"Wash the clothing in the hottest water possible.",
          "description":"You can either wash the item by hand in the sink or in the washing machine. Just be sure to use hot water because will lift stains and oil from the clothing fibers. If you're worried about the hot water shrinking the garment, use warm water instead. Always check the care label to make sure that hot water is safe for the fabric! If not, you can use warm water because it won’t cause immediate shrinkage like hot water might. Do not put the item in the dryer if the stain is still there after washing! That will only set the stain. So if that’s the case, treat and wash the stain again until it’s gone."
        }
      ]
    },
    {
      "name":"Applying Rubbing Alcohol",
      "steps":[
        {
          "headline":"Remove any excess Vaseline using a dull edge or paper towel.",
          "description":"To prevent spreading or setting the stain, it’s important to remove any excess as soon as possible. Use a dull knife or dry paper towel to carefully scrape or pull it away. The sooner you remove any excess, the better chance you have of lifting the stain."
        },
        {
          "headline":"Lightly dab rubbing alcohol onto the stain.",
          "description":"Rubbing alcohol (also known as isopropyl alcohol) is a degreasing agent that does things water and soap just can’t do! Use a clean dry cloth or cotton pad to dab rubbing alcohol onto the stain and rub it in using very small motions. Press down every so often to make sure it soaks through. Depending on the fabric and the quality of dyes used to color it, it may be necessary to test a little of the rubbing alcohol on an inconspicuous part of the garment to check for discoloration. Be gentle with thinner or delicate fabrics."
        },
        {
          "headline":"Allow the rubbing alcohol to dry.",
          "description":"Let the alcohol dry into the stain until it’s dry before washing. This could take anywhere from 20 to 40 minutes depending on the thickness of the material and size of the stain."
        },
        {
          "headline":"Scrub liquid dishwashing detergent into the stain.",
          "description":"Dishwashing detergent is a degreasing agent that will help lift any leftover oil from the fabric. Use both hands on either side of the cloth to scrub it all the way through until it gets sudsy. Remember to be careful with thinner fabrics!"
        },
        {
          "headline":"Rinse the stain with hot or warm water and let it dry.",
          "description":"Turn on the hot water tap to give it time to heat up. When it’s hot, hold the stained section under the water. Makes sure no cold water touches it because cold water sets oil stains while hot or warm water will help lift them out. You can use a clean towel to pat the stain dry or just let it air dry. If the stain still isn’t gone, apply more detergent or stain remover until there’s no more sign of it."
        },
        {
          "headline":"Wash the clothing in hot or warm water.",
          "description":"Wash the garment either by hand or in the washing machine. Just make sure that you use hot or warm water because it will lift stains and oil from the clothing fibers. If you think the item might shrink, it's okay to use warm water instead of hot. Always check the care label to make sure that hot water is safe for the fabric! If you’re unsure, use warm water because it won’t cause immediate shrinkage like hot water might. Whatever you do, do not put a still-stained garment in the dryer because this will set the stain and make it even harder to remove in the future!"
        }
      ]
    },
    {
      "name":"Soaking in Vinegar",
      "steps":[
        {
          "headline":"Scrape away any excess Vaseline.",
          "description":"To prevent spreading the stain, it’s important to remove any excess as soon as possible. Use a dull knife or dry paper towel to carefully remove as much Vaseline as possible. The sooner you remove any excess, the better chance you have of lifting the oil stain."
        },
        {
          "headline":"Soak the stained portion in vinegar for 5 to 10 minutes.",
          "description":"Vinegar is a natural astringent and packs a powerful punch against oil and stains in general. And don’t worry, the garment won’t smell like vinegar after a full wash. When treating colored garments, soak it in a mixture of vinegar and water in equal parts to prevent the fabric from fading or discoloration."
        },
        {
          "headline":"Scrub the area with a paper towel after soaking.",
          "description":"Scrubbing in the vinegar will help lift the oil from all those fibers. Make sure to scrub in all directions to loosen the oil from all sides of the fibers. If the stain doesn’t start to scrub away, apply some more vinegar and scrub it in again. For extra-stubborn stains, you can also scrub in some dishwashing liquid at this point and rinse it with warm water."
        },
        {
          "headline":"Let the garment air dry once the stain is gone.",
          "description":"Letting the garment dry naturally will prevent any stubborn stains from setting. If you’re tempted to toss it in the dryer or use a hair dryer on it to see if the stain is gone, fight the temptation! Both of those things will only seal in any stain residue. Once it’s air-dried, you can always go back and try a different stain removal method if the stain isn’t fully gone."
        }
      ]
    }
  ],
  "text":" Rubbing with Dishwashing Soap Scrape any excess Vaseline off the fabric with a dull edge. It’s important to remove as much Vaseline as possible from the get-go to prevent excess oil from setting into the fabric. Use a butter knife or something similar to scrape it away. Go slowly and be careful not to spread the Vaseline any further. Rub the fabric with dishwashing soap. Put a small amount of dishwashing soap (like Dawn) onto the stain and rub it around. Put both hands on both the inside and outside of the cloth and rub them together to make sure it goes through the fabric and reaches the entire surface of the stain. You can also use a soft-bristled toothbrush to really get into those fibers! But this isn’t recommended for thin fabrics (like pima cotton) as it can tear or stretch the threads. Rinse the soap away from the stained area with warm or hot water. Run the warm or hot faucet over the area of the clothing that you’ve just cleansed to get all the soap (and hopefully the oil) out. You should see that the stain has lifted a little and the fabric feels less oily. If a lot of Vaseline got into the fabric or if it has been there for a while, you may need to rub it with dishwashing soap a few times to see a difference. Apply a stain remover to the fabric and let it sit for 10 minutes. Pretreating the fabric with a stain remover will help remove any stubborn oil stains that may have set in over a longer period of time. Just make sure to read the particular stain remover’s instructions to prevent any discoloration (especially if the formula contains bleach). If you don’t have any stain remover, you can also put liquid laundry detergent on the stain or rub a wet bar of regular soap on it. Rinse the stain under the sink with hot water after treating it. Get all of the soap or stain remover out with hot water. Let the hot water tap heat up for a while so you don't accidentally put cold water on it. Cold water won't help oil stains and might seal them into the cloth. If the garment’s care label calls for cold water, it’s still okay to use very warm water on the area with the stain. Wash the clothing in the hottest water possible. You can either wash the item by hand in the sink or in the washing machine. Just be sure to use hot water because will lift stains and oil from the clothing fibers. If you're worried about the hot water shrinking the garment, use warm water instead. Always check the care label to make sure that hot water is safe for the fabric! If not, you can use warm water because it won’t cause immediate shrinkage like hot water might. Do not put the item in the dryer if the stain is still there after washing! That will only set the stain. So if that’s the case, treat and wash the stain again until it’s gone. Applying Rubbing Alcohol Remove any excess Vaseline using a dull edge or paper towel. To prevent spreading or setting the stain, it’s important to remove any excess as soon as possible. Use a dull knife or dry paper towel to carefully scrape or pull it away. The sooner you remove any excess, the better chance you have of lifting the stain. Lightly dab rubbing alcohol onto the stain. Rubbing alcohol (also known as isopropyl alcohol) is a degreasing agent that does things water and soap just can’t do! Use a clean dry cloth or cotton pad to dab rubbing alcohol onto the stain and rub it in using very small motions. Press down every so often to make sure it soaks through. Depending on the fabric and the quality of dyes used to color it, it may be necessary to test a little of the rubbing alcohol on an inconspicuous part of the garment to check for discoloration. Be gentle with thinner or delicate fabrics. Allow the rubbing alcohol to dry. Let the alcohol dry into the stain until it’s dry before washing. This could take anywhere from 20 to 40 minutes depending on the thickness of the material and size of the stain. Scrub liquid dishwashing detergent into the stain. Dishwashing detergent is a degreasing agent that will help lift any leftover oil from the fabric. Use both hands on either side of the cloth to scrub it all the way through until it gets sudsy. Remember to be careful with thinner fabrics! Rinse the stain with hot or warm water and let it dry. Turn on the hot water tap to give it time to heat up. When it’s hot, hold the stained section under the water. Makes sure no cold water touches it because cold water sets oil stains while hot or warm water will help lift them out. You can use a clean towel to pat the stain dry or just let it air dry. If the stain still isn’t gone, apply more detergent or stain remover until there’s no more sign of it. Wash the clothing in hot or warm water. Wash the garment either by hand or in the washing machine. Just make sure that you use hot or warm water because it will lift stains and oil from the clothing fibers. If you think the item might shrink, it's okay to use warm water instead of hot. Always check the care label to make sure that hot water is safe for the fabric! If you’re unsure, use warm water because it won’t cause immediate shrinkage like hot water might. Whatever you do, do not put a still-stained garment in the dryer because this will set the stain and make it even harder to remove in the future! Soaking in Vinegar Scrape away any excess Vaseline. To prevent spreading the stain, it’s important to remove any excess as soon as possible. Use a dull knife or dry paper towel to carefully remove as much Vaseline as possible. The sooner you remove any excess, the better chance you have of lifting the oil stain. Soak the stained portion in vinegar for 5 to 10 minutes. Vinegar is a natural astringent and packs a powerful punch against oil and stains in general. And don’t worry, the garment won’t smell like vinegar after a full wash. When treating colored garments, soak it in a mixture of vinegar and water in equal parts to prevent the fabric from fading or discoloration. Scrub the area with a paper towel after soaking. Scrubbing in the vinegar will help lift the oil from all those fibers. Make sure to scrub in all directions to loosen the oil from all sides of the fibers. If the stain doesn’t start to scrub away, apply some more vinegar and scrub it in again. For extra-stubborn stains, you can also scrub in some dishwashing liquid at this point and rinse it with warm water. Let the garment air dry once the stain is gone. Letting the garment dry naturally will prevent any stubborn stains from setting. If you’re tempted to toss it in the dryer or use a hair dryer on it to see if the stain is gone, fight the temptation! Both of those things will only seal in any stain residue. Once it’s air-dried, you can always go back and try a different stain removal method if the stain isn’t fully gone.",
  "tyn_model":[
    "water",
    "vaseline",
    "vinegar",
    "rubbing alcohol",
    "dishwashing soap",
    "stain remover",
    "soap",
    "hot water",
    "paper towel",
    "dishwashing detergent",
    "butter knife",
    "laundry detergent",
    "regular soap",
    "knife",
    "isopropyl alcohol",
    "detergent or",
    "dishwashing liquid",
    "dryer",
    "hair dryer"
  ],
  "tyn_section":[

  ]
}