{
  "title":"How to Measure Pipe Size",
  "url":"https://www.wikihow.com/Measure-Pipe-Size",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "parts":[
    {
      "name":"Measuring the Right Diameter",
      "steps":[
        {
          "headline":"Determine if your pipe has “male” or “female” threads or no threads.",
          "description":"Threads are the little grooves on the ends of some pipes that help them fit together. Male threads are on the outside of the pipe, whereas female threads are on the inside."
        },
        {
          "headline":"Find the outside diameter if the pipe has male threads or no threads.",
          "description":"The outside diameter is from outside edge to outside edge across the pipe. To find it, measure around the circumference of the pipe with flexible measuring tape. Divide the circumference by pi, or about 3.14159. For example, if the circumference is 12.57 inches (319 mm), you would divide by pi, and get an outside diameter of about 4 inches (100 mm). Use string to measure if you don’t have measuring tape. Mark the point on the string where it wraps around the circumference. Then remove the string, measure it against a ruler, and divide that length by pi."
        },
        {
          "headline":"Measure the inside diameter if the pipe has female threads.",
          "description":"That is the distance across the middle of the pipe, not including the thickness of the pipe walls. Use a ruler or a caliper and measure at the end of the pipe, where there is a cross section. Remember not to measure from the outside edges, but rather from inside edge to inside edge."
        }
      ]
    },
    {
      "name":"Converting to Nominal Pipe Size",
      "steps":[
        {
          "headline":"Convert your diameter to nominal size if its smaller than 14 inches (360 mm).",
          "description":"If its 14 inches (360 mm) or more, you don’t need to convert it, because the diameter will equal the nominal diameter already."
        },
        {
          "headline":"Find out if you need to convert to NPS or DN.",
          "description":"Convert to Nominal Pipe Size (NPS) if you are in North America, or Diameter Nominal (DN) if you are using the metric system. If you are unsure, it could help to go to the website of a store in your country that sells pipe. If they mark pipe with inches, then you need the NPS system."
        },
        {
          "headline":"Convert your measurement of internal or outside diameter to the appropriate nominal size.",
          "description":"Nominal size is what the pipe will be called in the store. You can do this using a table. This table is helpful for NPS measurements: https://www.zoro.com/pipe-fitting-size-guide\n\nThis table has both NPS and DN measurements: https://www.massflow-online.com/faqs/where-do-nps-or-dn-stand-for/\n\nFor example, if you measured a diameter of 1.05 inches (27 mm), this would translate to a nominal size of ¾ in NPS, or 20 in DN."
        }
      ]
    }
  ],
  "text":" Measuring the Right Diameter Determine if your pipe has “male” or “female” threads or no threads. Threads are the little grooves on the ends of some pipes that help them fit together. Male threads are on the outside of the pipe, whereas female threads are on the inside. Find the outside diameter if the pipe has male threads or no threads. The outside diameter is from outside edge to outside edge across the pipe. To find it, measure around the circumference of the pipe with flexible measuring tape. Divide the circumference by pi, or about 3.14159. For example, if the circumference is 12.57 inches (319 mm), you would divide by pi, and get an outside diameter of about 4 inches (100 mm). Use string to measure if you don’t have measuring tape. Mark the point on the string where it wraps around the circumference. Then remove the string, measure it against a ruler, and divide that length by pi. Measure the inside diameter if the pipe has female threads. That is the distance across the middle of the pipe, not including the thickness of the pipe walls. Use a ruler or a caliper and measure at the end of the pipe, where there is a cross section. Remember not to measure from the outside edges, but rather from inside edge to inside edge. Converting to Nominal Pipe Size Convert your diameter to nominal size if its smaller than 14 inches (360 mm). If its 14 inches (360 mm) or more, you don’t need to convert it, because the diameter will equal the nominal diameter already. Find out if you need to convert to NPS or DN. Convert to Nominal Pipe Size (NPS) if you are in North America, or Diameter Nominal (DN) if you are using the metric system. If you are unsure, it could help to go to the website of a store in your country that sells pipe. If they mark pipe with inches, then you need the NPS system. Convert your measurement of internal or outside diameter to the appropriate nominal size. Nominal size is what the pipe will be called in the store. You can do this using a table. This table is helpful for NPS measurements: https://www.zoro.com/pipe-fitting-size-guide\n\nThis table has both NPS and DN measurements: https://www.massflow-online.com/faqs/where-do-nps-or-dn-stand-for/\n\nFor example, if you measured a diameter of 1.05 inches (27 mm), this would translate to a nominal size of ¾ in NPS, or 20 in DN.",
  "tyn_model":[
    "threads",
    "string",
    "ruler",
    "pipe",
    "“male",
    "” or",
    "“female",
    "” threads",
    "flexible measuring tape",
    "measuring tape",
    "caliper",
    "table",
    "dn"
  ],
  "tyn_section":[

  ]
}