{
  "title":"How to Make a Dead Drop",
  "url":"https://www.wikihow.com/Make-a-Dead-Drop",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "steps":[
    {
      "headline":"Pre-arrange a place for the dead drop with your partner(s).",
      "description":"In order to successfully pass the message to another person, you must agree on a place to hide it beforehand. Make sure it is not in a place where it might be picked up or confiscated, such as a by the street side or at an airport. Find a place where the dead drop doesn't attract attention such as a city park or near a dumpster. Note that if you're making a dead drop of a geocache, then informing people of its location is unnecessary and counterproductive."
    },
    {
      "headline":"Make a signal.",
      "description":"For the dead drop to work, you must have a signal that tells the other person where the dead drop is or will be. For example, you could mark the location with chalk. Try to make the signal blend into its surroundings, but still recognizable by the recipient."
    },
    {
      "headline":"Write down your message and/or gather the items you want to drop.",
      "description":"Try and keep dead drops small. The more items you include, the more conspicuous the drop. If you have a lot of stuff to include, consider making more than one dead drop."
    },
    {
      "headline":"Think about how quickly the other person will retrieve it.",
      "description":"If your object will be retrieved quickly, you could put it in an area of higher risk finding it, but easier to retrieve. If however, the other person will only reach the drop location after a long time, you'd want to put the dead drop in a less risky and more isolated area."
    },
    {
      "headline":"Encode secret messages in case the dead drop is found.",
      "description":"No matter how well you hide your drop, there is still a possibility that it will be discovered. If you're sending a secret message, be sure to encrypt the message so that if someone finds it, your secrets are still safe. Make sure that the recipient knows how to decipher the message!"
    },
    {
      "headline":"Disguise your dead drop.",
      "description":"In order for the dead drop to go unnoticed, it mustn't attract attention. There are a variety of ways you can disguise your dead drop. For example:\nUse a plain cardboard box. An old, discoloured box works best, as people are likely to stay away or not notice at all. Avoid colorful or conspicuous containers. Use an empty soda can or opaque bottle. Soda cans are so common that no one is likely to pay much heed to it. All you need is an empty soda can and then you hide the message inside. The can poses as an innocent object - but be careful, someone may throw it away!"
    },
    {
      "headline":"Hide your dead drop.",
      "description":"While it's always possible to hide your dead drop in plain sight, consider burying it or placing it somewhere hard to reach. The more inaccessible the drop, the better."
    },
    {
      "headline":"Inform your partner(s) that the dead drop has been made.",
      "description":"If you don't want to disclose your identity, remain anonymous by using an internet bulletin board, or a pay phone."
    },
    {
      "headline":"Periodically check the dead drop.",
      "description":"Check on the dead drop once in a while to ensure its safety. If you're worried that the area you hid it isn't safe anymore, consider relocating the drop and informing the recipient."
    },
    {
      "headline":"Confirm that the dead drop was successful.",
      "description":"Wait for a message from the recipient. If you don't get a message, try and contact them for confirmation."
    }
  ],
  "text":" Pre-arrange a place for the dead drop with your partner(s). In order to successfully pass the message to another person, you must agree on a place to hide it beforehand. Make sure it is not in a place where it might be picked up or confiscated, such as a by the street side or at an airport. Find a place where the dead drop doesn't attract attention such as a city park or near a dumpster. Note that if you're making a dead drop of a geocache, then informing people of its location is unnecessary and counterproductive. Make a signal. For the dead drop to work, you must have a signal that tells the other person where the dead drop is or will be. For example, you could mark the location with chalk. Try to make the signal blend into its surroundings, but still recognizable by the recipient. Write down your message and/or gather the items you want to drop. Try and keep dead drops small. The more items you include, the more conspicuous the drop. If you have a lot of stuff to include, consider making more than one dead drop. Think about how quickly the other person will retrieve it. If your object will be retrieved quickly, you could put it in an area of higher risk finding it, but easier to retrieve. If however, the other person will only reach the drop location after a long time, you'd want to put the dead drop in a less risky and more isolated area. Encode secret messages in case the dead drop is found. No matter how well you hide your drop, there is still a possibility that it will be discovered. If you're sending a secret message, be sure to encrypt the message so that if someone finds it, your secrets are still safe. Make sure that the recipient knows how to decipher the message! Disguise your dead drop. In order for the dead drop to go unnoticed, it mustn't attract attention. There are a variety of ways you can disguise your dead drop. For example:\nUse a plain cardboard box. An old, discoloured box works best, as people are likely to stay away or not notice at all. Avoid colorful or conspicuous containers. Use an empty soda can or opaque bottle. Soda cans are so common that no one is likely to pay much heed to it. All you need is an empty soda can and then you hide the message inside. The can poses as an innocent object - but be careful, someone may throw it away! Hide your dead drop. While it's always possible to hide your dead drop in plain sight, consider burying it or placing it somewhere hard to reach. The more inaccessible the drop, the better. Inform your partner(s) that the dead drop has been made. If you don't want to disclose your identity, remain anonymous by using an internet bulletin board, or a pay phone. Periodically check the dead drop. Check on the dead drop once in a while to ensure its safety. If you're worried that the area you hid it isn't safe anymore, consider relocating the drop and informing the recipient. Confirm that the dead drop was successful. Wait for a message from the recipient. If you don't get a message, try and contact them for confirmation.",
  "tyn_model":[
    "soda can",
    "geocache",
    "chalk",
    "soda cans"
  ],
  "tyn_section":[

  ]
}