{
  "title":"How to Grill Portobello Mushrooms",
  "url":"https://www.wikihow.com/Grill-Portobello-Mushrooms",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Mushrooms"
  ],
  "parts":[
    {
      "name":"Cleaning and Seasoning the Portobellos",
      "steps":[
        {
          "headline":"Cut off the stems at the base.",
          "description":"This will make it easier to flip your mushrooms over and grill on both sides. You can save the stems to use in other recipes or throw them out. The stems taste good chopped up in soups, omelettes, or quiches."
        },
        {
          "headline":"Remove the gills if you want.",
          "description":"This step is optional, because some people prefer to leave the gills on, but they tend to release a lot of dark liquid while cooking. To take them off, lay the mushroom cap-side down on the counter or in the palm of your hand. Use a spoon to gently scrape down the gills. A grapefruit spoon with a serrated edge can help make this step easier."
        },
        {
          "headline":"Clean the mushrooms with a damp paper towel or cloth.",
          "description":"Gently remove the dirt from the mushroom tops. Don’t scrub them, or you’ll end up scrubbing off a lot of the mushroom by accident. You can rinse the mushroom gills if you left them on. Don’t submerge the portobellos in water, because they’ll get soggy and won’t grill well."
        },
        {
          "headline":"Place the mushrooms in a large plastic bag and add seasoning.",
          "description":"Put in enough olive oil to cover the mushrooms. Sprinkle salt and pepper into the bag. Add fun spices to the marinade. Some people like to add minced garlic. Others like chopped onion, thyme, dill weed, steak seasoning, or rosemary. Get creative with spices! This is your chance to experiment. Soy sauce adds a savory flavor."
        },
        {
          "headline":"Seal the plastic bag and leave it in the fridge for 10-30 minutes.",
          "description":"Marinating the mushrooms allows them to soak up more spice and flavor. If you leave it for more than an hour, the mushrooms might get too salty. If you don’t have time to wait, you can cook the mushrooms immediately after seasoning them⁠—the spices just won’t be as strong."
        }
      ]
    },
    {
      "name":"Grilling the Mushrooms",
      "steps":[
        {
          "headline":"Preheat the grill to medium-high for 15 minutes.",
          "description":"This will help burn off the food residue from the last time you grilled, and also get it to the right temperature for grilling. If you are using a charcoal grill, you only need to preheat for about 5 minutes. Use a ribbed cast iron skillet if you don’t have a grill. Oil it and turn the stove burner to medium-high. You may have to wait a few minutes for the skillet to heat up."
        },
        {
          "headline":"Clean the grill and oil it.",
          "description":"Use a stainless steel brush to remove all the ash and food residue. Put some oil on a paper towel and wipe down the grill with it. Oiling the grill will help your mushrooms slide off the grill easily."
        },
        {
          "headline":"Grill the mushrooms for 4-6 minutes on each side.",
          "description":"Place the mushrooms on the grill (or skillet) cap-side down and leave them for 4-6 minutes, until there are grill marks on the bottom. Flip using tongs so you don’t burn your hands. If you want to cook for longer, that’s fine. It’s hard to overcook portobello mushrooms. If your portobellos are too small for the grill, you can skewer them or use a grilling basket. For criss-cross grill lines, turn the mushrooms 45-degrees halfway through cooking on each side."
        },
        {
          "headline":"Drizzle with balsamic vinegar and serve.",
          "description":"Portobellos make a great main dish, with some sides of other vegetables. You can also serve your grilled portobellos in a burger bun with cheese and veggies for a good vegetarian alternative to burgers. They are also a good side for fish or meat."
        }
      ]
    }
  ],
  "text":" Cleaning and Seasoning the Portobellos Cut off the stems at the base. This will make it easier to flip your mushrooms over and grill on both sides. You can save the stems to use in other recipes or throw them out. The stems taste good chopped up in soups, omelettes, or quiches. Remove the gills if you want. This step is optional, because some people prefer to leave the gills on, but they tend to release a lot of dark liquid while cooking. To take them off, lay the mushroom cap-side down on the counter or in the palm of your hand. Use a spoon to gently scrape down the gills. A grapefruit spoon with a serrated edge can help make this step easier. Clean the mushrooms with a damp paper towel or cloth. Gently remove the dirt from the mushroom tops. Don’t scrub them, or you’ll end up scrubbing off a lot of the mushroom by accident. You can rinse the mushroom gills if you left them on. Don’t submerge the portobellos in water, because they’ll get soggy and won’t grill well. Place the mushrooms in a large plastic bag and add seasoning. Put in enough olive oil to cover the mushrooms. Sprinkle salt and pepper into the bag. Add fun spices to the marinade. Some people like to add minced garlic. Others like chopped onion, thyme, dill weed, steak seasoning, or rosemary. Get creative with spices! This is your chance to experiment. Soy sauce adds a savory flavor. Seal the plastic bag and leave it in the fridge for 10-30 minutes. Marinating the mushrooms allows them to soak up more spice and flavor. If you leave it for more than an hour, the mushrooms might get too salty. If you don’t have time to wait, you can cook the mushrooms immediately after seasoning them⁠—the spices just won’t be as strong. Grilling the Mushrooms Preheat the grill to medium-high for 15 minutes. This will help burn off the food residue from the last time you grilled, and also get it to the right temperature for grilling. If you are using a charcoal grill, you only need to preheat for about 5 minutes. Use a ribbed cast iron skillet if you don’t have a grill. Oil it and turn the stove burner to medium-high. You may have to wait a few minutes for the skillet to heat up. Clean the grill and oil it. Use a stainless steel brush to remove all the ash and food residue. Put some oil on a paper towel and wipe down the grill with it. Oiling the grill will help your mushrooms slide off the grill easily. Grill the mushrooms for 4-6 minutes on each side. Place the mushrooms on the grill (or skillet) cap-side down and leave them for 4-6 minutes, until there are grill marks on the bottom. Flip using tongs so you don’t burn your hands. If you want to cook for longer, that’s fine. It’s hard to overcook portobello mushrooms. If your portobellos are too small for the grill, you can skewer them or use a grilling basket. For criss-cross grill lines, turn the mushrooms 45-degrees halfway through cooking on each side. Drizzle with balsamic vinegar and serve. Portobellos make a great main dish, with some sides of other vegetables. You can also serve your grilled portobellos in a burger bun with cheese and veggies for a good vegetarian alternative to burgers. They are also a good side for fish or meat.",
  "tyn_model":[
    "mushrooms",
    "grill",
    "portobellos",
    "spices",
    "skillet",
    "oil",
    "spoon",
    "grapefruit spoon",
    "water",
    "large plastic bag",
    "seasoning",
    "olive oil",
    "salt and pepper",
    "garlic",
    "thyme",
    "dill weed",
    "steak seasoning",
    "rosemary",
    "soy sauce",
    "plastic bag",
    "charcoal grill",
    "cast iron skillet",
    "stove burner",
    "stainless steel brush",
    "paper towel",
    "portobello mushrooms",
    "grilling basket",
    "balsamic vinegar"
  ],
  "tyn_section":[

  ]
}