{
  "title":"How to Prevent Dust",
  "url":"https://www.wikihow.com/Prevent-Dust",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "Dusting"
  ],
  "parts":[
    {
      "name":"Minimizing Dust Build-Up",
      "steps":[
        {
          "headline":"Limit knickknacks around the house.",
          "description":"Knickknacks gather dust quickly and their small crevices are difficult to clean. Get rid of unnecessary clutter. If you have a lot of trinkets you want to display, consider putting them in a glass box. That way, they will still be visible, but one glass box is much easier to dust than many small knick-knacks."
        },
        {
          "headline":"Put doormats on both sides of every door used to enter the house.",
          "description":"As much as 80% of household dust comes in on the bottoms of shoes, so get the dust before it enters your house by giving your guests a place to wipe their feet. The most effective doormats are tight-weave and rubber-backed. Also consider implementing a No Shoes in the House policy."
        },
        {
          "headline":"Change the filter of your furnace or HVAC regularly.",
          "description":"Since the furnace or air conditioning unit circulates air throughout your house, the filter is a great way to catch dust before it blows all over the place. Check your filter monthly to see how much dust accumulates. Most filters need to be changed once a year. Use pleated filters in your furnace or air conditioning unit. Fiberglass filters do little to prevent dust, so pleated filters are the way to go. If you’re not sure which filters would work well with your furnace, consult a furnace technician."
        },
        {
          "headline":"Maintain a humidity of 50% or below in the house to prevent dust mites.",
          "description":"You can use an air conditioner or a dehumidifier to keep the humidity down. Studies have shown that having a humidity of less than 50% makes the house inhospitable to dust mites, which can really help prevent allergic symptoms. Dust mites are microscopic pests that live in household dust and cause allergic reactions including asthma."
        },
        {
          "headline":"Remove carpeting and non-washable curtains.",
          "description":"Wall-to-wall carpeting is a great home for dust mites, especially if the carpeting is over concrete. Replace wall-to-wall carpeting with tile, wood, linoleum, or vinyl flooring. Non-washable curtains also trap dust, so consider getting curtains that can be washed, or replacing them with blinds."
        }
      ]
    },
    {
      "name":"Dust-Proofing the Bedroom",
      "steps":[
        {
          "headline":"Zip allergen-reducing covers onto your mattresses and pillows.",
          "description":"If you find yourself sneezing in your bed a lot, you might benefit from allergen-reducing covers. These covers are much easier to wash than washing the whole mattress or pillow. To wash the covers, run them through the washing machine on a hot water cycle. Make sure to wash covers at least twice a year."
        },
        {
          "headline":"Wash your sheets, blankets and pillow cases once a week.",
          "description":"Use water that is at least 130 F (54.4 C). The hot water will kill dust mites and remove allergens. If your bedding can't be washed in hot water, you can still kill the dust mites. Just put the bedding in the dryer for 15 minutes or more, at a temperature above 130 F (54.4 C)."
        },
        {
          "headline":"Clean your pillows every 4-6 weeks.",
          "description":"You wash your bedding, but do you ever wash your pillows? Probably not. Hair and skin flakes can build up in pillows, creating dust. You can wash your pillows in the washing machine if the care label says you can. Steam or dry clean pillows made out of memory foam or latex."
        },
        {
          "headline":"Wash childrens’ stuffed animals.",
          "description":"Stuffed toys can collect dust, especially when they live on the bed. Wash stuffed animals regularly, whenever they’re starting to look grubby, by placing them on a gentle cycle in a delicates bag. If the stuffed animals are looking particularly threadbare and delicate, hand wash them in the sink. Always air dry the stuffed animals, because the dryer cycle might damage them."
        },
        {
          "headline":"Vacuum your mattress every few months.",
          "description":"Most people keep their mattress for a very long time, and dust and debris can really build up after a few years. So clean your mattress by stripping the bed and running the upholstery extension of the vacuum cleaner thoroughly over the mattress. Flip the mattress and vacuum on the other side."
        }
      ]
    },
    {
      "name":"Cleaning Regularly and Efficiently",
      "steps":[
        {
          "headline":"Establish a weekly cleaning routine.",
          "description":"It can be difficult to find time for big clean-up tasks like vacuuming and mopping, amid the everyday chores of cooking and laundry. Establishing a routine can help. Choose one day of the week that will be cleaning day."
        },
        {
          "headline":"Make a chore wheel if you share chores with roommates.",
          "description":"A chore wheel has a large paper circle with specific chores written on it, like, “mopping the kitchen floor” or “cleaning the bathroom” and a smaller paper circle pinned on top with the roommates’ or family members' names. Turn the small wheel each week so that each person has a new chore. Place the chore wheel somewhere public, like the refrigerator. This public display of chores can help keep people accountable."
        },
        {
          "headline":"Sweep, vacuum, and mop at least once a week.",
          "description":"Make cleaning floors and carpets part of your weekly cleaning routine, instead of waiting for them to look disgusting and get covered in dust mites. By the time you can see the dirt and hair accumulating, it’s already too late! Keeping a regular routine will prevent dusty build-up and dust mites. Vacuum carpets and rugs, and mop floor and tile. If the floor is really dirty, sweep before you mop. Make sure to clean under the sofa and under the bed! Dust bunnies often accumulate in these hard-to-reach places."
        },
        {
          "headline":"Empty the vacuum cleaner after each use.",
          "description":"If your vacuum cleaner has a canister, tip the contents of the canister into a trash bag. If your cleaner has a vacuum bag, take out the bag when it is half full and put in a trash bag. Replace the bag before you vacuum again."
        },
        {
          "headline":"Use a damp microfiber cloth to wipe down surfaces weekly.",
          "description":"A damp microfiber cloth will prevent the dust from floating up into the air and resettling. Avoid a feather duster. Feather dusters might look cute in the movies, but they don’t actually do a good job of dusting. Don’t use fabric softener or dryer sheets when you’re washing your microfiber cloths or other cleaning rags. That would reduce their ability to hold dust. Use a soft-bristled vacuum cleaner extension to dust curtains, blinds, and baseboards."
        },
        {
          "headline":"Dust surfaces from top to bottom.",
          "description":"Start dusting on the highest part of whatever you are cleaning. If you're cleaning a bookcase, start on the top shelf. If you're dusting a figurine, start at the head. This way, if any dust falls downward while you’re dusting, you will get it as you go. It’s the same principle as sweeping the stairs from top to bottom."
        }
      ]
    }
  ],
  "text":" Minimizing Dust Build-Up Limit knickknacks around the house. Knickknacks gather dust quickly and their small crevices are difficult to clean. Get rid of unnecessary clutter. If you have a lot of trinkets you want to display, consider putting them in a glass box. That way, they will still be visible, but one glass box is much easier to dust than many small knick-knacks. Put doormats on both sides of every door used to enter the house. As much as 80% of household dust comes in on the bottoms of shoes, so get the dust before it enters your house by giving your guests a place to wipe their feet. The most effective doormats are tight-weave and rubber-backed. Also consider implementing a No Shoes in the House policy. Change the filter of your furnace or HVAC regularly. Since the furnace or air conditioning unit circulates air throughout your house, the filter is a great way to catch dust before it blows all over the place. Check your filter monthly to see how much dust accumulates. Most filters need to be changed once a year. Use pleated filters in your furnace or air conditioning unit. Fiberglass filters do little to prevent dust, so pleated filters are the way to go. If you’re not sure which filters would work well with your furnace, consult a furnace technician. Maintain a humidity of 50% or below in the house to prevent dust mites. You can use an air conditioner or a dehumidifier to keep the humidity down. Studies have shown that having a humidity of less than 50% makes the house inhospitable to dust mites, which can really help prevent allergic symptoms. Dust mites are microscopic pests that live in household dust and cause allergic reactions including asthma. Remove carpeting and non-washable curtains. Wall-to-wall carpeting is a great home for dust mites, especially if the carpeting is over concrete. Replace wall-to-wall carpeting with tile, wood, linoleum, or vinyl flooring. Non-washable curtains also trap dust, so consider getting curtains that can be washed, or replacing them with blinds. Dust-Proofing the Bedroom Zip allergen-reducing covers onto your mattresses and pillows. If you find yourself sneezing in your bed a lot, you might benefit from allergen-reducing covers. These covers are much easier to wash than washing the whole mattress or pillow. To wash the covers, run them through the washing machine on a hot water cycle. Make sure to wash covers at least twice a year. Wash your sheets, blankets and pillow cases once a week. Use water that is at least 130 F (54.4 C). The hot water will kill dust mites and remove allergens. If your bedding can't be washed in hot water, you can still kill the dust mites. Just put the bedding in the dryer for 15 minutes or more, at a temperature above 130 F (54.4 C). Clean your pillows every 4-6 weeks. You wash your bedding, but do you ever wash your pillows? Probably not. Hair and skin flakes can build up in pillows, creating dust. You can wash your pillows in the washing machine if the care label says you can. Steam or dry clean pillows made out of memory foam or latex. Wash childrens’ stuffed animals. Stuffed toys can collect dust, especially when they live on the bed. Wash stuffed animals regularly, whenever they’re starting to look grubby, by placing them on a gentle cycle in a delicates bag. If the stuffed animals are looking particularly threadbare and delicate, hand wash them in the sink. Always air dry the stuffed animals, because the dryer cycle might damage them. Vacuum your mattress every few months. Most people keep their mattress for a very long time, and dust and debris can really build up after a few years. So clean your mattress by stripping the bed and running the upholstery extension of the vacuum cleaner thoroughly over the mattress. Flip the mattress and vacuum on the other side. Cleaning Regularly and Efficiently Establish a weekly cleaning routine. It can be difficult to find time for big clean-up tasks like vacuuming and mopping, amid the everyday chores of cooking and laundry. Establishing a routine can help. Choose one day of the week that will be cleaning day. Make a chore wheel if you share chores with roommates. A chore wheel has a large paper circle with specific chores written on it, like, “mopping the kitchen floor” or “cleaning the bathroom” and a smaller paper circle pinned on top with the roommates’ or family members' names. Turn the small wheel each week so that each person has a new chore. Place the chore wheel somewhere public, like the refrigerator. This public display of chores can help keep people accountable. Sweep, vacuum, and mop at least once a week. Make cleaning floors and carpets part of your weekly cleaning routine, instead of waiting for them to look disgusting and get covered in dust mites. By the time you can see the dirt and hair accumulating, it’s already too late! Keeping a regular routine will prevent dusty build-up and dust mites. Vacuum carpets and rugs, and mop floor and tile. If the floor is really dirty, sweep before you mop. Make sure to clean under the sofa and under the bed! Dust bunnies often accumulate in these hard-to-reach places. Empty the vacuum cleaner after each use. If your vacuum cleaner has a canister, tip the contents of the canister into a trash bag. If your cleaner has a vacuum bag, take out the bag when it is half full and put in a trash bag. Replace the bag before you vacuum again. Use a damp microfiber cloth to wipe down surfaces weekly. A damp microfiber cloth will prevent the dust from floating up into the air and resettling. Avoid a feather duster. Feather dusters might look cute in the movies, but they don’t actually do a good job of dusting. Don’t use fabric softener or dryer sheets when you’re washing your microfiber cloths or other cleaning rags. That would reduce their ability to hold dust. Use a soft-bristled vacuum cleaner extension to dust curtains, blinds, and baseboards. Dust surfaces from top to bottom. Start dusting on the highest part of whatever you are cleaning. If you're cleaning a bookcase, start on the top shelf. If you're dusting a figurine, start at the head. This way, if any dust falls downward while you’re dusting, you will get it as you go. It’s the same principle as sweeping the stairs from top to bottom.",
  "tyn_model":[
    "furnace",
    "vacuum cleaner",
    "filters",
    "water",
    "vacuum",
    "air conditioning",
    "curtains",
    "allergen-reducing covers",
    "microfiber cloth",
    "air conditioner",
    "dehumidifier",
    "hot water",
    "dryer",
    "washing machine",
    "memory foam",
    "’ stuffed",
    "“mopping",
    "” or",
    "“cleaning",
    "” and",
    "’ or",
    "refrigerator",
    "vacuum bag",
    "feather duster",
    "feather dusters",
    "fabric softener or dryer sheets",
    "microfiber cloths"
  ],
  "tyn_section":[

  ]
}