{
  "title":"How to Reduce Plastic Waste",
  "url":"https://www.wikihow.com/Reduce-Plastic-Waste",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Plastic"
  ],
  "methods":[
    {
      "name":"Carrying Reusable Items",
      "steps":[
        {
          "headline":"Take reusable bags with you when you need to shop.",
          "description":"Grocery stores have long been a prime source of single-use bags, but plastic bags are everywhere. The best way to avoid them is to carry fabric wherever you go. Many stores sell reusable bags, but you can save money by making your own out of fabric. Even if you buy a reusable plastic bag, it is much better than relying on disposable ones. These big bags are stronger and work well on any shopping trip. If you drive to the store, keep bags in your car so you don't have to rely on the ones stores will give you."
        },
        {
          "headline":"Bring your own cup or mug when buying coffee.",
          "description":"Disposable coffee cups are a massive source of plastic waste, but the problem is easy to avoid. Many coffee places sell reusable cups and even give discounts to customers who bring in their own cups. If you often drink coffee on your commute, try getting a metal tumbler. Another option is to stay at the coffee shop and ask the barista to pour your brew into one of their mugs instead of a paper cup. If you frequent a particular coffee shop, ask them about bringing in a reusable cup. They will help you figure out what you need to do as well as tell you about any incentives for"
        },
        {
          "headline":"Purchase your own straw if you’re used to using plastic ones.",
          "description":"You don’t need a plastic straw to enjoy a cold drink. If you find yourself often reaching for a straw, pack your own whenever you go out. Then, wash the straw out with soap and water when you get home. These straws are safe to use and more resistant to bending than flimsy plastic ones. Metal straws are durable but tend to get as hot or cold as the drink you’re sipping. Glass straws are temperature-resistant but more fragile. You could also get a silicone or bamboo straw. Silicone is temperature-resistant like glass. Bamboo is the eco-friendly option since it’s a biodegradable plant. Even if you decide you don’t need a straw, there is a way to avoid plastic. Sip your drink straight from the cup!"
        },
        {
          "headline":"Carry a refillable water bottle when you’re on the go.",
          "description":"Instead of buying bottled water, purchase something more sustainable. Try a steel bottle for a damage-resistant option during activities like sports. Glass is more fragile but also good at keeping hot water warm. You could even get a reusable plastic bottle, which is still a better option than buying multiple single-use bottles. If you’re worried about the quality of drinking water available, purchase your own filter. Some reusable water bottles come with built-in filters."
        },
        {
          "headline":"Bring your own cutlery to avoid relying on plastic ones.",
          "description":"Anticipate plastic forks, knives, and spoons at fast food restaurants and other small establishments. Next time you go in, pack your own at home and say no thanks to plastic. You could roll up metal cutlery in a bag, then take it home and wash it when you’re done eating. Metal cutlery is fine, but carrying it around can be a bit of a hassle. If you’re looking for something lightweight, try getting a set of bamboo cutlery. Bamboo is also organic and biodegradable in case you need to throw it out. Keep a set of utensils where you need them, such as at the office. If you’re ordering out, wait until you get the food home so you can take advantage of your own cutlery."
        },
        {
          "headline":"Take your own container to pack food and leftovers.",
          "description":"Restaurants put leftovers in little plastic boxes that inevitably go in the trash once you get home. Retailers now sell reusable versions of those containers, but you could also take advantage of any resealable food storage container you have. Use these containers whenever you need to carry around a meal. To cut out even more plastic waste, carry a container with you whenever you go to a restaurant. If you do get a plastic leftover container from a restaurant, put it to good use instead of throwing it away. These containers generally can be washed out and reused a few times."
        }
      ]
    },
    {
      "name":"Shopping Responsibly",
      "steps":[
        {
          "headline":"Purchase quality products instead of disposable ones.",
          "description":"Stores carry numerous disposable products that are great for convenience but bad for the environment. Plastic tents, sponges, wipes, and bottles are a few examples of items to stay away from. Instead of using a disposable razor, get a straight razor or at least one with a replaceable head. If you have a child, swap out disposable diapers for cloth ones. Making these changes often saves you money as well as cuts down on waste. For instance, you don’t need to buy plastic sandwich bags or containers when you’re reusing jars. Factor in the plastic packaging a lot of disposable items come in. Even if you buy wipes that aren’t made of plastic, they come in a plastic container. Use old rags or sponges instead for cleaning."
        },
        {
          "headline":"Choose natural cleansers instead of ones with microbeads.",
          "description":"Microbeads are tiny balls of plastic found in a lot of beauty products, including toothpaste, body washes, facial scrubs, and makeup. Because of their small size, they don’t get filtered out at water treatment plants. Many animals also see microbeads as food and eat them. Look for plain products with exfoliants like salt or oatmeal to avoid ones with microbeads. Check the packaging before buying a product. Microbeads will be listed as an ingredient there. If you see colored specks in a product, you are probably looking at microbeads."
        },
        {
          "headline":"Buy products in bulk to reduce the amount of plastic used.",
          "description":"Small packs of nuts or yogurt, for instance, are convenient but not efficient. To reduce plastic waste, you’re better off buying a big container of what you need. Companies generally fit more of a product in bigger packages while using less plastic. One big package is better than several smaller ones. One way to take advantage of bulk food purchases is through canning. Store food inside a sterile container filled with syrup or brine. Canning is a way to preserve food for storage. Watch out for opportunities to use your own containers. For example, some grocery stores with bulk aisles or binned spices let you do this. Contact the store for their policies on bringing containers from home."
        },
        {
          "headline":"Purchase items secondhand to reduce manufacturing waste.",
          "description":"Check out local garage sales, secondhand stores, and online postings for deals. New items take resources to make and often come with a lot of additional plastic in the packaging. Toys and electronics are some of the worst offenders, but you can often get them used. Reuse plastic toys in particular so they don’t end up sitting in a landfill. The opposite applies if you have things to get rid of. Instead of throwing away toys, for instance, donate them. Sometimes you have no choice but to buy something new. Make sure you dispose of the plastic properly, including the wrapping, casing, and twist ties."
        },
        {
          "headline":"Shop with companies that make an effort to reduce plastic waste.",
          "description":"There are many companies that make products out of recycled plastic. Many more now are making an effort to cut back on waste like straws and cups. Check out how a product is manufactured before buying it. If you can, stay away from companies that aren’t socially responsible and don’t do a good job of cutting back on pollution. Research companies and products online. Read about the company’s manufacturing process and mission statement before making a purchase. Look online for environmentally-conscious groups. Let other people concerned about plastic waste direct you to responsible companies."
        }
      ]
    },
    {
      "name":"Advocating and Volunteering",
      "steps":[
        {
          "headline":"Refuse plastic items when they are offered to you.",
          "description":"Say no to plastic items you don’t need to use. It may not seem like a big deal, but that means one less piece of plastic wasted. You’re probably going to end up forgetting about it anyway if you’re not planning on using it. Say “No straw, please” when ordering a drink, for instance. Many places still offer items like utensils and plastic bags automatically. Be sure to speak up when you have the chance. Also, plan ahead to bring alternatives like reusable bags."
        },
        {
          "headline":"Pick up any plastic trash you find lying around.",
          "description":"Unfortunately, many people drop their plastic outdoors where it ends up harming the environment. It needs to be disposed of in a landfill. Keep a trash bag or an extra plastic bag with you at all times. When you see something, whether it’s a plastic wrapper or a soda bottle, store it in the bag until you are able to throw it in the trash. Search for volunteer organizations in your area that arrange clean-up days. If you don’t mind spending the day picking up plastic, work with other people to do some good for the environment. A great place to look for discarded plastic is when you’re out in nature, such as in a park or at the beach. However, you can help by picking up plastic no matter where you find it. Don’t forget to take care of your own plastic waste! If you’re prone to losing waste before getting it to a trash can, keep a storage bag available, such as in your car. Throw away plastic in trash cans. If you collect big bags brimming with plastic, take them to a landfill. Call local waste management services or departments to find the nearest one."
        },
        {
          "headline":"Recycle any type of plastic that can be reused.",
          "description":"Many garbage disposal services also offer plastic recycling. To use one, rinse out the plastic you want to get rid of, then put it in a garbage bag inside a recycling bin. Also, look for special recycling bins out in public. These are typically designed for bottles and other common plastic objects people carry. Ask the waste facility or your local waste management office what kind of plastic they accept. Not all plastic is recyclable. For example, polyvinyl chloride and polypropylene often aren’t accepted for recycling. That includes plastic packaging, food wrappers, furniture, and toys."
        },
        {
          "headline":"Instruct other people about reducing and recycling waste.",
          "description":"Become an expert on dealing with plastic. Share the information with your friends and post about it online, such as through social media. Try to educate as many people as possible so they also contribute to the cause. Plastic waste is a worldwide problem, so do your best to raise awareness. If you get one more person involved, that is one less source of plastic waste. They can also tell people they know to help spread the word. Teach people how to recycle, for instance, or share the problems caused by plastic waste. Let people know you’re serious about protecting the environment. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tConsider taking part in a month-long challenge to help spread awareness. Every January I do a 31 Day Challenge, and there are YouTube videos and blog posts every day. It's built to start you out with smaller steps, then work up to bigger ideas and principles. At the end, it has to do with getting involved with your community and your local government."
        },
        {
          "headline":"Contact companies and officials about reducing plastic waste.",
          "description":"If you have a mind for activism, ask companies about the amount of plastic waste they leave behind. Also, get in touch with local leaders about making changes. Ask them to institute measures like banning straws or bags. These changes have already begun happening in many areas because of the dedication of activists. Find other people to help out, such as people you know online or in your community. Change is more likely to happen when more people speak up. Find causes to champion, such as by raising awareness of a polluted local river. Some causes have a direct impact on your community, so people are more likely to take them seriously."
        }
      ]
    }
  ],
  "text":" Carrying Reusable Items Take reusable bags with you when you need to shop. Grocery stores have long been a prime source of single-use bags, but plastic bags are everywhere. The best way to avoid them is to carry fabric wherever you go. Many stores sell reusable bags, but you can save money by making your own out of fabric. Even if you buy a reusable plastic bag, it is much better than relying on disposable ones. These big bags are stronger and work well on any shopping trip. If you drive to the store, keep bags in your car so you don't have to rely on the ones stores will give you. Bring your own cup or mug when buying coffee. Disposable coffee cups are a massive source of plastic waste, but the problem is easy to avoid. Many coffee places sell reusable cups and even give discounts to customers who bring in their own cups. If you often drink coffee on your commute, try getting a metal tumbler. Another option is to stay at the coffee shop and ask the barista to pour your brew into one of their mugs instead of a paper cup. If you frequent a particular coffee shop, ask them about bringing in a reusable cup. They will help you figure out what you need to do as well as tell you about any incentives for Purchase your own straw if you’re used to using plastic ones. You don’t need a plastic straw to enjoy a cold drink. If you find yourself often reaching for a straw, pack your own whenever you go out. Then, wash the straw out with soap and water when you get home. These straws are safe to use and more resistant to bending than flimsy plastic ones. Metal straws are durable but tend to get as hot or cold as the drink you’re sipping. Glass straws are temperature-resistant but more fragile. You could also get a silicone or bamboo straw. Silicone is temperature-resistant like glass. Bamboo is the eco-friendly option since it’s a biodegradable plant. Even if you decide you don’t need a straw, there is a way to avoid plastic. Sip your drink straight from the cup! Carry a refillable water bottle when you’re on the go. Instead of buying bottled water, purchase something more sustainable. Try a steel bottle for a damage-resistant option during activities like sports. Glass is more fragile but also good at keeping hot water warm. You could even get a reusable plastic bottle, which is still a better option than buying multiple single-use bottles. If you’re worried about the quality of drinking water available, purchase your own filter. Some reusable water bottles come with built-in filters. Bring your own cutlery to avoid relying on plastic ones. Anticipate plastic forks, knives, and spoons at fast food restaurants and other small establishments. Next time you go in, pack your own at home and say no thanks to plastic. You could roll up metal cutlery in a bag, then take it home and wash it when you’re done eating. Metal cutlery is fine, but carrying it around can be a bit of a hassle. If you’re looking for something lightweight, try getting a set of bamboo cutlery. Bamboo is also organic and biodegradable in case you need to throw it out. Keep a set of utensils where you need them, such as at the office. If you’re ordering out, wait until you get the food home so you can take advantage of your own cutlery. Take your own container to pack food and leftovers. Restaurants put leftovers in little plastic boxes that inevitably go in the trash once you get home. Retailers now sell reusable versions of those containers, but you could also take advantage of any resealable food storage container you have. Use these containers whenever you need to carry around a meal. To cut out even more plastic waste, carry a container with you whenever you go to a restaurant. If you do get a plastic leftover container from a restaurant, put it to good use instead of throwing it away. These containers generally can be washed out and reused a few times. Shopping Responsibly Purchase quality products instead of disposable ones. Stores carry numerous disposable products that are great for convenience but bad for the environment. Plastic tents, sponges, wipes, and bottles are a few examples of items to stay away from. Instead of using a disposable razor, get a straight razor or at least one with a replaceable head. If you have a child, swap out disposable diapers for cloth ones. Making these changes often saves you money as well as cuts down on waste. For instance, you don’t need to buy plastic sandwich bags or containers when you’re reusing jars. Factor in the plastic packaging a lot of disposable items come in. Even if you buy wipes that aren’t made of plastic, they come in a plastic container. Use old rags or sponges instead for cleaning. Choose natural cleansers instead of ones with microbeads. Microbeads are tiny balls of plastic found in a lot of beauty products, including toothpaste, body washes, facial scrubs, and makeup. Because of their small size, they don’t get filtered out at water treatment plants. Many animals also see microbeads as food and eat them. Look for plain products with exfoliants like salt or oatmeal to avoid ones with microbeads. Check the packaging before buying a product. Microbeads will be listed as an ingredient there. If you see colored specks in a product, you are probably looking at microbeads. Buy products in bulk to reduce the amount of plastic used. Small packs of nuts or yogurt, for instance, are convenient but not efficient. To reduce plastic waste, you’re better off buying a big container of what you need. Companies generally fit more of a product in bigger packages while using less plastic. One big package is better than several smaller ones. One way to take advantage of bulk food purchases is through canning. Store food inside a sterile container filled with syrup or brine. Canning is a way to preserve food for storage. Watch out for opportunities to use your own containers. For example, some grocery stores with bulk aisles or binned spices let you do this. Contact the store for their policies on bringing containers from home. Purchase items secondhand to reduce manufacturing waste. Check out local garage sales, secondhand stores, and online postings for deals. New items take resources to make and often come with a lot of additional plastic in the packaging. Toys and electronics are some of the worst offenders, but you can often get them used. Reuse plastic toys in particular so they don’t end up sitting in a landfill. The opposite applies if you have things to get rid of. Instead of throwing away toys, for instance, donate them. Sometimes you have no choice but to buy something new. Make sure you dispose of the plastic properly, including the wrapping, casing, and twist ties. Shop with companies that make an effort to reduce plastic waste. There are many companies that make products out of recycled plastic. Many more now are making an effort to cut back on waste like straws and cups. Check out how a product is manufactured before buying it. If you can, stay away from companies that aren’t socially responsible and don’t do a good job of cutting back on pollution. Research companies and products online. Read about the company’s manufacturing process and mission statement before making a purchase. Look online for environmentally-conscious groups. Let other people concerned about plastic waste direct you to responsible companies. Advocating and Volunteering Refuse plastic items when they are offered to you. Say no to plastic items you don’t need to use. It may not seem like a big deal, but that means one less piece of plastic wasted. You’re probably going to end up forgetting about it anyway if you’re not planning on using it. Say “No straw, please” when ordering a drink, for instance. Many places still offer items like utensils and plastic bags automatically. Be sure to speak up when you have the chance. Also, plan ahead to bring alternatives like reusable bags. Pick up any plastic trash you find lying around. Unfortunately, many people drop their plastic outdoors where it ends up harming the environment. It needs to be disposed of in a landfill. Keep a trash bag or an extra plastic bag with you at all times. When you see something, whether it’s a plastic wrapper or a soda bottle, store it in the bag until you are able to throw it in the trash. Search for volunteer organizations in your area that arrange clean-up days. If you don’t mind spending the day picking up plastic, work with other people to do some good for the environment. A great place to look for discarded plastic is when you’re out in nature, such as in a park or at the beach. However, you can help by picking up plastic no matter where you find it. Don’t forget to take care of your own plastic waste! If you’re prone to losing waste before getting it to a trash can, keep a storage bag available, such as in your car. Throw away plastic in trash cans. If you collect big bags brimming with plastic, take them to a landfill. Call local waste management services or departments to find the nearest one. Recycle any type of plastic that can be reused. Many garbage disposal services also offer plastic recycling. To use one, rinse out the plastic you want to get rid of, then put it in a garbage bag inside a recycling bin. Also, look for special recycling bins out in public. These are typically designed for bottles and other common plastic objects people carry. Ask the waste facility or your local waste management office what kind of plastic they accept. Not all plastic is recyclable. For example, polyvinyl chloride and polypropylene often aren’t accepted for recycling. That includes plastic packaging, food wrappers, furniture, and toys. Instruct other people about reducing and recycling waste. Become an expert on dealing with plastic. Share the information with your friends and post about it online, such as through social media. Try to educate as many people as possible so they also contribute to the cause. Plastic waste is a worldwide problem, so do your best to raise awareness. If you get one more person involved, that is one less source of plastic waste. They can also tell people they know to help spread the word. Teach people how to recycle, for instance, or share the problems caused by plastic waste. Let people know you’re serious about protecting the environment. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tConsider taking part in a month-long challenge to help spread awareness. Every January I do a 31 Day Challenge, and there are YouTube videos and blog posts every day. It's built to start you out with smaller steps, then work up to bigger ideas and principles. At the end, it has to do with getting involved with your community and your local government. Contact companies and officials about reducing plastic waste. If you have a mind for activism, ask companies about the amount of plastic waste they leave behind. Also, get in touch with local leaders about making changes. Ask them to institute measures like banning straws or bags. These changes have already begun happening in many areas because of the dedication of activists. Find other people to help out, such as people you know online or in your community. Change is more likely to happen when more people speak up. Find causes to champion, such as by raising awareness of a polluted local river. Some causes have a direct impact on your community, so people are more likely to take them seriously.",
  "tyn_model":[
    "straw",
    "plastic",
    "water",
    "cutlery",
    "containers",
    "toys",
    "reusable bags",
    "fabric",
    "utensils",
    "container",
    "sponges",
    "wipes",
    "reusable plastic bag",
    "bags",
    "coffee cups",
    "coffee",
    "tumbler",
    "coffee shop",
    "soap",
    "water bottle",
    "glass",
    "forks",
    "knives",
    "spoons",
    "food storage container",
    "bottles",
    "razor",
    "straight razor",
    "jars",
    "rags",
    "cleansers",
    "nuts",
    "yogurt",
    "canning",
    "spices",
    "“no",
    "” when",
    "trash bag",
    "plastic bag",
    "soda bottle",
    "garbage disposal services",
    "garbage bag",
    "waste management office",
    "polyvinyl chloride",
    "plastic waste",
    "zero waste\t\t\t\t\t\t\t\tkathryn"
  ],
  "tyn_section":[

  ]
}