{
  "title":"How to Hook Up a Generator",
  "url":"https://www.wikihow.com/Hook-Up-a-Generator",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Electrical Maintenance",
    "Motors Generators and Transformers"
  ],
  "methods":[
    {
      "name":"Using Different Types of Generators",
      "steps":[
        {
          "headline":"Plug into a gas-powered portable generator directly or connect it to a transfer switch.",
          "description":"If you lose power to your home or business, having a portable generator on hand can keep the appliances you need up and running. You can plug your portable generator into a transfer switch to bring power to a building or you can plug appliances or devices directly into it. They’re also much more affordable than other options and you can keep them in storage or in your garage until you need it. Gas-powered generators use either diesel or gasoline as fuel. Diesel-powered generators usually require fewer refills than gasoline, but can be more expensive."
        },
        {
          "headline":"Connect an inverter generator to a building or to appliances and devices.",
          "description":"Inverter generators automatically adjust the engine’s output up and down depending on how much energy is needed rather than running at full capacity at all times, like most gas-powered portable generators. But like gas-powered generators, they can be connected to a transfer switch to power a building or you can plug your appliances or devices directly into them. Inverter generators don’t need to be refueled as often, produce lower emissions, and are much quieter than other generators. You can use a small inverter generator to take tailgating or camping to power your electronic devices. They generally weigh about 50–60 pounds (23–27 kg)."
        },
        {
          "headline":"Install a standby generator to automatically restore power.",
          "description":"Standby generators run on natural gas and will automatically fire up whenever power is lost to your home or business so you won’t lose power. Standby generators are expensive and require professional installation, but they can power your entire home or business for the duration of the power outage.Tip: Because they have an automatic transfer switch, you don’t have to do anything to activate the standby generator if you lose power."
        }
      ]
    },
    {
      "name":"Connecting to a Transfer Switch",
      "steps":[
        {
          "headline":"Have an electrician install a manual transfer switch.",
          "description":"A transfer switch will allow you to plug in your portable or inverter generator to power your home or business in the event of an outage. In order to avoid dangerous backfeeding, you need a manual transfer switch that you can plug your generator into. To have the switch properly installed, have a reputable electrician install the transfer switch and the inlet box on the outside of the building. Do not attempt to install a transfer switch yourself. You could risk serious injury from electrocution. A cheaper alternative, known as an interlock device, can be installed to allow you to plug in your generator, but it should also be installed by an electrician."
        },
        {
          "headline":"Set up the generator at least 20 feet (6.1 m) from the building.",
          "description":"If you have a generator that isn’t permanently installed in a housing unit outside of your home or business, you need to place it far enough away to prevent any toxic fumes from entering the building. Be sure to point the exhaust ports on the generator away from any windows or doors. Generators are also very noisy and placing it far enough away can reduce the impact of the noise. They can also produce a lot of heat that you may not want near your home or business."
        },
        {
          "headline":"Plug the generator cord into the inlet box.",
          "description":"The power inlet box is a small metal box mounted on the outside of the building and is hardwired to the transfer switch. Connect the generator to the inlet box by plugging in the generator cord into the outlet. Many generators require you to push the plug into the outlet and then turn it clockwise in order to engage it."
        },
        {
          "headline":"Turn the circuit breakers in the transfer switch to the “Off” position.",
          "description":"Before you start the generator, you need to turn off all of the power from the utility by flipping the breakers. You don’t want to risk overloading the electrical system of your home or office. Flip all of the breakers in your home junction box to the opposite side so there isn’t any power flowing throw them."
        },
        {
          "headline":"Start up your generator.",
          "description":"Check the fuel gauge on your generator to make sure there’s enough fuel in it and make sure the circuit breaker on the generator is in the “Off” position before you start it. Turn the fuel valve to the “On” position when you’re ready to start it. Use the start switch or button to start the generator.Tip: If you don’t have an electric start generator, you need to pull start it. Flip the engine control switch to “On” or “Run,” grab the handle on the recoil rope, and pull it 1-2 times to start the generator."
        },
        {
          "headline":"Allow the generator to warm up then flip the circuit breaker back on.",
          "description":"Let the generator run for at least 5 minutes so it’s warmed up and ready to power your building. Then, switch the circuit breaker on the generator itself to the “On” position. In cold weather, you may need to let the generator run for a longer period of time to warm up. Check your owner’s manual to see how long you need to let the generator warm up."
        },
        {
          "headline":"Flip the breakers in the transfer switch to the “Generator” position.",
          "description":"The transfer switch is adjacent to your circuit breaker on the inside of the building. Once the generator is running, flip the breaker or dial on the transfer switch from either the “Utility” or “Off” position to the “Generator” position. The generator cannot power anything in the building unless the transfer switch is engaged in the correct position."
        },
        {
          "headline":"Turn on the circuits you want to power in your home junction box.",
          "description":"Flip the breakers 1 at a time so you don’t overload the generator. Wait at least 5 seconds after you flip 1 breaker before you turn on another. In order to conserve fuel and keep your generator running smoothly, only power the utilities and appliances that you need. If you flip a breaker and it kills your generator, start the process back over. Turn off all of the breakers and restart the generator before flipping the breakers back on."
        },
        {
          "headline":"Return the breakers to the “Utility” position when the power is back on.",
          "description":"When the power is restored to the building, flip the breaker on the transfer switch back to the “Utility” or “On” position. This will change over the power from the generator back to the main utility line. If power has been restored, there shouldn’t be any lapses in power when you return the breakers to the “On” or “Utility” position."
        },
        {
          "headline":"Turn off the generator and disconnect any cords.",
          "description":"After you’ve switched the power source back to the utility line, go ahead and turn off your generator to let it start to cool down so you can store it. Unplug any cords and replace the panel or cover on the transfer switch and power inlet so they’re secure. Allow the generator to cool down for at least 15 minutes before you move it to storage."
        }
      ]
    },
    {
      "name":"Plugging Directly into a Generator",
      "steps":[
        {
          "headline":"Connect directly to a generator if you don’t have a transfer switch.",
          "description":"If you lose power, you can connect your appliances and electronic devices directly to a generator. Never plug a generator directly into your home or business or you could back feed into the system and cause serious injury to anyone who works on the system. Be careful not to overload your generator by powering too many appliances or devices. It won’t damage your generator, but it will shut it off. Check the power needs of any appliances you want to power with your generator to make sure it can support it."
        },
        {
          "headline":"Place the generator away from windows, doors, and vents.",
          "description":"Portable generators can produce lots of carbon monoxide, which can be fatal if you breathe it in. Never use a generator indoors and place it at least 20 feet (6.1 m) away from buildings. Make sure the generator is placed on a dry surface to prevent electrocution.Warning: Keep your hands dry whenever you’re operating an electrical generator."
        },
        {
          "headline":"Check the generator’s fuel and oil levels.",
          "description":"Before you operate your generator, you need to make sure it has enough fuel to keep running and oil to keep it from overheating. The fuel guage is usually located on top of the generator. To check the oil, remove the oil cap and pull out the dipstick. There should be a line that tells you the proper amount of oil needed. Check the owner’s manual to make sure you have enough oil and to see what kind of oil you need to use if you need to add more."
        },
        {
          "headline":"Turn the breaker to the “Off” position.",
          "description":"If your generator has a circuit breaker on it, double check to make sure it isn’t switched on to avoid risking electrocution or shorting out a device. Until you’re ready to power something with your generator, keep the breaker switched off. Your generator may have a dial that you need to turn to the “Off” position."
        },
        {
          "headline":"Flip the fuel valve to the “On” position.",
          "description":"The fuel valve controls the flow of fuel to the generator’s engine and allows you to start it up. Before you start your generator, flip the colored control switch so that it’s vertical and in the “On” position."
        },
        {
          "headline":"Start your generator.",
          "description":"Once you’ve checked that the breaker is switched off and the fuel valve is switched on, press the start switch or button to fire up the generator. If your generator doesn’t have an electric start, grab the handle on the recoil rope, and give it 1-2 firm pulls to start up the generator. If the generator fails to start, pull the choke handle and try starting it again. You may have to adjust the choke in order to start the generator. Pull the handle out a little bit at a time and try to start the generator after each time."
        },
        {
          "headline":"Let the generator run for at least 5 minutes then flip the circuit breaker.",
          "description":"Allow the generator to warm up before you use it so it doesn’t sputter or get overloaded. Wait about 5 minutes, then flip the circuit breaker to the “On” position so you can start to use the generator to power your devices. Check the owner’s manual to see how long you need to let the generator run before you use it. Cold weather conditions may require you to let the generator run for longer to warm up properly."
        },
        {
          "headline":"Plug your devices into the generator.",
          "description":"Once your generator is running and the breaker is switched on, you can plug your electronic devices directly into the outlet on the generator. As long as there is enough fuel in the generator, you can power your devices for as long as you need to. Do not plug a surge protector or multi-plug into the generator to power multiple devices. You may overload the generator."
        }
      ]
    }
  ],
  "text":" Using Different Types of Generators Plug into a gas-powered portable generator directly or connect it to a transfer switch. If you lose power to your home or business, having a portable generator on hand can keep the appliances you need up and running. You can plug your portable generator into a transfer switch to bring power to a building or you can plug appliances or devices directly into it. They’re also much more affordable than other options and you can keep them in storage or in your garage until you need it. Gas-powered generators use either diesel or gasoline as fuel. Diesel-powered generators usually require fewer refills than gasoline, but can be more expensive. Connect an inverter generator to a building or to appliances and devices. Inverter generators automatically adjust the engine’s output up and down depending on how much energy is needed rather than running at full capacity at all times, like most gas-powered portable generators. But like gas-powered generators, they can be connected to a transfer switch to power a building or you can plug your appliances or devices directly into them. Inverter generators don’t need to be refueled as often, produce lower emissions, and are much quieter than other generators. You can use a small inverter generator to take tailgating or camping to power your electronic devices. They generally weigh about 50–60 pounds (23–27 kg). Install a standby generator to automatically restore power. Standby generators run on natural gas and will automatically fire up whenever power is lost to your home or business so you won’t lose power. Standby generators are expensive and require professional installation, but they can power your entire home or business for the duration of the power outage.Tip: Because they have an automatic transfer switch, you don’t have to do anything to activate the standby generator if you lose power. Connecting to a Transfer Switch Have an electrician install a manual transfer switch. A transfer switch will allow you to plug in your portable or inverter generator to power your home or business in the event of an outage. In order to avoid dangerous backfeeding, you need a manual transfer switch that you can plug your generator into. To have the switch properly installed, have a reputable electrician install the transfer switch and the inlet box on the outside of the building. Do not attempt to install a transfer switch yourself. You could risk serious injury from electrocution. A cheaper alternative, known as an interlock device, can be installed to allow you to plug in your generator, but it should also be installed by an electrician. Set up the generator at least 20 feet (6.1 m) from the building. If you have a generator that isn’t permanently installed in a housing unit outside of your home or business, you need to place it far enough away to prevent any toxic fumes from entering the building. Be sure to point the exhaust ports on the generator away from any windows or doors. Generators are also very noisy and placing it far enough away can reduce the impact of the noise. They can also produce a lot of heat that you may not want near your home or business. Plug the generator cord into the inlet box. The power inlet box is a small metal box mounted on the outside of the building and is hardwired to the transfer switch. Connect the generator to the inlet box by plugging in the generator cord into the outlet. Many generators require you to push the plug into the outlet and then turn it clockwise in order to engage it. Turn the circuit breakers in the transfer switch to the “Off” position. Before you start the generator, you need to turn off all of the power from the utility by flipping the breakers. You don’t want to risk overloading the electrical system of your home or office. Flip all of the breakers in your home junction box to the opposite side so there isn’t any power flowing throw them. Start up your generator. Check the fuel gauge on your generator to make sure there’s enough fuel in it and make sure the circuit breaker on the generator is in the “Off” position before you start it. Turn the fuel valve to the “On” position when you’re ready to start it. Use the start switch or button to start the generator.Tip: If you don’t have an electric start generator, you need to pull start it. Flip the engine control switch to “On” or “Run,” grab the handle on the recoil rope, and pull it 1-2 times to start the generator. Allow the generator to warm up then flip the circuit breaker back on. Let the generator run for at least 5 minutes so it’s warmed up and ready to power your building. Then, switch the circuit breaker on the generator itself to the “On” position. In cold weather, you may need to let the generator run for a longer period of time to warm up. Check your owner’s manual to see how long you need to let the generator warm up. Flip the breakers in the transfer switch to the “Generator” position. The transfer switch is adjacent to your circuit breaker on the inside of the building. Once the generator is running, flip the breaker or dial on the transfer switch from either the “Utility” or “Off” position to the “Generator” position. The generator cannot power anything in the building unless the transfer switch is engaged in the correct position. Turn on the circuits you want to power in your home junction box. Flip the breakers 1 at a time so you don’t overload the generator. Wait at least 5 seconds after you flip 1 breaker before you turn on another. In order to conserve fuel and keep your generator running smoothly, only power the utilities and appliances that you need. If you flip a breaker and it kills your generator, start the process back over. Turn off all of the breakers and restart the generator before flipping the breakers back on. Return the breakers to the “Utility” position when the power is back on. When the power is restored to the building, flip the breaker on the transfer switch back to the “Utility” or “On” position. This will change over the power from the generator back to the main utility line. If power has been restored, there shouldn’t be any lapses in power when you return the breakers to the “On” or “Utility” position. Turn off the generator and disconnect any cords. After you’ve switched the power source back to the utility line, go ahead and turn off your generator to let it start to cool down so you can store it. Unplug any cords and replace the panel or cover on the transfer switch and power inlet so they’re secure. Allow the generator to cool down for at least 15 minutes before you move it to storage. Plugging Directly into a Generator Connect directly to a generator if you don’t have a transfer switch. If you lose power, you can connect your appliances and electronic devices directly to a generator. Never plug a generator directly into your home or business or you could back feed into the system and cause serious injury to anyone who works on the system. Be careful not to overload your generator by powering too many appliances or devices. It won’t damage your generator, but it will shut it off. Check the power needs of any appliances you want to power with your generator to make sure it can support it. Place the generator away from windows, doors, and vents. Portable generators can produce lots of carbon monoxide, which can be fatal if you breathe it in. Never use a generator indoors and place it at least 20 feet (6.1 m) away from buildings. Make sure the generator is placed on a dry surface to prevent electrocution.Warning: Keep your hands dry whenever you’re operating an electrical generator. Check the generator’s fuel and oil levels. Before you operate your generator, you need to make sure it has enough fuel to keep running and oil to keep it from overheating. The fuel guage is usually located on top of the generator. To check the oil, remove the oil cap and pull out the dipstick. There should be a line that tells you the proper amount of oil needed. Check the owner’s manual to make sure you have enough oil and to see what kind of oil you need to use if you need to add more. Turn the breaker to the “Off” position. If your generator has a circuit breaker on it, double check to make sure it isn’t switched on to avoid risking electrocution or shorting out a device. Until you’re ready to power something with your generator, keep the breaker switched off. Your generator may have a dial that you need to turn to the “Off” position. Flip the fuel valve to the “On” position. The fuel valve controls the flow of fuel to the generator’s engine and allows you to start it up. Before you start your generator, flip the colored control switch so that it’s vertical and in the “On” position. Start your generator. Once you’ve checked that the breaker is switched off and the fuel valve is switched on, press the start switch or button to fire up the generator. If your generator doesn’t have an electric start, grab the handle on the recoil rope, and give it 1-2 firm pulls to start up the generator. If the generator fails to start, pull the choke handle and try starting it again. You may have to adjust the choke in order to start the generator. Pull the handle out a little bit at a time and try to start the generator after each time. Let the generator run for at least 5 minutes then flip the circuit breaker. Allow the generator to warm up before you use it so it doesn’t sputter or get overloaded. Wait about 5 minutes, then flip the circuit breaker to the “On” position so you can start to use the generator to power your devices. Check the owner’s manual to see how long you need to let the generator run before you use it. Cold weather conditions may require you to let the generator run for longer to warm up properly. Plug your devices into the generator. Once your generator is running and the breaker is switched on, you can plug your electronic devices directly into the outlet on the generator. As long as there is enough fuel in the generator, you can power your devices for as long as you need to. Do not plug a surge protector or multi-plug into the generator to power multiple devices. You may overload the generator.",
  "tyn_model":[
    "generator",
    "” position",
    "generators",
    "“on",
    "“off",
    "circuit breaker",
    "” or",
    "“utility",
    "oil",
    "breaker",
    "portable generator",
    "gas-powered generators",
    "inverter generator",
    "inverter generators",
    "electrician",
    "“generator",
    "gas-powered portable generator",
    "gasoline",
    "gas-powered portable generators",
    "generator cord",
    "electric start generator",
    "“run",
    "” grab",
    "breakers",
    "carbon monoxide",
    "electrical generator",
    "recoil rope",
    "surge protector"
  ],
  "tyn_section":[

  ]
}