{
  "title":"How to Make Buttercream Icing",
  "url":"https://www.wikihow.com/Make-Buttercream-Icing",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Making French Buttercream Icing",
      "steps":[
        {
          "headline":"Heat the sugar, water, and cream of tarter in a pot on medium heat with a candy thermometer.",
          "description":"You cannot skip the thermometer -- you need to know when exactly to take the sugar syrup off the heat. The cream of tarter is not essential, but will lead to a smoother frosting. 1-2 tablespoons of light corn syrup can help with this as well, and can be added with the tarter or alone."
        },
        {
          "headline":"Put the egg yolks and whole egg in a stand mixer with a whisk and beat on high.",
          "description":"Using an auto mixer, such as a Kitchenaid, whip the eggs on high. The eggs will foam up and get to the “ribbon stage.” This means that when you run your spatula through the eggs and lift up, the eggs will run down in a ribbon that settles on top of the egg mixture. You can't over whip the eggs! Just keep them going. You will not need the whites of the eggs after separating. They can be discarded."
        },
        {
          "headline":"Test the sugar syrup temperature, removing from heat at 230F.",
          "description":"Use a candy thermometer to gauge the temperature. It should reach 230 degrees Fahrenheit (“soft ball” stage). As soon as it hits this temp, take it off the heat and turn off the burner. If the temperature exceeds 230 degrees, the mixture will reach the \"firm ball\" or \"hard ball\" stage. In these stages, the sugar syrup mixture will start to hold its shape if made into a ball. It won't be spreadable as icing anymore."
        },
        {
          "headline":"Slowly pour the sugar syrup into the egg mixture.",
          "description":"Aim somewhere between the moving whisk and the side of the bowl, so it incorporates slowly without splatter. Be very careful and slow when pouring the sugar syrup into the egg mixture. Keep the mixer running as you pour. It’s crucial that you pour very slowly. Otherwise, the hot sugar syrup will start to cook the eggs in the bowl."
        },
        {
          "headline":"Continue adding the syrup, letting the mixer beat until the side of the bowl is cool.",
          "description":"You want the mixture to keep moving until the sugar syrup loses all it's heat and the metal bowl is cool to the touch, especially on the bottom. Add a pinch of salt when done, if desired -- this will help bring out the richness of the eggs."
        },
        {
          "headline":"Add the room temperature butter in small cubes.",
          "description":"Cut the butter into small pieces and add slowly into the syrup-egg mixture. It is a pain in the butt, but you really should add it one small, 1\" cube at a time. If the butter is added all at once, it won’t mix well with the eggs and you’ll have chunky icing. You're creating an emulsion -- or mixture of two things that don't want to mix. It takes time. Keep the butter out on the counter to soften as you work. This way, when you add it, it will mix in much more easily. It’s best if you use a paddle attachment with your stand mixer for this step. The whisk may have trouble mixing the butter with the rest of the mixture."
        },
        {
          "headline":"Add flavorings if you want and stir lightly.",
          "description":"Once the frosting is all well-mixed and fluffy, it is the time to flavor your frosting if you so choose. Add 2-3 teaspoons of cocoa powder, almond extract, vanilla, lemon juice, or other flavors, mix them in thoroughly, and you're done."
        },
        {
          "headline":"Store this frosting immediately in the fridge.",
          "description":"The raw egg in the icing, though not harmful, will go bad out in the open. Unlike classic buttercreams, this frosting must be refrigerated. You may need to whip it again before using to get a light consistency again."
        }
      ]
    },
    {
      "name":"Making Basic Buttercream Icing",
      "steps":[
        {
          "headline":"Soften the butter to room temperature.",
          "description":"Use good quality salted butter, as the bit of salt is essential to bring out the full flavor of your icing. Leave the butter out of the fridge for an hour so that it will soften. It should give freely under your finger when pressed. Note. it doesn't need to be liquid -- just soft. If your butter has been in the fridge, defrost it in the microwave for about 15 seconds, using 5-second bursts to ensure it doesn't liquefy. Another way to soften butter is to cut it up into small pieces and place next to a warm stove. Smaller chunks of butter will soften more quickly."
        },
        {
          "headline":"Cream the butter with a hand mixer, stand mixer, or wooden spoon.",
          "description":"Use a low speed to mix up the butter, using the paddle attachment. Scrape the sides of the bowl to make sure that all of the butter is mixed together. Beat for about 3 minutes, or until the butter is light and fluffy. Using a wooden spoon is hard work, but not impossible. Basically, you want to keep working and beating the butter until it is a nice, airy mixture."
        },
        {
          "headline":"Add powdered sugar.",
          "description":"Slowly add the sifted powdered sugar to the butter. Use a hand mixer at low speed to mix it together with the butter, keeping it moving as you add the sugar slowly. It can help to divide up the sugar first, adding only a fourth or a third at a time. Powdered sugar can me sold as icing sugar or confectioner’s sugar, as well."
        },
        {
          "headline":"Add the vanilla to the mix.",
          "description":"Vanilla is added next. Keep mixing the icing with your hand mixer. Don't worry about adding it slowly -- just toss it in. You can use imitation vanilla in a pinch, but real vanilla is always a better choice."
        },
        {
          "headline":"Add cream by the tablespoonful, adjusting based on your desired texture.",
          "description":"When you add cream to your icing, add it in one tablespoonful at a time. Mix up the icing after each time you add more milk. This will help you see how thick or thin your icing is getting. More cream leads to a more whipped icing, less leads to something more firm. If you don't have cream, use whole milk in order to ensure at least some creaminess and richness. Some recipes call for heavy cream, which can be used for an extra rich icing."
        },
        {
          "headline":"Thicken or thin the icing with more cream or sugar.",
          "description":"Depending on how thick your icing is, you may choose to thicken it up more or thin it out. Add a tablespoon of powdered sugar to thicken the icing. If you need to thin out the icing, add another tablespoon of milk. Continue to mix the icing to make sure your addition is integrated into the mix. Mix the icing until it is light and fluffy. It should be easy to spread on a cake but not so runny that it slides off the cake."
        },
        {
          "headline":"Store buttercream icing in the refrigerator.",
          "description":"Put the icing in an airtight container to store in the refrigerator. Do not store it next to fragrant foods, such as onions or fish. Store for up to 2 weeks. If you want it for a longer time, you can keep it in the freezer for up to three months. Store cakes with buttercream icing at room temperature for 2-3 days, max. Cakes that have icing on them can be stored at room temperature for 2-3 days."
        },
        {
          "headline":"Warm up cooled buttercream icing to room temperature after storing.",
          "description":"Bring the icing out of the refrigerator and warm it up to room temperature. Stir it well with a spatula or use a hand mixer. The texture may not be as good as when you originally made the buttercream icing, but it will be close. Add a tablespoonful of powdered sugar to thicken up the icing if necessary."
        }
      ]
    },
    {
      "name":"Variations on the Classic Recipes",
      "steps":[
        {
          "headline":"Add meringue powder for firmer icing, useful for decorating.",
          "description":"You might choose to add meringue powder if you need to stabilize your icing. This is useful if your cake is going to be sitting at a warm temperature, such as at an outdoor summer birthday party, or you want to create more intricate, structured designs. Add 2 teaspoons of meringue powder to your icing mix. along with the vanilla, beating in like normal."
        },
        {
          "headline":"Make chocolate buttercream icing.",
          "description":"After you add the powdered sugar, mix in 2-3 teaspoons of unsweetened cocoa powder. Add in milk and beat thoroughly. You can use regular or dark cocoa powder, depending on your taste."
        },
        {
          "headline":"Make coffee-flavored icing.",
          "description":"Use the basic buttercream icing recipe. Brew some strong coffee and allow it to cool, or use a teaspoon of instant coffee mixture. You could also use coffee liquor, like a Kahlua. The three methods are:\nAdd 1 tablespoon of cocoa powder and one of instant coffee when you add the powdered sugar. Use cold coffee in place of 1/4 of the cream. You still need a little cream to make buttercream frosting, of course. Add 1-2 tablespoons of coffee liquor in place of some of the cream."
        },
        {
          "headline":"Make rum buttercream icing.",
          "description":"Use the basic buttercream icing recipe. Add 2 teaspoons of dark rum to the mixture. Put the rum in the mixture when you add the milk. This also goes well with a little bit of spice, like a hint of cinnamon or even a touch of maple syrup."
        },
        {
          "headline":"Make lemon icing.",
          "description":"Use the basic buttercream icing recipe and add 2 teaspoons of lemon zest. Add in 2 teaspoons of lemon juice. Orange zest and juice can also be substituted for a deliciously citrus icing."
        },
        {
          "headline":"Make a delicious vegan buttercream icing that uses neither butter nor cream.",
          "description":"Those avoiding animal products don't have to be left out of all the fun! This simple recipe is put together the exact same way as the original -- beat the margarine, add sugar slowly, then flavor with vanilla and thing with rice or coconut milk. 1 cup of Vegan Margarine\n3 teaspoons of vanilla\n4 cups of icing or powdered sugar\n1-3 tsp of rice milk"
        }
      ]
    }
  ],
  "text":" Making French Buttercream Icing Heat the sugar, water, and cream of tarter in a pot on medium heat with a candy thermometer. You cannot skip the thermometer -- you need to know when exactly to take the sugar syrup off the heat. The cream of tarter is not essential, but will lead to a smoother frosting. 1-2 tablespoons of light corn syrup can help with this as well, and can be added with the tarter or alone. Put the egg yolks and whole egg in a stand mixer with a whisk and beat on high. Using an auto mixer, such as a Kitchenaid, whip the eggs on high. The eggs will foam up and get to the “ribbon stage.” This means that when you run your spatula through the eggs and lift up, the eggs will run down in a ribbon that settles on top of the egg mixture. You can't over whip the eggs! Just keep them going. You will not need the whites of the eggs after separating. They can be discarded. Test the sugar syrup temperature, removing from heat at 230F. Use a candy thermometer to gauge the temperature. It should reach 230 degrees Fahrenheit (“soft ball” stage). As soon as it hits this temp, take it off the heat and turn off the burner. If the temperature exceeds 230 degrees, the mixture will reach the \"firm ball\" or \"hard ball\" stage. In these stages, the sugar syrup mixture will start to hold its shape if made into a ball. It won't be spreadable as icing anymore. Slowly pour the sugar syrup into the egg mixture. Aim somewhere between the moving whisk and the side of the bowl, so it incorporates slowly without splatter. Be very careful and slow when pouring the sugar syrup into the egg mixture. Keep the mixer running as you pour. It’s crucial that you pour very slowly. Otherwise, the hot sugar syrup will start to cook the eggs in the bowl. Continue adding the syrup, letting the mixer beat until the side of the bowl is cool. You want the mixture to keep moving until the sugar syrup loses all it's heat and the metal bowl is cool to the touch, especially on the bottom. Add a pinch of salt when done, if desired -- this will help bring out the richness of the eggs. Add the room temperature butter in small cubes. Cut the butter into small pieces and add slowly into the syrup-egg mixture. It is a pain in the butt, but you really should add it one small, 1\" cube at a time. If the butter is added all at once, it won’t mix well with the eggs and you’ll have chunky icing. You're creating an emulsion -- or mixture of two things that don't want to mix. It takes time. Keep the butter out on the counter to soften as you work. This way, when you add it, it will mix in much more easily. It’s best if you use a paddle attachment with your stand mixer for this step. The whisk may have trouble mixing the butter with the rest of the mixture. Add flavorings if you want and stir lightly. Once the frosting is all well-mixed and fluffy, it is the time to flavor your frosting if you so choose. Add 2-3 teaspoons of cocoa powder, almond extract, vanilla, lemon juice, or other flavors, mix them in thoroughly, and you're done. Store this frosting immediately in the fridge. The raw egg in the icing, though not harmful, will go bad out in the open. Unlike classic buttercreams, this frosting must be refrigerated. You may need to whip it again before using to get a light consistency again. Making Basic Buttercream Icing Soften the butter to room temperature. Use good quality salted butter, as the bit of salt is essential to bring out the full flavor of your icing. Leave the butter out of the fridge for an hour so that it will soften. It should give freely under your finger when pressed. Note. it doesn't need to be liquid -- just soft. If your butter has been in the fridge, defrost it in the microwave for about 15 seconds, using 5-second bursts to ensure it doesn't liquefy. Another way to soften butter is to cut it up into small pieces and place next to a warm stove. Smaller chunks of butter will soften more quickly. Cream the butter with a hand mixer, stand mixer, or wooden spoon. Use a low speed to mix up the butter, using the paddle attachment. Scrape the sides of the bowl to make sure that all of the butter is mixed together. Beat for about 3 minutes, or until the butter is light and fluffy. Using a wooden spoon is hard work, but not impossible. Basically, you want to keep working and beating the butter until it is a nice, airy mixture. Add powdered sugar. Slowly add the sifted powdered sugar to the butter. Use a hand mixer at low speed to mix it together with the butter, keeping it moving as you add the sugar slowly. It can help to divide up the sugar first, adding only a fourth or a third at a time. Powdered sugar can me sold as icing sugar or confectioner’s sugar, as well. Add the vanilla to the mix. Vanilla is added next. Keep mixing the icing with your hand mixer. Don't worry about adding it slowly -- just toss it in. You can use imitation vanilla in a pinch, but real vanilla is always a better choice. Add cream by the tablespoonful, adjusting based on your desired texture. When you add cream to your icing, add it in one tablespoonful at a time. Mix up the icing after each time you add more milk. This will help you see how thick or thin your icing is getting. More cream leads to a more whipped icing, less leads to something more firm. If you don't have cream, use whole milk in order to ensure at least some creaminess and richness. Some recipes call for heavy cream, which can be used for an extra rich icing. Thicken or thin the icing with more cream or sugar. Depending on how thick your icing is, you may choose to thicken it up more or thin it out. Add a tablespoon of powdered sugar to thicken the icing. If you need to thin out the icing, add another tablespoon of milk. Continue to mix the icing to make sure your addition is integrated into the mix. Mix the icing until it is light and fluffy. It should be easy to spread on a cake but not so runny that it slides off the cake. Store buttercream icing in the refrigerator. Put the icing in an airtight container to store in the refrigerator. Do not store it next to fragrant foods, such as onions or fish. Store for up to 2 weeks. If you want it for a longer time, you can keep it in the freezer for up to three months. Store cakes with buttercream icing at room temperature for 2-3 days, max. Cakes that have icing on them can be stored at room temperature for 2-3 days. Warm up cooled buttercream icing to room temperature after storing. Bring the icing out of the refrigerator and warm it up to room temperature. Stir it well with a spatula or use a hand mixer. The texture may not be as good as when you originally made the buttercream icing, but it will be close. Add a tablespoonful of powdered sugar to thicken up the icing if necessary. Variations on the Classic Recipes Add meringue powder for firmer icing, useful for decorating. You might choose to add meringue powder if you need to stabilize your icing. This is useful if your cake is going to be sitting at a warm temperature, such as at an outdoor summer birthday party, or you want to create more intricate, structured designs. Add 2 teaspoons of meringue powder to your icing mix. along with the vanilla, beating in like normal. Make chocolate buttercream icing. After you add the powdered sugar, mix in 2-3 teaspoons of unsweetened cocoa powder. Add in milk and beat thoroughly. You can use regular or dark cocoa powder, depending on your taste. Make coffee-flavored icing. Use the basic buttercream icing recipe. Brew some strong coffee and allow it to cool, or use a teaspoon of instant coffee mixture. You could also use coffee liquor, like a Kahlua. The three methods are:\nAdd 1 tablespoon of cocoa powder and one of instant coffee when you add the powdered sugar. Use cold coffee in place of 1/4 of the cream. You still need a little cream to make buttercream frosting, of course. Add 1-2 tablespoons of coffee liquor in place of some of the cream. Make rum buttercream icing. Use the basic buttercream icing recipe. Add 2 teaspoons of dark rum to the mixture. Put the rum in the mixture when you add the milk. This also goes well with a little bit of spice, like a hint of cinnamon or even a touch of maple syrup. Make lemon icing. Use the basic buttercream icing recipe and add 2 teaspoons of lemon zest. Add in 2 teaspoons of lemon juice. Orange zest and juice can also be substituted for a deliciously citrus icing. Make a delicious vegan buttercream icing that uses neither butter nor cream. Those avoiding animal products don't have to be left out of all the fun! This simple recipe is put together the exact same way as the original -- beat the margarine, add sugar slowly, then flavor with vanilla and thing with rice or coconut milk. 1 cup of Vegan Margarine\n3 teaspoons of vanilla\n4 cups of icing or powdered sugar\n1-3 tsp of rice milk",
  "tyn_model":[
    "butter",
    "eggs",
    "cream",
    "vanilla",
    "buttercream icing",
    "sugar syrup",
    "sugar",
    "powdered sugar",
    "milk",
    "bowl",
    "hand mixer",
    "stand mixer",
    "whisk",
    "cocoa powder",
    "meringue powder",
    "cream of tarter",
    "candy thermometer",
    "egg",
    "spatula",
    "mixer",
    "salt",
    "lemon juice",
    "wooden spoon",
    "instant coffee",
    "coffee liquor",
    "french buttercream icing",
    "water",
    "light corn syrup",
    "tarter",
    "“ribbon",
    "” this",
    "“soft",
    "” stage",
    "burner",
    "almond extract",
    "salted butter",
    "microwave",
    "icing sugar",
    "confectioner’s sugar",
    "icing",
    "airtight container",
    "freezer",
    "refrigerator",
    "chocolate buttercream icing",
    "unsweetened cocoa powder",
    "buttercream frosting",
    "rum buttercream icing",
    "dark rum",
    "rum",
    "maple syrup",
    "lemon icing",
    "lemon zest",
    "orange zest",
    "margarine",
    "rice or",
    "coconut milk",
    "vegan margarine",
    "icing or powdered sugar",
    "rice milk"
  ],
  "tyn_section":[

  ]
}