{
  "title":"How to Use a League Pushing Deck in Clash Royale",
  "url":"https://www.wikihow.com/Use-a-League-Pushing-Deck-in-Clash-Royale",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Strategy Video Games",
    "Clash Royale"
  ],
  "parts":[
    {
      "name":"Working With Golem Beatdown",
      "steps":[
        {
          "headline":"Get Golem Beatdown.",
          "description":"Possessing one of the favorite Clash Royale cards, Golem Beatdown is  perhaps one of the most popular and well-known decks in the game. It typically consists of Golem, Lumberjack, Night Witch, Baby Dragon, Elixir Pump, Mega Minion, Lightning, and another spell, like Clone, Log, or Zap. This is a beatdown style deck, and is usually made to 3 crown players."
        },
        {
          "headline":"Play Golem Beatdown.",
          "description":"Golem Beatdown is typically best during double-elixir, as a Golem Beatdown deck is typically around a 4.4-4.6 elixir average, and needs lots of elixir to make. In the first 2 minutes, the deck is mainly defense, using cards like Lumberjack, Baby Dragon, and Mega Minion to defend, as well as Lightning if necessary. But the fun begins in double elixir. You want to start a Golem on the tile right behind your King Tower. Once you reach 8 elixir, you want to place down your Lumberjack and Night Witch behind the Golem. Once another 4 elixir is gained, you want to put you Baby Dragon behind all of this. The next move is up to you - you can Lightning, place down a Mega Minion, or even place down another Golem and repeat the cycle. The choice you make is dependent on what your opponent has on the ground at that moment."
        },
        {
          "headline":"Avoid using these cards to defend.",
          "description":"Know your end results, and pick your card. Inferno Dragons and Towers are almost always useless. Once your tower is focused on the Golem, it can no longer destroy the Bats from the Night Witch, and those Bats distract your Inferno Dragon or Tower, allowing your opponent's support troops to destroy it. P.E.K.K.A. is a pretty good card to counter Golem Beatdown, but even with extreme health, it will usually get destroyed by the support troops, but not before destroying all of the ground support troops and getting a few hits off the Golem. Any other troop besides P.E.K.K.A. is much too weak to defend against the push, and will likely get destroyed almost instantly. Even if that troop does survive, chances are they will go for the Golem, leaving your opponent's support troops relatively unharmed, unless it's a melee splash ground troop like a Valkyrie."
        },
        {
          "headline":"Defend against a Golem Beatdown push.",
          "description":"This is one of the toughest pushes to defend against, especially if you don't have a P.E.K.K.A. in your deck. You will almost always take damage, and what I've found is that the best deck to defend against this is Valkyrie Log-Bait. You first want to place a Princess behind your King Tower, on the opposite lane that you're opponent is rushing, once the Golem is around halfway across your opponent's side of the arena. Place down an Inferno Tower in the middle of your side of the arena, which will drag the Golem. After this, you will want to Rocket any of the support troops, as long as their total elixir is more than 6. Otherwise, you should place down a Valkyrie. Finally, if it's necessary, place down a Goblin Gang to protect against any other remaining troops from the Golem Beatdown push, so they don't do any damage to your tower."
        }
      ]
    },
    {
      "name":"Working With Hog Cycle",
      "steps":[
        {
          "headline":"Get Hog Cycle.",
          "description":"Aiming at a 2.6 elixir average, Hog Cycle is one of the classic meta 1-crown decks, and is almost impossible to defend against without a building. Hog Cycle consists of the Hog Rider, Musketeer, Cannon, Fireball, Ice Golem, Ice Spirit, Skeletons, and either Log or Zap."
        },
        {
          "headline":"Play Hog Cycle.",
          "description":"There really isn't much to it. The main point is just to keep cycling a push with Ice Golem Hog Zap/Log, which is just an Ice Golem in front of a Hog Rider at the bridge, with a Zap or Log being hovered, ready to deploy. To defend, you usually want to place a Musketeer behind your Arena Tower, place a Cannon in the middle of your side of the arena, wait until the support troops are focused on the Cannon, then Fireball+Zap/Log them. Then you just use the Ice Spirit and Skeletons to defend against the almost-dead tank."
        },
        {
          "headline":"Avoid using these cards to defend.",
          "description":"Don't use cards like Baby Dragon or Ice Wizard that slowly kill Hog Riders, as every time the Hog Rider gets a hit, it's basically 10% of your tower health gone. The Hog Rider is a fast card, and will likely run away from the troop(s) you place down, like Knights and Valkyrie. The Ice Golem will do enough Death Damage to troops like Minion Horde of Goblins to where they can be Zapped and die."
        },
        {
          "headline":"Defend against Hog Cycle.",
          "description":"Hog Cycle isn't that hard to defend against half the time, but the other half, it's really hard. The counter to Hog Cycle is once again, Valkyrie Log-Bait. Since Valkyrie-Log Bait has more swarm troops than Hog Cycle has spells, and it has Rocket and Inferno Tower, Hog Cycle is basically useless. You typically want to bait out their possible Log or Zap with a Goblin Barrel at their tower. Then you can place down a Goblin Gang on top of the Ice Golem and an Inferno Tower in the middle of your side of the arena, which will drag the Hog Rider. Or, you can always rocket their push, and get a fair elixir trade."
        }
      ]
    },
    {
      "name":"Working With P.E.K.K.A. Ram",
      "steps":[
        {
          "headline":"Get P.E.K.K.A Ram.",
          "description":"Unmistakably useful at almost any arena, P.E.K.K.A Ram is one of the best decks, as long as you have the cards. It can get any amount of towers, dependent on the opponent. It's also one of the easiest decks to upgrade, since people almost always use cards like P.E.K.K.A. or Zap, in lower arenas and will result in those cards being easier to upgrade to max level in the future. P.E.K.K.A. Ram consists of P.E.K.K.A., Battle Ram, Zap, Poison, Bandit, Royal Ghost, Electro Wizard, and Minions."
        },
        {
          "headline":"Up your game with a P.E.K.K.A Ram deck.",
          "description":"P.E.K.K.A Ram decks are typically meant to play 2 different ways- To make a huge push the opponent can't stop, or to punish the opponent for dropping a high-elixir card. This is one of the best defense decks, as many of the cards are low-elixir, which allows them to be incredibly versatile. This deck, like almost all the others, works best in double elixir."
        },
        {
          "headline":"Push smartly.",
          "description":"While making a push, you want to:\nPlace your P.E.K.K.A. behind your king tower, as soon as you reach 10 elixir. Once you reach 9 elixir, place down your Bandit and Electro Wizard. This should leave you with elixir to spare. You then want to place down your Battle Ram, once you reach 4 elixir. The next choice is up to you - you can place down Poison to counter any Goblin Gangs, Skeleton Armies, or Minion Hordes. You can place down a Royal Ghost for more damage. You can place down your Minions for extra air support. The choice is entirely up to what your opponent does. You can even place another P.E.K.K.A. once it's cycled!"
        },
        {
          "headline":"Deal with your opponents.",
          "description":"While punishing the opponent, you want to:\nPlace your P.E.K.K.A. behind your king tower, as soon as you reach 10 elixir. Once you reach 8 elixir, you want to place down your Electro Wizard and Royal Ghost behind the P.E.K.K.A. Your opponent is most likely going to spend a heavy elixir card to counter your push. So as they're focused on this push...\nYou want to rush the opposite lane with Battle Ram, Bandit, and Minions. Once you reach 2 elixir, make sure you hover a Zap over your punishing push, to counter any Goblin Gangs, Skeleton Armies, or Minion Hordes. In the other lane that you pushed with the P.E.K.K.A., your opponent's counter-push will be severely weakened, and should be easy to defend against."
        },
        {
          "headline":"Avoid using these cards to defend.",
          "description":"Inferno Towers and Dragons are useless, due to the Electro Wizard and Zap, which can counter your Inferno Tower/Dragon while support troops can kill it. Poison will counter any swarm troops you place. Mega Knights will push all support troops away, and will become focused on the P.E.K.K.A., allowing your opponent's support troops to attack it."
        },
        {
          "headline":"Defend against a P.E.K.K.A Ram push.",
          "description":"P.E.K.K.A. Ram is more difficult to counter, as you typically can't place down a troops and just hope it defends. One great defensive option is a Giant Skeleton and Inferno Tower/Inferno Dragon. The Giant Skeleton's bomb will destroy all cards, while the Inferno Tower/Inferno Dragon finishes the P.E.K.K.A. off. Another is a simple Rocket and Inferno Tower/Dragon. Basically the same defense as above, the Rocket substituting for the Giant Skeleton bomb."
        }
      ]
    }
  ],
  "text":" Working With Golem Beatdown Get Golem Beatdown. Possessing one of the favorite Clash Royale cards, Golem Beatdown is  perhaps one of the most popular and well-known decks in the game. It typically consists of Golem, Lumberjack, Night Witch, Baby Dragon, Elixir Pump, Mega Minion, Lightning, and another spell, like Clone, Log, or Zap. This is a beatdown style deck, and is usually made to 3 crown players. Play Golem Beatdown. Golem Beatdown is typically best during double-elixir, as a Golem Beatdown deck is typically around a 4.4-4.6 elixir average, and needs lots of elixir to make. In the first 2 minutes, the deck is mainly defense, using cards like Lumberjack, Baby Dragon, and Mega Minion to defend, as well as Lightning if necessary. But the fun begins in double elixir. You want to start a Golem on the tile right behind your King Tower. Once you reach 8 elixir, you want to place down your Lumberjack and Night Witch behind the Golem. Once another 4 elixir is gained, you want to put you Baby Dragon behind all of this. The next move is up to you - you can Lightning, place down a Mega Minion, or even place down another Golem and repeat the cycle. The choice you make is dependent on what your opponent has on the ground at that moment. Avoid using these cards to defend. Know your end results, and pick your card. Inferno Dragons and Towers are almost always useless. Once your tower is focused on the Golem, it can no longer destroy the Bats from the Night Witch, and those Bats distract your Inferno Dragon or Tower, allowing your opponent's support troops to destroy it. P.E.K.K.A. is a pretty good card to counter Golem Beatdown, but even with extreme health, it will usually get destroyed by the support troops, but not before destroying all of the ground support troops and getting a few hits off the Golem. Any other troop besides P.E.K.K.A. is much too weak to defend against the push, and will likely get destroyed almost instantly. Even if that troop does survive, chances are they will go for the Golem, leaving your opponent's support troops relatively unharmed, unless it's a melee splash ground troop like a Valkyrie. Defend against a Golem Beatdown push. This is one of the toughest pushes to defend against, especially if you don't have a P.E.K.K.A. in your deck. You will almost always take damage, and what I've found is that the best deck to defend against this is Valkyrie Log-Bait. You first want to place a Princess behind your King Tower, on the opposite lane that you're opponent is rushing, once the Golem is around halfway across your opponent's side of the arena. Place down an Inferno Tower in the middle of your side of the arena, which will drag the Golem. After this, you will want to Rocket any of the support troops, as long as their total elixir is more than 6. Otherwise, you should place down a Valkyrie. Finally, if it's necessary, place down a Goblin Gang to protect against any other remaining troops from the Golem Beatdown push, so they don't do any damage to your tower. Working With Hog Cycle Get Hog Cycle. Aiming at a 2.6 elixir average, Hog Cycle is one of the classic meta 1-crown decks, and is almost impossible to defend against without a building. Hog Cycle consists of the Hog Rider, Musketeer, Cannon, Fireball, Ice Golem, Ice Spirit, Skeletons, and either Log or Zap. Play Hog Cycle. There really isn't much to it. The main point is just to keep cycling a push with Ice Golem Hog Zap/Log, which is just an Ice Golem in front of a Hog Rider at the bridge, with a Zap or Log being hovered, ready to deploy. To defend, you usually want to place a Musketeer behind your Arena Tower, place a Cannon in the middle of your side of the arena, wait until the support troops are focused on the Cannon, then Fireball+Zap/Log them. Then you just use the Ice Spirit and Skeletons to defend against the almost-dead tank. Avoid using these cards to defend. Don't use cards like Baby Dragon or Ice Wizard that slowly kill Hog Riders, as every time the Hog Rider gets a hit, it's basically 10% of your tower health gone. The Hog Rider is a fast card, and will likely run away from the troop(s) you place down, like Knights and Valkyrie. The Ice Golem will do enough Death Damage to troops like Minion Horde of Goblins to where they can be Zapped and die. Defend against Hog Cycle. Hog Cycle isn't that hard to defend against half the time, but the other half, it's really hard. The counter to Hog Cycle is once again, Valkyrie Log-Bait. Since Valkyrie-Log Bait has more swarm troops than Hog Cycle has spells, and it has Rocket and Inferno Tower, Hog Cycle is basically useless. You typically want to bait out their possible Log or Zap with a Goblin Barrel at their tower. Then you can place down a Goblin Gang on top of the Ice Golem and an Inferno Tower in the middle of your side of the arena, which will drag the Hog Rider. Or, you can always rocket their push, and get a fair elixir trade. Working With P.E.K.K.A. Ram Get P.E.K.K.A Ram. Unmistakably useful at almost any arena, P.E.K.K.A Ram is one of the best decks, as long as you have the cards. It can get any amount of towers, dependent on the opponent. It's also one of the easiest decks to upgrade, since people almost always use cards like P.E.K.K.A. or Zap, in lower arenas and will result in those cards being easier to upgrade to max level in the future. P.E.K.K.A. Ram consists of P.E.K.K.A., Battle Ram, Zap, Poison, Bandit, Royal Ghost, Electro Wizard, and Minions. Up your game with a P.E.K.K.A Ram deck. P.E.K.K.A Ram decks are typically meant to play 2 different ways- To make a huge push the opponent can't stop, or to punish the opponent for dropping a high-elixir card. This is one of the best defense decks, as many of the cards are low-elixir, which allows them to be incredibly versatile. This deck, like almost all the others, works best in double elixir. Push smartly. While making a push, you want to:\nPlace your P.E.K.K.A. behind your king tower, as soon as you reach 10 elixir. Once you reach 9 elixir, place down your Bandit and Electro Wizard. This should leave you with elixir to spare. You then want to place down your Battle Ram, once you reach 4 elixir. The next choice is up to you - you can place down Poison to counter any Goblin Gangs, Skeleton Armies, or Minion Hordes. You can place down a Royal Ghost for more damage. You can place down your Minions for extra air support. The choice is entirely up to what your opponent does. You can even place another P.E.K.K.A. once it's cycled! Deal with your opponents. While punishing the opponent, you want to:\nPlace your P.E.K.K.A. behind your king tower, as soon as you reach 10 elixir. Once you reach 8 elixir, you want to place down your Electro Wizard and Royal Ghost behind the P.E.K.K.A. Your opponent is most likely going to spend a heavy elixir card to counter your push. So as they're focused on this push...\nYou want to rush the opposite lane with Battle Ram, Bandit, and Minions. Once you reach 2 elixir, make sure you hover a Zap over your punishing push, to counter any Goblin Gangs, Skeleton Armies, or Minion Hordes. In the other lane that you pushed with the P.E.K.K.A., your opponent's counter-push will be severely weakened, and should be easy to defend against. Avoid using these cards to defend. Inferno Towers and Dragons are useless, due to the Electro Wizard and Zap, which can counter your Inferno Tower/Dragon while support troops can kill it. Poison will counter any swarm troops you place. Mega Knights will push all support troops away, and will become focused on the P.E.K.K.A., allowing your opponent's support troops to attack it. Defend against a P.E.K.K.A Ram push. P.E.K.K.A. Ram is more difficult to counter, as you typically can't place down a troops and just hope it defends. One great defensive option is a Giant Skeleton and Inferno Tower/Inferno Dragon. The Giant Skeleton's bomb will destroy all cards, while the Inferno Tower/Inferno Dragon finishes the P.E.K.K.A. off. Another is a simple Rocket and Inferno Tower/Dragon. Basically the same defense as above, the Rocket substituting for the Giant Skeleton bomb.",
  "tyn_model":[
    "golem",
    "inferno tower",
    "ice golem",
    "zap",
    "rocket",
    "hog",
    "battle ram",
    "poison",
    "bandit",
    "electro wizard",
    "golem beatdown",
    "lightning",
    "elixir",
    "lumberjack",
    "night witch",
    "valkyrie",
    "goblin",
    "hog rider",
    "musketeer",
    "cannon",
    "ice spirit",
    "skeletons",
    "elixir pump",
    "log",
    "baby dragon",
    "mega minion",
    "inferno dragons",
    "towers",
    "inferno dragon",
    "fireball",
    "ice wizard",
    "goblins",
    "barrel",
    "goblin gang",
    "ram",
    "cards",
    "minions",
    "royal ghost",
    "skeleton",
    "dragon",
    "giant skeleton bomb"
  ],
  "tyn_section":[

  ]
}