{
  "title":"How to Tell if Ground Beef Has Gone Bad",
  "url":"https://www.wikihow.com/Tell-if-Ground-Beef-Has-Gone-Bad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Beef and Lamb"
  ],
  "methods":[
    {
      "name":"Inspecting the Beef",
      "steps":[
        {
          "headline":"Check to see if it has turned a dull brown or grey.",
          "description":"Fresh beef will be bright red in color, but it may have a few brown spots in the middle since ground beef is taken from different parts of the cow. Your ground beef will turn more grey the longer you keep it. If all of your beef is grey rather than red or brown, it’s best to throw it away. Prepackaged ground beef develops a brown color on the inside because oxygen is not able to reach the center."
        },
        {
          "headline":"Smell the beef to see if you notice a sour smell.",
          "description":"Fresh beef will have a slight smell, but beef starting to go bad will smell rotten or sour. The smell is produced from gases made by some of the bacteria on your beef. If there is a strong smell, avoid eating it. Many bacteria that cause food-borne illnesses like salmonella cannot be smelled and can be found on fresh beef. Always cook the beef thoroughly to kill bacteria. If you don’t feel comfortable eating the beef, throw it away."
        },
        {
          "headline":"Touch the meat to see if it feels slimy.",
          "description":"Squeeze the meat in your fingers to feel its consistency. Fresh meat should break apart in your hands easily and separate into chunks. If the meat is sticky or has a slimy texture, it has most likely gone bad. Always wash your hands before and after you handle raw beef so you don’t spread bacteria or contaminate surfaces."
        },
        {
          "headline":"Check the sell-by date on the packaging.",
          "description":"Raw ground beef is safe to use only 1 or 2 days after the recommended sell-by date. Check the calendar to determine how many days have passed since you bought it and throw it away if it’s old."
        }
      ]
    },
    {
      "name":"Storing Ground Beef Properly",
      "steps":[
        {
          "headline":"Store uncooked ground beef in the refrigerator at or below 40 °F (4 °C).",
          "description":"If you plan to cook the beef soon, store it in your refrigerator. Beef left out at room temperature will start to harbor harmful bacteria colonies within 2 hours. Never leave meat out for longer than 2 hours at room temperature, or for more than 1 hour if it is above 90 °F (32 °C). If you don’t plan to cook your beef right away, freeze it."
        },
        {
          "headline":"Cook the beef within 2 days of the sell-by date.",
          "description":"If the beef has been in a refrigerator the whole time, it will stay fresh and safe to use up to 2 days after the date listed on the packaging. Make sure you use the beef soon after you buy it so it doesn’t go to waste."
        },
        {
          "headline":"Keep raw beef in the freezer for up to 4 months.",
          "description":"Keep the beef in freezer-safe plastic bags and label them with the sell-by date listed on the packaging. Squeeze all the air out of the bag before sealing it to conserve freezer space. You may start to notice white freezer spots on the beef after a few months. These areas can be cut off if there are only a few. Otherwise, throw the meat away."
        },
        {
          "headline":"Thaw the beef in the fridge or in a sink filled with cold water.",
          "description":"Transfer the frozen beef to the fridge 1 to 2 days before you plan to use it so it has time to completely thaw. If you want to thaw the meat in the sink, fill your sink with cold water and submerge the beef. Change the water every 30 minutes until it’s completely thawed. Beef thawed with water needs to be cooked right away. Never leave the meat to thaw at room temperature. Beef can be thawed in the microwave but it needs to be cooked right after it’s finished thawing to avoid any contamination."
        },
        {
          "headline":"Cook ground beef to 160 °F (71 °C) before storing or eating it.",
          "description":"The only way to kill the natural bacteria in your beef is to cook it entirely. Use a meat thermometer to check the internal temperature of the meat while you’re cooking it."
        },
        {
          "headline":"Store cooked ground beef in the refrigerator or freezer.",
          "description":"Cooked ground beef can be safely stored in the fridge for 7 days before it starts to spoil. It can also be stored for up to 8 months in the freezer. Be sure to store it in an air-tight container!"
        }
      ]
    }
  ],
  "text":" Inspecting the Beef Check to see if it has turned a dull brown or grey. Fresh beef will be bright red in color, but it may have a few brown spots in the middle since ground beef is taken from different parts of the cow. Your ground beef will turn more grey the longer you keep it. If all of your beef is grey rather than red or brown, it’s best to throw it away. Prepackaged ground beef develops a brown color on the inside because oxygen is not able to reach the center. Smell the beef to see if you notice a sour smell. Fresh beef will have a slight smell, but beef starting to go bad will smell rotten or sour. The smell is produced from gases made by some of the bacteria on your beef. If there is a strong smell, avoid eating it. Many bacteria that cause food-borne illnesses like salmonella cannot be smelled and can be found on fresh beef. Always cook the beef thoroughly to kill bacteria. If you don’t feel comfortable eating the beef, throw it away. Touch the meat to see if it feels slimy. Squeeze the meat in your fingers to feel its consistency. Fresh meat should break apart in your hands easily and separate into chunks. If the meat is sticky or has a slimy texture, it has most likely gone bad. Always wash your hands before and after you handle raw beef so you don’t spread bacteria or contaminate surfaces. Check the sell-by date on the packaging. Raw ground beef is safe to use only 1 or 2 days after the recommended sell-by date. Check the calendar to determine how many days have passed since you bought it and throw it away if it’s old. Storing Ground Beef Properly Store uncooked ground beef in the refrigerator at or below 40 °F (4 °C). If you plan to cook the beef soon, store it in your refrigerator. Beef left out at room temperature will start to harbor harmful bacteria colonies within 2 hours. Never leave meat out for longer than 2 hours at room temperature, or for more than 1 hour if it is above 90 °F (32 °C). If you don’t plan to cook your beef right away, freeze it. Cook the beef within 2 days of the sell-by date. If the beef has been in a refrigerator the whole time, it will stay fresh and safe to use up to 2 days after the date listed on the packaging. Make sure you use the beef soon after you buy it so it doesn’t go to waste. Keep raw beef in the freezer for up to 4 months. Keep the beef in freezer-safe plastic bags and label them with the sell-by date listed on the packaging. Squeeze all the air out of the bag before sealing it to conserve freezer space. You may start to notice white freezer spots on the beef after a few months. These areas can be cut off if there are only a few. Otherwise, throw the meat away. Thaw the beef in the fridge or in a sink filled with cold water. Transfer the frozen beef to the fridge 1 to 2 days before you plan to use it so it has time to completely thaw. If you want to thaw the meat in the sink, fill your sink with cold water and submerge the beef. Change the water every 30 minutes until it’s completely thawed. Beef thawed with water needs to be cooked right away. Never leave the meat to thaw at room temperature. Beef can be thawed in the microwave but it needs to be cooked right after it’s finished thawing to avoid any contamination. Cook ground beef to 160 °F (71 °C) before storing or eating it. The only way to kill the natural bacteria in your beef is to cook it entirely. Use a meat thermometer to check the internal temperature of the meat while you’re cooking it. Store cooked ground beef in the refrigerator or freezer. Cooked ground beef can be safely stored in the fridge for 7 days before it starts to spoil. It can also be stored for up to 8 months in the freezer. Be sure to store it in an air-tight container!",
  "tyn_model":[
    "beef",
    "ground beef",
    "refrigerator",
    "water",
    "freezer",
    "freezer-safe plastic bags",
    "cold water",
    "microwave",
    "meat thermometer",
    "air-tight container"
  ],
  "tyn_section":[

  ]
}