{
  "title":"How to Make a Simple Spaceship in Tinkercad",
  "url":"https://www.wikihow.com/Make-a-Simple-Spaceship-in-Tinkercad",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Digital Technology Art and Craft Projects"
  ],
  "parts":[
    {
      "name":"Adding the Cylinder",
      "steps":[
        {
          "headline":"Left click and drag a cylinder onto the work-plane.",
          "description":""
        },
        {
          "headline":"Click and drag the elevation triangle up to 8mm off the work-plane.",
          "description":"The elevation triangle can be located either above or below the selected shape."
        }
      ]
    },
    {
      "name":"Adding a Paraboloid",
      "steps":[
        {
          "headline":"Drag a paraboloid onto the work-plane.",
          "description":""
        },
        {
          "headline":"Click and drag the elevation triangle to 25mm.",
          "description":""
        }
      ]
    },
    {
      "name":"Aligning the Shapes",
      "steps":[
        {
          "headline":"Use Ctrl+A on the keyboard to select all.",
          "description":""
        },
        {
          "headline":"Click on the Align tab.",
          "description":""
        },
        {
          "headline":"Click the middle dot on each side of the object.",
          "description":""
        }
      ]
    },
    {
      "name":"Grouping the Shapes",
      "steps":[
        {
          "headline":"Use Ctrl+A on the keyboard to select all.",
          "description":""
        },
        {
          "headline":"Use the Group icon to merge the shapes into one object.",
          "description":""
        }
      ]
    },
    {
      "name":"Creating the Spaceship Fins",
      "steps":[
        {
          "headline":"Drag a roof onto the workplane.",
          "description":""
        },
        {
          "headline":"Rotate 135 degrees (-135 or 135 is fine).",
          "description":"Make sure your elevation is 0 once you have finished rotating your shape."
        },
        {
          "headline":"Change dimensions to 14 L x 2 W x 15 H. Do this by clicking and dragging the white squares on the corners of the object, or click on one of the white squares, and type the numbers into the boxes.",
          "description":""
        },
        {
          "headline":"Clone the fin.",
          "description":"You currently have one fin. Use the Duplicate and repeat tool to clone it (the new one appears on top of the duplicated one)."
        },
        {
          "headline":"Use the Mirror tool to change this fin's direction by using the arrow on the long side.",
          "description":"You now have two fins, but you need to have four, and the next two have to face another direction."
        },
        {
          "headline":"Use the Duplicate and repeat tool again.",
          "description":"This time use the curved arrow on the work plane to rotate this fin 90 degrees."
        },
        {
          "headline":"Use the Mirror tool to change this fin's direction.",
          "description":""
        },
        {
          "headline":"Click and drag each fin to its spot on the spaceship.",
          "description":""
        }
      ]
    },
    {
      "name":"Grouping the Shapes",
      "steps":[
        {
          "headline":"Use Ctrl+A on the keyboard to select all.",
          "description":""
        },
        {
          "headline":"Use the Group icon to merge the shapes into one object.",
          "description":""
        }
      ]
    },
    {
      "name":"Creating Portals",
      "steps":[
        {
          "headline":"Drag a torus onto the workplane.",
          "description":""
        },
        {
          "headline":"Change the dimensions to 10 x 2.5 x 10.",
          "description":""
        },
        {
          "headline":"Use the curved arrow above the shape and rotate to 90 degrees.",
          "description":""
        },
        {
          "headline":"Drag the elevation triangle up to 14mm.",
          "description":""
        },
        {
          "headline":"Use the Duplicate and repeat tool to create another portal.",
          "description":""
        },
        {
          "headline":"Place portals on either side of your ship.",
          "description":"If you're finding that you're having trouble placing your portals over the fins, use the Ungroup tool (next to the Group tool) to separate the fins from the shape, and move the fins farther into the ship."
        }
      ]
    },
    {
      "name":"Grouping Shapes",
      "steps":[
        {
          "headline":"Use Ctrl+A on the keyboard to select all.",
          "description":""
        },
        {
          "headline":"Use the Group icon to merge the two shapes into one object.",
          "description":""
        },
        {
          "headline":"Congratulations - you did it!",
          "description":"Now find a 3D printer and make it reality!"
        }
      ]
    }
  ],
  "text":" Adding the Cylinder Left click and drag a cylinder onto the work-plane.  Click and drag the elevation triangle up to 8mm off the work-plane. The elevation triangle can be located either above or below the selected shape. Adding a Paraboloid Drag a paraboloid onto the work-plane.  Click and drag the elevation triangle to 25mm.  Aligning the Shapes Use Ctrl+A on the keyboard to select all.  Click on the Align tab.  Click the middle dot on each side of the object.  Grouping the Shapes Use Ctrl+A on the keyboard to select all.  Use the Group icon to merge the shapes into one object.  Creating the Spaceship Fins Drag a roof onto the workplane.  Rotate 135 degrees (-135 or 135 is fine). Make sure your elevation is 0 once you have finished rotating your shape. Change dimensions to 14 L x 2 W x 15 H. Do this by clicking and dragging the white squares on the corners of the object, or click on one of the white squares, and type the numbers into the boxes.  Clone the fin. You currently have one fin. Use the Duplicate and repeat tool to clone it (the new one appears on top of the duplicated one). Use the Mirror tool to change this fin's direction by using the arrow on the long side. You now have two fins, but you need to have four, and the next two have to face another direction. Use the Duplicate and repeat tool again. This time use the curved arrow on the work plane to rotate this fin 90 degrees. Use the Mirror tool to change this fin's direction.  Click and drag each fin to its spot on the spaceship.  Grouping the Shapes Use Ctrl+A on the keyboard to select all.  Use the Group icon to merge the shapes into one object.  Creating Portals Drag a torus onto the workplane.  Change the dimensions to 10 x 2.5 x 10.  Use the curved arrow above the shape and rotate to 90 degrees.  Drag the elevation triangle up to 14mm.  Use the Duplicate and repeat tool to create another portal.  Place portals on either side of your ship. If you're finding that you're having trouble placing your portals over the fins, use the Ungroup tool (next to the Group tool) to separate the fins from the shape, and move the fins farther into the ship. Grouping Shapes Use Ctrl+A on the keyboard to select all.  Use the Group icon to merge the two shapes into one object.  Congratulations - you did it! Now find a 3D printer and make it reality!",
  "tyn_model":[
    "cylinder",
    "paraboloid",
    "mirror",
    "torus",
    "portals",
    "3d printer"
  ],
  "tyn_section":[

  ]
}