{
  "title":"How to Photograph a Waterfall",
  "url":"https://www.wikihow.com/Photograph-a-Waterfall",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photography Genres",
    "Outdoor Photography"
  ],
  "parts":[
    {
      "name":"Setting Up at Your Location",
      "steps":[
        {
          "headline":"Shoot early in the day or late in the afternoon so the lighting is softer.",
          "description":"Light is a huge element in any photograph, and you’ll need to know how it will affect your shot. Specifics such as the direction of light, brightness, and color can all dramatically change the photograph. By shooting early in the morning or late into in the afternoon, you can ensure that the light is softer and less direct, making for a better enviroment to take quality photos. You can still shoot waterfalls in the middle of the day, but making sure that you have even lighting, may prove more difficult. If the waterfall you intend shoot faces in an easterly direction, the light will most directly affect your shot in the morning. Direct sunlight can cause a series of unwanted distortions to your shot. Try shooting in the late afternoon or evening to negate these effects. Similarly speaking, a westerly facing waterfall might have the best lighting at sunrise."
        },
        {
          "headline":"Choose a day where the weather is cloudy, and the air is still.",
          "description":"Clouds drastically cut back on significant contrast and shadow that a sunny day provides. Avoiding windy days will keep the surrounding trees and greenery from appearing blurred as they sway in the wind during long exposures. If you find yourself with a series of photos where some aspects came out great, but others are a bit blurry, look into image stacking, which can be used to combine images digitally for a clearer picture."
        },
        {
          "headline":"Use a camera with settings that can be adjusted manually.",
          "description":"You don’t need a top-of-the-line camera to take top-of-the-line photos. Both film and digital cameras are capable of capturing beautiful images. Ideally, you want to use a camera where you can adjust settings such as your aperture, ISO, and shutter speed. The more ways you can adjust to what nature is giving you, the more you’ll be able to capitalize on good photo opportunities."
        },
        {
          "headline":"Use a sturdy tripod.",
          "description":"Having a tripod is essential for shooting waterfalls, as you can’t entirely eliminate hand tremors or shaking in your muscles. The long exposures require that you find a sturdy surface upon which to mount your tripod, even if that surface is the riverbed. A steady tripod will save you hours of frustration. Don’t be afraid to take some quick sample shots at varying depths and distances before you set up your tripod. This will give you a general idea on where to shoot from. Don’t shy away from picking up and setting up your tripod in a totally new location. You may have a tendency to stay in one place once you’re all set up, but a new angle might give you the perfect shot you’re looking for. Check the feet on your tripod to see if there are spikes underneath. Often, tripods will have small spikes under the rubber feet which can aide in ensuring your tripod stays put. To properly set up your tripod legs, start from the top most extenders, and work your way down as needed. Some of the best shots can be taken from the water itself. By getting in the water, you can approach the waterfall for a closer shot and shoot from a lower vantage point."
        },
        {
          "headline":"Protect yourself and your equipment.",
          "description":"Make sure to watch your footing and check for changing weather conditions. Keep liquid from getting into your camera by investing in a rain sleeve, use sealed plastic bags for accessories, and pack microfiber cloths for cleaning or wicking away water."
        }
      ]
    },
    {
      "name":"Taking Your Best Shots",
      "steps":[
        {
          "headline":"Shoot in manual mode.",
          "description":"While there is a multitude of excellent automatic settings built-in to cameras these days, shooting waterfalls takes a bit more finesse. Even if you are new to manually adjusting your camera settings, now is a great time to learn."
        },
        {
          "headline":"Adjust your shutter speed as necessary to create the desired effect.",
          "description":"Only you know whether you want to create a long, silky, almost creamy look from the waterfall you’re shooting. Or perhaps you want the detail of the water to feature more prominently. Play with multiple shutter speeds to see which one produces the best shot for you. For larger waterfalls with lots of flowing water, shutter speeds from ¼ of a second to one second should be a long enough of an exposure to capture the motion of the running water, without blurring the finer details. For shorter, smaller waterfalls, exposures lasting several seconds can produce that stringy, silky, all-together textural appearance."
        },
        {
          "headline":"Lower your ISO setting as low as it goes.",
          "description":"Your ISO setting is your camera sensor’s ability to capture light as it passes through the aperture and shutter openings. Low ISO settings usually equate to a higher quality photo when it comes to shooting waterfalls. ISO settings on digital cameras today commonly go as low as 100."
        },
        {
          "headline":"Change your aperture to a higher f/ number (f-stop).",
          "description":"Your aperture controls the depth of field and is often referred to as “lens speed.” By choosing a higher f/ number, you are decreasing the size of the aperture lens. A higher f/ number decreases the amount of light traveling through the lens while the shutter is open. Adjusting these settings is useful in determining whether you wish to include surrounding objects in your photo or focus mainly on the waterfall. The higher the f/ setting, the greater your depth of field. Lower f/ settings are typically used in portrait photography."
        },
        {
          "headline":"Use a filter to adjust for ambient glare or harsher light.",
          "description":"By using a circular polarizing filter, you can cut down on glare, just like a pair of polarized sunglasses do the same. A neutral density filter (or ND filter) will help slow your shutter speed down even further and is great for shooting in bright light or heavy water currents. Consider eliminating the sky from the frame. The sky can compromise your exposure if it is particularly bright. Conversely, an extremely gray and cloudy sky might detract from the waterfall’s beauty."
        },
        {
          "headline":"Take a lot of photos.",
          "description":"Whether your shooting digitally, or with film, take a good number of shots. If you’re shooting with film, you don’t have the luxury of seeing your photos before they’re developed, but by taking lots of photos at different settings, you can see which worked well and which didn’t. If you're shooting digitally, you're limited only by the size of your memory card. Taking lots of photos will allow you to appreciate your successes and learn from any mistakes."
        }
      ]
    }
  ],
  "text":" Setting Up at Your Location Shoot early in the day or late in the afternoon so the lighting is softer. Light is a huge element in any photograph, and you’ll need to know how it will affect your shot. Specifics such as the direction of light, brightness, and color can all dramatically change the photograph. By shooting early in the morning or late into in the afternoon, you can ensure that the light is softer and less direct, making for a better enviroment to take quality photos. You can still shoot waterfalls in the middle of the day, but making sure that you have even lighting, may prove more difficult. If the waterfall you intend shoot faces in an easterly direction, the light will most directly affect your shot in the morning. Direct sunlight can cause a series of unwanted distortions to your shot. Try shooting in the late afternoon or evening to negate these effects. Similarly speaking, a westerly facing waterfall might have the best lighting at sunrise. Choose a day where the weather is cloudy, and the air is still. Clouds drastically cut back on significant contrast and shadow that a sunny day provides. Avoiding windy days will keep the surrounding trees and greenery from appearing blurred as they sway in the wind during long exposures. If you find yourself with a series of photos where some aspects came out great, but others are a bit blurry, look into image stacking, which can be used to combine images digitally for a clearer picture. Use a camera with settings that can be adjusted manually. You don’t need a top-of-the-line camera to take top-of-the-line photos. Both film and digital cameras are capable of capturing beautiful images. Ideally, you want to use a camera where you can adjust settings such as your aperture, ISO, and shutter speed. The more ways you can adjust to what nature is giving you, the more you’ll be able to capitalize on good photo opportunities. Use a sturdy tripod. Having a tripod is essential for shooting waterfalls, as you can’t entirely eliminate hand tremors or shaking in your muscles. The long exposures require that you find a sturdy surface upon which to mount your tripod, even if that surface is the riverbed. A steady tripod will save you hours of frustration. Don’t be afraid to take some quick sample shots at varying depths and distances before you set up your tripod. This will give you a general idea on where to shoot from. Don’t shy away from picking up and setting up your tripod in a totally new location. You may have a tendency to stay in one place once you’re all set up, but a new angle might give you the perfect shot you’re looking for. Check the feet on your tripod to see if there are spikes underneath. Often, tripods will have small spikes under the rubber feet which can aide in ensuring your tripod stays put. To properly set up your tripod legs, start from the top most extenders, and work your way down as needed. Some of the best shots can be taken from the water itself. By getting in the water, you can approach the waterfall for a closer shot and shoot from a lower vantage point. Protect yourself and your equipment. Make sure to watch your footing and check for changing weather conditions. Keep liquid from getting into your camera by investing in a rain sleeve, use sealed plastic bags for accessories, and pack microfiber cloths for cleaning or wicking away water. Taking Your Best Shots Shoot in manual mode. While there is a multitude of excellent automatic settings built-in to cameras these days, shooting waterfalls takes a bit more finesse. Even if you are new to manually adjusting your camera settings, now is a great time to learn. Adjust your shutter speed as necessary to create the desired effect. Only you know whether you want to create a long, silky, almost creamy look from the waterfall you’re shooting. Or perhaps you want the detail of the water to feature more prominently. Play with multiple shutter speeds to see which one produces the best shot for you. For larger waterfalls with lots of flowing water, shutter speeds from ¼ of a second to one second should be a long enough of an exposure to capture the motion of the running water, without blurring the finer details. For shorter, smaller waterfalls, exposures lasting several seconds can produce that stringy, silky, all-together textural appearance. Lower your ISO setting as low as it goes. Your ISO setting is your camera sensor’s ability to capture light as it passes through the aperture and shutter openings. Low ISO settings usually equate to a higher quality photo when it comes to shooting waterfalls. ISO settings on digital cameras today commonly go as low as 100. Change your aperture to a higher f/ number (f-stop). Your aperture controls the depth of field and is often referred to as “lens speed.” By choosing a higher f/ number, you are decreasing the size of the aperture lens. A higher f/ number decreases the amount of light traveling through the lens while the shutter is open. Adjusting these settings is useful in determining whether you wish to include surrounding objects in your photo or focus mainly on the waterfall. The higher the f/ setting, the greater your depth of field. Lower f/ settings are typically used in portrait photography. Use a filter to adjust for ambient glare or harsher light. By using a circular polarizing filter, you can cut down on glare, just like a pair of polarized sunglasses do the same. A neutral density filter (or ND filter) will help slow your shutter speed down even further and is great for shooting in bright light or heavy water currents. Consider eliminating the sky from the frame. The sky can compromise your exposure if it is particularly bright. Conversely, an extremely gray and cloudy sky might detract from the waterfall’s beauty. Take a lot of photos. Whether your shooting digitally, or with film, take a good number of shots. If you’re shooting with film, you don’t have the luxury of seeing your photos before they’re developed, but by taking lots of photos at different settings, you can see which worked well and which didn’t. If you're shooting digitally, you're limited only by the size of your memory card. Taking lots of photos will allow you to appreciate your successes and learn from any mistakes.",
  "tyn_model":[
    "tripod",
    "water",
    "camera",
    "film",
    "waterfall",
    "image stacking",
    "tripods",
    "cameras",
    "“lens",
    "” by",
    "filter",
    "polarizing filter",
    "polarized sunglasses",
    "neutral density filter",
    "nd filter"
  ],
  "tyn_section":[

  ]
}