{
  "title":"How to Store Vegetables in the Fridge",
  "url":"https://www.wikihow.com/Store-Vegetables-in-the-Fridge",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Storing Leafy Greens in Containers",
      "steps":[
        {
          "headline":"Rinse and dry leafy greens when you bring them home.",
          "description":"Leafy greens include lettuce, bok choy, chard, kale, and spinach. Even if the greens are pre-washed, it’s a good idea to rinse them again. You can dry them with a salad spinner or blot them with paper towels."
        },
        {
          "headline":"Put your greens in a container with paper towels.",
          "description":"Line a plastic storage container with paper towels, put the greens on top, and then cover it with another layer of paper towels. Seal the lid on top. Don’t stuff the salad greens in too tightly. While other storage methods work for salad greens, the container and paper towel method will help keep them fresh a little longer."
        },
        {
          "headline":"Keep the greens in the fridge for up to a week.",
          "description":"Kale and collards last up to a week, while most lettuces only last 3-5 days. Go through your fridge regularly to check that your greens are still fresh. When greens go bad, they turn a little brown and get a slimy texture. Consider freezing kale or spinach to last longer. Other greens don’t freeze as well."
        }
      ]
    },
    {
      "name":"Refrigerating Cruciferous and Stem Vegetables",
      "steps":[
        {
          "headline":"Store broccoli, cauliflower, cabbage, and turnips in plastic in the vegetable crisper.",
          "description":"Wrap these veggies in loose plastic, like a partially open plastic bag or perforated plastic. Make sure to keep your broccoli in the fridge, not on the counter, because it will deteriorate in warm temperatures. Put them in the vegetable crisper drawer, if there’s room. Broccoli and cauliflower will last about a week in the fridge, while cabbage turnips will last at least 2. They also freeze well, if you need them to last longer."
        },
        {
          "headline":"Wrap celery in aluminum foil and put it in the fridge.",
          "description":"Wrap the foil around the celery to keep the water inside so your celery doesn’t go limp. Don’t crimp the edge of the foil shut, so that the ripening gas that celery produces can escape. Don’t put your celery in the freezer, because it will be all mushy when you defrost it."
        },
        {
          "headline":"Keep asparagus in a glass of water in the fridge.",
          "description":"Trim 1 inch (2.5 cm) off the bottoms of your asparagus. Stand the asparagus up in a jar with 1 inch (2.5 cm) or water. If you don’t have a jar handy, you can also use any kind of glass or measuring cup. Make sure all the asparagus ends are in the water. If you want, you can loosely cover the asparagus tops in plastic wrap to keep out odors, but you don’t have to. The  asparagus should stay fresh for up to 7 days."
        },
        {
          "headline":"Sprinkle your artichoke stems in water and refrigerate them in plastic.",
          "description":"Slice a very thin sliver off the end of your artichoke stems and sprinkle the ends in water. Wrap the whole artichokes in plastic bags, and then put them in your fridge.Artichokes will last up to 5 days, but they’re best when eaten within a day or two of when you bought them."
        },
        {
          "headline":"Wrap leeks in a damp paper towel and plastic before refrigerating them.",
          "description":"The damp paper towel will help keep your leeks fresh, and the perforated plastic bag will contain the moisture. Don’t put your leeks in the fridge unwrapped, because their odor will be absorbed by other items in your fridge. Don’t trim or wash your leeks before storing them. The leeks should stay fresh for about 10 days."
        }
      ]
    },
    {
      "name":"Dealing with Roots, Bulbs, and Tubers",
      "steps":[
        {
          "headline":"Put carrots in a container of water in the fridge.",
          "description":"Trim off the leafy carrot tops and then place your carrots into a plastic container. Fill the container with water until the carrots are completely covered. Put the lid on the container, and then place the container in the fridge. Change the water every 4-5 days. Carrots can last up to a month when stored this way."
        },
        {
          "headline":"Store beets in the vegetable crisper in a perforated plastic bag.",
          "description":"Place your beets in a plastic bag and slice holes in the bag, if they did not already come in perforated plastic. Then, place the bag in the vegetable crisper drawer of your fridge, which is the high-humidity drawer. Beets will last in the refrigerator for 1-3 months."
        },
        {
          "headline":"Keep potatoes  and sweet potatoes in a cool dry place with ventilation.",
          "description":"Good places to keep potatoes include basements, cellars, pantries, and kitchen cabinets. It’s best to leave the potatoes in the mesh bags they came in because they need ventilation to stay fresh. Don’t wash your potatoes before storage. Don’t keep potatoes in the fridge, because it’s too cold for them."
        },
        {
          "headline":"Put onions, shallots, and garlic in a cool, dry place.",
          "description":"Store them on the counter or in a kitchen cabinet, as long as the cabinet doesn’t seal air-tight. Leave them in the mesh ventilated bag them come in, rather than putting them in an air-tight container. Green onions, on the other hand, belong in the fridge."
        }
      ]
    },
    {
      "name":"Storing Vegetables That Are Actually Fruits",
      "steps":[
        {
          "headline":"Keep cucumbers, zucchini, eggplant, and bell peppers on the counter for better flavor.",
          "description":"Though it might seem counterintuitive, these veggies actually taste much better when they are stored on your counter. If you’re afraid that they are about to start rotting, you can put them in the fridge, but it’s best to regularly buy them fresh and eat them within a few days. If you must keep them in the fridge, leave them there for no more than 3 days. You can also freeze cucumbers for longer storage."
        },
        {
          "headline":"Place tomatoes on the counter until they’re overripe.",
          "description":"Tomatoes do best at about 55 °F (13 °C) which is, unfortunately, warmer than most fridges and cooler than most rooms. Keep them on the counter when they’re under-ripe or ripe, and move them to the fridge if they get a little squishy. You can use squishy tomatoes in sauces and soups."
        },
        {
          "headline":"Ripen avocados on the counter and then put them in the fruit crisper.",
          "description":"When avocados are ripe they give slightly to the touch and the skin is black. At this point, you can either eat them or put them in the fridge. Keep avocados in the fruit drawer of your fridge, which is the crisper drawer with lower humidity. Don’t put avocados in the fridge before they ripen, because they’ll stay hard."
        },
        {
          "headline":"Keep corn on the cob in a plastic bag in the vegetable crisper drawer.",
          "description":"Leave corn on the cob in its husk, if you bought it with the husk still on. Put the cobs in a plastic bag, seal the bag, and leave it in the vegetable crisper drawer. Your corn should last a week."
        }
      ]
    }
  ],
  "text":" Storing Leafy Greens in Containers Rinse and dry leafy greens when you bring them home. Leafy greens include lettuce, bok choy, chard, kale, and spinach. Even if the greens are pre-washed, it’s a good idea to rinse them again. You can dry them with a salad spinner or blot them with paper towels. Put your greens in a container with paper towels. Line a plastic storage container with paper towels, put the greens on top, and then cover it with another layer of paper towels. Seal the lid on top. Don’t stuff the salad greens in too tightly. While other storage methods work for salad greens, the container and paper towel method will help keep them fresh a little longer. Keep the greens in the fridge for up to a week. Kale and collards last up to a week, while most lettuces only last 3-5 days. Go through your fridge regularly to check that your greens are still fresh. When greens go bad, they turn a little brown and get a slimy texture. Consider freezing kale or spinach to last longer. Other greens don’t freeze as well. Refrigerating Cruciferous and Stem Vegetables Store broccoli, cauliflower, cabbage, and turnips in plastic in the vegetable crisper. Wrap these veggies in loose plastic, like a partially open plastic bag or perforated plastic. Make sure to keep your broccoli in the fridge, not on the counter, because it will deteriorate in warm temperatures. Put them in the vegetable crisper drawer, if there’s room. Broccoli and cauliflower will last about a week in the fridge, while cabbage turnips will last at least 2. They also freeze well, if you need them to last longer. Wrap celery in aluminum foil and put it in the fridge. Wrap the foil around the celery to keep the water inside so your celery doesn’t go limp. Don’t crimp the edge of the foil shut, so that the ripening gas that celery produces can escape. Don’t put your celery in the freezer, because it will be all mushy when you defrost it. Keep asparagus in a glass of water in the fridge. Trim 1 inch (2.5 cm) off the bottoms of your asparagus. Stand the asparagus up in a jar with 1 inch (2.5 cm) or water. If you don’t have a jar handy, you can also use any kind of glass or measuring cup. Make sure all the asparagus ends are in the water. If you want, you can loosely cover the asparagus tops in plastic wrap to keep out odors, but you don’t have to. The  asparagus should stay fresh for up to 7 days. Sprinkle your artichoke stems in water and refrigerate them in plastic. Slice a very thin sliver off the end of your artichoke stems and sprinkle the ends in water. Wrap the whole artichokes in plastic bags, and then put them in your fridge.Artichokes will last up to 5 days, but they’re best when eaten within a day or two of when you bought them. Wrap leeks in a damp paper towel and plastic before refrigerating them. The damp paper towel will help keep your leeks fresh, and the perforated plastic bag will contain the moisture. Don’t put your leeks in the fridge unwrapped, because their odor will be absorbed by other items in your fridge. Don’t trim or wash your leeks before storing them. The leeks should stay fresh for about 10 days. Dealing with Roots, Bulbs, and Tubers Put carrots in a container of water in the fridge. Trim off the leafy carrot tops and then place your carrots into a plastic container. Fill the container with water until the carrots are completely covered. Put the lid on the container, and then place the container in the fridge. Change the water every 4-5 days. Carrots can last up to a month when stored this way. Store beets in the vegetable crisper in a perforated plastic bag. Place your beets in a plastic bag and slice holes in the bag, if they did not already come in perforated plastic. Then, place the bag in the vegetable crisper drawer of your fridge, which is the high-humidity drawer. Beets will last in the refrigerator for 1-3 months. Keep potatoes  and sweet potatoes in a cool dry place with ventilation. Good places to keep potatoes include basements, cellars, pantries, and kitchen cabinets. It’s best to leave the potatoes in the mesh bags they came in because they need ventilation to stay fresh. Don’t wash your potatoes before storage. Don’t keep potatoes in the fridge, because it’s too cold for them. Put onions, shallots, and garlic in a cool, dry place. Store them on the counter or in a kitchen cabinet, as long as the cabinet doesn’t seal air-tight. Leave them in the mesh ventilated bag them come in, rather than putting them in an air-tight container. Green onions, on the other hand, belong in the fridge. Storing Vegetables That Are Actually Fruits Keep cucumbers, zucchini, eggplant, and bell peppers on the counter for better flavor. Though it might seem counterintuitive, these veggies actually taste much better when they are stored on your counter. If you’re afraid that they are about to start rotting, you can put them in the fridge, but it’s best to regularly buy them fresh and eat them within a few days. If you must keep them in the fridge, leave them there for no more than 3 days. You can also freeze cucumbers for longer storage. Place tomatoes on the counter until they’re overripe. Tomatoes do best at about 55 °F (13 °C) which is, unfortunately, warmer than most fridges and cooler than most rooms. Keep them on the counter when they’re under-ripe or ripe, and move them to the fridge if they get a little squishy. You can use squishy tomatoes in sauces and soups. Ripen avocados on the counter and then put them in the fruit crisper. When avocados are ripe they give slightly to the touch and the skin is black. At this point, you can either eat them or put them in the fridge. Keep avocados in the fruit drawer of your fridge, which is the crisper drawer with lower humidity. Don’t put avocados in the fridge before they ripen, because they’ll stay hard. Keep corn on the cob in a plastic bag in the vegetable crisper drawer. Leave corn on the cob in its husk, if you bought it with the husk still on. Put the cobs in a plastic bag, seal the bag, and leave it in the vegetable crisper drawer. Your corn should last a week.",
  "tyn_model":[
    "water",
    "asparagus",
    "vegetable crisper",
    "celery",
    "potatoes",
    "paper towels",
    "fridge",
    "avocados",
    "kale",
    "broccoli",
    "tomatoes",
    "corn",
    "spinach",
    "container",
    "cauliflower",
    "foil",
    "jar",
    "artichoke",
    "carrots",
    "onions",
    "cucumbers",
    "lettuce",
    "bok choy",
    "chard",
    "salad spinner",
    "plastic storage container",
    "salad greens",
    "paper towel",
    "collards",
    "lettuces",
    "cabbage",
    "turnips",
    "cabbage turnips",
    "aluminum foil",
    "freezer",
    "plastic wrap",
    "plastic bags",
    "artichokes",
    "plastic",
    "perforated plastic bag",
    "beets",
    "refrigerator",
    "sweet potatoes",
    "shallots",
    "garlic",
    "air-tight container",
    "zucchini",
    "eggplant",
    "bell peppers",
    "veggies",
    "fruit crisper",
    "plastic bag",
    "vegetable crisper drawer"
  ],
  "tyn_section":[

  ]
}