{
  "title":"How to Store Blankets",
  "url":"https://www.wikihow.com/Store-Blankets",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms",
    "Bed Linen",
    "Blankets"
  ],
  "methods":[
    {
      "name":"Displaying Your Blankets",
      "steps":[
        {
          "headline":"Fold blankets over a blanket ladder.",
          "description":"Blanket ladders are a simple way to keep blankets and quilts easily available and visible. The blankets simply drape over the rungs, overlapping one another. You can purchase one at a home decor store or make one yourself with two boards and a few rungs. You can check out some detailed DIY blanket ladder instructions at https://www.remodelaholic.com/build-easy-blanket-ladder/."
        },
        {
          "headline":"Keep your blankets displayed in a cabinet.",
          "description":"If you have extra space in a display cabinet, you can fold and stack blankets to highlight them in your living room or bedroom. This option is great for those with beautiful, decorative blankets that don’t see as much use as the super soft ones you curl up with on the couch. Other furniture items can make great choices too. Anything with a few extra shelves can display your lesser-used blankets."
        },
        {
          "headline":"Place your blankets in a basket when they are not in use.",
          "description":"From simple wicker to decorative designs, baskets are a classic choice for blanket storage. An open basket will show off your blankets, but if you would rather keep them out of sight, there are baskets with lids to choose from as well. Keeping the blankets rolled up will allow the basket to hold more blankets."
        },
        {
          "headline":"Store blankets on the back of a door.",
          "description":"Installing a set of straight bar racks, like the ones you keep towels on in your bathroom, on the back of a bedroom door will allow you to drape blankets in an accessible, yet slightly tucked away spot. Small blankets, like baby blankets, may even fit in a vinyl shoe hanger for a quick and easy nursery storage solution."
        }
      ]
    },
    {
      "name":"Storing Blankets out of Sight",
      "steps":[
        {
          "headline":"Keep your blankets in a simple box under the bed.",
          "description":"For blankets that keep you warm at night, storing them below your bed is convenient and simple. Under-bed boxes don’t have to be attractive, or fit the decor of the room, which can make it a great basic choice for storing blankets. This approach makes it easy for you to swap out the blanket that sits folded at the foot of your bed."
        },
        {
          "headline":"Store blankets and other bedding in an attractive trunk or chest.",
          "description":"If you would rather not pull an unattractive box out from under the bed when you need a blanket, or if you enjoy the look of antique chests, you can keep blankets alongside pillowcases and extra sheets in a beautiful case at the foot of your bed or beside a couch. If you use a wooden box, it is a good idea to keep something between the blankets and the wood. Acid-free paper, typically used for archiving documents and photographs, is a great choice for this."
        },
        {
          "headline":"Fold blankets and store them on shelves in a closet.",
          "description":"While they take up precious storage space, the closet leaves an optimal amount of airflow around the blankets, keeping them smelling fresh as long as you need to keep them there. Rolling the blankets will save room, as will stacking the blankets on top of boxes and other items in your closet."
        }
      ]
    },
    {
      "name":"Keeping Blankets Odor and Mildew Free",
      "steps":[
        {
          "headline":"Wash blankets before storing them.",
          "description":"By washing the blankets, you will remove any odors they may have collected and ensure that they are going into storage fresh. It is important that the blankets do not have dust or other particles on them, which will attract mites and other pests."
        },
        {
          "headline":"Dry the blankets thoroughly to avoid mildew or mold.",
          "description":"There must be no moisture remaining in or on the blankets. If you dried a whole load of blankets all at once, this can take some time. Be sure to check for any remaining wet spots before storing. You can even let thicker blankets sit out in the air for a few hours to ensure that all moisture has evaporated."
        },
        {
          "headline":"Pack the blankets loosely, leaving breathing room.",
          "description":"This will allow air to circulate and prevent mold and mildew from growing in the box, which would cause damage to the blankets in addition to leaving them with a nasty odor. You should try not fill the box to its limit so that this does not happen."
        },
        {
          "headline":"Prevent mold and mildew by keeping a desiccant in the container.",
          "description":"You can purchase silica gel online or in a hardware store, and placing it in the box it will remove moisture by absorbing it from the air. This will keep mildew from taking over your blankets. You can even place a pack of silica gel from a recently purchased a pair of shoes in the box. Silica gel is harmful if consumed. For a more child- or pet-proof option, try activated charcoal. Activated charcoal can also remove musty odors if they have already been absorbed by your blankets."
        },
        {
          "headline":"Place a potpourri or other dried source of fragrance in the container.",
          "description":"You can use store bought potpourris, or use an herb like thyme or rosemary, a flower like lavender, or even a fruit peel, like an orange. You should ensure that the potpourri, herb, flower or fruit is fully dried in order to prevent mold from forming. You should keep the fragrances away from the blankets themselves. If the potpourri makes contact with the blankets, they could stain."
        }
      ]
    }
  ],
  "text":" Displaying Your Blankets Fold blankets over a blanket ladder. Blanket ladders are a simple way to keep blankets and quilts easily available and visible. The blankets simply drape over the rungs, overlapping one another. You can purchase one at a home decor store or make one yourself with two boards and a few rungs. You can check out some detailed DIY blanket ladder instructions at https://www.remodelaholic.com/build-easy-blanket-ladder/. Keep your blankets displayed in a cabinet. If you have extra space in a display cabinet, you can fold and stack blankets to highlight them in your living room or bedroom. This option is great for those with beautiful, decorative blankets that don’t see as much use as the super soft ones you curl up with on the couch. Other furniture items can make great choices too. Anything with a few extra shelves can display your lesser-used blankets. Place your blankets in a basket when they are not in use. From simple wicker to decorative designs, baskets are a classic choice for blanket storage. An open basket will show off your blankets, but if you would rather keep them out of sight, there are baskets with lids to choose from as well. Keeping the blankets rolled up will allow the basket to hold more blankets. Store blankets on the back of a door. Installing a set of straight bar racks, like the ones you keep towels on in your bathroom, on the back of a bedroom door will allow you to drape blankets in an accessible, yet slightly tucked away spot. Small blankets, like baby blankets, may even fit in a vinyl shoe hanger for a quick and easy nursery storage solution. Storing Blankets out of Sight Keep your blankets in a simple box under the bed. For blankets that keep you warm at night, storing them below your bed is convenient and simple. Under-bed boxes don’t have to be attractive, or fit the decor of the room, which can make it a great basic choice for storing blankets. This approach makes it easy for you to swap out the blanket that sits folded at the foot of your bed. Store blankets and other bedding in an attractive trunk or chest. If you would rather not pull an unattractive box out from under the bed when you need a blanket, or if you enjoy the look of antique chests, you can keep blankets alongside pillowcases and extra sheets in a beautiful case at the foot of your bed or beside a couch. If you use a wooden box, it is a good idea to keep something between the blankets and the wood. Acid-free paper, typically used for archiving documents and photographs, is a great choice for this. Fold blankets and store them on shelves in a closet. While they take up precious storage space, the closet leaves an optimal amount of airflow around the blankets, keeping them smelling fresh as long as you need to keep them there. Rolling the blankets will save room, as will stacking the blankets on top of boxes and other items in your closet. Keeping Blankets Odor and Mildew Free Wash blankets before storing them. By washing the blankets, you will remove any odors they may have collected and ensure that they are going into storage fresh. It is important that the blankets do not have dust or other particles on them, which will attract mites and other pests. Dry the blankets thoroughly to avoid mildew or mold. There must be no moisture remaining in or on the blankets. If you dried a whole load of blankets all at once, this can take some time. Be sure to check for any remaining wet spots before storing. You can even let thicker blankets sit out in the air for a few hours to ensure that all moisture has evaporated. Pack the blankets loosely, leaving breathing room. This will allow air to circulate and prevent mold and mildew from growing in the box, which would cause damage to the blankets in addition to leaving them with a nasty odor. You should try not fill the box to its limit so that this does not happen. Prevent mold and mildew by keeping a desiccant in the container. You can purchase silica gel online or in a hardware store, and placing it in the box it will remove moisture by absorbing it from the air. This will keep mildew from taking over your blankets. You can even place a pack of silica gel from a recently purchased a pair of shoes in the box. Silica gel is harmful if consumed. For a more child- or pet-proof option, try activated charcoal. Activated charcoal can also remove musty odors if they have already been absorbed by your blankets. Place a potpourri or other dried source of fragrance in the container. You can use store bought potpourris, or use an herb like thyme or rosemary, a flower like lavender, or even a fruit peel, like an orange. You should ensure that the potpourri, herb, flower or fruit is fully dried in order to prevent mold from forming. You should keep the fragrances away from the blankets themselves. If the potpourri makes contact with the blankets, they could stain.",
  "tyn_model":[
    "blankets",
    "silica gel",
    "potpourri",
    "blanket ladder",
    "basket",
    "baskets",
    "blanket",
    "activated charcoal",
    "blanket ladders",
    "home decor store",
    "straight bar racks",
    "acid-free paper",
    "potpourris"
  ],
  "tyn_section":[

  ]
}