{
  "title":"How to Win on Rainbow Road in Mario Kart 64",
  "url":"https://www.wikihow.com/Win-on-Rainbow-Road-in-Mario-Kart-64",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo 64"
  ],
  "steps":[
    {
      "headline":"Do the track shortcut.",
      "description":"With any character, use a mushroom right after you cross the finish line, but before the drop. You will land about halfway through the course."
    },
    {
      "headline":"Watch out for Chain Chomps!",
      "description":"They come munching and crunching at you. They follow the course and can be hard to see along the bright colours."
    },
    {
      "headline":"Watch your turns.",
      "description":"The Nintendo 64 Rainbow Road is the only track of the series that has railings for the entire course. While you may not fall, hitting the rails will slow down your character."
    },
    {
      "headline":"Enjoy the scenery.",
      "description":"The scenery can be very nice to look at. It has colourful animations of the Mario crew. Don't get too distracted, though, because you could get hit by a Chain Chomp or other items if you're not paying attention."
    }
  ],
  "text":" Do the track shortcut. With any character, use a mushroom right after you cross the finish line, but before the drop. You will land about halfway through the course. Watch out for Chain Chomps! They come munching and crunching at you. They follow the course and can be hard to see along the bright colours. Watch your turns. The Nintendo 64 Rainbow Road is the only track of the series that has railings for the entire course. While you may not fall, hitting the rails will slow down your character. Enjoy the scenery. The scenery can be very nice to look at. It has colourful animations of the Mario crew. Don't get too distracted, though, because you could get hit by a Chain Chomp or other items if you're not paying attention.",
  "tyn_model":[
    "mushroom",
    "nintendo 64 rainbow road",
    "railings",
    "rails"
  ],
  "tyn_section":[

  ]
}