{
  "title":"How to Recycle Wood",
  "url":"https://www.wikihow.com/Recycle-Wood",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Household Waste Disposal",
    "Recycling"
  ],
  "methods":[
    {
      "name":"Using a Recycling Service",
      "steps":[
        {
          "headline":"Search for a place near you that accepts wood for recycling.",
          "description":"There are many ways to start looking for recycling centers, such as by contacting your local government or waste management service. Another way is to do a quick search online for recycling centers in your community. Try typing your address into a site like https://reusewood.org/. Look for salvage or demolition services to get rid of lumber and other construction scraps. Waste management services usually offer home pick-up for yard waste and small pieces of wood. Look for specialty recyclers that handle pallets, home goods, or other types of wood."
        },
        {
          "headline":"Remove any screws or nails left on the wood.",
          "description":"Most facilities won’t accept wood containing these components. Pull them out before trying to submit the wood to a recycling service. Pull out nails with the claw end of a hammer and take out screws with a screwdriver. If you aren’t able to remove the fasteners, you may need to take the wood to a landfill instead. Check the wood over to make sure it’s clean. Take apart any connected pieces so you can bundle it together after you ensure it is ready for recycling. Some places will take whole pieces of furniture and other items for recycling. For more information, check the rules of recycling services in your area."
        },
        {
          "headline":"Cut down large pieces of wood to submit for recycling.",
          "description":"Use a handsaw to break down branches and other big pieces of wood. Wood usually needs to be no more than 5 to 6 ft (1.5 to 1.8 m) long and 6 in (15 cm) thick. Clear the cut wood of dirt, stone, and other debris. Finish by tying it into a bundle using twine or string. Wood scraps from construction and demolition projects can be treated as yard waste and recycled as long as they are untreated and unpainted. If you wish to save big branches for yourself, rent a wood chipper from a hardware store. Use it to make mulch. Submit painted and treated wood whole, if possible, to avoid the hazards of cutting it. Furniture can also be difficult to dismantle, so try to find a place that accepts whole pieces."
        },
        {
          "headline":"Transport the wood or have it picked up by a recycler.",
          "description":"If you’re able to get a pickup service, prepare the wood and set it outside. Otherwise, bundle it up and drive it to the recycling facility you chose. Talk to someone at the facility before unloading the wood and moving it inside. During a home pickup, you should sort the wood according to the recycler’s specifications. That usually means putting yard waste into a paper waste bag, then tying sticks and boards together."
        }
      ]
    },
    {
      "name":"Disposing of Wood Products",
      "steps":[
        {
          "headline":"Take composite wood and flooring to a specialty recycling center.",
          "description":"Not all recycling centers can handle this kind of wood. Wood like pressure-treated lumber, laminated panels, fiberboard (MDF), particleboard, and plywood all have to be handled with caution. If you’re unable to recycle or reuse the wood, you may need to take it to a landfill for safe disposal. Treated wood and composites can be cut as long as you’re wearing a respirator mask and safety goggles. This kind of wood can’t be burned safely, however. Treated lumber often has a green tint and smells oily. Particleboard and other types of wood will look normal, but the glue and wood dust in them are still toxic."
        },
        {
          "headline":"Strip painted wood before recycling it.",
          "description":"Because of possible chemicals in the paint, painted wood cannot be recycled. However, you could change that by stripping the wood using a scraper and chemicals. Wear safety gear, including gloves and a dust mask, when working with chemical paint strippers. To avoid having to deal with the paint, reuse the wood as is. Repurpose it or give it a fresh coat of paint. If you don’t plan on reusing painted wood, you will need to dispose of it in a landfill."
        },
        {
          "headline":"Sort out different types of wood before taking them in for disposal.",
          "description":"Make sure the wood is properly sorted and bundled according to disposal recommendations. Separate pressure-treated wood and laminates, for instance, in case they need to be disposed of separately. Also, set aside the wood you wish to preserve. Save untreated wood for reuse or for a sustainable recycling facility. Treated wood is typically labeled, so look for an ink marking like “KD HT.”\nIf you’re uncertain about what kind of wood you have, keep it separate. Try taking it with you to a recycling facility and asking if they would accept it."
        }
      ]
    },
    {
      "name":"Repurposing Wood",
      "steps":[
        {
          "headline":"Reuse old boards that are still in good quality.",
          "description":"Wood planks are very easy to recycle since they have so many uses. They can be used for building homes, furniture, and all sorts of other projects. Recycling centers almost always accept quality lumber, but you could also give it away to someone who needs it. Salvage boards from old buildings, for example. As long as the boards aren’t rotting or otherwise damaged, they can be recycled. If you notice damage like rot or mold, cut it off. Throw away the ruined portion, then find a use for the scraps. Pallets can also be taken apart or sent to a recycling center. Most places take the good parts and use them to make new pallets."
        },
        {
          "headline":"Use sawdust and wood chips in your home or garden.",
          "description":"These types of wood waste have many uses and are worth saving. For example, sprinkle them on top of soil as mulch to protect plants. Also, use them to surround walkways and prevent weeds from invading. If you have animals, you could use the wood as bedding or to line flooring. Wood chips make good bedding for small animals like hamsters. It also can be used to pad outdoor playgrounds. Sawdust is great for absorbing spills. Sprinkle some over a fresh oil stain in your garage, for example. Another option is to make compost and put it in a compost bin made from wood scraps."
        },
        {
          "headline":"Save old furniture to be used for other projects.",
          "description":"Wood used for furniture is often high-quality. If you want to build something new, take apart the old furniture and save the wood for your next project. You could also refinish old furniture, such as by sanding it and filling in damaged portions with wood putty. Refurbishing furniture takes some effort, but it can save you money in the long run. You won’t need to worry about transporting the old furniture and buying new pieces. If you’re not prepared to save furniture or another home good, keep in mind that recycling centers often accept them as long as they aren’t painted. However, reselling or donating them can be easier."
        },
        {
          "headline":"Resell or donate wood items you no longer plan on using.",
          "description":"If the wood is in good shape, post a listing online to make a little bit of cash. You could also host a garage sale. Consider donating quality household items to secondhand stores or give them away instead. For instance, save wood items like toys or utensils. Many household items are painted and can’t be recycled, but they can be reused by someone who needs them. Try donating goods to a charity like Habitat For Humanity. They also accept building material at their ReStores."
        },
        {
          "headline":"Burn untreated wood for fuel.",
          "description":"If you have a fireplace or a wood stove, consider repurposing old wood by burning what you can’t otherwise use. You can save money on fuel costs by collecting wood you find outdoors. If you don’t plan on burning it yourself, take it to a biomass plant. Many plants accept wood donations to recycle into a cost-efficient energy source. Wood chips and other untreated woods work well as a fuel source. For your own safety, avoid burning chemically-treated wood. Biomass plants also will not accept treated wood. The ash from wood can also help your lawn or garden. Mix it into compost for a natural nutritional supplement."
        }
      ]
    }
  ],
  "text":" Using a Recycling Service Search for a place near you that accepts wood for recycling. There are many ways to start looking for recycling centers, such as by contacting your local government or waste management service. Another way is to do a quick search online for recycling centers in your community. Try typing your address into a site like https://reusewood.org/. Look for salvage or demolition services to get rid of lumber and other construction scraps. Waste management services usually offer home pick-up for yard waste and small pieces of wood. Look for specialty recyclers that handle pallets, home goods, or other types of wood. Remove any screws or nails left on the wood. Most facilities won’t accept wood containing these components. Pull them out before trying to submit the wood to a recycling service. Pull out nails with the claw end of a hammer and take out screws with a screwdriver. If you aren’t able to remove the fasteners, you may need to take the wood to a landfill instead. Check the wood over to make sure it’s clean. Take apart any connected pieces so you can bundle it together after you ensure it is ready for recycling. Some places will take whole pieces of furniture and other items for recycling. For more information, check the rules of recycling services in your area. Cut down large pieces of wood to submit for recycling. Use a handsaw to break down branches and other big pieces of wood. Wood usually needs to be no more than 5 to 6 ft (1.5 to 1.8 m) long and 6 in (15 cm) thick. Clear the cut wood of dirt, stone, and other debris. Finish by tying it into a bundle using twine or string. Wood scraps from construction and demolition projects can be treated as yard waste and recycled as long as they are untreated and unpainted. If you wish to save big branches for yourself, rent a wood chipper from a hardware store. Use it to make mulch. Submit painted and treated wood whole, if possible, to avoid the hazards of cutting it. Furniture can also be difficult to dismantle, so try to find a place that accepts whole pieces. Transport the wood or have it picked up by a recycler. If you’re able to get a pickup service, prepare the wood and set it outside. Otherwise, bundle it up and drive it to the recycling facility you chose. Talk to someone at the facility before unloading the wood and moving it inside. During a home pickup, you should sort the wood according to the recycler’s specifications. That usually means putting yard waste into a paper waste bag, then tying sticks and boards together. Disposing of Wood Products Take composite wood and flooring to a specialty recycling center. Not all recycling centers can handle this kind of wood. Wood like pressure-treated lumber, laminated panels, fiberboard (MDF), particleboard, and plywood all have to be handled with caution. If you’re unable to recycle or reuse the wood, you may need to take it to a landfill for safe disposal. Treated wood and composites can be cut as long as you’re wearing a respirator mask and safety goggles. This kind of wood can’t be burned safely, however. Treated lumber often has a green tint and smells oily. Particleboard and other types of wood will look normal, but the glue and wood dust in them are still toxic. Strip painted wood before recycling it. Because of possible chemicals in the paint, painted wood cannot be recycled. However, you could change that by stripping the wood using a scraper and chemicals. Wear safety gear, including gloves and a dust mask, when working with chemical paint strippers. To avoid having to deal with the paint, reuse the wood as is. Repurpose it or give it a fresh coat of paint. If you don’t plan on reusing painted wood, you will need to dispose of it in a landfill. Sort out different types of wood before taking them in for disposal. Make sure the wood is properly sorted and bundled according to disposal recommendations. Separate pressure-treated wood and laminates, for instance, in case they need to be disposed of separately. Also, set aside the wood you wish to preserve. Save untreated wood for reuse or for a sustainable recycling facility. Treated wood is typically labeled, so look for an ink marking like “KD HT.”\nIf you’re uncertain about what kind of wood you have, keep it separate. Try taking it with you to a recycling facility and asking if they would accept it. Repurposing Wood Reuse old boards that are still in good quality. Wood planks are very easy to recycle since they have so many uses. They can be used for building homes, furniture, and all sorts of other projects. Recycling centers almost always accept quality lumber, but you could also give it away to someone who needs it. Salvage boards from old buildings, for example. As long as the boards aren’t rotting or otherwise damaged, they can be recycled. If you notice damage like rot or mold, cut it off. Throw away the ruined portion, then find a use for the scraps. Pallets can also be taken apart or sent to a recycling center. Most places take the good parts and use them to make new pallets. Use sawdust and wood chips in your home or garden. These types of wood waste have many uses and are worth saving. For example, sprinkle them on top of soil as mulch to protect plants. Also, use them to surround walkways and prevent weeds from invading. If you have animals, you could use the wood as bedding or to line flooring. Wood chips make good bedding for small animals like hamsters. It also can be used to pad outdoor playgrounds. Sawdust is great for absorbing spills. Sprinkle some over a fresh oil stain in your garage, for example. Another option is to make compost and put it in a compost bin made from wood scraps. Save old furniture to be used for other projects. Wood used for furniture is often high-quality. If you want to build something new, take apart the old furniture and save the wood for your next project. You could also refinish old furniture, such as by sanding it and filling in damaged portions with wood putty. Refurbishing furniture takes some effort, but it can save you money in the long run. You won’t need to worry about transporting the old furniture and buying new pieces. If you’re not prepared to save furniture or another home good, keep in mind that recycling centers often accept them as long as they aren’t painted. However, reselling or donating them can be easier. Resell or donate wood items you no longer plan on using. If the wood is in good shape, post a listing online to make a little bit of cash. You could also host a garage sale. Consider donating quality household items to secondhand stores or give them away instead. For instance, save wood items like toys or utensils. Many household items are painted and can’t be recycled, but they can be reused by someone who needs them. Try donating goods to a charity like Habitat For Humanity. They also accept building material at their ReStores. Burn untreated wood for fuel. If you have a fireplace or a wood stove, consider repurposing old wood by burning what you can’t otherwise use. You can save money on fuel costs by collecting wood you find outdoors. If you don’t plan on burning it yourself, take it to a biomass plant. Many plants accept wood donations to recycle into a cost-efficient energy source. Wood chips and other untreated woods work well as a fuel source. For your own safety, avoid burning chemically-treated wood. Biomass plants also will not accept treated wood. The ash from wood can also help your lawn or garden. Mix it into compost for a natural nutritional supplement.",
  "tyn_model":[
    "wood",
    "boards",
    "lumber",
    "wood chips",
    "recycling centers",
    "mulch",
    "compost",
    "waste management service",
    "nails",
    "hammer",
    "screws",
    "screwdriver",
    "twine",
    "string",
    "wood chipper",
    "yard waste",
    "composite wood",
    "pressure-treated lumber",
    "fiberboard",
    "plywood",
    "glue",
    "wood dust",
    "scraper",
    "chemicals",
    "sustainable recycling",
    "“kd",
    "”\n",
    "wood planks",
    "sawdust",
    "wood putty",
    "furniture",
    "fireplace",
    "wood stove",
    "biomass plants"
  ],
  "tyn_section":[

  ]
}