{
  "title":"How to Make Freeze Dried Wax Marbles",
  "url":"https://www.wikihow.com/Make-Freeze-Dried-Wax-Marbles",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Creating Games"
  ],
  "steps":[
    {
      "headline":"Try to mold the cheese wax into a small ball with your fingers.",
      "description":"You do not want to get it into a perfect ball just yet. Roll it around so it is ready to be softened."
    },
    {
      "headline":"Fill a saucer with hot (but not boiling) water, and place the ball of wax inside.",
      "description":"Roll the ball around in your hands and knead it every few seconds. If you just leave it there, the wax will not get softened, but rather melted on the outside and hard on the inside."
    },
    {
      "headline":"Knead the softened wax in your hands.",
      "description":"Try to knead the wax so it gets an even tone and texture all around the wax."
    },
    {
      "headline":"Roll the wax into a smooth ball.",
      "description":"Try to get the ball as smooth and even as possible, but keep in mind that if you make a mistake, you can always soften it again and re-mold it after it is finished."
    },
    {
      "headline":"Pour half of your ice into a cup, and place your marble in.",
      "description":"Pour in the other half. This makes the ball \"trapped\" between two layers of ice, giving an even temperature so that it will dry properly."
    },
    {
      "headline":"Wait for a few minutes, or until all the ice has melted.",
      "description":"The marbles harden very quickly, so you do not have to wait a long time, but if you want to, you can."
    },
    {
      "headline":"Take out the ice, and enjoy your marble!",
      "description":"Once you have made some marbles, this technique can also be used to make small toys out of wax. You can try making dolls, animals, and more!"
    }
  ],
  "text":" Try to mold the cheese wax into a small ball with your fingers. You do not want to get it into a perfect ball just yet. Roll it around so it is ready to be softened. Fill a saucer with hot (but not boiling) water, and place the ball of wax inside. Roll the ball around in your hands and knead it every few seconds. If you just leave it there, the wax will not get softened, but rather melted on the outside and hard on the inside. Knead the softened wax in your hands. Try to knead the wax so it gets an even tone and texture all around the wax. Roll the wax into a smooth ball. Try to get the ball as smooth and even as possible, but keep in mind that if you make a mistake, you can always soften it again and re-mold it after it is finished. Pour half of your ice into a cup, and place your marble in. Pour in the other half. This makes the ball \"trapped\" between two layers of ice, giving an even temperature so that it will dry properly. Wait for a few minutes, or until all the ice has melted. The marbles harden very quickly, so you do not have to wait a long time, but if you want to, you can. Take out the ice, and enjoy your marble! Once you have made some marbles, this technique can also be used to make small toys out of wax. You can try making dolls, animals, and more!",
  "tyn_model":[
    "wax",
    "ice",
    "marble",
    "cheese wax",
    "saucer",
    "water",
    "cup"
  ],
  "tyn_section":[

  ]
}