{
  "title":"How to Play the UK Lottery",
  "url":"https://www.wikihow.com/Play-the-UK-Lottery",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Games of Chance",
    "Lotteries and Scratchcard Games"
  ],
  "methods":[
    {
      "name":"Participating in the Lottery Online",
      "steps":[
        {
          "headline":"Make an account on the official lottery website.",
          "description":"Create a digital lottery account online so you can participate in the Lotto and other games. While you don’t have to use your official work or business email, make sure that your login is something that can be easily traced back to you. In order to play the National Lottery online, you must have a digital account. You can only register online and enter the National Lottery if you live in the UK or the Isle of Man. You can find the National Lottery’s website here: https://www.national-lottery.co.uk."
        },
        {
          "headline":"Select which lottery game you’d like to play.",
          "description":"Choose whichever option appeals the most to you. Aside from the regular Lotto, there are other game options to choose from like EuroMillions, Set For Life, Lotto HotPicks, Thunderball, and Instant Win Games. It might be easier if you decide how much you’re willing to spend and risk before playing a specific game. For example, enter the Set For Life lottery if you want a chance to receive £10,000 per month over 3 decades. On the other hand, play EuroMillions if you want to enter a risky gambit for more money. Thunderball and Lotto HotPicks work similarly to the regular lotto, though the play slip is slightly different."
        },
        {
          "headline":"Choose 6 numbers to enter the regular Lotto.",
          "description":"Think of 6 different numbers between 1 and 59 to play for your Lotto submission, and enter them on the Lotto entry webpage. If you can’t decide on a set of numbers to enter, consider hitting the “Lucky Slip” button, which generates random number selections for you. It costs £2.00 to play one round of Lotto numbers. You can buy up to 10 pay slips of entries, if you’d like. The Lotto picks its winning numbers on Wednesday and Saturday, so decide how often you want to play."
        },
        {
          "headline":"Purchase multiple entries at a time if you don’t want to buy a new slip each week.",
          "description":"Opt to buy several weeks of Lotto plays at a time if you’re feeling especially lucky. It can be tedious to constantly be entering and submitting different plays for the biweekly draws, so the advanced purchase feature can really come in handy for those who wish to gamble in bulk. Depending on your mood, you can purchase up to 4 weeks of plays in advance, or you can charge your card on a weekly basis."
        },
        {
          "headline":"Wait for the winning numbers to be announced.",
          "description":"Check online or on your local television to watch the live drawings. If you’ve entered the regular Lotto, the results will be announced on Wednesday and Saturday at 8:00 PM and 7:45 PM GMT. Compare your selected numbers with the announced winners to see if you’ve won any cash for the week. If some of your numbers match the numbers drawn on television, then you’ve won! If at least 2 of your selected Lotto numbers match the drawing, you’ll win a free lucky dip (random play) for a future Lotto. Having 3 matching numbers gets you £30, while 4 give you £140. The prizes really get loaded once you start matching 4 or more numbers with the drawing, which equals £1,750 in winnings. You need to match all 6 numbers to win the jackpot. In the event that this doesn’t happen, you need to match at least 5 lottery numbers in addition to the bonus ball to win."
        },
        {
          "headline":"Receive your prize by debit card or check.",
          "description":"Examine your debit card and your online lottery account to make sure that your winnings are going to the right place. Smaller prizes (below £500) will be immediately deposited into your lottery funds account, while larger winnings need to be confirmed online. Especially large prizes (over £50,000) need to be collected and processed more personally. Call 03332344433 to set up a meeting. Go to the National Lottery website to create your lottery funds account: https://www.national-lottery.co.uk/account-terms."
        }
      ]
    },
    {
      "name":"Purchasing Scratchcards in Person",
      "steps":[
        {
          "headline":"Buy a Scratchcard from a convenience store or other shop.",
          "description":"Purchase a Scratchcard at the end of your shopping trip at a corner shop or grocery store. There are different types of cards you can choose from that offer different levels of prize money, so feel free to opt for a less risky prize. If you’re feeling especially bold, buy more than one card for a higher chance at winning! Certain Scratchcards cost more money than others. For example, the £4 Million Black card costs £10 to play, while cards like the £100,000 Purple and £100,000 Yellow only cost £1 to play. Depending on the popularity of card, extra prizes might be added to compensate for the additional interest."
        },
        {
          "headline":"Scratch off the designated areas of the card with a coin.",
          "description":"Look on the card to see where you should start scratching. Depending on the card, there might be a large rectangular grid or a smaller, more fun design for you to scratch off. Follow the instructions on the card so you can reveal the prizes as efficiently as possible. For example, the Super 7s card has 12 small squares for you to scratch off. If you uncover a 7 or an X2 on your card, you’ll win whatever prize is listed."
        },
        {
          "headline":"Check the game instructions to see if you’ve won.",
          "description":"Scratch off all possible areas to check for a winning prize. Review the card’s instructions to check the criteria. Depending on the game, there could be multiple ways to win, so double check before you toss out the card altogether! For example, the Payday Scratchcards use symbols to specify prizes."
        },
        {
          "headline":"Claim your Scratchcard prize in person or through the mail.",
          "description":"Receive your prize money by going back to the store or submitting your card through an official lottery machine. Prizes larger than £50,000 need to be received in person at the store with a special claim form. If you want, you can mail your winning card and completed claim form to the official National Lottery address. They will process your claim and mail you your prize in return."
        }
      ]
    }
  ],
  "text":" Participating in the Lottery Online Make an account on the official lottery website. Create a digital lottery account online so you can participate in the Lotto and other games. While you don’t have to use your official work or business email, make sure that your login is something that can be easily traced back to you. In order to play the National Lottery online, you must have a digital account. You can only register online and enter the National Lottery if you live in the UK or the Isle of Man. You can find the National Lottery’s website here: https://www.national-lottery.co.uk. Select which lottery game you’d like to play. Choose whichever option appeals the most to you. Aside from the regular Lotto, there are other game options to choose from like EuroMillions, Set For Life, Lotto HotPicks, Thunderball, and Instant Win Games. It might be easier if you decide how much you’re willing to spend and risk before playing a specific game. For example, enter the Set For Life lottery if you want a chance to receive £10,000 per month over 3 decades. On the other hand, play EuroMillions if you want to enter a risky gambit for more money. Thunderball and Lotto HotPicks work similarly to the regular lotto, though the play slip is slightly different. Choose 6 numbers to enter the regular Lotto. Think of 6 different numbers between 1 and 59 to play for your Lotto submission, and enter them on the Lotto entry webpage. If you can’t decide on a set of numbers to enter, consider hitting the “Lucky Slip” button, which generates random number selections for you. It costs £2.00 to play one round of Lotto numbers. You can buy up to 10 pay slips of entries, if you’d like. The Lotto picks its winning numbers on Wednesday and Saturday, so decide how often you want to play. Purchase multiple entries at a time if you don’t want to buy a new slip each week. Opt to buy several weeks of Lotto plays at a time if you’re feeling especially lucky. It can be tedious to constantly be entering and submitting different plays for the biweekly draws, so the advanced purchase feature can really come in handy for those who wish to gamble in bulk. Depending on your mood, you can purchase up to 4 weeks of plays in advance, or you can charge your card on a weekly basis. Wait for the winning numbers to be announced. Check online or on your local television to watch the live drawings. If you’ve entered the regular Lotto, the results will be announced on Wednesday and Saturday at 8:00 PM and 7:45 PM GMT. Compare your selected numbers with the announced winners to see if you’ve won any cash for the week. If some of your numbers match the numbers drawn on television, then you’ve won! If at least 2 of your selected Lotto numbers match the drawing, you’ll win a free lucky dip (random play) for a future Lotto. Having 3 matching numbers gets you £30, while 4 give you £140. The prizes really get loaded once you start matching 4 or more numbers with the drawing, which equals £1,750 in winnings. You need to match all 6 numbers to win the jackpot. In the event that this doesn’t happen, you need to match at least 5 lottery numbers in addition to the bonus ball to win. Receive your prize by debit card or check. Examine your debit card and your online lottery account to make sure that your winnings are going to the right place. Smaller prizes (below £500) will be immediately deposited into your lottery funds account, while larger winnings need to be confirmed online. Especially large prizes (over £50,000) need to be collected and processed more personally. Call 03332344433 to set up a meeting. Go to the National Lottery website to create your lottery funds account: https://www.national-lottery.co.uk/account-terms. Purchasing Scratchcards in Person Buy a Scratchcard from a convenience store or other shop. Purchase a Scratchcard at the end of your shopping trip at a corner shop or grocery store. There are different types of cards you can choose from that offer different levels of prize money, so feel free to opt for a less risky prize. If you’re feeling especially bold, buy more than one card for a higher chance at winning! Certain Scratchcards cost more money than others. For example, the £4 Million Black card costs £10 to play, while cards like the £100,000 Purple and £100,000 Yellow only cost £1 to play. Depending on the popularity of card, extra prizes might be added to compensate for the additional interest. Scratch off the designated areas of the card with a coin. Look on the card to see where you should start scratching. Depending on the card, there might be a large rectangular grid or a smaller, more fun design for you to scratch off. Follow the instructions on the card so you can reveal the prizes as efficiently as possible. For example, the Super 7s card has 12 small squares for you to scratch off. If you uncover a 7 or an X2 on your card, you’ll win whatever prize is listed. Check the game instructions to see if you’ve won. Scratch off all possible areas to check for a winning prize. Review the card’s instructions to check the criteria. Depending on the game, there could be multiple ways to win, so double check before you toss out the card altogether! For example, the Payday Scratchcards use symbols to specify prizes. Claim your Scratchcard prize in person or through the mail. Receive your prize money by going back to the store or submitting your card through an official lottery machine. Prizes larger than £50,000 need to be received in person at the store with a special claim form. If you want, you can mail your winning card and completed claim form to the official National Lottery address. They will process your claim and mail you your prize in return.",
  "tyn_model":[
    "lotto",
    "lottery",
    "lottery funds",
    "lottery game",
    "lotto hotpicks work",
    "“lucky",
    "” button",
    "gamble",
    "lottery numbers",
    "cards",
    "coin",
    "scratchcard prize"
  ],
  "tyn_section":[

  ]
}