{
  "title":"How to Thicken Whipped Cream",
  "url":"https://www.wikihow.com/Thicken-Whipped-Cream",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets"
  ],
  "methods":[
    {
      "name":"Stabilizing Whipped Cream with Gelatin",
      "steps":[
        {
          "headline":"Combine water and unflavored gelatin in a microwave-safe bowl.",
          "description":"Measure 4 teaspoons (20 ml) of water into a small microwave-safe bowl. Sprinkle 1 teaspoon (4.9 ml) of unflavored gelatin into the water. Let it sit for a few minutes. Make sure that the gelatin is unflavored, or else it will change the taste of the whipped cream."
        },
        {
          "headline":"Microwave the mixture for 3 seconds and give it a stir.",
          "description":"Check to make sure the gelatin is fully dissolved. If it isn’t, put it back in for a few more seconds. When you take it out, give it a stir. Set aside the mixture to let it cool while you whip the cream."
        },
        {
          "headline":"Whip 1 cup (240 ml) of heavy whipping cream with an electric mixer.",
          "description":"For best results, start with cold whipping cream. Whip it until it starts to thicken and forms into soft peaks. When you draw a spatula through the cream, it should hold its shape in soft billows. You can use a stand mixer with a whisk attachment, or a hand mixer that you hold over a bowl."
        },
        {
          "headline":"Add the powdered sugar and the gelatin mixture and keep whipping.",
          "description":"Once the cream forms soft peaks, pour in the powdered sugar and the gelatin. Turn the mixer to low speed and keep beating until the gelatin and sugar are fully incorporated and the cream forms stiff peaks. Add .5 teaspoons (2.5 ml) of pure vanilla extract if you'd like."
        },
        {
          "headline":"Refrigerate your stabilized whipped cream for up to 24 hours.",
          "description":"Unlike regular whipped cream, which deflates after about 3 hours, stabilized whipped cream will hold its shape for a whole day. The gelatin will not affect the flavor or texture, but will make the peaks stay firmer for longer. You can make desserts with stabilized whipped cream in advance and they will stay pretty until you are ready to serve them."
        }
      ]
    },
    {
      "name":"Stabilizing with Cream of Tartar",
      "steps":[
        {
          "headline":"Refrigerate a carton of heavy whipping cream.",
          "description":"Keeping the whipping cream cold will make it hold its shape longer when you whip it. Heavy whipping cream or heavy cream both work great. Whipping cream, with no “heavy” in the title, works too, but it doesn’t hold its peaks for as long, so if you can find it, the heavy stuff is better. You can buy whipping cream in the dairy aisle of the supermarket. To make sure everything’s cold throughout the process, consider putting your bowl and beater in the refrigerator too. They only need to be in there for about 5 minutes to get chilled."
        },
        {
          "headline":"Pour the cold whipping cream.",
          "description":"The cream will at least double in volume when you whip it up, so make sure to use a large bowl. If you want to make 2 cups (470 mL) of whipped cream, start with 2 cups (470 mL) of heavy cream. If you want to make plain whipped cream without any sugar or vanilla, then leave them out. The cream will still whip up to a lovely texture, it will just taste less sweet."
        },
        {
          "headline":"Whip the cream with a hand mixer until soft peaks form.",
          "description":"If you’re using an electric mixer, put it on medium-high speed for about 3 minutes. If you’re using a manual egg beater, move the beater around the bowl to make sure you whip all of the cream. If you draw the mixer out, and the cream comes up in a peak, then you know it’s almost done."
        },
        {
          "headline":"Pour in the sugar and cream of tartar as you keep whipping.",
          "description":"Once the cream has formed into soft peaks, it’s time to incorporate 2 tablespoons (30 mL) of confectioners’ sugar and .25 teaspoons (1.2 mL) of cream of tartar. Gently pour in the sugar and cream of tartar with one hand, and with the other, keep whipping the cream. Cream of tartar is a fine white powder that is a byproduct of winemaking. Lots of recipes use it to stabilize or increase volume. You can buy it in the baking aisle of the supermarket. Confectioners’ sugar generally contains a bit of starch in it, which helps with stabilizing too."
        },
        {
          "headline":"Continue whipping until the cream reaches the desired consistency.",
          "description":"You can decide how soft you want your whipped cream to be. Soft peaks are good for eating with berries, and stiffer peaks are great for piping on cakes. Just make sure you don’t overdo it and make butter! Add in a .5 teaspoons (2.5 ml) of pure vanilla extract if you’d like to lightly flavor the whipped cream. You can tell that you’ve whipped your cream too much if it clings to the sides of the bowl. Don’t despair! Just eat it as tasty homemade butter and start over for your whipped cream."
        },
        {
          "headline":"Eat your whipped cream right away or put it in the refrigerator.",
          "description":"Even stabilized whipped cream will lose its shape if it sits out at room temperature for a while, so either eat your whipped cream right away or store it in the refrigerator. Freezing whipped cream isn’t good for its consistency, so try to avoid that. Whipped cream makes a delicious topping for cakes, pies, and ice cream."
        }
      ]
    }
  ],
  "text":" Stabilizing Whipped Cream with Gelatin Combine water and unflavored gelatin in a microwave-safe bowl. Measure 4 teaspoons (20 ml) of water into a small microwave-safe bowl. Sprinkle 1 teaspoon (4.9 ml) of unflavored gelatin into the water. Let it sit for a few minutes. Make sure that the gelatin is unflavored, or else it will change the taste of the whipped cream. Microwave the mixture for 3 seconds and give it a stir. Check to make sure the gelatin is fully dissolved. If it isn’t, put it back in for a few more seconds. When you take it out, give it a stir. Set aside the mixture to let it cool while you whip the cream. Whip 1 cup (240 ml) of heavy whipping cream with an electric mixer. For best results, start with cold whipping cream. Whip it until it starts to thicken and forms into soft peaks. When you draw a spatula through the cream, it should hold its shape in soft billows. You can use a stand mixer with a whisk attachment, or a hand mixer that you hold over a bowl. Add the powdered sugar and the gelatin mixture and keep whipping. Once the cream forms soft peaks, pour in the powdered sugar and the gelatin. Turn the mixer to low speed and keep beating until the gelatin and sugar are fully incorporated and the cream forms stiff peaks. Add .5 teaspoons (2.5 ml) of pure vanilla extract if you'd like. Refrigerate your stabilized whipped cream for up to 24 hours. Unlike regular whipped cream, which deflates after about 3 hours, stabilized whipped cream will hold its shape for a whole day. The gelatin will not affect the flavor or texture, but will make the peaks stay firmer for longer. You can make desserts with stabilized whipped cream in advance and they will stay pretty until you are ready to serve them. Stabilizing with Cream of Tartar Refrigerate a carton of heavy whipping cream. Keeping the whipping cream cold will make it hold its shape longer when you whip it. Heavy whipping cream or heavy cream both work great. Whipping cream, with no “heavy” in the title, works too, but it doesn’t hold its peaks for as long, so if you can find it, the heavy stuff is better. You can buy whipping cream in the dairy aisle of the supermarket. To make sure everything’s cold throughout the process, consider putting your bowl and beater in the refrigerator too. They only need to be in there for about 5 minutes to get chilled. Pour the cold whipping cream. The cream will at least double in volume when you whip it up, so make sure to use a large bowl. If you want to make 2 cups (470 mL) of whipped cream, start with 2 cups (470 mL) of heavy cream. If you want to make plain whipped cream without any sugar or vanilla, then leave them out. The cream will still whip up to a lovely texture, it will just taste less sweet. Whip the cream with a hand mixer until soft peaks form. If you’re using an electric mixer, put it on medium-high speed for about 3 minutes. If you’re using a manual egg beater, move the beater around the bowl to make sure you whip all of the cream. If you draw the mixer out, and the cream comes up in a peak, then you know it’s almost done. Pour in the sugar and cream of tartar as you keep whipping. Once the cream has formed into soft peaks, it’s time to incorporate 2 tablespoons (30 mL) of confectioners’ sugar and .25 teaspoons (1.2 mL) of cream of tartar. Gently pour in the sugar and cream of tartar with one hand, and with the other, keep whipping the cream. Cream of tartar is a fine white powder that is a byproduct of winemaking. Lots of recipes use it to stabilize or increase volume. You can buy it in the baking aisle of the supermarket. Confectioners’ sugar generally contains a bit of starch in it, which helps with stabilizing too. Continue whipping until the cream reaches the desired consistency. You can decide how soft you want your whipped cream to be. Soft peaks are good for eating with berries, and stiffer peaks are great for piping on cakes. Just make sure you don’t overdo it and make butter! Add in a .5 teaspoons (2.5 ml) of pure vanilla extract if you’d like to lightly flavor the whipped cream. You can tell that you’ve whipped your cream too much if it clings to the sides of the bowl. Don’t despair! Just eat it as tasty homemade butter and start over for your whipped cream. Eat your whipped cream right away or put it in the refrigerator. Even stabilized whipped cream will lose its shape if it sits out at room temperature for a while, so either eat your whipped cream right away or store it in the refrigerator. Freezing whipped cream isn’t good for its consistency, so try to avoid that. Whipped cream makes a delicious topping for cakes, pies, and ice cream.",
  "tyn_model":[
    "cream",
    "whipped cream",
    "gelatin",
    "bowl",
    "whipping cream",
    "sugar",
    "water",
    "cream of tartar",
    "microwave-safe bowl",
    "heavy whipping cream",
    "electric mixer",
    "hand mixer",
    "powdered sugar",
    "mixer",
    "stabilized whipped cream",
    "heavy cream",
    "refrigerator",
    "tartar",
    "confectioners’ sugar",
    "cold whipping cream",
    "spatula",
    "stand mixer",
    "whisk",
    "pure vanilla",
    "“heavy",
    "” in",
    "vanilla",
    "egg beater",
    "baking aisle",
    "butter",
    "vanilla extract",
    "homemade butter",
    "ice cream"
  ],
  "tyn_section":[

  ]
}