{
  "title":"How to Reset a Kitchenaid Dishwasher",
  "url":"https://www.wikihow.com/Reset-a-Kitchenaid-Dishwasher",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "House Cleaning"
  ],
  "methods":[
    {
      "name":"Resetting the Dishwasher Manually",
      "steps":[
        {
          "headline":"Unplug the dishwasher from the outlet if it isn’t responding to commands.",
          "description":"Kind of like you might turn a computer on and off to try and work out some bugs, you can do the same thing with your dishwasher. Leave the dishwasher unplugged for 5 minutes to let the computer reset itself if possible. It won’t hurt anything if you leave the dishwasher unplugged for a longer amount of time.Tip: If your dishwasher is wired directly to the power source, you’ll need to turn off the breaker that powers that room for 5 minutes and then turn it back on."
        },
        {
          "headline":"Plug the dishwasher back into the outlet to see if that fixes the problem.",
          "description":"Once the 5 minutes have passed, go ahead and plug the dishwasher back in and look at the display panel to see if there are any flashing lights or error codes. Give the dishwasher 5-10 minutes, as it may be recomputing or running a diagnostics test. If an error code is on display, look it up in the user’s manual to see what needs to be done next. If there are no flashing lights or indication that the machine is working, skip ahead to reset the control panel."
        },
        {
          "headline":"Run a test cycle by pressing the “heat dry” and “normal” buttons.",
          "description":"After unplugging and plugging the machine back in, run a test cycle to see if the machine is working properly before you load it up with dishes. Press “heat dry,” “normal,” “heat dry,” “normal.” Once you see all the lights on the display are illuminated, press “start.” This will take the dishwasher through its cycle so you can make sure everything is working as it should. On some versions of dishwashers, you’ll need to press the first 3 buttons starting on the left side in a 1-2-3 sequence to start the test cycle. Repeat the 1-2-3 sequence 3 times and then press start to trigger the cycle.Tip: If there is an issue in the cycle process, an error code will display on the dishwasher’s screen. From there, you can look up the code and continue troubleshooting."
        }
      ]
    },
    {
      "name":"Using the Control Panel and Reset Function",
      "steps":[
        {
          "headline":"Reset the control panel with the “hi-temp” and “dry” buttons.",
          "description":"If unplugging and replugging the dishwasher didn’t make a difference and if you can’t successfully run a test cycle, it’s time to reset the actual control panel. Make sure the dishwasher’s door is completely closed and latched. Press the “hi-temp scrub” and “energy saver dry” buttons one after the other until each button has been pressed 5 times. These buttons may also be called “hi-temp” or “heated dry” or something similar depending on your model. Just make sure to press the buttons that have the most similar functions. Some models will reset after each button has been pushed 4 times instead of 5, but don’t worry about that. Just go ahead and press each one 5 times."
        },
        {
          "headline":"Leave the dishwasher alone for 5-10 minutes to let it reset.",
          "description":"After pushing the reset sequence, you’ll hopefully see all the lights on the display panel flash. You may also hear a whirring noise. Go ahead and leave the dishwasher alone so that it can run diagnostics and recompute before you press any other buttons. On rare occasions, it can take more than the 5-10 minutes. Wait until you no longer see any flashing lights or hear any noises coming from the machine."
        },
        {
          "headline":"Press the cancel or cancel/drain button to finish the reset.",
          "description":"This triggers a 2-minute drain cycle. Let this cycle completely run its course before you open the dishwasher. Hopefully, this process solved the dishwasher’s problem, but if it didn’t, you may want to consider calling in a professional technician or doing some further troubleshooting yourself. Resetting the control panel gives the entire computer a reboot, which often clears away any programming or user errors. If the problem is related to an actual broken part in the machine, though, it may not work."
        }
      ]
    },
    {
      "name":"Troubleshooting Other Problems",
      "steps":[
        {
          "headline":"Check to see if the control lock or child’s lock is engaged.",
          "description":"When this function is selected, you won’t be able to turn on the dishwasher. It can sometimes get accidentally selected, so take a quick look to see if the light underneath the button is lit up. To turn off this function, hold the “lock” button down for 4 seconds. The control lock is a great function, especially if you have kids who might want to open the dishwasher or push all the buttons."
        },
        {
          "headline":"Make sure the dishwasher’s door is closed and latched.",
          "description":"Sometimes a bottom rack that isn’t completely in place can keep the door from latching or there could be a utensil getting in the way. When you press the door shut, you should hear a clicking sound that lets you know it’s properly in place. If you can’t see a clear reason for why the latch isn’t working, it’s possible that the latch itself needs to be replaced. Take a look at it to see if it’s visibly broken to determine if that is true.Warning: Never force the dishwasher door shut. It should close and latch with a light amount of pressure. You could damage the door or latch if you have to shove it to get it to close."
        },
        {
          "headline":"Confirm that the “delayed wash” option is not selected.",
          "description":"To cancel the delayed wash, press the “cancel/drain” button and then press “start/resume” to start a normal cycle. The “delayed wash” function can come in handy if you are ready to run the dishwasher but have something else going on at home that is using a lot of water, like an in-use laundry machine or someone taking a shower."
        },
        {
          "headline":"Call a repair technician to fix more complex problems.",
          "description":"It’s always possible that there is a problem with the actual fuse or the computer board, which should both always be worked on by a professional. It could also be that a part of the dishwasher is broken and needs to be replaced. Get a referral from a friend or look online for a company with good reviews. Repairs generally cost about $150.Tip: Ask if the technician would be willing to waive their “trip fee,” which is usually $50-$75, to lower the cost of the repair."
        }
      ]
    }
  ],
  "text":" Resetting the Dishwasher Manually Unplug the dishwasher from the outlet if it isn’t responding to commands. Kind of like you might turn a computer on and off to try and work out some bugs, you can do the same thing with your dishwasher. Leave the dishwasher unplugged for 5 minutes to let the computer reset itself if possible. It won’t hurt anything if you leave the dishwasher unplugged for a longer amount of time.Tip: If your dishwasher is wired directly to the power source, you’ll need to turn off the breaker that powers that room for 5 minutes and then turn it back on. Plug the dishwasher back into the outlet to see if that fixes the problem. Once the 5 minutes have passed, go ahead and plug the dishwasher back in and look at the display panel to see if there are any flashing lights or error codes. Give the dishwasher 5-10 minutes, as it may be recomputing or running a diagnostics test. If an error code is on display, look it up in the user’s manual to see what needs to be done next. If there are no flashing lights or indication that the machine is working, skip ahead to reset the control panel. Run a test cycle by pressing the “heat dry” and “normal” buttons. After unplugging and plugging the machine back in, run a test cycle to see if the machine is working properly before you load it up with dishes. Press “heat dry,” “normal,” “heat dry,” “normal.” Once you see all the lights on the display are illuminated, press “start.” This will take the dishwasher through its cycle so you can make sure everything is working as it should. On some versions of dishwashers, you’ll need to press the first 3 buttons starting on the left side in a 1-2-3 sequence to start the test cycle. Repeat the 1-2-3 sequence 3 times and then press start to trigger the cycle.Tip: If there is an issue in the cycle process, an error code will display on the dishwasher’s screen. From there, you can look up the code and continue troubleshooting. Using the Control Panel and Reset Function Reset the control panel with the “hi-temp” and “dry” buttons. If unplugging and replugging the dishwasher didn’t make a difference and if you can’t successfully run a test cycle, it’s time to reset the actual control panel. Make sure the dishwasher’s door is completely closed and latched. Press the “hi-temp scrub” and “energy saver dry” buttons one after the other until each button has been pressed 5 times. These buttons may also be called “hi-temp” or “heated dry” or something similar depending on your model. Just make sure to press the buttons that have the most similar functions. Some models will reset after each button has been pushed 4 times instead of 5, but don’t worry about that. Just go ahead and press each one 5 times. Leave the dishwasher alone for 5-10 minutes to let it reset. After pushing the reset sequence, you’ll hopefully see all the lights on the display panel flash. You may also hear a whirring noise. Go ahead and leave the dishwasher alone so that it can run diagnostics and recompute before you press any other buttons. On rare occasions, it can take more than the 5-10 minutes. Wait until you no longer see any flashing lights or hear any noises coming from the machine. Press the cancel or cancel/drain button to finish the reset. This triggers a 2-minute drain cycle. Let this cycle completely run its course before you open the dishwasher. Hopefully, this process solved the dishwasher’s problem, but if it didn’t, you may want to consider calling in a professional technician or doing some further troubleshooting yourself. Resetting the control panel gives the entire computer a reboot, which often clears away any programming or user errors. If the problem is related to an actual broken part in the machine, though, it may not work. Troubleshooting Other Problems Check to see if the control lock or child’s lock is engaged. When this function is selected, you won’t be able to turn on the dishwasher. It can sometimes get accidentally selected, so take a quick look to see if the light underneath the button is lit up. To turn off this function, hold the “lock” button down for 4 seconds. The control lock is a great function, especially if you have kids who might want to open the dishwasher or push all the buttons. Make sure the dishwasher’s door is closed and latched. Sometimes a bottom rack that isn’t completely in place can keep the door from latching or there could be a utensil getting in the way. When you press the door shut, you should hear a clicking sound that lets you know it’s properly in place. If you can’t see a clear reason for why the latch isn’t working, it’s possible that the latch itself needs to be replaced. Take a look at it to see if it’s visibly broken to determine if that is true.Warning: Never force the dishwasher door shut. It should close and latch with a light amount of pressure. You could damage the door or latch if you have to shove it to get it to close. Confirm that the “delayed wash” option is not selected. To cancel the delayed wash, press the “cancel/drain” button and then press “start/resume” to start a normal cycle. The “delayed wash” function can come in handy if you are ready to run the dishwasher but have something else going on at home that is using a lot of water, like an in-use laundry machine or someone taking a shower. Call a repair technician to fix more complex problems. It’s always possible that there is a problem with the actual fuse or the computer board, which should both always be worked on by a professional. It could also be that a part of the dishwasher is broken and needs to be replaced. Get a referral from a friend or look online for a company with good reviews. Repairs generally cost about $150.Tip: Ask if the technician would be willing to waive their “trip fee,” which is usually $50-$75, to lower the cost of the repair.",
  "tyn_model":[
    "dishwasher",
    "” and",
    "” buttons",
    "” “",
    "“heat",
    "“start",
    "“hi",
    "” or",
    "” button",
    "“delayed",
    "“normal",
    "dishes",
    "” once",
    "” this",
    "dishwashers",
    "“dry",
    "“hi-temp",
    "“energy saver",
    "“heated",
    "“lock",
    "utensil",
    "dishwasher door",
    "” option",
    "“cancel",
    "” to",
    "” function",
    "“trip",
    "” which"
  ],
  "tyn_section":[

  ]
}