{
  "title":"How to Prune Rhododendrons",
  "url":"https://www.wikihow.com/Prune-Rhododendrons",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Trees and Shrubs"
  ],
  "parts":[
    {
      "name":"Timing Your Pruning",
      "steps":[
        {
          "headline":"Shear your rhododendrons in the winter when you are doing large cuts.",
          "description":"Winter pruning is better for more shocking trims because the plant is dormant, so its energy is not in its leaves or flowers. Cutting in the winter is the best way to ensure that your plant will have new growth after you prune it. Try not to prune during a freeze. If you cut your plant and the cut branches get frozen, the severe cold may damage or shock the plant."
        },
        {
          "headline":"Encourage new flowers by pruning right after a bloom.",
          "description":"If you are just cleaning up your rhododendron or wanting to ensure that your plant gets new flowers next season, you can prune right after your rhododendron is finished blooming. This will be in late spring or early summer, or whenever you notice its flowers dying and no new ones starting to grow. You can cut flowers off your rhododendron in the middle of spring when they are at their peak to get a beautiful bouquet of flowers. This will not hurt your plant."
        },
        {
          "headline":"Prune before the blooming season to reduce the amount of flowers.",
          "description":"You can prune in early spring or late winter to discourage your plant from producing as many flowers, and encourage it to put its energy into growing new branches and leaves. You should do this if you want your rhododendron to grow larger or taller. Rhododendrons are known for their beautiful flowers, so you may want to see your plant with its flowers before you decide to take some away."
        }
      ]
    },
    {
      "name":"Choosing a Pruning Style",
      "steps":[
        {
          "headline":"Cut off dead wood and flowers for a low-maintenance prune.",
          "description":"The easiest style of pruning is trimming off any dead or dying parts of your rhododendron with pruning shears. Dead leaves will look yellow or brown, and dead branches will be crispy and snap easily. Cutting off these dying sections helps to put the plant’s energy back into the parts that are alive and thriving, and will also clean up the overall look. Pruning like this only needs to be done once a year, or whenever you notice your rhododendron needs it. Pruning only the dead parts of your plant will also help promote a more natural, less landscaped look for your rhododendron."
        },
        {
          "headline":"Prune a shape into your plant when you are trying to control its growth.",
          "description":"You can encourage your rhododendron to grow in a certain direction or area by cutting back the parts you want to be smaller, and leaving the parts you want to be larger. This is helpful when your rhododendron is near your house, or when you are trying to keep a more uniformed look. This type of pruning only needs to be done once a year. Rhododendrons will only conform to a shape to a certain extent. They have broad leaves and longer branches, so they may not ever look completely uniform."
        },
        {
          "headline":"Trim it down to 2 feet (0.61 m) above the ground for a new look.",
          "description":"This pruning method is a reset for your plant. You should choose this method if your rhododendron is messy looking or overgrown and you want it to try growing again. Most species of rhododendrons will be able to survive this method of pruning, but a few cannot, so it is worth researching your specific type before using this method. Some healthy rhododendrons can even be cut down to 6 inches (15 cm) above the ground, but it’s recommended that you try 2 feet (0.61 m) first to see if your plant will survive. You should not use this method if your rhododendron is sick or especially old, because it is more likely to be shocked and not revive after such a harsh cut."
        }
      ]
    },
    {
      "name":"Trimming Your Plant",
      "steps":[
        {
          "headline":"Decide what tool you need for your rhododendron size.",
          "description":"Older and more established rhododendrons may need a chainsaw to cut through the large woody branches, especially toward the middle of the plant. Hand saws and pruning shears are helpful for smaller, less established branches, or when you are cutting less of the rhododendron. Tools can break or become dangerous when used improperly. You should always read the manual and operating instructions of any tool before you use it. Ask for professional help if you need it. Large, tree-like rhododendrons can sometimes require an expert to take care of them. You can check with your local landscaping company to see if they offer the services you need."
        },
        {
          "headline":"Cut branches in straight, even strokes.",
          "description":"Try to avoid bending or breaking the branches of your rhododendron. Instead, use your tool to cut the branches evenly and in straight lines. This will cause less damage to your plant, and will lessen the chances of it going into shock or dying. You can make your cuts on any part of the branch, unless you are trying to avoid flowers, in which case you only need to look out for buds or flowering parts of your plant. Place a tarp beneath the area you are cutting for an easier cleanup of branches and leaves. It might be easier to break off the dead branches, which will not hurt your plant, since they are already dead."
        },
        {
          "headline":"Clean up any excess branches and leaves that fall on the ground.",
          "description":"You’ll want to tidy up the space you have been working in once you are done pruning. This will keep your rhododendron looking neat and your yard looking organized. This step is optional, but it is essential if you want your yard to look well-kept. If your city has a yard debris program, you can put your cut branches in your yard debris bin."
        }
      ]
    }
  ],
  "text":" Timing Your Pruning Shear your rhododendrons in the winter when you are doing large cuts. Winter pruning is better for more shocking trims because the plant is dormant, so its energy is not in its leaves or flowers. Cutting in the winter is the best way to ensure that your plant will have new growth after you prune it. Try not to prune during a freeze. If you cut your plant and the cut branches get frozen, the severe cold may damage or shock the plant. Encourage new flowers by pruning right after a bloom. If you are just cleaning up your rhododendron or wanting to ensure that your plant gets new flowers next season, you can prune right after your rhododendron is finished blooming. This will be in late spring or early summer, or whenever you notice its flowers dying and no new ones starting to grow. You can cut flowers off your rhododendron in the middle of spring when they are at their peak to get a beautiful bouquet of flowers. This will not hurt your plant. Prune before the blooming season to reduce the amount of flowers. You can prune in early spring or late winter to discourage your plant from producing as many flowers, and encourage it to put its energy into growing new branches and leaves. You should do this if you want your rhododendron to grow larger or taller. Rhododendrons are known for their beautiful flowers, so you may want to see your plant with its flowers before you decide to take some away. Choosing a Pruning Style Cut off dead wood and flowers for a low-maintenance prune. The easiest style of pruning is trimming off any dead or dying parts of your rhododendron with pruning shears. Dead leaves will look yellow or brown, and dead branches will be crispy and snap easily. Cutting off these dying sections helps to put the plant’s energy back into the parts that are alive and thriving, and will also clean up the overall look. Pruning like this only needs to be done once a year, or whenever you notice your rhododendron needs it. Pruning only the dead parts of your plant will also help promote a more natural, less landscaped look for your rhododendron. Prune a shape into your plant when you are trying to control its growth. You can encourage your rhododendron to grow in a certain direction or area by cutting back the parts you want to be smaller, and leaving the parts you want to be larger. This is helpful when your rhododendron is near your house, or when you are trying to keep a more uniformed look. This type of pruning only needs to be done once a year. Rhododendrons will only conform to a shape to a certain extent. They have broad leaves and longer branches, so they may not ever look completely uniform. Trim it down to 2 feet (0.61 m) above the ground for a new look. This pruning method is a reset for your plant. You should choose this method if your rhododendron is messy looking or overgrown and you want it to try growing again. Most species of rhododendrons will be able to survive this method of pruning, but a few cannot, so it is worth researching your specific type before using this method. Some healthy rhododendrons can even be cut down to 6 inches (15 cm) above the ground, but it’s recommended that you try 2 feet (0.61 m) first to see if your plant will survive. You should not use this method if your rhododendron is sick or especially old, because it is more likely to be shocked and not revive after such a harsh cut. Trimming Your Plant Decide what tool you need for your rhododendron size. Older and more established rhododendrons may need a chainsaw to cut through the large woody branches, especially toward the middle of the plant. Hand saws and pruning shears are helpful for smaller, less established branches, or when you are cutting less of the rhododendron. Tools can break or become dangerous when used improperly. You should always read the manual and operating instructions of any tool before you use it. Ask for professional help if you need it. Large, tree-like rhododendrons can sometimes require an expert to take care of them. You can check with your local landscaping company to see if they offer the services you need. Cut branches in straight, even strokes. Try to avoid bending or breaking the branches of your rhododendron. Instead, use your tool to cut the branches evenly and in straight lines. This will cause less damage to your plant, and will lessen the chances of it going into shock or dying. You can make your cuts on any part of the branch, unless you are trying to avoid flowers, in which case you only need to look out for buds or flowering parts of your plant. Place a tarp beneath the area you are cutting for an easier cleanup of branches and leaves. It might be easier to break off the dead branches, which will not hurt your plant, since they are already dead. Clean up any excess branches and leaves that fall on the ground. You’ll want to tidy up the space you have been working in once you are done pruning. This will keep your rhododendron looking neat and your yard looking organized. This step is optional, but it is essential if you want your yard to look well-kept. If your city has a yard debris program, you can put your cut branches in your yard debris bin.",
  "tyn_model":[
    "prune",
    "rhododendron",
    "pruning shears",
    "flowers",
    "pruning",
    "rhododendrons",
    "chainsaw",
    "hand saws",
    "tools",
    "tarp",
    "yard debris program",
    "yard debris bin"
  ],
  "tyn_section":[

  ]
}