{
  "title":"How to Wash Cotton",
  "url":"https://www.wikihow.com/Wash-Cotton",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Cleaning Fabric"
  ],
  "methods":[
    {
      "name":"Using a Washing Machine",
      "steps":[
        {
          "headline":"Separate white cotton from colored cotton.",
          "description":"White cotton needs to be washed separately from dyed cotton to prevent colors from bleeding. For example, washing a piece of red clothing with a piece of white clothing could lead to some of the red dye getting onto the white fabric. Separate the two piles into different machines, or two baskets to wash one after the other. The \"white\" pile doesn't need to be pure white. Anything you don't want stained by bright colors should go in the white pile. This could include patterned white fabric, muted pastel colors, or light grays."
        },
        {
          "headline":"Load the washing machine.",
          "description":"Avoid overloading the washing machine, as this will lead to your clothes not getting completely clean. To test if the machine is too full, try sinking your hand into the drum. If it doesn't fit or feels tight, the machine is too full. If the machine only had a few items in it, use a \"quick\" or \"small\" setting so that you don't waste water."
        },
        {
          "headline":"Put detergent into the drawer or the drum.",
          "description":"Depending on your washing machine, there may be a designated space to add detergent. If not, add detergent directly into the drum, where you put your clothes. You can also add fabric softener at this point, if you like, and you can add bleach if you are washing white fabric. Bleach is harsh on fabric, so use it sparingly to remove difficult stains on white fabric."
        },
        {
          "headline":"Use a regular, normal, or cotton setting on the washing machine.",
          "description":"\"Normal\" settings on a washing machine are usually created with cotton in mind. This setting has a fast spin cycle and uses warm water. Depending on the manufacturer, this cycle could be called regular, normal, or cotton. Override the warm water of a normal cycle by choosing 30 °C (86 °F) as the temperature. This a gentler and more energy-efficient option for cleaning."
        },
        {
          "headline":"Set your washing machine temperature to cold or 30 °C (86 °F) for colored cotton.",
          "description":"Cool water is the gentlest option for washing cotton. It prevents fabric from shrinking and losing its color. It is also more energy- and cost-efficient than using hot water. 30 °C (86 °F) isn't the coldest water setting, but it is the most effective with most detergents. Some washing machines let you set separate temperatures for the wash and the rinse cycles. Select 30 °C (86 °F) for both. Make sure to use a detergent that is compatible with cold water. Some powdered detergents won't fully dissolve in cold water."
        },
        {
          "headline":"Set your washing machine temperature to hot or at least 60 °C (140 °F) for white fabric.",
          "description":"Wash white fabric at a hotter temperature to remove stains more effectively. If the fabric is heavily stained, use the hottest temperature available. If you chose a normal setting and it automatically set the temperature to \"hot,\" leave the temperature setting as is. Keep in mind that heat can shrink cotton. Check if your cotton is pre-shrunk before washing it in hot water."
        },
        {
          "headline":"Dry cotton on a clothes line or drying rack to prevent shrinking.",
          "description":"Heat can shrink cotton, so it is safest to let it air dry. Hang your freshly-washed cotton in a place where there is a lot of air circulation, like in front of an open window, or turn on a fan in the room where it is drying. Air drying cotton also saves energy and extends the life of your fabric."
        },
        {
          "headline":"Dry your cotton in a clothes dryer for faster results.",
          "description":"Check the tags on your cotton to make sure it is dryer-safe first. Some clothes will specify that they are dryer-safe at a low temperature, so be sure to adjust the settings on the dryer. If you washed cotton in hot water, usually that means it is safe to dry at a hot temperature."
        }
      ]
    },
    {
      "name":"Washing Cotton by Hand",
      "steps":[
        {
          "headline":"Fill a tub with cool to lukewarm water and about 1 teaspoon (4.9 mL) detergent.",
          "description":"Use a mild detergent to be on the safe side, especially if the fabric doesn't have care details listed. Use your hand to swirl the soap around in the water to mix it in. Use more detergent if you are washing a large item or multiple items. As a rule of thumb, use 1 teaspoon (4.9 mL) for each garment."
        },
        {
          "headline":"Submerge the fabric in the water and swirl it around gently in the tub.",
          "description":"Submerge the fabric completely in the water so that it becomes completely soaked. Use your hands to move the fabric around in the tub. Avoid any twisting or scrubbing motions, as this can stretch the fabric."
        },
        {
          "headline":"Drain the tub and fill it with fresh water.",
          "description":"To rinse the fabric, you will need another tub filled with fresh water. Use cool or lukewarm water again. Rinse out the tub to get rid of any soap that might be left behind."
        },
        {
          "headline":"Rinse the fabric in the fresh water.",
          "description":"Sink the fabric completely into the fresh water. Use the same gentle swirling motion to move it around in the water and rinse out the soap. Also push the fabric up and down in the water. You may have to repeat this step with another fresh tub of water to rinse the clothes completely."
        },
        {
          "headline":"Squeeze out excess water, roll the fabric in a towel, and air dry it.",
          "description":"Use a gentle squeezing motion to get excess water out of cotton fabric. Then, roll the fabric up in a clean, dry towel and press down to absorb more water. Let the fabric finish drying on a clothesline or drying rack. Don't wring out cotton fabric. You can also dry the clothes in a clothes dryer, if you prefer."
        }
      ]
    },
    {
      "name":"Getting Stains out of Cotton",
      "steps":[
        {
          "headline":"Soak your stained cotton in water to prevent the stain from setting.",
          "description":"Try to get the stained item in the water as soon as possible for the best results. For dyes, such as makeup, hair dye, or bleed from other clothes, hot water can remove a lot of the stain. For other stains, water can prevent them from setting and make them easier to get out. Use ice water for bloodstains. Hot water cooks the protein in blood and makes stains difficult to remove later. Water usually isn't 100% effective at removing any stain."
        },
        {
          "headline":"Use salt to soak up sweat, red wine, or blood.",
          "description":"Soak the stain in water first, and then apply a layer of salt over the stain. Let the stain sit in the salt and water for at least 2 hours, then rinse it with cold water. The salt will leech the stain out of the fabric. This is most effective if the stain is fresh. The longer a fabric has been stained, the more difficult it will be to get the stain out."
        },
        {
          "headline":"Apply lemon juice or vinegar to coffee, tea, or grass stains.",
          "description":"Soak the fabric where it is stained. Then, squeeze 1 teaspoon (4.9 mL) lemon juice onto the stain, or pour about 1 teaspoon (4.9 mL) of white wine vinegar on the stain. Rinse the fabric out. Vinegar is also effective on sticky residue and mildew. If the stain doesn't come out right away, try letting the lemon or vinegar sit on the stain for about 30 minutes."
        },
        {
          "headline":"Remove grease stains with laundry detergent.",
          "description":"If your cotton is stained with oil or grease, laundry detergent is your best bet for getting it out. You can spot clean fabric with detergent by soaking the stain in water and rubbing it out with a soapy sponge. You can also use dish detergent, but it will be harsher on the fabric. Alternatively, use rubbing alcohol to remove oily stains."
        },
        {
          "headline":"Use glycerin or a stain stick to remove ink stains.",
          "description":"Glycerin draws ink and dye stains out of fabric. You can buy glycerin at craft stores and some pharmacies. Stain sticks are usually available wherever you can buy laundry detergent. Stain sticks are usually made with a combination of glycerin and laundry detergent."
        },
        {
          "headline":"Treat organic stains with enzyme cleaners.",
          "description":"Organic stains include urine, blood, sweat, and other bodily fluid stains. Follow the instructions that come with the enzyme cleaner. In general, spray the cleaner onto the stain and then wash the fabric as you normally do."
        }
      ]
    }
  ],
  "text":" Using a Washing Machine Separate white cotton from colored cotton. White cotton needs to be washed separately from dyed cotton to prevent colors from bleeding. For example, washing a piece of red clothing with a piece of white clothing could lead to some of the red dye getting onto the white fabric. Separate the two piles into different machines, or two baskets to wash one after the other. The \"white\" pile doesn't need to be pure white. Anything you don't want stained by bright colors should go in the white pile. This could include patterned white fabric, muted pastel colors, or light grays. Load the washing machine. Avoid overloading the washing machine, as this will lead to your clothes not getting completely clean. To test if the machine is too full, try sinking your hand into the drum. If it doesn't fit or feels tight, the machine is too full. If the machine only had a few items in it, use a \"quick\" or \"small\" setting so that you don't waste water. Put detergent into the drawer or the drum. Depending on your washing machine, there may be a designated space to add detergent. If not, add detergent directly into the drum, where you put your clothes. You can also add fabric softener at this point, if you like, and you can add bleach if you are washing white fabric. Bleach is harsh on fabric, so use it sparingly to remove difficult stains on white fabric. Use a regular, normal, or cotton setting on the washing machine. \"Normal\" settings on a washing machine are usually created with cotton in mind. This setting has a fast spin cycle and uses warm water. Depending on the manufacturer, this cycle could be called regular, normal, or cotton. Override the warm water of a normal cycle by choosing 30 °C (86 °F) as the temperature. This a gentler and more energy-efficient option for cleaning. Set your washing machine temperature to cold or 30 °C (86 °F) for colored cotton. Cool water is the gentlest option for washing cotton. It prevents fabric from shrinking and losing its color. It is also more energy- and cost-efficient than using hot water. 30 °C (86 °F) isn't the coldest water setting, but it is the most effective with most detergents. Some washing machines let you set separate temperatures for the wash and the rinse cycles. Select 30 °C (86 °F) for both. Make sure to use a detergent that is compatible with cold water. Some powdered detergents won't fully dissolve in cold water. Set your washing machine temperature to hot or at least 60 °C (140 °F) for white fabric. Wash white fabric at a hotter temperature to remove stains more effectively. If the fabric is heavily stained, use the hottest temperature available. If you chose a normal setting and it automatically set the temperature to \"hot,\" leave the temperature setting as is. Keep in mind that heat can shrink cotton. Check if your cotton is pre-shrunk before washing it in hot water. Dry cotton on a clothes line or drying rack to prevent shrinking. Heat can shrink cotton, so it is safest to let it air dry. Hang your freshly-washed cotton in a place where there is a lot of air circulation, like in front of an open window, or turn on a fan in the room where it is drying. Air drying cotton also saves energy and extends the life of your fabric. Dry your cotton in a clothes dryer for faster results. Check the tags on your cotton to make sure it is dryer-safe first. Some clothes will specify that they are dryer-safe at a low temperature, so be sure to adjust the settings on the dryer. If you washed cotton in hot water, usually that means it is safe to dry at a hot temperature. Washing Cotton by Hand Fill a tub with cool to lukewarm water and about 1 teaspoon (4.9 mL) detergent. Use a mild detergent to be on the safe side, especially if the fabric doesn't have care details listed. Use your hand to swirl the soap around in the water to mix it in. Use more detergent if you are washing a large item or multiple items. As a rule of thumb, use 1 teaspoon (4.9 mL) for each garment. Submerge the fabric in the water and swirl it around gently in the tub. Submerge the fabric completely in the water so that it becomes completely soaked. Use your hands to move the fabric around in the tub. Avoid any twisting or scrubbing motions, as this can stretch the fabric. Drain the tub and fill it with fresh water. To rinse the fabric, you will need another tub filled with fresh water. Use cool or lukewarm water again. Rinse out the tub to get rid of any soap that might be left behind. Rinse the fabric in the fresh water. Sink the fabric completely into the fresh water. Use the same gentle swirling motion to move it around in the water and rinse out the soap. Also push the fabric up and down in the water. You may have to repeat this step with another fresh tub of water to rinse the clothes completely. Squeeze out excess water, roll the fabric in a towel, and air dry it. Use a gentle squeezing motion to get excess water out of cotton fabric. Then, roll the fabric up in a clean, dry towel and press down to absorb more water. Let the fabric finish drying on a clothesline or drying rack. Don't wring out cotton fabric. You can also dry the clothes in a clothes dryer, if you prefer. Getting Stains out of Cotton Soak your stained cotton in water to prevent the stain from setting. Try to get the stained item in the water as soon as possible for the best results. For dyes, such as makeup, hair dye, or bleed from other clothes, hot water can remove a lot of the stain. For other stains, water can prevent them from setting and make them easier to get out. Use ice water for bloodstains. Hot water cooks the protein in blood and makes stains difficult to remove later. Water usually isn't 100% effective at removing any stain. Use salt to soak up sweat, red wine, or blood. Soak the stain in water first, and then apply a layer of salt over the stain. Let the stain sit in the salt and water for at least 2 hours, then rinse it with cold water. The salt will leech the stain out of the fabric. This is most effective if the stain is fresh. The longer a fabric has been stained, the more difficult it will be to get the stain out. Apply lemon juice or vinegar to coffee, tea, or grass stains. Soak the fabric where it is stained. Then, squeeze 1 teaspoon (4.9 mL) lemon juice onto the stain, or pour about 1 teaspoon (4.9 mL) of white wine vinegar on the stain. Rinse the fabric out. Vinegar is also effective on sticky residue and mildew. If the stain doesn't come out right away, try letting the lemon or vinegar sit on the stain for about 30 minutes. Remove grease stains with laundry detergent. If your cotton is stained with oil or grease, laundry detergent is your best bet for getting it out. You can spot clean fabric with detergent by soaking the stain in water and rubbing it out with a soapy sponge. You can also use dish detergent, but it will be harsher on the fabric. Alternatively, use rubbing alcohol to remove oily stains. Use glycerin or a stain stick to remove ink stains. Glycerin draws ink and dye stains out of fabric. You can buy glycerin at craft stores and some pharmacies. Stain sticks are usually available wherever you can buy laundry detergent. Stain sticks are usually made with a combination of glycerin and laundry detergent. Treat organic stains with enzyme cleaners. Organic stains include urine, blood, sweat, and other bodily fluid stains. Follow the instructions that come with the enzyme cleaner. In general, spray the cleaner onto the stain and then wash the fabric as you normally do.",
  "tyn_model":[
    "water",
    "detergent",
    "washing machine",
    "tub",
    "salt",
    "laundry detergent",
    "glycerin",
    "vinegar",
    "bleach",
    "cotton",
    "fabric",
    "clothes dryer",
    "lemon juice",
    "machine",
    "fabric softener at",
    "detergents",
    "washing machines",
    "soap",
    "towel",
    "ice water",
    "red wine",
    "white wine vinegar",
    "lemon",
    "soapy sponge",
    "dish detergent",
    "rubbing alcohol",
    "stain stick",
    "enzyme cleaners",
    "enzyme cleaner"
  ],
  "tyn_section":[

  ]
}