{
  "title":"How to Measure Spaghetti",
  "url":"https://www.wikihow.com/Measure-Spaghetti",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles",
    "Spaghetti"
  ],
  "methods":[
    {
      "name":"Measuring with Kitchen Tools",
      "steps":[
        {
          "headline":"Weigh 2 ounces (57 g) of dry spaghetti on a kitchen scale.",
          "description":"This is the most exact method of measuring serving sizes. If you have a kitchen scale, take some of the dry spaghetti out of the box, place it on the scale, and see what the initial measurement is. Then add or remove as necessary to reach the desired amount of pasta servings. If you do not have a kitchen scale, they are available to purchase at many retailers. These are very useful devices for people who enjoy cooking."
        },
        {
          "headline":"Use a spaghetti-measuring tool if one is available.",
          "description":"These are small devices with various-sized holes cut into them, and each hole equals a different number of servings, typically 1 serving up to 4 servings. Take a small amount of dry spaghetti out of the box and put it through the hole that matches the number of servings you want to make. Add spaghetti noodles to fill the hole completely. If you do not already own one of these convenient tools, they are available at many kitchenware stores retailers"
        },
        {
          "headline":"Fill the hole in a pasta spoon to quickly go from measuring to cooking.",
          "description":"If you have always wondered what that hole in your pasta spoon is for, it functions in the same way as a spaghetti-measuring tool! Put a small amount of the dry spaghetti through the hole in the middle of the spoon and add then add noodles until the hole is filled. Once filled, release the spaghetti into the pot. Repeat this as necessary if you are making more than one serving."
        }
      ]
    },
    {
      "name":"Estimating a Serving without Specific Tools",
      "steps":[
        {
          "headline":"Compare the size of a small bunch of noodles to a U.S. quarter.",
          "description":"1 serving of spaghetti, when bunched into a circle, has a diameter of ⁄8 inch (22 mm). This is the same size as a U.S. quarter. If you have one of those around, gather a small bunch of spaghetti and line it up on top of a quarter. Add noodles until the quarter is completely blocked by the spaghetti, but not more than fits on top."
        },
        {
          "headline":"Fit a serving of noodles through the top of a soda bottle.",
          "description":"The hole in the top of a soda bottle just so happens to also be approximately the same diameter as a serving of spaghetti. To measure this way, stand the bottle upright on a table and place a small amount of noodles into the bottle. You should continue to hold the noodles so they don't spread out and mess up the measurement. Add more spaghetti until the bottle's opening is filled in. If you like this method but don't want to have an empty soda bottle taking up counter or storage space, cut off the top and keep it in a drawer. Use it as you would a spaghetti-measuring tool."
        },
        {
          "headline":"Approximate a serving by making a circle with your fingers.",
          "description":"This method is less exact than the others because everyone has different sized hands, but if you don't have the necessary tools for the other methods, it can be a good rough estimate. Make a circle with your thumb and pointer finger; try to approximate the size of a bottle top. Using your other hand so as to not mess up the circle, place the spaghetti noodles through your fingers until the circle is filled."
        },
        {
          "headline":"Divide the box of spaghetti into the amount of servings it holds.",
          "description":"Boxes of spaghetti will have the total number of servings included on the nutrition label. Carefully pour out all of the spaghetti onto a flat surface and divide this pile into equal sections that match the number of servings as stated on the label. Put the piles into bags or containers and use them as needed."
        }
      ]
    }
  ],
  "text":" Measuring with Kitchen Tools Weigh 2 ounces (57 g) of dry spaghetti on a kitchen scale. This is the most exact method of measuring serving sizes. If you have a kitchen scale, take some of the dry spaghetti out of the box, place it on the scale, and see what the initial measurement is. Then add or remove as necessary to reach the desired amount of pasta servings. If you do not have a kitchen scale, they are available to purchase at many retailers. These are very useful devices for people who enjoy cooking. Use a spaghetti-measuring tool if one is available. These are small devices with various-sized holes cut into them, and each hole equals a different number of servings, typically 1 serving up to 4 servings. Take a small amount of dry spaghetti out of the box and put it through the hole that matches the number of servings you want to make. Add spaghetti noodles to fill the hole completely. If you do not already own one of these convenient tools, they are available at many kitchenware stores retailers Fill the hole in a pasta spoon to quickly go from measuring to cooking. If you have always wondered what that hole in your pasta spoon is for, it functions in the same way as a spaghetti-measuring tool! Put a small amount of the dry spaghetti through the hole in the middle of the spoon and add then add noodles until the hole is filled. Once filled, release the spaghetti into the pot. Repeat this as necessary if you are making more than one serving. Estimating a Serving without Specific Tools Compare the size of a small bunch of noodles to a U.S. quarter. 1 serving of spaghetti, when bunched into a circle, has a diameter of ⁄8 inch (22 mm). This is the same size as a U.S. quarter. If you have one of those around, gather a small bunch of spaghetti and line it up on top of a quarter. Add noodles until the quarter is completely blocked by the spaghetti, but not more than fits on top. Fit a serving of noodles through the top of a soda bottle. The hole in the top of a soda bottle just so happens to also be approximately the same diameter as a serving of spaghetti. To measure this way, stand the bottle upright on a table and place a small amount of noodles into the bottle. You should continue to hold the noodles so they don't spread out and mess up the measurement. Add more spaghetti until the bottle's opening is filled in. If you like this method but don't want to have an empty soda bottle taking up counter or storage space, cut off the top and keep it in a drawer. Use it as you would a spaghetti-measuring tool. Approximate a serving by making a circle with your fingers. This method is less exact than the others because everyone has different sized hands, but if you don't have the necessary tools for the other methods, it can be a good rough estimate. Make a circle with your thumb and pointer finger; try to approximate the size of a bottle top. Using your other hand so as to not mess up the circle, place the spaghetti noodles through your fingers until the circle is filled. Divide the box of spaghetti into the amount of servings it holds. Boxes of spaghetti will have the total number of servings included on the nutrition label. Carefully pour out all of the spaghetti onto a flat surface and divide this pile into equal sections that match the number of servings as stated on the label. Put the piles into bags or containers and use them as needed.",
  "tyn_model":[
    "spaghetti",
    "noodles",
    "kitchen scale",
    "soda bottle",
    "spaghetti-measuring tool",
    "spaghetti noodles",
    "pasta spoon",
    "kitchen tools",
    "scale",
    "spoon",
    "pot",
    "bottle top"
  ],
  "tyn_section":[

  ]
}