{
  "title":"How to Know if Chicken Is Cooked",
  "url":"https://www.wikihow.com/Know-if-Chicken-Is-Cooked",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "methods":[
    {
      "name":"Using a Thermometer",
      "steps":[
        {
          "headline":"Choose a meat thermometer.",
          "description":"Buying the right thermometer can make your cooking process much easier. To get the most accurate reading, a digital meat thermometer is best, but an analog thermometer can also be used."
        },
        {
          "headline":"Calibrate your thermometer by reading a freezing temperature.",
          "description":"Fill a large pitcher with ice and cold tap water, and mix thoroughly until the ice is distributed evenly. Place your thermometer into the pitcher of ice/water mixture and wait 30 seconds, or until the temperature reading stays on one number. Adjust your thermometer reading until it stays at 32 °F (0 °C). No matter what kind of thermometer you are using, making sure it is calibrated correctly is essential to ensure you get an accurate temperature reading."
        },
        {
          "headline":"Find the thickest part of the chicken.",
          "description":"Testing the temperature of the thickest part of the meat ensures that your entire piece of chicken is cooked, and not just the thin portions. Identify which area of the chicken has the most meat on it, usually toward the center of the piece."
        },
        {
          "headline":"Insert your thermometer.",
          "description":"Stab your thermometer into the thickest part of the chicken, making sure that the end of the thermometer stays near the middle of the piece. Wait about 30 seconds, or until your thermometer reading becomes steady. Chicken should be cooked until it is 165 °F (74 °C). If your chicken is above these temperatures, it may be overcooked. If it is under these temperatures, it needs more cooking time."
        }
      ]
    },
    {
      "name":"Noticing Visual Cues",
      "steps":[
        {
          "headline":"Test the firmness of the meat to make sure it is cooked.",
          "description":"When cooking, chicken loses moisture and will tighten up. Raw chicken feels rubbery or wobbly, while cooked chicken should feel firm and spring back from your touch. A good example of what cooked chicken should feel like can be felt by keeping your hand limp and pressing your middle finger to your thumb."
        },
        {
          "headline":"Check for white/clear juice to test whether your chicken is ready.",
          "description":"While cooking, there is often juice that collects in the pan or dish that your chicken is cooking in. Cooked chicken juice will be a white/clear color, while uncooked chicken juice will be more pink. Checking the color of the juice to test whether meat is done is a trick that only works for chicken, and not other types of meat."
        },
        {
          "headline":"Determine if your chicken has shrunk in size to see if it is cooked.",
          "description":"Uncooked chicken holds a lot of moisture which is expelled during the cooking process. Meat also tends to shrink while cooking, because the muscle fibers contract. Your cooked chicken piece will be slightly smaller than the piece of uncooked chicken that you started with."
        },
        {
          "headline":"Look for a white meat color to see if your chicken is cooked.",
          "description":"Raw or undercooked chicken has a pink tone to it. By cutting open the thickest part of your chicken and looking at the color, you can identify whether your chicken needs more cook time or not. Cooked chicken will be white on the inside with no pinkish hue, and a golden brown on the outside."
        }
      ]
    }
  ],
  "text":" Using a Thermometer Choose a meat thermometer. Buying the right thermometer can make your cooking process much easier. To get the most accurate reading, a digital meat thermometer is best, but an analog thermometer can also be used. Calibrate your thermometer by reading a freezing temperature. Fill a large pitcher with ice and cold tap water, and mix thoroughly until the ice is distributed evenly. Place your thermometer into the pitcher of ice/water mixture and wait 30 seconds, or until the temperature reading stays on one number. Adjust your thermometer reading until it stays at 32 °F (0 °C). No matter what kind of thermometer you are using, making sure it is calibrated correctly is essential to ensure you get an accurate temperature reading. Find the thickest part of the chicken. Testing the temperature of the thickest part of the meat ensures that your entire piece of chicken is cooked, and not just the thin portions. Identify which area of the chicken has the most meat on it, usually toward the center of the piece. Insert your thermometer. Stab your thermometer into the thickest part of the chicken, making sure that the end of the thermometer stays near the middle of the piece. Wait about 30 seconds, or until your thermometer reading becomes steady. Chicken should be cooked until it is 165 °F (74 °C). If your chicken is above these temperatures, it may be overcooked. If it is under these temperatures, it needs more cooking time. Noticing Visual Cues Test the firmness of the meat to make sure it is cooked. When cooking, chicken loses moisture and will tighten up. Raw chicken feels rubbery or wobbly, while cooked chicken should feel firm and spring back from your touch. A good example of what cooked chicken should feel like can be felt by keeping your hand limp and pressing your middle finger to your thumb. Check for white/clear juice to test whether your chicken is ready. While cooking, there is often juice that collects in the pan or dish that your chicken is cooking in. Cooked chicken juice will be a white/clear color, while uncooked chicken juice will be more pink. Checking the color of the juice to test whether meat is done is a trick that only works for chicken, and not other types of meat. Determine if your chicken has shrunk in size to see if it is cooked. Uncooked chicken holds a lot of moisture which is expelled during the cooking process. Meat also tends to shrink while cooking, because the muscle fibers contract. Your cooked chicken piece will be slightly smaller than the piece of uncooked chicken that you started with. Look for a white meat color to see if your chicken is cooked. Raw or undercooked chicken has a pink tone to it. By cutting open the thickest part of your chicken and looking at the color, you can identify whether your chicken needs more cook time or not. Cooked chicken will be white on the inside with no pinkish hue, and a golden brown on the outside.",
  "tyn_model":[
    "chicken",
    "thermometer",
    "ice",
    "large pitcher",
    "tap water",
    "pitcher",
    "water"
  ],
  "tyn_section":[

  ]
}