{
  "title":"How to Order an Iced Coffee at Starbucks",
  "url":"https://www.wikihow.com/Order-an-Iced-Coffee-at-Starbucks",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee",
    "Commercial Coffee",
    "Starbucks Coffee"
  ],
  "methods":[
    {
      "name":"Choosing Your Coffee",
      "steps":[
        {
          "headline":"Order a basic iced coffee if you want to modify it yourself.",
          "description":"An iced coffee is just that: ice and coffee. This plain drink is nice for people who like to add their own cream and sugar, or for those who like black coffee."
        },
        {
          "headline":"Buy a cold brew iced coffee.",
          "description":"Cold brewed iced coffees have been brewed in cold water, so they are made specifically to be iced. Many people find that cold brew coffees are smoother and have a richer taste than typical iced coffee that is brewed hot. Cold brew is a newer item on the Starbucks menu, so it may not have as many options as classic iced coffees do."
        },
        {
          "headline":"Try a flavored iced coffee if you want something sweeter.",
          "description":"Starbucks offers flavored iced coffees like vanilla, caramel, and mocha. These iced coffee options are nice when you don't want to spend time flavoring your own coffee, but still want something that tastes good."
        },
        {
          "headline":"Explore seasonal iced coffee flavors.",
          "description":"Many Starbucks locations offer seasonal syrup or sweetener flavors. Some even offer promotional deals to popularize these seasonal flavors. These menu items should be front and center at any Starbucks that has them. Larger holidays like Christmas usually inspire many new items on the Starbucks menu. One of the most popular seasonal flavors that is offered at Starbucks is the Pumpkin Spice flavor."
        }
      ]
    },
    {
      "name":"Deciding Your Add-Ons",
      "steps":[
        {
          "headline":"Add espresso if you want more caffeine.",
          "description":"Shots of espresso can be added to almost any drink, including iced coffee, for an additional fee. Iced coffee does not usually contain extra espresso, so if you are looking for a boost, this may be the way to go."
        },
        {
          "headline":"Include vanilla sweet cream if you want a smoother taste.",
          "description":"Starbucks' vanilla sweet cream provides the taste of vanilla while still staying true to a cream and sugar coffee. This is a good option for those who like a coffee taste, but still want to cut the bitterness of black coffee."
        },
        {
          "headline":"Order coconut milk or soy milk if you are dairy-free.",
          "description":"Starbucks offers two dairy free options so that you do not have to use cow's milk in your order. Coconut milk and soy milk can be substituted or added to any drink, including iced coffee. Starbucks has recently introduced oat milk into their shops, but only in select locations."
        }
      ]
    },
    {
      "name":"Ordering Your Drink",
      "steps":[
        {
          "headline":"Decide on your cup size.",
          "description":"Starbucks coffee comes in 4 standard sizes: tall (12 ounces (340 g)), grande (16 ounces (450 g)), venti (24 ounces (680 g)), and trenta (31 ounces (880 g)). The size of the coffee should be the first thing that you order, so it should also be the first thing that you decide. Remember that iced coffee will have ice in it, meaning that there may be less actual coffee in your cup."
        },
        {
          "headline":"Know what you want before you order.",
          "description":"Coffee shops move fast, and Starbucks is no exception. Knowing your order before you go up to a barista can be helpful both to you and the customers in line behind you."
        },
        {
          "headline":"State your whole order at once.",
          "description":"If your iced coffee has add-ons, make sure to specify those in your order so that they don't get forgotten. Telling the barista your whole order and not trying to add additional flavors/sweeteners afterward can speed up and simplify your ordering process. For example, say something like “tall iced coffee with cream and sugar,” or “grande vanilla iced coffee.”"
        },
        {
          "headline":"Order your coffee online if you're in a rush.",
          "description":"Starbucks now has the option to place an order on their website or on their app. This feature is helpful if you are in a rush, have a large order, or simply want to skip the line. Ordering online also removes the stress of having to order quickly."
        },
        {
          "headline":"Ask questions if you need to.",
          "description":"If you are confused about something on the menu or if you're unsure of what to get, don't be afraid to ask your barista questions so you get the iced coffee that you want. All baristas know the menu well and will be able to help you make a decision or offer suggestions on what to order."
        }
      ]
    }
  ],
  "text":" Choosing Your Coffee Order a basic iced coffee if you want to modify it yourself. An iced coffee is just that: ice and coffee. This plain drink is nice for people who like to add their own cream and sugar, or for those who like black coffee. Buy a cold brew iced coffee. Cold brewed iced coffees have been brewed in cold water, so they are made specifically to be iced. Many people find that cold brew coffees are smoother and have a richer taste than typical iced coffee that is brewed hot. Cold brew is a newer item on the Starbucks menu, so it may not have as many options as classic iced coffees do. Try a flavored iced coffee if you want something sweeter. Starbucks offers flavored iced coffees like vanilla, caramel, and mocha. These iced coffee options are nice when you don't want to spend time flavoring your own coffee, but still want something that tastes good. Explore seasonal iced coffee flavors. Many Starbucks locations offer seasonal syrup or sweetener flavors. Some even offer promotional deals to popularize these seasonal flavors. These menu items should be front and center at any Starbucks that has them. Larger holidays like Christmas usually inspire many new items on the Starbucks menu. One of the most popular seasonal flavors that is offered at Starbucks is the Pumpkin Spice flavor. Deciding Your Add-Ons Add espresso if you want more caffeine. Shots of espresso can be added to almost any drink, including iced coffee, for an additional fee. Iced coffee does not usually contain extra espresso, so if you are looking for a boost, this may be the way to go. Include vanilla sweet cream if you want a smoother taste. Starbucks' vanilla sweet cream provides the taste of vanilla while still staying true to a cream and sugar coffee. This is a good option for those who like a coffee taste, but still want to cut the bitterness of black coffee. Order coconut milk or soy milk if you are dairy-free. Starbucks offers two dairy free options so that you do not have to use cow's milk in your order. Coconut milk and soy milk can be substituted or added to any drink, including iced coffee. Starbucks has recently introduced oat milk into their shops, but only in select locations. Ordering Your Drink Decide on your cup size. Starbucks coffee comes in 4 standard sizes: tall (12 ounces (340 g)), grande (16 ounces (450 g)), venti (24 ounces (680 g)), and trenta (31 ounces (880 g)). The size of the coffee should be the first thing that you order, so it should also be the first thing that you decide. Remember that iced coffee will have ice in it, meaning that there may be less actual coffee in your cup. Know what you want before you order. Coffee shops move fast, and Starbucks is no exception. Knowing your order before you go up to a barista can be helpful both to you and the customers in line behind you. State your whole order at once. If your iced coffee has add-ons, make sure to specify those in your order so that they don't get forgotten. Telling the barista your whole order and not trying to add additional flavors/sweeteners afterward can speed up and simplify your ordering process. For example, say something like “tall iced coffee with cream and sugar,” or “grande vanilla iced coffee.” Order your coffee online if you're in a rush. Starbucks now has the option to place an order on their website or on their app. This feature is helpful if you are in a rush, have a large order, or simply want to skip the line. Ordering online also removes the stress of having to order quickly. Ask questions if you need to. If you are confused about something on the menu or if you're unsure of what to get, don't be afraid to ask your barista questions so you get the iced coffee that you want. All baristas know the menu well and will be able to help you make a decision or offer suggestions on what to order.",
  "tyn_model":[
    "iced coffee",
    "coffee",
    "iced coffees",
    "espresso",
    "vanilla sweet cream",
    "coconut milk",
    "soy milk",
    "cold brew iced coffee",
    "water",
    "cold brew coffees",
    "cold brew",
    "pumpkin spice",
    "cream and sugar coffee",
    "oat milk",
    "“tall",
    "” or",
    "“grande",
    "” order",
    "starbucks"
  ],
  "tyn_section":[

  ]
}