{
  "title":"How to Play Winston In Overwatch",
  "url":"https://www.wikihow.com/Play-Winston-In-Overwatch",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games"
  ],
  "steps":[
    {
      "headline":"Learn who Winston can easily beat.",
      "description":"Winston is good in a battle against Genji, Hanzo, and Widowmaker. Avoid characters like McCree, Mei, and Reaper when battling. Winston is weaker against those characters. Winston doesn't do well in medium to long-range fights."
    },
    {
      "headline":"Use Tesla Cannon as your main DPS.",
      "description":"Although this gun is weaker compared to other Overwatch characters' guns, this cannon will bypass any protective armor or barrier between you and your enemy. It'll auto-aim to your enemy, and, if there are enemies standing closely together, the cannon might hit both of them."
    },
    {
      "headline":"Use your Barrier Projector strategically.",
      "description":"Since the Barrier Projector pops up around Winston, make sure you are placed in the right place before you activate it. People standing inside the barrier can fire at enemies without worrying about return fire. You can also use a barrier projector on top of turrets to prevent them from working."
    },
    {
      "headline":"Use Jump Pack to move into fights.",
      "description":"When you land from Jump Pack, you'll cause damage to those near your landing site. You can use Jump Pack to exit a fight quickly if your health dips too low. Winston's Jump Pack ability launches you forward in the direction the camera is aimed."
    },
    {
      "headline":"Use Primal Rage when Winston is low on health.",
      "description":"This ultimate ability heals Winston completely, shortens the cooldown of Jump Pack, and adds a push-back ability to hits."
    }
  ],
  "text":" Learn who Winston can easily beat. Winston is good in a battle against Genji, Hanzo, and Widowmaker. Avoid characters like McCree, Mei, and Reaper when battling. Winston is weaker against those characters. Winston doesn't do well in medium to long-range fights. Use Tesla Cannon as your main DPS. Although this gun is weaker compared to other Overwatch characters' guns, this cannon will bypass any protective armor or barrier between you and your enemy. It'll auto-aim to your enemy, and, if there are enemies standing closely together, the cannon might hit both of them. Use your Barrier Projector strategically. Since the Barrier Projector pops up around Winston, make sure you are placed in the right place before you activate it. People standing inside the barrier can fire at enemies without worrying about return fire. You can also use a barrier projector on top of turrets to prevent them from working. Use Jump Pack to move into fights. When you land from Jump Pack, you'll cause damage to those near your landing site. You can use Jump Pack to exit a fight quickly if your health dips too low. Winston's Jump Pack ability launches you forward in the direction the camera is aimed. Use Primal Rage when Winston is low on health. This ultimate ability heals Winston completely, shortens the cooldown of Jump Pack, and adds a push-back ability to hits.",
  "tyn_model":[
    "barrier projector",
    "cannon",
    "tesla cannon",
    "guns",
    "primal rage",
    "jump pack"
  ],
  "tyn_section":[

  ]
}