{
  "title":"How to Use Garam Masala",
  "url":"https://www.wikihow.com/Use-Garam-Masala",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine"
  ],
  "methods":[
    {
      "name":"Seasoning Main Courses with Garam Masala",
      "steps":[
        {
          "headline":"Apply a garam masala dry rub to meats.",
          "description":"Garam masala adds a strong flavor to meats cooked on the grill or in the oven. You can use it by itself or combine it with other spices like onion powder, pepper, salt, and coriander. Mix the spices together in a bowl and apply a layer to the entire surface of any meat you're cooking. Coat the meat in olive oil to help the dry rub stick. Make sure to cover the top and bottom of the meat. If you’re cooking a whole chicken, coat the inside of the chicken as well. Use the “wet hand-dry hand” method of dry rub application. Take a handful of rub in one hand and sprinkle it on the meat, then use the other hand to rub the spices around. Continue this method until you’ve covered every surface of the meat. Let the meat sit for 30 minutes to absorb the dry rub."
        },
        {
          "headline":"Sprinkle garam masala into your soup.",
          "description":"This adds a nice spice to any soup. Take a pinch between your fingers and sprinkle it into your soup. Give the soup a stir and taste it. Add as much as you want. This adds a real kick to homemade soups. Make your favorite soup and sprinkle in the garam masala in for a unique flavor. You could also apply garam masala dry rub to any meats you use in your soup."
        },
        {
          "headline":"Mix garam masala into your chili.",
          "description":"Mix up the traditional spices in chili by adding in garam masala. Whether you're using beef, turkey, or vegetables, this spice will give you an interesting twist for your chili recipe. For extra flavor, toss and rub the meat and vegetables in garam masala before cooking the chili. Let the ingredients sit for 30 minutes so they absorb the flavor."
        },
        {
          "headline":"Add 1/2 teaspoon (2.84 g) to fish fillets.",
          "description":"Tilapia, salmon, snapper, and many other fish pair well with garam masala. Brush the fillet with olive oil or butter. Then rub it with 1/2 teaspoon (2.84 g) before cooking it. Remember to rub the spice on both sides of the fish. If you want more spice, increase the amount to 1 teaspoon (5.69 g). You can also mix the garam masala with other spices for a blend of flavors."
        }
      ]
    },
    {
      "name":"Spicing Up Side Dishes",
      "steps":[
        {
          "headline":"Toss vegetables in garam masala.",
          "description":"Garam masala pairs especially well with vegetables. Put all the vegetables you’re using into a large mixing bowl. Then  add 1–3 tablespoons (15–44 ml) of olive oil so the spices stick to the vegetables. Finally sprinkle 1 tablespoon (14.3 g) of garam masala over the vegetables. Use your hands or a spoon to mix the vegetables together and ensure they all get a coating of spice. You could do this with raw vegetables, but if you roast them beforehand, they will absorb the spices better."
        },
        {
          "headline":"Make garam masala salad dressing.",
          "description":"For a unique salad dressing, sprinkle 1 teaspoon (5 ml) of garam masala into extra virgin olive oil. Add any other spices you like too, like salt and pepper, and mix it all together in a bowl. Then drizzle the dressing on your favorite salad. This dressing could work on any salad. Garam masala pairs especially well with lentils and carrots. Experiment by making different salads and seeing what this dressing works best with."
        },
        {
          "headline":"Spice mayonnaise with garam masala.",
          "description":"It's extremely easy to spice up sandwiches, sauces, and eggs with seasoned mayonnaise. Add some garam masala to the mayo and stir it in for an even spice. Then add it to all the dishes you normally use mayonnaise in. Add just a sprinkle to a small amount of mayonnaise first to make sure you like the taste. If you need more, add up to 1 teaspoon (5.69 g) for a unique mayo flavor."
        },
        {
          "headline":"Sprinkle garam masala on baked potatoes.",
          "description":"Give your baked potatoes a brand new flavor with Indian spices. You can rub the potatoes in garam masala before baking them, or just sprinkle a little on when they're already done. Add the spice to mashed potatoes as well. You could also mix some garam masala into the sour cream you top the baked potato with."
        },
        {
          "headline":"Make garam masala apple butter.",
          "description":"Apple butter already uses spices like cinnamon for flavor, so adding to those spices with some garam masala creates bold new flavors. You can then spread the butter on breads or crackers for a snack or appetizer. You can buy apple butter already made and add the garam masala, or you can make your own and mix in the spice with the ingredients."
        }
      ]
    },
    {
      "name":"Mixing Garam Masala into Desserts",
      "steps":[
        {
          "headline":"Make samosas.",
          "description":"Samosas are a traditional Indian dessert specifically designed to use garam masala. They are easy to prepare from scratch. Try making them for a sweet yet spicy dessert choice. If you're just getting started adding garam masala to desserts, samosas are a good place to begin because they are supposed to have this spice. Get used to how garam masala tastes in a dessert and gain more knowledge on using it in others."
        },
        {
          "headline":"Add garam masala to cupcakes.",
          "description":"Cupcakes are a perfect dessert for a group of people. You can spice up regular cupcakes by sprinkling some garam masala into the batter, or you can search for specific recipes that blend the spice with other flavors. You can also sprinkle some into cupcake frosting for a unique flavor."
        },
        {
          "headline":"Mix garam masala into gingerbread cookies.",
          "description":"Garam masala pairs well with the spices that are already present in gingerbread cookies. Adding the spice to a gingerbread recipe adds a new flavor to this classic treat."
        }
      ]
    },
    {
      "name":"Using Garam Masala Effectively",
      "steps":[
        {
          "headline":"Add a small amount of spice at a time.",
          "description":"Some people find garam masala overpowering, and it's very easy to add too much. Don't go overboard when you're just starting out with the spice. Start off with adding 1/2 teaspoon (2.84 g) to dishes to get a feel for the spice and decide if you like it. If you want to increase the serving, do it by 1/2 teaspoon (2.84 g) at a time."
        },
        {
          "headline":"Make small servings first.",
          "description":"Rather than mixing garam masala into an entire meal, start out by making smaller dishes and portions. That way, if you don't like the taste of the spice, you  haven't wasted a lot of food."
        },
        {
          "headline":"Store the spice in an airtight jar to preserve flavor.",
          "description":"Garam masala loses its flavor over time if it's exposed to air. Keep yours sealed in an airtight jar to prevent it from losing flavor over time. Place the jar in a cupboard away from direct sunlight for the best results."
        },
        {
          "headline":"Try making your own garam masala for the best flavor.",
          "description":"While you can easily buy garam masala in a store, many experts say that homemade varieties are much better. Find out for yourself by mixing up your own batch. This allows you to add, increase, or decrease certain ingredients for your own personal flavor. The most common base ingredients for garam masala are garlic, peppercorns, cardamon, nutmeg, cumin, and coriander. There are many additional recipes for the spice on the internet. Experiment and find your favorite."
        }
      ]
    }
  ],
  "text":" Seasoning Main Courses with Garam Masala Apply a garam masala dry rub to meats. Garam masala adds a strong flavor to meats cooked on the grill or in the oven. You can use it by itself or combine it with other spices like onion powder, pepper, salt, and coriander. Mix the spices together in a bowl and apply a layer to the entire surface of any meat you're cooking. Coat the meat in olive oil to help the dry rub stick. Make sure to cover the top and bottom of the meat. If you’re cooking a whole chicken, coat the inside of the chicken as well. Use the “wet hand-dry hand” method of dry rub application. Take a handful of rub in one hand and sprinkle it on the meat, then use the other hand to rub the spices around. Continue this method until you’ve covered every surface of the meat. Let the meat sit for 30 minutes to absorb the dry rub. Sprinkle garam masala into your soup. This adds a nice spice to any soup. Take a pinch between your fingers and sprinkle it into your soup. Give the soup a stir and taste it. Add as much as you want. This adds a real kick to homemade soups. Make your favorite soup and sprinkle in the garam masala in for a unique flavor. You could also apply garam masala dry rub to any meats you use in your soup. Mix garam masala into your chili. Mix up the traditional spices in chili by adding in garam masala. Whether you're using beef, turkey, or vegetables, this spice will give you an interesting twist for your chili recipe. For extra flavor, toss and rub the meat and vegetables in garam masala before cooking the chili. Let the ingredients sit for 30 minutes so they absorb the flavor. Add 1/2 teaspoon (2.84 g) to fish fillets. Tilapia, salmon, snapper, and many other fish pair well with garam masala. Brush the fillet with olive oil or butter. Then rub it with 1/2 teaspoon (2.84 g) before cooking it. Remember to rub the spice on both sides of the fish. If you want more spice, increase the amount to 1 teaspoon (5.69 g). You can also mix the garam masala with other spices for a blend of flavors. Spicing Up Side Dishes Toss vegetables in garam masala. Garam masala pairs especially well with vegetables. Put all the vegetables you’re using into a large mixing bowl. Then  add 1–3 tablespoons (15–44 ml) of olive oil so the spices stick to the vegetables. Finally sprinkle 1 tablespoon (14.3 g) of garam masala over the vegetables. Use your hands or a spoon to mix the vegetables together and ensure they all get a coating of spice. You could do this with raw vegetables, but if you roast them beforehand, they will absorb the spices better. Make garam masala salad dressing. For a unique salad dressing, sprinkle 1 teaspoon (5 ml) of garam masala into extra virgin olive oil. Add any other spices you like too, like salt and pepper, and mix it all together in a bowl. Then drizzle the dressing on your favorite salad. This dressing could work on any salad. Garam masala pairs especially well with lentils and carrots. Experiment by making different salads and seeing what this dressing works best with. Spice mayonnaise with garam masala. It's extremely easy to spice up sandwiches, sauces, and eggs with seasoned mayonnaise. Add some garam masala to the mayo and stir it in for an even spice. Then add it to all the dishes you normally use mayonnaise in. Add just a sprinkle to a small amount of mayonnaise first to make sure you like the taste. If you need more, add up to 1 teaspoon (5.69 g) for a unique mayo flavor. Sprinkle garam masala on baked potatoes. Give your baked potatoes a brand new flavor with Indian spices. You can rub the potatoes in garam masala before baking them, or just sprinkle a little on when they're already done. Add the spice to mashed potatoes as well. You could also mix some garam masala into the sour cream you top the baked potato with. Make garam masala apple butter. Apple butter already uses spices like cinnamon for flavor, so adding to those spices with some garam masala creates bold new flavors. You can then spread the butter on breads or crackers for a snack or appetizer. You can buy apple butter already made and add the garam masala, or you can make your own and mix in the spice with the ingredients. Mixing Garam Masala into Desserts Make samosas. Samosas are a traditional Indian dessert specifically designed to use garam masala. They are easy to prepare from scratch. Try making them for a sweet yet spicy dessert choice. If you're just getting started adding garam masala to desserts, samosas are a good place to begin because they are supposed to have this spice. Get used to how garam masala tastes in a dessert and gain more knowledge on using it in others. Add garam masala to cupcakes. Cupcakes are a perfect dessert for a group of people. You can spice up regular cupcakes by sprinkling some garam masala into the batter, or you can search for specific recipes that blend the spice with other flavors. You can also sprinkle some into cupcake frosting for a unique flavor. Mix garam masala into gingerbread cookies. Garam masala pairs well with the spices that are already present in gingerbread cookies. Adding the spice to a gingerbread recipe adds a new flavor to this classic treat. Using Garam Masala Effectively Add a small amount of spice at a time. Some people find garam masala overpowering, and it's very easy to add too much. Don't go overboard when you're just starting out with the spice. Start off with adding 1/2 teaspoon (2.84 g) to dishes to get a feel for the spice and decide if you like it. If you want to increase the serving, do it by 1/2 teaspoon (2.84 g) at a time. Make small servings first. Rather than mixing garam masala into an entire meal, start out by making smaller dishes and portions. That way, if you don't like the taste of the spice, you  haven't wasted a lot of food. Store the spice in an airtight jar to preserve flavor. Garam masala loses its flavor over time if it's exposed to air. Keep yours sealed in an airtight jar to prevent it from losing flavor over time. Place the jar in a cupboard away from direct sunlight for the best results. Try making your own garam masala for the best flavor. While you can easily buy garam masala in a store, many experts say that homemade varieties are much better. Find out for yourself by mixing up your own batch. This allows you to add, increase, or decrease certain ingredients for your own personal flavor. The most common base ingredients for garam masala are garlic, peppercorns, cardamon, nutmeg, cumin, and coriander. There are many additional recipes for the spice on the internet. Experiment and find your favorite.",
  "tyn_model":[
    "garam masala",
    "spices",
    "mayonnaise",
    "olive oil",
    "apple butter",
    "samosas",
    "pepper",
    "salt",
    "coriander",
    "bowl",
    "chicken",
    "chili",
    "butter",
    "vegetables",
    "baked potatoes",
    "cupcakes",
    "gingerbread cookies",
    "airtight jar",
    "grill",
    "onion powder",
    "“wet",
    "” method",
    "fish fillets",
    "salmon",
    "snapper",
    "large mixing bowl",
    "spoon",
    "garam masala salad dressing",
    "extra virgin olive oil",
    "carrots",
    "eggs",
    "mayo",
    "sour cream",
    "baked potato",
    "desserts",
    "cupcake frosting",
    "garlic",
    "peppercorns",
    "cardamon",
    "nutmeg",
    "cumin"
  ],
  "tyn_section":[

  ]
}