{
  "title":"How to Clean a Wooden Chair",
  "url":"https://www.wikihow.com/Clean-a-Wooden-Chair",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "parts":[
    {
      "name":"Choosing Cleaning Supplies",
      "steps":[
        {
          "headline":"Avoid harsh chemicals.",
          "description":"Wooden furniture is either raw, untouched wood, or wood coated with stain or varnish. Either of these can be very easily damaged by chemical cleaners or strong detergents. Avoid using any drying cleaner or one not specifically intended for wood to avoid doing damage to the raw wood or the furniture's varnish. Even some cleaners claiming to be made for wood can be too harsh. Avoid anything using intense sudsing agents such as sulfates. Although safer alternatives might not lather, you do not need a lather in order to thoroughly clean."
        },
        {
          "headline":"Enlist cleansing oils.",
          "description":"One of the easiest ways to clean wood is to use an oil-based cleaner. Water-based cleaners can be too strong, while oil-based cleaners simultaneously cleanse the wood while infusing it with a conditioning treatment. The most common oil is mineral, but you can also use a vegetable oil-based treatment. When searching for a cleaner, one with mineral spirits will contain a conditioning oil as well as a gentle stripping agent. This can be picked up at most home improvement stores."
        },
        {
          "headline":"Search for wood-specific cleaner.",
          "description":"Try to avoid using all-purpose cleaners, as these are not formulated for delicate materials. Instead, use a cleaning solution created specifically for use on wood. This could be a store-bought cleaner, or you can make your own using an oil soap such as Dr. Bronner's castille soap. Murphy's Oil Soap is one formula intended for wood, and is typically mild enough to clean without doing damage."
        },
        {
          "headline":"Use lint-free rags.",
          "description":"To avoid snagging on any loose strips of wood or leaving lint behind, use lint-free rags for cleaning, such as those made with microfiber. These allow you to clean the wood thoroughly, leaving a streak-free, lint-free finish. Cheesecloth can also be helpful in cleaning wood, as it is extremely porous, but picks up dust well and does not leave any fabric behind."
        }
      ]
    },
    {
      "name":"Cleaning the Chair",
      "steps":[
        {
          "headline":"Dust the surface lightly.",
          "description":"Before using a cleaning/polishing cream, lightly dust off the surface using a feather duster or a clean, dry rag or vacuum. This does not have to be an involved task, but a simple brush-down of the visible surface. Failing to dust the furniture first could result in pressing dust further into the wood grain. Always complete a small dusting before you do any deep cleaning."
        },
        {
          "headline":"Apply the cleaner to your rag.",
          "description":"Apply your cleaner to your rag--not directly to the wood. Applying cleaner to the wood can eat away some of the finish or leave a stain, while applying it to the rag first will ensure you apply the cleaner evenly. This is true of all cleaners except vinegar and water. If using vinegar and water, you must submerge your rag in the mixture and wring it out until damp. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tDo a spot test to make sure your cleaner is safe for the furniture. Choose your cleaner, like a mixture of warm water and a couple of drops of dish soap. Then, dip a cotton ball in the solution and wipe it across an inconspicuous area of the furniture, then dry it with a microfiber cloth. If there's no damage, clean the rest of the furniture with a soft cloth dampened with the cleaning solution, and wipe it away gently. Finish by drying the area with your microfiber cloth."
        },
        {
          "headline":"Swipe the wood in long, clean strokes.",
          "description":"To make sure the cleaner is applied well, swipe your rag over the wood in long strokes, keeping the weight of your hand consistent. Once you've gone over every portion of the wood, go back one more time, using a wiping motion. The length of time will depend on the cleaner, but most cleaners require you to leave it on the wood for 10-20 minutes before moving on to the next step. Try to work with the grain of the wood, instead of against it. This will help prevent splinters and applying an uneven coat."
        },
        {
          "headline":"Wipe up any remaining cleanser.",
          "description":"Glance over the surface of the wood to find any stray wood cleaner, and wipe it away to prevent streaking or damaging the wood or varnish. This will catch any remaining cleaner and will make sure the cleaner has covered every surface evenly. Once again, use a lint-free rag if possible to avoid leaving behind bits of fabric. This step is particularly important if you are using an oil-based cleaner, as leftover oil can cause staining."
        }
      ]
    },
    {
      "name":"Sealing Your Work",
      "steps":[
        {
          "headline":"Allow the chair to dry.",
          "description":"Allow your chair to dry after wiping it down. This should only take between 10 and 20 minutes. To speed the drying time, you can place a fan overhead or beside the chair and turn it on high. If you are using a water-based cleaner, do not leave standing water on the wood to dry. Instead, wipe up any remaining water with a clean rag."
        },
        {
          "headline":"Condition with wood butter.",
          "description":"To seal the wood, apply wood butter. This will not only prevent staining, but will make future cleaning endeavors far easier, as most dirt and grime will slide right off of the conditioned wood. There are many commercial waxes and wood butters available on the market. You can make your own wood butter with some vegetable oil (olive and coconut work well) and beeswax."
        },
        {
          "headline":"Perform regular maintenance.",
          "description":"To make sure your chair stays in excellent working order, reseal using your wood butter every couple of months. This will make sure the chair is protected from dust and moisture, and will keep the appearance of the wood smooth and supple. Maintenance application does not have to be an all-over application. You can search for areas of the chair that have worn down or tarnished and apply your wood butter to those areas alone."
        }
      ]
    }
  ],
  "text":" Choosing Cleaning Supplies Avoid harsh chemicals. Wooden furniture is either raw, untouched wood, or wood coated with stain or varnish. Either of these can be very easily damaged by chemical cleaners or strong detergents. Avoid using any drying cleaner or one not specifically intended for wood to avoid doing damage to the raw wood or the furniture's varnish. Even some cleaners claiming to be made for wood can be too harsh. Avoid anything using intense sudsing agents such as sulfates. Although safer alternatives might not lather, you do not need a lather in order to thoroughly clean. Enlist cleansing oils. One of the easiest ways to clean wood is to use an oil-based cleaner. Water-based cleaners can be too strong, while oil-based cleaners simultaneously cleanse the wood while infusing it with a conditioning treatment. The most common oil is mineral, but you can also use a vegetable oil-based treatment. When searching for a cleaner, one with mineral spirits will contain a conditioning oil as well as a gentle stripping agent. This can be picked up at most home improvement stores. Search for wood-specific cleaner. Try to avoid using all-purpose cleaners, as these are not formulated for delicate materials. Instead, use a cleaning solution created specifically for use on wood. This could be a store-bought cleaner, or you can make your own using an oil soap such as Dr. Bronner's castille soap. Murphy's Oil Soap is one formula intended for wood, and is typically mild enough to clean without doing damage. Use lint-free rags. To avoid snagging on any loose strips of wood or leaving lint behind, use lint-free rags for cleaning, such as those made with microfiber. These allow you to clean the wood thoroughly, leaving a streak-free, lint-free finish. Cheesecloth can also be helpful in cleaning wood, as it is extremely porous, but picks up dust well and does not leave any fabric behind. Cleaning the Chair Dust the surface lightly. Before using a cleaning/polishing cream, lightly dust off the surface using a feather duster or a clean, dry rag or vacuum. This does not have to be an involved task, but a simple brush-down of the visible surface. Failing to dust the furniture first could result in pressing dust further into the wood grain. Always complete a small dusting before you do any deep cleaning. Apply the cleaner to your rag. Apply your cleaner to your rag--not directly to the wood. Applying cleaner to the wood can eat away some of the finish or leave a stain, while applying it to the rag first will ensure you apply the cleaner evenly. This is true of all cleaners except vinegar and water. If using vinegar and water, you must submerge your rag in the mixture and wring it out until damp. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tDo a spot test to make sure your cleaner is safe for the furniture. Choose your cleaner, like a mixture of warm water and a couple of drops of dish soap. Then, dip a cotton ball in the solution and wipe it across an inconspicuous area of the furniture, then dry it with a microfiber cloth. If there's no damage, clean the rest of the furniture with a soft cloth dampened with the cleaning solution, and wipe it away gently. Finish by drying the area with your microfiber cloth. Swipe the wood in long, clean strokes. To make sure the cleaner is applied well, swipe your rag over the wood in long strokes, keeping the weight of your hand consistent. Once you've gone over every portion of the wood, go back one more time, using a wiping motion. The length of time will depend on the cleaner, but most cleaners require you to leave it on the wood for 10-20 minutes before moving on to the next step. Try to work with the grain of the wood, instead of against it. This will help prevent splinters and applying an uneven coat. Wipe up any remaining cleanser. Glance over the surface of the wood to find any stray wood cleaner, and wipe it away to prevent streaking or damaging the wood or varnish. This will catch any remaining cleaner and will make sure the cleaner has covered every surface evenly. Once again, use a lint-free rag if possible to avoid leaving behind bits of fabric. This step is particularly important if you are using an oil-based cleaner, as leftover oil can cause staining. Sealing Your Work Allow the chair to dry. Allow your chair to dry after wiping it down. This should only take between 10 and 20 minutes. To speed the drying time, you can place a fan overhead or beside the chair and turn it on high. If you are using a water-based cleaner, do not leave standing water on the wood to dry. Instead, wipe up any remaining water with a clean rag. Condition with wood butter. To seal the wood, apply wood butter. This will not only prevent staining, but will make future cleaning endeavors far easier, as most dirt and grime will slide right off of the conditioned wood. There are many commercial waxes and wood butters available on the market. You can make your own wood butter with some vegetable oil (olive and coconut work well) and beeswax. Perform regular maintenance. To make sure your chair stays in excellent working order, reseal using your wood butter every couple of months. This will make sure the chair is protected from dust and moisture, and will keep the appearance of the wood smooth and supple. Maintenance application does not have to be an all-over application. You can search for areas of the chair that have worn down or tarnished and apply your wood butter to those areas alone.",
  "tyn_model":[
    "cleaner",
    "wood butter",
    "cleaners",
    "water",
    "oil-based cleaner",
    "vinegar",
    "microfiber cloth",
    "chemical cleaners",
    "drying cleaner",
    "cleansing oils",
    "oil-based cleaners",
    "vegetable oil-based treatment",
    "mineral spirits",
    "gentle stripping agent",
    "oil soap",
    "castille soap",
    "murphy's oil soap",
    "lint-free rags",
    "cheesecloth",
    "cleaning/polishing cream",
    "feather duster",
    "vacuum",
    "dish soap",
    "cotton ball",
    "cleanser",
    "wood cleaner",
    "varnish",
    "fan",
    "water-based cleaner",
    "wood butters",
    "vegetable oil",
    "beeswax."
  ],
  "tyn_section":[

  ]
}