{
  "title":"How to Change Halogen Light Bulbs",
  "url":"https://www.wikihow.com/Change-Halogen-Light-Bulbs",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Light Bulbs"
  ],
  "parts":[
    {
      "name":"Switching off the Power and Collecting Essentials",
      "steps":[
        {
          "headline":"Switch the power source off to make sure you don’t injure yourself.",
          "description":"Switch the power off if your light is connected through the wall, or unplug your light source if possible. If you’re ever in doubt as to whether the light is truly off or not, turn the power off using the fuse box to be sure. If you don’t switch the power source off, you could get electrocuted or badly injured due to the running electricity in the light bulb. Look for the fuse box in your garage, basement, or closet. Sometimes they may be attached to your house outdoors. You can turn off the main power switch in the fuse box, which will be the largest switch. You can also cut the power to the specific room you're working in if your fuse box is labeled with each room."
        },
        {
          "headline":"Cover your hands with gloves or a rag so you don’t touch the bulb.",
          "description":"Touching a halogen light bulb with your bare hands can ruin the bulb or make it last a shorter period of time due to the oils on your fingers. Put on thin fabric gloves or cover your hand with a cloth so you’re ready to change the bulb. Make sure your hands are dry before touching the bulb, even if they’ll be covered up."
        },
        {
          "headline":"Use a stable chair or ladder to change hard-to-reach bulbs.",
          "description":"Because many halogen light bulbs are in the ceiling or high light fixtures, it may be necessary to find something sturdy to stand on to reach the light bulb more easily. Use a step stool or chair that props you up enough that you can see and reach the light bulb easily. Avoid standing on your tip-toes to reach the light bulb—you need to be stable and balanced to be able to replace it properly."
        },
        {
          "headline":"Let the bulb sit for at least 10 minutes to cool down before touching it.",
          "description":"Halogen light bulbs can get very hot when they’re on. After turning the lights off, wait about 10 minutes for the bulb to cool down before you start changing it. Do a quick touch test to see if the bulb is cool enough after the 10 minutes have passed. If changing your halogen light bulb requires you to unclip the bulb using a metal prong, it’s best to wait 20 minutes for the metal to cool down."
        },
        {
          "headline":"Replace your halogen light bulb with a bulb of the same type.",
          "description":"There are several different kinds of halogen light bulbs, such as a G4, G9, GU10, and so on. Make sure you’ve purchased the correct replacement for your light bulb, noting the specific type as well as the wattage of your old one. If you’re not sure what type of halogen light bulb you have, unscrew it from its fixture and look for labeling that will tell you exactly what kind it is. The fixtures are often marked with stickers or other labels telling you the voltage, wattage, and specific type of halogen bulb needed. For example, G4 and G9 halogen bulbs are very small, while GU10 and MR16 light bulbs are larger and often found in ceilings around the house."
        }
      ]
    },
    {
      "name":"Removing the Halogen Bulb",
      "steps":[
        {
          "headline":"Loosen the light bulb by twisting or pulling on the enclosure, if necessary.",
          "description":"Some halogen bulbs can be pulled out directly, while others will be held in place with things like a clip or an outer ring. Squeeze the metal clip together to remove the fixture, or twist the outer ring to the left until the fixture comes out. Use needle nose pliers to remove the metal clip, if desired. If you see three bumps spaced evenly around the trim, grip the trim using the bumps and twist the fixture to the left to remove it. Put aside any clips or enclosures that you removed so you don’t lose them."
        },
        {
          "headline":"Bring the wiring down so you can see the connection.",
          "description":"After you twist or pull on the fixture’s trim, the light bulb should loosen from the ceiling or other fixture, remaining attached to the ceiling by the wiring. Pull the bulb close to you so you can see the socket that the bulb is attached to. As you’re looking at the socket that's attached to the wiring, see if the bulb will require twisting to loosen it, or if you can just pull it straight out. If your bulb needs twisting, the socket will be rounded and closed around the end of the bulb. A bulb that just needs to be pulled out won't have a real socket around it."
        },
        {
          "headline":"Pull the halogen bulb straight out if it doesn’t require twisting.",
          "description":"Smaller types of halogen light bulbs, like a G9 or G4, don’t require twisting to remove them. Simply grasp the bulb using your covered fingers or a tool, and pull directly outwards. The prongs will come loose from the notches and the bulb will be completely removed."
        },
        {
          "headline":"Twist the bulb to the left and pull it out, if twisting is required.",
          "description":"If you need to twist the bulb to loosen it, you’ll see that the bulb is attached by a rounded disk. Grasp the bulb and twist it in one movement to the left. This should release the bulb. Pull the bulb directly outwards, and it will come completely loose. It’s often necessary to twist the bulb out for larger halogen light bulbs like a GU10 or MR16. The two prongs will come loose from the round disk after you twist and pull outwards."
        }
      ]
    },
    {
      "name":"Installing the New Light Bulb",
      "steps":[
        {
          "headline":"Remove the new bulb from the packaging with your fingers still covered.",
          "description":"Because you’re now handling the brand-new light bulb, it’s especially important to remember not to touch the bulb with your bare fingers. Take the new halogen bulb out of its packaging, double-checking to make sure it’s the right kind that will fit the specific fixture."
        },
        {
          "headline":"Line up the prongs to fit in the grooves correctly and push them in.",
          "description":"Your new halogen bulb will have two prongs just like the old one. Line the prongs up so that they fit into the grooves of the fixture. Push inwards until the grooves are fully connected. The prongs should only need a light push to move into the grooves. If you’re having to push hard and they’re still not going in, check to see if there’s something like a small piece of metal blocking their path."
        },
        {
          "headline":"Twist the halogen bulb to the right to lock it in place, if needed.",
          "description":"If you had to twist your bulb to the left to remove it from the wiring and fixture, you’ll need to twist it to the right to lock it back in place once the prongs are attached. Twist it to the right until it no longer moves and is reattached to the wiring."
        },
        {
          "headline":"Reattach any protective covering that you removed earlier.",
          "description":"Hold the light in the fixture with one hand and use the other hand to reattach any coverings or metal rings. If it had a metal ring, push the ring back into place around the bulb until it clicks in. If you unscrewed the trim around the light to remove it, press the trim so it’s flush against the fixture and twist it to the right to reattach it. Use pliers to reattach the metal wire if desired, making it easier to push the round metal ring into place."
        },
        {
          "headline":"Turn on the power to see if your new light bulb works.",
          "description":"Once the halogen bulb is fully installed, you can plug back in any cords that you previously unplugged. Turn the power source back on and enjoy your newly installed halogen light."
        }
      ]
    }
  ],
  "text":" Switching off the Power and Collecting Essentials Switch the power source off to make sure you don’t injure yourself. Switch the power off if your light is connected through the wall, or unplug your light source if possible. If you’re ever in doubt as to whether the light is truly off or not, turn the power off using the fuse box to be sure. If you don’t switch the power source off, you could get electrocuted or badly injured due to the running electricity in the light bulb. Look for the fuse box in your garage, basement, or closet. Sometimes they may be attached to your house outdoors. You can turn off the main power switch in the fuse box, which will be the largest switch. You can also cut the power to the specific room you're working in if your fuse box is labeled with each room. Cover your hands with gloves or a rag so you don’t touch the bulb. Touching a halogen light bulb with your bare hands can ruin the bulb or make it last a shorter period of time due to the oils on your fingers. Put on thin fabric gloves or cover your hand with a cloth so you’re ready to change the bulb. Make sure your hands are dry before touching the bulb, even if they’ll be covered up. Use a stable chair or ladder to change hard-to-reach bulbs. Because many halogen light bulbs are in the ceiling or high light fixtures, it may be necessary to find something sturdy to stand on to reach the light bulb more easily. Use a step stool or chair that props you up enough that you can see and reach the light bulb easily. Avoid standing on your tip-toes to reach the light bulb—you need to be stable and balanced to be able to replace it properly. Let the bulb sit for at least 10 minutes to cool down before touching it. Halogen light bulbs can get very hot when they’re on. After turning the lights off, wait about 10 minutes for the bulb to cool down before you start changing it. Do a quick touch test to see if the bulb is cool enough after the 10 minutes have passed. If changing your halogen light bulb requires you to unclip the bulb using a metal prong, it’s best to wait 20 minutes for the metal to cool down. Replace your halogen light bulb with a bulb of the same type. There are several different kinds of halogen light bulbs, such as a G4, G9, GU10, and so on. Make sure you’ve purchased the correct replacement for your light bulb, noting the specific type as well as the wattage of your old one. If you’re not sure what type of halogen light bulb you have, unscrew it from its fixture and look for labeling that will tell you exactly what kind it is. The fixtures are often marked with stickers or other labels telling you the voltage, wattage, and specific type of halogen bulb needed. For example, G4 and G9 halogen bulbs are very small, while GU10 and MR16 light bulbs are larger and often found in ceilings around the house. Removing the Halogen Bulb Loosen the light bulb by twisting or pulling on the enclosure, if necessary. Some halogen bulbs can be pulled out directly, while others will be held in place with things like a clip or an outer ring. Squeeze the metal clip together to remove the fixture, or twist the outer ring to the left until the fixture comes out. Use needle nose pliers to remove the metal clip, if desired. If you see three bumps spaced evenly around the trim, grip the trim using the bumps and twist the fixture to the left to remove it. Put aside any clips or enclosures that you removed so you don’t lose them. Bring the wiring down so you can see the connection. After you twist or pull on the fixture’s trim, the light bulb should loosen from the ceiling or other fixture, remaining attached to the ceiling by the wiring. Pull the bulb close to you so you can see the socket that the bulb is attached to. As you’re looking at the socket that's attached to the wiring, see if the bulb will require twisting to loosen it, or if you can just pull it straight out. If your bulb needs twisting, the socket will be rounded and closed around the end of the bulb. A bulb that just needs to be pulled out won't have a real socket around it. Pull the halogen bulb straight out if it doesn’t require twisting. Smaller types of halogen light bulbs, like a G9 or G4, don’t require twisting to remove them. Simply grasp the bulb using your covered fingers or a tool, and pull directly outwards. The prongs will come loose from the notches and the bulb will be completely removed. Twist the bulb to the left and pull it out, if twisting is required. If you need to twist the bulb to loosen it, you’ll see that the bulb is attached by a rounded disk. Grasp the bulb and twist it in one movement to the left. This should release the bulb. Pull the bulb directly outwards, and it will come completely loose. It’s often necessary to twist the bulb out for larger halogen light bulbs like a GU10 or MR16. The two prongs will come loose from the round disk after you twist and pull outwards. Installing the New Light Bulb Remove the new bulb from the packaging with your fingers still covered. Because you’re now handling the brand-new light bulb, it’s especially important to remember not to touch the bulb with your bare fingers. Take the new halogen bulb out of its packaging, double-checking to make sure it’s the right kind that will fit the specific fixture. Line up the prongs to fit in the grooves correctly and push them in. Your new halogen bulb will have two prongs just like the old one. Line the prongs up so that they fit into the grooves of the fixture. Push inwards until the grooves are fully connected. The prongs should only need a light push to move into the grooves. If you’re having to push hard and they’re still not going in, check to see if there’s something like a small piece of metal blocking their path. Twist the halogen bulb to the right to lock it in place, if needed. If you had to twist your bulb to the left to remove it from the wiring and fixture, you’ll need to twist it to the right to lock it back in place once the prongs are attached. Twist it to the right until it no longer moves and is reattached to the wiring. Reattach any protective covering that you removed earlier. Hold the light in the fixture with one hand and use the other hand to reattach any coverings or metal rings. If it had a metal ring, push the ring back into place around the bulb until it clicks in. If you unscrewed the trim around the light to remove it, press the trim so it’s flush against the fixture and twist it to the right to reattach it. Use pliers to reattach the metal wire if desired, making it easier to push the round metal ring into place. Turn on the power to see if your new light bulb works. Once the halogen bulb is fully installed, you can plug back in any cords that you previously unplugged. Turn the power source back on and enjoy your newly installed halogen light.",
  "tyn_model":[
    "halogen bulb",
    "halogen light bulbs",
    "halogen light bulb",
    "bulb",
    "fuse box",
    "halogen bulbs",
    "light bulb",
    "gloves",
    "rag",
    "stable chair",
    "ladder",
    "step stool",
    "—you",
    "needle nose pliers",
    "light",
    "pliers",
    "halogen light"
  ],
  "tyn_section":[

  ]
}