{
  "title":"How to Use Hemp for Health Benefits",
  "url":"https://www.wikihow.com/Use-Hemp-for-Health-Benefits",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Taking Hemp Oil Orally",
      "steps":[
        {
          "headline":"Buy a bottle of hemp oil tincture from a health store or the internet.",
          "description":"A tincture is a type of compound that can be absorbed orally. Hemp oil in this form is increasingly available for purchase from numerous outlets. Look for a bottle at a local pharmacy, vitamin store, or on the internet. Hemp oil comes in different flavors, because its natural flavor is sometimes too earthy for people, so consider buying a flavored variety if that's an important consideration for you. When considering a hemp product, always investigate the manufacturer before making a purchase. Start with an internet search to see if there are any complaints or violations listed against a manufacturer. Then, contact manufacturers and ask for their full supplement facts, ingredients, and how they produce their hemp oil. Reputable companies should be transparent about their practices and shouldn't delay in providing you this information. Be skeptical of manufacturers that make wild health claims. For example, a few doses of hemp oil will not cure cancer. Manufacturers that make such claims are exaggerating and you shouldn't trust them."
        },
        {
          "headline":"Read the dosage instructions on the product you buy.",
          "description":"There is currently no universal dosage for hemp oil, and different products come with their own instructions. Check the instructions on any product you buy. The most common instructions are to use 1 or 2 drops once or twice per day. Start with a low dose when you are just starting with hemp oil. This helps avoid adverse reactions and lets your body get used to it. One drop is a good starting point. Clinical trials have shown that 1500 mg of hemp daily is safe, so keep that in mind and do not exceed this amount. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJamie Corroon, ND, MPH\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMedical Director of the Center for Medical Cannabis Education\t\t\t\t\t\t\t\tDr. Jamie Corroon, ND, MPH is the founder and Medical Director of the Center for Medical Cannabis Education. Dr. Corroon is a licensed Naturopathic Doctor and clinical researcher. In addition to clinical practice, Dr. Corroon advises dietary supplement and cannabis companies regarding science, regulation, and product development. He is well published in the peer-review literature, with recent publications that investigate the clinical and public health implications of the broadening acceptance of cannabis in society. He earned a Masters in Public Health (MPH) in Epidemiology from San Diego State University. He also earned a Doctor of Naturopathic Medicine degree from Bastyr University, subsequently completed two years of residency at the Bastyr Center for Natural Health, and is a former adjunct professor at Bastyr University California. Jamie Corroon, ND, MPH\t\t\tMedical Director of the Center for Medical Cannabis Education\t\t\t\tDid You Know? The amount of THC present in a CBD product can vary widely, and depending on the amount you take and the frequency with which you use the product, it could potentially lead to a failed drug screen. If failing a drug test would have significant consequences for you, it's best to confirm the absence of THC in the product by viewing a Certificate of Analysis from the manufacturer."
        },
        {
          "headline":"Place the oil under your tongue and leave it there for 60 to 90 seconds.",
          "description":"Your body doesn't absorb hemp oil properly if you swallow it right away. It only absorbs efficiently through the membranes in your mouth. Take the hemp oil dose and place it under your tongue. Press your tongue down and wait 60 to 90 seconds before swallowing the oil. If the hemp oil you bought doesn’t come with a dropper, dip your finger into the oil and rub it under your tongue instead. Rinse your mouth out with water or juice if you don’t like the aftertaste."
        },
        {
          "headline":"Mix hemp oil into drinks for a better taste.",
          "description":"Some people are turned off by the earthy, nutty flavor of hemp oil and find it difficult to take orally. Luckily, hemp oil can also be mixed into water or juices to mask its flavor. Take the dosage amount and mix it into a drink of your choice. Stir well so the oil is distributed throughout the drink. When you sip the drink, hold the liquid under your tongue for 60 to 90 seconds so you can absorb the hemp. If you swallow the hemp without keeping it in your mouth, your body won’t absorb many nutrients. There are also hemp-infused drinks that give you the same benefit of mixing hemp oil into your own drinks."
        }
      ]
    },
    {
      "name":"Applying Hemp Topically",
      "steps":[
        {
          "headline":"Rub hemp oil directly into your dry skin.",
          "description":"Hemp oil can be applied to directly to your skin as a moisturizer. Pour a small amount onto your hand and massage it into your skin. Apply the oil to all dry or cracked areas. Hemp oil has shown effectiveness against eczema and psoriasis, so try rubbing the oil onto affected areas if you experience these conditions. If you apply the oil to your hands or feet, consider wearing gloves or socks so it doesn’t rub off before your skin absorbs it."
        },
        {
          "headline":"Use a hemp-infused cream for dry skin.",
          "description":"With hemp’s ability to moisturize skin, many beauty products are incorporating hemp and other cannabis products into creams. These creams are applied topically. If you suffer from dry skin, eczema, or psoriasis, hemp-infused creams may help moisturize your skin. There are many types of hemp creams available. The most common are moisturizing hand creams and face masks. Hair care products are also incorporating hemp. Use caution when buying hemp beauty products. Studies have shown that some products less hemp than they claim. Contact the manufacturer you’re considering buying from and ask for the full product facts and ingredients. Also ask about their production techniques and how they infuse hemp into their products. If they delay in providing this for you, don’t buy their product."
        },
        {
          "headline":"Massage hemp oil into sore muscles and joints.",
          "description":"Hemp oil has anti-inflammatory qualities and has shown promise in treat joint pain and injuries. Take advantage of this quality by rubbing the oil onto your sore spots. Massage it well so it soaks into the skin. If you suffer from arthritis, sciatica, or another chronic pain disorder, using hemp topically may be right for you. There are also specialized hemp or CBD massages, where the masseuse uses these oils instead of regular massage oil. Consider looking into this if you get massages regularly."
        }
      ]
    },
    {
      "name":"Using Hemp in Your Cooking",
      "steps":[
        {
          "headline":"Snack on plain hemp seeds.",
          "description":"Hemp seeds are edible on their own, and snacking on them gives you a good dose of fatty acids. They are about the size of a shelled sunflower seed, so you can easily grab a handful for a snack. Stores like Whole Foods carry bags of plain hemp seeds. Chew the seeds well. They’re small and can get stuck in your throat if you accidentally swallow them whole."
        },
        {
          "headline":"Sprinkle hemp seeds into cereal, smoothies, or yogurt.",
          "description":"Hemp seeds can also be paired with other foods. They make a great replacement for granola in yogurt, and can thicken smoothies. You can also sprinkle some seeds onto a salad for extra flavor and crunch."
        },
        {
          "headline":"Drizzle hemp oil on salads or pastas.",
          "description":"Hemp oil should be used as a finishing oil, because the cooking process will burn off most of its nutrients. Get the full benefit by topping off salads, pastas, or hummus with some hemp oil. To make hemp oil salad dressing, replace olive oil with hemp oil in the same quantities in your recipes. If you find hemp oil’s taste a bit overpowering, try diluting it by mixing it with extra virgin olive oil."
        },
        {
          "headline":"Store unused hemp seeds and oil in a refrigerated airtight container.",
          "description":"If you don’t use all the hemp seeds or oil at once, keeping them refrigerated will maximize freshness. In a refrigerated airtight container, they should stay fresh for about a year. Unrefrigerated, the seeds will only stay fresh for 3-4 months. The oil will spoil more quickly."
        }
      ]
    }
  ],
  "text":" Taking Hemp Oil Orally Buy a bottle of hemp oil tincture from a health store or the internet. A tincture is a type of compound that can be absorbed orally. Hemp oil in this form is increasingly available for purchase from numerous outlets. Look for a bottle at a local pharmacy, vitamin store, or on the internet. Hemp oil comes in different flavors, because its natural flavor is sometimes too earthy for people, so consider buying a flavored variety if that's an important consideration for you. When considering a hemp product, always investigate the manufacturer before making a purchase. Start with an internet search to see if there are any complaints or violations listed against a manufacturer. Then, contact manufacturers and ask for their full supplement facts, ingredients, and how they produce their hemp oil. Reputable companies should be transparent about their practices and shouldn't delay in providing you this information. Be skeptical of manufacturers that make wild health claims. For example, a few doses of hemp oil will not cure cancer. Manufacturers that make such claims are exaggerating and you shouldn't trust them. Read the dosage instructions on the product you buy. There is currently no universal dosage for hemp oil, and different products come with their own instructions. Check the instructions on any product you buy. The most common instructions are to use 1 or 2 drops once or twice per day. Start with a low dose when you are just starting with hemp oil. This helps avoid adverse reactions and lets your body get used to it. One drop is a good starting point. Clinical trials have shown that 1500 mg of hemp daily is safe, so keep that in mind and do not exceed this amount. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJamie Corroon, ND, MPH\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMedical Director of the Center for Medical Cannabis Education\t\t\t\t\t\t\t\tDr. Jamie Corroon, ND, MPH is the founder and Medical Director of the Center for Medical Cannabis Education. Dr. Corroon is a licensed Naturopathic Doctor and clinical researcher. In addition to clinical practice, Dr. Corroon advises dietary supplement and cannabis companies regarding science, regulation, and product development. He is well published in the peer-review literature, with recent publications that investigate the clinical and public health implications of the broadening acceptance of cannabis in society. He earned a Masters in Public Health (MPH) in Epidemiology from San Diego State University. He also earned a Doctor of Naturopathic Medicine degree from Bastyr University, subsequently completed two years of residency at the Bastyr Center for Natural Health, and is a former adjunct professor at Bastyr University California. Jamie Corroon, ND, MPH\t\t\tMedical Director of the Center for Medical Cannabis Education\t\t\t\tDid You Know? The amount of THC present in a CBD product can vary widely, and depending on the amount you take and the frequency with which you use the product, it could potentially lead to a failed drug screen. If failing a drug test would have significant consequences for you, it's best to confirm the absence of THC in the product by viewing a Certificate of Analysis from the manufacturer. Place the oil under your tongue and leave it there for 60 to 90 seconds. Your body doesn't absorb hemp oil properly if you swallow it right away. It only absorbs efficiently through the membranes in your mouth. Take the hemp oil dose and place it under your tongue. Press your tongue down and wait 60 to 90 seconds before swallowing the oil. If the hemp oil you bought doesn’t come with a dropper, dip your finger into the oil and rub it under your tongue instead. Rinse your mouth out with water or juice if you don’t like the aftertaste. Mix hemp oil into drinks for a better taste. Some people are turned off by the earthy, nutty flavor of hemp oil and find it difficult to take orally. Luckily, hemp oil can also be mixed into water or juices to mask its flavor. Take the dosage amount and mix it into a drink of your choice. Stir well so the oil is distributed throughout the drink. When you sip the drink, hold the liquid under your tongue for 60 to 90 seconds so you can absorb the hemp. If you swallow the hemp without keeping it in your mouth, your body won’t absorb many nutrients. There are also hemp-infused drinks that give you the same benefit of mixing hemp oil into your own drinks. Applying Hemp Topically Rub hemp oil directly into your dry skin. Hemp oil can be applied to directly to your skin as a moisturizer. Pour a small amount onto your hand and massage it into your skin. Apply the oil to all dry or cracked areas. Hemp oil has shown effectiveness against eczema and psoriasis, so try rubbing the oil onto affected areas if you experience these conditions. If you apply the oil to your hands or feet, consider wearing gloves or socks so it doesn’t rub off before your skin absorbs it. Use a hemp-infused cream for dry skin. With hemp’s ability to moisturize skin, many beauty products are incorporating hemp and other cannabis products into creams. These creams are applied topically. If you suffer from dry skin, eczema, or psoriasis, hemp-infused creams may help moisturize your skin. There are many types of hemp creams available. The most common are moisturizing hand creams and face masks. Hair care products are also incorporating hemp. Use caution when buying hemp beauty products. Studies have shown that some products less hemp than they claim. Contact the manufacturer you’re considering buying from and ask for the full product facts and ingredients. Also ask about their production techniques and how they infuse hemp into their products. If they delay in providing this for you, don’t buy their product. Massage hemp oil into sore muscles and joints. Hemp oil has anti-inflammatory qualities and has shown promise in treat joint pain and injuries. Take advantage of this quality by rubbing the oil onto your sore spots. Massage it well so it soaks into the skin. If you suffer from arthritis, sciatica, or another chronic pain disorder, using hemp topically may be right for you. There are also specialized hemp or CBD massages, where the masseuse uses these oils instead of regular massage oil. Consider looking into this if you get massages regularly. Using Hemp in Your Cooking Snack on plain hemp seeds. Hemp seeds are edible on their own, and snacking on them gives you a good dose of fatty acids. They are about the size of a shelled sunflower seed, so you can easily grab a handful for a snack. Stores like Whole Foods carry bags of plain hemp seeds. Chew the seeds well. They’re small and can get stuck in your throat if you accidentally swallow them whole. Sprinkle hemp seeds into cereal, smoothies, or yogurt. Hemp seeds can also be paired with other foods. They make a great replacement for granola in yogurt, and can thicken smoothies. You can also sprinkle some seeds onto a salad for extra flavor and crunch. Drizzle hemp oil on salads or pastas. Hemp oil should be used as a finishing oil, because the cooking process will burn off most of its nutrients. Get the full benefit by topping off salads, pastas, or hummus with some hemp oil. To make hemp oil salad dressing, replace olive oil with hemp oil in the same quantities in your recipes. If you find hemp oil’s taste a bit overpowering, try diluting it by mixing it with extra virgin olive oil. Store unused hemp seeds and oil in a refrigerated airtight container. If you don’t use all the hemp seeds or oil at once, keeping them refrigerated will maximize freshness. In a refrigerated airtight container, they should stay fresh for about a year. Unrefrigerated, the seeds will only stay fresh for 3-4 months. The oil will spoil more quickly.",
  "tyn_model":[
    "hemp oil",
    "hemp",
    "hemp seeds",
    "oil",
    "medical cannabis",
    "corroon",
    "water",
    "yogurt",
    "naturopathic doctor",
    "dietary supplement",
    "cannabis",
    "public health",
    "naturopathic medicine",
    "natural health,",
    "cbd product",
    "hemp-infused cream",
    "hemp-",
    "hemp creams",
    "granola",
    "salad",
    "olive oil",
    "extra virgin olive oil",
    "airtight container"
  ],
  "tyn_section":[

  ]
}