{
  "title":"How to Make Nobby Buns",
  "url":"https://www.wikihow.com/Make-Nobby-Buns",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "steps":[
    {
      "headline":"Soften the butter.",
      "description":"Take it out of the fridge and wait approximately 10 minutes. The butter should not be hard to touch, and you should be able to make noticeable dents in it with your fingers."
    },
    {
      "headline":"Preheat the oven.",
      "description":"Set the temperature to 375 to 400 °F (191 to 204 °C). It will take some time (5 to 15 minutes, depending on your oven) for the oven to reach that temperature, so proceed to the next steps meanwhile. Prepare a shallow baking pan by placing a silicone baking sheet, parchment paper, or similar nonstick surface over it."
    },
    {
      "headline":"Put the butter into a big bowl and mix it with the sugar.",
      "description":"Use a mixer on a low speed. Mix until the butter stops being one block in the middle of the bowl, and is spread across the floor of the bowl. Ideally, it should also be mixed with most of the sugar."
    },
    {
      "headline":"Add the 3 eggs.",
      "description":"Open each egg and add its entire content (both the white and the yolk) to the bowl. Mix until everything in the bowl becomes a light-yellow homogeneous mass, like in the above picture."
    },
    {
      "headline":"Mix in the cinnamon and flour.",
      "description":"Continue mixing on low speed until everything is evenly combined. The result should now look like cookie dough."
    },
    {
      "headline":"Drop small heaps of the dough onto the baking sheet with a teaspoon.",
      "description":"If the dough is too sticky for this to work, use your hands instead of a teaspoon, but make sure that the heaps are approximately the same size. If you have not done so already, place the baking sheet on the baking pan."
    },
    {
      "headline":"Put the baking pan with the nobby buns into the oven.",
      "description":"Wear oven gloves and be careful, as the oven is very hot now."
    },
    {
      "headline":"Bake 7–10 minutes.",
      "description":"The smaller you made the buns, the less time they need to bake. To test whether the nobby buns are baked enough, stick a toothpick into one of them and look if any dough sticks to it or if any of the dough is still obviously gooey. In both cases, the buns are not baked enough."
    },
    {
      "headline":"Turn off the oven and take out the cookies.",
      "description":"The cookies are very hot, so either use a fork to collect them or wait some minutes until they become cold enough to touch. Wear oven gloves while touching anything inside the oven."
    }
  ],
  "text":" Soften the butter. Take it out of the fridge and wait approximately 10 minutes. The butter should not be hard to touch, and you should be able to make noticeable dents in it with your fingers. Preheat the oven. Set the temperature to 375 to 400 °F (191 to 204 °C). It will take some time (5 to 15 minutes, depending on your oven) for the oven to reach that temperature, so proceed to the next steps meanwhile. Prepare a shallow baking pan by placing a silicone baking sheet, parchment paper, or similar nonstick surface over it. Put the butter into a big bowl and mix it with the sugar. Use a mixer on a low speed. Mix until the butter stops being one block in the middle of the bowl, and is spread across the floor of the bowl. Ideally, it should also be mixed with most of the sugar. Add the 3 eggs. Open each egg and add its entire content (both the white and the yolk) to the bowl. Mix until everything in the bowl becomes a light-yellow homogeneous mass, like in the above picture. Mix in the cinnamon and flour. Continue mixing on low speed until everything is evenly combined. The result should now look like cookie dough. Drop small heaps of the dough onto the baking sheet with a teaspoon. If the dough is too sticky for this to work, use your hands instead of a teaspoon, but make sure that the heaps are approximately the same size. If you have not done so already, place the baking sheet on the baking pan. Put the baking pan with the nobby buns into the oven. Wear oven gloves and be careful, as the oven is very hot now. Bake 7–10 minutes. The smaller you made the buns, the less time they need to bake. To test whether the nobby buns are baked enough, stick a toothpick into one of them and look if any dough sticks to it or if any of the dough is still obviously gooey. In both cases, the buns are not baked enough. Turn off the oven and take out the cookies. The cookies are very hot, so either use a fork to collect them or wait some minutes until they become cold enough to touch. Wear oven gloves while touching anything inside the oven.",
  "tyn_model":[
    "oven",
    "butter",
    "baking pan",
    "baking sheet",
    "sugar",
    "bowl",
    "oven gloves",
    "fridge",
    "parchment paper",
    "mixer",
    "eggs",
    "cinnamon",
    "flour",
    "cookie dough",
    "toothpick",
    "cookies",
    "fork"
  ],
  "tyn_section":[

  ]
}