{
  "title":"How to Use Active Dry Yeast",
  "url":"https://www.wikihow.com/Use-Active-Dry-Yeast",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Bread Making Tips"
  ],
  "methods":[
    {
      "name":"Activating Dry Yeast",
      "steps":[
        {
          "headline":"Pour the recommended amount of warm water into a mixing bowl.",
          "description":"Using water that is too cold won't activate the yeast. Water that is hotter than 110 °F (43 °C) can kill the yeast. Usually water that comes from your tap and feels warm, but not hot, to the touch is around the right temperature. If you aren't sure what temperature the water should be, check if there are specific instructions on the packet. The exact amount of water you will need to use depends on your recipe."
        },
        {
          "headline":"Add the amount of yeast called for by the recipe.",
          "description":"Add the yeast into the water and stir. The yeast will immediately start to dissolve and the mixture will become silky. Some claim that adding sugar to the water helps activate the yeast. This isn't necessary, but it doesn't hurt, either."
        },
        {
          "headline":"Let the yeast proof for 5-10 minutes until it foams.",
          "description":"The exact amount of time the yeast takes to activate will depend on the brand and how warm or cold your kitchen is. Wait until the mixture foams up entirely to use the yeast. If the mixture doesn't foam up, the yeast is probably dead. Throw it out and try a new packet. Once the yeast is activated, you can add it in to the other ingredients you are using and start baking!"
        }
      ]
    },
    {
      "name":"Baking Homemade Bread",
      "steps":[
        {
          "headline":"Activate the yeast in a large bowl with 2 1/4 (.4 L)  warm water.",
          "description":"Add 1 packet of yeast to a bowl of 2 1/4 (.4 L) of warm water and 1/2 tsp (3g) of sugar. Wait until the water starts to bubble. You can mix the dry ingredients while you wait. Make sure the yeast bubbles up before you use it in the dough."
        },
        {
          "headline":"Whisk together flour, sugar, and salt in a separate, large bowl.",
          "description":"Mix 6 1/4 cups (850 g) of bread flour with 3 tbsp (24g) of sugar and 1 tbsp (8g) of salt. Use a whisk or sifter to evenly distribute all of the dry ingredients. You will need an extra 1/2 cups (68g) of bread flour to knead the dough, so make sure you save enough."
        },
        {
          "headline":"Add oil to the yeast and pour it into the dry ingredients a little at a time.",
          "description":"Mix 2 tablespoons (30 mL) of canola oil into the mixture of water and yeast. Pour the combination little by little into the dry ingredients. Use a spoon or your hands to mix the flour while you pour the yeast and water in."
        },
        {
          "headline":"Knead the mixture for about 10 minutes, until the dough is smooth.",
          "description":"Once all of the ingredients are combined, turn them out onto a floured countertop and knead it until the dough is smooth and elastic. This usually takes around 10 minutes. To knead bread, press the dough firmly away from you with the palm of your hand, then lift the edge furthest away from you and fold it back towards the center of the dough. You can also use a mixer with a dough hook to knead the dough."
        },
        {
          "headline":"Proof the dough for 1 1/2 to 2 hours until it doubles in size.",
          "description":"Cover the dough lightly with a towel and leave it somewhere just warmer than room temperature. Check after 1 1/2 hours to see if it doubled in size. Leave it for another 30 minutes if it still needs to grow a little bit. A good place to proof dough is in an oven that is turned off."
        },
        {
          "headline":"Punch down the dough, separate it into 2 loaves, and let them rise again.",
          "description":"Once the dough is doubled in size, turn it out onto a floured surface and punch it down so that the air is released from the dough. Divide the dough into 2 even loaves, shape them how you like, and let them rise again for 1 to 1 1/2 hours until they have doubled again..\nFor the second rise, place the loaves on a baking tray and cover them with a towel. Let them rise in a warm place."
        },
        {
          "headline":"Bake the loaves at 375 °F (191 °C) for 30-35 minutes.",
          "description":"Once the loaves have doubled in size, carefully slide them into the oven so that they don't lose any air. Bake them until they are golden brown, around 30 minutes. To tell if the loaves are done, tap the bottom of the bread to see if it sounds hollow. If it does, the bread is done."
        }
      ]
    },
    {
      "name":"Making Your Own Pizza Crust",
      "steps":[
        {
          "headline":"Activate the yeast using ⁄4 cup (180 mL) of warm water.",
          "description":"Add 1 packet of active dry yeast to ⁄4 cup (180 mL) of warm water. Wait until it dissolves, in around 5 minutes. Wait until the yeast bubbles up to use it."
        },
        {
          "headline":"Mix flour, sugar, and salt in a separate bowl.",
          "description":"In a large bowl, mix 2 cups (260 g) of all purpose flour with 1 tsp (5g) of sugar and 3/4 tsp (4g) of salt. Use a whisk or fork to mix all of the dry ingredients together. Mix the dry ingredients while you are waiting for the yeast to activate."
        },
        {
          "headline":"Add the yeast, water, and olive oil to the dry ingredients and knead.",
          "description":"Add the yeast mixture, plus 3 tablespoons (44 mL) of olive oil to the dry ingredients and mix them until they are combined. Then, turn the mixture onto a floured surface and knead it until it is smooth and elastic. This usually takes about 10 minutes. You can also use a mixer with a dough hook to knead the dough for around 10 minutes."
        },
        {
          "headline":"Let the dough rise for about an hour until it doubles in size.",
          "description":"Cover the dough with a towel and place it somewhere warm to rise. Check it in about an hour to see if it doubled in size. If it still looks a little small, give it another half an hour. The colder the dough is, the longer it will take to rise."
        },
        {
          "headline":"Roll out the dough and top it with the ingredients of your choice.",
          "description":"Start in the center of the ball of dough and push outwards to create a circle of dough. Roll the dough until it is about ⁄2 inch (1.3 cm) thick. Add your favorite pizza toppings. For a classic cheese pizza, spread a thin layer of tomato sauce across the dough and add shredded mozzarella. Add a sprinkle of oregano for a little extra flavor, or some slices of pepperoni for a more hearty meal."
        },
        {
          "headline":"Bake the dough at 450 °F (232 °C) for 10-15 minutes.",
          "description":"Preheat the oven so that it is very hot before you put the pizza in. Bake the pizza until the crust is brown and crispy. Bake the dough on a pizza stone, if you have one. If not, sprinkle a little semolina or flour on a baking sheet before putting the dough on."
        }
      ]
    }
  ],
  "text":" Activating Dry Yeast Pour the recommended amount of warm water into a mixing bowl. Using water that is too cold won't activate the yeast. Water that is hotter than 110 °F (43 °C) can kill the yeast. Usually water that comes from your tap and feels warm, but not hot, to the touch is around the right temperature. If you aren't sure what temperature the water should be, check if there are specific instructions on the packet. The exact amount of water you will need to use depends on your recipe. Add the amount of yeast called for by the recipe. Add the yeast into the water and stir. The yeast will immediately start to dissolve and the mixture will become silky. Some claim that adding sugar to the water helps activate the yeast. This isn't necessary, but it doesn't hurt, either. Let the yeast proof for 5-10 minutes until it foams. The exact amount of time the yeast takes to activate will depend on the brand and how warm or cold your kitchen is. Wait until the mixture foams up entirely to use the yeast. If the mixture doesn't foam up, the yeast is probably dead. Throw it out and try a new packet. Once the yeast is activated, you can add it in to the other ingredients you are using and start baking! Baking Homemade Bread Activate the yeast in a large bowl with 2 1/4 (.4 L)  warm water. Add 1 packet of yeast to a bowl of 2 1/4 (.4 L) of warm water and 1/2 tsp (3g) of sugar. Wait until the water starts to bubble. You can mix the dry ingredients while you wait. Make sure the yeast bubbles up before you use it in the dough. Whisk together flour, sugar, and salt in a separate, large bowl. Mix 6 1/4 cups (850 g) of bread flour with 3 tbsp (24g) of sugar and 1 tbsp (8g) of salt. Use a whisk or sifter to evenly distribute all of the dry ingredients. You will need an extra 1/2 cups (68g) of bread flour to knead the dough, so make sure you save enough. Add oil to the yeast and pour it into the dry ingredients a little at a time. Mix 2 tablespoons (30 mL) of canola oil into the mixture of water and yeast. Pour the combination little by little into the dry ingredients. Use a spoon or your hands to mix the flour while you pour the yeast and water in. Knead the mixture for about 10 minutes, until the dough is smooth. Once all of the ingredients are combined, turn them out onto a floured countertop and knead it until the dough is smooth and elastic. This usually takes around 10 minutes. To knead bread, press the dough firmly away from you with the palm of your hand, then lift the edge furthest away from you and fold it back towards the center of the dough. You can also use a mixer with a dough hook to knead the dough. Proof the dough for 1 1/2 to 2 hours until it doubles in size. Cover the dough lightly with a towel and leave it somewhere just warmer than room temperature. Check after 1 1/2 hours to see if it doubled in size. Leave it for another 30 minutes if it still needs to grow a little bit. A good place to proof dough is in an oven that is turned off. Punch down the dough, separate it into 2 loaves, and let them rise again. Once the dough is doubled in size, turn it out onto a floured surface and punch it down so that the air is released from the dough. Divide the dough into 2 even loaves, shape them how you like, and let them rise again for 1 to 1 1/2 hours until they have doubled again..\nFor the second rise, place the loaves on a baking tray and cover them with a towel. Let them rise in a warm place. Bake the loaves at 375 °F (191 °C) for 30-35 minutes. Once the loaves have doubled in size, carefully slide them into the oven so that they don't lose any air. Bake them until they are golden brown, around 30 minutes. To tell if the loaves are done, tap the bottom of the bread to see if it sounds hollow. If it does, the bread is done. Making Your Own Pizza Crust Activate the yeast using ⁄4 cup (180 mL) of warm water. Add 1 packet of active dry yeast to ⁄4 cup (180 mL) of warm water. Wait until it dissolves, in around 5 minutes. Wait until the yeast bubbles up to use it. Mix flour, sugar, and salt in a separate bowl. In a large bowl, mix 2 cups (260 g) of all purpose flour with 1 tsp (5g) of sugar and 3/4 tsp (4g) of salt. Use a whisk or fork to mix all of the dry ingredients together. Mix the dry ingredients while you are waiting for the yeast to activate. Add the yeast, water, and olive oil to the dry ingredients and knead. Add the yeast mixture, plus 3 tablespoons (44 mL) of olive oil to the dry ingredients and mix them until they are combined. Then, turn the mixture onto a floured surface and knead it until it is smooth and elastic. This usually takes about 10 minutes. You can also use a mixer with a dough hook to knead the dough for around 10 minutes. Let the dough rise for about an hour until it doubles in size. Cover the dough with a towel and place it somewhere warm to rise. Check it in about an hour to see if it doubled in size. If it still looks a little small, give it another half an hour. The colder the dough is, the longer it will take to rise. Roll out the dough and top it with the ingredients of your choice. Start in the center of the ball of dough and push outwards to create a circle of dough. Roll the dough until it is about ⁄2 inch (1.3 cm) thick. Add your favorite pizza toppings. For a classic cheese pizza, spread a thin layer of tomato sauce across the dough and add shredded mozzarella. Add a sprinkle of oregano for a little extra flavor, or some slices of pepperoni for a more hearty meal. Bake the dough at 450 °F (232 °C) for 10-15 minutes. Preheat the oven so that it is very hot before you put the pizza in. Bake the pizza until the crust is brown and crispy. Bake the dough on a pizza stone, if you have one. If not, sprinkle a little semolina or flour on a baking sheet before putting the dough on.",
  "tyn_model":[
    "water",
    "yeast",
    "sugar",
    "salt",
    "flour",
    "oven",
    "bowl",
    "bread flour",
    "whisk",
    "mixer",
    "warm water",
    "olive oil",
    "mixing bowl",
    "large bowl",
    "sifter",
    "oil",
    "canola oil",
    "spoon",
    "baking tray",
    "towel",
    "bread",
    "active dry yeast",
    "all purpose flour",
    "tomato sauce",
    "mozzarella",
    "oregano",
    "pepperoni",
    "pizza stone",
    "semolina or flour",
    "baking sheet"
  ],
  "tyn_section":[

  ]
}