{
  "title":"How to Hang Clothes at a Garage Sale",
  "url":"https://www.wikihow.com/Hang-Clothes-at-a-Garage-Sale",
  "category_hierarchy":[
    "Home and Garden",
    "Garages"
  ],
  "methods":[
    {
      "name":"Washing, Hanging, and Pricing the Clothes",
      "steps":[
        {
          "headline":"Wash and dry each item of clothing you plan to sell.",
          "description":"Potential customers will not buy dirty or worn-looking items at your garage sale. Before you hang them up, wash and dry the clothes so they’re clean and fresh. Any items that have major damage like tears and holes probably won’t sell at the garage sale. Consider donating them or placing them in a box labeled “Free” at your garage sale. Try to remove any stains on the clothes you want to sell."
        },
        {
          "headline":"Insert hangers through the bottom of shirts.",
          "description":"Slide the hanger through the bottom of the shirt or blouse and thread it through the opening at the top. Don’t put the shirt or blouse on the hanger by sticking it through the neck hole because that can stretch it out. People are less likely to purchase a shirt or blouse from your garage sale if it’s stretched or warped."
        },
        {
          "headline":"Button the second button of button-up shirts before you hang them.",
          "description":"Oxfords, polos, and other dress shirts with buttons need to have the button below the top button secured. This will keep the shirt from sliding or falling off of the hanger. When people sift through the clothes hanging up, you’ll want the button-up shirts to stay secure on the hangers."
        },
        {
          "headline":"Clip skirts, shorts, and pants to the hanger at the waist.",
          "description":"Use hangers with clips for shorts and pants so they’re easily visible when you hang them at your garage sale. Secure them to the hanger by clipping them along the waistband. If the skirt, shorts, or pants have a larger waistband than the length of the hanger, fold them in half and clip the waistband. Place a piece of a napkin or tissue paper between the clips and the item to protect embellishments like embroidery or beading.Tip: If you don’t have hangers with clips on them, fold the skirt, pants, or shorts over the central bar of the hanger."
        },
        {
          "headline":"Use clothespins to hang baby and children's items.",
          "description":"You don’t need to use special baby-sized hangers that hold baby outfits together. Instead, use clothespins to attach pants, shorts, and skirts to their corresponding onesies or shirts on the hangers. You can pin the pants to the bottom of the shirt or to the hanger itself so they hang just below the shirt."
        },
        {
          "headline":"Price each item appropriately.",
          "description":"Your clothing needs to be priced well enough for people to want to buy the used items. You can label each item with a price or you can price sections of clothes. Clothes made by a well-known and quality name brand should still be priced reasonably so people are more likely to buy them. For example, you could say that all pants are $4. Baby clothes in good condition should be priced between $1 and $3, while adult clothes with little wear and tear should be priced between $3 and $5. If the clothes are really out of style, reduce the price so people are more likely to buy them and take them off your hands. Sell clothes that are older and worn but don’t have any damage for $1 to encourage people to purchase them."
        }
      ]
    },
    {
      "name":"Arranging the Clothes",
      "steps":[
        {
          "headline":"Use a clothing rack to display your clothes.",
          "description":"A clothing rack will make it easier for people to sort through the clothes you’re selling. It will also keep the clothes organized and off the ground so they stay clean. You also won’t have to keep refolding clothes that people pick up because they’re on a hanger. You can find clothing racks at department stores and online.Tip: If you don’t have a clothing rack, try making one yourself! String a clothesline across a dresser that you can hang the clothes from. Try standing up 2 ladders and run a PVC pipe or a rod across the rungs of both ladders to create a rack. You could even hang a chain from a dresser, pole, or tree and put the hangers in the links."
        },
        {
          "headline":"Place the clothing racks in the front of the sale.",
          "description":"The clothes you want to sell should be easy to see, even to people driving by. Put the racks out in front so people can flip through them casually. Don’t place items in front of the clothing racks that could make it difficult for people to see or peruse them."
        },
        {
          "headline":"Separate clothes by gender for clear sections.",
          "description":"It will be easier for people to peruse if you hang clothes in separate sections. A simple way to separate clothing is by gender. Create sections for men’s clothes, women’s clothes, boy's clothes, and girl's clothes."
        },
        {
          "headline":"Organize the clothes by size if you have many different sizes.",
          "description":"If you’re selling a large variety of clothes with many different sizes, displaying them organized by size can help people navigate the items. Hang similarly sized clothes near each other so people can more easily identify the sections. For example, you can hang T-shirts of the same size together, even if they’re different colors or styles."
        },
        {
          "headline":"Keep similar clothing types and outfits together.",
          "description":"Keeping shirts with shirts, jeans with jeans, and shorts with shorts will help people perusing your garage sale find what they’re looking for. Hang similar items near each other for people who want to search for specific types of clothes. Similarly,  keeping whole outfits or a set of clothing together can make it easier for people to take home the whole set. Place them together on a hanger or keep them nearby so they’re visible. Arrange sections of similar clothing types by alternating colors to break them up visually. For example, hang a pair of blue shorts next to a pair of white shorts rather than another pair of blue. Put together outfits with the clothing that you have to inspire people to purchase the whole set. Selling multiple items at once means you can clear out more space and make more money!"
        },
        {
          "headline":"Make signs to label the sections of clothes.",
          "description":"Decorative signs can add flair and organization to your garage sale. Create and put up a sign for the sections of items you’re selling so people can peruse more easily. For example, put a sign next to the jeans that says, “Jeans!”\nUse small chalkboards and draw out wacky or decorative signs. Put the price range of the clothes sections on the sign."
        }
      ]
    }
  ],
  "text":" Washing, Hanging, and Pricing the Clothes Wash and dry each item of clothing you plan to sell. Potential customers will not buy dirty or worn-looking items at your garage sale. Before you hang them up, wash and dry the clothes so they’re clean and fresh. Any items that have major damage like tears and holes probably won’t sell at the garage sale. Consider donating them or placing them in a box labeled “Free” at your garage sale. Try to remove any stains on the clothes you want to sell. Insert hangers through the bottom of shirts. Slide the hanger through the bottom of the shirt or blouse and thread it through the opening at the top. Don’t put the shirt or blouse on the hanger by sticking it through the neck hole because that can stretch it out. People are less likely to purchase a shirt or blouse from your garage sale if it’s stretched or warped. Button the second button of button-up shirts before you hang them. Oxfords, polos, and other dress shirts with buttons need to have the button below the top button secured. This will keep the shirt from sliding or falling off of the hanger. When people sift through the clothes hanging up, you’ll want the button-up shirts to stay secure on the hangers. Clip skirts, shorts, and pants to the hanger at the waist. Use hangers with clips for shorts and pants so they’re easily visible when you hang them at your garage sale. Secure them to the hanger by clipping them along the waistband. If the skirt, shorts, or pants have a larger waistband than the length of the hanger, fold them in half and clip the waistband. Place a piece of a napkin or tissue paper between the clips and the item to protect embellishments like embroidery or beading.Tip: If you don’t have hangers with clips on them, fold the skirt, pants, or shorts over the central bar of the hanger. Use clothespins to hang baby and children's items. You don’t need to use special baby-sized hangers that hold baby outfits together. Instead, use clothespins to attach pants, shorts, and skirts to their corresponding onesies or shirts on the hangers. You can pin the pants to the bottom of the shirt or to the hanger itself so they hang just below the shirt. Price each item appropriately. Your clothing needs to be priced well enough for people to want to buy the used items. You can label each item with a price or you can price sections of clothes. Clothes made by a well-known and quality name brand should still be priced reasonably so people are more likely to buy them. For example, you could say that all pants are $4. Baby clothes in good condition should be priced between $1 and $3, while adult clothes with little wear and tear should be priced between $3 and $5. If the clothes are really out of style, reduce the price so people are more likely to buy them and take them off your hands. Sell clothes that are older and worn but don’t have any damage for $1 to encourage people to purchase them. Arranging the Clothes Use a clothing rack to display your clothes. A clothing rack will make it easier for people to sort through the clothes you’re selling. It will also keep the clothes organized and off the ground so they stay clean. You also won’t have to keep refolding clothes that people pick up because they’re on a hanger. You can find clothing racks at department stores and online.Tip: If you don’t have a clothing rack, try making one yourself! String a clothesline across a dresser that you can hang the clothes from. Try standing up 2 ladders and run a PVC pipe or a rod across the rungs of both ladders to create a rack. You could even hang a chain from a dresser, pole, or tree and put the hangers in the links. Place the clothing racks in the front of the sale. The clothes you want to sell should be easy to see, even to people driving by. Put the racks out in front so people can flip through them casually. Don’t place items in front of the clothing racks that could make it difficult for people to see or peruse them. Separate clothes by gender for clear sections. It will be easier for people to peruse if you hang clothes in separate sections. A simple way to separate clothing is by gender. Create sections for men’s clothes, women’s clothes, boy's clothes, and girl's clothes. Organize the clothes by size if you have many different sizes. If you’re selling a large variety of clothes with many different sizes, displaying them organized by size can help people navigate the items. Hang similarly sized clothes near each other so people can more easily identify the sections. For example, you can hang T-shirts of the same size together, even if they’re different colors or styles. Keep similar clothing types and outfits together. Keeping shirts with shirts, jeans with jeans, and shorts with shorts will help people perusing your garage sale find what they’re looking for. Hang similar items near each other for people who want to search for specific types of clothes. Similarly,  keeping whole outfits or a set of clothing together can make it easier for people to take home the whole set. Place them together on a hanger or keep them nearby so they’re visible. Arrange sections of similar clothing types by alternating colors to break them up visually. For example, hang a pair of blue shorts next to a pair of white shorts rather than another pair of blue. Put together outfits with the clothing that you have to inspire people to purchase the whole set. Selling multiple items at once means you can clear out more space and make more money! Make signs to label the sections of clothes. Decorative signs can add flair and organization to your garage sale. Create and put up a sign for the sections of items you’re selling so people can peruse more easily. For example, put a sign next to the jeans that says, “Jeans!”\nUse small chalkboards and draw out wacky or decorative signs. Put the price range of the clothes sections on the sign.",
  "tyn_model":[
    "clothes",
    "hangers",
    "hanger",
    "clothing rack",
    "clothespins",
    "clothing",
    "“free",
    "” at",
    "shirt",
    "button-up shirts",
    "napkin",
    "tissue paper",
    "clothesline",
    "pvc pipe",
    "rod",
    "chain",
    "clothing racks",
    "shirts",
    "jeans",
    "“jeans",
    "”\n",
    "chalkboards"
  ],
  "tyn_section":[

  ]
}