{
  "title":"How to Play Guitar on Rock Band 2 (for Beginners)",
  "url":"https://www.wikihow.com/Play-Guitar-on-Rock-Band-2-(for-Beginners)",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Rock Band"
  ],
  "steps":[
    {
      "headline":"Purchase Rock Band 2 at any game store.",
      "description":"If you have a Wii, purchase the Wii version. If you want the complete pack, purchase it at a department store that sells it (Target, etc). If you want the full pack for Xbox 360 or PS3, purchase it. It is very expensive if you want to buy it new, though."
    },
    {
      "headline":"Get the guitar controller synced.",
      "description":"Go to the options menu, you will find \"Calibration\". Select it to enter the Calibration menu, do what it tells you to do, and move on. If you have the Rock Band 2 guitar, you should be able to auto calibrate the game with it by selecting the Auto Calibrate option in the Calibration menu."
    },
    {
      "headline":"Create a character.",
      "description":"This character will resemble you in the background animations of the game. Your character doesn't need to be the same gender as you, but it is preferred. You may also choose from pre-made characters when playing in Quickplay."
    },
    {
      "headline":"Select the first song you will play, either in Quickplay or in World Tour.",
      "description":"Selecting an easy song like \"Today\" by Smashing Pumpkins or \"Eye of The Tiger\" by Survivor might be a good idea at first. After you have selected which song to play, choose which instrument you want to play (Guitar or Bass when using a guitar controller), and then choose what difficulty you wish to play on. Choosing the Easy difficulty might be a good idea if you are a stranger to music games in general, while Medium is probably the way to go if you are a bit more familiar with rhythm games."
    },
    {
      "headline":"Now, place your first four fingers (your thumb is behind the buttons) with your left hand over the green, red, yellow, and blue (in that order) buttons on the neck of your plastic guitar and wait for the song to load.",
      "description":""
    },
    {
      "headline":"Now the song will start, and the game will begin.",
      "description":"When playing the game, \"notes\" with colours representing the buttons on the guitar neck will come towards you on the game screen, and you are supposed to press the the strum bar, the white thing at the body of the guitar, down with your thumb while holding down the correct \"fret\" button(s) as these notes hit the \"hitline\" on the bottom of the screen."
    },
    {
      "headline":"Remember that this works like a real guitar when it comes to playing notes: you can keep the fret buttons pressed down at any time without being penalised, as long as you press down the correct fret buttons and strum when the notes hit the \"hitline\".",
      "description":"You don't play notes by just pressing the strings on a real guitar either."
    },
    {
      "headline":"If you are left-handed, remember to turn on lefty mode under options in the pause menu.",
      "description":""
    },
    {
      "headline":"Try to play trough the song.",
      "description":"As long as you hit enough notes, your concert will be a success and you will go out victorious at the end of the song's duration."
    },
    {
      "headline":"Congratulations, you have just learned how to play Rock Band 2 on Guitar!",
      "description":""
    }
  ],
  "text":" Purchase Rock Band 2 at any game store. If you have a Wii, purchase the Wii version. If you want the complete pack, purchase it at a department store that sells it (Target, etc). If you want the full pack for Xbox 360 or PS3, purchase it. It is very expensive if you want to buy it new, though. Get the guitar controller synced. Go to the options menu, you will find \"Calibration\". Select it to enter the Calibration menu, do what it tells you to do, and move on. If you have the Rock Band 2 guitar, you should be able to auto calibrate the game with it by selecting the Auto Calibrate option in the Calibration menu. Create a character. This character will resemble you in the background animations of the game. Your character doesn't need to be the same gender as you, but it is preferred. You may also choose from pre-made characters when playing in Quickplay. Select the first song you will play, either in Quickplay or in World Tour. Selecting an easy song like \"Today\" by Smashing Pumpkins or \"Eye of The Tiger\" by Survivor might be a good idea at first. After you have selected which song to play, choose which instrument you want to play (Guitar or Bass when using a guitar controller), and then choose what difficulty you wish to play on. Choosing the Easy difficulty might be a good idea if you are a stranger to music games in general, while Medium is probably the way to go if you are a bit more familiar with rhythm games. Now, place your first four fingers (your thumb is behind the buttons) with your left hand over the green, red, yellow, and blue (in that order) buttons on the neck of your plastic guitar and wait for the song to load.  Now the song will start, and the game will begin. When playing the game, \"notes\" with colours representing the buttons on the guitar neck will come towards you on the game screen, and you are supposed to press the the strum bar, the white thing at the body of the guitar, down with your thumb while holding down the correct \"fret\" button(s) as these notes hit the \"hitline\" on the bottom of the screen. Remember that this works like a real guitar when it comes to playing notes: you can keep the fret buttons pressed down at any time without being penalised, as long as you press down the correct fret buttons and strum when the notes hit the \"hitline\". You don't play notes by just pressing the strings on a real guitar either. If you are left-handed, remember to turn on lefty mode under options in the pause menu.  Try to play trough the song. As long as you hit enough notes, your concert will be a success and you will go out victorious at the end of the song's duration. Congratulations, you have just learned how to play Rock Band 2 on Guitar! ",
  "tyn_model":[
    "guitar",
    "rock band",
    "guitar controller",
    "rock band 2",
    "plastic guitar"
  ],
  "tyn_section":[

  ]
}