{
  "title":"How to Choose Between CBD and THC",
  "url":"https://www.wikihow.com/Choose-Between-CBD-and-THC",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Treating Symptoms with CBD",
      "steps":[
        {
          "headline":"Use CBD to treat symptoms without mind-altering effects.",
          "description":"Cannabidiol (CBD) is found naturally in the cannabis plant. It can be used to treat a variety of symptoms such as chronic pain, inflammation, irritable bowel symptoms, and insomnia. Because CBD does not have any psychoactive properties, and will not impair you if you consume it. In other words, you will not get high if you consume CBD and it’s a better option if you want to improve your general health and wellness. Check your local laws before you use either substance. THC isn’t legal in many locations, but CBD often is. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLiana Georgoulis, PsyD\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPsychologist\t\t\t\t\t\t\t\tDr. Liana Georgoulis is a Licensed Clinical Psychologist with over 10 years of experience, and is now the Clinical Director at Coast Psychological Services in Los Angeles, California. She received her Doctor of Psychology from Pepperdine University in 2009. Her practice provides cognitive behavioral therapy and other evidence-based therapies for adolescents, adults, and couples. Liana Georgoulis, PsyD\t\t\tPsychologist\t\t\t\tOur Expert Agrees: CBD will relax your body and it has a neuro-protective effect, much like many other supplements. It may also aid in reducing stress-related issues and anxiety. However, it will not give you the same high feeling or euphoric buzz that THC would."
        },
        {
          "headline":"Take CBD products to reduce joint pain caused by arthritis.",
          "description":"CBD may help with arthritis-related symptoms such as pain, inflammation, insomnia, and anxiety. While the scientific evidence about CBD’s ability to relieve arthritis symptoms isn’t definitive, some people with arthritis who have tried CBD report noticeable pain relief, sleep improvement, and a reduction in their anxiety levels. Apply a CBD infused cream to the skin above your joints that are inflamed and painful. CBD should never be used as a replacement for arthritis medications, disease-modifying antirheumatic drugs (DMARDs), or any medications prescribed by your doctor. There are no established clinically established guidelines regarding the dosage of CBD. Talk to your doctor about whether CBD is safe for you to consume and their recommended dosage."
        },
        {
          "headline":"Alleviate the symptoms of IBD and Crohn’s disease with CBD.",
          "description":"Cannabidiol may reduce the permeability of your gastrointestinal tract, which can help block the absorption of harmful bacteria and fats. Blocking or reducing the absorption of harmful substances can reduce inflammation and pain in the gastrointestinal tract. Use a CBD tincture or oil to ingest CBD for IBD symptom relief. CBD may help reduce the most common symptoms of IBD including stomach pain, cramping, and diarrhea. Ask your doctor if CBD is a viable treatment option for you before you consume it."
        },
        {
          "headline":"Manage chronic pain by taking CBD.",
          "description":"The chronic pain caused by injury or diseases such as multiple sclerosis may be alleviated by consuming CBD. Research suggests that CBD can reduce inflammation and reduce the intensity of chronic pain. Consume CBD oil or a tincture to relieve chronic pain. CBD can also help combat anxiety, which is often associated with chronic pain. In addition to MS-related pain, CBD may also help treat the spasticity and bladder symptoms caused by the disease."
        },
        {
          "headline":"Treat insomnia by using CBD.",
          "description":"Studies suggest that CBD may help with falling asleep and staying asleep without lingering fatigue upon waking. A common side effect of consuming CBD is sleepiness, which when coupled with a reduction in the anxiety and stress levels associated with insomnia, can be an effective treatment option. If you have sleep issues or insomnia, talk to your doctor about using CBD oil or tinctures to treat your symptoms. Your doctor may be able to recommend a dosage level of CBD that would be effective for you."
        },
        {
          "headline":"Reduce your anxiety and stress levels with CBD.",
          "description":"Cannabidiol directly impacts the receptors in your brain that can affect your serotonin levels. Serotonin is the neurotransmitter that plays a large role in mood disorders, such as acute and chronic anxiety. If you suffer from anxiety, CBD may be an effective treatment that also won’t impair your judgment or alter your state of mind. Taking CBD orally may help reduce your stress and anxiety. CBD should not be used as a replacement for anxiety medications prescribed by your doctor. Talk to your doctor or psychiatrist about using CBD to treat your anxiety before you decide to use it."
        }
      ]
    },
    {
      "name":"Using THC Medicinally",
      "steps":[
        {
          "headline":"Do not drive or operate machinery if you consume THC.",
          "description":"Tetrahydrocannabinol (THC) is the psychoactive ingredient found in cannabis, also known as marijuana. Consuming THC will alter your state of mind, affect your short-term memory, and reduce your ability to concentrate. If you take THC to treat your symptoms, do not drive a vehicle or operate something that requires focus and concentration. Consume THC at home to treat your symptoms so you don’t have to drive anywhere. Use a designated driver if you need to go somewhere after you take THC."
        },
        {
          "headline":"Take THC to reduce nausea and increase your appetite.",
          "description":"If you have chronic stomach issues or you take medications that can make you nauseous or reduce your appetite, such as many cancer treatment medications, THC can help restore your appetite so you can eat. THC is also shown to reduce the negative effects of chemotherapy including nausea, insomnia, and stress. Eating disorders such as anorexia and bulimia can benefit from the appetite increasing effects of THC."
        },
        {
          "headline":"Treat symptoms of depression and anxiety with THC.",
          "description":"Studies show that THC can effectively treat symptoms of anxiety and depression in some people. However, for some people, THC can exacerbate their symptoms, making their anxiety worse. Talk to your doctor about using THC as a treatment for your depression and anxiety before you use it. THC can increase serotonin levels, which can improve your mood and reduce the effects of your depression.Warning: Anxiety and paranoia are a common side effect of consuming THC. Stop using THC if you experience negative side effects."
        },
        {
          "headline":"Use THC as a pain reliever.",
          "description":"THC affects the nerve signals that your brain interprets as pain and can be an effective treatment for acute and chronic pain. It has been used to treat a variety of painful conditions, including headaches, back pain, and menstrual cramps. THC can be a more effective treatment for chronic pain than opiates because the side effects are milder and users can develop a tolerance and become highly dependent on opiates. Talk to your doctor before you use THC to treat your pain symptoms to make sure it’s safe for you to use."
        },
        {
          "headline":"Reduce muscle spasms and pain caused by MS with THC.",
          "description":"The symptoms of multiple sclerosis (MS) include stiff, aching, cramping muscles that are also prone to spasticity. Research suggests that THC can lessen both the pain and spasticity caused by MS. If you have MS, talk to your doctor about using THC. The pain caused by MS can also lead to a lack of sleep. Taking THC can ease your pain while also helping you fall asleep and stay asleep."
        }
      ]
    },
    {
      "name":"Selecting a Delivery Method",
      "steps":[
        {
          "headline":"Talk to your doctor about the right dosage for you.",
          "description":"Whether you’re using CBD or THC to treat your symptoms, the adequate dosage can vary. Before you start to use either substance, ask your doctor what the proper dose would be to relieve your symptoms. A modest dose of THC is generally between 1.25 to 2.5 milligrams and can be effective at treating symptoms such as nausea and mild pain. CBD dosages can vary based on your body weight. For example, a person that weighs between 151–240 pounds (68–109 kg) can take a dose of 18 milligrams for mild pain.Tip: If you are new to using CBD or THC, start low and go slow. Ingest 1 recommended dose and wait 15 minutes to see how you feel. If your symptoms have not improved, you can increase the dose until you find what works for you."
        },
        {
          "headline":"Get a medical prescription for THC, if required by law.",
          "description":"THC isn’t legal in all locations and illegally possessing it can lead to a hefty fine or even prison time. Don’t consume THC if it isn’t legal in your area and be sure to obtain any necessary prescriptions or licenses to acquire THC. Look online to check the legal requirements to obtain THC in your area. Some states in the US require you to have a medical marijuana card in order to purchase THC. A doctor may be able to write a prescription for THC so you can obtain it legally."
        },
        {
          "headline":"Check your employer’s policies regarding THC and CBD usage.",
          "description":"Even if THC and CBD are legal in your area, and even if you have a prescription or license to use them, your employer may be able to fire you for it. Before you choose to use either substance, look through your company’s policy about using them. You may also risk losing medical benefits if you use THC or CBD. Look through your employee handbook to find information regarding their drug policy."
        },
        {
          "headline":"Buy THC or CBD from a reputable source.",
          "description":"It’s important that you use CBD or THC that is of good quality and has a measured dosage so you can administer the proper amount. Regulation of these substances is scant or nonexistent, and the product you’re using could contain heavy metals or other contaminants. Only acquire THC or CBD from a licensed distributor. Search online for licensed distributors in your area. Avoid ordering THC or CBD online unless the company is reputable and has a license to distribute the product. Never order THC online if it is not legal in your area."
        },
        {
          "headline":"Take THC or CBD in oil form for convenience.",
          "description":"Both THC and CBD can be consumed in the form of an oil that can be taken directly or used as an ingredient you can mix into food. To take it orally, simply pour some into a spoon and swallow it down. Read the packaging for dosage instructions and follow the dose recommended by your doctor. Add THC or CBD oil to smoothies, tea, or sweet treats like brownies and gummies. CBD and THC oils can also come in form of gel caps, lozenges, and pre-made foods and candies."
        },
        {
          "headline":"Squirt CBD or THC tinctures under your tongue for fast absorption.",
          "description":"A tincture is an extract of the substance in the form of an oily liquid. Use a dropper to remove a measured amount of the tincture and squirt the liquid under your tongue. You will start to feel the effects in a few minutes. Hold the tincture under your tongue for 1-2 minutes before you swallow so it’s absorbed. Tinctures differ from cannabis oil because they can be absorbed through the blood vessels in your mouth."
        },
        {
          "headline":"Roll a marijuana joint  to consume THC by inhaling it.",
          "description":"Rolling, lighting, and smoking marijuana is a common way to ingest THC. Breathing in the smoke will quickly deliver the THC to your bloodstream in as little as 1 to 2 puffs of the joint. Even if marijuana is legal or you have a license or prescription to use it, you may not be able to smoke a joint in certain places. Check your local laws regarding where you can smoke marijuana. Check with your doctor before you smoke marijuana to make sure it’s safe for you. Do not smoke marijuana if it is not legal in your area. The THC dosage can vary among different strains of marijuana. Ask the supplier if they have tested the marijuana and what the THC levels are."
        },
        {
          "headline":"Apply a CBD cream to the area you want to treat.",
          "description":"If you have localized pain, spreading a CBD topical cream directly to the affected area may provide you some relief. Rub the cream into the skin above the affected area until it’s fully absorbed. CBD creams can help alleviate pain and inflammation in joints caused by injuries and diseases such as arthritis."
        }
      ]
    }
  ],
  "text":" Treating Symptoms with CBD Use CBD to treat symptoms without mind-altering effects. Cannabidiol (CBD) is found naturally in the cannabis plant. It can be used to treat a variety of symptoms such as chronic pain, inflammation, irritable bowel symptoms, and insomnia. Because CBD does not have any psychoactive properties, and will not impair you if you consume it. In other words, you will not get high if you consume CBD and it’s a better option if you want to improve your general health and wellness. Check your local laws before you use either substance. THC isn’t legal in many locations, but CBD often is. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLiana Georgoulis, PsyD\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tPsychologist\t\t\t\t\t\t\t\tDr. Liana Georgoulis is a Licensed Clinical Psychologist with over 10 years of experience, and is now the Clinical Director at Coast Psychological Services in Los Angeles, California. She received her Doctor of Psychology from Pepperdine University in 2009. Her practice provides cognitive behavioral therapy and other evidence-based therapies for adolescents, adults, and couples. Liana Georgoulis, PsyD\t\t\tPsychologist\t\t\t\tOur Expert Agrees: CBD will relax your body and it has a neuro-protective effect, much like many other supplements. It may also aid in reducing stress-related issues and anxiety. However, it will not give you the same high feeling or euphoric buzz that THC would. Take CBD products to reduce joint pain caused by arthritis. CBD may help with arthritis-related symptoms such as pain, inflammation, insomnia, and anxiety. While the scientific evidence about CBD’s ability to relieve arthritis symptoms isn’t definitive, some people with arthritis who have tried CBD report noticeable pain relief, sleep improvement, and a reduction in their anxiety levels. Apply a CBD infused cream to the skin above your joints that are inflamed and painful. CBD should never be used as a replacement for arthritis medications, disease-modifying antirheumatic drugs (DMARDs), or any medications prescribed by your doctor. There are no established clinically established guidelines regarding the dosage of CBD. Talk to your doctor about whether CBD is safe for you to consume and their recommended dosage. Alleviate the symptoms of IBD and Crohn’s disease with CBD. Cannabidiol may reduce the permeability of your gastrointestinal tract, which can help block the absorption of harmful bacteria and fats. Blocking or reducing the absorption of harmful substances can reduce inflammation and pain in the gastrointestinal tract. Use a CBD tincture or oil to ingest CBD for IBD symptom relief. CBD may help reduce the most common symptoms of IBD including stomach pain, cramping, and diarrhea. Ask your doctor if CBD is a viable treatment option for you before you consume it. Manage chronic pain by taking CBD. The chronic pain caused by injury or diseases such as multiple sclerosis may be alleviated by consuming CBD. Research suggests that CBD can reduce inflammation and reduce the intensity of chronic pain. Consume CBD oil or a tincture to relieve chronic pain. CBD can also help combat anxiety, which is often associated with chronic pain. In addition to MS-related pain, CBD may also help treat the spasticity and bladder symptoms caused by the disease. Treat insomnia by using CBD. Studies suggest that CBD may help with falling asleep and staying asleep without lingering fatigue upon waking. A common side effect of consuming CBD is sleepiness, which when coupled with a reduction in the anxiety and stress levels associated with insomnia, can be an effective treatment option. If you have sleep issues or insomnia, talk to your doctor about using CBD oil or tinctures to treat your symptoms. Your doctor may be able to recommend a dosage level of CBD that would be effective for you. Reduce your anxiety and stress levels with CBD. Cannabidiol directly impacts the receptors in your brain that can affect your serotonin levels. Serotonin is the neurotransmitter that plays a large role in mood disorders, such as acute and chronic anxiety. If you suffer from anxiety, CBD may be an effective treatment that also won’t impair your judgment or alter your state of mind. Taking CBD orally may help reduce your stress and anxiety. CBD should not be used as a replacement for anxiety medications prescribed by your doctor. Talk to your doctor or psychiatrist about using CBD to treat your anxiety before you decide to use it. Using THC Medicinally Do not drive or operate machinery if you consume THC. Tetrahydrocannabinol (THC) is the psychoactive ingredient found in cannabis, also known as marijuana. Consuming THC will alter your state of mind, affect your short-term memory, and reduce your ability to concentrate. If you take THC to treat your symptoms, do not drive a vehicle or operate something that requires focus and concentration. Consume THC at home to treat your symptoms so you don’t have to drive anywhere. Use a designated driver if you need to go somewhere after you take THC. Take THC to reduce nausea and increase your appetite. If you have chronic stomach issues or you take medications that can make you nauseous or reduce your appetite, such as many cancer treatment medications, THC can help restore your appetite so you can eat. THC is also shown to reduce the negative effects of chemotherapy including nausea, insomnia, and stress. Eating disorders such as anorexia and bulimia can benefit from the appetite increasing effects of THC. Treat symptoms of depression and anxiety with THC. Studies show that THC can effectively treat symptoms of anxiety and depression in some people. However, for some people, THC can exacerbate their symptoms, making their anxiety worse. Talk to your doctor about using THC as a treatment for your depression and anxiety before you use it. THC can increase serotonin levels, which can improve your mood and reduce the effects of your depression.Warning: Anxiety and paranoia are a common side effect of consuming THC. Stop using THC if you experience negative side effects. Use THC as a pain reliever. THC affects the nerve signals that your brain interprets as pain and can be an effective treatment for acute and chronic pain. It has been used to treat a variety of painful conditions, including headaches, back pain, and menstrual cramps. THC can be a more effective treatment for chronic pain than opiates because the side effects are milder and users can develop a tolerance and become highly dependent on opiates. Talk to your doctor before you use THC to treat your pain symptoms to make sure it’s safe for you to use. Reduce muscle spasms and pain caused by MS with THC. The symptoms of multiple sclerosis (MS) include stiff, aching, cramping muscles that are also prone to spasticity. Research suggests that THC can lessen both the pain and spasticity caused by MS. If you have MS, talk to your doctor about using THC. The pain caused by MS can also lead to a lack of sleep. Taking THC can ease your pain while also helping you fall asleep and stay asleep. Selecting a Delivery Method Talk to your doctor about the right dosage for you. Whether you’re using CBD or THC to treat your symptoms, the adequate dosage can vary. Before you start to use either substance, ask your doctor what the proper dose would be to relieve your symptoms. A modest dose of THC is generally between 1.25 to 2.5 milligrams and can be effective at treating symptoms such as nausea and mild pain. CBD dosages can vary based on your body weight. For example, a person that weighs between 151–240 pounds (68–109 kg) can take a dose of 18 milligrams for mild pain.Tip: If you are new to using CBD or THC, start low and go slow. Ingest 1 recommended dose and wait 15 minutes to see how you feel. If your symptoms have not improved, you can increase the dose until you find what works for you. Get a medical prescription for THC, if required by law. THC isn’t legal in all locations and illegally possessing it can lead to a hefty fine or even prison time. Don’t consume THC if it isn’t legal in your area and be sure to obtain any necessary prescriptions or licenses to acquire THC. Look online to check the legal requirements to obtain THC in your area. Some states in the US require you to have a medical marijuana card in order to purchase THC. A doctor may be able to write a prescription for THC so you can obtain it legally. Check your employer’s policies regarding THC and CBD usage. Even if THC and CBD are legal in your area, and even if you have a prescription or license to use them, your employer may be able to fire you for it. Before you choose to use either substance, look through your company’s policy about using them. You may also risk losing medical benefits if you use THC or CBD. Look through your employee handbook to find information regarding their drug policy. Buy THC or CBD from a reputable source. It’s important that you use CBD or THC that is of good quality and has a measured dosage so you can administer the proper amount. Regulation of these substances is scant or nonexistent, and the product you’re using could contain heavy metals or other contaminants. Only acquire THC or CBD from a licensed distributor. Search online for licensed distributors in your area. Avoid ordering THC or CBD online unless the company is reputable and has a license to distribute the product. Never order THC online if it is not legal in your area. Take THC or CBD in oil form for convenience. Both THC and CBD can be consumed in the form of an oil that can be taken directly or used as an ingredient you can mix into food. To take it orally, simply pour some into a spoon and swallow it down. Read the packaging for dosage instructions and follow the dose recommended by your doctor. Add THC or CBD oil to smoothies, tea, or sweet treats like brownies and gummies. CBD and THC oils can also come in form of gel caps, lozenges, and pre-made foods and candies. Squirt CBD or THC tinctures under your tongue for fast absorption. A tincture is an extract of the substance in the form of an oily liquid. Use a dropper to remove a measured amount of the tincture and squirt the liquid under your tongue. You will start to feel the effects in a few minutes. Hold the tincture under your tongue for 1-2 minutes before you swallow so it’s absorbed. Tinctures differ from cannabis oil because they can be absorbed through the blood vessels in your mouth. Roll a marijuana joint  to consume THC by inhaling it. Rolling, lighting, and smoking marijuana is a common way to ingest THC. Breathing in the smoke will quickly deliver the THC to your bloodstream in as little as 1 to 2 puffs of the joint. Even if marijuana is legal or you have a license or prescription to use it, you may not be able to smoke a joint in certain places. Check your local laws regarding where you can smoke marijuana. Check with your doctor before you smoke marijuana to make sure it’s safe for you. Do not smoke marijuana if it is not legal in your area. The THC dosage can vary among different strains of marijuana. Ask the supplier if they have tested the marijuana and what the THC levels are. Apply a CBD cream to the area you want to treat. If you have localized pain, spreading a CBD topical cream directly to the affected area may provide you some relief. Rub the cream into the skin above the affected area until it’s fully absorbed. CBD creams can help alleviate pain and inflammation in joints caused by injuries and diseases such as arthritis.",
  "tyn_model":[
    "cbd",
    "thc",
    "marijuana",
    "serotonin",
    "cbd oil",
    "cannabidiol",
    "cannabis plant",
    "clinical psychologist",
    "psychological services",
    "psychology",
    "cognitive behavioral therapy",
    "cbd infused cream",
    "cannabis",
    "opiates",
    "multiple sclerosis",
    "medical marijuana",
    "spoon",
    "sweet treats",
    "dropper",
    "cannabis oil",
    "cbd cream",
    "cbd topical cream",
    "cbd creams"
  ],
  "tyn_section":[

  ]
}