{
  "title":"How to Make Metallic Slime",
  "url":"https://www.wikihow.com/Make-Metallic-Slime",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids",
    "Putty Dough and Slime"
  ],
  "methods":[
    {
      "name":"Using Starch to Make Metallic Slime",
      "steps":[
        {
          "headline":"Pour 1 cup (240 ml) of clear glue into a mixing bowl.",
          "description":"Use clear school glue, squirting it into a measuring cup or estimating and squirting it directly into the mixing bowl. If you measured it out, use a spoon to scrape all of the clear glue out of the measuring cup and into the bowl. Purchase clear glue at your local big box or craft store."
        },
        {
          "headline":"Measure out 2 US tbsp (30 ml) of metallic paint to put into the bowl.",
          "description":"Choose metallic craft paint in any color, such as pink, blue, or purple, or opt for a classic option like silver or gold. Pour the metallic paint into the bowl full of glue. Metallic paint comes in small bottles and can be found at your local craft store or online. Avoid purchasing professional metallic paint that goes on metal that you would use to paint a car."
        },
        {
          "headline":"Stir the mixture until it’s thoroughly combined.",
          "description":"Use a wooden stick or spoon to mix the glue and paint together. Take your time and stir slowly to make sure the glue and paint are no longer easily distinguishable. If you mix them together and want your slime to have more pigment, add a little bit more paint into the glue and mix it again."
        },
        {
          "headline":"Mix liquid starch in slowly until you’re satisfied with the consistency.",
          "description":"It’s important to pour the liquid starch slowly while mixing all of the ingredients together to allow the starch time to activate. Continue adding small amounts of starch and combining it with the glue and paint until you’re pleased with the slime’s consistency. Look for liquid starch in the laundry aisle of the grocery store or in craft stores. Stir the starch in slowly to avoid creating air bubbles."
        },
        {
          "headline":"Take the slime out of the bowl and knead it with your hands.",
          "description":"Once your slime is relatively solid, take it out of the bowl and start kneading it with your fingers to keep distributing the ingredients. If your slime is still sticky, add a little bit more starch until it’s no longer sticking to your hands. Use clean, dry hands to knead the slime. Continue kneading the slime with your hands if you added more starch to evenly distribute it."
        }
      ]
    },
    {
      "name":"Combining Shaving Cream and Contact Lens Solution",
      "steps":[
        {
          "headline":"Add 1 cup (240 ml) of white glue to a mixing bowl.",
          "description":"Remove the top from the white glue and pour it into a measuring cup to get the exact amount, or estimate the right amount and pour it directly into the bowl. If you pour it into a measuring cup, use a spoon to scrape out any remaining glue as you pour it into the bowl. Purchase white school glue from your local big box or craft store."
        },
        {
          "headline":"Mix roughly 3 cups (710 ml) of shaving cream into the bowl.",
          "description":"If you don’t want to use exact measurements, this is okay. The more shaving cream you use, the fluffier your slime will be. Mix the ingredients together thoroughly using a spoon or wooden stick. Use shaving cream that is sprayed out as a foam, not a gel. If you don’t want your slime to be very fluffy, avoid adding a lot of shaving cream."
        },
        {
          "headline":"Pour metallic paint into the bowl until you reach your desired color.",
          "description":"Squirt your chosen color of metallic craft paint into the mixture slowly. Stir the color into the glue and shaving cream as you pour so that you get an accurate idea of how the color is distributing. Continue adding metallic paint and mixing it into the ingredients until you’re satisfied with the color. Add the paint in small amounts. If you add too much in the beginning, you’ll need to add more glue and shaving cream to balance it back out."
        },
        {
          "headline":"Add contact lens solution in small amounts to firm up the slime.",
          "description":"Squirt a few drops of contact lens solution into the mixture, stirring it with a spoon or wooden stick to distribute it. Keep adding contact lens solution until you like the slime’s consistency. Instead of a wooden stick or spoon, you can also mix the ingredients together using your hands. If you touch the slime with your hands and it’s still sticky, add a few more drops of contact lens solution."
        },
        {
          "headline":"Knead the slime using your hands when it’s no longer sticky.",
          "description":"Take the slime out of the bowl and start kneading it on a clean surface using your hands. This will help distribute the ingredients even more to ensure your metallic slime is ready to be played with."
        }
      ]
    },
    {
      "name":"Creating It with Contact Lens Solution and Baking Soda",
      "steps":[
        {
          "headline":"Pour 1 cup (240 ml) of clear glue into a bowl.",
          "description":"Estimate 1 cup (240 ml) by squirting the glue directly into the bowl, or pour it into a measuring cup first to be exact. Clear school glue can be purchased at your local big box or craft store. Scrape out any remaining glue from the measuring cup using a spoon or wooden stick if needed."
        },
        {
          "headline":"Mix 1 tablespoon (15 ml) of baking soda into the glue.",
          "description":"Measure out the baking soda and pour it into the bowl full of glue. Use a wooden stick or spoon to stir the baking soda and glue until they are well integrated."
        },
        {
          "headline":"Pour contact lens solution into the bowl slowly while mixing it.",
          "description":"Slowly add a few drops of contact lens solution to the glue and baking soda, mixing it with a wooden stick or spoon (or even your hands!). Keep adding the contact solution and mixing until you touch the slime and are pleased with its consistency. The more contact lens solution you add, the firmer your slime will become."
        },
        {
          "headline":"Knead the slime with your hands to continue mixing the ingredients.",
          "description":"Use clean, dry hands to remove the slime from the bowl and start kneading it on a flat surface. This will make sure the ingredients are thoroughly mixed together. Add a few more drops of contact lens solution if your slime is still too sticky. Let your slime sit overnight before adding pigment to it so it becomes super clear, if desired."
        },
        {
          "headline":"Sprinkle metallic powder into the slime and twist it to spread the pigment.",
          "description":"Sprinkle fine metallic craft or nail powder in your chosen color into the center of the slime. Fold the edges of the slime into the center using your hands to cover the powder, and then start folding and twisting the slime to spread the powder. Look for metallic craft powder at your local big box store or craft store, or nail powder that's used on nails at a beauty store. Add more metallic powder to the slime if desired. Take your time twisting and kneading the slime to distribute the color evenly."
        }
      ]
    }
  ],
  "text":" Using Starch to Make Metallic Slime Pour 1 cup (240 ml) of clear glue into a mixing bowl. Use clear school glue, squirting it into a measuring cup or estimating and squirting it directly into the mixing bowl. If you measured it out, use a spoon to scrape all of the clear glue out of the measuring cup and into the bowl. Purchase clear glue at your local big box or craft store. Measure out 2 US tbsp (30 ml) of metallic paint to put into the bowl. Choose metallic craft paint in any color, such as pink, blue, or purple, or opt for a classic option like silver or gold. Pour the metallic paint into the bowl full of glue. Metallic paint comes in small bottles and can be found at your local craft store or online. Avoid purchasing professional metallic paint that goes on metal that you would use to paint a car. Stir the mixture until it’s thoroughly combined. Use a wooden stick or spoon to mix the glue and paint together. Take your time and stir slowly to make sure the glue and paint are no longer easily distinguishable. If you mix them together and want your slime to have more pigment, add a little bit more paint into the glue and mix it again. Mix liquid starch in slowly until you’re satisfied with the consistency. It’s important to pour the liquid starch slowly while mixing all of the ingredients together to allow the starch time to activate. Continue adding small amounts of starch and combining it with the glue and paint until you’re pleased with the slime’s consistency. Look for liquid starch in the laundry aisle of the grocery store or in craft stores. Stir the starch in slowly to avoid creating air bubbles. Take the slime out of the bowl and knead it with your hands. Once your slime is relatively solid, take it out of the bowl and start kneading it with your fingers to keep distributing the ingredients. If your slime is still sticky, add a little bit more starch until it’s no longer sticking to your hands. Use clean, dry hands to knead the slime. Continue kneading the slime with your hands if you added more starch to evenly distribute it. Combining Shaving Cream and Contact Lens Solution Add 1 cup (240 ml) of white glue to a mixing bowl. Remove the top from the white glue and pour it into a measuring cup to get the exact amount, or estimate the right amount and pour it directly into the bowl. If you pour it into a measuring cup, use a spoon to scrape out any remaining glue as you pour it into the bowl. Purchase white school glue from your local big box or craft store. Mix roughly 3 cups (710 ml) of shaving cream into the bowl. If you don’t want to use exact measurements, this is okay. The more shaving cream you use, the fluffier your slime will be. Mix the ingredients together thoroughly using a spoon or wooden stick. Use shaving cream that is sprayed out as a foam, not a gel. If you don’t want your slime to be very fluffy, avoid adding a lot of shaving cream. Pour metallic paint into the bowl until you reach your desired color. Squirt your chosen color of metallic craft paint into the mixture slowly. Stir the color into the glue and shaving cream as you pour so that you get an accurate idea of how the color is distributing. Continue adding metallic paint and mixing it into the ingredients until you’re satisfied with the color. Add the paint in small amounts. If you add too much in the beginning, you’ll need to add more glue and shaving cream to balance it back out. Add contact lens solution in small amounts to firm up the slime. Squirt a few drops of contact lens solution into the mixture, stirring it with a spoon or wooden stick to distribute it. Keep adding contact lens solution until you like the slime’s consistency. Instead of a wooden stick or spoon, you can also mix the ingredients together using your hands. If you touch the slime with your hands and it’s still sticky, add a few more drops of contact lens solution. Knead the slime using your hands when it’s no longer sticky. Take the slime out of the bowl and start kneading it on a clean surface using your hands. This will help distribute the ingredients even more to ensure your metallic slime is ready to be played with. Creating It with Contact Lens Solution and Baking Soda Pour 1 cup (240 ml) of clear glue into a bowl. Estimate 1 cup (240 ml) by squirting the glue directly into the bowl, or pour it into a measuring cup first to be exact. Clear school glue can be purchased at your local big box or craft store. Scrape out any remaining glue from the measuring cup using a spoon or wooden stick if needed. Mix 1 tablespoon (15 ml) of baking soda into the glue. Measure out the baking soda and pour it into the bowl full of glue. Use a wooden stick or spoon to stir the baking soda and glue until they are well integrated. Pour contact lens solution into the bowl slowly while mixing it. Slowly add a few drops of contact lens solution to the glue and baking soda, mixing it with a wooden stick or spoon (or even your hands!). Keep adding the contact solution and mixing until you touch the slime and are pleased with its consistency. The more contact lens solution you add, the firmer your slime will become. Knead the slime with your hands to continue mixing the ingredients. Use clean, dry hands to remove the slime from the bowl and start kneading it on a flat surface. This will make sure the ingredients are thoroughly mixed together. Add a few more drops of contact lens solution if your slime is still too sticky. Let your slime sit overnight before adding pigment to it so it becomes super clear, if desired. Sprinkle metallic powder into the slime and twist it to spread the pigment. Sprinkle fine metallic craft or nail powder in your chosen color into the center of the slime. Fold the edges of the slime into the center using your hands to cover the powder, and then start folding and twisting the slime to spread the powder. Look for metallic craft powder at your local big box store or craft store, or nail powder that's used on nails at a beauty store. Add more metallic powder to the slime if desired. Take your time twisting and kneading the slime to distribute the color evenly.",
  "tyn_model":[
    "bowl",
    "glue",
    "contact lens",
    "spoon",
    "paint",
    "shaving cream",
    "metallic paint",
    "baking soda",
    "starch",
    "clear glue",
    "liquid starch",
    "mixing bowl",
    "clear school glue",
    "white glue",
    "contact lens solution",
    "metallic powder",
    "measuring cup",
    "white school glue",
    "metallic craft paint",
    "metallic craft powder",
    "nail powder"
  ],
  "tyn_section":[

  ]
}