{
  "title":"How to Use Super Glue",
  "url":"https://www.wikihow.com/Use-Super-Glue",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Applying Super Glue",
      "steps":[
        {
          "headline":"Use super glue to strongly bind 2 surfaces together.",
          "description":"Super glue is a powerful adhesive and works well on almost any type of surface. Use it to connect parts, make repairs, and adhere 2 surfaces together. You can use super glue to fix chipped or cracked glass or plastic. Repair torn soles on shoes with super glue. Use super glue instead of duct tape to hold 2 things together."
        },
        {
          "headline":"Wipe the surfaces you plan to glue together with a damp cloth.",
          "description":"Super glue will adhere to dust, dirt, and other particles on the surface, which will affect how well the glue bonds. Use a damp cloth to wipe the areas you plan to glue clean. Then, dry the areas with a clean cloth. Be sure to clean both surfaces you plan to glue."
        },
        {
          "headline":"Use 180-grit sandpaper to rough up smooth surfaces.",
          "description":"Super glue works great on materials such as metal, ceramic, leather, rubber, and vinyl. To make the super glue more effective on smooth surfaces such as plastic or laminated surfaces, take some sandpaper and rub the area you plan to glue. Use gentle, circular motions to create texture for the glue to adhere to. Don’t sand the surface too much or it will become too smooth to create an effective bond.Tip: If you don’t have sandpaper, use steel wool to rough up the surface for better adhesion."
        },
        {
          "headline":"Remove the glue's cap and make sure the opening is clear.",
          "description":"Pull the lid or cap off of the super glue and look into the opening to make sure it isn’t clogged. Give the glue a bottle a gentle squeeze until the glue starts to exit the opening to make sure there isn’t any blockage that could prevent you from applying the glue properly. If there is a blockage, use a needle, tack, or the tip of a knife to clear the opening by scraping off any gunk blocking it."
        },
        {
          "headline":"Spread a thin layer of super glue to 1 of the surfaces.",
          "description":"Super glue is potent and a thin layer will actually create a more effective bond than a thick application. Apply the glue to 1 of the surfaces for the best adhesion. Applying the glue to both of the surfaces you plan to connect together will create too thick of a layer of glue. Put the lid back on the super glue immediately after you use it to prevent it from drying out. Push the cap until it snaps into place so you know it’s sealed."
        },
        {
          "headline":"Connect and hold the 2 surfaces together for 30 seconds.",
          "description":"Squeeze the 2 surfaces together and hold them tight so the glue can set. After about 10 seconds, slowly release the pressure and the 2 surfaces will be bonded together by the glue. If the surfaces are not connected after 30 seconds, hold them together for another 30 seconds to ensure cohesion.Tip: Blow on the glue while you hold the parts together so the glue dries faster. Some super glues have caps that twist on and off. Twist the cap back on until it can be turned anymore to ensure it’s tightly sealed."
        },
        {
          "headline":"Soak super glue in warm soapy water for 5 minutes to remove it.",
          "description":"If you accidentally get some super glue on your hands or the wrong surface, you can remove it by quickly soaking the glue in warm water with dish soap. After soaking for 5 minutes, gently pry the skin or surfaces apart with a hard object like a spoon. Soak the super glue as soon as possible to remove it."
        }
      ]
    },
    {
      "name":"Making the Glue Set Faster",
      "steps":[
        {
          "headline":"Blow a hairdryer on low to heat the glue so it will set faster.",
          "description":"Super glue reacts to temperature, and warm air will make it set quicker. Move the hairdryer around so you don’t overheat the area and the heat and air are distributed evenly. Use the lowest setting possible so you don’t overheat the super glue. Keep the hairdryer in constant motion while you hold it about 1 foot (30 cm) away from the parts or surfaces you’re gluing."
        },
        {
          "headline":"Aim a fan at the glue to increase circulation to make the glue dry faster.",
          "description":"Increasing the circulation in the air around the parts you’re gluing together will cause the glue to dry faster and form a strong bond. Turn on an overhead fan if the room has one or point a desk fan toward the area where you’re using the super glue. Good circulation will also reduce your exposure to the fumes of the super glue which are toxic, can make you nauseated, and give you a headache. Blowing on the super glue can also help speed up the drying time.Tip: Work in a well-ventilated space, turn on any fans in the room, and open up any windows to increase circulation so the glue dries faster and you’re less likely to breathe in the fumes."
        },
        {
          "headline":"Sprinkle baking soda on the glue to speed up the drying time.",
          "description":"Apply a thin layer of super glue to the parts or surfaces you’re connecting, then sprinkle a small amount of baking soda on the glue. Connect the 2 pieces together and the glue will dry and set almost immediately. Connect the pieces quickly so the glue doesn’t dry first!"
        },
        {
          "headline":"Use a chemical accelerator to make the glue set.",
          "description":"After you apply the glue, add a small amount of accelerator to it. Then, connect the 2 pieces or surfaces together. The accelerator will make the glue set instantaneously. You can find chemical accelerators at hardware stores, home improvement stores, and online. Be careful not to breathe in the fumes of the accelerator, which can be toxic."
        }
      ]
    },
    {
      "name":"Storing Super Glue",
      "steps":[
        {
          "headline":"Make sure the cap is fully closed before you store the super glue.",
          "description":"Air and humidity will cause the super glue to dry out. You can extend the lifespan and effectiveness of your super glue by ensuring that it’s fully sealed after each use. Some caps snap into place to signal that the bottle is sealed. If the top screws on, be sure to screw it as tightly as possible."
        },
        {
          "headline":"Keep the super glue container in an airtight bag.",
          "description":"Moisture in the air can reduce the effectiveness of super glue. Place the tube of super glue in a Ziploc bag and squeeze out as much air as possible. Then seal the bag closed. You can find airtight bags at department stores and online. Some airtight bags have a convenient zipper at the top you can use to lock them.Tip: If you have a lot of super glue containers that you want to keep from drying out, place them all into a vacuum-sealed storage bag and remove all of the air from the bag before you store it."
        },
        {
          "headline":"Place the bag upright in your refrigerator.",
          "description":"A refrigerator is cool, dark, and dry, which will extend the life of your super glue and keep it from drying out. Place the sealed plastic bag in your refrigerator until you’re ready to use it. Cooling the glue in the refrigerator will not affect how well it flows out of the container. Don’t place the bag in your freezer or it could harden the super glue."
        }
      ]
    }
  ],
  "text":" Applying Super Glue Use super glue to strongly bind 2 surfaces together. Super glue is a powerful adhesive and works well on almost any type of surface. Use it to connect parts, make repairs, and adhere 2 surfaces together. You can use super glue to fix chipped or cracked glass or plastic. Repair torn soles on shoes with super glue. Use super glue instead of duct tape to hold 2 things together. Wipe the surfaces you plan to glue together with a damp cloth. Super glue will adhere to dust, dirt, and other particles on the surface, which will affect how well the glue bonds. Use a damp cloth to wipe the areas you plan to glue clean. Then, dry the areas with a clean cloth. Be sure to clean both surfaces you plan to glue. Use 180-grit sandpaper to rough up smooth surfaces. Super glue works great on materials such as metal, ceramic, leather, rubber, and vinyl. To make the super glue more effective on smooth surfaces such as plastic or laminated surfaces, take some sandpaper and rub the area you plan to glue. Use gentle, circular motions to create texture for the glue to adhere to. Don’t sand the surface too much or it will become too smooth to create an effective bond.Tip: If you don’t have sandpaper, use steel wool to rough up the surface for better adhesion. Remove the glue's cap and make sure the opening is clear. Pull the lid or cap off of the super glue and look into the opening to make sure it isn’t clogged. Give the glue a bottle a gentle squeeze until the glue starts to exit the opening to make sure there isn’t any blockage that could prevent you from applying the glue properly. If there is a blockage, use a needle, tack, or the tip of a knife to clear the opening by scraping off any gunk blocking it. Spread a thin layer of super glue to 1 of the surfaces. Super glue is potent and a thin layer will actually create a more effective bond than a thick application. Apply the glue to 1 of the surfaces for the best adhesion. Applying the glue to both of the surfaces you plan to connect together will create too thick of a layer of glue. Put the lid back on the super glue immediately after you use it to prevent it from drying out. Push the cap until it snaps into place so you know it’s sealed. Connect and hold the 2 surfaces together for 30 seconds. Squeeze the 2 surfaces together and hold them tight so the glue can set. After about 10 seconds, slowly release the pressure and the 2 surfaces will be bonded together by the glue. If the surfaces are not connected after 30 seconds, hold them together for another 30 seconds to ensure cohesion.Tip: Blow on the glue while you hold the parts together so the glue dries faster. Some super glues have caps that twist on and off. Twist the cap back on until it can be turned anymore to ensure it’s tightly sealed. Soak super glue in warm soapy water for 5 minutes to remove it. If you accidentally get some super glue on your hands or the wrong surface, you can remove it by quickly soaking the glue in warm water with dish soap. After soaking for 5 minutes, gently pry the skin or surfaces apart with a hard object like a spoon. Soak the super glue as soon as possible to remove it. Making the Glue Set Faster Blow a hairdryer on low to heat the glue so it will set faster. Super glue reacts to temperature, and warm air will make it set quicker. Move the hairdryer around so you don’t overheat the area and the heat and air are distributed evenly. Use the lowest setting possible so you don’t overheat the super glue. Keep the hairdryer in constant motion while you hold it about 1 foot (30 cm) away from the parts or surfaces you’re gluing. Aim a fan at the glue to increase circulation to make the glue dry faster. Increasing the circulation in the air around the parts you’re gluing together will cause the glue to dry faster and form a strong bond. Turn on an overhead fan if the room has one or point a desk fan toward the area where you’re using the super glue. Good circulation will also reduce your exposure to the fumes of the super glue which are toxic, can make you nauseated, and give you a headache. Blowing on the super glue can also help speed up the drying time.Tip: Work in a well-ventilated space, turn on any fans in the room, and open up any windows to increase circulation so the glue dries faster and you’re less likely to breathe in the fumes. Sprinkle baking soda on the glue to speed up the drying time. Apply a thin layer of super glue to the parts or surfaces you’re connecting, then sprinkle a small amount of baking soda on the glue. Connect the 2 pieces together and the glue will dry and set almost immediately. Connect the pieces quickly so the glue doesn’t dry first! Use a chemical accelerator to make the glue set. After you apply the glue, add a small amount of accelerator to it. Then, connect the 2 pieces or surfaces together. The accelerator will make the glue set instantaneously. You can find chemical accelerators at hardware stores, home improvement stores, and online. Be careful not to breathe in the fumes of the accelerator, which can be toxic. Storing Super Glue Make sure the cap is fully closed before you store the super glue. Air and humidity will cause the super glue to dry out. You can extend the lifespan and effectiveness of your super glue by ensuring that it’s fully sealed after each use. Some caps snap into place to signal that the bottle is sealed. If the top screws on, be sure to screw it as tightly as possible. Keep the super glue container in an airtight bag. Moisture in the air can reduce the effectiveness of super glue. Place the tube of super glue in a Ziploc bag and squeeze out as much air as possible. Then seal the bag closed. You can find airtight bags at department stores and online. Some airtight bags have a convenient zipper at the top you can use to lock them.Tip: If you have a lot of super glue containers that you want to keep from drying out, place them all into a vacuum-sealed storage bag and remove all of the air from the bag before you store it. Place the bag upright in your refrigerator. A refrigerator is cool, dark, and dry, which will extend the life of your super glue and keep it from drying out. Place the sealed plastic bag in your refrigerator until you’re ready to use it. Cooling the glue in the refrigerator will not affect how well it flows out of the container. Don’t place the bag in your freezer or it could harden the super glue.",
  "tyn_model":[
    "super glue",
    "glue",
    "refrigerator",
    "hairdryer",
    "sandpaper",
    "baking soda",
    "accelerator",
    "airtight bags",
    "duct tape",
    "180-grit sandpaper",
    "steel wool",
    "knife",
    "super glues",
    "water",
    "dish soap",
    "fan",
    "chemical accelerator",
    "chemical accelerators",
    "airtight bag",
    "ziploc bag",
    "vacuum-sealed storage bag",
    "plastic bag",
    "freezer"
  ],
  "tyn_section":[

  ]
}