{
  "title":"How to Make an iPod Case out of Paper",
  "url":"https://www.wikihow.com/Make-an-iPod-Case-out-of-Paper",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Digital Technology Art and Craft Projects"
  ],
  "steps":[
    {
      "headline":"Lay your iPod face down on the backside of the paper.",
      "description":"Align the iPod with the top of the paper. Mark the bottom of your iPod."
    },
    {
      "headline":"Cut the paper where you marked the bottom of the iPod.",
      "description":""
    },
    {
      "headline":"Fold the paper around your iPod and crease the folds at the edges of the iPod.",
      "description":"Make a crease to cut the excess paper leaving a little overlap, then unfold the paper."
    },
    {
      "headline":"Turn your iPod face up and place the paper on it face down, aligning the edges with your creases.",
      "description":"Trace the screen and the click wheel then cut both out carefully."
    },
    {
      "headline":"Place strips of clear tape to cover the front of the paper (preferably not overlapping).",
      "description":""
    },
    {
      "headline":"Trim tape at the bottom and top of the paper so that you now have a cleanly taped piece that can wrap around your iPod.",
      "description":"Don't forget to cut out the tape from the holes from the screen and the click wheel."
    },
    {
      "headline":"Wrap the piece around your iPod and tape in the back.",
      "description":""
    },
    {
      "headline":"Done!",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Lay your iPod face down on the backside of the paper. Align the iPod with the top of the paper. Mark the bottom of your iPod. Cut the paper where you marked the bottom of the iPod.  Fold the paper around your iPod and crease the folds at the edges of the iPod. Make a crease to cut the excess paper leaving a little overlap, then unfold the paper. Turn your iPod face up and place the paper on it face down, aligning the edges with your creases. Trace the screen and the click wheel then cut both out carefully. Place strips of clear tape to cover the front of the paper (preferably not overlapping).  Trim tape at the bottom and top of the paper so that you now have a cleanly taped piece that can wrap around your iPod. Don't forget to cut out the tape from the holes from the screen and the click wheel. Wrap the piece around your iPod and tape in the back.  Done!  Finished. ",
  "tyn_model":[
    "paper",
    "tape",
    "clear tape",
    "ipod"
  ],
  "tyn_section":[

  ]
}