{
  "title":"How to Bake a Wet Bottom Shoo Fly Pie",
  "url":"https://www.wikihow.com/Bake-a-Wet-Bottom-Shoo-Fly-Pie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies"
  ],
  "parts":[
    {
      "name":"Making the crust",
      "steps":[
        {
          "headline":"Preheat the oven to 400ºF/200ºC.",
          "description":""
        },
        {
          "headline":"Combine the flour and salt in a medium bowl.",
          "description":"Cut in 1/3 cup butter flavor Crisco using a pastry blender (or 2 knives). Mix until the flour blends into fine crumbs."
        },
        {
          "headline":"Cut in the remaining 1/3 cup of Crisco.",
          "description":"Mix until coarse crumbs form."
        },
        {
          "headline":"Stir in the egg.",
          "description":""
        },
        {
          "headline":"Sprinkle with water, one tablespoon at a time.",
          "description":"Toss lightly with a fork until the dough forms a ball. Press between your hands to form two 5–6 inch (12.7–15.2 cm) \"pancakes\"."
        },
        {
          "headline":"Flour a rolling surface and rolling pin lightly.",
          "description":"Roll one \"pancake\" into a circle. Trim the pastry to 1 inch (2.5 cm) larger than an upside-down 9-inch pie plate."
        },
        {
          "headline":"Fold into quarters.",
          "description":"Unfold and press into the pie plate. Flute. Repeat for the second pie shell."
        }
      ]
    },
    {
      "name":"Making the crumbs",
      "steps":[
        {
          "headline":"Combine the flour, sugar and baking soda in large bowl.",
          "description":"Cut in the butter with a pastry blender (or 2 knives)."
        },
        {
          "headline":"Mix until crumbs form.",
          "description":"Set aside."
        }
      ]
    },
    {
      "name":"Making the filling",
      "steps":[
        {
          "headline":"Combine the molasses, water, egg and baking soda in a large bowl.",
          "description":"Beat at low speed (electric mixer) until blended."
        },
        {
          "headline":"Add half the crumb mixture to the filling.",
          "description":"Beat at a low speed just until blended."
        },
        {
          "headline":"Pour into unbaked pie shells.",
          "description":"Fill a little over half full (don't worry, you may find it doesn't use all the filling)."
        },
        {
          "headline":"Sprinkle remaining crumbs over both pies.",
          "description":""
        },
        {
          "headline":"Bake at 400ºF/200ºC for 10 minutes.",
          "description":"Reduce the oven to 375ºF/190ºC. Bake 35 to 40 minutes or until a knife inserted in center comes out clean."
        },
        {
          "headline":"Remove from the oven.",
          "description":"Cool for 10 minutes on a wire cooling rack."
        },
        {
          "headline":"Place each pie inside separate plastic bag.",
          "description":"Fasten open end with a twistie. Leave to cool completely on counter."
        },
        {
          "headline":"Serve.",
          "description":"Serve with cream, ice cream or custard."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the crust Preheat the oven to 400ºF/200ºC.  Combine the flour and salt in a medium bowl. Cut in 1/3 cup butter flavor Crisco using a pastry blender (or 2 knives). Mix until the flour blends into fine crumbs. Cut in the remaining 1/3 cup of Crisco. Mix until coarse crumbs form. Stir in the egg.  Sprinkle with water, one tablespoon at a time. Toss lightly with a fork until the dough forms a ball. Press between your hands to form two 5–6 inch (12.7–15.2 cm) \"pancakes\". Flour a rolling surface and rolling pin lightly. Roll one \"pancake\" into a circle. Trim the pastry to 1 inch (2.5 cm) larger than an upside-down 9-inch pie plate. Fold into quarters. Unfold and press into the pie plate. Flute. Repeat for the second pie shell. Making the crumbs Combine the flour, sugar and baking soda in large bowl. Cut in the butter with a pastry blender (or 2 knives). Mix until crumbs form. Set aside. Making the filling Combine the molasses, water, egg and baking soda in a large bowl. Beat at low speed (electric mixer) until blended. Add half the crumb mixture to the filling. Beat at a low speed just until blended. Pour into unbaked pie shells. Fill a little over half full (don't worry, you may find it doesn't use all the filling). Sprinkle remaining crumbs over both pies.  Bake at 400ºF/200ºC for 10 minutes. Reduce the oven to 375ºF/190ºC. Bake 35 to 40 minutes or until a knife inserted in center comes out clean. Remove from the oven. Cool for 10 minutes on a wire cooling rack. Place each pie inside separate plastic bag. Fasten open end with a twistie. Leave to cool completely on counter. Serve. Serve with cream, ice cream or custard. Finished. ",
  "tyn_model":[
    "oven",
    "flour",
    "pastry blender",
    "water",
    "baking soda",
    "large bowl",
    "salt",
    "medium bowl",
    "butter flavor crisco",
    "crisco",
    "egg",
    "fork",
    "rolling surface",
    "rolling pin",
    "pastry",
    "9-inch pie plate",
    "pie plate",
    "sugar",
    "butter",
    "molasses",
    "electric mixer",
    "cream",
    "ice cream",
    "custard"
  ],
  "tyn_section":[

  ]
}