{
  "title":"How to Open the Xbox Game Bar",
  "url":"https://www.wikihow.com/Open-the-Xbox-Game-Bar",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox"
  ],
  "parts":[
    {
      "name":"Signing In",
      "steps":[
        {
          "headline":"Open Settings .",
          "description":"To do so, click on the settings gear in Start. This will immediately open up your Windows settings."
        },
        {
          "headline":"Click on \"Accounts\".",
          "description":"This will open up your account settings."
        },
        {
          "headline":"Click on \"Sign in with a Microsoft account\".",
          "description":"You need to sign in with your Microsoft account to use Xbox features."
        },
        {
          "headline":"Enter your Microsoft account email, Skype ID, or phone number.",
          "description":"Click on Next."
        },
        {
          "headline":"Enter your Microsoft account password.",
          "description":"Click on Sign in. You can also approve the request sent to Microsoft authenticator. You will be prompted to enter a verification code if two-factor authentication is enabled."
        },
        {
          "headline":"Enter your computer password.",
          "description":""
        }
      ]
    },
    {
      "name":"Enabling Game Bar",
      "steps":[
        {
          "headline":"Open Settings .",
          "description":"To do so, click on the settings gear in Start. This will immediately open up your Windows settings."
        },
        {
          "headline":"Click on \"Gaming\".",
          "description":"This will open gaming-related settings."
        },
        {
          "headline":"Ensure \"Game bar\" is set to .",
          "description":"This will enable the game bar in all apps and games. Windows is able to detect whether you are playing a game or not and will automatically suggest opening the game bar when you launch a game."
        }
      ]
    },
    {
      "name":"Using the Game Bar",
      "steps":[
        {
          "headline":"Press ⊞ Win+G.",
          "description":"This will open the Game Bar. Alternatively, type Game Bar into the Cortana search box and choose the top result."
        },
        {
          "headline":"Click on one of the icons at the top to open a particular Game Bar element or choose the menu button to view all of them.",
          "description":"You can pin game bar elements to the menu by clicking on the star to the right."
        }
      ]
    },
    {
      "name":"Configuring Xbox Game Bar",
      "steps":[
        {
          "headline":"Press ⊞ Win+G.",
          "description":"This will open the Game Bar. Alternatively, type Game Bar into the Cortana search box and choose the top result."
        },
        {
          "headline":"Choose whether you are viewing a game or not.",
          "description":"If you are viewing a game, check the box labeled \"Remember this is a game.\""
        },
        {
          "headline":"Link accounts to Game Bar.",
          "description":"To do so, click on \"Accounts\" from the left tab, click on Sign in or Link next to the account name, and follow the prompts to sign in."
        },
        {
          "headline":"Configure Game Bar shortcuts.",
          "description":"Choose the \"Shortcuts\" tab, then click on the box underneath the shortcut you want to configure, then press the desired key combination."
        },
        {
          "headline":"Choose the Game Bar theme.",
          "description":"You can choose between Light, Dark, and System Default. Click on \"Personalization\". From this menu, you can turn on/off Game Bar animations, as well as reset the overlay position."
        },
        {
          "headline":"Change recording settings.",
          "description":"To do so, click on \"Capturing\". You can choose to record automatically when playing a game (where then you can retrieve the last 30 seconds by using the key shortcut ⊞ Win+Alt+G as well as show microphone recording notifications and what to record."
        },
        {
          "headline":"Change notification settings.",
          "description":"To do so, click on \"Notifications\". You can silence all notifications (except alarms) while playing all or just fullscreen games, you can enable notifications when achievements are unlocked and when certain friends are online/send you messages, etc."
        },
        {
          "headline":"Configure voice chat settings.",
          "description":"Click on \"Voice chat\", then decide the audio output for voice chat, the volume of voice chat, and whether you have to press a key to enable communications."
        }
      ]
    }
  ],
  "text":" Signing In Open Settings . To do so, click on the settings gear in Start. This will immediately open up your Windows settings. Click on \"Accounts\". This will open up your account settings. Click on \"Sign in with a Microsoft account\". You need to sign in with your Microsoft account to use Xbox features. Enter your Microsoft account email, Skype ID, or phone number. Click on Next. Enter your Microsoft account password. Click on Sign in. You can also approve the request sent to Microsoft authenticator. You will be prompted to enter a verification code if two-factor authentication is enabled. Enter your computer password.  Enabling Game Bar Open Settings . To do so, click on the settings gear in Start. This will immediately open up your Windows settings. Click on \"Gaming\". This will open gaming-related settings. Ensure \"Game bar\" is set to . This will enable the game bar in all apps and games. Windows is able to detect whether you are playing a game or not and will automatically suggest opening the game bar when you launch a game. Using the Game Bar Press ⊞ Win+G. This will open the Game Bar. Alternatively, type Game Bar into the Cortana search box and choose the top result. Click on one of the icons at the top to open a particular Game Bar element or choose the menu button to view all of them. You can pin game bar elements to the menu by clicking on the star to the right. Configuring Xbox Game Bar Press ⊞ Win+G. This will open the Game Bar. Alternatively, type Game Bar into the Cortana search box and choose the top result. Choose whether you are viewing a game or not. If you are viewing a game, check the box labeled \"Remember this is a game.\" Link accounts to Game Bar. To do so, click on \"Accounts\" from the left tab, click on Sign in or Link next to the account name, and follow the prompts to sign in. Configure Game Bar shortcuts. Choose the \"Shortcuts\" tab, then click on the box underneath the shortcut you want to configure, then press the desired key combination. Choose the Game Bar theme. You can choose between Light, Dark, and System Default. Click on \"Personalization\". From this menu, you can turn on/off Game Bar animations, as well as reset the overlay position. Change recording settings. To do so, click on \"Capturing\". You can choose to record automatically when playing a game (where then you can retrieve the last 30 seconds by using the key shortcut ⊞ Win+Alt+G as well as show microphone recording notifications and what to record. Change notification settings. To do so, click on \"Notifications\". You can silence all notifications (except alarms) while playing all or just fullscreen games, you can enable notifications when achievements are unlocked and when certain friends are online/send you messages, etc. Configure voice chat settings. Click on \"Voice chat\", then decide the audio output for voice chat, the volume of voice chat, and whether you have to press a key to enable communications.",
  "tyn_model":[
    "game bar",
    "microsoft account",
    "⊞ win+g.",
    "⊞ win+alt+g",
    "voice chat"
  ],
  "tyn_section":[

  ]
}