{
  "title":"How to Adjust Garage Door Cables",
  "url":"https://www.wikihow.com/Adjust-Garage-Door-Cables",
  "category_hierarchy":[
    "Home and Garden",
    "Garages"
  ],
  "parts":[
    {
      "name":"Releasing the Door from the Track",
      "steps":[
        {
          "headline":"Close the garage door completely.",
          "description":"Use the automatic control to close the door so it’s fully closed. If your cables are uneven or 1 of them has come off of the track, then there may be a small gap between the bottom of the door and the ground on 1 side. Allow the door to close as much as it can. Do not try to force the door closed if there’s a small gap."
        },
        {
          "headline":"Pull the red cord to release the door from the track.",
          "description":"At the base of the trolley track on the ceiling of your garage is a small box that operates the automatic garage door opener. Pull the red cord hanging from it until you hear a “click” to disengage the door from the track. Don’t yank or jerk on the rope or you could damage the opener. You may not be able to disengage the door from the track if the door isn’t closed completely. Try having someone put their weight on the door to close it fully so you can pull the rope to disengage it."
        },
        {
          "headline":"Lift the door with your hands and open it fully.",
          "description":"Grab the bottom edge of the door and lift it straight up. Get a good grip and keep lifting it so it follows along the trolley track. Continue to raise the door until it’s open as far as it will go. If the cables or springs are misaligned or off of the track, the door may be difficult to open."
        },
        {
          "headline":"Clamp the garage door on the track so it stays open.",
          "description":"Many automatic garage doors have clamps near the end of the track that you can use to secure the door and keep it open. If your garage door doesn’t have clamps connected to it, attach 2 c-clamps to the track just below the lowest roller to keep it from closing. You can find c-clamps at hardware stores, department stores, and online.Tip: If your garage door has a metal lock, which looks like a bolt at the bottom of your garage door, slide the bolt into the door track when the door is raised to hold it open."
        }
      ]
    },
    {
      "name":"Positioning the Cables Correctly",
      "steps":[
        {
          "headline":"Put the cable back on the pulley if it has come off.",
          "description":"If a cable comes completely off of the pulley, use your hands to wrap it back around the pulley so it’s as tight as possible. If you’re on the left side of the door, wrap the cable so it’s flush against the left side of the pulley. If you’re on the right side of the door, wrap it so it’s flush against the right side. Wind the cable as tightly as you can with your hands. When you reconnect the garage door to the track and open it, the cable will wind itself tighter as the spring puts tension on it."
        },
        {
          "headline":"Wind the cable around the pulley if it’s loose.",
          "description":"At the top left and right corners of the garage door frame are pulleys that hold the cables that open the door. Use your hands to wrap the cable back around the pulley so it’s taut. When you reengage the automatic opener, the spring will put tension on the cable and tighten them further. If the cable comes loose, it can affect how well the door functions and can cause it to not close fully. When the door is open, there will be plenty of slack you can use to wind a loose cable back around the pulley."
        },
        {
          "headline":"Lower the door and use 2 metal rods to adjust the tension in the spring.",
          "description":"Lower the garage door, clamp or bolt it shut so it can’t open, and insert 1 metal rod into 1 of the holes around the perimeter of the spring. Then, insert another rod into a hole below the rod you already inserted. Lift the top rod upward to move the bottom rod until it’s flush against the door to adjust the tension in the spring. If your cables are tightly wound on the pulley, but 1 side of the door is uneven, then you need to adjust the tension on the torsion spring mounted above the center of the garage door frame. Use steel rods at least 18 inches (46 cm) long. You can find them at hardware stores and online. Remove the rods from the spring after you make your adjustments. The garage door must be lowered in order to adjust the spring."
        },
        {
          "headline":"Reengage the door to the automatic opener track by pulling the cord.",
          "description":"Pull the cord hanging from the automatic opener to activate the lever that will reconnect the door. Grab the door at the bottom and raise it until it reengages back onto the track. You’ll hear a “click” when the door snaps back into place on the track.Tip: You may be able to use the remote control of your automatic garage door to reconnect the door to the track. Press the button on the remote or wall panel to open the door and reengage it to the track."
        },
        {
          "headline":"Close the door fully to make sure the door is working properly.",
          "description":"Allow the door to close as far as it can on its own. If the cables have been adjusted properly, there won’t be any gaps at the bottom of the door and the bottom edge will be completely flush against the ground. Open and close the door a few times to make sure the cables are functioning properly."
        }
      ]
    }
  ],
  "text":" Releasing the Door from the Track Close the garage door completely. Use the automatic control to close the door so it’s fully closed. If your cables are uneven or 1 of them has come off of the track, then there may be a small gap between the bottom of the door and the ground on 1 side. Allow the door to close as much as it can. Do not try to force the door closed if there’s a small gap. Pull the red cord to release the door from the track. At the base of the trolley track on the ceiling of your garage is a small box that operates the automatic garage door opener. Pull the red cord hanging from it until you hear a “click” to disengage the door from the track. Don’t yank or jerk on the rope or you could damage the opener. You may not be able to disengage the door from the track if the door isn’t closed completely. Try having someone put their weight on the door to close it fully so you can pull the rope to disengage it. Lift the door with your hands and open it fully. Grab the bottom edge of the door and lift it straight up. Get a good grip and keep lifting it so it follows along the trolley track. Continue to raise the door until it’s open as far as it will go. If the cables or springs are misaligned or off of the track, the door may be difficult to open. Clamp the garage door on the track so it stays open. Many automatic garage doors have clamps near the end of the track that you can use to secure the door and keep it open. If your garage door doesn’t have clamps connected to it, attach 2 c-clamps to the track just below the lowest roller to keep it from closing. You can find c-clamps at hardware stores, department stores, and online.Tip: If your garage door has a metal lock, which looks like a bolt at the bottom of your garage door, slide the bolt into the door track when the door is raised to hold it open. Positioning the Cables Correctly Put the cable back on the pulley if it has come off. If a cable comes completely off of the pulley, use your hands to wrap it back around the pulley so it’s as tight as possible. If you’re on the left side of the door, wrap the cable so it’s flush against the left side of the pulley. If you’re on the right side of the door, wrap it so it’s flush against the right side. Wind the cable as tightly as you can with your hands. When you reconnect the garage door to the track and open it, the cable will wind itself tighter as the spring puts tension on it. Wind the cable around the pulley if it’s loose. At the top left and right corners of the garage door frame are pulleys that hold the cables that open the door. Use your hands to wrap the cable back around the pulley so it’s taut. When you reengage the automatic opener, the spring will put tension on the cable and tighten them further. If the cable comes loose, it can affect how well the door functions and can cause it to not close fully. When the door is open, there will be plenty of slack you can use to wind a loose cable back around the pulley. Lower the door and use 2 metal rods to adjust the tension in the spring. Lower the garage door, clamp or bolt it shut so it can’t open, and insert 1 metal rod into 1 of the holes around the perimeter of the spring. Then, insert another rod into a hole below the rod you already inserted. Lift the top rod upward to move the bottom rod until it’s flush against the door to adjust the tension in the spring. If your cables are tightly wound on the pulley, but 1 side of the door is uneven, then you need to adjust the tension on the torsion spring mounted above the center of the garage door frame. Use steel rods at least 18 inches (46 cm) long. You can find them at hardware stores and online. Remove the rods from the spring after you make your adjustments. The garage door must be lowered in order to adjust the spring. Reengage the door to the automatic opener track by pulling the cord. Pull the cord hanging from the automatic opener to activate the lever that will reconnect the door. Grab the door at the bottom and raise it until it reengages back onto the track. You’ll hear a “click” when the door snaps back into place on the track.Tip: You may be able to use the remote control of your automatic garage door to reconnect the door to the track. Press the button on the remote or wall panel to open the door and reengage it to the track. Close the door fully to make sure the door is working properly. Allow the door to close as far as it can on its own. If the cables have been adjusted properly, there won’t be any gaps at the bottom of the door and the bottom edge will be completely flush against the ground. Open and close the door a few times to make sure the cables are functioning properly.",
  "tyn_model":[
    "garage door",
    "cable",
    "automatic opener",
    "cables",
    "“click",
    "rope",
    "trolley track",
    "garage door opener",
    "” to",
    "spring",
    "metal rods",
    "torsion spring",
    "steel rods",
    "” when"
  ],
  "tyn_section":[

  ]
}