{
  "title":"How to Address Wedding Invitations Without an Inner Envelope",
  "url":"https://www.wikihow.com/Address-Wedding-Invitations-Without-an-Inner-Envelope",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Planning",
    "Invitations"
  ],
  "parts":[
    {
      "name":"Using the Proper Honorifics",
      "steps":[
        {
          "headline":"Address married couples with both first names.",
          "description":"Fill out the invitation by mentioning the first names of both partners, instead of just using the husband’s first and last name. If both partners use different last names, then be sure to use 2 separate lines for each individual. If you aren’t sure how to address a certain couple, reach out to either partner to find out. For example, address an invitation envelope with: Mr. and Mrs. Brad and Katie Smith\nIf both partners have separate last names, address them like:Mr. Brad LewisMrs. Katie Smith\nIf you’d prefer to be more formal, use the male’s full name on the invitation, like Mr. and Mrs. Brad Lewis"
        },
        {
          "headline":"Write out prefixes and suffixes if you’re trying to be formal.",
          "description":"Take a moment to write out a guest’s full name on a wedding invitation, including their proper prefixes and suffixes. Precede “junior” with a comma before writing out the whole lowercase word. If you’re addressing a judge or doctor, use  “The Honorable” and “Doctor” on the invitation. Additionally, be sure to write out the full military title for any guests, as necessary. For instance, address a Navy captain and her non-military husband as: Captain Jennifer Rollins and Mr. Erik Rollins\nIf you’re inviting a judge, address them as: The Honorable Daniel Clinton and Mrs. Lucy Clinton"
        },
        {
          "headline":"Refer to single women with the “Ms.” honorific.",
          "description":"Address your single, female friends with a subtle and polite prefix to keep the invitations formal. If you feel like your friend or family member would prefer the “Miss” honorific, feel free to use that instead. If you’re ever unsure of which honorific to use, always default to “Ms.”\nFor example, address an invitation to a female friend like this: Ms. Carol DavisDid you know? If you’re inviting a widowed individual, continue using her late husband’s surname on the invitation."
        },
        {
          "headline":"Go for the “Mr.” honorific when inviting men.",
          "description":"Address all male guests with the “Mr.” prefix, unless they’d prefer to use a different honorific. If you aren’t sure of a guest’s preference, feel free to contact them and double check. For instance, address a male guest like this: Mr. Anthony Maxwell"
        },
        {
          "headline":"Opt for the “Mx.” title when inviting gender-neutral friends and family.",
          "description":"Use the “Mx.” pronoun in the same way that you’d use “Mr.” or “Ms.” on an invitation. If you’re uncertain of a guest’s preferred pronouns, use “Mx.” on the invitation instead of assuming. If you’d like to double-check, feel free to ask them! For example, refer to a gender-neutral friend as: Mx. Sam Johnson"
        },
        {
          "headline":"Address entire families on a single envelope.",
          "description":"Use the top recipient line to write out the parents’ names. Once you’ve written out this line, you can devote a second line to the children’s first names. If the family has a lot of children, feel free to address the family as 1 unit. For instance, address a family invitation with:Mr. and Mrs. Xavier and Kelsey MatthewsSammy and Alex\nIf you’re addressing the family as a whole unit, write: The Matthews Family\nCreate a separate invitation for adult children living with their parents. If you want to create individual invitations for children, use “Miss” and “Master” to address them."
        },
        {
          "headline":"Write out the name of any known guests.",
          "description":"Dedicate the top line of the address to your initially invited friend or family member. If you know the name of the partner or guest that they’ll bring along, devote the second line to that person’s name. For example, write out an invitation like this:Ms. Lauren SmithMr. James Nottingham"
        },
        {
          "headline":"Note on the envelope if the invitee can bring a guest.",
          "description":"Let the recipient know right away if they’re allowed to bring a plus 1 by specifying on the envelope. To do this, write “and guest” after the recipient’s name, with “guest” remaining lowercase. For instance, write out the invitation like this: Ms. Patricia Gold and guest"
        }
      ]
    },
    {
      "name":"Labeling and Filling the Envelope",
      "steps":[
        {
          "headline":"Place the recipient’s name and address in the center.",
          "description":"Set the guest’s name(s) in the center of the envelope. When preparing the design layout for the envelopes, dedicate 1-2 lines for recipient names. Dedicate the next 1-2 lines to the address, with the street name written out completely. Finally, devote the bottom line to the zip code. For example, fill out an envelope like this:Ms. Bailey Miller1266 Sparrow StreetBirmingham, AL35005"
        },
        {
          "headline":"Print the name of the bride and groom in the upper left-hand corner.",
          "description":"Save the time and effort of a labeled inner envelope by printing your name on the larger postage! Select a uniform font for your return address, then use a cursive, more flowing font for the first names of the married couple. For example, fill out the return address like this:Brian and Alex Williams1708 5th AvenueNew York, NY10010\nYou can also print the return address on the back of the envelope.Tip: If you’d like to add a personal touch, consider signing your name on the return address portion of the envelope."
        },
        {
          "headline":"Include the formal invitation in the envelope.",
          "description":"Opt for a simpler wedding invitation by including all of the relevant information on 1 piece of paper or cardstock. Include the wedding date, location, ceremony and reception time, and RSVP deadline on the formal invitation. Additionally, mention if they need to indicate a food preference on the RSVP card."
        },
        {
          "headline":"Slip in a pre-addressed RSVP card for the guests to fill out.",
          "description":"Provide an area for the guest to specify if they’re coming and who they’re bringing with them. To save time for your guests, pre-address all of these RSVPs to the bride and groom and add postage so your guests can mail them back easily. If you want your guests to select food for the reception, include a checklist of the menu on the RSVP card."
        },
        {
          "headline":"Add a stamp to the letter so it’s ready to mail.",
          "description":"Include a single stamp in the corner of your wedding invitation to ensure that the invite arrives at its intended destination. Try and use identical or themed stamps on all of the invitations so they look uniform. If you want to make your envelopes extra stylish, consider using vintage stamps."
        }
      ]
    }
  ],
  "text":" Using the Proper Honorifics Address married couples with both first names. Fill out the invitation by mentioning the first names of both partners, instead of just using the husband’s first and last name. If both partners use different last names, then be sure to use 2 separate lines for each individual. If you aren’t sure how to address a certain couple, reach out to either partner to find out. For example, address an invitation envelope with: Mr. and Mrs. Brad and Katie Smith\nIf both partners have separate last names, address them like:Mr. Brad LewisMrs. Katie Smith\nIf you’d prefer to be more formal, use the male’s full name on the invitation, like Mr. and Mrs. Brad Lewis Write out prefixes and suffixes if you’re trying to be formal. Take a moment to write out a guest’s full name on a wedding invitation, including their proper prefixes and suffixes. Precede “junior” with a comma before writing out the whole lowercase word. If you’re addressing a judge or doctor, use  “The Honorable” and “Doctor” on the invitation. Additionally, be sure to write out the full military title for any guests, as necessary. For instance, address a Navy captain and her non-military husband as: Captain Jennifer Rollins and Mr. Erik Rollins\nIf you’re inviting a judge, address them as: The Honorable Daniel Clinton and Mrs. Lucy Clinton Refer to single women with the “Ms.” honorific. Address your single, female friends with a subtle and polite prefix to keep the invitations formal. If you feel like your friend or family member would prefer the “Miss” honorific, feel free to use that instead. If you’re ever unsure of which honorific to use, always default to “Ms.”\nFor example, address an invitation to a female friend like this: Ms. Carol DavisDid you know? If you’re inviting a widowed individual, continue using her late husband’s surname on the invitation. Go for the “Mr.” honorific when inviting men. Address all male guests with the “Mr.” prefix, unless they’d prefer to use a different honorific. If you aren’t sure of a guest’s preference, feel free to contact them and double check. For instance, address a male guest like this: Mr. Anthony Maxwell Opt for the “Mx.” title when inviting gender-neutral friends and family. Use the “Mx.” pronoun in the same way that you’d use “Mr.” or “Ms.” on an invitation. If you’re uncertain of a guest’s preferred pronouns, use “Mx.” on the invitation instead of assuming. If you’d like to double-check, feel free to ask them! For example, refer to a gender-neutral friend as: Mx. Sam Johnson Address entire families on a single envelope. Use the top recipient line to write out the parents’ names. Once you’ve written out this line, you can devote a second line to the children’s first names. If the family has a lot of children, feel free to address the family as 1 unit. For instance, address a family invitation with:Mr. and Mrs. Xavier and Kelsey MatthewsSammy and Alex\nIf you’re addressing the family as a whole unit, write: The Matthews Family\nCreate a separate invitation for adult children living with their parents. If you want to create individual invitations for children, use “Miss” and “Master” to address them. Write out the name of any known guests. Dedicate the top line of the address to your initially invited friend or family member. If you know the name of the partner or guest that they’ll bring along, devote the second line to that person’s name. For example, write out an invitation like this:Ms. Lauren SmithMr. James Nottingham Note on the envelope if the invitee can bring a guest. Let the recipient know right away if they’re allowed to bring a plus 1 by specifying on the envelope. To do this, write “and guest” after the recipient’s name, with “guest” remaining lowercase. For instance, write out the invitation like this: Ms. Patricia Gold and guest Labeling and Filling the Envelope Place the recipient’s name and address in the center. Set the guest’s name(s) in the center of the envelope. When preparing the design layout for the envelopes, dedicate 1-2 lines for recipient names. Dedicate the next 1-2 lines to the address, with the street name written out completely. Finally, devote the bottom line to the zip code. For example, fill out an envelope like this:Ms. Bailey Miller1266 Sparrow StreetBirmingham, AL35005 Print the name of the bride and groom in the upper left-hand corner. Save the time and effort of a labeled inner envelope by printing your name on the larger postage! Select a uniform font for your return address, then use a cursive, more flowing font for the first names of the married couple. For example, fill out the return address like this:Brian and Alex Williams1708 5th AvenueNew York, NY10010\nYou can also print the return address on the back of the envelope.Tip: If you’d like to add a personal touch, consider signing your name on the return address portion of the envelope. Include the formal invitation in the envelope. Opt for a simpler wedding invitation by including all of the relevant information on 1 piece of paper or cardstock. Include the wedding date, location, ceremony and reception time, and RSVP deadline on the formal invitation. Additionally, mention if they need to indicate a food preference on the RSVP card. Slip in a pre-addressed RSVP card for the guests to fill out. Provide an area for the guest to specify if they’re coming and who they’re bringing with them. To save time for your guests, pre-address all of these RSVPs to the bride and groom and add postage so your guests can mail them back easily. If you want your guests to select food for the reception, include a checklist of the menu on the RSVP card. Add a stamp to the letter so it’s ready to mail. Include a single stamp in the corner of your wedding invitation to ensure that the invite arrives at its intended destination. Try and use identical or themed stamps on all of the invitations so they look uniform. If you want to make your envelopes extra stylish, consider using vintage stamps.",
  "tyn_model":[
    "envelope",
    "” on",
    "“ms.",
    "” honorific",
    "“mr.",
    "“mx",
    "” and",
    "“miss",
    "stamps",
    "“junior",
    "” with",
    "“the",
    "“doctor",
    "judge",
    "”\n",
    "” prefix",
    "” title",
    "” pronoun",
    "” or",
    "’ names",
    "“master",
    "” to",
    "“and",
    "” after",
    "“guest",
    "” remaining",
    "cardstock"
  ],
  "tyn_section":[

  ]
}