{
  "title":"How to Make Ashtello",
  "url":"https://www.wikihow.com/Make-Ashtello",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Middle Eastern Cuisine"
  ],
  "steps":[
    {
      "headline":"Gather all ingredients.",
      "description":"Make sure you have everything out ready to go before starting, because you won’t have time to look for ingredients as you're making the recipe."
    },
    {
      "headline":"Add the heavy whipping cream or half and half, sugar, and rose water to a pot.",
      "description":"Heat over high heat on a stovetop and stir until it gets hot. Make sure the sugar dissolves and all ingredients blend and create a smooth consistency. Do not let it boil."
    },
    {
      "headline":"Add cold milk and gelatin in a separate bowl.",
      "description":"Whisk until the milk and gelatin are incorporated together."
    },
    {
      "headline":"Add the milk and gelatin mixture to the pot on the stovetop.",
      "description":"Once the pot on the stovetop gets hot, turn off the stove and add in the milk and gelatin mixture. Whisk until incorporated."
    },
    {
      "headline":"Grab the cake mold and pour in the mixture.",
      "description":"Once you are done whisking the mixture, grab the cake mold and pour the mixture in. Let it cool for 20 minutes."
    },
    {
      "headline":"Refrigerate for 3-4 hours or overnight.",
      "description":"Now that the mixture is cool, refrigerate it for 3-4 hours or leave it all night for better consistency."
    },
    {
      "headline":"Place pan in a sink with hot water.",
      "description":"Once you allow the mixture to refrigerate for the appropriate time and it is ready and firm, it’s time to take it out. Put the cake mold into the sink with hot water and let it sit for 10 seconds."
    },
    {
      "headline":"Pull the pan out and cut around edges.",
      "description":"The easiest way to allow it to slip out of the pan is to pull out the pan from the hot water and cut around the edges so that they are not stuck to the side of the pan."
    },
    {
      "headline":"Grab a plate to flip over.",
      "description":"Now grab a plate and put it on top of the cake mold in order to flip over the Ashtello."
    },
    {
      "headline":"Flip over the cake mold onto a plate.",
      "description":"Once you flip the cake mold over the plate the Ashtello should be loose and fall right onto the plate."
    },
    {
      "headline":"Garnish with pistachios.",
      "description":"Add crushed pistachios to the top of the ashtello."
    },
    {
      "headline":"Prepare the syrup for serving.",
      "description":"Bring to boil water, sugar, and rose water. Simmer for 15 minutes."
    },
    {
      "headline":"Serve.",
      "description":"The dish is ready to be served. Cut the dish in desired pieces of your liking. Serve the syrup either hot on top of Ashtello or cool and serve next to the ashtello."
    }
  ],
  "text":" Gather all ingredients. Make sure you have everything out ready to go before starting, because you won’t have time to look for ingredients as you're making the recipe. Add the heavy whipping cream or half and half, sugar, and rose water to a pot. Heat over high heat on a stovetop and stir until it gets hot. Make sure the sugar dissolves and all ingredients blend and create a smooth consistency. Do not let it boil. Add cold milk and gelatin in a separate bowl. Whisk until the milk and gelatin are incorporated together. Add the milk and gelatin mixture to the pot on the stovetop. Once the pot on the stovetop gets hot, turn off the stove and add in the milk and gelatin mixture. Whisk until incorporated. Grab the cake mold and pour in the mixture. Once you are done whisking the mixture, grab the cake mold and pour the mixture in. Let it cool for 20 minutes. Refrigerate for 3-4 hours or overnight. Now that the mixture is cool, refrigerate it for 3-4 hours or leave it all night for better consistency. Place pan in a sink with hot water. Once you allow the mixture to refrigerate for the appropriate time and it is ready and firm, it’s time to take it out. Put the cake mold into the sink with hot water and let it sit for 10 seconds. Pull the pan out and cut around edges. The easiest way to allow it to slip out of the pan is to pull out the pan from the hot water and cut around the edges so that they are not stuck to the side of the pan. Grab a plate to flip over. Now grab a plate and put it on top of the cake mold in order to flip over the Ashtello. Flip over the cake mold onto a plate. Once you flip the cake mold over the plate the Ashtello should be loose and fall right onto the plate. Garnish with pistachios. Add crushed pistachios to the top of the ashtello. Prepare the syrup for serving. Bring to boil water, sugar, and rose water. Simmer for 15 minutes. Serve. The dish is ready to be served. Cut the dish in desired pieces of your liking. Serve the syrup either hot on top of Ashtello or cool and serve next to the ashtello.",
  "tyn_model":[
    "plate",
    "milk",
    "gelatin",
    "water",
    "sugar",
    "rose water",
    "pot",
    "cake mold",
    "pistachios",
    "ashtello",
    "heavy whipping cream",
    "half and half,",
    "bowl",
    "stove",
    "whisk",
    "pan",
    "syrup"
  ],
  "tyn_section":[

  ]
}