{
  "title":"How to Determine CBD Oil Quality",
  "url":"https://www.wikihow.com/Determine-CBD-Oil-Quality",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Checking the Product Label",
      "steps":[
        {
          "headline":"Pick a full-spectrum CBD oil if you want the most effectiveness.",
          "description":"Full-spectrum oil contains other molecules and chemicals from the hemp plant, which usually gives the CBD oil a more prominent effect. Look around the label to see if it has either “full-spectrum” or “whole-plant” written on it so you know that it will work well for you. If you can’t find the information on the label, then the oil may not work as well. Full-spectrum oils usually have a yellow, green, or brown color. Search the CBD oil online to see if the product website lists any additional information.Warning: Full-spectrum oils may contain trace amounts of THC and may show up on drug tests."
        },
        {
          "headline":"Choose an isolate oil if you want pure CBD.",
          "description":"Isolate oils are filtered to remove the other chemicals found in hemp so the CBD doesn’t have any additional contaminants. Look for the term “isolate” or “THC-free” on the packaging to determine if the product has other chemicals. Then check the ingredients listing to see if there are any other added chemicals besides the CBD. Isolate oils work well if you’re frequently drug-tested since they don’t contain THC. Isolate CBD oils may not be as effective as full-spectrum oil since they don’t contain the other chemicals from hemp."
        },
        {
          "headline":"Check that the product has less than 0.3% THC.",
          "description":"Since CBD comes from hemp and marijuana, the oil may have small percentages of tetrahydrocannabinol (THC), which is the chemical that gives you a high. Make sure the THC content is clearly listed on the package label, or else it may be low-quality. Avoid buying any CBD oils if you aren’t sure how much THC it has, since it could have negative effects. THC levels below 0.03% will not give you a high, so oils are still safe to use. If your CBD oil has higher than 0.3% THC content, then you could be charged for possession of marijuana if it’s illegal in your area."
        },
        {
          "headline":"Read the nutritional label to see if it lists the ingredients.",
          "description":"Good-quality CBD companies are usually transparent with any additives they include with the CBD oil. Inspect the product packaging and search for a breakdown of how much of each ingredient is included in the oil. If you aren’t able to easily find the CBD oil ingredients on the package, then the CBD oil may be of lower quality and should be avoided if you’re able to. You can also try searching for the CBD oil online to see if the ingredients are broken down there. If the CBD oil doesn’t have any nutritional information, then avoid the product entirely."
        },
        {
          "headline":"Calculate the price per milligram to see if it’s over $0.05 USD.",
          "description":"Properly extracting and filtering CBD from hemp plants can be an expensive process, so high-quality oils will usually cost more. Check how many milligrams of oil are included in the package and divide it by the total price. If the cost equals less than $0.05 USD per milligram, then the oil is most likely low-quality and should be avoided. If it’s over that price, then the CBD oil should be safe. For example, if you have a 1,000 mg container of CBD oil that costs $65 USD, then the equation would be 65/1,000 = $0.07 USD per milligram. The price may vary more depending on the concentration of the CBD oil as well."
        }
      ]
    },
    {
      "name":"Researching the Manufacturer",
      "steps":[
        {
          "headline":"Get oil using hemp from the United States to ensure it’s certified.",
          "description":"Hemp that’s grown in the United States has to be approved by the Department of Agriculture to ensure the growing environment is safe. First, see if the manufacturer lists the hemp source on the product label. If you don’t see the source listed there, look on the manufacturer’s website for information about what hemp they use for their products. If you aren’t able to find information about the hemp, then it’s most likely low-quality and shouldn’t be used. If you can’t find hemp grown in the United States, then make sure it’s non-GMO and pesticide-free from an industrial grower. Some other countries also have processes for certifying CBD oil, such as the United Kingdom. You may buy from them if it would be easier than importing it from the United States.Warning: Hemp easily absorbs chemicals and molecules from the soil, so the hemp and CBD oil could contain harmful chemicals if they’re already present in the growing medium."
        },
        {
          "headline":"Look for CBD oil that uses ethanol or CO2 extraction for the safest substance.",
          "description":"Ethanol or CO2 extraction removes higher percentages of CBD without including any harmful chemicals in the final oil. If the extraction method hasn’t been listed on the oil’s label, then check the manufacturer’s website for details about their process. If you aren’t able to determine how they extract CBD from hemp, avoid the oil since it may be unsafe to use. Low-quality oils will use toxic chemicals like butane for extracting CBD, which can affect the purity of the oil and make it unsafe."
        },
        {
          "headline":"See if the oil has been tested by a third-party lab.",
          "description":"Third-party labs test the purity and concentration of the CBD oil to make sure they’re safe for consumption. Usually, the label will say “third-party lab-tested” if it’s been checked, but other brands may not put it on the label. Look at the manufacturing process on the product’s website to make sure they have their CBD tested. If you can’t find any information, then the CBD may not be safe. You can usually find the results of the lab’s tests so you can look at a more detailed breakdown of any chemicals or additives found in the oil."
        },
        {
          "headline":"Call the product’s support line to ask a representative further questions.",
          "description":"Many CBD products have a support line that you contact if you have questions or concerns about the oil. Dial the number on the product’s package or website so you can reach a representative. Ask questions about any information you weren’t able to find on the package or concerns you have. The representative should be able to answer any queries you have for them. If the representative can’t answer your questions about basic information, such as the manufacturing process or ingredients, then the oil may be low-quality."
        }
      ]
    }
  ],
  "text":" Checking the Product Label Pick a full-spectrum CBD oil if you want the most effectiveness. Full-spectrum oil contains other molecules and chemicals from the hemp plant, which usually gives the CBD oil a more prominent effect. Look around the label to see if it has either “full-spectrum” or “whole-plant” written on it so you know that it will work well for you. If you can’t find the information on the label, then the oil may not work as well. Full-spectrum oils usually have a yellow, green, or brown color. Search the CBD oil online to see if the product website lists any additional information.Warning: Full-spectrum oils may contain trace amounts of THC and may show up on drug tests. Choose an isolate oil if you want pure CBD. Isolate oils are filtered to remove the other chemicals found in hemp so the CBD doesn’t have any additional contaminants. Look for the term “isolate” or “THC-free” on the packaging to determine if the product has other chemicals. Then check the ingredients listing to see if there are any other added chemicals besides the CBD. Isolate oils work well if you’re frequently drug-tested since they don’t contain THC. Isolate CBD oils may not be as effective as full-spectrum oil since they don’t contain the other chemicals from hemp. Check that the product has less than 0.3% THC. Since CBD comes from hemp and marijuana, the oil may have small percentages of tetrahydrocannabinol (THC), which is the chemical that gives you a high. Make sure the THC content is clearly listed on the package label, or else it may be low-quality. Avoid buying any CBD oils if you aren’t sure how much THC it has, since it could have negative effects. THC levels below 0.03% will not give you a high, so oils are still safe to use. If your CBD oil has higher than 0.3% THC content, then you could be charged for possession of marijuana if it’s illegal in your area. Read the nutritional label to see if it lists the ingredients. Good-quality CBD companies are usually transparent with any additives they include with the CBD oil. Inspect the product packaging and search for a breakdown of how much of each ingredient is included in the oil. If you aren’t able to easily find the CBD oil ingredients on the package, then the CBD oil may be of lower quality and should be avoided if you’re able to. You can also try searching for the CBD oil online to see if the ingredients are broken down there. If the CBD oil doesn’t have any nutritional information, then avoid the product entirely. Calculate the price per milligram to see if it’s over $0.05 USD. Properly extracting and filtering CBD from hemp plants can be an expensive process, so high-quality oils will usually cost more. Check how many milligrams of oil are included in the package and divide it by the total price. If the cost equals less than $0.05 USD per milligram, then the oil is most likely low-quality and should be avoided. If it’s over that price, then the CBD oil should be safe. For example, if you have a 1,000 mg container of CBD oil that costs $65 USD, then the equation would be 65/1,000 = $0.07 USD per milligram. The price may vary more depending on the concentration of the CBD oil as well. Researching the Manufacturer Get oil using hemp from the United States to ensure it’s certified. Hemp that’s grown in the United States has to be approved by the Department of Agriculture to ensure the growing environment is safe. First, see if the manufacturer lists the hemp source on the product label. If you don’t see the source listed there, look on the manufacturer’s website for information about what hemp they use for their products. If you aren’t able to find information about the hemp, then it’s most likely low-quality and shouldn’t be used. If you can’t find hemp grown in the United States, then make sure it’s non-GMO and pesticide-free from an industrial grower. Some other countries also have processes for certifying CBD oil, such as the United Kingdom. You may buy from them if it would be easier than importing it from the United States.Warning: Hemp easily absorbs chemicals and molecules from the soil, so the hemp and CBD oil could contain harmful chemicals if they’re already present in the growing medium. Look for CBD oil that uses ethanol or CO2 extraction for the safest substance. Ethanol or CO2 extraction removes higher percentages of CBD without including any harmful chemicals in the final oil. If the extraction method hasn’t been listed on the oil’s label, then check the manufacturer’s website for details about their process. If you aren’t able to determine how they extract CBD from hemp, avoid the oil since it may be unsafe to use. Low-quality oils will use toxic chemicals like butane for extracting CBD, which can affect the purity of the oil and make it unsafe. See if the oil has been tested by a third-party lab. Third-party labs test the purity and concentration of the CBD oil to make sure they’re safe for consumption. Usually, the label will say “third-party lab-tested” if it’s been checked, but other brands may not put it on the label. Look at the manufacturing process on the product’s website to make sure they have their CBD tested. If you can’t find any information, then the CBD may not be safe. You can usually find the results of the lab’s tests so you can look at a more detailed breakdown of any chemicals or additives found in the oil. Call the product’s support line to ask a representative further questions. Many CBD products have a support line that you contact if you have questions or concerns about the oil. Dial the number on the product’s package or website so you can reach a representative. Ask questions about any information you weren’t able to find on the package or concerns you have. The representative should be able to answer any queries you have for them. If the representative can’t answer your questions about basic information, such as the manufacturing process or ingredients, then the oil may be low-quality.",
  "tyn_model":[
    "cbd oil",
    "hemp",
    "cbd",
    "” or",
    "oil",
    "hemp plant",
    "“full",
    "“whole",
    "” written",
    "“isolate",
    "“thc",
    "” on",
    "isolate oils",
    "isolate cbd oils",
    "cbd oils",
    "marijuana",
    "hemp plants",
    "butane",
    "“third-",
    "” if",
    "cbd products"
  ],
  "tyn_section":[

  ]
}