{
  "title":"How to Read CBD Oil Labels",
  "url":"https://www.wikihow.com/Read-CBD-Oil-Labels",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Herbs and Spices"
  ],
  "parts":[
    {
      "name":"Determining the Potency",
      "steps":[
        {
          "headline":"Find the amount of CBD in the oil listed in milligrams.",
          "description":"The amount of CBD will be clearly labeled on the front of the package so you can easily find it. Check next to the number to see if it’s the amount in the entire package or per serving. If you’re trying CBD for the first time, choose an oil with less CBD so you can get used to how it affects your body. The amount of CBD in the package is not the same as the package size. Some CBD oils may be mislabeled and could contain more or less CBD. Research the CBD oil’s manufacturer and pick one that lists accurate amounts."
        },
        {
          "headline":"Compare the package’s size to the amount of CBD to learn the concentration.",
          "description":"Look near the bottom of the label to find the total amount of oil in the package. Divide the amount of CBD by the size of the package so you know the oil’s potency. Compare the potencies of multiple oils so you can choose one that works best for you. For example, if a 15 mL bottle contains 500 mg of CBD, then the equation would be 500/15 = 33.3 mg of CBD per mL. CBD oil affects everyone differently. While it may only take you 1 dose of oil for you to feel it, another person may need multiple doses or a higher potency to feel the same effect."
        },
        {
          "headline":"Make note of the serving size on the nutritional label.",
          "description":"Check the supplement information listed on the back or side of the package to find the serving size. CBD oils usually have serving sizes of 0.5 or 1 mL, but it may vary depending on the product you’re using. The label will also list how many servings are included in the package. Don’t use more than the serving size listed until you know how CBD oil affects your body. Too much CBD can give you adverse reactions and make your conditions feel worse."
        },
        {
          "headline":"Check if the CBD oil contains any THC.",
          "description":"Since CBD oil is extracted from hemp or marijuana, it may contain trace amounts of tetrahydrocannabinol (THC), which is the chemical that gets you high. Look on the label near the amount of CBD or on the nutritional panel on the back of the package to find the amount of THC. Usually, high-quality CBD oils will have less than 0.3% THC and will not give you a high. If you can’t find the amount of THC listed on the package, avoid getting the oil since it may be low-quality. Check the laws and regulations on CBD in your area since they may vary.Warning: If the CBD oil has over 0.6% THC, then you may be charged with possession of drugs if marijuana is illegal in your area."
        }
      ]
    },
    {
      "name":"Checking the Manufacturing Process",
      "steps":[
        {
          "headline":"Look for full-spectrum or isolate to determine if the oil uses the whole plant.",
          "description":"Full-spectrum oil contains other chemicals from hemp plants to help enhance the effects of the CBD. Isolate oils only use pure CBD from the plant, but they may be less effective. Check the front of the package or near the nutritional information to see what kind of CBD oil you have. Some labels may say “whole-plant” instead of “full-spectrum.”\nFull-spectrum oils may contain trace amounts of THC while isolate oils will not. If you are drug-tested on a regular basis, choose an isolate oil instead. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMichael Lewis, MD, MPH, MBA, FACPM, FACN\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBoard Certified Brain Health Physician\t\t\t\t\t\t\t\tMichael D. Lewis, MD, MPH, MBA, FACPM, FACN, is an expert on nutritional interventions for brain health, particularly the prevention and rehabilitation of brain injury. In 2012 upon retiring as a Colonel after 31 years in the U.S. Army, he founded the nonprofit Brain Health Education and Research Institute. He is in private practice in Potomac, Maryland, and is the author of \"When Brains Collide: What every athlete and parent should know about the prevention and treatment of concussions and head injuries.\" He is a graduate of the U.S. Military Academy at West Point and Tulane University School of Medicine. He completed post-graduate training at Walter Reed Army Medical Center, Johns Hopkins University, and Walter Reed Army Institute of Research. Dr. Lewis is board-certified and a Fellow of the American College of Preventive Medicine and American College of Nutrition. Michael Lewis, MD, MPH, MBA, FACPM, FACN\t\t\tBoard Certified Brain Health Physician\t\t\t\tOur Expert Agrees: When you're looking at a CBD label, check whether the CBD is extracted from hemp or cannabis, as well as whether it's a broad or whole spectrum extract. In addition, the label should tell you how much CBD is in the product, but also how much of the total extract it contains. For example, a soft gel might contain 15 mg of CBD and 45 mg of hemp extract."
        },
        {
          "headline":"Check for the oil’s extraction process to make sure it’s safe to consume.",
          "description":"There are multiple ways to extract CBD oil, but some of them use toxic chemicals that aren’t safe to use. Check near the nutritional information to see if they list the extraction process on the package. If they list CO2 or ethanol as an extraction process, the oil will be safe for you to use. However, if they use a chemical like butane, then it may not be safe to use. If you can’t find the extraction process on the label, look on the product’s website to see if it’s listed there. Don’t buy CBD oil if you aren’t able to find the extraction method."
        },
        {
          "headline":"See if the label lists the percentages of each ingredient.",
          "description":"Check on the nutritional panel for a list of the ingredients included in your CBD oil. If you have a good-quality oil, then each ingredient and their amounts should be on the package. If you don’t see an ingredients list on the package, then there may be additives in the oil that could be harmful. If you don’t see cannabidiol in the ingredients or it only says “hemp oil,” then there it may have a lower amount of CBD than what’s listed on the package."
        },
        {
          "headline":"Search for the batch number so you can check lab reports on the oil.",
          "description":"Manufacturers usually have third-party labs test the CBD oil to check the purity and make sure it’s safe to consume. Check for a batch number printed or stamped onto the package. Look up the product and the batch number online to see the lab results so you know what’s in the CBD oil. If you don’t find a batch number or third-party lab testing listed on the package, then the CBD oil may be low-quality.Tip: Some CBD oils have QR codes that you can scan with your phone so you can see the results of the lab reports right away."
        },
        {
          "headline":"Pay attention to the expiration date.",
          "description":"The expiration date is usually printed on the side or bottom of the CBD oil package. If you’re close to the expiration date, avoid getting or using the oil since it will start to lose its effectiveness. Only buy the CBD oil if you think you’ll use all of it before the expiration date. If you don’t see an expiration date on the package, then don’t use the CBD oil since you don’t know if it’s still effective."
        }
      ]
    }
  ],
  "text":" Determining the Potency Find the amount of CBD in the oil listed in milligrams. The amount of CBD will be clearly labeled on the front of the package so you can easily find it. Check next to the number to see if it’s the amount in the entire package or per serving. If you’re trying CBD for the first time, choose an oil with less CBD so you can get used to how it affects your body. The amount of CBD in the package is not the same as the package size. Some CBD oils may be mislabeled and could contain more or less CBD. Research the CBD oil’s manufacturer and pick one that lists accurate amounts. Compare the package’s size to the amount of CBD to learn the concentration. Look near the bottom of the label to find the total amount of oil in the package. Divide the amount of CBD by the size of the package so you know the oil’s potency. Compare the potencies of multiple oils so you can choose one that works best for you. For example, if a 15 mL bottle contains 500 mg of CBD, then the equation would be 500/15 = 33.3 mg of CBD per mL. CBD oil affects everyone differently. While it may only take you 1 dose of oil for you to feel it, another person may need multiple doses or a higher potency to feel the same effect. Make note of the serving size on the nutritional label. Check the supplement information listed on the back or side of the package to find the serving size. CBD oils usually have serving sizes of 0.5 or 1 mL, but it may vary depending on the product you’re using. The label will also list how many servings are included in the package. Don’t use more than the serving size listed until you know how CBD oil affects your body. Too much CBD can give you adverse reactions and make your conditions feel worse. Check if the CBD oil contains any THC. Since CBD oil is extracted from hemp or marijuana, it may contain trace amounts of tetrahydrocannabinol (THC), which is the chemical that gets you high. Look on the label near the amount of CBD or on the nutritional panel on the back of the package to find the amount of THC. Usually, high-quality CBD oils will have less than 0.3% THC and will not give you a high. If you can’t find the amount of THC listed on the package, avoid getting the oil since it may be low-quality. Check the laws and regulations on CBD in your area since they may vary.Warning: If the CBD oil has over 0.6% THC, then you may be charged with possession of drugs if marijuana is illegal in your area. Checking the Manufacturing Process Look for full-spectrum or isolate to determine if the oil uses the whole plant. Full-spectrum oil contains other chemicals from hemp plants to help enhance the effects of the CBD. Isolate oils only use pure CBD from the plant, but they may be less effective. Check the front of the package or near the nutritional information to see what kind of CBD oil you have. Some labels may say “whole-plant” instead of “full-spectrum.”\nFull-spectrum oils may contain trace amounts of THC while isolate oils will not. If you are drug-tested on a regular basis, choose an isolate oil instead. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMichael Lewis, MD, MPH, MBA, FACPM, FACN\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tBoard Certified Brain Health Physician\t\t\t\t\t\t\t\tMichael D. Lewis, MD, MPH, MBA, FACPM, FACN, is an expert on nutritional interventions for brain health, particularly the prevention and rehabilitation of brain injury. In 2012 upon retiring as a Colonel after 31 years in the U.S. Army, he founded the nonprofit Brain Health Education and Research Institute. He is in private practice in Potomac, Maryland, and is the author of \"When Brains Collide: What every athlete and parent should know about the prevention and treatment of concussions and head injuries.\" He is a graduate of the U.S. Military Academy at West Point and Tulane University School of Medicine. He completed post-graduate training at Walter Reed Army Medical Center, Johns Hopkins University, and Walter Reed Army Institute of Research. Dr. Lewis is board-certified and a Fellow of the American College of Preventive Medicine and American College of Nutrition. Michael Lewis, MD, MPH, MBA, FACPM, FACN\t\t\tBoard Certified Brain Health Physician\t\t\t\tOur Expert Agrees: When you're looking at a CBD label, check whether the CBD is extracted from hemp or cannabis, as well as whether it's a broad or whole spectrum extract. In addition, the label should tell you how much CBD is in the product, but also how much of the total extract it contains. For example, a soft gel might contain 15 mg of CBD and 45 mg of hemp extract. Check for the oil’s extraction process to make sure it’s safe to consume. There are multiple ways to extract CBD oil, but some of them use toxic chemicals that aren’t safe to use. Check near the nutritional information to see if they list the extraction process on the package. If they list CO2 or ethanol as an extraction process, the oil will be safe for you to use. However, if they use a chemical like butane, then it may not be safe to use. If you can’t find the extraction process on the label, look on the product’s website to see if it’s listed there. Don’t buy CBD oil if you aren’t able to find the extraction method. See if the label lists the percentages of each ingredient. Check on the nutritional panel for a list of the ingredients included in your CBD oil. If you have a good-quality oil, then each ingredient and their amounts should be on the package. If you don’t see an ingredients list on the package, then there may be additives in the oil that could be harmful. If you don’t see cannabidiol in the ingredients or it only says “hemp oil,” then there it may have a lower amount of CBD than what’s listed on the package. Search for the batch number so you can check lab reports on the oil. Manufacturers usually have third-party labs test the CBD oil to check the purity and make sure it’s safe to consume. Check for a batch number printed or stamped onto the package. Look up the product and the batch number online to see the lab results so you know what’s in the CBD oil. If you don’t find a batch number or third-party lab testing listed on the package, then the CBD oil may be low-quality.Tip: Some CBD oils have QR codes that you can scan with your phone so you can see the results of the lab reports right away. Pay attention to the expiration date. The expiration date is usually printed on the side or bottom of the CBD oil package. If you’re close to the expiration date, avoid getting or using the oil since it will start to lose its effectiveness. Only buy the CBD oil if you think you’ll use all of it before the expiration date. If you don’t see an expiration date on the package, then don’t use the CBD oil since you don’t know if it’s still effective.",
  "tyn_model":[
    "cbd",
    "cbd oil",
    "cbd oils",
    "brain health physician",
    "full-spectrum",
    "hemp plants",
    "“whole",
    "” instead",
    "“full",
    "”\n",
    "isolate oils",
    "isolate oil",
    "brain health education and research institute",
    "nutrition",
    "hemp",
    "cannabis",
    "hemp extract",
    "butane",
    "“hemp",
    "” then"
  ],
  "tyn_section":[

  ]
}