{
  "title":"How to Fold a Transforming Origami Rose Box",
  "url":"https://www.wikihow.com/Fold-a-Transforming-Origami-Rose-Box",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Origami"
  ],
  "steps":[
    {
      "headline":"Prepare six evenly sized sheets of Kami paper.",
      "description":"For this particular rose box you will need three pieces of green paper, and three pieces of red paper - but you can use any two colors you'd like. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/f\\/f1\\/Sixpaper.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/f\\/f1\\/Sixpaper.jpg\",\"smallWidth\":460,\"smallHeight\":346,\"bigWidth\":760,\"bigHeight\":571.0734463276837,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}"
    },
    {
      "headline":"Fold all six pieces of paper horizontally into fourths.",
      "description":"Create a crease along the middle of the paper by letting opposite sides of the square meet and fold. Afterwards, fold the two sides inward so that they meet the crease that was made in the middle."
    },
    {
      "headline":"Create diagonal folds that meet with the outer crease for all six pieces of paper.",
      "description":"Fold perpendicular sides to the creases to create a diagonal crease. Line up the perpendicular side with the outer most crease. Create a similar crease using the opposite side to create a parallel crease to the one just made."
    },
    {
      "headline":"Follow diagonal creases to create two pockets in the red pieces of paper.",
      "description":"Fold the paper along one of the diagonal creases that were made, so that the corner lines up with the horizontal crease. Fold the same corner back in the opposite direction of the horizontal crease closest to that corner so that the bottom flap naturally folds upward. Repeat this step for the other corner so that the two pockets cover the white space on the other pocket. After repeating this step for the other corner, the box begins to take its shape as the first side is nearly completed."
    },
    {
      "headline":"Flip the red pieces of paper over and fold the two triangle flaps up.",
      "description":"Fold the two triangle flaps upwards so that the paper has the silhouette of a rhombus."
    },
    {
      "headline":"Fold the two sides of the rhombus inward so that the triangle flaps face inside for the same red pieces of paper.",
      "description":"Create folds so that the same corner of the rhombus that has the triangle flap meets with the corner along the same line as the base of the triangle. Folding both sides of the rhombus accordingly will create a square, and the first side of the box."
    },
    {
      "headline":"Follow one of the diagonal creases to create one pocket in the remaining green pieces of paper.",
      "description":"Fold the paper along one of the diagonal creases that were made, so that the corner lines up with the horizontal crease. Fold the same corner back in the opposite direction of the crease on that corner so that the bottom flap naturally folds upward. Create a crease from the pocket."
    },
    {
      "headline":"Fold the small white corner on the same corner as the last crease made inside twice on the three pieces of green paper.",
      "description":"Fold the corner triangle located on the upper right corner of the three pieces of green paper inward so that it meets with the folded piece from the last step. Fold this newly made larger triangle upward to completely eliminate that triangle."
    },
    {
      "headline":"Fold the second pocket inside of the first to create the other three sides of the square on the three green pieces of paper that remain.",
      "description":"Fold the last pocket along the original diagonal crease and tuck it inside the first pocket that was made. Naturally fold the paper into the final sides of the square. Create a crease along the pocket that was made, and fold the outside triangle inward to finish the fold."
    },
    {
      "headline":"Flip the three green pieces of paper over and fold the triangle on the longer arm inside.",
      "description":"Eliminate the rectangular arm and create a pointier edge by folding the triangle inside of the longer rectangular arm."
    },
    {
      "headline":"Fold both triangular arms of the three green pieces inward so that both arms face inward with the same side as the triangle flap on the longer arm.",
      "description":"Create the last side of the box so that both arms will be creased inward to create a perfect square on the outside of the paper as shown."
    },
    {
      "headline":"Assemble the box by connecting the green pieces of paper together by their longer triangular arms.",
      "description":"Connect the green pieces of paper to each other to form one corner of the box. Insert the longer arms of the box inside of existing pockets on another green piece by inserting the longer arm into the square of the other piece so that it naturally fits inside the existing pocket on the paper. Expose the shorter arms/triangles so that only the longer arms are used to connect the green pieces together on this half of the box."
    },
    {
      "headline":"Assemble the other half of the box by connecting the red pieces of paper together by either of their sides.",
      "description":"Follow the same process used to assemble the green half of the box to assemble the red half. Insert the long flap of one of the red pieces into the pocket that exists in one of the other red pieces. Connect all three red pieces of paper so that they form a uniform corner of the box where all the lines point towards the corner of the red half."
    },
    {
      "headline":"Connect the green and red portions of the box.",
      "description":"Line up the short flaps of the green pieces and the long flaps of the red pieces so that the flaps can fit inside the remaining pockets. Insert all of the flaps into the remaining pockets of the opposite half of the box."
    },
    {
      "headline":"Create the flower by unfolding the short arms of the leaves, and “fluffing” the flower.",
      "description":"Remove the small flaps of the green pieces from their respective red pocket to expose the “leaves” of the flower. Pinch on the diagonal line of the leaves to fully expose the leaves. Pinch on the diagonal line of the flower to expose the “petals” of the flower, and the flower takes its final shape."
    }
  ],
  "text":" Prepare six evenly sized sheets of Kami paper. For this particular rose box you will need three pieces of green paper, and three pieces of red paper - but you can use any two colors you'd like. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/f\\/f1\\/Sixpaper.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/f\\/f1\\/Sixpaper.jpg\",\"smallWidth\":460,\"smallHeight\":346,\"bigWidth\":760,\"bigHeight\":571.0734463276837,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image by: Uploader<br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by\\/3.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"} Fold all six pieces of paper horizontally into fourths. Create a crease along the middle of the paper by letting opposite sides of the square meet and fold. Afterwards, fold the two sides inward so that they meet the crease that was made in the middle. Create diagonal folds that meet with the outer crease for all six pieces of paper. Fold perpendicular sides to the creases to create a diagonal crease. Line up the perpendicular side with the outer most crease. Create a similar crease using the opposite side to create a parallel crease to the one just made. Follow diagonal creases to create two pockets in the red pieces of paper. Fold the paper along one of the diagonal creases that were made, so that the corner lines up with the horizontal crease. Fold the same corner back in the opposite direction of the horizontal crease closest to that corner so that the bottom flap naturally folds upward. Repeat this step for the other corner so that the two pockets cover the white space on the other pocket. After repeating this step for the other corner, the box begins to take its shape as the first side is nearly completed. Flip the red pieces of paper over and fold the two triangle flaps up. Fold the two triangle flaps upwards so that the paper has the silhouette of a rhombus. Fold the two sides of the rhombus inward so that the triangle flaps face inside for the same red pieces of paper. Create folds so that the same corner of the rhombus that has the triangle flap meets with the corner along the same line as the base of the triangle. Folding both sides of the rhombus accordingly will create a square, and the first side of the box. Follow one of the diagonal creases to create one pocket in the remaining green pieces of paper. Fold the paper along one of the diagonal creases that were made, so that the corner lines up with the horizontal crease. Fold the same corner back in the opposite direction of the crease on that corner so that the bottom flap naturally folds upward. Create a crease from the pocket. Fold the small white corner on the same corner as the last crease made inside twice on the three pieces of green paper. Fold the corner triangle located on the upper right corner of the three pieces of green paper inward so that it meets with the folded piece from the last step. Fold this newly made larger triangle upward to completely eliminate that triangle. Fold the second pocket inside of the first to create the other three sides of the square on the three green pieces of paper that remain. Fold the last pocket along the original diagonal crease and tuck it inside the first pocket that was made. Naturally fold the paper into the final sides of the square. Create a crease along the pocket that was made, and fold the outside triangle inward to finish the fold. Flip the three green pieces of paper over and fold the triangle on the longer arm inside. Eliminate the rectangular arm and create a pointier edge by folding the triangle inside of the longer rectangular arm. Fold both triangular arms of the three green pieces inward so that both arms face inward with the same side as the triangle flap on the longer arm. Create the last side of the box so that both arms will be creased inward to create a perfect square on the outside of the paper as shown. Assemble the box by connecting the green pieces of paper together by their longer triangular arms. Connect the green pieces of paper to each other to form one corner of the box. Insert the longer arms of the box inside of existing pockets on another green piece by inserting the longer arm into the square of the other piece so that it naturally fits inside the existing pocket on the paper. Expose the shorter arms/triangles so that only the longer arms are used to connect the green pieces together on this half of the box. Assemble the other half of the box by connecting the red pieces of paper together by either of their sides. Follow the same process used to assemble the green half of the box to assemble the red half. Insert the long flap of one of the red pieces into the pocket that exists in one of the other red pieces. Connect all three red pieces of paper so that they form a uniform corner of the box where all the lines point towards the corner of the red half. Connect the green and red portions of the box. Line up the short flaps of the green pieces and the long flaps of the red pieces so that the flaps can fit inside the remaining pockets. Insert all of the flaps into the remaining pockets of the opposite half of the box. Create the flower by unfolding the short arms of the leaves, and “fluffing” the flower. Remove the small flaps of the green pieces from their respective red pocket to expose the “leaves” of the flower. Pinch on the diagonal line of the leaves to fully expose the leaves. Pinch on the diagonal line of the flower to expose the “petals” of the flower, and the flower takes its final shape.",
  "tyn_model":[
    "paper",
    "green paper",
    "” of",
    "kami paper",
    "“fluffing",
    "” the",
    "“leaves",
    "flower",
    "“petals"
  ],
  "tyn_section":[

  ]
}