{
  "title":"How to Set Photography Rates",
  "url":"https://www.wikihow.com/Set-Photography-Rates",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography"
  ],
  "methods":[
    {
      "name":"Calculating Shoot Prices",
      "steps":[
        {
          "headline":"Estimate how many shoots you think you’ll complete each year.",
          "description":"If you’ve already established yourself as a photographer, look at how many shoots you scheduled in the past year to use as a reference. If you haven’t started yet, think about how long it takes you to shoot and edit photos on a regular basis. Consider how many projects you’re comfortable doing per week or month so you can figure out how many clients you can take throughout the year. For example, if it usually takes you 2 weeks to sort through and edit photographs, you could estimate that you’ll get about 25 clients per year. Wedding photography can be more challenging to book since the peak seasons only last for a few months every year."
        },
        {
          "headline":"Calculate the cost of your photography-related expenses per shoot.",
          "description":"Your overhead includes the price of anything that you regularly use during your shoot. This may include studio rentals, equipment, and software licenses. Add up the total amount of your expenses that you would normally have each year for your photography, and divide it by the number of shoots you estimated. That way, you’ll know how much you need to make to break even. For example, if you use software that costs $500 USD per year and rent a studio that’s $5,000 USD annually, add 5,000 + 500 = $5,500 USD. If you think you’ll do 25 different shoots, then your calculation would be 5,500/25 = $220 USD of expenses per shoot. You can also find the price per hour if you usually shoot different lengths of times or events. For example, if your overheads cost $5,500 USD annually and you plan on working 500 hours on shoots per year, then your calculation would be 5,500/500 = $11 USD per hour."
        },
        {
          "headline":"Charge a rate for your labor that’s 3–4 times what you want to make hourly.",
          "description":"Your labor includes everything you do for your shoots, including traveling, setting up equipment, taking photographs, and editing your work. If you want to make a profit from your photography, choose how much you want, which is usually around $15–25 USD if you’re an amateur or over $50 USD if you’re a professional. Multiply the wage you’d like to make by 3 or 4 to find a reasonable wage so you can pay for taxes or set aside money for emergencies. For example, if you want to earn $20 USD an hour, you could charge $60–80 USD per hour so you can set money aside. In this example, if you spend 4 hours on a shoot and your overhead costs are $11 USD an hour, then you can charge between $284–364 USD for the entire shoot. Average Rates per Shoot\nPortrait or Family Photography: $100–500 USDHeadshot Photography: $75–325 USDEvent or Party Photography: $500–1,000 USDWedding Photography: $1,500–3,500 USDReal Estate/Property Photography: $150–300 USD"
        },
        {
          "headline":"Add the total prices of prints or deliverables to your base price.",
          "description":"If you plan on giving digital copies of your prints, include the price of external hard drives or cloud storage in your expenses. If you plan on offering prints, find out how much it costs to get them printed from a photo lab so you can include them in your price. Be sure to also charge for the amount of time you spent for ordering the prints, shipping them, and inspecting them for quality. For example, if it costs $8 USD to order and ship an 8 in × 10 in (20 cm × 25 cm) print and you spend 30 minutes working on it, charge half your hourly rate plus the price of the print. If your hourly rate is $60 USD, then the print would cost 30 + 8 = $38 USD for a print. The prices for deliverables depend on what you order, how long it takes to work on them, and the sizes of any prints. Only charge for the amount of time you spend actively working on the picture and not for the time you spend waiting for it to print or ship."
        },
        {
          "headline":"Look up other photographers in your area to see if your rate is competitive.",
          "description":"Look for other photographers of your skill level and look on their website to see if they list their rates. Compare the services they offer and the prices they charge for them so you can see if you’re charging a similar rate. Be careful not to set your prices too much higher or lower than your competitors or you may not book as many shoots. If you’re just starting photography and trying to find new clients, price your services slightly lower than your competition so people are more likely to hire you. Avoid setting higher prices and then dropping them lower since previous clients will think they were overcharged."
        }
      ]
    },
    {
      "name":"Consulting with Clients",
      "steps":[
        {
          "headline":"Meet with your client to see what they expect from you.",
          "description":"When you have a potential client contact you, ask to meet them or talk on the phone so you can get an idea of the project’s scope. Find out the exact things they want you to take photos of as well as how long they want your service. Ask if they want to have mostly posed photos or if they want them more candid to capture the entire experience. Make sure you know all of your clients wants and needs so you can offer them the best service. If you’re doing portrait photography, ask how many locations, how long of a session they want, and if they want their photos posed or candid. If you’re photographing an event, such as a party or large group gathering, ask them if there are specific moments they want photographed or if they want you to take random photos throughout. For wedding photography, find out if they just want the ceremony photographed or if they want to include the dinner and reception. If you take commercial photos of property or real estate, then ask if they want pictures at specific times of day or how many angles they want of each room."
        },
        {
          "headline":"Offer different package levels to give your client options on deliverables.",
          "description":"Packages are great ways to bundle your services for a base price so it’s easier for your client to decide what they want. Offer your very basic services for the lowest price package, and add new things to each level, such as additional editing services, longer shoot times, and more prints. Raise your prices by about 25–50% between each of your package options so your clients don’t feel like they’re getting ripped off for different levels. For example, a base wedding package could cost $2,500 and include 6 hours of shoot time, access to an online gallery, and a DVD. A premium wedding package could cost $3,800 and include 10 hours of shooting time, an engagement photo session, and a photo album as well as  the gallery and DVD from the original package. The prices for your packages depend on what services you offer and how long it takes you to complete them.Warning: Only offer 3–4 packages, or else it could be overwhelming for your client to choose one they want."
        },
        {
          "headline":"Have a list of additional services that your client can pick from.",
          "description":"While it’s nice to have packages for your client, they may want to customize your service more so they can get exactly what they’re looking for. Give your client a list of things they can add onto a package or use to build their own package, such as additional prints, aerial drone photography, or a photo booth set up an event. List the prices of each item they can add to their service so your client can easily see how much it will cost them. For example, many drone photographers charge around $150–300 USD for 1–2 hours of service and a selection of photographs. Photo booths with backdrops usually add an additional $150–200 USD per hour to your charges. The amount you charge for your services depends on how much additional time it takes and the upkeep cost for the equipment you’re using."
        },
        {
          "headline":"Make a contract that lists all of your fees and expectations.",
          "description":"Once you and your client agree on what services they want, write out a contract that explicitly states how long you’ll work and what you’ll deliver to the client. Specify the timeframes for how long it will take and when you expect payment from them. Have the client read over the entire contract so they aren’t surprised by anything later on. Don’t start working for the client unless they sign a contract, or else they may try to have you do additional services free of charge."
        },
        {
          "headline":"Ask for a deposit to make your client less likely to cancel your services.",
          "description":"If a client cancels a shoot, then you may lose money if you aren’t able to book a replacement gig. Put a deposit in the contract so your client pays you a portion of your rate upfront. This will help keep them from canceling your services and still allows you to earn some money if they do. Deposits usually range from 25–50% of the total shoot cost. You can have the client break the cost into multiple payments if it’s easier for them financially."
        }
      ]
    }
  ],
  "text":" Calculating Shoot Prices Estimate how many shoots you think you’ll complete each year. If you’ve already established yourself as a photographer, look at how many shoots you scheduled in the past year to use as a reference. If you haven’t started yet, think about how long it takes you to shoot and edit photos on a regular basis. Consider how many projects you’re comfortable doing per week or month so you can figure out how many clients you can take throughout the year. For example, if it usually takes you 2 weeks to sort through and edit photographs, you could estimate that you’ll get about 25 clients per year. Wedding photography can be more challenging to book since the peak seasons only last for a few months every year. Calculate the cost of your photography-related expenses per shoot. Your overhead includes the price of anything that you regularly use during your shoot. This may include studio rentals, equipment, and software licenses. Add up the total amount of your expenses that you would normally have each year for your photography, and divide it by the number of shoots you estimated. That way, you’ll know how much you need to make to break even. For example, if you use software that costs $500 USD per year and rent a studio that’s $5,000 USD annually, add 5,000 + 500 = $5,500 USD. If you think you’ll do 25 different shoots, then your calculation would be 5,500/25 = $220 USD of expenses per shoot. You can also find the price per hour if you usually shoot different lengths of times or events. For example, if your overheads cost $5,500 USD annually and you plan on working 500 hours on shoots per year, then your calculation would be 5,500/500 = $11 USD per hour. Charge a rate for your labor that’s 3–4 times what you want to make hourly. Your labor includes everything you do for your shoots, including traveling, setting up equipment, taking photographs, and editing your work. If you want to make a profit from your photography, choose how much you want, which is usually around $15–25 USD if you’re an amateur or over $50 USD if you’re a professional. Multiply the wage you’d like to make by 3 or 4 to find a reasonable wage so you can pay for taxes or set aside money for emergencies. For example, if you want to earn $20 USD an hour, you could charge $60–80 USD per hour so you can set money aside. In this example, if you spend 4 hours on a shoot and your overhead costs are $11 USD an hour, then you can charge between $284–364 USD for the entire shoot. Average Rates per Shoot\nPortrait or Family Photography: $100–500 USDHeadshot Photography: $75–325 USDEvent or Party Photography: $500–1,000 USDWedding Photography: $1,500–3,500 USDReal Estate/Property Photography: $150–300 USD Add the total prices of prints or deliverables to your base price. If you plan on giving digital copies of your prints, include the price of external hard drives or cloud storage in your expenses. If you plan on offering prints, find out how much it costs to get them printed from a photo lab so you can include them in your price. Be sure to also charge for the amount of time you spent for ordering the prints, shipping them, and inspecting them for quality. For example, if it costs $8 USD to order and ship an 8 in × 10 in (20 cm × 25 cm) print and you spend 30 minutes working on it, charge half your hourly rate plus the price of the print. If your hourly rate is $60 USD, then the print would cost 30 + 8 = $38 USD for a print. The prices for deliverables depend on what you order, how long it takes to work on them, and the sizes of any prints. Only charge for the amount of time you spend actively working on the picture and not for the time you spend waiting for it to print or ship. Look up other photographers in your area to see if your rate is competitive. Look for other photographers of your skill level and look on their website to see if they list their rates. Compare the services they offer and the prices they charge for them so you can see if you’re charging a similar rate. Be careful not to set your prices too much higher or lower than your competitors or you may not book as many shoots. If you’re just starting photography and trying to find new clients, price your services slightly lower than your competition so people are more likely to hire you. Avoid setting higher prices and then dropping them lower since previous clients will think they were overcharged. Consulting with Clients Meet with your client to see what they expect from you. When you have a potential client contact you, ask to meet them or talk on the phone so you can get an idea of the project’s scope. Find out the exact things they want you to take photos of as well as how long they want your service. Ask if they want to have mostly posed photos or if they want them more candid to capture the entire experience. Make sure you know all of your clients wants and needs so you can offer them the best service. If you’re doing portrait photography, ask how many locations, how long of a session they want, and if they want their photos posed or candid. If you’re photographing an event, such as a party or large group gathering, ask them if there are specific moments they want photographed or if they want you to take random photos throughout. For wedding photography, find out if they just want the ceremony photographed or if they want to include the dinner and reception. If you take commercial photos of property or real estate, then ask if they want pictures at specific times of day or how many angles they want of each room. Offer different package levels to give your client options on deliverables. Packages are great ways to bundle your services for a base price so it’s easier for your client to decide what they want. Offer your very basic services for the lowest price package, and add new things to each level, such as additional editing services, longer shoot times, and more prints. Raise your prices by about 25–50% between each of your package options so your clients don’t feel like they’re getting ripped off for different levels. For example, a base wedding package could cost $2,500 and include 6 hours of shoot time, access to an online gallery, and a DVD. A premium wedding package could cost $3,800 and include 10 hours of shooting time, an engagement photo session, and a photo album as well as  the gallery and DVD from the original package. The prices for your packages depend on what services you offer and how long it takes you to complete them.Warning: Only offer 3–4 packages, or else it could be overwhelming for your client to choose one they want. Have a list of additional services that your client can pick from. While it’s nice to have packages for your client, they may want to customize your service more so they can get exactly what they’re looking for. Give your client a list of things they can add onto a package or use to build their own package, such as additional prints, aerial drone photography, or a photo booth set up an event. List the prices of each item they can add to their service so your client can easily see how much it will cost them. For example, many drone photographers charge around $150–300 USD for 1–2 hours of service and a selection of photographs. Photo booths with backdrops usually add an additional $150–200 USD per hour to your charges. The amount you charge for your services depends on how much additional time it takes and the upkeep cost for the equipment you’re using. Make a contract that lists all of your fees and expectations. Once you and your client agree on what services they want, write out a contract that explicitly states how long you’ll work and what you’ll deliver to the client. Specify the timeframes for how long it will take and when you expect payment from them. Have the client read over the entire contract so they aren’t surprised by anything later on. Don’t start working for the client unless they sign a contract, or else they may try to have you do additional services free of charge. Ask for a deposit to make your client less likely to cancel your services. If a client cancels a shoot, then you may lose money if you aren’t able to book a replacement gig. Put a deposit in the contract so your client pays you a portion of your rate upfront. This will help keep them from canceling your services and still allows you to earn some money if they do. Deposits usually range from 25–50% of the total shoot cost. You can have the client break the cost into multiple payments if it’s easier for them financially.",
  "tyn_model":[
    "photography",
    "photographers",
    "dvd",
    "photographer",
    "photos",
    "photographs",
    "photography-related expenses",
    "software",
    "photo lab",
    "× 10",
    "× 25",
    "portrait photography",
    "photo album",
    "aerial drone photography",
    "photo booth",
    "drone photographers",
    "photo booths",
    "deposit"
  ],
  "tyn_section":[

  ]
}