{
  "title":"How to Make Taco Triangles",
  "url":"https://www.wikihow.com/Make-Taco-Triangles",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine",
    "Taco Dishes"
  ],
  "steps":[
    {
      "headline":"Mix vegetables and spices.",
      "description":"Add the olive oil, onion, red and green bell pepper, salt, pepper, paprika, chili powder, cumin, garlic powder, and dried oregano into a large pan. Mix to combine."
    },
    {
      "headline":"Cook the vegetables.",
      "description":"Add the juiced lime to the pan and cook the vegetables for approximately 5 minutes on medium heat, or until soft."
    },
    {
      "headline":"Separate the vegetables into three large bowls.",
      "description":""
    },
    {
      "headline":"Mix the vegetables with chicken, beans, and ground beef.",
      "description":"Add the entirety of the shredded chicken into one of the three bowls, stir until everything is mixed. Fill the other two bowls the same way with the ground beef and black beans."
    },
    {
      "headline":"Cut a flour tortilla in half with a knife.",
      "description":""
    },
    {
      "headline":"Add a filling to the tortilla.",
      "description":"Chose a filling and put a spoonful in the center of one of the tortilla halves. Sprinkle with your desired cheese blend. Make sure the filling stays in the middle of the triangle and doesn't bleed to the edge of the tortilla."
    },
    {
      "headline":"Fold each corner over the middle, forming a triangle.",
      "description":""
    },
    {
      "headline":"Brush the open edges of the tortilla with egg wash. Whisk your egg so the white and yolk are combined.",
      "description":"This creates your egg wash."
    },
    {
      "headline":"Seal the tortilla.",
      "description":"Press all open edges of the tortilla firmly with a fork to seal the contents inside. Tip: During this step it is crucial to apply enough force to seal the triangle in order to avoid the contents from coming out while being fried. Many times, indents from the fork onto the tortilla are visibly seen after sealing."
    },
    {
      "headline":"Continue with the remaining tortillas and fillings.",
      "description":"Repeat the process to create as many triangles as the filling will allow. It should be around 20 triangles."
    },
    {
      "headline":"Heat two inches of oil to 350°F (180°C) in a deep frying pan.",
      "description":""
    },
    {
      "headline":"Fry the taco triangles.",
      "description":"Once the oil is hot, place the tortilla triangles in the pan and cook on each side for 3 minutes, or until golden brown. Tip: Do not add all the taco triangles into the pan at once, they should not be stacked on each other."
    },
    {
      "headline":"Drain the triangles on a rack.",
      "description":""
    },
    {
      "headline":"Add sour cream and salsa.",
      "description":"Enjoy!"
    }
  ],
  "text":" Mix vegetables and spices. Add the olive oil, onion, red and green bell pepper, salt, pepper, paprika, chili powder, cumin, garlic powder, and dried oregano into a large pan. Mix to combine. Cook the vegetables. Add the juiced lime to the pan and cook the vegetables for approximately 5 minutes on medium heat, or until soft. Separate the vegetables into three large bowls.  Mix the vegetables with chicken, beans, and ground beef. Add the entirety of the shredded chicken into one of the three bowls, stir until everything is mixed. Fill the other two bowls the same way with the ground beef and black beans. Cut a flour tortilla in half with a knife.  Add a filling to the tortilla. Chose a filling and put a spoonful in the center of one of the tortilla halves. Sprinkle with your desired cheese blend. Make sure the filling stays in the middle of the triangle and doesn't bleed to the edge of the tortilla. Fold each corner over the middle, forming a triangle.  Brush the open edges of the tortilla with egg wash. Whisk your egg so the white and yolk are combined. This creates your egg wash. Seal the tortilla. Press all open edges of the tortilla firmly with a fork to seal the contents inside. Tip: During this step it is crucial to apply enough force to seal the triangle in order to avoid the contents from coming out while being fried. Many times, indents from the fork onto the tortilla are visibly seen after sealing. Continue with the remaining tortillas and fillings. Repeat the process to create as many triangles as the filling will allow. It should be around 20 triangles. Heat two inches of oil to 350°F (180°C) in a deep frying pan.  Fry the taco triangles. Once the oil is hot, place the tortilla triangles in the pan and cook on each side for 3 minutes, or until golden brown. Tip: Do not add all the taco triangles into the pan at once, they should not be stacked on each other. Drain the triangles on a rack.  Add sour cream and salsa. Enjoy!",
  "tyn_model":[
    "vegetables",
    "chicken",
    "ground beef",
    "tortilla",
    "fork",
    "oil",
    "spices",
    "olive oil",
    "onion",
    "salt",
    "pepper",
    "paprika",
    "chili powder",
    "cumin",
    "garlic powder",
    "dried oregano",
    "large pan",
    "juiced lime",
    "beans",
    "black beans",
    "flour tortilla",
    "knife",
    "cheese blend",
    "egg wash",
    "tortillas",
    "deep frying pan",
    "sour cream",
    "salsa"
  ],
  "tyn_section":[

  ]
}