{
  "title":"How to Make a Chicken and Pepperoni Pizza",
  "url":"https://www.wikihow.com/Make-a-Chicken-and-Pepperoni-Pizza",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals",
    "Pizza"
  ],
  "steps":[
    {
      "headline":"Preheat the oven at 225ºC/425ºF.",
      "description":""
    },
    {
      "headline":"Roll the pizza base out to its desired shape.",
      "description":"The edges of the pizza must be longer than the pizza pan, as it will be folded back over the pepperoni border shortly. Place over the pizza pan, adjusting so that the additional edge is even all the way around the pan."
    },
    {
      "headline":"Spread the tomato sauce on top of the base.",
      "description":""
    },
    {
      "headline":"Place the pieces of pepperoni on top of the pizza base.",
      "description":"Add lots more for a meatier taste, or a less for the occasional surprise."
    },
    {
      "headline":"Sprinkle the cheese over the top of the pepperoni.",
      "description":"The amount depends on what you are going for."
    },
    {
      "headline":"Place the precooked chicken on the pizza.",
      "description":"Arrange it to cover the pizza but not to the edges––leave the edge free for the border."
    },
    {
      "headline":"Sprinkle seasonings on top.",
      "description":"This can include herbs, salt and pepper and spices. Choose the type and amount of your preference."
    },
    {
      "headline":"Make the border.",
      "description":"Place a ring of pepperoni around the edge of the pizza. The fold over the extra portion of dough to form an encased crust that now fits within the pizza pan."
    },
    {
      "headline":"Put the pizza into the preheated oven.",
      "description":"Bake for 15 to 20 minutes."
    },
    {
      "headline":"Take the pizza out using oven gloves.",
      "description":"Let it cool down for a moment."
    },
    {
      "headline":"Serve by cutting into quarters.",
      "description":"Enjoy your pizza!"
    }
  ],
  "text":" Preheat the oven at 225ºC/425ºF.  Roll the pizza base out to its desired shape. The edges of the pizza must be longer than the pizza pan, as it will be folded back over the pepperoni border shortly. Place over the pizza pan, adjusting so that the additional edge is even all the way around the pan. Spread the tomato sauce on top of the base.  Place the pieces of pepperoni on top of the pizza base. Add lots more for a meatier taste, or a less for the occasional surprise. Sprinkle the cheese over the top of the pepperoni. The amount depends on what you are going for. Place the precooked chicken on the pizza. Arrange it to cover the pizza but not to the edges––leave the edge free for the border. Sprinkle seasonings on top. This can include herbs, salt and pepper and spices. Choose the type and amount of your preference. Make the border. Place a ring of pepperoni around the edge of the pizza. The fold over the extra portion of dough to form an encased crust that now fits within the pizza pan. Put the pizza into the preheated oven. Bake for 15 to 20 minutes. Take the pizza out using oven gloves. Let it cool down for a moment. Serve by cutting into quarters. Enjoy your pizza!",
  "tyn_model":[
    "pizza pan",
    "pepperoni",
    "oven",
    "tomato sauce",
    "cheese",
    "chicken",
    "seasonings",
    "herbs",
    "salt and pepper",
    "spices",
    "oven gloves"
  ],
  "tyn_section":[

  ]
}