{
  "title":"How to Peel and Devein Shrimp",
  "url":"https://www.wikihow.com/Peel-and-Devein-Shrimp",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Peeling Food"
  ],
  "methods":[
    {
      "name":"Peeling Shrimp",
      "steps":[
        {
          "headline":"Decide whether to peel the shrimp before or after cooking.",
          "description":"Many cooks maintain that keeping the shell on the shrimp during cooking enhances the flavor, since the shell keeps juices in and is itself packed with flavor. However, some people like to peel the shrimp before cooking, so it's easier to eat the finished dish. If you want to keep the shell on the body while you're cooking it, but you'd rather not cook it with the legs and vein, use a pair of kitchen scissors to snip the shell along its back. This way you can still devein the shrimp, and peel off the shell when it's done cooking."
        },
        {
          "headline":"Pull off the head.",
          "description":"Sometimes shrimp comes with the head still attached. That's the first thing you should pull off. You can also chop if off if you'd rather."
        },
        {
          "headline":"Pull off the legs.",
          "description":"Grasp them between your fingers and pull them off in clumps. They should easily detach from the body."
        },
        {
          "headline":"Pull off the shell.",
          "description":"Start at the head end slip your fingers under the shell. Gently pull it away from the body in one piece."
        },
        {
          "headline":"Leave the tail on or off - it's your choice.",
          "description":"Some cooks like the way the tails look in the finished dish, while others prefer to remove it."
        },
        {
          "headline":"Save the shells.",
          "description":"Put them in a bag and freeze them for when you want to make shrimp stock. It's a delicious base for shrimp bisque and other seafood soups."
        }
      ]
    },
    {
      "name":"Deveining Shrimp",
      "steps":[
        {
          "headline":"Use a paring knife to make a slit along the shrimp's back.",
          "description":"Cut in about ⁄4 inch (0.6 cm). The flesh will peel open and reveal a black or white \"vein\" just beneath the surface. This is actually the digestive tract of the shrimp - stomach and colon in all."
        },
        {
          "headline":"Use the end of the knife to lift the vein slightly.",
          "description":"Start lifting it with your fingers."
        },
        {
          "headline":"Pull the vein out gently with your fingers.",
          "description":"Try to pull it out in one piece, so you don't end up with a lot of vein pieces. Use the knife to pry away any flesh that might be getting in the way. Discard the vein once you've pulled it out."
        },
        {
          "headline":"Check the shrimp's belly.",
          "description":"Some shrimp have a second vein on the belly side. If yours does, use the knife to make a second slit along the belly. Lift out the vein using the knife and your fingers."
        },
        {
          "headline":"Rinse your fingers and the shrimp.",
          "description":"The vein can be sticky, so make sure no bits get left behind."
        },
        {
          "headline":"Keep the shrimp cold until you're ready to cook them.",
          "description":"Shrimp deteriorate quickly in warm air, and they need to be kept cold. Put yours in the refrigerator or a bowl of ice water."
        }
      ]
    },
    {
      "name":"Using the Fork Technique",
      "steps":[
        {
          "headline":"Look for the beginning of the vein.",
          "description":"Take a headless shrimp and look at the end where the head use to be attached for a little dark dot or vein just below the shell on the top side of the shrimp."
        },
        {
          "headline":"Take a two tined cooking fork and put one of the tines directly on the dark spot or vein.",
          "description":""
        },
        {
          "headline":"Firmly hold the shrimp and start pushing the tine into the vein cavity.",
          "description":"The shrimp will start straightening out as the tine goes down its spine. The pressure will split the spine and roll the shell back at the same time, peeling the shrimp and deveining it all at once. This method can be done with a shrimp deveining tool you can buy at seafood markets, but a two tined cooking fork will do the same job. Running cold water over the shrimp as you're forking it helps the vein come out and moves the process along more quickly."
        }
      ]
    }
  ],
  "text":" Peeling Shrimp Decide whether to peel the shrimp before or after cooking. Many cooks maintain that keeping the shell on the shrimp during cooking enhances the flavor, since the shell keeps juices in and is itself packed with flavor. However, some people like to peel the shrimp before cooking, so it's easier to eat the finished dish. If you want to keep the shell on the body while you're cooking it, but you'd rather not cook it with the legs and vein, use a pair of kitchen scissors to snip the shell along its back. This way you can still devein the shrimp, and peel off the shell when it's done cooking. Pull off the head. Sometimes shrimp comes with the head still attached. That's the first thing you should pull off. You can also chop if off if you'd rather. Pull off the legs. Grasp them between your fingers and pull them off in clumps. They should easily detach from the body. Pull off the shell. Start at the head end slip your fingers under the shell. Gently pull it away from the body in one piece. Leave the tail on or off - it's your choice. Some cooks like the way the tails look in the finished dish, while others prefer to remove it. Save the shells. Put them in a bag and freeze them for when you want to make shrimp stock. It's a delicious base for shrimp bisque and other seafood soups. Deveining Shrimp Use a paring knife to make a slit along the shrimp's back. Cut in about ⁄4 inch (0.6 cm). The flesh will peel open and reveal a black or white \"vein\" just beneath the surface. This is actually the digestive tract of the shrimp - stomach and colon in all. Use the end of the knife to lift the vein slightly. Start lifting it with your fingers. Pull the vein out gently with your fingers. Try to pull it out in one piece, so you don't end up with a lot of vein pieces. Use the knife to pry away any flesh that might be getting in the way. Discard the vein once you've pulled it out. Check the shrimp's belly. Some shrimp have a second vein on the belly side. If yours does, use the knife to make a second slit along the belly. Lift out the vein using the knife and your fingers. Rinse your fingers and the shrimp. The vein can be sticky, so make sure no bits get left behind. Keep the shrimp cold until you're ready to cook them. Shrimp deteriorate quickly in warm air, and they need to be kept cold. Put yours in the refrigerator or a bowl of ice water. Using the Fork Technique Look for the beginning of the vein. Take a headless shrimp and look at the end where the head use to be attached for a little dark dot or vein just below the shell on the top side of the shrimp. Take a two tined cooking fork and put one of the tines directly on the dark spot or vein.  Firmly hold the shrimp and start pushing the tine into the vein cavity. The shrimp will start straightening out as the tine goes down its spine. The pressure will split the spine and roll the shell back at the same time, peeling the shrimp and deveining it all at once. This method can be done with a shrimp deveining tool you can buy at seafood markets, but a two tined cooking fork will do the same job. Running cold water over the shrimp as you're forking it helps the vein come out and moves the process along more quickly.",
  "tyn_model":[
    "shrimp",
    "knife",
    "cooking fork",
    "kitchen scissors",
    "shrimp stock",
    "shrimp bisque",
    "paring knife",
    "refrigerator",
    "ice water",
    "fork",
    "shrimp deveining tool",
    "water"
  ],
  "tyn_section":[

  ]
}