{
  "title":"How to Decorate a Living Room on a Budget",
  "url":"https://www.wikihow.com/Decorate-a-Living-Room-on-a-Budget",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Living Rooms"
  ],
  "methods":[
    {
      "name":"Adding Inexpensive Accessories",
      "steps":[
        {
          "headline":"Add a variety of plants to bring your living room to life.",
          "description":"Potted plants will always be an excellent and inexpensive choice for decorative purposes. Plants that can be grown indoors come in a huge variety of types, shapes, sizes, and even colours. You can find plants in all sorts of stores in your local area. Some plants already come in decorative pots, but if you have to get a decorative pot, you can buy inexpensive ones at the store or even use terra cotta pots from a garden centre (which can be painted). Do a little bit of research before purchasing your plants. Make sure you get plants that can thrive in your living room based on the amount of light it receives. Don’t forget to water your plants based on the instructions they come with. If you think you’ll forget, you can buy pots or bulbs that allow the plant to self-water itself over several weeks."
        },
        {
          "headline":"Use embellishments on items you already have to add sparkle.",
          "description":"Many items you already have in your living room can be changed or altered in such a way as to give it a whole new look at a very low cost. For example, buying or making new pillow covers; replacing door and drawer knobs, light and outlet covers, or vent covers; glueing or sewing jewels, buttons, or sequins to pillows or lamps; or installing doors on bookshelves. You could even sew fancy trim onto your throw pillows or lampshades to add flare. Don’t be afraid to use stencils on the wall, floor, ceiling, or furniture to add shapes and colours with paint."
        },
        {
          "headline":"Install new light fixtures or lamps to brighten up your living room.",
          "description":"New lighting of any kind can add new dimensions of light to your living room that can really change its look. You can purchase new light fixtures or lamps to add to your room or even fixtures and lamps that are ‘new to you.’ You can also update existing lamps and light fixtures by adding or removing elements. For example, keep the same lamp, but change or paint the lampshade, or remove your overhead light fixtures and replace it with multiple floor lamps. Even changing the type or wattage of the light bulbs you use can make a huge difference. If you want to add atmosphere, but don’t need to use the light to read, use bulbs with lower wattage to provide a more subtle light."
        },
        {
          "headline":"Use curtains or blinds to change the look of your entire living room.",
          "description":"Hang new (or new to you) curtains or blinds in your living room to alter the whole look and feel. Use curtain rods that are wider than your window or install curtain rods much higher than a window to make the window seem bigger. Widen the trim around your window to also make the window look larger. Avoid painting your walls and window trim the same colour, or the window won’t stand out. Don’t be afraid to layer blinds and curtains on the same window. The curtains may end up decorative, but the blinds may be practical."
        },
        {
          "headline":"Purchase a new area rug to add texture to your living room.",
          "description":"Area rugs are a creative way to add texture, a unique pattern, or colour to your living room. They can also be used as the ‘anchor’ to bring all the pieces of your room together. For example, use the colours found in your area rug to decorate the whole room and the carpet will tie it all together. Try to obtain a rug that is the right size for your living room. Alternatively, you could combine multiple area rugs to create one larger rug or create multiple living areas within your living room."
        }
      ]
    },
    {
      "name":"Personalizing Living Room Walls",
      "steps":[
        {
          "headline":"Create your own artwork for the walls of your living room.",
          "description":"Artwork, especially original artwork, can be expensive. Therefore, instead of buying original artwork, create your own. Buy at least one blank canvas from a craft store. Purchase any kind of paint to use on the canvas, or reuse some paint you already have at home. Paint the canvas using any type of brush or sponge, or drip or splatter paint onto it. Once dry, hang your personal artwork on the wall of your living room. Canvases can be hung with a simple nail or hook on the wall or leaned against the wall from a floating shelf or fireplace mantle. Use one or more colour on the canvas that matches the various items you’ve used in your living room in order to pull those multiple pieces together. For example, if you have a dark blue rug, a light green chair, and yellow throw cushions, use all three colours in your painting. You can paint one large canvas or multiple smaller-sized canvases."
        },
        {
          "headline":"Add a gallery wall to your living room to display photos.",
          "description":"Gallery walls are an easy and fun way to create an accent wall in your living room using items you already have. Designate one wall in your living room as a gallery wall. Hang framed or canvas-wrapped photos of different sizes over the vast majority of that wall. Hang each photo randomly, don’t worry about creating a pattern. You can also use artwork on your gallery wall, either artwork you’ve created yourself or that you’ve purchased. You can hang empty, yet unique, frames to your gallery wall if you’d like. Or hang items other than photos or artwork within these empty frames (e.g., jewellery, stained glass, clocks, books)."
        },
        {
          "headline":"Install an awesome tapestry on your living room wall.",
          "description":"A tapestry–a large piece of fabric with a specific pattern or design–is an easy and inexpensive way to create an accent wall in your living room. Any piece of fabric will do, including a blanket, scarf, or area rug/carpet. Hang the tapestry on one wall and use the elements (colours, patterns) of the tapestry as ideas for the rest of the room. Use decorative nails or pins to hang the tapestry on the wall, or try using velcro if the tapestry isn’t too heavy."
        }
      ]
    },
    {
      "name":"Saving Money by Reusing Furniture",
      "steps":[
        {
          "headline":"Shop for ‘new to you’ furniture at a garage or estate sale.",
          "description":"Furniture (and decor items) of every type, style, colour, pattern, texture, and size can be found at garage and estate sales. While these pieces may be secondhand, many are in excellent condition, are inexpensive, and won’t require any fixing up to be used. While garage sales may be found more often in warmer months, estate sales can happen all year round. Don’t be afraid to negotiate the price with the seller."
        },
        {
          "headline":"Rearrange your existing furniture to give your living room a new look.",
          "description":"One of the easiest and least expensive methods to redecorate your living room is to simply rearrange your existing furniture. You can either move the furniture around until you’ve found a new arrangement you prefer, or you can plan a new layout using paper or software. There are many smartphone apps available that can help you design a room layout, some even use photos of your living room to help you with the redesign. App examples include MagicPlan, Room Scan Pro, Floor Plan Creator, Room Creator, Amikasa, Home Design 3D, and Rooms. These apps can be downloaded from your smartphone’s app store."
        },
        {
          "headline":"Borrow furniture and decor items from around your home.",
          "description":"Rather than spending money to buy new furniture or decor items (e.g., throw pillows, artwork, photos, plants, lighting), take a walk around your home and select items to put in your living room. You may also want to look through your closets and storage spaces. Maybe there are items you’ve had stored away that would make a perfect addition to your living room. Try to avoid only adding things to your living room without taking anything away. If you move an item into your living room, try to remove an item as well. If you remove an item from your living room, use this as an opportunity to determine if you really need to keep that item. This might be a perfect time to donate or sell items you no longer use."
        },
        {
          "headline":"Recover or reupholster existing couches and chairs.",
          "description":"Another great way to save money on your living room redecoration is to cover your existing couches and chairs with slipcovers. Slipcovers come in a wide variety of sizes (for all different types of couches and chairs), colours, and fabrics. Alternatively, you can purchase new upholstery fabric and refinish the chairs or couches yourself or pay a professional upholsterer to refinish your chairs or couches. When purchasing slipcovers, make sure the measurement of the slipcover matches the measurement of your actual chair or couch. Or, make sure the slipcover can be returned or exchanged if it doesn’t properly fit your chair or couch. Upholstery fabric can be expensive, but fabric stores will usually have a wide variety available at different price ranges. You can also wait for sales or purchase fabric from the sale bin."
        }
      ]
    }
  ],
  "text":" Adding Inexpensive Accessories Add a variety of plants to bring your living room to life. Potted plants will always be an excellent and inexpensive choice for decorative purposes. Plants that can be grown indoors come in a huge variety of types, shapes, sizes, and even colours. You can find plants in all sorts of stores in your local area. Some plants already come in decorative pots, but if you have to get a decorative pot, you can buy inexpensive ones at the store or even use terra cotta pots from a garden centre (which can be painted). Do a little bit of research before purchasing your plants. Make sure you get plants that can thrive in your living room based on the amount of light it receives. Don’t forget to water your plants based on the instructions they come with. If you think you’ll forget, you can buy pots or bulbs that allow the plant to self-water itself over several weeks. Use embellishments on items you already have to add sparkle. Many items you already have in your living room can be changed or altered in such a way as to give it a whole new look at a very low cost. For example, buying or making new pillow covers; replacing door and drawer knobs, light and outlet covers, or vent covers; glueing or sewing jewels, buttons, or sequins to pillows or lamps; or installing doors on bookshelves. You could even sew fancy trim onto your throw pillows or lampshades to add flare. Don’t be afraid to use stencils on the wall, floor, ceiling, or furniture to add shapes and colours with paint. Install new light fixtures or lamps to brighten up your living room. New lighting of any kind can add new dimensions of light to your living room that can really change its look. You can purchase new light fixtures or lamps to add to your room or even fixtures and lamps that are ‘new to you.’ You can also update existing lamps and light fixtures by adding or removing elements. For example, keep the same lamp, but change or paint the lampshade, or remove your overhead light fixtures and replace it with multiple floor lamps. Even changing the type or wattage of the light bulbs you use can make a huge difference. If you want to add atmosphere, but don’t need to use the light to read, use bulbs with lower wattage to provide a more subtle light. Use curtains or blinds to change the look of your entire living room. Hang new (or new to you) curtains or blinds in your living room to alter the whole look and feel. Use curtain rods that are wider than your window or install curtain rods much higher than a window to make the window seem bigger. Widen the trim around your window to also make the window look larger. Avoid painting your walls and window trim the same colour, or the window won’t stand out. Don’t be afraid to layer blinds and curtains on the same window. The curtains may end up decorative, but the blinds may be practical. Purchase a new area rug to add texture to your living room. Area rugs are a creative way to add texture, a unique pattern, or colour to your living room. They can also be used as the ‘anchor’ to bring all the pieces of your room together. For example, use the colours found in your area rug to decorate the whole room and the carpet will tie it all together. Try to obtain a rug that is the right size for your living room. Alternatively, you could combine multiple area rugs to create one larger rug or create multiple living areas within your living room. Personalizing Living Room Walls Create your own artwork for the walls of your living room. Artwork, especially original artwork, can be expensive. Therefore, instead of buying original artwork, create your own. Buy at least one blank canvas from a craft store. Purchase any kind of paint to use on the canvas, or reuse some paint you already have at home. Paint the canvas using any type of brush or sponge, or drip or splatter paint onto it. Once dry, hang your personal artwork on the wall of your living room. Canvases can be hung with a simple nail or hook on the wall or leaned against the wall from a floating shelf or fireplace mantle. Use one or more colour on the canvas that matches the various items you’ve used in your living room in order to pull those multiple pieces together. For example, if you have a dark blue rug, a light green chair, and yellow throw cushions, use all three colours in your painting. You can paint one large canvas or multiple smaller-sized canvases. Add a gallery wall to your living room to display photos. Gallery walls are an easy and fun way to create an accent wall in your living room using items you already have. Designate one wall in your living room as a gallery wall. Hang framed or canvas-wrapped photos of different sizes over the vast majority of that wall. Hang each photo randomly, don’t worry about creating a pattern. You can also use artwork on your gallery wall, either artwork you’ve created yourself or that you’ve purchased. You can hang empty, yet unique, frames to your gallery wall if you’d like. Or hang items other than photos or artwork within these empty frames (e.g., jewellery, stained glass, clocks, books). Install an awesome tapestry on your living room wall. A tapestry–a large piece of fabric with a specific pattern or design–is an easy and inexpensive way to create an accent wall in your living room. Any piece of fabric will do, including a blanket, scarf, or area rug/carpet. Hang the tapestry on one wall and use the elements (colours, patterns) of the tapestry as ideas for the rest of the room. Use decorative nails or pins to hang the tapestry on the wall, or try using velcro if the tapestry isn’t too heavy. Saving Money by Reusing Furniture Shop for ‘new to you’ furniture at a garage or estate sale. Furniture (and decor items) of every type, style, colour, pattern, texture, and size can be found at garage and estate sales. While these pieces may be secondhand, many are in excellent condition, are inexpensive, and won’t require any fixing up to be used. While garage sales may be found more often in warmer months, estate sales can happen all year round. Don’t be afraid to negotiate the price with the seller. Rearrange your existing furniture to give your living room a new look. One of the easiest and least expensive methods to redecorate your living room is to simply rearrange your existing furniture. You can either move the furniture around until you’ve found a new arrangement you prefer, or you can plan a new layout using paper or software. There are many smartphone apps available that can help you design a room layout, some even use photos of your living room to help you with the redesign. App examples include MagicPlan, Room Scan Pro, Floor Plan Creator, Room Creator, Amikasa, Home Design 3D, and Rooms. These apps can be downloaded from your smartphone’s app store. Borrow furniture and decor items from around your home. Rather than spending money to buy new furniture or decor items (e.g., throw pillows, artwork, photos, plants, lighting), take a walk around your home and select items to put in your living room. You may also want to look through your closets and storage spaces. Maybe there are items you’ve had stored away that would make a perfect addition to your living room. Try to avoid only adding things to your living room without taking anything away. If you move an item into your living room, try to remove an item as well. If you remove an item from your living room, use this as an opportunity to determine if you really need to keep that item. This might be a perfect time to donate or sell items you no longer use. Recover or reupholster existing couches and chairs. Another great way to save money on your living room redecoration is to cover your existing couches and chairs with slipcovers. Slipcovers come in a wide variety of sizes (for all different types of couches and chairs), colours, and fabrics. Alternatively, you can purchase new upholstery fabric and refinish the chairs or couches yourself or pay a professional upholsterer to refinish your chairs or couches. When purchasing slipcovers, make sure the measurement of the slipcover matches the measurement of your actual chair or couch. Or, make sure the slipcover can be returned or exchanged if it doesn’t properly fit your chair or couch. Upholstery fabric can be expensive, but fabric stores will usually have a wide variety available at different price ranges. You can also wait for sales or purchase fabric from the sale bin.",
  "tyn_model":[
    "plants",
    "tapestry",
    "lamps",
    "paint",
    "curtains",
    "fabric",
    "slipcovers",
    "pots",
    "water",
    "‘new",
    "curtain rods",
    "area rug",
    "artwork",
    "furniture",
    "upholstery fabric",
    "slipcover",
    "potted plants",
    "pot",
    "terra cotta pots",
    "garden centre",
    "jewels",
    "throw pillows",
    "light fixtures",
    "’ you",
    "area rugs",
    "‘anchor",
    "’ to",
    "carpet",
    "rug",
    "rugs",
    "sponge",
    "canvas",
    "stained glass",
    "books",
    "–a",
    "–is",
    "nails",
    "pins",
    "velcro",
    "’ furniture",
    "floor plan creator",
    "home design",
    "fabrics",
    "upholsterer"
  ],
  "tyn_section":[

  ]
}