{
  "title":"How to Cover Buttons in Fabric",
  "url":"https://www.wikihow.com/Cover-Buttons-in-Fabric",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Sewing"
  ],
  "methods":[
    {
      "name":"Measuring and Cutting the Fabric",
      "steps":[
        {
          "headline":"Use a template to measure your fabric circle if you’re using a button kit.",
          "description":"If you’re covering your button using a button kit that you bought from the store, it will likely come with a template made of cardboard that you can cut out using scissors. Once it’s cut, place the circle template on the piece of fabric you’re using and trace it using a pen or pencil.The template will be part of the packaging from your button kit, so don’t throw away the packaging once you take out the button kit pieces."
        },
        {
          "headline":"Put the button on your fabric and draw around it to measure without a template.",
          "description":"Use a pen or pencil to trace a circle around the button that's roughly 1 centimetre (0.39 in) past the edge of the button. This extra space ensures the sides of the button will be covered too. This circle will be where you cut.Don't just trace the edges of the button, as this won't leave you enough space to wrap the fabric around the edges of the button. If you're not sure how much space to leave between the button and your drawn circle, measure the diameter of the button. This is the correct amount of space to leave between the button's edge and your pen or pencil markings."
        },
        {
          "headline":"Use scissors to cut along the circle you drew for the button.",
          "description":"Once you’ve created your drawn circle, use scissors to cut along the marks you drew. Use sharp scissors, such as fabric scissors, to ensure your fabric doesn’t fray.If your fabric is super thin, consider cutting out 2 layers of the fabric so you can add them on top of each other."
        }
      ]
    },
    {
      "name":"Covering a Button Shell",
      "steps":[
        {
          "headline":"Place the silicone button mold from the kit onto a flat surface.",
          "description":"If your button kit comes with a silicone mold to help you cover the button, place this on a flat surface with the hollow end facing upwards. The hollow section is where you’ll place your fabric and two button pieces.If you’re not sure whether your kit has a silicone mold or not, read the packaging to find a list of supplies or the specific instructions."
        },
        {
          "headline":"Lay the fabric circle over the mold with the patterned side down.",
          "description":"Situate the circle of fabric that you cut out so that it’s centered over the silicone mold with the patterned side facing the mold. Placing it in the center of the mold is important so that all of the edges of your button will be properly covered.The fabric circle will be larger than the mold, so pay attention to where you place the fabric on the mold to ensure it’s centered."
        },
        {
          "headline":"Push the button shell into the fabric-covered mold to cover the button.",
          "description":"While holding the fabric in place over the silicone mold, push the button shell into the mold with the flat side down. Push the button into the mold until you can’t push any further and it’s flat against the mold. As you push the button deeper into the mold, the fabric will fold over the edges of the button to cover it. The button comes in two pieces, the button shell and the back of the button. The button shell has a perfectly flat side which is covered in the fabric."
        },
        {
          "headline":"Cover the folded fabric with the back piece of the button.",
          "description":"Once your button is pushed into the mold, the spare edges of the fabric will be pushed together to cover the back of the button shell as well. Set the back side of the button, the second button piece, over the folded fabric in the mold with the fixture side facing upwards.The back side of the button is the one that has a ridge and possibly a fixture that lets you attach your button to clothing or other items."
        },
        {
          "headline":"Press down on the back side of the button until you hear a snap.",
          "description":"Use your fingers to push the back side of the button into the folded fabric, securing it in place. Your button kit may come with a tool to help you push down on the back of the button too. Once you hear a snap, your button pieces are together."
        },
        {
          "headline":"Remove the finished button from the silicone mold gently.",
          "description":"Pry the edges of the silicone mold off of the button to release the button safely. Give your button another squeeze to ensure it’s secured tightly, and your button is ready to be used!Yanking your button out of the silicone mold could cause the back side of the button to come off."
        }
      ]
    },
    {
      "name":"Folding Fabric over Button Teeth",
      "steps":[
        {
          "headline":"Place the button with the teeth side up on your fabric circle.",
          "description":"Set the fabric on a flat surface with the patterned side facing down. If you’re using a button that has teeth that hold the fabric in place, place the button in the center of your fabric circle with the teeth facing upwards towards you.The teeth are there to hold the fabric in place when you fold it over the button’s edges."
        },
        {
          "headline":"Fold the fabric over all of the teeth to hold the fabric in place.",
          "description":"Pull up on the edges of the fabric and hook them onto the teeth of the button. Fold over opposite edges of the button to tighten the fabric, and go all the way around the button, hooking the fabric on the teeth securely.Go slowly to ensure the fabric doesn’t come undone and is firmly attached to the button’s teeth."
        },
        {
          "headline":"Push the back of the button over the folded fabric to secure it.",
          "description":"Take the back piece of the button that comes in the kit and press it down on top of the folded fabric with the ridge facing down. Keep pushing down until you hear a snap that signals the button has clicked into place.If the fabric you’re using is especially thick, you may need to apply extra force to get the back of the button to stay in place. Once the back of the button is attached, your button is ready to be used!"
        }
      ]
    },
    {
      "name":"Sewing Fabric onto a Button",
      "steps":[
        {
          "headline":"Place your fabric circle patterned-side down.",
          "description":"It’s best to place the fabric down on a surface that you’re able to sew on top of easily. Set down the circle with the patterned side facing the surface so you’re looking at the back side of the fabric."
        },
        {
          "headline":"Use a needle and thread to create stitches along the edge of the fabric.",
          "description":"Thread a needle with a thin piece of thread of your choosing. Begin creating stitches along the outer edge of the fabric, just inside the circle. Go all the way around the fabric circle, pushing your needle down through the fabric and back up to create a thin line.These stitches, also called edge stitches, form a straight line along the edge of the fabric. Keep the tail of the thread long once you’re finished so you’ll be able to tie a knot. The purpose of these stitches is to create a gathered balloon-like covering for your button once the thread is pulled tightly."
        },
        {
          "headline":"Set your button in the center of the fabric circle.",
          "description":"Set the button down on the fabric so that the side that attaches to clothing or objects is facing you. It’s okay if the button isn’t perfectly centered on the fabric, but make sure all of the stitched edges are visible."
        },
        {
          "headline":"Pull the thread so it tightens around the button.",
          "description":"With the button centered on the piece of fabric, pull the loose threads so that the fabric bunches up around the button. Keep pulling on the threads carefully until the fabric is flat against the button.As you pull on the threads, the fabric will create a mushroom shape over the button."
        },
        {
          "headline":"Tie a knot to secure the fabric around the button tightly.",
          "description":"Once the threads are pulled tightly, create a knot to hold them together. Double knot the thread to secure it, and admire your newly covered button!Trim the ends of the thread after you create knots using scissors. Use the long threads to attach the button to something like a cardigan or purse instead of trimming them, if desired."
        }
      ]
    }
  ],
  "text":" Measuring and Cutting the Fabric Use a template to measure your fabric circle if you’re using a button kit. If you’re covering your button using a button kit that you bought from the store, it will likely come with a template made of cardboard that you can cut out using scissors. Once it’s cut, place the circle template on the piece of fabric you’re using and trace it using a pen or pencil.The template will be part of the packaging from your button kit, so don’t throw away the packaging once you take out the button kit pieces. Put the button on your fabric and draw around it to measure without a template. Use a pen or pencil to trace a circle around the button that's roughly 1 centimetre (0.39 in) past the edge of the button. This extra space ensures the sides of the button will be covered too. This circle will be where you cut.Don't just trace the edges of the button, as this won't leave you enough space to wrap the fabric around the edges of the button. If you're not sure how much space to leave between the button and your drawn circle, measure the diameter of the button. This is the correct amount of space to leave between the button's edge and your pen or pencil markings. Use scissors to cut along the circle you drew for the button. Once you’ve created your drawn circle, use scissors to cut along the marks you drew. Use sharp scissors, such as fabric scissors, to ensure your fabric doesn’t fray.If your fabric is super thin, consider cutting out 2 layers of the fabric so you can add them on top of each other. Covering a Button Shell Place the silicone button mold from the kit onto a flat surface. If your button kit comes with a silicone mold to help you cover the button, place this on a flat surface with the hollow end facing upwards. The hollow section is where you’ll place your fabric and two button pieces.If you’re not sure whether your kit has a silicone mold or not, read the packaging to find a list of supplies or the specific instructions. Lay the fabric circle over the mold with the patterned side down. Situate the circle of fabric that you cut out so that it’s centered over the silicone mold with the patterned side facing the mold. Placing it in the center of the mold is important so that all of the edges of your button will be properly covered.The fabric circle will be larger than the mold, so pay attention to where you place the fabric on the mold to ensure it’s centered. Push the button shell into the fabric-covered mold to cover the button. While holding the fabric in place over the silicone mold, push the button shell into the mold with the flat side down. Push the button into the mold until you can’t push any further and it’s flat against the mold. As you push the button deeper into the mold, the fabric will fold over the edges of the button to cover it. The button comes in two pieces, the button shell and the back of the button. The button shell has a perfectly flat side which is covered in the fabric. Cover the folded fabric with the back piece of the button. Once your button is pushed into the mold, the spare edges of the fabric will be pushed together to cover the back of the button shell as well. Set the back side of the button, the second button piece, over the folded fabric in the mold with the fixture side facing upwards.The back side of the button is the one that has a ridge and possibly a fixture that lets you attach your button to clothing or other items. Press down on the back side of the button until you hear a snap. Use your fingers to push the back side of the button into the folded fabric, securing it in place. Your button kit may come with a tool to help you push down on the back of the button too. Once you hear a snap, your button pieces are together. Remove the finished button from the silicone mold gently. Pry the edges of the silicone mold off of the button to release the button safely. Give your button another squeeze to ensure it’s secured tightly, and your button is ready to be used!Yanking your button out of the silicone mold could cause the back side of the button to come off. Folding Fabric over Button Teeth Place the button with the teeth side up on your fabric circle. Set the fabric on a flat surface with the patterned side facing down. If you’re using a button that has teeth that hold the fabric in place, place the button in the center of your fabric circle with the teeth facing upwards towards you.The teeth are there to hold the fabric in place when you fold it over the button’s edges. Fold the fabric over all of the teeth to hold the fabric in place. Pull up on the edges of the fabric and hook them onto the teeth of the button. Fold over opposite edges of the button to tighten the fabric, and go all the way around the button, hooking the fabric on the teeth securely.Go slowly to ensure the fabric doesn’t come undone and is firmly attached to the button’s teeth. Push the back of the button over the folded fabric to secure it. Take the back piece of the button that comes in the kit and press it down on top of the folded fabric with the ridge facing down. Keep pushing down until you hear a snap that signals the button has clicked into place.If the fabric you’re using is especially thick, you may need to apply extra force to get the back of the button to stay in place. Once the back of the button is attached, your button is ready to be used! Sewing Fabric onto a Button Place your fabric circle patterned-side down. It’s best to place the fabric down on a surface that you’re able to sew on top of easily. Set down the circle with the patterned side facing the surface so you’re looking at the back side of the fabric. Use a needle and thread to create stitches along the edge of the fabric. Thread a needle with a thin piece of thread of your choosing. Begin creating stitches along the outer edge of the fabric, just inside the circle. Go all the way around the fabric circle, pushing your needle down through the fabric and back up to create a thin line.These stitches, also called edge stitches, form a straight line along the edge of the fabric. Keep the tail of the thread long once you’re finished so you’ll be able to tie a knot. The purpose of these stitches is to create a gathered balloon-like covering for your button once the thread is pulled tightly. Set your button in the center of the fabric circle. Set the button down on the fabric so that the side that attaches to clothing or objects is facing you. It’s okay if the button isn’t perfectly centered on the fabric, but make sure all of the stitched edges are visible. Pull the thread so it tightens around the button. With the button centered on the piece of fabric, pull the loose threads so that the fabric bunches up around the button. Keep pulling on the threads carefully until the fabric is flat against the button.As you pull on the threads, the fabric will create a mushroom shape over the button. Tie a knot to secure the fabric around the button tightly. Once the threads are pulled tightly, create a knot to hold them together. Double knot the thread to secure it, and admire your newly covered button!Trim the ends of the thread after you create knots using scissors. Use the long threads to attach the button to something like a cardigan or purse instead of trimming them, if desired.",
  "tyn_model":[
    "fabric",
    "thread",
    "silicone mold",
    "button kit",
    "scissors",
    "needle",
    "template",
    "cardboard",
    "pencil",
    "pen or pencil",
    "fabric scissors",
    "silicone button mold",
    "silicone"
  ],
  "tyn_section":[

  ]
}