{
  "title":"How to Make a Polymer Clay Tiny Book",
  "url":"https://www.wikihow.com/Make-a-Polymer-Clay-Tiny-Book",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Clay Projects",
    "Polymer Clay Projects"
  ],
  "steps":[
    {
      "headline":"Condition all of the clay thoroughly.",
      "description":"Work the clay with your hands until it is soft and pliable."
    },
    {
      "headline":"Run black clay through the pasta machine at the thickest setting.",
      "description":"Lay the silver leaf on top and burnish with fingers."
    },
    {
      "headline":"Roll the transparent clay through the pasta machine at the thickest setting.",
      "description":"Continue to roll through and lower the setting one notch each time until you get it very thin."
    },
    {
      "headline":"Place the transparent clay on top of the silver leaf and burnish with your fingers.",
      "description":""
    },
    {
      "headline":"Measure and cut the stack to approximately 2\" x 2 1/2\".",
      "description":""
    },
    {
      "headline":"Cut the loop off your charm with some heavy wire cutters.",
      "description":""
    },
    {
      "headline":"Coat the back of your charm with some white glue such as Sobo or tacky glue.",
      "description":"Place the charm on the cover and push gently into the clay."
    },
    {
      "headline":"Decorate the edge of the cover with slices from a small pre-made cane.",
      "description":"Make the back cover to match and be sure to sign it. Bake according to clay directions."
    },
    {
      "headline":"Make a grid on a piece of paper with your computer.",
      "description":"If you are more comfortable, you can use a pencil and a ruler to make a grid. These squares measure slightly smaller than the book cover which is 2\"x 2 1/2\". Leave some of the squares blank, as shown. These blank pages will be glued inside the fold of two others and will not show."
    },
    {
      "headline":"Cut the paper so that you have four strips of four boxes.",
      "description":""
    },
    {
      "headline":"Fold the strips accordion style so that they fit together as shown.",
      "description":""
    },
    {
      "headline":"Glue stick the blank pages inside the folds so that only the squares with words are showing.",
      "description":""
    },
    {
      "headline":"Cut three strips of ribbon and use your permanent glue stick to glue them as shown to the front of the book pages.",
      "description":"Wrap them around the book and glue them to the back."
    },
    {
      "headline":"Get the covers ready.",
      "description":"Coat them with the Sobo and lay the paper pages and ribbon to the clay cover. Do this on both sides."
    },
    {
      "headline":"Let dry and you're done!",
      "description":""
    }
  ],
  "text":" Condition all of the clay thoroughly. Work the clay with your hands until it is soft and pliable. Run black clay through the pasta machine at the thickest setting. Lay the silver leaf on top and burnish with fingers. Roll the transparent clay through the pasta machine at the thickest setting. Continue to roll through and lower the setting one notch each time until you get it very thin. Place the transparent clay on top of the silver leaf and burnish with your fingers.  Measure and cut the stack to approximately 2\" x 2 1/2\".  Cut the loop off your charm with some heavy wire cutters.  Coat the back of your charm with some white glue such as Sobo or tacky glue. Place the charm on the cover and push gently into the clay. Decorate the edge of the cover with slices from a small pre-made cane. Make the back cover to match and be sure to sign it. Bake according to clay directions. Make a grid on a piece of paper with your computer. If you are more comfortable, you can use a pencil and a ruler to make a grid. These squares measure slightly smaller than the book cover which is 2\"x 2 1/2\". Leave some of the squares blank, as shown. These blank pages will be glued inside the fold of two others and will not show. Cut the paper so that you have four strips of four boxes.  Fold the strips accordion style so that they fit together as shown.  Glue stick the blank pages inside the folds so that only the squares with words are showing.  Cut three strips of ribbon and use your permanent glue stick to glue them as shown to the front of the book pages. Wrap them around the book and glue them to the back. Get the covers ready. Coat them with the Sobo and lay the paper pages and ribbon to the clay cover. Do this on both sides. Let dry and you're done! ",
  "tyn_model":[
    "clay",
    "paper",
    "pasta machine",
    "transparent clay",
    "ribbon",
    "black clay",
    "heavy wire cutters",
    "white glue",
    "sobo or tacky glue",
    "cane",
    "pencil",
    "ruler",
    "glue",
    "permanent glue",
    "sobo"
  ],
  "tyn_section":[

  ]
}