{
  "title":"How to Throw a Bridal Shower at a Spa",
  "url":"https://www.wikihow.com/Throw-a-Bridal-Shower-at-a-Spa",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties"
  ],
  "parts":[
    {
      "name":"Booking a Spa and Sending Invitations",
      "steps":[
        {
          "headline":"Set the date and time of the shower 2 months before the wedding.",
          "description":"Choose a weekend day or an evening so that most people can make it. If there are people important to the bride who live out of town, check in with them to make sure they can make it. Plan on having the shower about 1 or 2 months before the wedding. Any closer and it could be an added stress for the bride. Some spas stay open late for large parties. Start planning the shower about 2 months before it happens."
        },
        {
          "headline":"Plan out your guest list of 8 to 12 people.",
          "description":"Most bridal showers include the bridal party as well as any female relatives of the bride and groom. Check with the bride to see who she would like to invite. Make sure that anyone you invite to the shower is also invited to the wedding. Try not to exceed 15 people, or it could be tough to throw your shower at a spa. Check with the bride to see if she’d like to keep it intimate with fewer people."
        },
        {
          "headline":"Set a budget for the shower.",
          "description":"Bridal showers can get expensive, and you don’t want to use a ton of your own money for it. Create a budget that includes the venue, food, and party favors that you’ll use throughout the party. Ask the party guests to pitch in anywhere from $20 to $50 depending on how many people are on your guest list. Put this on the invitation or send them a message on social media.Tip: Don’t ask for a huge amount of money, or it could prohibit some people from going."
        },
        {
          "headline":"Shop around at different spas to gather information about deals and pricing.",
          "description":"Some spas offer discounts on bridal parties, while others might not be big enough to accommodate your guest list. Call or walk into the spa you have in mind and ask if they can treat a large group of people with multiple services. Ask about dates and times available to see if they have anything open for your date. Some spas have packages that you can purchase. Pick out services like mani/pedis, facials, massages, or even yoga if you think your guests will like it."
        },
        {
          "headline":"Make a reservation at a spa 2 months in advance.",
          "description":"Spas can’t accommodate large parties all the time, so be sure to make your reservation a few months ahead of time. Some spas may ask for a deposit or the money in full at the time of your booking, so be prepared to pay for your shower early. Depending on the size of the spa, you may have to book the entire venue for your party so that you don’t disturb the other patrons of the spa. Make a reservation as soon as possible so the date that you want doesn’t fill up."
        },
        {
          "headline":"Send invitations to your guests 2 months in advance.",
          "description":"Contact everyone on your guest list with the date and time of the shower. You can send them paper invitations, send a mass email, or use social media to give out your invitations. Ask your guests to let you know if they will be able to make it so that you can plan accordingly. Incorporate the spa theme into your invitations by using pictures of bathtubs, suds, and bubbles. You can create an event page on Facebook for an easy way to see how many people will be attending. Your guests can choose “Going,” “Maybe,” or “Can’t Go” to RSVP. Be sure to include information about the bride’s gift registry if she has one."
        }
      ]
    },
    {
      "name":"Organizing Food, Games, and Favors",
      "steps":[
        {
          "headline":"Plan the menu yourself or book a catering company.",
          "description":"Spa days can be exhausting, so your guests might want some pick-me-ups in between treatments. Consider buying healthy, bite-sized food like finger sandwiches or stuffed mushrooms. Order pastries from a bakery and stock up on wine or cocktail ingredients to serve your guests. If you’re not sure what kind of food everyone likes, check with the bride to find out her favorites.Tip: Some guests may also offer to bring desserts or drinks. Take them up on it to remove some of the burden from your shoulders. If you are using a catering service, contact them a few months in advance. Have them deliver the food on the day of the shower."
        },
        {
          "headline":"Come up with some bridal shower activities.",
          "description":"Most of the bridal shower will be spent relaxing at the spa, but some of it should focus on the bride. Come up with 1 or 2 games for your guests to play that center around the bride and her upcoming wedding. Make sure your guests are on a loose schedule that has them playing the games about 1 hour into the party. Don’t choose any activities that need a lot of space or movement. Stick with the relaxing vibe of the spa. Popular bridal shower games include a gift Bingo game, where guests write down what gifts they think the bride will receive on a Bingo sheet, and a romantic movie quiz, where guests try to guess as many movie titles based on quotes as they can."
        },
        {
          "headline":"Create spa-themed party favors for your guests to take home.",
          "description":"Part of the charm of a bridal shower is that each guest gets to take home a momento from their time there. Put together small party favors that cost under $15 each to make. Stick with the spa theme and put lotions or bath salts into an attractive bag or basket. You could also throw in face masks, nail polish, or hair products. You can find travel-sized products that are fairly inexpensive at most home goods stores."
        }
      ]
    },
    {
      "name":"Running Things on the Day of the Shower",
      "steps":[
        {
          "headline":"Show up to the spa early to bring food or decorations.",
          "description":"If you want to add your own flowers or themed decorations to the spa, get there ahead of time so that you can set them up. Try to arrive about 30 minutes before your appointment so that you can set out any food or drinks that you have. Check with the salon you have a reservation at to see if you will be able to show up early. If any of the guests are bringing food, ask them to show up about 10 minutes early."
        },
        {
          "headline":"Lead the group in activities and games.",
          "description":"Since you were the one to come up with the games and activities for the shower, you will also have to get them started and act as referee. Gather your guests after they have had a chance to enjoy the spa and instruct them on the rules of each game that you’ve planned. Answer any questions and declare a winner at the end of the activity.Tip: You can also have small, spa-themed prizes for the winners of the games. Face masks and body scrubs are great incentives that don’t cost much."
        },
        {
          "headline":"Set a time for the bride to open her gifts.",
          "description":"One of the main events at any bridal shower is the bride receiving all of her presents. Let your guests enjoy the spa for about 1 hour, and then gather them around the bride in a large area or waiting room to watch her open them. Talk to the bride beforehand to see if she wants you to write down who gave her what to send thank you notes. Opening the presents after 1 hour also accounts for guests who might show up late."
        },
        {
          "headline":"Relax and enjoy the spa!",
          "description":"Just because you are throwing the shower doesn’t mean that you can’t enjoy yourself too. Allow both you and your guests to take advantage of the spa surroundings and enjoy facials, massages, and manicures. If things don’t go exactly as you planned, that’s okay. Just make sure the bride is having a good time with her friends and family. People will probably come to you if things go wrong. Be prepared to run out for more food or drinks if you run out."
        },
        {
          "headline":"Hand out party favors at the end of the shower.",
          "description":"Don’t forget to give away the party favors that you made before your guests leave! Let everyone pick out which one they want, or attach name tags to each party favor for individual guests. Thank your guests for coming and for giving the bride a great party. Use the party favors to remind your guests when the day of the wedding is."
        }
      ]
    }
  ],
  "text":" Booking a Spa and Sending Invitations Set the date and time of the shower 2 months before the wedding. Choose a weekend day or an evening so that most people can make it. If there are people important to the bride who live out of town, check in with them to make sure they can make it. Plan on having the shower about 1 or 2 months before the wedding. Any closer and it could be an added stress for the bride. Some spas stay open late for large parties. Start planning the shower about 2 months before it happens. Plan out your guest list of 8 to 12 people. Most bridal showers include the bridal party as well as any female relatives of the bride and groom. Check with the bride to see who she would like to invite. Make sure that anyone you invite to the shower is also invited to the wedding. Try not to exceed 15 people, or it could be tough to throw your shower at a spa. Check with the bride to see if she’d like to keep it intimate with fewer people. Set a budget for the shower. Bridal showers can get expensive, and you don’t want to use a ton of your own money for it. Create a budget that includes the venue, food, and party favors that you’ll use throughout the party. Ask the party guests to pitch in anywhere from $20 to $50 depending on how many people are on your guest list. Put this on the invitation or send them a message on social media.Tip: Don’t ask for a huge amount of money, or it could prohibit some people from going. Shop around at different spas to gather information about deals and pricing. Some spas offer discounts on bridal parties, while others might not be big enough to accommodate your guest list. Call or walk into the spa you have in mind and ask if they can treat a large group of people with multiple services. Ask about dates and times available to see if they have anything open for your date. Some spas have packages that you can purchase. Pick out services like mani/pedis, facials, massages, or even yoga if you think your guests will like it. Make a reservation at a spa 2 months in advance. Spas can’t accommodate large parties all the time, so be sure to make your reservation a few months ahead of time. Some spas may ask for a deposit or the money in full at the time of your booking, so be prepared to pay for your shower early. Depending on the size of the spa, you may have to book the entire venue for your party so that you don’t disturb the other patrons of the spa. Make a reservation as soon as possible so the date that you want doesn’t fill up. Send invitations to your guests 2 months in advance. Contact everyone on your guest list with the date and time of the shower. You can send them paper invitations, send a mass email, or use social media to give out your invitations. Ask your guests to let you know if they will be able to make it so that you can plan accordingly. Incorporate the spa theme into your invitations by using pictures of bathtubs, suds, and bubbles. You can create an event page on Facebook for an easy way to see how many people will be attending. Your guests can choose “Going,” “Maybe,” or “Can’t Go” to RSVP. Be sure to include information about the bride’s gift registry if she has one. Organizing Food, Games, and Favors Plan the menu yourself or book a catering company. Spa days can be exhausting, so your guests might want some pick-me-ups in between treatments. Consider buying healthy, bite-sized food like finger sandwiches or stuffed mushrooms. Order pastries from a bakery and stock up on wine or cocktail ingredients to serve your guests. If you’re not sure what kind of food everyone likes, check with the bride to find out her favorites.Tip: Some guests may also offer to bring desserts or drinks. Take them up on it to remove some of the burden from your shoulders. If you are using a catering service, contact them a few months in advance. Have them deliver the food on the day of the shower. Come up with some bridal shower activities. Most of the bridal shower will be spent relaxing at the spa, but some of it should focus on the bride. Come up with 1 or 2 games for your guests to play that center around the bride and her upcoming wedding. Make sure your guests are on a loose schedule that has them playing the games about 1 hour into the party. Don’t choose any activities that need a lot of space or movement. Stick with the relaxing vibe of the spa. Popular bridal shower games include a gift Bingo game, where guests write down what gifts they think the bride will receive on a Bingo sheet, and a romantic movie quiz, where guests try to guess as many movie titles based on quotes as they can. Create spa-themed party favors for your guests to take home. Part of the charm of a bridal shower is that each guest gets to take home a momento from their time there. Put together small party favors that cost under $15 each to make. Stick with the spa theme and put lotions or bath salts into an attractive bag or basket. You could also throw in face masks, nail polish, or hair products. You can find travel-sized products that are fairly inexpensive at most home goods stores. Running Things on the Day of the Shower Show up to the spa early to bring food or decorations. If you want to add your own flowers or themed decorations to the spa, get there ahead of time so that you can set them up. Try to arrive about 30 minutes before your appointment so that you can set out any food or drinks that you have. Check with the salon you have a reservation at to see if you will be able to show up early. If any of the guests are bringing food, ask them to show up about 10 minutes early. Lead the group in activities and games. Since you were the one to come up with the games and activities for the shower, you will also have to get them started and act as referee. Gather your guests after they have had a chance to enjoy the spa and instruct them on the rules of each game that you’ve planned. Answer any questions and declare a winner at the end of the activity.Tip: You can also have small, spa-themed prizes for the winners of the games. Face masks and body scrubs are great incentives that don’t cost much. Set a time for the bride to open her gifts. One of the main events at any bridal shower is the bride receiving all of her presents. Let your guests enjoy the spa for about 1 hour, and then gather them around the bride in a large area or waiting room to watch her open them. Talk to the bride beforehand to see if she wants you to write down who gave her what to send thank you notes. Opening the presents after 1 hour also accounts for guests who might show up late. Relax and enjoy the spa! Just because you are throwing the shower doesn’t mean that you can’t enjoy yourself too. Allow both you and your guests to take advantage of the spa surroundings and enjoy facials, massages, and manicures. If things don’t go exactly as you planned, that’s okay. Just make sure the bride is having a good time with her friends and family. People will probably come to you if things go wrong. Be prepared to run out for more food or drinks if you run out. Hand out party favors at the end of the shower. Don’t forget to give away the party favors that you made before your guests leave! Let everyone pick out which one they want, or attach name tags to each party favor for individual guests. Thank your guests for coming and for giving the bride a great party. Use the party favors to remind your guests when the day of the wedding is.",
  "tyn_model":[
    "spa",
    "spas",
    "food",
    "face masks",
    "bubbles",
    "“going",
    "” “",
    "” or",
    "“ca",
    "” to",
    "mushrooms",
    "pastries",
    "wine",
    "desserts",
    "lotions",
    "bath salts",
    "nail polish",
    "decorations",
    "flowers",
    "body scrubs",
    "presents",
    "party favors"
  ],
  "tyn_section":[

  ]
}