{
  "title":"How to Wash Black Shirts",
  "url":"https://www.wikihow.com/Wash-Black-Shirts",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Cleaning Clothes"
  ],
  "methods":[
    {
      "name":"Using Good Washing Techniques",
      "steps":[
        {
          "headline":"Wash black shirts with other dark clothing.",
          "description":"Always separate dark shirts from light clothing to preserve their color. Wash your black shirts with other black clothing or dark items, such as navy blue clothing. Don’t wash black shirts with red clothing as red dye can bleed onto the black fabric and give it a crimson sheen."
        },
        {
          "headline":"Turn black shirts inside out before washing them.",
          "description":"This will protect the outer fabric from agitation and tumbling. Agitation and tumbling cause the fabric to wear out and look faded more quickly. If the shirts have any buttons or zippers, button and zip them up to keep the shirt inside out and prevent any snagging."
        },
        {
          "headline":"Wash the shirts using only cold water.",
          "description":"Cold water helps preserve the color of black fabrics, whereas warm water makes black clothing fade faster. Always adjust your washing machine’s water temperature to cold or select a cycle that uses cold water before putting your black shirts in. It’s rarely necessary to wash any clothing with warm or hot water. It just wears them out faster and even can set stains in permanently rather than getting them out."
        },
        {
          "headline":"Put the shirts in the washing machine on a short, light-soil cycle.",
          "description":"Pick a light-soil setting on your washer so the shirts will be in it for less time. This cuts down on the agitation and tumbling time, so the fabric of your black shirts won’t wear out as fast.Tip: If you have any black shirts that are delicate, such as silk or linen shirts, wash them on a delicate cycle or consider hand washing them. If your black shirts are covered in mud or something like that, it’s OK to pick a longer cycle meant for more heavily-soiled clothing. However, for regular washing always use the shortest cycle you can."
        },
        {
          "headline":"Use the recommended amount of a liquid laundry detergent made for dark clothes.",
          "description":"Purchase a detergent that is meant for dark clothing and cold washes. Read the directions on the packaging to add the correct amount for the number of shirts and other laundry you are washing. For example, if the packaging says to use 1 cap full of the liquid detergent for light loads and you are only washing a few black shirts, use 1 cap full. These types of detergents help preserve dark colors longer and can even make them appear darker and richer. Don’t ever exceed the amount of detergent recommended by the manufacturer. Too much detergent can leave streaks and soapy residue on your black shirts."
        },
        {
          "headline":"Pour in 1/2 a cup (150 g) of salt into a shirt's first load to lock in color.",
          "description":"Add the salt to the water in the washing machine the very first time you wash a black shirt. This will prevent bleeding and lock in the black color so it looks new for longer. You can do this for clothing of all colors to keep the colors from bleeding."
        },
        {
          "headline":"Add fabric softener or conditioner to a wash load to reduce fading.",
          "description":"Pour in 1/2 a cup (118 mL) of vinegar, which acts as a natural fabric softener, per wash load. Use the amount of a fabric softener liquid recommended by the manufacturer if you prefer to use a commercial fabric softener. Either of these will lubricate the fabric fibers during washing so they don't wear out as fast and start looking faded."
        }
      ]
    },
    {
      "name":"Preventing Fading Before and After Washing",
      "steps":[
        {
          "headline":"Read the care labels on black shirts and follow any special directions.",
          "description":"The care labels on the tags will provide specific instructions for washing or caring for the shirts to keep them looking good longer. Always refer to these instructions and follow any unique instructions from the manufacturer. For example, certain black shirts might recommend that you only wash them by hand or to avoid practices like tumble drying and ironing."
        },
        {
          "headline":"Wash your black shirts every 4-5 wears.",
          "description":"The more you wash the shirts, the faster they will wear out and fade. Only wash your black shirts after 1 use when they are visibly dirty or you after you have been active and sweating in them. You can try airing out your black shirts after each wear between washes by hanging them up in the laundry room or somewhere else in your home where they get some airflow to get rid of any odors that the shirts pick up."
        },
        {
          "headline":"Spot-clean your shirts with water or stain remover using a clean cloth.",
          "description":"Blot out small spills or stains with a cloth soaked with stain remover or plain water by pressing the cloth firmly against the stain until it disappears. This will allow you to wait longer between washes by getting rid of small dirty spots.Tip: For a homemade spot-cleaning solution, try mixing ⁄2  c (120 mL) of water with 1 US tbsp (15 mL) of mild liquid dish detergent. If there is anything stuck to the shirt, you can gently scrape it off using the edge of a round spoon, then blot it with a clean cloth and plain water or cleaning solution."
        },
        {
          "headline":"Hang or lay the shirts flat to dry them.",
          "description":"Avoid putting black shirts in a drying machine as they will pick up all kinds of fuzzies that make them look less black. Hang them up to dry on clothes hangers or lay them flat on a drying rack. If you absolutely must dry your black shirts in the machine, do so only with other black items and use a low-heat, short cycle time setting to avoid breaking down the fabric and wearing it out by overdrying. Consider having a lint roller on hand to remove any fuzzies stuck to the shirts after drying them."
        },
        {
          "headline":"Avoid leaving black shirts in the sun.",
          "description":"Don’t hang or lay black shirts to dry outside in the sun because UV rays will fade the color more quickly. So, don’t hang them up on an outdoor clothesline or lay them out somewhere like a balcony. If you have an open-air laundry room, hang or lay your black shirts in a different room somewhere inside to dry so they aren’t exposed to the sun."
        }
      ]
    }
  ],
  "text":" Using Good Washing Techniques Wash black shirts with other dark clothing. Always separate dark shirts from light clothing to preserve their color. Wash your black shirts with other black clothing or dark items, such as navy blue clothing. Don’t wash black shirts with red clothing as red dye can bleed onto the black fabric and give it a crimson sheen. Turn black shirts inside out before washing them. This will protect the outer fabric from agitation and tumbling. Agitation and tumbling cause the fabric to wear out and look faded more quickly. If the shirts have any buttons or zippers, button and zip them up to keep the shirt inside out and prevent any snagging. Wash the shirts using only cold water. Cold water helps preserve the color of black fabrics, whereas warm water makes black clothing fade faster. Always adjust your washing machine’s water temperature to cold or select a cycle that uses cold water before putting your black shirts in. It’s rarely necessary to wash any clothing with warm or hot water. It just wears them out faster and even can set stains in permanently rather than getting them out. Put the shirts in the washing machine on a short, light-soil cycle. Pick a light-soil setting on your washer so the shirts will be in it for less time. This cuts down on the agitation and tumbling time, so the fabric of your black shirts won’t wear out as fast.Tip: If you have any black shirts that are delicate, such as silk or linen shirts, wash them on a delicate cycle or consider hand washing them. If your black shirts are covered in mud or something like that, it’s OK to pick a longer cycle meant for more heavily-soiled clothing. However, for regular washing always use the shortest cycle you can. Use the recommended amount of a liquid laundry detergent made for dark clothes. Purchase a detergent that is meant for dark clothing and cold washes. Read the directions on the packaging to add the correct amount for the number of shirts and other laundry you are washing. For example, if the packaging says to use 1 cap full of the liquid detergent for light loads and you are only washing a few black shirts, use 1 cap full. These types of detergents help preserve dark colors longer and can even make them appear darker and richer. Don’t ever exceed the amount of detergent recommended by the manufacturer. Too much detergent can leave streaks and soapy residue on your black shirts. Pour in 1/2 a cup (150 g) of salt into a shirt's first load to lock in color. Add the salt to the water in the washing machine the very first time you wash a black shirt. This will prevent bleeding and lock in the black color so it looks new for longer. You can do this for clothing of all colors to keep the colors from bleeding. Add fabric softener or conditioner to a wash load to reduce fading. Pour in 1/2 a cup (118 mL) of vinegar, which acts as a natural fabric softener, per wash load. Use the amount of a fabric softener liquid recommended by the manufacturer if you prefer to use a commercial fabric softener. Either of these will lubricate the fabric fibers during washing so they don't wear out as fast and start looking faded. Preventing Fading Before and After Washing Read the care labels on black shirts and follow any special directions. The care labels on the tags will provide specific instructions for washing or caring for the shirts to keep them looking good longer. Always refer to these instructions and follow any unique instructions from the manufacturer. For example, certain black shirts might recommend that you only wash them by hand or to avoid practices like tumble drying and ironing. Wash your black shirts every 4-5 wears. The more you wash the shirts, the faster they will wear out and fade. Only wash your black shirts after 1 use when they are visibly dirty or you after you have been active and sweating in them. You can try airing out your black shirts after each wear between washes by hanging them up in the laundry room or somewhere else in your home where they get some airflow to get rid of any odors that the shirts pick up. Spot-clean your shirts with water or stain remover using a clean cloth. Blot out small spills or stains with a cloth soaked with stain remover or plain water by pressing the cloth firmly against the stain until it disappears. This will allow you to wait longer between washes by getting rid of small dirty spots.Tip: For a homemade spot-cleaning solution, try mixing ⁄2  c (120 mL) of water with 1 US tbsp (15 mL) of mild liquid dish detergent. If there is anything stuck to the shirt, you can gently scrape it off using the edge of a round spoon, then blot it with a clean cloth and plain water or cleaning solution. Hang or lay the shirts flat to dry them. Avoid putting black shirts in a drying machine as they will pick up all kinds of fuzzies that make them look less black. Hang them up to dry on clothes hangers or lay them flat on a drying rack. If you absolutely must dry your black shirts in the machine, do so only with other black items and use a low-heat, short cycle time setting to avoid breaking down the fabric and wearing it out by overdrying. Consider having a lint roller on hand to remove any fuzzies stuck to the shirts after drying them. Avoid leaving black shirts in the sun. Don’t hang or lay black shirts to dry outside in the sun because UV rays will fade the color more quickly. So, don’t hang them up on an outdoor clothesline or lay them out somewhere like a balcony. If you have an open-air laundry room, hang or lay your black shirts in a different room somewhere inside to dry so they aren’t exposed to the sun.",
  "tyn_model":[
    "water",
    "fabric softener",
    "detergent",
    "salt",
    "stain remover",
    "washer",
    "laundry detergent",
    "liquid detergent",
    "detergents",
    "vinegar",
    "mild liquid dish detergent",
    "cleaning solution",
    "clothes hangers",
    "lint roller"
  ],
  "tyn_section":[

  ]
}