{
  "title":"How to Use a Waffle Maker",
  "url":"https://www.wikihow.com/Use-a-Waffle-Maker",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Waffles"
  ],
  "methods":[
    {
      "name":"Cooking Waffles",
      "steps":[
        {
          "headline":"Prepare your desired waffle batter.",
          "description":"You can make it from scratch using your favorite recipe, or you can make it using a boxed mix. Don't over-mix the batter; you want there to be some lumps. If you do this, the waffle will turn out chewy. Add some oil or melted butter into your recipe to reduce sticking. For extra flavor, add some cinnamon, vanilla, or almond extract. If you want some heat in your breakfast, try a dash of chili powder."
        },
        {
          "headline":"Preheat the waffle maker.",
          "description":"Set the waffle maker onto a flat, heat-safe surface and plug it in. If your waffle maker has different heat settings (ie: light, medium, dark), select the one that appeals to you. Some models will have an indicator light that switches on. Pay attention to this light; it will turn off or change color when the iron is ready to use."
        },
        {
          "headline":"Grease the waffle maker plates, if needed.",
          "description":"You can use cooking spray, melted butter, or oil. This will prevent the batter from sticking and makes cleaning up easier. If you have a non-stick waffle maker, skip the cooking spray, butter, or oil. This will only lead to sticky, gummy build-up."
        },
        {
          "headline":"Pour the batter in a spiral.",
          "description":"Measure out about ¾ cup (180 milliliters) of batter. Pour it onto the plate in a spiral, starting from the outside edges. If your waffle maker has an indicator light, wait for the light to change color (or switch off, depending on the model) first. If some batter leaks out, don't worry; just use less next time."
        },
        {
          "headline":"Close the lid and allow the batter to cook.",
          "description":"As your waffle cooks, it will release steam. Wait until the steam stops coming out before checking on the waffle for doneness. How long this takes depends on the model and setting you are using; it usually takes about 5 minutes. Do not peek while the waffle is cooking. If you lift the lid too early, you could rip the waffle apart! If your waffle has an indicator light, wait for the light to change color or switch off (depending on the model). If your waffle iron doesn't have an indicator light, check the crack between the to plates. The waffle peeking out from the side will look more like cake when it is done."
        },
        {
          "headline":"Remove the waffle using a plastic, rubber, or silicone utensil.",
          "description":"A knife, fork, or spatula all will work, as long as they are made from plastic, rubber, or silicone. Do not use any metal utensils, as they may scratch the surface."
        },
        {
          "headline":"Close the lid on the iron and plate that delectable waffle.",
          "description":"Butter it and smother it with syrup, and enjoy the splendor of its goodness. If you have more batter, cook that up or cover it and put in the fridge for the next day."
        },
        {
          "headline":"Allow the waffle maker to cool completely before cleaning it.",
          "description":"Wipe the plates down with a soft, damp cloth or paper towel. Brush any crumbs off with a soft kitchen brush. Use a rubber spatula to pick off any pieces of batter stuck to the plates. For really stubborn spots, cover them with cooking oil, wait 5 minutes, then wipe them away with a soft cloth. Do not use scouring pads or steel wool on the plates. Do not use soap unless the instructions tell you to do so. If the plate are removable, you can soak them in water. Avoid using soap unless the instruction manual specifically tells you to do so."
        },
        {
          "headline":"Let the waffle maker dry before putting it away.",
          "description":"If there is any batter stuck to the outside, be sure to wipe it off with a damp cloth first."
        }
      ]
    },
    {
      "name":"Trying Other Batters",
      "steps":[
        {
          "headline":"Try a different kind of batter, such as brownie.",
          "description":"Prepare your desired batter, then pour it into a greased waffle maker. Close the lid, and cook the batter until there's no more steam. If you want a crispier finish, leave the batter in the waffle maker for a few more seconds. This can get a little messy. Make clean up easier by placing a baking sheet under the waffle maker to catch any spilled batter. You can use this technique to make lots of yummy treats, including brownies, banana bread, carrot cake, doughnuts, or even muffins! Make your doughnuts more doughnut-like by glazing them with glace icing or chocolate ganache once they have cooled."
        },
        {
          "headline":"Press scoops of cookie dough in your waffle maker for a quick treat.",
          "description":"Prepare your favorite cookie dough. Refrigerate it for 30 minute, then place a scoop of cookie dough onto each section of your waffle maker. Close the waffle maker and cook the cookies for 4 to 5 minutes. You can use the same method to prepare cinnamon rolls. They will need 2 to 4 minutes to cook."
        },
        {
          "headline":"Switch the batter out for eggs to make an omelet or a frittata.",
          "description":"Beat 2 eggs with 2 tablespoons (30 milliliters) of milk. Pour the batter into the waffle maker. Close the waffle maker, then cook the omelet until the eggs are set. For a tastier omelet, add in some chopped goodie, such as onions, peppers, or mushrooms."
        },
        {
          "headline":"Make hash browns by using shredded potatoes instead.",
          "description":"Shred or grate potatoes using a food processor or grater. Add them to a waffle maker greased with melted butter. Close the lid, and cook them for 15 minutes. Switch out the potatoes for another root vegetable, such as sweet potatoes or yams. Make some fritters with grated zucchini instead! They only need about 3 minutes to cook."
        },
        {
          "headline":"Cook falafels in a waffle maker instead of a pan.",
          "description":"Prepare your falafel batter as usual. Grease the waffle maker with cooking spray, then add your falafel batter. Close the waffle maker, and cook it for 6 to 10 minutes, or until golden and done inside. If you plan on putting the falafel into a pita, a round waffle maker will give you a better shape."
        }
      ]
    },
    {
      "name":"Cooking Solid Meals",
      "steps":[
        {
          "headline":"Make a grilled cheese sandwich.",
          "description":"Grease the waffle maker with cooking spray. Lay down a slice of bread, then top it off with cheese and another piece of bread. Close the waffle maker, and cook it until the cheese melts. Make your sandwich extra crispy and flavorful by coating the outside of each slice with mayonnaise before cooking it."
        },
        {
          "headline":"Make some quesadillas.",
          "description":"Spray the waffle maker, then place a tortilla on the bottom plate. Top it off with shredded cheese and your choice of toppings. Cover it with another tortilla, then close the lid. Cook the tortilla until the cheese melts, about 2 to 3 minutes."
        },
        {
          "headline":"Press fruits between a waffle maker as a substitute for grilling.",
          "description":"Cut larger fruits, such as pineapple or apples, into thick slices first. Stone fruits, such as apricots or nectarines, should be cut in half and pitted. Other types of fruits that work well include pears, figs, and plantains. Most fruits will cook in about 4 minutes."
        },
        {
          "headline":"Cook sliced vegetables for a quick snack.",
          "description":"Cut the vegetables into ¼ to ½-inch (0.64 to 1.27-centimeter) thick slices. Toss them with olive oil, then season them with salt. Cook them in the waffle maker for 3 to 5 minutes. Vine vegetables, such as eggplant, squash, and zucchini work great for this. Portobello mushrooms are also a great choice, especially when making vegetarian-friendly burgers."
        },
        {
          "headline":"Make some pizza!",
          "description":"Prepare your pizza dough, then spread it across the waffle plate. Close the lid and cook it for 2 to 3 minutes. Flip the pizza, and cook it for 2 to 3 minutes more. Add some pizza sauce, cheese, and your choice of toppings. Leave it on the plate with the lid open until the cheese melts."
        }
      ]
    }
  ],
  "text":" Cooking Waffles Prepare your desired waffle batter. You can make it from scratch using your favorite recipe, or you can make it using a boxed mix. Don't over-mix the batter; you want there to be some lumps. If you do this, the waffle will turn out chewy. Add some oil or melted butter into your recipe to reduce sticking. For extra flavor, add some cinnamon, vanilla, or almond extract. If you want some heat in your breakfast, try a dash of chili powder. Preheat the waffle maker. Set the waffle maker onto a flat, heat-safe surface and plug it in. If your waffle maker has different heat settings (ie: light, medium, dark), select the one that appeals to you. Some models will have an indicator light that switches on. Pay attention to this light; it will turn off or change color when the iron is ready to use. Grease the waffle maker plates, if needed. You can use cooking spray, melted butter, or oil. This will prevent the batter from sticking and makes cleaning up easier. If you have a non-stick waffle maker, skip the cooking spray, butter, or oil. This will only lead to sticky, gummy build-up. Pour the batter in a spiral. Measure out about ¾ cup (180 milliliters) of batter. Pour it onto the plate in a spiral, starting from the outside edges. If your waffle maker has an indicator light, wait for the light to change color (or switch off, depending on the model) first. If some batter leaks out, don't worry; just use less next time. Close the lid and allow the batter to cook. As your waffle cooks, it will release steam. Wait until the steam stops coming out before checking on the waffle for doneness. How long this takes depends on the model and setting you are using; it usually takes about 5 minutes. Do not peek while the waffle is cooking. If you lift the lid too early, you could rip the waffle apart! If your waffle has an indicator light, wait for the light to change color or switch off (depending on the model). If your waffle iron doesn't have an indicator light, check the crack between the to plates. The waffle peeking out from the side will look more like cake when it is done. Remove the waffle using a plastic, rubber, or silicone utensil. A knife, fork, or spatula all will work, as long as they are made from plastic, rubber, or silicone. Do not use any metal utensils, as they may scratch the surface. Close the lid on the iron and plate that delectable waffle. Butter it and smother it with syrup, and enjoy the splendor of its goodness. If you have more batter, cook that up or cover it and put in the fridge for the next day. Allow the waffle maker to cool completely before cleaning it. Wipe the plates down with a soft, damp cloth or paper towel. Brush any crumbs off with a soft kitchen brush. Use a rubber spatula to pick off any pieces of batter stuck to the plates. For really stubborn spots, cover them with cooking oil, wait 5 minutes, then wipe them away with a soft cloth. Do not use scouring pads or steel wool on the plates. Do not use soap unless the instructions tell you to do so. If the plate are removable, you can soak them in water. Avoid using soap unless the instruction manual specifically tells you to do so. Let the waffle maker dry before putting it away. If there is any batter stuck to the outside, be sure to wipe it off with a damp cloth first. Trying Other Batters Try a different kind of batter, such as brownie. Prepare your desired batter, then pour it into a greased waffle maker. Close the lid, and cook the batter until there's no more steam. If you want a crispier finish, leave the batter in the waffle maker for a few more seconds. This can get a little messy. Make clean up easier by placing a baking sheet under the waffle maker to catch any spilled batter. You can use this technique to make lots of yummy treats, including brownies, banana bread, carrot cake, doughnuts, or even muffins! Make your doughnuts more doughnut-like by glazing them with glace icing or chocolate ganache once they have cooled. Press scoops of cookie dough in your waffle maker for a quick treat. Prepare your favorite cookie dough. Refrigerate it for 30 minute, then place a scoop of cookie dough onto each section of your waffle maker. Close the waffle maker and cook the cookies for 4 to 5 minutes. You can use the same method to prepare cinnamon rolls. They will need 2 to 4 minutes to cook. Switch the batter out for eggs to make an omelet or a frittata. Beat 2 eggs with 2 tablespoons (30 milliliters) of milk. Pour the batter into the waffle maker. Close the waffle maker, then cook the omelet until the eggs are set. For a tastier omelet, add in some chopped goodie, such as onions, peppers, or mushrooms. Make hash browns by using shredded potatoes instead. Shred or grate potatoes using a food processor or grater. Add them to a waffle maker greased with melted butter. Close the lid, and cook them for 15 minutes. Switch out the potatoes for another root vegetable, such as sweet potatoes or yams. Make some fritters with grated zucchini instead! They only need about 3 minutes to cook. Cook falafels in a waffle maker instead of a pan. Prepare your falafel batter as usual. Grease the waffle maker with cooking spray, then add your falafel batter. Close the waffle maker, and cook it for 6 to 10 minutes, or until golden and done inside. If you plan on putting the falafel into a pita, a round waffle maker will give you a better shape. Cooking Solid Meals Make a grilled cheese sandwich. Grease the waffle maker with cooking spray. Lay down a slice of bread, then top it off with cheese and another piece of bread. Close the waffle maker, and cook it until the cheese melts. Make your sandwich extra crispy and flavorful by coating the outside of each slice with mayonnaise before cooking it. Make some quesadillas. Spray the waffle maker, then place a tortilla on the bottom plate. Top it off with shredded cheese and your choice of toppings. Cover it with another tortilla, then close the lid. Cook the tortilla until the cheese melts, about 2 to 3 minutes. Press fruits between a waffle maker as a substitute for grilling. Cut larger fruits, such as pineapple or apples, into thick slices first. Stone fruits, such as apricots or nectarines, should be cut in half and pitted. Other types of fruits that work well include pears, figs, and plantains. Most fruits will cook in about 4 minutes. Cook sliced vegetables for a quick snack. Cut the vegetables into ¼ to ½-inch (0.64 to 1.27-centimeter) thick slices. Toss them with olive oil, then season them with salt. Cook them in the waffle maker for 3 to 5 minutes. Vine vegetables, such as eggplant, squash, and zucchini work great for this. Portobello mushrooms are also a great choice, especially when making vegetarian-friendly burgers. Make some pizza! Prepare your pizza dough, then spread it across the waffle plate. Close the lid and cook it for 2 to 3 minutes. Flip the pizza, and cook it for 2 to 3 minutes more. Add some pizza sauce, cheese, and your choice of toppings. Leave it on the plate with the lid open until the cheese melts.",
  "tyn_model":[
    "waffle maker",
    "butter",
    "cooking spray",
    "plates",
    "plate",
    "eggs",
    "potatoes",
    "iron",
    "waffle",
    "soap",
    "cookie dough",
    "zucchini",
    "falafel batter",
    "vegetables",
    "waffle batter",
    "chili powder",
    "oil",
    "waffle iron",
    "knife",
    "fork",
    "spatula",
    "syrup",
    "fridge",
    "kitchen brush",
    "rubber spatula",
    "cooking oil",
    "scouring pads",
    "steel wool",
    "water",
    "brownie",
    "baking sheet",
    "banana bread",
    "carrot cake",
    "doughnuts",
    "glace icing",
    "chocolate ganache",
    "cinnamon rolls",
    "milk",
    "onions",
    "peppers",
    "mushrooms",
    "hash browns",
    "food processor",
    "sweet potatoes",
    "falafels",
    "pan",
    "grilled cheese",
    "cheese",
    "mayonnaise",
    "quesadillas",
    "shredded cheese",
    "tortilla",
    "pineapple",
    "apples",
    "apricots",
    "fruits",
    "plantains",
    "olive oil",
    "salt",
    "eggplant",
    "squash",
    "portobello mushrooms",
    "pizza dough",
    "waffle plate",
    "pizza",
    "pizza sauce"
  ],
  "tyn_section":[

  ]
}