{
  "title":"How to Not Blackout when Drinking",
  "url":"https://www.wikihow.com/Not-Blackout-when-Drinking",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Alcohol Consumption"
  ],
  "methods":[
    {
      "name":"Practicing Safer Drinking Habits",
      "steps":[
        {
          "headline":"Drink slowly to prevent a rapid rise in blood-alcohol concentration (BAC).",
          "description":"A sudden spike in the amount of alcohol in your blood is one of the biggest risk factors for a blackout. To avoid blacking out, pace yourself when you drink. Avoid gulping down your drink or having several drinks in a row without taking breaks in between. If you have trouble pacing yourself, try some of the following tricks:\nDrink a “spacer” between alcoholic beverages, such as a glass of soda, some juice, or even a non-alcoholic beer. Take small sips and make a conscious effort to savor your drink. Set your glass down after every sip. Avoid topping off your glass—don’t refill it until it’s empty."
        },
        {
          "headline":"Limit yourself to no more than 1-2 drinks per day.",
          "description":"You’re more likely to have blackouts if you binge drink—that is, have several drinks within a relatively short period of time. Avoid binges by limiting your intake to no more than 1 drink per day if you’re a woman or 2 drinks if you’re a man. 1 drink is defined as 12 fluid ounces (350 mL) of beer (5% alcohol), 5 fluid ounces (150 mL) of wine (12% alcohol), or 1.5 fluid ounces (44 mL) of 80 proof distilled spirits (40% alcohol). Binge drinking is technically defined as any level of drinking that causes you to reach a BAC of 0.08% or higher. For most people, this happens after having 4-5 drinks within a 2-hour period. However, everyone reacts to alcohol differently, so your personal tolerance level may be higher or lower."
        },
        {
          "headline":"Stick to drinks with a lower alcohol content.",
          "description":"The higher the alcohol content in a beverage, the more likely it is to make you blackout drunk. Avoid sending your BAC through the roof by sticking to drinks like beer or cider rather than hard liquors. If you want to drink something harder, mix it with a generous amount of a non-alcoholic mixer, such as tonic water, soda, or juice. Avoid mixed drinks, since mixing multiple types of alcohol will cause you to take in a lot more alcohol in a shorter period of time."
        },
        {
          "headline":"Consume food and water along with alcoholic drinks.",
          "description":"Never drink on an empty stomach, since doing so will cause your body to absorb alcohol much faster. You’re less likely to get blackout drunk if you drink alcohol with a meal. Drinking plenty of water will also help slow the absorption of alcohol. In addition to slowing down the effects of alcohol, filling up on food and water may help you feel fuller so that you’re not tempted to drink as much."
        },
        {
          "headline":"Avoid drinking alcohol while taking other drugs or medications.",
          "description":"Certain medications or drugs can interact with alcohol, making it more likely for you to experience blackouts or other unwanted side effects. Read all your medication labels carefully or talk to your doctor or pharmacist about whether you can safely use them in combination with alcohol. Medications that reduce anxiety and promote sleep, such as benzodiazepines, are especially likely to cause blackouts when combined with alcohol. Taking alcohol and antidepressants together can make your depression worse, increase the effects of the alcohol, and make you more prone to side effects like drowsiness and dizziness. Don’t mix alcohol with other recreational drugs, since this can also have dangerous or unexpected side effects."
        },
        {
          "headline":"Have a designated non-drinker with you if you’re blackout-prone.",
          "description":"Blackouts can put you at greater risk of ending up in dangerous situations or behaving in risky or inappropriate ways. If you know you tend to black out while drinking, try to drink with a friend who’s willing to stay sober and help keep you out of trouble. Ask your friend to remind you to pace yourself. Try saying something like, “Hey, if you see me drinking too much at the party tonight, can you tell me to take a break and grab a snack?”"
        },
        {
          "headline":"Cut back or abstain from drinking if you have alcoholic relatives.",
          "description":"If alcoholism runs in your family, you’re more likely to be at risk of frequent blackouts. Take extra care to drink in moderation or avoid drinking altogether if you have one or more relatives with a drinking problem.Did you know? Although having a family history of alcoholism puts you at greater risk, blackouts aren’t necessarily a sign of alcoholism. Anybody can have a blackout while drinking alcohol, regardless of your level of drinking experience."
        }
      ]
    },
    {
      "name":"Seeking Medical Help",
      "steps":[
        {
          "headline":"See your doctor if you have concerns about your drinking habits.",
          "description":"If you have frequent blackouts, are concerned that you drink too much, or have questions about how alcohol might be affecting your health, talk to your doctor. They can work with you to help determine whether you might have a drinking problem. It’s a good idea to see your doctor if:\nYou’re worried about how much you drink. Your drinking is interfering with your daily life, work, or relationships. Your friends or family have started expressing concern about your drinking habits. You drink even in situations where it might put you or others at risk, such as before driving or operating heavy machinery. You’ve tried to quit or cut back multiple times without success. You experience frequent blackouts or other negative effects from drinking, like vomiting, hangovers, or withdrawal symptoms."
        },
        {
          "headline":"Discuss possible treatment options if you’re alcohol dependent.",
          "description":"If you’re struggling to quit or cut back on your alcohol intake, there are a variety of treatments that can help. Ask your doctor to recommend behavioral strategies to help you quit, or talk about other treatment options, such as:Warning: Quitting cold turkey is difficult for most people, and it could even be dangerous if you have a severe alcohol dependency. Talk to your doctor about developing a plan to stop drinking gradually and safely. A medically supervised detox program to help you manage withdrawal symptoms. Psychological therapy to help you develop a recovery plan, learn appropriate coping skills, and deal with underlying conditions that might contribute to your drinking habits. Medications to help reduce your craving for alcohol or block the enjoyable effects of drinking."
        },
        {
          "headline":"Get emergency medical care if you suspect alcohol poisoning.",
          "description":"Drinking too much, too fast can put you at risk of developing alcohol poisoning. This condition can be life-threatening, so it’s important to seek help immediately if it happens. Call emergency services if you suspect that someone you know has alcohol poisoning, and stay with them until help arrives. Ask your friends to do the same for you, since you’re unlikely to be able to get help for yourself. Symptoms of alcohol poisoning include severe confusion, vomiting, seizures, slow or irregular breathing, skin that is cold, pale, or blue-tinged, and loss of consciousness."
        }
      ]
    }
  ],
  "text":" Practicing Safer Drinking Habits Drink slowly to prevent a rapid rise in blood-alcohol concentration (BAC). A sudden spike in the amount of alcohol in your blood is one of the biggest risk factors for a blackout. To avoid blacking out, pace yourself when you drink. Avoid gulping down your drink or having several drinks in a row without taking breaks in between. If you have trouble pacing yourself, try some of the following tricks:\nDrink a “spacer” between alcoholic beverages, such as a glass of soda, some juice, or even a non-alcoholic beer. Take small sips and make a conscious effort to savor your drink. Set your glass down after every sip. Avoid topping off your glass—don’t refill it until it’s empty. Limit yourself to no more than 1-2 drinks per day. You’re more likely to have blackouts if you binge drink—that is, have several drinks within a relatively short period of time. Avoid binges by limiting your intake to no more than 1 drink per day if you’re a woman or 2 drinks if you’re a man. 1 drink is defined as 12 fluid ounces (350 mL) of beer (5% alcohol), 5 fluid ounces (150 mL) of wine (12% alcohol), or 1.5 fluid ounces (44 mL) of 80 proof distilled spirits (40% alcohol). Binge drinking is technically defined as any level of drinking that causes you to reach a BAC of 0.08% or higher. For most people, this happens after having 4-5 drinks within a 2-hour period. However, everyone reacts to alcohol differently, so your personal tolerance level may be higher or lower. Stick to drinks with a lower alcohol content. The higher the alcohol content in a beverage, the more likely it is to make you blackout drunk. Avoid sending your BAC through the roof by sticking to drinks like beer or cider rather than hard liquors. If you want to drink something harder, mix it with a generous amount of a non-alcoholic mixer, such as tonic water, soda, or juice. Avoid mixed drinks, since mixing multiple types of alcohol will cause you to take in a lot more alcohol in a shorter period of time. Consume food and water along with alcoholic drinks. Never drink on an empty stomach, since doing so will cause your body to absorb alcohol much faster. You’re less likely to get blackout drunk if you drink alcohol with a meal. Drinking plenty of water will also help slow the absorption of alcohol. In addition to slowing down the effects of alcohol, filling up on food and water may help you feel fuller so that you’re not tempted to drink as much. Avoid drinking alcohol while taking other drugs or medications. Certain medications or drugs can interact with alcohol, making it more likely for you to experience blackouts or other unwanted side effects. Read all your medication labels carefully or talk to your doctor or pharmacist about whether you can safely use them in combination with alcohol. Medications that reduce anxiety and promote sleep, such as benzodiazepines, are especially likely to cause blackouts when combined with alcohol. Taking alcohol and antidepressants together can make your depression worse, increase the effects of the alcohol, and make you more prone to side effects like drowsiness and dizziness. Don’t mix alcohol with other recreational drugs, since this can also have dangerous or unexpected side effects. Have a designated non-drinker with you if you’re blackout-prone. Blackouts can put you at greater risk of ending up in dangerous situations or behaving in risky or inappropriate ways. If you know you tend to black out while drinking, try to drink with a friend who’s willing to stay sober and help keep you out of trouble. Ask your friend to remind you to pace yourself. Try saying something like, “Hey, if you see me drinking too much at the party tonight, can you tell me to take a break and grab a snack?” Cut back or abstain from drinking if you have alcoholic relatives. If alcoholism runs in your family, you’re more likely to be at risk of frequent blackouts. Take extra care to drink in moderation or avoid drinking altogether if you have one or more relatives with a drinking problem.Did you know? Although having a family history of alcoholism puts you at greater risk, blackouts aren’t necessarily a sign of alcoholism. Anybody can have a blackout while drinking alcohol, regardless of your level of drinking experience. Seeking Medical Help See your doctor if you have concerns about your drinking habits. If you have frequent blackouts, are concerned that you drink too much, or have questions about how alcohol might be affecting your health, talk to your doctor. They can work with you to help determine whether you might have a drinking problem. It’s a good idea to see your doctor if:\nYou’re worried about how much you drink. Your drinking is interfering with your daily life, work, or relationships. Your friends or family have started expressing concern about your drinking habits. You drink even in situations where it might put you or others at risk, such as before driving or operating heavy machinery. You’ve tried to quit or cut back multiple times without success. You experience frequent blackouts or other negative effects from drinking, like vomiting, hangovers, or withdrawal symptoms. Discuss possible treatment options if you’re alcohol dependent. If you’re struggling to quit or cut back on your alcohol intake, there are a variety of treatments that can help. Ask your doctor to recommend behavioral strategies to help you quit, or talk about other treatment options, such as:Warning: Quitting cold turkey is difficult for most people, and it could even be dangerous if you have a severe alcohol dependency. Talk to your doctor about developing a plan to stop drinking gradually and safely. A medically supervised detox program to help you manage withdrawal symptoms. Psychological therapy to help you develop a recovery plan, learn appropriate coping skills, and deal with underlying conditions that might contribute to your drinking habits. Medications to help reduce your craving for alcohol or block the enjoyable effects of drinking. Get emergency medical care if you suspect alcohol poisoning. Drinking too much, too fast can put you at risk of developing alcohol poisoning. This condition can be life-threatening, so it’s important to seek help immediately if it happens. Call emergency services if you suspect that someone you know has alcohol poisoning, and stay with them until help arrives. Ask your friends to do the same for you, since you’re unlikely to be able to get help for yourself. Symptoms of alcohol poisoning include severe confusion, vomiting, seizures, slow or irregular breathing, skin that is cold, pale, or blue-tinged, and loss of consciousness.",
  "tyn_model":[
    "alcohol",
    "alcohol poisoning",
    "water",
    "soda",
    "glass",
    "beer",
    "“spacer",
    "” between",
    "—don’t",
    "—that",
    "wine",
    "80 proof distilled spirits",
    "non-alcoholic mixer",
    "tonic water",
    "antidepressants",
    "“hey",
    "” cut"
  ],
  "tyn_section":[

  ]
}