{
  "title":"How to Dispose of Roundup Weed Killer",
  "url":"https://www.wikihow.com/Dispose-of-Roundup-Weed-Killer",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Pests and Weeds",
    "Garden Sprays"
  ],
  "methods":[
    {
      "name":"Getting Rid of Extra Pesticide",
      "steps":[
        {
          "headline":"Read the disposal instructions on the container.",
          "description":"Every container of Roundup has instructions on how to dispose of the pesticide. Read the instructions carefully and follow them to the best of your ability. Always read the instructions on any pesticides before using them."
        },
        {
          "headline":"Ask your neighbors if they need any Roundup.",
          "description":"Before you start the process of throwing away your extra pesticide, check with your neighbors and friends to see if they could use the extra Roundup in their lawns. This reduces waste and is a nice gesture. Some people may choose not to use pesticides in their yards. Don’t be offended if they say no to your offer."
        },
        {
          "headline":"Check with your local solid waste company to see if they pick up pesticides.",
          "description":"Some municipalities have programs for pesticide disposal. If there is still Roundup in the container, you may be able to drop it off at a community center or have it picked up from your home. Use the internet to look for your solid waste company. Use search terms like “Orange County pesticide pickup.”\nThe police department can also tell you where to drop off your pesticide waste."
        },
        {
          "headline":"Call 1-800-CLEANUP to find local pesticide waste removal.",
          "description":"If you are still having trouble figuring out where to take your Roundup, call this number to be directed to a pesticide waste facility near you. You will be asked to enter your zip code. Call 1-800-253-2687."
        },
        {
          "headline":"Place your Roundup in a plastic tub in the car during transport.",
          "description":"If you have to drive your excess Roundup somewhere to dispose of it, make sure the cap is fully tightened on the container. Set the container upright in an airtight plastic container that has a lid. Put the plastic container on the floor of your car so that it doesn’t spill as you drive."
        },
        {
          "headline":"Avoid pouring Roundup down the drain, sink, or toilet.",
          "description":"Pesticides can get into waterways and harm fish, plants, and humans. Most water treatment plants are not equipped to remove pesticides from drinking water. Never pour Roundup down any drain or sewer.Tip: Try to only use Roundup when there is no rain predicted for the next 24 hours. This will help prevent it from running off of your lawn and into the sewers."
        }
      ]
    },
    {
      "name":"Recycling Empty Roundup Containers",
      "steps":[
        {
          "headline":"Rinse out your Roundup containers if you have a spray tank.",
          "description":"If you are using large amounts of Roundup that you mixed up in a spray tank, use a hose to fill up your empty container about 20% full of water. Place the cap back onto the container and swirl the water around. Pour the water from the container into the spray tank. Repeat this 2 more times and then put your Roundup container into the recycling or garbage for pickup. Never pour the water from the container directly onto the ground or down a drain. This could harm living things, like plants and fish."
        },
        {
          "headline":"Avoid rinsing your Roundup containers if you don’t have a spray tank.",
          "description":"Pesticides like Roundup harms plants, fish, and other living things in our waterway. Even small traces of Roundup poured down your drain can be harmful. Recycling centers rinse out the pesticide containers before repurposing them."
        },
        {
          "headline":"Place empty containers in the recycling for curbside pickup.",
          "description":"If your Roundup container is empty, you can place it in your recycling can for curbside pickup. If you do not have a curbside pickup program for recycling, take your empty containers to a recycling center near you. Use the normal recycling bin for your Roundup container, not the glass one. Throw the caps from the containers into the trash."
        },
        {
          "headline":"Throw empty Roundup containers in the trash if you can't recycle.",
          "description":"If you do not have a recycling program that picks up curbside and you do not live near a recycling center, you can throw your empty Roundup containers into the trash can to be taken to the landfill. If you do not have a curbside garbage program, take your Roundup containers to your local dump."
        },
        {
          "headline":"Avoid reusing empty pesticide containers.",
          "description":"Never place another chemical inside of an empty container of Roundup. There is most likely some residue left that will mix with the new chemical or liquid. Dispose of Roundup containers as soon as they are empty.Warning: Roundup can mix with other chemicals and create toxic fumes. Never mix Roundup with other pesticides or chemicals."
        }
      ]
    }
  ],
  "text":" Getting Rid of Extra Pesticide Read the disposal instructions on the container. Every container of Roundup has instructions on how to dispose of the pesticide. Read the instructions carefully and follow them to the best of your ability. Always read the instructions on any pesticides before using them. Ask your neighbors if they need any Roundup. Before you start the process of throwing away your extra pesticide, check with your neighbors and friends to see if they could use the extra Roundup in their lawns. This reduces waste and is a nice gesture. Some people may choose not to use pesticides in their yards. Don’t be offended if they say no to your offer. Check with your local solid waste company to see if they pick up pesticides. Some municipalities have programs for pesticide disposal. If there is still Roundup in the container, you may be able to drop it off at a community center or have it picked up from your home. Use the internet to look for your solid waste company. Use search terms like “Orange County pesticide pickup.”\nThe police department can also tell you where to drop off your pesticide waste. Call 1-800-CLEANUP to find local pesticide waste removal. If you are still having trouble figuring out where to take your Roundup, call this number to be directed to a pesticide waste facility near you. You will be asked to enter your zip code. Call 1-800-253-2687. Place your Roundup in a plastic tub in the car during transport. If you have to drive your excess Roundup somewhere to dispose of it, make sure the cap is fully tightened on the container. Set the container upright in an airtight plastic container that has a lid. Put the plastic container on the floor of your car so that it doesn’t spill as you drive. Avoid pouring Roundup down the drain, sink, or toilet. Pesticides can get into waterways and harm fish, plants, and humans. Most water treatment plants are not equipped to remove pesticides from drinking water. Never pour Roundup down any drain or sewer.Tip: Try to only use Roundup when there is no rain predicted for the next 24 hours. This will help prevent it from running off of your lawn and into the sewers. Recycling Empty Roundup Containers Rinse out your Roundup containers if you have a spray tank. If you are using large amounts of Roundup that you mixed up in a spray tank, use a hose to fill up your empty container about 20% full of water. Place the cap back onto the container and swirl the water around. Pour the water from the container into the spray tank. Repeat this 2 more times and then put your Roundup container into the recycling or garbage for pickup. Never pour the water from the container directly onto the ground or down a drain. This could harm living things, like plants and fish. Avoid rinsing your Roundup containers if you don’t have a spray tank. Pesticides like Roundup harms plants, fish, and other living things in our waterway. Even small traces of Roundup poured down your drain can be harmful. Recycling centers rinse out the pesticide containers before repurposing them. Place empty containers in the recycling for curbside pickup. If your Roundup container is empty, you can place it in your recycling can for curbside pickup. If you do not have a curbside pickup program for recycling, take your empty containers to a recycling center near you. Use the normal recycling bin for your Roundup container, not the glass one. Throw the caps from the containers into the trash. Throw empty Roundup containers in the trash if you can't recycle. If you do not have a recycling program that picks up curbside and you do not live near a recycling center, you can throw your empty Roundup containers into the trash can to be taken to the landfill. If you do not have a curbside garbage program, take your Roundup containers to your local dump. Avoid reusing empty pesticide containers. Never place another chemical inside of an empty container of Roundup. There is most likely some residue left that will mix with the new chemical or liquid. Dispose of Roundup containers as soon as they are empty.Warning: Roundup can mix with other chemicals and create toxic fumes. Never mix Roundup with other pesticides or chemicals.",
  "tyn_model":[
    "roundup",
    "water",
    "pesticides",
    "roundup containers",
    "pesticide",
    "solid waste company",
    "“orange",
    "pesticide pickup",
    "”\n",
    "pesticide waste",
    "pesticide waste removal",
    "pesticide waste facility",
    "airtight plastic container",
    "water treatment plants",
    "hose",
    "pesticide containers",
    "roundup container",
    "recycling center"
  ],
  "tyn_section":[

  ]
}