{
  "title":"How to Keep Nutrients in Frozen Vegetables",
  "url":"https://www.wikihow.com/Keep-Nutrients-in-Frozen-Vegetables",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Preservation Techniques",
    "Freezing Food"
  ],
  "methods":[
    {
      "name":"Selecting and Harvesting Vegetables to Freeze",
      "steps":[
        {
          "headline":"Choose locally grown vegetables for nutrient-rich, fresh options.",
          "description":"To get fresh vegetables with the maximum amount of nutrients, buy vegetables that are grown locally whenever possible. It’a likely that local vegetables were harvested more recently than grocery store options. Therefore, they've likely retained more nutrients. Farmer’s markets and community-sponsored agricultural associations (CSAs) are both great options for buying local produce."
        },
        {
          "headline":"Opt for organic vegetables to maximize the flavor and nutrition.",
          "description":"While the effects vary depending on the chemicals and the type of vegetable, in many cases, the additives used to grow non-organic vegetables can alter their flavor, color, and texture. In addition, some non-organic vegetables may have less nutrients than organic options. Therefore, to select vegetables to freeze that have the maximum amount of nutrients, organic options are likely your best bet."
        },
        {
          "headline":"Harvest homegrown vegetables for the freshest options available.",
          "description":"If you want to ensure that your vegetables are harvested and frozen at the best time to maintain nutrients, growing your own vegetables may be your best option. While it takes a lot of planning and care, you’ll be able to control every step of the growing process and freeze your vegetables at their absolute peak level of freshness."
        },
        {
          "headline":"Check the color, firmness, and smell to ensure they’re fresh.",
          "description":"To maximize the amount of nutrients retained in your frozen vegetables, it’s important that you freeze them at their maximum level of freshness. To assess if they’re fresh, first look over the outside to see if the skin is bright and lively in color. Then, gently squeeze or press on the skin to ensure the vegetable is firm. Finally, smell the vegetables to make sure they smell as expected and don’t have any odd or pungent odors. For example, when you’re looking for Brussels sprouts or cabbage to freeze, choose options that are brighter green, free of blemishes, and have tighter, more compact leaves. Freezing vegetables at peak freshness will also help them maintain their texture and more flavor. For best results, freeze the vegetables within a few hours of harvesting or purchasing them to ensure you freeze them at peak freshness."
        }
      ]
    },
    {
      "name":"Cleaning, Blanching, and Chopping the Vegetables",
      "steps":[
        {
          "headline":"Wash your vegetables in cold water to remove impurities.",
          "description":"Hold each of the vegetables under the sink faucet and rinse them with cold water. This will remove any surface bacteria or pesticides that can impact the quality and freshness. You can also place multiple vegetables in a strainer and run them under cold water, letting the water and any dirt or residue drain out the bottom."
        },
        {
          "headline":"Trim or peel the vegetables as needed for each type of vegetable.",
          "description":"While some vegetables, such as asparagus, beans, mushrooms, and small carrots, can be frozen whole, most vegetables will need to be trimmed or peeled to lock in their freshness. Here are a few preparation tips for commonly frozen vegetables:\nFor broccoli, cauliflower, Brussels sprouts, cabbage, collard greens, and kale, trim off any stem ends with a sharp knife and remove course or undesirable outer leaves. For large carrots, potatoes, eggplant, pimento peppers, and turnips, peel the outer layer of skin off using a vegetable peeler or knife, or, if possible, by rubbing the skin off with your hands. For pumpkin, as well as different types of squash, cut the vegetable in half with a sharp knife, remove the stem and any undesirable innards, and cut the remaining part into chunks at your desired size."
        },
        {
          "headline":"Chop the vegetables to your desired size.",
          "description":"While you can freeze many types of vegetables whole, chopping them before freezing them can save you time later. In addition, if you plan to cook the vegetables without thawing them first, it may be helpful to have them pre-chopped. For example, if you’re planning to make French fries out of frozen potatoes, you may want to chop the potatoes into long, skinny chunks so they’re already in the French fry shape when you freeze them. If you want to freeze the vegetables whole, you can skip this step."
        },
        {
          "headline":"Blanch the vegetables to maintain more nutrients.",
          "description":"First, bring a pot of water to a boil. Then, put the vegetables in a steamer basket and place it over the boiling water to blanch your vegetables. Blanch the vegetables for 3 to 5 minutes, depending on the type of vegetable. This will slow or stop the growth of the vegetable’s enzymes, which can cause loss of flavor, nutrients, and freshness. For thicker and larger vegetables, such as potatoes and Brussels sprouts, blanching takes about 5 minutes. For thinner and softer vegetables, such as carrots, broccoli, and squash, blanching takes about 3 minutes. Blanching will also help preserve your vegetable’s texture and color, and destroy the microorganisms on the surface of the vegetables that can cause it to deteriorate."
        },
        {
          "headline":"Cool blanched vegetables in an ice bath to prevent them from cooking.",
          "description":"Fill a large bowl with cold water and ice. Then, place the vegetables in the ice bath as soon as they’re done blanching. Make sure all of the vegetables are fully submerged for a few seconds (about 5 to 10 seconds) before removing them and drying them with a paper towel. While you want blanching to stop enzyme growth, it’s important that you don’t allow the vegetables to start cooking during or after blanching."
        }
      ]
    },
    {
      "name":"Packing and Freezing to Retain Nutrients",
      "steps":[
        {
          "headline":"Freeze the vegetables on a baking sheet if you chopped them.",
          "description":"Once your vegetables are chopped, spread them out on a baking sheet so that none are touching. Then, place the baking sheet in the freezer. Leave the vegetables in the freezer until they’re frozen. If you’re freezing the vegetables whole, you can skip this step."
        },
        {
          "headline":"Transfer the vegetables into a durable, moisture-resistant container.",
          "description":"Once frozen, transfer the vegetables into a plastic freezer container, plastic freezer bag, or a glass canning jar. Then, seal the bag or replace the top on the container or jar. Cardboard or paper containers are not durable enough and generally not moisture-resistant. While glass canning jars are a great option for freezing vegetables, glass jars made of thinner glass may break too easily to be frozen. Make sure that you squeeze the air out of bags before sealing them, as excess air may deplete the nutrients and alter the taste."
        },
        {
          "headline":"Return the vegetables to the freezer set at 0 °F (−18 °C) or lower.",
          "description":"After packaging the vegetables, return them back to the freezer. Make sure your freezer is set at 0 °F (−18 °C) or below to ensure the vegetables stay frozen and the nutrients remain intact. Use your frozen vegetables within 1 year for optimal flavor and texture."
        }
      ]
    }
  ],
  "text":" Selecting and Harvesting Vegetables to Freeze Choose locally grown vegetables for nutrient-rich, fresh options. To get fresh vegetables with the maximum amount of nutrients, buy vegetables that are grown locally whenever possible. It’a likely that local vegetables were harvested more recently than grocery store options. Therefore, they've likely retained more nutrients. Farmer’s markets and community-sponsored agricultural associations (CSAs) are both great options for buying local produce. Opt for organic vegetables to maximize the flavor and nutrition. While the effects vary depending on the chemicals and the type of vegetable, in many cases, the additives used to grow non-organic vegetables can alter their flavor, color, and texture. In addition, some non-organic vegetables may have less nutrients than organic options. Therefore, to select vegetables to freeze that have the maximum amount of nutrients, organic options are likely your best bet. Harvest homegrown vegetables for the freshest options available. If you want to ensure that your vegetables are harvested and frozen at the best time to maintain nutrients, growing your own vegetables may be your best option. While it takes a lot of planning and care, you’ll be able to control every step of the growing process and freeze your vegetables at their absolute peak level of freshness. Check the color, firmness, and smell to ensure they’re fresh. To maximize the amount of nutrients retained in your frozen vegetables, it’s important that you freeze them at their maximum level of freshness. To assess if they’re fresh, first look over the outside to see if the skin is bright and lively in color. Then, gently squeeze or press on the skin to ensure the vegetable is firm. Finally, smell the vegetables to make sure they smell as expected and don’t have any odd or pungent odors. For example, when you’re looking for Brussels sprouts or cabbage to freeze, choose options that are brighter green, free of blemishes, and have tighter, more compact leaves. Freezing vegetables at peak freshness will also help them maintain their texture and more flavor. For best results, freeze the vegetables within a few hours of harvesting or purchasing them to ensure you freeze them at peak freshness. Cleaning, Blanching, and Chopping the Vegetables Wash your vegetables in cold water to remove impurities. Hold each of the vegetables under the sink faucet and rinse them with cold water. This will remove any surface bacteria or pesticides that can impact the quality and freshness. You can also place multiple vegetables in a strainer and run them under cold water, letting the water and any dirt or residue drain out the bottom. Trim or peel the vegetables as needed for each type of vegetable. While some vegetables, such as asparagus, beans, mushrooms, and small carrots, can be frozen whole, most vegetables will need to be trimmed or peeled to lock in their freshness. Here are a few preparation tips for commonly frozen vegetables:\nFor broccoli, cauliflower, Brussels sprouts, cabbage, collard greens, and kale, trim off any stem ends with a sharp knife and remove course or undesirable outer leaves. For large carrots, potatoes, eggplant, pimento peppers, and turnips, peel the outer layer of skin off using a vegetable peeler or knife, or, if possible, by rubbing the skin off with your hands. For pumpkin, as well as different types of squash, cut the vegetable in half with a sharp knife, remove the stem and any undesirable innards, and cut the remaining part into chunks at your desired size. Chop the vegetables to your desired size. While you can freeze many types of vegetables whole, chopping them before freezing them can save you time later. In addition, if you plan to cook the vegetables without thawing them first, it may be helpful to have them pre-chopped. For example, if you’re planning to make French fries out of frozen potatoes, you may want to chop the potatoes into long, skinny chunks so they’re already in the French fry shape when you freeze them. If you want to freeze the vegetables whole, you can skip this step. Blanch the vegetables to maintain more nutrients. First, bring a pot of water to a boil. Then, put the vegetables in a steamer basket and place it over the boiling water to blanch your vegetables. Blanch the vegetables for 3 to 5 minutes, depending on the type of vegetable. This will slow or stop the growth of the vegetable’s enzymes, which can cause loss of flavor, nutrients, and freshness. For thicker and larger vegetables, such as potatoes and Brussels sprouts, blanching takes about 5 minutes. For thinner and softer vegetables, such as carrots, broccoli, and squash, blanching takes about 3 minutes. Blanching will also help preserve your vegetable’s texture and color, and destroy the microorganisms on the surface of the vegetables that can cause it to deteriorate. Cool blanched vegetables in an ice bath to prevent them from cooking. Fill a large bowl with cold water and ice. Then, place the vegetables in the ice bath as soon as they’re done blanching. Make sure all of the vegetables are fully submerged for a few seconds (about 5 to 10 seconds) before removing them and drying them with a paper towel. While you want blanching to stop enzyme growth, it’s important that you don’t allow the vegetables to start cooking during or after blanching. Packing and Freezing to Retain Nutrients Freeze the vegetables on a baking sheet if you chopped them. Once your vegetables are chopped, spread them out on a baking sheet so that none are touching. Then, place the baking sheet in the freezer. Leave the vegetables in the freezer until they’re frozen. If you’re freezing the vegetables whole, you can skip this step. Transfer the vegetables into a durable, moisture-resistant container. Once frozen, transfer the vegetables into a plastic freezer container, plastic freezer bag, or a glass canning jar. Then, seal the bag or replace the top on the container or jar. Cardboard or paper containers are not durable enough and generally not moisture-resistant. While glass canning jars are a great option for freezing vegetables, glass jars made of thinner glass may break too easily to be frozen. Make sure that you squeeze the air out of bags before sealing them, as excess air may deplete the nutrients and alter the taste. Return the vegetables to the freezer set at 0 °F (−18 °C) or lower. After packaging the vegetables, return them back to the freezer. Make sure your freezer is set at 0 °F (−18 °C) or below to ensure the vegetables stay frozen and the nutrients remain intact. Use your frozen vegetables within 1 year for optimal flavor and texture.",
  "tyn_model":[
    "vegetables",
    "water",
    "freezer",
    "potatoes",
    "brussels sprouts",
    "carrots",
    "baking sheet",
    "vegetable",
    "cabbage",
    "broccoli",
    "sharp knife",
    "squash",
    "ice bath",
    "produce",
    "strainer",
    "mushrooms",
    "cauliflower",
    "collard greens",
    "kale",
    "eggplant",
    "pimento peppers",
    "turnips",
    "vegetable peeler",
    "pumpkin",
    "french fries",
    "steamer basket",
    "large bowl",
    "cold water",
    "ice",
    "paper towel",
    "freezer container",
    "freezer bag",
    "glass canning jar",
    "canning jars"
  ],
  "tyn_section":[

  ]
}