{
  "title":"How to Upcycle Glass Bottles",
  "url":"https://www.wikihow.com/Upcycle-Glass-Bottles",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Household Waste Disposal",
    "Recycling"
  ],
  "methods":[
    {
      "name":"Using Bottles around the House",
      "steps":[
        {
          "headline":"Wash your glass bottles and dry them thoroughly.",
          "description":"It's a good idea to rinse any glass bottles you plan on upcycling, especially if they contained something sticky or smelly. Wash the bottles and let them dry completely before turning them into a new project. You can leave the labels on the bottles or soak them if you want to peel them off. If there's sticky residue left behind, scrub it off with a scouring pad."
        },
        {
          "headline":"Fill a bottle with water and add cut flowers to make a homemade vase.",
          "description":"Bottles make great vases since you can use different sized bottles to suit your needs. For example, if you want a vase for just 1 or 2 short stems, find a squat glass bottle. To make a larger vase for a full bouquet, use a wide-mouthed bottle. If you're using small bottles as vases, consider wrapping cord or wire around the rims. Then, hang the vases on the wall or a fence."
        },
        {
          "headline":"Insert a candle into the bottle for a simple candle holder.",
          "description":"To make a candle holder for a tall, thin candle, push the bottom of a taper candle into the top of a wine bottle. If you'd like to hold a pillar or tealight candle, place it in a glass bottle that has a wide opening. To help the candle stay in place, you could pour sand, rice, or pebbles into the bottle around the base of the candle.Tip: If you'd like light without the worry of an open flame, fill your jar with a small strand of holiday or twinkle lights. Set the bottle near an outlet so you can plug in the lights and enjoy their soft glow! To make a dramatic centerpiece, cluster a group of glass bottles in the middle of your table. Stick candles in them and light them before hosting an event."
        },
        {
          "headline":"Fill the bottles with soap or oil and insert a bottle pourer on top.",
          "description":"Upgrade the soap dispenser in your bathroom or kitchen or make a decorative bottle for your kitchen oil. Fill a clean glass bottle that has a narrow neck with liquid soap or oil and push a bottle pourer into the top. If you're using a short, squat bottle, you might be able to screw on a lid that has a pump dispenser. Then, fill the bottle with dish or hand soap and use it in the bathroom or kitchen."
        },
        {
          "headline":"Use bottles as custom storage containers.",
          "description":"Instead of going to the store to buy containers, hold on to your glass bottles! You can use small bottles, like baby food bottles, to hold small items, such as hairpins or push pins. Use larger bottles to hold any of these:\nOffice supplies, such as paperclips, staples, or rubber bands\nToiletries, such as cotton balls, cotton cloths, or Epsom salts\nSpices and food, such as peppercorns, cinnamon, or coffee\nCraft supplies, such as beads, pom poms, or feathers"
        },
        {
          "headline":"Fill bottles with corks, beads, or sand to make a unique centerpiece.",
          "description":"Make a dramatic centerpiece that doesn't cost a lot. Place an empty glass bottle on a shelf or bookcase and fill it with used corks, sand, small shells, or rocks. Try to match the theme of your room. Put pinecones and some holly into a large glass bottle to make a rustic centerpiece, for instance. To turn the centerpiece into a picture frame, slide a photograph into the bottle after you've put sand, seashells, or pebbles along the bottom. These will hold the photo in place."
        }
      ]
    },
    {
      "name":"Upcycling Bottles in the Garden",
      "steps":[
        {
          "headline":"Wash and dry glass bottles before upcycling them in your yard.",
          "description":"Once you've gathered glass bottles, wash them thoroughly. This removes any sticky substances and odors from the bottles. Then, let them dry before repurposing them. If you like, leave the labels on the bottles. If you'd rather take them off, soak the bottles so the labels slip off easily."
        },
        {
          "headline":"Create your own terrarium or planter in a glass bottle.",
          "description":"If you have a green thumb, turn a glass bottle into a custom planter. Put 1 or 2 inches (2.5 or 5.1 cm) of soil into a bottle and plant seeds or a small seedling. Add enough water to moisten the soil and set your bottle in a sunny place. To make it into a terrarium, screw a lid on the bottle to trap the moisture. Small glass bottles are also great containers for a windowsill herb garden!"
        },
        {
          "headline":"Fill a bottle with seeds and screw on an attachment to make a bird feeder.",
          "description":"Take a bottle that has a narrow screw top and fill it with birdseed. Then, buy a circular dispenser attachment and screw it onto the top of the bottle. Turn the bottle upside down so some of the seed spills out onto the feeder attachment. If you'd like to hang your bird feeder, wrap thick wire around the bottle and shape it into a hook near the top. Then, hang the hook to suspend the bird feeder. You may be able to purchase feeder attachments for wider bottles too."
        },
        {
          "headline":"Hang a bottle with a clapper attached to a chain to create a wind chime.",
          "description":"Cut the bottom 1/4 off of your glass bottle and sand it until it's smooth. Then, attach a keyring to a chain and thread it through the neck of your bottle. Hang another keyring from the end of the chain so you can suspend the bottle. To attach a clapper, secure a chain from the keyring inside the bottle and hook a cork, ornament, or piece of wood to the bottom chain.Tip: Remove the glass bottle wind chimes if it begins to storm. You don't want heavy wind to knock the glass bottles into each other so hard that they break. To use the chime, pull the bottle up by the top hook so the bottle hangs and the clapper hangs loosely."
        },
        {
          "headline":"Turn a glass bottle into a hands-off plant waterer.",
          "description":"Fill a narrow-necked glass bottle with water and seal it shut with a cork. Take a skewer and push it through the cork to create a small hole for water to leak out. Then, turn the bottle upside down and push it into your plant pot or garden so about 2 inches (5.1 cm) of the bottle are under the soil. The water will slowly leak out through the cork, which will keep your plant watered on its own. Remember to refill the bottle when it runs out of water."
        },
        {
          "headline":"Turn bottles upside down and push them into soil to create beautiful edging.",
          "description":"Instead of lining walkways or garden patches with paving stones or rocks, select clear or colorful glass bottles. Loosen the soil where you'd like to make the edging. Then, turn the bottles upside down and push them until they're at least half submerged. Pack down the soil around the bottles to help them stay in place. The sun warms the glass, which will also warm the soil. Keep this in mind if you're growing plants that need a little extra warmth. You can push the bottles down so they're all level or insert them at different depths so some bottles stick out more than others."
        }
      ]
    },
    {
      "name":"Decorating the Bottles",
      "steps":[
        {
          "headline":"Wrap twine around the bottles to give them a rustic style.",
          "description":"Squirt craft glue near the bottom of a glass bottle and press the end of a piece of twine on it. Let the glue dry so the twine stays in place. Then, wrap the twine up around the bottle. To keep the twine in place, squirt more glue on the bottle every few rows. Wrap tightly so there aren't gaps in the twine.Tip: If you don't have twine, use thick or chunky yarn. To make the bottles even more unique, use a glue gun to attach buttons, lace, or fabric flowers."
        },
        {
          "headline":"Paint the insides of the glass bottles for a custom look.",
          "description":"Purchase acrylic paint in any shade and pour it directly into a clean glass bottle. Slowly rotate the bottle and tilt it so the paint spreads and coats the entire interior of the bottle. Then, set the bottle upside down on a wire rack with a newspaper underneath it. Once the paint is dry, you can use your colorful bottle! If you prefer, spray paint the inside of the bottle. Keep in mind that this works better for wide-mouthed bottles instead of narrow bottles."
        },
        {
          "headline":"Apply etching cream to a bottle to give the bottle a frosted appearance.",
          "description":"Tape a stencil with words or a design onto your bottle. Use a paintbrush to spread etching cream over the stencil and leave the bottle alone for about 5 minutes. Then, rinse off the cream and peel off the stencil to reveal your etched glass bottle. To make polka dots on your glass, press hole-reinforcer stickers on your bottle. Then, paint the circle inside each sticker to make perfect dots."
        },
        {
          "headline":"Coat the outside of bottles with chalkboard paint if you'd like to write on them.",
          "description":"Buy chalkboard paint that's designed for glass and dip a foam paintbrush into it. Spread an even coat of paint over the entire surface of the bottle and set it aside to dry completely. Then, write on the bottle with white or colored chalk. If you want to paint only a portion of the bottle, tape off the part of the bottle that you want to keep clear. You could etch just the bottom 1/3 of the bottle, for instance."
        },
        {
          "headline":"Decoupage glass bottles to match your personal style.",
          "description":"Choose a design that you'd like to attach to the glass. You might find photographs, sheets of tissue paper, or magazine clippings. Dip a foam brush into craft glue and spread it on the back of your materials. Then, press them onto the glass bottle and brush a thin layer of glue along the edges of the materials. Let them dry completely. For example, you might cover a glass bottle with newsprint. Then, use the unique bottle to hold pens on your desk."
        }
      ]
    }
  ],
  "text":" Using Bottles around the House Wash your glass bottles and dry them thoroughly. It's a good idea to rinse any glass bottles you plan on upcycling, especially if they contained something sticky or smelly. Wash the bottles and let them dry completely before turning them into a new project. You can leave the labels on the bottles or soak them if you want to peel them off. If there's sticky residue left behind, scrub it off with a scouring pad. Fill a bottle with water and add cut flowers to make a homemade vase. Bottles make great vases since you can use different sized bottles to suit your needs. For example, if you want a vase for just 1 or 2 short stems, find a squat glass bottle. To make a larger vase for a full bouquet, use a wide-mouthed bottle. If you're using small bottles as vases, consider wrapping cord or wire around the rims. Then, hang the vases on the wall or a fence. Insert a candle into the bottle for a simple candle holder. To make a candle holder for a tall, thin candle, push the bottom of a taper candle into the top of a wine bottle. If you'd like to hold a pillar or tealight candle, place it in a glass bottle that has a wide opening. To help the candle stay in place, you could pour sand, rice, or pebbles into the bottle around the base of the candle.Tip: If you'd like light without the worry of an open flame, fill your jar with a small strand of holiday or twinkle lights. Set the bottle near an outlet so you can plug in the lights and enjoy their soft glow! To make a dramatic centerpiece, cluster a group of glass bottles in the middle of your table. Stick candles in them and light them before hosting an event. Fill the bottles with soap or oil and insert a bottle pourer on top. Upgrade the soap dispenser in your bathroom or kitchen or make a decorative bottle for your kitchen oil. Fill a clean glass bottle that has a narrow neck with liquid soap or oil and push a bottle pourer into the top. If you're using a short, squat bottle, you might be able to screw on a lid that has a pump dispenser. Then, fill the bottle with dish or hand soap and use it in the bathroom or kitchen. Use bottles as custom storage containers. Instead of going to the store to buy containers, hold on to your glass bottles! You can use small bottles, like baby food bottles, to hold small items, such as hairpins or push pins. Use larger bottles to hold any of these:\nOffice supplies, such as paperclips, staples, or rubber bands\nToiletries, such as cotton balls, cotton cloths, or Epsom salts\nSpices and food, such as peppercorns, cinnamon, or coffee\nCraft supplies, such as beads, pom poms, or feathers Fill bottles with corks, beads, or sand to make a unique centerpiece. Make a dramatic centerpiece that doesn't cost a lot. Place an empty glass bottle on a shelf or bookcase and fill it with used corks, sand, small shells, or rocks. Try to match the theme of your room. Put pinecones and some holly into a large glass bottle to make a rustic centerpiece, for instance. To turn the centerpiece into a picture frame, slide a photograph into the bottle after you've put sand, seashells, or pebbles along the bottom. These will hold the photo in place. Upcycling Bottles in the Garden Wash and dry glass bottles before upcycling them in your yard. Once you've gathered glass bottles, wash them thoroughly. This removes any sticky substances and odors from the bottles. Then, let them dry before repurposing them. If you like, leave the labels on the bottles. If you'd rather take them off, soak the bottles so the labels slip off easily. Create your own terrarium or planter in a glass bottle. If you have a green thumb, turn a glass bottle into a custom planter. Put 1 or 2 inches (2.5 or 5.1 cm) of soil into a bottle and plant seeds or a small seedling. Add enough water to moisten the soil and set your bottle in a sunny place. To make it into a terrarium, screw a lid on the bottle to trap the moisture. Small glass bottles are also great containers for a windowsill herb garden! Fill a bottle with seeds and screw on an attachment to make a bird feeder. Take a bottle that has a narrow screw top and fill it with birdseed. Then, buy a circular dispenser attachment and screw it onto the top of the bottle. Turn the bottle upside down so some of the seed spills out onto the feeder attachment. If you'd like to hang your bird feeder, wrap thick wire around the bottle and shape it into a hook near the top. Then, hang the hook to suspend the bird feeder. You may be able to purchase feeder attachments for wider bottles too. Hang a bottle with a clapper attached to a chain to create a wind chime. Cut the bottom 1/4 off of your glass bottle and sand it until it's smooth. Then, attach a keyring to a chain and thread it through the neck of your bottle. Hang another keyring from the end of the chain so you can suspend the bottle. To attach a clapper, secure a chain from the keyring inside the bottle and hook a cork, ornament, or piece of wood to the bottom chain.Tip: Remove the glass bottle wind chimes if it begins to storm. You don't want heavy wind to knock the glass bottles into each other so hard that they break. To use the chime, pull the bottle up by the top hook so the bottle hangs and the clapper hangs loosely. Turn a glass bottle into a hands-off plant waterer. Fill a narrow-necked glass bottle with water and seal it shut with a cork. Take a skewer and push it through the cork to create a small hole for water to leak out. Then, turn the bottle upside down and push it into your plant pot or garden so about 2 inches (5.1 cm) of the bottle are under the soil. The water will slowly leak out through the cork, which will keep your plant watered on its own. Remember to refill the bottle when it runs out of water. Turn bottles upside down and push them into soil to create beautiful edging. Instead of lining walkways or garden patches with paving stones or rocks, select clear or colorful glass bottles. Loosen the soil where you'd like to make the edging. Then, turn the bottles upside down and push them until they're at least half submerged. Pack down the soil around the bottles to help them stay in place. The sun warms the glass, which will also warm the soil. Keep this in mind if you're growing plants that need a little extra warmth. You can push the bottles down so they're all level or insert them at different depths so some bottles stick out more than others. Decorating the Bottles Wrap twine around the bottles to give them a rustic style. Squirt craft glue near the bottom of a glass bottle and press the end of a piece of twine on it. Let the glue dry so the twine stays in place. Then, wrap the twine up around the bottle. To keep the twine in place, squirt more glue on the bottle every few rows. Wrap tightly so there aren't gaps in the twine.Tip: If you don't have twine, use thick or chunky yarn. To make the bottles even more unique, use a glue gun to attach buttons, lace, or fabric flowers. Paint the insides of the glass bottles for a custom look. Purchase acrylic paint in any shade and pour it directly into a clean glass bottle. Slowly rotate the bottle and tilt it so the paint spreads and coats the entire interior of the bottle. Then, set the bottle upside down on a wire rack with a newspaper underneath it. Once the paint is dry, you can use your colorful bottle! If you prefer, spray paint the inside of the bottle. Keep in mind that this works better for wide-mouthed bottles instead of narrow bottles. Apply etching cream to a bottle to give the bottle a frosted appearance. Tape a stencil with words or a design onto your bottle. Use a paintbrush to spread etching cream over the stencil and leave the bottle alone for about 5 minutes. Then, rinse off the cream and peel off the stencil to reveal your etched glass bottle. To make polka dots on your glass, press hole-reinforcer stickers on your bottle. Then, paint the circle inside each sticker to make perfect dots. Coat the outside of bottles with chalkboard paint if you'd like to write on them. Buy chalkboard paint that's designed for glass and dip a foam paintbrush into it. Spread an even coat of paint over the entire surface of the bottle and set it aside to dry completely. Then, write on the bottle with white or colored chalk. If you want to paint only a portion of the bottle, tape off the part of the bottle that you want to keep clear. You could etch just the bottom 1/3 of the bottle, for instance. Decoupage glass bottles to match your personal style. Choose a design that you'd like to attach to the glass. You might find photographs, sheets of tissue paper, or magazine clippings. Dip a foam brush into craft glue and spread it on the back of your materials. Then, press them onto the glass bottle and brush a thin layer of glue along the edges of the materials. Let them dry completely. For example, you might cover a glass bottle with newsprint. Then, use the unique bottle to hold pens on your desk.",
  "tyn_model":[
    "bottles",
    "bottle",
    "glass bottle",
    "twine",
    "water",
    "glue",
    "glass bottles",
    "sand",
    "bird feeder",
    "paint",
    "wire",
    "pebbles",
    "bottle pourer",
    "etching cream",
    "chalkboard paint",
    "scouring pad",
    "vase",
    "candle",
    "candle holder",
    "taper candle",
    "wine bottle",
    "rice",
    "candles",
    "soap",
    "soap dispenser",
    "liquid soap",
    "dish or hand soap",
    "containers",
    "push pins",
    "rubber bands",
    "epsom salts",
    "coffee",
    "beads",
    "feathers",
    "corks",
    "rocks",
    "pinecones",
    "holly",
    "birdseed",
    "circular dispenser",
    "feeder",
    "chain",
    "clapper",
    "plant waterer",
    "skewer",
    "soil",
    "glass",
    "yarn",
    "glue gun",
    "acrylic paint",
    "newspaper",
    "spray paint",
    "paintbrush",
    "cream",
    "foam paintbrush",
    "white or colored chalk",
    "foam brush",
    "craft glue",
    "pens"
  ],
  "tyn_section":[

  ]
}