{
  "title":"How to Refrigerate Fruit",
  "url":"https://www.wikihow.com/Refrigerate-Fruit",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Refrigerating Fruit at the Right Time",
      "steps":[
        {
          "headline":"Place fully ripe fruit in the fridge right away to extend shelf life.",
          "description":"Most fully ripe fruits should go directly in the fridge when you get them home to preserve their flavor and texture. If you leave ripe fruit out at room temperature, it accelerates the ripening process dramatically. Avoid rinsing the fruit before storage! Wash produce right before you use it to maximize shelf life. This includes apples, melons, mangos, papayas, pineapples, peaches, nectarines, apples, plums, kiwi, star fruit, and pears. Avoid refrigerating ripe bananas, lemons, and limes. Ripe fruit has deep, even coloring and smells sweet and fresh. The skin is smooth and firm with a small amount of give if you apply pressure. Most ripe fruit feels slightly heavy for its size when you hold it in your hand. These fruits will stay fresh in the fridge for about 5-7 days. They’ll deteriorate rapidly after that and should be tossed out."
        },
        {
          "headline":"Let tropical and stone fruits ripen on the counter first to preserve flavor.",
          "description":"If these fruits aren’t quite ripe when you get them home, it’s important to leave them out at room temperature and let them fully ripen before you stick them in the fridge. If you refrigerate them prematurely, they can develop a mealy texture and lose their flavor. Keep them at room temperature for about 3-4 days before refrigerating them. This includes peaches, nectarines, bananas, mangos, melons, kiwi, plums, and so on. A green skin or rind typically indicates unripe fruit unless the fruit is citrus or supposed to be green (like kiwi or green apples). Immature fruits also feel hard to the touch and won't have much of an aroma."
        },
        {
          "headline":"Put berries, cherries, and grapes in the fridge immediately.",
          "description":"These fruits are picked when they’re fully ripe, so they need to go in the fridge right away to prevent spoilage. They will start to spoil rapidly if you leave them at room temperature. This includes blackberries, raspberries, cherries, grapes, cranberries, and strawberries. Most of these fruits need to be tossed after 5-7 days. However, blueberries can last 1-2 weeks and cranberries 3-4 weeks in the fridge. Strawberries ripen the fastest and typically only last 3-5 days in the fridge."
        },
        {
          "headline":"Toss out fresh fruit when the exterior gets mushy or darkens in color.",
          "description":"You’ll probably know as soon as you touch the fruit if it’s still good or not. Overripe fruit will often feel mushy and give off a pungent, sickly-sweet scent. Discoloration, especially darkening, is also a sign that you should toss the fruit. You can sort through berries and grapes and keep the good ones, since some of them may ripen faster than others."
        }
      ]
    },
    {
      "name":"Storing Fruit in the Best Area or Container",
      "steps":[
        {
          "headline":"Keep berries and grapes unwashed and in their original packaging.",
          "description":"These fruits are already fully ripe when you bring them home, so introducing moisture will only speed up the deterioration process. Keep berries, cherries, and grapes in their original packaging and place them in the crisper drawer of your fridge right away. If you prefer, you can put them in a dry, airtight plastic container before refrigerating them."
        },
        {
          "headline":"Place fruit in the crisper drawer to protect the flavor and extend shelf life.",
          "description":"Most ripe fruit will keep best in its original packaging and tucked safely inside of your refrigerator’s crisper drawer. The crisper prevents moisture and odors from other refrigerated foods from seeping into the fruit. Always use the crisper to maximize shelf life and flavor of your fresh fruit!"
        },
        {
          "headline":"Separate different kinds of fruit to prevent rapid deterioration.",
          "description":"Some fruits, like apples, release ethylene gas, which causes other fruits and veggies nearby to ripen faster. To prevent this from happening, store different kinds of fruits in separate areas in the fridge or put them in separate containers. You can also place apples in paper bags before refrigerating them to prevent the ethylene gas from seeping out."
        },
        {
          "headline":"Store ripe bananas, lemons, and limes in a cool, dry place.",
          "description":"These fruits typically don’t need to be refrigerated at all, but you do need to put them somewhere cool and dark to prevent spoilage. Avoid humid or moist spaces, like next to the stove or dishwasher, since moisture will spoil the fruit. For example, store them in a cool kitchen on the counter, put them in a ventilated pantry, or store them in your cellar."
        }
      ]
    }
  ],
  "text":" Refrigerating Fruit at the Right Time Place fully ripe fruit in the fridge right away to extend shelf life. Most fully ripe fruits should go directly in the fridge when you get them home to preserve their flavor and texture. If you leave ripe fruit out at room temperature, it accelerates the ripening process dramatically. Avoid rinsing the fruit before storage! Wash produce right before you use it to maximize shelf life. This includes apples, melons, mangos, papayas, pineapples, peaches, nectarines, apples, plums, kiwi, star fruit, and pears. Avoid refrigerating ripe bananas, lemons, and limes. Ripe fruit has deep, even coloring and smells sweet and fresh. The skin is smooth and firm with a small amount of give if you apply pressure. Most ripe fruit feels slightly heavy for its size when you hold it in your hand. These fruits will stay fresh in the fridge for about 5-7 days. They’ll deteriorate rapidly after that and should be tossed out. Let tropical and stone fruits ripen on the counter first to preserve flavor. If these fruits aren’t quite ripe when you get them home, it’s important to leave them out at room temperature and let them fully ripen before you stick them in the fridge. If you refrigerate them prematurely, they can develop a mealy texture and lose their flavor. Keep them at room temperature for about 3-4 days before refrigerating them. This includes peaches, nectarines, bananas, mangos, melons, kiwi, plums, and so on. A green skin or rind typically indicates unripe fruit unless the fruit is citrus or supposed to be green (like kiwi or green apples). Immature fruits also feel hard to the touch and won't have much of an aroma. Put berries, cherries, and grapes in the fridge immediately. These fruits are picked when they’re fully ripe, so they need to go in the fridge right away to prevent spoilage. They will start to spoil rapidly if you leave them at room temperature. This includes blackberries, raspberries, cherries, grapes, cranberries, and strawberries. Most of these fruits need to be tossed after 5-7 days. However, blueberries can last 1-2 weeks and cranberries 3-4 weeks in the fridge. Strawberries ripen the fastest and typically only last 3-5 days in the fridge. Toss out fresh fruit when the exterior gets mushy or darkens in color. You’ll probably know as soon as you touch the fruit if it’s still good or not. Overripe fruit will often feel mushy and give off a pungent, sickly-sweet scent. Discoloration, especially darkening, is also a sign that you should toss the fruit. You can sort through berries and grapes and keep the good ones, since some of them may ripen faster than others. Storing Fruit in the Best Area or Container Keep berries and grapes unwashed and in their original packaging. These fruits are already fully ripe when you bring them home, so introducing moisture will only speed up the deterioration process. Keep berries, cherries, and grapes in their original packaging and place them in the crisper drawer of your fridge right away. If you prefer, you can put them in a dry, airtight plastic container before refrigerating them. Place fruit in the crisper drawer to protect the flavor and extend shelf life. Most ripe fruit will keep best in its original packaging and tucked safely inside of your refrigerator’s crisper drawer. The crisper prevents moisture and odors from other refrigerated foods from seeping into the fruit. Always use the crisper to maximize shelf life and flavor of your fresh fruit! Separate different kinds of fruit to prevent rapid deterioration. Some fruits, like apples, release ethylene gas, which causes other fruits and veggies nearby to ripen faster. To prevent this from happening, store different kinds of fruits in separate areas in the fridge or put them in separate containers. You can also place apples in paper bags before refrigerating them to prevent the ethylene gas from seeping out. Store ripe bananas, lemons, and limes in a cool, dry place. These fruits typically don’t need to be refrigerated at all, but you do need to put them somewhere cool and dark to prevent spoilage. Avoid humid or moist spaces, like next to the stove or dishwasher, since moisture will spoil the fruit. For example, store them in a cool kitchen on the counter, put them in a ventilated pantry, or store them in your cellar.",
  "tyn_model":[
    "fridge",
    "grapes",
    "apples",
    "berries",
    "bananas",
    "cherries",
    "melons",
    "peaches",
    "plums",
    "lemons",
    "limes",
    "cranberries",
    "strawberries",
    "crisper drawer",
    "crisper",
    "ethylene gas",
    "produce",
    "pineapples",
    "nectarines",
    "star fruit",
    "pears",
    "blackberries",
    "raspberries",
    "blueberries",
    "fruit",
    "refrigerator",
    "fruits"
  ],
  "tyn_section":[

  ]
}