{
  "title":"How to Make Any Meal Into a Healthier One",
  "url":"https://www.wikihow.com/Make-Any-Meal-Into-a-Healthier-One",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Meal Planning"
  ],
  "methods":[
    {
      "name":"For Any Meal",
      "steps":[
        {
          "headline":"Remind yourself before each meal that your stomach is (or should be) only the size of your fist.",
          "description":"Granted, you can eat more than a fistful of most foods because the food is compacted as you chew it and the water and air escape from it. Just try to envision the entire plate of food in front of you in that small fist size stomach of yours and hopefully that will remind you to eat healthy."
        },
        {
          "headline":"Eat slowly.",
          "description":"Take the time to chew each bite and appreciate what you are eating. It takes times for the signals from your stomach to reach your brain. Listen to the signals your stomach is sending to you as you eat. If it says \"I'm still hungry\" eat another bite, if it says \"I'm just fine\" then stop eating for a while and only eat again if that signal changes back to \"I'm still hungry\",  if it says \"I'm too full\" stop eating immediately."
        },
        {
          "headline":"Drink some water before your meal and continue to drink throughout the meal.",
          "description":""
        },
        {
          "headline":"Add more fruits, vegetables, grains, beans, nuts, and seeds to your meals to get more fiber and anti-oxidants.",
          "description":""
        },
        {
          "headline":"Do not let yourself overeat.",
          "description":"When you are \"just fine\" stop yourself from eating by getting up and clearing your plate, or if you are in a situation where you can't do that, put your napkin on the plate to serve as a reminder that you are not eating anymore."
        },
        {
          "headline":"Avoid hydrogenated oils, high fructose corn syrup, too much salt and sugar, processed foods, and cholesterol.",
          "description":""
        },
        {
          "headline":"If you are able to cut back on foods with carbohydrates, you can actually eat more saturated fat, since it becomes the bodies first priority to burn as fuel when no carbohydrates are available.",
          "description":"Carbohydrates are converted to, and stored as, fat, if not used or burned relatively quickly."
        }
      ]
    },
    {
      "name":"When Eating Out",
      "steps":[
        {
          "headline":"Ordering meals that sound less unhealthy won't always guarantee that they are healthy.",
          "description":"Salads can be just as bad as any entrée if they are loaded with dressing. Instead, order what you want to eat with any unhealthy aspects either taken off or put on the side (if you can handle having them there without feeling like you need to eat them)."
        },
        {
          "headline":"Never justify eating your entire meal because you paid for it.",
          "description":"If you feel this way then remind yourself that the money you spent on the part of the meal that you didn't eat is just an investment in a healthier you or if you can take the rest of the food home and eat it later. If you go to a restaurant and find the portions to be large, ask for a take-home box when your food arrives. Place half the meal into the box before you begin to eat. Plan on eating the rest later that day, if you get hungry, or tomorrow. This way you won't feel you've wasted money or food and you'll already have tomorrow's lunch ready to warm up. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f0\\/Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet1.jpg\\/v4-460px-Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f0\\/Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet1.jpg\\/v4-759px-Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":305,\"bigWidth\":760,\"bigHeight\":504.2307692307692,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nDo a little research before you go to the restaurant. There are websites that list the ingredients/nutritional facts for restaurants. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/88\\/Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet2.jpg\\/v4-460px-Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/88\\/Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet2.jpg\\/v4-759px-Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":305,\"bigWidth\":760,\"bigHeight\":504.2307692307692,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        }
      ]
    }
  ],
  "text":" For Any Meal Remind yourself before each meal that your stomach is (or should be) only the size of your fist. Granted, you can eat more than a fistful of most foods because the food is compacted as you chew it and the water and air escape from it. Just try to envision the entire plate of food in front of you in that small fist size stomach of yours and hopefully that will remind you to eat healthy. Eat slowly. Take the time to chew each bite and appreciate what you are eating. It takes times for the signals from your stomach to reach your brain. Listen to the signals your stomach is sending to you as you eat. If it says \"I'm still hungry\" eat another bite, if it says \"I'm just fine\" then stop eating for a while and only eat again if that signal changes back to \"I'm still hungry\",  if it says \"I'm too full\" stop eating immediately. Drink some water before your meal and continue to drink throughout the meal.  Add more fruits, vegetables, grains, beans, nuts, and seeds to your meals to get more fiber and anti-oxidants.  Do not let yourself overeat. When you are \"just fine\" stop yourself from eating by getting up and clearing your plate, or if you are in a situation where you can't do that, put your napkin on the plate to serve as a reminder that you are not eating anymore. Avoid hydrogenated oils, high fructose corn syrup, too much salt and sugar, processed foods, and cholesterol.  If you are able to cut back on foods with carbohydrates, you can actually eat more saturated fat, since it becomes the bodies first priority to burn as fuel when no carbohydrates are available. Carbohydrates are converted to, and stored as, fat, if not used or burned relatively quickly. When Eating Out Ordering meals that sound less unhealthy won't always guarantee that they are healthy. Salads can be just as bad as any entrée if they are loaded with dressing. Instead, order what you want to eat with any unhealthy aspects either taken off or put on the side (if you can handle having them there without feeling like you need to eat them). Never justify eating your entire meal because you paid for it. If you feel this way then remind yourself that the money you spent on the part of the meal that you didn't eat is just an investment in a healthier you or if you can take the rest of the food home and eat it later. If you go to a restaurant and find the portions to be large, ask for a take-home box when your food arrives. Place half the meal into the box before you begin to eat. Plan on eating the rest later that day, if you get hungry, or tomorrow. This way you won't feel you've wasted money or food and you'll already have tomorrow's lunch ready to warm up. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f0\\/Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet1.jpg\\/v4-460px-Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/f\\/f0\\/Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet1.jpg\\/v4-759px-Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":305,\"bigWidth\":760,\"bigHeight\":504.2307692307692,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nDo a little research before you go to the restaurant. There are websites that list the ingredients/nutritional facts for restaurants. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/88\\/Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet2.jpg\\/v4-460px-Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/88\\/Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet2.jpg\\/v4-759px-Make-Any-Meal-Into-a-Healthier-One-Step-9Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":305,\"bigWidth\":760,\"bigHeight\":504.2307692307692,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}",
  "tyn_model":[
    "water",
    "plate",
    "nuts",
    "napkin",
    "high fructose corn syrup",
    "saturated fat",
    "carbohydrates",
    "food",
    "parser"
  ],
  "tyn_section":[

  ]
}