{
  "title":"How to Choose a Paint Roller",
  "url":"https://www.wikihow.com/Choose-a-Paint-Roller",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Selecting a Nap Length",
      "steps":[
        {
          "headline":"Find a ⁄4 inch (0.64 cm) nap for painting smooth surfaces, such as wood or metal.",
          "description":"Choose a short-nap roller if you're painting a very smooth surface that could show streaks or imperfections, such as wood, walls, or metal. You should also select a short nap if you're painting smooth drywall or a surface with light texture. For a single-use roller, use a foam roller instead of one with woven or fabric nap. The foam will apply the paint without leaving streaks or lint."
        },
        {
          "headline":"Pick a ⁄4 to ⁄8 inch (0.64 to 0.95 cm) nap for medium-textured surfaces.",
          "description":"A ⁄8 inch (0.95 cm) nap is a standard nap size, which makes it a good choice for most painting projects. If you're painting ceilings or interior walls, use this size since it will pick up more paint than a roller with a shorter nap and will fill in a slightly textured surface. If you're still unsure about which nap is right for your project, start with a ⁄8 inch (0.95 cm) nap. If the roller is picking up too much paint for the job, move down to a ⁄4 inch (0.64 cm) nap."
        },
        {
          "headline":"Choose a 1 to 1 ⁄4 in (2.5 to 3.2 cm) nap if you're painting rough surfaces.",
          "description":"A long nap is great for getting paint into the cracks or crevices of rough surfaces. Look for a 1 to 1 ⁄4 in (2.5 to 3.2 cm) nap roller if you're painting:\nBrick\nStucco\nMasonry\nTextured plaster"
        }
      ]
    },
    {
      "name":"Picking a Roller Material",
      "steps":[
        {
          "headline":"Select a foam roller if you're painting a smooth surface with high gloss paint.",
          "description":"Very smooth surfaces can show streaks if you use a knit or woven roller. To apply paint without leaving lint or a bubbled texture, buy a foam roller. These are great for painting metal doors, cabinets, or trim. Because foam rollers don't last very well after using and washing them, most are considered to be single-use."
        },
        {
          "headline":"Buy a synthetic or blended roller cover for latex or acrylic paints.",
          "description":"Covers made from polyester, nylon, or dacron work well with any latex, acrylic, or oil-based paint. For a longer-lasting cover, choose one that's a blend of polyester and wool. The wool helps the roller pick up more paint while the polyester prevents the roller from wearing out quickly.Tip: Although you can use a blended cover for oil paint, it's fine to use a natural cover made from mohair or sheepskin. These are more expensive and can't be used with latex paint, but they apply oil paint well. Synthetic covers don't pick up as much paint as a wool cover, but they last a long time when cared for properly."
        },
        {
          "headline":"Feel the roller and buy one that has a tight weave.",
          "description":"Brush your fingers over the roller material and pay attention to how loose or fluffy it feels. The material should feel tightly woven if it's a well-made roller. Don't buy a roller that releases lint or fibers when you brush it since these will end up in your paint. Keep in mind that it's easier to clean and reuse higher-quality rollers since the roller material won't fall away from the roller as easily."
        }
      ]
    },
    {
      "name":"Choosing a Roller Size",
      "steps":[
        {
          "headline":"Buy a 9 in (23 cm) roller for most of your painting projects.",
          "description":"A 9 in (23 cm) roller is easier hold and use than a larger one. It's also the right size for paint trays, which makes loading the roller with paint much simpler. You can use a 9 in (23 cm) roller to paint most interior or exterior walls. You'll also have more choices for roller covers if you use a 9 in (23 cm) paint roller because it's the most common size."
        },
        {
          "headline":"Choose a roller up to 18 inches (46 cm) in size for a very large project.",
          "description":"If you need to paint a large surface area, such as a large room of smooth drywall, pick a roller that's up to 18 inches (46 cm) so you can apply a lot of paint very quickly. Keep in mind that holding a large roller can be tiring after a while. If you have a lot of large projects, consider using a paint sprayer instead."
        },
        {
          "headline":"Use a 2 to 3 in (5.1 to 7.6 cm) roller if you'll be painting around windows or edges.",
          "description":"It can be difficult to wedge a standard roller into a narrow space, so purchase a mini-roller. These are designed to easily paint along edges, around windows, and in tight spaces.Tip: You can buy special edge rollers made of foam. These are cut with an angle so you can run them along a straight edge to get a straight line. If you don't want to buy a separate roller for cutting in around frames, use a small paintbrush instead."
        },
        {
          "headline":"Choose a matching roller frame that feels comfortable in your hand.",
          "description":"If you're painting a large surface, such as the walls of a room, you'll want a roller that you can hold without straining your wrist. Pick up a roller frame and practice holding it as though you're painting. Don't buy the roller frame if it digs into your hand or is difficult to hold. If you'll be screwing the frame onto an extension pole, buy a frame that has threading on the bottom."
        }
      ]
    },
    {
      "name":"Caring for Your Paint Roller",
      "steps":[
        {
          "headline":"Clean the roller immediately after finishing your project.",
          "description":"Take a few minutes to wash your roller cover once you're done painting. This prevents the paint from drying between the fibers, which makes cleaning the roller more difficult. If you bought a cheap foam roller cover, you may not be able to wash it and use it again. Only wash the roller if you think it won't disintegrate."
        },
        {
          "headline":"Use warm water to rinse latex or acrylic paint from the roller.",
          "description":"Use a rubber spatula to scrape excess paint from the roller into the paint can or tray. This reduces the amount of paint that you're washing down the drain. Then, take the roller to a sink and run warm water over it. Gently massage the roller to loosen the paint. Keep rinsing until the water runs clear. Don't rinse oil-based paint in the sink since water won't remove the paint."
        },
        {
          "headline":"Soak the roller in paint thinner before rinsing it if you used oil-based paint.",
          "description":"You can't simply rinse the oil-based paint roller in the sink since it can damage your plumbing. Instead, fill a bucket with paint thinner and put the roller in it. Soak the roller for at least 2 or 3 hours. Then, lift the roller out of the paint thinner and rinse the roller under cold water until the water runs clear.Tip: Work in a well-ventilated space so you don't breathe in the fumes from the paint thinner. Open windows or work outside, for instance. You could also use mineral spirits instead of paint thinner since it will also remove the oil-based paint. Don't pour the paint thinner down the sink. Follow the manufacturer's disposal instructions."
        },
        {
          "headline":"Spin the roller to help it dry faster.",
          "description":"Slide your clean fingers down the length of the paint roller to remove excess water. If you have a roller spinning tool, slide it into the roller and pump the tool up and down. It will quickly rotate the roller so water spins out. If you don't have a spinner, put the roller cover on the frame and use your hand to spin the cover so water flies out."
        },
        {
          "headline":"Dry the roller completely before storing it.",
          "description":"Stand the roller upright so it dries evenly on all sides. Leave it at room temperature until it's completely dry. Then, slide the roller back into the package and store it flat until your next project. If you store the roller while it's still moist, the material can mildew or clump together."
        }
      ]
    }
  ],
  "text":" Selecting a Nap Length Find a ⁄4 inch (0.64 cm) nap for painting smooth surfaces, such as wood or metal. Choose a short-nap roller if you're painting a very smooth surface that could show streaks or imperfections, such as wood, walls, or metal. You should also select a short nap if you're painting smooth drywall or a surface with light texture. For a single-use roller, use a foam roller instead of one with woven or fabric nap. The foam will apply the paint without leaving streaks or lint. Pick a ⁄4 to ⁄8 inch (0.64 to 0.95 cm) nap for medium-textured surfaces. A ⁄8 inch (0.95 cm) nap is a standard nap size, which makes it a good choice for most painting projects. If you're painting ceilings or interior walls, use this size since it will pick up more paint than a roller with a shorter nap and will fill in a slightly textured surface. If you're still unsure about which nap is right for your project, start with a ⁄8 inch (0.95 cm) nap. If the roller is picking up too much paint for the job, move down to a ⁄4 inch (0.64 cm) nap. Choose a 1 to 1 ⁄4 in (2.5 to 3.2 cm) nap if you're painting rough surfaces. A long nap is great for getting paint into the cracks or crevices of rough surfaces. Look for a 1 to 1 ⁄4 in (2.5 to 3.2 cm) nap roller if you're painting:\nBrick\nStucco\nMasonry\nTextured plaster Picking a Roller Material Select a foam roller if you're painting a smooth surface with high gloss paint. Very smooth surfaces can show streaks if you use a knit or woven roller. To apply paint without leaving lint or a bubbled texture, buy a foam roller. These are great for painting metal doors, cabinets, or trim. Because foam rollers don't last very well after using and washing them, most are considered to be single-use. Buy a synthetic or blended roller cover for latex or acrylic paints. Covers made from polyester, nylon, or dacron work well with any latex, acrylic, or oil-based paint. For a longer-lasting cover, choose one that's a blend of polyester and wool. The wool helps the roller pick up more paint while the polyester prevents the roller from wearing out quickly.Tip: Although you can use a blended cover for oil paint, it's fine to use a natural cover made from mohair or sheepskin. These are more expensive and can't be used with latex paint, but they apply oil paint well. Synthetic covers don't pick up as much paint as a wool cover, but they last a long time when cared for properly. Feel the roller and buy one that has a tight weave. Brush your fingers over the roller material and pay attention to how loose or fluffy it feels. The material should feel tightly woven if it's a well-made roller. Don't buy a roller that releases lint or fibers when you brush it since these will end up in your paint. Keep in mind that it's easier to clean and reuse higher-quality rollers since the roller material won't fall away from the roller as easily. Choosing a Roller Size Buy a 9 in (23 cm) roller for most of your painting projects. A 9 in (23 cm) roller is easier hold and use than a larger one. It's also the right size for paint trays, which makes loading the roller with paint much simpler. You can use a 9 in (23 cm) roller to paint most interior or exterior walls. You'll also have more choices for roller covers if you use a 9 in (23 cm) paint roller because it's the most common size. Choose a roller up to 18 inches (46 cm) in size for a very large project. If you need to paint a large surface area, such as a large room of smooth drywall, pick a roller that's up to 18 inches (46 cm) so you can apply a lot of paint very quickly. Keep in mind that holding a large roller can be tiring after a while. If you have a lot of large projects, consider using a paint sprayer instead. Use a 2 to 3 in (5.1 to 7.6 cm) roller if you'll be painting around windows or edges. It can be difficult to wedge a standard roller into a narrow space, so purchase a mini-roller. These are designed to easily paint along edges, around windows, and in tight spaces.Tip: You can buy special edge rollers made of foam. These are cut with an angle so you can run them along a straight edge to get a straight line. If you don't want to buy a separate roller for cutting in around frames, use a small paintbrush instead. Choose a matching roller frame that feels comfortable in your hand. If you're painting a large surface, such as the walls of a room, you'll want a roller that you can hold without straining your wrist. Pick up a roller frame and practice holding it as though you're painting. Don't buy the roller frame if it digs into your hand or is difficult to hold. If you'll be screwing the frame onto an extension pole, buy a frame that has threading on the bottom. Caring for Your Paint Roller Clean the roller immediately after finishing your project. Take a few minutes to wash your roller cover once you're done painting. This prevents the paint from drying between the fibers, which makes cleaning the roller more difficult. If you bought a cheap foam roller cover, you may not be able to wash it and use it again. Only wash the roller if you think it won't disintegrate. Use warm water to rinse latex or acrylic paint from the roller. Use a rubber spatula to scrape excess paint from the roller into the paint can or tray. This reduces the amount of paint that you're washing down the drain. Then, take the roller to a sink and run warm water over it. Gently massage the roller to loosen the paint. Keep rinsing until the water runs clear. Don't rinse oil-based paint in the sink since water won't remove the paint. Soak the roller in paint thinner before rinsing it if you used oil-based paint. You can't simply rinse the oil-based paint roller in the sink since it can damage your plumbing. Instead, fill a bucket with paint thinner and put the roller in it. Soak the roller for at least 2 or 3 hours. Then, lift the roller out of the paint thinner and rinse the roller under cold water until the water runs clear.Tip: Work in a well-ventilated space so you don't breathe in the fumes from the paint thinner. Open windows or work outside, for instance. You could also use mineral spirits instead of paint thinner since it will also remove the oil-based paint. Don't pour the paint thinner down the sink. Follow the manufacturer's disposal instructions. Spin the roller to help it dry faster. Slide your clean fingers down the length of the paint roller to remove excess water. If you have a roller spinning tool, slide it into the roller and pump the tool up and down. It will quickly rotate the roller so water spins out. If you don't have a spinner, put the roller cover on the frame and use your hand to spin the cover so water flies out. Dry the roller completely before storing it. Stand the roller upright so it dries evenly on all sides. Leave it at room temperature until it's completely dry. Then, slide the roller back into the package and store it flat until your next project. If you store the roller while it's still moist, the material can mildew or clump together.",
  "tyn_model":[
    "roller",
    "paint",
    "water",
    "paint thinner",
    "foam roller",
    "oil-based paint",
    "oil paint",
    "rollers",
    "paint roller",
    "roller frame",
    "foam",
    "foam rollers",
    "paints",
    "wool",
    "polyester",
    "roller material",
    "paint trays",
    "paint sprayer",
    "extension pole",
    "acrylic paint",
    "rubber spatula",
    "paint can",
    "oil-based paint roller",
    "bucket",
    "mineral spirits",
    "roller spinning",
    "spinner"
  ],
  "tyn_section":[

  ]
}