{
  "title":"How to Wrap Takeout Food",
  "url":"https://www.wikihow.com/Wrap-Takeout-Food",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Preservation Techniques"
  ],
  "methods":[
    {
      "name":"Choosing a Wrapping Material or Container",
      "steps":[
        {
          "headline":"Use parchment or wax paper to wrap regularly shaped solid foods tightly.",
          "description":"Parchment or wax paper is perfect for things like sandwiches, cookies, or other large solid foods. Wrap your food in the paper either by wrapping it like you would a present or rolling it up in the paper before securing it with tape. This ensures your food stays fresh. Rip off a piece of parchment paper or wax paper that’s large enough to cover all the edges of your food. If you need a wrapping material that's moisture-resistant, parchment paper is a great option."
        },
        {
          "headline":"Purchase beeswax food wraps for an eco-friendly option.",
          "description":"Not only are these easy to clean and reuse, but they fold easily and even stick, sealing your food so it stays fresh. Look for beeswax food wraps at your local home goods store or online, or consider making your own. Rinse the beeswax off with clean water and let it dry once you’re finished using it. Beeswax food wraps come in lots of different sizes and patterns."
        },
        {
          "headline":"Wrap your food in aluminum foil to make folding easy.",
          "description":"Aluminum foil is a great material for wrapping food that has been warmed or heated, and it's the best option for wrapping irregularly shaped foods. Since it folds so easily and stays in place, your food will remain secure in the foil and keep its shape. While foil is best for wrapping things like sandwiches or burritos, it can also be used to create a little pouch for foods like cereal, popcorn, or candies."
        },
        {
          "headline":"Place your food in a glass jar if it’s difficult to wrap.",
          "description":"Glass containers are a great eco-friendly option for foods that aren’t easily wrapped, such as cereals, nuts, fruit, or other loose foods. Choose a glass jar that has a tight lid to make sure your food stays as fresh as possible. Glass containers are the easiest to clean."
        },
        {
          "headline":"Opt for reusable plastic containers for a quick solution.",
          "description":"If you need to store food that can’t be wrapped or you just need a quick fix, place your food in a plastic container like tupperware. Place the lid on tightly to keep the food fresh and choose a container that fits your food snugly. It’s best not to have lots of open space in your container between the food and the lid, as this can cause the food to spoil faster and not stay as fresh. Check to be sure your plastic container is labeled as BPA-free so chemicals won't accidentally be leaking into your foods from the plastic."
        },
        {
          "headline":"Put foods in a resealable plastic bag for an on-the-go option.",
          "description":"This works best for foods like fruit, small snacks, or larger main dishes like leftover pizza or chicken. Choose a resealable plastic bag that's the right size for your food and seal it securely so it stays as fresh as possible.Try not to store your food in plastic bags for more than a couple days, as the chemicals in the plastic can leak into your food. Using plastic wrap is also an option, but it's not very eco-friendly."
        }
      ]
    },
    {
      "name":"Creating Different Wraps",
      "steps":[
        {
          "headline":"Use paper or foil to wrap a flat sandwich.",
          "description":"Rip off a rectangular piece of parchment paper or aluminum foil and place your sandwich in the middle. Pull the top and bottom edges up together and create a fold with them that's roughly 1 inch (2.5 cm) thick. Continue refolding the fold until it's flush against the sandwich. Form triangle creases with the 2 loose ends before tucking the ends under the sandwich to keep the wrapping in place. Use aluminum foil to help keep hot sandwiches, like grilled cheese, warm. If you used parchment paper or wax paper, consider cutting through the paper to slice your sandwich in half for easy eating."
        },
        {
          "headline":"Roll up your food in paper to store things like subs or wraps.",
          "description":"Rip off a piece of parchment paper or wax paper that’s 1.5 times longer than the sub or wrap. Set the food down diagonally on the paper near a corner and bring this corner up over the food. Holding the corner in place, begin rolling the food toward the other end of the paper, stopping to fold in the edges before you get to the very end. Use a piece of tape to keep the edge of the paper in place. This is also a great way to wrap burritos. Avoid heating up wax paper."
        },
        {
          "headline":"Create a pocket out of beeswax to store loose snacks or sandwiches.",
          "description":"Starting with a square piece of beeswax, fold it in half so it creates a triangle. With the longest edge facing you, fold the left corner two-thirds of the way across to the right side. Fold the right corner two-thirds of the way across to the left side before tucking this corner into the flap you’ve created. Place your food in the pocket and close it by bringing the top flap down securely."
        },
        {
          "headline":"Wrap your food in foil to create a versatile pouch.",
          "description":"Lay a piece of foil large enough for your item (or items) of food on the table—most times 12 inches (30 cm) of foil will work. Place your food in the center of the piece of foil and pull the 2 longest edges up together. Fold these edges to create a crease, and continue folding over the crease until it's flat against the food. Fold in the remaining 2 loose edges until they're tight as well.Since foil is so moldable, fold the edges in as close to the food as possible to create a tight pouch."
        }
      ]
    }
  ],
  "text":" Choosing a Wrapping Material or Container Use parchment or wax paper to wrap regularly shaped solid foods tightly. Parchment or wax paper is perfect for things like sandwiches, cookies, or other large solid foods. Wrap your food in the paper either by wrapping it like you would a present or rolling it up in the paper before securing it with tape. This ensures your food stays fresh. Rip off a piece of parchment paper or wax paper that’s large enough to cover all the edges of your food. If you need a wrapping material that's moisture-resistant, parchment paper is a great option. Purchase beeswax food wraps for an eco-friendly option. Not only are these easy to clean and reuse, but they fold easily and even stick, sealing your food so it stays fresh. Look for beeswax food wraps at your local home goods store or online, or consider making your own. Rinse the beeswax off with clean water and let it dry once you’re finished using it. Beeswax food wraps come in lots of different sizes and patterns. Wrap your food in aluminum foil to make folding easy. Aluminum foil is a great material for wrapping food that has been warmed or heated, and it's the best option for wrapping irregularly shaped foods. Since it folds so easily and stays in place, your food will remain secure in the foil and keep its shape. While foil is best for wrapping things like sandwiches or burritos, it can also be used to create a little pouch for foods like cereal, popcorn, or candies. Place your food in a glass jar if it’s difficult to wrap. Glass containers are a great eco-friendly option for foods that aren’t easily wrapped, such as cereals, nuts, fruit, or other loose foods. Choose a glass jar that has a tight lid to make sure your food stays as fresh as possible. Glass containers are the easiest to clean. Opt for reusable plastic containers for a quick solution. If you need to store food that can’t be wrapped or you just need a quick fix, place your food in a plastic container like tupperware. Place the lid on tightly to keep the food fresh and choose a container that fits your food snugly. It’s best not to have lots of open space in your container between the food and the lid, as this can cause the food to spoil faster and not stay as fresh. Check to be sure your plastic container is labeled as BPA-free so chemicals won't accidentally be leaking into your foods from the plastic. Put foods in a resealable plastic bag for an on-the-go option. This works best for foods like fruit, small snacks, or larger main dishes like leftover pizza or chicken. Choose a resealable plastic bag that's the right size for your food and seal it securely so it stays as fresh as possible.Try not to store your food in plastic bags for more than a couple days, as the chemicals in the plastic can leak into your food. Using plastic wrap is also an option, but it's not very eco-friendly. Creating Different Wraps Use paper or foil to wrap a flat sandwich. Rip off a rectangular piece of parchment paper or aluminum foil and place your sandwich in the middle. Pull the top and bottom edges up together and create a fold with them that's roughly 1 inch (2.5 cm) thick. Continue refolding the fold until it's flush against the sandwich. Form triangle creases with the 2 loose ends before tucking the ends under the sandwich to keep the wrapping in place. Use aluminum foil to help keep hot sandwiches, like grilled cheese, warm. If you used parchment paper or wax paper, consider cutting through the paper to slice your sandwich in half for easy eating. Roll up your food in paper to store things like subs or wraps. Rip off a piece of parchment paper or wax paper that’s 1.5 times longer than the sub or wrap. Set the food down diagonally on the paper near a corner and bring this corner up over the food. Holding the corner in place, begin rolling the food toward the other end of the paper, stopping to fold in the edges before you get to the very end. Use a piece of tape to keep the edge of the paper in place. This is also a great way to wrap burritos. Avoid heating up wax paper. Create a pocket out of beeswax to store loose snacks or sandwiches. Starting with a square piece of beeswax, fold it in half so it creates a triangle. With the longest edge facing you, fold the left corner two-thirds of the way across to the right side. Fold the right corner two-thirds of the way across to the left side before tucking this corner into the flap you’ve created. Place your food in the pocket and close it by bringing the top flap down securely. Wrap your food in foil to create a versatile pouch. Lay a piece of foil large enough for your item (or items) of food on the table—most times 12 inches (30 cm) of foil will work. Place your food in the center of the piece of foil and pull the 2 longest edges up together. Fold these edges to create a crease, and continue folding over the crease until it's flat against the food. Fold in the remaining 2 loose edges until they're tight as well.Since foil is so moldable, fold the edges in as close to the food as possible to create a tight pouch.",
  "tyn_model":[
    "foil",
    "parchment paper",
    "paper",
    "food",
    "wax paper",
    "aluminum foil",
    "parchment or wax paper",
    "tape",
    "beeswax food wraps",
    "beeswax",
    "water",
    "beeswax food",
    "fruit",
    "glass jar",
    "containers",
    "tupperware",
    "container",
    "resealable plastic bag",
    "plastic bags",
    "plastic wrap",
    "grilled cheese",
    "—most"
  ],
  "tyn_section":[

  ]
}