{
  "title":"How to Replace Tail Light Bulbs",
  "url":"https://www.wikihow.com/Replace-Tail-Light-Bulbs",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Light Bulbs"
  ],
  "parts":[
    {
      "name":"Removing the Old Bulb",
      "steps":[
        {
          "headline":"Open the trunk or tailgate of your vehicle.",
          "description":"Pull the trunk release button from the driver’s side of the vehicle to pop it open or pull the handle on your tailgate to drop it down so you can access the backside of your tail light assembly. Some vehicles have a button you can press on the trunk itself to pop it open. You may need to pull up on the tailgate when you pull on the handle in order to lower it."
        },
        {
          "headline":"Move the fabric liner or panel covering the backside of the tail light.",
          "description":"With your trunk open or your tailgate down, look inside your vehicle for a sturdy fabric liner or a plastic panel covering the backside of your tail light. Find the edge where the fabric or panel meets the plastic trim of your vehicle and use your hands to pull back the fabric or remove the panel to expose the backside of your tail light. Don’t completely remove a fabric so you can put it back under the trim once you’re finished. Some plastic panels may need to be completely removed, but will have small brackets that allow you to easily fit it back into place."
        },
        {
          "headline":"Pull out the entire light assembly if you can’t access the backside.",
          "description":"If your vehicle doesn’t have a fabric liner or panel that allows you to access the backside of your tail light, look for bolts or screws on the side of the lens covering the tail light. Use a screwdriver to remove the screws or a wrench to remove the bolts and gently slide out the whole light assembly so you don’t disconnect the wires attached to the backside of it. Place the fasteners in a plastic bag and set them aside so you can replace them later."
        },
        {
          "headline":"Grab the back of the light socket, turn it to the left, and slide it out.",
          "description":"On the backside of the tail light assembly you’ll see the back of the light socket with wires connected to it. Locate the socket holding the burned-out bulb and grip the rear of it. Rotate the socket to the left and pull it out of the backside of the light. Be careful not to stretch or pull out the wires connected to the sockets."
        },
        {
          "headline":"Press down on the bulb in the socket and then slide it out.",
          "description":"Gently grip the bulb by the metal part of the plug and depress it slightly into the socket to release it. Then, slide it out of the light socket. Some bulbs may require you to unscrew them to remove them from the socket.Warning: Don’t grip the bulb by the glass or you could break it, making it very difficult to remove."
        }
      ]
    },
    {
      "name":"Installing the New Bulb",
      "steps":[
        {
          "headline":"Put on a pair of nitrile gloves to keep from damaging the bulb.",
          "description":"Wear a pair of nitrile gloves to keep the natural oils on your hands from getting onto the bulb. When the bulb heats up from being used, the oils can damage it and cause it to burn out prematurely. You can find nitrile gloves at many department stores, auto parts stores, and online."
        },
        {
          "headline":"Slide a new version of the same type of bulb gently into the socket.",
          "description":"Choose a replacement bulb the same size and wattage as the old bulb. Check the terminals on the end of the bulbs to make sure they match. Line up the terminal at the end of the bulb with the plug in the socket and gently insert the new bulb into the socket until it clicks into place. Bring the old bulb with you to compare so you can be sure you get a matching bulb."
        },
        {
          "headline":"Replace the socket and turn it to the right to secure the bulb.",
          "description":"With the new bulb in the socket, put the socket back into the tail light assembly from the rear. Once it’s in place, turn it to the right until it clicks into place so it’s held securely. Gently wiggle the socket to make sure it’s held firmly in the assembly."
        },
        {
          "headline":"Put the fabric liner or the panel back into place over the back of the lens.",
          "description":"If you accessed the backside of your tail light through your trunk or tailgate, cover the rear of the tail light assembly with the fabric liner that you pulled back or reinstall the plastic panel where you removed it. If your panel has brackets to hold it in place, line them up with their connections on your vehicle and push the panel until you hear them snap into place. The fabric liner may need to be tucked back under the trim of your vehicle so it’s held securely."
        },
        {
          "headline":"Reattach the lamp assembly or cover and fasteners if you removed them.",
          "description":"If you had to pull out the entire assembly, slide it back into place from where you removed it. Replace the screws or bolts that you removed and tighten them well so your tail light is and secure. Make sure you replace all of the fasteners and tighten them fully so your tail light won’t be damaged by the movement of your vehicle."
        },
        {
          "headline":"Close the trunk or tailgate and start the vehicle to test the bulb.",
          "description":"Shut your trunk or raise your tailgate and pay close attention to make sure the bulb doesn’t fall out or rattle. Have a friend start your vehicle and press on the brake pedal so you can check the light to make sure it’s working. Then, with their foot on the brake or the e-brake engaged, have them put the vehicle into reverse to make sure all of the lights work. If you installed the bulb correctly but it still isn’t working, you may have a blown fuse or an electrical problem that needs to be inspected by a licensed mechanic.Tip: If the bulb falls out, you may not have plugged it into the socket properly. If it rattles, then double-check the fasteners to make sure they’re tight or check the socket to make sure you rotated it into place properly."
        }
      ]
    }
  ],
  "text":" Removing the Old Bulb Open the trunk or tailgate of your vehicle. Pull the trunk release button from the driver’s side of the vehicle to pop it open or pull the handle on your tailgate to drop it down so you can access the backside of your tail light assembly. Some vehicles have a button you can press on the trunk itself to pop it open. You may need to pull up on the tailgate when you pull on the handle in order to lower it. Move the fabric liner or panel covering the backside of the tail light. With your trunk open or your tailgate down, look inside your vehicle for a sturdy fabric liner or a plastic panel covering the backside of your tail light. Find the edge where the fabric or panel meets the plastic trim of your vehicle and use your hands to pull back the fabric or remove the panel to expose the backside of your tail light. Don’t completely remove a fabric so you can put it back under the trim once you’re finished. Some plastic panels may need to be completely removed, but will have small brackets that allow you to easily fit it back into place. Pull out the entire light assembly if you can’t access the backside. If your vehicle doesn’t have a fabric liner or panel that allows you to access the backside of your tail light, look for bolts or screws on the side of the lens covering the tail light. Use a screwdriver to remove the screws or a wrench to remove the bolts and gently slide out the whole light assembly so you don’t disconnect the wires attached to the backside of it. Place the fasteners in a plastic bag and set them aside so you can replace them later. Grab the back of the light socket, turn it to the left, and slide it out. On the backside of the tail light assembly you’ll see the back of the light socket with wires connected to it. Locate the socket holding the burned-out bulb and grip the rear of it. Rotate the socket to the left and pull it out of the backside of the light. Be careful not to stretch or pull out the wires connected to the sockets. Press down on the bulb in the socket and then slide it out. Gently grip the bulb by the metal part of the plug and depress it slightly into the socket to release it. Then, slide it out of the light socket. Some bulbs may require you to unscrew them to remove them from the socket.Warning: Don’t grip the bulb by the glass or you could break it, making it very difficult to remove. Installing the New Bulb Put on a pair of nitrile gloves to keep from damaging the bulb. Wear a pair of nitrile gloves to keep the natural oils on your hands from getting onto the bulb. When the bulb heats up from being used, the oils can damage it and cause it to burn out prematurely. You can find nitrile gloves at many department stores, auto parts stores, and online. Slide a new version of the same type of bulb gently into the socket. Choose a replacement bulb the same size and wattage as the old bulb. Check the terminals on the end of the bulbs to make sure they match. Line up the terminal at the end of the bulb with the plug in the socket and gently insert the new bulb into the socket until it clicks into place. Bring the old bulb with you to compare so you can be sure you get a matching bulb. Replace the socket and turn it to the right to secure the bulb. With the new bulb in the socket, put the socket back into the tail light assembly from the rear. Once it’s in place, turn it to the right until it clicks into place so it’s held securely. Gently wiggle the socket to make sure it’s held firmly in the assembly. Put the fabric liner or the panel back into place over the back of the lens. If you accessed the backside of your tail light through your trunk or tailgate, cover the rear of the tail light assembly with the fabric liner that you pulled back or reinstall the plastic panel where you removed it. If your panel has brackets to hold it in place, line them up with their connections on your vehicle and push the panel until you hear them snap into place. The fabric liner may need to be tucked back under the trim of your vehicle so it’s held securely. Reattach the lamp assembly or cover and fasteners if you removed them. If you had to pull out the entire assembly, slide it back into place from where you removed it. Replace the screws or bolts that you removed and tighten them well so your tail light is and secure. Make sure you replace all of the fasteners and tighten them fully so your tail light won’t be damaged by the movement of your vehicle. Close the trunk or tailgate and start the vehicle to test the bulb. Shut your trunk or raise your tailgate and pay close attention to make sure the bulb doesn’t fall out or rattle. Have a friend start your vehicle and press on the brake pedal so you can check the light to make sure it’s working. Then, with their foot on the brake or the e-brake engaged, have them put the vehicle into reverse to make sure all of the lights work. If you installed the bulb correctly but it still isn’t working, you may have a blown fuse or an electrical problem that needs to be inspected by a licensed mechanic.Tip: If the bulb falls out, you may not have plugged it into the socket properly. If it rattles, then double-check the fasteners to make sure they’re tight or check the socket to make sure you rotated it into place properly.",
  "tyn_model":[
    "bulb",
    "fabric liner",
    "socket",
    "fabric",
    "light socket",
    "nitrile gloves",
    "fasteners",
    "screws",
    "screwdriver",
    "wrench",
    "bulbs",
    "lamp"
  ],
  "tyn_section":[

  ]
}