{
  "title":"How to Finish off Basketry Work",
  "url":"https://www.wikihow.com/Finish-off-Basketry-Work",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Basketry Wicker and Rattan"
  ],
  "steps":[
    {
      "headline":"Cut off any excess ends of cane.",
      "description":"This part requires good balancing to ensure that they are not cut off too short or left too long. Use a sharp knife, clippers, or hand shears to perform this."
    },
    {
      "headline":"Singe the work.",
      "description":"Finished basketry work should be carefully singed to remove the thin fibers that tend to stick out after working with the cane. Do this using the tip of a Bunsen burner or small craft flame. Avoid using a wax taper such as a candle, as this will blacken the cane-work."
    },
    {
      "headline":"Wash the piece with warm water.",
      "description":"This will remove any dirt and improves the look of the basket. Do not use soap."
    },
    {
      "headline":"Ensure that the basketry work is fully dry before placing into storage.",
      "description":"If it isn't, it will discolor and it may attract mold or mildew growth."
    }
  ],
  "text":" Cut off any excess ends of cane. This part requires good balancing to ensure that they are not cut off too short or left too long. Use a sharp knife, clippers, or hand shears to perform this. Singe the work. Finished basketry work should be carefully singed to remove the thin fibers that tend to stick out after working with the cane. Do this using the tip of a Bunsen burner or small craft flame. Avoid using a wax taper such as a candle, as this will blacken the cane-work. Wash the piece with warm water. This will remove any dirt and improves the look of the basket. Do not use soap. Ensure that the basketry work is fully dry before placing into storage. If it isn't, it will discolor and it may attract mold or mildew growth.",
  "tyn_model":[
    "cane",
    "sharp knife",
    "bunsen burner",
    "small craft flame",
    "candle",
    "water",
    "soap",
    "basketry work"
  ],
  "tyn_section":[

  ]
}