{
  "title":"How to Store Candles",
  "url":"https://www.wikihow.com/Store-Candles",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Candles"
  ],
  "methods":[
    {
      "name":"Finding a Safe Storage Location",
      "steps":[
        {
          "headline":"Pick out a cool, dry place to store your candles.",
          "description":"Candles last longest when kept at low-to-moderate temperatures. For this reason, places like cupboards, closets, and dry basements tend to make the best storage locations. If you don’t have one of these spaces available in your home, try stashing them in a spare drawer (away from lighters and matches), or even under your bed. Ideally, your candles should remain at a temperature between 50 °F (10 °C) and 85 °F (29 °C) while they’re in storage. When bringing home a new haul or transporting your candles to another place, be careful not to leave them in your vehicle for too long, particularly if it’s hot outside.Warning: Never leave your candles near an open flame or source of direct heat, such as radiators, space heaters, or kitchen appliances, even temporarily."
        },
        {
          "headline":"Make sure your candles are off-limits to your kids or pets.",
          "description":"No matter where you decide to store your candles, take steps to guarantee that they won't find their way into the wrong hands (or paws). You might place them in a container with a locking lid, hide them, or perch them on a high shelf where they'll be safely out of reach. Some candles might look appetizing to curious young children and animals. It's also possible for older children to start accidental fires by lighting candles that have been stored with or near lighters or matches. Most candles are non-toxic. If ingested in large enough quantities, however, the wax used to make them can still pose significant health risks, such as intestinal blockage or allergic reaction."
        },
        {
          "headline":"Keep your candles out of direct sunlight.",
          "description":"Sunlight has a tendency to bleach dyed candles after a while, leaving them looking faded or discolored. Too many potent rays can also sap the fragrance from scented candles. It’s even possible for candles to partially melt if they’re left sitting in a poorly-positioned sunbeam. This also goes for other kinds of harsh light, such as desk lamps and spotlights."
        },
        {
          "headline":"Avoid freezing your candles in an effort to make them last longer.",
          "description":"There's little truth to the common myth that storing candles in the freezer causes them to burn slower. While it may seem like a good idea in theory, lowering the temperature of the wax only hardens it, which in turn can lead to cracking, splitting, or permanent changes in texture. Repeated freezing and thawing can also be hard on the wicks, which absorb small amounts of moisture between burns. It’s perfectly fine to stick a candle or two at the back of the fridge if you’re hard up for space elsewhere. The only time you should put a candle in the freezer is if you’re deliberately trying to break up the wax so you can reuse the jar for another purpose."
        }
      ]
    },
    {
      "name":"Choosing an Appropriate Container",
      "steps":[
        {
          "headline":"Use metal tins for maximum safety and protection.",
          "description":"Metal won’t let in moisture, rot, or catch fire accidentally. It’s also highly durable, which means there’s less chance of your candles getting smooshed if they happen to end up at the bottom of a pile of other stored items. You can buy metal storage boxes in a wide range of shapes, sizes, and styles online or at home goods stores, often for less than $10 per unit.Tip: Things like old toolboxes, lock boxes, empty coffee canisters, and cookie tins can easily be repurposed into thrifty, functional candle containers."
        },
        {
          "headline":"Grab a plastic storage container to take advantage of more sizing options.",
          "description":"The major benefit of these containers, aside from their ready availability and low price, is that they come in so many different sizes. This makes them ideal for managing even the most out-of-control candle collections. Plastic storage containers are also usually made of strong stuff, though they may be vulnerable to melting if the surrounding temperature gets too high. For added safety, double-up your storage security by placing your candles in a small container, then fitting that container inside a second, larger one."
        },
        {
          "headline":"Use a sturdy cardboard box if you don’t have a more suitable container.",
          "description":"Cardboard should generally be your last resort when it comes to storing candles and other flammable items. However, it’s alright to make do with an ordinary cardboard box, provided it’s in good condition and you have a cool, dry, dark spot to put it. Restaurants, bookstores, coffee shops, schools, and liquor stores can be great places to scavenge for free cardboard boxes. Shoeboxes offer a perfect balance of capacity and compactness—they can be used to hold a few large candles or lots of little ones."
        },
        {
          "headline":"Organize tea lights and votive candles in compartmentalized containers.",
          "description":"Boxes with built-in dividers are useful for keeping up with small candles that might otherwise become lost or end up in a chaotic jumble. Browse the storage solutions at your local home goods store or office supply center to find containers with compartments that are just the right size. If you’re looking for a more economical alternative, an old egg carton or ice cube tray can also serve the same function at no additional cost. This is also a good way to store wax melts, vent sticks, and other wax-based air fresheners."
        },
        {
          "headline":"Display a few of your overflow candles in a cabinet or case.",
          "description":"If you’ve accumulated so many candles over the years that you can’t get them all out of sight, consider showing them off instead. You might arrange them by size, shape, color, or container type, or use them to book-end other ornamental items like books or china. Putting your favorite candles on display when you’re not using them will also make you less likely to misplace them. Candles often work just as well as decorations as they do mood-enhancers."
        }
      ]
    },
    {
      "name":"Storing Various Types of Candles",
      "steps":[
        {
          "headline":"Put away candles in jars and tumblers as-is.",
          "description":"Since these sorts of candles come in their own containers, you don’t need to do anything special to store them. Just slip their lids on them and make some room for them in a cabinet or on an open shelf. You can even stack them to save space, so long as they’re not in danger of falling and breaking. If you want to keep your jar or tumbler candles together while also being able to tote them from place to place, group them side-by-side in a large box or basket. Mason jar lids can make excellent makeshift candle covers if you’ve lost some of your original lids."
        },
        {
          "headline":"Lay loose pillar candles flat to help them maintain their shape.",
          "description":"They’ll be less likely to warp, bend, or droop when supported from underneath. Arrange your candles in an even row at the bottom of their container. If you have enough to form more than one layer, stack them in an offset pattern so that they settle neatly in the gaps between the candles that make up the layer below. It’s especially important for your candles to be resting nice and flat if they’re in a place where they might experience drastic changes in temperature, or if you’re putting them away shortly after burning them. Votive, decorative, and scented candles that are missing their original containers also stack well."
        },
        {
          "headline":"Wrap taper candles with tissue paper to keep them from sticking together.",
          "description":"If you’re worried about your tapers fusing into one giant mass inside their storage container, roll each one up in a piece of tissue paper, then lay them all out in a single flat layer to store them. The tissue will provide a bit of a buffer between the tacky wax, making the candles easier to separate and remove later on. Keep in mind that tissue paper is itself flammable, so you’ll need to be extra careful about where and how you store your candles once you’ve wrapped them up. Avoid stacking or piling long taper candles. Since their shape makes them somewhat fragile, this can increase their chances of breaking.Tip: It may be better to wrap your candles in some kind of soft fabric if you’re worried about starting a fire. Naturally heat-resistant fabrics such as silk and wool are the safest choice. Synthetics like nylon and acrylic are also harder to ignite and tend to burn slower once they catch."
        },
        {
          "headline":"Seal scented candles inside plastic bags to keep them smelling fresh.",
          "description":"Opt for a bag with a zip or snap enclosure to ensure that no potentially-damaging air or moisture gets inside. If you don’t have either of these types of bags on hand, a large sheet of plastic wrap or parchment paper will be better than nothing. Just be sure to bind the candles tightly with rubber bands or tape after bundling them up. The longer scented candles stay exposed to air and environmental moisture, they faster they’ll dry out and lose their fragrance."
        }
      ]
    }
  ],
  "text":" Finding a Safe Storage Location Pick out a cool, dry place to store your candles. Candles last longest when kept at low-to-moderate temperatures. For this reason, places like cupboards, closets, and dry basements tend to make the best storage locations. If you don’t have one of these spaces available in your home, try stashing them in a spare drawer (away from lighters and matches), or even under your bed. Ideally, your candles should remain at a temperature between 50 °F (10 °C) and 85 °F (29 °C) while they’re in storage. When bringing home a new haul or transporting your candles to another place, be careful not to leave them in your vehicle for too long, particularly if it’s hot outside.Warning: Never leave your candles near an open flame or source of direct heat, such as radiators, space heaters, or kitchen appliances, even temporarily. Make sure your candles are off-limits to your kids or pets. No matter where you decide to store your candles, take steps to guarantee that they won't find their way into the wrong hands (or paws). You might place them in a container with a locking lid, hide them, or perch them on a high shelf where they'll be safely out of reach. Some candles might look appetizing to curious young children and animals. It's also possible for older children to start accidental fires by lighting candles that have been stored with or near lighters or matches. Most candles are non-toxic. If ingested in large enough quantities, however, the wax used to make them can still pose significant health risks, such as intestinal blockage or allergic reaction. Keep your candles out of direct sunlight. Sunlight has a tendency to bleach dyed candles after a while, leaving them looking faded or discolored. Too many potent rays can also sap the fragrance from scented candles. It’s even possible for candles to partially melt if they’re left sitting in a poorly-positioned sunbeam. This also goes for other kinds of harsh light, such as desk lamps and spotlights. Avoid freezing your candles in an effort to make them last longer. There's little truth to the common myth that storing candles in the freezer causes them to burn slower. While it may seem like a good idea in theory, lowering the temperature of the wax only hardens it, which in turn can lead to cracking, splitting, or permanent changes in texture. Repeated freezing and thawing can also be hard on the wicks, which absorb small amounts of moisture between burns. It’s perfectly fine to stick a candle or two at the back of the fridge if you’re hard up for space elsewhere. The only time you should put a candle in the freezer is if you’re deliberately trying to break up the wax so you can reuse the jar for another purpose. Choosing an Appropriate Container Use metal tins for maximum safety and protection. Metal won’t let in moisture, rot, or catch fire accidentally. It’s also highly durable, which means there’s less chance of your candles getting smooshed if they happen to end up at the bottom of a pile of other stored items. You can buy metal storage boxes in a wide range of shapes, sizes, and styles online or at home goods stores, often for less than $10 per unit.Tip: Things like old toolboxes, lock boxes, empty coffee canisters, and cookie tins can easily be repurposed into thrifty, functional candle containers. Grab a plastic storage container to take advantage of more sizing options. The major benefit of these containers, aside from their ready availability and low price, is that they come in so many different sizes. This makes them ideal for managing even the most out-of-control candle collections. Plastic storage containers are also usually made of strong stuff, though they may be vulnerable to melting if the surrounding temperature gets too high. For added safety, double-up your storage security by placing your candles in a small container, then fitting that container inside a second, larger one. Use a sturdy cardboard box if you don’t have a more suitable container. Cardboard should generally be your last resort when it comes to storing candles and other flammable items. However, it’s alright to make do with an ordinary cardboard box, provided it’s in good condition and you have a cool, dry, dark spot to put it. Restaurants, bookstores, coffee shops, schools, and liquor stores can be great places to scavenge for free cardboard boxes. Shoeboxes offer a perfect balance of capacity and compactness—they can be used to hold a few large candles or lots of little ones. Organize tea lights and votive candles in compartmentalized containers. Boxes with built-in dividers are useful for keeping up with small candles that might otherwise become lost or end up in a chaotic jumble. Browse the storage solutions at your local home goods store or office supply center to find containers with compartments that are just the right size. If you’re looking for a more economical alternative, an old egg carton or ice cube tray can also serve the same function at no additional cost. This is also a good way to store wax melts, vent sticks, and other wax-based air fresheners. Display a few of your overflow candles in a cabinet or case. If you’ve accumulated so many candles over the years that you can’t get them all out of sight, consider showing them off instead. You might arrange them by size, shape, color, or container type, or use them to book-end other ornamental items like books or china. Putting your favorite candles on display when you’re not using them will also make you less likely to misplace them. Candles often work just as well as decorations as they do mood-enhancers. Storing Various Types of Candles Put away candles in jars and tumblers as-is. Since these sorts of candles come in their own containers, you don’t need to do anything special to store them. Just slip their lids on them and make some room for them in a cabinet or on an open shelf. You can even stack them to save space, so long as they’re not in danger of falling and breaking. If you want to keep your jar or tumbler candles together while also being able to tote them from place to place, group them side-by-side in a large box or basket. Mason jar lids can make excellent makeshift candle covers if you’ve lost some of your original lids. Lay loose pillar candles flat to help them maintain their shape. They’ll be less likely to warp, bend, or droop when supported from underneath. Arrange your candles in an even row at the bottom of their container. If you have enough to form more than one layer, stack them in an offset pattern so that they settle neatly in the gaps between the candles that make up the layer below. It’s especially important for your candles to be resting nice and flat if they’re in a place where they might experience drastic changes in temperature, or if you’re putting them away shortly after burning them. Votive, decorative, and scented candles that are missing their original containers also stack well. Wrap taper candles with tissue paper to keep them from sticking together. If you’re worried about your tapers fusing into one giant mass inside their storage container, roll each one up in a piece of tissue paper, then lay them all out in a single flat layer to store them. The tissue will provide a bit of a buffer between the tacky wax, making the candles easier to separate and remove later on. Keep in mind that tissue paper is itself flammable, so you’ll need to be extra careful about where and how you store your candles once you’ve wrapped them up. Avoid stacking or piling long taper candles. Since their shape makes them somewhat fragile, this can increase their chances of breaking.Tip: It may be better to wrap your candles in some kind of soft fabric if you’re worried about starting a fire. Naturally heat-resistant fabrics such as silk and wool are the safest choice. Synthetics like nylon and acrylic are also harder to ignite and tend to burn slower once they catch. Seal scented candles inside plastic bags to keep them smelling fresh. Opt for a bag with a zip or snap enclosure to ensure that no potentially-damaging air or moisture gets inside. If you don’t have either of these types of bags on hand, a large sheet of plastic wrap or parchment paper will be better than nothing. Just be sure to bind the candles tightly with rubber bands or tape after bundling them up. The longer scented candles stay exposed to air and environmental moisture, they faster they’ll dry out and lose their fragrance.",
  "tyn_model":[
    "candles",
    "cardboard",
    "tissue paper",
    "lighters",
    "matches",
    "container",
    "freezer",
    "candle",
    "jar",
    "space heaters",
    "fridge",
    "tins",
    "metal",
    "home goods stores",
    "plastic storage container",
    "plastic storage containers",
    "shoeboxes",
    "—they",
    "tea lights",
    "votive candles",
    "containers",
    "ice cube tray",
    "wax melts",
    "air fresheners",
    "jars",
    "tumblers",
    "tumbler",
    "mason jar",
    "plastic bags",
    "plastic wrap",
    "parchment paper",
    "rubber bands"
  ],
  "tyn_section":[

  ]
}