{
  "title":"How to Turn Milk to Stone",
  "url":"https://www.wikihow.com/Turn-Milk-to-Stone",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts"
  ],
  "steps":[
    {
      "headline":"Measure a cup of nonfat milk into a pan (could make butter from raw whole-milk, then use the whey for this project) to experiment with and warm it until it is simmering; stir to avoid scorching; allow a little foaming around the edges.",
      "description":"Avoid excess foaming from overheating. Or, warm it in a bowl in a microwave simmering (start lower and add more time, up to about two minutes, as necessary depending on your microwave)."
    },
    {
      "headline":"Pour in 1 tablespoon of vinegar using measuring spoon, stir and wait for the reaction.",
      "description":"What is happening is that the acid in the vinegar (5% ascetic acid) is reacting with substances in the milk."
    },
    {
      "headline":"Add foil strips or other decorative material to the batch while stirring it.",
      "description":""
    },
    {
      "headline":"Add dye, for streaking it in the wet casein plastic (stone) or can dye surface later.",
      "description":"Or, stir in thoroughly for consistent coloring."
    },
    {
      "headline":"Cool it carefully to be comfortable to the touch: Avoid touching or splashing the material or container while it is hot.",
      "description":""
    },
    {
      "headline":"Strain slowly to separate the coagulated, curdled-milk/casein out of the liquid (milk-whey), using a colander (do not press into colander) or such.",
      "description":"Strain the liquid twice or more if needed (Use enough vinegar, or this would be edible cheese and whey, using just a few drops of non-toxic acidic materials)."
    },
    {
      "headline":"Dump the soggy casein onto paper or smooth kitchen toweling, or such (not terry cloth).",
      "description":"casein - ca·sein (kā'sēn', -sē-ĭn) n. A white, tasteless, odorless protein precipitated from cow's milk that is the basis of cheese \"and is used to make plastics, adhesives, paints, and foods\"."
    },
    {
      "headline":"Fold towel and blot excess liquid.",
      "description":"Squeeze gently."
    },
    {
      "headline":"Unfold, unwrap and place the curd on an appropriate paper/wax paper and place it to dry -- perhaps cover it with an open weave cloth to keep out dust and debris.",
      "description":""
    },
    {
      "headline":"Allow the plastic (casein) to dry for a few days.",
      "description":"This plastic is thermoset, not thermal, ie: will not dissolve due to heating."
    },
    {
      "headline":"Shape/Mold it by drying in some kind of form, such as a bottle cap, for its basic shape or dry it in sheets, rod form or in other forms.",
      "description":"It could be dried in the basic shape of jewelry and finished later. Dye the plastic surface by dipping or streaking it with dyes or dye could have been added in the making the wet casein plastic(s) and streak two or more colors, etc. : color throughout, in streaks or only absorbed into the dried stone. Work the material when dry: It tends to warp while drying. It is brittle, does not bend once dry. Re-shape and finish milk-stone: carving, etching, cutting, sanding, drilling, polishing, etc. to make your item. Make milk-stone crafts and products: buttons, jewelry, home, bathroom or office accessories."
    },
    {
      "headline":"Harden the plastic (optional) when dry by immersing it in formaldehyde and re-drying it.",
      "description":"This is a porous material so, it goes more than surface deep. This strengthens it, gives resistance to scratching and longer wear."
    },
    {
      "headline":"Caution: Use adequate ventilation as formaldehyde is a known carcinogenic substance; so do not breath its vapors, protect your skin, and eyes, etc.",
      "description":"If it is contacted, wash off affected area, ie: flush eyes for fifteen (15) minutes if splashed or contact is in eyes. If swallowed contact your medical authority for what to do, such as the Center for Poison Control for information."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Measure a cup of nonfat milk into a pan (could make butter from raw whole-milk, then use the whey for this project) to experiment with and warm it until it is simmering; stir to avoid scorching; allow a little foaming around the edges. Avoid excess foaming from overheating. Or, warm it in a bowl in a microwave simmering (start lower and add more time, up to about two minutes, as necessary depending on your microwave). Pour in 1 tablespoon of vinegar using measuring spoon, stir and wait for the reaction. What is happening is that the acid in the vinegar (5% ascetic acid) is reacting with substances in the milk. Add foil strips or other decorative material to the batch while stirring it.  Add dye, for streaking it in the wet casein plastic (stone) or can dye surface later. Or, stir in thoroughly for consistent coloring. Cool it carefully to be comfortable to the touch: Avoid touching or splashing the material or container while it is hot.  Strain slowly to separate the coagulated, curdled-milk/casein out of the liquid (milk-whey), using a colander (do not press into colander) or such. Strain the liquid twice or more if needed (Use enough vinegar, or this would be edible cheese and whey, using just a few drops of non-toxic acidic materials). Dump the soggy casein onto paper or smooth kitchen toweling, or such (not terry cloth). casein - ca·sein (kā'sēn', -sē-ĭn) n. A white, tasteless, odorless protein precipitated from cow's milk that is the basis of cheese \"and is used to make plastics, adhesives, paints, and foods\". Fold towel and blot excess liquid. Squeeze gently. Unfold, unwrap and place the curd on an appropriate paper/wax paper and place it to dry -- perhaps cover it with an open weave cloth to keep out dust and debris.  Allow the plastic (casein) to dry for a few days. This plastic is thermoset, not thermal, ie: will not dissolve due to heating. Shape/Mold it by drying in some kind of form, such as a bottle cap, for its basic shape or dry it in sheets, rod form or in other forms. It could be dried in the basic shape of jewelry and finished later. Dye the plastic surface by dipping or streaking it with dyes or dye could have been added in the making the wet casein plastic(s) and streak two or more colors, etc. : color throughout, in streaks or only absorbed into the dried stone. Work the material when dry: It tends to warp while drying. It is brittle, does not bend once dry. Re-shape and finish milk-stone: carving, etching, cutting, sanding, drilling, polishing, etc. to make your item. Make milk-stone crafts and products: buttons, jewelry, home, bathroom or office accessories. Harden the plastic (optional) when dry by immersing it in formaldehyde and re-drying it. This is a porous material so, it goes more than surface deep. This strengthens it, gives resistance to scratching and longer wear. Caution: Use adequate ventilation as formaldehyde is a known carcinogenic substance; so do not breath its vapors, protect your skin, and eyes, etc. If it is contacted, wash off affected area, ie: flush eyes for fifteen (15) minutes if splashed or contact is in eyes. If swallowed contact your medical authority for what to do, such as the Center for Poison Control for information. Finished. ",
  "tyn_model":[
    "plastic",
    "vinegar",
    "microwave",
    "casein",
    "colander",
    "milk-stone",
    "formaldehyde",
    "nonfat milk",
    "bowl",
    "measuring spoon",
    "ascetic acid",
    "milk",
    "foil",
    "dye",
    "casein plastic",
    "milk-whey",
    "whey",
    "terry cloth",
    "cow's milk",
    "cheese",
    "towel",
    "bottle cap",
    "casein plastic(s",
    "buttons"
  ],
  "tyn_section":[

  ]
}