{
  "title":"How to Wash Technical Clothing",
  "url":"https://www.wikihow.com/Wash-Technical-Clothing",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Cleaning Clothes"
  ],
  "methods":[
    {
      "name":"Using a Washing Machine",
      "steps":[
        {
          "headline":"Read the care instructions on the tag of the garment.",
          "description":"The garment's manufacturer knows what's best for the fabric, so refer to the care instructions for the best advice. Most technical clothing can be washed in the washing machine as long as you don’t use regular detergent or fabric softeners—a specialty outerwear detergent is best.For dark-colored clothing, check the tag to see if you should wash it inside out to keep the color from fading. You shouldn’t wash down jackets in a top-loading machine because the garment could snag and tear on the center agitator during the spin cycle. Note any icons on the tag: an image of a hand reaching into a bucket of water means hand-washing is recommended. Two dots mean warm water while 3 mean hot water. A small icon of a dryer (a square with a circle inside it) with an \"x\" through it means you shouldn't tumble-dry the garment."
        },
        {
          "headline":"Run your washing machine on an empty cycle to clean it.",
          "description":"Residue from fabric softeners or biological detergents can damage the fibers and coating on your outerwear, especially if it has a DWR (durable water repellent) coating. To prevent doing damage, run the rinse cycle with hot water to wash away any residue in the drum.If your washing machine has a detergent tray, make sure it’s clean and free of any liquid or powder detergent residue."
        },
        {
          "headline":"Empty all the pockets and close all the zippers and flaps.",
          "description":"Check all the pockets to make sure you're not accidentally washing other items along with your clothing (like snack crumbs). Zip up all the zippers and close all the flaps on the garment to help them keep their shape.If necessary, brush away any visible debris from the garment like stuck-on leaves, sand, and dirt. If your jacket has detachable pieces made of different materials like fur, remove those before washing it. You’ll need to clean fur attachments separately."
        },
        {
          "headline":"Pre-treat any stains or soiled areas with specialty detergent.",
          "description":"Rub a little of the detergent you’ll be using to wash the garment onto the stain. This should be specialty detergent made for outerwear—do not use regular detergent or fabric softeners. Let it sit for 10 to 15 minutes before rinsing the area with warm water and gently rubbing it with a damp cloth.Don’t the same spot-treating formulas you would use on regular clothing because the chemicals may cause discoloration or damage the fibers."
        },
        {
          "headline":"Place a maximum of 2 large or bulky garments into the machine.",
          "description":"If you're washing an extra-bulky outerwear jacket, wash it by itself to ensure the detergent and water can fully penetrate the clothing fibers. Smaller, thinner garments like base layers and thermal underwear can be washed in larger batches—just make sure the machine fills with enough water to cover all of the items.If you're using a compact washing machine (or any type that’s smaller than full-sized), only wash 1 garment at a time."
        },
        {
          "headline":"Pour 1 to 2 capfuls of specialty detergent into the machine's detergent drawer.",
          "description":"If you're washing 1 item, use 1 capful of specialty outerwear detergent or cleaner. For 2 items or 1 heavily soiled item, use 2 capfuls. If your machine doesn't have a detergent drawer, pour the solution directly into the drum with the garment and water.Check the manufacturer’s recommendations about which specialty detergent to use. You can buy detergent made for outerwear at most camping and outdoor gear superstores. If you plan to reproof the clothing later, consider using a 2-in-1 solution that will both wash and reproof your outerwear to save time and water."
        },
        {
          "headline":"Set the washer to a regular cycle wash using warm water.",
          "description":"A water temperature of around 86°F (30°C) will clean the garment without compromising the material. Avoid using hot water because it can cause the sealant tape around pockets and seams to melt, decreasing the garment’s longevity.If your dryer has a spin option, select the low spin option."
        },
        {
          "headline":"Do an extra rinse cycle to ensure the garment is free of detergent.",
          "description":"Set your washing machine to do an extra rinse to make sure all the detergent is out of the garment. Don’t reset the water temperature for the rinse—leave it on the warm setting.You can also fill a large tub with water and rinse it that way, submerging the garment gently pressing out any remaining soapy water."
        },
        {
          "headline":"Dry the garment according to the care instructions.",
          "description":"Some garments can be tumble dried while others can be laid flat or hung up to dry. Read the care instructions on the label or, if the label has worn off, look up the care instructions from the manufacturer’s website. If it can go in the dryer, use a low heat setting to avoid damaging the fibers.Some heavy-duty jackets with waterproof coating should be hang dried until just damp and then put in the dryer on low heat for 20 minutes to reactivate the coating."
        }
      ]
    },
    {
      "name":"Handwashing Down Jackets and Outerwear",
      "steps":[
        {
          "headline":"Fill a tub or sink with warm water and a capful of specialty detergent.",
          "description":"Fill the vessel with enough water to cover the entire article of clothing. For instance, you'll need at least 8 inches (20 cm) of water to completely submerge a puffer jacket. Pour in 1 capful of specialty outerwear detergent for 1 garment.If you need to wash 2 garments, wash them one at a time."
        },
        {
          "headline":"Place the garment in the water and push it down, flipping it as you push.",
          "description":"Use your hands to push the garment underwater section by section until it's fully submerged. Work in the suds with your hands as you push the jacket down.Make sure you've pressed the garment down from the front and back so the soapy water has worked its way through the whole thing."
        },
        {
          "headline":"Let the garment soak for 30 minutes or longer.",
          "description":"Allowing the garment to sit in the water will ensure the detergent reaches as many fibers as possible. Leave extra-soiled garments soaking for up to 60 minutes.If the inside of the garment is particularly smelly or soiled, turn it inside out before you let it soak."
        },
        {
          "headline":"Drain the tub or sink while pressing water out of the garment.",
          "description":"Lift the stopper on your tub or sink so the soapy water drains away. Press down on the garment with your hands to expel as much of the soapy water as possible.If you have one handy, use a large slotted laundry basket as a strainer."
        },
        {
          "headline":"Rinse the garment with clean warm water 4 to 6 times.",
          "description":"Refill the tub or sink with warm water and drain it again, pressing the water out in the process. You may need to repeat this up to 6 times or until the water runs clear.Don't twist or wring the garment because it could tear the fabric or distort the shape of the stuffing inside."
        },
        {
          "headline":"Transfer the jacket to a dryer or hanger according to the care instructions.",
          "description":"Check the care instructions on the label to see whether it's best to tumble dry or hang dry it. Be careful carrying the garment if it's made of down because the water will make it super heavy—cradle the entire jacket so the weight doesn't stretch or tear the fabric.If the jacket is made of down, avoid air-drying it because it can take a long time and result in mold and mildew."
        }
      ]
    },
    {
      "name":"Tumble-Drying Down Jackets",
      "steps":[
        {
          "headline":"Place the garment in the tumble dryer on low for 20 minutes, if possible.",
          "description":"If the care instructions suggest tumble-drying, put the garment in the dryer. Stay nearby because you’ll need to stay nearby to take the garment out and shape it every 20 minutes.Put 4 tennis balls into the dryer—these will help heavy down jackets keep their puffiness."
        },
        {
          "headline":"Remove the garment from the dryer and break up any internal clumps.",
          "description":"Take the garment out of the dryer and use your hands to fluff up the material, breaking up any clumps that may have formed inside of it. This is especially important for down jackets because clumping can change the structure of the jacket.Make sure to cover the entire garment, concentrating on any creases where inside material may have bunched up."
        },
        {
          "headline":"Repeat the drying and fluffing process at least 4 times until it’s dry.",
          "description":"Puffy jackets and outerwear are thick, so they’ll take much longer to dry than normal clothing items. You may need to repeat the drying-and-fluffing process 4 to 6 times until the garment is fully dry.The entire washing and drying process can take 3 to 4 hours total, so be patient."
        }
      ]
    },
    {
      "name":"Cleaning Athletic Wear",
      "steps":[
        {
          "headline":"Wash smelly gym clothes right away.",
          "description":"Don't toss your worn, stinky items in a hamper until laundry day because it'll make them smell worse and cause nearby clothing to stink as well. It may even lead to mold and mildew, which smells even worse!If you can't wash them right away or would rather wait until you have a full load of stinky workout gear, turn them inside out and put them on hangers. Hang the hangers outside or somewhere in your bathroom until the sweat is dry. Then you can toss them in your hamper until laundry day."
        },
        {
          "headline":"Pre-soak extra-stinky workout clothes in vinegar for 30 minutes.",
          "description":"Fill a large bowl or sink with 1 part vinegar and 5 parts water. For instance, if you're using a bowl that holds 5 cups (1,200 mL) of water, pour in 1 cup (240 mL) of white vinegar. Let them soak for 30 minutes.Note that you'll need to transfer the clothes into the washing machine after soaking, so make sure the machine is empty and ready to go. Feel free to skip this step if your athletic clothes aren't super soiled. You can always add vinegar to the rinse cycle later on."
        },
        {
          "headline":"Set your washing machine to cold or warm water.",
          "description":"Hot water may seem like the best option for cleaning sweaty clothes, but most active wear requires cold water due to the fabrics. Some garments made of cotton blends can be washed in warm water, but it’s best to use cold if you’re washing a load of workout clothes made from different materials.Spandex, polyester, rayon, linen shouldn’t be washed in hot (and sometimes warm) water because it can break down the fibers or shrink the garment."
        },
        {
          "headline":"Fill the detergent tray with regular detergent free of bleach or softeners.",
          "description":"Choose a detergent that doesn't have fabric softeners already in the formula because they'll lock in the smell and leave a residue on the clothing. If your washing machine doesn’t have a tray, pour the detergent into the drum along with the clothes.If you chose not to do a vinegar pre-soak, add some in during the rinse cycle for extra stink-cleaning power."
        },
        {
          "headline":"Dry athletic wear in a tumble dryer on low or no heat if possible.",
          "description":"Refer to the care instructions to see if you can tumble dry your workout gear. If so, set your dryer to the low heat or no heat setting.Use dryer balls to prevent static cling."
        },
        {
          "headline":"Hang dry athletic wear on a rack, hanger, or line.",
          "description":"Reshape the clothing and hang it on a hanger or drying rack to dry. Place the hanger or rack in a well-ventilated area to prevent dampening the air in the room. If possible, hang the clothes outside because the sun will help prevent the growth of bacteria within the clothing fibers.Thin workout clothes may only take 3 to 4 hours to fully dry. Heavier workout clothes intended for cold weather may take up to 1 or 2 days to fully hang-dry."
        }
      ]
    },
    {
      "name":"Reproofing Waterproof Outerwear",
      "steps":[
        {
          "headline":"Spray the entire surface of the dry garment with reproofing spray.",
          "description":"Hang the jacket on a hanger or clothesline and hold the spray bottle or canister 6 inches (15 cm) to 8 inches (20 cm) away. Spray the entire outer surface of the garment evenly.Always reproof a garment after you clean it; don’t reproof dirty outerwear."
        },
        {
          "headline":"Wipe away any excess proofing solution with a damp cloth.",
          "description":"Wiping the excess away will prevent any residue marks on the garment. It’s also necessary to wipe away as much as you can before adding a second layer of proofing spray if you choose to do so.A slightly damp rag or paper towel will do the trick."
        },
        {
          "headline":"Apply a second layer of proofer to high-contact areas.",
          "description":"Areas that are exposed to the elements the most can benefit from a second proofing layer. For jackets, this is the shoulders and elbow areas. For pants, the knees and butt area can benefit from a second proofing layer.Depending on what you’ll be doing in the garment you may want to double-spray other areas like the chest or back as well. If your garment’s waterproof layer has completely faded, go ahead and spray the entire jacket a second time."
        },
        {
          "headline":"Reshape the garment and let it air dry for air-cured proofers.",
          "description":"Check the care instructions on the proofing spray to see if it’s air-cured or heat-activated. If it’s air-cured, hang the item up to dry or lay it flat—refer to the care instructions on the label.If you’re hanging the garment, hang it outside or in a well-ventilated area."
        },
        {
          "headline":"Tumble-dry the garment on low heat for 20 minutes for heat-activated proofer.",
          "description":"Check the instructions on the proofing spray to see if it’s heat-activated. If so, set your dryer to low heat and let it dry for 15 minutes (or however long the instructions suggest).Toss 4 tennis balls into your dryer along with a down jacket to help the material stay fluffy. Too much heat can damage the seams around pockets and zippers, so be sure to use low heat. Only dry 1 garment at a time to minimize the drying time."
        }
      ]
    }
  ],
  "text":" Using a Washing Machine Read the care instructions on the tag of the garment. The garment's manufacturer knows what's best for the fabric, so refer to the care instructions for the best advice. Most technical clothing can be washed in the washing machine as long as you don’t use regular detergent or fabric softeners—a specialty outerwear detergent is best.For dark-colored clothing, check the tag to see if you should wash it inside out to keep the color from fading. You shouldn’t wash down jackets in a top-loading machine because the garment could snag and tear on the center agitator during the spin cycle. Note any icons on the tag: an image of a hand reaching into a bucket of water means hand-washing is recommended. Two dots mean warm water while 3 mean hot water. A small icon of a dryer (a square with a circle inside it) with an \"x\" through it means you shouldn't tumble-dry the garment. Run your washing machine on an empty cycle to clean it. Residue from fabric softeners or biological detergents can damage the fibers and coating on your outerwear, especially if it has a DWR (durable water repellent) coating. To prevent doing damage, run the rinse cycle with hot water to wash away any residue in the drum.If your washing machine has a detergent tray, make sure it’s clean and free of any liquid or powder detergent residue. Empty all the pockets and close all the zippers and flaps. Check all the pockets to make sure you're not accidentally washing other items along with your clothing (like snack crumbs). Zip up all the zippers and close all the flaps on the garment to help them keep their shape.If necessary, brush away any visible debris from the garment like stuck-on leaves, sand, and dirt. If your jacket has detachable pieces made of different materials like fur, remove those before washing it. You’ll need to clean fur attachments separately. Pre-treat any stains or soiled areas with specialty detergent. Rub a little of the detergent you’ll be using to wash the garment onto the stain. This should be specialty detergent made for outerwear—do not use regular detergent or fabric softeners. Let it sit for 10 to 15 minutes before rinsing the area with warm water and gently rubbing it with a damp cloth.Don’t the same spot-treating formulas you would use on regular clothing because the chemicals may cause discoloration or damage the fibers. Place a maximum of 2 large or bulky garments into the machine. If you're washing an extra-bulky outerwear jacket, wash it by itself to ensure the detergent and water can fully penetrate the clothing fibers. Smaller, thinner garments like base layers and thermal underwear can be washed in larger batches—just make sure the machine fills with enough water to cover all of the items.If you're using a compact washing machine (or any type that’s smaller than full-sized), only wash 1 garment at a time. Pour 1 to 2 capfuls of specialty detergent into the machine's detergent drawer. If you're washing 1 item, use 1 capful of specialty outerwear detergent or cleaner. For 2 items or 1 heavily soiled item, use 2 capfuls. If your machine doesn't have a detergent drawer, pour the solution directly into the drum with the garment and water.Check the manufacturer’s recommendations about which specialty detergent to use. You can buy detergent made for outerwear at most camping and outdoor gear superstores. If you plan to reproof the clothing later, consider using a 2-in-1 solution that will both wash and reproof your outerwear to save time and water. Set the washer to a regular cycle wash using warm water. A water temperature of around 86°F (30°C) will clean the garment without compromising the material. Avoid using hot water because it can cause the sealant tape around pockets and seams to melt, decreasing the garment’s longevity.If your dryer has a spin option, select the low spin option. Do an extra rinse cycle to ensure the garment is free of detergent. Set your washing machine to do an extra rinse to make sure all the detergent is out of the garment. Don’t reset the water temperature for the rinse—leave it on the warm setting.You can also fill a large tub with water and rinse it that way, submerging the garment gently pressing out any remaining soapy water. Dry the garment according to the care instructions. Some garments can be tumble dried while others can be laid flat or hung up to dry. Read the care instructions on the label or, if the label has worn off, look up the care instructions from the manufacturer’s website. If it can go in the dryer, use a low heat setting to avoid damaging the fibers.Some heavy-duty jackets with waterproof coating should be hang dried until just damp and then put in the dryer on low heat for 20 minutes to reactivate the coating. Handwashing Down Jackets and Outerwear Fill a tub or sink with warm water and a capful of specialty detergent. Fill the vessel with enough water to cover the entire article of clothing. For instance, you'll need at least 8 inches (20 cm) of water to completely submerge a puffer jacket. Pour in 1 capful of specialty outerwear detergent for 1 garment.If you need to wash 2 garments, wash them one at a time. Place the garment in the water and push it down, flipping it as you push. Use your hands to push the garment underwater section by section until it's fully submerged. Work in the suds with your hands as you push the jacket down.Make sure you've pressed the garment down from the front and back so the soapy water has worked its way through the whole thing. Let the garment soak for 30 minutes or longer. Allowing the garment to sit in the water will ensure the detergent reaches as many fibers as possible. Leave extra-soiled garments soaking for up to 60 minutes.If the inside of the garment is particularly smelly or soiled, turn it inside out before you let it soak. Drain the tub or sink while pressing water out of the garment. Lift the stopper on your tub or sink so the soapy water drains away. Press down on the garment with your hands to expel as much of the soapy water as possible.If you have one handy, use a large slotted laundry basket as a strainer. Rinse the garment with clean warm water 4 to 6 times. Refill the tub or sink with warm water and drain it again, pressing the water out in the process. You may need to repeat this up to 6 times or until the water runs clear.Don't twist or wring the garment because it could tear the fabric or distort the shape of the stuffing inside. Transfer the jacket to a dryer or hanger according to the care instructions. Check the care instructions on the label to see whether it's best to tumble dry or hang dry it. Be careful carrying the garment if it's made of down because the water will make it super heavy—cradle the entire jacket so the weight doesn't stretch or tear the fabric.If the jacket is made of down, avoid air-drying it because it can take a long time and result in mold and mildew. Tumble-Drying Down Jackets Place the garment in the tumble dryer on low for 20 minutes, if possible. If the care instructions suggest tumble-drying, put the garment in the dryer. Stay nearby because you’ll need to stay nearby to take the garment out and shape it every 20 minutes.Put 4 tennis balls into the dryer—these will help heavy down jackets keep their puffiness. Remove the garment from the dryer and break up any internal clumps. Take the garment out of the dryer and use your hands to fluff up the material, breaking up any clumps that may have formed inside of it. This is especially important for down jackets because clumping can change the structure of the jacket.Make sure to cover the entire garment, concentrating on any creases where inside material may have bunched up. Repeat the drying and fluffing process at least 4 times until it’s dry. Puffy jackets and outerwear are thick, so they’ll take much longer to dry than normal clothing items. You may need to repeat the drying-and-fluffing process 4 to 6 times until the garment is fully dry.The entire washing and drying process can take 3 to 4 hours total, so be patient. Cleaning Athletic Wear Wash smelly gym clothes right away. Don't toss your worn, stinky items in a hamper until laundry day because it'll make them smell worse and cause nearby clothing to stink as well. It may even lead to mold and mildew, which smells even worse!If you can't wash them right away or would rather wait until you have a full load of stinky workout gear, turn them inside out and put them on hangers. Hang the hangers outside or somewhere in your bathroom until the sweat is dry. Then you can toss them in your hamper until laundry day. Pre-soak extra-stinky workout clothes in vinegar for 30 minutes. Fill a large bowl or sink with 1 part vinegar and 5 parts water. For instance, if you're using a bowl that holds 5 cups (1,200 mL) of water, pour in 1 cup (240 mL) of white vinegar. Let them soak for 30 minutes.Note that you'll need to transfer the clothes into the washing machine after soaking, so make sure the machine is empty and ready to go. Feel free to skip this step if your athletic clothes aren't super soiled. You can always add vinegar to the rinse cycle later on. Set your washing machine to cold or warm water. Hot water may seem like the best option for cleaning sweaty clothes, but most active wear requires cold water due to the fabrics. Some garments made of cotton blends can be washed in warm water, but it’s best to use cold if you’re washing a load of workout clothes made from different materials.Spandex, polyester, rayon, linen shouldn’t be washed in hot (and sometimes warm) water because it can break down the fibers or shrink the garment. Fill the detergent tray with regular detergent free of bleach or softeners. Choose a detergent that doesn't have fabric softeners already in the formula because they'll lock in the smell and leave a residue on the clothing. If your washing machine doesn’t have a tray, pour the detergent into the drum along with the clothes.If you chose not to do a vinegar pre-soak, add some in during the rinse cycle for extra stink-cleaning power. Dry athletic wear in a tumble dryer on low or no heat if possible. Refer to the care instructions to see if you can tumble dry your workout gear. If so, set your dryer to the low heat or no heat setting.Use dryer balls to prevent static cling. Hang dry athletic wear on a rack, hanger, or line. Reshape the clothing and hang it on a hanger or drying rack to dry. Place the hanger or rack in a well-ventilated area to prevent dampening the air in the room. If possible, hang the clothes outside because the sun will help prevent the growth of bacteria within the clothing fibers.Thin workout clothes may only take 3 to 4 hours to fully dry. Heavier workout clothes intended for cold weather may take up to 1 or 2 days to fully hang-dry. Reproofing Waterproof Outerwear Spray the entire surface of the dry garment with reproofing spray. Hang the jacket on a hanger or clothesline and hold the spray bottle or canister 6 inches (15 cm) to 8 inches (20 cm) away. Spray the entire outer surface of the garment evenly.Always reproof a garment after you clean it; don’t reproof dirty outerwear. Wipe away any excess proofing solution with a damp cloth. Wiping the excess away will prevent any residue marks on the garment. It’s also necessary to wipe away as much as you can before adding a second layer of proofing spray if you choose to do so.A slightly damp rag or paper towel will do the trick. Apply a second layer of proofer to high-contact areas. Areas that are exposed to the elements the most can benefit from a second proofing layer. For jackets, this is the shoulders and elbow areas. For pants, the knees and butt area can benefit from a second proofing layer.Depending on what you’ll be doing in the garment you may want to double-spray other areas like the chest or back as well. If your garment’s waterproof layer has completely faded, go ahead and spray the entire jacket a second time. Reshape the garment and let it air dry for air-cured proofers. Check the care instructions on the proofing spray to see if it’s air-cured or heat-activated. If it’s air-cured, hang the item up to dry or lay it flat—refer to the care instructions on the label.If you’re hanging the garment, hang it outside or in a well-ventilated area. Tumble-dry the garment on low heat for 20 minutes for heat-activated proofer. Check the instructions on the proofing spray to see if it’s heat-activated. If so, set your dryer to low heat and let it dry for 15 minutes (or however long the instructions suggest).Toss 4 tennis balls into your dryer along with a down jacket to help the material stay fluffy. Too much heat can damage the seams around pockets and zippers, so be sure to use low heat. Only dry 1 garment at a time to minimize the drying time.",
  "tyn_model":[
    "water",
    "dryer",
    "detergent",
    "washing machine",
    "vinegar",
    "tub",
    "proofing spray",
    "regular detergent",
    "fabric softeners",
    "detergent tray",
    "jacket",
    "specialty detergent",
    "detergent drawer",
    "tumble dryer",
    "tennis balls",
    "—a",
    "bucket",
    "biological detergents",
    "—do",
    "fabric softeners.",
    "—just",
    "washer",
    "—leave",
    "heavy-duty jackets",
    "puffer jacket",
    "specialty outerwear detergent",
    "soapy water",
    "stopper",
    "strainer",
    "—cradle",
    "air-drying",
    "—these",
    "down jackets",
    "puffy jackets",
    "white vinegar",
    "dryer balls",
    "waterproof outerwear",
    "spray bottle",
    "paper towel",
    "proofer",
    "air-cured proofers",
    "—refer",
    "heat-activated proofer",
    "down jacket"
  ],
  "tyn_section":[

  ]
}