{
  "title":"How to Win a Chase on ROBLOX",
  "url":"https://www.wikihow.com/Win-a-Chase-on-ROBLOX",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games",
    "Roblox"
  ],
  "steps":[
    {
      "headline":"Be prepared for a chase.",
      "description":"Don't irritate somebody if you don't know whether they'll chase you. Chances are if you're prepared, you can combat them easily."
    },
    {
      "headline":"Jump.",
      "description":"When they try to run at you, just jump out of the way over on top of their head."
    },
    {
      "headline":"Attack.",
      "description":"If you have a weapon of your own, perform the jump step and then attack them from behind."
    },
    {
      "headline":"Kamikaze (only on build games).",
      "description":"Okay, this might not be considered winning, but it gets them off your back. Create a path using blocks you move and jump on it with them. While they try to attack you on it, quickly delete it and you both die."
    },
    {
      "headline":"Walling (only on build games).",
      "description":"Pick up a block and then create a small wall out of it to give you some time to escape their clutches."
    }
  ],
  "text":" Be prepared for a chase. Don't irritate somebody if you don't know whether they'll chase you. Chances are if you're prepared, you can combat them easily. Jump. When they try to run at you, just jump out of the way over on top of their head. Attack. If you have a weapon of your own, perform the jump step and then attack them from behind. Kamikaze (only on build games). Okay, this might not be considered winning, but it gets them off your back. Create a path using blocks you move and jump on it with them. While they try to attack you on it, quickly delete it and you both die. Walling (only on build games). Pick up a block and then create a small wall out of it to give you some time to escape their clutches.",
  "tyn_model":[
    "kamikaze",
    "blocks",
    "block"
  ],
  "tyn_section":[

  ]
}