{
  "title":"How to Dye Sand with Acrylic Paint",
  "url":"https://www.wikihow.com/Dye-Sand-with-Acrylic-Paint",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids"
  ],
  "parts":[
    {
      "name":"Mixing the Paint and Sand",
      "steps":[
        {
          "headline":"Separate equal amounts of white sand into a bowl for each color.",
          "description":"Place disposable bowls on the table, using a separate bowl for each color of sand you’d like to make. Pour sand into each bowl, making sure to only fill them up to three-quarters of the way full so you have room to stir. White craft sand is best to use because the color will show up more vibrantly, but regular tan sand will work as well. If you got your sand from outside, use a sifter to get rid of any pebbles or other chunks of dirt before dyeing the sand."
        },
        {
          "headline":"Pour 1 US tbsp (15 ml) of acrylic paint onto a pile of sand.",
          "description":"This measurement doesn’t need to be exact because you’ll likely have to add more paint after you’ve mixed it together with the sand. Pour a dollop of acrylic paint into the center of each sand pile, using a different paint color for each bowl of sand. Purchase acrylic paint from your local craft or big box store."
        },
        {
          "headline":"Add a spoonful of water to help with stirring.",
          "description":"This loosens up the paint and makes it easier to distribute the color evenly. Pour a spoonful of water into each bowl of sand, adding more later on if needed. If you’re not sure how much water your bowl of sand will need, start off with a small amount⁠—you can always add more."
        },
        {
          "headline":"Mix the paint and sand together using a spoon or fork.",
          "description":"Use a disposable spoon or fork to avoid getting paint on your regular kitchen utensils. Stir the paint, water, and sand together thoroughly, watching the paint blend in with the sand until the color is evenly spread out. Be patient while stirring, as it takes a little bit of time for the paint to be distributed evenly."
        },
        {
          "headline":"Continue adding more paint to the sand until you reach your desired shade.",
          "description":"If you stir your paint and sand together and it’s not as vibrant as you’d like, add another dollop of paint and mix it together again. Continue adding small amounts of paint until you’re pleased with the color. Create the other colors of sand using the same method. Feel free to add more water to the sand to help with the mixing."
        }
      ]
    },
    {
      "name":"Letting the Sand Dry",
      "steps":[
        {
          "headline":"Spread the sand out on a lined cookie sheet to dry overnight.",
          "description":"Once the paint and sand are fully mixed, line a baking sheet with foil or parchment paper. Gently pour a bowl of the painted sand out onto the parchment paper, spreading it out in an even layer using a spoon. Let the sand dry overnight so it’s ready to be used. Use a separate tray for each color of sand. If you don’t have enough trays for each bag of sand, spread a piece of parchment paper out on the counter and pour the sand directly onto this. As the sand dries, it will turn a slightly lighter color."
        },
        {
          "headline":"Bake the sand in the oven on low heat to dry it quickly.",
          "description":"Spread a sand color out on a baking sheet and put it in the oven on low heat. Check the sand every couple of minutes to see if it's dry yet and stir it around each time with a spoon so the heat is reaching all of the sand. If you're worried about getting paint on your baking sheet, line it with parchment paper first. Bake each color of sand separately to avoid mixing them together accidentally."
        },
        {
          "headline":"Use a spoon to loosen the chunks of sand so it’s smooth.",
          "description":"Press the back of a spoon onto the sand, loosening up any chunks that hardened while the sand dried and creating loose grains. You can also use your fingers to break up chunks of sand that are stuck together, if desired. Now your sand is ready to be used to fill vases or bottles or create other decorations!"
        },
        {
          "headline":"Store the painted sand in an air-tight container or bag.",
          "description":"Place each of your colors of sand in a different container to be sure they don't mix together. Pour them into a plastic container or resealable plastic bag, sealing them up securely so the sand doesn't leak out. If you can't see through your container, label the container with the color of sand so you know which one is which."
        }
      ]
    }
  ],
  "text":" Mixing the Paint and Sand Separate equal amounts of white sand into a bowl for each color. Place disposable bowls on the table, using a separate bowl for each color of sand you’d like to make. Pour sand into each bowl, making sure to only fill them up to three-quarters of the way full so you have room to stir. White craft sand is best to use because the color will show up more vibrantly, but regular tan sand will work as well. If you got your sand from outside, use a sifter to get rid of any pebbles or other chunks of dirt before dyeing the sand. Pour 1 US tbsp (15 ml) of acrylic paint onto a pile of sand. This measurement doesn’t need to be exact because you’ll likely have to add more paint after you’ve mixed it together with the sand. Pour a dollop of acrylic paint into the center of each sand pile, using a different paint color for each bowl of sand. Purchase acrylic paint from your local craft or big box store. Add a spoonful of water to help with stirring. This loosens up the paint and makes it easier to distribute the color evenly. Pour a spoonful of water into each bowl of sand, adding more later on if needed. If you’re not sure how much water your bowl of sand will need, start off with a small amount⁠—you can always add more. Mix the paint and sand together using a spoon or fork. Use a disposable spoon or fork to avoid getting paint on your regular kitchen utensils. Stir the paint, water, and sand together thoroughly, watching the paint blend in with the sand until the color is evenly spread out. Be patient while stirring, as it takes a little bit of time for the paint to be distributed evenly. Continue adding more paint to the sand until you reach your desired shade. If you stir your paint and sand together and it’s not as vibrant as you’d like, add another dollop of paint and mix it together again. Continue adding small amounts of paint until you’re pleased with the color. Create the other colors of sand using the same method. Feel free to add more water to the sand to help with the mixing. Letting the Sand Dry Spread the sand out on a lined cookie sheet to dry overnight. Once the paint and sand are fully mixed, line a baking sheet with foil or parchment paper. Gently pour a bowl of the painted sand out onto the parchment paper, spreading it out in an even layer using a spoon. Let the sand dry overnight so it’s ready to be used. Use a separate tray for each color of sand. If you don’t have enough trays for each bag of sand, spread a piece of parchment paper out on the counter and pour the sand directly onto this. As the sand dries, it will turn a slightly lighter color. Bake the sand in the oven on low heat to dry it quickly. Spread a sand color out on a baking sheet and put it in the oven on low heat. Check the sand every couple of minutes to see if it's dry yet and stir it around each time with a spoon so the heat is reaching all of the sand. If you're worried about getting paint on your baking sheet, line it with parchment paper first. Bake each color of sand separately to avoid mixing them together accidentally. Use a spoon to loosen the chunks of sand so it’s smooth. Press the back of a spoon onto the sand, loosening up any chunks that hardened while the sand dried and creating loose grains. You can also use your fingers to break up chunks of sand that are stuck together, if desired. Now your sand is ready to be used to fill vases or bottles or create other decorations! Store the painted sand in an air-tight container or bag. Place each of your colors of sand in a different container to be sure they don't mix together. Pour them into a plastic container or resealable plastic bag, sealing them up securely so the sand doesn't leak out. If you can't see through your container, label the container with the color of sand so you know which one is which.",
  "tyn_model":[
    "sand",
    "paint",
    "spoon",
    "water",
    "parchment paper",
    "acrylic paint",
    "baking sheet",
    "bowl",
    "oven",
    "white sand",
    "bowls",
    "white craft sand",
    "sifter",
    "cookie sheet",
    "foil",
    "air-tight container",
    "plastic container",
    "resealable plastic bag"
  ],
  "tyn_section":[

  ]
}