{
  "title":"How to Install Running Lights",
  "url":"https://www.wikihow.com/Install-Running-Lights",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Hanging Lights"
  ],
  "parts":[
    {
      "name":"Mounting the Lights and Control Box",
      "steps":[
        {
          "headline":"Mark the screw locations for the brackets with a pencil.",
          "description":"Universal-mount DRL kits use 2 LED light bars that clip into separate mounting brackets. Hold a bracket (without the light bar installed) against the vehicle body where you want it placed, stick a pencil through the pre-drilled screw holes to mark the locations, and repeat with the other bracket. Your DRL will look better if you take the time to use a tape measure and pencil to mark off a pair of symmetrical locations (typically beneath and slightly in from the headlights) for the brackets. Government vehicle safety regulations where you live may require that DRLs be a certain height off the ground, a certain distance from the outer edges of the car, and/or at a certain angle vis-a-vis the front headlights. The instructions provided in this article are generally applicable, but most specifically related to one of the most popular DRL kits—the Philips LED Daylight 8 kit. Always follow your specific product’s instructions when installing running lights."
        },
        {
          "headline":"Screw the brackets securely into the auto body.",
          "description":"Line up the screw holes in one of the brackets over the pencil marks you made, then use an electric screwdriver to drive the 2 provided screws through the holes and into the body material of the vehicle. Do the same with the other bracket. Alternatively, use a power drill to create holes in the auto body at the pencil marks, then place the bracket over the holes and drive the screws in place with a manual screwdriver. Another option is to skip using the mounting bracket altogether and instead secure the light bar itself directly to the auto body using outdoor-rated, heavy-duty, double-sided tape. This might be an option if you’re putting the lights beneath the overhang of an air intake grille, for instance."
        },
        {
          "headline":"Screw, zip tie, or tape the kit's control box near the vehicle’s battery.",
          "description":"No matter the brand, your kit should come with a small (usually black) control box with at least 5 wires protruding from it. This is the “nerve center” of the kit and should be placed near the vehicle’s battery. Use screws, zip ties, or mounting tape (one or more of which should be provided in the kit) to stick the box near the battery, but away from heat sources within the engine compartment. For instance, look for a spot along the perimeter of the engine bay that’s within about 1 ft (30 cm) of the vehicle battery."
        },
        {
          "headline":"Feed the wires from the light bars into the engine compartment.",
          "description":"Grasp the wire coming from the back of one of the LED light bars and fish it through the back of the bracket and into the closest grille or other entry point into the engine bay. Work the wire up and out of the top front of the engine bay for the time being, then repeat the process with the other light bar’s wire. In some cases, you may need to remove and then reinstall the vehicle’s front grille in order to get the wires into the engine bay. The grille is usually attached with several screws, but check your owner’s manual for specific guidance."
        },
        {
          "headline":"Clip the LED light bars into the brackets.",
          "description":"With most brands, this simply involves pressing a light bar straight into the bracket until you hear a snap. Now that the actual lights are in place, turn your focus to wiring everything correctly!"
        }
      ]
    },
    {
      "name":"Wiring the Lights, Box, and Battery",
      "steps":[
        {
          "headline":"Plug the wires from the light bars into the labeled wires from the box.",
          "description":"2 of the wires coming from the control box will (with most brands) have clear plastic plugs that snap together with the coordinating plugs at the ends of the wires coming from the LED light bars. After making the connections, use zip ties to secure the wires along the perimeter of the engine bay, away from any moving parts or heat sources. Refer to your product guide to confirm that you’re making the correct connections."
        },
        {
          "headline":"Remove the cable from the negative terminal of the vehicle battery.",
          "description":"Use a socket wrench or crescent wrench to loosen the nut that holds the thick cable against the negative (black) battery terminal, pull or lift the cable free of the terminal, and lay it aside. Then, loosen the nut holding the other thick cable to the positive (red) battery terminal, but leave the cable in place. Disconnecting the negative terminal cable is a safety measure to reduce your risk of getting an unwanted shock."
        },
        {
          "headline":"Attach the box's red and black wires to the same-color battery terminals.",
          "description":"Identify the red and black wires coming from the control box that have what look like 2-pronged metal forks at their ends. Slide the prongs on the red wire over the battery’s red, positive (+) terminal, then tighten the nut to secure both the red wire and the thick cable in place. Slide the prongs of the black wire over the black, negative (-) terminal, put the thick cable back in place, and tighten the nut over both of them. Some brands may not have the 2-pronged forks at the ends of the wires. Refer to your product guide for specific instructions."
        }
      ]
    },
    {
      "name":"Connecting to the Side or Marker Lights",
      "steps":[
        {
          "headline":"Identify the positive wire for the battery-side marker or side light.",
          "description":"Side lights are usually located to the inside of the headlights, while marker lights are typically to the outside. Find the side or marker light on the same side of the vehicle as the battery, then find the wires coming from it into the engine bay. Use your owner's manual to determine which wire is the positive wire. Temporarily mark it with a piece of tape if you wish. Depending on the make and model of your vehicle and the automotive lighting requirements where you live, your vehicle may have side lights, marker lights, or both sets of lights. These lights illuminate when the engine is on but the headlights are off, and shut off when the headlights are on. The goal here is to connect your running lights to one of these lights so that they also illuminate and turn off at the same time. It may be a requirement where you live for the running lights to turn off when the headlights are on. If it isn’t, and you don’t mind the running lights being on whenever the engine is running, you can skip this entire section."
        },
        {
          "headline":"Intersect the labeled wire from the box with the positive wire you found.",
          "description":"There should be one wire remaining (often orange in color) coming from the DRL kit’s control box. Run it around the perimeter of the engine compartment until it meets with the positive wire for the battery-side marker or side light. This is where you will connect the 2 wires with a T-tap connector, which should come with your kit. If not, buy one at an auto supply store."
        },
        {
          "headline":"Clamp one piece of the T-tap over the positive wire you identified.",
          "description":"T-tap connectors separate into 2 parts—one each for the horizontal (top) and vertical (bottom) sections of a capital T. Open the top section, lay the positive wire into the channel, and snap the top section closed firmly over the wire. Follow the specific instructions for your DRL kit or the T-tap you purchased separately when making this connection."
        },
        {
          "headline":"Clamp the control box wire and plug the 2 T-tap sections together.",
          "description":"Lift open the bottom section of the T-tap, lay the wire coming from the control box in the channel, and snap the bottom section shut. Then, plug the 2 sections of the T-tap together. The positive wire and the control box wire are now safely connected. Use zip ties to secure the excess control box wire to the perimeter of the engine compartment, away from any moving parts or heat sources."
        },
        {
          "headline":"Close the hood, start the engine, and test your new running lights.",
          "description":"If you start up the engine and keep the headlights off, the DRL should illuminate immediately. When you turn on the headlights, the DRL should turn off within 2-3 seconds. When you shut the engine off, the DRL should turn off within 15-20 seconds. If the lights are not working properly, check back over your work according to the product instructions. If you still can’t figure out the problem, take your vehicle to a licensed mechanic for assistance."
        }
      ]
    }
  ],
  "text":" Mounting the Lights and Control Box Mark the screw locations for the brackets with a pencil. Universal-mount DRL kits use 2 LED light bars that clip into separate mounting brackets. Hold a bracket (without the light bar installed) against the vehicle body where you want it placed, stick a pencil through the pre-drilled screw holes to mark the locations, and repeat with the other bracket. Your DRL will look better if you take the time to use a tape measure and pencil to mark off a pair of symmetrical locations (typically beneath and slightly in from the headlights) for the brackets. Government vehicle safety regulations where you live may require that DRLs be a certain height off the ground, a certain distance from the outer edges of the car, and/or at a certain angle vis-a-vis the front headlights. The instructions provided in this article are generally applicable, but most specifically related to one of the most popular DRL kits—the Philips LED Daylight 8 kit. Always follow your specific product’s instructions when installing running lights. Screw the brackets securely into the auto body. Line up the screw holes in one of the brackets over the pencil marks you made, then use an electric screwdriver to drive the 2 provided screws through the holes and into the body material of the vehicle. Do the same with the other bracket. Alternatively, use a power drill to create holes in the auto body at the pencil marks, then place the bracket over the holes and drive the screws in place with a manual screwdriver. Another option is to skip using the mounting bracket altogether and instead secure the light bar itself directly to the auto body using outdoor-rated, heavy-duty, double-sided tape. This might be an option if you’re putting the lights beneath the overhang of an air intake grille, for instance. Screw, zip tie, or tape the kit's control box near the vehicle’s battery. No matter the brand, your kit should come with a small (usually black) control box with at least 5 wires protruding from it. This is the “nerve center” of the kit and should be placed near the vehicle’s battery. Use screws, zip ties, or mounting tape (one or more of which should be provided in the kit) to stick the box near the battery, but away from heat sources within the engine compartment. For instance, look for a spot along the perimeter of the engine bay that’s within about 1 ft (30 cm) of the vehicle battery. Feed the wires from the light bars into the engine compartment. Grasp the wire coming from the back of one of the LED light bars and fish it through the back of the bracket and into the closest grille or other entry point into the engine bay. Work the wire up and out of the top front of the engine bay for the time being, then repeat the process with the other light bar’s wire. In some cases, you may need to remove and then reinstall the vehicle’s front grille in order to get the wires into the engine bay. The grille is usually attached with several screws, but check your owner’s manual for specific guidance. Clip the LED light bars into the brackets. With most brands, this simply involves pressing a light bar straight into the bracket until you hear a snap. Now that the actual lights are in place, turn your focus to wiring everything correctly! Wiring the Lights, Box, and Battery Plug the wires from the light bars into the labeled wires from the box. 2 of the wires coming from the control box will (with most brands) have clear plastic plugs that snap together with the coordinating plugs at the ends of the wires coming from the LED light bars. After making the connections, use zip ties to secure the wires along the perimeter of the engine bay, away from any moving parts or heat sources. Refer to your product guide to confirm that you’re making the correct connections. Remove the cable from the negative terminal of the vehicle battery. Use a socket wrench or crescent wrench to loosen the nut that holds the thick cable against the negative (black) battery terminal, pull or lift the cable free of the terminal, and lay it aside. Then, loosen the nut holding the other thick cable to the positive (red) battery terminal, but leave the cable in place. Disconnecting the negative terminal cable is a safety measure to reduce your risk of getting an unwanted shock. Attach the box's red and black wires to the same-color battery terminals. Identify the red and black wires coming from the control box that have what look like 2-pronged metal forks at their ends. Slide the prongs on the red wire over the battery’s red, positive (+) terminal, then tighten the nut to secure both the red wire and the thick cable in place. Slide the prongs of the black wire over the black, negative (-) terminal, put the thick cable back in place, and tighten the nut over both of them. Some brands may not have the 2-pronged forks at the ends of the wires. Refer to your product guide for specific instructions. Connecting to the Side or Marker Lights Identify the positive wire for the battery-side marker or side light. Side lights are usually located to the inside of the headlights, while marker lights are typically to the outside. Find the side or marker light on the same side of the vehicle as the battery, then find the wires coming from it into the engine bay. Use your owner's manual to determine which wire is the positive wire. Temporarily mark it with a piece of tape if you wish. Depending on the make and model of your vehicle and the automotive lighting requirements where you live, your vehicle may have side lights, marker lights, or both sets of lights. These lights illuminate when the engine is on but the headlights are off, and shut off when the headlights are on. The goal here is to connect your running lights to one of these lights so that they also illuminate and turn off at the same time. It may be a requirement where you live for the running lights to turn off when the headlights are on. If it isn’t, and you don’t mind the running lights being on whenever the engine is running, you can skip this entire section. Intersect the labeled wire from the box with the positive wire you found. There should be one wire remaining (often orange in color) coming from the DRL kit’s control box. Run it around the perimeter of the engine compartment until it meets with the positive wire for the battery-side marker or side light. This is where you will connect the 2 wires with a T-tap connector, which should come with your kit. If not, buy one at an auto supply store. Clamp one piece of the T-tap over the positive wire you identified. T-tap connectors separate into 2 parts—one each for the horizontal (top) and vertical (bottom) sections of a capital T. Open the top section, lay the positive wire into the channel, and snap the top section closed firmly over the wire. Follow the specific instructions for your DRL kit or the T-tap you purchased separately when making this connection. Clamp the control box wire and plug the 2 T-tap sections together. Lift open the bottom section of the T-tap, lay the wire coming from the control box in the channel, and snap the bottom section shut. Then, plug the 2 sections of the T-tap together. The positive wire and the control box wire are now safely connected. Use zip ties to secure the excess control box wire to the perimeter of the engine compartment, away from any moving parts or heat sources. Close the hood, start the engine, and test your new running lights. If you start up the engine and keep the headlights off, the DRL should illuminate immediately. When you turn on the headlights, the DRL should turn off within 2-3 seconds. When you shut the engine off, the DRL should turn off within 15-20 seconds. If the lights are not working properly, check back over your work according to the product instructions. If you still can’t figure out the problem, take your vehicle to a licensed mechanic for assistance.",
  "tyn_model":[
    "pencil",
    "tape",
    "zip ties",
    "t-tap",
    "control box wire",
    "screws",
    "bracket",
    "nut",
    "drl kit",
    "wire",
    "drl kits",
    "tape measure",
    "—the",
    "brackets",
    "electric screwdriver",
    "power drill",
    "screwdriver",
    "“nerve",
    "” of",
    "mounting tape",
    "socket wrench",
    "forks",
    "automotive lighting requirements",
    "t-tap connector",
    "connectors",
    "—one",
    "running lights"
  ],
  "tyn_section":[

  ]
}