{
  "title":"How to Try THC for Pain",
  "url":"https://www.wikihow.com/Try-THC-for-Pain",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Seeking Medical Advice",
      "steps":[
        {
          "headline":"Make an appointment to see your doctor if you’re in pain.",
          "description":"There are many different causes of chronic pain, but it’s important to diagnose the cause before trying to treat it. If you have not yet seen a doctor about your pain, make an appointment. Let them know what your symptoms are and tell them that you’re considering using THC to control pain. Keep in mind that some doctors are for using medical marijuana while others are against it. Either way, be open and honest with your doctor about your interest in trying THC."
        },
        {
          "headline":"Identify whether you may qualify for medical marijuana.",
          "description":"Certain painful medical conditions have been shown to benefit from medical marijuana. Your doctor may be willing to prescribe a THC medication or other product if you have one of these conditions. These include:\nAmyotrophic lateral sclerosis (ALS)\nMultiple sclerosis\nCancer\nHIV/AIDS\nCrohn’s disease\nSevere or chronic pain"
        },
        {
          "headline":"Tell your doctor about any medications you take.",
          "description":"THC may have adverse reactions with many different types of medications, although not all of these interactions are known. These reactions vary from one medication to another, but may include causing the medication to have a stronger effect or negating its effects altogether. Let your doctor know what prescription and over-the-counter medicines you take regularly. Medications that may interact with THC include, but are not limited to:\nBlood thinners, such as warfarin\nAntidepressants\nAnalgesics\nAnticonvulsants"
        },
        {
          "headline":"Consider the potential side effects of using THC.",
          "description":"Even though THC is natural, it can still cause negative side effects. Be on the lookout for these if you decide to try THC. If you experience any of these side effects, stop using THC immediately. Side effects may include:\nDizziness\nDifficulty concentrating and remembering things\nHallucinations\nIncreased appetite\nIncreased heart rate\nSlowed reaction time\nVomiting repeatedly Warning: In some instances, THC may make pain seem worse."
        },
        {
          "headline":"Avoid THC if you are at risk of having a heart attack or stroke.",
          "description":"Using THC increases the risk of having a heart attack or stroke. If you’re already at risk, such as from high blood pressure, heart disease, or a previous heart attack or stroke, do not use THC. Check with your doctor if you’re not sure if you’re at risk."
        }
      ]
    },
    {
      "name":"Choosing a THC Delivery Method",
      "steps":[
        {
          "headline":"Smoke or inhale THC with a vaporizer for fast pain relief.",
          "description":"Smoking or inhaling with a vaporizer offers the fastest pain relief. You can purchase a pipe, cigarette papers, or a bong to smoke buds and leaves, or you can purchase a vaporizer to smoke THC oil. Using THC in this way will allow you to get the fastest possible pain relief as the THC goes from your lungs to your blood stream. You may even feel the effects immediately, but they will only last for 2-3 hours. If you don’t experience pain relief within 5-10 minutes after your first hit, try taking another."
        },
        {
          "headline":"Consume THC in food or pill form for long-lasting effects.",
          "description":"Consuming THC in food, beverages, or pill form will take between 30 minutes and 2 hours to take effect because it must go through your digestive system to get into your blood stream. However, some people prefer this option because you do not have to inhale the THC via smoke or vapor. You can easily eat a THC product or swallow a pill, and the effects will last up to 12 hours."
        },
        {
          "headline":"Place THC tincture under your tongue for faster absorption.",
          "description":"Open your mouth, lift your tongue, and dispense the desired dose onto the floor of your mouth. Don’t swallow the dose. Allow it to sit under your tongue and absorb. This will allow the THC to get into your blood stream. Taking THC sublingually should produce pain relieving effects in about 15-30 minutes and can last between 8-12 hours."
        },
        {
          "headline":"Rub THC oil or lotion on your skin for fast, local pain relief.",
          "description":"This might be a good option if your pain is local and mild to moderate, such as from arthritis or muscle strain. Rubbing THC lotion or oil on your skin will work within 15-30 minutes, but it will only relieve pain in the area where you apply it."
        },
        {
          "headline":"Start with a very low dose to reduce the risk of adverse side effects.",
          "description":"High doses of THC may cause negative side effects. To reduce the risk, take the lowest possible dose and only increase it if it’s not helping. Check the manufacturer’s instructions for a dosage suggestion if taking a tincture, pill, or edible. You can also consult your doctor for suggestions if you’re using medical marijuana under their supervision. It’s hard to control dosage with THC products that you inhale, such as vaporized oil or buds and leaves that you smoke. To limit your dose, inhale once and then wait for 10 minutes to see if eases your pain."
        },
        {
          "headline":"Don’t use THC daily for more than 6 months.",
          "description":"Using THC regularly over time will cause your tolerance to increase. This means that as time goes on you’ll require more and more THC to get the same effect. To prevent this, limit your use of THC to when you really need it for pain. If you find yourself using it every day for 6 months or longer, talk to your doctor about other pain relief options. Using THC for several months or longer than a year can severely impair your physical and mental health. Don’t incorporate THC as a daily pain reliever without permission from your doctor.Tip: It is possible to develop a dependence on THC if you use it for a long period of time. Tell your doctor if using THC becomes a habit for you."
        }
      ]
    }
  ],
  "text":" Seeking Medical Advice Make an appointment to see your doctor if you’re in pain. There are many different causes of chronic pain, but it’s important to diagnose the cause before trying to treat it. If you have not yet seen a doctor about your pain, make an appointment. Let them know what your symptoms are and tell them that you’re considering using THC to control pain. Keep in mind that some doctors are for using medical marijuana while others are against it. Either way, be open and honest with your doctor about your interest in trying THC. Identify whether you may qualify for medical marijuana. Certain painful medical conditions have been shown to benefit from medical marijuana. Your doctor may be willing to prescribe a THC medication or other product if you have one of these conditions. These include:\nAmyotrophic lateral sclerosis (ALS)\nMultiple sclerosis\nCancer\nHIV/AIDS\nCrohn’s disease\nSevere or chronic pain Tell your doctor about any medications you take. THC may have adverse reactions with many different types of medications, although not all of these interactions are known. These reactions vary from one medication to another, but may include causing the medication to have a stronger effect or negating its effects altogether. Let your doctor know what prescription and over-the-counter medicines you take regularly. Medications that may interact with THC include, but are not limited to:\nBlood thinners, such as warfarin\nAntidepressants\nAnalgesics\nAnticonvulsants Consider the potential side effects of using THC. Even though THC is natural, it can still cause negative side effects. Be on the lookout for these if you decide to try THC. If you experience any of these side effects, stop using THC immediately. Side effects may include:\nDizziness\nDifficulty concentrating and remembering things\nHallucinations\nIncreased appetite\nIncreased heart rate\nSlowed reaction time\nVomiting repeatedly Warning: In some instances, THC may make pain seem worse. Avoid THC if you are at risk of having a heart attack or stroke. Using THC increases the risk of having a heart attack or stroke. If you’re already at risk, such as from high blood pressure, heart disease, or a previous heart attack or stroke, do not use THC. Check with your doctor if you’re not sure if you’re at risk. Choosing a THC Delivery Method Smoke or inhale THC with a vaporizer for fast pain relief. Smoking or inhaling with a vaporizer offers the fastest pain relief. You can purchase a pipe, cigarette papers, or a bong to smoke buds and leaves, or you can purchase a vaporizer to smoke THC oil. Using THC in this way will allow you to get the fastest possible pain relief as the THC goes from your lungs to your blood stream. You may even feel the effects immediately, but they will only last for 2-3 hours. If you don’t experience pain relief within 5-10 minutes after your first hit, try taking another. Consume THC in food or pill form for long-lasting effects. Consuming THC in food, beverages, or pill form will take between 30 minutes and 2 hours to take effect because it must go through your digestive system to get into your blood stream. However, some people prefer this option because you do not have to inhale the THC via smoke or vapor. You can easily eat a THC product or swallow a pill, and the effects will last up to 12 hours. Place THC tincture under your tongue for faster absorption. Open your mouth, lift your tongue, and dispense the desired dose onto the floor of your mouth. Don’t swallow the dose. Allow it to sit under your tongue and absorb. This will allow the THC to get into your blood stream. Taking THC sublingually should produce pain relieving effects in about 15-30 minutes and can last between 8-12 hours. Rub THC oil or lotion on your skin for fast, local pain relief. This might be a good option if your pain is local and mild to moderate, such as from arthritis or muscle strain. Rubbing THC lotion or oil on your skin will work within 15-30 minutes, but it will only relieve pain in the area where you apply it. Start with a very low dose to reduce the risk of adverse side effects. High doses of THC may cause negative side effects. To reduce the risk, take the lowest possible dose and only increase it if it’s not helping. Check the manufacturer’s instructions for a dosage suggestion if taking a tincture, pill, or edible. You can also consult your doctor for suggestions if you’re using medical marijuana under their supervision. It’s hard to control dosage with THC products that you inhale, such as vaporized oil or buds and leaves that you smoke. To limit your dose, inhale once and then wait for 10 minutes to see if eases your pain. Don’t use THC daily for more than 6 months. Using THC regularly over time will cause your tolerance to increase. This means that as time goes on you’ll require more and more THC to get the same effect. To prevent this, limit your use of THC to when you really need it for pain. If you find yourself using it every day for 6 months or longer, talk to your doctor about other pain relief options. Using THC for several months or longer than a year can severely impair your physical and mental health. Don’t incorporate THC as a daily pain reliever without permission from your doctor.Tip: It is possible to develop a dependence on THC if you use it for a long period of time. Tell your doctor if using THC becomes a habit for you.",
  "tyn_model":[
    "thc",
    "vaporizer",
    "marijuana",
    "medicines",
    "cigarette papers",
    "thc tincture",
    "thc oil",
    "lotion",
    "thc lotion",
    "medical marijuana"
  ],
  "tyn_section":[

  ]
}