{
  "title":"How to Choose a String Trimmer",
  "url":"https://www.wikihow.com/Choose-a-String-Trimmer",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Landscaping"
  ],
  "methods":[
    {
      "name":"Figuring Out Your Needs",
      "steps":[
        {
          "headline":"Get a cordless trimmer if you have a large property.",
          "description":"If you live on a large piece of property, then a corded trimmer won't reach as far as you need it to. A cordless trimmer, either gas or battery-powered, is better in this case. Both are mobile and ideal for trimming large properties. If you have a larger property, you can still use a corded trimmer. Just get an extension cord. A cordless trimmer is also helpful if you have a lot of obstructions in your yard like flower beds or furniture. Maneuvering the cord around will be difficult. Battery-powered trimmers usually only hold about 30 minutes of power before needing a recharge. If your property is large enough that you’ll be trimming for longer than that, then a gas-powered model is best. You can get a higher-voltage battery that will make a battery-powered trimmer last longer. Keep in mind that this battery will be more expensive to buy and replace."
        },
        {
          "headline":"Choose a gas or battery trimmer if you have thick foliage in your yard.",
          "description":"Some trimmer types are more powerful than others, making them more suited to some jobs. Battery and gas-powered models are much stronger. They can handle cutting thick grass, weeds, and shrubs. If you have this type of foliage in your yard, then use a battery or gas model. Corded electric trimmers are the weakest, and work best for edging lawns and cutting grass. If this is all you'll be using your trimmer for, then it's the best option. Gas and battery-powered models are similar in strength, so consider other features to decide between the two. Black & Decker and Toro produce quality electric trimmers, both corded and battery-powered. For good gas-powered brands, look for Stihl, Craftsman, and Echo."
        },
        {
          "headline":"Go with a corded electric trimmer for the cheapest option.",
          "description":"Trimmers can range from under $100 to several hundred, so budgeting is important. Corded electric trimmers are the cheapest option, ranging from about $50-120. If you have a small property, then there’s no need to spend more than this for a more powerful model. Black & Decker produces quality, affordable corded trimmers. This is a good brand to start with. Gas-powered trimmers range from $100-300 or more, depending on the engine type. You also need to spend money on gas and oil for it. Battery-powered trimmers are similar in price to gas-powered ones, about $100-300. Also remember that replacement batteries can cost over $100."
        },
        {
          "headline":"Get a corded-electric trimmer for the lowest-maintenance option.",
          "description":"Each trimmer type has different maintenance needs, which affect the effort and cost of owning them. Corded electric trimmers are the lowest-maintenance. They require basically no other upkeep besides replacing the string when it runs out. If you don't want to spend a lot of time and money maintaining your trimmer, then go with a corded electric. These trimmers are also less durable than the other ones, so they may not last as long. However, if you only trim short grass and edge lawns, you're not putting much stress on the trimmer."
        },
        {
          "headline":"Choose a gas or battery trimmer for more durability.",
          "description":"While these 2 types require more maintenance than a corded trimmer, they can also last more than 10 years with proper care. If you're planning on making a long-term investment or use your trimmer for commercial landscaping, then one of these options is the best choice. Weigh the maintenance costs associated with each type to decide which is best for you. Battery-powered trimmers require regular battery charging, which can take over an hour. Further, batteries need replacement every 5 years or so, and new batteries can cost $100. Gas-powered trimmers need the most maintenance. They need new oil every 6 months, plus refueling when they’re empty. You also need to keep the engine and motor clean to prevent grease buildup. These trimmers also last the longest, however, and should still be working in 10 years."
        },
        {
          "headline":"Get a gas trimmer with a 4-stroke engine for more fuel efficiency.",
          "description":"Some gas trimmer brands make models with 2 or 4-stroke engines. The major difference between these is that a 4-stroke engine has greater fuel efficiency and produces less emissions. It also runs more quietly so you can avoid disturbing your neighbors. On the other hand, 2-stroke models are lighter and easier to handle. They also require less maintenance because the engine is less complex. If you want to try different types, look for a Husqvarna, Stihl, MTD, or Craftsman. These brands produce quality products with either engine variety, so you can try out different types to make your decision."
        },
        {
          "headline":"Buy an electric trimmer if your town has emissions and noise laws.",
          "description":"The major drawbacks of gas trimmers are that they’re very loud and produce emissions. Some local governments have laws against noise and emissions, so check if your town has any limitations like these. If so, use a battery or corded trimmer to avoid breaking laws. Many towns have laws about using loud power tools early in the morning or late at night. As long as you trim during the day, you shouldn’t be violating any laws."
        }
      ]
    },
    {
      "name":"Picking Physical Features",
      "steps":[
        {
          "headline":"Pick a convenient release mechanism to control the string level.",
          "description":"These are the 2 main string-release mechanisms that trimmers use. Weigh the advantages of each to see what’s best for you. With a tap-release, you’d bump the trimmer head on the ground to release more string. This gives you more control over how much string you’re using, but also requires more skill to operate. An automatic-release lets out more string whenever it needs to, meaning you don’t have to do it manually. This lets you focus only on trimming. The release mechanism, however, requires more maintenance and might need periodic tune-ups."
        },
        {
          "headline":"Look for a model with an adjustable head for easier edging.",
          "description":"Some trimmers have heads that flip vertically, making edging lawns much easier. If you’ll be using the trimmer for edging and don’t have a lot of skill cutting in straight lines, then this feature will make your job easier. You can also edge with a trimmer that doesn’t have an adjustable head. It’ll just take more practice to master the motion. If you’re only edging your lawn, then an edging tool would be better than a string trimmer. These make straighter lines and require less skill to operate."
        },
        {
          "headline":"Get a trimmer with no gap between the head and shaft to prevent clogs.",
          "description":"Cheaper trimmers have a gap between the head and the shaft. Grass and other debris can get stuck in here and cause a blockage. To avoid this inconvenience, get a model where the shaft connects directly to the head without any gap. If you’re on a budget and don’t have a large property, then getting a model with a gap should work fine. Just be prepared to pull debris out of the gap periodically. Turn the trimmer off before doing this."
        },
        {
          "headline":"Choose a trimmer with a large shield to protect you from debris.",
          "description":"Most trimmers have a protective shield that blocks debris from flying back at the user. For the safest options, look for a trimmer with a large shield that will block any kickback. This is especially important if you have gravel or a lot of small debris on your property. Even small rocks can do a lot of damage if the trimmer kicks them up. Remember that even with a large shield, you could still get hit with debris. Always wear goggles when operating the trimmer."
        }
      ]
    },
    {
      "name":"Trying the Trimmer Out",
      "steps":[
        {
          "headline":"Go to a store to try out trimmers in person to find the right one.",
          "description":"Even if you know what features you're looking for in a trimmer, always try them out in person before buying one. That way, you can feel if the weight, balance, and height is correct for you. Visit a local hardware store to see the options that are available. You don't have to buy the trimmer in the store if they're cheaper online. Go to the store and try some out. Then, when you find one you like, look for it online."
        },
        {
          "headline":"See if the trimmer weight feels comfortable.",
          "description":"Trimmers come in multiple weights. When you’re trying one out, pick it up and carry it around a bit. Make the same motions you’d make while using the trimmer. If it feels too heavy to operate properly, then look for another model. Corded trimmers are the lightest options. If you don’t have enough strength to maneuver a heavy trimmer, then this is probably the best option. Remember that you’ll be holding the trimmer for 10-20 minutes if you’re working in a normal yard. It might not feel heavy initially, but after some time your muscles will get tired."
        },
        {
          "headline":"Look for a trimmer that's the right height for you.",
          "description":"A trimmer that’s the wrong size for you will be difficult to operate. Hold the trimmer the way you would if you were using it, and make sure you can comfortably touch the ground with it. If you have to bend down to touch the ground, or lean back to prevent it from hitting the ground, then look for a model that fits you better. If you’re taller, a straight shaft will help you reach the ground better. If you’re shorter, than a curved shaft is probably easier to handle. Some trimmers have an adjustable height. This is a good option if multiple people will be using it."
        },
        {
          "headline":"Make sure the trimmer feels balanced.",
          "description":"Trimmers have different weight distributions. A balanced model is easier to handle, and you’re less likely to slip and cut something you didn’t want to. Confirm that the trimmer is well-balanced and comfortable for you to use. Check if it feels heavier on one side, or pulls in a certain direction. Trimmers with the engine all the way in the back and the motor all the way in the front are usually the most well-balanced."
        },
        {
          "headline":"Start the trimmer and feel how intense the vibration is.",
          "description":"Vibrations can hurt or numb your hands over a period of time. Most newer trimmers have anti-vibration technology, but start the trimmer up before you buy it to check how intense the vibration is. Choose one that you can operate comfortably without too much vibration. Gas-powered trimmers have the most intense vibrations. If you’re sensitive to this, choose an electric model instead."
        }
      ]
    }
  ],
  "text":" Figuring Out Your Needs Get a cordless trimmer if you have a large property. If you live on a large piece of property, then a corded trimmer won't reach as far as you need it to. A cordless trimmer, either gas or battery-powered, is better in this case. Both are mobile and ideal for trimming large properties. If you have a larger property, you can still use a corded trimmer. Just get an extension cord. A cordless trimmer is also helpful if you have a lot of obstructions in your yard like flower beds or furniture. Maneuvering the cord around will be difficult. Battery-powered trimmers usually only hold about 30 minutes of power before needing a recharge. If your property is large enough that you’ll be trimming for longer than that, then a gas-powered model is best. You can get a higher-voltage battery that will make a battery-powered trimmer last longer. Keep in mind that this battery will be more expensive to buy and replace. Choose a gas or battery trimmer if you have thick foliage in your yard. Some trimmer types are more powerful than others, making them more suited to some jobs. Battery and gas-powered models are much stronger. They can handle cutting thick grass, weeds, and shrubs. If you have this type of foliage in your yard, then use a battery or gas model. Corded electric trimmers are the weakest, and work best for edging lawns and cutting grass. If this is all you'll be using your trimmer for, then it's the best option. Gas and battery-powered models are similar in strength, so consider other features to decide between the two. Black & Decker and Toro produce quality electric trimmers, both corded and battery-powered. For good gas-powered brands, look for Stihl, Craftsman, and Echo. Go with a corded electric trimmer for the cheapest option. Trimmers can range from under $100 to several hundred, so budgeting is important. Corded electric trimmers are the cheapest option, ranging from about $50-120. If you have a small property, then there’s no need to spend more than this for a more powerful model. Black & Decker produces quality, affordable corded trimmers. This is a good brand to start with. Gas-powered trimmers range from $100-300 or more, depending on the engine type. You also need to spend money on gas and oil for it. Battery-powered trimmers are similar in price to gas-powered ones, about $100-300. Also remember that replacement batteries can cost over $100. Get a corded-electric trimmer for the lowest-maintenance option. Each trimmer type has different maintenance needs, which affect the effort and cost of owning them. Corded electric trimmers are the lowest-maintenance. They require basically no other upkeep besides replacing the string when it runs out. If you don't want to spend a lot of time and money maintaining your trimmer, then go with a corded electric. These trimmers are also less durable than the other ones, so they may not last as long. However, if you only trim short grass and edge lawns, you're not putting much stress on the trimmer. Choose a gas or battery trimmer for more durability. While these 2 types require more maintenance than a corded trimmer, they can also last more than 10 years with proper care. If you're planning on making a long-term investment or use your trimmer for commercial landscaping, then one of these options is the best choice. Weigh the maintenance costs associated with each type to decide which is best for you. Battery-powered trimmers require regular battery charging, which can take over an hour. Further, batteries need replacement every 5 years or so, and new batteries can cost $100. Gas-powered trimmers need the most maintenance. They need new oil every 6 months, plus refueling when they’re empty. You also need to keep the engine and motor clean to prevent grease buildup. These trimmers also last the longest, however, and should still be working in 10 years. Get a gas trimmer with a 4-stroke engine for more fuel efficiency. Some gas trimmer brands make models with 2 or 4-stroke engines. The major difference between these is that a 4-stroke engine has greater fuel efficiency and produces less emissions. It also runs more quietly so you can avoid disturbing your neighbors. On the other hand, 2-stroke models are lighter and easier to handle. They also require less maintenance because the engine is less complex. If you want to try different types, look for a Husqvarna, Stihl, MTD, or Craftsman. These brands produce quality products with either engine variety, so you can try out different types to make your decision. Buy an electric trimmer if your town has emissions and noise laws. The major drawbacks of gas trimmers are that they’re very loud and produce emissions. Some local governments have laws against noise and emissions, so check if your town has any limitations like these. If so, use a battery or corded trimmer to avoid breaking laws. Many towns have laws about using loud power tools early in the morning or late at night. As long as you trim during the day, you shouldn’t be violating any laws. Picking Physical Features Pick a convenient release mechanism to control the string level. These are the 2 main string-release mechanisms that trimmers use. Weigh the advantages of each to see what’s best for you. With a tap-release, you’d bump the trimmer head on the ground to release more string. This gives you more control over how much string you’re using, but also requires more skill to operate. An automatic-release lets out more string whenever it needs to, meaning you don’t have to do it manually. This lets you focus only on trimming. The release mechanism, however, requires more maintenance and might need periodic tune-ups. Look for a model with an adjustable head for easier edging. Some trimmers have heads that flip vertically, making edging lawns much easier. If you’ll be using the trimmer for edging and don’t have a lot of skill cutting in straight lines, then this feature will make your job easier. You can also edge with a trimmer that doesn’t have an adjustable head. It’ll just take more practice to master the motion. If you’re only edging your lawn, then an edging tool would be better than a string trimmer. These make straighter lines and require less skill to operate. Get a trimmer with no gap between the head and shaft to prevent clogs. Cheaper trimmers have a gap between the head and the shaft. Grass and other debris can get stuck in here and cause a blockage. To avoid this inconvenience, get a model where the shaft connects directly to the head without any gap. If you’re on a budget and don’t have a large property, then getting a model with a gap should work fine. Just be prepared to pull debris out of the gap periodically. Turn the trimmer off before doing this. Choose a trimmer with a large shield to protect you from debris. Most trimmers have a protective shield that blocks debris from flying back at the user. For the safest options, look for a trimmer with a large shield that will block any kickback. This is especially important if you have gravel or a lot of small debris on your property. Even small rocks can do a lot of damage if the trimmer kicks them up. Remember that even with a large shield, you could still get hit with debris. Always wear goggles when operating the trimmer. Trying the Trimmer Out Go to a store to try out trimmers in person to find the right one. Even if you know what features you're looking for in a trimmer, always try them out in person before buying one. That way, you can feel if the weight, balance, and height is correct for you. Visit a local hardware store to see the options that are available. You don't have to buy the trimmer in the store if they're cheaper online. Go to the store and try some out. Then, when you find one you like, look for it online. See if the trimmer weight feels comfortable. Trimmers come in multiple weights. When you’re trying one out, pick it up and carry it around a bit. Make the same motions you’d make while using the trimmer. If it feels too heavy to operate properly, then look for another model. Corded trimmers are the lightest options. If you don’t have enough strength to maneuver a heavy trimmer, then this is probably the best option. Remember that you’ll be holding the trimmer for 10-20 minutes if you’re working in a normal yard. It might not feel heavy initially, but after some time your muscles will get tired. Look for a trimmer that's the right height for you. A trimmer that’s the wrong size for you will be difficult to operate. Hold the trimmer the way you would if you were using it, and make sure you can comfortably touch the ground with it. If you have to bend down to touch the ground, or lean back to prevent it from hitting the ground, then look for a model that fits you better. If you’re taller, a straight shaft will help you reach the ground better. If you’re shorter, than a curved shaft is probably easier to handle. Some trimmers have an adjustable height. This is a good option if multiple people will be using it. Make sure the trimmer feels balanced. Trimmers have different weight distributions. A balanced model is easier to handle, and you’re less likely to slip and cut something you didn’t want to. Confirm that the trimmer is well-balanced and comfortable for you to use. Check if it feels heavier on one side, or pulls in a certain direction. Trimmers with the engine all the way in the back and the motor all the way in the front are usually the most well-balanced. Start the trimmer and feel how intense the vibration is. Vibrations can hurt or numb your hands over a period of time. Most newer trimmers have anti-vibration technology, but start the trimmer up before you buy it to check how intense the vibration is. Choose one that you can operate comfortably without too much vibration. Gas-powered trimmers have the most intense vibrations. If you’re sensitive to this, choose an electric model instead.",
  "tyn_model":[
    "trimmer",
    "trimmers",
    "cordless trimmer",
    "corded trimmer",
    "electric trimmers",
    "electric trimmer",
    "extension cord",
    "black & decker produces quality, affordable corded trimmers",
    "gas trimmer",
    "trim",
    "string",
    "edging tool",
    "grass",
    "gravel",
    "rocks",
    "goggles"
  ],
  "tyn_section":[

  ]
}