{
  "title":"How to Keep Sugar Cookies from Spreading",
  "url":"https://www.wikihow.com/Keep-Sugar-Cookies-from-Spreading",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Sugar Cookies and Biscuits"
  ],
  "methods":[
    {
      "name":"Mixing Dough That Won't Spread",
      "steps":[
        {
          "headline":"Choose a recipe that uses 1 part butter to 3 parts flour.",
          "description":"If you have more butter than this, such as 2 parts butter to 3 parts flour, the butter will quickly melt as the cookies bake, causing them to spread. That's why it's important to find a recipe that balances the ratio of butter to flour.Tip: You can also experiment with using some vegetable shortening instead of all butter. Shortening holds its shape well, but butter has better flavor so you might like using a combination of both. For example, try a sugar cookie recipe that uses 1 cup (226 g) of butter and 3 cups  (360 g) of flour."
        },
        {
          "headline":"Follow a recipe that uses baking powder instead of baking soda.",
          "description":"Your sugar cookie dough is actually acidic, but if you add baking soda as a raising agent, it neutralizes the acidity and makes the cookies spread. Baking powder is acidic, so it helps the dough keep its shape. Ensure that you're using baking powder that hasn't expired or your cookies won't develop a soft rise."
        },
        {
          "headline":"Avoid using powdered sugar in your dough.",
          "description":"You've probably seen cookie recipes that call for powdered sugar instead of granulated sugar. Unfortunately, since powdered sugar is so fine, it melts faster which makes your cookies spread. To help the cookies keep their shape, use granulated sugar. You could also try cane sugar since it's less refined and coarser than granulated sugar."
        },
        {
          "headline":"Measure all of your recipe ingredients carefully when you make the dough.",
          "description":"Since baking recipes are a specific balance of butter, flour, sugar, and leaveners, it's critical to weigh out each ingredient instead of eyeballing amounts. For example, to measure flour, scoop a measuring cup into your flour container and run the flat edge of a knife across the top to level it. Sugar cookies can spread if there's not enough flour, so measure accurately. If they're still spreading, add an extra 2 tablespoons (30 g) of flour to your dough. Use a kitchen scale to weigh out your ingredients to get the most accurate result."
        },
        {
          "headline":"Beat the butter and sugar for a full 5 minutes.",
          "description":"Your recipe probably tells you to cream the butter and sugar until the mixture is light and fluffy. If you're unsure what that means and your cookies have been spreading, you probably need to beat the butter and sugar longer. Beat the mixture on medium speed for 5 minutes and scrape down the sides of the bowl occasionally. Use room temperature butter since it will beat easily. Don't make dough with melted butter because it won't hold its shape in the oven. Beating or creaming the butter and sugar makes the dough less dense so the fat and sugar don't melt as quickly. This helps the cookies hold their shape better."
        },
        {
          "headline":"Chill the cut-out cookie dough for 10 to 15 minutes.",
          "description":"There's no need to chill the dough before you roll it out and cut or slice it into shapes. Just place the cookies on a parchment paper-lined baking sheet and stick them in the fridge while you preheat the oven. You can refrigerate the dough whenever it feels like it's getting too soft or sticky to work with."
        }
      ]
    },
    {
      "name":"Baking Cookies That Hold Their Shape",
      "steps":[
        {
          "headline":"Preheat your oven before putting the cookies in.",
          "description":"If you usually turn on the oven and stick the sheet of cookies into it right away, your cookies will spread more because they'll begin to melt before they bake. Help your cookies hold their shape by preheating the oven before you put the sheet of cookies into the oven and set the timer.Tip: Put an oven thermometer into the oven or pay attention to how your oven heats since all ovens are a little different. You might find that your oven runs cool and you need to turn the oven temperature up a little so the cookies don't spread too much."
        },
        {
          "headline":"Roll the dough about ⁄3 inch (0.85 cm) thin before cutting the shapes.",
          "description":"If your recipes calls for rolling the dough thinner, follow its direction. In general, the thicker the cookie shapes, the more they'll spread so roll the dough at least 1 centimetre (0.39 in) thin before cutting shapes. If your dough becomes warm or sticky when you're rolling it, stick it in the fridge for a few minutes to chill so it's easier to work with."
        },
        {
          "headline":"Put your cookies on parchment paper-lined sheets instead of silicone.",
          "description":"Silicone baking mats are popular, but since they're non-stick, they'll make your cookie dough spread quickly on the baking sheets. Tear off a sheet of parchment paper and use that on your sheet instead. It prevents the cookies from sticking and helps them bake evenly. You can reuse parchment paper sheets a few times before throwing them away."
        },
        {
          "headline":"Bake 1 sheet of sugar cookies at a time so they cook evenly.",
          "description":"Don't put more than 1 sheet of cookies in your preheated oven at a time because they'll cook completely differently. For example, a sheet that's in the top third of the oven might take longer to bake than the one that's in the bottom third of the oven. Put the sheet on the middle rack so the oven heat circulates evenly. To use your time efficiently, roll out and cut a sheet of cookies while another sheet is baking in the oven."
        },
        {
          "headline":"Cool the baking sheet before baking another batch of cookies.",
          "description":"If you place cut-out cookie shapes on a hot baking sheet, the dough immediately begins to melt and spread. Use a different baking sheet or let the sheet cool completely before you make your next batch. This is another reason that baking and rolling the cookies in batches works effectively."
        },
        {
          "headline":"Trim the cookies with your cookie cutter if they still spread during baking.",
          "description":"If you make these adjustments to baking your sugar cookies, you should find that they hold their shape. However, if they still spread a little, carefully take the cookies out of the oven and press the cookie cutter down on the hot cookie to trim away the excess. Then, brush off the crumbs with a pastry brush. Trim the cookies before they cool or they could crumble and crack."
        }
      ]
    }
  ],
  "text":" Mixing Dough That Won't Spread Choose a recipe that uses 1 part butter to 3 parts flour. If you have more butter than this, such as 2 parts butter to 3 parts flour, the butter will quickly melt as the cookies bake, causing them to spread. That's why it's important to find a recipe that balances the ratio of butter to flour.Tip: You can also experiment with using some vegetable shortening instead of all butter. Shortening holds its shape well, but butter has better flavor so you might like using a combination of both. For example, try a sugar cookie recipe that uses 1 cup (226 g) of butter and 3 cups  (360 g) of flour. Follow a recipe that uses baking powder instead of baking soda. Your sugar cookie dough is actually acidic, but if you add baking soda as a raising agent, it neutralizes the acidity and makes the cookies spread. Baking powder is acidic, so it helps the dough keep its shape. Ensure that you're using baking powder that hasn't expired or your cookies won't develop a soft rise. Avoid using powdered sugar in your dough. You've probably seen cookie recipes that call for powdered sugar instead of granulated sugar. Unfortunately, since powdered sugar is so fine, it melts faster which makes your cookies spread. To help the cookies keep their shape, use granulated sugar. You could also try cane sugar since it's less refined and coarser than granulated sugar. Measure all of your recipe ingredients carefully when you make the dough. Since baking recipes are a specific balance of butter, flour, sugar, and leaveners, it's critical to weigh out each ingredient instead of eyeballing amounts. For example, to measure flour, scoop a measuring cup into your flour container and run the flat edge of a knife across the top to level it. Sugar cookies can spread if there's not enough flour, so measure accurately. If they're still spreading, add an extra 2 tablespoons (30 g) of flour to your dough. Use a kitchen scale to weigh out your ingredients to get the most accurate result. Beat the butter and sugar for a full 5 minutes. Your recipe probably tells you to cream the butter and sugar until the mixture is light and fluffy. If you're unsure what that means and your cookies have been spreading, you probably need to beat the butter and sugar longer. Beat the mixture on medium speed for 5 minutes and scrape down the sides of the bowl occasionally. Use room temperature butter since it will beat easily. Don't make dough with melted butter because it won't hold its shape in the oven. Beating or creaming the butter and sugar makes the dough less dense so the fat and sugar don't melt as quickly. This helps the cookies hold their shape better. Chill the cut-out cookie dough for 10 to 15 minutes. There's no need to chill the dough before you roll it out and cut or slice it into shapes. Just place the cookies on a parchment paper-lined baking sheet and stick them in the fridge while you preheat the oven. You can refrigerate the dough whenever it feels like it's getting too soft or sticky to work with. Baking Cookies That Hold Their Shape Preheat your oven before putting the cookies in. If you usually turn on the oven and stick the sheet of cookies into it right away, your cookies will spread more because they'll begin to melt before they bake. Help your cookies hold their shape by preheating the oven before you put the sheet of cookies into the oven and set the timer.Tip: Put an oven thermometer into the oven or pay attention to how your oven heats since all ovens are a little different. You might find that your oven runs cool and you need to turn the oven temperature up a little so the cookies don't spread too much. Roll the dough about ⁄3 inch (0.85 cm) thin before cutting the shapes. If your recipes calls for rolling the dough thinner, follow its direction. In general, the thicker the cookie shapes, the more they'll spread so roll the dough at least 1 centimetre (0.39 in) thin before cutting shapes. If your dough becomes warm or sticky when you're rolling it, stick it in the fridge for a few minutes to chill so it's easier to work with. Put your cookies on parchment paper-lined sheets instead of silicone. Silicone baking mats are popular, but since they're non-stick, they'll make your cookie dough spread quickly on the baking sheets. Tear off a sheet of parchment paper and use that on your sheet instead. It prevents the cookies from sticking and helps them bake evenly. You can reuse parchment paper sheets a few times before throwing them away. Bake 1 sheet of sugar cookies at a time so they cook evenly. Don't put more than 1 sheet of cookies in your preheated oven at a time because they'll cook completely differently. For example, a sheet that's in the top third of the oven might take longer to bake than the one that's in the bottom third of the oven. Put the sheet on the middle rack so the oven heat circulates evenly. To use your time efficiently, roll out and cut a sheet of cookies while another sheet is baking in the oven. Cool the baking sheet before baking another batch of cookies. If you place cut-out cookie shapes on a hot baking sheet, the dough immediately begins to melt and spread. Use a different baking sheet or let the sheet cool completely before you make your next batch. This is another reason that baking and rolling the cookies in batches works effectively. Trim the cookies with your cookie cutter if they still spread during baking. If you make these adjustments to baking your sugar cookies, you should find that they hold their shape. However, if they still spread a little, carefully take the cookies out of the oven and press the cookie cutter down on the hot cookie to trim away the excess. Then, brush off the crumbs with a pastry brush. Trim the cookies before they cool or they could crumble and crack.",
  "tyn_model":[
    "butter",
    "oven",
    "flour",
    "sugar",
    "cookies",
    "baking powder",
    "powdered sugar",
    "granulated sugar",
    "sugar cookies",
    "parchment paper",
    "baking sheet",
    "baking soda",
    "cookie cutter",
    "vegetable shortening",
    "shortening",
    "sugar cookie",
    "sugar cookie dough",
    "cane sugar",
    "leaveners",
    "flour container",
    "knife",
    "kitchen scale",
    "bowl",
    "cookie dough",
    "parchment paper-lined baking sheet",
    "oven thermometer",
    "baking sheets",
    "cookie",
    "pastry brush"
  ],
  "tyn_section":[

  ]
}