{
  "title":"How to Make a Great Bedroom for Sleeping",
  "url":"https://www.wikihow.com/Make-a-Great-Bedroom-for-Sleeping",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "steps":[
    {
      "headline":"Find out what bothers you.",
      "description":"Do you hate that TV and it's loud sounds? Is the streetlight outside annoying? What about the rough bed covers?"
    },
    {
      "headline":"Clean up your bedroom.",
      "description":"Simple as that."
    },
    {
      "headline":"Buy a new mattress.",
      "description":"Find out how you sleep so you can find the right one."
    },
    {
      "headline":"Find a quality pillow.",
      "description":"Get one that is bound to stay comfy and nice through the years."
    },
    {
      "headline":"Look for softer bed linens.",
      "description":"If your sheets are okay, buy a soft blanket."
    },
    {
      "headline":"Consider buying thermal drapes for your windows.",
      "description":"They work wonders. They keep out the cold, block out light, and reduces outside noise."
    },
    {
      "headline":"If you want, put thermal drapes over the doors to silence bathroom noise and the kids running down the hall.",
      "description":""
    },
    {
      "headline":"Buy a dimmer alarm clock.",
      "description":"It will not keep you up as much as a regular one."
    },
    {
      "headline":"Use a lamp that is dim to ease your eyes into sleep.",
      "description":""
    },
    {
      "headline":"Remove everything else off of your nightstand.",
      "description":"It can distract you from your sleep."
    },
    {
      "headline":"Remove the batteries from the TV remote!",
      "description":"That way, you won't be tempted to turn it on."
    },
    {
      "headline":"If you must bring an i-Device or mp3 player to bed, put the brightness level as low as possible and don't stay on it all night.",
      "description":"Put it and the earbuds under your pillow, turn up the volume in the earbuds so that you can hear it through your pillow and sleep."
    },
    {
      "headline":"Computers are distractions.",
      "description":"Turn them off at 7pm and put them away (if it is a laptop.)"
    },
    {
      "headline":"Reposition your bed away from the windows or walls near heavily used rooms, like a living room or playroom.",
      "description":""
    },
    {
      "headline":"Paint your walls a darker color.",
      "description":"Lime green will not help you fall asleep."
    },
    {
      "headline":"Invest in a light with a dimmer.",
      "description":"It will help you ease into sleep better."
    },
    {
      "headline":"Remove photos on the wall, excess furniture, and other not needed items.",
      "description":"They will distract you into looking around the room at stuff and not sleeping."
    },
    {
      "headline":"Organize bathrooms and closets if necessary.",
      "description":"If left unorganized, they will make you think, \"Uh, I have to clean this and organize this and pick up this and wipe down this\", and it puts unnecessary stress on you."
    }
  ],
  "text":" Find out what bothers you. Do you hate that TV and it's loud sounds? Is the streetlight outside annoying? What about the rough bed covers? Clean up your bedroom. Simple as that. Buy a new mattress. Find out how you sleep so you can find the right one. Find a quality pillow. Get one that is bound to stay comfy and nice through the years. Look for softer bed linens. If your sheets are okay, buy a soft blanket. Consider buying thermal drapes for your windows. They work wonders. They keep out the cold, block out light, and reduces outside noise. If you want, put thermal drapes over the doors to silence bathroom noise and the kids running down the hall.  Buy a dimmer alarm clock. It will not keep you up as much as a regular one. Use a lamp that is dim to ease your eyes into sleep.  Remove everything else off of your nightstand. It can distract you from your sleep. Remove the batteries from the TV remote! That way, you won't be tempted to turn it on. If you must bring an i-Device or mp3 player to bed, put the brightness level as low as possible and don't stay on it all night. Put it and the earbuds under your pillow, turn up the volume in the earbuds so that you can hear it through your pillow and sleep. Computers are distractions. Turn them off at 7pm and put them away (if it is a laptop.) Reposition your bed away from the windows or walls near heavily used rooms, like a living room or playroom.  Paint your walls a darker color. Lime green will not help you fall asleep. Invest in a light with a dimmer. It will help you ease into sleep better. Remove photos on the wall, excess furniture, and other not needed items. They will distract you into looking around the room at stuff and not sleeping. Organize bathrooms and closets if necessary. If left unorganized, they will make you think, \"Uh, I have to clean this and organize this and pick up this and wipe down this\", and it puts unnecessary stress on you.",
  "tyn_model":[
    "thermal drapes",
    "mattress",
    "pillow",
    "alarm clock",
    "lamp",
    "tv remote",
    "computers",
    "laptop"
  ],
  "tyn_section":[

  ]
}