{
  "title":"How to Make Cheese Kachori",
  "url":"https://www.wikihow.com/Make-Cheese-Kachori",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes"
  ],
  "steps":[
    {
      "headline":"Mix the ingredients.",
      "description":"In a big bowl add grated cheese, all-purpose flour, onions, chili flakes, baking powder, coriander leaves, plain yogurt, Italian seasoning and salt. Mix everything and knead it like a dough."
    },
    {
      "headline":"Take a small portion of the dough and spread it with your fingers.",
      "description":"Put a small amount (1tsp) of cream cheese stuffing on the spread dough and close it from all sides making a ball shape."
    },
    {
      "headline":"Take a small amount of oil and rub it between the palm of your hand.",
      "description":"Then take the Kachori balls you made and gently press them between your palms to slightly flatten the Kachori. Repeat the same steps for all the Kachori."
    },
    {
      "headline":"Heat the oil at medium heat and fry 3-4 kachoris at a time.",
      "description":"Turn them over a couple of times and cook them till they become golden brown and crispy."
    },
    {
      "headline":"Serve them.",
      "description":"You can serve these cheese kachoris with coriander chutney, ketchup, ranch or your favorite condiment."
    }
  ],
  "text":" Mix the ingredients. In a big bowl add grated cheese, all-purpose flour, onions, chili flakes, baking powder, coriander leaves, plain yogurt, Italian seasoning and salt. Mix everything and knead it like a dough. Take a small portion of the dough and spread it with your fingers. Put a small amount (1tsp) of cream cheese stuffing on the spread dough and close it from all sides making a ball shape. Take a small amount of oil and rub it between the palm of your hand. Then take the Kachori balls you made and gently press them between your palms to slightly flatten the Kachori. Repeat the same steps for all the Kachori. Heat the oil at medium heat and fry 3-4 kachoris at a time. Turn them over a couple of times and cook them till they become golden brown and crispy. Serve them. You can serve these cheese kachoris with coriander chutney, ketchup, ranch or your favorite condiment.",
  "tyn_model":[
    "oil",
    "grated cheese",
    "all-purpose flour",
    "onions",
    "chili flakes",
    "baking powder",
    "coriander leaves",
    "plain yogurt",
    "italian seasoning",
    "salt",
    "cream cheese",
    "coriander chutney",
    "ketchup"
  ],
  "tyn_section":[

  ]
}