{
  "title":"How to Drink Pelinkovac",
  "url":"https://www.wikihow.com/Drink-Pelinkovac",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks"
  ],
  "methods":[
    {
      "name":"Sipping Pelinkovac",
      "steps":[
        {
          "headline":"Put the bottle of pelinkovac in the fridge to chill for 2 hours.",
          "description":"Most pelinkovac producers recommend serving the pelinkovac chilled, especially if you don't want to add ice. Either store the bottle in the fridge so it's always perfectly chilled or put the bottle in about 2 hours before you drink the pelinkovac."
        },
        {
          "headline":"Pour the pelinkovac into an old-fashioned glass.",
          "description":"Although you could use any type of glass, an old-fashioned or lowball glass gives the pelinkovac room to move around so you smell more of its aromatics. In general, put about 1 ⁄2  fl oz (44 mL) of pelinkovac into your glass.Feel free to pour as much or as little pelinkovac into your glass as you want to drink. To enjoy a small amount, just fill a shotglass."
        },
        {
          "headline":"Add ice or cold water if you'd like the pelinkovac to have a mellower flavor.",
          "description":"To slightly dilute the drink, put 2 to 3 ice cubes or 1 to 2 teaspoons (4.9 to 9.9 mL) of cold water into the glass. Swirl the glass a few times to further chill the pelinkovac.Tip: To make a more flavorful drink, add cola, tonic water, or cranberry juice instead of cold water. Taste the drink and add more mixer depending on how strong you'd like the drink to be. If you're adding ice, wait to add the cubes until you're ready to begin drinking the pelinkovac. If the ice sits too long, the pelinkovac will be too watery."
        },
        {
          "headline":"Stick a citrus wedge onto the rim of the glass if you want to add a bright flavor.",
          "description":"Orange, lemon, and lime pair well with the herbal flavors of pelinkovac, so garnish the drink with a citrus wedge. You can squeeze it into the pelinkovac and drop it into the glass for a bolder flavor.For a slight citrus flavor, peel a lemon, lime, or orange twist and add it to the pelinkovac."
        },
        {
          "headline":"Sip the pelinkovac before or after a meal.",
          "description":"There's no wrong way to drink pelinkovac and it's a popular drink in Eastern Europe. Try enjoying it as an aperitif before your meal or as a digestif to finish a nice dinner.If you dislike the herbal aftertaste, suck on the citrus wedge or sip a little water."
        }
      ]
    },
    {
      "name":"Using Pelinkovac in Mixed Drinks",
      "steps":[
        {
          "headline":"Combine pelinkovac, vodka, and orange juice for a Zagreb night cocktail.",
          "description":"Fill an old-fashioned glass with ice and pour in 4  fl oz (120 mL) of orange juice. Add 1  fl oz (30 mL) of pelinkovac and 1  fl oz (30 mL) of vodka. Then, stir the cocktail a few times and enjoy it cold.Use orange-flavored vodka for an extra citrusy tasting cocktail."
        },
        {
          "headline":"Make a fizzy pelnkovac cocktail with marashino liqueur and tonic water.",
          "description":"To make a one-trick pony cocktail, fill an old-fashioned glass with ice. Pour in 1 ⁄2  fl oz (44 mL) of pelinkovac, ⁄2  fl oz (15 mL) of maraschino liqueur, and 4 fluid ounces (120 mL) of tonic. Then, stir the cocktail gently to distribute the liqueurs.For a simple garnish, stick a lime wedge on the rim of the glass."
        },
        {
          "headline":"Shake a pelinkovac cocktail with bourbon and bitters.",
          "description":"If you love the taste of a Manhattan, pour 1 ⁄2  fl oz (44 mL) of bourbon into a cocktail shaker. Add ⁄2  fl oz (15 mL) of pelinkovac, ⁄2  fl oz (15 mL) of Punt e Mes, 1 dash of angostura bitters, and 2 dashes of Peychaud's bitters. Fill the shaker with ice and put the lid on it. Then, shake the cocktail for about 20 seconds before you strain it into a martini glass.If you can't find Punt e Mes, mix 2 parts of sweet vermouth with 1 part of Campari. Then, measure out ⁄2  fl oz (15 mL) to use in the cocktail."
        },
        {
          "headline":"Add pelinkovac and rum to hot water for an herbal hot toddy.",
          "description":"Get out a mug or Irish coffee glass and pour in 1  fl oz (30 mL) of pelinkovac. Add 1  fl oz (30 mL) of spiced rum and ⁄2  fl oz (15 mL) of simple syrup. Then, slowly stir in 3 ⁄2  fl oz (100 mL) of hot water and garnish the toddy with a pinch of cinnamon or cloves if you'd like it to be spicier.You can also add a lemon wedge to the toddy to give it a bright, citrus flavor."
        },
        {
          "headline":"Mix pelinkovac with licorice liqueur and juice to make a red licorice whip cocktail.",
          "description":"Fill a cocktail shaker with ice and pour in 1  fl oz (30 mL) of licorice liqueur, 1  fl oz (30 mL) of pelinkovac, and 1  fl oz (30 mL) of orange juice along with 2 teaspoons (9.9 mL) of almond syrup. Use a long spoon to stir the liquid and strain it into a martini glass. Serve the cocktail cold with a red licorice stick garnish.Tip: If you'd like to decorate the martini glass, drizzle ⁄4 to ⁄2  fl oz (7.4 to 14.8 mL) grenadine syrup on the inside of the glass. Then, pour the cocktail into it. Stir the cocktail for 20 to 30 seconds so the ice dilutes the cocktail slightly and blends the ingredients."
        }
      ]
    }
  ],
  "text":" Sipping Pelinkovac Put the bottle of pelinkovac in the fridge to chill for 2 hours. Most pelinkovac producers recommend serving the pelinkovac chilled, especially if you don't want to add ice. Either store the bottle in the fridge so it's always perfectly chilled or put the bottle in about 2 hours before you drink the pelinkovac. Pour the pelinkovac into an old-fashioned glass. Although you could use any type of glass, an old-fashioned or lowball glass gives the pelinkovac room to move around so you smell more of its aromatics. In general, put about 1 ⁄2  fl oz (44 mL) of pelinkovac into your glass.Feel free to pour as much or as little pelinkovac into your glass as you want to drink. To enjoy a small amount, just fill a shotglass. Add ice or cold water if you'd like the pelinkovac to have a mellower flavor. To slightly dilute the drink, put 2 to 3 ice cubes or 1 to 2 teaspoons (4.9 to 9.9 mL) of cold water into the glass. Swirl the glass a few times to further chill the pelinkovac.Tip: To make a more flavorful drink, add cola, tonic water, or cranberry juice instead of cold water. Taste the drink and add more mixer depending on how strong you'd like the drink to be. If you're adding ice, wait to add the cubes until you're ready to begin drinking the pelinkovac. If the ice sits too long, the pelinkovac will be too watery. Stick a citrus wedge onto the rim of the glass if you want to add a bright flavor. Orange, lemon, and lime pair well with the herbal flavors of pelinkovac, so garnish the drink with a citrus wedge. You can squeeze it into the pelinkovac and drop it into the glass for a bolder flavor.For a slight citrus flavor, peel a lemon, lime, or orange twist and add it to the pelinkovac. Sip the pelinkovac before or after a meal. There's no wrong way to drink pelinkovac and it's a popular drink in Eastern Europe. Try enjoying it as an aperitif before your meal or as a digestif to finish a nice dinner.If you dislike the herbal aftertaste, suck on the citrus wedge or sip a little water. Using Pelinkovac in Mixed Drinks Combine pelinkovac, vodka, and orange juice for a Zagreb night cocktail. Fill an old-fashioned glass with ice and pour in 4  fl oz (120 mL) of orange juice. Add 1  fl oz (30 mL) of pelinkovac and 1  fl oz (30 mL) of vodka. Then, stir the cocktail a few times and enjoy it cold.Use orange-flavored vodka for an extra citrusy tasting cocktail. Make a fizzy pelnkovac cocktail with marashino liqueur and tonic water. To make a one-trick pony cocktail, fill an old-fashioned glass with ice. Pour in 1 ⁄2  fl oz (44 mL) of pelinkovac, ⁄2  fl oz (15 mL) of maraschino liqueur, and 4 fluid ounces (120 mL) of tonic. Then, stir the cocktail gently to distribute the liqueurs.For a simple garnish, stick a lime wedge on the rim of the glass. Shake a pelinkovac cocktail with bourbon and bitters. If you love the taste of a Manhattan, pour 1 ⁄2  fl oz (44 mL) of bourbon into a cocktail shaker. Add ⁄2  fl oz (15 mL) of pelinkovac, ⁄2  fl oz (15 mL) of Punt e Mes, 1 dash of angostura bitters, and 2 dashes of Peychaud's bitters. Fill the shaker with ice and put the lid on it. Then, shake the cocktail for about 20 seconds before you strain it into a martini glass.If you can't find Punt e Mes, mix 2 parts of sweet vermouth with 1 part of Campari. Then, measure out ⁄2  fl oz (15 mL) to use in the cocktail. Add pelinkovac and rum to hot water for an herbal hot toddy. Get out a mug or Irish coffee glass and pour in 1  fl oz (30 mL) of pelinkovac. Add 1  fl oz (30 mL) of spiced rum and ⁄2  fl oz (15 mL) of simple syrup. Then, slowly stir in 3 ⁄2  fl oz (100 mL) of hot water and garnish the toddy with a pinch of cinnamon or cloves if you'd like it to be spicier.You can also add a lemon wedge to the toddy to give it a bright, citrus flavor. Mix pelinkovac with licorice liqueur and juice to make a red licorice whip cocktail. Fill a cocktail shaker with ice and pour in 1  fl oz (30 mL) of licorice liqueur, 1  fl oz (30 mL) of pelinkovac, and 1  fl oz (30 mL) of orange juice along with 2 teaspoons (9.9 mL) of almond syrup. Use a long spoon to stir the liquid and strain it into a martini glass. Serve the cocktail cold with a red licorice stick garnish.Tip: If you'd like to decorate the martini glass, drizzle ⁄4 to ⁄2  fl oz (7.4 to 14.8 mL) grenadine syrup on the inside of the glass. Then, pour the cocktail into it. Stir the cocktail for 20 to 30 seconds so the ice dilutes the cocktail slightly and blends the ingredients.",
  "tyn_model":[
    "pelinkovac",
    "ice",
    "glass",
    "old-fashioned glass",
    "cold water",
    "lemon",
    "vodka",
    "orange juice",
    "martini glass",
    "tonic water",
    "lime",
    "citrus wedge",
    "bourbon",
    "cocktail shaker",
    "hot water",
    "licorice liqueur",
    "old-fashioned or",
    "shotglass",
    "ice or",
    "ice cubes",
    "cola",
    "cranberry juice",
    "citrus",
    "orange",
    "water",
    "marashino liqueur",
    "maraschino liqueur",
    "tonic",
    "bitters",
    "punt e mes",
    "angostura bitters",
    "peychaud's bitters",
    "shaker",
    "sweet vermouth",
    "campari",
    "rum",
    "spiced rum",
    "simple syrup",
    "cinnamon",
    "red licorice whip cocktail",
    "almond syrup",
    "red licorice stick",
    "grenadine syrup"
  ],
  "tyn_section":[

  ]
}