{
  "title":"How to Make Your House Look Bigger",
  "url":"https://www.wikihow.com/Make-Your-House-Look-Bigger",
  "category_hierarchy":[
    "Home and Garden",
    "Home Decorating",
    "Interior Design for Rooms"
  ],
  "methods":[
    {
      "name":"Using Quick Staging Techniques",
      "steps":[
        {
          "headline":"Declutter your home to maintain some empty space.",
          "description":"A messy house will look smaller than a clean house because clutter reduces visible floor and wall space. Ideally, each shelf, table, desk, or other furniture item should have some empty space on it. For example, you could place a single book on a coffee table in your living room, or a single vase on a dresser, or a single clay sculpture on a bookshelf. To declutter a room, try setting up 3 boxes: 1 for items to keep, 1 for items to donate, and 1 for items to throw away."
        },
        {
          "headline":"Open the curtains and blinds to let in more light.",
          "description":"Letting in as much light as possible will make your home appear larger. Open up all of the windows and blinds to create the illusion of more space. Clean your windows to let in the maximum amount of light."
        },
        {
          "headline":"Move furniture to create more open areas on the floor.",
          "description":"If your furniture is taking up most of the floor space in a room, moving it around can make a big difference. Move each of the pieces so that there will be more visible floor space around them. Some options for arranging your furniture include:\nMoving your furniture to the center of a room if you only have a few small or medium sized items. For example, you could move a few chairs to the center of the room so that they are gathered around a coffee table. This will open up the space around the backs of the chairs. Placing larger furniture pieces at angles if you can’t arrange them another way. For example, you could turn your bed or sofa so it is at an angle to a wall. Moving furniture to the sides of the room if you want more space to walk through. For example, you could push your sofa and chairs in the living room to the perimeters of the room. Taking 1 or more pieces of furniture out of a room if there is very little floor or wall space. For example, you could take 1 seldom used chair out of the living room, or remove the nightstands from your bedroom."
        },
        {
          "headline":"Turn on all the lamps and lighting fixtures in a room to illuminate it.",
          "description":"More lamps in a room will also make the room seem bigger, but only if they are switched on. Turn on all of the lamps in your room. If you do not have very many lamps, consider adding a few more. Light fixtures can also make a room seem larger. You could switch these on as well."
        },
        {
          "headline":"Place something interesting in the corner of every room as a focal point.",
          "description":"Having an accent piece will help to draw the eye to that spot in the room. Place the accent piece in a corner of the room as far away from the door as possible. For example, you could place a decorative vase on a dresser in the far corner of a bedroom, or place an unusual object on a shelf in the corner of your home office."
        }
      ]
    },
    {
      "name":"Selecting Size-Enhancing Furniture",
      "steps":[
        {
          "headline":"Choose furniture with legs to create the look of more floor space.",
          "description":"Having some visible space under your furniture will help to make your rooms seems larger. Look for sofas, chairs, and other items that have legs rather than a base that completely covers the floor. Retro furniture often features this type of design, but you can find plenty of modern looking furniture pieces that are up off the ground, too."
        },
        {
          "headline":"Find furniture pieces that double as something else to save space.",
          "description":"Multi-functional furniture can also help to make a home seem bigger because you can maintain more floor and wall space as a result. Look for furniture items that can double as something else. For example, you could get an ottoman that doubles as a coffee table, or a desk with shelving in the sides."
        },
        {
          "headline":"Opt for 1 or 2 large pieces of furniture to enhance a small room.",
          "description":"While having a room filled with large furniture may dwarf a small space, 1 or 2 larger pieces of furniture can make the space seem larger. Get a long dining room table to place in your dining area to make the room seem expansive. The long table will create a sense of space even if the room is not very big. Choose bookcases that go all the way from the floor to the ceiling in rooms with low ceilings. This will make the ceilings seem higher than they are."
        },
        {
          "headline":"Choose clear tables and chairs to create the illusion of more space.",
          "description":"Having some clear furniture can also make a room seem bigger. You can see right through it and that creates the illusion of space. Try to find a clear end table, a clear accent chair, or even a clear dining set. If you cannot find clear items, the next best thing is items in the same color palette as the space. For example, if the walls in a room are light blue, then opt for furniture in a shade of light blue as well. This will trick the eye into thinking there is more wall and floor space."
        }
      ]
    },
    {
      "name":"Using Decorative Touches",
      "steps":[
        {
          "headline":"Opt for long curtains that match your walls to make ceilings look higher.",
          "description":"Curtains that go from the floor to the ceiling are best, but even curtains that go from just above the window to the floor will help. Make sure to get curtains that are in the same color palette as the room they will be in, such as white curtains for a white room or light green curtains in a light green room. Light, airy curtains will also help to enhance the size of your rooms. Opt for light materials, such as lightweight linen and cotton. If you don’t want your curtains to be the same color as your walls, another option is to get them in a similar color so that they are in the same palette. For example, if your walls are tan, then you could get light brown or cream colored curtains to maintain a neutral palette."
        },
        {
          "headline":"Place a mirror in every room to make the space seem larger.",
          "description":"Mirrors will make the rooms in your house seem bigger, so place a mirror in every room to take advantage of this effect. Place an accent mirror on a shelf in your living room, set up a full-length mirror in your bedroom, and mount a mirror on the wall of the entryway to your home. You could also look for furniture that has a mirror built into it, such as a coffee table with a mirror top or a dresser with an attached mirror."
        },
        {
          "headline":"Select rugs with small prints and solid colors to enhance the size of the room.",
          "description":"Large prints will dwarf a small room, so opt for small prints on rugs instead. Solid colors in the same palette as the room will also help to make the room appear larger. Opt for rugs that are darker than the walls and ceilings. This will help to draw your eye up and create a sense of space."
        },
        {
          "headline":"Try a neutral color palette to create the look of an expansive space.",
          "description":"A neutral color palette is a great way to enhance the size of a home. Try painting and decorating with shades of off-white, nude, beige, and tan. If you don’t like neutral palettes, light greens and blues are also good choices for enhancing the size of your rooms. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKatherine Tlapa\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInterior Designer\t\t\t\t\t\t\t\tKatherine Tlapa is an interior designer, currently working as a Design Specialist for Modsy, a design service based in San Francisco. She also runs her own DIY Home Design blog, My Eclectic Grace. She received her BFA in Interior Architecture from Ohio University in 2016. Katherine Tlapa\t\t\tInterior Designer\t\t\t\tYou can paint your rooms bright colors, but avoid very bold shades. Typically, small rooms should be painted a neutral or bright color to appear larger, as this will help reflect light around the space. However, avoid oversaturated colors, like cobalt blue or bright red, because these will make the space seem smaller."
        }
      ]
    },
    {
      "name":"Remodeling to Make Your Home Look Bigger",
      "steps":[
        {
          "headline":"Add a window or 2 to let in more light.",
          "description":"More windows equals more light, which will make your house look bigger. If your house doesn’t have very many windows, you might consider hiring someone to install another window or 2, or to expand the size of 1 or more existing windows with a replacement window. Try adding a window to wall without windows in your living room."
        },
        {
          "headline":"Paint the ceiling white or a bright color to draw the eye up.",
          "description":"A gleaming white ceiling will draw the eye upward and make a room seem larger, so you could do this for every room in your house. Another option is to paint your ceilings bright colors, such as lime green, orange, or yellow. Identify the color palette of each room to help you decide what color to paint your ceilings. For example, if the palette in your bedroom is light blue, then white or a very light blue would probably be best. Opt for a paint that is at least a couple of shades lighter than the paint on the walls."
        },
        {
          "headline":"Install wall-to-wall or ceiling-to-ceiling shelves for a spacious look.",
          "description":"If the shelving or countertops in your home are on the small side, this may be making your home seem smaller. By installing shelves that go from the floor to the ceiling or counters that go from one wall to another, you will create the illusion of more space. To make any room look bigger, try installing a series of side-by-side floating shelves on 1 wall of the room, or create a built-in bookcase for floor to ceiling shelving. If you want to make your kitchen look bigger, choose 1 side of your kitchen to install a wall-to-wall countertop."
        },
        {
          "headline":"Put down some striped flooring to make a room seem like it is bigger.",
          "description":"Striped floors create the illusion of a room that goes on forever, even if it is somewhat small. If you are in the market for new flooring, opt for a striped pattern. For example, you could go with some classic black and white striped flooring, or you could choose striped flooring in the color palette for the room, such as blue and green striped flooring for a room with a blue and green color palette."
        },
        {
          "headline":"Remove unnecessary doors to open up your floorplan.",
          "description":"If there are doors in your home that you do not need, such as a door to the dining room or living room, then removing the door might help to make the space seem bigger. Try taking the door off the hinges for a day to see if this helps. If it does, then you could permanently remove the door and any others that you don’t need."
        }
      ]
    }
  ],
  "text":" Using Quick Staging Techniques Declutter your home to maintain some empty space. A messy house will look smaller than a clean house because clutter reduces visible floor and wall space. Ideally, each shelf, table, desk, or other furniture item should have some empty space on it. For example, you could place a single book on a coffee table in your living room, or a single vase on a dresser, or a single clay sculpture on a bookshelf. To declutter a room, try setting up 3 boxes: 1 for items to keep, 1 for items to donate, and 1 for items to throw away. Open the curtains and blinds to let in more light. Letting in as much light as possible will make your home appear larger. Open up all of the windows and blinds to create the illusion of more space. Clean your windows to let in the maximum amount of light. Move furniture to create more open areas on the floor. If your furniture is taking up most of the floor space in a room, moving it around can make a big difference. Move each of the pieces so that there will be more visible floor space around them. Some options for arranging your furniture include:\nMoving your furniture to the center of a room if you only have a few small or medium sized items. For example, you could move a few chairs to the center of the room so that they are gathered around a coffee table. This will open up the space around the backs of the chairs. Placing larger furniture pieces at angles if you can’t arrange them another way. For example, you could turn your bed or sofa so it is at an angle to a wall. Moving furniture to the sides of the room if you want more space to walk through. For example, you could push your sofa and chairs in the living room to the perimeters of the room. Taking 1 or more pieces of furniture out of a room if there is very little floor or wall space. For example, you could take 1 seldom used chair out of the living room, or remove the nightstands from your bedroom. Turn on all the lamps and lighting fixtures in a room to illuminate it. More lamps in a room will also make the room seem bigger, but only if they are switched on. Turn on all of the lamps in your room. If you do not have very many lamps, consider adding a few more. Light fixtures can also make a room seem larger. You could switch these on as well. Place something interesting in the corner of every room as a focal point. Having an accent piece will help to draw the eye to that spot in the room. Place the accent piece in a corner of the room as far away from the door as possible. For example, you could place a decorative vase on a dresser in the far corner of a bedroom, or place an unusual object on a shelf in the corner of your home office. Selecting Size-Enhancing Furniture Choose furniture with legs to create the look of more floor space. Having some visible space under your furniture will help to make your rooms seems larger. Look for sofas, chairs, and other items that have legs rather than a base that completely covers the floor. Retro furniture often features this type of design, but you can find plenty of modern looking furniture pieces that are up off the ground, too. Find furniture pieces that double as something else to save space. Multi-functional furniture can also help to make a home seem bigger because you can maintain more floor and wall space as a result. Look for furniture items that can double as something else. For example, you could get an ottoman that doubles as a coffee table, or a desk with shelving in the sides. Opt for 1 or 2 large pieces of furniture to enhance a small room. While having a room filled with large furniture may dwarf a small space, 1 or 2 larger pieces of furniture can make the space seem larger. Get a long dining room table to place in your dining area to make the room seem expansive. The long table will create a sense of space even if the room is not very big. Choose bookcases that go all the way from the floor to the ceiling in rooms with low ceilings. This will make the ceilings seem higher than they are. Choose clear tables and chairs to create the illusion of more space. Having some clear furniture can also make a room seem bigger. You can see right through it and that creates the illusion of space. Try to find a clear end table, a clear accent chair, or even a clear dining set. If you cannot find clear items, the next best thing is items in the same color palette as the space. For example, if the walls in a room are light blue, then opt for furniture in a shade of light blue as well. This will trick the eye into thinking there is more wall and floor space. Using Decorative Touches Opt for long curtains that match your walls to make ceilings look higher. Curtains that go from the floor to the ceiling are best, but even curtains that go from just above the window to the floor will help. Make sure to get curtains that are in the same color palette as the room they will be in, such as white curtains for a white room or light green curtains in a light green room. Light, airy curtains will also help to enhance the size of your rooms. Opt for light materials, such as lightweight linen and cotton. If you don’t want your curtains to be the same color as your walls, another option is to get them in a similar color so that they are in the same palette. For example, if your walls are tan, then you could get light brown or cream colored curtains to maintain a neutral palette. Place a mirror in every room to make the space seem larger. Mirrors will make the rooms in your house seem bigger, so place a mirror in every room to take advantage of this effect. Place an accent mirror on a shelf in your living room, set up a full-length mirror in your bedroom, and mount a mirror on the wall of the entryway to your home. You could also look for furniture that has a mirror built into it, such as a coffee table with a mirror top or a dresser with an attached mirror. Select rugs with small prints and solid colors to enhance the size of the room. Large prints will dwarf a small room, so opt for small prints on rugs instead. Solid colors in the same palette as the room will also help to make the room appear larger. Opt for rugs that are darker than the walls and ceilings. This will help to draw your eye up and create a sense of space. Try a neutral color palette to create the look of an expansive space. A neutral color palette is a great way to enhance the size of a home. Try painting and decorating with shades of off-white, nude, beige, and tan. If you don’t like neutral palettes, light greens and blues are also good choices for enhancing the size of your rooms. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKatherine Tlapa\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInterior Designer\t\t\t\t\t\t\t\tKatherine Tlapa is an interior designer, currently working as a Design Specialist for Modsy, a design service based in San Francisco. She also runs her own DIY Home Design blog, My Eclectic Grace. She received her BFA in Interior Architecture from Ohio University in 2016. Katherine Tlapa\t\t\tInterior Designer\t\t\t\tYou can paint your rooms bright colors, but avoid very bold shades. Typically, small rooms should be painted a neutral or bright color to appear larger, as this will help reflect light around the space. However, avoid oversaturated colors, like cobalt blue or bright red, because these will make the space seem smaller. Remodeling to Make Your Home Look Bigger Add a window or 2 to let in more light. More windows equals more light, which will make your house look bigger. If your house doesn’t have very many windows, you might consider hiring someone to install another window or 2, or to expand the size of 1 or more existing windows with a replacement window. Try adding a window to wall without windows in your living room. Paint the ceiling white or a bright color to draw the eye up. A gleaming white ceiling will draw the eye upward and make a room seem larger, so you could do this for every room in your house. Another option is to paint your ceilings bright colors, such as lime green, orange, or yellow. Identify the color palette of each room to help you decide what color to paint your ceilings. For example, if the palette in your bedroom is light blue, then white or a very light blue would probably be best. Opt for a paint that is at least a couple of shades lighter than the paint on the walls. Install wall-to-wall or ceiling-to-ceiling shelves for a spacious look. If the shelving or countertops in your home are on the small side, this may be making your home seem smaller. By installing shelves that go from the floor to the ceiling or counters that go from one wall to another, you will create the illusion of more space. To make any room look bigger, try installing a series of side-by-side floating shelves on 1 wall of the room, or create a built-in bookcase for floor to ceiling shelving. If you want to make your kitchen look bigger, choose 1 side of your kitchen to install a wall-to-wall countertop. Put down some striped flooring to make a room seem like it is bigger. Striped floors create the illusion of a room that goes on forever, even if it is somewhat small. If you are in the market for new flooring, opt for a striped pattern. For example, you could go with some classic black and white striped flooring, or you could choose striped flooring in the color palette for the room, such as blue and green striped flooring for a room with a blue and green color palette. Remove unnecessary doors to open up your floorplan. If there are doors in your home that you do not need, such as a door to the dining room or living room, then removing the door might help to make the space seem bigger. Try taking the door off the hinges for a day to see if this helps. If it does, then you could permanently remove the door and any others that you don’t need.",
  "tyn_model":[
    "furniture",
    "curtains",
    "mirror",
    "lamps",
    "chairs",
    "rugs",
    "interior designer",
    "shelves",
    "vase",
    "paint",
    "coffee table",
    "sofa",
    "light fixtures",
    "sofas",
    "ottoman",
    "desk",
    "dining room table",
    "table",
    "bookcases",
    "mirrors",
    "interior architecture",
    "window",
    "flooring"
  ],
  "tyn_section":[

  ]
}