{
  "title":"How to Make Your Own Scrapbook",
  "url":"https://www.wikihow.com/Make-Your-Own-Scrapbook",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Scrapbooks"
  ],
  "methods":[
    {
      "name":"Choosing Materials to Fit Your Needs",
      "steps":[
        {
          "headline":"Pick a scrapbook style.",
          "description":"Albums come in a few different forms, so you want to think about what will work for you in terms on where you'll store your album and how you want the interior to flow. Three-ring style. You can use a regular three-ring photo album as a scrapbook. They easily hold 8.5”x11” pages/paper, which are inexpensive, and they also stand up nicely on a bookshelf so they're easy to store. You can add pages to a three-ring binder anytime and in any place within the album. You can slip your pages easily into standard-size, acid-free photo-safe protective sheets to prevent wear and tear. The biggest downside is that there will be a gap in your two-page layouts where the rings are, so the look won't be seamless. Post-bound style. Post-bound scrapbooks are held together by small metal posts that you screw and unscrew in order to add new pages to your album. Just like a three-ring style, you can add pages anywhere within the album; it just takes a little more effort to unscrew and screw again the posts to do so. That being said, this styles does offer an almost seamless two-page spread because when the album is open, the pages lay closer to each other. You can easily insert (top-load) your finished pages into the album's protective sheets. Bound with non-removable pages style. You can buy a scrapbook album with a fixed number of pages -- meaning you cannot add or remove pages from this type of album. That means you have to plan and execute your pages well since you can't simply pull out a page if you make a mistake. These albums don't come with sheet protectors, which can be good or bad. It's an advantage if you like to use bulkier embellishments or want to glue envelopes to the page and fill them with photos. Of course the downside is that without the sheet protectors, you sacrifice some level of protection and must be sure to treat your pages with care."
        },
        {
          "headline":"Decide on a size.",
          "description":"There are two standard sizes for scrapbooks:  8.5\"x11\" and 12”x12” as well as a number of specialty sizes. The style of album you want may dictate what size you choose. 8.5\"x11\". 8.5”x11” albums are the most economical choice. The background papers are less expensive than 12\"x12\" because they're smaller. You can also save money by buying your photo-safe sheet protectors from office supply stores since they're a standard size. Finally, you can use an inexpensive three-ring photo album to hold your 8.5”x11” pages or purchase a three-ring notebook from the discount office supply store to serve as an album. 12'x12\". This size album has become increasingly popular, and as a result, there are more decorative background papers in this size than in the 8.5”x11”. Another advantage of the 12\"x12\":  you can also fit more photos on a page. Specialty sizes. You can find scrapbooks in a whole range of sizes from pocket-sized to those that look like oversize coffee-table books. These styles are typically bound with non-removable pages. They can be good choices if you want to devote an album to a single event such as the birth of a baby or a family reunion celebration."
        },
        {
          "headline":"Pick your paper.",
          "description":"This is one of the most fun and potentially most overwhelming steps in your scrapbook-making process. There are hundreds and hundreds of papers to choose from. There are papers with holiday themes, sports themes, hobby themes, floral patterns, geometric patterns--the list goes on and on. Make your choices based on what appeals to you or what you have in mind as the themes for some of your page layouts. You can buy your scrapbook paper in packs or by the sheet. You don't have to purchase your paper from a craft or art supply store. If you see something you like anywhere, pick it up. Just be sure the paper is marked \"archival quality\" or \"acid free\" because the acids in many types of paper can damage photos and other mementos over time. Buy a bit more than you need -- especially of a particular design you like so that you'll have a back-up in case you ruin a page. You might want to think in terms of multiples so that you have at least two of the same design. Some people prefer to use two sheets of the same paper when they create the spreads in their albums. Or pick up the same design paper in two different complementary colors. For example, the same snowflake pattern in red and in green."
        },
        {
          "headline":"Cover the basics.",
          "description":"Technically, a scrapbook can take on any form you can envision. Will yours be made from newspaper and macaroni? Regardless of what you see in your scrapbooking future, there are a few basic things you need: scissors, glue, and cardstock. Scissors. Plan to spend between $5 to $15 on a pair of good quality, sharp, straight-edge scissors. You'll be using your scissors a lot, so it makes sense to put a little bit of money into this important tool. You can invest in a paper trimmer or paper cutter if you prefer. Depending on size and quality, they could run from $10 to $70. There are tons of decorative-edge scissors you can buy to add some interest to the edges of your paper or photos when you cut them. They can be a lot of fun, but they are a nice-to-have rather than a must-have item. Adhesive. There are a variety of ways to stick your images and embellishments to the page, but you're likely to need nothing more than a good glue stick. It's easy to use and comes in an acid-free, photo-safe formula. If you want to be able to remove photos from your scrapbook pages, purchase photo corners. You insert the corners of your photograph into the paper corners and glue them to the page. Then you can remove the picture by gently pulling its edges out from inside the corners, which stay in place on the page. Cardstock. Pick up a pack of multi-colored 8.5\"x11\" Cardstock. You can use it to mat your photos, create tags and blocks where you can write text to add to your pages. If you're using an 8.5\"x11\" scrapbook album, you can use the Cardstock as solid background pages for your album."
        },
        {
          "headline":"Fill your decorating toolbox.",
          "description":"You'll probably want a few other basic supplies to get started scrapbooking. Scrapbooking can become an expensive hobby--there are lots and lots of supplies out there, and you can have a ton of fun adding to your collection. But the truth is, you only need a few basic items to make a truly beautiful scrapbook. Plastic stencils. Get one plastic stencil with multiple, standard shapes (circles, ovals, squares, rectangles, diamonds, etc.). Use this to \"crop\" your photos and create shapes out of Cardstock for adding titles and creating text boxes on your pages. Markers. You need at least one good black marker for journaling and titling your pages. If you can, pick up a few different colors (stay away from hard-to-read shades like yellow or light pink) in a couple of different tip thicknesses. Embellishments. You could spend a small fortune on embellishments. Charms, decorative tags, die-cuts, jewels, studs--they're all out there and then some. You absolutely do not need store-bought embellishments to make a beautiful and creative scrapbook. Browse through the selection at your local craft store, but don't feel as though your pages won't be complete without them. Look around your house for items you can use to embellish a page. Pictures cut out from greeting cards, old costume jewelry pieces and pieces of ribbon are all things you may have lying around that you could incorporate into your page designs."
        }
      ]
    },
    {
      "name":"Creating Your Pages",
      "steps":[
        {
          "headline":"Decide on a theme or message.",
          "description":"You probably have a big stash of photos and other materials that you want to organize in your scrapbook. Now's the time get them out and make some decisions about how you want to proceed. Let your materials dictate your direction. Go through your photos, cards, ribbons, awards, newspaper clippings and other materials and group related things together based on their relevance to an occasion or event (graduation, summer vacation, Christmas, etc.) Choose the background paper that works best with each layout idea. Decide on a color and theme ahead of time. Maybe you had a wedding with a black and white theme or your sister just gave birth to a baby girl. Pull background papers from your collection in the color(s) and styles that work with that theme and go through your materials and gather together all the photos and other memorabilia that you'll use on those pages."
        },
        {
          "headline":"Play around with layout.",
          "description":"Before you jump in and start gluing things to paper, you want to have an idea in mind for your page layout. Some people plan everything down to the last detail before they begin attaching things to the page; other people develop a general idea that includes the basics and then allow the details of the layout to develop on their own. Get a plain piece of paper the same size as your page. Use a pencil to sketch out a plan of how you want your layout to look. Pencil in the places where you'll put your photos, title, text and other pictures. You can simply rough in your photo placements and take it from there or go in a more detailed direction and plan everything including the placement of all embellishments or other decorative bits. Experiment a little and work in a way that feels creative and comfortable for you."
        },
        {
          "headline":"Think in terms of spreads.",
          "description":"A spread is made up of two side-by-side pages in your album. Instead of treating each page as stand-alone, consider what the pages will look like when the album is open and when they're displayed next to one another. Consider creating your rough layouts two at a time so you can plan your spreads. When you take a spread into account, it's easier to avoid creating pages that clash or compete with one another for attention. While you don't have to go as far as to use the same background paper for every spread, at least choose papers that coordinate either in color or design."
        },
        {
          "headline":"Crop your photos.",
          "description":"Once you've decided where your photos will go on the page, you may have to size them down in order to make them fit. Use your scissors, paper trimmer or plastic template to create the size and shape you want for your photographs. If you're concerned about ruining an important photo, make a copy of it and use that in your album. Or take a picture of your picture and use the duplicate image."
        },
        {
          "headline":"Follow your layout.",
          "description":"Once you have your photos cropped, lay everything in place as per your rough layout. Something that initially looked good on paper, may not completely appeal to you once you see it in place on the page, so be willing to move things around a bit if you feel as though you need to. Be sure you're 100% happy before you glue anything in place."
        },
        {
          "headline":"Add text.",
          "description":"You might want to add a title, captions or a short block of text that sums up your memories in a catchy way. You may have already planned for these in your sample layout, or you chose to wait and see where you'd like to put text after you had your photos in place. Don't write too much. Your photos and other images/materials will likely tell the story of your page, so limit your text to one or two sentences that sum up something interesting you want to remember about the event/experience. Consider including the date somewhere on your page. You may find it difficult to believe that you'll ever forget when something took place, but life gets busy and experiences accumulate, and you may find yourself puzzling to come up with a date. Besides, scrapbooks can be passed down through the generations, and those who enjoy them in the years to come will appreciate pages that are dated."
        },
        {
          "headline":"Add embellishments.",
          "description":"Embellishments can add interest, support your theme, guide the eye and create unity among pages with a common theme. Ultimately, if you decide to embellish your layouts, you should do it in a way that you find visually pleasing and meaningful. There are a few ideas for using embellishments to give them added impact. Group them. In the same way that collections are best displayed in groups, so are embellishments. Consider clustering decorative elements together on the page for added emphasis. Depending on the number of embellishments you're using, you can create a couple of groups on the page. When you do, consider following the rule of three--the eye likes things grouped in threes or at least in uneven numbers. Put them in the corners. Put embellishments in the corners of photos or text blocks to help anchor them to the page. They'll give the images or text a bit more \"weight\" and ground them in place. You can also put embellishments in the corners of your pages. If you have several pages that are a part of the same theme, using the same decorative elements in the corners of each of those pages helps to unify them. Stack or layer them. Glue two or three decorative elements on top of one another. Keep in mind that this will add thickness to your page, so choose your items with care. If you're using a bound album with no removable pages, you won't have plastic protective page covers to contend with, so you could allow for a little more bulk."
        }
      ]
    },
    {
      "name":"Taking it to the Next Level",
      "steps":[
        {
          "headline":"Take a class.",
          "description":"Scrapbooking classes are often held in craft stores, at rec centers and by scrapbooking \"coaches.\" You can also purchase idea books and DVDs. If you have some extra time and money to invest, you can also participate in weekend workshops, camp sessions or retreats."
        },
        {
          "headline":"Network.",
          "description":"One of the best ways to grow as a scrapbook artist is to learn from and share ideas with other scrapbook lovers. Visit scrapbooking blogs, social network pages devoted to the craft, Pinterest boards or join organizations such as the Scrapbooking and Paper Crafting Society. If you take a class or simply spend some time hanging out in the paper aisle of your local craft or art supply store, you're likely to run into other scrapbook hobbyists. See if they're part of a club you can join or consider starting your own scrapbook club."
        },
        {
          "headline":"Attend a scrapbook convention.",
          "description":"There are several scrapbook conventions that are held annually and offer attendees workshops, lectures and vendors displaying the latest supplies. Look into the Creating Keepsakes (CK) Scrapbook Conventions, Scrapbook Expo, and Great American Scrapbook Conventions."
        },
        {
          "headline":"Turn pro.",
          "description":"If you enjoy scrapbooking and want to share your skills with others, think about stepping up and offering your services as an scrapbooking professional. Become a teacher. Teaching someone how to make a scrapbook means you're not only good at what you do but are able to explain and demonstrate scrapbooking tools, approaches and designs. You'll also need patience in working with beginners and a positive and encouraging demeanor. Finally, you'll have to keep up with all the latest trends and materials so that you can share those with your students.Check with your local craft or art supply store to see if they have a need for a scrapbook instructor. Otherwise, consider securing your own space and offering a one-day or weekend workshop. Advertise online and in local establishments."
        },
        {
          "headline":"Make scrapbooks for others.",
          "description":"Not everyone has the patience, creativity and skill to make a scrapbook, and they're willing to pay someone who can in order to preserve their memories. Advertise your services online or set up a booth at a local street fair or craft fair. Bring the very best examples of your work along with plenty of business cards. You can create a website your your business. Post photos of your best scrapbook layouts or create digital pages so potential clients can see examples of your work. Work as a scrapbook writer. If you're good with words, consider becoming a freelance writer. Websites devoted to scrapbooking need writers to contribute content, or you could write and sell your own ebook. There are a number of specialty magazines devoted to scrapbooking, so you may also be able to sell your articles to magazines or journals. To come up with article ideas, go to scrapbooking discussion board to see what kinds of questions people have and what the hot topics are. Attend conventions and talk to product reps to see if there is a need in their company for someone to write product-related articles. Become an event planner. If you have strong organizational skills and a keen sense of what scrapbookers want to know and see, you may be able to find a position coordinating a scrapbooking expo or retreat. You could offer your services as an independent contractor or try to secure a job with a company that plans these kinds of events."
        }
      ]
    }
  ],
  "text":" Choosing Materials to Fit Your Needs Pick a scrapbook style. Albums come in a few different forms, so you want to think about what will work for you in terms on where you'll store your album and how you want the interior to flow. Three-ring style. You can use a regular three-ring photo album as a scrapbook. They easily hold 8.5”x11” pages/paper, which are inexpensive, and they also stand up nicely on a bookshelf so they're easy to store. You can add pages to a three-ring binder anytime and in any place within the album. You can slip your pages easily into standard-size, acid-free photo-safe protective sheets to prevent wear and tear. The biggest downside is that there will be a gap in your two-page layouts where the rings are, so the look won't be seamless. Post-bound style. Post-bound scrapbooks are held together by small metal posts that you screw and unscrew in order to add new pages to your album. Just like a three-ring style, you can add pages anywhere within the album; it just takes a little more effort to unscrew and screw again the posts to do so. That being said, this styles does offer an almost seamless two-page spread because when the album is open, the pages lay closer to each other. You can easily insert (top-load) your finished pages into the album's protective sheets. Bound with non-removable pages style. You can buy a scrapbook album with a fixed number of pages -- meaning you cannot add or remove pages from this type of album. That means you have to plan and execute your pages well since you can't simply pull out a page if you make a mistake. These albums don't come with sheet protectors, which can be good or bad. It's an advantage if you like to use bulkier embellishments or want to glue envelopes to the page and fill them with photos. Of course the downside is that without the sheet protectors, you sacrifice some level of protection and must be sure to treat your pages with care. Decide on a size. There are two standard sizes for scrapbooks:  8.5\"x11\" and 12”x12” as well as a number of specialty sizes. The style of album you want may dictate what size you choose. 8.5\"x11\". 8.5”x11” albums are the most economical choice. The background papers are less expensive than 12\"x12\" because they're smaller. You can also save money by buying your photo-safe sheet protectors from office supply stores since they're a standard size. Finally, you can use an inexpensive three-ring photo album to hold your 8.5”x11” pages or purchase a three-ring notebook from the discount office supply store to serve as an album. 12'x12\". This size album has become increasingly popular, and as a result, there are more decorative background papers in this size than in the 8.5”x11”. Another advantage of the 12\"x12\":  you can also fit more photos on a page. Specialty sizes. You can find scrapbooks in a whole range of sizes from pocket-sized to those that look like oversize coffee-table books. These styles are typically bound with non-removable pages. They can be good choices if you want to devote an album to a single event such as the birth of a baby or a family reunion celebration. Pick your paper. This is one of the most fun and potentially most overwhelming steps in your scrapbook-making process. There are hundreds and hundreds of papers to choose from. There are papers with holiday themes, sports themes, hobby themes, floral patterns, geometric patterns--the list goes on and on. Make your choices based on what appeals to you or what you have in mind as the themes for some of your page layouts. You can buy your scrapbook paper in packs or by the sheet. You don't have to purchase your paper from a craft or art supply store. If you see something you like anywhere, pick it up. Just be sure the paper is marked \"archival quality\" or \"acid free\" because the acids in many types of paper can damage photos and other mementos over time. Buy a bit more than you need -- especially of a particular design you like so that you'll have a back-up in case you ruin a page. You might want to think in terms of multiples so that you have at least two of the same design. Some people prefer to use two sheets of the same paper when they create the spreads in their albums. Or pick up the same design paper in two different complementary colors. For example, the same snowflake pattern in red and in green. Cover the basics. Technically, a scrapbook can take on any form you can envision. Will yours be made from newspaper and macaroni? Regardless of what you see in your scrapbooking future, there are a few basic things you need: scissors, glue, and cardstock. Scissors. Plan to spend between $5 to $15 on a pair of good quality, sharp, straight-edge scissors. You'll be using your scissors a lot, so it makes sense to put a little bit of money into this important tool. You can invest in a paper trimmer or paper cutter if you prefer. Depending on size and quality, they could run from $10 to $70. There are tons of decorative-edge scissors you can buy to add some interest to the edges of your paper or photos when you cut them. They can be a lot of fun, but they are a nice-to-have rather than a must-have item. Adhesive. There are a variety of ways to stick your images and embellishments to the page, but you're likely to need nothing more than a good glue stick. It's easy to use and comes in an acid-free, photo-safe formula. If you want to be able to remove photos from your scrapbook pages, purchase photo corners. You insert the corners of your photograph into the paper corners and glue them to the page. Then you can remove the picture by gently pulling its edges out from inside the corners, which stay in place on the page. Cardstock. Pick up a pack of multi-colored 8.5\"x11\" Cardstock. You can use it to mat your photos, create tags and blocks where you can write text to add to your pages. If you're using an 8.5\"x11\" scrapbook album, you can use the Cardstock as solid background pages for your album. Fill your decorating toolbox. You'll probably want a few other basic supplies to get started scrapbooking. Scrapbooking can become an expensive hobby--there are lots and lots of supplies out there, and you can have a ton of fun adding to your collection. But the truth is, you only need a few basic items to make a truly beautiful scrapbook. Plastic stencils. Get one plastic stencil with multiple, standard shapes (circles, ovals, squares, rectangles, diamonds, etc.). Use this to \"crop\" your photos and create shapes out of Cardstock for adding titles and creating text boxes on your pages. Markers. You need at least one good black marker for journaling and titling your pages. If you can, pick up a few different colors (stay away from hard-to-read shades like yellow or light pink) in a couple of different tip thicknesses. Embellishments. You could spend a small fortune on embellishments. Charms, decorative tags, die-cuts, jewels, studs--they're all out there and then some. You absolutely do not need store-bought embellishments to make a beautiful and creative scrapbook. Browse through the selection at your local craft store, but don't feel as though your pages won't be complete without them. Look around your house for items you can use to embellish a page. Pictures cut out from greeting cards, old costume jewelry pieces and pieces of ribbon are all things you may have lying around that you could incorporate into your page designs. Creating Your Pages Decide on a theme or message. You probably have a big stash of photos and other materials that you want to organize in your scrapbook. Now's the time get them out and make some decisions about how you want to proceed. Let your materials dictate your direction. Go through your photos, cards, ribbons, awards, newspaper clippings and other materials and group related things together based on their relevance to an occasion or event (graduation, summer vacation, Christmas, etc.) Choose the background paper that works best with each layout idea. Decide on a color and theme ahead of time. Maybe you had a wedding with a black and white theme or your sister just gave birth to a baby girl. Pull background papers from your collection in the color(s) and styles that work with that theme and go through your materials and gather together all the photos and other memorabilia that you'll use on those pages. Play around with layout. Before you jump in and start gluing things to paper, you want to have an idea in mind for your page layout. Some people plan everything down to the last detail before they begin attaching things to the page; other people develop a general idea that includes the basics and then allow the details of the layout to develop on their own. Get a plain piece of paper the same size as your page. Use a pencil to sketch out a plan of how you want your layout to look. Pencil in the places where you'll put your photos, title, text and other pictures. You can simply rough in your photo placements and take it from there or go in a more detailed direction and plan everything including the placement of all embellishments or other decorative bits. Experiment a little and work in a way that feels creative and comfortable for you. Think in terms of spreads. A spread is made up of two side-by-side pages in your album. Instead of treating each page as stand-alone, consider what the pages will look like when the album is open and when they're displayed next to one another. Consider creating your rough layouts two at a time so you can plan your spreads. When you take a spread into account, it's easier to avoid creating pages that clash or compete with one another for attention. While you don't have to go as far as to use the same background paper for every spread, at least choose papers that coordinate either in color or design. Crop your photos. Once you've decided where your photos will go on the page, you may have to size them down in order to make them fit. Use your scissors, paper trimmer or plastic template to create the size and shape you want for your photographs. If you're concerned about ruining an important photo, make a copy of it and use that in your album. Or take a picture of your picture and use the duplicate image. Follow your layout. Once you have your photos cropped, lay everything in place as per your rough layout. Something that initially looked good on paper, may not completely appeal to you once you see it in place on the page, so be willing to move things around a bit if you feel as though you need to. Be sure you're 100% happy before you glue anything in place. Add text. You might want to add a title, captions or a short block of text that sums up your memories in a catchy way. You may have already planned for these in your sample layout, or you chose to wait and see where you'd like to put text after you had your photos in place. Don't write too much. Your photos and other images/materials will likely tell the story of your page, so limit your text to one or two sentences that sum up something interesting you want to remember about the event/experience. Consider including the date somewhere on your page. You may find it difficult to believe that you'll ever forget when something took place, but life gets busy and experiences accumulate, and you may find yourself puzzling to come up with a date. Besides, scrapbooks can be passed down through the generations, and those who enjoy them in the years to come will appreciate pages that are dated. Add embellishments. Embellishments can add interest, support your theme, guide the eye and create unity among pages with a common theme. Ultimately, if you decide to embellish your layouts, you should do it in a way that you find visually pleasing and meaningful. There are a few ideas for using embellishments to give them added impact. Group them. In the same way that collections are best displayed in groups, so are embellishments. Consider clustering decorative elements together on the page for added emphasis. Depending on the number of embellishments you're using, you can create a couple of groups on the page. When you do, consider following the rule of three--the eye likes things grouped in threes or at least in uneven numbers. Put them in the corners. Put embellishments in the corners of photos or text blocks to help anchor them to the page. They'll give the images or text a bit more \"weight\" and ground them in place. You can also put embellishments in the corners of your pages. If you have several pages that are a part of the same theme, using the same decorative elements in the corners of each of those pages helps to unify them. Stack or layer them. Glue two or three decorative elements on top of one another. Keep in mind that this will add thickness to your page, so choose your items with care. If you're using a bound album with no removable pages, you won't have plastic protective page covers to contend with, so you could allow for a little more bulk. Taking it to the Next Level Take a class. Scrapbooking classes are often held in craft stores, at rec centers and by scrapbooking \"coaches.\" You can also purchase idea books and DVDs. If you have some extra time and money to invest, you can also participate in weekend workshops, camp sessions or retreats. Network. One of the best ways to grow as a scrapbook artist is to learn from and share ideas with other scrapbook lovers. Visit scrapbooking blogs, social network pages devoted to the craft, Pinterest boards or join organizations such as the Scrapbooking and Paper Crafting Society. If you take a class or simply spend some time hanging out in the paper aisle of your local craft or art supply store, you're likely to run into other scrapbook hobbyists. See if they're part of a club you can join or consider starting your own scrapbook club. Attend a scrapbook convention. There are several scrapbook conventions that are held annually and offer attendees workshops, lectures and vendors displaying the latest supplies. Look into the Creating Keepsakes (CK) Scrapbook Conventions, Scrapbook Expo, and Great American Scrapbook Conventions. Turn pro. If you enjoy scrapbooking and want to share your skills with others, think about stepping up and offering your services as an scrapbooking professional. Become a teacher. Teaching someone how to make a scrapbook means you're not only good at what you do but are able to explain and demonstrate scrapbooking tools, approaches and designs. You'll also need patience in working with beginners and a positive and encouraging demeanor. Finally, you'll have to keep up with all the latest trends and materials so that you can share those with your students.Check with your local craft or art supply store to see if they have a need for a scrapbook instructor. Otherwise, consider securing your own space and offering a one-day or weekend workshop. Advertise online and in local establishments. Make scrapbooks for others. Not everyone has the patience, creativity and skill to make a scrapbook, and they're willing to pay someone who can in order to preserve their memories. Advertise your services online or set up a booth at a local street fair or craft fair. Bring the very best examples of your work along with plenty of business cards. You can create a website your your business. Post photos of your best scrapbook layouts or create digital pages so potential clients can see examples of your work. Work as a scrapbook writer. If you're good with words, consider becoming a freelance writer. Websites devoted to scrapbooking need writers to contribute content, or you could write and sell your own ebook. There are a number of specialty magazines devoted to scrapbooking, so you may also be able to sell your articles to magazines or journals. To come up with article ideas, go to scrapbooking discussion board to see what kinds of questions people have and what the hot topics are. Attend conventions and talk to product reps to see if there is a need in their company for someone to write product-related articles. Become an event planner. If you have strong organizational skills and a keen sense of what scrapbookers want to know and see, you may be able to find a position coordinating a scrapbooking expo or retreat. You could offer your services as an independent contractor or try to secure a job with a company that plans these kinds of events.",
  "tyn_model":[
    "paper",
    "scissors",
    "cardstock",
    "embellishments",
    "scrapbooks",
    "papers",
    "three-ring photo album",
    "” pages",
    "sheet protectors",
    "glue",
    "pencil",
    "scrapbook",
    "scrapbook style",
    "three-ring binder",
    "scrapbook album",
    "” as",
    "” albums",
    "photo-safe sheet protectors",
    "three-ring notebook",
    "”.",
    "scrapbook-",
    "scrapbook paper",
    "newspaper",
    "adhesive",
    "glue stick",
    "markers",
    "black marker",
    "jewels",
    "ribbon",
    "cards",
    "ribbons",
    "background papers",
    "paper trimmer",
    "scrapbooking \"",
    "scrapbook artist",
    "scrapbook lovers",
    "scrapbooking and paper crafting",
    "scrapbook hobbyists",
    "scrapbook club",
    "scrapbook convention",
    "scrapbook conventions",
    "scrapbook expo",
    "scrapbooking professional",
    "scrapbooking tools",
    "scrapbook instructor",
    "scrapbook writer",
    "scrapbooking discussion",
    "scrapbooking expo"
  ],
  "tyn_section":[

  ]
}