{
  "title":"How to Make a Chocolate and Cookie Layer Cake",
  "url":"https://www.wikihow.com/Make-a-Chocolate-and-Cookie-Layer-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Chocolate Cakes"
  ],
  "parts":[
    {
      "name":"Preparing the Chocolate Cake",
      "steps":[
        {
          "headline":"Preheat the oven to 350 °F (177 °C).",
          "description":"Grease and flour two round nine-inch cake pans and set aside."
        },
        {
          "headline":"Sift the dry ingredients.",
          "description":"Using a whisk, sift the flour, sugar, cocoa, baking powder, and baking soda together in a large bowl."
        },
        {
          "headline":"Mix in the wet ingredients.",
          "description":"Crack in the eggs and then pour in the milk, vegetable oil, and vanilla extract. Use an electric hand mixer to beat the ingredients together for about two minutes, or until fully combined."
        },
        {
          "headline":"Stir in the boiling water with a spoon.",
          "description":"The water will thin the cake batter; this is normal."
        },
        {
          "headline":"Pour the cake batter into the two pans.",
          "description":"Use a rubber spatula to scrape out the leftover cake batter and get it into the pans."
        },
        {
          "headline":"Allow the cake to bake for 30 to 35 minutes.",
          "description":"The baking time may vary, but if a toothpick poked into the center of the cake comes out clean, then the cake is done baking."
        },
        {
          "headline":"Allow the cakes to cool for 10 minutes.",
          "description":""
        },
        {
          "headline":"Remove the cakes from their pans.",
          "description":"Take a knife and run it along the edges of the cake pans to slightly dislodge the cakes, then place a wire rack over the top of the pans and flip the pans over. Carefully remove the cake pans from the cakes and allow the cakes to fully cool."
        }
      ]
    },
    {
      "name":"Preparing the Cookie Cake",
      "steps":[
        {
          "headline":"Preheat the oven to 350 °F (177 °C).",
          "description":"Grease a nine-inch cake pan and set aside."
        },
        {
          "headline":"Cream the butter.",
          "description":"Using an electric mixer, cream the butter in a large bowl until it's creamy and smooth."
        },
        {
          "headline":"Blend in the brown sugar on medium speed until smooth.",
          "description":""
        },
        {
          "headline":"Combine in the wet ingredients.",
          "description":"Crack in the egg, then add in the egg yolk and vanilla, and mix thoroughly on medium speed. It's recommended to make sure the eggs are room temperature before you add them in, as this will make sure the egg is blended in evenly and will result in a consistent texture in the cookie cake."
        },
        {
          "headline":"Sift together the dry ingredients.",
          "description":"Using a whisk, sift the flour, cornstarch, and baking soda together in a separate bowl."
        },
        {
          "headline":"Slowly combine the wet ingredients with the dry ingredients.",
          "description":"The dough will be thick, which is normal."
        },
        {
          "headline":"Fold in the chocolate chips.",
          "description":""
        },
        {
          "headline":"Press the cookie dough into the cake pan.",
          "description":"Make sure it rests evenly in the pan."
        },
        {
          "headline":"Bake the cake for 20 to 25 minutes.",
          "description":"The cake is done when it is a light shade of golden brown, and a toothpick poked into the center of the cake comes out clean. If you're worried about the edges of the cake turning too dark, you can loosely cover the cake with aluminum foil after 15 minutes, which can help prevent the edges from overcooking."
        },
        {
          "headline":"Place the cake pan on a wire rack and allow it to cool.",
          "description":"Do not remove it from the pan until it has cooled fully."
        }
      ]
    },
    {
      "name":"Finishing the Cake",
      "steps":[
        {
          "headline":"Make the chocolate frosting.",
          "description":"The sweet chocolate frosting will add a delightful taste to your finished cake. Sift the sugar and cocoa powder together, and set it aside. In a separate bowl, use a mixer to cream the butter. Alternate between slowly adding the sugar and cocoa powder mix, the heavy cream, and the vanilla to the butter mix, slowly blending it together after adding each ingredient. Mix at high speed until the ingredients are fully blended together."
        },
        {
          "headline":"Prepare the cookie dough frosting.",
          "description":"Those who fear there isn't enough cookie flavor will be reassured by the presence of this frosting. Cream the butter, brown sugar, and powdered sugar at low speed. Combine in the flour, salt, and vanilla at medium speed until the frosting is creamy. Mix in the milk slowly, stopping when the frosting is at the wanted consistency. Fold in the mini chocolate chips."
        },
        {
          "headline":"Remove the cookie cake from the pan.",
          "description":"Run a knife along the edges of the cake pan to dislodge the cake, remove it from the pan, and place it on a plate."
        },
        {
          "headline":"Frost the top of the cookie cake with the chocolate frosting.",
          "description":""
        },
        {
          "headline":"Stack one of the chocolate cakes on top of the frosted cookie cake.",
          "description":"Frost the top with the cookie dough frosting."
        },
        {
          "headline":"Place the second chocolate cake on top of the frosted chocolate cake.",
          "description":""
        },
        {
          "headline":"Frost the rest of the cake with the frosting of your choice.",
          "description":"You can try frosting the top of the cake with cookie dough frosting and the sides with chocolate frosting, or vice versa."
        },
        {
          "headline":"Garnish the cake.",
          "description":"Try using the extra frosting to decorate the cake, if you wish. Top with chocolate chips or cookie dough, or something more creative, like chocolate-dipped strawberries."
        },
        {
          "headline":"Serve.",
          "description":"Slice the cake and place it on a serving plate. Consider serving it alongside vanilla ice cream, whipped cream, or even just a glass of milk. Enjoy!"
        }
      ]
    }
  ],
  "text":" Preparing the Chocolate Cake Preheat the oven to 350 °F (177 °C). Grease and flour two round nine-inch cake pans and set aside. Sift the dry ingredients. Using a whisk, sift the flour, sugar, cocoa, baking powder, and baking soda together in a large bowl. Mix in the wet ingredients. Crack in the eggs and then pour in the milk, vegetable oil, and vanilla extract. Use an electric hand mixer to beat the ingredients together for about two minutes, or until fully combined. Stir in the boiling water with a spoon. The water will thin the cake batter; this is normal. Pour the cake batter into the two pans. Use a rubber spatula to scrape out the leftover cake batter and get it into the pans. Allow the cake to bake for 30 to 35 minutes. The baking time may vary, but if a toothpick poked into the center of the cake comes out clean, then the cake is done baking. Allow the cakes to cool for 10 minutes.  Remove the cakes from their pans. Take a knife and run it along the edges of the cake pans to slightly dislodge the cakes, then place a wire rack over the top of the pans and flip the pans over. Carefully remove the cake pans from the cakes and allow the cakes to fully cool. Preparing the Cookie Cake Preheat the oven to 350 °F (177 °C). Grease a nine-inch cake pan and set aside. Cream the butter. Using an electric mixer, cream the butter in a large bowl until it's creamy and smooth. Blend in the brown sugar on medium speed until smooth.  Combine in the wet ingredients. Crack in the egg, then add in the egg yolk and vanilla, and mix thoroughly on medium speed. It's recommended to make sure the eggs are room temperature before you add them in, as this will make sure the egg is blended in evenly and will result in a consistent texture in the cookie cake. Sift together the dry ingredients. Using a whisk, sift the flour, cornstarch, and baking soda together in a separate bowl. Slowly combine the wet ingredients with the dry ingredients. The dough will be thick, which is normal. Fold in the chocolate chips.  Press the cookie dough into the cake pan. Make sure it rests evenly in the pan. Bake the cake for 20 to 25 minutes. The cake is done when it is a light shade of golden brown, and a toothpick poked into the center of the cake comes out clean. If you're worried about the edges of the cake turning too dark, you can loosely cover the cake with aluminum foil after 15 minutes, which can help prevent the edges from overcooking. Place the cake pan on a wire rack and allow it to cool. Do not remove it from the pan until it has cooled fully. Finishing the Cake Make the chocolate frosting. The sweet chocolate frosting will add a delightful taste to your finished cake. Sift the sugar and cocoa powder together, and set it aside. In a separate bowl, use a mixer to cream the butter. Alternate between slowly adding the sugar and cocoa powder mix, the heavy cream, and the vanilla to the butter mix, slowly blending it together after adding each ingredient. Mix at high speed until the ingredients are fully blended together. Prepare the cookie dough frosting. Those who fear there isn't enough cookie flavor will be reassured by the presence of this frosting. Cream the butter, brown sugar, and powdered sugar at low speed. Combine in the flour, salt, and vanilla at medium speed until the frosting is creamy. Mix in the milk slowly, stopping when the frosting is at the wanted consistency. Fold in the mini chocolate chips. Remove the cookie cake from the pan. Run a knife along the edges of the cake pan to dislodge the cake, remove it from the pan, and place it on a plate. Frost the top of the cookie cake with the chocolate frosting.  Stack one of the chocolate cakes on top of the frosted cookie cake. Frost the top with the cookie dough frosting. Place the second chocolate cake on top of the frosted chocolate cake.  Frost the rest of the cake with the frosting of your choice. You can try frosting the top of the cake with cookie dough frosting and the sides with chocolate frosting, or vice versa. Garnish the cake. Try using the extra frosting to decorate the cake, if you wish. Top with chocolate chips or cookie dough, or something more creative, like chocolate-dipped strawberries. Serve. Slice the cake and place it on a serving plate. Consider serving it alongside vanilla ice cream, whipped cream, or even just a glass of milk. Enjoy!",
  "tyn_model":[
    "butter",
    "cake pan",
    "chocolate cake",
    "flour",
    "sugar",
    "milk",
    "vanilla",
    "cookie cake",
    "chocolate chips",
    "chocolate frosting",
    "cookie dough frosting",
    "oven",
    "whisk",
    "baking soda",
    "large bowl",
    "eggs",
    "water",
    "cake batter",
    "knife",
    "cake pans",
    "wire rack",
    "brown sugar",
    "cookie dough",
    "cocoa powder",
    "nine-inch cake pans",
    "cocoa",
    "baking powder",
    "vegetable oil",
    "vanilla extract",
    "electric hand mixer",
    "spoon",
    "rubber spatula",
    "electric mixer",
    "egg",
    "cornstarch",
    "aluminum foil",
    "mixer",
    "heavy cream",
    "powdered sugar",
    "salt",
    "plate",
    "chocolate cakes",
    "frosting",
    "chocolate-dipped strawberries",
    "serving plate",
    "vanilla ice cream",
    "whipped cream"
  ],
  "tyn_section":[

  ]
}