{
  "title":"How to Create a Magical World",
  "url":"https://www.wikihow.com/Create-a-Magical-World",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Fantasy Drawing"
  ],
  "steps":[
    {
      "headline":"First, decide on a location for your new world.",
      "description":"Plan out the geography and topography (the arrangement of physical and natural features), and think about the climate. You could also draw maps and pictures."
    },
    {
      "headline":"Now, name your world: this can be anything that you want.",
      "description":"Don't plagiarize (taking someone else's name), though! This should express the wonder and imagination you want that world to have. For example, a world filled with demons, a bad government, antagonists (people that want to destroy the world) etc should not be called Bliss - a name more suited to a peaceful place."
    },
    {
      "headline":"Now, you need to think of how you would enter your fantasy world.",
      "description":"It's no use if you can't get in! Make sure that it is a secret entrance: this world isn't for just anybody. Some examples include; saying magical words before entering; crossing a bridge / rope over a river (like in the film 'Bridge to Terabithia') or a more magical transportation - you could arrange items in a particular way and use them as a teleportation board."
    },
    {
      "headline":"Now you've accessed your world: but it's blank!",
      "description":"Begin decorating your fresh canvas. Create of plants, weather, buildings, cliffs, etc. Make the world very detailed but only as realistic as you want."
    },
    {
      "headline":"Add creatures!",
      "description":"Use your imagination! What is their personality like? How about their appearance and origin?"
    },
    {
      "headline":"You can add bad people to make action.",
      "description":"Protagonists (good people) and antagonists (the opposite) make for a great, action-filled plot line."
    },
    {
      "headline":"Make weapons!",
      "description":"You can sharpen a sturdy stick. How will you fight your enemy? Or are you the bad guy! Create an impenetrable fortress. Or, make a fortress which has only one weakness!"
    },
    {
      "headline":"Keep it a secret!",
      "description":""
    },
    {
      "headline":"Choose your side - good or bad?",
      "description":""
    },
    {
      "headline":"Are there other people in your land?",
      "description":"Kings, Queens, Dwarfs?"
    },
    {
      "headline":"Write down everything about your world!",
      "description":"Create a story and a history! Make it interesting!"
    },
    {
      "headline":"Visit your world.",
      "description":"This is a great opportunity to learn how to lucid dream!"
    }
  ],
  "text":" First, decide on a location for your new world. Plan out the geography and topography (the arrangement of physical and natural features), and think about the climate. You could also draw maps and pictures. Now, name your world: this can be anything that you want. Don't plagiarize (taking someone else's name), though! This should express the wonder and imagination you want that world to have. For example, a world filled with demons, a bad government, antagonists (people that want to destroy the world) etc should not be called Bliss - a name more suited to a peaceful place. Now, you need to think of how you would enter your fantasy world. It's no use if you can't get in! Make sure that it is a secret entrance: this world isn't for just anybody. Some examples include; saying magical words before entering; crossing a bridge / rope over a river (like in the film 'Bridge to Terabithia') or a more magical transportation - you could arrange items in a particular way and use them as a teleportation board. Now you've accessed your world: but it's blank! Begin decorating your fresh canvas. Create of plants, weather, buildings, cliffs, etc. Make the world very detailed but only as realistic as you want. Add creatures! Use your imagination! What is their personality like? How about their appearance and origin? You can add bad people to make action. Protagonists (good people) and antagonists (the opposite) make for a great, action-filled plot line. Make weapons! You can sharpen a sturdy stick. How will you fight your enemy? Or are you the bad guy! Create an impenetrable fortress. Or, make a fortress which has only one weakness! Keep it a secret!  Choose your side - good or bad?  Are there other people in your land? Kings, Queens, Dwarfs? Write down everything about your world! Create a story and a history! Make it interesting! Visit your world. This is a great opportunity to learn how to lucid dream!",
  "tyn_model":[
    "rope",
    "canvas",
    "weapons"
  ],
  "tyn_section":[

  ]
}