{
  "title":"How to Roast Fennel",
  "url":"https://www.wikihow.com/Roast-Fennel",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Roasting Fennel with Lemon and Pepper",
      "steps":[
        {
          "headline":"Gather the ingredients.",
          "description":"This recipe is easy to make and only takes about 35 minutes to prepare and cook. It is a low-carb dish that will serve approximately 4 people. The ingredients you will need are:\n1 squeezed lemon\n4 heads of fennel\n3 tablespoons olive oil\n6 oz. (150 g) sugar snap peas\n2 tablespoons roasted sunflower or pumpkin seeds\nSea salt (to taste)\nBlack or white pepper, freshly ground (to taste)"
        },
        {
          "headline":"Preheat the oven to 450°F (225°C) and wash the fennel bulbs.",
          "description":"After preheating, rinse the 4 fennel bulbs well with water to remove any soil or debris. Then trim the green shoots off the tops of the fennel, so that only the bulbs remain. Discard the shoots and trimmings."
        },
        {
          "headline":"Cut the bulbs into small wedges and put in a baking dish.",
          "description":"Cut the fennel into quarters, which is a good size wedge for this dish. Put them in a baking dish. You can use a pastry brush to apply olive oil onto the wedges or you can simply drizzle the 3 tablespoons of olive oil over them. Sprinkle the sea salt and freshly ground pepper over the oiled fennel wedges."
        },
        {
          "headline":"Squeeze the juice from the lemon.",
          "description":"Cut the lemon in half and squeeze the juice from each half out into a bowl. You can save the juice and use it for something else or toss it – you won’t need it for this recipe. After you’ve squeezed the juice from both halves, cut the lemon into small, thin wedges. Place the lemon wedges around the fennel in the baking dish. These should be discarded afterward — they are for flavoring the fennel, not for eating."
        },
        {
          "headline":"Roast the fennel wedges in the oven for 20-30 minutes.",
          "description":"Carefully place the baking dish, uncovered, into your oven. Roast the dish for approximately 20-30 minutes. Keep an eye on its progress – it’s ready to be taken out when the fennel has lightly browned and become tender."
        },
        {
          "headline":"Thinly slice the sugar snaps and roast the pumpkin seeds.",
          "description":"While the fennel is roasting in the oven, prepare the pumpkin seeds and sugar snaps. Use a dry frying pan to roast the pumpkin seeds over medium heat for several minutes. You want them to be roasted a nice brown color, but not burned. To prep the raw sugar snap peas, first trim off both ends. Then thinly slice the peas on the diagonal. You can also roughly chop the peas, as long as you end up with thin slivers."
        },
        {
          "headline":"Remove the fennel from the oven.",
          "description":"Once your fennel bulbs are roasted a nice brown color, carefully take the baking dish out of the oven. Place the roasted wedges on a large serving plate. Mix the sugar snaps and pumpkin seeds up with the roasted fennel on the plate. Serve immediately. You can sprinkle a little more sea salt and freshly ground pepper over the completed dish before serving, if you like. This works well as a side dish to chicken or seafood."
        }
      ]
    },
    {
      "name":"Making Balsamic Roasted Fennel",
      "steps":[
        {
          "headline":"Gather the ingredients.",
          "description":"This simple recipe takes 10 minutes to prepare and about 40 minutes to cook. It will serve approximately 4 people. The ingredients you will need are:\n2 fennel bulbs\n2 tablespoons of olive oil (or more)\n2 teaspoons of balsamic vinegar (or more)"
        },
        {
          "headline":"Preheat the oven to 400°F (200°C) and prepare the fennel.",
          "description":"Once you've set your oven to preheat, rinse your fennel bulbs. Cut the stalks off (the green shoots on the top) and cut the bulbs in half lengthwise. From there, cut the halves into 1-inch thick wedges."
        },
        {
          "headline":"Put the fennel wedges in a large bowl.Add 1-2 tablespoons of olive oil to the bowl and toss the fennel wedges until they are coated with the oil.",
          "description":"Sprinkle 2 teaspoons of balsamic vinegar over the wedges and toss them again until they are coated with the vinegar."
        },
        {
          "headline":"Line a roasting pan with aluminum foil brushed with olive oil.",
          "description":"Place a sheet of aluminum foil at the bottom of a roasting pan and brush it with olive oil. Place the fennel wedges into the pan. Arrange them so that they all have room and there’s only one layer of wedges."
        },
        {
          "headline":"Roast the fennel for 40 minutes.",
          "description":"When the 40 minute mark starts getting close, watch the dish carefully. You want the fennel wedges to roast until they are cooked through. The edges should look slightly caramelized. When you see that, carefully remove the pan from the oven. You can drizzle more olive oil over the top, if you like. Serve immediately. This makes a great side dish to chicken or fish."
        }
      ]
    },
    {
      "name":"Roasting Fennel with Olives and Garlic",
      "steps":[
        {
          "headline":"Gather your ingredients.",
          "description":"This delicious recipe is heart-healthy, easy to make and will be on the table in about 45 minutes. The dish will serve approximately 8 people. The ingredients you will need are:\nNonstick vegetable oil spray\n4 small (3-inch-diameter) fennel bulbs\n1/4 cup extra-virgin olive oil\n6 large garlic cloves, coarsely crushed\n1 tablespoon chopped fresh thyme\n1/8 teaspoon dried crushed red pepper\nCoarse kosher salt\n1/2 cup halved pitted Kalamata olives"
        },
        {
          "headline":"Preheat your oven to 425°F and prepare the fennel.",
          "description":"After preheating the oven, rinse the 4 fennel bulbs. Make sure you wash away any dirt or debris on the vegetables. Trim the green stalks off the top and discard them. Cut each fennel bulb into 8 wedges. After cutting all of the bulbs, you should end up with 32 small fennel wedges in total."
        },
        {
          "headline":"Place the 32 fennel wedges into a large bowl.",
          "description":"Add 1/4 cup of olive oil, 6 coarsely crushed garlic cloves, 1 tablespoon of thyme, and 1/8 teaspoon of crushed red pepper to the bowl. Toss the contents of the bowl until the fennel wedges are coated well with the additional ingredients."
        },
        {
          "headline":"Spread the wedges out on a baking sheet.",
          "description":"Spray a large baking sheet with the nonstick spray. Arrange the fennel on the baking sheet. Be sure to spread the wedges out well so that they all have room on the baking sheet. Sprinkle coarse kosher salt and pepper over the fennel."
        },
        {
          "headline":"Place the baking sheet into the oven.",
          "description":"Carefully put the dish in the oven and allow the wedges to roast for 15 minutes. At that point, open the oven and turn all of the wedges over using tongs. Continue roasting for approximately 10 minutes. Take the sheet out and turn the wedges over one more time. Pop the fennel back in and roast for an additional 10 minutes. After that last 10 minute interval, the fennel will be tender."
        },
        {
          "headline":"Sprinkle the olives over the fennel wedges.",
          "description":"Pull the sheet out of the oven and sprinkle the 1/2 cup of Kalamata olives over the top. Carefully put the baking sheet back into the oven. Roast for approximately 8 more minutes. When the fennel starts to brown at the edges, the dish is ready."
        },
        {
          "headline":"Remove the baking sheet from the oven.",
          "description":"Sprinkle a little more salt and pepper over the roasted fennel wedges. Place the wedges in a large bowl. The dish is now ready to serve. You can serve the roasted fennel warm or at room temperature, whichever is preferred. This works well as a side dish to steaks, chicken, fish or grilled pork roast."
        }
      ]
    }
  ],
  "text":" Roasting Fennel with Lemon and Pepper Gather the ingredients. This recipe is easy to make and only takes about 35 minutes to prepare and cook. It is a low-carb dish that will serve approximately 4 people. The ingredients you will need are:\n1 squeezed lemon\n4 heads of fennel\n3 tablespoons olive oil\n6 oz. (150 g) sugar snap peas\n2 tablespoons roasted sunflower or pumpkin seeds\nSea salt (to taste)\nBlack or white pepper, freshly ground (to taste) Preheat the oven to 450°F (225°C) and wash the fennel bulbs. After preheating, rinse the 4 fennel bulbs well with water to remove any soil or debris. Then trim the green shoots off the tops of the fennel, so that only the bulbs remain. Discard the shoots and trimmings. Cut the bulbs into small wedges and put in a baking dish. Cut the fennel into quarters, which is a good size wedge for this dish. Put them in a baking dish. You can use a pastry brush to apply olive oil onto the wedges or you can simply drizzle the 3 tablespoons of olive oil over them. Sprinkle the sea salt and freshly ground pepper over the oiled fennel wedges. Squeeze the juice from the lemon. Cut the lemon in half and squeeze the juice from each half out into a bowl. You can save the juice and use it for something else or toss it – you won’t need it for this recipe. After you’ve squeezed the juice from both halves, cut the lemon into small, thin wedges. Place the lemon wedges around the fennel in the baking dish. These should be discarded afterward — they are for flavoring the fennel, not for eating. Roast the fennel wedges in the oven for 20-30 minutes. Carefully place the baking dish, uncovered, into your oven. Roast the dish for approximately 20-30 minutes. Keep an eye on its progress – it’s ready to be taken out when the fennel has lightly browned and become tender. Thinly slice the sugar snaps and roast the pumpkin seeds. While the fennel is roasting in the oven, prepare the pumpkin seeds and sugar snaps. Use a dry frying pan to roast the pumpkin seeds over medium heat for several minutes. You want them to be roasted a nice brown color, but not burned. To prep the raw sugar snap peas, first trim off both ends. Then thinly slice the peas on the diagonal. You can also roughly chop the peas, as long as you end up with thin slivers. Remove the fennel from the oven. Once your fennel bulbs are roasted a nice brown color, carefully take the baking dish out of the oven. Place the roasted wedges on a large serving plate. Mix the sugar snaps and pumpkin seeds up with the roasted fennel on the plate. Serve immediately. You can sprinkle a little more sea salt and freshly ground pepper over the completed dish before serving, if you like. This works well as a side dish to chicken or seafood. Making Balsamic Roasted Fennel Gather the ingredients. This simple recipe takes 10 minutes to prepare and about 40 minutes to cook. It will serve approximately 4 people. The ingredients you will need are:\n2 fennel bulbs\n2 tablespoons of olive oil (or more)\n2 teaspoons of balsamic vinegar (or more) Preheat the oven to 400°F (200°C) and prepare the fennel. Once you've set your oven to preheat, rinse your fennel bulbs. Cut the stalks off (the green shoots on the top) and cut the bulbs in half lengthwise. From there, cut the halves into 1-inch thick wedges. Put the fennel wedges in a large bowl.Add 1-2 tablespoons of olive oil to the bowl and toss the fennel wedges until they are coated with the oil. Sprinkle 2 teaspoons of balsamic vinegar over the wedges and toss them again until they are coated with the vinegar. Line a roasting pan with aluminum foil brushed with olive oil. Place a sheet of aluminum foil at the bottom of a roasting pan and brush it with olive oil. Place the fennel wedges into the pan. Arrange them so that they all have room and there’s only one layer of wedges. Roast the fennel for 40 minutes. When the 40 minute mark starts getting close, watch the dish carefully. You want the fennel wedges to roast until they are cooked through. The edges should look slightly caramelized. When you see that, carefully remove the pan from the oven. You can drizzle more olive oil over the top, if you like. Serve immediately. This makes a great side dish to chicken or fish. Roasting Fennel with Olives and Garlic Gather your ingredients. This delicious recipe is heart-healthy, easy to make and will be on the table in about 45 minutes. The dish will serve approximately 8 people. The ingredients you will need are:\nNonstick vegetable oil spray\n4 small (3-inch-diameter) fennel bulbs\n1/4 cup extra-virgin olive oil\n6 large garlic cloves, coarsely crushed\n1 tablespoon chopped fresh thyme\n1/8 teaspoon dried crushed red pepper\nCoarse kosher salt\n1/2 cup halved pitted Kalamata olives Preheat your oven to 425°F and prepare the fennel. After preheating the oven, rinse the 4 fennel bulbs. Make sure you wash away any dirt or debris on the vegetables. Trim the green stalks off the top and discard them. Cut each fennel bulb into 8 wedges. After cutting all of the bulbs, you should end up with 32 small fennel wedges in total. Place the 32 fennel wedges into a large bowl. Add 1/4 cup of olive oil, 6 coarsely crushed garlic cloves, 1 tablespoon of thyme, and 1/8 teaspoon of crushed red pepper to the bowl. Toss the contents of the bowl until the fennel wedges are coated well with the additional ingredients. Spread the wedges out on a baking sheet. Spray a large baking sheet with the nonstick spray. Arrange the fennel on the baking sheet. Be sure to spread the wedges out well so that they all have room on the baking sheet. Sprinkle coarse kosher salt and pepper over the fennel. Place the baking sheet into the oven. Carefully put the dish in the oven and allow the wedges to roast for 15 minutes. At that point, open the oven and turn all of the wedges over using tongs. Continue roasting for approximately 10 minutes. Take the sheet out and turn the wedges over one more time. Pop the fennel back in and roast for an additional 10 minutes. After that last 10 minute interval, the fennel will be tender. Sprinkle the olives over the fennel wedges. Pull the sheet out of the oven and sprinkle the 1/2 cup of Kalamata olives over the top. Carefully put the baking sheet back into the oven. Roast for approximately 8 more minutes. When the fennel starts to brown at the edges, the dish is ready. Remove the baking sheet from the oven. Sprinkle a little more salt and pepper over the roasted fennel wedges. Place the wedges in a large bowl. The dish is now ready to serve. You can serve the roasted fennel warm or at room temperature, whichever is preferred. This works well as a side dish to steaks, chicken, fish or grilled pork roast.",
  "tyn_model":[
    "fennel",
    "oven",
    "olive oil",
    "baking sheet",
    "lemon",
    "baking dish",
    "bowl",
    "pepper",
    "sea salt",
    "large bowl",
    "garlic",
    "sugar snap peas",
    "freshly ground pepper",
    "pumpkin seeds",
    "sugar snaps",
    "peas",
    "balsamic vinegar",
    "roasting pan",
    "aluminum foil",
    "olives",
    "crushed red pepper",
    "kosher salt",
    "kalamata olives",
    "sunflower or pumpkin seeds",
    "water",
    "pastry brush",
    "– you",
    "— they",
    "dish",
    "– it",
    "sugar",
    "frying pan",
    "large serving plate",
    "pumpkin",
    "balsamic roasted",
    "fennel bulbs",
    "vinegar",
    "vegetable oil",
    "extra-virgin olive oil",
    "fresh thyme",
    "vegetables",
    "thyme",
    "nonstick spray",
    "salt and pepper",
    "fish",
    "grilled pork"
  ],
  "tyn_section":[

  ]
}