{
  "title":"How to Prepare Cannellini Beans",
  "url":"https://www.wikihow.com/Prepare-Cannellini-Beans",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Rice and Beans"
  ],
  "steps":[
    {
      "headline":"Pre soak them.",
      "description":"This allows for greater digestibility and ensures that the essential minerals are accessible. It also ensures faster cooking times. Soak for 12 hours overnight, and allow four cups of water to each cup of beans."
    },
    {
      "headline":"Drain the Cannellini beans after soaking.",
      "description":""
    },
    {
      "headline":"Pour the drained beans into a cooking pot or saucepan with four cups of water.",
      "description":""
    },
    {
      "headline":"Bring the water to a boil.",
      "description":"Reduce the heat to low, cover the saucepan, and leave to simmer for about 1 1/2 hours, or until soft. If preferred, use a pressure cooker. The beans will take about 45 minutes."
    },
    {
      "headline":"Use as required.",
      "description":"As stated earlier, these beans are ideal in soups, salads, and as a side serve with olive oil, ground rosemary, and cracked black pepper."
    }
  ],
  "text":" Pre soak them. This allows for greater digestibility and ensures that the essential minerals are accessible. It also ensures faster cooking times. Soak for 12 hours overnight, and allow four cups of water to each cup of beans. Drain the Cannellini beans after soaking.  Pour the drained beans into a cooking pot or saucepan with four cups of water.  Bring the water to a boil. Reduce the heat to low, cover the saucepan, and leave to simmer for about 1 1/2 hours, or until soft. If preferred, use a pressure cooker. The beans will take about 45 minutes. Use as required. As stated earlier, these beans are ideal in soups, salads, and as a side serve with olive oil, ground rosemary, and cracked black pepper.",
  "tyn_model":[
    "water",
    "cannellini beans",
    "cooking pot or saucepan",
    "saucepan",
    "pressure cooker",
    "olive oil",
    "rosemary",
    "cracked black pepper"
  ],
  "tyn_section":[

  ]
}