{
  "title":"How to Put Together a Basic Pruning Kit",
  "url":"https://www.wikihow.com/Put-Together-a-Basic-Pruning-Kit",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "steps":[
    {
      "headline":"Get some decent garden gloves.",
      "description":"If you don't already have a good pair, get some. They're essential for protecting your hands from sharp edges, thorns, and prickles when you're pruning."
    },
    {
      "headline":"Purchase quality secateurs.",
      "description":"You'll use these for a lot of pruning jobs, so be prepared to spend a decent amount on them. Secateurs are good for fine pruning tasks."
    },
    {
      "headline":"Purchase loppers.",
      "description":"These should be medium-sized. They are ideal for pruning branches that are thin. You can also use loppers to thin out branches."
    },
    {
      "headline":"Purchase a handsaw.",
      "description":"A handsaw is needed for tougher branches and thicker branches. Be sure to check its sturdiness when buying it; avoid anything that is wobbly or bends."
    },
    {
      "headline":"Purchase shears.",
      "description":"These are ideal for dead-heading and trimming."
    }
  ],
  "text":" Get some decent garden gloves. If you don't already have a good pair, get some. They're essential for protecting your hands from sharp edges, thorns, and prickles when you're pruning. Purchase quality secateurs. You'll use these for a lot of pruning jobs, so be prepared to spend a decent amount on them. Secateurs are good for fine pruning tasks. Purchase loppers. These should be medium-sized. They are ideal for pruning branches that are thin. You can also use loppers to thin out branches. Purchase a handsaw. A handsaw is needed for tougher branches and thicker branches. Be sure to check its sturdiness when buying it; avoid anything that is wobbly or bends. Purchase shears. These are ideal for dead-heading and trimming.",
  "tyn_model":[
    "secateurs",
    "loppers",
    "handsaw",
    "garden gloves",
    "shears"
  ],
  "tyn_section":[

  ]
}