{
  "title":"How to Make Tuna",
  "url":"https://www.wikihow.com/Make-Tuna",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Tuna"
  ],
  "methods":[
    {
      "name":"Sesame-Seared Tuna",
      "steps":[
        {
          "headline":"Select your tuna.",
          "description":"Ahi tuna can refer to yellowfin or bigeye tuna, either of which makes a fine tuna steak. Albacore is generally cheaper and still a favorite of some cooks. Nowadays, frozen fillets at a fishmonger can be high quality, and much cheaper than the fresh stuff. Look for cuts that are neatly trimmed, with firm, dark red flesh. Avoid any with discolored flesh around the bone, or with a brown tinge. Thick cuts are necessary to create a seared crust without overcooking the inner flesh. Aim for a cut at least 1¼\" (3.2 cm) thick."
        },
        {
          "headline":"Start mixing the marinade.",
          "description":"In a medium bowl, mix together the soy sauce, mirin, honey and sesame oil with a whisk. If you can't find mirin, use white wine or sherry, with a small pinch of sugar stirred in."
        },
        {
          "headline":"Divide the mixture into two equal portions.",
          "description":"Set aside one portion to use as a dipping sauce."
        },
        {
          "headline":"Add the rice wine vinegar to the marinade mixture.",
          "description":"Whisk until incorporated."
        },
        {
          "headline":"Marinate the tuna.",
          "description":"Place the marinade and tuna in a sealable plastic bag and refrigerate. Leave it for up to 2 hours to allow the flavors to blend. Some chefs recommend keeping this to 30 minutes or less, or even just briefly rubbing in the marinade. The shorter marinade could result in more tender meat, but a more fishy flavor."
        },
        {
          "headline":"Press in the sesame seeds.",
          "description":"Remove the tuna steaks from the bag and drain off excess marinade. Cover them in a crust of sesame seeds, pressing gently to adhere them to the surface. Use both white and black sesame seeds for an attractive presentation."
        },
        {
          "headline":"Heat a grill or cast iron skillet.",
          "description":"Searing requires very high temperatures. If using a gas grill, bring it to 450ºF (230ºC). If using a stove, use a heavy skillet good at conducting heat, preferably a well-seasoned cast iron pan. Add peanut oil, refined (non-extra-virgin) olive oil, or another oil with a high smoking point. When the oil shimmers or just begins to smoke, the pan is hot enough for the tuna."
        },
        {
          "headline":"Sear the tuna steaks.",
          "description":"Sear until brown on the outside and opaque in the center, with a golden-brown sesame seed crust. This will take about 1–2 minutes on each side. Sear for just 30 seconds on each side if you prefer a rare center. Due to risk of parasites, this method should only be used for tuna that's been frozen."
        },
        {
          "headline":"Serve.",
          "description":"Remove the steaks from the skillet and serve with the reserved dipping sauce."
        }
      ]
    },
    {
      "name":"Tuna Sandwich",
      "steps":[
        {
          "headline":"Drain the tuna.",
          "description":"Drain the can of tuna. Optionally, rinse it under cold water to remove most of the salt, as well as the oil if oil-packed. Empty the can into a large bowl. If you're using a more expensive can of tuna packed in olive oil, skip this step. Use the oil it was packed in instead of the mayonnaise. Empty oil in the trash can, not the sink."
        },
        {
          "headline":"Mix in other ingredients.",
          "description":"Add the mayonnaise, mustard, lemon juice, chopped celery, and pepper. Stir thoroughly to combine."
        },
        {
          "headline":"Spread over toasted bread.",
          "description":"Lightly toast two pieces of bread, then spoon the tuna mixture between them. Fresh-baked, crusty bread such as ciabatta or sourdough delivers the best taste."
        },
        {
          "headline":"Add vegetables.",
          "description":"Balance the sandwich with arugula, lettuce or cucumber for a fresh taste."
        },
        {
          "headline":"Try other variations.",
          "description":"You can add many other ingredients to your tuna mixture, such as a small spoonful of capers or a dash of hot sauce. Turn it into a tuna melt by adding a slice of cheese and heating the sandwich until crisp with a frying pan, broiler, or toaster oven. Check out even more variations here. When making a tuna melt, add the arugula or other fresh veggies after the sandwich is toasted."
        }
      ]
    },
    {
      "name":"Tuna Salad",
      "steps":[
        {
          "headline":"Mix tuna with mayonnaise or olive oil.",
          "description":"Tuna salad begins with just enough oil to hold the tuna together. Drain the canned tuna, then spoon in mayonnaise or high-quality olive oil and stir until combined. With mayonnaise, it will stick together as a moist mixture. Olive oil will make a looser salad, so just break apart the tuna chunks and stir until coated. For a low-fat salad, use plain, low-fat yoghurt instead. If your tuna is packed in flavorful olive oil, you can skip this step."
        },
        {
          "headline":"Mix in ingredients.",
          "description":"Mayonnaise and tuna isn't bad on its own, but tuna salad has more potential than that. Try mixing it with one of these recipes:\nCranberries, apple, and green onion(See top of page for quantities)\n\n½ stick celery and ⅛ red onion, diced, plus 1 tsp (5 mL) pickle relish\n1 clove crushed garlic, several chopped and toasted walnuts, handful of sprouts\n\nRead this article for more variations"
        },
        {
          "headline":"Add spices and garnish.",
          "description":"Add sea salt, and black pepper to taste. Optionally, squeeze a wedge of lemon over the tuna salad, or garnish with fresh Italian parsley, dill, basil, or cilantro."
        },
        {
          "headline":"Serve immediately or chilled.",
          "description":"Most cooks prefer to chill tuna salad under plastic wrap in the refrigerator, but it can be served at room temperature. Here are a few serving suggestions:\nOn a bed of spinach or lettuce leaves\nTopped with sliced tomatoes and/or avocado\nStuffed into a hollowed out tomato\nShaped into a cylinder using a mold (for firm salads only)"
        }
      ]
    },
    {
      "name":"Other Tuna Recipes",
      "steps":[
        {
          "headline":"Mix tuna and avocado.",
          "description":"Cut an avocado in half and remove the pit. Chop the flesh into cubes and add it to a bowl of drained, canned tuna. Mash them together lightly with a pinch of salt. Stop while it's still chunky, and eat as-is. You can serve this in the avocado skin, garnished with a sprig of cilantro and a wedge of lemon."
        },
        {
          "headline":"Create salad Nicoise.",
          "description":"Invented near the French city of Nice, this salad packs enough weight to serve as a whole meal. Its many variations almost always include tuna, boiled potato, hard-boiled eggs, and black olives."
        },
        {
          "headline":"Make a tuna casserole.",
          "description":"Picky children and tired parents have popularized this easy dinner. Mix together canned tuna, cooked pasta, peas, and cream of mushroom soup. Top with cheese and bread crumbs, then bake until it forms a crust. You can make this even faster by cooking the noodles in a skillet, then using the leftover water to make a cream sauce."
        },
        {
          "headline":"Cook tuna croquettes.",
          "description":"Fry breaded tuna salad into a crisp shell with a piping hot interior. Serve with Worcestershire sauce, lemon, or Dijon mustard."
        },
        {
          "headline":"Prepare select cuts as sashimi.",
          "description":"Tuna is the most popular choice for sashimi, or slices of raw fish. Because the dish is served raw, you should only use frozen fish from a trusted fishmonger. But ignore the terms \"sushi grade\" or \"sashimi grade\" — these have no legal weight in the US. There are numerous varieties of tuna sashimi, based on the species of tuna and the location of the cut. Get started with high-quality tuna fillets, cutting them into thin slices or chunks."
        }
      ]
    }
  ],
  "text":" Sesame-Seared Tuna Select your tuna. Ahi tuna can refer to yellowfin or bigeye tuna, either of which makes a fine tuna steak. Albacore is generally cheaper and still a favorite of some cooks. Nowadays, frozen fillets at a fishmonger can be high quality, and much cheaper than the fresh stuff. Look for cuts that are neatly trimmed, with firm, dark red flesh. Avoid any with discolored flesh around the bone, or with a brown tinge. Thick cuts are necessary to create a seared crust without overcooking the inner flesh. Aim for a cut at least 1¼\" (3.2 cm) thick. Start mixing the marinade. In a medium bowl, mix together the soy sauce, mirin, honey and sesame oil with a whisk. If you can't find mirin, use white wine or sherry, with a small pinch of sugar stirred in. Divide the mixture into two equal portions. Set aside one portion to use as a dipping sauce. Add the rice wine vinegar to the marinade mixture. Whisk until incorporated. Marinate the tuna. Place the marinade and tuna in a sealable plastic bag and refrigerate. Leave it for up to 2 hours to allow the flavors to blend. Some chefs recommend keeping this to 30 minutes or less, or even just briefly rubbing in the marinade. The shorter marinade could result in more tender meat, but a more fishy flavor. Press in the sesame seeds. Remove the tuna steaks from the bag and drain off excess marinade. Cover them in a crust of sesame seeds, pressing gently to adhere them to the surface. Use both white and black sesame seeds for an attractive presentation. Heat a grill or cast iron skillet. Searing requires very high temperatures. If using a gas grill, bring it to 450ºF (230ºC). If using a stove, use a heavy skillet good at conducting heat, preferably a well-seasoned cast iron pan. Add peanut oil, refined (non-extra-virgin) olive oil, or another oil with a high smoking point. When the oil shimmers or just begins to smoke, the pan is hot enough for the tuna. Sear the tuna steaks. Sear until brown on the outside and opaque in the center, with a golden-brown sesame seed crust. This will take about 1–2 minutes on each side. Sear for just 30 seconds on each side if you prefer a rare center. Due to risk of parasites, this method should only be used for tuna that's been frozen. Serve. Remove the steaks from the skillet and serve with the reserved dipping sauce. Tuna Sandwich Drain the tuna. Drain the can of tuna. Optionally, rinse it under cold water to remove most of the salt, as well as the oil if oil-packed. Empty the can into a large bowl. If you're using a more expensive can of tuna packed in olive oil, skip this step. Use the oil it was packed in instead of the mayonnaise. Empty oil in the trash can, not the sink. Mix in other ingredients. Add the mayonnaise, mustard, lemon juice, chopped celery, and pepper. Stir thoroughly to combine. Spread over toasted bread. Lightly toast two pieces of bread, then spoon the tuna mixture between them. Fresh-baked, crusty bread such as ciabatta or sourdough delivers the best taste. Add vegetables. Balance the sandwich with arugula, lettuce or cucumber for a fresh taste. Try other variations. You can add many other ingredients to your tuna mixture, such as a small spoonful of capers or a dash of hot sauce. Turn it into a tuna melt by adding a slice of cheese and heating the sandwich until crisp with a frying pan, broiler, or toaster oven. Check out even more variations here. When making a tuna melt, add the arugula or other fresh veggies after the sandwich is toasted. Tuna Salad Mix tuna with mayonnaise or olive oil. Tuna salad begins with just enough oil to hold the tuna together. Drain the canned tuna, then spoon in mayonnaise or high-quality olive oil and stir until combined. With mayonnaise, it will stick together as a moist mixture. Olive oil will make a looser salad, so just break apart the tuna chunks and stir until coated. For a low-fat salad, use plain, low-fat yoghurt instead. If your tuna is packed in flavorful olive oil, you can skip this step. Mix in ingredients. Mayonnaise and tuna isn't bad on its own, but tuna salad has more potential than that. Try mixing it with one of these recipes:\nCranberries, apple, and green onion(See top of page for quantities)\n\n½ stick celery and ⅛ red onion, diced, plus 1 tsp (5 mL) pickle relish\n1 clove crushed garlic, several chopped and toasted walnuts, handful of sprouts\n\nRead this article for more variations Add spices and garnish. Add sea salt, and black pepper to taste. Optionally, squeeze a wedge of lemon over the tuna salad, or garnish with fresh Italian parsley, dill, basil, or cilantro. Serve immediately or chilled. Most cooks prefer to chill tuna salad under plastic wrap in the refrigerator, but it can be served at room temperature. Here are a few serving suggestions:\nOn a bed of spinach or lettuce leaves\nTopped with sliced tomatoes and/or avocado\nStuffed into a hollowed out tomato\nShaped into a cylinder using a mold (for firm salads only) Other Tuna Recipes Mix tuna and avocado. Cut an avocado in half and remove the pit. Chop the flesh into cubes and add it to a bowl of drained, canned tuna. Mash them together lightly with a pinch of salt. Stop while it's still chunky, and eat as-is. You can serve this in the avocado skin, garnished with a sprig of cilantro and a wedge of lemon. Create salad Nicoise. Invented near the French city of Nice, this salad packs enough weight to serve as a whole meal. Its many variations almost always include tuna, boiled potato, hard-boiled eggs, and black olives. Make a tuna casserole. Picky children and tired parents have popularized this easy dinner. Mix together canned tuna, cooked pasta, peas, and cream of mushroom soup. Top with cheese and bread crumbs, then bake until it forms a crust. You can make this even faster by cooking the noodles in a skillet, then using the leftover water to make a cream sauce. Cook tuna croquettes. Fry breaded tuna salad into a crisp shell with a piping hot interior. Serve with Worcestershire sauce, lemon, or Dijon mustard. Prepare select cuts as sashimi. Tuna is the most popular choice for sashimi, or slices of raw fish. Because the dish is served raw, you should only use frozen fish from a trusted fishmonger. But ignore the terms \"sushi grade\" or \"sashimi grade\" — these have no legal weight in the US. There are numerous varieties of tuna sashimi, based on the species of tuna and the location of the cut. Get started with high-quality tuna fillets, cutting them into thin slices or chunks.",
  "tyn_model":[
    "tuna",
    "olive oil",
    "mayonnaise",
    "tuna salad",
    "avocado",
    "skillet",
    "oil",
    "lemon",
    "whisk",
    "sesame seeds",
    "salt",
    "celery",
    "arugula",
    "tuna melt",
    "cheese",
    "canned tuna",
    "ahi tuna",
    "medium bowl",
    "soy sauce",
    "mirin",
    "honey",
    "sesame oil",
    "white wine",
    "sherry",
    "sugar",
    "dipping sauce",
    "rice wine vinegar",
    "sealable plastic bag",
    "grill",
    "cast iron skillet",
    "gas grill",
    "stove",
    "cast iron pan",
    "peanut oil",
    "large bowl",
    "mustard",
    "lemon juice",
    "pepper",
    "vegetables",
    "lettuce",
    "cucumber",
    "capers",
    "hot sauce",
    "frying pan, broiler",
    "toaster oven",
    "low-fat yoghurt",
    "cranberries",
    "apple",
    "green onion(see",
    "⅛ red",
    "onion",
    "pickle relish",
    "crushed garlic",
    "walnuts",
    "spices",
    "sea salt",
    "black pepper",
    "dill",
    "basil",
    "cilantro",
    "spinach",
    "tomatoes",
    "tomato",
    "bowl",
    "boiled potato",
    "hard-boiled eggs",
    "black olives",
    "tuna casserole",
    "peas",
    "cream of mushroom soup",
    "bread crumbs",
    "water",
    "cream sauce",
    "tuna croquettes",
    "worcestershire sauce",
    "dijon mustard",
    "fish",
    "— these",
    "tuna sashimi"
  ],
  "tyn_section":[

  ]
}