{
  "title":"How to Make Baked Wonton Wrapper Baskets",
  "url":"https://www.wikihow.com/Make-Baked-Wonton-Wrapper-Baskets",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350ºF/180ºC.",
      "description":""
    },
    {
      "headline":"Cut the wonton wrappers into square shapes.",
      "description":"Make these about 2 inches or 5cm in size."
    },
    {
      "headline":"Brush the muffin pan with olive oil.",
      "description":"Press a wonton square into each cup of the muffin pan. Brush each wonton square with olive oil."
    },
    {
      "headline":"Place into the oven and bake for 7-8 minutes, or until lightly golden in color.",
      "description":""
    },
    {
      "headline":"Place the muffin pan on a wire cooling rack.",
      "description":"Leave the baked wonton baskets to cool before removing."
    },
    {
      "headline":"Use the wonton baskets.",
      "description":"You can fill the wonton baskets with the food of your choice. Some suggestions include:\nDip such as hummus, beetroot dip, or babaganoush. Add olives and sun dried tomatoes for garnish. Cream cheese, flavored with fresh herbs and seasoned with salt and pepper. Seafood dip. Fine noodles with finely julienned vegetables."
    }
  ],
  "text":" Preheat the oven to 350ºF/180ºC.  Cut the wonton wrappers into square shapes. Make these about 2 inches or 5cm in size. Brush the muffin pan with olive oil. Press a wonton square into each cup of the muffin pan. Brush each wonton square with olive oil. Place into the oven and bake for 7-8 minutes, or until lightly golden in color.  Place the muffin pan on a wire cooling rack. Leave the baked wonton baskets to cool before removing. Use the wonton baskets. You can fill the wonton baskets with the food of your choice. Some suggestions include:\nDip such as hummus, beetroot dip, or babaganoush. Add olives and sun dried tomatoes for garnish. Cream cheese, flavored with fresh herbs and seasoned with salt and pepper. Seafood dip. Fine noodles with finely julienned vegetables.",
  "tyn_model":[
    "wonton",
    "muffin pan",
    "oven",
    "olive oil",
    "wonton baskets",
    "hummus",
    "beetroot dip",
    "olives",
    "sun dried tomatoes",
    "cream cheese",
    "salt and pepper",
    "seafood dip"
  ],
  "tyn_section":[

  ]
}