{
  "title":"How to Watch Netflix Movies on Xbox",
  "url":"https://www.wikihow.com/Watch-Netflix-Movies-on-Xbox",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox"
  ],
  "methods":[
    {
      "name":"Using Xbox 360",
      "steps":[
        {
          "headline":"Sign in to Xbox Live on your Xbox 360 using your Xbox LIVE gamertag.",
          "description":""
        },
        {
          "headline":"Navigate to “Video Marketplace”.",
          "description":""
        },
        {
          "headline":"Select “Netflix”.",
          "description":"If Netflix does not appear in the Video Marketplace, go under Apps to Browse Apps, and find it there."
        },
        {
          "headline":"Select “Confirm Download”.",
          "description":""
        },
        {
          "headline":"Navigate to “Video Marketplace” and launch “Netflix”.",
          "description":"(You will be prompted to sign-up for a Gold Membership if you don't already have one)"
        },
        {
          "headline":"Click “Yes I am” to sign into your existing Netflix account.",
          "description":"Use the onscreen instructions to create a Netflix account if you do not already have one."
        },
        {
          "headline":"Copy down the Activation Code.",
          "description":""
        },
        {
          "headline":"Click here to navigate to the following Netflix URL in your web browser of choice.",
          "description":"If you live in a different country that has Netflix, it will redirect to Netflix in your country."
        },
        {
          "headline":"Enter your Activation Code.",
          "description":""
        },
        {
          "headline":"Click “Activate”.",
          "description":""
        },
        {
          "headline":"Navigate to “Video Marketplace” and launch “Netflix”.",
          "description":""
        },
        {
          "headline":"Select a video to watch.",
          "description":""
        },
        {
          "headline":"Select “Play”.",
          "description":""
        },
        {
          "headline":"Pause the show.",
          "description":"When the video is playing, you may find that you need to pause it for some reason. If that is the case simply tap the A button and the video will pause. Tap it again and the video will resume."
        },
        {
          "headline":"Fast-forward or rewind.",
          "description":"If you missed an important part of the movie, or want to skip ahead to the best part, you can do so by fast-forwarding and rewinding the movie. In order to fast-forward, simply tap the right trigger on the top of the controller. If you tap it again, it will fast-forward faster. In order to get it to stop fast-forwarding, just press the A button on your controller. You can do the same exact thing with rewinding, the only difference is the left trigger on the controller makes it rewind."
        }
      ]
    },
    {
      "name":"Using Xbox One",
      "steps":[
        {
          "headline":"Turn on the Xbox One.",
          "description":"Click the center button on your Xbox One controller. Your Xbox will turn on and you will be on your dashboard."
        },
        {
          "headline":"Go to Games and Apps.",
          "description":"If you look on the right side of the screen, you can see that there is a box that says “Games and Apps.” Move your cursor so that it highlights that box, and then hit the A button."
        },
        {
          "headline":"Go to Apps.",
          "description":"When the next page loads look at the left side of the page. You can see the different sections of your games and apps, select the “Apps” button with the A button."
        },
        {
          "headline":"Locate Netflix.",
          "description":"After the app section loads scroll through your applications until you find the Netflix app. It is red text that says “Netflix” with a white square background. When you find it, select it, and the sign in page will load."
        },
        {
          "headline":"Sign in.",
          "description":"Enter your email address and password in the boxes provided then select “Sign in” to continue."
        },
        {
          "headline":"Select a movie.",
          "description":"Now all you have to do is scroll through your videos until you find something that you want to watch. Once you find something that catches your attention move your cursor over the movie or show and hit the A button. The video will start automatically."
        },
        {
          "headline":"Pause the movie.",
          "description":"If you are watching your movie or TV show and something important comes up, you can pause the video by simply tapping the A button on your controller. If you want to resume the video just tap A again."
        },
        {
          "headline":"Fast-forward or rewind.",
          "description":"If you need to rewind or fast forward you can do so easily by using the back triggers on the controller. The left trigger causes the video to rewind, while the right trigger makes it fast forward. If you want to play the video again at normal speed just hit the A button."
        }
      ]
    }
  ],
  "text":" Using Xbox 360 Sign in to Xbox Live on your Xbox 360 using your Xbox LIVE gamertag.  Navigate to “Video Marketplace”.  Select “Netflix”. If Netflix does not appear in the Video Marketplace, go under Apps to Browse Apps, and find it there. Select “Confirm Download”.  Navigate to “Video Marketplace” and launch “Netflix”. (You will be prompted to sign-up for a Gold Membership if you don't already have one) Click “Yes I am” to sign into your existing Netflix account. Use the onscreen instructions to create a Netflix account if you do not already have one. Copy down the Activation Code.  Click here to navigate to the following Netflix URL in your web browser of choice. If you live in a different country that has Netflix, it will redirect to Netflix in your country. Enter your Activation Code.  Click “Activate”.  Navigate to “Video Marketplace” and launch “Netflix”.  Select a video to watch.  Select “Play”.  Pause the show. When the video is playing, you may find that you need to pause it for some reason. If that is the case simply tap the A button and the video will pause. Tap it again and the video will resume. Fast-forward or rewind. If you missed an important part of the movie, or want to skip ahead to the best part, you can do so by fast-forwarding and rewinding the movie. In order to fast-forward, simply tap the right trigger on the top of the controller. If you tap it again, it will fast-forward faster. In order to get it to stop fast-forwarding, just press the A button on your controller. You can do the same exact thing with rewinding, the only difference is the left trigger on the controller makes it rewind. Using Xbox One Turn on the Xbox One. Click the center button on your Xbox One controller. Your Xbox will turn on and you will be on your dashboard. Go to Games and Apps. If you look on the right side of the screen, you can see that there is a box that says “Games and Apps.” Move your cursor so that it highlights that box, and then hit the A button. Go to Apps. When the next page loads look at the left side of the page. You can see the different sections of your games and apps, select the “Apps” button with the A button. Locate Netflix. After the app section loads scroll through your applications until you find the Netflix app. It is red text that says “Netflix” with a white square background. When you find it, select it, and the sign in page will load. Sign in. Enter your email address and password in the boxes provided then select “Sign in” to continue. Select a movie. Now all you have to do is scroll through your videos until you find something that you want to watch. Once you find something that catches your attention move your cursor over the movie or show and hit the A button. The video will start automatically. Pause the movie. If you are watching your movie or TV show and something important comes up, you can pause the video by simply tapping the A button on your controller. If you want to resume the video just tap A again. Fast-forward or rewind. If you need to rewind or fast forward you can do so easily by using the back triggers on the controller. The left trigger causes the video to rewind, while the right trigger makes it fast forward. If you want to play the video again at normal speed just hit the A button.",
  "tyn_model":[
    "”.",
    "“netflix",
    "netflix",
    "controller",
    "“video",
    "” and",
    "” to",
    "xbox one",
    "xbox 360",
    "video marketplace",
    "“confirm",
    "“yes",
    "“activate",
    "“play",
    "xbox one controller",
    "xbox",
    "“games",
    "” move",
    "“apps",
    "” button",
    "” with",
    "“sign"
  ],
  "tyn_section":[

  ]
}