{
  "title":"How to Kill Maggots",
  "url":"https://www.wikihow.com/Kill-Maggots",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control",
    "Fly Control"
  ],
  "methods":[
    {
      "name":"Using Chemical Means",
      "steps":[
        {
          "headline":"Apply a water-based permethrin spray to medium-sized hordes.",
          "description":"Permethrin is a synthetic chemical that is used as an insecticide, insect repellent, or acaricide. Permethrin sprays are typically designed to kill scabies and lice, but 2 to 3 sprays is enough to kill maggots. Liquid (shampoo) and cream products also contain permethrin. Mix 4 parts boiling water with 1 part permethrin dog shampoo and slowly dump the mixture over any maggots. Apply your spray or permethrin mixture in a 5 to 25 foot (1.5 to 7.6 m) radius from the source of the maggots. This will ensure that you reach the entire affected area and prevent the maggots from returning. While permethrin is safe for use in human hair and on the scalp, take care not to get it in your eyes, ears, nose, or mouth. If you do, flush or clean it away immediately. Permethrin and synthetic pyrethroids can be fatal to cats and fish—keep them away from pets!"
        },
        {
          "headline":"Mix bleach and water into a bowl and pour it over large maggot hordes.",
          "description":"Mix 1 cup (0.24 L) of bleach with 1 cup (0.24 L) of water in a plastic or metal bowl. If you're dumping the mixture onto the ground, gently pour it over the region with maggots, taking care to hit all of them. If you're dumping bleach into a trash can, close the lid after pouring it and let the fumes suffocate the maggots. Let the bleach sit for about 30 minutes before you open the can and clean it out. After clearing out the affected area, pour another bowl of bleach over it to prevent the maggots from returning."
        },
        {
          "headline":"Spray stray maggots with standard bug killer.",
          "description":"Although they aren't as effective as permethrin, pest sprays will eventually kill maggots. Give 2 to 3 sprays to the affected areas, holding down the trigger for about 2 seconds at a time. It might take 30 minutes or more for it to start taking effect. In general, bug sprays that act as fumigators, wasp, and hornet killers, as well as ant and roach killers, will work. Bug killer sprays can be purchased from grocery stores and big-box stores. Select products that contain permethrin if possible."
        },
        {
          "headline":"Apply household chemical solutions as alternative insecticides.",
          "description":"Hairsprays can be effective if you apply 5 or 6 sprays lasting about 2 seconds each. You can also mix 1 part multi-surface or all-purpose cleaner with 4 parts boiling water. Afterward, gently pour it over the maggots. Try using hairsprays, multi-surface cleaners, and all-purpose cleaners."
        },
        {
          "headline":"Mix water with household chemical and apply to large trash can hordes.",
          "description":"Chemicals such as motor oil or brake or carburetor cleaner are effective choices. Mix 1 cup (0.24 L) of carburetor cleaner with 1 to 2 gallons (3.8 to 7.6 L) of hot water. Slowly dump the mixture into your trash can after having disposed of the trash. Close the lid and allow the toxic fumes and hot water to work its magic for about 1 hour. Afterward, throw the dead maggots into a dumpster or outdoor garbage. Carburetor cleaner is extremely toxic—only use it as a last resort. Always wear proper clothing and gloves. Do not mix carburetor cleaner with any other solvents. Chlorinated carburetor cleaner can interact with other solvents to form a toxic mix of gases that can be harmful if inhaled or exposed to skin."
        }
      ]
    },
    {
      "name":"Using Natural Methods",
      "steps":[
        {
          "headline":"Pour boiling water onto your maggots for a simple solution.",
          "description":"Set a large pot of water to boil for about 5 minutes. Pour it slowly and carefully into infected regions. This method is especially useful if you have your maggots quarantined somewhere like your garbage bin or crawl space. In the meantime, remove the garbage the maggots were feeding on. Close the garbage bin to keep in the heat. Avoid using this method on your walls or carpet, as moisture can lead to structural damage and mold growth."
        },
        {
          "headline":"Sprinkle diatomaceous earth over the maggots to dehydrate them slowly.",
          "description":"Diatomaceous earth is a sedimentary rock with a wide range of cleaning and insecticide applications. Sprinkle enough diatomaceous earth over the maggots to completely cover them. It will stick to their exoskeletons, dehydrate them, and kill them from water pressure deficiency. Purchase diatomaceous earth from big-box stores, department stores, and home hardware stores."
        },
        {
          "headline":"Flood the maggots with a mixture of water and cinnamon for a fast solution.",
          "description":"Mix 1/6 cinnamon with 5/6 water into a bowl and slowly pour it over the maggots. It will take about 6 hours to kill larvae. Maggots find this mixture uninhabitable, so it can also prevent future infestations. You can also use a solution of 1/6 apple cider vinegar and 5/6 water, although it takes about 18 hours to kill larvae."
        },
        {
          "headline":"Sprinkle lime and salt over affected areas to dehydrate stray maggots.",
          "description":"Lime and salt dries out the maggots and causes them to die of water pressure deficiency. Mix ⁄4 cup (59 mL) of lime (calcium hydroxide) with ⁄4 cup (59 mL) of salt. Afterward, sprinkle the mix over the maggot breeding areas. Keep an eye on the maggots—if they're not dying, apply more lime and salt. You can also use calcium-oxide lime, which you can buy at hardware or big-box stores."
        },
        {
          "headline":"Place an open container of beer to attract and drown small maggot hordes.",
          "description":"Pour 1 beer into a container and set it close to the maggots. In some cases, maggots are attracted to it and crawl inside and drown in the beer. This is not a long-term solution for large-scale problems. Make sure the beer dish is easily accessible to the maggots. While some people place lights next to the beer to attract the maggots, research shows that maggots actually move away from light."
        },
        {
          "headline":"Freeze maggots at −20 °C (−4 °F) for at least 60 minutes as a last resort.",
          "description":"Scrape up smaller maggot hordes into a dustpan, pour them into a resealable bag, and place the bag in the freezer. About an hour in the freezer should kill them. If they aren't dying, leave them in for longer. Keep an eye on them every hour or so and once they're dead, throw them into the trash."
        }
      ]
    },
    {
      "name":"Practicing Preventative Techniques",
      "steps":[
        {
          "headline":"Avoid throwing meat and fish in the garbage.",
          "description":"Flies (which reproduce and lay maggot eggs) breed mainly in decaying meat and fish. Never allow excess meat and fish into your trash to decrease the chances of maggot infestation. Here are a couple solutions for attacking the source of the problem:\n\nMake meat stock using excess bones and meat. Dump the leftover bones into a pot of boiling water, add a few bay leaves and spices, and set to simmer for at least an hour. Save some of the meat/bones in a separate refrigerator (or freezer) until garbage day, and then dump it all at once. Your meat won't spoil as easily if it's refrigerated or frozen. If you have to throw excess meat and fish in the garbage, wrap them in paper towels before you toss them. If flies can't get at them, they'll have a difficult time laying eggs."
        },
        {
          "headline":"Coat the affected areas with essential oils like peppermint, bay leaf, and eucalyptus.",
          "description":"Essential oils repel flies. Dilute 4 to 5 drops of any essential oil in a spray bottle filled with water and lightly spray affected areas. You can also spray a dry cloth with the diluted oil and use it to apply the mixture."
        },
        {
          "headline":"Clean your trash can with vinegar and water once a week.",
          "description":"Mix 1 part vinegar with 2 parts water into a bowl. Afterward, dab a cloth into it and scrub the inside and outside of the trash can. Wipe it down with a dry cloth when you're finished and let it dry in the sun or a dry room before putting a new bag in. Keep on top of emptying your trash cans whenever they are full and clean them at least once a week. Always insulate with garbage bags to avoid bits and scraps of food becoming lodged in your trash can. Add a couple drops of your favorite essential oil to your detergent when you choose to clean the trash."
        },
        {
          "headline":"Clean your garbage disposal if you think the maggot infestation has affected it.",
          "description":"Turn off the fuse that controls your garbage disposal and use pliers or tongs to remove any trapped pieces of food. Afterward, dilute 1 tablespoon (15 mL) of liquid bleach into 1 gallon (3.8 L) of water and pour it slowly into your disposal. Run your garbage disposal for a longer period of time when you use it. This will help ensure that all the food is properly disposed of. Avoid letting grease down your sink drain."
        },
        {
          "headline":"Keep affected maggot regions as dry as possible.",
          "description":"Maggots really like moisture, so take it away from them. Make sure your trash bags aren't leaky and wipe away moisture that does make it to the bottom of the bin as soon as possible. Keep food preparation areas and other maggot-friendly regions dry as often as you can. Keep a few silica packets (which come with new shoes) at the bottom of your trash. Silica is a natural absorbent, so it draws away moisture effectively."
        },
        {
          "headline":"Place mothballs near affected regions as a last resort.",
          "description":"Mothballs are chemically treated orbs that are filled with insecticides. If you place 1 or 2 mothballs in the proximity of affected areas, such as the bottom of your trash can, they can be effective at repelling and killing intruders. Moth balls and carcinogenic and toxic, so only use them if you've tried all of the other methods above. Never place them near food."
        }
      ]
    }
  ],
  "text":" Using Chemical Means Apply a water-based permethrin spray to medium-sized hordes. Permethrin is a synthetic chemical that is used as an insecticide, insect repellent, or acaricide. Permethrin sprays are typically designed to kill scabies and lice, but 2 to 3 sprays is enough to kill maggots. Liquid (shampoo) and cream products also contain permethrin. Mix 4 parts boiling water with 1 part permethrin dog shampoo and slowly dump the mixture over any maggots. Apply your spray or permethrin mixture in a 5 to 25 foot (1.5 to 7.6 m) radius from the source of the maggots. This will ensure that you reach the entire affected area and prevent the maggots from returning. While permethrin is safe for use in human hair and on the scalp, take care not to get it in your eyes, ears, nose, or mouth. If you do, flush or clean it away immediately. Permethrin and synthetic pyrethroids can be fatal to cats and fish—keep them away from pets! Mix bleach and water into a bowl and pour it over large maggot hordes. Mix 1 cup (0.24 L) of bleach with 1 cup (0.24 L) of water in a plastic or metal bowl. If you're dumping the mixture onto the ground, gently pour it over the region with maggots, taking care to hit all of them. If you're dumping bleach into a trash can, close the lid after pouring it and let the fumes suffocate the maggots. Let the bleach sit for about 30 minutes before you open the can and clean it out. After clearing out the affected area, pour another bowl of bleach over it to prevent the maggots from returning. Spray stray maggots with standard bug killer. Although they aren't as effective as permethrin, pest sprays will eventually kill maggots. Give 2 to 3 sprays to the affected areas, holding down the trigger for about 2 seconds at a time. It might take 30 minutes or more for it to start taking effect. In general, bug sprays that act as fumigators, wasp, and hornet killers, as well as ant and roach killers, will work. Bug killer sprays can be purchased from grocery stores and big-box stores. Select products that contain permethrin if possible. Apply household chemical solutions as alternative insecticides. Hairsprays can be effective if you apply 5 or 6 sprays lasting about 2 seconds each. You can also mix 1 part multi-surface or all-purpose cleaner with 4 parts boiling water. Afterward, gently pour it over the maggots. Try using hairsprays, multi-surface cleaners, and all-purpose cleaners. Mix water with household chemical and apply to large trash can hordes. Chemicals such as motor oil or brake or carburetor cleaner are effective choices. Mix 1 cup (0.24 L) of carburetor cleaner with 1 to 2 gallons (3.8 to 7.6 L) of hot water. Slowly dump the mixture into your trash can after having disposed of the trash. Close the lid and allow the toxic fumes and hot water to work its magic for about 1 hour. Afterward, throw the dead maggots into a dumpster or outdoor garbage. Carburetor cleaner is extremely toxic—only use it as a last resort. Always wear proper clothing and gloves. Do not mix carburetor cleaner with any other solvents. Chlorinated carburetor cleaner can interact with other solvents to form a toxic mix of gases that can be harmful if inhaled or exposed to skin. Using Natural Methods Pour boiling water onto your maggots for a simple solution. Set a large pot of water to boil for about 5 minutes. Pour it slowly and carefully into infected regions. This method is especially useful if you have your maggots quarantined somewhere like your garbage bin or crawl space. In the meantime, remove the garbage the maggots were feeding on. Close the garbage bin to keep in the heat. Avoid using this method on your walls or carpet, as moisture can lead to structural damage and mold growth. Sprinkle diatomaceous earth over the maggots to dehydrate them slowly. Diatomaceous earth is a sedimentary rock with a wide range of cleaning and insecticide applications. Sprinkle enough diatomaceous earth over the maggots to completely cover them. It will stick to their exoskeletons, dehydrate them, and kill them from water pressure deficiency. Purchase diatomaceous earth from big-box stores, department stores, and home hardware stores. Flood the maggots with a mixture of water and cinnamon for a fast solution. Mix 1/6 cinnamon with 5/6 water into a bowl and slowly pour it over the maggots. It will take about 6 hours to kill larvae. Maggots find this mixture uninhabitable, so it can also prevent future infestations. You can also use a solution of 1/6 apple cider vinegar and 5/6 water, although it takes about 18 hours to kill larvae. Sprinkle lime and salt over affected areas to dehydrate stray maggots. Lime and salt dries out the maggots and causes them to die of water pressure deficiency. Mix ⁄4 cup (59 mL) of lime (calcium hydroxide) with ⁄4 cup (59 mL) of salt. Afterward, sprinkle the mix over the maggot breeding areas. Keep an eye on the maggots—if they're not dying, apply more lime and salt. You can also use calcium-oxide lime, which you can buy at hardware or big-box stores. Place an open container of beer to attract and drown small maggot hordes. Pour 1 beer into a container and set it close to the maggots. In some cases, maggots are attracted to it and crawl inside and drown in the beer. This is not a long-term solution for large-scale problems. Make sure the beer dish is easily accessible to the maggots. While some people place lights next to the beer to attract the maggots, research shows that maggots actually move away from light. Freeze maggots at −20 °C (−4 °F) for at least 60 minutes as a last resort. Scrape up smaller maggot hordes into a dustpan, pour them into a resealable bag, and place the bag in the freezer. About an hour in the freezer should kill them. If they aren't dying, leave them in for longer. Keep an eye on them every hour or so and once they're dead, throw them into the trash. Practicing Preventative Techniques Avoid throwing meat and fish in the garbage. Flies (which reproduce and lay maggot eggs) breed mainly in decaying meat and fish. Never allow excess meat and fish into your trash to decrease the chances of maggot infestation. Here are a couple solutions for attacking the source of the problem:\n\nMake meat stock using excess bones and meat. Dump the leftover bones into a pot of boiling water, add a few bay leaves and spices, and set to simmer for at least an hour. Save some of the meat/bones in a separate refrigerator (or freezer) until garbage day, and then dump it all at once. Your meat won't spoil as easily if it's refrigerated or frozen. If you have to throw excess meat and fish in the garbage, wrap them in paper towels before you toss them. If flies can't get at them, they'll have a difficult time laying eggs. Coat the affected areas with essential oils like peppermint, bay leaf, and eucalyptus. Essential oils repel flies. Dilute 4 to 5 drops of any essential oil in a spray bottle filled with water and lightly spray affected areas. You can also spray a dry cloth with the diluted oil and use it to apply the mixture. Clean your trash can with vinegar and water once a week. Mix 1 part vinegar with 2 parts water into a bowl. Afterward, dab a cloth into it and scrub the inside and outside of the trash can. Wipe it down with a dry cloth when you're finished and let it dry in the sun or a dry room before putting a new bag in. Keep on top of emptying your trash cans whenever they are full and clean them at least once a week. Always insulate with garbage bags to avoid bits and scraps of food becoming lodged in your trash can. Add a couple drops of your favorite essential oil to your detergent when you choose to clean the trash. Clean your garbage disposal if you think the maggot infestation has affected it. Turn off the fuse that controls your garbage disposal and use pliers or tongs to remove any trapped pieces of food. Afterward, dilute 1 tablespoon (15 mL) of liquid bleach into 1 gallon (3.8 L) of water and pour it slowly into your disposal. Run your garbage disposal for a longer period of time when you use it. This will help ensure that all the food is properly disposed of. Avoid letting grease down your sink drain. Keep affected maggot regions as dry as possible. Maggots really like moisture, so take it away from them. Make sure your trash bags aren't leaky and wipe away moisture that does make it to the bottom of the bin as soon as possible. Keep food preparation areas and other maggot-friendly regions dry as often as you can. Keep a few silica packets (which come with new shoes) at the bottom of your trash. Silica is a natural absorbent, so it draws away moisture effectively. Place mothballs near affected regions as a last resort. Mothballs are chemically treated orbs that are filled with insecticides. If you place 1 or 2 mothballs in the proximity of affected areas, such as the bottom of your trash can, they can be effective at repelling and killing intruders. Moth balls and carcinogenic and toxic, so only use them if you've tried all of the other methods above. Never place them near food.",
  "tyn_model":[
    "water",
    "bleach",
    "carburetor cleaner",
    "bowl",
    "diatomaceous earth",
    "lime",
    "salt",
    "beer",
    "fish",
    "permethrin",
    "garbage disposal",
    "hairsprays",
    "cinnamon",
    "freezer",
    "essential oils",
    "essential oil",
    "vinegar",
    "permethrin spray",
    "permethrin is",
    "insect repellent,",
    "permethrin sprays",
    "permethrin dog shampoo",
    "—keep",
    "bug killer",
    "pest sprays",
    "bug killer sprays",
    "household chemical solutions",
    "multi-surface cleaners",
    "all-purpose cleaners",
    "household chemical",
    "motor oil",
    "hot water",
    "—only",
    "garbage bin",
    "cider vinegar",
    "—if",
    "calcium-oxide lime",
    "container",
    "beer dish",
    "dustpan",
    "resealable bag",
    "meat stock",
    "bay leaves",
    "spices",
    "refrigerator",
    "paper towels",
    "bay leaf",
    "spray bottle",
    "garbage bags",
    "liquid bleach",
    "trash bags",
    "silica",
    "mothballs"
  ],
  "tyn_section":[

  ]
}