{
  "title":"How to Use Chives",
  "url":"https://www.wikihow.com/Use-Chives",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "steps":[
    {
      "headline":"Grow your own chives.",
      "description":"If you'd like to have them freshly available, chives grow well outdoors and indoors, and are happy in a container."
    },
    {
      "headline":"Use chives to replace parsley.",
      "description":"The mildness of the onion flavour is not overwhelming and chives can make an excellent spicier substitute for parsley in many a dish."
    },
    {
      "headline":"Use chives with egg and cheese dishes.",
      "description":"These are a perfect match."
    },
    {
      "headline":"Cut chives up into smaller pieces and add to salads.",
      "description":"Chives in salad is an ideal addition. Use the chive flowers in salads. They are a pretty addition."
    },
    {
      "headline":"Sprinkle over baked potatoes.",
      "description":"Bake the potatoes, slice them open, add a dollop of sour cream or cream cheese and sprinkle over with cut chives. This also works well as a combination used over steamed or boiled corn."
    },
    {
      "headline":"Make a sandwich with chives inside.",
      "description":"Spread cream cheese across the bread and sprinkle with cut chives."
    },
    {
      "headline":"Add chives to homemade bread.",
      "description":"Chop into small pieces as shown in the image."
    }
  ],
  "text":" Grow your own chives. If you'd like to have them freshly available, chives grow well outdoors and indoors, and are happy in a container. Use chives to replace parsley. The mildness of the onion flavour is not overwhelming and chives can make an excellent spicier substitute for parsley in many a dish. Use chives with egg and cheese dishes. These are a perfect match. Cut chives up into smaller pieces and add to salads. Chives in salad is an ideal addition. Use the chive flowers in salads. They are a pretty addition. Sprinkle over baked potatoes. Bake the potatoes, slice them open, add a dollop of sour cream or cream cheese and sprinkle over with cut chives. This also works well as a combination used over steamed or boiled corn. Make a sandwich with chives inside. Spread cream cheese across the bread and sprinkle with cut chives. Add chives to homemade bread. Chop into small pieces as shown in the image.",
  "tyn_model":[
    "chives",
    "parsley",
    "potatoes",
    "cream cheese",
    "onion",
    "chive",
    "sour cream",
    "cut chives",
    "homemade bread"
  ],
  "tyn_section":[

  ]
}