{
  "title":"How to Select and Store Kiwifruit",
  "url":"https://www.wikihow.com/Select-and-Store-Kiwifruit",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "parts":[
    {
      "name":"Picking Ripe Kiwis",
      "steps":[
        {
          "headline":"Choose kiwi based on the skin color.",
          "description":"Although the fruit inside a kiwi is green (or yellow), you should avoid kiwis that have a greenish hue to their skin. Instead, pick kiwis that have goldish or dark brown skin. Kiwis with gold skin will be slightly firmer, and ones with dark brown skin will be softer."
        },
        {
          "headline":"Look for fruit that’s plump.",
          "description":"Kiwis are supposed to be juicy and sweet, so look for fruit that looks full, round, and full of juice. Avoid kiwi that looks shrivelled or withered."
        },
        {
          "headline":"Inspect kiwis for bruising, blemishes, and wrinkles.",
          "description":"The skin of the kiwi should be uniform in color, and not have any dark spots, cuts, or bruises that indicate damage to the fruit. Also look over the fruit for wrinkles, which indicate moisture loss. Kiwi with bruises, cuts, or blemishes is still safe to eat. Simply cut out the blemish before eating the rest of the fruit."
        },
        {
          "headline":"Press the fruit gently to test ripeness.",
          "description":"Delicately press your thumb into the outside of the fruit. When the kiwi is ripe and ready to eat, the fruit will yield to your squeeze. The fruit should be firm but not mushy or overly soft. If the kiwi doesn’t give when you press it, then it’s not ripe. Unripe kiwi will be tart and hard if you try to eat it, but it will ripen if you leave it at room temperature for a few days. Overly soft or mushy kiwi is likely bruised, damaged, or overripe, so avoid these kiwis. Do not purchase or eat kiwi that’s oozing juice or moldy. Mold on a kiwi may appear as a black, fuzzy green, or brown spot."
        },
        {
          "headline":"Smell the kiwi.",
          "description":"Unripe kiwi has no scent, so you can tell when a kiwi is ripe by the aroma. Bring the kiwi to your nose and inhale deeply. A mild fragrant scent indicates that the kiwi is ripe and ready to eat."
        }
      ]
    },
    {
      "name":"Storing Ripe and Unripe Kiwis",
      "steps":[
        {
          "headline":"Store kiwis on the counter to ripen them.",
          "description":"Kiwi is one of those fruits that will continue to ripen after it’s harvested. When you buy unripe kiwi, leave them on the counter at room temperature, and they will ripen over the next three to seven days. Other fruits that continue ripening after harvest include apples, bananas, plums, and apricots. There are even a few fruits, like avocados, that won’t ripen unless you pick them."
        },
        {
          "headline":"Transfer unripe kiwis to a paper bag to ripen them faster.",
          "description":"Kiwi is a fruit that produces a gas called ethylene, which helps to ripen fruit at an accelerated pace. When you store kiwi in a paper bag, the bag traps the ethylene and ripens the fruit faster. Kiwi ripened in a bag will generally ripen twice as quickly as kiwi that’s left to ripen on the counter. You can also ripen other fruit faster by storing it in a paper bag with kiwi, or another ethylene-producing fruit. Other ethylene-producing fruits include apples, bananas, cantaloupe, grapes, honeydew, mangoes, peaches, pears, potatoes, and tomatoes."
        },
        {
          "headline":"Eat ripe kiwis immediately.",
          "description":"Kiwi is ripe when the fruit gives to gentle pressure when you press the fruit with your thumb. Ripe kiwi will also smell fragrant, and have a darker brown skin. Eat the sweet and juicy fruit right away, or store it properly for an extended shelf life."
        },
        {
          "headline":"Transfer kiwis to the refrigerator for longer storage.",
          "description":"Once the kiwis have finished ripening, place any leftovers into the refrigerator to preserve them. Ripe kiwi will only last on the counter for a couple of days, but will keep in the refrigerator for one to two weeks. You can also store unripe kiwi in the refrigerator for an extended period of time. Place the kiwis in a plastic bag and transfer them to the refrigerator for up to six weeks. When you want to eat the kiwis, place them on the counter for a few days to ripen."
        },
        {
          "headline":"Dehydrate them for a longer shelf life.",
          "description":"Dehydrated foods can last for years, because all of the moisture gets removed. Kiwis are best dehydrated when they are ripe but still quite firm, as they will retain a better texture. To dehydrate kiwis:\nWash, scrub, and dry the fruit\nPeel off the skin with a vegetable peeler, and remove the top and bottom stem scars\nSlice the kiwi into one-eighth to one-quarter inch (3 to 6.3 mm) slices\nArrange the slices in single layers on dehydrator trays\nDehydrate them for eight to 10 hours at 130 F (54 C)\nStore the slices in an airtight container\nSigns that your dried kiwi has spoiled include discoloration, mold, chewiness or extreme hardness, a bad odor, and flavorless."
        },
        {
          "headline":"Freeze ripe kiwi for extended periods.",
          "description":"Rinse the kiwi under running water and scrub it with a brush or cloth. Pat the fruit dry. Remove the hard top and bottom stems from the fruit. Slice the kiwi into bite-sized chunks and spread them out on a baking sheet. Place the baking sheet in the freezer overnight. Transfer the slices to an airtight container or freezer bag and return them to the freezer. Kiwi will last for up to nine months in the freezer."
        }
      ]
    },
    {
      "name":"Enjoying Kiwis",
      "steps":[
        {
          "headline":"Eat them on their own.",
          "description":"To eat kiwi, rinse the fruit under running water and scrub it with a brush or cloth. Cut out the top and bottom stems. From there, you can peel the skin off with a vegetable peeler, or leave it on. Eat the kiwi like an apple, or cut it into chunks or slices. You can also eat kiwi by scooping out the flesh. Just cut the fruit in half widthwise, and use a spoon to scoop the flesh from the two halves."
        },
        {
          "headline":"Add them to smoothies.",
          "description":"Kiwis are great in smoothies, especially when paired with fruits like strawberries and bananas. To make your own smoothie recipes, wash the kiwi, peel the skin, and cut the fruit into quarters. Add the kiwi to a blender, along with other prepared fruits, milk, yogurt, orange juice, ice, or spices if desired. Blend the mixture until smooth and serve immediately. You can also make a berry kiwi smoothie by blending together:\n1 banana\n6 strawberries\n1 kiwi\n½ cup (72 g) vanilla frozen yogurt\n¾ cup (176 ml) pineapple and orange juice blend"
        },
        {
          "headline":"Sprinkle them on breakfast foods.",
          "description":"You can use peeled chunks or slices of kiwi to top French toast, pancakes, waffles, cereal, oatmeal, and other breakfast foods. Because kiwi is so sweet and juicy, it’s an excellent alternative to syrups and the sugary toppings that people often put on grain-based breakfasts."
        },
        {
          "headline":"Top desserts with kiwi slices.",
          "description":"Fresh kiwi is also an excellent addition to many desserts. Wash, peel, and slice the kiwi into thin disks. Layer the slices onto the top of your favorite desserts, such as cakes, pies, cheesecakes, ice cream, and sorbet. Kiwi pairs well with vanilla, berry, and citrus flavored ice creams and sorbets. It’s also an ideal topping for New York cheesecake, custard-based desserts, and fruit breads."
        },
        {
          "headline":"Mix them in with salads.",
          "description":"Kiwi can be used in place of tomatoes in a salad, or added to any salad along with tomato and other fruit. Kiwi goes especially well in salads that have ingredients like goat cheese, candied nuts, and balsamic vinaigrettes."
        }
      ]
    }
  ],
  "text":" Picking Ripe Kiwis Choose kiwi based on the skin color. Although the fruit inside a kiwi is green (or yellow), you should avoid kiwis that have a greenish hue to their skin. Instead, pick kiwis that have goldish or dark brown skin. Kiwis with gold skin will be slightly firmer, and ones with dark brown skin will be softer. Look for fruit that’s plump. Kiwis are supposed to be juicy and sweet, so look for fruit that looks full, round, and full of juice. Avoid kiwi that looks shrivelled or withered. Inspect kiwis for bruising, blemishes, and wrinkles. The skin of the kiwi should be uniform in color, and not have any dark spots, cuts, or bruises that indicate damage to the fruit. Also look over the fruit for wrinkles, which indicate moisture loss. Kiwi with bruises, cuts, or blemishes is still safe to eat. Simply cut out the blemish before eating the rest of the fruit. Press the fruit gently to test ripeness. Delicately press your thumb into the outside of the fruit. When the kiwi is ripe and ready to eat, the fruit will yield to your squeeze. The fruit should be firm but not mushy or overly soft. If the kiwi doesn’t give when you press it, then it’s not ripe. Unripe kiwi will be tart and hard if you try to eat it, but it will ripen if you leave it at room temperature for a few days. Overly soft or mushy kiwi is likely bruised, damaged, or overripe, so avoid these kiwis. Do not purchase or eat kiwi that’s oozing juice or moldy. Mold on a kiwi may appear as a black, fuzzy green, or brown spot. Smell the kiwi. Unripe kiwi has no scent, so you can tell when a kiwi is ripe by the aroma. Bring the kiwi to your nose and inhale deeply. A mild fragrant scent indicates that the kiwi is ripe and ready to eat. Storing Ripe and Unripe Kiwis Store kiwis on the counter to ripen them. Kiwi is one of those fruits that will continue to ripen after it’s harvested. When you buy unripe kiwi, leave them on the counter at room temperature, and they will ripen over the next three to seven days. Other fruits that continue ripening after harvest include apples, bananas, plums, and apricots. There are even a few fruits, like avocados, that won’t ripen unless you pick them. Transfer unripe kiwis to a paper bag to ripen them faster. Kiwi is a fruit that produces a gas called ethylene, which helps to ripen fruit at an accelerated pace. When you store kiwi in a paper bag, the bag traps the ethylene and ripens the fruit faster. Kiwi ripened in a bag will generally ripen twice as quickly as kiwi that’s left to ripen on the counter. You can also ripen other fruit faster by storing it in a paper bag with kiwi, or another ethylene-producing fruit. Other ethylene-producing fruits include apples, bananas, cantaloupe, grapes, honeydew, mangoes, peaches, pears, potatoes, and tomatoes. Eat ripe kiwis immediately. Kiwi is ripe when the fruit gives to gentle pressure when you press the fruit with your thumb. Ripe kiwi will also smell fragrant, and have a darker brown skin. Eat the sweet and juicy fruit right away, or store it properly for an extended shelf life. Transfer kiwis to the refrigerator for longer storage. Once the kiwis have finished ripening, place any leftovers into the refrigerator to preserve them. Ripe kiwi will only last on the counter for a couple of days, but will keep in the refrigerator for one to two weeks. You can also store unripe kiwi in the refrigerator for an extended period of time. Place the kiwis in a plastic bag and transfer them to the refrigerator for up to six weeks. When you want to eat the kiwis, place them on the counter for a few days to ripen. Dehydrate them for a longer shelf life. Dehydrated foods can last for years, because all of the moisture gets removed. Kiwis are best dehydrated when they are ripe but still quite firm, as they will retain a better texture. To dehydrate kiwis:\nWash, scrub, and dry the fruit\nPeel off the skin with a vegetable peeler, and remove the top and bottom stem scars\nSlice the kiwi into one-eighth to one-quarter inch (3 to 6.3 mm) slices\nArrange the slices in single layers on dehydrator trays\nDehydrate them for eight to 10 hours at 130 F (54 C)\nStore the slices in an airtight container\nSigns that your dried kiwi has spoiled include discoloration, mold, chewiness or extreme hardness, a bad odor, and flavorless. Freeze ripe kiwi for extended periods. Rinse the kiwi under running water and scrub it with a brush or cloth. Pat the fruit dry. Remove the hard top and bottom stems from the fruit. Slice the kiwi into bite-sized chunks and spread them out on a baking sheet. Place the baking sheet in the freezer overnight. Transfer the slices to an airtight container or freezer bag and return them to the freezer. Kiwi will last for up to nine months in the freezer. Enjoying Kiwis Eat them on their own. To eat kiwi, rinse the fruit under running water and scrub it with a brush or cloth. Cut out the top and bottom stems. From there, you can peel the skin off with a vegetable peeler, or leave it on. Eat the kiwi like an apple, or cut it into chunks or slices. You can also eat kiwi by scooping out the flesh. Just cut the fruit in half widthwise, and use a spoon to scoop the flesh from the two halves. Add them to smoothies. Kiwis are great in smoothies, especially when paired with fruits like strawberries and bananas. To make your own smoothie recipes, wash the kiwi, peel the skin, and cut the fruit into quarters. Add the kiwi to a blender, along with other prepared fruits, milk, yogurt, orange juice, ice, or spices if desired. Blend the mixture until smooth and serve immediately. You can also make a berry kiwi smoothie by blending together:\n1 banana\n6 strawberries\n1 kiwi\n½ cup (72 g) vanilla frozen yogurt\n¾ cup (176 ml) pineapple and orange juice blend Sprinkle them on breakfast foods. You can use peeled chunks or slices of kiwi to top French toast, pancakes, waffles, cereal, oatmeal, and other breakfast foods. Because kiwi is so sweet and juicy, it’s an excellent alternative to syrups and the sugary toppings that people often put on grain-based breakfasts. Top desserts with kiwi slices. Fresh kiwi is also an excellent addition to many desserts. Wash, peel, and slice the kiwi into thin disks. Layer the slices onto the top of your favorite desserts, such as cakes, pies, cheesecakes, ice cream, and sorbet. Kiwi pairs well with vanilla, berry, and citrus flavored ice creams and sorbets. It’s also an ideal topping for New York cheesecake, custard-based desserts, and fruit breads. Mix them in with salads. Kiwi can be used in place of tomatoes in a salad, or added to any salad along with tomato and other fruit. Kiwi goes especially well in salads that have ingredients like goat cheese, candied nuts, and balsamic vinaigrettes.",
  "tyn_model":[
    "kiwi",
    "kiwis",
    "refrigerator",
    "bananas",
    "apples",
    "ethylene",
    "ethylene-",
    "tomatoes",
    "vegetable peeler",
    "airtight container",
    "water",
    "baking sheet",
    "strawberries",
    "orange juice",
    "fruit",
    "unripe kiwi",
    "plums",
    "apricots",
    "avocados",
    "cantaloupe",
    "grapes",
    "peaches",
    "potatoes",
    "dehydrator trays",
    "freezer",
    "freezer bag",
    "spoon",
    "blender",
    "milk",
    "yogurt",
    "ice",
    "spices",
    "banana",
    "vanilla frozen yogurt",
    "pineapple",
    "french toast",
    "syrups",
    "cakes",
    "ice cream",
    "sorbet",
    "ice creams",
    "sorbets",
    "fruit breads",
    "tomato",
    "goat cheese",
    "nuts",
    "balsamic vinaigrettes"
  ],
  "tyn_section":[

  ]
}