{
  "title":"How to Make Popcorn Ice Cream",
  "url":"https://www.wikihow.com/Make-Popcorn-Ice-Cream",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts"
  ],
  "steps":[
    {
      "headline":"Get a packet of your favorite popcorn and set it aside.",
      "description":"In a saucepan, mix two cups of cream and one cup of milk and add the popcorn."
    },
    {
      "headline":"Boil the milk and cream mixture and let it stand in the saucepan for 10 - 15 minutes.",
      "description":"This allows the milk and cream to absorb the popcorn flavour."
    },
    {
      "headline":"Drain the mixture with a colander and into a bowl.",
      "description":"Strain out and discard remaining pieces of popcorn."
    },
    {
      "headline":"Combine five egg yolks with a cup of sugar in a separate bowl and mix until fluffy.",
      "description":"Beat the egg and sugar combination with the cream and milk mixture."
    },
    {
      "headline":"Reheat the saucepan on the stove until the mixture reaches 100 F degrees or until it becomes thick.",
      "description":"Stir constantly to keep ingredients from boiling."
    },
    {
      "headline":"Scoop the mixture into a container and cool the mixture in a freezer.",
      "description":"Freeze for at least 2 hours to ensure firmness."
    },
    {
      "headline":"Use food colouring and/or syrup if you want to enhance different colours.",
      "description":"You can also use this to enhance flavour."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Get a packet of your favorite popcorn and set it aside. In a saucepan, mix two cups of cream and one cup of milk and add the popcorn. Boil the milk and cream mixture and let it stand in the saucepan for 10 - 15 minutes. This allows the milk and cream to absorb the popcorn flavour. Drain the mixture with a colander and into a bowl. Strain out and discard remaining pieces of popcorn. Combine five egg yolks with a cup of sugar in a separate bowl and mix until fluffy. Beat the egg and sugar combination with the cream and milk mixture. Reheat the saucepan on the stove until the mixture reaches 100 F degrees or until it becomes thick. Stir constantly to keep ingredients from boiling. Scoop the mixture into a container and cool the mixture in a freezer. Freeze for at least 2 hours to ensure firmness. Use food colouring and/or syrup if you want to enhance different colours. You can also use this to enhance flavour. Finished. ",
  "tyn_model":[
    "cream",
    "milk",
    "saucepan",
    "bowl",
    "sugar",
    "colander",
    "popcorn",
    "egg",
    "stove",
    "container",
    "freezer",
    "food colouring and/or",
    "syrup"
  ],
  "tyn_section":[

  ]
}