{
  "title":"How to Make Groundhog Day Cookies",
  "url":"https://www.wikihow.com/Make-Groundhog-Day-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits"
  ],
  "steps":[
    {
      "headline":"Sift the following ingredients into a bowl: the flour, salt, baking soda, baking powder, and three spices.",
      "description":"Put to one side."
    },
    {
      "headline":"Cream the butter and sugar.",
      "description":"When fluffy, mix in the egg yolk and molasses."
    },
    {
      "headline":"Stir the sifted mixture into the butter mixture.",
      "description":"Mix thoroughly."
    },
    {
      "headline":"Form into a dough ball.",
      "description":"Wrap the dough ball in plastic food wrap and place in the refrigerator. Leave to chill overnight. It can even be frozen or chilled for several nights in a row."
    },
    {
      "headline":"Preheat the oven to 350ºF/180ºC.",
      "description":"Lay parchment paper on the cookie sheet."
    },
    {
      "headline":"Pull off a small piece of dough and place it on plastic food wrap.",
      "description":"Place another sheet of plastic food wrap over the top."
    },
    {
      "headline":"Roll over the plastic wrap to flatten to the dough to about ⁄8 inch (0.3 cm) thickness.",
      "description":""
    },
    {
      "headline":"Cut out the cookies.",
      "description":"Use a lightly floured cutter. If you have a groundhog shape, all the better. See How to make cookie cutters from foil for an idea on how to tailor the cookie shape."
    },
    {
      "headline":"Arrange the cookies on the cookie sheet.",
      "description":"Brush each cookie lightly with beaten egg. To make it look more like a groundhog, use the raisins or currants for eyes and perhaps even a mouth, depending on how creative you're feeling."
    },
    {
      "headline":"Place in the oven.",
      "description":"Bake the cookies for 8 to 10 minutes, or until slightly browned."
    },
    {
      "headline":"Leave the cookie sheet to cool slightly before removing the cookies.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Sift the following ingredients into a bowl: the flour, salt, baking soda, baking powder, and three spices. Put to one side. Cream the butter and sugar. When fluffy, mix in the egg yolk and molasses. Stir the sifted mixture into the butter mixture. Mix thoroughly. Form into a dough ball. Wrap the dough ball in plastic food wrap and place in the refrigerator. Leave to chill overnight. It can even be frozen or chilled for several nights in a row. Preheat the oven to 350ºF/180ºC. Lay parchment paper on the cookie sheet. Pull off a small piece of dough and place it on plastic food wrap. Place another sheet of plastic food wrap over the top. Roll over the plastic wrap to flatten to the dough to about ⁄8 inch (0.3 cm) thickness.  Cut out the cookies. Use a lightly floured cutter. If you have a groundhog shape, all the better. See How to make cookie cutters from foil for an idea on how to tailor the cookie shape. Arrange the cookies on the cookie sheet. Brush each cookie lightly with beaten egg. To make it look more like a groundhog, use the raisins or currants for eyes and perhaps even a mouth, depending on how creative you're feeling. Place in the oven. Bake the cookies for 8 to 10 minutes, or until slightly browned. Leave the cookie sheet to cool slightly before removing the cookies.  Finished. ",
  "tyn_model":[
    "plastic food wrap",
    "cookie sheet",
    "butter",
    "oven",
    "bowl",
    "flour",
    "salt",
    "baking soda",
    "baking powder",
    "spices",
    "sugar",
    "egg yolk",
    "molasses",
    "refrigerator",
    "parchment paper",
    "plastic wrap",
    "cookie cutters",
    "foil",
    "beaten egg",
    "raisins",
    "currants"
  ],
  "tyn_section":[

  ]
}