{
  "title":"How to Make a Papier Mâché Seashell",
  "url":"https://www.wikihow.com/Make-a-Papier-M%C3%A2ch%C3%A9-Seashell",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Papier Mache"
  ],
  "steps":[
    {
      "headline":"Wash your seashell (look for a flat one, such as a scallop shell, to make it easier to slide out).",
      "description":"Wash it and make sure there is no dirt or sand on it."
    },
    {
      "headline":"Set up your station.",
      "description":"Mix warm water with glue and shred thin pieces of newspaper."
    },
    {
      "headline":"Lay your seashell out on the newspaper.",
      "description":"Take a piece of newspaper and dip it in to the glue mixture. Put it on your shell."
    },
    {
      "headline":"Keep doing this until all of your shell is covered with papier mâché.",
      "description":""
    },
    {
      "headline":"Let the mold dry.",
      "description":""
    },
    {
      "headline":"Wait for the glue to dry completely and for the mold to harden.",
      "description":""
    },
    {
      "headline":"Use a blunt knife and cut along the sides of the mold.",
      "description":""
    },
    {
      "headline":"Take the shell out and put it away, papier mâché the sides of the mold you cut to stick them back together.",
      "description":""
    },
    {
      "headline":"Let it dry.",
      "description":""
    },
    {
      "headline":"Allow to dry and admire your papier mâché seashell.",
      "description":""
    }
  ],
  "text":" Wash your seashell (look for a flat one, such as a scallop shell, to make it easier to slide out). Wash it and make sure there is no dirt or sand on it. Set up your station. Mix warm water with glue and shred thin pieces of newspaper. Lay your seashell out on the newspaper. Take a piece of newspaper and dip it in to the glue mixture. Put it on your shell. Keep doing this until all of your shell is covered with papier mâché.  Let the mold dry.  Wait for the glue to dry completely and for the mold to harden.  Use a blunt knife and cut along the sides of the mold.  Take the shell out and put it away, papier mâché the sides of the mold you cut to stick them back together.  Let it dry.  Allow to dry and admire your papier mâché seashell. ",
  "tyn_model":[
    "glue",
    "newspaper",
    "papier mâché",
    "water",
    "blunt knife",
    "papier mâché seashell"
  ],
  "tyn_section":[

  ]
}