{
  "title":"How to Winterize Your Car",
  "url":"https://www.wikihow.com/Winterize-Your-Car",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling"
  ],
  "methods":[
    {
      "name":"Winterizing the Exterior of Your Car",
      "steps":[
        {
          "headline":"Replace your windshield wipers and wiper fluid.",
          "description":"Poor visibility is extremely dangerous while driving, especially in winter, so it's important to ensure that your windshield wipers are in good working condition. Old blades are prone to cracking, tearing or simply not working when faced with the icy precipitation that's beating against your windshield. Examine yours to see whether the rubber is cracked or frayed, and keep in mind that wiper blades are supposed to be replaced every 6 to 12 months. You could also consider buying wiper blades specifically designed for winter weather. Fill the windshield washer reservoir with fresh washer fluid. Some washer fluids have a defroster additive and a lower freezing temperature,  making them a good choice for the cold winter months."
        },
        {
          "headline":"Check the tire pressure on all of your tires.",
          "description":"Maintaining the correct tire pressure for your vehicle is very important during the winter months. Deflated tires have decreased traction, making them more prone to slipping on icy surfaces. Keep in mind that your tire pressure will be affected by the decrease in temperature — in fact, for every 10 degree F drop in temperature, the air pressure in your tires will be reduced by about 1 PSI. Therefore, it's important to keep an eye on your tires throughout the winter months. Use a tire gauge to see if your tires meet the standards set for your vehicle. If you're not familiar with the proper level for your vehicle, check the inside edge of your driver's side door frame. There should be a sticker there that indicates several things, including suggested tire pressure. If you do not have a tire gauge, you can usually find one at your local gas station, where you can also fill your tires with air. This is usually free or costs very little. While checking the air pressure, it's also important to check how your tires are wearing. If they need replacing or rotating, do this before winter weather hits."
        },
        {
          "headline":"Give your car a good coat of wax before winter weather arrives.",
          "description":"A waxed surface repels snow, dirt and salt better than a non-waxed one. It will help your car look better and protect the paint. Before you apply the wax, make sure to give the car a thorough wash. Don't forget to rinse the underside of the car to remove any sand or salt residue. Try to wax the car before the first snowfall hits, or before the temperature drops below 55 °F (13 °C). This will protect the paint, while also making any snow or ice easier to brush off. While you're at it, now is a good time to clean the inside of your car. Remove any clutter, vacuum the floor and seats and use an upholstery cleaner if necessary. You may also want to replace the carpeted floor mats with some water-resistant ones, to protect your floors from melted ice and snow."
        },
        {
          "headline":"Make sure your lights are working.",
          "description":"As mentioned above, having good visibility is very important, especially on the dark winter evening. However, it's not only important that you can see, it's also imperative that you can be seen. This is why ensuring that your lights are in proper working order is essential. Get somebody to help you do a visual check on all of the exterior lights on your car — including your headlights, taillights, backup lights and signal lights (including hazards and brake lights). You should also be aware that the lights will be greater burden on your vehicle's electrical system in the winter, due to shorter and darker days. You'll need to take this into consideration when testing your battery."
        }
      ]
    },
    {
      "name":"Checking the Mechanics",
      "steps":[
        {
          "headline":"Change your engine oil.",
          "description":"As the cold winter months approach, it's a good idea to check your engine oil and decide whether it needs to be changed. Dropping temperatures cause the oil in your engine to become more viscous (thicker). When this happens, the oil flows too slowly from one part of the engine to another — this prevents the engine from being properly lubricated, leading to overheating and an engine that won't start. Therefore, it is often advisable to switch to a thinner oil during the cold winter months, in order to keep your engine sufficiently lubricated. If you're unsure about what type of oil to use, check the owner's manual for more specific instructions on what type of oil is best for your specific car, under certain temperatures and weather conditions. It's also important to remember that, as a general rule, the oil in your car should be changed every 3,000 miles (4,800 km), or once every three months."
        },
        {
          "headline":"Check your belts and hoses.",
          "description":"Your car's belts and hoses are susceptible to general wear and tear and are particularly affected by the cold weather. If your car isn't due for its 30,000-mile full-service tune-up this winter (where the belts and hoses are often replaced) then it's a good idea to check them yourself for any signs of damage and get them replaced if necessary. This step should not be neglected, because if something snaps while driving, you'll have no choice but to call a tow truck — which is far from ideal in the middle of winter."
        },
        {
          "headline":"Replace old coolant with antifreeze.",
          "description":"It's highly important that your engine contains the correct ratio of anti-freeze to water before the cold winter months set in, otherwise the coolant could freeze, causing the engine to overheat and potentially blow a gasket. A ratio of 50% anti-freeze to 50% water is recommended for most cars, though in some circumstances this is increased to 60% anti-freeze, 40% water. Luckily, you can buy pre-mixed bottles of anti-freeze and water at the gas station. If you're not sure about the current ratio of antifreeze to water in your car's radiator fluid, you can pick up an anti-freeze tester at your local auto parts store for relatively cheap. If the ratio is incorrect, you will need to flush your coolant system before you can refill it with the correct ratio. If this is not something you know how to do, take your car to a mechanic or oil change location. There is, however, no need to flush your system if you drain and refill on scheduled maintenance."
        },
        {
          "headline":"Make sure your 4-wheel drive is working.",
          "description":"If your car has a 4-wheel drive function, it's important to get it checked out to ensure that it's working properly, especially if you haven't used it since the previous winter. Have a mechanic check the 4-wheel drive to ensure that the system engages and disengages smoothly, and that the transmission and gear fluids are at the correct level. At this time, you (and any members of your household) should also review how the system works and understand the conditions under which it should be used. 4-wheel drive can improve your tires' traction on snowy or icy roads, thus decreasing your chances of getting stuck. However, this doesn't mean that you should drive any faster or less safely than you normally would in unfavorable conditions."
        },
        {
          "headline":"Check your battery.",
          "description":"It's essential that your battery is in good working condition before the winter months — in cold weather, your battery takes more time to generate power, while the engine requires more current from the battery in order to start. If your battery is in poor condition, it won't be able to handle these requirements and your car will fail to start. Keep track of how old your car battery is — they usually last between 3 to 5 years, so if yours is somewhere in that range it may be time to get a new one. You can also ask your mechanic to perform a battery load test to determine whether your battery needs to be placed. Even if it doesn't need to be replaced, you should give your car battery a once over to check for any corrosion on the battery's posts and connections and for any fraying on the cables. You also need to check the fluid level if your car is relatively old — you can do this by unscrewing the caps on top of the battery. If the fluid level is low, you can fill it with distilled water. Just be careful not to overfill it. However, most (if not all) new batteries are maintenance-free and do not require distilled water to be added. In fact, there are no caps to take off."
        },
        {
          "headline":"Check your defrosting and heating units.",
          "description":"The defrosting and heating units on your car are essential for your visibility and comfort while driving, so it's important to ensure that they are functioning normally. The defroster helps to clear condensation from the inside of the windshield by blowing warm, dry air onto the glass. If it's not working properly, the windows can fog up and obstruct your view of the road. Have a mechanic check the defroster to ensure that it's working properly. If you find the window is still fogging up, you'll need to check your doors and windows for air leaks that could be letting in moisture. It will become pretty obvious if your heater isn't working once the cold winter weather hits, but it's important to get this fixed as soon as possible. It may be necessary to replace the heater coil — this can be expensive, but it will be worth every cent on those cold winter mornings. It's not just your comfort that's at stake, it's also your safety. If you're too cold while driving, this may affect your steering ability and attention to the road. Having a functional heating system could also save your life if you get stranded somewhere in your car."
        }
      ]
    },
    {
      "name":"Being Prepared at All Times",
      "steps":[
        {
          "headline":"Make sure your spare tire is ready to use.",
          "description":"During adverse weather conditions, it's essential to have a spare tire in the car at all times. You should inspect your spare tire periodically to ensure that it's in good working condition — you don't want to blow a tire only to find that the spare isn't working! You should also ensure that your jack, wrench and wheel lock tool are all in a safe, secure position inside the car and that everyone in your household knows where this is."
        },
        {
          "headline":"Keep your tank at least half-full at all times.",
          "description":"When your gas tank is at least half full, there is less of a chance that your fuel lines will freeze up in cold weather. This happens when condensation forms on the sides of a near-empty fuel tank, drips down into the water, sinks to the bottom and freezes due to icy conditions. Keeping your gas tank at least half full at all times reduces the chances of this happening and also limits the possibility of getting stranded somewhere when you run out of fuel."
        },
        {
          "headline":"Put together an emergency kit and keep it in your trunk.",
          "description":"It's a very good idea to keep an emergency kit in your car in case it breaks down and you get stranded in bad weather conditions. The kit should include: boots, gloves, hats, some wool blankets, ice scrapers, defroster, a flashlight, salt or cat litter, jumper cables, a first-aid kit, some flares, bottles of coolant and washer fluid, and a radio. You should also include some non-perishable snacks (like unsalted canned nuts and dried fruit) and a bottle of water. Even if the water freezes, you can thaw it out or eat the ice in order to stay hydrated. You should also keep a phone charger in the car for your cell phone."
        },
        {
          "headline":"Consider getting snow tires.",
          "description":"If you live in an area that's covered in snow and ice all winter long, you should consider replacing your regular tires with snow tires during the colder months. Snow tires are softer and more flexible that regular tires and also have a different tread shape, which gives them greater traction on snowy and icy surfaces. Alternatively, you could keep a set of tire chains in your trunk for driving in snowy, icy conditions. These are particularly necessary  in mountainous regions. You could also consider carrying a traction pad or scrap piece of carpet with you — this can help you to free your wheels if your car gets stuck in deep snow."
        },
        {
          "headline":"Know what to do if you get stranded.",
          "description":"Despite your best efforts to winterize your car, sometimes things will still go wrong and you may end up stranded. It's important that you know exactly what to do in order to stay safe and warm if this situation should ever arise. Firstly, you should never leave your car unless you know exactly where you are and how far you will need to walk in order to find help. If you don't know where you are, light a flare on either side of your car to draw attention to your location. Try to keep yourself as warm as possible by putting on any extra clothes and using any available blankets (wool is best for heat). If you still have gas, run the heater for ten minutes every hour to raise the temperature in the car (as long as you are certain that the gas pipe is not blocked). Despite the cold, you should keep one window at least partly open at all times to prevent heavy snow or ice from sealing the car shut. Keep yourself hydrated by drinking water or eating ice, and suck on a hard candy to prevent your mouth drying out."
        }
      ]
    }
  ],
  "text":" Winterizing the Exterior of Your Car Replace your windshield wipers and wiper fluid. Poor visibility is extremely dangerous while driving, especially in winter, so it's important to ensure that your windshield wipers are in good working condition. Old blades are prone to cracking, tearing or simply not working when faced with the icy precipitation that's beating against your windshield. Examine yours to see whether the rubber is cracked or frayed, and keep in mind that wiper blades are supposed to be replaced every 6 to 12 months. You could also consider buying wiper blades specifically designed for winter weather. Fill the windshield washer reservoir with fresh washer fluid. Some washer fluids have a defroster additive and a lower freezing temperature,  making them a good choice for the cold winter months. Check the tire pressure on all of your tires. Maintaining the correct tire pressure for your vehicle is very important during the winter months. Deflated tires have decreased traction, making them more prone to slipping on icy surfaces. Keep in mind that your tire pressure will be affected by the decrease in temperature — in fact, for every 10 degree F drop in temperature, the air pressure in your tires will be reduced by about 1 PSI. Therefore, it's important to keep an eye on your tires throughout the winter months. Use a tire gauge to see if your tires meet the standards set for your vehicle. If you're not familiar with the proper level for your vehicle, check the inside edge of your driver's side door frame. There should be a sticker there that indicates several things, including suggested tire pressure. If you do not have a tire gauge, you can usually find one at your local gas station, where you can also fill your tires with air. This is usually free or costs very little. While checking the air pressure, it's also important to check how your tires are wearing. If they need replacing or rotating, do this before winter weather hits. Give your car a good coat of wax before winter weather arrives. A waxed surface repels snow, dirt and salt better than a non-waxed one. It will help your car look better and protect the paint. Before you apply the wax, make sure to give the car a thorough wash. Don't forget to rinse the underside of the car to remove any sand or salt residue. Try to wax the car before the first snowfall hits, or before the temperature drops below 55 °F (13 °C). This will protect the paint, while also making any snow or ice easier to brush off. While you're at it, now is a good time to clean the inside of your car. Remove any clutter, vacuum the floor and seats and use an upholstery cleaner if necessary. You may also want to replace the carpeted floor mats with some water-resistant ones, to protect your floors from melted ice and snow. Make sure your lights are working. As mentioned above, having good visibility is very important, especially on the dark winter evening. However, it's not only important that you can see, it's also imperative that you can be seen. This is why ensuring that your lights are in proper working order is essential. Get somebody to help you do a visual check on all of the exterior lights on your car — including your headlights, taillights, backup lights and signal lights (including hazards and brake lights). You should also be aware that the lights will be greater burden on your vehicle's electrical system in the winter, due to shorter and darker days. You'll need to take this into consideration when testing your battery. Checking the Mechanics Change your engine oil. As the cold winter months approach, it's a good idea to check your engine oil and decide whether it needs to be changed. Dropping temperatures cause the oil in your engine to become more viscous (thicker). When this happens, the oil flows too slowly from one part of the engine to another — this prevents the engine from being properly lubricated, leading to overheating and an engine that won't start. Therefore, it is often advisable to switch to a thinner oil during the cold winter months, in order to keep your engine sufficiently lubricated. If you're unsure about what type of oil to use, check the owner's manual for more specific instructions on what type of oil is best for your specific car, under certain temperatures and weather conditions. It's also important to remember that, as a general rule, the oil in your car should be changed every 3,000 miles (4,800 km), or once every three months. Check your belts and hoses. Your car's belts and hoses are susceptible to general wear and tear and are particularly affected by the cold weather. If your car isn't due for its 30,000-mile full-service tune-up this winter (where the belts and hoses are often replaced) then it's a good idea to check them yourself for any signs of damage and get them replaced if necessary. This step should not be neglected, because if something snaps while driving, you'll have no choice but to call a tow truck — which is far from ideal in the middle of winter. Replace old coolant with antifreeze. It's highly important that your engine contains the correct ratio of anti-freeze to water before the cold winter months set in, otherwise the coolant could freeze, causing the engine to overheat and potentially blow a gasket. A ratio of 50% anti-freeze to 50% water is recommended for most cars, though in some circumstances this is increased to 60% anti-freeze, 40% water. Luckily, you can buy pre-mixed bottles of anti-freeze and water at the gas station. If you're not sure about the current ratio of antifreeze to water in your car's radiator fluid, you can pick up an anti-freeze tester at your local auto parts store for relatively cheap. If the ratio is incorrect, you will need to flush your coolant system before you can refill it with the correct ratio. If this is not something you know how to do, take your car to a mechanic or oil change location. There is, however, no need to flush your system if you drain and refill on scheduled maintenance. Make sure your 4-wheel drive is working. If your car has a 4-wheel drive function, it's important to get it checked out to ensure that it's working properly, especially if you haven't used it since the previous winter. Have a mechanic check the 4-wheel drive to ensure that the system engages and disengages smoothly, and that the transmission and gear fluids are at the correct level. At this time, you (and any members of your household) should also review how the system works and understand the conditions under which it should be used. 4-wheel drive can improve your tires' traction on snowy or icy roads, thus decreasing your chances of getting stuck. However, this doesn't mean that you should drive any faster or less safely than you normally would in unfavorable conditions. Check your battery. It's essential that your battery is in good working condition before the winter months — in cold weather, your battery takes more time to generate power, while the engine requires more current from the battery in order to start. If your battery is in poor condition, it won't be able to handle these requirements and your car will fail to start. Keep track of how old your car battery is — they usually last between 3 to 5 years, so if yours is somewhere in that range it may be time to get a new one. You can also ask your mechanic to perform a battery load test to determine whether your battery needs to be placed. Even if it doesn't need to be replaced, you should give your car battery a once over to check for any corrosion on the battery's posts and connections and for any fraying on the cables. You also need to check the fluid level if your car is relatively old — you can do this by unscrewing the caps on top of the battery. If the fluid level is low, you can fill it with distilled water. Just be careful not to overfill it. However, most (if not all) new batteries are maintenance-free and do not require distilled water to be added. In fact, there are no caps to take off. Check your defrosting and heating units. The defrosting and heating units on your car are essential for your visibility and comfort while driving, so it's important to ensure that they are functioning normally. The defroster helps to clear condensation from the inside of the windshield by blowing warm, dry air onto the glass. If it's not working properly, the windows can fog up and obstruct your view of the road. Have a mechanic check the defroster to ensure that it's working properly. If you find the window is still fogging up, you'll need to check your doors and windows for air leaks that could be letting in moisture. It will become pretty obvious if your heater isn't working once the cold winter weather hits, but it's important to get this fixed as soon as possible. It may be necessary to replace the heater coil — this can be expensive, but it will be worth every cent on those cold winter mornings. It's not just your comfort that's at stake, it's also your safety. If you're too cold while driving, this may affect your steering ability and attention to the road. Having a functional heating system could also save your life if you get stranded somewhere in your car. Being Prepared at All Times Make sure your spare tire is ready to use. During adverse weather conditions, it's essential to have a spare tire in the car at all times. You should inspect your spare tire periodically to ensure that it's in good working condition — you don't want to blow a tire only to find that the spare isn't working! You should also ensure that your jack, wrench and wheel lock tool are all in a safe, secure position inside the car and that everyone in your household knows where this is. Keep your tank at least half-full at all times. When your gas tank is at least half full, there is less of a chance that your fuel lines will freeze up in cold weather. This happens when condensation forms on the sides of a near-empty fuel tank, drips down into the water, sinks to the bottom and freezes due to icy conditions. Keeping your gas tank at least half full at all times reduces the chances of this happening and also limits the possibility of getting stranded somewhere when you run out of fuel. Put together an emergency kit and keep it in your trunk. It's a very good idea to keep an emergency kit in your car in case it breaks down and you get stranded in bad weather conditions. The kit should include: boots, gloves, hats, some wool blankets, ice scrapers, defroster, a flashlight, salt or cat litter, jumper cables, a first-aid kit, some flares, bottles of coolant and washer fluid, and a radio. You should also include some non-perishable snacks (like unsalted canned nuts and dried fruit) and a bottle of water. Even if the water freezes, you can thaw it out or eat the ice in order to stay hydrated. You should also keep a phone charger in the car for your cell phone. Consider getting snow tires. If you live in an area that's covered in snow and ice all winter long, you should consider replacing your regular tires with snow tires during the colder months. Snow tires are softer and more flexible that regular tires and also have a different tread shape, which gives them greater traction on snowy and icy surfaces. Alternatively, you could keep a set of tire chains in your trunk for driving in snowy, icy conditions. These are particularly necessary  in mountainous regions. You could also consider carrying a traction pad or scrap piece of carpet with you — this can help you to free your wheels if your car gets stuck in deep snow. Know what to do if you get stranded. Despite your best efforts to winterize your car, sometimes things will still go wrong and you may end up stranded. It's important that you know exactly what to do in order to stay safe and warm if this situation should ever arise. Firstly, you should never leave your car unless you know exactly where you are and how far you will need to walk in order to find help. If you don't know where you are, light a flare on either side of your car to draw attention to your location. Try to keep yourself as warm as possible by putting on any extra clothes and using any available blankets (wool is best for heat). If you still have gas, run the heater for ten minutes every hour to raise the temperature in the car (as long as you are certain that the gas pipe is not blocked). Despite the cold, you should keep one window at least partly open at all times to prevent heavy snow or ice from sealing the car shut. Keep yourself hydrated by drinking water or eating ice, and suck on a hard candy to prevent your mouth drying out.",
  "tyn_model":[
    "water",
    "oil",
    "wax",
    "salt",
    "— this",
    "belts",
    "coolant",
    "4-wheel drive",
    "defroster",
    "heater",
    "ice",
    "snow tires",
    "windshield wipers",
    "wiper blades",
    "— in",
    "tires",
    "— you",
    "distilled water",
    "wiper fluid",
    "windshield washer",
    "washer fluid",
    "washer fluids",
    "tire gauge",
    "upholstery cleaner",
    "— including",
    "— which",
    "antifreeze",
    "anti-freeze",
    "anti-freeze tester",
    "— they",
    "wrench",
    "gas tank",
    "ice scrapers",
    "flashlight",
    "first-aid kit",
    "coolant and washer fluid",
    "radio",
    "traction pad",
    "snow",
    "blankets"
  ],
  "tyn_section":[

  ]
}