{
  "title":"How to Make a Siphon",
  "url":"https://www.wikihow.com/Make-a-Siphon",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Plastic and Adhesive Projects"
  ],
  "methods":[
    {
      "name":"Making a Siphon for a Large Tank",
      "steps":[
        {
          "headline":"Get your materials.",
          "description":"For this project, you'll need: at least 10' of 5/8\" by 7/8\" vinyl tubing, an empty clear plastic bottle, a 1/2\" ball valve, three 1/2\" male hose adapters, and plumber's tape. You can always use more than 10' of 5/8\" by 7/8\" vinyl tubing if you need your siphon to be longer than 10'. These can all be found in a hardware store, usually the irrigation section. You'll also need scissors, a wrench, and a lighter."
        },
        {
          "headline":"Drill a hole in the bottle.",
          "description":"First, take off any labels on the plastic bottle. Wash it out if it had something besides water in it. Drill a 3/4\" hole in the cap of the bottle. The easiest way to do this is with the cap still on the bottle, tightly screwed."
        },
        {
          "headline":"Insert one of the male hose adapters.",
          "description":"Stick the thick end of one of the 1/2\" male hose adapters in the hole you drilled in the cap."
        },
        {
          "headline":"Cut the bottle.",
          "description":"Use scissors to cut off approximately two inches of the bottom of the bottle. Use a lighter to heat up the edges of the cut. Just run the flame along the edge to strengthen the plastic."
        },
        {
          "headline":"Put the hose adapters in the ball valve.",
          "description":"First, wrap a few layers of plumber's tape around the thick ends of the remaining two 1/2\" male hose adapters. Then thread them into both ends of the ball valve. Use a wrench to make them tight."
        },
        {
          "headline":"Cut and attach the tubing.",
          "description":"Use your scissors to cut 3' to 4' of tubing. Attach one end of this 3' to 4' tube to the male hose adapter connected to the bottle, and attach the other end to one of the male hose adapters on the ball valve. Attach one end of the remaining tubing to the last male hose adapter. The function of the ball valve is to give you the ability to stop and start the siphoning without having to put your mouth back on the tube that's been in dirty water."
        }
      ]
    },
    {
      "name":"Making a Homebrew Siphon",
      "steps":[
        {
          "headline":"Get your materials.",
          "description":"To siphon your homebrewed beer, or other beverage, from one container to another you need: a rubber sink stopper anywhere from 1 and 1/8th inch to 1 and 1/4 inch in diameter, 2 feet (0.61 m) of 1/4th inch tubing, three feet of 3/8th inch tubing, scissors, and a drill or a dremel. You need to have a drill bit that's smaller than 1/4th of an inch. The rubber sink stopper needs to be the kind that's concave or hollow on the side that goes into the sink, not solid."
        },
        {
          "headline":"Drill into the sink stopper.",
          "description":"Drill two holes in the sink stopper. The holes should be on either side of the small bump used to pull the sink stopper out of the sink. They should be as close to this bump and as vertically aligned with each other as possible."
        },
        {
          "headline":"Run the smaller tube through the hole.",
          "description":"Stick the smaller tube through one of the holes. Place the sink stopper on the opening of the bottle you're siphoning into, and run the tube down to the bottom of the bottle. If the tube doesn't fit in the hole, you can drill it a little bit bigger, but be careful. Don't make it any bigger than necessary. You want the tube to fit in very snugly, and airtight."
        },
        {
          "headline":"Cut off the excess tubing.",
          "description":"Now you want to cut the tube you just placed in the bottle through the hole in the stopper. Cut it about two inches from where it comes out of the hole. Don't throw away the excess tubing."
        },
        {
          "headline":"Stick the excess through the other hole.",
          "description":"Run the left over tubing that you cut off into the other hole, about one inch in."
        },
        {
          "headline":"Put the larger tube over the smaller one.",
          "description":"Fit the larger tube over the smaller tube, the one that reaches the bottom of the bottle. Fit about 2 inches of the larger tube over the smaller one so it won't slip off."
        },
        {
          "headline":"Blow into the excess tube.",
          "description":"To siphon, place the sink stopper over the rim of the bottle with the brew in it. Place the other end of the long tube into the container you're siphoning into. Blow into the excess tube. This will start the siphoning."
        }
      ]
    },
    {
      "name":"Making a Straw Siphon",
      "steps":[
        {
          "headline":"Get your materials.",
          "description":"To make a simple straw siphon, as a kids science experiment, or demonstration of the physics involved in siphoning, you need two bendy straws, scissors, and tape."
        },
        {
          "headline":"Cut one of the straws.",
          "description":"Cut one of the bendy straws right before the bendy part, so that the straw is no longer a bendy straw. Cut it at an angle so that it comes to a point."
        },
        {
          "headline":"Insert the cut straw into the other straw.",
          "description":"Stick the sharp end of the straw you just cut into the end of the other straw. It should go into the end that's closest to the bend. Fit it in far enough so that it doesn't slip out."
        },
        {
          "headline":"Tape the straws together.",
          "description":"Tape around where the two straws are connected. Use plenty of tape, as you want the seal to be air tight."
        },
        {
          "headline":"Stick the straw into the container with liquid.",
          "description":"Place either end of the newly created double-length bendy straw into the container with liquid in it. Make sure it's in far enough that the bend is submerged in the liquid."
        },
        {
          "headline":"Use the siphon.",
          "description":"Put your finger over the top of the straw. Begin lifting the straw out of the container. You'll see the liquid come up into the straw as you lift it. While keeping your finger over the end of the straw, place that end into the container you're siphoning into. Once it's in there, remove your finger. The liquid will now siphon from one container to the other."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making a Siphon for a Large Tank Get your materials. For this project, you'll need: at least 10' of 5/8\" by 7/8\" vinyl tubing, an empty clear plastic bottle, a 1/2\" ball valve, three 1/2\" male hose adapters, and plumber's tape. You can always use more than 10' of 5/8\" by 7/8\" vinyl tubing if you need your siphon to be longer than 10'. These can all be found in a hardware store, usually the irrigation section. You'll also need scissors, a wrench, and a lighter. Drill a hole in the bottle. First, take off any labels on the plastic bottle. Wash it out if it had something besides water in it. Drill a 3/4\" hole in the cap of the bottle. The easiest way to do this is with the cap still on the bottle, tightly screwed. Insert one of the male hose adapters. Stick the thick end of one of the 1/2\" male hose adapters in the hole you drilled in the cap. Cut the bottle. Use scissors to cut off approximately two inches of the bottom of the bottle. Use a lighter to heat up the edges of the cut. Just run the flame along the edge to strengthen the plastic. Put the hose adapters in the ball valve. First, wrap a few layers of plumber's tape around the thick ends of the remaining two 1/2\" male hose adapters. Then thread them into both ends of the ball valve. Use a wrench to make them tight. Cut and attach the tubing. Use your scissors to cut 3' to 4' of tubing. Attach one end of this 3' to 4' tube to the male hose adapter connected to the bottle, and attach the other end to one of the male hose adapters on the ball valve. Attach one end of the remaining tubing to the last male hose adapter. The function of the ball valve is to give you the ability to stop and start the siphoning without having to put your mouth back on the tube that's been in dirty water. Making a Homebrew Siphon Get your materials. To siphon your homebrewed beer, or other beverage, from one container to another you need: a rubber sink stopper anywhere from 1 and 1/8th inch to 1 and 1/4 inch in diameter, 2 feet (0.61 m) of 1/4th inch tubing, three feet of 3/8th inch tubing, scissors, and a drill or a dremel. You need to have a drill bit that's smaller than 1/4th of an inch. The rubber sink stopper needs to be the kind that's concave or hollow on the side that goes into the sink, not solid. Drill into the sink stopper. Drill two holes in the sink stopper. The holes should be on either side of the small bump used to pull the sink stopper out of the sink. They should be as close to this bump and as vertically aligned with each other as possible. Run the smaller tube through the hole. Stick the smaller tube through one of the holes. Place the sink stopper on the opening of the bottle you're siphoning into, and run the tube down to the bottom of the bottle. If the tube doesn't fit in the hole, you can drill it a little bit bigger, but be careful. Don't make it any bigger than necessary. You want the tube to fit in very snugly, and airtight. Cut off the excess tubing. Now you want to cut the tube you just placed in the bottle through the hole in the stopper. Cut it about two inches from where it comes out of the hole. Don't throw away the excess tubing. Stick the excess through the other hole. Run the left over tubing that you cut off into the other hole, about one inch in. Put the larger tube over the smaller one. Fit the larger tube over the smaller tube, the one that reaches the bottom of the bottle. Fit about 2 inches of the larger tube over the smaller one so it won't slip off. Blow into the excess tube. To siphon, place the sink stopper over the rim of the bottle with the brew in it. Place the other end of the long tube into the container you're siphoning into. Blow into the excess tube. This will start the siphoning. Making a Straw Siphon Get your materials. To make a simple straw siphon, as a kids science experiment, or demonstration of the physics involved in siphoning, you need two bendy straws, scissors, and tape. Cut one of the straws. Cut one of the bendy straws right before the bendy part, so that the straw is no longer a bendy straw. Cut it at an angle so that it comes to a point. Insert the cut straw into the other straw. Stick the sharp end of the straw you just cut into the end of the other straw. It should go into the end that's closest to the bend. Fit it in far enough so that it doesn't slip out. Tape the straws together. Tape around where the two straws are connected. Use plenty of tape, as you want the seal to be air tight. Stick the straw into the container with liquid. Place either end of the newly created double-length bendy straw into the container with liquid in it. Make sure it's in far enough that the bend is submerged in the liquid. Use the siphon. Put your finger over the top of the straw. Begin lifting the straw out of the container. You'll see the liquid come up into the straw as you lift it. While keeping your finger over the end of the straw, place that end into the container you're siphoning into. Once it's in there, remove your finger. The liquid will now siphon from one container to the other. Finished. ",
  "tyn_model":[
    "straw",
    "scissors",
    "sink stopper",
    "tubing",
    "tape",
    "container",
    "siphon",
    "plumber's tape",
    "wrench",
    "water",
    "hose adapters",
    "bottle",
    "rubber sink stopper",
    "drill",
    "liquid",
    "clear plastic bottle",
    "lighter",
    "dremel",
    "stopper",
    "siphoning"
  ],
  "tyn_section":[

  ]
}