{
  "title":"How to Buy Things on eBay",
  "url":"https://www.wikihow.com/Buy-Things-on-eBay",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Collecting"
  ],
  "methods":[
    {
      "name":"Getting Familiar With eBay",
      "steps":[
        {
          "headline":"Set up an account.",
          "description":"The first thing you need to do to starting shopping on eBay is to set up an account. You won't be able to buy or sell items without creating an account. Go to ebay.com and click on the link to \"register\" on the top left-hand corner of the page. You will be asked to input your full name and email address, along with creating an eBay username and password. You will then be sent a confirmation email which you will need to open in order to activate your account. Now you're ready to start shopping!"
        },
        {
          "headline":"Search for an item.",
          "description":"You can search for a specific item on eBay by typing a keyword into the search box at the top of the homepage. Alternatively, you can browse through the list of categories - which features everything from fashion, to electronics, to home ware - to see what's on offer. A list of all ongoing auctions will appear, which you can scroll through to compare."
        },
        {
          "headline":"Start small.",
          "description":"If it's your first time making a purchase an eBay, it is advisable to get involved in some low-priced auctions first, so you can get a feel for how the site works without worrying about spending large sums of money. Learning how to bid smartly and successfully is a skill, which you will need to practice to become good at."
        }
      ]
    },
    {
      "name":"Choosing Your Purchases Wisely",
      "steps":[
        {
          "headline":"Compare the price.",
          "description":"When buying an item on eBay, make sure that you have thoroughly researched the item before placing a bid. Look up the market value and search for similar items on auction and watch what prices they're selling for. This way, you will get a good idea of the going rate for a particular item, so you will recognize a genuinely good bargain when you see one. Take the time to do your research and make informed decisions before buying. Just imagine how angry you'd be if you rushed into purchasing a watch for $50 (thinking this was an excellent deal) only to see the same watch sell for $30 a week later. Whatever you do, don't rush into a purchase just because you think it might be your only opportunity to buy - with the exception of very rare collectibles, most sale items will pop up again and again on eBay."
        },
        {
          "headline":"Look at the seller's feedback score.",
          "description":"Once of the most important things you need to consider before making a transaction on eBay is the feedback rating of the seller. The efficiency, openness and trustworthiness of the seller can make a huge impact on whether your buying experience on eBay is positive or negative. Each seller has a feedback score, which they receive based on the reviews of eBay customers who have previously bought items from them. This information is available on the description page of the item to be sold, in the top right hand corner. Whether the seller's feedback rating is good or poor should inform your decision to buy the item. If the rating is poor, you buy the item at your own risk. Though uncommon, it's possible that the seller may ship you a broken or faulty item, or fail to send the item at all. You can also read reviews of each seller on their feedback page, written by previous buyers. This will also help to give you an idea of what you can expect when buying an item from them."
        },
        {
          "headline":"Read the description carefully.",
          "description":"To save time and hassle, it is important that you read the description of each item very, very carefully, to make sure it is exactly what you're looking for. Some pictures or titles may be deceiving (whether intentionally or otherwise) and you might be fooled into buying the wrong thing. Make sure to read the entire description thoroughly, looking out for any mentions of flaws or problems with the item. Remember that if you are disappointed with the condition of your item when it arrives, even though the flaws were clearly noted in the item's description, you will have no one to blame but yourself. In this situation it might be very difficult to arrange a return and the seller will not be happy. Examples of things to watch out for include whether the item is new or used, whether it comes in its original packaging, and whether it includes any necessary extras (batteries, chargers etc.) Be wary of very vague or confusing descriptions, as there is an increased risk that the item will not be what you expect."
        },
        {
          "headline":"Look at the shipping fees.",
          "description":"Shipping fees are another expense you will need to factor in to the cost of buying things on eBay. It is very important to check the cost of shipping before you buy, as many buyers get caught out by very low selling prices which are balanced out by exorbitantly high shipping rates. For this reason, you always need to factor shipping costs in to the total price of your item. The shipping information should be stated clearly beneath the selling price of the item. If you are not satisfied with the shipping charge on the item, then you should not bid on it. It is very unfair on the seller to commit to buying the item, then refuse to pay high shipping charges. If you really wish to find a compromise, message the seller before agreeing to buy the item, to see if a solution can be found. You also need to check what location the seller is shipping from and where they are willing to ship to. This is particularly important if you are buying from an international location, as some sellers will refuse to ship outside their own country. This information is available underneath the shipping costs."
        },
        {
          "headline":"Message the seller if you have any questions.",
          "description":"Good communication between the buyer and seller can transform any buying experience from poor to excellent. Most high-rated sellers will be very responsive towards any questions or queries you might have about the item itself, the shipping method and fees and the payment method. In order to message the seller, scroll down the item page until you reach the \"Question and Answers\" box beneath the item's description. There will be a link titled \"Ask a question\" which you can click on to message the seller. You should make sure that you have all of the correct information about the seller's preferred payment method and return policy before making a purchase. If this information is not supplied on the item page, ask the seller directly."
        },
        {
          "headline":"Don't click the \"Buy it Now\" or \"Place Bid\" button til you're sure.",
          "description":"What many new buyers don't realize is that by clicking on either the \"Buy it Now\" or \"Place Bid\" button, they are committing to purchasing the item and there is no going back. Once you hit either of these buttons, the seller is automatically charged a fee by eBay for their use of the site, so they will not be happy if you try to back out of the sale. In some cases, the situation can be resolved if you have a legitimate reason for backing out of the sale and you message the seller immediately requesting a cancellation. You may need to cover the cost of the fee they've already paid, but at least you won't be forced to buy an item you don't want. If you do not have a legitimate reason for backing out of the sale and simply refuse to pay for the item, the seller is entitled to open a non-paying bidder dispute against you. This may result in an unpaid item strike being placed on your account, which will deter future sellers and buyers from wanting to do business with you. If you get three of these strikes, eBay will suspend your account."
        }
      ]
    },
    {
      "name":"Making a Purchase",
      "steps":[
        {
          "headline":"Use the \"Buy it Now\" option.",
          "description":"If an item gives you a \"Buy it Now\" option, you will be able to bypass the auction process and purchase the item immediately. The price of \"Buy it Now\" items an vary quite a lot - depending on the seller's strategy:\nSometimes the \"Buy it Now\" price will be very low -- this is when the seller is trying to get rid of the item in a hurry, so they sell it at a lower than average price. You can get some great deals using the \"Buy it Now\" option, but these items get snapped up quickly, so you will have to act fast to avail of them. A good way to deal with this is to set up email notifications, where eBay will notify you when a particular item becomes available for immediate purchase. On the other hand, the \"Buy it Now\" price can often be higher than the average bidding price. This is because sellers are counting on buyers who need particular items in a hurry and are not willing to wait the several days it takes to bid in an auction. So unless you are in a hurry, it's important that you do your research to find out the average selling price for a particular item, before buying it using \"Buy it Now\"."
        },
        {
          "headline":"Place a bid.",
          "description":"If the \"Buy it Now\" option is unavailable, or you're hoping to get a better deal on an item, you can use eBay's innovative online bidding system. The bidding system is very simple, all you need to do enter the maximum amount that you would be willing to pay for an item. eBay will then compare this amount to the bids of other potential buyers and will increase your bid incrementally each time you are outbid. They will continually raise your bid until they reach your maximum amount. eBay will only raise the price of your bid high enough to outbid other potential buyers. Once they reach your maximum amount, and the auction is still running, you will either need to accept defeat or raise your maximum bid. Once you have placed a bid, there is no way to retract it. If you win the auction, you will be obligated to buy the item. If you refuse, you will face penalties from eBay and may even have your account suspended."
        },
        {
          "headline":"Check the status of your bid.",
          "description":"Make a note of how much longer the auction will be running for and check back periodically to see how your bid is doing. Once the auction ends, you will receive an email notification from eBay informing you whether you won the item or not. If you did, the email will also provide instructions on what to do next."
        },
        {
          "headline":"Make a payment.",
          "description":"The next step is to complete your payment for the item. You can reach the payment page by clicking on the \"Pay Now\" link, which can be found on the \"Review Order\" page, on the confirmation email, on the listing page and on the \"Purchase History\" page on My eBay. The viable payment options are decided by the seller, and while most will accept payment by credit card or through Pay Pal, some sellers will request payment by check, money order or bank wire transfer. Never send cash to a seller in the mail. It could potentially get lost or stolen, or the seller might keep it and refuse to ship you your item. You should make your payment as promptly as possible after winning the auction, a seller is entitled to open an unpaid item case if you fail to pay for the item after as little as two days. When entering your shipment information, double check it to make sure all of the details are correct. If the information is incorrect and the item is shipped to the wrong address, you are the one at fault."
        },
        {
          "headline":"Give your seller feedback.",
          "description":"Once you have you have received your item, you can can rate the seller based on whether you had a positive or negative experience. eBay encourages you to leave feedback as it creates trust between buyers and sellers and improves the overall customer experience. You can leave feedback by going to the \"Feedback Forum\" on the eBay site and clicking on the \"Leave Feedback\" link on the right hand side of the page. While feedback is encouraged, it is advisable to contact a seller directly about any negative experiences before you give them a poor rating. Most sellers will do their best to reach a solution which is agreeable to both of you - whether that's providing a refund, or some other form of compensation. Your bad experience may have been due to unforeseen circumstances or simple human error, so it is best to give sellers the benefit of the doubt before slating them on the forums. When giving feedback, you can rate your experience as positive, neutral or negative, as well as provide a more detailed seller review. Try to be as factual and informative as possible and avoid making any offensive or personal comments, as this may discourage other people from selling to you."
        }
      ]
    },
    {
      "name":"Mastering Bidding Strategies",
      "steps":[
        {
          "headline":"Bid using odd figures.",
          "description":"Most of the time, when people place a bet they keep it to a nice round number, like $50 or $300. However, your chances of winning a bid can be greatly increased if you use odd figures instead, such as $50.03 or $301.87. This way you can win an auction by paying only an extra few cents more than the next highest bidder. For example, if you place a bid of $150.97 on a piece of furniture, you may win the auction over someone who placed a round bid of $150.00. You get your coffee table, but you only had to spend an extra 97 cent to do so."
        },
        {
          "headline":"Bid at strategic times.",
          "description":"eBay is busiest at specific times of the day, and at these times there are more people bidding on each individual auction. Thus, logically, if you can bid during the site's quietest hours, you increase your chances of winning more bids. eBay gets the most traffic during business hours on weekdays and in the early evenings, on Eastern Standard Time. It's at its quietest in the early hours of the morning, around 1 am to 2 am. You can take advantage of this fact, particularly if you live in an accommodating time zone, if you place your bids while all of the East Coasters are asleep. Surprisingly, many auctions end during the early hours of the morning, so you'll have plenty of items to choose from. Holidays like Christmas and Thanksgiving are also quieter than normal days, so take advantage of this by placing your bids while the turkey's in the oven."
        },
        {
          "headline":"Don't bid early and high - do one or the other.",
          "description":"Many new eBay users make the mistake of placing a high bid early on in the auction. This is not a good move, as it makes it obvious how much you want the item and marks you out as a newbie. You can either make a low bid early in the game and increase it as the competition intensifies, or you can place a high bid near the end of the auction, only when it becomes necessary to secure the item. Unsurprisingly, most sellers will be very happy if you place a high bid early in the game, as they know that they are guaranteed that amount no matter what. Unfortunately for you, you may end up having to pay a much higher amount for an item you could have got for half the price, if you'd played your cards right. Avoid over-bidding by researching amounts that have been paid for similar items during past auctions."
        },
        {
          "headline":"Try bid sniping.",
          "description":"Bid sniping involves placing your bid as late as possible in the auction, typically in the last minutes or seconds before it closes. The thinking behind this is that other buyers won't notice or won't have time to outbid you and you will win the auction. Although sniping is a very popular strategy and works in a lot of cases, it has a number of flaws. Firstly, if your snipe is a lower value than that of the maximum bid of another buyer, then eBay will automatically increase their bid to the next incremental value. In this case, you will not have enough time to come back with a higher bid and you will lose the auction, in addition to raising the buying price for the winner. Lose-lose. Secondly, sniping is very risky if you have your heart set on a specific item. A last minute sniping war with another buyer may cause you to bid higher than you originally intended out of panic, thus undoing any potential savings. In addition, you run the risk of your computer crashing, of unexpectedly having to log in again before placing your bid or some other external factor which will prevent you from making your bid."
        },
        {
          "headline":"Use proxy bidding.",
          "description":"Proxy bidding is the system outlined in the previous section, whereby you enter the maximum amount you are willing to pay for an item and eBay does the bidding for you. This is the easiest way to bid, as eBay will enter the lowest possible winning bid on your behalf, then increase it incrementally (up to your maximum amount) as competing bids are submitted. This is a pretty safe way to bid, as the only way you will lose the auction is if the selling price is higher than your maximum amount. Only eBay knows what your highest maximum bid is, that information is not available to the seller or to other potential buyers."
        },
        {
          "headline":"Watch your auction carefully.",
          "description":"You can bide your time and wait to see how the auction is going before entering your maximum bid. This will give you a chance to see how fierce the competition is and how low you can possibly bid to win the auction. You can watch a number of ongoing auctions easily by clicking the \"Add to Watch List\" link on the item's description page. You can then access the auction information by going to your My eBay page. Remember to check back every day for updates."
        },
        {
          "headline":"Don't panic if you find yourself in a bidding war.",
          "description":"Bidding wars happen all the time on eBay, particularly in the final few seconds before an auction closes. This is all part of the fun - you may be certain that you have placed the winning bid on an item, only to find out at the last minute that you have been topped by someone else. It is possible to increase your maximum bid to get another shot at securing the item, but without knowing what the other buyer's maximum bid is, you cannot guarantee that you'll win. Don't be too angry or frustrated if you you lose an auction. The same items pop up again and again on eBay and you may find an even better deal next time round."
        }
      ]
    }
  ],
  "text":" Getting Familiar With eBay Set up an account. The first thing you need to do to starting shopping on eBay is to set up an account. You won't be able to buy or sell items without creating an account. Go to ebay.com and click on the link to \"register\" on the top left-hand corner of the page. You will be asked to input your full name and email address, along with creating an eBay username and password. You will then be sent a confirmation email which you will need to open in order to activate your account. Now you're ready to start shopping! Search for an item. You can search for a specific item on eBay by typing a keyword into the search box at the top of the homepage. Alternatively, you can browse through the list of categories - which features everything from fashion, to electronics, to home ware - to see what's on offer. A list of all ongoing auctions will appear, which you can scroll through to compare. Start small. If it's your first time making a purchase an eBay, it is advisable to get involved in some low-priced auctions first, so you can get a feel for how the site works without worrying about spending large sums of money. Learning how to bid smartly and successfully is a skill, which you will need to practice to become good at. Choosing Your Purchases Wisely Compare the price. When buying an item on eBay, make sure that you have thoroughly researched the item before placing a bid. Look up the market value and search for similar items on auction and watch what prices they're selling for. This way, you will get a good idea of the going rate for a particular item, so you will recognize a genuinely good bargain when you see one. Take the time to do your research and make informed decisions before buying. Just imagine how angry you'd be if you rushed into purchasing a watch for $50 (thinking this was an excellent deal) only to see the same watch sell for $30 a week later. Whatever you do, don't rush into a purchase just because you think it might be your only opportunity to buy - with the exception of very rare collectibles, most sale items will pop up again and again on eBay. Look at the seller's feedback score. Once of the most important things you need to consider before making a transaction on eBay is the feedback rating of the seller. The efficiency, openness and trustworthiness of the seller can make a huge impact on whether your buying experience on eBay is positive or negative. Each seller has a feedback score, which they receive based on the reviews of eBay customers who have previously bought items from them. This information is available on the description page of the item to be sold, in the top right hand corner. Whether the seller's feedback rating is good or poor should inform your decision to buy the item. If the rating is poor, you buy the item at your own risk. Though uncommon, it's possible that the seller may ship you a broken or faulty item, or fail to send the item at all. You can also read reviews of each seller on their feedback page, written by previous buyers. This will also help to give you an idea of what you can expect when buying an item from them. Read the description carefully. To save time and hassle, it is important that you read the description of each item very, very carefully, to make sure it is exactly what you're looking for. Some pictures or titles may be deceiving (whether intentionally or otherwise) and you might be fooled into buying the wrong thing. Make sure to read the entire description thoroughly, looking out for any mentions of flaws or problems with the item. Remember that if you are disappointed with the condition of your item when it arrives, even though the flaws were clearly noted in the item's description, you will have no one to blame but yourself. In this situation it might be very difficult to arrange a return and the seller will not be happy. Examples of things to watch out for include whether the item is new or used, whether it comes in its original packaging, and whether it includes any necessary extras (batteries, chargers etc.) Be wary of very vague or confusing descriptions, as there is an increased risk that the item will not be what you expect. Look at the shipping fees. Shipping fees are another expense you will need to factor in to the cost of buying things on eBay. It is very important to check the cost of shipping before you buy, as many buyers get caught out by very low selling prices which are balanced out by exorbitantly high shipping rates. For this reason, you always need to factor shipping costs in to the total price of your item. The shipping information should be stated clearly beneath the selling price of the item. If you are not satisfied with the shipping charge on the item, then you should not bid on it. It is very unfair on the seller to commit to buying the item, then refuse to pay high shipping charges. If you really wish to find a compromise, message the seller before agreeing to buy the item, to see if a solution can be found. You also need to check what location the seller is shipping from and where they are willing to ship to. This is particularly important if you are buying from an international location, as some sellers will refuse to ship outside their own country. This information is available underneath the shipping costs. Message the seller if you have any questions. Good communication between the buyer and seller can transform any buying experience from poor to excellent. Most high-rated sellers will be very responsive towards any questions or queries you might have about the item itself, the shipping method and fees and the payment method. In order to message the seller, scroll down the item page until you reach the \"Question and Answers\" box beneath the item's description. There will be a link titled \"Ask a question\" which you can click on to message the seller. You should make sure that you have all of the correct information about the seller's preferred payment method and return policy before making a purchase. If this information is not supplied on the item page, ask the seller directly. Don't click the \"Buy it Now\" or \"Place Bid\" button til you're sure. What many new buyers don't realize is that by clicking on either the \"Buy it Now\" or \"Place Bid\" button, they are committing to purchasing the item and there is no going back. Once you hit either of these buttons, the seller is automatically charged a fee by eBay for their use of the site, so they will not be happy if you try to back out of the sale. In some cases, the situation can be resolved if you have a legitimate reason for backing out of the sale and you message the seller immediately requesting a cancellation. You may need to cover the cost of the fee they've already paid, but at least you won't be forced to buy an item you don't want. If you do not have a legitimate reason for backing out of the sale and simply refuse to pay for the item, the seller is entitled to open a non-paying bidder dispute against you. This may result in an unpaid item strike being placed on your account, which will deter future sellers and buyers from wanting to do business with you. If you get three of these strikes, eBay will suspend your account. Making a Purchase Use the \"Buy it Now\" option. If an item gives you a \"Buy it Now\" option, you will be able to bypass the auction process and purchase the item immediately. The price of \"Buy it Now\" items an vary quite a lot - depending on the seller's strategy:\nSometimes the \"Buy it Now\" price will be very low -- this is when the seller is trying to get rid of the item in a hurry, so they sell it at a lower than average price. You can get some great deals using the \"Buy it Now\" option, but these items get snapped up quickly, so you will have to act fast to avail of them. A good way to deal with this is to set up email notifications, where eBay will notify you when a particular item becomes available for immediate purchase. On the other hand, the \"Buy it Now\" price can often be higher than the average bidding price. This is because sellers are counting on buyers who need particular items in a hurry and are not willing to wait the several days it takes to bid in an auction. So unless you are in a hurry, it's important that you do your research to find out the average selling price for a particular item, before buying it using \"Buy it Now\". Place a bid. If the \"Buy it Now\" option is unavailable, or you're hoping to get a better deal on an item, you can use eBay's innovative online bidding system. The bidding system is very simple, all you need to do enter the maximum amount that you would be willing to pay for an item. eBay will then compare this amount to the bids of other potential buyers and will increase your bid incrementally each time you are outbid. They will continually raise your bid until they reach your maximum amount. eBay will only raise the price of your bid high enough to outbid other potential buyers. Once they reach your maximum amount, and the auction is still running, you will either need to accept defeat or raise your maximum bid. Once you have placed a bid, there is no way to retract it. If you win the auction, you will be obligated to buy the item. If you refuse, you will face penalties from eBay and may even have your account suspended. Check the status of your bid. Make a note of how much longer the auction will be running for and check back periodically to see how your bid is doing. Once the auction ends, you will receive an email notification from eBay informing you whether you won the item or not. If you did, the email will also provide instructions on what to do next. Make a payment. The next step is to complete your payment for the item. You can reach the payment page by clicking on the \"Pay Now\" link, which can be found on the \"Review Order\" page, on the confirmation email, on the listing page and on the \"Purchase History\" page on My eBay. The viable payment options are decided by the seller, and while most will accept payment by credit card or through Pay Pal, some sellers will request payment by check, money order or bank wire transfer. Never send cash to a seller in the mail. It could potentially get lost or stolen, or the seller might keep it and refuse to ship you your item. You should make your payment as promptly as possible after winning the auction, a seller is entitled to open an unpaid item case if you fail to pay for the item after as little as two days. When entering your shipment information, double check it to make sure all of the details are correct. If the information is incorrect and the item is shipped to the wrong address, you are the one at fault. Give your seller feedback. Once you have you have received your item, you can can rate the seller based on whether you had a positive or negative experience. eBay encourages you to leave feedback as it creates trust between buyers and sellers and improves the overall customer experience. You can leave feedback by going to the \"Feedback Forum\" on the eBay site and clicking on the \"Leave Feedback\" link on the right hand side of the page. While feedback is encouraged, it is advisable to contact a seller directly about any negative experiences before you give them a poor rating. Most sellers will do their best to reach a solution which is agreeable to both of you - whether that's providing a refund, or some other form of compensation. Your bad experience may have been due to unforeseen circumstances or simple human error, so it is best to give sellers the benefit of the doubt before slating them on the forums. When giving feedback, you can rate your experience as positive, neutral or negative, as well as provide a more detailed seller review. Try to be as factual and informative as possible and avoid making any offensive or personal comments, as this may discourage other people from selling to you. Mastering Bidding Strategies Bid using odd figures. Most of the time, when people place a bet they keep it to a nice round number, like $50 or $300. However, your chances of winning a bid can be greatly increased if you use odd figures instead, such as $50.03 or $301.87. This way you can win an auction by paying only an extra few cents more than the next highest bidder. For example, if you place a bid of $150.97 on a piece of furniture, you may win the auction over someone who placed a round bid of $150.00. You get your coffee table, but you only had to spend an extra 97 cent to do so. Bid at strategic times. eBay is busiest at specific times of the day, and at these times there are more people bidding on each individual auction. Thus, logically, if you can bid during the site's quietest hours, you increase your chances of winning more bids. eBay gets the most traffic during business hours on weekdays and in the early evenings, on Eastern Standard Time. It's at its quietest in the early hours of the morning, around 1 am to 2 am. You can take advantage of this fact, particularly if you live in an accommodating time zone, if you place your bids while all of the East Coasters are asleep. Surprisingly, many auctions end during the early hours of the morning, so you'll have plenty of items to choose from. Holidays like Christmas and Thanksgiving are also quieter than normal days, so take advantage of this by placing your bids while the turkey's in the oven. Don't bid early and high - do one or the other. Many new eBay users make the mistake of placing a high bid early on in the auction. This is not a good move, as it makes it obvious how much you want the item and marks you out as a newbie. You can either make a low bid early in the game and increase it as the competition intensifies, or you can place a high bid near the end of the auction, only when it becomes necessary to secure the item. Unsurprisingly, most sellers will be very happy if you place a high bid early in the game, as they know that they are guaranteed that amount no matter what. Unfortunately for you, you may end up having to pay a much higher amount for an item you could have got for half the price, if you'd played your cards right. Avoid over-bidding by researching amounts that have been paid for similar items during past auctions. Try bid sniping. Bid sniping involves placing your bid as late as possible in the auction, typically in the last minutes or seconds before it closes. The thinking behind this is that other buyers won't notice or won't have time to outbid you and you will win the auction. Although sniping is a very popular strategy and works in a lot of cases, it has a number of flaws. Firstly, if your snipe is a lower value than that of the maximum bid of another buyer, then eBay will automatically increase their bid to the next incremental value. In this case, you will not have enough time to come back with a higher bid and you will lose the auction, in addition to raising the buying price for the winner. Lose-lose. Secondly, sniping is very risky if you have your heart set on a specific item. A last minute sniping war with another buyer may cause you to bid higher than you originally intended out of panic, thus undoing any potential savings. In addition, you run the risk of your computer crashing, of unexpectedly having to log in again before placing your bid or some other external factor which will prevent you from making your bid. Use proxy bidding. Proxy bidding is the system outlined in the previous section, whereby you enter the maximum amount you are willing to pay for an item and eBay does the bidding for you. This is the easiest way to bid, as eBay will enter the lowest possible winning bid on your behalf, then increase it incrementally (up to your maximum amount) as competing bids are submitted. This is a pretty safe way to bid, as the only way you will lose the auction is if the selling price is higher than your maximum amount. Only eBay knows what your highest maximum bid is, that information is not available to the seller or to other potential buyers. Watch your auction carefully. You can bide your time and wait to see how the auction is going before entering your maximum bid. This will give you a chance to see how fierce the competition is and how low you can possibly bid to win the auction. You can watch a number of ongoing auctions easily by clicking the \"Add to Watch List\" link on the item's description page. You can then access the auction information by going to your My eBay page. Remember to check back every day for updates. Don't panic if you find yourself in a bidding war. Bidding wars happen all the time on eBay, particularly in the final few seconds before an auction closes. This is all part of the fun - you may be certain that you have placed the winning bid on an item, only to find out at the last minute that you have been topped by someone else. It is possible to increase your maximum bid to get another shot at securing the item, but without knowing what the other buyer's maximum bid is, you cannot guarantee that you'll win. Don't be too angry or frustrated if you you lose an auction. The same items pop up again and again on eBay and you may find an even better deal next time round.",
  "tyn_model":[
    "ebay",
    "watch",
    "money order or bank wire transfer.",
    "cash",
    "coffee table",
    "turkey"
  ],
  "tyn_section":[

  ]
}