{
  "title":"How to Make Baked Pork Chops With Apple Cranberry Sauce",
  "url":"https://www.wikihow.com/Make-Baked-Pork-Chops-With-Apple-Cranberry-Sauce",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Pork",
    "Pork Chops"
  ],
  "steps":[
    {
      "headline":"Preheat oven to 350 °F (177 °C).",
      "description":""
    },
    {
      "headline":"Season pork chops with pepper and orange zest.",
      "description":""
    },
    {
      "headline":"Heat olive oil over medium heat.",
      "description":""
    },
    {
      "headline":"Add pork chops, and cook until browned on one side, about 2 minutes.",
      "description":""
    },
    {
      "headline":"Turn over and brown the second side, an additional 2 minutes.",
      "description":""
    },
    {
      "headline":"Remove pork chops from the pan, place them on a nonstick baking sheet, and put in the oven to cook for an additional 10 minutes (to a minimum internal temperature of 160 degrees F).",
      "description":""
    },
    {
      "headline":"Add chicken broth to the sauté pan and scrape up the brown bits.",
      "description":"Set aside."
    },
    {
      "headline":"Place grated apples, cinnamon stick, and bay leaf in a small saucepan.",
      "description":"Cook over medium heat until the apples begin to soften."
    },
    {
      "headline":"Add cranberries, orange juice, and saved broth with flavorful brown bits.",
      "description":"Bring to a boil, and then lower to a gentle simmer. Simmer for up to 10 minutes, or until the cranberries are plump and the apples are tender. Remove the cinnamon stick."
    },
    {
      "headline":"Peel the orange used for the zest, and cut it into eight sections for garnish.",
      "description":""
    },
    {
      "headline":"Serve one pork chop with 1/4 cup of sauce and two orange segments.",
      "description":""
    }
  ],
  "text":" Preheat oven to 350 °F (177 °C).  Season pork chops with pepper and orange zest.  Heat olive oil over medium heat.  Add pork chops, and cook until browned on one side, about 2 minutes.  Turn over and brown the second side, an additional 2 minutes.  Remove pork chops from the pan, place them on a nonstick baking sheet, and put in the oven to cook for an additional 10 minutes (to a minimum internal temperature of 160 degrees F).  Add chicken broth to the sauté pan and scrape up the brown bits. Set aside. Place grated apples, cinnamon stick, and bay leaf in a small saucepan. Cook over medium heat until the apples begin to soften. Add cranberries, orange juice, and saved broth with flavorful brown bits. Bring to a boil, and then lower to a gentle simmer. Simmer for up to 10 minutes, or until the cranberries are plump and the apples are tender. Remove the cinnamon stick. Peel the orange used for the zest, and cut it into eight sections for garnish.  Serve one pork chop with 1/4 cup of sauce and two orange segments. ",
  "tyn_model":[
    "oven",
    "apples",
    "cranberries",
    "orange",
    "pepper",
    "orange zest",
    "olive oil",
    "nonstick baking sheet",
    "chicken broth",
    "sauté pan",
    "cinnamon stick",
    "bay leaf",
    "small saucepan",
    "orange juice",
    "saved broth",
    "cinnamon",
    "pork chop"
  ],
  "tyn_section":[

  ]
}