{
  "title":"How to Bag Groceries",
  "url":"https://www.wikihow.com/Bag-Groceries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "parts":[
    {
      "name":"Choosing a Grocery Bag",
      "steps":[
        {
          "headline":"Choose a reusable shopping bag for sturdiness.",
          "description":"Reusable bags are made of fabric or recyclable plastic. They are more durable than plastic and paper bags, and they have more space than traditional grocery bags. Many stores are discontinuing the use of disposable bags, and cities around the world are banning plastic bags to reduce the number in landfills. Polypropylene and polyethylene are forms of recyclable plastic that are cheap to produce, durable, can be made from recyclable materials, and are chemical resistant. Other reusable bags are made from hemp, jute, cotton, calico, and upcycled scraps of cloth. All of these are strong materials that will last a long time. Clean your reusable bags, because they can become contaminated with bacteria from meats and fruit. You can put them in the washing machine or rinse them in the sink."
        },
        {
          "headline":"Use plastic grocery bags for their convenience.",
          "description":"Plastic bags are still the most convenient bags to use when grocery shopping, because customers get them for free most of the time. They also take up less space than paper bags. Some cities in the United States charge a fee of $0.10 per plastic bag if you didn’t bring your own. While plastic bags have a negative impact on the environment, they can also be reused for grocery shopping or as liners for small bathroom trash bins."
        },
        {
          "headline":"Use a paper bag for its structure when bagging groceries.",
          "description":"Paper bags have a flat bottom that makes layering groceries by weight easier. They’re made to easily stack items according to size and weight, because you can put heavier cans on the bottom and the fragile food, such as eggs, on top. Paper bags aren’t the most reusable bags, because they tear more easily than plastic and cloth. However, they are compostable."
        }
      ]
    },
    {
      "name":"Sorting the Items",
      "steps":[
        {
          "headline":"Group like items together.",
          "description":"It may help to separate bags into 4 groups such as general pantry items, meats, frozen or refrigerated items, and produce. Bag fruits and vegetables with each other and put freezer items together in separate bags. If possible, pre-sort the items as they come down the belt so you will have a better idea of how many bags to take out for each group of items. By grouping items together by type of food, you reduce the risk of cross-contamination and damage. Grouping cold items together helps them retain their temperature and makes it easier to unpack everything that should be put into the refrigerator or freezer immediately."
        },
        {
          "headline":"Separate raw food from the rest to prevent contamination.",
          "description":"Place raw meats in separate plastic bags, as they have the tendency to leak. Meat and fresh pasta should be kept separate from ready-to-eat foods such as nuts, drinks, produce, cheese, sushi, and bakery food. Pack eggs separate from any foods you plan on eating raw, in case they crack."
        },
        {
          "headline":"Bag chemicals separately from food.",
          "description":"This will protect the rest of your groceries from contamination with soap, cleaner, or batteries. Other chemicals you don’t want near food are deodorant, shampoo, room freshener sprays, and bleach. You could get sick from eating vegetables that were covered in detergent or bleach, so keep your food items in separate bags."
        }
      ]
    },
    {
      "name":"Packing Groceries Properly",
      "steps":[
        {
          "headline":"Distribute heavy items among several bags.",
          "description":"Avoid putting lots of jars or cans in a single bag, as it may tear or be too heavy to carry. Aim to put some heavy and light items in each bag. Don’t exceed 15 pounds (6.8 kg) per bag. Don’t pack more than 6 cans per bag, depending on the size, because more than that may break through a plastic bag or rip a paper bag. Jars should be limited to 4 per bag."
        },
        {
          "headline":"Pack lighter items on top of heavier items.",
          "description":"A good bagging foundation usually has shorter cans in the bottom middle of the bag. Layer boxed food on top along the sides of the bag to create a wall. Medium sized staples, such as boxes of oatmeal or bags of rice, should go in the middle on top of the cans. Food that can be squished easily, such as fruit, bread, eggs, and chips, can go on top of heavier items, like jars and cans."
        },
        {
          "headline":"Pack glass items in the middle of cans to prevent them from breaking.",
          "description":"Placing glass bottles next to each other can damage them. The cans will support the glass, minimizing the chance for breakage. If paper sleeves are available to you, you may wrap the glass items and set them next to each other. The paper will act as a buffer protecting against impact. Double-bag, when necessary. Double-bagging either plastic or paper bags reinforces the bag and enables you to pack your bags with more and heavier items."
        },
        {
          "headline":"Consider what can be left unpacked.",
          "description":"Rolls of toilet paper, big sacks of dog food, or boxes of soda may not fit in bags. Most larger items can be carried out on their own, or with the addition of a quick and handy adhesive handle. Don’t bag large items with handles such as milk, soda, and detergent. Place them directly at the bottom of the cart instead. You can also bag chemical items such as cleaners separately from food in case they leak."
        },
        {
          "headline":"Load the groceries in your car carefully.",
          "description":"When you get to the car, observe the same packing rules you did for bagging. Put heavier bags on the bottom or around the sides. Bags containing more delicate items should go on top, and put supported items in the middle. Use caution when placing items in back seats next to child safety seats. Make sure nothing will tip over on to the child."
        }
      ]
    }
  ],
  "text":" Choosing a Grocery Bag Choose a reusable shopping bag for sturdiness. Reusable bags are made of fabric or recyclable plastic. They are more durable than plastic and paper bags, and they have more space than traditional grocery bags. Many stores are discontinuing the use of disposable bags, and cities around the world are banning plastic bags to reduce the number in landfills. Polypropylene and polyethylene are forms of recyclable plastic that are cheap to produce, durable, can be made from recyclable materials, and are chemical resistant. Other reusable bags are made from hemp, jute, cotton, calico, and upcycled scraps of cloth. All of these are strong materials that will last a long time. Clean your reusable bags, because they can become contaminated with bacteria from meats and fruit. You can put them in the washing machine or rinse them in the sink. Use plastic grocery bags for their convenience. Plastic bags are still the most convenient bags to use when grocery shopping, because customers get them for free most of the time. They also take up less space than paper bags. Some cities in the United States charge a fee of $0.10 per plastic bag if you didn’t bring your own. While plastic bags have a negative impact on the environment, they can also be reused for grocery shopping or as liners for small bathroom trash bins. Use a paper bag for its structure when bagging groceries. Paper bags have a flat bottom that makes layering groceries by weight easier. They’re made to easily stack items according to size and weight, because you can put heavier cans on the bottom and the fragile food, such as eggs, on top. Paper bags aren’t the most reusable bags, because they tear more easily than plastic and cloth. However, they are compostable. Sorting the Items Group like items together. It may help to separate bags into 4 groups such as general pantry items, meats, frozen or refrigerated items, and produce. Bag fruits and vegetables with each other and put freezer items together in separate bags. If possible, pre-sort the items as they come down the belt so you will have a better idea of how many bags to take out for each group of items. By grouping items together by type of food, you reduce the risk of cross-contamination and damage. Grouping cold items together helps them retain their temperature and makes it easier to unpack everything that should be put into the refrigerator or freezer immediately. Separate raw food from the rest to prevent contamination. Place raw meats in separate plastic bags, as they have the tendency to leak. Meat and fresh pasta should be kept separate from ready-to-eat foods such as nuts, drinks, produce, cheese, sushi, and bakery food. Pack eggs separate from any foods you plan on eating raw, in case they crack. Bag chemicals separately from food. This will protect the rest of your groceries from contamination with soap, cleaner, or batteries. Other chemicals you don’t want near food are deodorant, shampoo, room freshener sprays, and bleach. You could get sick from eating vegetables that were covered in detergent or bleach, so keep your food items in separate bags. Packing Groceries Properly Distribute heavy items among several bags. Avoid putting lots of jars or cans in a single bag, as it may tear or be too heavy to carry. Aim to put some heavy and light items in each bag. Don’t exceed 15 pounds (6.8 kg) per bag. Don’t pack more than 6 cans per bag, depending on the size, because more than that may break through a plastic bag or rip a paper bag. Jars should be limited to 4 per bag. Pack lighter items on top of heavier items. A good bagging foundation usually has shorter cans in the bottom middle of the bag. Layer boxed food on top along the sides of the bag to create a wall. Medium sized staples, such as boxes of oatmeal or bags of rice, should go in the middle on top of the cans. Food that can be squished easily, such as fruit, bread, eggs, and chips, can go on top of heavier items, like jars and cans. Pack glass items in the middle of cans to prevent them from breaking. Placing glass bottles next to each other can damage them. The cans will support the glass, minimizing the chance for breakage. If paper sleeves are available to you, you may wrap the glass items and set them next to each other. The paper will act as a buffer protecting against impact. Double-bag, when necessary. Double-bagging either plastic or paper bags reinforces the bag and enables you to pack your bags with more and heavier items. Consider what can be left unpacked. Rolls of toilet paper, big sacks of dog food, or boxes of soda may not fit in bags. Most larger items can be carried out on their own, or with the addition of a quick and handy adhesive handle. Don’t bag large items with handles such as milk, soda, and detergent. Place them directly at the bottom of the cart instead. You can also bag chemical items such as cleaners separately from food in case they leak. Load the groceries in your car carefully. When you get to the car, observe the same packing rules you did for bagging. Put heavier bags on the bottom or around the sides. Bags containing more delicate items should go on top, and put supported items in the middle. Use caution when placing items in back seats next to child safety seats. Make sure nothing will tip over on to the child.",
  "tyn_model":[
    "paper",
    "reusable bags",
    "jars",
    "plastic bags",
    "eggs",
    "freezer",
    "groceries",
    "soda",
    "reusable shopping bag",
    "disposable bags",
    "bag",
    "meats",
    "produce",
    "fruits",
    "vegetables",
    "refrigerator",
    "meat",
    "soap",
    "cleaner",
    "deodorant, shampoo",
    "room freshener sprays",
    "bleach",
    "bagging foundation",
    "food",
    "rice",
    "bottles",
    "cans",
    "toilet paper",
    "milk",
    "detergent",
    "bags"
  ],
  "tyn_section":[

  ]
}