{
  "title":"How to Make Stollen",
  "url":"https://www.wikihow.com/Make-Stollen",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Fruit Cakes"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 190C, 375F or Gas Mark 5.",
      "description":"(Note that you will not need the oven hot until later in the process, so you can start without it on.)"
    },
    {
      "headline":"Warm the milk until you can just dip your little finger in it.",
      "description":""
    },
    {
      "headline":"Pour the milk into a glass jug.",
      "description":"Add 1 teaspoon of the sugar along with the dried yeast and leave it until it forms a frothy head about 2.5cm (1 inch)."
    },
    {
      "headline":"Sift 300g (11oz) of the flour together with the salt and remaining sugar into a mixing bowl, and make a well in the centre.",
      "description":""
    },
    {
      "headline":"Pour the milk and yeast mixture into this, then add the softened butter and beaten egg.",
      "description":""
    },
    {
      "headline":"Mix everything together, either with your hands or with a wooden spoon, until the mixture is well blended and leaves the side of the bowl cleanly.",
      "description":""
    },
    {
      "headline":"Work in the fruits, peel, nuts and lemon zest, distributing them as evenly as possible.",
      "description":""
    },
    {
      "headline":"Knead the dough on a working surface for 5 minutes until it is springy and elastic.",
      "description":""
    },
    {
      "headline":"Leave the dough in a warm place, covered with cling film, until it has doubled in size.",
      "description":"The time this takes can vary depending on the temperature. It could take up to two hours."
    },
    {
      "headline":"Turn the risen dough out on to a board floured with the reserved 25g (1 oz) of flour.",
      "description":"Punch it down, which is to say press your fist into it to knock the air out of it, and knead the dough until it is smooth and elastic."
    },
    {
      "headline":"Roll or press out the dough to an oblong flat shape about 25 X 20 cm (10 X 8 inches).",
      "description":""
    },
    {
      "headline":"Roll out the marzipan to form a sausage-shape using your hands and place this along the centre of the dough finishing just short of the edges.",
      "description":""
    },
    {
      "headline":"Fold the dough over the marzipan and carefully place the whole thing on a baking sheet, allowing plenty of room for expansion.",
      "description":""
    },
    {
      "headline":"Leave it to proof in a warm place until it has doubled in size again.",
      "description":"Preheat the oven near the end of this time."
    },
    {
      "headline":"Bake the loaf in the preheated oven for 35-40 minutes.",
      "description":""
    },
    {
      "headline":"Allow it to cool on the baking sheet for about 5 minutes.",
      "description":"Then transfer it onto a wire rack to finish cooling."
    },
    {
      "headline":"Make the glaze by mixing the sifted icing sugar with the lemon juice.",
      "description":"Use a small spatula to spread this icing all over the top surface of the Stollen while it is still warm."
    },
    {
      "headline":"Serve fresh, cut into thick slices, with or without butter.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 190C, 375F or Gas Mark 5. (Note that you will not need the oven hot until later in the process, so you can start without it on.) Warm the milk until you can just dip your little finger in it.  Pour the milk into a glass jug. Add 1 teaspoon of the sugar along with the dried yeast and leave it until it forms a frothy head about 2.5cm (1 inch). Sift 300g (11oz) of the flour together with the salt and remaining sugar into a mixing bowl, and make a well in the centre.  Pour the milk and yeast mixture into this, then add the softened butter and beaten egg.  Mix everything together, either with your hands or with a wooden spoon, until the mixture is well blended and leaves the side of the bowl cleanly.  Work in the fruits, peel, nuts and lemon zest, distributing them as evenly as possible.  Knead the dough on a working surface for 5 minutes until it is springy and elastic.  Leave the dough in a warm place, covered with cling film, until it has doubled in size. The time this takes can vary depending on the temperature. It could take up to two hours. Turn the risen dough out on to a board floured with the reserved 25g (1 oz) of flour. Punch it down, which is to say press your fist into it to knock the air out of it, and knead the dough until it is smooth and elastic. Roll or press out the dough to an oblong flat shape about 25 X 20 cm (10 X 8 inches).  Roll out the marzipan to form a sausage-shape using your hands and place this along the centre of the dough finishing just short of the edges.  Fold the dough over the marzipan and carefully place the whole thing on a baking sheet, allowing plenty of room for expansion.  Leave it to proof in a warm place until it has doubled in size again. Preheat the oven near the end of this time. Bake the loaf in the preheated oven for 35-40 minutes.  Allow it to cool on the baking sheet for about 5 minutes. Then transfer it onto a wire rack to finish cooling. Make the glaze by mixing the sifted icing sugar with the lemon juice. Use a small spatula to spread this icing all over the top surface of the Stollen while it is still warm. Serve fresh, cut into thick slices, with or without butter.  Finished. ",
  "tyn_model":[
    "oven",
    "milk",
    "sugar",
    "yeast",
    "flour",
    "butter",
    "marzipan",
    "baking sheet",
    "glass jug",
    "salt",
    "mixing bowl",
    "egg",
    "wooden spoon",
    "bowl",
    "fruits",
    "nuts",
    "lemon",
    "cling film",
    "wire rack",
    "icing sugar",
    "lemon juice",
    "spatula"
  ],
  "tyn_section":[

  ]
}