{
  "title":"How to Make Edible Arrangements",
  "url":"https://www.wikihow.com/Make-Edible-Arrangements",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "methods":[
    {
      "name":"Making a Fruit Arrangement",
      "steps":[
        {
          "headline":"Get your supplies.",
          "description":"Along with the fruit you’re going to need, you will also need something to hold your fruit arrangement. You can use a carved out watermelon or pumpkin, a flower vase, a planter, or a bowl. Choose a holder that’s appropriate to the size and shape you want your arrangement to be. Other supplies you'll need include:\nA good sharp knife and cutting board\nFloral foam (alternatively, use a head of cabbage or lettuce)\nBamboo skewers and toothpicks\nFlower-shaped metal cookie cutters\nAluminum foil and plastic wrap\nA melon baller"
        },
        {
          "headline":"Choose your fruit.",
          "description":"Most fruit is suitable for an edible arrangement, but there are common ingredients that get used because of their color variety, size, and texture. Of the common fruits that are used, you can make a basic arrangement with one:\nPineapple\nCantaloupe and one honeydew\nQuart of strawberries\nPint each of blueberries and blackberries\nBag seedless grapes\nBunch of kale or another large, leafy green"
        },
        {
          "headline":"Wash and dry your berries, grapes, and kale.",
          "description":"Leave the leaves on the strawberries for additional color. Remove stems from other fruit, such as grapes. Cut the excess stems off the kale. Set it all aside."
        },
        {
          "headline":"Cut the melons in half.",
          "description":"Scoop out the seeds. Clean out the two halves of the cantaloupe by scooping out spheres with the melon baller. Set the melon spheres aside with the berries. Peel the honeydew. Place the melon halves flat-side down on a flat surface. Follow the rounded contour of the melons with a knife to remove the rind. Cut each melon half into crescent-shaped wedges that are about an inch thick on the bottom. Cut the wedges in half widthwise. These will be used as flower leaves."
        },
        {
          "headline":"Prepare the pineapple.",
          "description":"Cut off the top and set it aside with the melon balls and berries. Cut off the bottom inch and discard. Without peeling it, slice the remaining pineapple into rounds that are half an inch to three-quarters of an inch thick. Use the cookie cutters to press out the center of each pineapple slice into flower shapes. You can use different sizes and shapes, or you can make each flower-shaped pineapple piece the same. You can also use other shapes for the pineapples, such as hearts (great for Valentine’s Day) stars, or even holiday-themed shapes."
        },
        {
          "headline":"Prepare your bowl.",
          "description":"Fill the bowl with floral foam. Cut the foam to fit if necessary. Cover the foam in a layer of foil, tucking the foil inside the bowl to cover the sides of the foam. This will prevent pieces of foam from getting on the fruit. Then, lay some kale over top to cover the foil. Position the kale so the leaves spill out over the sides of the bowl. A head of cabbage will also work as a base into which you can place your fruit skewers. Put it in your bowl and cut it to size if necessary. Lay kale over it and position the leaves to overhang the top of the bowl. The overhanging kale will create a nice green base for the arrangement, and make it look a little more like a traditional flower arrangement."
        },
        {
          "headline":"Assemble the pineapple flower heads.",
          "description":"Cut your toothpicks in half. Use the toothpick halves to fasten a melon sphere, grape, blackberry, or blueberry to the center of each pineapple flower. Make sure the toothpick doesn’t stick out the top of the melon or the back of the pineapple."
        },
        {
          "headline":"Create the pineapple flowers.",
          "description":"For each flower, you will need two honeydew half-crescents and one pineapple flower head. Skewer a melon wedge so it sticks out perpendicular to the skewer with the crescent facing the ceiling. Skewer the second wedge in the same fashion but on the other side, and with the crescent facing the floor. Insert the top of the skewer through the bottom of the pineapple flower and insert it about halfway into the pineapple flower. Make sure the flower is vertical, with the flower head facing outward, not the ceiling. Position the two melon wedges so they are about an inch below the bottom of the pineapple, like leaves on a flower stem. Repeat until all the pineapple flowers have been put on stems and given melon leaves. Use mini marshmallows or gumdrops to secure the flowers in place if they won’t stay positioned on the skewers."
        },
        {
          "headline":"Skewer the remaining fruit.",
          "description":"Fill each skewer about halfway down with assorted fruit: blueberries, blackberries, grapes, and melon balls. Top each one with a strawberry, with the pointed end facing up (skewer the stem end first). Make sure the skewer doesn’t stick out the top of the strawberry. If you run out of strawberries, top the remaining skewers with a melon ball, honeydew crescent, or blackberry."
        },
        {
          "headline":"Assemble the arrangement.",
          "description":"Start by arranging the pineapple flowers. Spread them out evenly around the arrangement, securing them in place by sticking them into the foam. Cut the skewers to different lengths to create depth. When you have the flowers in place, fill in the holes with the remaining fruit skewers. Again, cut the skewers to different lengths and place them evenly around the arrangement. You can also use the pineapple top as the center of the arrangement, and arrange the flowers and skewers around it. Fill in any open areas at the bottom with kale."
        },
        {
          "headline":"Wrap the arrangement in plastic.",
          "description":"Store in the fridge until you need it. To guarantee freshness and the brightest colors, make your arrangement the day you need it."
        }
      ]
    },
    {
      "name":"Making a Vegetable Tree",
      "steps":[
        {
          "headline":"Gather your supplies.",
          "description":"Along with your vegetables, you will also need a knife and cutting board, toothpicks, a serving platter, a large floral foam cone, and aluminum foil."
        },
        {
          "headline":"Select your vegetables.",
          "description":"You can use most vegetables to make a vegetable tree, but broccoli and cauliflower work well to create the bulk of the tree. You can experiment with other vegetables, but a good start will include:\nA bunch of red kale\nThree or four carrots\nA pint of cherry tomatoes\nOne yellow and one orange pepper\nOne cucumber"
        },
        {
          "headline":"Prepare the vegetables.",
          "description":"Wash and dry all the vegetables. Remove stems and seeds from the kale, peppers, and carrots. Peel the carrots as well. Cut the carrots and cucumber into two-inch long chunks, and cut each chunk lengthwise into quarters. Cut the peppers into very thin strips. Remove the stalks from the broccoli and cauliflower and cut them into bite-sized florets."
        },
        {
          "headline":"Ready the foam tree.",
          "description":"Cover the cone with aluminum foil. Place it in the center of the serving platter. Surround the tree base with kale."
        },
        {
          "headline":"Skewer the vegetables with toothpicks.",
          "description":"Insert the toothpicks into the remaining stalks on the broccoli and cauliflower florets and into the bottom of the cucumber and carrot sticks. Skewer the tomatoes."
        },
        {
          "headline":"Assemble the tree.",
          "description":"Starting at the bottom, stick the other end of the toothpicks into the cone and create a circle of alternating cauliflower and broccoli florets around the base of the cone. Try not to leave any open spaces. Directly above that row, insert a row of vegetables, alternating between carrots stick, cucumber sticks, and tomatoes. Continue up the tree, alternating between rows of broccoli/cauliflower and other vegetables, until you have covered the entire cone, including the tip. Overlap the vegetables as much as possible so there are no open spaces."
        },
        {
          "headline":"Decorate the tree with pepper slices.",
          "description":"Use the natural curve of the pepper slices to stick them into the spaces between the other vegetables and string the slices around the entire tree like ribbon."
        },
        {
          "headline":"Arrange remaining vegetables on the kale.",
          "description":"If you have any vegetable pieces left over, remove the toothpicks and arrange them at the base of the tree on the bed of kale. Wrap the tree in plastic and store in the fridge until you are ready to serve or present it. Consider serving the vegetable tree with vegetable dip, hummus, or spinach dip."
        }
      ]
    },
    {
      "name":"Putting Together an Edible Flower Bouquet",
      "steps":[
        {
          "headline":"Gather your equipment.",
          "description":"To give the bouquet as a gift, you’ll need tissue paper, clear plastic gift wrapping, an elastic band, and twine. Grab a vase as well that you can use to arrange your bouquet before packaging it. You can also leave the bouquet in the vase if you aren't giving it as a gift or don't want to package it."
        },
        {
          "headline":"Choose your edible flowers.",
          "description":"While not all flowers are edible, there are many that are, and they are delicious in salads, soups, teas, sorbets, and many other dishes. You can select flowers based on color, look, or just what’s available. Edible blue or purple flowers include: borage, hyssop, chive, violet, lavender, cornflower, lilac, clover, and dame’s rocket. Edible pink or red flowers include: honey suckle, bee balm, waxed begonias, tuberous begonias, apple blossoms, banana blossoms, English daisy, and carnations. Edible orange or yellow flowers include: nasturtium, mustard, zucchini and squash blossoms, daylily, calendula, and dandelions. Multicolored flowers or flowers that come in multiple colors include: Johnny jump ups, roses, and chrysanthemums."
        },
        {
          "headline":"Arrange the flowers.",
          "description":"Leave the stems long, but if you need to trim them down, cut them with garden clippers or a sharp knife. Start with the largest flowers (all of the same kind), and place them in the vase. Space them around so they’ll be balanced (though not even) throughout the arrangement. Always work with uneven numbers of flowers. Then select your second largest flowers and space them around in the arrangement as well. Constantly turn the vase around so you can see it from all angles. Fill in empty spaces with bunches of smaller flowers, and add some depth and height by adding tall flowers like lavender."
        },
        {
          "headline":"Wrap the bouquet.",
          "description":"When you have finished arranging your bouquet, remove it from the vase, being careful not to let the flowers slip out of place. Hold the bouquet near the top of the stems and place an elastic band around them loosely to keep them in place. Use tissue paper to wrap the stems and surround the flowers. Wrap the paper with clear plastic wrap. Tie the bouquet closed with the twine just below where the flowers meet the stems."
        }
      ]
    }
  ],
  "text":" Making a Fruit Arrangement Get your supplies. Along with the fruit you’re going to need, you will also need something to hold your fruit arrangement. You can use a carved out watermelon or pumpkin, a flower vase, a planter, or a bowl. Choose a holder that’s appropriate to the size and shape you want your arrangement to be. Other supplies you'll need include:\nA good sharp knife and cutting board\nFloral foam (alternatively, use a head of cabbage or lettuce)\nBamboo skewers and toothpicks\nFlower-shaped metal cookie cutters\nAluminum foil and plastic wrap\nA melon baller Choose your fruit. Most fruit is suitable for an edible arrangement, but there are common ingredients that get used because of their color variety, size, and texture. Of the common fruits that are used, you can make a basic arrangement with one:\nPineapple\nCantaloupe and one honeydew\nQuart of strawberries\nPint each of blueberries and blackberries\nBag seedless grapes\nBunch of kale or another large, leafy green Wash and dry your berries, grapes, and kale. Leave the leaves on the strawberries for additional color. Remove stems from other fruit, such as grapes. Cut the excess stems off the kale. Set it all aside. Cut the melons in half. Scoop out the seeds. Clean out the two halves of the cantaloupe by scooping out spheres with the melon baller. Set the melon spheres aside with the berries. Peel the honeydew. Place the melon halves flat-side down on a flat surface. Follow the rounded contour of the melons with a knife to remove the rind. Cut each melon half into crescent-shaped wedges that are about an inch thick on the bottom. Cut the wedges in half widthwise. These will be used as flower leaves. Prepare the pineapple. Cut off the top and set it aside with the melon balls and berries. Cut off the bottom inch and discard. Without peeling it, slice the remaining pineapple into rounds that are half an inch to three-quarters of an inch thick. Use the cookie cutters to press out the center of each pineapple slice into flower shapes. You can use different sizes and shapes, or you can make each flower-shaped pineapple piece the same. You can also use other shapes for the pineapples, such as hearts (great for Valentine’s Day) stars, or even holiday-themed shapes. Prepare your bowl. Fill the bowl with floral foam. Cut the foam to fit if necessary. Cover the foam in a layer of foil, tucking the foil inside the bowl to cover the sides of the foam. This will prevent pieces of foam from getting on the fruit. Then, lay some kale over top to cover the foil. Position the kale so the leaves spill out over the sides of the bowl. A head of cabbage will also work as a base into which you can place your fruit skewers. Put it in your bowl and cut it to size if necessary. Lay kale over it and position the leaves to overhang the top of the bowl. The overhanging kale will create a nice green base for the arrangement, and make it look a little more like a traditional flower arrangement. Assemble the pineapple flower heads. Cut your toothpicks in half. Use the toothpick halves to fasten a melon sphere, grape, blackberry, or blueberry to the center of each pineapple flower. Make sure the toothpick doesn’t stick out the top of the melon or the back of the pineapple. Create the pineapple flowers. For each flower, you will need two honeydew half-crescents and one pineapple flower head. Skewer a melon wedge so it sticks out perpendicular to the skewer with the crescent facing the ceiling. Skewer the second wedge in the same fashion but on the other side, and with the crescent facing the floor. Insert the top of the skewer through the bottom of the pineapple flower and insert it about halfway into the pineapple flower. Make sure the flower is vertical, with the flower head facing outward, not the ceiling. Position the two melon wedges so they are about an inch below the bottom of the pineapple, like leaves on a flower stem. Repeat until all the pineapple flowers have been put on stems and given melon leaves. Use mini marshmallows or gumdrops to secure the flowers in place if they won’t stay positioned on the skewers. Skewer the remaining fruit. Fill each skewer about halfway down with assorted fruit: blueberries, blackberries, grapes, and melon balls. Top each one with a strawberry, with the pointed end facing up (skewer the stem end first). Make sure the skewer doesn’t stick out the top of the strawberry. If you run out of strawberries, top the remaining skewers with a melon ball, honeydew crescent, or blackberry. Assemble the arrangement. Start by arranging the pineapple flowers. Spread them out evenly around the arrangement, securing them in place by sticking them into the foam. Cut the skewers to different lengths to create depth. When you have the flowers in place, fill in the holes with the remaining fruit skewers. Again, cut the skewers to different lengths and place them evenly around the arrangement. You can also use the pineapple top as the center of the arrangement, and arrange the flowers and skewers around it. Fill in any open areas at the bottom with kale. Wrap the arrangement in plastic. Store in the fridge until you need it. To guarantee freshness and the brightest colors, make your arrangement the day you need it. Making a Vegetable Tree Gather your supplies. Along with your vegetables, you will also need a knife and cutting board, toothpicks, a serving platter, a large floral foam cone, and aluminum foil. Select your vegetables. You can use most vegetables to make a vegetable tree, but broccoli and cauliflower work well to create the bulk of the tree. You can experiment with other vegetables, but a good start will include:\nA bunch of red kale\nThree or four carrots\nA pint of cherry tomatoes\nOne yellow and one orange pepper\nOne cucumber Prepare the vegetables. Wash and dry all the vegetables. Remove stems and seeds from the kale, peppers, and carrots. Peel the carrots as well. Cut the carrots and cucumber into two-inch long chunks, and cut each chunk lengthwise into quarters. Cut the peppers into very thin strips. Remove the stalks from the broccoli and cauliflower and cut them into bite-sized florets. Ready the foam tree. Cover the cone with aluminum foil. Place it in the center of the serving platter. Surround the tree base with kale. Skewer the vegetables with toothpicks. Insert the toothpicks into the remaining stalks on the broccoli and cauliflower florets and into the bottom of the cucumber and carrot sticks. Skewer the tomatoes. Assemble the tree. Starting at the bottom, stick the other end of the toothpicks into the cone and create a circle of alternating cauliflower and broccoli florets around the base of the cone. Try not to leave any open spaces. Directly above that row, insert a row of vegetables, alternating between carrots stick, cucumber sticks, and tomatoes. Continue up the tree, alternating between rows of broccoli/cauliflower and other vegetables, until you have covered the entire cone, including the tip. Overlap the vegetables as much as possible so there are no open spaces. Decorate the tree with pepper slices. Use the natural curve of the pepper slices to stick them into the spaces between the other vegetables and string the slices around the entire tree like ribbon. Arrange remaining vegetables on the kale. If you have any vegetable pieces left over, remove the toothpicks and arrange them at the base of the tree on the bed of kale. Wrap the tree in plastic and store in the fridge until you are ready to serve or present it. Consider serving the vegetable tree with vegetable dip, hummus, or spinach dip. Putting Together an Edible Flower Bouquet Gather your equipment. To give the bouquet as a gift, you’ll need tissue paper, clear plastic gift wrapping, an elastic band, and twine. Grab a vase as well that you can use to arrange your bouquet before packaging it. You can also leave the bouquet in the vase if you aren't giving it as a gift or don't want to package it. Choose your edible flowers. While not all flowers are edible, there are many that are, and they are delicious in salads, soups, teas, sorbets, and many other dishes. You can select flowers based on color, look, or just what’s available. Edible blue or purple flowers include: borage, hyssop, chive, violet, lavender, cornflower, lilac, clover, and dame’s rocket. Edible pink or red flowers include: honey suckle, bee balm, waxed begonias, tuberous begonias, apple blossoms, banana blossoms, English daisy, and carnations. Edible orange or yellow flowers include: nasturtium, mustard, zucchini and squash blossoms, daylily, calendula, and dandelions. Multicolored flowers or flowers that come in multiple colors include: Johnny jump ups, roses, and chrysanthemums. Arrange the flowers. Leave the stems long, but if you need to trim them down, cut them with garden clippers or a sharp knife. Start with the largest flowers (all of the same kind), and place them in the vase. Space them around so they’ll be balanced (though not even) throughout the arrangement. Always work with uneven numbers of flowers. Then select your second largest flowers and space them around in the arrangement as well. Constantly turn the vase around so you can see it from all angles. Fill in empty spaces with bunches of smaller flowers, and add some depth and height by adding tall flowers like lavender. Wrap the bouquet. When you have finished arranging your bouquet, remove it from the vase, being careful not to let the flowers slip out of place. Hold the bouquet near the top of the stems and place an elastic band around them loosely to keep them in place. Use tissue paper to wrap the stems and surround the flowers. Wrap the paper with clear plastic wrap. Tie the bouquet closed with the twine just below where the flowers meet the stems.",
  "tyn_model":[
    "kale",
    "vegetables",
    "pineapple",
    "bowl",
    "melon",
    "flowers",
    "skewers",
    "broccoli",
    "carrots",
    "vase",
    "grapes",
    "cucumber",
    "aluminum foil",
    "strawberries",
    "berries",
    "foil",
    "cauliflower",
    "sharp knife",
    "floral foam",
    "melon baller",
    "cantaloupe",
    "honeydew",
    "blueberries",
    "blackberries",
    "knife",
    "fruit skewers",
    "toothpick",
    "skewer",
    "strawberry",
    "plastic",
    "peppers",
    "tomatoes",
    "pepper",
    "tissue paper",
    "elastic band",
    "twine",
    "lavender",
    "flower vase",
    "planter",
    "cutting board",
    "lettuce",
    "plastic wrap",
    "melons",
    "cookie cutters",
    "pineapples",
    "cabbage",
    "toothpicks",
    "grape",
    "honeydew half",
    "marshmallows",
    "gumdrops",
    "fruit",
    "melon ball",
    "honeydew crescent",
    "blackberry",
    "pineapple flowers",
    "foam",
    "fridge",
    "large floral foam cone",
    "vegetable tree",
    "cherry tomatoes",
    "serving platter",
    "carrot",
    "vegetable",
    "vegetable dip",
    "spinach dip",
    "clear plastic gift wrapping",
    "edible flowers",
    "sorbets",
    "borage",
    "hyssop",
    "chive",
    "violet",
    "cornflower",
    "lilac",
    "clover",
    "dame’s rocket",
    "honey suckle",
    "bee balm",
    "apple blossoms",
    "english daisy",
    "carnations",
    "mustard",
    "daylily",
    "calendula",
    "dandelions",
    "roses",
    "chrysanthemums",
    "garden clippers",
    "clear plastic wrap"
  ],
  "tyn_section":[

  ]
}