{
  "title":"How to Construct Muppet Style Puppets",
  "url":"https://www.wikihow.com/Construct-Muppet-Style-Puppets",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids"
  ],
  "steps":[
    {
      "headline":"Fold a paper plate in half.",
      "description":""
    },
    {
      "headline":"Cut a slit in the toe of the tube sock and put the folded paper plate into it, so that your hand may the mouth.",
      "description":""
    },
    {
      "headline":"Glue sock in place",
      "description":""
    },
    {
      "headline":"Make two \"pillows\" using fleece as the outside fabric, one larger and one smaller one",
      "description":""
    },
    {
      "headline":"Form the larger pillow into what will be the top part of the head.",
      "description":"The actual shape is determined by your design. Use a combination of Glue and sewing to hold the shape in place."
    },
    {
      "headline":"Glue the pillow to one of the sides of the paper plate, trying not to close up the sock",
      "description":""
    },
    {
      "headline":"Form the smaller pillow into a chin, using similar methods, and glue it to the other side of the paper plate.",
      "description":""
    },
    {
      "headline":"Wrap the sock in fleece, to represent the neck.",
      "description":""
    },
    {
      "headline":"Make a third, large pillow, and wrap it around the sock, using glue or sewing to hold it in place.",
      "description":"This is the body for the puppet."
    },
    {
      "headline":"Make two tubes and hands out of the fleece and attach them to the body where the shoulders would be to form the arms/hands.",
      "description":""
    },
    {
      "headline":"Attach two straightened-out wire hangers to the \"wrists\" to control the hands",
      "description":""
    },
    {
      "headline":"Glue fur, eyes, a nose, etc.",
      "description":"to the top of the head to make a face, depending on your design. The puppet is complete."
    }
  ],
  "text":" Fold a paper plate in half.  Cut a slit in the toe of the tube sock and put the folded paper plate into it, so that your hand may the mouth.  Glue sock in place  Make two \"pillows\" using fleece as the outside fabric, one larger and one smaller one  Form the larger pillow into what will be the top part of the head. The actual shape is determined by your design. Use a combination of Glue and sewing to hold the shape in place. Glue the pillow to one of the sides of the paper plate, trying not to close up the sock  Form the smaller pillow into a chin, using similar methods, and glue it to the other side of the paper plate.  Wrap the sock in fleece, to represent the neck.  Make a third, large pillow, and wrap it around the sock, using glue or sewing to hold it in place. This is the body for the puppet. Make two tubes and hands out of the fleece and attach them to the body where the shoulders would be to form the arms/hands.  Attach two straightened-out wire hangers to the \"wrists\" to control the hands  Glue fur, eyes, a nose, etc. to the top of the head to make a face, depending on your design. The puppet is complete.",
  "tyn_model":[
    "paper plate",
    "pillow",
    "glue",
    "fleece",
    "fabric",
    "wire hangers"
  ],
  "tyn_section":[

  ]
}