{
  "title":"How to Create a Japanese Themed Bedroom",
  "url":"https://www.wikihow.com/Create-a-Japanese-Themed-Bedroom",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "methods":[
    {
      "name":"Changing the Basics",
      "steps":[
        {
          "headline":"Clear everything out of your room.",
          "description":"Take out all the furniture, even the window decorations. Take down everything on the walls. Vacuum and/or mop the floors. You want to start this project with as clean and empty a room as possible."
        },
        {
          "headline":"Use tatami mats for flooring.",
          "description":"Put tatami mats, which are woven straw mats, over the current flooring in your bedroom. Purchase them online or at a furniture store near you. Before you buy them, measure your room to see how many you need and of what size. Typically, they are about 3 by 6 feet (0.91 by 1.83 m). Tatami mats will complement almost any kind of flooring, but they look especially good with wood floors and earth tones. If you have a bright carpet or another type of floor that does not match tatami mats, consider replacing your floor. Tatami mats are best on smooth floors, like wood or tile. Be sure to put down a mesh liner underneath the mats to keep them from sliding across the floor. If you cannot afford to put tatami mats in your entire room, put them in pertinent places in the room, such as near the bed or in a seating area."
        },
        {
          "headline":"Paint the walls in an earth tone.",
          "description":"Choose a muted color, like white, beige, yellow, or brown. The wall color should be warm and relaxing, not distracting. If you so choose, consider adding a bamboo accent wall. You can later accent them with bright splashes of color, such as red, gold, or pink. The goal is to create a soothing ambiance, almost like the feeling one gets from viewing nature."
        },
        {
          "headline":"Replace your current doors with a Japanese-inspired sliding door.",
          "description":"If the architecture of your room allows, take out your current door. Japanese-inspired sliding doors typically have wood frames covered with either paper (so that they are opaque) or glass (either frosted or clear). If you cannot accommodate a sliding door, choose a Japanese-inspired swinging door. Alternatively, hang a paper panel over a door opening in an area you don’t need much privacy. Put it on a sliding mechanism so it can be moved in front of the opening when necessary."
        },
        {
          "headline":"Leave the windows uncovered.",
          "description":"Natural light is important for the style of the room. Try to leave the windows completely without ornamentation or cover, if you can. If you need to cover the windows, use silk curtains in warm, neutral colors or rice paper or bamboo blinds. Or, add tinted film to the windows to maintain your privacy while still allowing light in."
        }
      ]
    },
    {
      "name":"Choosing Furniture",
      "steps":[
        {
          "headline":"Opt for furniture made of natural wood.",
          "description":"Choose pieces with sleek, clean lines as opposed to heavy, oversized furniture. Opt for furniture with traditional or ornamental Japanese designs. Your furniture should be simple and close to the ground. Stylistically, it should be modern. Do not clutter your bedroom with furniture."
        },
        {
          "headline":"Pick a bed frame that is low to the ground.",
          "description":"Go to a furniture store and find a bed frame that sits as close to the floor as possible. Dark colors look especially good here. If you do not want to buy a new bed frame, you can also put your mattress directly on the ground. Alternatively, you could remove the box spring and put your mattress on a low frame."
        },
        {
          "headline":"Add Japanese-inspired tables and chairs.",
          "description":"Depending on the size of your bedroom, the style of your old furniture, and your personal needs, think about including a combination of the following items:\nBedside tables that match your bed and are close to the ground\nA set of drawers that is wider than it is tall\nA simple table and chair, to be used as a desk\nA long, low, simply crafted bench"
        },
        {
          "headline":"Consider a seating area.",
          "description":"If your bedroom has space, think about a buying a long, low, cleanly crafted wooden coffee table and floor pillows in warm, earthy colors (beige, brown, yellow, green, etc.). Many Japanese inspired bedrooms have small seating areas."
        }
      ]
    },
    {
      "name":"Arranging and Decorating",
      "steps":[
        {
          "headline":"Leave space for the furniture to breathe when arranging your room.",
          "description":"A common theme in Japanese style is having as little furniture as possible. Choose the amount of furniture that suits the size of your room. Do not put so much furniture into the room that you cannot walk around freely. The room should look minimalist, but not empty. To achieve this balance, choose only the necessary pieces of furniture and do not pack furniture tightly together. Start with the absolute basics and add furniture only if you really need it. Look at pictures of Japanese themed bedrooms online to get a mental image of how much furniture should be in a room."
        },
        {
          "headline":"Opt for lots of natural light and simple, low-light lamps.",
          "description":"Ideally, mostly natural light will illuminate your bedroom in the daytime. Choose lamps in natural colors that give off soft light, rather than harsh light. Another option is to buy Japanese-style paper lanterns, or light fixtures inspired by these lanterns. To avoid harsh lighting, use lamps instead of a traditional overhead light to illuminate your room."
        },
        {
          "headline":"Separate your room with partitions.",
          "description":"If you want to divide your room into separate sections or perhaps block a drafty window, use partitions. These usually come in natural colors, bamboo, or rice paper. Be careful of breaking up the flow of a room to make it look smaller, though. You want to maintain the simplicity and sleek design of Japanese bedrooms. You can also use the partition temporarily, such as when you have guests over or when you’re changing in the daytime. They are useful to have, even if you do not use them as a permanent fixture in your room. You could also affix these partitions to a wall in your room. An entire wall of Japanese-inspired partitions is a great way to get the theme you’re looking for and make the space look larger."
        },
        {
          "headline":"Choose 1 or 2 striking pieces of artwork.",
          "description":"Select this artwork carefully. It should go with the natural color scheme of the room, perhaps adding in a splash of red or gold. You could put a vase filled with sticks on a table or hang a Japanese-style screen print. Many Japanese themed rooms also have murals. Find a mural like this online or at an art gallery."
        },
        {
          "headline":"Add a simple plant.",
          "description":"Japanese design often entails a mixture of interior and exterior elements, as well as inclusion of the natural world indoors. Buy a small plant or tree and place it somewhere prominent in your room. The color green goes well with the Japanese-inspired color scheme of beiges, browns, yellows, and greens. Don’t feel that you need to get an elaborate orchid. A small plant, such as a bonsai tree, a succulent, or a small fern, will suffice and add a simple natural beauty to the room. For a simplistic look, put a plant on your bedside table or in the corner of your room."
        }
      ]
    }
  ],
  "text":" Changing the Basics Clear everything out of your room. Take out all the furniture, even the window decorations. Take down everything on the walls. Vacuum and/or mop the floors. You want to start this project with as clean and empty a room as possible. Use tatami mats for flooring. Put tatami mats, which are woven straw mats, over the current flooring in your bedroom. Purchase them online or at a furniture store near you. Before you buy them, measure your room to see how many you need and of what size. Typically, they are about 3 by 6 feet (0.91 by 1.83 m). Tatami mats will complement almost any kind of flooring, but they look especially good with wood floors and earth tones. If you have a bright carpet or another type of floor that does not match tatami mats, consider replacing your floor. Tatami mats are best on smooth floors, like wood or tile. Be sure to put down a mesh liner underneath the mats to keep them from sliding across the floor. If you cannot afford to put tatami mats in your entire room, put them in pertinent places in the room, such as near the bed or in a seating area. Paint the walls in an earth tone. Choose a muted color, like white, beige, yellow, or brown. The wall color should be warm and relaxing, not distracting. If you so choose, consider adding a bamboo accent wall. You can later accent them with bright splashes of color, such as red, gold, or pink. The goal is to create a soothing ambiance, almost like the feeling one gets from viewing nature. Replace your current doors with a Japanese-inspired sliding door. If the architecture of your room allows, take out your current door. Japanese-inspired sliding doors typically have wood frames covered with either paper (so that they are opaque) or glass (either frosted or clear). If you cannot accommodate a sliding door, choose a Japanese-inspired swinging door. Alternatively, hang a paper panel over a door opening in an area you don’t need much privacy. Put it on a sliding mechanism so it can be moved in front of the opening when necessary. Leave the windows uncovered. Natural light is important for the style of the room. Try to leave the windows completely without ornamentation or cover, if you can. If you need to cover the windows, use silk curtains in warm, neutral colors or rice paper or bamboo blinds. Or, add tinted film to the windows to maintain your privacy while still allowing light in. Choosing Furniture Opt for furniture made of natural wood. Choose pieces with sleek, clean lines as opposed to heavy, oversized furniture. Opt for furniture with traditional or ornamental Japanese designs. Your furniture should be simple and close to the ground. Stylistically, it should be modern. Do not clutter your bedroom with furniture. Pick a bed frame that is low to the ground. Go to a furniture store and find a bed frame that sits as close to the floor as possible. Dark colors look especially good here. If you do not want to buy a new bed frame, you can also put your mattress directly on the ground. Alternatively, you could remove the box spring and put your mattress on a low frame. Add Japanese-inspired tables and chairs. Depending on the size of your bedroom, the style of your old furniture, and your personal needs, think about including a combination of the following items:\nBedside tables that match your bed and are close to the ground\nA set of drawers that is wider than it is tall\nA simple table and chair, to be used as a desk\nA long, low, simply crafted bench Consider a seating area. If your bedroom has space, think about a buying a long, low, cleanly crafted wooden coffee table and floor pillows in warm, earthy colors (beige, brown, yellow, green, etc.). Many Japanese inspired bedrooms have small seating areas. Arranging and Decorating Leave space for the furniture to breathe when arranging your room. A common theme in Japanese style is having as little furniture as possible. Choose the amount of furniture that suits the size of your room. Do not put so much furniture into the room that you cannot walk around freely. The room should look minimalist, but not empty. To achieve this balance, choose only the necessary pieces of furniture and do not pack furniture tightly together. Start with the absolute basics and add furniture only if you really need it. Look at pictures of Japanese themed bedrooms online to get a mental image of how much furniture should be in a room. Opt for lots of natural light and simple, low-light lamps. Ideally, mostly natural light will illuminate your bedroom in the daytime. Choose lamps in natural colors that give off soft light, rather than harsh light. Another option is to buy Japanese-style paper lanterns, or light fixtures inspired by these lanterns. To avoid harsh lighting, use lamps instead of a traditional overhead light to illuminate your room. Separate your room with partitions. If you want to divide your room into separate sections or perhaps block a drafty window, use partitions. These usually come in natural colors, bamboo, or rice paper. Be careful of breaking up the flow of a room to make it look smaller, though. You want to maintain the simplicity and sleek design of Japanese bedrooms. You can also use the partition temporarily, such as when you have guests over or when you’re changing in the daytime. They are useful to have, even if you do not use them as a permanent fixture in your room. You could also affix these partitions to a wall in your room. An entire wall of Japanese-inspired partitions is a great way to get the theme you’re looking for and make the space look larger. Choose 1 or 2 striking pieces of artwork. Select this artwork carefully. It should go with the natural color scheme of the room, perhaps adding in a splash of red or gold. You could put a vase filled with sticks on a table or hang a Japanese-style screen print. Many Japanese themed rooms also have murals. Find a mural like this online or at an art gallery. Add a simple plant. Japanese design often entails a mixture of interior and exterior elements, as well as inclusion of the natural world indoors. Buy a small plant or tree and place it somewhere prominent in your room. The color green goes well with the Japanese-inspired color scheme of beiges, browns, yellows, and greens. Don’t feel that you need to get an elaborate orchid. A small plant, such as a bonsai tree, a succulent, or a small fern, will suffice and add a simple natural beauty to the room. For a simplistic look, put a plant on your bedside table or in the corner of your room.",
  "tyn_model":[
    "furniture",
    "tatami mats",
    "plant",
    "bed frame",
    "lamps",
    "partitions",
    "paper",
    "rice paper",
    "mats",
    "sliding doors",
    "glass",
    "sliding door",
    "curtains",
    "chairs",
    "coffee table",
    "vase",
    "tree",
    "orchid",
    "succulent",
    "fern"
  ],
  "tyn_section":[

  ]
}