{
  "title":"How to Make a Belgian Chocolate Layer Cake",
  "url":"https://www.wikihow.com/Make-a-Belgian-Chocolate-Layer-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Chocolate Cakes"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 180ºC or 350ºF.",
      "description":"Line two 23 centimeter (9.1 in) cake tins with greaseproof paper."
    },
    {
      "headline":"Beat the softened butter with the sugar, then add eggs one at a time, mixing well between each one.",
      "description":""
    },
    {
      "headline":"Mix together the flour, cocoa powder, baking powder, vanilla extract and ground almonds, then add to egg mixture and 1/2 cup of boiling water and blend well.",
      "description":""
    },
    {
      "headline":"Pour even amounts of the mixture into the two cake tins, and bake until they are just set in the middle.",
      "description":"(30 - 40 minutes) Cool the cakes."
    },
    {
      "headline":"Melt the butter and chocolate for the filling over a pan of hot water.",
      "description":""
    },
    {
      "headline":"Beat the egg with the icing sugar then mix on the melted chocolate mixture.",
      "description":""
    },
    {
      "headline":"Sandwich the two cakes together with the mixture.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 180ºC or 350ºF. Line two 23 centimeter (9.1 in) cake tins with greaseproof paper. Beat the softened butter with the sugar, then add eggs one at a time, mixing well between each one.  Mix together the flour, cocoa powder, baking powder, vanilla extract and ground almonds, then add to egg mixture and 1/2 cup of boiling water and blend well.  Pour even amounts of the mixture into the two cake tins, and bake until they are just set in the middle. (30 - 40 minutes) Cool the cakes. Melt the butter and chocolate for the filling over a pan of hot water.  Beat the egg with the icing sugar then mix on the melted chocolate mixture.  Sandwich the two cakes together with the mixture.  Finished. ",
  "tyn_model":[
    "cake tins",
    "butter",
    "chocolate",
    "oven",
    "greaseproof paper",
    "sugar",
    "eggs",
    "flour",
    "cocoa powder",
    "baking powder",
    "vanilla extract",
    "almonds",
    "egg",
    "water",
    "hot water",
    "icing sugar"
  ],
  "tyn_section":[

  ]
}