{
  "title":"How to Make Molasses Candy",
  "url":"https://www.wikihow.com/Make-Molasses-Candy",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy"
  ],
  "steps":[
    {
      "headline":"Take out a frying pan.",
      "description":"The pan can be any size"
    },
    {
      "headline":"Go outside and fill up the pan with snow.",
      "description":"Then come back inside."
    },
    {
      "headline":"Now that you have the snow, put the pan inside the fridge/freezer so that the snow does not melt.",
      "description":""
    },
    {
      "headline":"Now we have to make the actual candy.",
      "description":"Take out a small pot and place it on the stove."
    },
    {
      "headline":"Put in about half a cup of molasses and about 8 tablespoons (118 ml) of sugar in the pan.",
      "description":"You can use more or less ingredients, depending on how much candy you want to make and how sugary you like your candy."
    },
    {
      "headline":"Boil the molasses and sugar at medium heat until it forms a thick syrup.",
      "description":"While waiting for the molasses and sugar to boil, stir continuously."
    },
    {
      "headline":"When the syrup is ready, take out the pan of snow from the fridge/freezer.",
      "description":""
    },
    {
      "headline":"Pour the syrup on top of the snow in little curls.",
      "description":"You can make many different patterns with the syrup in the snow!"
    },
    {
      "headline":"Wait for the syrup to dry, about 45 seconds.",
      "description":""
    },
    {
      "headline":"While you are waiting, take out a piece of wax paper/tinfoil etc.",
      "description":""
    },
    {
      "headline":"Pick up the candy and space them evenly on the wax paper, so they don't melt into each other.",
      "description":""
    },
    {
      "headline":"Repeat steps 8-11 until the syrup is all gone",
      "description":""
    },
    {
      "headline":"Put in the fridge if you want to save some pieces.",
      "description":"Enjoy!"
    }
  ],
  "text":" Take out a frying pan. The pan can be any size Go outside and fill up the pan with snow. Then come back inside. Now that you have the snow, put the pan inside the fridge/freezer so that the snow does not melt.  Now we have to make the actual candy. Take out a small pot and place it on the stove. Put in about half a cup of molasses and about 8 tablespoons (118 ml) of sugar in the pan. You can use more or less ingredients, depending on how much candy you want to make and how sugary you like your candy. Boil the molasses and sugar at medium heat until it forms a thick syrup. While waiting for the molasses and sugar to boil, stir continuously. When the syrup is ready, take out the pan of snow from the fridge/freezer.  Pour the syrup on top of the snow in little curls. You can make many different patterns with the syrup in the snow! Wait for the syrup to dry, about 45 seconds.  While you are waiting, take out a piece of wax paper/tinfoil etc.  Pick up the candy and space them evenly on the wax paper, so they don't melt into each other.  Repeat steps 8-11 until the syrup is all gone  Put in the fridge if you want to save some pieces. Enjoy!",
  "tyn_model":[
    "molasses",
    "sugar",
    "fridge/freezer",
    "snow",
    "wax paper",
    "frying pan",
    "small pot",
    "stove",
    "pan",
    "tinfoil",
    "candy",
    "fridge"
  ],
  "tyn_section":[

  ]
}