{
  "title":"How to Make Pumpkin Mousse Parfaits",
  "url":"https://www.wikihow.com/Make-Pumpkin-Mousse-Parfaits",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Mousses"
  ],
  "steps":[
    {
      "headline":"Measure and pour the rum in a medium sized bowl.",
      "description":"Lightly sprinkle and gently stir the gelatin powder in the rum. Place on the side for about 10 minutes, as this will allow the powder to soften into the rum."
    },
    {
      "headline":"Combine the pumpkin, both sugars, egg yolks, cinnamon, orange zest, nutmeg, and salt in a large bowl.",
      "description":"Use a whisk to mix thoroughly."
    },
    {
      "headline":"Create a double boiler with the gelatin/rum bowl and simmer until the gelatin is clear.",
      "description":"Add and whisk the gelatin mixture to the pumpkin bowl immediately."
    },
    {
      "headline":"Use an electric mixer to combine the heavy cream and vanilla extract until soft peaks start to form up.",
      "description":"Add and fold the heavy cream mixture into the pumpkin bowl."
    },
    {
      "headline":"Make the sweetened whipped cream by mixing 1 cup heavy cream, 1 tablespoon sugar, and 1 teaspoon vanilla extract.",
      "description":"Avoid over-whipping it or else you'll end it up with a butter texture."
    },
    {
      "headline":"Place a spoonful of the pumpkin mixture on the bottom of the parfait glasses.",
      "description":"Layer some whipped cream and chopped cookies. Repeat the layering until the 3rd layer of pumpkin mixture."
    },
    {
      "headline":"Cover each glass with plastic wrap and place in the refrigerator for 4 hours or overnight.",
      "description":""
    },
    {
      "headline":"Garnish with whipped cream and cookie on top before serving.",
      "description":""
    }
  ],
  "text":" Measure and pour the rum in a medium sized bowl. Lightly sprinkle and gently stir the gelatin powder in the rum. Place on the side for about 10 minutes, as this will allow the powder to soften into the rum. Combine the pumpkin, both sugars, egg yolks, cinnamon, orange zest, nutmeg, and salt in a large bowl. Use a whisk to mix thoroughly. Create a double boiler with the gelatin/rum bowl and simmer until the gelatin is clear. Add and whisk the gelatin mixture to the pumpkin bowl immediately. Use an electric mixer to combine the heavy cream and vanilla extract until soft peaks start to form up. Add and fold the heavy cream mixture into the pumpkin bowl. Make the sweetened whipped cream by mixing 1 cup heavy cream, 1 tablespoon sugar, and 1 teaspoon vanilla extract. Avoid over-whipping it or else you'll end it up with a butter texture. Place a spoonful of the pumpkin mixture on the bottom of the parfait glasses. Layer some whipped cream and chopped cookies. Repeat the layering until the 3rd layer of pumpkin mixture. Cover each glass with plastic wrap and place in the refrigerator for 4 hours or overnight.  Garnish with whipped cream and cookie on top before serving. ",
  "tyn_model":[
    "heavy cream",
    "rum",
    "pumpkin bowl",
    "vanilla extract",
    "whipped cream",
    "medium sized bowl",
    "pumpkin",
    "sugars",
    "egg yolks",
    "cinnamon",
    "orange zest",
    "nutmeg",
    "salt",
    "large bowl",
    "whisk",
    "double boiler",
    "gelatin/rum",
    "gelatin",
    "electric mixer",
    "sweetened whipped cream",
    "sugar",
    "parfait glasses",
    "plastic wrap",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}