{
  "title":"How to Make Yogurt By Machine",
  "url":"https://www.wikihow.com/Make-Yogurt-By-Machine",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Yogurt"
  ],
  "steps":[
    {
      "headline":"Find out how much milk you need from the instructions with the machine.",
      "description":"Use whole, 2%, 1% or skim milk and add 1/4 cup powdered, dry milk for each quart. Heat that amount of milk your yogurt maker will hold  in a crock pot on low overnight. You can do the same thing on your stove in a double-boiler. Bring it to the froth stage or between 180 - 200F. Keep it at this temperature for at least 10 minutes. Optionally, for every gallon of milk you can add a cup of sugar and a pinch of salt. This helps the bacteria work and improves the taste of the resulting yogurt without decreasing it's nutritional value."
    },
    {
      "headline":"Cool the milk to just under 120F.",
      "description":"You'll need a thermometer to do this as temperatures are important. This milk now is referred to as tempered milk."
    },
    {
      "headline":"Blend part of the tempered milk and 2 tablespoon (29.6 ml) of yogurt culture for 10 seconds in a blender.",
      "description":"This is the starter. The culture can be store-bought yogurt with live cultures in it, packets of yogurt culture bought online or at your local health food store, or from prior yogurt you have made and kept refrigerated or frozen. This step is extremely important as the culture has the bacteria in it that you needs to be distributed throughout the yogurt. You can use flavored yogurt. The final yogurt may taste faintly of the flavor you use. Keep the amount of any store-bought yogurt culture you use to under 5 tablespoons (73.9 ml) or you will risk curdling the milk before it starts to turn to yogurt. Yogurt has acid in it which can curdle milk."
    },
    {
      "headline":"Pour the starter into the rest of the tempered milk and stir for at least 10 seconds with a whisk.",
      "description":""
    },
    {
      "headline":"Pour the milk into clean jars or containers and put them in your yogurt maker.",
      "description":""
    },
    {
      "headline":"Follow the instructions from your yogurt maker to start it going.",
      "description":""
    },
    {
      "headline":"To find out if your yogurt is ready, after 2 hours, slightly jiggle one of the jars to see if it is firm.",
      "description":"If it is, it is ready. You may want to let it go longer, up to 12 hours or more to increase the cultures in the yogurt and make it more tart."
    },
    {
      "headline":"When you are ready, take the jars out and put them in the refrigerator to cool and set further.",
      "description":"At this point you can add flavorings, fruit and other items like granola."
    },
    {
      "headline":"Save part of the yogurt for the next batch.",
      "description":"After 5 or so batches, you may want to start fresh to ensure the cultures don't degrade."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Find out how much milk you need from the instructions with the machine. Use whole, 2%, 1% or skim milk and add 1/4 cup powdered, dry milk for each quart. Heat that amount of milk your yogurt maker will hold  in a crock pot on low overnight. You can do the same thing on your stove in a double-boiler. Bring it to the froth stage or between 180 - 200F. Keep it at this temperature for at least 10 minutes. Optionally, for every gallon of milk you can add a cup of sugar and a pinch of salt. This helps the bacteria work and improves the taste of the resulting yogurt without decreasing it's nutritional value. Cool the milk to just under 120F. You'll need a thermometer to do this as temperatures are important. This milk now is referred to as tempered milk. Blend part of the tempered milk and 2 tablespoon (29.6 ml) of yogurt culture for 10 seconds in a blender. This is the starter. The culture can be store-bought yogurt with live cultures in it, packets of yogurt culture bought online or at your local health food store, or from prior yogurt you have made and kept refrigerated or frozen. This step is extremely important as the culture has the bacteria in it that you needs to be distributed throughout the yogurt. You can use flavored yogurt. The final yogurt may taste faintly of the flavor you use. Keep the amount of any store-bought yogurt culture you use to under 5 tablespoons (73.9 ml) or you will risk curdling the milk before it starts to turn to yogurt. Yogurt has acid in it which can curdle milk. Pour the starter into the rest of the tempered milk and stir for at least 10 seconds with a whisk.  Pour the milk into clean jars or containers and put them in your yogurt maker.  Follow the instructions from your yogurt maker to start it going.  To find out if your yogurt is ready, after 2 hours, slightly jiggle one of the jars to see if it is firm. If it is, it is ready. You may want to let it go longer, up to 12 hours or more to increase the cultures in the yogurt and make it more tart. When you are ready, take the jars out and put them in the refrigerator to cool and set further. At this point you can add flavorings, fruit and other items like granola. Save part of the yogurt for the next batch. After 5 or so batches, you may want to start fresh to ensure the cultures don't degrade. Finished. ",
  "tyn_model":[
    "milk",
    "yogurt",
    "yogurt maker",
    "yogurt culture",
    "crock pot",
    "double-boiler",
    "sugar",
    "salt",
    "blender",
    "whisk",
    "jars",
    "refrigerator",
    "granola"
  ],
  "tyn_section":[

  ]
}