{
  "title":"How to Thresh and Winnow",
  "url":"https://www.wikihow.com/Thresh-and-Winnow",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "steps":[
    {
      "headline":"Choose a good day.",
      "description":"Choose a day when there isn't much wind and when it is dry. Don't try to do this when it's raining, windy, or muddy."
    },
    {
      "headline":"Lay a clean tarpaulin down on the ground.",
      "description":"Do this near where you plan to cut down the relevant plants. It should also be somewhere fairly clean and not too dusty as you don't want dust, dirt, and other things getting into the threshed seeds."
    },
    {
      "headline":"Cut down the plants that have seed pods or seed cases on them in your garden.",
      "description":""
    },
    {
      "headline":"Lay the plants across the tarpaulin.",
      "description":"Fold the tarpaulin over to cover the plants and to stop the seeds from jumping out or flying away."
    },
    {
      "headline":"Have some stomping fun.",
      "description":"Jump up and down on the folded tarpaulin. Get a friend to help or get the kids into it. The stomping and jumping will release the seeds and separate them from the chaff. If kids are helping, remind them that the tarpaulin needs to stay over the plants while they're jumping up and down."
    },
    {
      "headline":"Select the container that you want the seeds to fall into.",
      "description":"Place a sieve or screen over the container that will enable you to sift the seeds. You will need to check the screen size against the seed size to ensure the seed can fall through but not much else, and especially not the chaff."
    },
    {
      "headline":"Winnow.",
      "description":"This refers to the act of blowing the chaff off the seeds. You can do this in various ways:\nBlow across the sieve or screen as you are sifting the seeds; rotate the container at the same time. Pour the seeds from one container to another, using a fan or similar object to blow off the seeds."
    },
    {
      "headline":"Be ruthless with the seed chosen for storage.",
      "description":"Light seed that blows away with the wind and winnowing should not be kept as it won't have good genetic material. Instead, look for the top 10 percent of seeds, which are the heaviest ones."
    },
    {
      "headline":"Store.",
      "description":"Place in a cool, dry place for storage. Plant the next season."
    }
  ],
  "text":" Choose a good day. Choose a day when there isn't much wind and when it is dry. Don't try to do this when it's raining, windy, or muddy. Lay a clean tarpaulin down on the ground. Do this near where you plan to cut down the relevant plants. It should also be somewhere fairly clean and not too dusty as you don't want dust, dirt, and other things getting into the threshed seeds. Cut down the plants that have seed pods or seed cases on them in your garden.  Lay the plants across the tarpaulin. Fold the tarpaulin over to cover the plants and to stop the seeds from jumping out or flying away. Have some stomping fun. Jump up and down on the folded tarpaulin. Get a friend to help or get the kids into it. The stomping and jumping will release the seeds and separate them from the chaff. If kids are helping, remind them that the tarpaulin needs to stay over the plants while they're jumping up and down. Select the container that you want the seeds to fall into. Place a sieve or screen over the container that will enable you to sift the seeds. You will need to check the screen size against the seed size to ensure the seed can fall through but not much else, and especially not the chaff. Winnow. This refers to the act of blowing the chaff off the seeds. You can do this in various ways:\nBlow across the sieve or screen as you are sifting the seeds; rotate the container at the same time. Pour the seeds from one container to another, using a fan or similar object to blow off the seeds. Be ruthless with the seed chosen for storage. Light seed that blows away with the wind and winnowing should not be kept as it won't have good genetic material. Instead, look for the top 10 percent of seeds, which are the heaviest ones. Store. Place in a cool, dry place for storage. Plant the next season.",
  "tyn_model":[
    "tarpaulin",
    "sieve",
    "winnow",
    "container",
    "seeds"
  ],
  "tyn_section":[

  ]
}