{
  "title":"How to Make Chawanmushi With Avocado",
  "url":"https://www.wikihow.com/Make-Chawanmushi-With-Avocado",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Japanese Dishes"
  ],
  "steps":[
    {
      "headline":"Make a soup stock with bonito and kelp.",
      "description":"Add seasonings, and cool."
    },
    {
      "headline":"Prepare the toppings, by cutting them to dice.",
      "description":""
    },
    {
      "headline":"Make the egg mixture, by mixing the eggs in the stock.",
      "description":""
    },
    {
      "headline":"Put the toppings (except avocado) in a bowl, and sprinkle with sake.",
      "description":""
    },
    {
      "headline":"Put the avocado and other toppings in the cups.",
      "description":""
    },
    {
      "headline":"Pour the egg mixture(soup stock with egg) in the cups.",
      "description":""
    },
    {
      "headline":"Place cups inside a large steamer, allowing space between cups for steam to circulate.",
      "description":""
    },
    {
      "headline":"Cover the cups with a paper towel to keep steam drops from falling into the cups.",
      "description":"Use plastic wrap if you prepare it the microwave instead of the steamer."
    },
    {
      "headline":"Steam the custard.",
      "description":""
    },
    {
      "headline":"Place the cups on saucers and serve.",
      "description":""
    },
    {
      "headline":"Add soy sauce to your liking.",
      "description":""
    }
  ],
  "text":" Make a soup stock with bonito and kelp. Add seasonings, and cool. Prepare the toppings, by cutting them to dice.  Make the egg mixture, by mixing the eggs in the stock.  Put the toppings (except avocado) in a bowl, and sprinkle with sake.  Put the avocado and other toppings in the cups.  Pour the egg mixture(soup stock with egg) in the cups.  Place cups inside a large steamer, allowing space between cups for steam to circulate.  Cover the cups with a paper towel to keep steam drops from falling into the cups. Use plastic wrap if you prepare it the microwave instead of the steamer. Steam the custard.  Place the cups on saucers and serve.  Add soy sauce to your liking. ",
  "tyn_model":[
    "egg",
    "avocado",
    "steamer",
    "soup stock",
    "bonito",
    "kelp",
    "seasonings",
    "eggs",
    "stock",
    "bowl",
    "sake",
    "paper towel",
    "plastic wrap",
    "microwave",
    "saucers",
    "soy sauce"
  ],
  "tyn_section":[

  ]
}