{
  "title":"How to Service an Outdoor Air Conditioning Unit",
  "url":"https://www.wikihow.com/Service-an-Outdoor-Air-Conditioning-Unit",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling",
    "Cooling Systems"
  ],
  "steps":[
    {
      "headline":"Make sure that the dust covers from the service ports are removed.",
      "description":""
    },
    {
      "headline":"Connect your service manifold gauges.",
      "description":"(Make sure the connection is secure so no refrigerant might leak once you open the line from the outdoor unit)."
    },
    {
      "headline":"Be sure the service tank is connected to the yellow line of the manifold gauge properly.",
      "description":""
    },
    {
      "headline":"Open the service ports on the outdoor unit.",
      "description":""
    },
    {
      "headline":"Open the service port to the service tank.",
      "description":""
    },
    {
      "headline":"Read your gauges to see what you pressure is.",
      "description":"(It can be used to determine how much refrigerant you will need add to the system)."
    },
    {
      "headline":"Once servicing is accomplished turn off the service port to the service tank.",
      "description":""
    },
    {
      "headline":"Make sure that all the refrigerant from your gauges has made its way into the outdoor unit.",
      "description":"(Pressure will drop to 0psi)."
    },
    {
      "headline":"Make sure that system pressure is equal to what is being called for.",
      "description":""
    },
    {
      "headline":"Close off the service ports on the outdoor unit.",
      "description":""
    },
    {
      "headline":"Disconnect the manifold gauges.",
      "description":""
    },
    {
      "headline":"Make sure there is no left over air pressure in the manifold gauge after disconnect.",
      "description":""
    },
    {
      "headline":"Reinstall the dust caps to the service ports.",
      "description":""
    }
  ],
  "text":" Make sure that the dust covers from the service ports are removed.  Connect your service manifold gauges. (Make sure the connection is secure so no refrigerant might leak once you open the line from the outdoor unit). Be sure the service tank is connected to the yellow line of the manifold gauge properly.  Open the service ports on the outdoor unit.  Open the service port to the service tank.  Read your gauges to see what you pressure is. (It can be used to determine how much refrigerant you will need add to the system). Once servicing is accomplished turn off the service port to the service tank.  Make sure that all the refrigerant from your gauges has made its way into the outdoor unit. (Pressure will drop to 0psi). Make sure that system pressure is equal to what is being called for.  Close off the service ports on the outdoor unit.  Disconnect the manifold gauges.  Make sure there is no left over air pressure in the manifold gauge after disconnect.  Reinstall the dust caps to the service ports. ",
  "tyn_model":[
    "refrigerant"
  ],
  "tyn_section":[

  ]
}