{
  "title":"How to Bake Fluffy Pound Cake with a Variety of Flavors",
  "url":"https://www.wikihow.com/Bake-Fluffy-Pound-Cake-with-a-Variety-of-Flavors",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes"
  ],
  "steps":[
    {
      "headline":"Wash your hands because any germs on your hands can cause the batter to get contaminated leading to people having food poisoning.",
      "description":""
    },
    {
      "headline":"Make sure that the unsalted butter, eggs, and milk have been sitting outside of the freezer for at least an hour, just to make sure that they are in room temperature and the ingredients to combine effectively with one another once they are mixed.",
      "description":""
    },
    {
      "headline":"Put the butter in a metal or a deep glass bowl.",
      "description":"Once that is set up, whip the butter with a hand mixer for about 15 minutes or until the butter is soften. While the butter is being whipped you can grab the 4 cups of flour and begin sifting the combination of the flour and the baking powder to make sure you get rid of any impurities of both the flour and the baking powder. Note:  This step is a precaution to make sure that none of these impurities prevent the cake from rising. Once the mixer is on do not put your hands or fingers close to the scraper of the mixer."
    },
    {
      "headline":"Sifting Process: This process is simple but very important.",
      "description":"Grab a bowl that can hold all 4 cups of the all-purpose flour set on a table. Grab a colander with thing holes hold it with one hand and slowly start pouring the combination of flour and baking powder in. Note: Put a cup at a time when you do this hold the colander in one hand and once the flour is in make a back and forth motion between both of your hands; this way the colander hits your other hand softly and cleans the flour from any impurities or clumps of flour."
    },
    {
      "headline":"Once the butter is softened you can incorporate the 4 cups of sugar.",
      "description":"Allow for these two ingredients to combine so that the granulated sugar diminishes; or until the mixture is not crunchy. Beat these two ingredients for about 5 minutes; this extra five minutes will also help the cake rise. Lower the speed so that you do not make a mess when adding ingredients."
    },
    {
      "headline":"Crack the eggs and put them in a separate deep dish.",
      "description":"Incorporate 8 eggs. Cracking the eggs into a different bowl is recommended because if you drop an eggshell, it will ruin the whole batter."
    },
    {
      "headline":"Slow the speed of the mixer to about 3; in other words, low speed.",
      "description":"Slowly incorporate 2 cups of the dry mixture; flour and baking powder. Add about ½ a cup (120 ml) of milk. Warning: Be careful with the amount of milk that you add to the cake batter at one time, because if you add all the milk to the batter the cake will become too watery making it difficult for the cake to rise. Note: it does not have to be exact this is only to prevent the cake from becoming bulky and creamy."
    },
    {
      "headline":"Alternate between these two steps; in other words 2 cups of dry mixture and about ½ cup of milk into the cake batter.",
      "description":"Do this slowly and until both of these ingredients are gone. Make sure you allow the ingredients to mix with one another."
    },
    {
      "headline":"Remember turn off the mixer to add the flour, otherwise you will be covered in flour.",
      "description":""
    },
    {
      "headline":"Preheat Oven: At this point you can preheat the oven at 350° Fahrenheit/180° Celsius.",
      "description":""
    },
    {
      "headline":"This is the best step of the process to prepare this cake!",
      "description":"Incorporate 2 tablespoons of vanilla extract; or 2 tablespoons of the flavor of your choice. Note: This is when you can decide what flavor you would prefer for the cake to have."
    },
    {
      "headline":"If choose you could also make a marble cake with this batter.",
      "description":"Split the batter into two separate bowls. In the bowl with the smallest amount of batter add 3/4th of a cup of unsweetened cocoa powder. Beat this batter until you get a dark brown color. Pour the vanilla batter into the cookware. Towards the center of the cookware pour the cocoa batter. With a long fork stir the batter to kindly mix them both. Ready to bake!"
    },
    {
      "headline":"Prepare the Cookware.",
      "description":"Grab a thick napkin and use it to spread regular butter around the whole pan. Now start pouring the cake batter in the baking pan. Move the batter around so that it is even in the baking pan. Note: If you use a silicone cookware make sure to put a bake pan underneath the cake to prevent from any spills."
    },
    {
      "headline":"Cooking Time: Once the batter is in the baking pan, put it in the oven.",
      "description":"Set the time to 45 minutes. Once the oven beeps insert a butter knife or a toothpick in the cake, if it comes out clean the cake is completely baked. If the cake is fully baked take the cake out using an oven mitt. Note: If the cake is not fully baked; in other words the toothpick has batter on it, set the timer for 15 more minutes, and do the same procedure to check the cake’s consistency"
    },
    {
      "headline":"Be careful when you take the cake out because the silicone or the baking pan of your choice will be very hot.",
      "description":"Make sure you use an oven mitt to take out the cake from the oven."
    }
  ],
  "text":" Wash your hands because any germs on your hands can cause the batter to get contaminated leading to people having food poisoning.  Make sure that the unsalted butter, eggs, and milk have been sitting outside of the freezer for at least an hour, just to make sure that they are in room temperature and the ingredients to combine effectively with one another once they are mixed.  Put the butter in a metal or a deep glass bowl. Once that is set up, whip the butter with a hand mixer for about 15 minutes or until the butter is soften. While the butter is being whipped you can grab the 4 cups of flour and begin sifting the combination of the flour and the baking powder to make sure you get rid of any impurities of both the flour and the baking powder. Note:  This step is a precaution to make sure that none of these impurities prevent the cake from rising. Once the mixer is on do not put your hands or fingers close to the scraper of the mixer. Sifting Process: This process is simple but very important. Grab a bowl that can hold all 4 cups of the all-purpose flour set on a table. Grab a colander with thing holes hold it with one hand and slowly start pouring the combination of flour and baking powder in. Note: Put a cup at a time when you do this hold the colander in one hand and once the flour is in make a back and forth motion between both of your hands; this way the colander hits your other hand softly and cleans the flour from any impurities or clumps of flour. Once the butter is softened you can incorporate the 4 cups of sugar. Allow for these two ingredients to combine so that the granulated sugar diminishes; or until the mixture is not crunchy. Beat these two ingredients for about 5 minutes; this extra five minutes will also help the cake rise. Lower the speed so that you do not make a mess when adding ingredients. Crack the eggs and put them in a separate deep dish. Incorporate 8 eggs. Cracking the eggs into a different bowl is recommended because if you drop an eggshell, it will ruin the whole batter. Slow the speed of the mixer to about 3; in other words, low speed. Slowly incorporate 2 cups of the dry mixture; flour and baking powder. Add about ½ a cup (120 ml) of milk. Warning: Be careful with the amount of milk that you add to the cake batter at one time, because if you add all the milk to the batter the cake will become too watery making it difficult for the cake to rise. Note: it does not have to be exact this is only to prevent the cake from becoming bulky and creamy. Alternate between these two steps; in other words 2 cups of dry mixture and about ½ cup of milk into the cake batter. Do this slowly and until both of these ingredients are gone. Make sure you allow the ingredients to mix with one another. Remember turn off the mixer to add the flour, otherwise you will be covered in flour.  Preheat Oven: At this point you can preheat the oven at 350° Fahrenheit/180° Celsius.  This is the best step of the process to prepare this cake! Incorporate 2 tablespoons of vanilla extract; or 2 tablespoons of the flavor of your choice. Note: This is when you can decide what flavor you would prefer for the cake to have. If choose you could also make a marble cake with this batter. Split the batter into two separate bowls. In the bowl with the smallest amount of batter add 3/4th of a cup of unsweetened cocoa powder. Beat this batter until you get a dark brown color. Pour the vanilla batter into the cookware. Towards the center of the cookware pour the cocoa batter. With a long fork stir the batter to kindly mix them both. Ready to bake! Prepare the Cookware. Grab a thick napkin and use it to spread regular butter around the whole pan. Now start pouring the cake batter in the baking pan. Move the batter around so that it is even in the baking pan. Note: If you use a silicone cookware make sure to put a bake pan underneath the cake to prevent from any spills. Cooking Time: Once the batter is in the baking pan, put it in the oven. Set the time to 45 minutes. Once the oven beeps insert a butter knife or a toothpick in the cake, if it comes out clean the cake is completely baked. If the cake is fully baked take the cake out using an oven mitt. Note: If the cake is not fully baked; in other words the toothpick has batter on it, set the timer for 15 more minutes, and do the same procedure to check the cake’s consistency Be careful when you take the cake out because the silicone or the baking pan of your choice will be very hot. Make sure you use an oven mitt to take out the cake from the oven.",
  "tyn_model":[
    "flour",
    "milk",
    "butter",
    "oven",
    "eggs",
    "baking powder",
    "mixer",
    "baking pan",
    "colander",
    "bowl",
    "sugar",
    "cake batter",
    "oven mitt",
    "unsalted butter",
    "deep glass bowl",
    "hand mixer",
    "all-purpose flour",
    "deep dish",
    "vanilla extract",
    "unsweetened cocoa powder",
    "vanilla batter",
    "cookware.",
    "cocoa batter",
    "fork",
    "cookware",
    "napkin",
    "regular butter",
    "bake pan",
    "butter knife"
  ],
  "tyn_section":[

  ]
}