{
  "title":"How to Make Lavender Healing Salve",
  "url":"https://www.wikihow.com/Make-Lavender-Healing-Salve",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "steps":[
    {
      "headline":"Wash and dry the containers you're intending to use.",
      "description":"Allow them to air dry, as this is the most hygienic method for drying. To do so, simply set them on a tea towel and leave for a time. Suitable containers range from well cleaned used makeup jars, spice jars, to any other small glass containers you have. Glass is the best material, but be sure the containers are able to handle heat up to up to 95 C (200°F). Plastics can leach chemicals into the salve as well as break down over time, so avoid using them."
    },
    {
      "headline":"Assemble and weigh the ingredients.",
      "description":""
    },
    {
      "headline":"Put the cocoa butter and beeswax into a heatproof pouring vessel such as a metallic jug or pitcher.",
      "description":"Put the heatproof vessel into a saucepan of boiling water."
    },
    {
      "headline":"Melt the ingredients.",
      "description":"Do this by keeping the water simmering and allowing the ingredients to gently come together."
    },
    {
      "headline":"Leaving the water simmering, take the heatproof vessel out of the saucepan using oven mitts.",
      "description":"simmering Add the olive oil and lavender oil ingredients to the vessel. At this point, you'll notice that the mixture will solidify a little, which is fine."
    },
    {
      "headline":"Return the vessel to the saucepan.",
      "description":"This will liquefy the mixture once again. Stir the mixture using a skewer to evenly distribute the contents. Once mixed thoroughly, quickly and carefully pour the resulting liquid into the prepared containers."
    },
    {
      "headline":"Leave the salve to cool fully.",
      "description":"If you want to place it in the fridge, that's fine."
    },
    {
      "headline":"Once the mixture has solidified into a salve, it's ready for use.",
      "description":"Use on dried skin as required. It's a good idea to label and date the salve so that you remember what it's for and when it was made."
    }
  ],
  "text":" Wash and dry the containers you're intending to use. Allow them to air dry, as this is the most hygienic method for drying. To do so, simply set them on a tea towel and leave for a time. Suitable containers range from well cleaned used makeup jars, spice jars, to any other small glass containers you have. Glass is the best material, but be sure the containers are able to handle heat up to up to 95 C (200°F). Plastics can leach chemicals into the salve as well as break down over time, so avoid using them. Assemble and weigh the ingredients.  Put the cocoa butter and beeswax into a heatproof pouring vessel such as a metallic jug or pitcher. Put the heatproof vessel into a saucepan of boiling water. Melt the ingredients. Do this by keeping the water simmering and allowing the ingredients to gently come together. Leaving the water simmering, take the heatproof vessel out of the saucepan using oven mitts. simmering Add the olive oil and lavender oil ingredients to the vessel. At this point, you'll notice that the mixture will solidify a little, which is fine. Return the vessel to the saucepan. This will liquefy the mixture once again. Stir the mixture using a skewer to evenly distribute the contents. Once mixed thoroughly, quickly and carefully pour the resulting liquid into the prepared containers. Leave the salve to cool fully. If you want to place it in the fridge, that's fine. Once the mixture has solidified into a salve, it's ready for use. Use on dried skin as required. It's a good idea to label and date the salve so that you remember what it's for and when it was made.",
  "tyn_model":[
    "saucepan",
    "water",
    "containers",
    "heatproof vessel",
    "salve",
    "tea towel",
    "cocoa butter",
    "heatproof pouring vessel",
    "pitcher",
    "oven mitts",
    "olive oil",
    "lavender oil",
    "skewer",
    "fridge"
  ],
  "tyn_section":[

  ]
}