{
  "title":"How to Find the First Colossus in the Shadow of the Colossus",
  "url":"https://www.wikihow.com/Find-the-First-Colossus-in-the-Shadow-of-the-Colossus",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation 2"
  ],
  "steps":[
    {
      "headline":"Exit the shrine.",
      "description":"You start this game in the Shrine of Worship after you place your beloved on the altar. The first thing you have to do is leave the shrine. Call Argo and mount his saddle. Once you've hopped on your horse, go to either the right or left of the altar and walk down the stairs. You'll be outside in the vast world of the game. To call Argo, press 'X'\nTo mount Argo's saddle, stand by his side, facing him, and press the 'Triangle' button\nPress 'X' while on Argo to make him move. The more you press 'X', the faster he'll go."
    },
    {
      "headline":"Go straight forward.",
      "description":"The first colosi's layer is directly in front of the Shrine, in an opening in the mountain wall. You can raise your sword and follow the path of light when it centers. Just keep going forward, and soon the opening in the mountains will be clear. Make sure to stay between the cliffs on that sort of path that they make! Press and hold 'O' or 'Square' to hold up your sword while on Argo, and the right analogue stick to move it."
    },
    {
      "headline":"Enter the chip in the wall.",
      "description":"Once you find the place, you'll know it; there will be stairs leading to a round cut-out in the canyon wall. Walk Argo into this circular area and then dismount as Argo can not go where you'll be headed next."
    },
    {
      "headline":"Climb the moss.",
      "description":"If you're still facing the way you were when you walked in, there should be a patch of moss to your right. Go to it and begin to climb it. It's not too tall, so you should reach the top fast. You should now be on a ledge. Yay! Press 'Triangle' to jump and hold 'R1' to hold onto the moss. You can then press up on the left analogue to move up or press 'Triangle' to jump up faster."
    },
    {
      "headline":"Head left.",
      "description":"When you head left, it will slightly curve back around. Be careful: at the end of the curve is a gap between one part of the ledge and the other. Jump over this."
    },
    {
      "headline":"Once on the other side, get higher.",
      "description":"There is a ledge next to you, and you must jump up and grab this, and then hoist yourself up on onto this ledge. You'll know where to jump and grab for because a part of that ledge is lighter and a little more green."
    },
    {
      "headline":"Head right across the bridge and jump the next gap.",
      "description":"If you're at the wooden bridge, then you're already halfway there. Make your way across this and then hop over another gap in the pathway."
    },
    {
      "headline":"Roll under the pillar.",
      "description":"There will be a pillar in your path now. If you try to walk under it, you'll notice that you can't continue. To get past this obstacle, you need to stand back from the pillar a little bit. Once far enough back, face the pillar, crouch down, and then roll forward and under the pillar. To roll, hold down 'R1' and then quickly press 'Triangle'."
    },
    {
      "headline":"Climb onto the next ledge.",
      "description":"As you continue straight forward, you'll find another ledge. Keep making your way up."
    },
    {
      "headline":"On this ledge, you'll have to go all the way to the right almost until you reach the end.",
      "description":"Once here, climb up onto the ledge to your left."
    },
    {
      "headline":"Go left.",
      "description":"You'll quickly run into a wall, and that's perfect. There is a ledge slightly above you that is perfect for grabbing onto. Grab onto this ledge."
    },
    {
      "headline":"Make your way around the wall.",
      "description":"When you're on the ledge, push your left analogue stick left. You will begin to move left around the wall. Make sure you move all the way onto the other side of the wall. Make sure you're still holding 'R1' the whole time"
    },
    {
      "headline":"Jump back.",
      "description":"This may sound easy, but it's hard at first. While holding on to the ledge, you'll have to turn around and jump back onto the ledge behind you. Here's how:\nWhile holding down 'R1', push your left analogue stick straight back. You will turn around and face a ledge behind you\nHold down 'Triangle' until your meter shows that you stamina is charged\nLeft go of 'Triangle'. You will jump towards the ledge behind you. Make sure you are still holding 'R1' so that you can grab onto the ledge when you jump towards it."
    },
    {
      "headline":"Continue up the path.",
      "description":"there is no more climbing. Once you reach the end of the path, a little clip will show you that you have finally found the first colossus. Congratulations; now it's time to beat him."
    },
    {
      "headline":"Now Read How To Beat the First Colossus in Shadow of the Colossus and prepare to beat him!",
      "description":""
    }
  ],
  "text":" Exit the shrine. You start this game in the Shrine of Worship after you place your beloved on the altar. The first thing you have to do is leave the shrine. Call Argo and mount his saddle. Once you've hopped on your horse, go to either the right or left of the altar and walk down the stairs. You'll be outside in the vast world of the game. To call Argo, press 'X'\nTo mount Argo's saddle, stand by his side, facing him, and press the 'Triangle' button\nPress 'X' while on Argo to make him move. The more you press 'X', the faster he'll go. Go straight forward. The first colosi's layer is directly in front of the Shrine, in an opening in the mountain wall. You can raise your sword and follow the path of light when it centers. Just keep going forward, and soon the opening in the mountains will be clear. Make sure to stay between the cliffs on that sort of path that they make! Press and hold 'O' or 'Square' to hold up your sword while on Argo, and the right analogue stick to move it. Enter the chip in the wall. Once you find the place, you'll know it; there will be stairs leading to a round cut-out in the canyon wall. Walk Argo into this circular area and then dismount as Argo can not go where you'll be headed next. Climb the moss. If you're still facing the way you were when you walked in, there should be a patch of moss to your right. Go to it and begin to climb it. It's not too tall, so you should reach the top fast. You should now be on a ledge. Yay! Press 'Triangle' to jump and hold 'R1' to hold onto the moss. You can then press up on the left analogue to move up or press 'Triangle' to jump up faster. Head left. When you head left, it will slightly curve back around. Be careful: at the end of the curve is a gap between one part of the ledge and the other. Jump over this. Once on the other side, get higher. There is a ledge next to you, and you must jump up and grab this, and then hoist yourself up on onto this ledge. You'll know where to jump and grab for because a part of that ledge is lighter and a little more green. Head right across the bridge and jump the next gap. If you're at the wooden bridge, then you're already halfway there. Make your way across this and then hop over another gap in the pathway. Roll under the pillar. There will be a pillar in your path now. If you try to walk under it, you'll notice that you can't continue. To get past this obstacle, you need to stand back from the pillar a little bit. Once far enough back, face the pillar, crouch down, and then roll forward and under the pillar. To roll, hold down 'R1' and then quickly press 'Triangle'. Climb onto the next ledge. As you continue straight forward, you'll find another ledge. Keep making your way up. On this ledge, you'll have to go all the way to the right almost until you reach the end. Once here, climb up onto the ledge to your left. Go left. You'll quickly run into a wall, and that's perfect. There is a ledge slightly above you that is perfect for grabbing onto. Grab onto this ledge. Make your way around the wall. When you're on the ledge, push your left analogue stick left. You will begin to move left around the wall. Make sure you move all the way onto the other side of the wall. Make sure you're still holding 'R1' the whole time Jump back. This may sound easy, but it's hard at first. While holding on to the ledge, you'll have to turn around and jump back onto the ledge behind you. Here's how:\nWhile holding down 'R1', push your left analogue stick straight back. You will turn around and face a ledge behind you\nHold down 'Triangle' until your meter shows that you stamina is charged\nLeft go of 'Triangle'. You will jump towards the ledge behind you. Make sure you are still holding 'R1' so that you can grab onto the ledge when you jump towards it. Continue up the path. there is no more climbing. Once you reach the end of the path, a little clip will show you that you have finally found the first colossus. Congratulations; now it's time to beat him. Now Read How To Beat the First Colossus in Shadow of the Colossus and prepare to beat him! ",
  "tyn_model":[
    "argo",
    "moss",
    "sword",
    "pillar",
    "horse",
    "ledge",
    "analogue stick"
  ],
  "tyn_section":[

  ]
}