{
  "title":"How to Create a Mold for Candles",
  "url":"https://www.wikihow.com/Create-a-Mold-for-Candles",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Candles"
  ],
  "steps":[
    {
      "headline":"Save heavy cardboard type containers.",
      "description":"Useful types of cardboard include a Pringles can, Chinese take-out containers, or waxed milk cartons. Make sure that the cardboard is coated with wax in some way... regular cardboard will absorb the melted wax and become a fire hazard, not to mention a mess."
    },
    {
      "headline":"Wipe the inside of the container with a damp paper towel to remove any food residue.",
      "description":""
    },
    {
      "headline":"Attach your wick to the center of the inside of the container.",
      "description":"You can use a little scotch tape to do this. Also a good way to attach the wick is to melt a space for it when the candle is done and put the wick in."
    },
    {
      "headline":"Lay a pencil (or similar object) across the top of the container and tape your wick to it, so that the wick is centered in the container.",
      "description":""
    },
    {
      "headline":"Pour a little bit of melted wax in the container and wait a few seconds to make sure the container isn't going to leak.",
      "description":""
    },
    {
      "headline":"Pour the wax into the container almost to the top.",
      "description":"Reserve a little wax for topping up, as the wax shrinks into the center as it cools."
    },
    {
      "headline":"Wait several hours or overnight for the wax to cool and harden.",
      "description":""
    },
    {
      "headline":"Let the candle cool.",
      "description":"When the candle is cool, peel the container away."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Save heavy cardboard type containers. Useful types of cardboard include a Pringles can, Chinese take-out containers, or waxed milk cartons. Make sure that the cardboard is coated with wax in some way... regular cardboard will absorb the melted wax and become a fire hazard, not to mention a mess. Wipe the inside of the container with a damp paper towel to remove any food residue.  Attach your wick to the center of the inside of the container. You can use a little scotch tape to do this. Also a good way to attach the wick is to melt a space for it when the candle is done and put the wick in. Lay a pencil (or similar object) across the top of the container and tape your wick to it, so that the wick is centered in the container.  Pour a little bit of melted wax in the container and wait a few seconds to make sure the container isn't going to leak.  Pour the wax into the container almost to the top. Reserve a little wax for topping up, as the wax shrinks into the center as it cools. Wait several hours or overnight for the wax to cool and harden.  Let the candle cool. When the candle is cool, peel the container away. Finished. ",
  "tyn_model":[
    "cardboard",
    "candle",
    "wax",
    "pringles can",
    "milk cartons",
    "scotch tape",
    "pencil",
    "container"
  ],
  "tyn_section":[

  ]
}