{
  "title":"How to Get a Few Drops from a Lemon",
  "url":"https://www.wikihow.com/Get-a-Few-Drops-from-a-Lemon",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Citrus Fruits"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Find a suitable tool and clean it.",
          "description":"The ideal tools include a knitting needle or a skewer. Give the tool a good hot wash and dry it, so that it is sterilized."
        },
        {
          "headline":"Place the lemon on a firm surface.",
          "description":"You will want it to sit so that it cannot roll."
        },
        {
          "headline":"Pierce the lemon with the skewer or knitting needle.",
          "description":"Just make a small hole."
        },
        {
          "headline":"Take the lemon and hold the hole over the bowl or saucepan and squeeze out a few drops.",
          "description":""
        },
        {
          "headline":"Return the rest of the lemon to the fridge.",
          "description":"Wrap it in foil first. It will stay fresh in there until needed again. Obviously, use it within a short space of time to prevent it from going moldy or drying out."
        }
      ]
    },
    {
      "name":"Cocktail Stick or Toothpick Method",
      "steps":[
        {
          "headline":"Pierce the skin of the lemon with a cocktail stick or toothpick.",
          "description":""
        },
        {
          "headline":"Squeeze out the juice needed.",
          "description":""
        },
        {
          "headline":"Plug the hole with the cocktail stick or toothpick and refrigerate.",
          "description":""
        }
      ]
    }
  ],
  "text":" Steps Find a suitable tool and clean it. The ideal tools include a knitting needle or a skewer. Give the tool a good hot wash and dry it, so that it is sterilized. Place the lemon on a firm surface. You will want it to sit so that it cannot roll. Pierce the lemon with the skewer or knitting needle. Just make a small hole. Take the lemon and hold the hole over the bowl or saucepan and squeeze out a few drops.  Return the rest of the lemon to the fridge. Wrap it in foil first. It will stay fresh in there until needed again. Obviously, use it within a short space of time to prevent it from going moldy or drying out. Cocktail Stick or Toothpick Method Pierce the skin of the lemon with a cocktail stick or toothpick.  Squeeze out the juice needed.  Plug the hole with the cocktail stick or toothpick and refrigerate. ",
  "tyn_model":[
    "lemon",
    "cocktail stick or toothpick",
    "skewer",
    "knitting needle",
    "bowl",
    "saucepan",
    "fridge",
    "foil"
  ],
  "tyn_section":[

  ]
}