{
  "title":"How to Play Civcraft",
  "url":"https://www.wikihow.com/Play-Civcraft",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "parts":[
    {
      "name":"Setting Up",
      "steps":[
        {
          "headline":"Take a piece of paper and draw a number of land masses.",
          "description":"Think about the way they were formed, if they rose from a volcanic plane from underneath the ocean or broke off from an immense pangea. You can be as detailed as you want to be when it comes to this."
        },
        {
          "headline":"Fill it with terrain features.",
          "description":"You can include forests, mountains, rivers, lakes, and more. Remember to consider the geological history of the land. An ice age would cause glaciers that carve U-shaped valleys into the land and tectonic faults would cause mountain ranges like the Andes or fold mountains like the Alps, depending on how they form and how they differ in composition. This can help when distributing resources. Remember, you can be as detailed as you want to be when it comes to this."
        },
        {
          "headline":"Write your civilization's name on another piece of paper.",
          "description":"This piece of paper will list your civilization's statistics, such as resources and troops. Below your civilization's name write 4 populations, 4 tools. Write capabilities below that. Write down hut building, basic tool building, and basic organization under that."
        },
        {
          "headline":"Draw your land/terrain paper.",
          "description":"Include 4 stick figures and 4 tools."
        }
      ]
    },
    {
      "name":"Learning About the Tables for Each Action",
      "steps":[
        {
          "headline":"Roll once for each action spent rolling (roll 1d6) for search table.",
          "description":"3 found 1d6 of aspect searched for\n6 aspect not found"
        },
        {
          "headline":"Use the proper tools required to for the harvest table to harvest the wanted material.",
          "description":"For example, you need axes to cut down trees. Roll 1d6 for each action spent harvesting. 2 greatly harvested: Gain 2d6 of aspect harvested\n4 aspect harvested: Gain 1d6 of aspect harvested\n6 aspect not harvested"
        },
        {
          "headline":"Roll 1d6 for each action spent building for the build table.",
          "description":"After an aspect is built, the materials are reduced (example: after a stone house is built, the amount of stone used is gone). Roll 1d6 for each action spent building for the build table. 2 aspect completely built\n4 aspect nearly complete: Will be completely finished next turn\n6 aspect not built"
        },
        {
          "headline":"Use the proper tools needed and the proper materials needed to know how to do it for the repair/heal table.",
          "description":"For example, a soldier is wounded and a medic spends his action healing him, who has a medical kit and has medical capability. Roll 1d6 for each action spent repairing and healing. 2 aspect completely healed/repaired\n4 aspect nearly completely healed/repaired will be completely repaired/healed nearly healed/repaired next turn\n6 aspect not repaired or healed at all"
        },
        {
          "headline":"Roll 1d6 for each action spent on conflict for the conflict table.",
          "description":"2 opponent soundly beaten (select effects, such as being killed)\n4 opponent beaten, but only wounded\n6 opponent not beaten"
        },
        {
          "headline":"Roll 1d6 for each action spent boosting population for the population boost table.",
          "description":"2 population increased by 3d6\n4 population increased by 2d6\nPopulation increased by 1d6\nPopulation not increased"
        },
        {
          "headline":"Learn the capability boost table.",
          "description":"Capability increases what your civilization can do (E.G. A capability such as mining allows a civilisation to mine). Roll 1d6 for each action spent boosting a civilisation's capabilities. 2 capability completely learned: Can begin using it this turn\n4 capability nearly learned: Can begin using it next turn\n6 capability not learned\nOnce a capability is learned, it stays learned."
        }
      ]
    },
    {
      "name":"Event Tables",
      "steps":[
        {
          "headline":"Learn the optional rule.",
          "description":"Events roll after turn 10 (Roll 1d6). 2 peaceful events. (Roll on the peace table.) Warfare event. (Roll on the warfare table.) Disaster event. (Roll on the disaster table.) 6 no event."
        },
        {
          "headline":"Roll 1d6 for the peace table.",
          "description":"An example could be 3 traders make up a fair trade, and roll 1d6. On a result of 1-3 they take the deal, and on a 4-6 they don't."
        },
        {
          "headline":"Gain 1d6 new capabilities for travelers.",
          "description":"Prosperity: Gain 3d6+5 precious ores. Huge population surge: Your population doubles."
        },
        {
          "headline":"Roll 1d6 for the warfare table.",
          "description":"2  barbarians:attacked by barbarians 1/4 your population size\n4 enemy nation:attacked by an enemy warriors 1/2 your size\n6 no event"
        },
        {
          "headline":"Roll 1d6 for the disaster table.",
          "description":"Storm: Loose 10% of ships, 50% are damaged. Earthquake: Loose 20% of buildings, 10% are damaged. Loose 1% of population. Volcano: Loose 20% of buildings, and 1% of population. Epidemic: Loose 50% of population, 1% remains sick. 6 no event."
        }
      ]
    }
  ],
  "text":" Setting Up Take a piece of paper and draw a number of land masses. Think about the way they were formed, if they rose from a volcanic plane from underneath the ocean or broke off from an immense pangea. You can be as detailed as you want to be when it comes to this. Fill it with terrain features. You can include forests, mountains, rivers, lakes, and more. Remember to consider the geological history of the land. An ice age would cause glaciers that carve U-shaped valleys into the land and tectonic faults would cause mountain ranges like the Andes or fold mountains like the Alps, depending on how they form and how they differ in composition. This can help when distributing resources. Remember, you can be as detailed as you want to be when it comes to this. Write your civilization's name on another piece of paper. This piece of paper will list your civilization's statistics, such as resources and troops. Below your civilization's name write 4 populations, 4 tools. Write capabilities below that. Write down hut building, basic tool building, and basic organization under that. Draw your land/terrain paper. Include 4 stick figures and 4 tools. Learning About the Tables for Each Action Roll once for each action spent rolling (roll 1d6) for search table. 3 found 1d6 of aspect searched for\n6 aspect not found Use the proper tools required to for the harvest table to harvest the wanted material. For example, you need axes to cut down trees. Roll 1d6 for each action spent harvesting. 2 greatly harvested: Gain 2d6 of aspect harvested\n4 aspect harvested: Gain 1d6 of aspect harvested\n6 aspect not harvested Roll 1d6 for each action spent building for the build table. After an aspect is built, the materials are reduced (example: after a stone house is built, the amount of stone used is gone). Roll 1d6 for each action spent building for the build table. 2 aspect completely built\n4 aspect nearly complete: Will be completely finished next turn\n6 aspect not built Use the proper tools needed and the proper materials needed to know how to do it for the repair/heal table. For example, a soldier is wounded and a medic spends his action healing him, who has a medical kit and has medical capability. Roll 1d6 for each action spent repairing and healing. 2 aspect completely healed/repaired\n4 aspect nearly completely healed/repaired will be completely repaired/healed nearly healed/repaired next turn\n6 aspect not repaired or healed at all Roll 1d6 for each action spent on conflict for the conflict table. 2 opponent soundly beaten (select effects, such as being killed)\n4 opponent beaten, but only wounded\n6 opponent not beaten Roll 1d6 for each action spent boosting population for the population boost table. 2 population increased by 3d6\n4 population increased by 2d6\nPopulation increased by 1d6\nPopulation not increased Learn the capability boost table. Capability increases what your civilization can do (E.G. A capability such as mining allows a civilisation to mine). Roll 1d6 for each action spent boosting a civilisation's capabilities. 2 capability completely learned: Can begin using it this turn\n4 capability nearly learned: Can begin using it next turn\n6 capability not learned\nOnce a capability is learned, it stays learned. Event Tables Learn the optional rule. Events roll after turn 10 (Roll 1d6). 2 peaceful events. (Roll on the peace table.) Warfare event. (Roll on the warfare table.) Disaster event. (Roll on the disaster table.) 6 no event. Roll 1d6 for the peace table. An example could be 3 traders make up a fair trade, and roll 1d6. On a result of 1-3 they take the deal, and on a 4-6 they don't. Gain 1d6 new capabilities for travelers. Prosperity: Gain 3d6+5 precious ores. Huge population surge: Your population doubles. Roll 1d6 for the warfare table. 2  barbarians:attacked by barbarians 1/4 your population size\n4 enemy nation:attacked by an enemy warriors 1/2 your size\n6 no event Roll 1d6 for the disaster table. Storm: Loose 10% of ships, 50% are damaged. Earthquake: Loose 20% of buildings, 10% are damaged. Loose 1% of population. Volcano: Loose 20% of buildings, and 1% of population. Epidemic: Loose 50% of population, 1% remains sick. 6 no event.",
  "tyn_model":[
    "paper",
    "tools",
    "rivers",
    "glaciers",
    "stick figures",
    "axes",
    "materials",
    "stone house",
    "stone",
    "medic",
    "traders",
    "ores",
    "storm",
    "ships",
    "earthquake"
  ],
  "tyn_section":[

  ]
}