{
  "title":"How to Use Angelica",
  "url":"https://www.wikihow.com/Use-Angelica",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "steps":[
    {
      "headline":"Candy the stems.",
      "description":"This is a long-used method for angelica stems and the candied angelica can be used for candy or as a decorative item on cakes, etc. Read How to make crystallised angelica for details."
    },
    {
      "headline":"Use angelica to sweeten food.",
      "description":"Add the angelica stems to improve the taste of food such as stewed rhubarb or stewed apricots."
    },
    {
      "headline":"Eat the roots.",
      "description":"The roots of angelica are edible. Serve them as a vegetable."
    },
    {
      "headline":"Cook the tips of angelica in marmalade and jam.",
      "description":""
    },
    {
      "headline":"Make angelica tea.",
      "description":""
    },
    {
      "headline":"Make angelica mouthwash.",
      "description":""
    },
    {
      "headline":"Use as a fixative in potpourri.",
      "description":"Dry the roots, then grind them up into a powder. Use as the fixative for your potpourri recipe. In addition, the dried leaves, seeds, and flowers can serve as elements of the potpourri proper. Add to herb pillows."
    }
  ],
  "text":" Candy the stems. This is a long-used method for angelica stems and the candied angelica can be used for candy or as a decorative item on cakes, etc. Read How to make crystallised angelica for details. Use angelica to sweeten food. Add the angelica stems to improve the taste of food such as stewed rhubarb or stewed apricots. Eat the roots. The roots of angelica are edible. Serve them as a vegetable. Cook the tips of angelica in marmalade and jam.  Make angelica tea.  Make angelica mouthwash.  Use as a fixative in potpourri. Dry the roots, then grind them up into a powder. Use as the fixative for your potpourri recipe. In addition, the dried leaves, seeds, and flowers can serve as elements of the potpourri proper. Add to herb pillows.",
  "tyn_model":[
    "angelica",
    "angelica stems",
    "rhubarb",
    "apricots",
    "marmalade",
    "jam",
    "angelica tea",
    "angelica mouthwash",
    "potpourri",
    "herb pillows"
  ],
  "tyn_section":[

  ]
}