{
  "title":"How to Make a Pi Day Pie",
  "url":"https://www.wikihow.com/Make-a-Pi-Day-Pie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies"
  ],
  "steps":[
    {
      "headline":"Line a pie pan with pie dough.",
      "description":"Bake at 425ºF, until lightly brown (also known as \"blind baking\"). Be sure to prick some holes in the base to allow steam to escape. At this point, set aside a little of the pie dough to cut and shape the Pi symbol. Place it in the oven to bake as well. Follow the image for your template, or even cut a template out using light cardboard."
    },
    {
      "headline":"Combine and mix the pumpkin with the eggs.",
      "description":"Mix both ingredients well."
    },
    {
      "headline":"Add the brown sugar in and mix again so that the brown sugar is well folded into the mixture.",
      "description":""
    },
    {
      "headline":"Combine the spices to the pint of melted ice cream.",
      "description":""
    },
    {
      "headline":"Pour the ice cream mixture into the pumpkin mix.",
      "description":"Mix until well blended so that the white streaks from the ice cream disappear. Pour the mixture into the pie shell."
    },
    {
      "headline":"Bake at 425ºF for 15 minutes.",
      "description":"Reduce heat to 350ºF/180ºC and bake about 45 minutes longer or until inserted knife comes out clean."
    },
    {
      "headline":"Allow to cool slightly.",
      "description":"Add the Pi symbol. Serve with whipped cream."
    }
  ],
  "text":" Line a pie pan with pie dough. Bake at 425ºF, until lightly brown (also known as \"blind baking\"). Be sure to prick some holes in the base to allow steam to escape. At this point, set aside a little of the pie dough to cut and shape the Pi symbol. Place it in the oven to bake as well. Follow the image for your template, or even cut a template out using light cardboard. Combine and mix the pumpkin with the eggs. Mix both ingredients well. Add the brown sugar in and mix again so that the brown sugar is well folded into the mixture.  Combine the spices to the pint of melted ice cream.  Pour the ice cream mixture into the pumpkin mix. Mix until well blended so that the white streaks from the ice cream disappear. Pour the mixture into the pie shell. Bake at 425ºF for 15 minutes. Reduce heat to 350ºF/180ºC and bake about 45 minutes longer or until inserted knife comes out clean. Allow to cool slightly. Add the Pi symbol. Serve with whipped cream.",
  "tyn_model":[
    "ice cream",
    "pie dough",
    "brown sugar",
    "pie pan",
    "oven",
    "pumpkin",
    "eggs",
    "spices",
    "pie shell",
    "knife",
    "pi symbol",
    "whipped cream"
  ],
  "tyn_section":[

  ]
}