{
  "title":"How to Create a Collage of Polaroids Using Photoshop CS5",
  "url":"https://www.wikihow.com/Create-a-Collage-of-Polaroids-Using-Photoshop-CS5",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Collages"
  ],
  "steps":[
    {
      "headline":"After you have chosen which picture you are going to collage and have opened it within Photoshop CS5 you'll need to duplicate the background layers.",
      "description":"To duplicate the layer, select the layer and press command+J"
    },
    {
      "headline":"Add a blank layer between the background layer and layer 1.",
      "description":"To do this, Highlight layer 1 while holding down command and click on the new layer icon. (The new layer icon is at the bottom of this image, looks like a little sticky note with the bottom left corner tabbed over.)"
    },
    {
      "headline":"Fill the new layer as black, the foreground color.",
      "description":"To do this make sure your color swatch is selected as black and click on the paint bucket tool, then click on your layer 2. The image in layer 2 does not show up black on your screen but will change in your layers toolbar."
    },
    {
      "headline":"With layer 2 selected, click on the new layer icon again to create Layer 3",
      "description":""
    },
    {
      "headline":"Select the rectangular marquee tool from the sidebar on the left.",
      "description":"Select on your image which section you want your first Polaroid."
    },
    {
      "headline":"Fill the selection from step 5 with black.",
      "description":"To do this, make sure you have Layer 3 selected and hold down option+delete to fill the selection. This will not appear on your image but in the layers palette."
    },
    {
      "headline":"Now we need to create a clipping mask using the selection we just filled with black in step 6.",
      "description":"To do this, click on layer 1 in the layers palette. Then go up to to the Layer menu at the top of your screen and select create clipping mask OR hold down option+command+G. tip: notice how layer 1 has become indented in the layers palette with a small arrow pointing down. This is telling us that layer 1 is being clipped by layer 3."
    },
    {
      "headline":"Now we need to add another new blank layer above layer 2.",
      "description":"Select layer 2 and then click on the new layer icon at the bottom of the layer palette."
    },
    {
      "headline":"Now select the rectangular marquee toolagain from the left side tool bar and drag out the border of the Polaroid photo around the first inside Polaroid image.",
      "description":""
    },
    {
      "headline":"We want to fill the selected section with white, thus looking like a Polaroid picture.",
      "description":"To do this, select layer 4 in the layer palette. Then make sure that white is selected as the foreground color(on the left side), then use the same shortcut we did last time to fill the selected area, command+delete."
    },
    {
      "headline":"To give the photo a more realistic collage look, we can rotate it however we'd like.",
      "description":"To do this, in your layer palette highlight layers 4 and 3. Hold the shift bar down to select both layers.With both selected use the shortcut command+T to rotate the image as you desire. (Hit enter when done rotating.)"
    },
    {
      "headline":"Now we need to group the three layers that makeup the Polaroid picture, layers 1, 3, and 4.",
      "description":"To select all three, again, hold the shift bar down to select more than one layer. With layers 1, 3, and 4 selected hold down command+G to group."
    },
    {
      "headline":"Now we want to create more Polaroids that are the same shape and size of our original one, so we want to duplicate this layer group.",
      "description":"To do this, select and drag the group down to the new layer icon at the bottom of the layers palette. Notice: group 1 copy."
    },
    {
      "headline":"Expand this folder and select both layers 3 and 4 (holding down shift to select both) and then with these two selected hold down command+T.",
      "description":"This allows us to move the new Polaroid and rotate the image as we please."
    },
    {
      "headline":"Repeat steps 13 and 14 until you have gathered a collage of Polaroids.",
      "description":""
    }
  ],
  "text":" After you have chosen which picture you are going to collage and have opened it within Photoshop CS5 you'll need to duplicate the background layers. To duplicate the layer, select the layer and press command+J Add a blank layer between the background layer and layer 1. To do this, Highlight layer 1 while holding down command and click on the new layer icon. (The new layer icon is at the bottom of this image, looks like a little sticky note with the bottom left corner tabbed over.) Fill the new layer as black, the foreground color. To do this make sure your color swatch is selected as black and click on the paint bucket tool, then click on your layer 2. The image in layer 2 does not show up black on your screen but will change in your layers toolbar. With layer 2 selected, click on the new layer icon again to create Layer 3  Select the rectangular marquee tool from the sidebar on the left. Select on your image which section you want your first Polaroid. Fill the selection from step 5 with black. To do this, make sure you have Layer 3 selected and hold down option+delete to fill the selection. This will not appear on your image but in the layers palette. Now we need to create a clipping mask using the selection we just filled with black in step 6. To do this, click on layer 1 in the layers palette. Then go up to to the Layer menu at the top of your screen and select create clipping mask OR hold down option+command+G. tip: notice how layer 1 has become indented in the layers palette with a small arrow pointing down. This is telling us that layer 1 is being clipped by layer 3. Now we need to add another new blank layer above layer 2. Select layer 2 and then click on the new layer icon at the bottom of the layer palette. Now select the rectangular marquee toolagain from the left side tool bar and drag out the border of the Polaroid photo around the first inside Polaroid image.  We want to fill the selected section with white, thus looking like a Polaroid picture. To do this, select layer 4 in the layer palette. Then make sure that white is selected as the foreground color(on the left side), then use the same shortcut we did last time to fill the selected area, command+delete. To give the photo a more realistic collage look, we can rotate it however we'd like. To do this, in your layer palette highlight layers 4 and 3. Hold the shift bar down to select both layers.With both selected use the shortcut command+T to rotate the image as you desire. (Hit enter when done rotating.) Now we need to group the three layers that makeup the Polaroid picture, layers 1, 3, and 4. To select all three, again, hold the shift bar down to select more than one layer. With layers 1, 3, and 4 selected hold down command+G to group. Now we want to create more Polaroids that are the same shape and size of our original one, so we want to duplicate this layer group. To do this, select and drag the group down to the new layer icon at the bottom of the layers palette. Notice: group 1 copy. Expand this folder and select both layers 3 and 4 (holding down shift to select both) and then with these two selected hold down command+T. This allows us to move the new Polaroid and rotate the image as we please. Repeat steps 13 and 14 until you have gathered a collage of Polaroids. ",
  "tyn_model":[
    "polaroid",
    "clipping mask",
    "layer palette",
    "polaroids",
    "photoshop cs5",
    "paint bucket"
  ],
  "tyn_section":[

  ]
}