{
  "title":"How to Affordably Decorate a Small Bedroom",
  "url":"https://www.wikihow.com/Affordably-Decorate-a-Small-Bedroom",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "methods":[
    {
      "name":"Rethinking Your Bedroom Furniture",
      "steps":[
        {
          "headline":"Make your bed the focal point.",
          "description":"When you walk into a bedroom, the bed is the piece of furniture that instantly draws the eye. Situating it in a central place and decorating around it is the best way to handle having a big bed in a small bedroom. Place the headboard against one wall. Treat it like the mantle in your living room, which you use as a place to display treasured items and pretty decorations. Since you have a small room, know that whatever wall art you choose is going to dominate the room. Limit your art to just two or three pieces so that you have plenty of bare wall, which gives the impression of more space. Save money by making your own wall art. Try  creating a silhouette of your pet or  painting a landscape. Black and white prints are affordable and a good choice for small rooms, since they don't demand attention the same way colorful paintings might."
        },
        {
          "headline":"Give away your dresser.",
          "description":"It sounds crazy, right? However, having a big, clunky dresser takes up a lot of space in a bedroom, and you may be able to get away without having one, or at the very least, downsizing. Take a look at what you've got and figure out how you can store it differently. Chances are, you can store most of it in the closet or in another storage container. Try some of these space-saving tricks when it comes to clothing storage:\nHang up most of your clothes. Clothes take up less space when they're on hangers than when they're folded up in a drawer. Hang up t-shirts, jeans, and other items you'd normally store in the dresser. Store your undergarments in a small cabinet or storage container in the closet or under the bed. Use hooks. Scarves, coats, hats, and other items can be stored on hooks instead of taking up space in a dresser. Store out-of-season clothing when you aren't using it. Place it in air-tight storage containers that will fit under your bed or on a shelf in your closet. Regularly donate clothes you no longer wear. You probably have more clothes and shoes than you could ever use - if this is the case, take them to a donation center and free up some space in your bedroom."
        },
        {
          "headline":"Buy a small chair and table.",
          "description":"Choose a sturdy table that can double as a desk and hold the items you'd normally place on your dresser. Place it near a window in the part of your room that gets used the least. Get a small wooden chair that you can push in under the table, so it's not sitting out in the middle of the room. Avoid getting a big cushy office chair, unless your bedroom doubles as your office. A straight-backed chair with a small cushion will take up far less space in your bedroom. Choose a table and chair that match your bed's frame so that your furniture choices don't look mismatched. Cherry wood, blond wood, or wrought iron are nice choices. Use part of the table's surface as a place to put your jewelry box, reading material, and other items you use on a daily basis. Don't let it get too cluttered, though!"
        },
        {
          "headline":"Get a small folding table to use as a nightstand.",
          "description":"You can buy small slatted wood tables that are easy to move around and fold up when they aren't in use. Place it next to your bed and top it with a reading lamp, your glasses, and whatever items you need next to you at night."
        }
      ]
    },
    {
      "name":"Getting Creative With Lighting and Color",
      "steps":[
        {
          "headline":"Rethink your approach to lighting.",
          "description":"The lighting in a bedroom can make a huge difference in how small or large it feels and whether or not it comes off as \"polished.\" To create a relaxing, comfortable bedroom in which you actually want to spend downtime, try making these changes:\nUse minimal window coverings. Avoid having blinds, which block out too much light and make a room feel closed-in even when they're open. Go for breezy, light curtains in a neutral color instead. Hanging them a few inches above the top of the window can make the windows look bigger and increase the perceived scale of the room. Choose a bright table or floor lamp. Overhead lights seem to spotlight the flaws in a room, making it feel cramped and uncomfortable. It's worth buying a floor lamp or side table lamp bright enough to light the whole room instead."
        },
        {
          "headline":"Paint the walls a light color.",
          "description":"Light, natural hues like white, cream, pale yellow, pale blue, or another neutral shade will help make the room look bigger and brighter. Choose a color that doesn't contrast too much with the shade of your floor. Paint the ceiling white as well. If you love bold colors, consider painting the walls a neutral color and using a bolder trim. You could also paint just one wall in a bold color (or paper it with a brightly patterned wallpaper) and paint the other walls a lighter color. Consider adding color and interest by  making a stenciled border around the perimeter of the room. You may not even need wall art if you go this route."
        },
        {
          "headline":"Pick out linens with subtle patterns.",
          "description":"You might be attracted to a duvet cover with a bright floral pattern, but in a small bedroom it will draw the eye and stick out from its surroundings. A better approach would be to get a bed covering in a more neutral hue and add throw pillows in bright contrasting colors for a decorative touch. You could also add some color by choosing sheets with a fun pattern and making your bed so that the sheets are folded over the top of your neutral-colored comforter. Choose linens that aren't too frilly or bulky, since these take up more space."
        }
      ]
    },
    {
      "name":"Incorporating Small Touches that Make a Big Difference",
      "steps":[
        {
          "headline":"Keep the floor as bare as possible.",
          "description":"If you have a hardwood floor (lucky you) a small throw rug next to the bed should be the only floor covering you need. Keeping the floor bare makes a room seem more spacious, while covering a floor with small rugs dissects it and makes it look cluttered. Plus, you'll avoid the expense of buying extra floor coverings. If you have carpeting, avoid breaking it up with smaller throw rugs. Keep the floor clear of random objects like bean bag chairs, piles of clothing, and other odds and ends."
        },
        {
          "headline":"Use mirrors to make the room feel larger.",
          "description":"Investing in a few good-quality mirrors is a great idea when you're working with limited space. Mirrors really do trick the eye into thinking a space is larger than it is."
        },
        {
          "headline":"Use wall shelves instead of a bookcase.",
          "description":"Install sturdy shelves on the wall and use it for the books or trinkets you want to display. You'll free up a lot of floor space by getting rid of your bookcase."
        },
        {
          "headline":"Choose just a few trinkets to display.",
          "description":"You may love your collection of vintage cuckoo clocks, but chances are they're taking up too much space in your little bedroom. Choose your favorite items to display and put the rest in storage. You can rotate them out after a few months to keep things fresh and interesting."
        },
        {
          "headline":"Find a place for a plant or two.",
          "description":"Plants are an inexpensive way to add a beautiful decorative touch to a room, and they don't have to take up too much space. Go to your local nursery and pick out a few plants small enough to display on your windowsill or a shelf. You could also consider installing a hook in the ceiling and buying a hanging plant to place near a window. Succulents, such as air plants, require very little upkeep. You can hang them up or display them on a shelf in pretty glass containers; just spray them with water once a week to keep them green and healthy."
        }
      ]
    }
  ],
  "text":" Rethinking Your Bedroom Furniture Make your bed the focal point. When you walk into a bedroom, the bed is the piece of furniture that instantly draws the eye. Situating it in a central place and decorating around it is the best way to handle having a big bed in a small bedroom. Place the headboard against one wall. Treat it like the mantle in your living room, which you use as a place to display treasured items and pretty decorations. Since you have a small room, know that whatever wall art you choose is going to dominate the room. Limit your art to just two or three pieces so that you have plenty of bare wall, which gives the impression of more space. Save money by making your own wall art. Try  creating a silhouette of your pet or  painting a landscape. Black and white prints are affordable and a good choice for small rooms, since they don't demand attention the same way colorful paintings might. Give away your dresser. It sounds crazy, right? However, having a big, clunky dresser takes up a lot of space in a bedroom, and you may be able to get away without having one, or at the very least, downsizing. Take a look at what you've got and figure out how you can store it differently. Chances are, you can store most of it in the closet or in another storage container. Try some of these space-saving tricks when it comes to clothing storage:\nHang up most of your clothes. Clothes take up less space when they're on hangers than when they're folded up in a drawer. Hang up t-shirts, jeans, and other items you'd normally store in the dresser. Store your undergarments in a small cabinet or storage container in the closet or under the bed. Use hooks. Scarves, coats, hats, and other items can be stored on hooks instead of taking up space in a dresser. Store out-of-season clothing when you aren't using it. Place it in air-tight storage containers that will fit under your bed or on a shelf in your closet. Regularly donate clothes you no longer wear. You probably have more clothes and shoes than you could ever use - if this is the case, take them to a donation center and free up some space in your bedroom. Buy a small chair and table. Choose a sturdy table that can double as a desk and hold the items you'd normally place on your dresser. Place it near a window in the part of your room that gets used the least. Get a small wooden chair that you can push in under the table, so it's not sitting out in the middle of the room. Avoid getting a big cushy office chair, unless your bedroom doubles as your office. A straight-backed chair with a small cushion will take up far less space in your bedroom. Choose a table and chair that match your bed's frame so that your furniture choices don't look mismatched. Cherry wood, blond wood, or wrought iron are nice choices. Use part of the table's surface as a place to put your jewelry box, reading material, and other items you use on a daily basis. Don't let it get too cluttered, though! Get a small folding table to use as a nightstand. You can buy small slatted wood tables that are easy to move around and fold up when they aren't in use. Place it next to your bed and top it with a reading lamp, your glasses, and whatever items you need next to you at night. Getting Creative With Lighting and Color Rethink your approach to lighting. The lighting in a bedroom can make a huge difference in how small or large it feels and whether or not it comes off as \"polished.\" To create a relaxing, comfortable bedroom in which you actually want to spend downtime, try making these changes:\nUse minimal window coverings. Avoid having blinds, which block out too much light and make a room feel closed-in even when they're open. Go for breezy, light curtains in a neutral color instead. Hanging them a few inches above the top of the window can make the windows look bigger and increase the perceived scale of the room. Choose a bright table or floor lamp. Overhead lights seem to spotlight the flaws in a room, making it feel cramped and uncomfortable. It's worth buying a floor lamp or side table lamp bright enough to light the whole room instead. Paint the walls a light color. Light, natural hues like white, cream, pale yellow, pale blue, or another neutral shade will help make the room look bigger and brighter. Choose a color that doesn't contrast too much with the shade of your floor. Paint the ceiling white as well. If you love bold colors, consider painting the walls a neutral color and using a bolder trim. You could also paint just one wall in a bold color (or paper it with a brightly patterned wallpaper) and paint the other walls a lighter color. Consider adding color and interest by  making a stenciled border around the perimeter of the room. You may not even need wall art if you go this route. Pick out linens with subtle patterns. You might be attracted to a duvet cover with a bright floral pattern, but in a small bedroom it will draw the eye and stick out from its surroundings. A better approach would be to get a bed covering in a more neutral hue and add throw pillows in bright contrasting colors for a decorative touch. You could also add some color by choosing sheets with a fun pattern and making your bed so that the sheets are folded over the top of your neutral-colored comforter. Choose linens that aren't too frilly or bulky, since these take up more space. Incorporating Small Touches that Make a Big Difference Keep the floor as bare as possible. If you have a hardwood floor (lucky you) a small throw rug next to the bed should be the only floor covering you need. Keeping the floor bare makes a room seem more spacious, while covering a floor with small rugs dissects it and makes it look cluttered. Plus, you'll avoid the expense of buying extra floor coverings. If you have carpeting, avoid breaking it up with smaller throw rugs. Keep the floor clear of random objects like bean bag chairs, piles of clothing, and other odds and ends. Use mirrors to make the room feel larger. Investing in a few good-quality mirrors is a great idea when you're working with limited space. Mirrors really do trick the eye into thinking a space is larger than it is. Use wall shelves instead of a bookcase. Install sturdy shelves on the wall and use it for the books or trinkets you want to display. You'll free up a lot of floor space by getting rid of your bookcase. Choose just a few trinkets to display. You may love your collection of vintage cuckoo clocks, but chances are they're taking up too much space in your little bedroom. Choose your favorite items to display and put the rest in storage. You can rotate them out after a few months to keep things fresh and interesting. Find a place for a plant or two. Plants are an inexpensive way to add a beautiful decorative touch to a room, and they don't have to take up too much space. Go to your local nursery and pick out a few plants small enough to display on your windowsill or a shelf. You could also consider installing a hook in the ceiling and buying a hanging plant to place near a window. Succulents, such as air plants, require very little upkeep. You can hang them up or display them on a shelf in pretty glass containers; just spray them with water once a week to keep them green and healthy.",
  "tyn_model":[
    "table",
    "chair",
    "mirrors",
    "dresser",
    "hooks",
    "linens",
    "sheets",
    "plant",
    "plants",
    "bed",
    "mantle",
    "air-tight storage containers",
    "wrought iron",
    "folding table",
    "reading lamp",
    "curtains",
    "floor lamp",
    "wallpaper",
    "duvet",
    "throw pillows",
    "shelves",
    "bookcase",
    "air plants",
    "water"
  ],
  "tyn_section":[

  ]
}