{
  "title":"How to Make Apricot and Cranberry Balls",
  "url":"https://www.wikihow.com/Make-Apricot-and-Cranberry-Balls",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Berries"
  ],
  "steps":[
    {
      "headline":"Place the pistachio nuts into a blender.",
      "description":"Blend, remove and put aside."
    },
    {
      "headline":"Add the apricots, crystallised ginger, rum or juice, and ground almonds into the blender.",
      "description":"Pulse until the resulting mixture is sticky."
    },
    {
      "headline":"Tip the apricot blend into a bowl.",
      "description":"Add the chopped dried cranberries and mix together."
    },
    {
      "headline":"Prepare the ball shapes.",
      "description":"Take about a teaspoon of mixture and roll into a ball shape on a clean surface. Once formed, roll in the ground pistachios."
    },
    {
      "headline":"Arrange on a tray lined with baking paper or wax paper.",
      "description":"Place in the refrigerator to chill for an hour."
    },
    {
      "headline":"Serve.",
      "description":"These also make excellent gifts."
    }
  ],
  "text":" Place the pistachio nuts into a blender. Blend, remove and put aside. Add the apricots, crystallised ginger, rum or juice, and ground almonds into the blender. Pulse until the resulting mixture is sticky. Tip the apricot blend into a bowl. Add the chopped dried cranberries and mix together. Prepare the ball shapes. Take about a teaspoon of mixture and roll into a ball shape on a clean surface. Once formed, roll in the ground pistachios. Arrange on a tray lined with baking paper or wax paper. Place in the refrigerator to chill for an hour. Serve. These also make excellent gifts.",
  "tyn_model":[
    "blender",
    "pistachio nuts",
    "apricots",
    "ginger",
    "rum",
    "ground almonds",
    "apricot",
    "bowl",
    "cranberries",
    "pistachios",
    "baking paper",
    "wax paper",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}