{
  "title":"How to Operate a Concrete Compression Machine",
  "url":"https://www.wikihow.com/Operate-a-Concrete-Compression-Machine",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Concrete",
    "Working with Concrete and Cement"
  ],
  "steps":[
    {
      "headline":"Before you even turn on the machine, make sure you have all of the materials you need in order make operating this machine and making calculations as easy as possible.Put on your safety goggles/glasses and your gloves before you proceed.",
      "description":""
    },
    {
      "headline":"Draw a table on a piece of paper in order to record the readings off the display of the machine when the concrete specimen fails/cracks.Calculate the diameter and area of each concrete specimen and record.",
      "description":""
    },
    {
      "headline":"After making a complete table, turn on the machine.",
      "description":"The main power switch is behind the digital monitor screen. Be careful not to touch the motor while it is on."
    },
    {
      "headline":"Place the concrete cylinder in the center of the loading area.",
      "description":"You must place the cylinder on top of the neoprene cap as shown in the image to the right. Be careful not to move the piston manually with your hands."
    },
    {
      "headline":"Close and latch the cage door.",
      "description":"Watch your hands!"
    },
    {
      "headline":"Push the lever away from you on the motor to lower the piston against the top of the concrete cylinder.",
      "description":"Make sure the lever is in the “Advance” position. Do not touch the motor."
    },
    {
      "headline":"Please make sure the piston is touching the top of the cylinder before you proceed.",
      "description":"Be careful not to put hands near piston while it is coming down!"
    },
    {
      "headline":"Once the piston is right on top of the cylinder, pull the lever towards you into the “Hold” position.",
      "description":""
    },
    {
      "headline":"Push the “zero” button on the display to start the compression test.",
      "description":""
    },
    {
      "headline":"Increase the amount of pressure on the piston by turning the valve next to the piston-lever counter-clockwise.",
      "description":"Refer to Page 5 for correct pressures per concrete cylinder."
    },
    {
      "headline":"Watch the display screen as the pressure and weight goes up.",
      "description":""
    },
    {
      "headline":"Keep adjusting the amount of pressure on the piston (via the valve) to make sure it matches the values on the Compressive Strength Figure.",
      "description":""
    },
    {
      "headline":"The Concrete Test is complete when the cylinder begins to crack and splinter.",
      "description":"Record the ultimate load (in lbs) on your table."
    },
    {
      "headline":"Stop the test by pushing the lever away from you into the “Retreat” position.",
      "description":"This should place the piston back in its original position before you began the test."
    },
    {
      "headline":"Once the piston is back into position, open the cage door and safely remove the cracked concrete with both hands.",
      "description":""
    },
    {
      "headline":"Record the ultimate load (in pounds) that is on the display when the concrete cracked (this number should still be on the display even after the test is complete).Put this data on your table.",
      "description":""
    },
    {
      "headline":"Clean up the inside of the loading area by discarding cracked concrete fragments into a bucket or bowl.",
      "description":""
    },
    {
      "headline":"Turn off the machine by referring to the switch behind the display monitor.",
      "description":""
    },
    {
      "headline":"Use the Compressive Strength formula (Figure 1.21) in order to calculate the compressive force that was required to crack and splinter the concrete.",
      "description":""
    },
    {
      "headline":"Repeat the test for other concrete specimens if you have time.",
      "description":"Restart the testing process from step 3 and go up all the way to step 19."
    }
  ],
  "text":" Before you even turn on the machine, make sure you have all of the materials you need in order make operating this machine and making calculations as easy as possible.Put on your safety goggles/glasses and your gloves before you proceed.  Draw a table on a piece of paper in order to record the readings off the display of the machine when the concrete specimen fails/cracks.Calculate the diameter and area of each concrete specimen and record.  After making a complete table, turn on the machine. The main power switch is behind the digital monitor screen. Be careful not to touch the motor while it is on. Place the concrete cylinder in the center of the loading area. You must place the cylinder on top of the neoprene cap as shown in the image to the right. Be careful not to move the piston manually with your hands. Close and latch the cage door. Watch your hands! Push the lever away from you on the motor to lower the piston against the top of the concrete cylinder. Make sure the lever is in the “Advance” position. Do not touch the motor. Please make sure the piston is touching the top of the cylinder before you proceed. Be careful not to put hands near piston while it is coming down! Once the piston is right on top of the cylinder, pull the lever towards you into the “Hold” position.  Push the “zero” button on the display to start the compression test.  Increase the amount of pressure on the piston by turning the valve next to the piston-lever counter-clockwise. Refer to Page 5 for correct pressures per concrete cylinder. Watch the display screen as the pressure and weight goes up.  Keep adjusting the amount of pressure on the piston (via the valve) to make sure it matches the values on the Compressive Strength Figure.  The Concrete Test is complete when the cylinder begins to crack and splinter. Record the ultimate load (in lbs) on your table. Stop the test by pushing the lever away from you into the “Retreat” position. This should place the piston back in its original position before you began the test. Once the piston is back into position, open the cage door and safely remove the cracked concrete with both hands.  Record the ultimate load (in pounds) that is on the display when the concrete cracked (this number should still be on the display even after the test is complete).Put this data on your table.  Clean up the inside of the loading area by discarding cracked concrete fragments into a bucket or bowl.  Turn off the machine by referring to the switch behind the display monitor.  Use the Compressive Strength formula (Figure 1.21) in order to calculate the compressive force that was required to crack and splinter the concrete.  Repeat the test for other concrete specimens if you have time. Restart the testing process from step 3 and go up all the way to step 19.",
  "tyn_model":[
    "concrete",
    "” position",
    "motor",
    "safety goggles",
    "table",
    "neoprene cap",
    "“advance",
    "lever",
    "“hold",
    "“zero",
    "” button",
    "“retreat",
    "bucket",
    "bowl",
    "machine"
  ],
  "tyn_section":[

  ]
}