{
  "title":"How to Beat Bowser in Mario Party DS",
  "url":"https://www.wikihow.com/Beat-Bowser-in-Mario-Party-DS",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Mario Party Series"
  ],
  "methods":[
    {
      "name":"Tornado Bowser",
      "steps":[
        {
          "headline":"Understand that Bowser will begin to spin towards you.",
          "description":"While he is doing this, swiftly move around and avoid his spin attack. He will also fire fireballs, so do your best to dodge these as well."
        },
        {
          "headline":"Wait for Bowser to stop and fall over.",
          "description":"Be sure that you're out of the way when he stops and is about to do this. Once he falls, punch the singular golden block multiple times until he transforms into his second phase, Block Bowser."
        }
      ]
    },
    {
      "name":"Block Bowser",
      "steps":[
        {
          "headline":"Stay at the center of the arena.",
          "description":"Bowser will transform into a cube and topple over to move. Try to stay in the center to limit his movement."
        },
        {
          "headline":"Punch him when the golden block is at the bottom of the cube.",
          "description":"He should topple over once again in a couple of seconds, so punch him repeatedly and he will eventually transform into his 3rd and final phase, Snake Bowser."
        }
      ]
    },
    {
      "name":"Snake Bowser",
      "steps":[
        {
          "headline":"Change your view to help you see him better.",
          "description":"This is the final and hardest form of Bowser, as he will transform into a snake. Change the view to the Overview by pressing the X button. This makes following his moves easier."
        },
        {
          "headline":"Punch the golden block before he attacks you.",
          "description":"He will circle the platform and shoot fireballs before attempting to rush you. Before he can do this, quickly run up to him and punch the golden block. After a couple of hits, move away. Be ready for his spread shoot, as he will shoot two fireballs sideways and one forwards."
        }
      ]
    }
  ],
  "text":" Tornado Bowser Understand that Bowser will begin to spin towards you. While he is doing this, swiftly move around and avoid his spin attack. He will also fire fireballs, so do your best to dodge these as well. Wait for Bowser to stop and fall over. Be sure that you're out of the way when he stops and is about to do this. Once he falls, punch the singular golden block multiple times until he transforms into his second phase, Block Bowser. Block Bowser Stay at the center of the arena. Bowser will transform into a cube and topple over to move. Try to stay in the center to limit his movement. Punch him when the golden block is at the bottom of the cube. He should topple over once again in a couple of seconds, so punch him repeatedly and he will eventually transform into his 3rd and final phase, Snake Bowser. Snake Bowser Change your view to help you see him better. This is the final and hardest form of Bowser, as he will transform into a snake. Change the view to the Overview by pressing the X button. This makes following his moves easier. Punch the golden block before he attacks you. He will circle the platform and shoot fireballs before attempting to rush you. Before he can do this, quickly run up to him and punch the golden block. After a couple of hits, move away. Be ready for his spread shoot, as he will shoot two fireballs sideways and one forwards.",
  "tyn_model":[
    "bowser",
    "snake",
    "golden block"
  ],
  "tyn_section":[

  ]
}