{
  "title":"How to Make a Matching Bracelet and Earring Set",
  "url":"https://www.wikihow.com/Make-a-Matching-Bracelet-and-Earring-Set",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Beading"
  ],
  "methods":[
    {
      "name":"Making a Bead Bracelet",
      "steps":[
        {
          "headline":"Take the nylon coated stainless steel stringing wire and begin by stringing the beads onto the end that is not attached to the spool.",
          "description":"Cut the wire once you have finished stringing all of the beads onto it so that you can measure the length of the bracelet with the beads already on it. You may want to measure the length of the bracelet with your own wrist or with the wrist of the recipient of this bracelet to make sure that the bracelet is the correct size."
        },
        {
          "headline":"Begin with one of the small swarovski crystal beads and thread the wire through its hole.",
          "description":""
        },
        {
          "headline":"Use one of the circular shell beads, however only thread this bead halfway through.",
          "description":""
        },
        {
          "headline":"Place one of the square beads in the center of the circular shell bead where the open hole is and align their holes.",
          "description":""
        },
        {
          "headline":"Thread the wire through both beads and then place another swarovski crystal bead on the other side of the circular shell bead and thread the wire through this bead.",
          "description":""
        },
        {
          "headline":"Continue with this process, rotating the swarovski crystal beads and the circular shell beads with the square bead in its center until you have seven swarovski crystal beads and six circular shell beads with the square bead in its center alternating between each.",
          "description":"You may need to put on an extra circular shell bead with the square bead in its center for bigger wrists, adding the clasp will add some more length however."
        },
        {
          "headline":"Once you have strung all of the beads, take a crimp bead and thread it onto the end of the wire, the side that is not attached to the spool.",
          "description":""
        },
        {
          "headline":"Take one of the pieces from the clasp set and thread it onto the wire next to the crimp bead.",
          "description":""
        },
        {
          "headline":"Take the loose end of the wire and fold it back towards the crimp bead, making a loop which the clasp is hanging on.",
          "description":""
        },
        {
          "headline":"Thread the end of the wire back through the crimp bead so that the wire is threaded through the crimp bead twice.",
          "description":""
        },
        {
          "headline":"Take the needle nose pliers and place them around the crimp bead and close the crimp bead by pushing the pliers together.",
          "description":""
        },
        {
          "headline":"Take the loose end of the wire poking out of the crimp bead and feed it back through the swarovski crystal bead for cleaner look.",
          "description":""
        },
        {
          "headline":"Cut the wire loose from the spool leaving about an inch and a half extra wire which you will attach the second half of the clasp to.",
          "description":""
        },
        {
          "headline":"Repeat steps 7-12 to close the second side of the bracelet.",
          "description":""
        },
        {
          "headline":"The bracelet is now complete, you may want to straighten out the beads and check for any excess wire poking out or anything else that you may want to clean up about the bracelet’s look.",
          "description":""
        }
      ]
    },
    {
      "name":"Making a Pair of Dangle Earrings",
      "steps":[
        {
          "headline":"Take one of your stainless steel head pins and thread one of the small swarovski crystal beads onto the head pin.",
          "description":"The bead should not slip off because the swarovski crystal bead hole should not be larger than the stopper at the end of the head pin."
        },
        {
          "headline":"Take one of the circular shell beads and thread it through the head pin half of the way.",
          "description":""
        },
        {
          "headline":"Place one of the square beads in the center of the circular shell bead where the open hole is and align their holes.",
          "description":""
        },
        {
          "headline":"Slide the head pin through both of the beads.",
          "description":""
        },
        {
          "headline":"Take the pair of needle nose pliers with wire cutter and cut off the excess part of the pin, leaving approximately a centimeter of the pin that has the beads on it.",
          "description":""
        },
        {
          "headline":"Take the pair of round tip pliers, about a half a centimeter from the tip of the pliers, and place them at the end of the head pin.",
          "description":""
        },
        {
          "headline":"Bend the tip of the head pin over and mold the pin around the pliers eventually forming a small loop.",
          "description":"Make sure to not close the loop completely, because you are going to need space to slide on the earring hook."
        },
        {
          "headline":"Take one of the earring hooks and put it onto the small loop at the end of the head pin.",
          "description":""
        },
        {
          "headline":"Take the pair of round tip pliers and close the small gap in the loop.",
          "description":""
        },
        {
          "headline":"Repeat steps 1-9 for the second earring.",
          "description":""
        },
        {
          "headline":"You have now completed the set of earrings, but you may want to straighten the beads or bend the wires so that they are completely straight; this is solely for your benefit, making the earrings look exactly as you want them to look.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making a Bead Bracelet Take the nylon coated stainless steel stringing wire and begin by stringing the beads onto the end that is not attached to the spool. Cut the wire once you have finished stringing all of the beads onto it so that you can measure the length of the bracelet with the beads already on it. You may want to measure the length of the bracelet with your own wrist or with the wrist of the recipient of this bracelet to make sure that the bracelet is the correct size. Begin with one of the small swarovski crystal beads and thread the wire through its hole.  Use one of the circular shell beads, however only thread this bead halfway through.  Place one of the square beads in the center of the circular shell bead where the open hole is and align their holes.  Thread the wire through both beads and then place another swarovski crystal bead on the other side of the circular shell bead and thread the wire through this bead.  Continue with this process, rotating the swarovski crystal beads and the circular shell beads with the square bead in its center until you have seven swarovski crystal beads and six circular shell beads with the square bead in its center alternating between each. You may need to put on an extra circular shell bead with the square bead in its center for bigger wrists, adding the clasp will add some more length however. Once you have strung all of the beads, take a crimp bead and thread it onto the end of the wire, the side that is not attached to the spool.  Take one of the pieces from the clasp set and thread it onto the wire next to the crimp bead.  Take the loose end of the wire and fold it back towards the crimp bead, making a loop which the clasp is hanging on.  Thread the end of the wire back through the crimp bead so that the wire is threaded through the crimp bead twice.  Take the needle nose pliers and place them around the crimp bead and close the crimp bead by pushing the pliers together.  Take the loose end of the wire poking out of the crimp bead and feed it back through the swarovski crystal bead for cleaner look.  Cut the wire loose from the spool leaving about an inch and a half extra wire which you will attach the second half of the clasp to.  Repeat steps 7-12 to close the second side of the bracelet.  The bracelet is now complete, you may want to straighten out the beads and check for any excess wire poking out or anything else that you may want to clean up about the bracelet’s look.  Making a Pair of Dangle Earrings Take one of your stainless steel head pins and thread one of the small swarovski crystal beads onto the head pin. The bead should not slip off because the swarovski crystal bead hole should not be larger than the stopper at the end of the head pin. Take one of the circular shell beads and thread it through the head pin half of the way.  Place one of the square beads in the center of the circular shell bead where the open hole is and align their holes.  Slide the head pin through both of the beads.  Take the pair of needle nose pliers with wire cutter and cut off the excess part of the pin, leaving approximately a centimeter of the pin that has the beads on it.  Take the pair of round tip pliers, about a half a centimeter from the tip of the pliers, and place them at the end of the head pin.  Bend the tip of the head pin over and mold the pin around the pliers eventually forming a small loop. Make sure to not close the loop completely, because you are going to need space to slide on the earring hook. Take one of the earring hooks and put it onto the small loop at the end of the head pin.  Take the pair of round tip pliers and close the small gap in the loop.  Repeat steps 1-9 for the second earring.  You have now completed the set of earrings, but you may want to straighten the beads or bend the wires so that they are completely straight; this is solely for your benefit, making the earrings look exactly as you want them to look. ",
  "tyn_model":[
    "wire",
    "swarovski crystal",
    "thread",
    "pliers",
    "swarovski crystal beads",
    "circular shell beads",
    "needle nose pliers",
    "round tip pliers",
    "nylon coated stainless steel stringing wire",
    "circular shell bead",
    "stainless steel head pins",
    "swarovski crystal bead",
    "stopper",
    "wire cutter",
    "beads"
  ],
  "tyn_section":[

  ]
}