{
  "title":"How to Build a Film Can Cannon Without a Film Can",
  "url":"https://www.wikihow.com/Build-a-Film-Can-Cannon-Without-a-Film-Can",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Model Making"
  ],
  "steps":[
    {
      "headline":"Put wires through a Tic-Tac box.",
      "description":"Instead of film can, use an empty box which previously stored Tic-Tac candies. Then, make a slit in the top of the box. Push a pair of wires through the slit."
    },
    {
      "headline":"Solder the wires.",
      "description":"Solder the wires to something that can light them. A cigarette lighter or an electronic lighter is ideal for this project."
    },
    {
      "headline":"Fuel the cannon.",
      "description":"There are many varieties of fuel for this cannon. You can use perfume, hairspray, or even mouth freshener. Open the lid of the Tic-Tac box and spray the \"fuel\" in it a couple times, then close the lid quickly."
    },
    {
      "headline":"Light the cannon.",
      "description":"If you aren't already outside, go into your front or backyard, put the cannon on the ground, and flick on the lighter. The cannon should shoot into the air."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Put wires through a Tic-Tac box. Instead of film can, use an empty box which previously stored Tic-Tac candies. Then, make a slit in the top of the box. Push a pair of wires through the slit. Solder the wires. Solder the wires to something that can light them. A cigarette lighter or an electronic lighter is ideal for this project. Fuel the cannon. There are many varieties of fuel for this cannon. You can use perfume, hairspray, or even mouth freshener. Open the lid of the Tic-Tac box and spray the \"fuel\" in it a couple times, then close the lid quickly. Light the cannon. If you aren't already outside, go into your front or backyard, put the cannon on the ground, and flick on the lighter. The cannon should shoot into the air. Finished. ",
  "tyn_model":[
    "cannon",
    "tic-tac box",
    "tic-tac candies",
    "cigarette lighter",
    "electronic lighter",
    "hairspray",
    "mouth freshener",
    "lighter"
  ],
  "tyn_section":[

  ]
}