{
  "title":"How to Make Photos Private on Flickr",
  "url":"https://www.wikihow.com/Make-Photos-Private-on-Flickr",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography"
  ],
  "methods":[
    {
      "name":"Flickr Mobile App - Altering Your Default Privacy Settings",
      "steps":[
        {
          "headline":"Tap the Settings icon in the upper right corner.",
          "description":"On Android click the three dots in a vertical line. On iPhone, click the gear."
        },
        {
          "headline":"Select “Privacy and safety”.",
          "description":""
        },
        {
          "headline":"Tap “Default post privacy”.",
          "description":""
        },
        {
          "headline":"Choose who may view your content.",
          "description":"When you change your default privacy setting, it will only affect new content. It will not change the privacy settings for existing content. You may choose one of the following options:\nPublic: Anyone can access your content. Friends & Family: The contacts you've designated as friends and family may access your content. Friends: Only the contacts you've identified as friends may view your content. Family: Only the contacts you've identified as family may view your content. Private: Only you may view your content."
        }
      ]
    },
    {
      "name":"Flickr Mobile App - Batch-Editing Photos in Camera Roll",
      "steps":[
        {
          "headline":"Click “Camera Roll”.",
          "description":""
        },
        {
          "headline":"Tap and hold down on an image.",
          "description":"This will allow you to select multiple images."
        },
        {
          "headline":"Select the images you want to make private.",
          "description":""
        },
        {
          "headline":"Tap on the lock icon.",
          "description":"This will open the privacy settings."
        },
        {
          "headline":"Select who may view your content.",
          "description":"You may choose one of the following options:\nPublic: Anyone can access your content. Friends & Family: The contacts you've designated as friends and family may access your content. Friends: Only the contacts you've identified as friends may view your content. Family: Only the contacts you've identified as family may view your content. Private: Only you may view your content."
        }
      ]
    },
    {
      "name":"Flickr Mobile App - Editing One Image in Camera Roll",
      "steps":[
        {
          "headline":"Select “Camera Roll”.",
          "description":"If you've organized your images into albums, you can press “Albums” instead of “Camera Roll”. After you select the album you wish to edit, press the icon (three dots in a horizontal line) in the very top, right corner of the screen. Tap “Edit” from the drop-down menu and then proceed with the remaining steps."
        },
        {
          "headline":"Tap the image you want to make private.",
          "description":""
        },
        {
          "headline":"Tap the info icon.",
          "description":"This icon is a lowercase “i” surrounded by a circle. If you are in “Albums”, press the lock icon located at the very bottom, left corner of the screen."
        },
        {
          "headline":"Locate the “Privacy” section and click the pencil icon.",
          "description":"If you are in “Albums”, skip this step."
        },
        {
          "headline":"Decide who may view your content.",
          "description":"You may choose one of the following options:\nPublic: Anyone can access your content. Friends & Family: The contacts you've designated as friends and family may access your content. Friends: Only the contacts you've identified as friends may view your content. Family: Only the contacts you've identified as family may view your content. Private: Only you may view your content."
        }
      ]
    },
    {
      "name":"Flickr Desktop - Altering Your Default Privacy Settings",
      "steps":[
        {
          "headline":"Click on your profile picture in the upper right corner.",
          "description":""
        },
        {
          "headline":"Select “Settings”.",
          "description":""
        },
        {
          "headline":"Select “Privacy & Permissions”.",
          "description":""
        },
        {
          "headline":"Scroll down to the “Defaults for new uploads” section.",
          "description":""
        },
        {
          "headline":"Edit “Who will be able to see, comment on, add notes, or add people”.",
          "description":""
        },
        {
          "headline":"Change the default setting from “Anyone (public)” to “Only you (private)”.",
          "description":""
        },
        {
          "headline":"Allow your friends and/or family to see your images.",
          "description":"When you select “Only you (private),” Flickr presents you with the option to allow the contacts designated as “Your friends” and/or “Your family” to also view these private images. Checking the box next to one or both options will allow contacts you've designated as friends and/or family members to access your private photos."
        },
        {
          "headline":"Click “Save Settings”.",
          "description":"Your new privacy settings will only apply to content you upload in the future. It will not alter the privacy settings for existing content."
        }
      ]
    },
    {
      "name":"Flickr Desktop - Editing Images in Camera Roll",
      "steps":[
        {
          "headline":"Click “You”, followed by “Camera Roll”.",
          "description":""
        },
        {
          "headline":"Select one or multiple images.",
          "description":"You can select images individually or click “Select all”."
        },
        {
          "headline":"Click on the privacy \"lock\" icon.",
          "description":""
        },
        {
          "headline":"Choose who may view your content.",
          "description":"You may choose one of the following options:\nPublic: Anyone can access your content. Friends & Family: The contacts you've designated as friends and family may access your content. Friends: Only the contacts you've identified as friends may view your content. Family: Only the contacts you've identified as family may view your content. Private: Only you may view your content."
        }
      ]
    },
    {
      "name":"Flickr Desktop - Editing One Image in Photostream",
      "steps":[
        {
          "headline":"Click “You” then press “Photostream”.",
          "description":""
        },
        {
          "headline":"Choose an image to edit.",
          "description":""
        },
        {
          "headline":"Scroll down to the “Additional Information” section.",
          "description":""
        },
        {
          "headline":"Change the Viewing privacy settings.",
          "description":"You may choose one of the following options:\nPublic: Anyone can access your content. Friends & Family: The contacts you've designated as friends and family may access your content. Friends: Only the contacts you've identified as friends may view your content. Family: Only the contacts you've identified as family may view your content. Private: Only you may view your content."
        }
      ]
    },
    {
      "name":"Flickr Desktop - Batch-editing Photos in an Album",
      "steps":[
        {
          "headline":"Select “You”.",
          "description":""
        },
        {
          "headline":"Click “Albums”.",
          "description":""
        },
        {
          "headline":"Click on the album you want to edit.",
          "description":""
        },
        {
          "headline":"Select “Edit in Organizer”.",
          "description":"This is located above the album's banner."
        },
        {
          "headline":"Select “Batch Edit” the “Change Permissions”.",
          "description":""
        },
        {
          "headline":"Choose “Only you (private)”.",
          "description":""
        },
        {
          "headline":"Allow your friends and/or family to see your images.",
          "description":"Once you've selected “Only you (private),” Flickr presents you with the option to allow the contacts designated as “Your friends” and/or “Your family” to also view these private images. Checking the box next to one or both options will allow contacts you've designated as friends and/or family members to access your private photos."
        },
        {
          "headline":"Click “Change Permissions”.",
          "description":"Clicking “Change Permissions” saves the changes you made to the album's privacy settings. Only those you granted permission to (“Only You (Private)”, “Your friends”, and/or “Your family”) will be able to view the images in this album."
        }
      ]
    }
  ],
  "text":" Flickr Mobile App - Altering Your Default Privacy Settings Tap the Settings icon in the upper right corner. On Android click the three dots in a vertical line. On iPhone, click the gear. Select “Privacy and safety”.  Tap “Default post privacy”.  Choose who may view your content. When you change your default privacy setting, it will only affect new content. It will not change the privacy settings for existing content. You may choose one of the following options:\nPublic: Anyone can access your content. Friends & Family: The contacts you've designated as friends and family may access your content. Friends: Only the contacts you've identified as friends may view your content. Family: Only the contacts you've identified as family may view your content. Private: Only you may view your content. Flickr Mobile App - Batch-Editing Photos in Camera Roll Click “Camera Roll”.  Tap and hold down on an image. This will allow you to select multiple images. Select the images you want to make private.  Tap on the lock icon. This will open the privacy settings. Select who may view your content. You may choose one of the following options:\nPublic: Anyone can access your content. Friends & Family: The contacts you've designated as friends and family may access your content. Friends: Only the contacts you've identified as friends may view your content. Family: Only the contacts you've identified as family may view your content. Private: Only you may view your content. Flickr Mobile App - Editing One Image in Camera Roll Select “Camera Roll”. If you've organized your images into albums, you can press “Albums” instead of “Camera Roll”. After you select the album you wish to edit, press the icon (three dots in a horizontal line) in the very top, right corner of the screen. Tap “Edit” from the drop-down menu and then proceed with the remaining steps. Tap the image you want to make private.  Tap the info icon. This icon is a lowercase “i” surrounded by a circle. If you are in “Albums”, press the lock icon located at the very bottom, left corner of the screen. Locate the “Privacy” section and click the pencil icon. If you are in “Albums”, skip this step. Decide who may view your content. You may choose one of the following options:\nPublic: Anyone can access your content. Friends & Family: The contacts you've designated as friends and family may access your content. Friends: Only the contacts you've identified as friends may view your content. Family: Only the contacts you've identified as family may view your content. Private: Only you may view your content. Flickr Desktop - Altering Your Default Privacy Settings Click on your profile picture in the upper right corner.  Select “Settings”.  Select “Privacy & Permissions”.  Scroll down to the “Defaults for new uploads” section.  Edit “Who will be able to see, comment on, add notes, or add people”.  Change the default setting from “Anyone (public)” to “Only you (private)”.  Allow your friends and/or family to see your images. When you select “Only you (private),” Flickr presents you with the option to allow the contacts designated as “Your friends” and/or “Your family” to also view these private images. Checking the box next to one or both options will allow contacts you've designated as friends and/or family members to access your private photos. Click “Save Settings”. Your new privacy settings will only apply to content you upload in the future. It will not alter the privacy settings for existing content. Flickr Desktop - Editing Images in Camera Roll Click “You”, followed by “Camera Roll”.  Select one or multiple images. You can select images individually or click “Select all”. Click on the privacy \"lock\" icon.  Choose who may view your content. You may choose one of the following options:\nPublic: Anyone can access your content. Friends & Family: The contacts you've designated as friends and family may access your content. Friends: Only the contacts you've identified as friends may view your content. Family: Only the contacts you've identified as family may view your content. Private: Only you may view your content. Flickr Desktop - Editing One Image in Photostream Click “You” then press “Photostream”.  Choose an image to edit.  Scroll down to the “Additional Information” section.  Change the Viewing privacy settings. You may choose one of the following options:\nPublic: Anyone can access your content. Friends & Family: The contacts you've designated as friends and family may access your content. Friends: Only the contacts you've identified as friends may view your content. Family: Only the contacts you've identified as family may view your content. Private: Only you may view your content. Flickr Desktop - Batch-editing Photos in an Album Select “You”.  Click “Albums”.  Click on the album you want to edit.  Select “Edit in Organizer”. This is located above the album's banner. Select “Batch Edit” the “Change Permissions”.  Choose “Only you (private)”.  Allow your friends and/or family to see your images. Once you've selected “Only you (private),” Flickr presents you with the option to allow the contacts designated as “Your friends” and/or “Your family” to also view these private images. Checking the box next to one or both options will allow contacts you've designated as friends and/or family members to access your private photos. Click “Change Permissions”. Clicking “Change Permissions” saves the changes you made to the album's privacy settings. Only those you granted permission to (“Only You (Private)”, “Your friends”, and/or “Your family”) will be able to view the images in this album.",
  "tyn_model":[
    "”.",
    "“your",
    "”,",
    "“only",
    "“camera",
    "“albums",
    "“privacy",
    "” section",
    "” to",
    "“you",
    "“change",
    "“edit",
    "” flickr",
    "” and/or",
    "“default",
    "” instead",
    "” from",
    "“i",
    "” surrounded",
    "pencil",
    "“settings",
    "“defaults",
    "“who",
    "“anyone",
    "“save",
    "“select",
    "” then",
    "“photostream",
    "“additional",
    "photos",
    "“batch",
    "” the",
    "” saves",
    "”)"
  ],
  "tyn_section":[

  ]
}