{
  "title":"How to Stock Your Pantry for Quick and Easy Meals",
  "url":"https://www.wikihow.com/Stock-Your-Pantry-for-Quick-and-Easy-Meals",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Meal Planning"
  ],
  "parts":[
    {
      "name":"Stocking the Basics",
      "steps":[
        {
          "headline":"Look at your herbs and seasonings before you go shopping.",
          "description":"Since these items aren’t regularly purchased, it’s easy to forget you need them. Salt, pepper, Italian seasoning, basil, and red pepper flakes are common herbs and seasonings you might want to have on hand."
        },
        {
          "headline":"Purchase a variety of oils.",
          "description":"Vegetable oil, peanut oil, sesame oil, and olive oil are popular oils to have keep in stock. Each of these can change the flavor of your food and provides a simple way to add variety. If you’re looking for a healthier choice, peanut oil or sunflower oil might be the best option. They also impart unique flavors to the food. Use olive oil in Italian and European style dishes or sesame oil for an Asian flair. Vegetable oil works well for deep frying anything from chicken and fish to French fries."
        },
        {
          "headline":"Buy only the bread you will need for a week.",
          "description":"Keep the bread tied at all times and keep it sealed in a bread container for extra protection against going stale."
        },
        {
          "headline":"Buy a variety of bouillon cubes.",
          "description":"Chicken and beef bouillon cubes last for 6 to 12 months and allow you to prepare chicken or beef stocks for healthy, flavorful meals."
        }
      ]
    },
    {
      "name":"Stocking Canned Goods",
      "steps":[
        {
          "headline":"Buy a variety of soups.",
          "description":"Soups taste good as quick stand-alone meals, but they also go well with sandwiches and can be used in cooking. This makes soup a versatile and convenient item to keep on hand."
        },
        {
          "headline":"Store pre-cooked meats like canned ham and sausage.",
          "description":"Use pre-cooked meats as a source of protein without having to worry about the cook time of fresh meats."
        },
        {
          "headline":"Purchase plenty of canned fruit.",
          "description":"There are different types of canned fruit. Canned fruit for baking has the consistency of pie filling. If you want to keep it healthy, avoid heavy syrup and buy canned fruit packed in natural juices or light syrup."
        },
        {
          "headline":"Stock your pantry with tuna fish.",
          "description":"Tuna fish sandwiches on toast is delicious and healthy. Tuna fish is also a good addition to egg noodles for a delicious casserole. You can purchase tuna fish packed in oil or water, depending on your taste preference."
        }
      ]
    },
    {
      "name":"Stocking Dry Goods",
      "steps":[
        {
          "headline":"Stock flour, baking soda, and sugar.",
          "description":"These are basic ingredients you can use in desserts and in savory dishes. Purchase large sizes of these ingredients to save money."
        },
        {
          "headline":"Buy packaged sides.",
          "description":"Gravy, mashed potatoes, and pasta dishes come in handy serving sizes. Use these packaged side dishes for a quick, easy way to round out your meals."
        },
        {
          "headline":"Purchase a variety of cake and muffin mixes.",
          "description":"Boxed cakes are easy to make, especially if you buy the no-bake variety. Use sweet muffins for dessert or snacks and corn muffins a a tasty addition to any meal with soup or stew."
        },
        {
          "headline":"Stock up on pasta.",
          "description":"Pasta is easy to store. Use pasta with a variety of herbs and seasonings to create flavorful meals fast."
        },
        {
          "headline":"Include rice when you stock your pantry.",
          "description":"You can buy quick-cook rice to help speed up the cooking time of your meals. Basic white rice can be used in a variety of dishes. It can be eaten for breakfast, lunch, or dinner, which makes it a versatile. Rice with sugar, butter, and milk is a great start to your morning. Use it in stir fry dishes for a light lunch, or combine it with fragrant herbs for an excellent side dish at dinner."
        },
        {
          "headline":"Buy a variety of canned beans.",
          "description":"Canned beans can be used as a standalone side or in other dishes. Ham and beans, chili, and bean soups are great ways to make use of beans for hearty one-pot meals."
        },
        {
          "headline":"Cook with boxed dinners when possible.",
          "description":"There are a variety of dinners that come in boxes with all ingredients included except meat. Just add hamburger or tuna to these boxed meals and you get a full dinner in less than an hour. Boxed meals provide a lot of variety and aren’t expensive, so you save money, save time, and get tasty meals."
        }
      ]
    },
    {
      "name":"Organizing Your Space",
      "steps":[
        {
          "headline":"Utilize the space you have on hand for storage wisely.",
          "description":"Make sure you have ample room to keep the things in stock you will need for storing your foods.It’s a good idea to make a plan for organization. This helps speed up the process when it’s time to find the ingredients you need to prepare a quick meal."
        },
        {
          "headline":"Place taller items in back and shorter items in front.",
          "description":"This lets you quickly spot the items you need without having to rummage around."
        },
        {
          "headline":"Install a labeled spice rack.",
          "description":"This is an effective way to make it easy to spot your herbs and spices without having to pick up each of them and it takes up less space."
        },
        {
          "headline":"Arrange dry goods by type.",
          "description":"Flour, sugar, baking powder, and muffin and cake mixes are baking items. Mashed potatoes, gravy, and packaged pasta sides are savory. Separating these items by type can help speed up the process when you’re preparing meals."
        },
        {
          "headline":"Place packaged items like gravy, mashed potatoes, and mixes in a plastic container and stand them up.",
          "description":"This keeps them from falling all over your pantry and lets you thumb through them when you’re looking for something in particular."
        },
        {
          "headline":"Group similar items together.",
          "description":"It’s easier to go to what you need when you have vegetables together, fruits together, and soups together."
        },
        {
          "headline":"Keep your ingredients in the same place.",
          "description":"Once you’ve created a system for stocking your ingredients, it won’t take you long to get used to where everything is. This will make finding what you need second nature."
        },
        {
          "headline":"Arrange your kitchen for ease of access.",
          "description":"Know where everything is and set up your cooking space so you can grab what you need without having to search for it. An unorganized kitchen can add time to your quick meal preparation."
        }
      ]
    }
  ],
  "text":" Stocking the Basics Look at your herbs and seasonings before you go shopping. Since these items aren’t regularly purchased, it’s easy to forget you need them. Salt, pepper, Italian seasoning, basil, and red pepper flakes are common herbs and seasonings you might want to have on hand. Purchase a variety of oils. Vegetable oil, peanut oil, sesame oil, and olive oil are popular oils to have keep in stock. Each of these can change the flavor of your food and provides a simple way to add variety. If you’re looking for a healthier choice, peanut oil or sunflower oil might be the best option. They also impart unique flavors to the food. Use olive oil in Italian and European style dishes or sesame oil for an Asian flair. Vegetable oil works well for deep frying anything from chicken and fish to French fries. Buy only the bread you will need for a week. Keep the bread tied at all times and keep it sealed in a bread container for extra protection against going stale. Buy a variety of bouillon cubes. Chicken and beef bouillon cubes last for 6 to 12 months and allow you to prepare chicken or beef stocks for healthy, flavorful meals. Stocking Canned Goods Buy a variety of soups. Soups taste good as quick stand-alone meals, but they also go well with sandwiches and can be used in cooking. This makes soup a versatile and convenient item to keep on hand. Store pre-cooked meats like canned ham and sausage. Use pre-cooked meats as a source of protein without having to worry about the cook time of fresh meats. Purchase plenty of canned fruit. There are different types of canned fruit. Canned fruit for baking has the consistency of pie filling. If you want to keep it healthy, avoid heavy syrup and buy canned fruit packed in natural juices or light syrup. Stock your pantry with tuna fish. Tuna fish sandwiches on toast is delicious and healthy. Tuna fish is also a good addition to egg noodles for a delicious casserole. You can purchase tuna fish packed in oil or water, depending on your taste preference. Stocking Dry Goods Stock flour, baking soda, and sugar. These are basic ingredients you can use in desserts and in savory dishes. Purchase large sizes of these ingredients to save money. Buy packaged sides. Gravy, mashed potatoes, and pasta dishes come in handy serving sizes. Use these packaged side dishes for a quick, easy way to round out your meals. Purchase a variety of cake and muffin mixes. Boxed cakes are easy to make, especially if you buy the no-bake variety. Use sweet muffins for dessert or snacks and corn muffins a a tasty addition to any meal with soup or stew. Stock up on pasta. Pasta is easy to store. Use pasta with a variety of herbs and seasonings to create flavorful meals fast. Include rice when you stock your pantry. You can buy quick-cook rice to help speed up the cooking time of your meals. Basic white rice can be used in a variety of dishes. It can be eaten for breakfast, lunch, or dinner, which makes it a versatile. Rice with sugar, butter, and milk is a great start to your morning. Use it in stir fry dishes for a light lunch, or combine it with fragrant herbs for an excellent side dish at dinner. Buy a variety of canned beans. Canned beans can be used as a standalone side or in other dishes. Ham and beans, chili, and bean soups are great ways to make use of beans for hearty one-pot meals. Cook with boxed dinners when possible. There are a variety of dinners that come in boxes with all ingredients included except meat. Just add hamburger or tuna to these boxed meals and you get a full dinner in less than an hour. Boxed meals provide a lot of variety and aren’t expensive, so you save money, save time, and get tasty meals. Organizing Your Space Utilize the space you have on hand for storage wisely. Make sure you have ample room to keep the things in stock you will need for storing your foods.It’s a good idea to make a plan for organization. This helps speed up the process when it’s time to find the ingredients you need to prepare a quick meal. Place taller items in back and shorter items in front. This lets you quickly spot the items you need without having to rummage around. Install a labeled spice rack. This is an effective way to make it easy to spot your herbs and spices without having to pick up each of them and it takes up less space. Arrange dry goods by type. Flour, sugar, baking powder, and muffin and cake mixes are baking items. Mashed potatoes, gravy, and packaged pasta sides are savory. Separating these items by type can help speed up the process when you’re preparing meals. Place packaged items like gravy, mashed potatoes, and mixes in a plastic container and stand them up. This keeps them from falling all over your pantry and lets you thumb through them when you’re looking for something in particular. Group similar items together. It’s easier to go to what you need when you have vegetables together, fruits together, and soups together. Keep your ingredients in the same place. Once you’ve created a system for stocking your ingredients, it won’t take you long to get used to where everything is. This will make finding what you need second nature. Arrange your kitchen for ease of access. Know where everything is and set up your cooking space so you can grab what you need without having to search for it. An unorganized kitchen can add time to your quick meal preparation.",
  "tyn_model":[
    "herbs",
    "soups",
    "gravy",
    "pasta",
    "rice",
    "seasonings",
    "oils",
    "vegetable oil",
    "peanut oil",
    "sesame oil",
    "olive oil",
    "bread",
    "canned fruit",
    "fruit",
    "tuna fish",
    "flour",
    "sugar",
    "potatoes",
    "beans",
    "salt, pepper",
    "italian seasoning",
    "basil",
    "red pepper flakes",
    "sunflower oil",
    "bread container",
    "soup",
    "ham",
    "sausage",
    "tuna fish sandwiches",
    "egg noodles",
    "baking soda",
    "pasta dishes",
    "muffins",
    "corn muffins",
    "white rice",
    "butter",
    "milk",
    "stir fry dishes",
    "canned beans",
    "chili",
    "tuna",
    "spice rack",
    "dry goods",
    "baking powder",
    "muffin and cake mixes",
    "mashed potatoes",
    "mixes",
    "vegetables",
    "fruits"
  ],
  "tyn_section":[

  ]
}