{
  "title":"How to Buy a Circular Saw",
  "url":"https://www.wikihow.com/Buy-a-Circular-Saw",
  "category_hierarchy":[
    "Home and Garden",
    "Tools",
    "Cutting Tools",
    "Manual and Power Saws"
  ],
  "methods":[
    {
      "name":"Choosing the Saw's Features",
      "steps":[
        {
          "headline":"Get a sidewinder if you’re an enthusiast or amateur carpenter.",
          "description":"Most circular saws that you can buy in a big box store are sidewinders. A sidewinder circular saw has the motor on the side of the blade, which means that the trigger is beside the actual blade. A sidewinder offers a high speed in the blade’s RPM, and is more than enough for the casual woodworker or DIY enthusiast."
        },
        {
          "headline":"Opt for a worm-drive circular saw if you want more control and torque.",
          "description":"A worm-drive circular saw has the motor directly behind the blade so that the trigger is directly behind it. A worm-drive generally offers more torque and control when cutting, but tends to be a lot heavier than a sidewinder. Sidewinders are more commonly used for DIY projects, while you’re more likely to find worm-drive saws on a professional construction site."
        },
        {
          "headline":"Get a portable saw if you plan on moving around a lot.",
          "description":"Portable saws use a battery pack that you plug into a wall charger to recharge. Portable circular saws tend to be weaker in terms of RPM, torque, and cutting capability when compared to wired saws, but they’re easier to carry around a workshop or construction site. Choose a portable saw if you really think that you’ll be moving around a lot with your power tools. Select a saw with a cord if it’ll stay in your workshop. Not only will they be cheaper than a portable saw, but the quality of their cuts will be superior."
        },
        {
          "headline":"Choose a saw that makes bevel cuts if you’re cutting angles.",
          "description":"A bevel is used to cut angles into a material. While most circular saws are going to have some kind of bevel function, there are certain saws that offer a greater freedom of movement or control over bevel cuts. If you plan on making a lot of angle cuts, prioritize bevel functionality in a potential saw. A bevel cut refers to any cut you make where the saw blade is not sitting at 90-degree angle in relation to the saw’s shoe. Get a saw with no bevel function if you’re never going to make angle cuts. If you plan on never using a bevel function, you could save quite a bit of money by getting a circular saw with no bevel control."
        },
        {
          "headline":"Select a higher RPM if you know you’ll need the power.",
          "description":"The higher the rotations per minute are, the faster the blade in your saw will spin. This means that a high RPM will make the saw more powerful when it cuts. Consequently, you should prioritize a higher RPM if you plan on cutting a lot of granite, quartz, or tile.Tip: Try to avoid buying a circular saw that spins at anything lower than 4,600 RPM, a saw blade that isn’t spinning fast enough will kickback and get caught on the material that it’s cutting. The average circular saw spins at 5,800 RPM."
        }
      ]
    },
    {
      "name":"Selecting Optional Components",
      "steps":[
        {
          "headline":"Pick an aluminum or magnesium base plate to avoid bending.",
          "description":"You may notice that a lot of cheaper circular saws have steel base plate. If you plan on using your saw frequently, consider getting a saw with an aluminum or magnesium shoe, since steel will bend and get dented over time. They may be a little pricier, but if you want your saw to last, avoid steel base plates. The base plate, or shoe, is the flat surface that holds your saw in place and slides across the top of a material as you cut it. Steel has the added benefit of being bent back if you ever do drop it. If you know your saw is going to get knocked around, steel may actually be better for you since aluminum and magnesium will simply crack if they ever get damaged."
        },
        {
          "headline":"Select a saw with lights built in if you plan on working late.",
          "description":"Some circular saws come with built-in LED bulbs that light up when you pull the trigger. These lights allow you to get a clear picture of where you’re cutting in low-light conditions. If you plan on doing a lot of sawing late at night, or working in rooms with poor natural light, consider getting a saw with a built-in light."
        },
        {
          "headline":"Get a laser cutting guide line if you’re inexperienced.",
          "description":"If you’re a first-time circular saw user, you may want to consider purchasing a circular saw with a laser guide for cutting. The laser guide will make it easier to see where you’re cutting and will light up whenever you pull the trigger on the saw.Tip: You can sometimes attach a laser guide line to a saw even if it isn’t built in."
        },
        {
          "headline":"Buy a saw with a built-in blade wrench if you cut a lot of different materials.",
          "description":"Different materials require different saw blades, which means that you’ll need to switch out a lot of blades if you’re cutting a lot of different stuff. If this sounds like it might be you, look for a circular saw with a built-in blade wrench. A built-in wrench will ensure that you never end up wasting your time looking around for a wrench when it comes time to switch out your saw blade."
        }
      ]
    }
  ],
  "text":" Choosing the Saw's Features Get a sidewinder if you’re an enthusiast or amateur carpenter. Most circular saws that you can buy in a big box store are sidewinders. A sidewinder circular saw has the motor on the side of the blade, which means that the trigger is beside the actual blade. A sidewinder offers a high speed in the blade’s RPM, and is more than enough for the casual woodworker or DIY enthusiast. Opt for a worm-drive circular saw if you want more control and torque. A worm-drive circular saw has the motor directly behind the blade so that the trigger is directly behind it. A worm-drive generally offers more torque and control when cutting, but tends to be a lot heavier than a sidewinder. Sidewinders are more commonly used for DIY projects, while you’re more likely to find worm-drive saws on a professional construction site. Get a portable saw if you plan on moving around a lot. Portable saws use a battery pack that you plug into a wall charger to recharge. Portable circular saws tend to be weaker in terms of RPM, torque, and cutting capability when compared to wired saws, but they’re easier to carry around a workshop or construction site. Choose a portable saw if you really think that you’ll be moving around a lot with your power tools. Select a saw with a cord if it’ll stay in your workshop. Not only will they be cheaper than a portable saw, but the quality of their cuts will be superior. Choose a saw that makes bevel cuts if you’re cutting angles. A bevel is used to cut angles into a material. While most circular saws are going to have some kind of bevel function, there are certain saws that offer a greater freedom of movement or control over bevel cuts. If you plan on making a lot of angle cuts, prioritize bevel functionality in a potential saw. A bevel cut refers to any cut you make where the saw blade is not sitting at 90-degree angle in relation to the saw’s shoe. Get a saw with no bevel function if you’re never going to make angle cuts. If you plan on never using a bevel function, you could save quite a bit of money by getting a circular saw with no bevel control. Select a higher RPM if you know you’ll need the power. The higher the rotations per minute are, the faster the blade in your saw will spin. This means that a high RPM will make the saw more powerful when it cuts. Consequently, you should prioritize a higher RPM if you plan on cutting a lot of granite, quartz, or tile.Tip: Try to avoid buying a circular saw that spins at anything lower than 4,600 RPM, a saw blade that isn’t spinning fast enough will kickback and get caught on the material that it’s cutting. The average circular saw spins at 5,800 RPM. Selecting Optional Components Pick an aluminum or magnesium base plate to avoid bending. You may notice that a lot of cheaper circular saws have steel base plate. If you plan on using your saw frequently, consider getting a saw with an aluminum or magnesium shoe, since steel will bend and get dented over time. They may be a little pricier, but if you want your saw to last, avoid steel base plates. The base plate, or shoe, is the flat surface that holds your saw in place and slides across the top of a material as you cut it. Steel has the added benefit of being bent back if you ever do drop it. If you know your saw is going to get knocked around, steel may actually be better for you since aluminum and magnesium will simply crack if they ever get damaged. Select a saw with lights built in if you plan on working late. Some circular saws come with built-in LED bulbs that light up when you pull the trigger. These lights allow you to get a clear picture of where you’re cutting in low-light conditions. If you plan on doing a lot of sawing late at night, or working in rooms with poor natural light, consider getting a saw with a built-in light. Get a laser cutting guide line if you’re inexperienced. If you’re a first-time circular saw user, you may want to consider purchasing a circular saw with a laser guide for cutting. The laser guide will make it easier to see where you’re cutting and will light up whenever you pull the trigger on the saw.Tip: You can sometimes attach a laser guide line to a saw even if it isn’t built in. Buy a saw with a built-in blade wrench if you cut a lot of different materials. Different materials require different saw blades, which means that you’ll need to switch out a lot of blades if you’re cutting a lot of different stuff. If this sounds like it might be you, look for a circular saw with a built-in blade wrench. A built-in wrench will ensure that you never end up wasting your time looking around for a wrench when it comes time to switch out your saw blade.",
  "tyn_model":[
    "saw",
    "circular saw",
    "circular saws",
    "saw blade",
    "sidewinder",
    "laser guide",
    "worm-drive",
    "sidewinders",
    "worm-drive saws",
    "steel",
    "laser cutting guide line",
    "laser guide line",
    "saw blades"
  ],
  "tyn_section":[

  ]
}