{
  "title":"How to Fight a Forest Fire",
  "url":"https://www.wikihow.com/Fight-a-Forest-Fire",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "methods":[
    {
      "name":"Encountering a Wild Fire",
      "steps":[
        {
          "headline":"Contact emergency services.",
          "description":"Anytime you encounter an unattended or out-of-control fire, contact the emergency services in your area. Provide as many details as you can, such as your specific location (including landmarks) and the size of the fire. If you are in the US, dial 9-1-1."
        },
        {
          "headline":"Cover your mouth.",
          "description":"Inhaling carbon monoxide from a fire can be extremely hazardous. If you should encounter a fire, cover your mouth and nose immediately. Use a sweatshirt, scarf, or other material. If you have water available, make the fabric damp. Keep your face pointed down, and keep yourself close to the ground."
        },
        {
          "headline":"Get yourself to safety.",
          "description":"Get as far away as possible from the fire. Ideally, get into a vehicle and drive away from the fire. If you are on foot, head for non-flammable terrain, such as a road or body of water. If the fire is very close, attempt to find shelter in a building, vehicle, body of water, or low area of ground (like a ditch). If you are in the midst of a blaze, do not run. Instead, submerge yourself in a body of water or lay in a low ditch. Wait for the blaze to pass, and then evacuate. Dampen your clothes and/or cover yourself with mud or soil to protect yourself from the heat."
        },
        {
          "headline":"Evacuate your home.",
          "description":"If a wildfire is near, you may be asked to evacuate your home. Prepare your house to reduce fire damage, and make sure that all members of your family evacuate safely. Try not to worry about personal possessions. Almost anything can be replaced. When it is time to evacuate, be sure to:\nWear protective clothing, such as sturdy shoes, cotton/wool clothing, jeans, a long-sleeved shirt, gloves, and a scarf or handkerchief to protect your face. Make sure children and elderly people get to safety first. Evacuate any pets. Close all doors and windows. Turn off your gas. Open your fireplace damper, but close the screen. Grab your important papers."
        }
      ]
    },
    {
      "name":"Fighting a Forest Fire as a Professional",
      "steps":[
        {
          "headline":"Take a course in fire science.",
          "description":"If you are interested in fighting wilderness fires, become certified to do so. Understanding how fire behaves, grasping the ways that meteorology and geography affect fires, and learning about wilderness fire suppression tactics will enable you to fight fires. Contact your local colleges, universities, fire departments, and national parks to find courses. Firefighters in your city, or staff at a local wildlife area, may offer tutorials on firefighting and prevention. If you are certified, you may be able to work or volunteer as a wilderness firefighter."
        },
        {
          "headline":"Allow fires to burn.",
          "description":"Fire is a natural part of the lifecycle of the forest, so in many instances, emergency agencies will simply monitor a fire while it burns. When a forest fire threatens structures, property, or people, emergency agencies will usually intervene to contain it."
        },
        {
          "headline":"Create a fireline.",
          "description":"In order to contain fires and protect property, many emergency agencies will create what is called a fireline. This is accomplished by doing a controlled burn around the perimeter of a forest fire. A controlled burn will allow you to cut off the fuel source of the larger fire by already burning off the dry plants. A fireline removes the fuel component of the fire. This method is considered an indirect attack on the fire."
        },
        {
          "headline":"Use water as a fire suppression tool.",
          "description":"When fire crews arrive at a forest fire, they set up power pumps at the closest water source that they can find, and then they run their hoses to the fire. Other times fire may be brought in via tanker or helibucket. Firefighters often use water to create a fireline, soaking up the perimeter of the fire, and preventing future spreading."
        },
        {
          "headline":"Deploy suppressant foam.",
          "description":"Depressant foam is used as an alternative water, to create fire lines and/or suppress fire. Just like water, this foam can be applied from the ground or from the air. Whether you use an aerial or a ground application, suppressant foam can help you extinguish your fires faster by acting as an insulated barrier to keep unburned fuels from being ignited. The bubble structure of the foam also gives you a slower, more controlled water drainage, which helps you penetrate better and longer into the fuel sources."
        },
        {
          "headline":"Use natural barriers to slow the spread of fires.",
          "description":"Areas like rivers, lakes, roads, swamps and rocky areas can be a natural ending spot for a fire so that you can concentrate on tackling other sides. All fire suppression activities are based from an anchor point, which is often one of these spots. The likelihood of the fire reaching this area is lower than average, so these area can act as base camps for firefighters."
        }
      ]
    },
    {
      "name":"Preventing Forest Fires",
      "steps":[
        {
          "headline":"Prepare your home in advance.",
          "description":"If you live in an area prone to fire danger, you must take steps to prepare for a wildfire ahead of time. Make sure that your home is ready in the event of a wildfire nearby. Make a fire plan for your family. Create a 30-foot radius “safe zone” around your house by removing brush and keeping your lawn short. Clear all combustibles from the area, such as firewood, propane grills, and chemicals. Remove debris from gutters, and under decks and porches. Use fire-safe siding on your home. Fill swimming pools with water."
        },
        {
          "headline":"Pay attention to fire warnings in your area.",
          "description":"The National Weather Service has great technology that detects where fires are likely to occur. If you're out camping, take note of any warnings issued and/or fire forecasts for your area. Some common warning include:\nRed Flag Warning: This is issued when existing environmental conditions combined with expected weather conditions could result in fires starting within the next 24 hours. Fire Weather Watch: This is issued when Red Flag conditions are expected to arise within the next 3 days."
        },
        {
          "headline":"Follow the regulations in your area.",
          "description":"Before you burn anything near your home, contact your local fire department to find out what kind of burning is allowed in your area (if any). Also, find out whether a permit is required to burn debris. If burning is allowed in your area, follow these standard guidelines:\nCheck the weather forecast. If it is particularly windy in your area, it may not be advisable to start any type of fire. Prepare the site correctly. Make sure the area where you'll be burning your fire is surrounded by dirt or gravel for ten feet or more in each direction. Keep the surrounding area watered down while the fire is active. Remain with your fire until it is completely out. To ensure the fire has been completely extinguished, pour water over it. Use a shovel to lift and turn over the ashes, then pour another fresh bucket of water on it. Repeat this a few more times."
        },
        {
          "headline":"Exercise campfire safety.",
          "description":"Having a bonfire can be an absolute blast, but if done unsafely, it can result in serious damage. Make sure to exercise logic and caution when having a campfire. Do not build a fire at a site during hazardous, dry conditions. Do not build a fire if the campground prohibits it. Do not build a fire if there is not an existing fire pit. If pits are allowed, look for a site that is at least fifteen feet away from tent walls, shrubs, trees or other flammable objects. Beware of low-hanging branches overhead."
        },
        {
          "headline":"Extinguish all fires completely.",
          "description":"Before you go to bed or leave the area, make sure that all fires have been put out. Douse your fire liberally with water until it is cool. Remember: If it's too hot to touch, it's too hot to leave!"
        }
      ]
    }
  ],
  "text":" Encountering a Wild Fire Contact emergency services. Anytime you encounter an unattended or out-of-control fire, contact the emergency services in your area. Provide as many details as you can, such as your specific location (including landmarks) and the size of the fire. If you are in the US, dial 9-1-1. Cover your mouth. Inhaling carbon monoxide from a fire can be extremely hazardous. If you should encounter a fire, cover your mouth and nose immediately. Use a sweatshirt, scarf, or other material. If you have water available, make the fabric damp. Keep your face pointed down, and keep yourself close to the ground. Get yourself to safety. Get as far away as possible from the fire. Ideally, get into a vehicle and drive away from the fire. If you are on foot, head for non-flammable terrain, such as a road or body of water. If the fire is very close, attempt to find shelter in a building, vehicle, body of water, or low area of ground (like a ditch). If you are in the midst of a blaze, do not run. Instead, submerge yourself in a body of water or lay in a low ditch. Wait for the blaze to pass, and then evacuate. Dampen your clothes and/or cover yourself with mud or soil to protect yourself from the heat. Evacuate your home. If a wildfire is near, you may be asked to evacuate your home. Prepare your house to reduce fire damage, and make sure that all members of your family evacuate safely. Try not to worry about personal possessions. Almost anything can be replaced. When it is time to evacuate, be sure to:\nWear protective clothing, such as sturdy shoes, cotton/wool clothing, jeans, a long-sleeved shirt, gloves, and a scarf or handkerchief to protect your face. Make sure children and elderly people get to safety first. Evacuate any pets. Close all doors and windows. Turn off your gas. Open your fireplace damper, but close the screen. Grab your important papers. Fighting a Forest Fire as a Professional Take a course in fire science. If you are interested in fighting wilderness fires, become certified to do so. Understanding how fire behaves, grasping the ways that meteorology and geography affect fires, and learning about wilderness fire suppression tactics will enable you to fight fires. Contact your local colleges, universities, fire departments, and national parks to find courses. Firefighters in your city, or staff at a local wildlife area, may offer tutorials on firefighting and prevention. If you are certified, you may be able to work or volunteer as a wilderness firefighter. Allow fires to burn. Fire is a natural part of the lifecycle of the forest, so in many instances, emergency agencies will simply monitor a fire while it burns. When a forest fire threatens structures, property, or people, emergency agencies will usually intervene to contain it. Create a fireline. In order to contain fires and protect property, many emergency agencies will create what is called a fireline. This is accomplished by doing a controlled burn around the perimeter of a forest fire. A controlled burn will allow you to cut off the fuel source of the larger fire by already burning off the dry plants. A fireline removes the fuel component of the fire. This method is considered an indirect attack on the fire. Use water as a fire suppression tool. When fire crews arrive at a forest fire, they set up power pumps at the closest water source that they can find, and then they run their hoses to the fire. Other times fire may be brought in via tanker or helibucket. Firefighters often use water to create a fireline, soaking up the perimeter of the fire, and preventing future spreading. Deploy suppressant foam. Depressant foam is used as an alternative water, to create fire lines and/or suppress fire. Just like water, this foam can be applied from the ground or from the air. Whether you use an aerial or a ground application, suppressant foam can help you extinguish your fires faster by acting as an insulated barrier to keep unburned fuels from being ignited. The bubble structure of the foam also gives you a slower, more controlled water drainage, which helps you penetrate better and longer into the fuel sources. Use natural barriers to slow the spread of fires. Areas like rivers, lakes, roads, swamps and rocky areas can be a natural ending spot for a fire so that you can concentrate on tackling other sides. All fire suppression activities are based from an anchor point, which is often one of these spots. The likelihood of the fire reaching this area is lower than average, so these area can act as base camps for firefighters. Preventing Forest Fires Prepare your home in advance. If you live in an area prone to fire danger, you must take steps to prepare for a wildfire ahead of time. Make sure that your home is ready in the event of a wildfire nearby. Make a fire plan for your family. Create a 30-foot radius “safe zone” around your house by removing brush and keeping your lawn short. Clear all combustibles from the area, such as firewood, propane grills, and chemicals. Remove debris from gutters, and under decks and porches. Use fire-safe siding on your home. Fill swimming pools with water. Pay attention to fire warnings in your area. The National Weather Service has great technology that detects where fires are likely to occur. If you're out camping, take note of any warnings issued and/or fire forecasts for your area. Some common warning include:\nRed Flag Warning: This is issued when existing environmental conditions combined with expected weather conditions could result in fires starting within the next 24 hours. Fire Weather Watch: This is issued when Red Flag conditions are expected to arise within the next 3 days. Follow the regulations in your area. Before you burn anything near your home, contact your local fire department to find out what kind of burning is allowed in your area (if any). Also, find out whether a permit is required to burn debris. If burning is allowed in your area, follow these standard guidelines:\nCheck the weather forecast. If it is particularly windy in your area, it may not be advisable to start any type of fire. Prepare the site correctly. Make sure the area where you'll be burning your fire is surrounded by dirt or gravel for ten feet or more in each direction. Keep the surrounding area watered down while the fire is active. Remain with your fire until it is completely out. To ensure the fire has been completely extinguished, pour water over it. Use a shovel to lift and turn over the ashes, then pour another fresh bucket of water on it. Repeat this a few more times. Exercise campfire safety. Having a bonfire can be an absolute blast, but if done unsafely, it can result in serious damage. Make sure to exercise logic and caution when having a campfire. Do not build a fire at a site during hazardous, dry conditions. Do not build a fire if the campground prohibits it. Do not build a fire if there is not an existing fire pit. If pits are allowed, look for a site that is at least fifteen feet away from tent walls, shrubs, trees or other flammable objects. Beware of low-hanging branches overhead. Extinguish all fires completely. Before you go to bed or leave the area, make sure that all fires have been put out. Douse your fire liberally with water until it is cool. Remember: If it's too hot to touch, it's too hot to leave!",
  "tyn_model":[
    "water",
    "fire",
    "scarf",
    "suppressant foam",
    "9-1-1. cover",
    "carbon monoxide",
    "mud",
    "gloves",
    "fireplace",
    "fire science",
    "fires",
    "wilderness firefighter",
    "fireline",
    "depressant foam",
    "foam",
    "fire suppression",
    "“safe",
    "” around",
    "propane grills",
    "shovel",
    "campfire safety",
    "bonfire",
    "campfire"
  ],
  "tyn_section":[

  ]
}