{
  "title":"How to Write a Video Game Review",
  "url":"https://www.wikihow.com/Write-a-Video-Game-Review",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "parts":[
    {
      "name":"Playing the Game and Taking Notes",
      "steps":[
        {
          "headline":"Play the game for 7 to 10 hours.",
          "description":"Many video games can take upwards of 100 hours to complete. However, most publications expect a review within 1 week of the game being released. Try to play the video game that you are reviewing for at least 7 hours to get a feel for it. Explore as much of the game as you can in this timeframe. If the game has different levels, try to level up as many times as possible. If the game is an open world, explore as much of it as you can."
        },
        {
          "headline":"Take notes on what you appreciate about the game.",
          "description":"Your notes will translate directly into what you put in your review. Use a computer or a notebook to write down what you like about the game. Pay attention to playability, sound, graphics, and in-game purchases. Jot down anything that sticks out to you, even if it is small. Details as small as the trees waving in the wind or a character’s headband can help a reader envision the in-game world when they read your review."
        },
        {
          "headline":"Write down what could be improved about the game.",
          "description":"Not every game is perfect, and your review should focus on the improvements that you think could be made as well as the positives. Take note of what you didn’t love about the game. Maybe the graphics are clunky, or the load times are too long. If anything annoys you even slightly, be sure to write it down.Tip: Try to be specific. Instead of writing “The main character sucks!” try, “The main character didn’t have as many weapon options as I would have liked.” This will be helpful when you start writing."
        },
        {
          "headline":"Note how the game compares to other games like it.",
          "description":"You’ve probably played a lot of video games that could be comparable to the one you are reviewing. Think about games that are in the same genre as the one you are playing. Is it an action-based game? A horror game? A racing one? Then, think about which ones you liked better or worse. Would you play this one more or less than other games? For example, you could say, “This racing game has more car model options, but less customizable pieces than their last release.”"
        }
      ]
    },
    {
      "name":"Compiling Your Notes into a Review",
      "steps":[
        {
          "headline":"Aim to write about 1,000 words in your review.",
          "description":"If you are submitting your review to a gaming site, they will most likely want between 800 and 1,000 words in your review. Indie games or mobile apps can be on the lower end, while popular games should be more in-depth and closer to 1,000 words.Tip: If you are publishing a video game review on your own website or blog, you can choose your word count. However, your readers will probably appreciate a comprehensive review."
        },
        {
          "headline":"Start with a 2 to 3 sentence introduction.",
          "description":"Your readers may have heard about the game you are playing, or it could be brand new to them. Introduce the game that you are reviewing without giving away too much about the story itself. Open with a hook to grab your readers’ attention and make them want to read the rest of your review. For example, say something like, “After the success of Injustice, the newest game from the NetherRealm Studios is Mortal Kombat X. With this installment in the MK series, Nether Realm has mended all the shortcomings that Injustice had and added so much more. MK X is by far the best MK game we have seen in the series.”"
        },
        {
          "headline":"Discuss the quality of the sound and graphics.",
          "description":"Refer back to your notes to identify what you liked or disliked about the sound and the graphics of the game. Go into detail about what system you were using and how well the game translated through that. Note if you were wearing headphones or using speakers and if the game was displayed on a TV or computer. For example, “The movements of the characters and flair with which the executions and bonus moves are performed are one of the best we’ve ever seen. The blood and gore of MK coupled with the next generation graphics truly delivers an experience like no other.”"
        },
        {
          "headline":"Write about the story and the characters.",
          "description":"If the video game you are writing about is a series, it may continue old characters or introduce new ones. Be sure to talk about the characters that you can play as and who you interact with the most throughout the game. Describe the different actions and weapons options that each character provides. For example, “This game breathes fresh air into the market by offering characters who each have a different playing style, offering you the opportunity to learn the combo moves of each character.”"
        },
        {
          "headline":"Note your personal opinion on the game.",
          "description":"Make sure to inject your own opinion on the game into your review. Let your readers know if you’d recommend the game or not and what you’d tell the developers if you could. You can give it a numerical rating if you’d like to make it easy to understand. For example, “I certainly advise you to go pick yourself up a copy of this game. It might just be the best fighting game to come out in 2016. I rate it 8.8/10.”"
        },
        {
          "headline":"Proofread your review for any errors before you submit it.",
          "description":"If you are submitting your review to a video game magazine or publication, take a few minutes to look over your work and check for errors. Your review will most likely get edited before it is published, but it will be taken more seriously if it does not have many glaring errors. Check for spelling, grammar, and flow of your words. Your review may get sent back to you by an editor if it needs to be changed."
        }
      ]
    }
  ],
  "text":" Playing the Game and Taking Notes Play the game for 7 to 10 hours. Many video games can take upwards of 100 hours to complete. However, most publications expect a review within 1 week of the game being released. Try to play the video game that you are reviewing for at least 7 hours to get a feel for it. Explore as much of the game as you can in this timeframe. If the game has different levels, try to level up as many times as possible. If the game is an open world, explore as much of it as you can. Take notes on what you appreciate about the game. Your notes will translate directly into what you put in your review. Use a computer or a notebook to write down what you like about the game. Pay attention to playability, sound, graphics, and in-game purchases. Jot down anything that sticks out to you, even if it is small. Details as small as the trees waving in the wind or a character’s headband can help a reader envision the in-game world when they read your review. Write down what could be improved about the game. Not every game is perfect, and your review should focus on the improvements that you think could be made as well as the positives. Take note of what you didn’t love about the game. Maybe the graphics are clunky, or the load times are too long. If anything annoys you even slightly, be sure to write it down.Tip: Try to be specific. Instead of writing “The main character sucks!” try, “The main character didn’t have as many weapon options as I would have liked.” This will be helpful when you start writing. Note how the game compares to other games like it. You’ve probably played a lot of video games that could be comparable to the one you are reviewing. Think about games that are in the same genre as the one you are playing. Is it an action-based game? A horror game? A racing one? Then, think about which ones you liked better or worse. Would you play this one more or less than other games? For example, you could say, “This racing game has more car model options, but less customizable pieces than their last release.” Compiling Your Notes into a Review Aim to write about 1,000 words in your review. If you are submitting your review to a gaming site, they will most likely want between 800 and 1,000 words in your review. Indie games or mobile apps can be on the lower end, while popular games should be more in-depth and closer to 1,000 words.Tip: If you are publishing a video game review on your own website or blog, you can choose your word count. However, your readers will probably appreciate a comprehensive review. Start with a 2 to 3 sentence introduction. Your readers may have heard about the game you are playing, or it could be brand new to them. Introduce the game that you are reviewing without giving away too much about the story itself. Open with a hook to grab your readers’ attention and make them want to read the rest of your review. For example, say something like, “After the success of Injustice, the newest game from the NetherRealm Studios is Mortal Kombat X. With this installment in the MK series, Nether Realm has mended all the shortcomings that Injustice had and added so much more. MK X is by far the best MK game we have seen in the series.” Discuss the quality of the sound and graphics. Refer back to your notes to identify what you liked or disliked about the sound and the graphics of the game. Go into detail about what system you were using and how well the game translated through that. Note if you were wearing headphones or using speakers and if the game was displayed on a TV or computer. For example, “The movements of the characters and flair with which the executions and bonus moves are performed are one of the best we’ve ever seen. The blood and gore of MK coupled with the next generation graphics truly delivers an experience like no other.” Write about the story and the characters. If the video game you are writing about is a series, it may continue old characters or introduce new ones. Be sure to talk about the characters that you can play as and who you interact with the most throughout the game. Describe the different actions and weapons options that each character provides. For example, “This game breathes fresh air into the market by offering characters who each have a different playing style, offering you the opportunity to learn the combo moves of each character.” Note your personal opinion on the game. Make sure to inject your own opinion on the game into your review. Let your readers know if you’d recommend the game or not and what you’d tell the developers if you could. You can give it a numerical rating if you’d like to make it easy to understand. For example, “I certainly advise you to go pick yourself up a copy of this game. It might just be the best fighting game to come out in 2016. I rate it 8.8/10.” Proofread your review for any errors before you submit it. If you are submitting your review to a video game magazine or publication, take a few minutes to look over your work and check for errors. Your review will most likely get edited before it is published, but it will be taken more seriously if it does not have many glaring errors. Check for spelling, grammar, and flow of your words. Your review may get sent back to you by an editor if it needs to be changed.",
  "tyn_model":[
    "video game",
    "“the",
    "“this",
    "computer",
    "notebook",
    "” try",
    "” this",
    "video games",
    "” compiling",
    "’ attention",
    "“after",
    "mortal kombat x.",
    "nether realm",
    "” discuss",
    "mk",
    "” write",
    "” note",
    "“i",
    "” proofread",
    "video game magazine"
  ],
  "tyn_section":[

  ]
}