{
  "title":"How to Choose and Slice a Pineapple",
  "url":"https://www.wikihow.com/Choose-and-Slice-a-Pineapple",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Pineapple"
  ],
  "steps":[
    {
      "headline":"Examine the pineapples in the produce section.",
      "description":"Pineapples are harvested when they are at peak sweetness and do not ripen once picked. When shopping for a pineapple, look for sturdy, green leaves rather than dry, brown ones. The quality of the pineapple will decline over time, so choose the freshest fruit available. The pineapple should feel firm and have just a little give. The base should smell fruity, bright, and sweet. Avoid pineapples that look dehydrated, have soft spots, or have bruises."
    },
    {
      "headline":"Remove the top leaves, commonly known as the crown.",
      "description":"There are 2 ways you can go about this. One is to grab all of the leaves in your hand and twist them, using some force, to remove them. The other is to lay the pineapple down on a cutting board and use your knife to cut them off. Throw the crown away."
    },
    {
      "headline":"Cut off the bottom of the pineapple.",
      "description":"Lay the pineapple on its side on a cutting board. Use a knife to cut the base of the pineapple off, while holding the fruit firmly. Toss the part you cut off in the trash."
    },
    {
      "headline":"Remove the pineapple center, or core.",
      "description":"There are specialty tools called pineapple corers that can easily remove the core of the pineapple with little to no effort. Place the pineapple upright, put the corer even with the center of the pineapple and push down with force while turning the corer until you reach the bottom of the pineapple. Pull the corer up and out of the pineapple to remove the core. Throw the core away. If you do not have a pineapple corer, move onto removing the pineapple skin."
    },
    {
      "headline":"Slice off the skin of the pineapple.",
      "description":"With the pineapple still in an upright position, use a kitchen knife to cut the skin off the pineapple in thin slices. After you remove all of the skin, you might notice some brown 'eyes' still left on the pineapple. Take a paring knife and carefully remove these brown spots."
    },
    {
      "headline":"Decide which shape of pineapple pieces you prefer.",
      "description":"You can choose to cut pieces or pineapple rings. If you prefer pineapple rings, lay the pineapple on its side and slice the pineapple. How thick you cut the slices is up to you. If you have not already removed the core, take your paring knife and carefully cut the core out of each pineapple slice. If you want pineapple pieces, cut the pineapple into manageable wedges. If you have not already removed the core, slice the core away from the center of each wedge, and slice each wedge into the desired tsize."
    }
  ],
  "text":" Examine the pineapples in the produce section. Pineapples are harvested when they are at peak sweetness and do not ripen once picked. When shopping for a pineapple, look for sturdy, green leaves rather than dry, brown ones. The quality of the pineapple will decline over time, so choose the freshest fruit available. The pineapple should feel firm and have just a little give. The base should smell fruity, bright, and sweet. Avoid pineapples that look dehydrated, have soft spots, or have bruises. Remove the top leaves, commonly known as the crown. There are 2 ways you can go about this. One is to grab all of the leaves in your hand and twist them, using some force, to remove them. The other is to lay the pineapple down on a cutting board and use your knife to cut them off. Throw the crown away. Cut off the bottom of the pineapple. Lay the pineapple on its side on a cutting board. Use a knife to cut the base of the pineapple off, while holding the fruit firmly. Toss the part you cut off in the trash. Remove the pineapple center, or core. There are specialty tools called pineapple corers that can easily remove the core of the pineapple with little to no effort. Place the pineapple upright, put the corer even with the center of the pineapple and push down with force while turning the corer until you reach the bottom of the pineapple. Pull the corer up and out of the pineapple to remove the core. Throw the core away. If you do not have a pineapple corer, move onto removing the pineapple skin. Slice off the skin of the pineapple. With the pineapple still in an upright position, use a kitchen knife to cut the skin off the pineapple in thin slices. After you remove all of the skin, you might notice some brown 'eyes' still left on the pineapple. Take a paring knife and carefully remove these brown spots. Decide which shape of pineapple pieces you prefer. You can choose to cut pieces or pineapple rings. If you prefer pineapple rings, lay the pineapple on its side and slice the pineapple. How thick you cut the slices is up to you. If you have not already removed the core, take your paring knife and carefully cut the core out of each pineapple slice. If you want pineapple pieces, cut the pineapple into manageable wedges. If you have not already removed the core, slice the core away from the center of each wedge, and slice each wedge into the desired tsize.",
  "tyn_model":[
    "pineapple",
    "pineapples",
    "cutting board",
    "knife",
    "paring knife",
    "pineapple rings",
    "fruit",
    "pineapple corers",
    "pineapple corer",
    "kitchen knife"
  ],
  "tyn_section":[

  ]
}