{
  "title":"How to Install Wainscoting",
  "url":"https://www.wikihow.com/Install-Wainscoting",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Walls and Ceilings",
    "Interior Walls"
  ],
  "methods":[
    {
      "name":"Installing Pre-Cut Panels",
      "steps":[
        {
          "headline":"Prepare the area for installation.",
          "description":"Remove existing baseboards, chair rails or skirt moldings. You should also remove outlet plates. Measure the linear footage of the room or wall with a tape measure in order to determine the number of panels you will need to purchase. Allow wood wainscot panels to acclimate in the room where they will be installed for at least 48 hours. This will prevent expansion and contraction of the paneling from occurring after installation."
        },
        {
          "headline":"Mark the top level line.",
          "description":"Establish a level line around the room for the top of the panels. Measure the appropriate height of the panels, up from the floor, and using a level as a straight edge, lightly pencil a guideline on each wall. A laser level will make this easiest."
        },
        {
          "headline":"Mark the studs.",
          "description":"Use a stud finder tool, or gently tap the wall with a hammer, to locate the wall studs and mark them just above the level line."
        },
        {
          "headline":"Glue and nail the panels from left to right.",
          "description":"Apply construction adhesive to the back of a full panel and set it into place beginning in the corner of the room. Ensure the top of the panel is flush with your level line. Hold the panel in place and secure it with paneling nails. Try to anchor the molding into the marked wall studs whenever possible. Continue installing panels in the same manner, leaving 1/16 inch (2.54 cm) of space between each panel, until you arrive at the next corner. The bottom of a piece can be sanded down or trimmed if there is variation in the floor and the piece will not fit. However, you should double check that the top level line was made correctly. You will need to cut a hole for an outlet when you see that a panel will cover one. Cover the outlet in brightly colored chalk, line up the panel, press the panel into the chalk to get your outline, and then cut out the shape with a jigsaw."
        },
        {
          "headline":"Cut custom pieces as necessary.",
          "description":"Measure and cut the final panel with a jigsaw to accommodate the appropriate length of the wall."
        },
        {
          "headline":"Install the baseboard and upper moldings.",
          "description":"Ensure the molding is flush and level with the top of the wainscoting. Again, secure each piece to a wall stud when possible."
        }
      ]
    },
    {
      "name":"Creating Your Own Panels",
      "steps":[
        {
          "headline":"Gather your materials.",
          "description":"You'll need 1/4\" plywood for the back panels, 1x4 lumber for the stiles, 1x6 lumber for the baseboard, and 1x2 lumber for the rails. You'll need to rent a circular saw from your local big box hardware store to cut the lumber and panels to size. A laser lever, scrap wood for stile spacing, stud finder, pneumatic nail gun with 2.5\" and 1.5\" finishing nails, and other tools can also be helpful."
        },
        {
          "headline":"Prepare the area for installation.",
          "description":"Remove existing baseboards, chair rails or skirt moldings. You should also remove outlet plates. Measure the linear footage of the room or wall with a tape measure in order to determine how much wood you will need. Allow wood to acclimate in the room where it will be installed for at least 48 hours. This will prevent expansion and contraction of the paneling from occurring after installation."
        },
        {
          "headline":"Mark the top level line.",
          "description":"Establish a level line around the room for the top of the panels. Measure the height of the room, divide that by 3, and create your panels to reach that height or close to it. Once you've calculated the height, draw and then mark (with painter's tape works best) a level line around the room. A laser level will make this easiest. You may want to try to place the top edge of the panel just a little higher than the panel really is if you know that your floor is uneven. This will keep down the amount of trimming you need to do. Shoe molding can always be placed at the bottom to hide gaps that occur with an uneven floor."
        },
        {
          "headline":"Mark the studs and utility lines.",
          "description":"Use a stud finder tool, or gently tap the wall with a hammer, to locate the wall studs and mark them just above the level line. If you can locate the utility lines, you should mark those on the wall as well, to help avoid hitting them with nails. Utility lines are often found around water sources or immediately next to the studs closest to outlets and wall lights. Be careful when nailing in these areas."
        },
        {
          "headline":"Plan out your spacing.",
          "description":"The size and orientation of your room will determine what your paneling looks like, so specific measurements unfortunately cannot be given. There are a few basic guidelines you should follow though, in order to figure out where everything should go:\nTry to get at least a few stiles placed over a stud. This will help seal your panel to the wall. Don't place a stile over an outlet or other unusual feature. This will only create more cutting and measuring for you. Try to line up your stiles to cover gaps between panels, helping to hide the seam. Set the spacing of your stiles in a way that looks good for the size of room you have. The smaller the room, the further apart the stiles should be. Larger rooms can be spaced the same as studs: 16\" center-to-center."
        },
        {
          "headline":"Attach your panels.",
          "description":"Add construction adhesive to the backs of the panels and place them on the wall, staring at the corner and covering the longest wall first. Line the top of the panel up with your level line and secure the panels into the studs with a pneumatic nail gun and 1.5\" finish nails (should be placed at the top and bottom, so that they will be hidden by the rail and baseboard). Go around the room until all of the panels are placed. You will need to cut a hole for an outlet when you see that a panel will cover one. Cover the outlet in brightly colored chalk, line up the panel, press the panel into the chalk to get your outline, and then cut out the shape with a jigsaw."
        },
        {
          "headline":"Attach your top rail.",
          "description":"Line up the 1x2 rails so that they are flush with the top of the panels and then nail them into place with 2.5\" finish nails. These should also be nailed into studs whenever possible."
        },
        {
          "headline":"Attach your stiles.",
          "description":"Next, glue and nail the stiles in place exactly how you attached the top rail. Start with two stiles at the corner of the room, and then use the spacer at the top and then again at the bottom as you nail the two ends into place. Use a carefully cut piece of scrap wood as a spacer and a laser or normal level to make sure the stiles are nailed in as straight as possible."
        },
        {
          "headline":"Attach your baseboard and shoe molding.",
          "description":"Next attach the baseboard the same way you attach the the stiles and top rail. Don't worry about any gaps left at the bottom by uneven floors: that will be covered up by shoe molding which goes up last. You can also add molding at the top to cover uneven rails and paneling or just use a flat piece if you want a usable ledge."
        },
        {
          "headline":"Add finishing touches.",
          "description":"Sand the completed wood surface, cover any nails with a nail crayon, and then paint or stain the wood as desired. Enjoy your new wainscoting!"
        }
      ]
    }
  ],
  "text":" Installing Pre-Cut Panels Prepare the area for installation. Remove existing baseboards, chair rails or skirt moldings. You should also remove outlet plates. Measure the linear footage of the room or wall with a tape measure in order to determine the number of panels you will need to purchase. Allow wood wainscot panels to acclimate in the room where they will be installed for at least 48 hours. This will prevent expansion and contraction of the paneling from occurring after installation. Mark the top level line. Establish a level line around the room for the top of the panels. Measure the appropriate height of the panels, up from the floor, and using a level as a straight edge, lightly pencil a guideline on each wall. A laser level will make this easiest. Mark the studs. Use a stud finder tool, or gently tap the wall with a hammer, to locate the wall studs and mark them just above the level line. Glue and nail the panels from left to right. Apply construction adhesive to the back of a full panel and set it into place beginning in the corner of the room. Ensure the top of the panel is flush with your level line. Hold the panel in place and secure it with paneling nails. Try to anchor the molding into the marked wall studs whenever possible. Continue installing panels in the same manner, leaving 1/16 inch (2.54 cm) of space between each panel, until you arrive at the next corner. The bottom of a piece can be sanded down or trimmed if there is variation in the floor and the piece will not fit. However, you should double check that the top level line was made correctly. You will need to cut a hole for an outlet when you see that a panel will cover one. Cover the outlet in brightly colored chalk, line up the panel, press the panel into the chalk to get your outline, and then cut out the shape with a jigsaw. Cut custom pieces as necessary. Measure and cut the final panel with a jigsaw to accommodate the appropriate length of the wall. Install the baseboard and upper moldings. Ensure the molding is flush and level with the top of the wainscoting. Again, secure each piece to a wall stud when possible. Creating Your Own Panels Gather your materials. You'll need 1/4\" plywood for the back panels, 1x4 lumber for the stiles, 1x6 lumber for the baseboard, and 1x2 lumber for the rails. You'll need to rent a circular saw from your local big box hardware store to cut the lumber and panels to size. A laser lever, scrap wood for stile spacing, stud finder, pneumatic nail gun with 2.5\" and 1.5\" finishing nails, and other tools can also be helpful. Prepare the area for installation. Remove existing baseboards, chair rails or skirt moldings. You should also remove outlet plates. Measure the linear footage of the room or wall with a tape measure in order to determine how much wood you will need. Allow wood to acclimate in the room where it will be installed for at least 48 hours. This will prevent expansion and contraction of the paneling from occurring after installation. Mark the top level line. Establish a level line around the room for the top of the panels. Measure the height of the room, divide that by 3, and create your panels to reach that height or close to it. Once you've calculated the height, draw and then mark (with painter's tape works best) a level line around the room. A laser level will make this easiest. You may want to try to place the top edge of the panel just a little higher than the panel really is if you know that your floor is uneven. This will keep down the amount of trimming you need to do. Shoe molding can always be placed at the bottom to hide gaps that occur with an uneven floor. Mark the studs and utility lines. Use a stud finder tool, or gently tap the wall with a hammer, to locate the wall studs and mark them just above the level line. If you can locate the utility lines, you should mark those on the wall as well, to help avoid hitting them with nails. Utility lines are often found around water sources or immediately next to the studs closest to outlets and wall lights. Be careful when nailing in these areas. Plan out your spacing. The size and orientation of your room will determine what your paneling looks like, so specific measurements unfortunately cannot be given. There are a few basic guidelines you should follow though, in order to figure out where everything should go:\nTry to get at least a few stiles placed over a stud. This will help seal your panel to the wall. Don't place a stile over an outlet or other unusual feature. This will only create more cutting and measuring for you. Try to line up your stiles to cover gaps between panels, helping to hide the seam. Set the spacing of your stiles in a way that looks good for the size of room you have. The smaller the room, the further apart the stiles should be. Larger rooms can be spaced the same as studs: 16\" center-to-center. Attach your panels. Add construction adhesive to the backs of the panels and place them on the wall, staring at the corner and covering the longest wall first. Line the top of the panel up with your level line and secure the panels into the studs with a pneumatic nail gun and 1.5\" finish nails (should be placed at the top and bottom, so that they will be hidden by the rail and baseboard). Go around the room until all of the panels are placed. You will need to cut a hole for an outlet when you see that a panel will cover one. Cover the outlet in brightly colored chalk, line up the panel, press the panel into the chalk to get your outline, and then cut out the shape with a jigsaw. Attach your top rail. Line up the 1x2 rails so that they are flush with the top of the panels and then nail them into place with 2.5\" finish nails. These should also be nailed into studs whenever possible. Attach your stiles. Next, glue and nail the stiles in place exactly how you attached the top rail. Start with two stiles at the corner of the room, and then use the spacer at the top and then again at the bottom as you nail the two ends into place. Use a carefully cut piece of scrap wood as a spacer and a laser or normal level to make sure the stiles are nailed in as straight as possible. Attach your baseboard and shoe molding. Next attach the baseboard the same way you attach the the stiles and top rail. Don't worry about any gaps left at the bottom by uneven floors: that will be covered up by shoe molding which goes up last. You can also add molding at the top to cover uneven rails and paneling or just use a flat piece if you want a usable ledge. Add finishing touches. Sand the completed wood surface, cover any nails with a nail crayon, and then paint or stain the wood as desired. Enjoy your new wainscoting!",
  "tyn_model":[
    "lumber",
    "chalk",
    "jigsaw",
    "shoe molding",
    "tape measure",
    "level",
    "stud finder tool",
    "hammer",
    "glue",
    "construction adhesive",
    "pneumatic nail gun",
    "wood wainscot panels",
    "level line",
    "paneling nails",
    "brightly colored chalk",
    "plywood",
    "circular saw",
    "laser lever",
    "stud finder",
    "wood",
    "painter's tape",
    "laser level",
    "nails",
    "stile",
    "stiles",
    "spacer",
    "laser or normal level",
    "baseboard",
    "nail crayon"
  ],
  "tyn_section":[

  ]
}