{
  "title":"How to Draw a Cartoon Killer Bee",
  "url":"https://www.wikihow.com/Draw-a-Cartoon-Killer-Bee",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "steps":[
    {
      "headline":"Start by drawing an egg shape in pencil, this will be the body.",
      "description":"Make sure it is slanted to the left."
    },
    {
      "headline":"Leave a little space,then draw a cone shaped sting underneath the end of the egg.",
      "description":""
    },
    {
      "headline":"Make sure the whole thing is slanted to the left.You will see why it is like this at the end.",
      "description":""
    },
    {
      "headline":"Draw a Pac-man shape on its back, above the egg.",
      "description":""
    },
    {
      "headline":"Draw a teardrop shape wing coming out of the Pac-man shape.",
      "description":""
    },
    {
      "headline":"Now, draw the head (an alien shape) for the eyes,you can experiment.",
      "description":""
    },
    {
      "headline":"You can draw a mean smile,like he (or she!)",
      "description":"is going to bite you!"
    },
    {
      "headline":"Draw another wing, colour in the eyes, body or wing with a marker pen.",
      "description":"Go over the pencil sketches with marker and you're done!"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Start by drawing an egg shape in pencil, this will be the body. Make sure it is slanted to the left. Leave a little space,then draw a cone shaped sting underneath the end of the egg.  Make sure the whole thing is slanted to the left.You will see why it is like this at the end.  Draw a Pac-man shape on its back, above the egg.  Draw a teardrop shape wing coming out of the Pac-man shape.  Now, draw the head (an alien shape) for the eyes,you can experiment.  You can draw a mean smile,like he (or she!) is going to bite you! Draw another wing, colour in the eyes, body or wing with a marker pen. Go over the pencil sketches with marker and you're done! Finished. ",
  "tyn_model":[
    "pencil",
    "teardrop shape",
    "marker pen",
    "marker"
  ],
  "tyn_section":[

  ]
}