{
  "title":"How to Make Doughnut Muffins",
  "url":"https://www.wikihow.com/Make-Doughnut-Muffins",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Muffins"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350°F or 180°C.",
      "description":""
    },
    {
      "headline":"Cream the butter and sugar together with an electric mixer in a large bowl.",
      "description":"Beat each egg, one at a time, in until creamy in texture."
    },
    {
      "headline":"Sift the flour, baking soda, baking powder, nutmeg, and salt together in a separate bowl.",
      "description":""
    },
    {
      "headline":"Measure and add the buttermilk and milk in a third bowl.",
      "description":""
    },
    {
      "headline":"Carefully add about a quarter of the dry ingredients into the butter/sugar bowl and mix in.",
      "description":"Add about a third of the milk in and repeat the alternating process. Mix thoroughly until smooth, but don't over-mix the batter."
    },
    {
      "headline":"Grease a muffin tin with non-stick cooking spray or flour.",
      "description":"Add enough batter to the muffin cups to the rim or about 1/2 a cup."
    },
    {
      "headline":"Bake for about 30 to 35 minutes or until firm.",
      "description":""
    },
    {
      "headline":"Melt the 2 sticks of butter for dipping.",
      "description":"In a bowl, mix the sugar and cinnamon together thoroughly. Remove the muffins from the tin, when cooled. Add each one to the melted butter bowl (or use a basting brush) and roll them in the cinnamon sugar bowl."
    },
    {
      "headline":"Shake off any chunks or excess sugar from the muffins.",
      "description":"Store in an airtight container."
    },
    {
      "headline":"Enjoy it with coffee, tea, as a snack, or as a dessert.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 350°F or 180°C.  Cream the butter and sugar together with an electric mixer in a large bowl. Beat each egg, one at a time, in until creamy in texture. Sift the flour, baking soda, baking powder, nutmeg, and salt together in a separate bowl.  Measure and add the buttermilk and milk in a third bowl.  Carefully add about a quarter of the dry ingredients into the butter/sugar bowl and mix in. Add about a third of the milk in and repeat the alternating process. Mix thoroughly until smooth, but don't over-mix the batter. Grease a muffin tin with non-stick cooking spray or flour. Add enough batter to the muffin cups to the rim or about 1/2 a cup. Bake for about 30 to 35 minutes or until firm.  Melt the 2 sticks of butter for dipping. In a bowl, mix the sugar and cinnamon together thoroughly. Remove the muffins from the tin, when cooled. Add each one to the melted butter bowl (or use a basting brush) and roll them in the cinnamon sugar bowl. Shake off any chunks or excess sugar from the muffins. Store in an airtight container. Enjoy it with coffee, tea, as a snack, or as a dessert. ",
  "tyn_model":[
    "butter",
    "sugar",
    "flour",
    "milk",
    "oven",
    "electric mixer",
    "large bowl",
    "baking soda",
    "baking powder",
    "nutmeg",
    "salt",
    "buttermilk",
    "muffin tin",
    "non-stick cooking spray",
    "muffin cups",
    "bowl",
    "cinnamon",
    "butter bowl",
    "cinnamon sugar bowl",
    "airtight container"
  ],
  "tyn_section":[

  ]
}