{
  "title":"How to Install a Pendant Light",
  "url":"https://www.wikihow.com/Install-a-Pendant-Light",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Hanging Lights"
  ],
  "parts":[
    {
      "name":"Preparing for Installation",
      "steps":[
        {
          "headline":"Unpack your new fixture.",
          "description":"Carefully lay out the parts so they are easily accessible."
        },
        {
          "headline":"Turn off the power.",
          "description":"Find your home's circuit breaker or fuse box and turn off power to the room or area of the house where you'll be installing the light. Failure to turn off the power before beginning work may result in serious electrical shock."
        },
        {
          "headline":"Remove the old fixture.",
          "description":"Unless you are installing your pendant light in a new or recently remodeled house, you'll probably need to remove an old light fixture. Detach the fixture. This process will depend on the type of fixture you previously had installed. If possible, have someone hold it up while you detach it from the ceiling to decrease the likelihood of dropping it. Remove the old wire connectors. These are the small plastic caps covering the connections between the fixture wires and the house wiring. Usually they can be removed by twisting them counterclockwise until loose. Before disconnecting the wires, it's a good idea use a voltage checker to make sure the wires have no electricity running through them. Finally, disconnect the wires and remove any remaining parts of the old fixture that are still attached to the ceiling, such as a base or trim."
        },
        {
          "headline":"Check your support.",
          "description":"Make sure your installation location is structurally sound. Your electrical junction box should be supported by a beam or other support system, not simply screwed into drywall. If the electrical box and light fixture are not adequately supported, it may fall. Further, this is likely a building code violation. If there is not adequate support to hold your fixture up, do not proceed with the installation."
        },
        {
          "headline":"Check the junction box.",
          "description":"Make sure the screws holding the electrical box in place are tight and the box is secure. Tighten screws if necessary, but do not over-tighten."
        }
      ]
    },
    {
      "name":"Installing Your Pendant Light",
      "steps":[
        {
          "headline":"Attach the power wires.",
          "description":"Have an assistant hold the light fixture up to the ceiling while you connect the wires from the light fixture to those hanging out of the junction box. Connect wires according to the directions provided with the light. Usually, this means connecting black to black and white to white. Wrap the exposed ends of the wires together. If there is not enough exposed surface on each wire, you may need to use wire strippers to peel back some of the wire insulation. Screw on wire nuts/connectors to cover the exposed connections and secure them tightly. These should be provided with the fixture, but if not, can be purchased cheaply at any hardware store."
        },
        {
          "headline":"Attach the ground wire.",
          "description":"Find the ground wire on the pendant light. Depending on your wiring, you'll either wrap it around a ground screw located in the junction box or attach it to a protruding ground wire. The ground wire is usually either a green wire or a bare copper wire. If you have a ground screw, tighten the screw to hold the wire in place."
        },
        {
          "headline":"Secure the wires.",
          "description":"Push or fold the wiring up into the junction box, making sure that all wires remain secured together with the wire nuts."
        },
        {
          "headline":"Install the mounting bracket and/or mounting screws.",
          "description":"Your new fixture should have come with a bracket and/or mounting screws needed to firmly attach the pendant light to the junction box. This will vary depending on the style of light you are installing. Follow the manufacturers instructions."
        },
        {
          "headline":"Hang the light.",
          "description":"Attach the canopy of or base of your light to the mounting screws or bracket. This process will also vary depending on the style of pendant light you are installing, so it's a good idea to check your directions before you start. In some cases, the process is as aligning your mounting screws with some small holes in the fixture, and turning the fixture about a quarter turn. In other cases, you'll have to screw the fixture into a mounting bracket."
        },
        {
          "headline":"Install a bulb.",
          "description":"Screw a light bulb of the correct voltage and size into the pendant light fixture."
        },
        {
          "headline":"Turn the power back on.",
          "description":"Your light should now be functional. If your light does not function, turn the power back off and check your wiring."
        },
        {
          "headline":"Complete installation.",
          "description":"If your fixture has a trim, a cover, or any other remaining parts that still need to be installed, install them now, and make any final adjustments to the light's height."
        }
      ]
    }
  ],
  "text":" Preparing for Installation Unpack your new fixture. Carefully lay out the parts so they are easily accessible. Turn off the power. Find your home's circuit breaker or fuse box and turn off power to the room or area of the house where you'll be installing the light. Failure to turn off the power before beginning work may result in serious electrical shock. Remove the old fixture. Unless you are installing your pendant light in a new or recently remodeled house, you'll probably need to remove an old light fixture. Detach the fixture. This process will depend on the type of fixture you previously had installed. If possible, have someone hold it up while you detach it from the ceiling to decrease the likelihood of dropping it. Remove the old wire connectors. These are the small plastic caps covering the connections between the fixture wires and the house wiring. Usually they can be removed by twisting them counterclockwise until loose. Before disconnecting the wires, it's a good idea use a voltage checker to make sure the wires have no electricity running through them. Finally, disconnect the wires and remove any remaining parts of the old fixture that are still attached to the ceiling, such as a base or trim. Check your support. Make sure your installation location is structurally sound. Your electrical junction box should be supported by a beam or other support system, not simply screwed into drywall. If the electrical box and light fixture are not adequately supported, it may fall. Further, this is likely a building code violation. If there is not adequate support to hold your fixture up, do not proceed with the installation. Check the junction box. Make sure the screws holding the electrical box in place are tight and the box is secure. Tighten screws if necessary, but do not over-tighten. Installing Your Pendant Light Attach the power wires. Have an assistant hold the light fixture up to the ceiling while you connect the wires from the light fixture to those hanging out of the junction box. Connect wires according to the directions provided with the light. Usually, this means connecting black to black and white to white. Wrap the exposed ends of the wires together. If there is not enough exposed surface on each wire, you may need to use wire strippers to peel back some of the wire insulation. Screw on wire nuts/connectors to cover the exposed connections and secure them tightly. These should be provided with the fixture, but if not, can be purchased cheaply at any hardware store. Attach the ground wire. Find the ground wire on the pendant light. Depending on your wiring, you'll either wrap it around a ground screw located in the junction box or attach it to a protruding ground wire. The ground wire is usually either a green wire or a bare copper wire. If you have a ground screw, tighten the screw to hold the wire in place. Secure the wires. Push or fold the wiring up into the junction box, making sure that all wires remain secured together with the wire nuts. Install the mounting bracket and/or mounting screws. Your new fixture should have come with a bracket and/or mounting screws needed to firmly attach the pendant light to the junction box. This will vary depending on the style of light you are installing. Follow the manufacturers instructions. Hang the light. Attach the canopy of or base of your light to the mounting screws or bracket. This process will also vary depending on the style of pendant light you are installing, so it's a good idea to check your directions before you start. In some cases, the process is as aligning your mounting screws with some small holes in the fixture, and turning the fixture about a quarter turn. In other cases, you'll have to screw the fixture into a mounting bracket. Install a bulb. Screw a light bulb of the correct voltage and size into the pendant light fixture. Turn the power back on. Your light should now be functional. If your light does not function, turn the power back off and check your wiring. Complete installation. If your fixture has a trim, a cover, or any other remaining parts that still need to be installed, install them now, and make any final adjustments to the light's height.",
  "tyn_model":[
    "light fixture",
    "pendant light",
    "wire nuts",
    "circuit breaker",
    "electrical box",
    "screws",
    "wire strippers",
    "wire insulation",
    "ground wire",
    "ground screw",
    "mounting screws",
    "bulb",
    "light bulb",
    "pendant light fixture"
  ],
  "tyn_section":[

  ]
}