{
  "title":"How to Make Cheese Fondue (Moitié Moitié)",
  "url":"https://www.wikihow.com/Make-Cheese-Fondue-(Moiti%C3%A9-Moiti%C3%A9)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Cheese",
    "Fondue"
  ],
  "steps":[
    {
      "headline":"Cut the bread into 1-inch cubes.",
      "description":"Rub the garlic it on the bottom and the side of the fondue pot or saucepan."
    },
    {
      "headline":"Best: Use a double boiler.",
      "description":"Boil water in a pot underneath the fondue pot to heat the wine. The idea is not to boil the wine but make it hot enough to melt the cheese."
    },
    {
      "headline":"Alternative: Heat over low heat just until bubbles rise to surface (wine should not boil).",
      "description":"This method often makes the cheese stick to the bottom and burn."
    },
    {
      "headline":"add cheeses, about 1/4 cup at a time, stirring constantly with a spoon or fork.",
      "description":"The cheese should melt as soon as it enters the pot. If if doesn't, wait for the pot to heat up more."
    },
    {
      "headline":"Add seasonings to taste.",
      "description":""
    },
    {
      "headline":"Spear bread cubes with fondue forks; dip and swirl in fondue with stirring motion.",
      "description":"Try other dippers, too."
    }
  ],
  "text":" Cut the bread into 1-inch cubes. Rub the garlic it on the bottom and the side of the fondue pot or saucepan. Best: Use a double boiler. Boil water in a pot underneath the fondue pot to heat the wine. The idea is not to boil the wine but make it hot enough to melt the cheese. Alternative: Heat over low heat just until bubbles rise to surface (wine should not boil). This method often makes the cheese stick to the bottom and burn. add cheeses, about 1/4 cup at a time, stirring constantly with a spoon or fork. The cheese should melt as soon as it enters the pot. If if doesn't, wait for the pot to heat up more. Add seasonings to taste.  Spear bread cubes with fondue forks; dip and swirl in fondue with stirring motion. Try other dippers, too.",
  "tyn_model":[
    "pot",
    "fondue pot",
    "garlic",
    "double boiler",
    "water",
    "spoon",
    "seasonings",
    "fondue forks",
    "fondue"
  ],
  "tyn_section":[

  ]
}