{
  "title":"How to Make Hair Accessories",
  "url":"https://www.wikihow.com/Make-Hair-Accessories",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Making Headbands",
      "steps":[
        {
          "headline":"Make a ribbon headband.",
          "description":"Choose a ribbon or trim of your choice, and pick up a thin elastic band in a color/width to match. Wrap the ribbon around your head where you want the headband to sit, and then cut the ribbon to be six inches shorter that that length. Cut a piece of elastic to 4 inches (10.2 cm) long, and sew the ends together with the ends of the ribbon to form a loop. Voila! Your ribbon headband is complete. If your headband is too loose, cut off more ribbon and sew it to the end of the elastic. The elastic will typically be hidden under your hair, so it won't be a problem to have a bit more of the stretchy material. Avoid ribbon or trim with sequins sewn in, as they may get caught in your hair and cause a difficult tangle."
        },
        {
          "headline":"Decorate a hard-shell headband.",
          "description":"Hard-shell headbands are available for incredibly cheap, at several for a dollar at many stores. They're cheap for a reason though: they're plain. Grab a couple in a color you like, and decorate away! Wrap them in ribbon, spray-paint them, glue on beads or sequins, or add feathers. The sky's the limit when it comes to decorating these bad boys. Plus, because they're cheap you don't have to worry about ruining one and not being able to make a new one. Use found items or pieces off of old headbands or jewelry in order to be environmentally friendly and frugal."
        },
        {
          "headline":"Make a turban headband.",
          "description":"This is a great option for combining fashion with utility. Purchase two 2\" thick jersey headbands from any beauty supply store. Cut one of the headbands in half along the seam. Place the cut headband through the complete headband, and then sew the ends back together (so you are left with two loops linked together). Pull the loops tight and then sew the opposite ends of the loops together to create a single loop, with a knot at the front where the two headbands meet. If you'd rather not buy and butcher two perfectly good headbands, any jersey fabric cut into strips will work. You can also choose to use old nylons for the same effect. You can hand-sew or use a sewing machine for this project."
        }
      ]
    },
    {
      "name":"Making Hair Clips",
      "steps":[
        {
          "headline":"Make painted bobby pins.",
          "description":"Typically the goal of bobby pins is to secretly pin back hair - but why not give them a bit of flair and wear them more noticeably? Put 5-10 bobby pins together over a thick piece of cardstock (fold it in half if need be), and slide them so that they're all touching. Use nail polish or acrylic paint to coat the bobby pins with a design or a solid color. Allow them to dry, and you're done! Wear multiple together for a unique look, or use one at a time for a pop of color."
        },
        {
          "headline":"Make beaded bobby pins.",
          "description":"This is a great way to look cheap bobby pins look very fancy. Gather 10-20 beads of your choice, with a hole large enough that small craft/florists wire can easily fit through. Cut a piece of wire to be twice the length of the bobby pin. Wrap the end around the bent part of the bobby pin, and then string on a bead. Keep the bead on top, and wrap the wire around the pin. Add another bead, wrap the wire, and continue the process until you reach the end. Use a pair of pliers to wrap the end of the wire around the end of the bobby pin."
        },
        {
          "headline":"Make a bow hair clip.",
          "description":"Choose your favorite fabric - you won't need more than a piece 4 inches (10.2 cm) wide - and cut it into two pieces: one piece three times as wide as the other. Wrap the wider piece around to create a loop, and glue the ends together. . Use the second thin strip to create a 'knot' at the center by wrapping it around the loop in the middle. Glue the ends together at the back. You should be left with a small bow which can be attached to your favorite hair clip."
        },
        {
          "headline":"Make a studded hair clip.",
          "description":"Find a small piece of leather (or faux-leather) and cut it in a rectangle slightly larger than your hair clip. Pick some studs that are slightly smaller than the leather strip, and arrange them as you like. Attach them to the leather either using the brad on the back (if they have them) or with a dab of hot glue. Glue this studded leather strip to your hair clip to finish up the project."
        },
        {
          "headline":"Upcycle a hair clip.",
          "description":"Find a collection of small items such as buttons, fabric flowers, beads, and broken pieces of jewelry. Attach these pieces to hair clips with hot glue or wire. Keep your hair clip simple by adding a single item to a single clip, or go for glam and stack up multiple items on a clip. You'll have a 100% unique and green hair clip!"
        }
      ]
    },
    {
      "name":"Wearing a Head Scarf",
      "steps":[
        {
          "headline":"Turn your scarf into a headband.",
          "description":"Fold a square scarf (silk preferably) diagonally to create a large triangle shape. Starting at the widest side of the triangle, roll/fold the fabric up into a long, thin, rectangular strip. Wrap this strip around your head with the two tails above your forehead, and tie them together in a knot. If the ends are long enough, you can tie them together in a bow or tuck the ends around the headwrap and pin in place to hide them."
        },
        {
          "headline":"Braid a scarf into your hair.",
          "description":"Find a small scarf in a lightweight fabric (square silk scarves typically work best) and pull your hair into a ponytail with one of the corners of the scarf tucked into the loop. Section your hair into three pieces, and add the scarf to one of the strands. Braid your hair as you usually would, weaving the scarf into your hair as you go. Knot off the end with an elastic band and wrap the scarf around it, and tuck the end in place."
        },
        {
          "headline":"Tie a scarf in a bow in your hair.",
          "description":"This style is best for adorning updos and when your hair is pulled back from your face. Style your hair as you would normally, and then wrap a small, thin scarf around the elastic band or hair clip that you've used to pin your hair up. Tie the scarf in a bow, and adjust the fabric as necessary to make it more attractive."
        },
        {
          "headline":"Wear your scarf as a bandanna.",
          "description":"Take a large square scarf and fold it in half diagonally to create a large triangle. Drape this over your head so that the widest side of the triangle is above your forehead, and the two tail ends are near the nape of your neck. Tie the tail ends in a knot or a bow underneath your hair at the base of your neck. This style is great for bad hair days, or when you need to keep your hair out of your face."
        }
      ]
    }
  ],
  "text":" Making Headbands Make a ribbon headband. Choose a ribbon or trim of your choice, and pick up a thin elastic band in a color/width to match. Wrap the ribbon around your head where you want the headband to sit, and then cut the ribbon to be six inches shorter that that length. Cut a piece of elastic to 4 inches (10.2 cm) long, and sew the ends together with the ends of the ribbon to form a loop. Voila! Your ribbon headband is complete. If your headband is too loose, cut off more ribbon and sew it to the end of the elastic. The elastic will typically be hidden under your hair, so it won't be a problem to have a bit more of the stretchy material. Avoid ribbon or trim with sequins sewn in, as they may get caught in your hair and cause a difficult tangle. Decorate a hard-shell headband. Hard-shell headbands are available for incredibly cheap, at several for a dollar at many stores. They're cheap for a reason though: they're plain. Grab a couple in a color you like, and decorate away! Wrap them in ribbon, spray-paint them, glue on beads or sequins, or add feathers. The sky's the limit when it comes to decorating these bad boys. Plus, because they're cheap you don't have to worry about ruining one and not being able to make a new one. Use found items or pieces off of old headbands or jewelry in order to be environmentally friendly and frugal. Make a turban headband. This is a great option for combining fashion with utility. Purchase two 2\" thick jersey headbands from any beauty supply store. Cut one of the headbands in half along the seam. Place the cut headband through the complete headband, and then sew the ends back together (so you are left with two loops linked together). Pull the loops tight and then sew the opposite ends of the loops together to create a single loop, with a knot at the front where the two headbands meet. If you'd rather not buy and butcher two perfectly good headbands, any jersey fabric cut into strips will work. You can also choose to use old nylons for the same effect. You can hand-sew or use a sewing machine for this project. Making Hair Clips Make painted bobby pins. Typically the goal of bobby pins is to secretly pin back hair - but why not give them a bit of flair and wear them more noticeably? Put 5-10 bobby pins together over a thick piece of cardstock (fold it in half if need be), and slide them so that they're all touching. Use nail polish or acrylic paint to coat the bobby pins with a design or a solid color. Allow them to dry, and you're done! Wear multiple together for a unique look, or use one at a time for a pop of color. Make beaded bobby pins. This is a great way to look cheap bobby pins look very fancy. Gather 10-20 beads of your choice, with a hole large enough that small craft/florists wire can easily fit through. Cut a piece of wire to be twice the length of the bobby pin. Wrap the end around the bent part of the bobby pin, and then string on a bead. Keep the bead on top, and wrap the wire around the pin. Add another bead, wrap the wire, and continue the process until you reach the end. Use a pair of pliers to wrap the end of the wire around the end of the bobby pin. Make a bow hair clip. Choose your favorite fabric - you won't need more than a piece 4 inches (10.2 cm) wide - and cut it into two pieces: one piece three times as wide as the other. Wrap the wider piece around to create a loop, and glue the ends together. . Use the second thin strip to create a 'knot' at the center by wrapping it around the loop in the middle. Glue the ends together at the back. You should be left with a small bow which can be attached to your favorite hair clip. Make a studded hair clip. Find a small piece of leather (or faux-leather) and cut it in a rectangle slightly larger than your hair clip. Pick some studs that are slightly smaller than the leather strip, and arrange them as you like. Attach them to the leather either using the brad on the back (if they have them) or with a dab of hot glue. Glue this studded leather strip to your hair clip to finish up the project. Upcycle a hair clip. Find a collection of small items such as buttons, fabric flowers, beads, and broken pieces of jewelry. Attach these pieces to hair clips with hot glue or wire. Keep your hair clip simple by adding a single item to a single clip, or go for glam and stack up multiple items on a clip. You'll have a 100% unique and green hair clip! Wearing a Head Scarf Turn your scarf into a headband. Fold a square scarf (silk preferably) diagonally to create a large triangle shape. Starting at the widest side of the triangle, roll/fold the fabric up into a long, thin, rectangular strip. Wrap this strip around your head with the two tails above your forehead, and tie them together in a knot. If the ends are long enough, you can tie them together in a bow or tuck the ends around the headwrap and pin in place to hide them. Braid a scarf into your hair. Find a small scarf in a lightweight fabric (square silk scarves typically work best) and pull your hair into a ponytail with one of the corners of the scarf tucked into the loop. Section your hair into three pieces, and add the scarf to one of the strands. Braid your hair as you usually would, weaving the scarf into your hair as you go. Knot off the end with an elastic band and wrap the scarf around it, and tuck the end in place. Tie a scarf in a bow in your hair. This style is best for adorning updos and when your hair is pulled back from your face. Style your hair as you would normally, and then wrap a small, thin scarf around the elastic band or hair clip that you've used to pin your hair up. Tie the scarf in a bow, and adjust the fabric as necessary to make it more attractive. Wear your scarf as a bandanna. Take a large square scarf and fold it in half diagonally to create a large triangle. Drape this over your head so that the widest side of the triangle is above your forehead, and the two tail ends are near the nape of your neck. Tie the tail ends in a knot or a bow underneath your hair at the base of your neck. This style is great for bad hair days, or when you need to keep your hair out of your face.",
  "tyn_model":[
    "scarf",
    "ribbon",
    "wire",
    "elastic band",
    "elastic",
    "bobby pins",
    "fabric",
    "beads",
    "hot glue",
    "ribbon headband",
    "sequins",
    "hard-shell headbands",
    "feathers",
    "jewelry",
    "jersey fabric",
    "nylons",
    "sewing machine",
    "cardstock",
    "nail polish",
    "acrylic paint",
    "pins",
    "beaded bobby",
    "pliers",
    "leather",
    "silk"
  ],
  "tyn_section":[

  ]
}