{
  "title":"How to Replace an Aqua Pure AP810 Water Filter",
  "url":"https://www.wikihow.com/Replace-an-Aqua-Pure-AP810-Water-Filter",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "steps":[
    {
      "headline":"Turn off incoming water by isolating the Aqua-Pure system with existing valves on your homes water supply system.",
      "description":""
    },
    {
      "headline":"Bleed the pressure from your Aqua-Pure unit by pressing down on the red button (pressure relief button) on the top of the filter housing",
      "description":""
    },
    {
      "headline":"Take your filter wrench and slide it up from the bottom of the filter housing towards the head.",
      "description":"Once in place turn to the left to unscrew."
    },
    {
      "headline":"Remove the housing, and wipe it clean, and then insert your new Aqua-Pure AP810 water filter.",
      "description":""
    },
    {
      "headline":"Add a small amount of silicone o-ring lubricant (available at most hardware stores) to the O-ring and screw the housing back into the head.",
      "description":""
    },
    {
      "headline":"Turn back on your water supply to the system.",
      "description":""
    }
  ],
  "text":" Turn off incoming water by isolating the Aqua-Pure system with existing valves on your homes water supply system.  Bleed the pressure from your Aqua-Pure unit by pressing down on the red button (pressure relief button) on the top of the filter housing  Take your filter wrench and slide it up from the bottom of the filter housing towards the head. Once in place turn to the left to unscrew. Remove the housing, and wipe it clean, and then insert your new Aqua-Pure AP810 water filter.  Add a small amount of silicone o-ring lubricant (available at most hardware stores) to the O-ring and screw the housing back into the head.  Turn back on your water supply to the system. ",
  "tyn_model":[
    "water",
    "aqua-pure",
    "water supply",
    "filter wrench",
    "aqua-pure ap810 water filter",
    "o-ring"
  ],
  "tyn_section":[

  ]
}