{
  "title":"How to Buy Cabinets",
  "url":"https://www.wikihow.com/Buy-Cabinets",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture",
    "Cabinets and Cupboards"
  ],
  "methods":[
    {
      "name":"Measuring for New Cabinets",
      "steps":[
        {
          "headline":"Draw a rough blueprint of the room you will install the cabinets in.",
          "description":"The blueprint doesn’t need to be perfect since it’s just to record your measurements. Mark the locations of any obstacles such as doors, windows, and appliances that will stay put. Make sure to draw the blueprint big enough that you will be able to write down all your measurements clearly to refer to later on."
        },
        {
          "headline":"Measure the walls in the room to the nearest ⁄16 in (0.16 cm).",
          "description":"Use a tape measure to measure each wall. Write down the measurement next to the corresponding wall on your blueprint sketch. If you are just replacing existing cabinets, then you don’t need to measure the walls. Just measure the cabinets to determine their size so you can use the measurements to purchase replacements."
        },
        {
          "headline":"Measure any obstacles in the room to the nearest ⁄16 in (0.16 cm).",
          "description":"Measure the height, width, and depth of all appliances, windows, doors, and any other obstacles that you will need to accommodate the cabinets around. Write down the numbers next to the obstacles on your blueprint. Make sure to measure the distance between any appliances, such as a stove that will stay in place, and the walls. This way, you know how much length of cabinetry you can install on either side. Do the same for the space between windows and the ceiling or walls so you will be able to fit cabinetry around them."
        },
        {
          "headline":"Measure the height of the ceiling.",
          "description":"Use your tape measure to measure from the floor to the ceiling and write the number off to the side of your blueprint. This will help you figure out the ideal height for any upper cabinets. The standard height of lower cabinets is 36 in (91 cm) with the countertops included. The standard backsplash height (the height of the wall space between countertops and upper cabinets) is 18 in (46 cm). You can subtract these numbers from the ceiling height to figure out the ideal size for upper cabinets."
        },
        {
          "headline":"Use all the measurements to decide what size and how many cabinets to buy.",
          "description":"Refer to all the numbers you wrote down on your blueprint when shopping for stock cabinets or ordering custom cabinets. Remember that you can just buy cabinets of the same size if you are simply replacing old ones. If you aren’t confident in your measuring ability, many cabinet builders or furniture showrooms offer in-home consultation services during which they can measure for you."
        }
      ]
    },
    {
      "name":"Choosing Cabinets for Your Budget",
      "steps":[
        {
          "headline":"Choose stock cabinets for the cheapest option.",
          "description":"Stock cabinets are either pre-built or come in a box ready-to-assemble. Usually, you will be able to take home the stock cabinets the same day you shop for them, or have them delivered within a short time frame. Big box home improvement stores or IKEA are examples of places where you can find stock cabinets."
        },
        {
          "headline":"Opt for semi-custom cabinets for a midrange budget option with more features.",
          "description":"Semi-custom cabinets come in a wider range of sizes, styles, and finishes than stock cabinets. Semi-custom cabinets are usually available by special order from big box stores or specialty cabinet manufacturers. Semi-custom cabinets offer you more flexibility when designing your home than stock cabinets that come in less sizes and styles. They are also usually more durable and functional. If you are on a budget, semi-custom cabinets are a good option because you can always add accessories to them afterwards to improve their functionality or customize their look."
        },
        {
          "headline":"Order fully custom cabinets for high-end custom design and construction.",
          "description":"Fully custom cabinets offer you the most choices for size, style, and finish. Find a local cabinet manufacturer that offers custom-built cabinetry, then give them your size specifications and style guidelines for them to build cabinets that meet your vision. Keep in mind that custom cabinets cost the most of all cabinet options and can take up to 12 weeks to get built. Companies that sell semi-custom and custom cabinets usually provide consultations, and even free measurements of your home spaces, as long as you commit to buying cabinets from them."
        }
      ]
    },
    {
      "name":"Deciding on a Style of Cabinets",
      "steps":[
        {
          "headline":"Choose face-framed cabinets for a classic look.",
          "description":"Face-framed cabinets have cabinet doors with recessed or raised panels that are inset into the frame. The framed doors are attached to the box of the cabinets in such a way that it hides the cabinet’s joinery. This type of cabinet fits well in a classic kitchen, for example."
        },
        {
          "headline":"Get frameless cabinets for a more modern design.",
          "description":"Frameless cabinets have flat doors that are attached to the cabinet box. This creates a streamlined contemporary look. Frameless cabinets are usually smaller and less expensive than face-framed cabinets. They can work well in smaller spaces, such as modern apartment kitchens."
        },
        {
          "headline":"Look at cabinets in a design showroom to see different finishes and materials.",
          "description":"It’s best to see cabinet models in person to select the material and finish that go best with your vision. Visit a kitchen or cabinet design showroom to feel the materials and look at finishes, then pick a combination that you like and that fits your budget. Custom cabinets will offer you the most choice of finishes. For example, you can order them painted, stained, distressed, or antiqued. Stock cabinets usually come unfinished, or with a basic stain or thermofoil finish."
        }
      ]
    },
    {
      "name":"Selecting Features for Your Cabinets",
      "steps":[
        {
          "headline":"Select solid wood door frames if your budget allows for it.",
          "description":"Most cabinet manufacturers offer different door options in different price ranges. Choose a solid wood frame construction around solid wood or plywood panels for the most sturdy and durable option. Stock cabinets are often made entirely of particle board, so you won’t have the option for solid wood doors if you are on a strict budget."
        },
        {
          "headline":"Choose solid wood drawers with plywood bottoms for long-lasting drawers.",
          "description":"Drawers get the most use, so it’s important to choose drawers with solid construction. Look for drawers with solid wood sides and plywood bottoms that fit into grooves on all 4 sides for the sturdiest option. Avoid stapled particle board drawers, unless your budget absolutely doesn’t allow you any other option."
        },
        {
          "headline":"Opt for plywood shelves to avoid sagging over time.",
          "description":"Particle board shelves can sag over time, so avoid them if you have the budget for better quality. ⁄4 in (1.9 cm) plywood is the ideal thickness and material for the shelves. Solid wood is another option for shelves, but will significantly increase the cost. Only choose this if you are going all out with fully custom cabinets for your home."
        },
        {
          "headline":"Select full-extension drawer guide hardware for the best hardware.",
          "description":"Full-extension drawer guides are smoother and more durable than other types of hardware like bottom-mounted roller designs. Semi-custom and custom cabinet models allow you to choose or upgrade the drawer guide hardware, so go for the full-extension drawers if your budget allows for it. Premium models of full-extension drawer guide hardware can even come with a soft-close feature that keeps the drawers from slamming shut. Don’t worry about door hinge hardware too much, as there isn’t a significant difference in performance."
        },
        {
          "headline":"Choose extra features that will make your life easier if you have extra budget.",
          "description":"Special features, like slide-out trash cans or spring-loaded shelves that swivel up and out, can add up to 20% to the cost of your cabinets. Only go for these features when you want to create the cabinets of your dreams and truly customize your space. If you are going with cheaper stock or semi-custom cabinets, you can always buy accessories later on, like slide-out drawers that fit inside, to customize them."
        }
      ]
    }
  ],
  "text":" Measuring for New Cabinets Draw a rough blueprint of the room you will install the cabinets in. The blueprint doesn’t need to be perfect since it’s just to record your measurements. Mark the locations of any obstacles such as doors, windows, and appliances that will stay put. Make sure to draw the blueprint big enough that you will be able to write down all your measurements clearly to refer to later on. Measure the walls in the room to the nearest ⁄16 in (0.16 cm). Use a tape measure to measure each wall. Write down the measurement next to the corresponding wall on your blueprint sketch. If you are just replacing existing cabinets, then you don’t need to measure the walls. Just measure the cabinets to determine their size so you can use the measurements to purchase replacements. Measure any obstacles in the room to the nearest ⁄16 in (0.16 cm). Measure the height, width, and depth of all appliances, windows, doors, and any other obstacles that you will need to accommodate the cabinets around. Write down the numbers next to the obstacles on your blueprint. Make sure to measure the distance between any appliances, such as a stove that will stay in place, and the walls. This way, you know how much length of cabinetry you can install on either side. Do the same for the space between windows and the ceiling or walls so you will be able to fit cabinetry around them. Measure the height of the ceiling. Use your tape measure to measure from the floor to the ceiling and write the number off to the side of your blueprint. This will help you figure out the ideal height for any upper cabinets. The standard height of lower cabinets is 36 in (91 cm) with the countertops included. The standard backsplash height (the height of the wall space between countertops and upper cabinets) is 18 in (46 cm). You can subtract these numbers from the ceiling height to figure out the ideal size for upper cabinets. Use all the measurements to decide what size and how many cabinets to buy. Refer to all the numbers you wrote down on your blueprint when shopping for stock cabinets or ordering custom cabinets. Remember that you can just buy cabinets of the same size if you are simply replacing old ones. If you aren’t confident in your measuring ability, many cabinet builders or furniture showrooms offer in-home consultation services during which they can measure for you. Choosing Cabinets for Your Budget Choose stock cabinets for the cheapest option. Stock cabinets are either pre-built or come in a box ready-to-assemble. Usually, you will be able to take home the stock cabinets the same day you shop for them, or have them delivered within a short time frame. Big box home improvement stores or IKEA are examples of places where you can find stock cabinets. Opt for semi-custom cabinets for a midrange budget option with more features. Semi-custom cabinets come in a wider range of sizes, styles, and finishes than stock cabinets. Semi-custom cabinets are usually available by special order from big box stores or specialty cabinet manufacturers. Semi-custom cabinets offer you more flexibility when designing your home than stock cabinets that come in less sizes and styles. They are also usually more durable and functional. If you are on a budget, semi-custom cabinets are a good option because you can always add accessories to them afterwards to improve their functionality or customize their look. Order fully custom cabinets for high-end custom design and construction. Fully custom cabinets offer you the most choices for size, style, and finish. Find a local cabinet manufacturer that offers custom-built cabinetry, then give them your size specifications and style guidelines for them to build cabinets that meet your vision. Keep in mind that custom cabinets cost the most of all cabinet options and can take up to 12 weeks to get built. Companies that sell semi-custom and custom cabinets usually provide consultations, and even free measurements of your home spaces, as long as you commit to buying cabinets from them. Deciding on a Style of Cabinets Choose face-framed cabinets for a classic look. Face-framed cabinets have cabinet doors with recessed or raised panels that are inset into the frame. The framed doors are attached to the box of the cabinets in such a way that it hides the cabinet’s joinery. This type of cabinet fits well in a classic kitchen, for example. Get frameless cabinets for a more modern design. Frameless cabinets have flat doors that are attached to the cabinet box. This creates a streamlined contemporary look. Frameless cabinets are usually smaller and less expensive than face-framed cabinets. They can work well in smaller spaces, such as modern apartment kitchens. Look at cabinets in a design showroom to see different finishes and materials. It’s best to see cabinet models in person to select the material and finish that go best with your vision. Visit a kitchen or cabinet design showroom to feel the materials and look at finishes, then pick a combination that you like and that fits your budget. Custom cabinets will offer you the most choice of finishes. For example, you can order them painted, stained, distressed, or antiqued. Stock cabinets usually come unfinished, or with a basic stain or thermofoil finish. Selecting Features for Your Cabinets Select solid wood door frames if your budget allows for it. Most cabinet manufacturers offer different door options in different price ranges. Choose a solid wood frame construction around solid wood or plywood panels for the most sturdy and durable option. Stock cabinets are often made entirely of particle board, so you won’t have the option for solid wood doors if you are on a strict budget. Choose solid wood drawers with plywood bottoms for long-lasting drawers. Drawers get the most use, so it’s important to choose drawers with solid construction. Look for drawers with solid wood sides and plywood bottoms that fit into grooves on all 4 sides for the sturdiest option. Avoid stapled particle board drawers, unless your budget absolutely doesn’t allow you any other option. Opt for plywood shelves to avoid sagging over time. Particle board shelves can sag over time, so avoid them if you have the budget for better quality. ⁄4 in (1.9 cm) plywood is the ideal thickness and material for the shelves. Solid wood is another option for shelves, but will significantly increase the cost. Only choose this if you are going all out with fully custom cabinets for your home. Select full-extension drawer guide hardware for the best hardware. Full-extension drawer guides are smoother and more durable than other types of hardware like bottom-mounted roller designs. Semi-custom and custom cabinet models allow you to choose or upgrade the drawer guide hardware, so go for the full-extension drawers if your budget allows for it. Premium models of full-extension drawer guide hardware can even come with a soft-close feature that keeps the drawers from slamming shut. Don’t worry about door hinge hardware too much, as there isn’t a significant difference in performance. Choose extra features that will make your life easier if you have extra budget. Special features, like slide-out trash cans or spring-loaded shelves that swivel up and out, can add up to 20% to the cost of your cabinets. Only go for these features when you want to create the cabinets of your dreams and truly customize your space. If you are going with cheaper stock or semi-custom cabinets, you can always buy accessories later on, like slide-out drawers that fit inside, to customize them.",
  "tyn_model":[
    "cabinets",
    "cabinet",
    "tape measure",
    "cabinetry",
    "drawer guide",
    "cabinet builders",
    "home improvement stores",
    "design showroom",
    "solid wood door frames",
    "particle board",
    "particle board drawers",
    "particle board shelves",
    "plywood",
    "shelves"
  ],
  "tyn_section":[

  ]
}