{
  "title":"How to Plant Vegetable Seeds Outdoors",
  "url":"https://www.wikihow.com/Plant-Vegetable-Seeds-Outdoors",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Vegetables"
  ],
  "steps":[
    {
      "headline":"Choose the types of vegetables you would like to grow and purchase the vegetable seeds to plant.",
      "description":"This will allow you to become familiar with how to plant vegetable seeds outdoors and enjoy the varieties you select once harvest time arrives."
    },
    {
      "headline":"Learn about the types of vegetable seeds you are going to plant.",
      "description":"Each seed variety requires specific conditions needed for germination, including proper temperature, moisture levels and sunlight. Too much or too little of any of these necessary elements will result in the delicate seed or seedling failing to grow."
    },
    {
      "headline":"Know your planting zone to ensure that you are putting your vegetable seeds into the ground at the right time of the season.",
      "description":"Separated by temperature variation, areas are divided into International or United States Department of Agriculture Hardiness Zones. Each zone helps gardeners understand their particular climate, and teaches gardeners how to plant vegetable seeds outdoors during the proper time of year for the best results. Zones determine lowest and highest temperatures, and the expected annual rainfall, which are vital to seed germination."
    },
    {
      "headline":"Begin planting vegetable seeds by marking the soil in rows.",
      "description":"The depth each seed needs to be placed in the ground generally depends on its size, with larger seeds needing to be placed deeper in the soil. The proximity of each seed also usually depends on size, with larger seeds requiring more space between each one."
    },
    {
      "headline":"Water the vegetable seeds if the ground is dry.",
      "description":"Now is also a good time to add a small amount of fertilizer mixed with the water to give the seeds extra nourishment."
    },
    {
      "headline":"Cover the vegetable seeds with soil.",
      "description":"How much depends on the type of seed; a light covering will do for small seeds and more soil for larger seeds. Do note that most seeds do not need to be buried very deeply to grow; it only needs to be enough that the seeds are protected from the weather. Several small seeds, such as chia or carrot seeds, barely need to be covered at all."
    },
    {
      "headline":"Gently firm the ground over the vegetable seeds.",
      "description":"Use your hand or planting tool, and then water the bed of seeds with a light spray."
    }
  ],
  "text":" Choose the types of vegetables you would like to grow and purchase the vegetable seeds to plant. This will allow you to become familiar with how to plant vegetable seeds outdoors and enjoy the varieties you select once harvest time arrives. Learn about the types of vegetable seeds you are going to plant. Each seed variety requires specific conditions needed for germination, including proper temperature, moisture levels and sunlight. Too much or too little of any of these necessary elements will result in the delicate seed or seedling failing to grow. Know your planting zone to ensure that you are putting your vegetable seeds into the ground at the right time of the season. Separated by temperature variation, areas are divided into International or United States Department of Agriculture Hardiness Zones. Each zone helps gardeners understand their particular climate, and teaches gardeners how to plant vegetable seeds outdoors during the proper time of year for the best results. Zones determine lowest and highest temperatures, and the expected annual rainfall, which are vital to seed germination. Begin planting vegetable seeds by marking the soil in rows. The depth each seed needs to be placed in the ground generally depends on its size, with larger seeds needing to be placed deeper in the soil. The proximity of each seed also usually depends on size, with larger seeds requiring more space between each one. Water the vegetable seeds if the ground is dry. Now is also a good time to add a small amount of fertilizer mixed with the water to give the seeds extra nourishment. Cover the vegetable seeds with soil. How much depends on the type of seed; a light covering will do for small seeds and more soil for larger seeds. Do note that most seeds do not need to be buried very deeply to grow; it only needs to be enough that the seeds are protected from the weather. Several small seeds, such as chia or carrot seeds, barely need to be covered at all. Gently firm the ground over the vegetable seeds. Use your hand or planting tool, and then water the bed of seeds with a light spray.",
  "tyn_model":[
    "water",
    "vegetable seeds",
    "soil",
    "fertilizer",
    "carrot",
    "vegetable"
  ],
  "tyn_section":[

  ]
}