{
  "title":"How to Make Lemon Sorbet",
  "url":"https://www.wikihow.com/Make-Lemon-Sorbet",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts",
    "Sorbet and Sherbet"
  ],
  "methods":[
    {
      "name":"Lemon Sorbet",
      "steps":[
        {
          "headline":"Mix 1 cup (200g) sugar and 1 cup (8oz) water in a small saucepan.",
          "description":"For a creamier version that's similar to lemon sherbet, you may substitute milk for any amount of the water. The more milk you add, the creamier the texture will be. For an even richer, more decadent texture, you can substitute heavy cream for the water. This makes it more of a lemon ice cream and really tones down the tartness of the lemon."
        },
        {
          "headline":"Cook over medium heat, stirring constantly until it begins to boil.",
          "description":""
        },
        {
          "headline":"Reduce the heat and let it simmer for 2 minutes, uncovered.",
          "description":""
        },
        {
          "headline":"Remove from heat and allow the mixture to cool.",
          "description":""
        },
        {
          "headline":"Add 3/4 to 1 cup (6 to 8oz) lemon juice.",
          "description":"This is approximately 5 to 8 lemons depending on their size. Add 1 to 3 tbs. (15ml to 45ml) lemon zest and mix well."
        },
        {
          "headline":"Pour the mixture into an ice cream maker and follow the manufacturer's instructions.",
          "description":""
        },
        {
          "headline":"Transfer the prepared lemon sorbet from the ice cream freezer to an air-tight container.",
          "description":""
        },
        {
          "headline":"Store in the freezer until you are ready to serve.",
          "description":"When serving, you can top your sorbet with a mint leaf for a lovely green garnish. Or you can top with fresh raspberries, strawberries, or blueberries for a colorful twist. Even a dollop of fresh whipped cream and a sprinkle of lemon zest can make for an eye-catching garnish."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    },
    {
      "name":"Zesty Lemon Sorbet",
      "steps":[
        {
          "headline":"Boil the water.",
          "description":"Add the sugar. Stir frequently until it has completely dissolved."
        },
        {
          "headline":"Zest the 3 lemons.",
          "description":""
        },
        {
          "headline":"Squeeze the juice from the 3 lemons.",
          "description":""
        },
        {
          "headline":"Put the lemon juice and water mixture in the fridge overnight.",
          "description":"Put the ice cream maker in the freezer overnight."
        },
        {
          "headline":"Put the lemon juice and water mixture into the ice cream maker the following day.",
          "description":"Follow the instructions."
        },
        {
          "headline":"Remove the sorbet.",
          "description":"Serve."
        }
      ]
    },
    {
      "name":"Creamy Lemon Sorbet",
      "steps":[
        {
          "headline":"Add the sugar, water, lemon juice and lemon zest to a large bowl.",
          "description":"Cover the bowl. Set aside for 2 hours, to strengthen the lemon flavor."
        },
        {
          "headline":"Remove the cover.",
          "description":"Mix the ingredients well until the sugar has dissolved completely. Strain through a fine mesh sieve."
        },
        {
          "headline":"Add the cream to another bowl.",
          "description":"Using an electric mixer, whip until thick."
        },
        {
          "headline":"Add the whipped cream to the lemon mixture.",
          "description":"Stir to combine."
        },
        {
          "headline":"Transfer the lemon cream mixture to the ice cream maker.",
          "description":"Follow the manufacturer's instructions."
        },
        {
          "headline":"Serve.",
          "description":"Place in sorbet bowls or dessert dishes. Garnish with the candied or glazed lemon peel and a mint leaf."
        }
      ]
    }
  ],
  "text":" Lemon Sorbet Mix 1 cup (200g) sugar and 1 cup (8oz) water in a small saucepan. For a creamier version that's similar to lemon sherbet, you may substitute milk for any amount of the water. The more milk you add, the creamier the texture will be. For an even richer, more decadent texture, you can substitute heavy cream for the water. This makes it more of a lemon ice cream and really tones down the tartness of the lemon. Cook over medium heat, stirring constantly until it begins to boil.  Reduce the heat and let it simmer for 2 minutes, uncovered.  Remove from heat and allow the mixture to cool.  Add 3/4 to 1 cup (6 to 8oz) lemon juice. This is approximately 5 to 8 lemons depending on their size. Add 1 to 3 tbs. (15ml to 45ml) lemon zest and mix well. Pour the mixture into an ice cream maker and follow the manufacturer's instructions.  Transfer the prepared lemon sorbet from the ice cream freezer to an air-tight container.  Store in the freezer until you are ready to serve. When serving, you can top your sorbet with a mint leaf for a lovely green garnish. Or you can top with fresh raspberries, strawberries, or blueberries for a colorful twist. Even a dollop of fresh whipped cream and a sprinkle of lemon zest can make for an eye-catching garnish. Finished.  Zesty Lemon Sorbet Boil the water. Add the sugar. Stir frequently until it has completely dissolved. Zest the 3 lemons.  Squeeze the juice from the 3 lemons.  Put the lemon juice and water mixture in the fridge overnight. Put the ice cream maker in the freezer overnight. Put the lemon juice and water mixture into the ice cream maker the following day. Follow the instructions. Remove the sorbet. Serve. Creamy Lemon Sorbet Add the sugar, water, lemon juice and lemon zest to a large bowl. Cover the bowl. Set aside for 2 hours, to strengthen the lemon flavor. Remove the cover. Mix the ingredients well until the sugar has dissolved completely. Strain through a fine mesh sieve. Add the cream to another bowl. Using an electric mixer, whip until thick. Add the whipped cream to the lemon mixture. Stir to combine. Transfer the lemon cream mixture to the ice cream maker. Follow the manufacturer's instructions. Serve. Place in sorbet bowls or dessert dishes. Garnish with the candied or glazed lemon peel and a mint leaf.",
  "tyn_model":[
    "water",
    "lemon",
    "sugar",
    "ice cream maker",
    "milk",
    "lemon juice",
    "whipped cream",
    "bowl",
    "small saucepan",
    "lemon sherbet",
    "heavy cream",
    "ice cream",
    "lemon zest",
    "lemon sorbet",
    "ice cream freezer",
    "air-tight container",
    "freezer",
    "strawberries",
    "blueberries",
    "large bowl",
    "fine mesh sieve",
    "cream",
    "electric mixer",
    "lemon cream",
    "sorbet bowls",
    "mint leaf"
  ],
  "tyn_section":[

  ]
}