{
  "title":"How to Make Cinnamon Star Cookies",
  "url":"https://www.wikihow.com/Make-Cinnamon-Star-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "steps":[
    {
      "headline":"Grind 2 1/3 cups whole almonds to a fine powder.",
      "description":""
    },
    {
      "headline":"Beat 3 egg whites and 1 tsp.",
      "description":"(5ml) lemon juice until stiff."
    },
    {
      "headline":"Add 1 cup (225g) plus 3 tbs.",
      "description":"(45ml) confectioners (powdered) sugar very gradually and mix until it is dissolved."
    },
    {
      "headline":"Remove 3/4 of a cup (6oz.)",
      "description":"of this sugar and egg mixture and set it aside for the meringue glaze."
    },
    {
      "headline":"Fold the ground almonds into the remaining mixture along with 1 tsp.",
      "description":"(5ml) cinnamon and 1 tsp (5ml) vanilla extract."
    },
    {
      "headline":"Cover the dough and place it in the refrigerator for 30 minutes.",
      "description":""
    },
    {
      "headline":"Preheat the oven to 300 degrees Fahrenheit (149 degrees Celsius).",
      "description":""
    },
    {
      "headline":"Line your baking sheets with parchment paper or silicone baking mats for a non-stick surface.",
      "description":""
    },
    {
      "headline":"Separate the dough in half.",
      "description":""
    },
    {
      "headline":"Roll half of the dough on a surface dusted with powdered sugar to ⁄4 inch (0.6 cm) thickness.",
      "description":""
    },
    {
      "headline":"Cut out the cookies using a traditional 6-point-star cookie cutter, and place them on the parchment-lined baking sheets.",
      "description":""
    },
    {
      "headline":"Top the cookies with the meringue glaze that you set aside.",
      "description":""
    },
    {
      "headline":"Repeat this process with the remaining half of the dough.",
      "description":""
    },
    {
      "headline":"Bake the cookies for 25 minutes until they have gently risen from the baking sheet.",
      "description":""
    },
    {
      "headline":"Allow to cool completely.",
      "description":""
    },
    {
      "headline":"Store the cinnamon star cookies in an air-tight container to maintain freshness.",
      "description":""
    }
  ],
  "text":" Grind 2 1/3 cups whole almonds to a fine powder.  Beat 3 egg whites and 1 tsp. (5ml) lemon juice until stiff. Add 1 cup (225g) plus 3 tbs. (45ml) confectioners (powdered) sugar very gradually and mix until it is dissolved. Remove 3/4 of a cup (6oz.) of this sugar and egg mixture and set it aside for the meringue glaze. Fold the ground almonds into the remaining mixture along with 1 tsp. (5ml) cinnamon and 1 tsp (5ml) vanilla extract. Cover the dough and place it in the refrigerator for 30 minutes.  Preheat the oven to 300 degrees Fahrenheit (149 degrees Celsius).  Line your baking sheets with parchment paper or silicone baking mats for a non-stick surface.  Separate the dough in half.  Roll half of the dough on a surface dusted with powdered sugar to ⁄4 inch (0.6 cm) thickness.  Cut out the cookies using a traditional 6-point-star cookie cutter, and place them on the parchment-lined baking sheets.  Top the cookies with the meringue glaze that you set aside.  Repeat this process with the remaining half of the dough.  Bake the cookies for 25 minutes until they have gently risen from the baking sheet.  Allow to cool completely.  Store the cinnamon star cookies in an air-tight container to maintain freshness. ",
  "tyn_model":[
    "almonds",
    "egg",
    "lemon juice",
    "confectioners (powdered) sugar",
    "sugar",
    "cinnamon",
    "vanilla extract",
    "refrigerator",
    "oven",
    "baking sheets",
    "parchment paper",
    "baking mats",
    "powdered sugar",
    "cookie cutter",
    "parchment-lined baking sheets",
    "meringue glaze",
    "baking sheet",
    "cinnamon star",
    "air-tight container"
  ],
  "tyn_section":[

  ]
}