{
  "title":"How to Stock Your Pantry for Asian Cooking",
  "url":"https://www.wikihow.com/Stock-Your-Pantry-for-Asian-Cooking",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Meal Planning"
  ],
  "methods":[
    {
      "name":"Gathering Oils, Vinegars, and Sauces",
      "steps":[
        {
          "headline":"Purchase a bottle of soy sauce.",
          "description":"Choose your favorite type of soy sauce since there are a variety available. Dark soy sauces are usually thicker and saltier than light soy sauces. Japanese light soy sauce is slightly sweet because sweet rice wine is added to the sauce. Store the soy sauce in a dark, cool part of the pantry. If you'd like a gluten-free option, choose tamari. The flavor is similar to soy sauce, but it's entirely with soybeans."
        },
        {
          "headline":"Store sesame oil in the refrigerator.",
          "description":"Buy a small jar of dark, toasted sesame oil and use just a few drops to flavor a dish. Toasted sesame has a nutty, almost smoky flavor that you can add to your cooked food. Add a few drops to steamed broccoli or vegetable stir fries. Because it's a seasoning oil, avoid cooking food in the oil. You can store sesame oil in the refrigerator for about a year. If you store the oil at room temperature, it will become rancid."
        },
        {
          "headline":"Buy a bottle of fish sauce.",
          "description":"You can use fish salt in a lot of Thai or Vietnamese recipes. Fish sauce is made by fermenting fish with salt in water. The sauce itself is dark, salty, and very smelly, but it will add an important flavor to Asian recipes. Since the sauce is fermented you can store it in your pantry for up to 2 or 3 years. Oyster sauce is another sweet and spicy sauce that isn't quite as fishy as fish sauce. For a vegetarian oyster sauce, look for one that's made with mushrooms instead of oysters."
        },
        {
          "headline":"Get several types of chili sauce.",
          "description":"A lot of Asian recipes can be made spicy. To get this heat, stir in a little chili sauce. You can buy garlic chili sauce, Thai sweet chili sauce, or sriracha sauce. If you're serving food to guests, consider setting out a small tray with different types of chili sauce so your guests can adjust their own flavors. You can keep the chili sauces stored at room temperature if you eat them within a month or two. For longer storage, keep them in the refrigerator."
        },
        {
          "headline":"Store rice wine and rice vinegar.",
          "description":"Both rice wine and rice vinegar are made by fermenting rice for a long period of time. Pay attention to recipes that call for rice wine or rice vinegar and use the correct liquid since they're not interchangeable. Rice vinegar is a mild, light vinegar that has a little sweetness to it. It's usually clear or reddish brown. Rice wine does have a low alcohol content and it gives a slightly sweet flavor to foods. Sake, mirin, and Shaoxing are all popular types of red wine vinegar that will add depth of flavor to your Asian meals."
        }
      ]
    },
    {
      "name":"Stocking Rice, Grains, and Canned Goods",
      "steps":[
        {
          "headline":"Purchase a few kinds of rice.",
          "description":"Rice is a great base for many classic Asian meals. Instead of relying on the same type again and again, keep a few types of rice in your pantry. Jasmine and basmati rice work well with most meals or you could use brown rice to add a chewier, nutty texture to a dish. For Japanese recipes, consider using sushi rice or a Japanese short-grain rice. Serve your Asian meal with a side of rice or stir rice directly into soup. You can even make sticky rice to serve with sweetened fruit."
        },
        {
          "headline":"Buy a variety of noodles.",
          "description":"You'll have a lot more flexibility in cooking Asian meals if you stock several kinds of noodles. These can be made from wheat, buckwheat, or rice. Some of these noodles should be boiled and used in a dish while others can be softened in cold water. For example, make Pad Thai with softened rice noodles. Try to buy:\nRamen noodles\nRice noodles\nSoba noodles\nUdon noodles\nSomen noodles"
        },
        {
          "headline":"Keep a package of panko.",
          "description":"You've probably seen panko used in a number of recipes, but it's often used as a breading or topping in Japanese cooking. These very crunchy breadcrumbs keep for several months if you store them in an airtight container. Try coating pork chops in panko and frying them until they become crisp. You can serve the pork with ginger soy sauce and rice."
        },
        {
          "headline":"Store cans of coconut milk.",
          "description":"If you'd like to make curries or add creaminess to an Asian meal, simply add a little coconut milk. You can purchase regular coconut milk (coconut cream that is diluted with water), light coconut milk, coconut cream, or powdered coconut milk."
        },
        {
          "headline":"Get a few curry pastes.",
          "description":"Curry pastes are an easy way to add an incredible amount of flavor to curries, stews, sauces, and soups. Look for concentrated curry pastes that are sold in small jars instead of simmer sauces. Try a few of the these curry pastes:\nRed\nGreen\nYellow\nPanang\nMassaman"
        }
      ]
    },
    {
      "name":"Storing Nuts and Flavorings",
      "steps":[
        {
          "headline":"Get a jar of peanuts.",
          "description":"Many Southeast Asian recipes use peanuts to add texture and a buttery flavor. Sprinkle chopped, roasted peanuts over curries, stir fries, or salad rolls. You can also grind the peanuts into flavorful dipping sauces. Try garnishing Thai noodles with crushed peanuts. You can also use cashews in many Chinese-American dishes, such as cashew chicken."
        },
        {
          "headline":"Store sesame seeds in the refrigerator.",
          "description":"Sesame seeds are used to give foods a little crunch or to garnish a dish. You can use white or black sesame seeds, but you'll need to keep them in the refrigerator to prevent them from turning rancid. You could make honey sesame chicken or crispy sesame chicken with rice."
        },
        {
          "headline":"Keep miso paste in the refrigerator.",
          "description":"Get white, red, or yellow miso in the refrigerated section of an Asian market or grocery store. Miso is a thick paste made from fermented soybeans and it can add a burst of flavor to soups, roasted vegetables, marinades, and sauces. Although miso paste is a pantry staple, you'll need to keep it in its airtight container in the refrigerator. It will last 9 months to 1 year. Use the miso to make classic miso soup or stir a spoonful into vinegar to make a marinade for meats."
        },
        {
          "headline":"Keep dried mushrooms.",
          "description":"Dried mushrooms are often used to add the umami flavor to Asian foods. You can rehydrate dried shiitake mushrooms in hot water and cook with them. Recipes might also call for the soaking liquid to add an extra mushroom flavor to meals. Soften and cook the mushrooms with beef stir fries or in mushroom curries."
        },
        {
          "headline":"Store and rotate common Asian spices and herbs.",
          "description":"Try to buy several ground, dried herbs and spices. Label the spices with the date that you purchased them and try to use them within 6 months. The flavor will fade over time, so replace them regularly. Common Asian spices and herbs include:\nGround ginger\nStar anise\nCloves\nCumin and coriander\nWhole peppercorns\nTumeric\nCinnamon\nDried hot chilies\nFive-spice powder"
        }
      ]
    }
  ],
  "text":" Gathering Oils, Vinegars, and Sauces Purchase a bottle of soy sauce. Choose your favorite type of soy sauce since there are a variety available. Dark soy sauces are usually thicker and saltier than light soy sauces. Japanese light soy sauce is slightly sweet because sweet rice wine is added to the sauce. Store the soy sauce in a dark, cool part of the pantry. If you'd like a gluten-free option, choose tamari. The flavor is similar to soy sauce, but it's entirely with soybeans. Store sesame oil in the refrigerator. Buy a small jar of dark, toasted sesame oil and use just a few drops to flavor a dish. Toasted sesame has a nutty, almost smoky flavor that you can add to your cooked food. Add a few drops to steamed broccoli or vegetable stir fries. Because it's a seasoning oil, avoid cooking food in the oil. You can store sesame oil in the refrigerator for about a year. If you store the oil at room temperature, it will become rancid. Buy a bottle of fish sauce. You can use fish salt in a lot of Thai or Vietnamese recipes. Fish sauce is made by fermenting fish with salt in water. The sauce itself is dark, salty, and very smelly, but it will add an important flavor to Asian recipes. Since the sauce is fermented you can store it in your pantry for up to 2 or 3 years. Oyster sauce is another sweet and spicy sauce that isn't quite as fishy as fish sauce. For a vegetarian oyster sauce, look for one that's made with mushrooms instead of oysters. Get several types of chili sauce. A lot of Asian recipes can be made spicy. To get this heat, stir in a little chili sauce. You can buy garlic chili sauce, Thai sweet chili sauce, or sriracha sauce. If you're serving food to guests, consider setting out a small tray with different types of chili sauce so your guests can adjust their own flavors. You can keep the chili sauces stored at room temperature if you eat them within a month or two. For longer storage, keep them in the refrigerator. Store rice wine and rice vinegar. Both rice wine and rice vinegar are made by fermenting rice for a long period of time. Pay attention to recipes that call for rice wine or rice vinegar and use the correct liquid since they're not interchangeable. Rice vinegar is a mild, light vinegar that has a little sweetness to it. It's usually clear or reddish brown. Rice wine does have a low alcohol content and it gives a slightly sweet flavor to foods. Sake, mirin, and Shaoxing are all popular types of red wine vinegar that will add depth of flavor to your Asian meals. Stocking Rice, Grains, and Canned Goods Purchase a few kinds of rice. Rice is a great base for many classic Asian meals. Instead of relying on the same type again and again, keep a few types of rice in your pantry. Jasmine and basmati rice work well with most meals or you could use brown rice to add a chewier, nutty texture to a dish. For Japanese recipes, consider using sushi rice or a Japanese short-grain rice. Serve your Asian meal with a side of rice or stir rice directly into soup. You can even make sticky rice to serve with sweetened fruit. Buy a variety of noodles. You'll have a lot more flexibility in cooking Asian meals if you stock several kinds of noodles. These can be made from wheat, buckwheat, or rice. Some of these noodles should be boiled and used in a dish while others can be softened in cold water. For example, make Pad Thai with softened rice noodles. Try to buy:\nRamen noodles\nRice noodles\nSoba noodles\nUdon noodles\nSomen noodles Keep a package of panko. You've probably seen panko used in a number of recipes, but it's often used as a breading or topping in Japanese cooking. These very crunchy breadcrumbs keep for several months if you store them in an airtight container. Try coating pork chops in panko and frying them until they become crisp. You can serve the pork with ginger soy sauce and rice. Store cans of coconut milk. If you'd like to make curries or add creaminess to an Asian meal, simply add a little coconut milk. You can purchase regular coconut milk (coconut cream that is diluted with water), light coconut milk, coconut cream, or powdered coconut milk. Get a few curry pastes. Curry pastes are an easy way to add an incredible amount of flavor to curries, stews, sauces, and soups. Look for concentrated curry pastes that are sold in small jars instead of simmer sauces. Try a few of the these curry pastes:\nRed\nGreen\nYellow\nPanang\nMassaman Storing Nuts and Flavorings Get a jar of peanuts. Many Southeast Asian recipes use peanuts to add texture and a buttery flavor. Sprinkle chopped, roasted peanuts over curries, stir fries, or salad rolls. You can also grind the peanuts into flavorful dipping sauces. Try garnishing Thai noodles with crushed peanuts. You can also use cashews in many Chinese-American dishes, such as cashew chicken. Store sesame seeds in the refrigerator. Sesame seeds are used to give foods a little crunch or to garnish a dish. You can use white or black sesame seeds, but you'll need to keep them in the refrigerator to prevent them from turning rancid. You could make honey sesame chicken or crispy sesame chicken with rice. Keep miso paste in the refrigerator. Get white, red, or yellow miso in the refrigerated section of an Asian market or grocery store. Miso is a thick paste made from fermented soybeans and it can add a burst of flavor to soups, roasted vegetables, marinades, and sauces. Although miso paste is a pantry staple, you'll need to keep it in its airtight container in the refrigerator. It will last 9 months to 1 year. Use the miso to make classic miso soup or stir a spoonful into vinegar to make a marinade for meats. Keep dried mushrooms. Dried mushrooms are often used to add the umami flavor to Asian foods. You can rehydrate dried shiitake mushrooms in hot water and cook with them. Recipes might also call for the soaking liquid to add an extra mushroom flavor to meals. Soften and cook the mushrooms with beef stir fries or in mushroom curries. Store and rotate common Asian spices and herbs. Try to buy several ground, dried herbs and spices. Label the spices with the date that you purchased them and try to use them within 6 months. The flavor will fade over time, so replace them regularly. Common Asian spices and herbs include:\nGround ginger\nStar anise\nCloves\nCumin and coriander\nWhole peppercorns\nTumeric\nCinnamon\nDried hot chilies\nFive-spice powder",
  "tyn_model":[
    "rice",
    "coconut milk",
    "peanuts",
    "soy sauce",
    "rice wine",
    "rice vinegar",
    "curry pastes",
    "sesame oil",
    "fish sauce",
    "mushrooms",
    "chili sauce",
    "noodles",
    "panko",
    "miso",
    "herbs",
    "spices",
    "sesame",
    "water",
    "vinegar",
    "coconut cream",
    "miso paste",
    "sweet rice wine",
    "vegetable stir fries",
    "fish salt",
    "fish",
    "salt",
    "oyster sauce",
    "sriracha sauce",
    "chili sauces",
    "refrigerator",
    "mirin",
    "red wine vinegar",
    "grains",
    "brown rice",
    "sushi rice",
    "sticky rice",
    "rice noodles",
    "ramen",
    "udon",
    "airtight container",
    "ginger soy sauce",
    "southeast asian recipes",
    "stir fries",
    "cashews",
    "cashew chicken",
    "sesame seeds",
    "sauces",
    "shiitake mushrooms",
    "mushroom curries",
    "ground ginger",
    "star anise\ncloves",
    "cumin",
    "coriander",
    "peppercorns",
    "tumeric",
    "cinnamon",
    "chilies",
    "five-spice powder"
  ],
  "tyn_section":[

  ]
}