{
  "title":"How to Shut Off Utilities in Your Old Home",
  "url":"https://www.wikihow.com/Shut-Off-Utilities-in-Your-Old-Home",
  "category_hierarchy":[
    "Home and Garden",
    "Moving and Removals",
    "Planning to Move"
  ],
  "parts":[
    {
      "name":"Gathering Information",
      "steps":[
        {
          "headline":"Make a list of utility accounts.",
          "description":"This will likely include electric, gas, heating, cooling, water, sewer and trash removal. This may also include internet, phone, and cable. Write down each service, the name of your provider, and the telephone number. This will help ensure that you cover all of your bases, and that no utility gets mistakenly left out."
        },
        {
          "headline":"Gather your account information.",
          "description":"When you call each company, they are going to need some information from you. In most instances, this will include some kind of account number, as well as your home address. In some cases, you may also need to provide a password, or other personal information (such as a social security number) to verify your identity. Gather this information before you call."
        },
        {
          "headline":"Make sure you are not violating a contract.",
          "description":"Some companies (often internet providers, for example) require you to sign a contract at the time of installation. Before you call to cancel, it is a good idea to figure out where you stand with your contract. If you will be violating your contract, you may be charged a steep fee. If this is the case for you, look into transferring your service to your new home."
        },
        {
          "headline":"Consider a transfer of service.",
          "description":"Particularly with media services (like phone, internet, and cable) it is relatively easy to transfer your service to your new home (as long as your provider offers service in that area). If you will be in the same city or even state, your electric, water, or trash company may stay the same as well. Before you cancel your service, determine whether or not any of your accounts will qualify for a transfer. (You can do this by calling each company and inquiring). Often, they can simply use your existing deposit and personal information, making the process of moving much more smooth."
        },
        {
          "headline":"Choose a day.",
          "description":"You don’t want to pay for utilities that you aren’t going to use. At the same time, you don’t want to be stuck at home with no water or electricity. In other words, think carefully about the exact date you’d like your utility services to cease. You will likely need about 2-3 weeks between when you call to cancel, and the exact day you’d like your services to end, so begin thinking about this as early as possible."
        }
      ]
    },
    {
      "name":"Closing Accounts",
      "steps":[
        {
          "headline":"Contact each company.",
          "description":"Moving down the list you created, contact each company one at a time, and inform them of your move. Once again, be sure to have any relevant account information or personal information ready when you call. You will want to call 2-3 weeks prior to your move."
        },
        {
          "headline":"Return equipment.",
          "description":"In some instances, you will need to return some equipment in order to close your account. If you have any equipment belonging to the company (such as an internet router), ask them what you should do with the equipment. If they say you must return it in person, be sure to drop it off before you move. When you do so, ask for a receipt, so there will be no dispute when it is time to receive your deposit."
        },
        {
          "headline":"Leave equipment behind.",
          "description":"In some cases, the company may simply tell you to leave certain equipment behind. (This is sometimes the case with cable boxes, for example.) If this is the case for you, be certain to leave the equipment when you move. Consider putting it in a safe place where you know it will not be packed by mistake."
        },
        {
          "headline":"Ask for a final reading.",
          "description":"When you call to cancel your service, you should ask the company to come out and do a final reading of your meters. (This is especially true for water and gas). This reading will provide you with final numbers before you move, so that you can be sure your last bill is accurate. You may consider taking a photo of your meters with your cell phone, this way you have some proof of your final readings in the case of a dispute."
        },
        {
          "headline":"Provide a forwarding address.",
          "description":"When you call to cancel your service, you will be asked to provide a forwarding address. This is important to do if you will be receiving a deposit, or if they will still need to send your final bill."
        }
      ]
    },
    {
      "name":"Finishing the Process",
      "steps":[
        {
          "headline":"Pay any outstanding balances.",
          "description":"In order for your account to be fully closed, your account balance will need to be at zero. Inquire about any outstanding balances or fees and pay these at the time of cancellation. If you will still be receiving a final bill later, be sure to pay this bill in full when you receive it."
        },
        {
          "headline":"Inquire about your deposit.",
          "description":"Many utility companies require the payment of a deposit at the time of activation. If you have not violated your contract, if you have returned all equipment, and if you do not have an outstanding balance, you should qualify for reimbursement of this deposit. Speak to you provider about this and be sure that they send you a check."
        },
        {
          "headline":"Leave a list for the next tenants.",
          "description":"Something nice that you can do for the people who will be moving into your home after you leave is to compile a list of the utility companies you used and their telephone numbers. Of course, this is not required, but it is a nice gesture and it’s easy to do."
        },
        {
          "headline":"Bring important info with you.",
          "description":"You may need to follow up with some of these companies in the future, so you will want to compile some information, important phone numbers, and possibly even your final bill. Put all of this information in a safe place that you will be able to access after the move."
        },
        {
          "headline":"Check your final bill.",
          "description":"When you receive your final bill, check to make sure everything is accurate. Ensure that your service was terminated on the date you requested, and compare the readings on your bill with the final reading numbers you received (or photographed). If there are any inconsistencies, contact your utility company right away."
        }
      ]
    }
  ],
  "text":" Gathering Information Make a list of utility accounts. This will likely include electric, gas, heating, cooling, water, sewer and trash removal. This may also include internet, phone, and cable. Write down each service, the name of your provider, and the telephone number. This will help ensure that you cover all of your bases, and that no utility gets mistakenly left out. Gather your account information. When you call each company, they are going to need some information from you. In most instances, this will include some kind of account number, as well as your home address. In some cases, you may also need to provide a password, or other personal information (such as a social security number) to verify your identity. Gather this information before you call. Make sure you are not violating a contract. Some companies (often internet providers, for example) require you to sign a contract at the time of installation. Before you call to cancel, it is a good idea to figure out where you stand with your contract. If you will be violating your contract, you may be charged a steep fee. If this is the case for you, look into transferring your service to your new home. Consider a transfer of service. Particularly with media services (like phone, internet, and cable) it is relatively easy to transfer your service to your new home (as long as your provider offers service in that area). If you will be in the same city or even state, your electric, water, or trash company may stay the same as well. Before you cancel your service, determine whether or not any of your accounts will qualify for a transfer. (You can do this by calling each company and inquiring). Often, they can simply use your existing deposit and personal information, making the process of moving much more smooth. Choose a day. You don’t want to pay for utilities that you aren’t going to use. At the same time, you don’t want to be stuck at home with no water or electricity. In other words, think carefully about the exact date you’d like your utility services to cease. You will likely need about 2-3 weeks between when you call to cancel, and the exact day you’d like your services to end, so begin thinking about this as early as possible. Closing Accounts Contact each company. Moving down the list you created, contact each company one at a time, and inform them of your move. Once again, be sure to have any relevant account information or personal information ready when you call. You will want to call 2-3 weeks prior to your move. Return equipment. In some instances, you will need to return some equipment in order to close your account. If you have any equipment belonging to the company (such as an internet router), ask them what you should do with the equipment. If they say you must return it in person, be sure to drop it off before you move. When you do so, ask for a receipt, so there will be no dispute when it is time to receive your deposit. Leave equipment behind. In some cases, the company may simply tell you to leave certain equipment behind. (This is sometimes the case with cable boxes, for example.) If this is the case for you, be certain to leave the equipment when you move. Consider putting it in a safe place where you know it will not be packed by mistake. Ask for a final reading. When you call to cancel your service, you should ask the company to come out and do a final reading of your meters. (This is especially true for water and gas). This reading will provide you with final numbers before you move, so that you can be sure your last bill is accurate. You may consider taking a photo of your meters with your cell phone, this way you have some proof of your final readings in the case of a dispute. Provide a forwarding address. When you call to cancel your service, you will be asked to provide a forwarding address. This is important to do if you will be receiving a deposit, or if they will still need to send your final bill. Finishing the Process Pay any outstanding balances. In order for your account to be fully closed, your account balance will need to be at zero. Inquire about any outstanding balances or fees and pay these at the time of cancellation. If you will still be receiving a final bill later, be sure to pay this bill in full when you receive it. Inquire about your deposit. Many utility companies require the payment of a deposit at the time of activation. If you have not violated your contract, if you have returned all equipment, and if you do not have an outstanding balance, you should qualify for reimbursement of this deposit. Speak to you provider about this and be sure that they send you a check. Leave a list for the next tenants. Something nice that you can do for the people who will be moving into your home after you leave is to compile a list of the utility companies you used and their telephone numbers. Of course, this is not required, but it is a nice gesture and it’s easy to do. Bring important info with you. You may need to follow up with some of these companies in the future, so you will want to compile some information, important phone numbers, and possibly even your final bill. Put all of this information in a safe place that you will be able to access after the move. Check your final bill. When you receive your final bill, check to make sure everything is accurate. Ensure that your service was terminated on the date you requested, and compare the readings on your bill with the final reading numbers you received (or photographed). If there are any inconsistencies, contact your utility company right away.",
  "tyn_model":[
    "water",
    "meters",
    "utility companies",
    "utility",
    "internet providers",
    "utilities",
    "utility services",
    "internet router",
    "cable boxes",
    "equipment",
    "cell phone",
    "utility company"
  ],
  "tyn_section":[

  ]
}