{
  "title":"How to Remove Gum from Carpet",
  "url":"https://www.wikihow.com/Remove-Gum-from-Carpet",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Carpets and Rugs"
  ],
  "methods":[
    {
      "name":"Freezing the Gum Off",
      "steps":[
        {
          "headline":"Freeze the gum with an ice pack.",
          "description":"Place several ice cubes in a resealable plastic bag and lay it on top of the gum wad. Alternatively, spraying the gum at close range with compressed air from a computer duster, or placing a piece of dry ice on the gum can also freeze it quickly. Freezing gum is most successful when the gum has just gotten into the carpet and is not ground deeply into the carpet fibers. Be sure the gum is frozen solid and not just cold before moving on to the next steps."
        },
        {
          "headline":"Use a butter knife or metal spatula to scrape the frozen gum off the carpet.",
          "description":"Gently lift the gum up off of the carpet fibers with a scraping motion. Allow it to crack and break into fragments and remove as much as possible. Rub ice over stubborn areas that won't lift off and repeat as necessary."
        },
        {
          "headline":"Clean the spot to remove any remaining residues.",
          "description":"Dip a rag into a soapy solution containing a small amount of white vinegar and gently rub the spot where the gum was to finish the cleaning process. Blot dry with a thick towel and don't walk on the area until it is completely dry."
        }
      ]
    },
    {
      "name":"Removing Gum with Oils",
      "steps":[
        {
          "headline":"Test an inconspicuous area of the carpet before using any oils to remove gum.",
          "description":"Some oils may discolor or bleach fabrics. Ensure that you aren't going to make a bigger stain by applying a small amount of oil in a hidden location and inspect for any discoloration. Oil reduces the stickiness of gum which will allow it to release from the carpet fibers. Try one of these oils to get the gum off your carpets:\nEucalyptus Oil\nOlive Oil\nPeanut Butter\nNOTE: You will need to thoroughly clean the oils out of the carpets after the gum is removed."
        },
        {
          "headline":"Apply oil to the gum with a cloth.",
          "description":"Do not pour the oil directly on the gum; it is much easier to control where you are applying the oil when it is placed on a cleaning cloth first. Saturate the gum wad with oil by repeatedly applying oil with the cleaning cloth."
        },
        {
          "headline":"Scrape the gum off gently using a butter knife.",
          "description":"Gently lift the gum off the carpet by scraping a knife over the gum in the same direction each time. Wipe the gum off the knife blade after each pass to avoid re-applying the gum to the carpet. Rubbing back and forth may damage the carpet fibers and cause more damage to your flooring."
        },
        {
          "headline":"Clean the area with dish soap and water.",
          "description":"Once the gum has been removed there may be some residual oils left from the cleaning process. Mix a teaspoon of a grease fighting dish soap with a quart of water and scrub the carpet with a cloth dipped in the soapy solution."
        }
      ]
    },
    {
      "name":"Using Other Solvents to Remove Gum",
      "steps":[
        {
          "headline":"Apply Dry-Cleaning Solvent, Citrus Based Degreaser, or Mineral Spirits to the gum.",
          "description":"These solvents will help dissolve the gum polymers making them less sticky and easier to remove from the carpet. Use a cleaning cloth to directly apply the solvent to the gum wad. A muscle rub product containing methyl salicylate can also be used as a solvent. Always test a small amount of solvent on a hidden area of your carpet to ensure that no staining will result from using the solvent to remove gum."
        },
        {
          "headline":"Allow the solvent time to absorb into the gum.",
          "description":"Wait 5 to 10 minutes, depending on the hardness of the gum, before attempting to remove the gum. During this time the solvents will work their way into the gum polymers and loosen the structures thereby releasing the gum from the carpet."
        },
        {
          "headline":"Scrape off the gum with a butter knife.",
          "description":"Use a scraping motion in the same direction with each pass to avoid damaging the carpet fibers."
        },
        {
          "headline":"Sponge the area with a solution made from 1 teaspoon of mild detergent and 1 quart of lukewarm water.",
          "description":"Finish the cleaning process by removing any traces of the solvents with soap and water. Blot dry with a towel, and enjoy your gum free carpets."
        }
      ]
    }
  ],
  "text":" Freezing the Gum Off Freeze the gum with an ice pack. Place several ice cubes in a resealable plastic bag and lay it on top of the gum wad. Alternatively, spraying the gum at close range with compressed air from a computer duster, or placing a piece of dry ice on the gum can also freeze it quickly. Freezing gum is most successful when the gum has just gotten into the carpet and is not ground deeply into the carpet fibers. Be sure the gum is frozen solid and not just cold before moving on to the next steps. Use a butter knife or metal spatula to scrape the frozen gum off the carpet. Gently lift the gum up off of the carpet fibers with a scraping motion. Allow it to crack and break into fragments and remove as much as possible. Rub ice over stubborn areas that won't lift off and repeat as necessary. Clean the spot to remove any remaining residues. Dip a rag into a soapy solution containing a small amount of white vinegar and gently rub the spot where the gum was to finish the cleaning process. Blot dry with a thick towel and don't walk on the area until it is completely dry. Removing Gum with Oils Test an inconspicuous area of the carpet before using any oils to remove gum. Some oils may discolor or bleach fabrics. Ensure that you aren't going to make a bigger stain by applying a small amount of oil in a hidden location and inspect for any discoloration. Oil reduces the stickiness of gum which will allow it to release from the carpet fibers. Try one of these oils to get the gum off your carpets:\nEucalyptus Oil\nOlive Oil\nPeanut Butter\nNOTE: You will need to thoroughly clean the oils out of the carpets after the gum is removed. Apply oil to the gum with a cloth. Do not pour the oil directly on the gum; it is much easier to control where you are applying the oil when it is placed on a cleaning cloth first. Saturate the gum wad with oil by repeatedly applying oil with the cleaning cloth. Scrape the gum off gently using a butter knife. Gently lift the gum off the carpet by scraping a knife over the gum in the same direction each time. Wipe the gum off the knife blade after each pass to avoid re-applying the gum to the carpet. Rubbing back and forth may damage the carpet fibers and cause more damage to your flooring. Clean the area with dish soap and water. Once the gum has been removed there may be some residual oils left from the cleaning process. Mix a teaspoon of a grease fighting dish soap with a quart of water and scrub the carpet with a cloth dipped in the soapy solution. Using Other Solvents to Remove Gum Apply Dry-Cleaning Solvent, Citrus Based Degreaser, or Mineral Spirits to the gum. These solvents will help dissolve the gum polymers making them less sticky and easier to remove from the carpet. Use a cleaning cloth to directly apply the solvent to the gum wad. A muscle rub product containing methyl salicylate can also be used as a solvent. Always test a small amount of solvent on a hidden area of your carpet to ensure that no staining will result from using the solvent to remove gum. Allow the solvent time to absorb into the gum. Wait 5 to 10 minutes, depending on the hardness of the gum, before attempting to remove the gum. During this time the solvents will work their way into the gum polymers and loosen the structures thereby releasing the gum from the carpet. Scrape off the gum with a butter knife. Use a scraping motion in the same direction with each pass to avoid damaging the carpet fibers. Sponge the area with a solution made from 1 teaspoon of mild detergent and 1 quart of lukewarm water. Finish the cleaning process by removing any traces of the solvents with soap and water. Blot dry with a towel, and enjoy your gum free carpets.",
  "tyn_model":[
    "oil",
    "solvent",
    "water",
    "butter knife",
    "oils",
    "towel",
    "knife",
    "dish soap",
    "ice pack",
    "ice cubes",
    "resealable plastic bag",
    "compressed air",
    "dry ice",
    "gum",
    "ice",
    "rag",
    "white vinegar",
    "eucalyptus oil",
    "olive oil",
    "peanut butter",
    "cloth",
    "cleaning cloth",
    "dry-cleaning solvent",
    "citrus based degreaser",
    "mineral spirits",
    "methyl salicylate",
    "mild detergent",
    "soap"
  ],
  "tyn_section":[

  ]
}