{
  "title":"How to Play Plants Vs. Zombies in Real Life",
  "url":"https://www.wikihow.com/Play-Plants-Vs.-Zombies-in-Real-Life",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Plants vs. Zombies"
  ],
  "steps":[
    {
      "headline":"Set up the playing field.",
      "description":"Use your selection of bricks or sticks to draw a border on one end of the lawn. Set up the cinder block right behind it. On the other side of the line, scatter the cement slabs around. Use a marker to label them 1, 2, 3, 4, 5, etc."
    },
    {
      "headline":"Pick teams.",
      "description":"They need to be completely equal. If you have an odd number, the plants get the last player. If you are picked for the plants, decide who will be the leader."
    },
    {
      "headline":"Once you have a leader for the plants, they will take the leafy branch, and stand on the cinder-block.",
      "description":"From there, they will label each of the plants. (Not with a marker.) 1, 2, 3, 4, 5, etc. Then, they will instruct each plant, (calling them by plant number) to stand on one of the concrete slabs you set up and labeled, (which are called stations, by the way.)"
    },
    {
      "headline":"Arm the teams.",
      "description":"Each one of the zombies gets a bat or tennis racket. Each plant, except for the leader, gets a dodgeball. They stand on their station. The zombies stand on the other side of the lawn."
    },
    {
      "headline":"Start the game.",
      "description":"Everybody yells: \"The zombies are coming\" as loud as they can. This start the game."
    },
    {
      "headline":"The zombies start by doing a \"zombie walk\" slowly across the yard.",
      "description":"Their goal is to get past the line in front of the plant leader, who should be on the cinder-block."
    },
    {
      "headline":"The plant leader yells at the plants, (addressing them by number) telling them what to do.",
      "description":"For example, the leader could shout \"Plant number 3! Throw at zombie number 2!\""
    },
    {
      "headline":"If a zombie gets hit, they stop, and go back to where they began.",
      "description":"A zombie has to get hit twice before they are out of the game. So basically, if you're a zombie and get hit, go back to the zombie starting place and start over."
    },
    {
      "headline":"If a plant misses while throwing, they have to run and manually get the ball.",
      "description":"They must be back on the station before they are permitted to throw again. (Even then they must be told to do so by the plant leader.)"
    },
    {
      "headline":"If a zombie wishes, they may knock the ball away with their bat or tennis racket.",
      "description":"The plant has to leave the station to get it, and as usual, cannot throw again until on the station and told to do so."
    },
    {
      "headline":"If a zombie passes the border, the plant leader chooses a plant to get out of the game, and the zombie gets to start again, even if they only have one life.",
      "description":""
    },
    {
      "headline":"If one team loses all their members, (the zombies cross the line a number of times equal to the number of plants, or all the zombies get hit twice) the side that still has members wins.",
      "description":""
    }
  ],
  "text":" Set up the playing field. Use your selection of bricks or sticks to draw a border on one end of the lawn. Set up the cinder block right behind it. On the other side of the line, scatter the cement slabs around. Use a marker to label them 1, 2, 3, 4, 5, etc. Pick teams. They need to be completely equal. If you have an odd number, the plants get the last player. If you are picked for the plants, decide who will be the leader. Once you have a leader for the plants, they will take the leafy branch, and stand on the cinder-block. From there, they will label each of the plants. (Not with a marker.) 1, 2, 3, 4, 5, etc. Then, they will instruct each plant, (calling them by plant number) to stand on one of the concrete slabs you set up and labeled, (which are called stations, by the way.) Arm the teams. Each one of the zombies gets a bat or tennis racket. Each plant, except for the leader, gets a dodgeball. They stand on their station. The zombies stand on the other side of the lawn. Start the game. Everybody yells: \"The zombies are coming\" as loud as they can. This start the game. The zombies start by doing a \"zombie walk\" slowly across the yard. Their goal is to get past the line in front of the plant leader, who should be on the cinder-block. The plant leader yells at the plants, (addressing them by number) telling them what to do. For example, the leader could shout \"Plant number 3! Throw at zombie number 2!\" If a zombie gets hit, they stop, and go back to where they began. A zombie has to get hit twice before they are out of the game. So basically, if you're a zombie and get hit, go back to the zombie starting place and start over. If a plant misses while throwing, they have to run and manually get the ball. They must be back on the station before they are permitted to throw again. (Even then they must be told to do so by the plant leader.) If a zombie wishes, they may knock the ball away with their bat or tennis racket. The plant has to leave the station to get it, and as usual, cannot throw again until on the station and told to do so. If a zombie passes the border, the plant leader chooses a plant to get out of the game, and the zombie gets to start again, even if they only have one life.  If one team loses all their members, (the zombies cross the line a number of times equal to the number of plants, or all the zombies get hit twice) the side that still has members wins. ",
  "tyn_model":[
    "zombies",
    "plants",
    "plant",
    "marker",
    "bat",
    "tennis racket",
    "bricks",
    "cinder block",
    "cement",
    "cinder-"
  ],
  "tyn_section":[

  ]
}