{
  "title":"How to Troubleshoot Mold on Interior Walls",
  "url":"https://www.wikihow.com/Troubleshoot-Mold-on-Interior-Walls",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "parts":[
    {
      "name":"Identifying Mold and Its Sources",
      "steps":[
        {
          "headline":"Examine areas with excessive moisture.",
          "description":"Check your home for sources of excessive moisture. These include flooding, water leaks, damp basements, HVAC duct systems or shower or cooking steam. Look for uninsulated exterior windows and walls, including uninsulated closets along exterior walls where mold can grow when you run your heating in the winter. Check the airflow in your home. Consult with a contractor to ensure your air conditioning unit is appropriately sized for your home."
        },
        {
          "headline":"Look for mold’s food sources.",
          "description":"Mold grows on organic food sources, including other mold. Search for discoloration around wallpaper, wallpaper glue, ceiling tiles, carpeting, paper, textiles, and wood products that indicate mold growth. Also check for excessive dirt and moisture near your walls."
        },
        {
          "headline":"Look for discolored patches on walls, furniture, and carpeting.",
          "description":"Look for patches of mold in colors ranging from white to orange and green to brown and black. Check for speckled or cottony growth on walls, especially near water-damaged surfaces. You may also see furry growth and black stains."
        },
        {
          "headline":"Smell for earthy, musty odors.",
          "description":"Your basement and bathrooms might have the mustiest smells, which can be your first sign of a mold problem. Also check for a strong musty odor in walls, ceilings, floors, carpets, books, or piles of newspapers. Damp, mildewing textiles, like rugs and clothing, will also smell sour."
        }
      ]
    },
    {
      "name":"Fixing the Sources of Mold",
      "steps":[
        {
          "headline":"Prevent excess moisture in your home.",
          "description":"Dry water that accumulates indoors after heavy rains. Use an indoor/outdoor vacuum on major puddles. After a flood, remove any water-damaged items that can’t be thoroughly dried, including carpets, bedding, and furniture. Don't leave wet clothes or towels lying around the house. Hang clothes to dry after laundering them or put them in the drier immediately. Dry wet spots on carpets and rugs within 24-48 hours. Run an exhaust fan or open the window when you shower. Wipe down the floor and walls in your bathroom after a shower. Regrade your yard so it slopes away from your home. If it slopes towards your house,  water doesn’t collect in your basement or crawlspace."
        },
        {
          "headline":"Improve your home’s air circulation after floods or heavy rains.",
          "description":"Lower humidity by running dehumidifiers and window air conditioners. Use fans, but only within 48 hours of flooding or else mold spores can be blown around. Avoid using heaters or turning up the heat in confined areas because mold grows more quickly in higher temperatures."
        },
        {
          "headline":"Clean and seal your air conditioner’s parts.",
          "description":"Use a ½ percent bleach solution to clean the condensation pan under the coil of your central air conditioner. Also check to be sure the drain on your air conditioner is working properly. Seal any leaky air conditioner duct joints with flexible mastic. Sealing the ducts is especially important if they run through a hot attic where the heat and leaky cool air create moisture for mold to grow. Clean all humidifiers, which both distribute mold throughout your home and give mold a place to grow. Use an antimicrobial solution to clean humidifier reservoirs."
        }
      ]
    },
    {
      "name":"Cleaning Mold",
      "steps":[
        {
          "headline":"Protect your health when cleaning mold.",
          "description":"Wear rubber gloves, eye goggles, and an N-95 respirator. Look for the respirator at hardware stores. Also wear long sleeves and long pants that you can launder or discard immediately. Plan to undress in the room that you’ve cleaned of mold. Open the windows to ensure good ventilation when you clean. You can also use a 3M#1860 or TC-21C particulate respirator. After you clean, put the clothes in a plastic bag for the laundry or disposal so you don’t spread mold spores in other areas of your home. Don’t let other people or pets into the space where you are cleaning the mold."
        },
        {
          "headline":"Scrub hard surfaces with a non-ammonia detergent or soap.",
          "description":"First wet the surface you’ll clean to cut down on mold flying around while you scrub. Use the soap and a stiff bristled scrub brush to remove mold from hard plastic, glass, and metal. You might need to sand growth on structural wood, including wall studs."
        },
        {
          "headline":"Remove porous surfaces covered in mold.",
          "description":"These can include paper, drywall, insulation, ceiling tiles, carpets, and carpet padding. Discard these carefully in sealed plastic bags. Replace any moldy wood trim and floorboards."
        },
        {
          "headline":"Disinfect the area with bleach.",
          "description":"Combine 1.5 cups (360 mL) of chlorine bleach with one gallon (3.785 L) of water. Wipe this on the surfaces that you’ve cleaned. Keep the area wet for 15-30 minutes so the bleach can effectively disinfect the surface."
        },
        {
          "headline":"Rinse and dry the cleaned surface.",
          "description":"Use clean water to rinse after you’ve disinfected. Immediately dry the area you’ve cleaned. Use fans, open windows, and/or dehumidifiers to accelerate the drying process."
        },
        {
          "headline":"Apply a paint with antimicrobial properties.",
          "description":"Combat future mold by painting the area with an antimicrobial paint. Only paint after you have properly cleaned and dried the surface. If you don’t want an antimicrobial paint, choose a latex-based paint that will allow the air to flow through your interior walls and reduce future mold growth. Monitor the area frequently to prevent or address any future outbreaks."
        }
      ]
    }
  ],
  "text":" Identifying Mold and Its Sources Examine areas with excessive moisture. Check your home for sources of excessive moisture. These include flooding, water leaks, damp basements, HVAC duct systems or shower or cooking steam. Look for uninsulated exterior windows and walls, including uninsulated closets along exterior walls where mold can grow when you run your heating in the winter. Check the airflow in your home. Consult with a contractor to ensure your air conditioning unit is appropriately sized for your home. Look for mold’s food sources. Mold grows on organic food sources, including other mold. Search for discoloration around wallpaper, wallpaper glue, ceiling tiles, carpeting, paper, textiles, and wood products that indicate mold growth. Also check for excessive dirt and moisture near your walls. Look for discolored patches on walls, furniture, and carpeting. Look for patches of mold in colors ranging from white to orange and green to brown and black. Check for speckled or cottony growth on walls, especially near water-damaged surfaces. You may also see furry growth and black stains. Smell for earthy, musty odors. Your basement and bathrooms might have the mustiest smells, which can be your first sign of a mold problem. Also check for a strong musty odor in walls, ceilings, floors, carpets, books, or piles of newspapers. Damp, mildewing textiles, like rugs and clothing, will also smell sour. Fixing the Sources of Mold Prevent excess moisture in your home. Dry water that accumulates indoors after heavy rains. Use an indoor/outdoor vacuum on major puddles. After a flood, remove any water-damaged items that can’t be thoroughly dried, including carpets, bedding, and furniture. Don't leave wet clothes or towels lying around the house. Hang clothes to dry after laundering them or put them in the drier immediately. Dry wet spots on carpets and rugs within 24-48 hours. Run an exhaust fan or open the window when you shower. Wipe down the floor and walls in your bathroom after a shower. Regrade your yard so it slopes away from your home. If it slopes towards your house,  water doesn’t collect in your basement or crawlspace. Improve your home’s air circulation after floods or heavy rains. Lower humidity by running dehumidifiers and window air conditioners. Use fans, but only within 48 hours of flooding or else mold spores can be blown around. Avoid using heaters or turning up the heat in confined areas because mold grows more quickly in higher temperatures. Clean and seal your air conditioner’s parts. Use a ½ percent bleach solution to clean the condensation pan under the coil of your central air conditioner. Also check to be sure the drain on your air conditioner is working properly. Seal any leaky air conditioner duct joints with flexible mastic. Sealing the ducts is especially important if they run through a hot attic where the heat and leaky cool air create moisture for mold to grow. Clean all humidifiers, which both distribute mold throughout your home and give mold a place to grow. Use an antimicrobial solution to clean humidifier reservoirs. Cleaning Mold Protect your health when cleaning mold. Wear rubber gloves, eye goggles, and an N-95 respirator. Look for the respirator at hardware stores. Also wear long sleeves and long pants that you can launder or discard immediately. Plan to undress in the room that you’ve cleaned of mold. Open the windows to ensure good ventilation when you clean. You can also use a 3M#1860 or TC-21C particulate respirator. After you clean, put the clothes in a plastic bag for the laundry or disposal so you don’t spread mold spores in other areas of your home. Don’t let other people or pets into the space where you are cleaning the mold. Scrub hard surfaces with a non-ammonia detergent or soap. First wet the surface you’ll clean to cut down on mold flying around while you scrub. Use the soap and a stiff bristled scrub brush to remove mold from hard plastic, glass, and metal. You might need to sand growth on structural wood, including wall studs. Remove porous surfaces covered in mold. These can include paper, drywall, insulation, ceiling tiles, carpets, and carpet padding. Discard these carefully in sealed plastic bags. Replace any moldy wood trim and floorboards. Disinfect the area with bleach. Combine 1.5 cups (360 mL) of chlorine bleach with one gallon (3.785 L) of water. Wipe this on the surfaces that you’ve cleaned. Keep the area wet for 15-30 minutes so the bleach can effectively disinfect the surface. Rinse and dry the cleaned surface. Use clean water to rinse after you’ve disinfected. Immediately dry the area you’ve cleaned. Use fans, open windows, and/or dehumidifiers to accelerate the drying process. Apply a paint with antimicrobial properties. Combat future mold by painting the area with an antimicrobial paint. Only paint after you have properly cleaned and dried the surface. If you don’t want an antimicrobial paint, choose a latex-based paint that will allow the air to flow through your interior walls and reduce future mold growth. Monitor the area frequently to prevent or address any future outbreaks.",
  "tyn_model":[
    "water",
    "paint",
    "air conditioner",
    "bleach",
    "soap",
    "air conditioning",
    "wallpaper glue",
    "mold",
    "vacuum",
    "dehumidifiers and",
    "air conditioners",
    "fans",
    "heaters",
    "flexible mastic",
    "humidifiers",
    "humidifier",
    "rubber gloves",
    "n-95 respirator",
    "respirator",
    "particulate respirator",
    "non-ammonia detergent",
    "scrub brush",
    "chlorine bleach"
  ],
  "tyn_section":[

  ]
}