{
  "title":"How to Find a Good Apartment",
  "url":"https://www.wikihow.com/Find-a-Good-Apartment",
  "category_hierarchy":[
    "Home and Garden",
    "Apartment Living"
  ],
  "parts":[
    {
      "name":"Optimizing Your Search",
      "steps":[
        {
          "headline":"Set a budget range.",
          "description":"Determine what you can afford each month by factoring your income and expenditures. Include groceries, transportation, social activities, utilities, and gym membership as your expenditures. Make sure you provide realistic numbers so that you can still save in case of emergency. Do not be tempted to look at apartments above your price range. You will waste time and resources looking at larger and newer spaces that you cannot afford. If your budget is tightly restricted, focus on finding cheap apartments that offer security and cleanliness over prime location or what your wealthier friends can afford."
        },
        {
          "headline":"Keep the bigger picture in mind.",
          "description":"Don’t be fooled by small perks. If a landlord throws in a TV or lets you move in early, it may be a waste if the apartment doesn’t meet one of your larger needs. Make sure to set your priorities and don’t compromise them. Remember that you may be locked into a lease so make your decision wisely."
        },
        {
          "headline":"Consider the time of year.",
          "description":"Prices may be much higher during the summer because that’s when a lot of people tend to search for a new apartment. Depending on where you live and whether you have a timeline, it may be best to search during October to December or February through March. People do not want to move during the holidays or cold months so take advantage of the drop in competition. Places tend to stay vacant during these times so you may see some prices drop if you are willing to wait a month or so. If you live in a location with a lot of college students, waiting until after school starts in September can help you find a reduced rental rate."
        },
        {
          "headline":"Narrow your search.",
          "description":"Don’t spend time looking at everything that’s available. Search online and create a list of no more than four or five apartments to visit. Schedule your visit as opposed to simply dropping by. Take photos and ask questions during your visit to make sure the apartment meets all your standards. If the person showing the apartment is unable to answer a question, be sure to get his contact information so that you can follow up."
        },
        {
          "headline":"Keep organized.",
          "description":"Depending on your time and resources, you may be able to look at a number of apartments. Keep all the information organized in a single document complete with pictures and a pros and cons list. You may also be able to place them on a map and order them according to convenience of travel from your work or school. Spreadsheets are great to keep track of things like rent, amenities, security deposit, lease length, and contact information. Keep any additional notes and how many times you have visited the location. The more informed of a decision you can make, the better."
        },
        {
          "headline":"Research public transportation.",
          "description":"Public transportation can save you money or be necessary during emergencies. Make sure you know how far your apartment is from major transportation routes. Even if you have a car, researching how much you may save on insurance, gas, and travel time may cause you to change how you commute."
        },
        {
          "headline":"Look into new construction.",
          "description":"It may seem counterintuitive but new buildings may have reasonable rents because a new apartment complex may want to fill up as fast as possible. Owners and managers may be flexible with their rent if they are trying to lease the entire building. Make sure to see if there is room to negotiate."
        },
        {
          "headline":"Use an apartment locator.",
          "description":"Apartment locators are in constant contact with landlords and may become aware of decreases in prices, rent specials, or deals before they become available to the public. They may have personal relationships with landlords that can help you find a deal unavailable to anyone else. Search social media or job boards for apartment locators. It may be free to use the services of an apartment locator in your city so research any costs that may be associated before investing."
        },
        {
          "headline":"Broaden your search.",
          "description":"If you have been looking for a while and you are finding it increasingly difficult to find an apartment in your price range, expand your search criteria. You may look at locations a little bit further than you originally planned or building without certain amenities. Prioritize what you are able to be flexible with and change your search criteria. Many times it is the location that is the most difficult thing to find as the most prime apartments are often taken or priced for their coveted location. While your commute may factor into your location, also factor in safety and cleanliness. Adding a few minutes to your commute is an easy sacrifice for a safe and clean apartment."
        }
      ]
    },
    {
      "name":"Evaluating Your Final Choices",
      "steps":[
        {
          "headline":"Bring your roommates.",
          "description":"If you’re moving with other people, make sure that everyone has a chance to see the place before signing anything. Get everyone’s feedback and opinion and make sure you all get a chance to discuss your likes and dislikes. Don’t rely on pictures. Make sure that each roommate gets to physically see the apartment so that they can form a solid opinion."
        },
        {
          "headline":"Ask about special discounts.",
          "description":"There may be special move-in offers or certain special discounts depending on the apartment. Some landlords offer the first month free if you sign a longer lease. You may also get bonuses if you have referred a friend. It never hurts to ask what’s available to you. There may also be discounts for students, retirees, veterans, or individuals with special needs. Refer to any professional affiliations as well."
        },
        {
          "headline":"Inquire about the average energy costs.",
          "description":"Ask the landlord about the average utility cost before signing anything. The rent may be exactly at your budget but any additional cost may hurt you as the lease goes on. Make sure you get a sense of the hidden costs utilities may provide."
        },
        {
          "headline":"Prepare to negotiate.",
          "description":"Once you have narrowed down your top three choices, negotiate with the landlords and let them know that you have other options. If a landlord knows that you are interested but have other options, she may be willing to come down in price or work to find other bonuses like extra storage or parking."
        },
        {
          "headline":"Be flexible.",
          "description":"If you don’t get the apartment that you want there may be something similar in the same building or another building owned by the same landlord. Consider moving into a studio instead of a one-bedroom or getting a roommate for a two bedroom. Buildings will have apartments with similar floor plans  with an extra bedroom."
        },
        {
          "headline":"Consider the amenities.",
          "description":"Amenities like free Wi-Fi or gym may save you money on outside costs. However, don’t let amenities be the driving force of your decision. Carefully consider what you are willing to pay in rent for your amenities. Views are also great to have but not a necessity. Inquire if there are similar apartments within the building but without the same view. This can help save you money."
        },
        {
          "headline":"Talk to tenants.",
          "description":"The physical building may impress you but get a sense of your neighbours and what the living conditions may be like. Tenants can tell you if it’s noisy on the weekend or if there are newborns on your floor. You also want to find out about your landlord. You want to make sure he is safe, courteous and maintains the apartment promptly. Inquire about infrastructure issues, response time to tenant issues, tenant turnover, and safety issues. It is also wise to ask about the area and the typical cost of living. Find out about what tenants pay for utilities, entertainment, and transportation. Ask about the school district if you’re moving with a family, restaurants, grocery stores, and closest amenities."
        }
      ]
    },
    {
      "name":"Closing the Deal",
      "steps":[
        {
          "headline":"Prepare your documents.",
          "description":"Think of your application as a rental resume  and make sure you put your best foot forward. The documents that you should include are:\nA copy of your rental application. You should have filled this out online. If they asked you to fill it out in person, make sure that you provide neat handwriting. A copy of your credit report. A letter of reference from your current or last landlord. If this is your first apartment you can provide a character reference from an employer or teacher if you are a student. A copy of your current or most recent apartment lease. Employment verification. This should include a copy of your most recent tax return or W-2 as well as your three most current pay stubs. A summary of yourself. Don’t go into detail but give a positive glimpse of the type of tenant you will be. Talk about your hobbies and lifestyle to paint you as an ideal tenant. Any details about any pets if you currently have one."
        },
        {
          "headline":"Put your landlord at ease.",
          "description":"If your documents aren’t enough to persuade your landlord, offer to pay rent a week or even a month in advance until the month before the expiration of your lease. Show her that you are easy to manage and reliable. You may also be given a deal if you offer to pay in advance or offer an extra incentive to make your landlord’s life easier."
        },
        {
          "headline":"Perform a walk-through.",
          "description":"Once you are satisfied with the location, landlord, and apartment, conduct a final walk-through before signing anything. Be sure that you won’t be held responsible for any damages caused by the previous tennant and make sure to check the following with your landlord:\nCheck that all the lights, faucets, and toilets work properly. Look for any presence of rodents or insects specifically droppings, chew marks, or eggs/larvae in the storage spaces. Make sure all outlets work. Bring your phone charger and plug it into each outlet. Check smoke alarms and fire equipment. A smoke extinguisher may be placed in the kitchen. Open and close all the windows and doors. Make sure the locks work and there is no damage. Make sure all appliances work. Turn them off and on. Ask to be walked through the functionality to ensure that they work. Examine the walls, floors, and ceiling for damage. Inspect tiles, linoleum, drywall, and carpet. Take pictures of any issues and make sure your landlord takes note. You may be able to negotiate changing something or a drop in rent. Be sure to save the pictures in case there are discrepancies with maintenance or issues getting your security deposit back."
        },
        {
          "headline":"Read over and sign your lease.",
          "description":"Take the time to fully comprehend your lease. If you need to take it home or ask questions, don’t hesitate. This is a big commitment so don’t feel rushed or pressured. Leases vary depending on length of time and contract terms. Sign only when you feel comfortable. Periodic leases work well for a short duration because the landlord acknowledges that your situation may change every month. This allows you to renew with each new month. While it gives you more flexibility, they may be more costly. Most common is a fixed-term lease. These usually range from three, six, or twelve months. While you can lock in a lower rate, you may be responsible for the rest of your lease if you must break it before the expiration date. Discuss contingencies with your landlord as you may be able to just pay a penalty if you have to break your lease. Subleases are three-party lease agreements that happen when you have to break your lease but are able to find someone to takeover paying the remainder of your lease agreement. The new tenant takes over the remaining lease term with the approval of the landlord."
        }
      ]
    }
  ],
  "text":" Optimizing Your Search Set a budget range. Determine what you can afford each month by factoring your income and expenditures. Include groceries, transportation, social activities, utilities, and gym membership as your expenditures. Make sure you provide realistic numbers so that you can still save in case of emergency. Do not be tempted to look at apartments above your price range. You will waste time and resources looking at larger and newer spaces that you cannot afford. If your budget is tightly restricted, focus on finding cheap apartments that offer security and cleanliness over prime location or what your wealthier friends can afford. Keep the bigger picture in mind. Don’t be fooled by small perks. If a landlord throws in a TV or lets you move in early, it may be a waste if the apartment doesn’t meet one of your larger needs. Make sure to set your priorities and don’t compromise them. Remember that you may be locked into a lease so make your decision wisely. Consider the time of year. Prices may be much higher during the summer because that’s when a lot of people tend to search for a new apartment. Depending on where you live and whether you have a timeline, it may be best to search during October to December or February through March. People do not want to move during the holidays or cold months so take advantage of the drop in competition. Places tend to stay vacant during these times so you may see some prices drop if you are willing to wait a month or so. If you live in a location with a lot of college students, waiting until after school starts in September can help you find a reduced rental rate. Narrow your search. Don’t spend time looking at everything that’s available. Search online and create a list of no more than four or five apartments to visit. Schedule your visit as opposed to simply dropping by. Take photos and ask questions during your visit to make sure the apartment meets all your standards. If the person showing the apartment is unable to answer a question, be sure to get his contact information so that you can follow up. Keep organized. Depending on your time and resources, you may be able to look at a number of apartments. Keep all the information organized in a single document complete with pictures and a pros and cons list. You may also be able to place them on a map and order them according to convenience of travel from your work or school. Spreadsheets are great to keep track of things like rent, amenities, security deposit, lease length, and contact information. Keep any additional notes and how many times you have visited the location. The more informed of a decision you can make, the better. Research public transportation. Public transportation can save you money or be necessary during emergencies. Make sure you know how far your apartment is from major transportation routes. Even if you have a car, researching how much you may save on insurance, gas, and travel time may cause you to change how you commute. Look into new construction. It may seem counterintuitive but new buildings may have reasonable rents because a new apartment complex may want to fill up as fast as possible. Owners and managers may be flexible with their rent if they are trying to lease the entire building. Make sure to see if there is room to negotiate. Use an apartment locator. Apartment locators are in constant contact with landlords and may become aware of decreases in prices, rent specials, or deals before they become available to the public. They may have personal relationships with landlords that can help you find a deal unavailable to anyone else. Search social media or job boards for apartment locators. It may be free to use the services of an apartment locator in your city so research any costs that may be associated before investing. Broaden your search. If you have been looking for a while and you are finding it increasingly difficult to find an apartment in your price range, expand your search criteria. You may look at locations a little bit further than you originally planned or building without certain amenities. Prioritize what you are able to be flexible with and change your search criteria. Many times it is the location that is the most difficult thing to find as the most prime apartments are often taken or priced for their coveted location. While your commute may factor into your location, also factor in safety and cleanliness. Adding a few minutes to your commute is an easy sacrifice for a safe and clean apartment. Evaluating Your Final Choices Bring your roommates. If you’re moving with other people, make sure that everyone has a chance to see the place before signing anything. Get everyone’s feedback and opinion and make sure you all get a chance to discuss your likes and dislikes. Don’t rely on pictures. Make sure that each roommate gets to physically see the apartment so that they can form a solid opinion. Ask about special discounts. There may be special move-in offers or certain special discounts depending on the apartment. Some landlords offer the first month free if you sign a longer lease. You may also get bonuses if you have referred a friend. It never hurts to ask what’s available to you. There may also be discounts for students, retirees, veterans, or individuals with special needs. Refer to any professional affiliations as well. Inquire about the average energy costs. Ask the landlord about the average utility cost before signing anything. The rent may be exactly at your budget but any additional cost may hurt you as the lease goes on. Make sure you get a sense of the hidden costs utilities may provide. Prepare to negotiate. Once you have narrowed down your top three choices, negotiate with the landlords and let them know that you have other options. If a landlord knows that you are interested but have other options, she may be willing to come down in price or work to find other bonuses like extra storage or parking. Be flexible. If you don’t get the apartment that you want there may be something similar in the same building or another building owned by the same landlord. Consider moving into a studio instead of a one-bedroom or getting a roommate for a two bedroom. Buildings will have apartments with similar floor plans  with an extra bedroom. Consider the amenities. Amenities like free Wi-Fi or gym may save you money on outside costs. However, don’t let amenities be the driving force of your decision. Carefully consider what you are willing to pay in rent for your amenities. Views are also great to have but not a necessity. Inquire if there are similar apartments within the building but without the same view. This can help save you money. Talk to tenants. The physical building may impress you but get a sense of your neighbours and what the living conditions may be like. Tenants can tell you if it’s noisy on the weekend or if there are newborns on your floor. You also want to find out about your landlord. You want to make sure he is safe, courteous and maintains the apartment promptly. Inquire about infrastructure issues, response time to tenant issues, tenant turnover, and safety issues. It is also wise to ask about the area and the typical cost of living. Find out about what tenants pay for utilities, entertainment, and transportation. Ask about the school district if you’re moving with a family, restaurants, grocery stores, and closest amenities. Closing the Deal Prepare your documents. Think of your application as a rental resume  and make sure you put your best foot forward. The documents that you should include are:\nA copy of your rental application. You should have filled this out online. If they asked you to fill it out in person, make sure that you provide neat handwriting. A copy of your credit report. A letter of reference from your current or last landlord. If this is your first apartment you can provide a character reference from an employer or teacher if you are a student. A copy of your current or most recent apartment lease. Employment verification. This should include a copy of your most recent tax return or W-2 as well as your three most current pay stubs. A summary of yourself. Don’t go into detail but give a positive glimpse of the type of tenant you will be. Talk about your hobbies and lifestyle to paint you as an ideal tenant. Any details about any pets if you currently have one. Put your landlord at ease. If your documents aren’t enough to persuade your landlord, offer to pay rent a week or even a month in advance until the month before the expiration of your lease. Show her that you are easy to manage and reliable. You may also be given a deal if you offer to pay in advance or offer an extra incentive to make your landlord’s life easier. Perform a walk-through. Once you are satisfied with the location, landlord, and apartment, conduct a final walk-through before signing anything. Be sure that you won’t be held responsible for any damages caused by the previous tennant and make sure to check the following with your landlord:\nCheck that all the lights, faucets, and toilets work properly. Look for any presence of rodents or insects specifically droppings, chew marks, or eggs/larvae in the storage spaces. Make sure all outlets work. Bring your phone charger and plug it into each outlet. Check smoke alarms and fire equipment. A smoke extinguisher may be placed in the kitchen. Open and close all the windows and doors. Make sure the locks work and there is no damage. Make sure all appliances work. Turn them off and on. Ask to be walked through the functionality to ensure that they work. Examine the walls, floors, and ceiling for damage. Inspect tiles, linoleum, drywall, and carpet. Take pictures of any issues and make sure your landlord takes note. You may be able to negotiate changing something or a drop in rent. Be sure to save the pictures in case there are discrepancies with maintenance or issues getting your security deposit back. Read over and sign your lease. Take the time to fully comprehend your lease. If you need to take it home or ask questions, don’t hesitate. This is a big commitment so don’t feel rushed or pressured. Leases vary depending on length of time and contract terms. Sign only when you feel comfortable. Periodic leases work well for a short duration because the landlord acknowledges that your situation may change every month. This allows you to renew with each new month. While it gives you more flexibility, they may be more costly. Most common is a fixed-term lease. These usually range from three, six, or twelve months. While you can lock in a lower rate, you may be responsible for the rest of your lease if you must break it before the expiration date. Discuss contingencies with your landlord as you may be able to just pay a penalty if you have to break your lease. Subleases are three-party lease agreements that happen when you have to break your lease but are able to find someone to takeover paying the remainder of your lease agreement. The new tenant takes over the remaining lease term with the approval of the landlord.",
  "tyn_model":[
    "apartment locator",
    "apartment locators",
    "tv",
    "spreadsheets",
    "utility",
    "utilities",
    "toilets",
    "phone charger",
    "smoke alarms",
    "smoke extinguisher",
    "appliances",
    "linoleum"
  ],
  "tyn_section":[

  ]
}