{
  "title":"How to Get Rid of Rabbits",
  "url":"https://www.wikihow.com/Get-Rid-of-Rabbits",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control"
  ],
  "methods":[
    {
      "name":"Altering the Habitat to Deter Rabbits",
      "steps":[
        {
          "headline":"Reduce the areas where rabbits like to hide.",
          "description":"Because rabbits will hide in accumulations of vegetation, a great way to deter rabbits is to keep your grass mowed short, remove any unnecessary vegetation such as tall grasses, and clean up plant debris regularly. Also, be sure to trim off and discard low-hanging bottom branches on bushes and shrubs, which rabbits may use for cover. Finally, fill in any existing burrows you may find on your property. Tour your property regularly to find potential sites of infestation as well as burrows that need covering. Check sites where you have taken measures to deter rabbits on a regular basis to maintain control over these areas."
        },
        {
          "headline":"Secure structures.",
          "description":"Make sure no rabbits are hiding in any holes you may find under sheds, decks, stairs, and other places where rabbits may find shelter. Seal these holes with chicken wire or wood. Use chicken wire mesh or wood board spacing of one inch (2.5 cm) or less to reduce the chances rabbits will gain entry. Check places where you have secured the structure on a regular basis to make sure the repairs are intact. Pest control services that specialize in small animal removal and control may be able to recommend contractors who may be able to help you secure structures."
        },
        {
          "headline":"Remove access to any water sources.",
          "description":"Rabbits may be especially prone to making their habitat on property that is close to a water source. If you have a water source on your property—a stream, creek, pond, etc.—you can build fences around them to encourage rabbits to build their habitat elsewhere. As with sealing holes, be sure that the fence you build is made of a mesh that has one-inch holes or smaller. You should also bury the bottom of the fence at least four to eight inches underground and ensure it is at least two feet high. Be sure to maintain your fence over time. Rabbits may find weak spots or dig up sections along the ground to re-gain entry."
        },
        {
          "headline":"Plant as many rabbit-deterring plants as possible.",
          "description":"Few plants will be off-limits to rabbits as food, but some are certainly on the lower end of desirability, and planting these might encourage rabbits to go elsewhere in search of food. These undesirables include annuals such as goatweed, impatiens, and verbena, perennials like echinacea and honeysuckle, and groundcover such as big periwinkle and bougainvillea. Combined with perennials and annuals, shrubs like rhododendrons and camellias can offer an extra deterrent. Consult with a landscape designer on ways to incorporate these plants into your garden in an effective and aesthetically pleasing way."
        },
        {
          "headline":"Plant trees that deter rabbits.",
          "description":"Like plants, not all trees that rabbits dislike are always off-limits to them, but there are some that seem to be less preferred. These trees may, in turn, be worth planting as a means to making your landscape less desirable to rabbits. These include alder and birch trees. Visit a tree farm to see if you can purchase young trees that can be planted on your property."
        },
        {
          "headline":"Protect shrubs and trees from damage using hardware cloth.",
          "description":"Rabbits can damage and even kill shrubs and trees by gnawing on the bark around the base. Wrap hardware cloth around the bases of shrubs and trees that are susceptible to damage. Rabbits cannot gnaw through hardware cloth and it will effectively protect shrubs and trees. Some people use this technique with great success. Hardware cloth despite the name is not a cloth, but rather a galvanized wire screen that comes in rolls and is available from your hardware store."
        }
      ]
    },
    {
      "name":"Keeping Rabbits Out of a Garden",
      "steps":[
        {
          "headline":"Fence your garden to keep the rabbits out.",
          "description":"Chicken wire works fine as long as the mesh is 1 inch (2.5 cm) or less. Bury the bottom of the fence 3 to 6 inches (8 to 15 cm) into the ground to prevent rabbits from digging under it. Extend it at least three feet (one meter) above ground. Be sure to install flashing along the bottom of gates to ensure rabbits can't squeeze underneath to gain access to the garden. Fencing and chicken wire can be purchased at hardware stores, usually in a wide variety of styles and colors to compliment the décor of your yard. Consult a landscape designer to see if they have any suggestions as to fencing that can be effective at protecting your garden as well as aesthetically pleasing."
        },
        {
          "headline":"Install automatic, motion-activated sprinklers.",
          "description":"Automatic, motion-activated sprinklers condition rabbits to stay out of the area by spraying them with water every time they move into the sensor's range. Some of these sprinklers not only spray a burst of water to deter rabbits, but also emit a sound that is annoying to rabbits. This option is also environmentally friendly and humane because it does not use any chemicals—only water and sound. These sprinkler systems are available in hardware stores and online and they are fairly easy to set up, generally staking into the ground much like a standard sprinkler used for watering your lawn. Many different brands and styles of motion-sensitive sprinklers are available. Consider the path of the water as you set up the sprinkler so as not to overwater or damage your plants."
        },
        {
          "headline":"Use commercially available repellents.",
          "description":"Many different repellents may be available, but no repellent will work on all rabbits, so you may have to try several before finding one that works for you. Remember that some repellents may have to be applied more than once per season. Some repellents include:\nBlood or bone meal fertilizer. Blood or bone meal fertilizer repels rabbits because they are natural herbivores, and, as an added bonus, these fertilizers are great for your garden. Chemical repellents. Some chemical repellents like ammonium soaps can help deter rabbits, but they may not be safe for the more delicate plants in the garden, so be sure to read the label. A solution containing the bitter Bitrex can also be sprayed to deter rabbits, but generally only if the garden is made up of flowers because Bitrex will alter the taste of vegetables."
        },
        {
          "headline":"Use household repellents.",
          "description":"Cayenne pepper, human hair, dog hair, or manure on the ground near the garden or mixed with fertilizer can help deter rabbits. You can also spray vegetables with a mixture of vinegar and water with a small amount of hot sauce mixed in as well. This mixture sprayed on vegetables make the are unattractive to rabbits and may make the vegetables distasteful as well. Dried sulfur and onions can also be effective repellents against rabbits."
        }
      ]
    },
    {
      "name":"Getting Rid of Rabbits In Other Ways",
      "steps":[
        {
          "headline":"Hunt the rabbits to keep the population down.",
          "description":"Use a shotgun to hunt rabbits, or, alternatively, a .22 rifle, a pistol, or a bow and arrow. When hunting, be sure to follow licensing and hunting season laws in your area. If you live in a densely populated city, you may not be able to discharge weapons in your yard. Check your local laws to ensure you are able to hunt rabbits on your property. Also, be sure to practice gun safety when hunting. Always keep the barrel of your gun pointed in a safe direction, such as toward the ground, and do not put your finger inside the trigger guard on your gun until you are ready to shoot. Also, treat every weapon as though it were loaded, wear a bright orange vest to keep yourself visible, and always be aware of what is in front of and behind your target. Gun safety courses may be available in your community. Hunting with an expert may help you with hunting safety and effectiveness at thinning the rabbit population on your property. You may be able to find people who want to hunt on your property if you do not want to do so yourself. The game is often compensation enough, and some hunters may even pay you for allowing them to hunt on your property."
        },
        {
          "headline":"Use live traps.",
          "description":"Live traps can allow you to capture rabbits and remove them from your property. Traps are available at many stores and online. This is an excellent alternative to shooting rabbits. Bait traps with apples, brussels sprouts, carrots, or lettuce. Monitor the traps regularly and release rabbits as quickly as possible after they are captured. Wear protective gloves when handling traps and releasing the rabbits. Drive the rabbit at least a mile from your property to release to ensure they won't come back. Contact your local animal control officer or parks and recreation department to learn about release laws in your area."
        },
        {
          "headline":"Use a pest control service.",
          "description":"Find a pest control company in your area that can deal with your rabbit problem. They can help you confirm that rabbits are responsible for any damage you may have found. They can also help implement techniques for repelling rabbits and protecting property, including fencing, traps, tree guards, etc. A pest control service will generally schedule follow-up or maintenance appointments and they will ensure any removal or control techniques are consistent with local wildlife laws. If you have been confounded by rabbits and are ready to use a pest control service, look for pest control services in your area that specialize in small animals like rabbits—not all pest control services are experienced in rabbit control. Ask them over the phone if they have dealt with rabbit infestations before and what measures they took to control the problem."
        }
      ]
    }
  ],
  "text":" Altering the Habitat to Deter Rabbits Reduce the areas where rabbits like to hide. Because rabbits will hide in accumulations of vegetation, a great way to deter rabbits is to keep your grass mowed short, remove any unnecessary vegetation such as tall grasses, and clean up plant debris regularly. Also, be sure to trim off and discard low-hanging bottom branches on bushes and shrubs, which rabbits may use for cover. Finally, fill in any existing burrows you may find on your property. Tour your property regularly to find potential sites of infestation as well as burrows that need covering. Check sites where you have taken measures to deter rabbits on a regular basis to maintain control over these areas. Secure structures. Make sure no rabbits are hiding in any holes you may find under sheds, decks, stairs, and other places where rabbits may find shelter. Seal these holes with chicken wire or wood. Use chicken wire mesh or wood board spacing of one inch (2.5 cm) or less to reduce the chances rabbits will gain entry. Check places where you have secured the structure on a regular basis to make sure the repairs are intact. Pest control services that specialize in small animal removal and control may be able to recommend contractors who may be able to help you secure structures. Remove access to any water sources. Rabbits may be especially prone to making their habitat on property that is close to a water source. If you have a water source on your property—a stream, creek, pond, etc.—you can build fences around them to encourage rabbits to build their habitat elsewhere. As with sealing holes, be sure that the fence you build is made of a mesh that has one-inch holes or smaller. You should also bury the bottom of the fence at least four to eight inches underground and ensure it is at least two feet high. Be sure to maintain your fence over time. Rabbits may find weak spots or dig up sections along the ground to re-gain entry. Plant as many rabbit-deterring plants as possible. Few plants will be off-limits to rabbits as food, but some are certainly on the lower end of desirability, and planting these might encourage rabbits to go elsewhere in search of food. These undesirables include annuals such as goatweed, impatiens, and verbena, perennials like echinacea and honeysuckle, and groundcover such as big periwinkle and bougainvillea. Combined with perennials and annuals, shrubs like rhododendrons and camellias can offer an extra deterrent. Consult with a landscape designer on ways to incorporate these plants into your garden in an effective and aesthetically pleasing way. Plant trees that deter rabbits. Like plants, not all trees that rabbits dislike are always off-limits to them, but there are some that seem to be less preferred. These trees may, in turn, be worth planting as a means to making your landscape less desirable to rabbits. These include alder and birch trees. Visit a tree farm to see if you can purchase young trees that can be planted on your property. Protect shrubs and trees from damage using hardware cloth. Rabbits can damage and even kill shrubs and trees by gnawing on the bark around the base. Wrap hardware cloth around the bases of shrubs and trees that are susceptible to damage. Rabbits cannot gnaw through hardware cloth and it will effectively protect shrubs and trees. Some people use this technique with great success. Hardware cloth despite the name is not a cloth, but rather a galvanized wire screen that comes in rolls and is available from your hardware store. Keeping Rabbits Out of a Garden Fence your garden to keep the rabbits out. Chicken wire works fine as long as the mesh is 1 inch (2.5 cm) or less. Bury the bottom of the fence 3 to 6 inches (8 to 15 cm) into the ground to prevent rabbits from digging under it. Extend it at least three feet (one meter) above ground. Be sure to install flashing along the bottom of gates to ensure rabbits can't squeeze underneath to gain access to the garden. Fencing and chicken wire can be purchased at hardware stores, usually in a wide variety of styles and colors to compliment the décor of your yard. Consult a landscape designer to see if they have any suggestions as to fencing that can be effective at protecting your garden as well as aesthetically pleasing. Install automatic, motion-activated sprinklers. Automatic, motion-activated sprinklers condition rabbits to stay out of the area by spraying them with water every time they move into the sensor's range. Some of these sprinklers not only spray a burst of water to deter rabbits, but also emit a sound that is annoying to rabbits. This option is also environmentally friendly and humane because it does not use any chemicals—only water and sound. These sprinkler systems are available in hardware stores and online and they are fairly easy to set up, generally staking into the ground much like a standard sprinkler used for watering your lawn. Many different brands and styles of motion-sensitive sprinklers are available. Consider the path of the water as you set up the sprinkler so as not to overwater or damage your plants. Use commercially available repellents. Many different repellents may be available, but no repellent will work on all rabbits, so you may have to try several before finding one that works for you. Remember that some repellents may have to be applied more than once per season. Some repellents include:\nBlood or bone meal fertilizer. Blood or bone meal fertilizer repels rabbits because they are natural herbivores, and, as an added bonus, these fertilizers are great for your garden. Chemical repellents. Some chemical repellents like ammonium soaps can help deter rabbits, but they may not be safe for the more delicate plants in the garden, so be sure to read the label. A solution containing the bitter Bitrex can also be sprayed to deter rabbits, but generally only if the garden is made up of flowers because Bitrex will alter the taste of vegetables. Use household repellents. Cayenne pepper, human hair, dog hair, or manure on the ground near the garden or mixed with fertilizer can help deter rabbits. You can also spray vegetables with a mixture of vinegar and water with a small amount of hot sauce mixed in as well. This mixture sprayed on vegetables make the are unattractive to rabbits and may make the vegetables distasteful as well. Dried sulfur and onions can also be effective repellents against rabbits. Getting Rid of Rabbits In Other Ways Hunt the rabbits to keep the population down. Use a shotgun to hunt rabbits, or, alternatively, a .22 rifle, a pistol, or a bow and arrow. When hunting, be sure to follow licensing and hunting season laws in your area. If you live in a densely populated city, you may not be able to discharge weapons in your yard. Check your local laws to ensure you are able to hunt rabbits on your property. Also, be sure to practice gun safety when hunting. Always keep the barrel of your gun pointed in a safe direction, such as toward the ground, and do not put your finger inside the trigger guard on your gun until you are ready to shoot. Also, treat every weapon as though it were loaded, wear a bright orange vest to keep yourself visible, and always be aware of what is in front of and behind your target. Gun safety courses may be available in your community. Hunting with an expert may help you with hunting safety and effectiveness at thinning the rabbit population on your property. You may be able to find people who want to hunt on your property if you do not want to do so yourself. The game is often compensation enough, and some hunters may even pay you for allowing them to hunt on your property. Use live traps. Live traps can allow you to capture rabbits and remove them from your property. Traps are available at many stores and online. This is an excellent alternative to shooting rabbits. Bait traps with apples, brussels sprouts, carrots, or lettuce. Monitor the traps regularly and release rabbits as quickly as possible after they are captured. Wear protective gloves when handling traps and releasing the rabbits. Drive the rabbit at least a mile from your property to release to ensure they won't come back. Contact your local animal control officer or parks and recreation department to learn about release laws in your area. Use a pest control service. Find a pest control company in your area that can deal with your rabbit problem. They can help you confirm that rabbits are responsible for any damage you may have found. They can also help implement techniques for repelling rabbits and protecting property, including fencing, traps, tree guards, etc. A pest control service will generally schedule follow-up or maintenance appointments and they will ensure any removal or control techniques are consistent with local wildlife laws. If you have been confounded by rabbits and are ready to use a pest control service, look for pest control services in your area that specialize in small animals like rabbits—not all pest control services are experienced in rabbit control. Ask them over the phone if they have dealt with rabbit infestations before and what measures they took to control the problem.",
  "tyn_model":[
    "rabbits",
    "water",
    "trees",
    "hardware cloth",
    "chicken wire",
    "pest control services",
    "plants",
    "fertilizer",
    "gun",
    "rabbit",
    "traps",
    "pest control service",
    "landscape designer",
    "sprinkler",
    "chemical repellents",
    "vegetables",
    "chicken wire mesh",
    "—a",
    "impatiens",
    "verbena",
    "honeysuckle",
    "camellias",
    "tree farm",
    "galvanized wire screen",
    "fence",
    "fencing",
    "—only",
    "fertilizers",
    "ammonium soaps",
    "cayenne pepper",
    "vinegar",
    "hot sauce",
    "dried sulfur and onions",
    "shotgun",
    "pistol",
    "bow and arrow",
    "weapons",
    "hunters",
    "apples",
    "brussels sprouts",
    "carrots",
    "lettuce",
    "animal control officer",
    "parks and recreation department",
    "pest control company",
    "—not"
  ],
  "tyn_section":[

  ]
}