{
  "title":"How to Make Alkaline Water",
  "url":"https://www.wikihow.com/Make-Alkaline-Water",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Water Ice and Sports Drinks"
  ],
  "methods":[
    {
      "name":"Determining the pH Before You Alkalize",
      "steps":[
        {
          "headline":"Determine the pH level of your water.",
          "description":"Before and after you alkalize your water, you should check to see what you water’s pH level is. Doing this will tell you how much of an adjustment will need to be made to your water. Water is naturally a 7 on the scale,but impurities in the water tend to tip the scale toward the left (more acidic). The ideal pH level for pure drinking water is 6.5 to 8.5."
        },
        {
          "headline":"Purchase a pH kit.",
          "description":"You can buy a pH kit at most health stores. The kit should come with pH strips and a pH color chart."
        },
        {
          "headline":"Dip a strip into your water before you alkalize.",
          "description":"Let the strip sit for a moment, and then compare the strip’s color with the colors on the chart. Note what your water’s pH level is and then alkalize your water by performing one of the methods listed below. After you alkalize your water, your water should be roughly 8 or 9 on the pH scale."
        },
        {
          "headline":"Understand the pH of your water.",
          "description":"When water is above a 7 on the pH scale, the water is basic, while water below a 7 is acidic. You want your water to be somewhere between 7 and 9."
        }
      ]
    },
    {
      "name":"Alkalizing with Water Additives",
      "steps":[
        {
          "headline":"Use baking soda.",
          "description":"Add 1/8 tbsp (600 mg) baking soda to an 8 oz. (0.237 liters) glass of water. Baking soda has a high alkaline content. When the baking soda mixes with the water, it increases the alkaline properties of the water. Shake (if you are using a water bottle) or stir (if using a glass) the mixture vigorously to make sure the baking soda mixes in thoroughly with the water. If you are on a low sodium diet, do not add baking soda to your water. Baking soda is high in sodium."
        },
        {
          "headline":"Use lemons.",
          "description":"Lemons are anionic, so when you drink lemon water, your body reacts with the anionic properties of the lemon making the water alkaline as your body digests it. Fill one pitcher (64 oz.) with clean water. Filtered water is the best way to go, but if you don’t have a filter, tap water is okay to use. Cut up one lemon into eighths. Add the lemons to the water but do not squeeze them--simply place them in the water. Cover the water and let it sit overnight for 8 to 12 hours at room temperature. You can add one tablespoon of pink Himalayan sea salt to your lemon water if desired. Adding the salt mineralizes your alkaline water."
        },
        {
          "headline":"Add pH drops.",
          "description":"pH drops contain potent alkaline minerals and are highly concentrated. You can purchase pH drops at health food stores or online. Follow the directions on your specific pH bottle to determine how many drops you should put into your water. Keep in mind that while pH drops increase the alkalinity of your water, they do not filter out any of the things like chlorine or fluoride that can be found in your tap water."
        }
      ]
    },
    {
      "name":"Using Different Filtrations Systems",
      "steps":[
        {
          "headline":"Buy a water ionizer.",
          "description":"Water ionizers attach to your faucet and are very user friendly. The water becomes electrically enhanced (ionized) because the ionizer runs it over positive and negative electrodes. Doing this separates the water into alkalized water and acidic water. The alkalized water makes up about 70% of the produced water and can be used for drinking. Don’t just discard the acidic water. Acidic water can kill many types of bacteria. You can use it for washing your body, killing some of the bacteria living on your skin."
        },
        {
          "headline":"Purchase an ionizing water filter.",
          "description":"These filters are easily transportable and cheaper than buying an electric ionizer. They work in a similar fashion to a normal filter. Pour water into the filter and let it sit for three to five minutes. While you are waiting, the water is being sent through a series of filters. Once it passes through the filters, it sits in a pool of alkalizing minerals. These filters can often be found with the kitchen appliances in home stores."
        },
        {
          "headline":"Buy a reverse osmosis water filter.",
          "description":"This type of filter is known as a hyperfilter, and it uses an especially fine membrane for filtration. The delicacy of the filter allows it to capture more elements than regular water filters, which ultimately alkalizes the water more completely. These filters can be purchased at local home improvement or hardware stores and are located alongside traditional water filters."
        },
        {
          "headline":"Use a normal water distiller and add pH drops.",
          "description":"Water distillers boil the water put into them, destroying the bacteria and other impurities that may be found in your tap water. Water distillers can make your water slightly more alkaline, but to really alkalize your water, add pH drops to your newly purified water. Water distillers range in price and size. They can be found alongside other kitchen appliances."
        }
      ]
    }
  ],
  "text":" Determining the pH Before You Alkalize Determine the pH level of your water. Before and after you alkalize your water, you should check to see what you water’s pH level is. Doing this will tell you how much of an adjustment will need to be made to your water. Water is naturally a 7 on the scale,but impurities in the water tend to tip the scale toward the left (more acidic). The ideal pH level for pure drinking water is 6.5 to 8.5. Purchase a pH kit. You can buy a pH kit at most health stores. The kit should come with pH strips and a pH color chart. Dip a strip into your water before you alkalize. Let the strip sit for a moment, and then compare the strip’s color with the colors on the chart. Note what your water’s pH level is and then alkalize your water by performing one of the methods listed below. After you alkalize your water, your water should be roughly 8 or 9 on the pH scale. Understand the pH of your water. When water is above a 7 on the pH scale, the water is basic, while water below a 7 is acidic. You want your water to be somewhere between 7 and 9. Alkalizing with Water Additives Use baking soda. Add 1/8 tbsp (600 mg) baking soda to an 8 oz. (0.237 liters) glass of water. Baking soda has a high alkaline content. When the baking soda mixes with the water, it increases the alkaline properties of the water. Shake (if you are using a water bottle) or stir (if using a glass) the mixture vigorously to make sure the baking soda mixes in thoroughly with the water. If you are on a low sodium diet, do not add baking soda to your water. Baking soda is high in sodium. Use lemons. Lemons are anionic, so when you drink lemon water, your body reacts with the anionic properties of the lemon making the water alkaline as your body digests it. Fill one pitcher (64 oz.) with clean water. Filtered water is the best way to go, but if you don’t have a filter, tap water is okay to use. Cut up one lemon into eighths. Add the lemons to the water but do not squeeze them--simply place them in the water. Cover the water and let it sit overnight for 8 to 12 hours at room temperature. You can add one tablespoon of pink Himalayan sea salt to your lemon water if desired. Adding the salt mineralizes your alkaline water. Add pH drops. pH drops contain potent alkaline minerals and are highly concentrated. You can purchase pH drops at health food stores or online. Follow the directions on your specific pH bottle to determine how many drops you should put into your water. Keep in mind that while pH drops increase the alkalinity of your water, they do not filter out any of the things like chlorine or fluoride that can be found in your tap water. Using Different Filtrations Systems Buy a water ionizer. Water ionizers attach to your faucet and are very user friendly. The water becomes electrically enhanced (ionized) because the ionizer runs it over positive and negative electrodes. Doing this separates the water into alkalized water and acidic water. The alkalized water makes up about 70% of the produced water and can be used for drinking. Don’t just discard the acidic water. Acidic water can kill many types of bacteria. You can use it for washing your body, killing some of the bacteria living on your skin. Purchase an ionizing water filter. These filters are easily transportable and cheaper than buying an electric ionizer. They work in a similar fashion to a normal filter. Pour water into the filter and let it sit for three to five minutes. While you are waiting, the water is being sent through a series of filters. Once it passes through the filters, it sits in a pool of alkalizing minerals. These filters can often be found with the kitchen appliances in home stores. Buy a reverse osmosis water filter. This type of filter is known as a hyperfilter, and it uses an especially fine membrane for filtration. The delicacy of the filter allows it to capture more elements than regular water filters, which ultimately alkalizes the water more completely. These filters can be purchased at local home improvement or hardware stores and are located alongside traditional water filters. Use a normal water distiller and add pH drops. Water distillers boil the water put into them, destroying the bacteria and other impurities that may be found in your tap water. Water distillers can make your water slightly more alkaline, but to really alkalize your water, add pH drops to your newly purified water. Water distillers range in price and size. They can be found alongside other kitchen appliances.",
  "tyn_model":[
    "water",
    "baking soda",
    "ph drops",
    "water distillers",
    "ph kit",
    "lemon water",
    "water filters",
    "water bottle",
    "lemons",
    "lemon",
    "tap water",
    "water ionizer",
    "water ionizers",
    "ionizing water",
    "water filter",
    "water distiller"
  ],
  "tyn_section":[

  ]
}