{
  "title":"How to Grow Olives",
  "url":"https://www.wikihow.com/Grow-Olives",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Vegetables"
  ],
  "methods":[
    {
      "name":"Creating the Right Environment",
      "steps":[
        {
          "headline":"Determine whether growing olives in your area is possible.",
          "description":"Olive crops thrives best in climates with mild winters and long, dry summers. Suitable geographic areas, for example, include Europe's Mediterranean region and coastal valleys in the state of California. It is difficult, if not impossible, to grow olives in tropical climates. Frost will kill many olive trees if care is not taken. Temperatures that hit 22 °F (−6 °C) can harm small branches, while large branches and even whole trees can be killed if the temperature dips below 15 °F (−9 °C).Even if branches and trees survive the cold, the flavor of the olives and the resultant oil can be compromised by cold streaks. Avoid growing olives if you live in an area prone to these temperature dips. Olive trees do need a certain amount of cold, however. Proper flower development depends on the climate dipping to 45 °F (7 °C) or below, although this number alternates with olive tree varieties. This is why cultivation is extremely difficult in the tropics or very warm areas. Make sure that bloom season is fairly dry and moderate. Bloom season (April to June) should be fairly dry and not excessively warm. Olives are wind-pollinated, so wet conditions can hamper a tree's fruit set."
        },
        {
          "headline":"Check the pH of your soil and adjust it if necessary.",
          "description":"The soil should be moderately acidic or moderately basic, with a pH greater than 5 and less than 8.5. Many farmers believe 6.5 to be ideal. Get your soil tested at the Department of Agriculture or use a home testing kit from a department store. If the pH isn't in the right range, adjust it as necessary. Limestone is used to raise a soil's pH level, while sulfur is used to lower it. You can buy sulfur and limestone powder or pellet form, online or at a local greenhouse or hardware store. You adjust pH by spreading sulfur or limestone over your soil. The precise amount varies based on how much you need to adjust. You can read the instructions on your package. It may take a few days for limestone or sulfur to be adequately absorbed. For a more natural way of altering the soil's pH level, use sphagnum moss to raise pH and pine needles to lower it. Once your pH level is at the right level, keep monitoring it throughout the growing process, especially after using fertilizers which can affect pH level. You may have to adjust pH levels periodically as you grow your olive trees."
        },
        {
          "headline":"Look for areas with good drainage.",
          "description":"Watch how water affects soil in the area you want to grow. Olive trees thrive in areas that have good drainage. After rain, check the soil. Do not plant in an area where the soil stands above ground during rainy periods. Also, dig a hole that's two feet deep and add water. If water steeps, opt for a different area. Planting your olive trees on a gentle slope can solve a lot of drainage problems. There tends to be better drainage on inclines."
        },
        {
          "headline":"Seek out places that have previously grown olive trees.",
          "description":"The best indicator that an area will grow olive trees successfully is if an area has grown trees in the past. If you know olive trees have previously grown somewhere, grow your trees there. You can also grow your trees near existing olive trees. If you know other farmers or gardeners in your area, try asking them where olive trees have previously grown."
        },
        {
          "headline":"Find an area that gets direct sunlight.",
          "description":"Full sun, without any shade blocking your trees, is ideal. Any area you choose should at least get some direct sunlight for at least six hours a day. Very shady areas are not recommended for growing olives."
        }
      ]
    },
    {
      "name":"Planting Your Olive Trees",
      "steps":[
        {
          "headline":"Plant your trees in the spring.",
          "description":"Frost can be a major danger for young olive oil trees. In general, opt to plant in spring after temperatures have been consistently warm and there has been no recent frost. Most people plant trees during April or May, but adjust for your region. The more time trees have to grow before winter, the better. Plant your trees as soon as possible after the last expected frost date of the season."
        },
        {
          "headline":"Start with potted trees.",
          "description":"Purchase potted olive trees online or at a local greenhouse. Seeds on their own are fragile and difficult to cultivate. You should plant trees that are 4 to 5 feet (1.2 to 1.5 m) high and whose branches start at three feet."
        },
        {
          "headline":"Dig a hole about the same size as the tree's planting container.",
          "description":"Measure the trees pot, including its circumference and height. Dig a hole about that deep and wide. You do not have to get the hole the exact number of inches and measure, but the hole should be roughly the same size so that the tree fits comfortably in the soil."
        },
        {
          "headline":"Take the tree out of its container and check the roots.",
          "description":"Remove the tree from the container, including all the roots. Cut or untwist any circling roots as best you can, but stay away from the root ball. Cutting into this can damage your plants."
        },
        {
          "headline":"Fill the hole.",
          "description":"Use the previously dug soil and surrounding soil to fill in the rest of the hole. Put an inch of topsoil over the root ball. At this time, things like fertilizer and compost should not be added near your tree. The tree should grow out of the native soil initially."
        },
        {
          "headline":"Install dip emitters near the tree trunk.",
          "description":"Dip emitters are irrigation systems that keep your olive trees properly hydrated. For the first year, they should be placed right next to each tree trunk. The following year, they should be moved 24 inches away from the trunks. A second emitter should be added, also 24 inches away from the trunk. Installing dip emitter is complicated. While you can purchase them at a hardware store, installation is tricky unless you have extensive gardening experience. It is best to hire professionals to install your emitters. Usually, emitters are hooked up to a water source such as an outside faucet. You then run the tubing across your garden or yard until it gets to the base of your trees. You will then poke holes in the tubing and install a watering device to help irrigate your olive trees."
        },
        {
          "headline":"Water and mulch the area with straw.",
          "description":"When using dip irrigators, you should water your trees \nOther mulches can be used instead of coarse straw. Lucerne, soya bean, and pea hay, to name a few, are excellent mulches high in nitrogen and other nutrients to feed the tree."
        }
      ]
    },
    {
      "name":"Nurturing Your Trees to Maturity",
      "steps":[
        {
          "headline":"Water and irrigate your olive tree modestly or as necessary.",
          "description":"With drip irrigation, trees need watering each day during the summer. Water your trees for an hour. Keeping mini-sprinklers, which wet the ground down at least two feet, can also help trees stayed watered. Look for sprinklers that .1 to .2 inches of water per hour and install these between the trunks of your trees. How often you water your tree may be dictated by whether you want to cultivate fruit or oil. If cultivating fruit, water your trees more often — anywhere from every week to every two or three weeks. If cultivating oil, water your trees less often. This will help concentrate the flavor of the oil."
        },
        {
          "headline":"Prune your trees regularly.",
          "description":"Do not prune young trees often. During the first four years, only remove side branches growing below three feet. As the trees mature, they will become to take on their full form and you can remove weak or unwanted branches. Early pruning, however, should be as minimal as possible to avoid stunting a tree's growth."
        },
        {
          "headline":"Address issues with pests and other diseases.",
          "description":"Like most plants, the olive tree is sometimes susceptible to attack, particularly from black scale, or Saissetia oleae. As a farmer, you want to strike a fine balance between letting your trees grow organically and protecting them from infestation and disease. In some cases, an insecticide is required to treat pest issues. Talk this over with a professional for the best results. Black scales are small black scales on the surface of the bark which can get out of hand fast as they produce eggs quickly. Although black scales primarily infest already diseased olive trees, healthy trees are not immune from attack. If discovered, treat black scale with the appropriate insecticide. Verticillium wilt may also affect olive trees, causing leaves and branches to unexpectedly wilt. Although certain cultivars of olives come equipped with resistance, there is yet no treatment for this fungal disease. If afflicted branches aren't cut off, wilt can affect the whole tree. In this case, you may have to prune branches even from very young trees. If you've had a problem with wilt in your soil before, avoid planting in that area."
        },
        {
          "headline":"Use a mild amount of fertilizer.",
          "description":"Olive trees will thrive well enough with correct planting and watering. A mild amount of fertilizer, however, can help trees grow. Choose a mild fertilizer and apply light layers during growing season. The fertilizer's package should indicate appropriate amounts and where/how to apply the fertilizer, which is often sprinkles over the top soil. Err towards the lowest amounts possible. Fertilizer containers have ratios written on them, indicating the amount of things like nitrogen. Olive trees thrive with fertilizers with a 10-10-10 ratio or 13-13-13 ratio."
        },
        {
          "headline":"Wait several years for your trees to start bearing fruit.",
          "description":"Well-watered trees will start bearing fruit two or three times faster than dry-farmed trees. While some cultivars begin bearing fruit as soon as two or three years if properly maintained, many trees won't start bearing until 10 years old. When growing olives, remember this is a long term project. Start watching for fruit after the first two years, but keep in mind it may take much longer for an olive tree to yield fruit."
        },
        {
          "headline":"Decide when to harvest.",
          "description":"Olives start out green and eventually all turn black as they ripen. Olives that are harvested when they are still green have a peppery, grassy, or more herbaceous flavor, while olives that are harvested when they turn taker have a milder, buttery flavor. Many oils are a mix between green and ripe olives, harvested right when they are turning color. Decide on the type of olive you want and wait until your olives turn that color to harvest. Keep in mind, you cannot eat olives directly off a tree. Most have to be brined, meaning they are soaked in salt water, before they can be consumed."
        }
      ]
    }
  ],
  "text":" Creating the Right Environment Determine whether growing olives in your area is possible. Olive crops thrives best in climates with mild winters and long, dry summers. Suitable geographic areas, for example, include Europe's Mediterranean region and coastal valleys in the state of California. It is difficult, if not impossible, to grow olives in tropical climates. Frost will kill many olive trees if care is not taken. Temperatures that hit 22 °F (−6 °C) can harm small branches, while large branches and even whole trees can be killed if the temperature dips below 15 °F (−9 °C).Even if branches and trees survive the cold, the flavor of the olives and the resultant oil can be compromised by cold streaks. Avoid growing olives if you live in an area prone to these temperature dips. Olive trees do need a certain amount of cold, however. Proper flower development depends on the climate dipping to 45 °F (7 °C) or below, although this number alternates with olive tree varieties. This is why cultivation is extremely difficult in the tropics or very warm areas. Make sure that bloom season is fairly dry and moderate. Bloom season (April to June) should be fairly dry and not excessively warm. Olives are wind-pollinated, so wet conditions can hamper a tree's fruit set. Check the pH of your soil and adjust it if necessary. The soil should be moderately acidic or moderately basic, with a pH greater than 5 and less than 8.5. Many farmers believe 6.5 to be ideal. Get your soil tested at the Department of Agriculture or use a home testing kit from a department store. If the pH isn't in the right range, adjust it as necessary. Limestone is used to raise a soil's pH level, while sulfur is used to lower it. You can buy sulfur and limestone powder or pellet form, online or at a local greenhouse or hardware store. You adjust pH by spreading sulfur or limestone over your soil. The precise amount varies based on how much you need to adjust. You can read the instructions on your package. It may take a few days for limestone or sulfur to be adequately absorbed. For a more natural way of altering the soil's pH level, use sphagnum moss to raise pH and pine needles to lower it. Once your pH level is at the right level, keep monitoring it throughout the growing process, especially after using fertilizers which can affect pH level. You may have to adjust pH levels periodically as you grow your olive trees. Look for areas with good drainage. Watch how water affects soil in the area you want to grow. Olive trees thrive in areas that have good drainage. After rain, check the soil. Do not plant in an area where the soil stands above ground during rainy periods. Also, dig a hole that's two feet deep and add water. If water steeps, opt for a different area. Planting your olive trees on a gentle slope can solve a lot of drainage problems. There tends to be better drainage on inclines. Seek out places that have previously grown olive trees. The best indicator that an area will grow olive trees successfully is if an area has grown trees in the past. If you know olive trees have previously grown somewhere, grow your trees there. You can also grow your trees near existing olive trees. If you know other farmers or gardeners in your area, try asking them where olive trees have previously grown. Find an area that gets direct sunlight. Full sun, without any shade blocking your trees, is ideal. Any area you choose should at least get some direct sunlight for at least six hours a day. Very shady areas are not recommended for growing olives. Planting Your Olive Trees Plant your trees in the spring. Frost can be a major danger for young olive oil trees. In general, opt to plant in spring after temperatures have been consistently warm and there has been no recent frost. Most people plant trees during April or May, but adjust for your region. The more time trees have to grow before winter, the better. Plant your trees as soon as possible after the last expected frost date of the season. Start with potted trees. Purchase potted olive trees online or at a local greenhouse. Seeds on their own are fragile and difficult to cultivate. You should plant trees that are 4 to 5 feet (1.2 to 1.5 m) high and whose branches start at three feet. Dig a hole about the same size as the tree's planting container. Measure the trees pot, including its circumference and height. Dig a hole about that deep and wide. You do not have to get the hole the exact number of inches and measure, but the hole should be roughly the same size so that the tree fits comfortably in the soil. Take the tree out of its container and check the roots. Remove the tree from the container, including all the roots. Cut or untwist any circling roots as best you can, but stay away from the root ball. Cutting into this can damage your plants. Fill the hole. Use the previously dug soil and surrounding soil to fill in the rest of the hole. Put an inch of topsoil over the root ball. At this time, things like fertilizer and compost should not be added near your tree. The tree should grow out of the native soil initially. Install dip emitters near the tree trunk. Dip emitters are irrigation systems that keep your olive trees properly hydrated. For the first year, they should be placed right next to each tree trunk. The following year, they should be moved 24 inches away from the trunks. A second emitter should be added, also 24 inches away from the trunk. Installing dip emitter is complicated. While you can purchase them at a hardware store, installation is tricky unless you have extensive gardening experience. It is best to hire professionals to install your emitters. Usually, emitters are hooked up to a water source such as an outside faucet. You then run the tubing across your garden or yard until it gets to the base of your trees. You will then poke holes in the tubing and install a watering device to help irrigate your olive trees. Water and mulch the area with straw. When using dip irrigators, you should water your trees \nOther mulches can be used instead of coarse straw. Lucerne, soya bean, and pea hay, to name a few, are excellent mulches high in nitrogen and other nutrients to feed the tree. Nurturing Your Trees to Maturity Water and irrigate your olive tree modestly or as necessary. With drip irrigation, trees need watering each day during the summer. Water your trees for an hour. Keeping mini-sprinklers, which wet the ground down at least two feet, can also help trees stayed watered. Look for sprinklers that .1 to .2 inches of water per hour and install these between the trunks of your trees. How often you water your tree may be dictated by whether you want to cultivate fruit or oil. If cultivating fruit, water your trees more often — anywhere from every week to every two or three weeks. If cultivating oil, water your trees less often. This will help concentrate the flavor of the oil. Prune your trees regularly. Do not prune young trees often. During the first four years, only remove side branches growing below three feet. As the trees mature, they will become to take on their full form and you can remove weak or unwanted branches. Early pruning, however, should be as minimal as possible to avoid stunting a tree's growth. Address issues with pests and other diseases. Like most plants, the olive tree is sometimes susceptible to attack, particularly from black scale, or Saissetia oleae. As a farmer, you want to strike a fine balance between letting your trees grow organically and protecting them from infestation and disease. In some cases, an insecticide is required to treat pest issues. Talk this over with a professional for the best results. Black scales are small black scales on the surface of the bark which can get out of hand fast as they produce eggs quickly. Although black scales primarily infest already diseased olive trees, healthy trees are not immune from attack. If discovered, treat black scale with the appropriate insecticide. Verticillium wilt may also affect olive trees, causing leaves and branches to unexpectedly wilt. Although certain cultivars of olives come equipped with resistance, there is yet no treatment for this fungal disease. If afflicted branches aren't cut off, wilt can affect the whole tree. In this case, you may have to prune branches even from very young trees. If you've had a problem with wilt in your soil before, avoid planting in that area. Use a mild amount of fertilizer. Olive trees will thrive well enough with correct planting and watering. A mild amount of fertilizer, however, can help trees grow. Choose a mild fertilizer and apply light layers during growing season. The fertilizer's package should indicate appropriate amounts and where/how to apply the fertilizer, which is often sprinkles over the top soil. Err towards the lowest amounts possible. Fertilizer containers have ratios written on them, indicating the amount of things like nitrogen. Olive trees thrive with fertilizers with a 10-10-10 ratio or 13-13-13 ratio. Wait several years for your trees to start bearing fruit. Well-watered trees will start bearing fruit two or three times faster than dry-farmed trees. While some cultivars begin bearing fruit as soon as two or three years if properly maintained, many trees won't start bearing until 10 years old. When growing olives, remember this is a long term project. Start watching for fruit after the first two years, but keep in mind it may take much longer for an olive tree to yield fruit. Decide when to harvest. Olives start out green and eventually all turn black as they ripen. Olives that are harvested when they are still green have a peppery, grassy, or more herbaceous flavor, while olives that are harvested when they turn taker have a milder, buttery flavor. Many oils are a mix between green and ripe olives, harvested right when they are turning color. Decide on the type of olive you want and wait until your olives turn that color to harvest. Keep in mind, you cannot eat olives directly off a tree. Most have to be brined, meaning they are soaked in salt water, before they can be consumed.",
  "tyn_model":[
    "olives",
    "water",
    "fertilizer",
    "limestone",
    "sulfur",
    "trees",
    "soil",
    "fertilizers",
    "container",
    "dip emitters",
    "straw",
    "sprinklers",
    "olive",
    "frost",
    "olive trees",
    "oil",
    "cold",
    "olive tree",
    "sphagnum moss",
    "pine needles",
    "olive oil trees",
    "potted olive trees",
    "topsoil",
    "compost",
    "emitter",
    "dip irrigators",
    "mulches",
    "soya bean",
    "pea hay",
    "drip irrigation",
    "— anywhere",
    "prune",
    "pruning",
    "black scale",
    "insecticide",
    "verticillium wilt",
    "fertilizer containers",
    "oils",
    "salt water"
  ],
  "tyn_section":[

  ]
}