{
  "title":"How to Make Vegetable Dyes for Easter Egg Crafts",
  "url":"https://www.wikihow.com/Make-Vegetable-Dyes-for-Easter-Egg-Crafts",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts",
    "Plant Dyes"
  ],
  "steps":[
    {
      "headline":"Prepare the eggs first.",
      "description":"Put the eggs into a saucepan and cover with water. Bring to the boil and boil for 10 minutes. You want them to be absolutely hard boiled. Remove and allow to cool. Once cooled, remove their shells."
    },
    {
      "headline":"Make yellow dyes.",
      "description":"Use turmeric powder. Simply add turmeric powder to hot water in a ceramic or glass bowl (plastic might stain). Add the eggs to the bowl and leave to soak up the dye for one to two hours."
    },
    {
      "headline":"Make orange or orange-brown dye.",
      "description":"Use onions. Keep the skins off 10 onions for the week leading up to dyeing the eggs. Boil the skins in two cups of water until the water turns brown. Drain the water into a bowl and discard the onion skins. Add the eggs to the brown water and soak for one to hours to allow the dye to penetrate the shell."
    },
    {
      "headline":"Make pink or red eggs.",
      "description":"Use beetroot. Pour the juice from a can of beetroot into a suitable bowl. Add the eggs to soak for one to hours."
    },
    {
      "headline":"In each case, keep an eye on the soaking process to determine the colour that pleases you most.",
      "description":""
    },
    {
      "headline":"Dry the eggs once you're happy with the colour.",
      "description":"Leave them to sit on a baking tray or cookie sheet."
    },
    {
      "headline":"Serve.",
      "description":"Once the eggs are dried, make a centrepiece from them in a glass bowl or dish. Place in the centre of the table along with a serving implement and encourage diners to help themselves. The flavour of the food used to dye the egg will be an additional taste delight, along with the pretty colours."
    },
    {
      "headline":"Experiment with other vegetable or food dyes from the kitchen.",
      "description":"There are lots of other possible colours that you can create from items in the kitchen, from a variety of vegetable or fruit juices from the can to the cooking water left after steaming greens. Just be sure to choose flavours that you think people will enjoy!"
    }
  ],
  "text":" Prepare the eggs first. Put the eggs into a saucepan and cover with water. Bring to the boil and boil for 10 minutes. You want them to be absolutely hard boiled. Remove and allow to cool. Once cooled, remove their shells. Make yellow dyes. Use turmeric powder. Simply add turmeric powder to hot water in a ceramic or glass bowl (plastic might stain). Add the eggs to the bowl and leave to soak up the dye for one to two hours. Make orange or orange-brown dye. Use onions. Keep the skins off 10 onions for the week leading up to dyeing the eggs. Boil the skins in two cups of water until the water turns brown. Drain the water into a bowl and discard the onion skins. Add the eggs to the brown water and soak for one to hours to allow the dye to penetrate the shell. Make pink or red eggs. Use beetroot. Pour the juice from a can of beetroot into a suitable bowl. Add the eggs to soak for one to hours. In each case, keep an eye on the soaking process to determine the colour that pleases you most.  Dry the eggs once you're happy with the colour. Leave them to sit on a baking tray or cookie sheet. Serve. Once the eggs are dried, make a centrepiece from them in a glass bowl or dish. Place in the centre of the table along with a serving implement and encourage diners to help themselves. The flavour of the food used to dye the egg will be an additional taste delight, along with the pretty colours. Experiment with other vegetable or food dyes from the kitchen. There are lots of other possible colours that you can create from items in the kitchen, from a variety of vegetable or fruit juices from the can to the cooking water left after steaming greens. Just be sure to choose flavours that you think people will enjoy!",
  "tyn_model":[
    "eggs",
    "water",
    "turmeric powder",
    "bowl",
    "onions",
    "beetroot",
    "saucepan",
    "hot water",
    "onion",
    "baking tray",
    "cookie sheet",
    "glass bowl",
    "serving implement",
    "cooking water"
  ],
  "tyn_section":[

  ]
}