{
  "title":"How to Connect a Wii Remote",
  "url":"https://www.wikihow.com/Connect-a-Wii-Remote",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo Wii"
  ],
  "methods":[
    {
      "name":"Syncing With a Wii",
      "steps":[
        {
          "headline":"Turn on the Wii and make sure it isn't running any programs.",
          "description":""
        },
        {
          "headline":"Remove the back cover from the Wii Remote.",
          "description":""
        },
        {
          "headline":"Flip down the SD card cover on the front of the Wii.",
          "description":"If you're using a Wii Mini, the Sync button can be found on the left side of the console near the battery slot."
        },
        {
          "headline":"Press and release the Sync button on the back of the Wii Remote.",
          "description":"It is located below the battery bay. The LED lights on the Wii Remote will begin blinking."
        },
        {
          "headline":"Quickly press and release the Sync button on the Wii while the lights are flashing on the Wii Remote.",
          "description":""
        },
        {
          "headline":"Wait for the lights to stop flashing.",
          "description":"Once the light on the Wii Remote is solid, the Remote has been successfully synced."
        },
        {
          "headline":"Make sure that no other programs are running.",
          "description":"Your Wii may not be able to sync if a game is playing on you are using a channel. Make sure you're on the Wii's main menu when trying to sync. Remove any game discs from the system completely if you're still unable to sync."
        },
        {
          "headline":"Ensure that the Wii Remote has enough battery.",
          "description":"The Wii Remote uses AA batteries, and may not sync if there isn't enough juice left. Try swapping the batteries out and see if that fixes your sync issues."
        },
        {
          "headline":"Remove the power cable from the back of the Wii and wait about 20 seconds.",
          "description":"Then plug the cable back in and turn it on. This will reset the Wii and may fix your issues."
        },
        {
          "headline":"Ensure that you sensor bar has been placed above or below your TV.",
          "description":"The sensor bar is how the Wii Remote is able to point at things on your screen. It works best when it is above or below your TV."
        },
        {
          "headline":"Reset the Wii Remote by removing the batteries, waiting one minute, and then reinserting the batteries and syncing again.",
          "description":""
        }
      ]
    },
    {
      "name":"Syncing With a Wii U",
      "steps":[
        {
          "headline":"Turn on the Wii U and make sure that it's showing the main menu.",
          "description":"If you try to launch Wii Mode without syncing a Wii Remote, you will be prompted to do so."
        },
        {
          "headline":"Press and hold the Sync button on the front of the Wii U until the Sync screen appears.",
          "description":""
        },
        {
          "headline":"Remove the back cover from the Wii Remote.",
          "description":""
        },
        {
          "headline":"Press the Sync button on the back of the Wii Remote.",
          "description":"It is located below the battery bay. The LED lights on the Wii Remote will begin blinking, and will then turn solid to indicate a good connection."
        },
        {
          "headline":"Make sure that no other programs are running.",
          "description":"Your Wii U may not be able to sync if a game is playing on you are using a channel. Make sure you're on the Wii U's main menu when trying to sync."
        },
        {
          "headline":"Ensure that the Wii Remote has enough battery.",
          "description":"The Wii Remote uses AA batteries, and may not sync if there isn't enough juice left. Try swapping the batteries out and see if that fixes your sync issues."
        },
        {
          "headline":"Ensure that you sensor bar has been placed above or below your TV.",
          "description":"The sensor bar is how the Wii Remote is able to point at things on your screen. It works best when it is above or below your TV."
        }
      ]
    },
    {
      "name":"Syncing With a Windows PC",
      "steps":[
        {
          "headline":"Use a Bluetooth USB dongle if your computer does not have an internal Bluetooth adapter.",
          "description":"Wii Remotes can be connected to your computer using Bluetooth, allowing you to use your Wii Remote with the Dolphin emulator or other programs. You will need to re-pair the Wii Remotes each time you restart your computer."
        },
        {
          "headline":"Right-click on the Bluetooth icon in your system tray and select \"Add a device\".",
          "description":""
        },
        {
          "headline":"Press the \"1\" and \"2\" buttons on the Wii Remote simultaneously so that the lights start blinking.",
          "description":""
        },
        {
          "headline":"Select \"Nintendo RVL-CNT-01\" from the list of devices and click .Next.",
          "description":""
        },
        {
          "headline":"Select \"Pair without using a code\" and click .Next.",
          "description":""
        },
        {
          "headline":"Wait for the Wii Remote to pair with the computer.",
          "description":""
        },
        {
          "headline":"Open Dolphin and click the \"Wiimote\" button.",
          "description":""
        },
        {
          "headline":"Select \"Real Wiimote\" from the \"Input Source\" menu.",
          "description":"This will let you use the Wii remote when playing games with the emulator."
        },
        {
          "headline":"Get a sensor bar for your computer.",
          "description":"Use a battery-powered sensor bar or make your own."
        },
        {
          "headline":"Close Dolphin before trying to sync the Wii Remotes.",
          "description":"When you sync the Remote with Dolphin open, there's a chance that it won't appear in the controller selection menu. Close Dolphin, un-pair the Wii Remote by right-clicking it in your Bluetooth menu and selecting \"Remove device\", and then try pairing it again."
        }
      ]
    }
  ],
  "text":" Syncing With a Wii Turn on the Wii and make sure it isn't running any programs.  Remove the back cover from the Wii Remote.  Flip down the SD card cover on the front of the Wii. If you're using a Wii Mini, the Sync button can be found on the left side of the console near the battery slot. Press and release the Sync button on the back of the Wii Remote. It is located below the battery bay. The LED lights on the Wii Remote will begin blinking. Quickly press and release the Sync button on the Wii while the lights are flashing on the Wii Remote.  Wait for the lights to stop flashing. Once the light on the Wii Remote is solid, the Remote has been successfully synced. Make sure that no other programs are running. Your Wii may not be able to sync if a game is playing on you are using a channel. Make sure you're on the Wii's main menu when trying to sync. Remove any game discs from the system completely if you're still unable to sync. Ensure that the Wii Remote has enough battery. The Wii Remote uses AA batteries, and may not sync if there isn't enough juice left. Try swapping the batteries out and see if that fixes your sync issues. Remove the power cable from the back of the Wii and wait about 20 seconds. Then plug the cable back in and turn it on. This will reset the Wii and may fix your issues. Ensure that you sensor bar has been placed above or below your TV. The sensor bar is how the Wii Remote is able to point at things on your screen. It works best when it is above or below your TV. Reset the Wii Remote by removing the batteries, waiting one minute, and then reinserting the batteries and syncing again.  Syncing With a Wii U Turn on the Wii U and make sure that it's showing the main menu. If you try to launch Wii Mode without syncing a Wii Remote, you will be prompted to do so. Press and hold the Sync button on the front of the Wii U until the Sync screen appears.  Remove the back cover from the Wii Remote.  Press the Sync button on the back of the Wii Remote. It is located below the battery bay. The LED lights on the Wii Remote will begin blinking, and will then turn solid to indicate a good connection. Make sure that no other programs are running. Your Wii U may not be able to sync if a game is playing on you are using a channel. Make sure you're on the Wii U's main menu when trying to sync. Ensure that the Wii Remote has enough battery. The Wii Remote uses AA batteries, and may not sync if there isn't enough juice left. Try swapping the batteries out and see if that fixes your sync issues. Ensure that you sensor bar has been placed above or below your TV. The sensor bar is how the Wii Remote is able to point at things on your screen. It works best when it is above or below your TV. Syncing With a Windows PC Use a Bluetooth USB dongle if your computer does not have an internal Bluetooth adapter. Wii Remotes can be connected to your computer using Bluetooth, allowing you to use your Wii Remote with the Dolphin emulator or other programs. You will need to re-pair the Wii Remotes each time you restart your computer. Right-click on the Bluetooth icon in your system tray and select \"Add a device\".  Press the \"1\" and \"2\" buttons on the Wii Remote simultaneously so that the lights start blinking.  Select \"Nintendo RVL-CNT-01\" from the list of devices and click .Next.  Select \"Pair without using a code\" and click .Next.  Wait for the Wii Remote to pair with the computer.  Open Dolphin and click the \"Wiimote\" button.  Select \"Real Wiimote\" from the \"Input Source\" menu. This will let you use the Wii remote when playing games with the emulator. Get a sensor bar for your computer. Use a battery-powered sensor bar or make your own. Close Dolphin before trying to sync the Wii Remotes. When you sync the Remote with Dolphin open, there's a chance that it won't appear in the controller selection menu. Close Dolphin, un-pair the Wii Remote by right-clicking it in your Bluetooth menu and selecting \"Remove device\", and then try pairing it again.",
  "tyn_model":[
    "wii remote",
    "wii",
    "wii u",
    "dolphin",
    "wii remotes",
    "sd card cover",
    "wii mini",
    "bluetooth usb dongle",
    "remote"
  ],
  "tyn_section":[

  ]
}