{
  "title":"How to Grow Daylilies",
  "url":"https://www.wikihow.com/Grow-Daylilies",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Flowers"
  ],
  "parts":[
    {
      "name":"Planting Your Daylilies",
      "steps":[
        {
          "headline":"Plant daylilies outside in the spring.",
          "description":"Spring planting gives lilies the entire growing season to establish their roots before the winter freeze. If you live in a warmer climate with a longer growing season, you can be more flexible on planting times. Daylilies do very well when planted outdoors. They are not fussy about soil, they can tolerate shade, and they are naturally resistant to insects. Daylilies are difficult to grow indoors. They require extensive artificial light and regular fertilizing to stay healthy. Indoor daylilies are unlikely to bloom at all."
        },
        {
          "headline":"Find an area that gets at least 6 hours of sun per day.",
          "description":"Daylilies need about of 6 hours of sunlight per day in order to thrive. Choose a spot for your daylilies that can accommodate this. Direct sunlight is ideal, but indirect or partial sun will work as well."
        },
        {
          "headline":"Till the soil to a depth of 1 foot (30 cm).",
          "description":"Although daylilies will grow in most soil, they prefer well-draining soil, and tilling will help you to create these conditions for your plants. If your soil is rocky or contains clay, you can add organic compost as you till."
        },
        {
          "headline":"Soak bare root plants overnight in a water-soluble general fertilizer solution.",
          "description":"Purchase a water-soluble fertilizer from a garden store and prepare it according to the package directions. Place the bare roots of your plants into the solution and let them sit overnight. If you purchased potted plants, give them a thorough watering with this solution the night before you plant."
        },
        {
          "headline":"Plant daylilies 18–24 inches (46–61 cm) apart.",
          "description":"Create holes in the dirt about 12 inches (30 cm) wide and 6 inches (15 cm) deep. Create a small mound of dirt in the center of each hole. Place each daylily bulb directly onto each mound, with the roots pointing out to the sides. Cover the roots and fill the hole with soil. Water your daylilies until the soil is damp."
        }
      ]
    },
    {
      "name":"Keeping Your Daylilies Healthy",
      "steps":[
        {
          "headline":"Water daylilies 3 times per week.",
          "description":"Every few days, saturate the top 8–10 inches (20–25 cm) of soil. Consistent watering is especially important in the spring when the buds are forming and throughout the summer blooming season. If the soil is still wet when you return to water, wait another day or 2. Although these plants can withstand droughts, they will make fewer and smaller flowers if they are allowed to dry out. Overhead watering may cause spots on the flowers. Pour water directly into the soil, not over the plants themselves."
        },
        {
          "headline":"Fertilize daylilies 1-2 times a year.",
          "description":"Prepare a water-soluble general plant fertilizer according to the package instructions. Spray this onto the base of your flowers twice per year to encourage healthy flower production. Give the first application in the spring when the plants are 2-4 weeks old. Provide a second application towards the end of the summer. Water-soluble fertilizer can be purchased at most garden stores."
        },
        {
          "headline":"Remove the seed pods that form after flowering.",
          "description":"After your daylilies flower, begin looking for the formation of seed pods. When they appear, carefully snip them off using shears. If you allow your plants to produce seeds, they will form fewer flowers in the following year."
        },
        {
          "headline":"Divide your daylily plants every 3-4 years.",
          "description":"Daylilies can grow quite large and vast. They will need to be divided every few years. Dig up the roots of the plant cluster and break them apart with your hands. Put some of the plant back in the original hole. The rest you can plant in a different bed or pot, or swap with your friends and neighbors."
        }
      ]
    }
  ],
  "text":" Planting Your Daylilies Plant daylilies outside in the spring. Spring planting gives lilies the entire growing season to establish their roots before the winter freeze. If you live in a warmer climate with a longer growing season, you can be more flexible on planting times. Daylilies do very well when planted outdoors. They are not fussy about soil, they can tolerate shade, and they are naturally resistant to insects. Daylilies are difficult to grow indoors. They require extensive artificial light and regular fertilizing to stay healthy. Indoor daylilies are unlikely to bloom at all. Find an area that gets at least 6 hours of sun per day. Daylilies need about of 6 hours of sunlight per day in order to thrive. Choose a spot for your daylilies that can accommodate this. Direct sunlight is ideal, but indirect or partial sun will work as well. Till the soil to a depth of 1 foot (30 cm). Although daylilies will grow in most soil, they prefer well-draining soil, and tilling will help you to create these conditions for your plants. If your soil is rocky or contains clay, you can add organic compost as you till. Soak bare root plants overnight in a water-soluble general fertilizer solution. Purchase a water-soluble fertilizer from a garden store and prepare it according to the package directions. Place the bare roots of your plants into the solution and let them sit overnight. If you purchased potted plants, give them a thorough watering with this solution the night before you plant. Plant daylilies 18–24 inches (46–61 cm) apart. Create holes in the dirt about 12 inches (30 cm) wide and 6 inches (15 cm) deep. Create a small mound of dirt in the center of each hole. Place each daylily bulb directly onto each mound, with the roots pointing out to the sides. Cover the roots and fill the hole with soil. Water your daylilies until the soil is damp. Keeping Your Daylilies Healthy Water daylilies 3 times per week. Every few days, saturate the top 8–10 inches (20–25 cm) of soil. Consistent watering is especially important in the spring when the buds are forming and throughout the summer blooming season. If the soil is still wet when you return to water, wait another day or 2. Although these plants can withstand droughts, they will make fewer and smaller flowers if they are allowed to dry out. Overhead watering may cause spots on the flowers. Pour water directly into the soil, not over the plants themselves. Fertilize daylilies 1-2 times a year. Prepare a water-soluble general plant fertilizer according to the package instructions. Spray this onto the base of your flowers twice per year to encourage healthy flower production. Give the first application in the spring when the plants are 2-4 weeks old. Provide a second application towards the end of the summer. Water-soluble fertilizer can be purchased at most garden stores. Remove the seed pods that form after flowering. After your daylilies flower, begin looking for the formation of seed pods. When they appear, carefully snip them off using shears. If you allow your plants to produce seeds, they will form fewer flowers in the following year. Divide your daylily plants every 3-4 years. Daylilies can grow quite large and vast. They will need to be divided every few years. Dig up the roots of the plant cluster and break them apart with your hands. Put some of the plant back in the original hole. The rest you can plant in a different bed or pot, or swap with your friends and neighbors.",
  "tyn_model":[
    "daylilies",
    "water",
    "water-soluble fertilizer",
    "lilies",
    "tilling",
    "organic compost",
    "water-soluble general fertilizer",
    "garden store",
    "soil",
    "general plant fertilizer",
    "shears",
    "daylily plants"
  ],
  "tyn_section":[

  ]
}