{
  "title":"How to Make Roast Potatoes",
  "url":"https://www.wikihow.com/Make-Roast-Potatoes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Potato Dishes"
  ],
  "parts":[
    {
      "name":"Preparing the Potatoes",
      "steps":[
        {
          "headline":"Choose a type of potato.",
          "description":"Any kind of potato can be roasted to delicious perfection. However, different kinds of potatoes offer different textures and flavors. For example:\nWaxy potatoes such as red skinned and fingerling don’t get as crispy as other varieties. Starchy potatoes such as russet and sweet potatoes are mildly crispy when roasted. All-purpose potatoes such as Yukon Gold and purple potatoes get crispy on the outside but stay creamy on the inside."
        },
        {
          "headline":"Wash the potatoes.",
          "description":"Hold each potato under cold running water and scrub it with a soft vegetable brush. This will remove any dirt or debris on the skin of the potato. Don’t use soap when washing vegetables. If you don’t have a vegetable brush, rub the potato vigorously while you rinse it."
        },
        {
          "headline":"Decide whether to peel your potatoes.",
          "description":"If your potato has a thick, fibrous skin, you may consider peeling it to improve the texture of the finished product. However, many people enjoy the texture of roasted potato skins and leave them on. Alternatively, peel the potatoes and roast the skins separately for a crunchy, salty snack. Use a vegetable peeler to easily peel potatoes."
        },
        {
          "headline":"Cut the potatoes into pieces.",
          "description":"The larger the pieces of potato, the longer the cooking time will be. If you’re trying to make a quick snack, cut the potatoes into small pieces. If you’re making a hearty side dish, cut the potatoes into larger chunks. If you’re using small thin-skinned potatoes, you can leave them whole. Larger, thick-skinned potatoes can be halved, quartered, or cubed. Roast diced potatoes for a crunchy, salty hash."
        }
      ]
    },
    {
      "name":"Parboiling Large Potato Pieces",
      "steps":[
        {
          "headline":"Decide whether to parboil the potatoes.",
          "description":"Many people decide that parboiling is a hassle and skip straight to the roasting. However, parboiled potatoes take less time to roast. Additionally, the potatoes will have a crispier skin and a creamier interior. When a vegetable is “parboiled,” it is softened but not completely cooked. If your potato pieces are smaller than 1 x 1 inches (2.25 x 2.25 centimeters,) don’t parboil them. They may become overcooked."
        },
        {
          "headline":"Fill a pot with salted water and potatoes.",
          "description":"Choose a large, deep pot. Add the pieces of potatoes to the pot. Fill the pot with cold water until all of the potato pieces are submerged. Next, add a large pinch of salt and stir the mixture. If you don’t salt the water, the potatoes may taste bland."
        },
        {
          "headline":"Parboil the potatoes.",
          "description":"Place the pot on your stove over medium high heat. Allow the water to come to a boil and cook the potatoes in the water until they’re soft on the outside. The surface of the potato should flake easily, but it should be slightly difficult to pierce the potato with a fork. Large pieces of potato need to boil for ten minutes. Small pieces should be boiled for five minutes."
        },
        {
          "headline":"Drain the potatoes.",
          "description":"Place a large metal or plastic colander in your sink. Pour the potatoes and water into the colander, draining the potatoes. Let the hot potatoes cool to room temperature before seasoning and roasting them. Once the potatoes have cooled, consider scoring the tops with a fork. This will help create a crunchy crust on the finished product."
        }
      ]
    },
    {
      "name":"Roasting the Potatoes",
      "steps":[
        {
          "headline":"Preheat your oven.",
          "description":"Set your oven to 375°F (190°C). Let your oven preheat for about ten minutes while you prepare the potatoes. Some ovens indicate when they’re finished preheating by beeping. This may take more than ten minutes, depending on your oven."
        },
        {
          "headline":"Season the potatoes.",
          "description":"Place your potatoes in a large bowl. Drizzle them with your oil of choice and sprinkle on some seasonings. Use a large spoon to toss the potatoes, coating each piece completely. There are a variety of delicious seasoning options for roasted potatoes. For example:\nCreate an herbaceous rosemary seasoning by drizzling on 2 tablespoons of vegetable oil, 1 teaspoon of salt, ½ teaspoon of black pepper, and ½ teaspoon of dried crushed rosemary. Toss the potatoes with 4 tablespoons of olive oil, 1 ½ teaspoons of salt, 1 teaspoon of black pepper, 2 tablespoons of minced garlic, and 2 tablespoons of chopped fresh parsley. Add 1 teaspoon of vegetable oil, 2 tablespoons of freshly grated Parmesan cheese, ½ teaspoon of salt, ½ teaspoon of garlic powder, ½ teaspoon of paprika, and ¼ teaspoon of black pepper to make cheesy garlic potatoes."
        },
        {
          "headline":"Arrange the potatoes on a baking pan.",
          "description":"Spread the potatoes onto the baking pan in a single layer to allow each piece to become crispy. Line the pan with parchment paper or foil for easier cleanup. For extra crispy potatoes, use a large metal roasting pan. If you don’t have a metal roasting pan, use an oven-safe glass casserole pan or a cast-iron skillet."
        },
        {
          "headline":"Roast the potatoes.",
          "description":"The cooking process will take anywhere from thirty minutes to an hour, depending on the size of the potato pieces. Check the potatoes every ten minutes to see if they’re done cooking. Signs of a properly roasted potato include:\nA crispy, golden-brown crust on the surface\nA fork can easily penetrate the potato\nThe potatoes smell buttery and fried"
        },
        {
          "headline":"Serve the potatoes.",
          "description":"Remove the potatoes from the oven and allow them to cool slightly. Transfer them to a serving dish and serve them immediately. Roasted potatoes are excellent side dishes that pair well with a variety of main courses. For example:\nServe roasted potatoes with leftover meatloaf. Eat several vegetable sides with roasted potatoes for a hearty vegetarian dinner. Dice leftover roasted potatoes and sprinkle them over a salad."
        }
      ]
    }
  ],
  "text":" Preparing the Potatoes Choose a type of potato. Any kind of potato can be roasted to delicious perfection. However, different kinds of potatoes offer different textures and flavors. For example:\nWaxy potatoes such as red skinned and fingerling don’t get as crispy as other varieties. Starchy potatoes such as russet and sweet potatoes are mildly crispy when roasted. All-purpose potatoes such as Yukon Gold and purple potatoes get crispy on the outside but stay creamy on the inside. Wash the potatoes. Hold each potato under cold running water and scrub it with a soft vegetable brush. This will remove any dirt or debris on the skin of the potato. Don’t use soap when washing vegetables. If you don’t have a vegetable brush, rub the potato vigorously while you rinse it. Decide whether to peel your potatoes. If your potato has a thick, fibrous skin, you may consider peeling it to improve the texture of the finished product. However, many people enjoy the texture of roasted potato skins and leave them on. Alternatively, peel the potatoes and roast the skins separately for a crunchy, salty snack. Use a vegetable peeler to easily peel potatoes. Cut the potatoes into pieces. The larger the pieces of potato, the longer the cooking time will be. If you’re trying to make a quick snack, cut the potatoes into small pieces. If you’re making a hearty side dish, cut the potatoes into larger chunks. If you’re using small thin-skinned potatoes, you can leave them whole. Larger, thick-skinned potatoes can be halved, quartered, or cubed. Roast diced potatoes for a crunchy, salty hash. Parboiling Large Potato Pieces Decide whether to parboil the potatoes. Many people decide that parboiling is a hassle and skip straight to the roasting. However, parboiled potatoes take less time to roast. Additionally, the potatoes will have a crispier skin and a creamier interior. When a vegetable is “parboiled,” it is softened but not completely cooked. If your potato pieces are smaller than 1 x 1 inches (2.25 x 2.25 centimeters,) don’t parboil them. They may become overcooked. Fill a pot with salted water and potatoes. Choose a large, deep pot. Add the pieces of potatoes to the pot. Fill the pot with cold water until all of the potato pieces are submerged. Next, add a large pinch of salt and stir the mixture. If you don’t salt the water, the potatoes may taste bland. Parboil the potatoes. Place the pot on your stove over medium high heat. Allow the water to come to a boil and cook the potatoes in the water until they’re soft on the outside. The surface of the potato should flake easily, but it should be slightly difficult to pierce the potato with a fork. Large pieces of potato need to boil for ten minutes. Small pieces should be boiled for five minutes. Drain the potatoes. Place a large metal or plastic colander in your sink. Pour the potatoes and water into the colander, draining the potatoes. Let the hot potatoes cool to room temperature before seasoning and roasting them. Once the potatoes have cooled, consider scoring the tops with a fork. This will help create a crunchy crust on the finished product. Roasting the Potatoes Preheat your oven. Set your oven to 375°F (190°C). Let your oven preheat for about ten minutes while you prepare the potatoes. Some ovens indicate when they’re finished preheating by beeping. This may take more than ten minutes, depending on your oven. Season the potatoes. Place your potatoes in a large bowl. Drizzle them with your oil of choice and sprinkle on some seasonings. Use a large spoon to toss the potatoes, coating each piece completely. There are a variety of delicious seasoning options for roasted potatoes. For example:\nCreate an herbaceous rosemary seasoning by drizzling on 2 tablespoons of vegetable oil, 1 teaspoon of salt, ½ teaspoon of black pepper, and ½ teaspoon of dried crushed rosemary. Toss the potatoes with 4 tablespoons of olive oil, 1 ½ teaspoons of salt, 1 teaspoon of black pepper, 2 tablespoons of minced garlic, and 2 tablespoons of chopped fresh parsley. Add 1 teaspoon of vegetable oil, 2 tablespoons of freshly grated Parmesan cheese, ½ teaspoon of salt, ½ teaspoon of garlic powder, ½ teaspoon of paprika, and ¼ teaspoon of black pepper to make cheesy garlic potatoes. Arrange the potatoes on a baking pan. Spread the potatoes onto the baking pan in a single layer to allow each piece to become crispy. Line the pan with parchment paper or foil for easier cleanup. For extra crispy potatoes, use a large metal roasting pan. If you don’t have a metal roasting pan, use an oven-safe glass casserole pan or a cast-iron skillet. Roast the potatoes. The cooking process will take anywhere from thirty minutes to an hour, depending on the size of the potato pieces. Check the potatoes every ten minutes to see if they’re done cooking. Signs of a properly roasted potato include:\nA crispy, golden-brown crust on the surface\nA fork can easily penetrate the potato\nThe potatoes smell buttery and fried Serve the potatoes. Remove the potatoes from the oven and allow them to cool slightly. Transfer them to a serving dish and serve them immediately. Roasted potatoes are excellent side dishes that pair well with a variety of main courses. For example:\nServe roasted potatoes with leftover meatloaf. Eat several vegetable sides with roasted potatoes for a hearty vegetarian dinner. Dice leftover roasted potatoes and sprinkle them over a salad.",
  "tyn_model":[
    "potatoes",
    "potato",
    "water",
    "pot",
    "salt",
    "oven",
    "fork",
    "black pepper",
    "vegetable brush",
    "colander",
    "vegetable oil",
    "baking pan",
    "roasting pan",
    "russet",
    "sweet potatoes",
    "vegetable peeler",
    "vegetable",
    "“parboiled",
    "” it",
    "salted water",
    "cold water",
    "stove",
    "large bowl",
    "oil",
    "seasonings",
    "rosemary",
    "olive oil",
    "minced garlic",
    "fresh parsley",
    "parmesan cheese",
    "garlic powder",
    "paprika",
    "garlic potatoes",
    "parchment paper",
    "casserole pan",
    "cast-iron skillet",
    "meatloaf",
    "salad"
  ],
  "tyn_section":[

  ]
}