{
  "title":"How to Buy an Air Conditioner",
  "url":"https://www.wikihow.com/Buy-an-Air-Conditioner",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling",
    "Cooling Systems"
  ],
  "methods":[
    {
      "name":"Selecting the Right Size",
      "steps":[
        {
          "headline":"Measure the area you need the air conditioner to cool.",
          "description":"Use a tape measure to measure the width and length of the indoor space you want to cool. Then multiply the width by the length. Different air conditioners have different cooling capacities, so you’ll need this information to select one that has the correct cooling capacity for the size of the space you want to cool. If there’s no wall or door separating the space you want to cool from an adjoining room, add the area of the adjoining room to your calculation because the air conditioner will have to cool that space as well."
        },
        {
          "headline":"Find an A/C unit with the recommended BTU rating for your space.",
          "description":"The cooling capacities of all air conditioners are measured in BTUs (British thermal units) per hour. By looking at a unit’s BTUs, you can know the area it is capable of adequately cooling. The higher a unit’s BTU, the larger the area it can cool. The label or online description of a specific air conditioner will typically state what area the unit is capable of cooling. An air conditioner with a cooling capacity of 5,000 BTUs, for example, can cool rooms that are between 100–150 square feet (9.3–13.9 m) in area. You’ll need an air conditioner with a cooling capacity of 6,000 BTUs to cool a room that’s 150–250 square feet (14–23 m) in area. For a comprehensive guide to what BTU rating most closely matches the size of your room, visit https://www.energystar.gov/products/heating_cooling/air_conditioning_room?qt-consumers_product_tab=3#qt-consumers_product_tab."
        },
        {
          "headline":"Get an A/C unit with a higher BTU rating if your space receives a lot of sunlight.",
          "description":"Aside from the size of the space you want to cool, the amount of sunlight it receives and other factors will also determine the BTU rating you’ll want to choose. Go with a unit with 10 percent higher capacity if your room receives a lot of direct sunlight. Buy a unit with 10 percent less capacity if the room you’ll be cooling is heavily shaded. Add another 4,000 BTU if you’ll be using the air conditioner to cool your kitchen. If more than 2 people will be regularly spending time in the room, increase the capacity of the air conditioner you buy by 600 BTUs per person."
        }
      ]
    },
    {
      "name":"Choosing a Portable Unit",
      "steps":[
        {
          "headline":"Opt for a window air conditioner if you want to save money.",
          "description":"Window air conditioners sit on your window, and are supported by a mounting bracket that you screw into your window sill. They have cooling capacities that range from 5,000 to 12,500 BTUs, and are capable of cooling rooms that are 100–650 square feet (9.3–60.4 m) in area. Smaller units typically cost somewhere between $150 - $250, while larger units with higher cooling capacities can cost as much as $600. Install window air conditioners in your window or in a designated space designed for a window air conditioner in your wall. Measure your window before selecting a window air conditioner. Window A/C units come in a variety of sizes. Measure the height and the width of your window and make sure these dimensions are slightly larger than the A/C unit you purchase. The height, width, and depth of an A/C unit will be printed on its box."
        },
        {
          "headline":"Select a portable unit if window installation isn’t an option.",
          "description":"Portable units look like big boxes and typically weigh between 50–80 pounds (23–36 kg). They’re great because you can move them from room to room. Their cooling capacities range from 9,000 BTUs to 15,500 BTUs. These units use more energy than comparably sized window units and aren’t as efficient at cooling. They are more convenient, however, because they are portable. Portable air conditioners are typically more expensive than window units, ranging in price from $300 - $700. Portable units also tend to be noisier than window units. You’ll need to place the portable unit near a window so that it can vent hot air through its hose to the outside."
        },
        {
          "headline":"Go with a split ductless unit if you want to cool several rooms.",
          "description":"A single split ductless air conditioner unit can cool several rooms quietly and efficiently. Split ductless units are more expensive than window or portable units, typically costing at least $1,000. This type of air conditioning is known as a “split” system because it is split between an inside unit and an outside unit. It is called “ductless” because it does not require the installation of any air ducts in your home. Instead, a small hose runs through your wall and connects the inside unit to the outside one. The inside unit is typically mounted high up on a wall near the ceiling and looks like a thin, long white box. Split ductless units are difficult to install, so you may want to call a professional to handle the installation."
        }
      ]
    },
    {
      "name":"Getting a Central Air Conditioning Unit",
      "steps":[
        {
          "headline":"Buy a central air conditioner to cool your entire home.",
          "description":"A central air conditioner is the most expensive and difficult-to-install option, but it can cool your entire home. A central air unit will cost you between $3,000 and $7,000. On top of this, you’ll also have to spend money on a pre-installation evaluation of your home, any necessary modification or installation of ductwork, and the actual installation of the unit."
        },
        {
          "headline":"Schedule a pre-installation evaluation.",
          "description":"During this evaluation, a qualified HVAC professional will check your home’s ductwork to make sure it can handle the airflow of a modern air conditioner. They will also look for places where air leaks from your home, and determine the cooling capacity that is needed to properly cool your home. Call or visit a local trade organization for a list of qualified evaluators."
        },
        {
          "headline":"Find a licensed contractor to install your central air system.",
          "description":"Ask friends and neighbors for contractor referrals. You can also ask for a list of contractors from a local trade organization. Ask potential contractors for a list of customer references who can testify to the quality of their work. Ask contractors for price estimates for the installation. Be sure to receive a written, itemized list of the price estimate before the contractor starts the installation. Try to schedule the installation of your central air system during the spring or fall. Since these periods are the off-seasons for HVAC contractors, you may be able to find a lower price."
        }
      ]
    },
    {
      "name":"Choosing Additional Features",
      "steps":[
        {
          "headline":"Choose a unit with easy-to-use controls for convenience.",
          "description":"Look for a large and easy-to-read LED display if you want to know the room’s precise temperature at a glance. Also, find a model with clear labelling that you can understand and large, raised buttons of various shapes that you’ll feel comfortable pressing. If affordability is what’s most important to you, choose a simple model with mechanical controls and no LED display."
        },
        {
          "headline":"Select a unit with adjustable vents so you can control airflow.",
          "description":"Air conditioners cool a room best when they blow air toward the room’s center. Finding a unit with adjustable vents (louvers) will ensure that you can program your unit to do this. Read the description of a specific A/C unit to see if it has adjustable vents. If you have an A/C unit with adjustable vents, you can change the direction of the A/C’s airflow both horizontally and vertically."
        },
        {
          "headline":"Go with a unit with a remote control for convenience.",
          "description":"A remote control will allow you to change the room’s temperature and the speed of the A/C unit’s fan from a distance, without having to get up and push buttons on the actual unit. If you purchase a Wi-Fi-enabled A/C unit, you’ll be able to adjust settings on your A/C unit with an app on your smartphone or through a voice-activated smart device."
        },
        {
          "headline":"Look for a Wi-Fi-enabled unit if you want to control your unit remotely.",
          "description":"The description of an A/C unit on its box or on a website will indicate whether it’s Wi-Fi-enabled. If the unit is Wi-Fi-enabled, you can use a smart app on your phone to turn the unit on or off, change its temperature, alter the speed of the fan, and adjust other modes. This option can also help you save money on your electricity bill by giving you the power to closely monitor your use of the unit. You can also use a home smart device to control a Wi-Fi-connected A/C unit."
        }
      ]
    }
  ],
  "text":" Selecting the Right Size Measure the area you need the air conditioner to cool. Use a tape measure to measure the width and length of the indoor space you want to cool. Then multiply the width by the length. Different air conditioners have different cooling capacities, so you’ll need this information to select one that has the correct cooling capacity for the size of the space you want to cool. If there’s no wall or door separating the space you want to cool from an adjoining room, add the area of the adjoining room to your calculation because the air conditioner will have to cool that space as well. Find an A/C unit with the recommended BTU rating for your space. The cooling capacities of all air conditioners are measured in BTUs (British thermal units) per hour. By looking at a unit’s BTUs, you can know the area it is capable of adequately cooling. The higher a unit’s BTU, the larger the area it can cool. The label or online description of a specific air conditioner will typically state what area the unit is capable of cooling. An air conditioner with a cooling capacity of 5,000 BTUs, for example, can cool rooms that are between 100–150 square feet (9.3–13.9 m) in area. You’ll need an air conditioner with a cooling capacity of 6,000 BTUs to cool a room that’s 150–250 square feet (14–23 m) in area. For a comprehensive guide to what BTU rating most closely matches the size of your room, visit https://www.energystar.gov/products/heating_cooling/air_conditioning_room?qt-consumers_product_tab=3#qt-consumers_product_tab. Get an A/C unit with a higher BTU rating if your space receives a lot of sunlight. Aside from the size of the space you want to cool, the amount of sunlight it receives and other factors will also determine the BTU rating you’ll want to choose. Go with a unit with 10 percent higher capacity if your room receives a lot of direct sunlight. Buy a unit with 10 percent less capacity if the room you’ll be cooling is heavily shaded. Add another 4,000 BTU if you’ll be using the air conditioner to cool your kitchen. If more than 2 people will be regularly spending time in the room, increase the capacity of the air conditioner you buy by 600 BTUs per person. Choosing a Portable Unit Opt for a window air conditioner if you want to save money. Window air conditioners sit on your window, and are supported by a mounting bracket that you screw into your window sill. They have cooling capacities that range from 5,000 to 12,500 BTUs, and are capable of cooling rooms that are 100–650 square feet (9.3–60.4 m) in area. Smaller units typically cost somewhere between $150 - $250, while larger units with higher cooling capacities can cost as much as $600. Install window air conditioners in your window or in a designated space designed for a window air conditioner in your wall. Measure your window before selecting a window air conditioner. Window A/C units come in a variety of sizes. Measure the height and the width of your window and make sure these dimensions are slightly larger than the A/C unit you purchase. The height, width, and depth of an A/C unit will be printed on its box. Select a portable unit if window installation isn’t an option. Portable units look like big boxes and typically weigh between 50–80 pounds (23–36 kg). They’re great because you can move them from room to room. Their cooling capacities range from 9,000 BTUs to 15,500 BTUs. These units use more energy than comparably sized window units and aren’t as efficient at cooling. They are more convenient, however, because they are portable. Portable air conditioners are typically more expensive than window units, ranging in price from $300 - $700. Portable units also tend to be noisier than window units. You’ll need to place the portable unit near a window so that it can vent hot air through its hose to the outside. Go with a split ductless unit if you want to cool several rooms. A single split ductless air conditioner unit can cool several rooms quietly and efficiently. Split ductless units are more expensive than window or portable units, typically costing at least $1,000. This type of air conditioning is known as a “split” system because it is split between an inside unit and an outside unit. It is called “ductless” because it does not require the installation of any air ducts in your home. Instead, a small hose runs through your wall and connects the inside unit to the outside one. The inside unit is typically mounted high up on a wall near the ceiling and looks like a thin, long white box. Split ductless units are difficult to install, so you may want to call a professional to handle the installation. Getting a Central Air Conditioning Unit Buy a central air conditioner to cool your entire home. A central air conditioner is the most expensive and difficult-to-install option, but it can cool your entire home. A central air unit will cost you between $3,000 and $7,000. On top of this, you’ll also have to spend money on a pre-installation evaluation of your home, any necessary modification or installation of ductwork, and the actual installation of the unit. Schedule a pre-installation evaluation. During this evaluation, a qualified HVAC professional will check your home’s ductwork to make sure it can handle the airflow of a modern air conditioner. They will also look for places where air leaks from your home, and determine the cooling capacity that is needed to properly cool your home. Call or visit a local trade organization for a list of qualified evaluators. Find a licensed contractor to install your central air system. Ask friends and neighbors for contractor referrals. You can also ask for a list of contractors from a local trade organization. Ask potential contractors for a list of customer references who can testify to the quality of their work. Ask contractors for price estimates for the installation. Be sure to receive a written, itemized list of the price estimate before the contractor starts the installation. Try to schedule the installation of your central air system during the spring or fall. Since these periods are the off-seasons for HVAC contractors, you may be able to find a lower price. Choosing Additional Features Choose a unit with easy-to-use controls for convenience. Look for a large and easy-to-read LED display if you want to know the room’s precise temperature at a glance. Also, find a model with clear labelling that you can understand and large, raised buttons of various shapes that you’ll feel comfortable pressing. If affordability is what’s most important to you, choose a simple model with mechanical controls and no LED display. Select a unit with adjustable vents so you can control airflow. Air conditioners cool a room best when they blow air toward the room’s center. Finding a unit with adjustable vents (louvers) will ensure that you can program your unit to do this. Read the description of a specific A/C unit to see if it has adjustable vents. If you have an A/C unit with adjustable vents, you can change the direction of the A/C’s airflow both horizontally and vertically. Go with a unit with a remote control for convenience. A remote control will allow you to change the room’s temperature and the speed of the A/C unit’s fan from a distance, without having to get up and push buttons on the actual unit. If you purchase a Wi-Fi-enabled A/C unit, you’ll be able to adjust settings on your A/C unit with an app on your smartphone or through a voice-activated smart device. Look for a Wi-Fi-enabled unit if you want to control your unit remotely. The description of an A/C unit on its box or on a website will indicate whether it’s Wi-Fi-enabled. If the unit is Wi-Fi-enabled, you can use a smart app on your phone to turn the unit on or off, change its temperature, alter the speed of the fan, and adjust other modes. This option can also help you save money on your electricity bill by giving you the power to closely monitor your use of the unit. You can also use a home smart device to control a Wi-Fi-connected A/C unit.",
  "tyn_model":[
    "air conditioner",
    "a/c unit",
    "air conditioners",
    "window air conditioners",
    "central air conditioner",
    "central air system",
    "remote control",
    "tape measure",
    "british thermal units",
    "window air conditioner",
    "a/c units",
    "air conditioning",
    "“split",
    "” system",
    "“ductless",
    "” because",
    "air ducts",
    "hose",
    "central air conditioning unit",
    "central air unit",
    "hvac professional",
    "hvac contractors",
    "wi-fi-enabled unit",
    "fan"
  ],
  "tyn_section":[

  ]
}