{
  "title":"How to Apply Wood Veneer",
  "url":"https://www.wikihow.com/Apply-Wood-Veneer",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "steps":[
    {
      "headline":"Cut the substrate (the material that the veneer is actually applied to) to the exact finish size.",
      "description":"This way, you can cut just the excess veneer with a razor knife and avoid damaging the finished product by using a table saw."
    },
    {
      "headline":"Select the most appealing section of the veneer pattern, which will be visible in the finished piece, keeping in mind that any excess will be trimmed.",
      "description":"One effective way to isolate your preferred section is to make a cardboard template. This will need to be cut to the identical size of the substrate panel by laying the substrate over the cardboard, marking the edges and then cutting the cardboard."
    },
    {
      "headline":"Place your template over the desired section of veneer and cut out that portion, leaving approximately one-half inch, or 1.27 centimeters (0.5 in), of excess on each side.",
      "description":""
    },
    {
      "headline":"Center the selected pattern section over the substrate panel and apply the contact cement, following the manufacturer's instructions, to both the veneer and the substrate.",
      "description":"Allow it to set. Be sure to mix the adhesive thoroughly before applying it. This will maximize its effectiveness."
    },
    {
      "headline":"Use extreme caution when positioning the two elements for adherence.",
      "description":"Since contact cement is so slip-resistant, they must be perfectly aligned on the first try."
    },
    {
      "headline":"Using maximum pressure, roll the veneer smooth by starting in the center and working out toward the edges using a veneer roller.",
      "description":""
    },
    {
      "headline":"Still using maximum pressure, smooth the surface with a smoothing blade to verify that the veneer is completely adhered.",
      "description":""
    },
    {
      "headline":"Turn your piece upside down and use a razor knife to trim the excess veneer, using the edges of the substrate as your guide.",
      "description":"Run your hand over the area to be sure that the area is entirely smooth. If you do encounter any bubbles, repeat the two previous steps. You can ensure a cleaner cut by scoring the surface first to determine the cut"
    },
    {
      "headline":"Allow ample time for curing and drying before finishing the piece.",
      "description":""
    }
  ],
  "text":" Cut the substrate (the material that the veneer is actually applied to) to the exact finish size. This way, you can cut just the excess veneer with a razor knife and avoid damaging the finished product by using a table saw. Select the most appealing section of the veneer pattern, which will be visible in the finished piece, keeping in mind that any excess will be trimmed. One effective way to isolate your preferred section is to make a cardboard template. This will need to be cut to the identical size of the substrate panel by laying the substrate over the cardboard, marking the edges and then cutting the cardboard. Place your template over the desired section of veneer and cut out that portion, leaving approximately one-half inch, or 1.27 centimeters (0.5 in), of excess on each side.  Center the selected pattern section over the substrate panel and apply the contact cement, following the manufacturer's instructions, to both the veneer and the substrate. Allow it to set. Be sure to mix the adhesive thoroughly before applying it. This will maximize its effectiveness. Use extreme caution when positioning the two elements for adherence. Since contact cement is so slip-resistant, they must be perfectly aligned on the first try. Using maximum pressure, roll the veneer smooth by starting in the center and working out toward the edges using a veneer roller.  Still using maximum pressure, smooth the surface with a smoothing blade to verify that the veneer is completely adhered.  Turn your piece upside down and use a razor knife to trim the excess veneer, using the edges of the substrate as your guide. Run your hand over the area to be sure that the area is entirely smooth. If you do encounter any bubbles, repeat the two previous steps. You can ensure a cleaner cut by scoring the surface first to determine the cut Allow ample time for curing and drying before finishing the piece. ",
  "tyn_model":[
    "cardboard",
    "substrate",
    "razor knife",
    "contact cement",
    "table saw",
    "adhesive",
    "veneer roller"
  ],
  "tyn_section":[

  ]
}