{
  "title":"How to Play Caribbean Stud Poker",
  "url":"https://www.wikihow.com/Play-Caribbean-Stud-Poker",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "steps":[
    {
      "headline":"Ante up.",
      "description":"The first step in entering a hand of Caribbean stud poker is to place an ante or initial bet in the right spot on the casino table. Existing instructions from the dealer should make it clear how much the stakes are and what the initial bet amount is."
    },
    {
      "headline":"Add a jackpot bet.",
      "description":"Each player can also put in another smaller amount of money to participate in a \"jackpot\" feature for this game. Put all applicable bets on the table before the dealer calls \"no more bets.\" This call is an important protocol and part of the game."
    },
    {
      "headline":"Receive 5 cards from the dealer.",
      "description":"After betting is closed, the dealer will deal each player 5 cards for his hand. The stud poker game eliminates any drawing or changing the cards in the hand."
    },
    {
      "headline":"Look at the first dealer's card.",
      "description":"After dealing, the dealer will reveal his first card. Don't engage in table talk. In Caribbean stud poker, players cannot talk to each other about hands while the game is in session. Pros call this kind of discussion \"table talk.\" Know the limits of what you can and can't say while at the table for this game."
    },
    {
      "headline":"Examine the 5 cards in your hand.",
      "description":"Each player can look at only his cards."
    },
    {
      "headline":"Play or fold.",
      "description":"After inspecting his cards, each player can play by doubling the ante or fold the hand and opt out of any further game play. Take your turn. The dealer will usually cue each player's decision to play or fold."
    },
    {
      "headline":"Allow the dealer to turn over his remaining cards.",
      "description":""
    },
    {
      "headline":"Use existing hand hierarchy to determine whether you have beat the dealer.",
      "description":"Those who beat the dealer win the hand and get money from the dealer. Others lose the money that they have bet on the hand."
    }
  ],
  "text":" Ante up. The first step in entering a hand of Caribbean stud poker is to place an ante or initial bet in the right spot on the casino table. Existing instructions from the dealer should make it clear how much the stakes are and what the initial bet amount is. Add a jackpot bet. Each player can also put in another smaller amount of money to participate in a \"jackpot\" feature for this game. Put all applicable bets on the table before the dealer calls \"no more bets.\" This call is an important protocol and part of the game. Receive 5 cards from the dealer. After betting is closed, the dealer will deal each player 5 cards for his hand. The stud poker game eliminates any drawing or changing the cards in the hand. Look at the first dealer's card. After dealing, the dealer will reveal his first card. Don't engage in table talk. In Caribbean stud poker, players cannot talk to each other about hands while the game is in session. Pros call this kind of discussion \"table talk.\" Know the limits of what you can and can't say while at the table for this game. Examine the 5 cards in your hand. Each player can look at only his cards. Play or fold. After inspecting his cards, each player can play by doubling the ante or fold the hand and opt out of any further game play. Take your turn. The dealer will usually cue each player's decision to play or fold. Allow the dealer to turn over his remaining cards.  Use existing hand hierarchy to determine whether you have beat the dealer. Those who beat the dealer win the hand and get money from the dealer. Others lose the money that they have bet on the hand.",
  "tyn_model":[
    "cards",
    "stud poker"
  ],
  "tyn_section":[

  ]
}