{
  "title":"How to Sew a Hem",
  "url":"https://www.wikihow.com/Sew-a-Hem",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Sewing",
    "Sewing Skills",
    "Hemming"
  ],
  "methods":[
    {
      "name":"Sewing a Double Fold Hem",
      "steps":[
        {
          "headline":"Decide how you will sew your hem.",
          "description":"There are two ways to sew a hem: by hand or with a sewing machine. While the latter is obviously faster, the former allows you to sew a hem without many tools. If you can, set up your sewing machine for your hem; use a straight stitch for a double-fold hem."
        },
        {
          "headline":"Fold your hem.",
          "description":"Lay out your clothing on a countertop pattern-side down, with the hem/edge in front of you. Fold the fabric edge up ⅝-inch, and use an iron to flatten it out. Then, starting from the edge, create a second fold over the first ⅝-inch wide, so that the raw edge of the first fold is hidden under the second fold. ⅝-inch is the standard seam allowance, but you can use whatever measurement you want for your hem."
        },
        {
          "headline":"Pin the hem in place.",
          "description":"Use multiple straight pins to secure this fold. Insert the pins so that the blunt end (often with a pearl) sticks out from the hem, while the needle-end of the pin is inserted towards the fabric. This will make them much easier to remove as you sew (if you’re using a sewing machine)."
        },
        {
          "headline":"Sew your hem.",
          "description":"Either with your sewing machine or by hand, use a matching thread to your fabric and sew a straight stitch along the top edge of the fold. Work all the way around until you’ve sewn the whole hem, and then tie off and cut your thread."
        },
        {
          "headline":"Iron the hem.",
          "description":"You’re almost done! To finish off your hem, you need to iron it so it lays down flat. If your fabric can handle it, use a bit of steam to help with the ironing process. When you’re done ironing, turn your fabric right-side-out, and enjoy your newly completed hem."
        }
      ]
    },
    {
      "name":"Sewing a Blind Hem",
      "steps":[
        {
          "headline":"Determine if you have the necessary tools.",
          "description":"Although you can hand-sew a blind hem, it can be very difficult and the process is much easier on a sewing machine. In order to sew a blind hem on a sewing machine, you must have two tools: a blind hem foot, and the proper stitch. A blind hem foot can be purchased at most sewing shops for around $10. In addition, check to see if your sewing machine comes with a stitch that looks like this: ^----^----^."
        },
        {
          "headline":"Prepare your fabric.",
          "description":"If you haven’t already, prewash your fabric to prevent it from shrinking later. Then, place your fabric on a countertop with the pattern side down."
        },
        {
          "headline":"Fold your hem.",
          "description":"Determine your seam allowance, as this is the width of the fold you will be making; a traditional seam allowance is ⅝-inch. Fold this much of the fabric up from the edge, and then do it again. This will hide the raw edge under fold, so that it won’t be seen in the finished hem. Use an iron to flatten this fabric out."
        },
        {
          "headline":"Pin the hem in place.",
          "description":"Use a series of straight pins to hold the fabric in place. Insert the pins so that the blunt/pearl end is on the fabric portion, while the needle/tip is sticking out towards the edge of the hem. If you are using a sewing machine, fold your ironed section under the fabric. Take the portion of fabric that you just folded/ironed, and fold it in the opposite direction so that it is hidden under the fabric. However, fold it so that about ⅛ of an inch is exposed. Your piece of fabric should now have the pattern-side down, but the tiny ⅛-inch exposed fold at the edge will show the fabric."
        },
        {
          "headline":"Sew the hem.",
          "description":"For hand sewing, start at the edge of your fold. Just above the fold, pick up a very small portion of the fabric. Then go left about 1/4 in and pick up a bit of the fold. Right above that, pick up a very small portion of the fabric again. Continue in this manner until you reach the end of your hem. For a sewing machine, change your stitch to the one that looks like ‘--^----^--’. Turn your fabric sideways on the sewing machine, so that the ⅛-inch fold is on the right side, and the rest of the fabric is on the left. Begin sewing down the edge where the fold and the rest of the fabric meet. You should keep the edge of the fabric plumb to the divider on your presser foot. Sew like this all the way down the hem, until you reach the end of your fabric. You should notice that the ‘^’ stitches will hook onto the body of the fabric, while the regular straight stitches in between remain on the ⅛-inch folded portion."
        },
        {
          "headline":"Finish your hem.",
          "description":"Tie and cut off the excess thread, and then unfold your hem. On one side (the back) you should see the hem sewn with the ‘--^----^--’ pattern. However, on the other side the stitch should be ‘blind’, as in you’ll only see a tiny dot where the ‘^’ stitch hooked onto the fabric. If this is the case, use an iron to flatten out the hem, and complete your sewing project."
        }
      ]
    }
  ],
  "text":" Sewing a Double Fold Hem Decide how you will sew your hem. There are two ways to sew a hem: by hand or with a sewing machine. While the latter is obviously faster, the former allows you to sew a hem without many tools. If you can, set up your sewing machine for your hem; use a straight stitch for a double-fold hem. Fold your hem. Lay out your clothing on a countertop pattern-side down, with the hem/edge in front of you. Fold the fabric edge up ⅝-inch, and use an iron to flatten it out. Then, starting from the edge, create a second fold over the first ⅝-inch wide, so that the raw edge of the first fold is hidden under the second fold. ⅝-inch is the standard seam allowance, but you can use whatever measurement you want for your hem. Pin the hem in place. Use multiple straight pins to secure this fold. Insert the pins so that the blunt end (often with a pearl) sticks out from the hem, while the needle-end of the pin is inserted towards the fabric. This will make them much easier to remove as you sew (if you’re using a sewing machine). Sew your hem. Either with your sewing machine or by hand, use a matching thread to your fabric and sew a straight stitch along the top edge of the fold. Work all the way around until you’ve sewn the whole hem, and then tie off and cut your thread. Iron the hem. You’re almost done! To finish off your hem, you need to iron it so it lays down flat. If your fabric can handle it, use a bit of steam to help with the ironing process. When you’re done ironing, turn your fabric right-side-out, and enjoy your newly completed hem. Sewing a Blind Hem Determine if you have the necessary tools. Although you can hand-sew a blind hem, it can be very difficult and the process is much easier on a sewing machine. In order to sew a blind hem on a sewing machine, you must have two tools: a blind hem foot, and the proper stitch. A blind hem foot can be purchased at most sewing shops for around $10. In addition, check to see if your sewing machine comes with a stitch that looks like this: ^----^----^. Prepare your fabric. If you haven’t already, prewash your fabric to prevent it from shrinking later. Then, place your fabric on a countertop with the pattern side down. Fold your hem. Determine your seam allowance, as this is the width of the fold you will be making; a traditional seam allowance is ⅝-inch. Fold this much of the fabric up from the edge, and then do it again. This will hide the raw edge under fold, so that it won’t be seen in the finished hem. Use an iron to flatten this fabric out. Pin the hem in place. Use a series of straight pins to hold the fabric in place. Insert the pins so that the blunt/pearl end is on the fabric portion, while the needle/tip is sticking out towards the edge of the hem. If you are using a sewing machine, fold your ironed section under the fabric. Take the portion of fabric that you just folded/ironed, and fold it in the opposite direction so that it is hidden under the fabric. However, fold it so that about ⅛ of an inch is exposed. Your piece of fabric should now have the pattern-side down, but the tiny ⅛-inch exposed fold at the edge will show the fabric. Sew the hem. For hand sewing, start at the edge of your fold. Just above the fold, pick up a very small portion of the fabric. Then go left about 1/4 in and pick up a bit of the fold. Right above that, pick up a very small portion of the fabric again. Continue in this manner until you reach the end of your hem. For a sewing machine, change your stitch to the one that looks like ‘--^----^--’. Turn your fabric sideways on the sewing machine, so that the ⅛-inch fold is on the right side, and the rest of the fabric is on the left. Begin sewing down the edge where the fold and the rest of the fabric meet. You should keep the edge of the fabric plumb to the divider on your presser foot. Sew like this all the way down the hem, until you reach the end of your fabric. You should notice that the ‘^’ stitches will hook onto the body of the fabric, while the regular straight stitches in between remain on the ⅛-inch folded portion. Finish your hem. Tie and cut off the excess thread, and then unfold your hem. On one side (the back) you should see the hem sewn with the ‘--^----^--’ pattern. However, on the other side the stitch should be ‘blind’, as in you’ll only see a tiny dot where the ‘^’ stitch hooked onto the fabric. If this is the case, use an iron to flatten out the hem, and complete your sewing project.",
  "tyn_model":[
    "fabric",
    "sewing machine",
    "iron",
    "pins",
    "thread",
    "‘--^----^--",
    "‘^",
    "clothing",
    "straight pins",
    "⅛ of",
    "’.",
    "’ stitches",
    "’ pattern",
    "‘blind",
    "’,",
    "’ stitch"
  ],
  "tyn_section":[

  ]
}