{
  "title":"How to Make Your Own Bows",
  "url":"https://www.wikihow.com/Make-Your-Own-Bows",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects",
    "Bow Projects"
  ],
  "steps":[
    {
      "headline":"Cut a square out of your material.",
      "description":"It doesn't have to be exact. Cut a strip out of the rest of your material, make it about 1 centimeter (0.4 in) wide and slightly longer than your square."
    },
    {
      "headline":"Lay the square flat out in front of you.",
      "description":"Fold the top two corners into the middle, like your making a paper plane."
    },
    {
      "headline":"Repeat with the other two corners.",
      "description":""
    },
    {
      "headline":"Flip the square over so the folds are touching your work surface.",
      "description":"Carefully, start gathering the material together in the middle. It should start looking like a bow by now."
    },
    {
      "headline":"Tie the spare strip of material around the middle of your Bow, so it keeps its shape.",
      "description":"You might have to fiddle around with it, so each side is roughly even."
    },
    {
      "headline":"On the back of the bow, gently glue down all of the loose, flappy bits of the sides.",
      "description":"If you need to, fasten the tie to the bow too."
    },
    {
      "headline":"When the glue has dried/cooled down, take your needle and cotton and sew a few loops into the centre of the bow, make sure they're quite loose, and when you pull the cotton, the loops get tighter.",
      "description":""
    },
    {
      "headline":"Slide the smooth half of the bobby pin into the cotton loops, then pull the cotton tight so the bobby pin is secured.",
      "description":"If you need to, add a few more loops."
    },
    {
      "headline":"Then ta-da!",
      "description":"Your brand new bow is finished!"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Cut a square out of your material. It doesn't have to be exact. Cut a strip out of the rest of your material, make it about 1 centimeter (0.4 in) wide and slightly longer than your square. Lay the square flat out in front of you. Fold the top two corners into the middle, like your making a paper plane. Repeat with the other two corners.  Flip the square over so the folds are touching your work surface. Carefully, start gathering the material together in the middle. It should start looking like a bow by now. Tie the spare strip of material around the middle of your Bow, so it keeps its shape. You might have to fiddle around with it, so each side is roughly even. On the back of the bow, gently glue down all of the loose, flappy bits of the sides. If you need to, fasten the tie to the bow too. When the glue has dried/cooled down, take your needle and cotton and sew a few loops into the centre of the bow, make sure they're quite loose, and when you pull the cotton, the loops get tighter.  Slide the smooth half of the bobby pin into the cotton loops, then pull the cotton tight so the bobby pin is secured. If you need to, add a few more loops. Then ta-da! Your brand new bow is finished! Finished. ",
  "tyn_model":[
    "material",
    "cotton",
    "glue",
    "bobby pin",
    "needle"
  ],
  "tyn_section":[

  ]
}