{
  "title":"How to Learn Shorthand",
  "url":"https://www.wikihow.com/Learn-Shorthand",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Text and Lettering"
  ],
  "parts":[
    {
      "name":"Choosing a System of Shorthand",
      "steps":[
        {
          "headline":"Consider decisive factors before choosing a method.",
          "description":"There are several systems of shorthand, and they differ from one another. You need to consider a few different things:\nHow much time do you have to learn the system? How fast do you ultimately want to be able to write? Is there a standard system of shorthand for your profession?"
        },
        {
          "headline":"Choose Gregg Pre-Anniversary, Gregg Anniversary, or New Era Pitman for maximum speed.",
          "description":"Gregg and Pitman have been the leading competing systems in English shorthand since the 19th century, and both have been adapted to several other languages, as well. Gregg was developed by John Robert Gregg in 1888 and has since undergone several adaptations. Gregg Pre-Anniversary and Anniversary refer to the system as outlined in 1916 and 1929, respectively. There is a heavy load of symbols to memorize, but the trade-off is writing over 200 words per minute. Pitman was developed by Sir Isaac Pitman in 1837. New Era Pitman, a streamlined version of the original theory dating back to 1922, is quite complex but also lets you write over 200 words per minute. Since thick and thin strokes represent different pairs of sounds, you'll need a steel-tipped pen to write. Also, you need lined paper, since the lines are also part of the system."
        },
        {
          "headline":"Go with Gregg Simplified for fast writing and a moderate learning load.",
          "description":"Gregg Simplified can still get up to 200 words per minute. This version, introduced by McGraw-Hill in 1949, was the first shorthand intended for business rather than court reporting. There are significantly fewer things to memorize compared with Gregg Anniversary."
        },
        {
          "headline":"Learn Gregg Diamond Jubilee or Pitman 2000 if you have less time.",
          "description":"With these methods you can still write up to 160 words per minute, but they require a significantly shorter investment of time."
        },
        {
          "headline":"Use an alphabetic system if you want a fast, easy learning process.",
          "description":"Unlike symbol systems, where lines, curves and circles represent sounds, alphabetic systems are based on the alphabet. This makes them easier to learn, though you won't be able to achieve the same rapid speeds. Still, a good speedwriter could get up to 120 words per minute. Three examples of these are Speedwriting, AlphaHand, and Keyscript."
        },
        {
          "headline":"Choose Teeline Shorthand if you're a journalist.",
          "description":"Teeline is a hybrid system largely based on the forms of the alphabet. It is the preferred shorthand theory of the UK's National Council for the Training of Journalists and is taught to journalism majors there."
        }
      ]
    },
    {
      "name":"Gathering Resources on Shorthand",
      "steps":[
        {
          "headline":"Visit your local library or bookstore to locate books on learning shorthand.",
          "description":"Alternatively, you can order books about shorthand online. Lots of books on shorthand are probably out of print. This is why the library, used bookstores, or online bookstores may offer you a wider selection of texts. Some shorthand books are in the public domain and available for free download online."
        },
        {
          "headline":"Look for old \"text kits.\"",
          "description":"If you want to teach yourself shorthand, these kits are designed for you. They include records or tapes with dictation, texts, self-tests, and additional materials. Bear in mind that these probably require a record player (phonograph) or cassette player."
        },
        {
          "headline":"Obtain a shorthand dictionary for your system.",
          "description":"These publications can show how different words are written in shorthand."
        },
        {
          "headline":"Take advantage of an array of online shorthand resources.",
          "description":"These include tutorials, dictations, and shorthand samples."
        },
        {
          "headline":"Enroll in a shorthand class.",
          "description":"Such classes may be offered online or in person. Make sure you understand the terms of the course and that you have adequate time in your schedule to meet the workload."
        }
      ]
    },
    {
      "name":"Practicing Shorthand",
      "steps":[
        {
          "headline":"Start off with realistic expectations.",
          "description":"Claims that you can learn shorthand in a few hours should be taken with a dose of skepticism. The time it will take you depends on how often you practice, the difficulty of the system, and your goal speed. It may take as long as a year of hard work to really master a useful shorthand."
        },
        {
          "headline":"Prioritize mastery over speed.",
          "description":"You need to fully absorb the word-building principles first; speed comes from them."
        },
        {
          "headline":"Practice every day.",
          "description":"Try for at least 45 minutes to an hour, if you can. Remember, though, that even daily short sessions are better than one or two longer ones per week."
        },
        {
          "headline":"Drill in stages.",
          "description":"Start with the alphabet, filling each line of a piece of notebook paper with one letter. Next, you'll move on to words, doing the same thing. When you're ready, you'll move on to common groups of words. Saying the words aloud as you write them helps your brain make the connection between the phonemic sound and the symbol."
        },
        {
          "headline":"Increase speed with dictation exercises.",
          "description":"Shorthand dictations come in different speeds (words per minute), so you can work your way to an increasingly rapid pace. Practice each speed (30, 40, 50, 60, etc.) until you're comfortable, then move on. If you want to practice as much as possible, put dictations on your MP3 player and practice whenever you have a few extra minutes."
        }
      ]
    }
  ],
  "text":" Choosing a System of Shorthand Consider decisive factors before choosing a method. There are several systems of shorthand, and they differ from one another. You need to consider a few different things:\nHow much time do you have to learn the system? How fast do you ultimately want to be able to write? Is there a standard system of shorthand for your profession? Choose Gregg Pre-Anniversary, Gregg Anniversary, or New Era Pitman for maximum speed. Gregg and Pitman have been the leading competing systems in English shorthand since the 19th century, and both have been adapted to several other languages, as well. Gregg was developed by John Robert Gregg in 1888 and has since undergone several adaptations. Gregg Pre-Anniversary and Anniversary refer to the system as outlined in 1916 and 1929, respectively. There is a heavy load of symbols to memorize, but the trade-off is writing over 200 words per minute. Pitman was developed by Sir Isaac Pitman in 1837. New Era Pitman, a streamlined version of the original theory dating back to 1922, is quite complex but also lets you write over 200 words per minute. Since thick and thin strokes represent different pairs of sounds, you'll need a steel-tipped pen to write. Also, you need lined paper, since the lines are also part of the system. Go with Gregg Simplified for fast writing and a moderate learning load. Gregg Simplified can still get up to 200 words per minute. This version, introduced by McGraw-Hill in 1949, was the first shorthand intended for business rather than court reporting. There are significantly fewer things to memorize compared with Gregg Anniversary. Learn Gregg Diamond Jubilee or Pitman 2000 if you have less time. With these methods you can still write up to 160 words per minute, but they require a significantly shorter investment of time. Use an alphabetic system if you want a fast, easy learning process. Unlike symbol systems, where lines, curves and circles represent sounds, alphabetic systems are based on the alphabet. This makes them easier to learn, though you won't be able to achieve the same rapid speeds. Still, a good speedwriter could get up to 120 words per minute. Three examples of these are Speedwriting, AlphaHand, and Keyscript. Choose Teeline Shorthand if you're a journalist. Teeline is a hybrid system largely based on the forms of the alphabet. It is the preferred shorthand theory of the UK's National Council for the Training of Journalists and is taught to journalism majors there. Gathering Resources on Shorthand Visit your local library or bookstore to locate books on learning shorthand. Alternatively, you can order books about shorthand online. Lots of books on shorthand are probably out of print. This is why the library, used bookstores, or online bookstores may offer you a wider selection of texts. Some shorthand books are in the public domain and available for free download online. Look for old \"text kits.\" If you want to teach yourself shorthand, these kits are designed for you. They include records or tapes with dictation, texts, self-tests, and additional materials. Bear in mind that these probably require a record player (phonograph) or cassette player. Obtain a shorthand dictionary for your system. These publications can show how different words are written in shorthand. Take advantage of an array of online shorthand resources. These include tutorials, dictations, and shorthand samples. Enroll in a shorthand class. Such classes may be offered online or in person. Make sure you understand the terms of the course and that you have adequate time in your schedule to meet the workload. Practicing Shorthand Start off with realistic expectations. Claims that you can learn shorthand in a few hours should be taken with a dose of skepticism. The time it will take you depends on how often you practice, the difficulty of the system, and your goal speed. It may take as long as a year of hard work to really master a useful shorthand. Prioritize mastery over speed. You need to fully absorb the word-building principles first; speed comes from them. Practice every day. Try for at least 45 minutes to an hour, if you can. Remember, though, that even daily short sessions are better than one or two longer ones per week. Drill in stages. Start with the alphabet, filling each line of a piece of notebook paper with one letter. Next, you'll move on to words, doing the same thing. When you're ready, you'll move on to common groups of words. Saying the words aloud as you write them helps your brain make the connection between the phonemic sound and the symbol. Increase speed with dictation exercises. Shorthand dictations come in different speeds (words per minute), so you can work your way to an increasingly rapid pace. Practice each speed (30, 40, 50, 60, etc.) until you're comfortable, then move on. If you want to practice as much as possible, put dictations on your MP3 player and practice whenever you have a few extra minutes.",
  "tyn_model":[
    "shorthand",
    "gregg",
    "pitman",
    "pen",
    "speedwriting,",
    "teeline shorthand",
    "teeline",
    "shorthand books",
    "text kits",
    "shorthand dictionary",
    "shorthand resources",
    "shorthand samples",
    "shorthand class",
    "notebook paper",
    "dictation exercises",
    "mp3 player"
  ],
  "tyn_section":[

  ]
}