{
  "title":"How to Cook Red Snapper",
  "url":"https://www.wikihow.com/Cook-Red-Snapper",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "methods":[
    {
      "name":"Baking Whole Snapper",
      "steps":[
        {
          "headline":"Pick out a whole fish.",
          "description":"There are many varieties of snapper, but red snapper has distinctive bright red metallic skin that fades into pink near the belly. When you're picking out a whole snapper, look for eyes that are clear and red. The flesh should be firm to the touch. Snapper has become so ubiquitous that it's often used as a catchall term for any kind of white fish. For this reason it's commonly mislabeled as a similar but less desirable fish, like rock cod. When you buy snapper, be sure to do so from a trusted fishmonger so you'll know you're buying the real thing. Ask for the fish to be gutted and cleaned, unless you want to do so yourself. You’ll need about ¾ of whole snapper per serving."
        },
        {
          "headline":"Preheat the oven to 350 degrees.",
          "description":"Be sure it's completely preheated before you put the fish in the oven."
        },
        {
          "headline":"Prep a baking pan.",
          "description":"Choose a metal, glass or ceramic baking pan or dish that's just large enough to hold the fish. Line the pan with aluminum foil to prevent the fish from sticking."
        },
        {
          "headline":"Season the fish.",
          "description":"Red snapper is delicious with light seasonings that complement its fresh flavor. Sprinkle salt, pepper and lemon juice to taste inside the fish’s cavity. Add pieces of butter inside the fish to keep it moist while it bakes. Season the outside with more salt and pepper. If you want the dish to have an herbal taste, add sprigs of thyme, rosemary or basil inside the fish's cavity. For a complete meal, place sliced carrots, onions or potatoes around the fish in the baking dish. The vegetables will cook along with the fish."
        },
        {
          "headline":"Bake the fish.",
          "description":"Place the baking dish in the oven and cook the fish for 45 minutes, or until the fish is cooked through. It can be a little tricky to tell whether the fish is ready, but you know it's done with the flesh is no longer translucent. After 40 minutes or so, check the fish to see if it's done. You can gently pull back some flesh with a fork. If it looks white and easily flakes off, it's ready. If it's still a little rubbery, it needs more time. Return it to the oven if it needs more time, then check again in five or ten minutes."
        },
        {
          "headline":"Transfer the fish to a platter and serve.",
          "description":"Whole red snapper looks impressive on a platter surrounded by fresh herb sprigs. To serve, use a serving fork or spoon to heap fish on individual plates."
        }
      ]
    },
    {
      "name":"Roasting Fillets",
      "steps":[
        {
          "headline":"Choose fresh red snapper fillets.",
          "description":"Red snapper fillets should be purchased with the skin on, since it yields a delicious flavor and helps keep the fish together while it cooks. Look for fillets with metallic pink skin and firm flesh. You will need 1/4 to 1/3 pound per serving size."
        },
        {
          "headline":"Preheat the oven to 425 degrees Fahrenheit (218 Celsius).",
          "description":"This high cooking temperature helps the fillets roast quickly so they have a flaky, moist texture."
        },
        {
          "headline":"Line a rimmed baking sheet with lemon slices.",
          "description":"Baking the fillets on top of lemon slices helps them retain moisture. First lightly oil a baking sheet that has a rim. Slice a lemon into thin discs and lay them out on the baking sheet."
        },
        {
          "headline":"Place a fillet on top of each pair of slices.",
          "description":"One fillet should fit neatly over two slices, but if you're roasting large fillets, you might need three. Position each fillet skin side down."
        },
        {
          "headline":"Season the fillets.",
          "description":"Sprinkle the top of the fillets with salt and pepper. You can also add a little cayenne, garlic powder, thyme, or any other herb to taste."
        },
        {
          "headline":"Bake the fillets.",
          "description":"Place the baking sheet in the oven once the oven is completely preheated. Bake the snapper fillets for about 15 minutes, or until they are no longer translucent. When they're done, the flesh should be opaque and it should flake easily when poked with a fork."
        },
        {
          "headline":"Make a sauce.",
          "description":"Red snapper fillets can be dressed up with a simple butter sauce that brings out the best in their flavor. The sauce is quite easy to make, and it will take the dish up a notch. While the fish is baking, melt together the following ingredients in a saucepan:\n2 tablespoons butter\n¼ teaspoon paprika\n1 teaspoon chopped rosemary\nSalt and pepper to taste\nA teaspoon of lemon zest"
        },
        {
          "headline":"Serve the filets with the herbed butter.",
          "description":"Place each fillet on a plate atop two lemon sliced. Pour a little melted butter over each fillet."
        }
      ]
    },
    {
      "name":"Sauteing Fillets",
      "steps":[
        {
          "headline":"Buy fresh red snapper fillets.",
          "description":"Pick out fillets with the skin on, since it becomes deliciously crispy when you sauté fillets. Buy fillets with metallic pink skin and firm flesh. You will need 1/4 to 1/3 pound per serving size."
        },
        {
          "headline":"Season the fillets with salt and pepper.",
          "description":"Pat the fillets with a paper towel to make sure they're completely dry, then sprinkle both sides with salt and pepper."
        },
        {
          "headline":"Heat olive oil over medium heat.",
          "description":"Heat the oil until it's hot, but not smoking."
        },
        {
          "headline":"Add the fillets skin side down.",
          "description":"When the oil is hot, slip them into the pan. Cook them until the skin is golden brown, about three minutes. Monitor the heat while they cook to make sure the skin isn't getting burned. If it turns brown right away, reduce the heat."
        },
        {
          "headline":"Flip the fillets and finish cooking them.",
          "description":"The fillets should cook on the other side for about three more minutes. The fish is done when it’s no longer translucent and flakes easily when poked with a fork."
        },
        {
          "headline":"Serve the fillets.",
          "description":"They're excellent with melted butter and lemon juice."
        }
      ]
    },
    {
      "name":"Deep Frying Fillets",
      "steps":[
        {
          "headline":"Use skinless fillets.",
          "description":"You may not be able to find skinless red snapper, but you can remove the skin once you get it home. The fillets will fry more evenly without the skin. Slice the fillets into finger-sized pieces to help them cook more quickly and evenly."
        },
        {
          "headline":"Prepare the batter.",
          "description":"Red snapper is so versatile that it tastes great with any type of breading or batter. You can use a classic dry seafood breading, Japanese Panko breading, or a beer batter. To make a dry breading, mix 1/2 cup flour, 1/2 cup dry bread crumbs and 1/2 teaspoon salt. Add black and red pepper to taste. Panko is a popular choice as well. This breading is sold in canisters available in the breading aisle in the grocery store. If you like the taste of beer batter, mix 2 cups flour and one 12-ounce beer. Add 1/2 teaspoon salt and black pepper to taste."
        },
        {
          "headline":"Heat the oil.",
          "description":"Pour enough oil into a stockpot to rise up the sides by two inches. Heat it over medium high heat until it reaches 365 degrees. Check the temperature with a kitchen thermometer before you proceed, since the fish won't fry correctly if the oil isn't hot enough. Use an oil with a high smoke point, such as canola oil or peanut oil. Olive oil and other low smoke point oils will break down when they're heated to a high temperature."
        },
        {
          "headline":"Dredge the fillets in the batter.",
          "description":"Be sure each piece is well coated on all sides. Try placing the fillets and batter together in a bag and shaking it to coat the fillets evenly."
        },
        {
          "headline":"Fry the fillets.",
          "description":"Place them in the oil a few at a time. Fry them for one or two minutes, or until the pieces float. Don’t crowd the pan or they won’t cook properly. The fish will fry very quickly, so monitor the pieces carefully to ensure they don't burn."
        },
        {
          "headline":"Remove the fillets and drain them on a paper towel.",
          "description":"Use a slotted spoon to transfer them from the pot to a towel-lined plate. The fried fish pieces are excellent when served with lemon wedges and tartar sauce."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Baking Whole Snapper Pick out a whole fish. There are many varieties of snapper, but red snapper has distinctive bright red metallic skin that fades into pink near the belly. When you're picking out a whole snapper, look for eyes that are clear and red. The flesh should be firm to the touch. Snapper has become so ubiquitous that it's often used as a catchall term for any kind of white fish. For this reason it's commonly mislabeled as a similar but less desirable fish, like rock cod. When you buy snapper, be sure to do so from a trusted fishmonger so you'll know you're buying the real thing. Ask for the fish to be gutted and cleaned, unless you want to do so yourself. You’ll need about ¾ of whole snapper per serving. Preheat the oven to 350 degrees. Be sure it's completely preheated before you put the fish in the oven. Prep a baking pan. Choose a metal, glass or ceramic baking pan or dish that's just large enough to hold the fish. Line the pan with aluminum foil to prevent the fish from sticking. Season the fish. Red snapper is delicious with light seasonings that complement its fresh flavor. Sprinkle salt, pepper and lemon juice to taste inside the fish’s cavity. Add pieces of butter inside the fish to keep it moist while it bakes. Season the outside with more salt and pepper. If you want the dish to have an herbal taste, add sprigs of thyme, rosemary or basil inside the fish's cavity. For a complete meal, place sliced carrots, onions or potatoes around the fish in the baking dish. The vegetables will cook along with the fish. Bake the fish. Place the baking dish in the oven and cook the fish for 45 minutes, or until the fish is cooked through. It can be a little tricky to tell whether the fish is ready, but you know it's done with the flesh is no longer translucent. After 40 minutes or so, check the fish to see if it's done. You can gently pull back some flesh with a fork. If it looks white and easily flakes off, it's ready. If it's still a little rubbery, it needs more time. Return it to the oven if it needs more time, then check again in five or ten minutes. Transfer the fish to a platter and serve. Whole red snapper looks impressive on a platter surrounded by fresh herb sprigs. To serve, use a serving fork or spoon to heap fish on individual plates. Roasting Fillets Choose fresh red snapper fillets. Red snapper fillets should be purchased with the skin on, since it yields a delicious flavor and helps keep the fish together while it cooks. Look for fillets with metallic pink skin and firm flesh. You will need 1/4 to 1/3 pound per serving size. Preheat the oven to 425 degrees Fahrenheit (218 Celsius). This high cooking temperature helps the fillets roast quickly so they have a flaky, moist texture. Line a rimmed baking sheet with lemon slices. Baking the fillets on top of lemon slices helps them retain moisture. First lightly oil a baking sheet that has a rim. Slice a lemon into thin discs and lay them out on the baking sheet. Place a fillet on top of each pair of slices. One fillet should fit neatly over two slices, but if you're roasting large fillets, you might need three. Position each fillet skin side down. Season the fillets. Sprinkle the top of the fillets with salt and pepper. You can also add a little cayenne, garlic powder, thyme, or any other herb to taste. Bake the fillets. Place the baking sheet in the oven once the oven is completely preheated. Bake the snapper fillets for about 15 minutes, or until they are no longer translucent. When they're done, the flesh should be opaque and it should flake easily when poked with a fork. Make a sauce. Red snapper fillets can be dressed up with a simple butter sauce that brings out the best in their flavor. The sauce is quite easy to make, and it will take the dish up a notch. While the fish is baking, melt together the following ingredients in a saucepan:\n2 tablespoons butter\n¼ teaspoon paprika\n1 teaspoon chopped rosemary\nSalt and pepper to taste\nA teaspoon of lemon zest Serve the filets with the herbed butter. Place each fillet on a plate atop two lemon sliced. Pour a little melted butter over each fillet. Sauteing Fillets Buy fresh red snapper fillets. Pick out fillets with the skin on, since it becomes deliciously crispy when you sauté fillets. Buy fillets with metallic pink skin and firm flesh. You will need 1/4 to 1/3 pound per serving size. Season the fillets with salt and pepper. Pat the fillets with a paper towel to make sure they're completely dry, then sprinkle both sides with salt and pepper. Heat olive oil over medium heat. Heat the oil until it's hot, but not smoking. Add the fillets skin side down. When the oil is hot, slip them into the pan. Cook them until the skin is golden brown, about three minutes. Monitor the heat while they cook to make sure the skin isn't getting burned. If it turns brown right away, reduce the heat. Flip the fillets and finish cooking them. The fillets should cook on the other side for about three more minutes. The fish is done when it’s no longer translucent and flakes easily when poked with a fork. Serve the fillets. They're excellent with melted butter and lemon juice. Deep Frying Fillets Use skinless fillets. You may not be able to find skinless red snapper, but you can remove the skin once you get it home. The fillets will fry more evenly without the skin. Slice the fillets into finger-sized pieces to help them cook more quickly and evenly. Prepare the batter. Red snapper is so versatile that it tastes great with any type of breading or batter. You can use a classic dry seafood breading, Japanese Panko breading, or a beer batter. To make a dry breading, mix 1/2 cup flour, 1/2 cup dry bread crumbs and 1/2 teaspoon salt. Add black and red pepper to taste. Panko is a popular choice as well. This breading is sold in canisters available in the breading aisle in the grocery store. If you like the taste of beer batter, mix 2 cups flour and one 12-ounce beer. Add 1/2 teaspoon salt and black pepper to taste. Heat the oil. Pour enough oil into a stockpot to rise up the sides by two inches. Heat it over medium high heat until it reaches 365 degrees. Check the temperature with a kitchen thermometer before you proceed, since the fish won't fry correctly if the oil isn't hot enough. Use an oil with a high smoke point, such as canola oil or peanut oil. Olive oil and other low smoke point oils will break down when they're heated to a high temperature. Dredge the fillets in the batter. Be sure each piece is well coated on all sides. Try placing the fillets and batter together in a bag and shaking it to coat the fillets evenly. Fry the fillets. Place them in the oil a few at a time. Fry them for one or two minutes, or until the pieces float. Don’t crowd the pan or they won’t cook properly. The fish will fry very quickly, so monitor the pieces carefully to ensure they don't burn. Remove the fillets and drain them on a paper towel. Use a slotted spoon to transfer them from the pot to a towel-lined plate. The fried fish pieces are excellent when served with lemon wedges and tartar sauce. Finished. ",
  "tyn_model":[
    "snapper",
    "oven",
    "red snapper",
    "oil",
    "fish",
    "butter",
    "salt and pepper",
    "baking sheet",
    "lemon",
    "fork",
    "salt",
    "baking pan",
    "lemon juice",
    "rosemary",
    "baking dish",
    "olive oil",
    "flour",
    "rock cod",
    "aluminum foil",
    "salt, pepper",
    "basil",
    "carrots",
    "potatoes",
    "serving fork",
    "garlic powder",
    "thyme",
    "butter sauce",
    "saucepan",
    "paprika",
    "lemon zest",
    "herbed butter",
    "plate",
    "paper towel",
    "pan",
    "deep frying fillets",
    "dry bread",
    "black and red pepper",
    "black pepper",
    "stockpot",
    "kitchen thermometer",
    "canola oil",
    "peanut oil",
    "batter",
    "slotted spoon",
    "pot",
    "lemon wedges",
    "tartar sauce"
  ],
  "tyn_section":[

  ]
}