{
  "title":"How to Make Fried Green Beans",
  "url":"https://www.wikihow.com/Make-Fried-Green-Beans",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Making Stir-Fried Green Beans",
      "steps":[
        {
          "headline":"Heat a wok or frying pan on the stove.",
          "description":"Before you do any frying, you'll want to get your pan nice and hot. Traditionally, stir fry dishes are cooked in a wok, but you can use nearly any steep-sided frying pan. Set the pan over a burner set to medium-high and allow it to heat up. Don't add the oil yet. A common expression in stir frying is \"hot wok, cold oil.\" To get the best possible texture, add the ingredients one at a time in the correct order."
        },
        {
          "headline":"Add oil to the pan, then the garlic and red pepper.",
          "description":"When the pan is nearly smoking hot, add a splash of oil to the pan. Follow this with the garlic and red pepper. The garlic should start sizzling nearly as soon as it hits the pan. Stir with a wooden spoon or spatula. Any cooking oil will work, but for best results, use an oil with a high smoke point like canola or peanut oil. Other oils can smoke and gain a bitter taste at the high temperatures used for stir frying."
        },
        {
          "headline":"Trim and chop the beans.",
          "description":"This isn't strictly necessary, but if you remove the stems and tough tips of each bean, they'll be easier to eat. After this, chop the beans into inch-sized segments so they cook quickly. A quick way to trim green beans is to line them up on a cutting board, then simply run a sharp knife down the row to remove about a half inch from each tip. Repeat for the other side."
        },
        {
          "headline":"Add the green beans and onions.",
          "description":"Use the spoon or spatula to stir the vegetables around in the oil and seasonings. Ensure they get a good coating — this will keep them from sticking. You can also use a tossing motion of the pan to combine the ingredients. However, because hot oil can cause dangerous burns, stick to the spoon unless you've already practiced this skill. See our article on this topic for more information."
        },
        {
          "headline":"Let cook, stirring only periodically.",
          "description":"Once the vegetables are combined, spread them out in the pan and let them cook without stirring. This will give them a nice sear — the brown, crispy texture that's so delicious on stir fried vegetables. After about 90 seconds, stir the vegetables and let them sear again for another 90 seconds or so. If you're not noticing your vegetables brown, turn the heat up."
        },
        {
          "headline":"Optionally, give the beans a soy glaze.",
          "description":"If you like the flavor of soy sauce, use this step to give your green beans a sweet soy flavor. Mix soy sauce and sugar in a small bowl as you're waiting for the beans to cook. When the beans are browned, pour the mixture into the pan. Stir to combine. Stir actively for the first few seconds to prevent the sugar from burning. Once the beans are well-coated with the sauce, you can slow down and let the sugar caramelize to bring out a smokier, more complex flavor."
        },
        {
          "headline":"Add sesame oil, season, and serve.",
          "description":"Check the appearance and texture of the vegetables as they continue to cook. When the beans have softened somewhat and the onions have gained a brown sear, they're ready. Splash a little sesame oil into the pan along with salt and pepper (you may want to go easy on the salt if you added soy sauce). Stir once more to combine. Your beans are ready to eat! The sesame oil is just for flavor, so don't use much — a teaspoon should do. Sesame oil also has a low smoke point, so you don't want it in the hot pan for long. The beans are ready to eat immediately, but if you let them sit in the pan (or together on a serving dish), they'll continue to cook and soften a little bit more."
        },
        {
          "headline":"Add other ingredients to customize your recipe.",
          "description":"You've just learned how to make a basic vegetable stir fry, but one of the nice things about this recipe is that it's easy to get creative with it. If you add new ingredients, try to cook them in order of how long they take to cook — things that take longer to cook go first. Just a few ideas are below. Meats (beef, chicken, or seafood) — add before the vegetables. Ginger (powdered or fresh) — add with the vegetables. Other vegetables (bell peppers, cooked carrots, peas, water chestnuts, etc.) Dry seasonings (parsley, garlic/onion powder, etc.) — add with the garlic and red pepper."
        }
      ]
    },
    {
      "name":"Making Breaded Green Bean Fries",
      "steps":[
        {
          "headline":"Make a batter from the beer, flour, salt, and pepper.",
          "description":"Mix these ingredients together in a small bowl until you have a smooth, velvety batter with few lumps. You can use as much salt and pepper as you like, but if you're unsure, about 2 teaspoons of salt and 1/2 teaspoon of black pepper ought to do."
        },
        {
          "headline":"Heat oil in a pan on the stove.",
          "description":"Add the oil to a steep-sided pan. Use at least enough to cover the fries when they are submerged. This is called \"deep frying.\" As in the section above, you'll want to use an oil like canola or peanut oil that has a high smoke point here. Avoid olive oil. You want the oil at about 375 degrees F (177 degrees C) when you start frying. If you have a cooking thermometer, use this. If you don't, heating at medium-high for about 5-10 minutes will usually be enough."
        },
        {
          "headline":"Trim the beans.",
          "description":"As with the recipe above, it's best to remove the stems and tips of the beans before you start to cook them. Line the beans up on a cutting board and run a sharp knife down the row to trim off a half inch from either end. If you want your final product to resemble french fries, don't shop the beans into small pieces. If you don't care, you can still do this."
        },
        {
          "headline":"Dip the beans in the batter to coat.",
          "description":"If you don't mind getting your fingers dirty, you can do this by hand — otherwise, drop the beans in and stir to coat. Remove the beans, let any excess better drip off, and transfer to a clean plate."
        },
        {
          "headline":"Fry the battered beans.",
          "description":"At this point, the oil should be hot — you can test this by dropping some batter in and seeing if it sizzles. Use a slotted spoon or strainer to transfer the beans to the oil and submerge them. Let them fry, floating and sizzling in the oil. Stir minimally. Fry the beans in batches, taking care not to crowd the pan or they may stick to each other."
        },
        {
          "headline":"Let the beans drain.",
          "description":"As soon as the beans have reached a pleasant golden-brown color and are crispy all over, they're ready to eat. Use a strainer or slotted spoon to carefully remove them from the hot oil. Let the excess oil drip off of each back of fries, then transfer them to a cooling rack over a paper towel. If you don't have a cooling rack, you can simply pile the fries on a paper towel-lined plate, but this can eliminate the crunchy texture of the batter."
        },
        {
          "headline":"Season and serve.",
          "description":"When the beans are cool enough to eat, give them a light sprinkling with salt and pepper. Your fries are ready to eat! If you want to \"spice up\" your recipe, this is a good time to dust the fries with your preferred dry seasonings. For example, you might try sprinkling a little Cajun seasoning or cayenne pepper over the fries to give them a little heat."
        }
      ]
    }
  ],
  "text":" Making Stir-Fried Green Beans Heat a wok or frying pan on the stove. Before you do any frying, you'll want to get your pan nice and hot. Traditionally, stir fry dishes are cooked in a wok, but you can use nearly any steep-sided frying pan. Set the pan over a burner set to medium-high and allow it to heat up. Don't add the oil yet. A common expression in stir frying is \"hot wok, cold oil.\" To get the best possible texture, add the ingredients one at a time in the correct order. Add oil to the pan, then the garlic and red pepper. When the pan is nearly smoking hot, add a splash of oil to the pan. Follow this with the garlic and red pepper. The garlic should start sizzling nearly as soon as it hits the pan. Stir with a wooden spoon or spatula. Any cooking oil will work, but for best results, use an oil with a high smoke point like canola or peanut oil. Other oils can smoke and gain a bitter taste at the high temperatures used for stir frying. Trim and chop the beans. This isn't strictly necessary, but if you remove the stems and tough tips of each bean, they'll be easier to eat. After this, chop the beans into inch-sized segments so they cook quickly. A quick way to trim green beans is to line them up on a cutting board, then simply run a sharp knife down the row to remove about a half inch from each tip. Repeat for the other side. Add the green beans and onions. Use the spoon or spatula to stir the vegetables around in the oil and seasonings. Ensure they get a good coating — this will keep them from sticking. You can also use a tossing motion of the pan to combine the ingredients. However, because hot oil can cause dangerous burns, stick to the spoon unless you've already practiced this skill. See our article on this topic for more information. Let cook, stirring only periodically. Once the vegetables are combined, spread them out in the pan and let them cook without stirring. This will give them a nice sear — the brown, crispy texture that's so delicious on stir fried vegetables. After about 90 seconds, stir the vegetables and let them sear again for another 90 seconds or so. If you're not noticing your vegetables brown, turn the heat up. Optionally, give the beans a soy glaze. If you like the flavor of soy sauce, use this step to give your green beans a sweet soy flavor. Mix soy sauce and sugar in a small bowl as you're waiting for the beans to cook. When the beans are browned, pour the mixture into the pan. Stir to combine. Stir actively for the first few seconds to prevent the sugar from burning. Once the beans are well-coated with the sauce, you can slow down and let the sugar caramelize to bring out a smokier, more complex flavor. Add sesame oil, season, and serve. Check the appearance and texture of the vegetables as they continue to cook. When the beans have softened somewhat and the onions have gained a brown sear, they're ready. Splash a little sesame oil into the pan along with salt and pepper (you may want to go easy on the salt if you added soy sauce). Stir once more to combine. Your beans are ready to eat! The sesame oil is just for flavor, so don't use much — a teaspoon should do. Sesame oil also has a low smoke point, so you don't want it in the hot pan for long. The beans are ready to eat immediately, but if you let them sit in the pan (or together on a serving dish), they'll continue to cook and soften a little bit more. Add other ingredients to customize your recipe. You've just learned how to make a basic vegetable stir fry, but one of the nice things about this recipe is that it's easy to get creative with it. If you add new ingredients, try to cook them in order of how long they take to cook — things that take longer to cook go first. Just a few ideas are below. Meats (beef, chicken, or seafood) — add before the vegetables. Ginger (powdered or fresh) — add with the vegetables. Other vegetables (bell peppers, cooked carrots, peas, water chestnuts, etc.) Dry seasonings (parsley, garlic/onion powder, etc.) — add with the garlic and red pepper. Making Breaded Green Bean Fries Make a batter from the beer, flour, salt, and pepper. Mix these ingredients together in a small bowl until you have a smooth, velvety batter with few lumps. You can use as much salt and pepper as you like, but if you're unsure, about 2 teaspoons of salt and 1/2 teaspoon of black pepper ought to do. Heat oil in a pan on the stove. Add the oil to a steep-sided pan. Use at least enough to cover the fries when they are submerged. This is called \"deep frying.\" As in the section above, you'll want to use an oil like canola or peanut oil that has a high smoke point here. Avoid olive oil. You want the oil at about 375 degrees F (177 degrees C) when you start frying. If you have a cooking thermometer, use this. If you don't, heating at medium-high for about 5-10 minutes will usually be enough. Trim the beans. As with the recipe above, it's best to remove the stems and tips of the beans before you start to cook them. Line the beans up on a cutting board and run a sharp knife down the row to trim off a half inch from either end. If you want your final product to resemble french fries, don't shop the beans into small pieces. If you don't care, you can still do this. Dip the beans in the batter to coat. If you don't mind getting your fingers dirty, you can do this by hand — otherwise, drop the beans in and stir to coat. Remove the beans, let any excess better drip off, and transfer to a clean plate. Fry the battered beans. At this point, the oil should be hot — you can test this by dropping some batter in and seeing if it sizzles. Use a slotted spoon or strainer to transfer the beans to the oil and submerge them. Let them fry, floating and sizzling in the oil. Stir minimally. Fry the beans in batches, taking care not to crowd the pan or they may stick to each other. Let the beans drain. As soon as the beans have reached a pleasant golden-brown color and are crispy all over, they're ready to eat. Use a strainer or slotted spoon to carefully remove them from the hot oil. Let the excess oil drip off of each back of fries, then transfer them to a cooling rack over a paper towel. If you don't have a cooling rack, you can simply pile the fries on a paper towel-lined plate, but this can eliminate the crunchy texture of the batter. Season and serve. When the beans are cool enough to eat, give them a light sprinkling with salt and pepper. Your fries are ready to eat! If you want to \"spice up\" your recipe, this is a good time to dust the fries with your preferred dry seasonings. For example, you might try sprinkling a little Cajun seasoning or cayenne pepper over the fries to give them a little heat.",
  "tyn_model":[
    "oil",
    "beans",
    "vegetables",
    "garlic",
    "pan",
    "sesame oil",
    "salt",
    "wok",
    "red pepper",
    "green beans",
    "soy sauce",
    "sugar",
    "— add",
    "stir frying",
    "spatula",
    "peanut oil",
    "onions",
    "spoon",
    "seasonings",
    "pepper",
    "salt and pepper",
    "slotted spoon",
    "strainer",
    "stir fry dishes",
    "frying pan",
    "burner",
    "wooden spoon",
    "cooking oil",
    "canola",
    "sharp knife",
    "— this",
    "— the",
    "small bowl",
    "— a",
    "serving dish",
    "— things",
    "seafood",
    "ginger",
    "bell peppers",
    "carrots",
    "peas",
    "water chestnuts",
    "parsley",
    "onion powder",
    "green bean fries",
    "beer",
    "flour",
    "stove",
    "canola or",
    "olive oil",
    "cooking thermometer",
    "cutting board",
    "knife",
    "— otherwise",
    "plate",
    "— you",
    "paper towel",
    "paper towel-",
    "cajun seasoning",
    "cayenne pepper"
  ],
  "tyn_section":[

  ]
}