{
  "title":"How to Boil Fish",
  "url":"https://www.wikihow.com/Boil-Fish",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "parts":[
    {
      "name":"Gathering Your Supplies",
      "steps":[
        {
          "headline":"Choose the right type of fish.",
          "description":"Traditional fish boil recipes use fish local to Wisconsin and Lake Michigan, such as lake trout and whitefish. However, you can use scrod, cod, haddock, or salmon if you don’t have access to local whitefish. For this recipe, you’ll need (4) ½ pound whitefish steaks. If you want to adjust the recipe for a larger group, have approximately a ½ pound to ¾ pound (227 g to 340 g) of fish per person."
        },
        {
          "headline":"Find a large cast-iron pot and fire logs for an outdoor boil.",
          "description":"If you are planning a traditional outdoor fish boil, you’ll boil the fish in a large pot on an open fire. A cast-iron pot typically works best, and you’ll need logs or slab wood, as well as matches or a lighter, for the fire. If you can’t find a cast-iron pot or kettle for the fish boil, you can use a stainless steel or aluminum pot. It also helps to have a wire basket that you can place the fish in and lower into the pot that you’re using. That makes it easier to remove the fish while it’s finished boiling. Make sure that you have extra logs or slab wood on hand for the fire in case you to feed it during the fish boil. Instead of a log fire, you can use a propane torch to heat the pot for the boil."
        },
        {
          "headline":"Select a large stockpot for an indoor boil.",
          "description":"You can recreate a fish boil at home without starting an outdoor fire. Instead, use a large stainless steel or aluminum stock pot with on your stovetop. If your pot has a basket or a strainer insert, you’ll have an easier time removing the fish when they’re done cooking. If you don’t have a strainer or basket for the pot, use a slotted spoon to remove the fish from the water when they’ve finished boiling."
        }
      ]
    },
    {
      "name":"Boiling the Fish",
      "steps":[
        {
          "headline":"Salt the water and bring it to a boil.",
          "description":"Fill your pot with approximately 1.5 gallons (5.7 L) of water. Stir in ¾ cup (177 g) of kosher salt until it’s thoroughly combined. Next, allow the pot to come to a full, rolling boil. If you’re cooking the fish on an outdoor fire, throw additional logs on the wood to feed the flames if the pot isn’t boiling. If you’re cooking on the stove, the heat should be set at high."
        },
        {
          "headline":"Add the seasonings to the water and boil for several minutes.",
          "description":"Take a piece of cheesecloth, and create a seasoning packet with equal parts bay leaves, whole allspice, and peppercorns in equal proportions that is approximately half the size of golf ball. Add it to the water and allow it to boil for 2 to 3 minutes. You can add any spices or seasonings that you like, such as fresh rosemary or thyme, to the packet."
        },
        {
          "headline":"Place the fish in the water and boil for 10 to 12 minutes or until fish flakes easily.",
          "description":"Arrange the fish in a wire basket, and submerge it in the pot. Wait for the water to return to a boil, which may take 2 to 3 minutes, and then allow the fish to boil until you can flake it easily with a fork, which should take approximately 10 to 12 minutes."
        },
        {
          "headline":"Skim the froth and remove the fish.",
          "description":"Once the fish flakes easily and is ready to be removed from the pot, take a moment to skim the froth from the surface of the water with a spoon so the fish won’t pass through it when you remove it. Lift the basket from the pot and drain carefully. If you don’t use a wire basket for the fish, remove the individual pieces from the pot with a slotted spoon, shaking carefully to ensure that they’re fully drained."
        }
      ]
    },
    {
      "name":"Adding Vegetables to the Boil",
      "steps":[
        {
          "headline":"Clean the potatoes and peel the onions.",
          "description":"While you can boil fish without any vegetables, a traditional fish boil typically includes potatoes and onions, which are partially boiled before you add the fish. Take 1 ½ pounds (680 g) of medium red potatoes, and scrub them with a nylon brush to ensure that they’re clean. Gather 8 small onions, and peel the skins from them, but leave the stem ends in tact. Scrub the potatoes under cold, running water. If you don’t have a brush, you can scrub them with your hands. The easiest way to peel the onions is to slice a half inch (1.3 cm) off the top and peel back the papery skin from the top."
        },
        {
          "headline":"Combine the potatoes and onions in the stockpot and cover with water.",
          "description":"In your pot, combine the scrubbed potatoes and peeled onions. Cover the vegetables with approximately 1.5 gallons (5.7 L) of water, or enough that the water level is 2 inches (5 cm) above the potatoes and onions."
        },
        {
          "headline":"Add the salt and bring to a boil.",
          "description":"Stir  ¾ cup (177 g) of kosher salt into the water with the potatoes and onions. Allow the pot to come to a full, rolling boil. If you’re cooking on a stove, make sure the burner is set to high."
        },
        {
          "headline":"Cook the potatoes and onions until the potatoes are nearly tender.",
          "description":"Once the pot comes to boil, allow the mixture to cook for approximately 15 minutes. You want the potatoes to be almost tender when you stick a fork in them. It’s important to keep the heat steady while you’re cooking the potatoes and onions, so be sure to maintain your fire or refrain from adjusting the burner."
        },
        {
          "headline":"Add the fish on top of the vegetables.",
          "description":"When the potatoes are tender, place the fish directly on top of the vegetables. Complete the boiling process exactly as you would without any vegetables."
        }
      ]
    },
    {
      "name":"Completing the Dish",
      "steps":[
        {
          "headline":"Remove the fish from the pot and put on a platter.",
          "description":"When the whitefish steaks are well drained, transfer them to a serving platter or plate. Handle the fish carefully when moving them to the plate to ensure that they don’t break. To keep the boiled fish warm, it helps to warm the platter before you place the steaks on it. You can warm an oven- or microwave-safe plate in the respective appliance to warm it, or simply run the platter under hot water to warm it up."
        },
        {
          "headline":"Place the vegetables around the fish and garnish with herbs.",
          "description":"Once you’ve set the fish on the platter, transfer the potatoes and onions from the pot to the platter with the slotted spoon. Arrange them so they’re surrounding the fish, and then garnish with 2 tablespoons (30 g) of fresh flat-leaf parsley that’s been finely chopped. You should also season the entire platter with plenty of freshly ground black pepper to taste."
        },
        {
          "headline":"Serve the fish with melted butter and lemons.",
          "description":"When you bring the boiled fish to the table, have ¼ pound (113) melted, unsalted butter on hand to pour over it. Make sure to have at least 4 lemon wedges as well for guests to squeeze over the fish."
        }
      ]
    }
  ],
  "text":" Gathering Your Supplies Choose the right type of fish. Traditional fish boil recipes use fish local to Wisconsin and Lake Michigan, such as lake trout and whitefish. However, you can use scrod, cod, haddock, or salmon if you don’t have access to local whitefish. For this recipe, you’ll need (4) ½ pound whitefish steaks. If you want to adjust the recipe for a larger group, have approximately a ½ pound to ¾ pound (227 g to 340 g) of fish per person. Find a large cast-iron pot and fire logs for an outdoor boil. If you are planning a traditional outdoor fish boil, you’ll boil the fish in a large pot on an open fire. A cast-iron pot typically works best, and you’ll need logs or slab wood, as well as matches or a lighter, for the fire. If you can’t find a cast-iron pot or kettle for the fish boil, you can use a stainless steel or aluminum pot. It also helps to have a wire basket that you can place the fish in and lower into the pot that you’re using. That makes it easier to remove the fish while it’s finished boiling. Make sure that you have extra logs or slab wood on hand for the fire in case you to feed it during the fish boil. Instead of a log fire, you can use a propane torch to heat the pot for the boil. Select a large stockpot for an indoor boil. You can recreate a fish boil at home without starting an outdoor fire. Instead, use a large stainless steel or aluminum stock pot with on your stovetop. If your pot has a basket or a strainer insert, you’ll have an easier time removing the fish when they’re done cooking. If you don’t have a strainer or basket for the pot, use a slotted spoon to remove the fish from the water when they’ve finished boiling. Boiling the Fish Salt the water and bring it to a boil. Fill your pot with approximately 1.5 gallons (5.7 L) of water. Stir in ¾ cup (177 g) of kosher salt until it’s thoroughly combined. Next, allow the pot to come to a full, rolling boil. If you’re cooking the fish on an outdoor fire, throw additional logs on the wood to feed the flames if the pot isn’t boiling. If you’re cooking on the stove, the heat should be set at high. Add the seasonings to the water and boil for several minutes. Take a piece of cheesecloth, and create a seasoning packet with equal parts bay leaves, whole allspice, and peppercorns in equal proportions that is approximately half the size of golf ball. Add it to the water and allow it to boil for 2 to 3 minutes. You can add any spices or seasonings that you like, such as fresh rosemary or thyme, to the packet. Place the fish in the water and boil for 10 to 12 minutes or until fish flakes easily. Arrange the fish in a wire basket, and submerge it in the pot. Wait for the water to return to a boil, which may take 2 to 3 minutes, and then allow the fish to boil until you can flake it easily with a fork, which should take approximately 10 to 12 minutes. Skim the froth and remove the fish. Once the fish flakes easily and is ready to be removed from the pot, take a moment to skim the froth from the surface of the water with a spoon so the fish won’t pass through it when you remove it. Lift the basket from the pot and drain carefully. If you don’t use a wire basket for the fish, remove the individual pieces from the pot with a slotted spoon, shaking carefully to ensure that they’re fully drained. Adding Vegetables to the Boil Clean the potatoes and peel the onions. While you can boil fish without any vegetables, a traditional fish boil typically includes potatoes and onions, which are partially boiled before you add the fish. Take 1 ½ pounds (680 g) of medium red potatoes, and scrub them with a nylon brush to ensure that they’re clean. Gather 8 small onions, and peel the skins from them, but leave the stem ends in tact. Scrub the potatoes under cold, running water. If you don’t have a brush, you can scrub them with your hands. The easiest way to peel the onions is to slice a half inch (1.3 cm) off the top and peel back the papery skin from the top. Combine the potatoes and onions in the stockpot and cover with water. In your pot, combine the scrubbed potatoes and peeled onions. Cover the vegetables with approximately 1.5 gallons (5.7 L) of water, or enough that the water level is 2 inches (5 cm) above the potatoes and onions. Add the salt and bring to a boil. Stir  ¾ cup (177 g) of kosher salt into the water with the potatoes and onions. Allow the pot to come to a full, rolling boil. If you’re cooking on a stove, make sure the burner is set to high. Cook the potatoes and onions until the potatoes are nearly tender. Once the pot comes to boil, allow the mixture to cook for approximately 15 minutes. You want the potatoes to be almost tender when you stick a fork in them. It’s important to keep the heat steady while you’re cooking the potatoes and onions, so be sure to maintain your fire or refrain from adjusting the burner. Add the fish on top of the vegetables. When the potatoes are tender, place the fish directly on top of the vegetables. Complete the boiling process exactly as you would without any vegetables. Completing the Dish Remove the fish from the pot and put on a platter. When the whitefish steaks are well drained, transfer them to a serving platter or plate. Handle the fish carefully when moving them to the plate to ensure that they don’t break. To keep the boiled fish warm, it helps to warm the platter before you place the steaks on it. You can warm an oven- or microwave-safe plate in the respective appliance to warm it, or simply run the platter under hot water to warm it up. Place the vegetables around the fish and garnish with herbs. Once you’ve set the fish on the platter, transfer the potatoes and onions from the pot to the platter with the slotted spoon. Arrange them so they’re surrounding the fish, and then garnish with 2 tablespoons (30 g) of fresh flat-leaf parsley that’s been finely chopped. You should also season the entire platter with plenty of freshly ground black pepper to taste. Serve the fish with melted butter and lemons. When you bring the boiled fish to the table, have ¼ pound (113) melted, unsalted butter on hand to pour over it. Make sure to have at least 4 lemon wedges as well for guests to squeeze over the fish.",
  "tyn_model":[
    "pot",
    "water",
    "potatoes",
    "fish",
    "onions",
    "vegetables",
    "platter",
    "cast-iron pot",
    "slotted spoon",
    "plate",
    "whitefish",
    "whitefish steaks",
    "logs",
    "wire basket",
    "stockpot",
    "strainer",
    "kosher salt",
    "fork",
    "fish boil",
    "lake trout",
    "scrod",
    "cod",
    "haddock",
    "salmon",
    "fire logs",
    "matches",
    "lighter",
    "kettle",
    "stainless steel or aluminum pot",
    "propane torch",
    "seasonings",
    "cheesecloth",
    "seasoning packet",
    "bay leaves",
    "allspice",
    "peppercorns",
    "thyme",
    "spoon",
    "basket",
    "nylon brush",
    "salt",
    "stove",
    "burner",
    "serving platter",
    "herbs",
    "flat-leaf parsley",
    "black pepper",
    "butter",
    "lemons",
    "unsalted butter",
    "lemon"
  ],
  "tyn_section":[

  ]
}