{
  "title":"How to Do Basic Dormant Season Pruning",
  "url":"https://www.wikihow.com/Do-Basic-Dormant-Season-Pruning",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "methods":[
    {
      "name":"Trimming Deciduous Trees",
      "steps":[
        {
          "headline":"Identify branches that are dead, diseased, or dangerous.",
          "description":"Unhealthy branches can be identified by dark lesions, indentations, or holes. Branches that are dead, diseased, broken, or growing near electrical wires or other hazards should be removed from your trees every year. Inspect your trees to decide what branches need to be removed when pruning. If you prune away diseased branches, disinfect your tools immediately afterwards to prevent the spread of disease."
        },
        {
          "headline":"Use a sturdy ladder that can accommodate your weight.",
          "description":"If you need to use a ladder to prune a tree, check its \"maximum load rating\" before buying or using it to make sure that it can support your full weight. Make sure that the ladder has slip-resistant feet that will grip the ground and resist sliding while you use it. If the ladder extends, make sure that all of the locks are in place before climbing it.. If there is no risk of heavy falling objects, have another person brace the bottom of the ladder for added security. Avoid using a ladder while it is raining or snowing to prevent an accident."
        },
        {
          "headline":"Use hand pruners to cut branches up to 0.75 inches (1.9 cm) in diameter.",
          "description":"Cut off small branches using handheld pruners. Opt for bypass pruning shears, which have 2 sharp blades to ensure a clean cut. Choose pruners that are comfortable to use, which will likely become an issue after prolonged use."
        },
        {
          "headline":"Cut branches up to 1.5 inches (3.8 cm) in diameter with lopper cutters.",
          "description":"Loppers have longer blades and handles than pruners, allowing them to cut thicker branches. The long handles also provide leverage, making them simple and powerful to use. Visit a local hardware store to test loppers until you find a pair that you feel comfortable handling."
        },
        {
          "headline":"Remove branches that are up to 4 inches (10 cm) in diameter with a pruning saw.",
          "description":"Handheld pruning saws are the best tools to tackle large branches that need to be removed from your trees. For the easiest cut, purchase a razor-tooth saw that will cut into the wood effectively. Choose a model of saw that is comfortable to grip, which will allow you to saw through branches more effectively."
        },
        {
          "headline":"Cut branches above the branch collar and branch bark ridge.",
          "description":"A branch collar is the swollen area located at the base of every tree branch. The branch bark ridge is the small area of dark, rough, slightly-raised bark that extends out from the branch collar to the rest of the branch. Locate these two parts of the branch and make sure to cut just above them, leaving them intact. These areas contain the nutrients that a tree needs to stimulate healing and closing after the branch is removed. Cutting off a branch without leaving these areas intact may result in that part of the tree rotting."
        },
        {
          "headline":"Saw large branches with 3 cuts to remove them safely.",
          "description":"Use a hand-held pruning saw to cut into the branch about 18 inches (46 cm) from the trunk. Cut about halfway through the branch, then make a second cut on top of the branch about 1 inch (2.5 cm) above that. Once the bulk of the branch is removed, make a final cut just above the branch collar and branch bark ridge. Be sure that the area under the tree is completely clear so that falling branches do not pose a danger."
        }
      ]
    },
    {
      "name":"Pruning Plants and Shrubs",
      "steps":[
        {
          "headline":"Prune most deciduous plants and shrubs during their dormant season.",
          "description":"In most cases, it is best to prune during the dormant season so that growth doesn't obscure your vision of damaged branches. It also ensures that wounds on plants or shrubs will only be open for a short time before new growth starts in spring. Prune between late winter and early spring for the best results. Flowering plants and shrubs that bloom early in the growth season are the exception as they should be trimmed immediately after they are done blooming."
        },
        {
          "headline":"Remove stems that are limp, damaged, or rubbing together.",
          "description":"Stems that should be removed from your plants will look visibly unhealthy. You should also consider cutting down stems that are crossing or rubbing against other stems, as they might hinder the growth of the plant. Inspect your plants visually to identify what you will be removing."
        },
        {
          "headline":"Use sharp hand pruners to ensure clean cuts.",
          "description":"The best way to trim the thin stems of plants and shrubs is to use a pair of handheld pruners. Be sure that the blades on the pruners are sharp, which will ensure that the cuts are made easily without crushing the stems. For thick or hard-to-cut stems, lopping shears may be used. Use a basic mill file, available at hardware stores, to sharpen your pruners."
        },
        {
          "headline":"Cut stems above new buds or above their collar.",
          "description":"The collar of a stem is the slightly flared base where it meets another stem. Position your pruner blades around the stem, just above the collar, and make a clean cut. If there is a new bud on the stem, cut the stem just above it to allow it to develop. Damaging the stem collar will impede the growth of a new stem. Pruning plants in the dormant season puts less stress on them."
        },
        {
          "headline":"Prune above outward facing buds.",
          "description":"By doing this, you will encourage the plant to grow outwards. Don't prune above a bud that faces in towards the plant, as the branch will grow towards the center of the plant and crowd it."
        },
        {
          "headline":"Thin the branches to give your plants an aesthetically-pleasing shape.",
          "description":"Beyond basic dormant season pruning, you can remove stems to achieve a particular shape or fullness. Once a year, remove up to 1/3 of the plant to encourage new growth. Remove up to 50% of a plant’s original shape every 3-5 years to rejuvenate the plant. Be sure to make clean cuts above stem collars to ensure regrowth."
        },
        {
          "headline":"Record how your plants react to pruning each year in a journal.",
          "description":"Learning how to properly prune your plants can take several years of trial and error. Each year, take note of how your plants react to how you've trimmed them and write it in a journal. The next dormant season, refer to the journal and prune the plants more or less based on how the plants reacted. For instance, pruning too conservatively one year may leave behind weak, damaged branches that interfere with new growth. Take note if pruning more than 1/3 of the stems or branches on a plant or shrub results in vigorous, abundant growth."
        }
      ]
    }
  ],
  "text":" Trimming Deciduous Trees Identify branches that are dead, diseased, or dangerous. Unhealthy branches can be identified by dark lesions, indentations, or holes. Branches that are dead, diseased, broken, or growing near electrical wires or other hazards should be removed from your trees every year. Inspect your trees to decide what branches need to be removed when pruning. If you prune away diseased branches, disinfect your tools immediately afterwards to prevent the spread of disease. Use a sturdy ladder that can accommodate your weight. If you need to use a ladder to prune a tree, check its \"maximum load rating\" before buying or using it to make sure that it can support your full weight. Make sure that the ladder has slip-resistant feet that will grip the ground and resist sliding while you use it. If the ladder extends, make sure that all of the locks are in place before climbing it.. If there is no risk of heavy falling objects, have another person brace the bottom of the ladder for added security. Avoid using a ladder while it is raining or snowing to prevent an accident. Use hand pruners to cut branches up to 0.75 inches (1.9 cm) in diameter. Cut off small branches using handheld pruners. Opt for bypass pruning shears, which have 2 sharp blades to ensure a clean cut. Choose pruners that are comfortable to use, which will likely become an issue after prolonged use. Cut branches up to 1.5 inches (3.8 cm) in diameter with lopper cutters. Loppers have longer blades and handles than pruners, allowing them to cut thicker branches. The long handles also provide leverage, making them simple and powerful to use. Visit a local hardware store to test loppers until you find a pair that you feel comfortable handling. Remove branches that are up to 4 inches (10 cm) in diameter with a pruning saw. Handheld pruning saws are the best tools to tackle large branches that need to be removed from your trees. For the easiest cut, purchase a razor-tooth saw that will cut into the wood effectively. Choose a model of saw that is comfortable to grip, which will allow you to saw through branches more effectively. Cut branches above the branch collar and branch bark ridge. A branch collar is the swollen area located at the base of every tree branch. The branch bark ridge is the small area of dark, rough, slightly-raised bark that extends out from the branch collar to the rest of the branch. Locate these two parts of the branch and make sure to cut just above them, leaving them intact. These areas contain the nutrients that a tree needs to stimulate healing and closing after the branch is removed. Cutting off a branch without leaving these areas intact may result in that part of the tree rotting. Saw large branches with 3 cuts to remove them safely. Use a hand-held pruning saw to cut into the branch about 18 inches (46 cm) from the trunk. Cut about halfway through the branch, then make a second cut on top of the branch about 1 inch (2.5 cm) above that. Once the bulk of the branch is removed, make a final cut just above the branch collar and branch bark ridge. Be sure that the area under the tree is completely clear so that falling branches do not pose a danger. Pruning Plants and Shrubs Prune most deciduous plants and shrubs during their dormant season. In most cases, it is best to prune during the dormant season so that growth doesn't obscure your vision of damaged branches. It also ensures that wounds on plants or shrubs will only be open for a short time before new growth starts in spring. Prune between late winter and early spring for the best results. Flowering plants and shrubs that bloom early in the growth season are the exception as they should be trimmed immediately after they are done blooming. Remove stems that are limp, damaged, or rubbing together. Stems that should be removed from your plants will look visibly unhealthy. You should also consider cutting down stems that are crossing or rubbing against other stems, as they might hinder the growth of the plant. Inspect your plants visually to identify what you will be removing. Use sharp hand pruners to ensure clean cuts. The best way to trim the thin stems of plants and shrubs is to use a pair of handheld pruners. Be sure that the blades on the pruners are sharp, which will ensure that the cuts are made easily without crushing the stems. For thick or hard-to-cut stems, lopping shears may be used. Use a basic mill file, available at hardware stores, to sharpen your pruners. Cut stems above new buds or above their collar. The collar of a stem is the slightly flared base where it meets another stem. Position your pruner blades around the stem, just above the collar, and make a clean cut. If there is a new bud on the stem, cut the stem just above it to allow it to develop. Damaging the stem collar will impede the growth of a new stem. Pruning plants in the dormant season puts less stress on them. Prune above outward facing buds. By doing this, you will encourage the plant to grow outwards. Don't prune above a bud that faces in towards the plant, as the branch will grow towards the center of the plant and crowd it. Thin the branches to give your plants an aesthetically-pleasing shape. Beyond basic dormant season pruning, you can remove stems to achieve a particular shape or fullness. Once a year, remove up to 1/3 of the plant to encourage new growth. Remove up to 50% of a plant’s original shape every 3-5 years to rejuvenate the plant. Be sure to make clean cuts above stem collars to ensure regrowth. Record how your plants react to pruning each year in a journal. Learning how to properly prune your plants can take several years of trial and error. Each year, take note of how your plants react to how you've trimmed them and write it in a journal. The next dormant season, refer to the journal and prune the plants more or less based on how the plants reacted. For instance, pruning too conservatively one year may leave behind weak, damaged branches that interfere with new growth. Take note if pruning more than 1/3 of the stems or branches on a plant or shrub results in vigorous, abundant growth.",
  "tyn_model":[
    "pruners",
    "ladder",
    "plants",
    "saw",
    "prune",
    "pruning",
    "loppers",
    "pruning saw",
    "branch bark",
    "trees",
    "pruning shears",
    "lopper cutters",
    "pruning saws",
    "lopping shears",
    "pruner",
    "branches",
    "stems"
  ],
  "tyn_section":[

  ]
}