{
  "title":"How to Make Peppermint Chocolate Sandwich Cookies",
  "url":"https://www.wikihow.com/Make-Peppermint-Chocolate-Sandwich-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Chocolate Cookies and Biscuits"
  ],
  "steps":[
    {
      "headline":"Before beginning, Preheat oven to 350ºF or 180ºC.",
      "description":"Combine the sugar cookie dough and flour. Roll it out on a lightly floured surface to 1/4 inch (7mm) thick. Cut out an even number of symmetrical circles."
    },
    {
      "headline":"Bake the cookies for about 8 to 10 minutes on parchment paper lined or greased cookie sheet.",
      "description":""
    },
    {
      "headline":"Create a double boiler.",
      "description":"Combine 1 cup chocolate chips and cream and stir until melted. Add peppermint extract and refrigerate for an hour."
    },
    {
      "headline":"Spoon a little of cooled chocolate on the flat sides of half the cookies.",
      "description":""
    },
    {
      "headline":"Press another cookie on top to distribute the chocolate evenly.",
      "description":""
    },
    {
      "headline":"Place all sandwiches on a parchment paper lined baking sheet or plate and freeze for 20-30 minutes or until chocolate filling sets.",
      "description":""
    },
    {
      "headline":"Use the same double boiler format to combine the remaining chocolate chips and vegetable oil.",
      "description":"Stir until melted completely."
    },
    {
      "headline":"Spoon the melted chocolate on top of the cookie sandwiches and spread evenly using the back of the spoon.",
      "description":""
    },
    {
      "headline":"Top each cookie with candy cane sprinkles and refrigerate until firm.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Before beginning, Preheat oven to 350ºF or 180ºC. Combine the sugar cookie dough and flour. Roll it out on a lightly floured surface to 1/4 inch (7mm) thick. Cut out an even number of symmetrical circles. Bake the cookies for about 8 to 10 minutes on parchment paper lined or greased cookie sheet.  Create a double boiler. Combine 1 cup chocolate chips and cream and stir until melted. Add peppermint extract and refrigerate for an hour. Spoon a little of cooled chocolate on the flat sides of half the cookies.  Press another cookie on top to distribute the chocolate evenly.  Place all sandwiches on a parchment paper lined baking sheet or plate and freeze for 20-30 minutes or until chocolate filling sets.  Use the same double boiler format to combine the remaining chocolate chips and vegetable oil. Stir until melted completely. Spoon the melted chocolate on top of the cookie sandwiches and spread evenly using the back of the spoon.  Top each cookie with candy cane sprinkles and refrigerate until firm.  Finished. ",
  "tyn_model":[
    "double boiler",
    "chocolate chips",
    "chocolate",
    "oven",
    "sugar cookie dough",
    "flour",
    "parchment paper lined or greased cookie sheet",
    "cream",
    "peppermint extract",
    "parchment paper lined baking sheet",
    "vegetable oil",
    "spoon",
    "candy cane"
  ],
  "tyn_section":[

  ]
}