{
  "title":"How to Sew Silk",
  "url":"https://www.wikihow.com/Sew-Silk",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Sewing",
    "Fabrics for Sewing and Crafts"
  ],
  "parts":[
    {
      "name":"Prewashing Silk",
      "steps":[
        {
          "headline":"Hand wash silk fabric.",
          "description":"Silk fabric has a tendency to shrink, which can alter the size and look of your sewing project. By prewashing the fabric, you will minimize the amount of shrinkage that might occur when you wash the fabric after you’ve completed the project. Typically, silk will shrink about 5-10%, with some looser weavers shrinking up to 15%. Use a mild detergent, such as Woolite or Ivory Snow, with warm water, washing the silk in a sink or bucket. Alternately, use a mild shampoo. You can also wash some silk fabrics in the washing machine. Use a delicate cycle and a mild detergent. A few silks, such as dupioni, should be dry cleaned only."
        },
        {
          "headline":"Wash strong colors separately.",
          "description":"If you have bright or deep colored silk, it’s best to wash these separately. Dyes used on silk have a tendency to run, and you don’t want to discolor your fabric. Take the time to do separate washes to ensure that colors don’t bleed from one piece to another. Prewashing strong colors will also ensure that the colors don’t bleed after you have sewn your project."
        },
        {
          "headline":"Rinse the fabric in water and white vinegar.",
          "description":"Vinegar will help get rid of the soap residue that remains on the fabric. In a bucket or sink, mix in ¼ cup of white vinegar per gallon of water. Swish around the silk fabric to rinse out the soap. Drain the water and leave the silk in the sink."
        },
        {
          "headline":"Rinse the fabric again in water.",
          "description":"Put the fabric through a second rinse, this time without vinegar. The clean water will rinse out any remaining vinegar and will remove the vinegar odor."
        },
        {
          "headline":"Don’t wring out the silk fabric.",
          "description":"After you finish hand washing the fabric, do not twist or wring it out to remove excess water. Rather, lay the fabric out on a towel and then lay another towel on top. You can remove some extra moisture by ironing over the top towel using a medium temperature."
        },
        {
          "headline":"Dry the fabric.",
          "description":"There are several methods of drying silk fabric, depending on your preference. Try partially drying the fabric in the dryer. Remove the fabric when it is still damp and hang up to finish drying. Alternately, you can dry the silk between two towels, or let it hang dry right after you have washed it."
        }
      ]
    },
    {
      "name":"Gathering Your Supplies",
      "steps":[
        {
          "headline":"Select sharp scissors.",
          "description":"Because silk is slippery, use very sharp scissors so that the cuts you make to the fabric will be smooth and clean. It may be useful to have regular sewing shears as well as pinking shears. Pinking shears are scissors that cut little triangles along the edge of fabric. This can help with fraying, which silk has a tendency to do."
        },
        {
          "headline":"Choose a small sewing machine needle.",
          "description":"A fine, sharp needle will leave smaller holes in the silk fabric. Since silk is prone to showing holes easily, choose a small-sized needle to use when sewing your project. A 60/8 Microtex or Universal needle is an ideal size. Have a few spare needles on hand while you work on your project. It is a good idea to replace needles every so often so that you are constantly using a very sharp needle. Silk fibers are quite tough and can dull the needle easily. If you are hand-sewing, choose a very sharp, fine needle."
        },
        {
          "headline":"Choose a good quality cotton or polyester thread.",
          "description":"Choose a thread to match your fabric. Cotton-wrapped or 100% polyester thread are good choices. While some people might like to use silk thread with silk fabric, silk thread is not very strong and can fray easily."
        },
        {
          "headline":"Choose a flat-bottomed foot for your sewing machine.",
          "description":"The foot on a sewing machine will press down the fabric while the needle moves up and down. A flat-bottomed foot is recommended, as it will not snag on the silk as the fabric moves through the machine. Alternately, choose a walking foot, which keeps the silk from sliding around."
        },
        {
          "headline":"Clean and dust your sewing machine.",
          "description":"Working with a clean, dust-free machine is a good rule of thumb whenever you sew, but it is particularly important when sewing a delicate fabric such as silk. Wipe down the machine to remove any residue on the machine. To remove dust, you can use a pressurized air canister to blow air into the crevices and cracks of your machine."
        }
      ]
    },
    {
      "name":"Cutting Silk Fabric",
      "steps":[
        {
          "headline":"Wash your hands before handling silk.",
          "description":"When you are ready to start handling your fabric, wash your hands with soap and water. Dry them thoroughly. This will remove any residue or oils from your hands that could spot the fabric. This is especially important if you are hand-sewing the fabric."
        },
        {
          "headline":"Layer muslin or tissue paper underneath the silk layer.",
          "description":"Having tissue paper, muslin, or even butcher paper will help keep the silk fabric from slipping when you cut it with your scissors. Tissue paper is especially useful because you can continue using it to stabilize your fabric, including when you pin and sew the fabric."
        },
        {
          "headline":"Spray on fabric stabilizer.",
          "description":"You can also use a spray-on fabric stabilizer, which will stiffen the fabric somewhat and make it easier to manage while you cut it. This is available at fabric stores and online."
        },
        {
          "headline":"Use silk pins and pattern weights.",
          "description":"Silk pins are extra fine pins that leave very tiny holes in silk fabric. These are useful for pinning patterns to fabric without noticeably marring the surface of the fabric. Pattern weights are used to hold fabric stationary on the cutting surface so that it doesn’t shift around when you are cutting. You can also use heavy objects such as canned food to hold down the fabric."
        },
        {
          "headline":"Cut each pattern piece one at a time.",
          "description":"With other types of fabric, you can usually cut same-shaped pattern pieces together, doubling up the fabric. With silk, however, it’s best to cut each pattern piece individually. Silk slips around too much, and cutting through two layers of fabric might cause errors in cutting out the pattern. For pattern pieces on a fold, redraw the piece as it would be folded out. This way, you won’t have to cut two layers of fabric at once."
        }
      ]
    },
    {
      "name":"Preparing Fabric for Sewing",
      "steps":[
        {
          "headline":"Use silk pins.",
          "description":"Silk pins are extra fine pins that leave very tiny holes in silk fabric. These are useful for pinning fabric pieces together without noticeably marring the surface of the fabric. Alternately, use wonder clips or binder clips to clip fabric together."
        },
        {
          "headline":"Position pins in the seam allowances.",
          "description":"The seam allowances are the areas of the fabric along the edges that will not show in the final sewing project. Since silk will show holes very easily, pin fabric together in the seam allowances to avoid poking holes in noticeable places. Typical sewing allowances are ½ inch or 5/8 inch in width."
        },
        {
          "headline":"Press seams with low iron heat and a press cloth.",
          "description":"Iron the silk fabric to make seams more visible when you sew them. Ironing seams will also keep them in place while you sew. Use a low setting on your iron, and put a press cloth over your fabric to avoid direct contact with your fabric. Many irons have a silk setting, which is appropriate to use for this purpose."
        },
        {
          "headline":"Cut away fraying edges.",
          "description":"Silk has a tendency to fray easily, and after you prewash the fabric, there may be more frays than a brand-new piece of fabric. Cut edges to remove frays and to make the edges even. Trim away any loose threads."
        }
      ]
    },
    {
      "name":"Sewing the Silk Fabric",
      "steps":[
        {
          "headline":"Hand-baste fabric pieces together.",
          "description":"Hand-basting is a technique of using long, loose stitches to hold fabric together and make sewing easier. Since silk is so slippery, it can be helpful to hand-baste the pieces with a stitch that looks like a dotted line. Read “How to Baste Fabric” for more information."
        },
        {
          "headline":"Place a piece of tissue paper underneath your silk.",
          "description":"If your silk fabric is slipping too much while sewing, try layering a piece of tissue paper underneath your sewing area. The needle will sew through both layers, sewing them together. When you’re done sewing the piece, you can just tear away the tissue paper."
        },
        {
          "headline":"Spray on fabric stabilizer.",
          "description":"You can also use a spray-on fabric stabilizer, which will stiffen the fabric somewhat and make it easier to manage while you cut it. This is available at fabric stores and online."
        },
        {
          "headline":"Test your sewing on a scrap piece.",
          "description":"Check how your sewing machine settings will respond to the silk by test sewing on a scrap piece of silk. Make adjustments to the tension and gauge of your thread before you move on to sewing your project. Aim for 8-12 stitches per inch, although this might vary depending on your project."
        },
        {
          "headline":"Pull back the top thread and bobbin thread.",
          "description":"As you set the fabric in place at your sewing machine, pull the top thread and bobbin thread back away from you. This will ensure that it won’t get accidentally wrapped up in the machine foot, which could cause holes or pulls in the fabric as you sew it."
        },
        {
          "headline":"Manually bring the needle down into the fabric.",
          "description":"Rotate the hand wheel to bring the needle down into the fabric. This will ensure that the sewing machine will start very slowly and the fabric won’t pucker or catch on the foot."
        },
        {
          "headline":"Hold the fabric straight.",
          "description":"Gently flatten the fabric so that it feeds straight into the machine. Don’t pull it taut, however, as this can cause puckers in the final sewing project."
        },
        {
          "headline":"Sew a few stitches and then backstitch.",
          "description":"Start out your stitching with a few stitches and then secure them by backstitching along them. This will ensure that the stitches won’t come out. Do so very carefully, so that you don’t accidentally allow the silk fabric to creep or bunch up at the beginning."
        },
        {
          "headline":"Sew at a steady, slow pace.",
          "description":"Silk has a tendency to bunch and gather, so go slowly when you’re sewing this fabric. Try a steady pace to ensure that the stitches are even and consistent."
        },
        {
          "headline":"Check on your progress frequently.",
          "description":"Slow down or pause to make sure the fabric is feeding properly through the machine. Look at your seams to see if they are sewing flat and without any snags."
        },
        {
          "headline":"Take care if ripping out seams.",
          "description":"Ripping out seams from silk fabric is risky, as this may leave holes in the fabric that you will be able to see even after the project is finished. Decide if seam ripping is necessary. If yes, then proceed very carefully and slowly. To minimize holes, rub the holes on the underside of the fabric with your fingernail. Dampen the fabric by spraying it lightly with water, and then iron it on a low to medium setting."
        },
        {
          "headline":"Finish the seams.",
          "description":"Silk will fray very easily, and that can compromise the quality of your sewing project if the edges fray all the way to where the stitches are. Finish the seams with a serged finish or a French seam. For a serged finish, you need a serger. It is the cleanest method, as it sews up the edge of the fabric and seals it within the serged area. You can also use other finishing methods, such as zigzag, seam binding and hand-overcast."
        }
      ]
    }
  ],
  "text":" Prewashing Silk Hand wash silk fabric. Silk fabric has a tendency to shrink, which can alter the size and look of your sewing project. By prewashing the fabric, you will minimize the amount of shrinkage that might occur when you wash the fabric after you’ve completed the project. Typically, silk will shrink about 5-10%, with some looser weavers shrinking up to 15%. Use a mild detergent, such as Woolite or Ivory Snow, with warm water, washing the silk in a sink or bucket. Alternately, use a mild shampoo. You can also wash some silk fabrics in the washing machine. Use a delicate cycle and a mild detergent. A few silks, such as dupioni, should be dry cleaned only. Wash strong colors separately. If you have bright or deep colored silk, it’s best to wash these separately. Dyes used on silk have a tendency to run, and you don’t want to discolor your fabric. Take the time to do separate washes to ensure that colors don’t bleed from one piece to another. Prewashing strong colors will also ensure that the colors don’t bleed after you have sewn your project. Rinse the fabric in water and white vinegar. Vinegar will help get rid of the soap residue that remains on the fabric. In a bucket or sink, mix in ¼ cup of white vinegar per gallon of water. Swish around the silk fabric to rinse out the soap. Drain the water and leave the silk in the sink. Rinse the fabric again in water. Put the fabric through a second rinse, this time without vinegar. The clean water will rinse out any remaining vinegar and will remove the vinegar odor. Don’t wring out the silk fabric. After you finish hand washing the fabric, do not twist or wring it out to remove excess water. Rather, lay the fabric out on a towel and then lay another towel on top. You can remove some extra moisture by ironing over the top towel using a medium temperature. Dry the fabric. There are several methods of drying silk fabric, depending on your preference. Try partially drying the fabric in the dryer. Remove the fabric when it is still damp and hang up to finish drying. Alternately, you can dry the silk between two towels, or let it hang dry right after you have washed it. Gathering Your Supplies Select sharp scissors. Because silk is slippery, use very sharp scissors so that the cuts you make to the fabric will be smooth and clean. It may be useful to have regular sewing shears as well as pinking shears. Pinking shears are scissors that cut little triangles along the edge of fabric. This can help with fraying, which silk has a tendency to do. Choose a small sewing machine needle. A fine, sharp needle will leave smaller holes in the silk fabric. Since silk is prone to showing holes easily, choose a small-sized needle to use when sewing your project. A 60/8 Microtex or Universal needle is an ideal size. Have a few spare needles on hand while you work on your project. It is a good idea to replace needles every so often so that you are constantly using a very sharp needle. Silk fibers are quite tough and can dull the needle easily. If you are hand-sewing, choose a very sharp, fine needle. Choose a good quality cotton or polyester thread. Choose a thread to match your fabric. Cotton-wrapped or 100% polyester thread are good choices. While some people might like to use silk thread with silk fabric, silk thread is not very strong and can fray easily. Choose a flat-bottomed foot for your sewing machine. The foot on a sewing machine will press down the fabric while the needle moves up and down. A flat-bottomed foot is recommended, as it will not snag on the silk as the fabric moves through the machine. Alternately, choose a walking foot, which keeps the silk from sliding around. Clean and dust your sewing machine. Working with a clean, dust-free machine is a good rule of thumb whenever you sew, but it is particularly important when sewing a delicate fabric such as silk. Wipe down the machine to remove any residue on the machine. To remove dust, you can use a pressurized air canister to blow air into the crevices and cracks of your machine. Cutting Silk Fabric Wash your hands before handling silk. When you are ready to start handling your fabric, wash your hands with soap and water. Dry them thoroughly. This will remove any residue or oils from your hands that could spot the fabric. This is especially important if you are hand-sewing the fabric. Layer muslin or tissue paper underneath the silk layer. Having tissue paper, muslin, or even butcher paper will help keep the silk fabric from slipping when you cut it with your scissors. Tissue paper is especially useful because you can continue using it to stabilize your fabric, including when you pin and sew the fabric. Spray on fabric stabilizer. You can also use a spray-on fabric stabilizer, which will stiffen the fabric somewhat and make it easier to manage while you cut it. This is available at fabric stores and online. Use silk pins and pattern weights. Silk pins are extra fine pins that leave very tiny holes in silk fabric. These are useful for pinning patterns to fabric without noticeably marring the surface of the fabric. Pattern weights are used to hold fabric stationary on the cutting surface so that it doesn’t shift around when you are cutting. You can also use heavy objects such as canned food to hold down the fabric. Cut each pattern piece one at a time. With other types of fabric, you can usually cut same-shaped pattern pieces together, doubling up the fabric. With silk, however, it’s best to cut each pattern piece individually. Silk slips around too much, and cutting through two layers of fabric might cause errors in cutting out the pattern. For pattern pieces on a fold, redraw the piece as it would be folded out. This way, you won’t have to cut two layers of fabric at once. Preparing Fabric for Sewing Use silk pins. Silk pins are extra fine pins that leave very tiny holes in silk fabric. These are useful for pinning fabric pieces together without noticeably marring the surface of the fabric. Alternately, use wonder clips or binder clips to clip fabric together. Position pins in the seam allowances. The seam allowances are the areas of the fabric along the edges that will not show in the final sewing project. Since silk will show holes very easily, pin fabric together in the seam allowances to avoid poking holes in noticeable places. Typical sewing allowances are ½ inch or 5/8 inch in width. Press seams with low iron heat and a press cloth. Iron the silk fabric to make seams more visible when you sew them. Ironing seams will also keep them in place while you sew. Use a low setting on your iron, and put a press cloth over your fabric to avoid direct contact with your fabric. Many irons have a silk setting, which is appropriate to use for this purpose. Cut away fraying edges. Silk has a tendency to fray easily, and after you prewash the fabric, there may be more frays than a brand-new piece of fabric. Cut edges to remove frays and to make the edges even. Trim away any loose threads. Sewing the Silk Fabric Hand-baste fabric pieces together. Hand-basting is a technique of using long, loose stitches to hold fabric together and make sewing easier. Since silk is so slippery, it can be helpful to hand-baste the pieces with a stitch that looks like a dotted line. Read “How to Baste Fabric” for more information. Place a piece of tissue paper underneath your silk. If your silk fabric is slipping too much while sewing, try layering a piece of tissue paper underneath your sewing area. The needle will sew through both layers, sewing them together. When you’re done sewing the piece, you can just tear away the tissue paper. Spray on fabric stabilizer. You can also use a spray-on fabric stabilizer, which will stiffen the fabric somewhat and make it easier to manage while you cut it. This is available at fabric stores and online. Test your sewing on a scrap piece. Check how your sewing machine settings will respond to the silk by test sewing on a scrap piece of silk. Make adjustments to the tension and gauge of your thread before you move on to sewing your project. Aim for 8-12 stitches per inch, although this might vary depending on your project. Pull back the top thread and bobbin thread. As you set the fabric in place at your sewing machine, pull the top thread and bobbin thread back away from you. This will ensure that it won’t get accidentally wrapped up in the machine foot, which could cause holes or pulls in the fabric as you sew it. Manually bring the needle down into the fabric. Rotate the hand wheel to bring the needle down into the fabric. This will ensure that the sewing machine will start very slowly and the fabric won’t pucker or catch on the foot. Hold the fabric straight. Gently flatten the fabric so that it feeds straight into the machine. Don’t pull it taut, however, as this can cause puckers in the final sewing project. Sew a few stitches and then backstitch. Start out your stitching with a few stitches and then secure them by backstitching along them. This will ensure that the stitches won’t come out. Do so very carefully, so that you don’t accidentally allow the silk fabric to creep or bunch up at the beginning. Sew at a steady, slow pace. Silk has a tendency to bunch and gather, so go slowly when you’re sewing this fabric. Try a steady pace to ensure that the stitches are even and consistent. Check on your progress frequently. Slow down or pause to make sure the fabric is feeding properly through the machine. Look at your seams to see if they are sewing flat and without any snags. Take care if ripping out seams. Ripping out seams from silk fabric is risky, as this may leave holes in the fabric that you will be able to see even after the project is finished. Decide if seam ripping is necessary. If yes, then proceed very carefully and slowly. To minimize holes, rub the holes on the underside of the fabric with your fingernail. Dampen the fabric by spraying it lightly with water, and then iron it on a low to medium setting. Finish the seams. Silk will fray very easily, and that can compromise the quality of your sewing project if the edges fray all the way to where the stitches are. Finish the seams with a serged finish or a French seam. For a serged finish, you need a serger. It is the cleanest method, as it sews up the edge of the fabric and seals it within the serged area. You can also use other finishing methods, such as zigzag, seam binding and hand-overcast.",
  "tyn_model":[
    "fabric",
    "silk",
    "water",
    "sewing machine",
    "thread",
    "tissue paper",
    "vinegar",
    "scissors",
    "silk pins",
    "towel",
    "fabric stabilizer",
    "pins",
    "iron",
    "silk fabric",
    "mild detergent",
    "white vinegar",
    "needles",
    "silk thread",
    "flat-bottomed foot",
    "muslin",
    "pattern weights",
    "press cloth",
    "bobbin thread",
    "ivory snow",
    "mild shampoo",
    "washing machine",
    "bucket",
    "dryer",
    "towels",
    "shears",
    "silk fibers",
    "pressurized air canister",
    "soap",
    "butcher paper",
    "spray-on fabric stabilizer",
    "binder clips",
    "low iron",
    "irons",
    "“how",
    "” for",
    "machine",
    "serger"
  ],
  "tyn_section":[

  ]
}