{
  "title":"How to Hire a Trim Carpenter",
  "url":"https://www.wikihow.com/Hire-a-Trim-Carpenter",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Walls and Ceilings"
  ],
  "steps":[
    {
      "headline":"Research local trim carpenters.",
      "description":"Consider those who are reputable and who have been in business for many years. Ask friends and family if they have any referrals also. If so, look at their trim work, and determine whether you like it. Consider the quality of craftsmanship and aesthetic appeal."
    },
    {
      "headline":"Narrow your search down to licensed, certified and qualified trim carpenters.",
      "description":"Check local regulations to verify the law's requirements for trim carpenters, and ask to see copies of licenses. Ask each of them for references so you can review their past work. Call past clients to make sure they were pleased with the trim carpenter's service. Ask if there were any problems once the job was completed, and if so, ensure that the trim carpenter was responsive."
    },
    {
      "headline":"Ask the carpenters about their insurance coverage and whether they are covered for personal injury or property damage.",
      "description":"You can ask for the documentation that verifies coverage if necessary."
    },
    {
      "headline":"Select 3 carpenters from those names that you found in your search.",
      "description":""
    },
    {
      "headline":"List the trim and casing projects that you need the carpenter to perform.",
      "description":"Be as detailed as possible, and include the type of wood that you prefer. Include measurements in your list."
    },
    {
      "headline":"Request estimates from the 3 carpenters you selected.",
      "description":"Ask that they list the materials that they need so that you can compare the pricing accurately."
    },
    {
      "headline":"Review the estimates once they come back.",
      "description":"Compare all the details, including materials used, time frame and price. Don't select a carpenter based on the price alone. The lowest price does not always indicate the best job done. Take everything into consideration. Talk to the carpenters, and decide which ones seem amiable enough to work with, who seems enthusiastic about your project and who seems to have the most knowledge about the job that needs to be completed."
    },
    {
      "headline":"Select your chosen trim carpenter.",
      "description":""
    },
    {
      "headline":"Ask for a finalized contract that details everything in your quote.",
      "description":"Make sure you are satisfied with the details. The contractor should include a clear beginning and ending date for the project. Check that the payment, any down payment amounts and payment schedules are what were initially agreed upon."
    }
  ],
  "text":" Research local trim carpenters. Consider those who are reputable and who have been in business for many years. Ask friends and family if they have any referrals also. If so, look at their trim work, and determine whether you like it. Consider the quality of craftsmanship and aesthetic appeal. Narrow your search down to licensed, certified and qualified trim carpenters. Check local regulations to verify the law's requirements for trim carpenters, and ask to see copies of licenses. Ask each of them for references so you can review their past work. Call past clients to make sure they were pleased with the trim carpenter's service. Ask if there were any problems once the job was completed, and if so, ensure that the trim carpenter was responsive. Ask the carpenters about their insurance coverage and whether they are covered for personal injury or property damage. You can ask for the documentation that verifies coverage if necessary. Select 3 carpenters from those names that you found in your search.  List the trim and casing projects that you need the carpenter to perform. Be as detailed as possible, and include the type of wood that you prefer. Include measurements in your list. Request estimates from the 3 carpenters you selected. Ask that they list the materials that they need so that you can compare the pricing accurately. Review the estimates once they come back. Compare all the details, including materials used, time frame and price. Don't select a carpenter based on the price alone. The lowest price does not always indicate the best job done. Take everything into consideration. Talk to the carpenters, and decide which ones seem amiable enough to work with, who seems enthusiastic about your project and who seems to have the most knowledge about the job that needs to be completed. Select your chosen trim carpenter.  Ask for a finalized contract that details everything in your quote. Make sure you are satisfied with the details. The contractor should include a clear beginning and ending date for the project. Check that the payment, any down payment amounts and payment schedules are what were initially agreed upon.",
  "tyn_model":[
    "carpenters",
    "carpenter",
    "trim carpenters",
    "trim carpenter",
    "materials",
    "contractor"
  ],
  "tyn_section":[

  ]
}