{
  "title":"How to Cook a Beef Rump Roast",
  "url":"https://www.wikihow.com/Cook-a-Beef-Rump-Roast",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Beef and Lamb"
  ],
  "methods":[
    {
      "name":"Braised Rump Roast",
      "steps":[
        {
          "headline":"Trim the roast of extra fat.",
          "description":"Don't remove all the fat from the roast, but if it has a thick or tough layer on one side, use a sharp knife to loosen it, then pull it off and discard."
        },
        {
          "headline":"Preheat the oven to 325 degrees Fahrenheit (162 degrees Celsius).",
          "description":""
        },
        {
          "headline":"Heat oil in a large dutch oven or frying pan.",
          "description":"Place the roast in the pan and cook until it is brown on all sides. Don't move the roast around in the pan until it is browned and ready to turn. Moving the meat will prevent it from browning thoroughly. Do not overcook; remove the meat as soon as it is brown on all sides. The point is not to cook it through, but to bring out the flavors in preparation for roasting."
        },
        {
          "headline":"Place the roast in a dutch oven or roasting pan.",
          "description":"You may use the same dutch oven you used to brown the roast, or a clean roasting pan."
        },
        {
          "headline":"Pour the wine and broth over the meat.",
          "description":"Season liberally with salt and pepper."
        },
        {
          "headline":"Cover the roast with a lid or aluminum foil.",
          "description":"Place in the oven and roast for 1 1/2 hours, or 30 minutes per pound."
        },
        {
          "headline":"Test the roast to make sure it's done.",
          "description":"Remove the lid or foil from the pan and insert a meat thermometer into the roast. Rare meat is done when its temperature has reached 125 degrees Fahrenheit(52 degrees Celsius). Medium rare meat is done at 130 degrees Fahrenheit (54 degrees Celsius). Medium well meat is done at 140 degrees Fahrenheit (60 degrees Celsius). Well done meat is done at 160 degrees Fahrenheit (71 degrees Celsius)."
        },
        {
          "headline":"Remove the roast from the oven and allow it to rest uncovered for thirty minutes.",
          "description":"Carve the meat with a sharp knife and serve sliced. If you'd like to make gravy, pour the drippings into a saucepan over medium heat. Add a few tablespoons of flour and stir until thickened."
        }
      ]
    },
    {
      "name":"Slow Cooker Rump Roast",
      "steps":[
        {
          "headline":"Trim the roast of extra fat.",
          "description":"Take care not to remove too much fat; just the tough or thick parts."
        },
        {
          "headline":"Place the roast inside a slow cooker or crockpot.",
          "description":"Adjust the temperature setting on the appliance to low. Most slow cookers and crock pots come with a guide to let you know how long it will take to cook meat at various temperatures. Use the guide to figure out what setting to use."
        },
        {
          "headline":"Pour the seasonings over the meat.",
          "description":"Pour a cup of water over the seasonings."
        },
        {
          "headline":"Place the lid on the slow cooker and cook.",
          "description":"It should take six to eight hours, depending on the setting you choose on  your appliance."
        }
      ]
    },
    {
      "name":"Marinated Rump Roast",
      "steps":[
        {
          "headline":"Trim the roast of extra fat.",
          "description":"Take care not to remove too much fat; just the tough or thick parts."
        },
        {
          "headline":"Place the roast in a large food storage bag.",
          "description":"Add the vinegar, water, thyme, garlic, and a few dashes of salt and pepper."
        },
        {
          "headline":"Seal the bag and allow the meat to marinate for 5 hours or overnight.",
          "description":""
        },
        {
          "headline":"When you're ready to cook the roast, preheat the oven to 325 degrees Fahrenheit (162 degrees Celsius).",
          "description":""
        },
        {
          "headline":"Place the roast in a dutch oven or roasting pan.",
          "description":"Set the marinade aside. Cover."
        },
        {
          "headline":"Cook the roast for one hour.",
          "description":"Remove it from the oven and baste it with the marinade using a brush."
        },
        {
          "headline":"Return the roast to the oven and cook covered until done, about 1/2 an hour longer.",
          "description":""
        },
        {
          "headline":"Test the roast to make sure it's done.",
          "description":"Remove the lid or foil from the pan and insert a meat thermometer into the roast. Follow the guide above for making rare, medium rare, medium well, or well done meat."
        },
        {
          "headline":"Remove the roast from the oven and allow it to sit uncovered for 30 minutes.",
          "description":"Carve the roast and serve in slices."
        }
      ]
    }
  ],
  "text":" Braised Rump Roast Trim the roast of extra fat. Don't remove all the fat from the roast, but if it has a thick or tough layer on one side, use a sharp knife to loosen it, then pull it off and discard. Preheat the oven to 325 degrees Fahrenheit (162 degrees Celsius).  Heat oil in a large dutch oven or frying pan. Place the roast in the pan and cook until it is brown on all sides. Don't move the roast around in the pan until it is browned and ready to turn. Moving the meat will prevent it from browning thoroughly. Do not overcook; remove the meat as soon as it is brown on all sides. The point is not to cook it through, but to bring out the flavors in preparation for roasting. Place the roast in a dutch oven or roasting pan. You may use the same dutch oven you used to brown the roast, or a clean roasting pan. Pour the wine and broth over the meat. Season liberally with salt and pepper. Cover the roast with a lid or aluminum foil. Place in the oven and roast for 1 1/2 hours, or 30 minutes per pound. Test the roast to make sure it's done. Remove the lid or foil from the pan and insert a meat thermometer into the roast. Rare meat is done when its temperature has reached 125 degrees Fahrenheit(52 degrees Celsius). Medium rare meat is done at 130 degrees Fahrenheit (54 degrees Celsius). Medium well meat is done at 140 degrees Fahrenheit (60 degrees Celsius). Well done meat is done at 160 degrees Fahrenheit (71 degrees Celsius). Remove the roast from the oven and allow it to rest uncovered for thirty minutes. Carve the meat with a sharp knife and serve sliced. If you'd like to make gravy, pour the drippings into a saucepan over medium heat. Add a few tablespoons of flour and stir until thickened. Slow Cooker Rump Roast Trim the roast of extra fat. Take care not to remove too much fat; just the tough or thick parts. Place the roast inside a slow cooker or crockpot. Adjust the temperature setting on the appliance to low. Most slow cookers and crock pots come with a guide to let you know how long it will take to cook meat at various temperatures. Use the guide to figure out what setting to use. Pour the seasonings over the meat. Pour a cup of water over the seasonings. Place the lid on the slow cooker and cook. It should take six to eight hours, depending on the setting you choose on  your appliance. Marinated Rump Roast Trim the roast of extra fat. Take care not to remove too much fat; just the tough or thick parts. Place the roast in a large food storage bag. Add the vinegar, water, thyme, garlic, and a few dashes of salt and pepper. Seal the bag and allow the meat to marinate for 5 hours or overnight.  When you're ready to cook the roast, preheat the oven to 325 degrees Fahrenheit (162 degrees Celsius).  Place the roast in a dutch oven or roasting pan. Set the marinade aside. Cover. Cook the roast for one hour. Remove it from the oven and baste it with the marinade using a brush. Return the roast to the oven and cook covered until done, about 1/2 an hour longer.  Test the roast to make sure it's done. Remove the lid or foil from the pan and insert a meat thermometer into the roast. Follow the guide above for making rare, medium rare, medium well, or well done meat. Remove the roast from the oven and allow it to sit uncovered for 30 minutes. Carve the roast and serve in slices.",
  "tyn_model":[
    "oven",
    "dutch oven",
    "roasting pan",
    "salt and pepper",
    "meat thermometer",
    "slow cooker",
    "seasonings",
    "water",
    "braised rump roast",
    "oil",
    "large dutch oven or frying",
    "wine",
    "broth",
    "aluminum foil",
    "sharp knife",
    "saucepan",
    "flour",
    "slow cooker rump",
    "crockpot",
    "slow cookers",
    "crock pots",
    "marinated rump roast",
    "large food storage bag",
    "vinegar",
    "thyme",
    "garlic",
    "dutch oven or roasting pan",
    "foil"
  ],
  "tyn_section":[

  ]
}