{
  "title":"How to Remove Mold from a Nylon Fabric Shower Curtain (Clove Oil Method)",
  "url":"https://www.wikihow.com/Remove-Mold-from-a-Nylon-Fabric-Shower-Curtain-(Clove-Oil-Method)",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Doors and Windows",
    "Window Treatments",
    "Curtains"
  ],
  "parts":[
    {
      "name":"Making the clove oil preparation",
      "steps":[
        {
          "headline":"Wear gloves when handling clove oil.",
          "description":"See Warnings below."
        },
        {
          "headline":"Mix 1/4 teaspoon of clove oil in the one liter/33 fl oz of water.",
          "description":""
        },
        {
          "headline":"Pour the mixture into a clean spray bottle.",
          "description":"Label the bottle so that you know what the contents are, especially if you intend on storing it for reuse."
        }
      ]
    },
    {
      "name":"Using the clove oil preparation",
      "steps":[
        {
          "headline":"Spray the mixture over the moldy nylon shower curtain.",
          "description":"Leave it overnight. It needs this time for the clove oil to react with the mold spores."
        },
        {
          "headline":"Wash the shower curtain in the washing machine the following day.",
          "description":"Allow to air dry, such as on the clothes line; a bit of sunshine will also do it some good."
        },
        {
          "headline":"Hang up again.",
          "description":"After washing, simply rehang it. It should now be clean and mold-free again."
        }
      ]
    }
  ],
  "text":" Making the clove oil preparation Wear gloves when handling clove oil. See Warnings below. Mix 1/4 teaspoon of clove oil in the one liter/33 fl oz of water.  Pour the mixture into a clean spray bottle. Label the bottle so that you know what the contents are, especially if you intend on storing it for reuse. Using the clove oil preparation Spray the mixture over the moldy nylon shower curtain. Leave it overnight. It needs this time for the clove oil to react with the mold spores. Wash the shower curtain in the washing machine the following day. Allow to air dry, such as on the clothes line; a bit of sunshine will also do it some good. Hang up again. After washing, simply rehang it. It should now be clean and mold-free again.",
  "tyn_model":[
    "clove oil",
    "shower curtain",
    "water",
    "spray bottle"
  ],
  "tyn_section":[

  ]
}