{
  "title":"How to Make Colored Sugar",
  "url":"https://www.wikihow.com/Make-Colored-Sugar",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Using a Blender or Processor to Color Sugar",
      "steps":[
        {
          "headline":"Measure and add a cup of sugar to a food processor or a blender.",
          "description":""
        },
        {
          "headline":"Add a few drops of the food coloring of your choice to the food processor or a blender.",
          "description":"The less drops you add, the lighter the colored sugar will be. The more drops added, the darker it will be."
        },
        {
          "headline":"Blend the ingredients to a desired texture and color.",
          "description":"The food processor or blender also blends and breaks down the sugar into a finer grain, which is better for decorating."
        },
        {
          "headline":"Use the mixture immediately or store any leftovers in an airtight container.",
          "description":""
        }
      ]
    },
    {
      "name":"Using a Plastic Bag to Color Sugar",
      "steps":[
        {
          "headline":"Add 1 cup of sugar to a resealable bag.",
          "description":"The bag must be at least sandwich size."
        },
        {
          "headline":"Add in 2 to 3 drops of food coloring.",
          "description":"Add the drops one at a time."
        },
        {
          "headline":"Shake the bag well.",
          "description":"This will coat the sugar with the food dye."
        },
        {
          "headline":"Add more coloring if needed.",
          "description":"Lumps can be crushed out with your hand."
        },
        {
          "headline":"Use as required.",
          "description":"If not using immediately, ensure that the sugar is properly dried, then add to an airtight storage container."
        }
      ]
    }
  ],
  "text":" Using a Blender or Processor to Color Sugar Measure and add a cup of sugar to a food processor or a blender.  Add a few drops of the food coloring of your choice to the food processor or a blender. The less drops you add, the lighter the colored sugar will be. The more drops added, the darker it will be. Blend the ingredients to a desired texture and color. The food processor or blender also blends and breaks down the sugar into a finer grain, which is better for decorating. Use the mixture immediately or store any leftovers in an airtight container.  Using a Plastic Bag to Color Sugar Add 1 cup of sugar to a resealable bag. The bag must be at least sandwich size. Add in 2 to 3 drops of food coloring. Add the drops one at a time. Shake the bag well. This will coat the sugar with the food dye. Add more coloring if needed. Lumps can be crushed out with your hand. Use as required. If not using immediately, ensure that the sugar is properly dried, then add to an airtight storage container.",
  "tyn_model":[
    "sugar",
    "blender",
    "food processor",
    "food coloring",
    "airtight container",
    "plastic bag",
    "resealable bag",
    "food dye",
    "airtight storage container"
  ],
  "tyn_section":[

  ]
}