{
  "title":"How to Dechlorinate Water",
  "url":"https://www.wikihow.com/Dechlorinate-Water",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Dechlorinating Fish Tank or Pond Water",
      "steps":[
        {
          "headline":"Install an aerating sprayer for your fish pond.",
          "description":"If you’re trying to dechlorinate pond water, use a spraying device (like a spraying nozzle connected to a hose) to add air into the water as it enters the pond. Chlorine is volatile and will naturally dissipate in open ponds, but aeration will speed up the process considerably. Aeration does not work for chloramine, however, which is a less volatile additive used by some municipal water authorities. You’ll need to add a dechlorination agent as well."
        },
        {
          "headline":"Add a dechlorination agent to remove chlorine and chloramine.",
          "description":"You can buy dechlorination agents at any pet store. Every dechlorination agent specifies the amount of water it’s designed to treat, so read the directions carefully. Adding the dechlorination agent requires unscrewing the bottle's lid, then turning the bottle upside down, allowing the proper amount to drip out. The water will be ready for immediate use. If you’re using the water in a fish tank with a biological filter, choose a dechlorination agent that doesn’t have an ammonia remover, which could cause problems in your filter."
        },
        {
          "headline":"Aerate fish tank water using an air pump.",
          "description":"You should always dechlorinate water before adding it to a fish tank, but aerating the water will also aid in removing chlorine. Fish tanks typically require an air pump to circulate the water, so you’ll get an aerating and chlorine removing agent as a bonus. Buy the appropriate pump for your tank’s size and type, and the pets you’ll be keeping in the tank."
        }
      ]
    },
    {
      "name":"Dechlorinating Drinking Water",
      "steps":[
        {
          "headline":"Use an activated carbon filter for drinking water.",
          "description":"Activated carbon is a special filter media that removes chlorine, chloramines, and organic compounds from water. Some activated carbon filters can be connected to your home’s water supply, or you can buy a filtered pitcher that uses an activated carbon filter. Activated carbon filters remove both chlorine and chloramine. Choose an activated carbon filter that has been certified by NSF International, a nonprofit that tests and certifies water filtration products."
        },
        {
          "headline":"Install a reverse osmosis filter in your home.",
          "description":"Reverse osmosis refers to the process in which ions and particles are removed from the water. Reverse osmosis systems can be installed directly beneath your kitchen sink or where your water supply enters your home, and are therefore very convenient relative to other dechlorination methods. But they’re also very expensive, often reaching several thousand U.S. dollars. Additionally, reverse osmosis filters are energy-intensive and produce large volumes of wastewater."
        },
        {
          "headline":"Change your filter as needed.",
          "description":"All filters need to be changed eventually. The amount of time that passes between filter changes depends on your filter’s size and how heavily it’s been used. Check the manufacturer’s directions to ensure you’re changing your filter with the appropriate frequency."
        },
        {
          "headline":"Boil chlorinated water for 20 minutes.",
          "description":"Boiling creates heat and aeration (via bubbles), the combination of which is sufficient to remove volatile chlorine after 20 minutes. If you’re trying to dechlorinate large batches of water, however, this method is probably not practical. Boiling for at least 20 minutes will also remove chloramine, which is added instead of chlorine in some areas."
        }
      ]
    },
    {
      "name":"Dechlorinating Water for General Use",
      "steps":[
        {
          "headline":"Allow the chlorine to evaporate naturally.",
          "description":"Fill a bucket or tub with the water you want to dechlorinate. Do not cover it, and place it in an area with limited airborne particles and debris to prevent contamination. Over time, the chlorine in the water will dissipate due to exposure to the sun and air. The precise length of time needed to dechlorinate water using this method depends on the volume of chlorine you’re attempting to remove and the amount of direct sunlight the water receives. Also, the wider and shallower the container, the faster the process will occur. Check the water regularly using a chlorine test kit to determine how much chlorine remains in the water. Evaporation won’t remove chloramine, which is used instead of chlorine in some water supplies. It’s also not recommended for drinking water since contamination can easily occur."
        },
        {
          "headline":"Add 1 teaspoon of ascorbic acid per 1 gallon (3.8 L) of water.",
          "description":"Powdered ascorbic acid (also known as vitamin C) neutralizes chlorine. Just sprinkle the ascorbic acid over the water and mix it in. This method works best for dechlorinating water meant for plants or hydroponics systems. Ascorbic acid is affordable and can be obtained from most pet stores. Ascorbic acid removes both chlorine and chloramine. It also shouldn't noticeably affect the flavor of the water, if you choose to use this method for drinking water."
        },
        {
          "headline":"Use ultraviolet light to dechlorinate water.",
          "description":"Place the water you wish to dechlorinate as close as possible to a UV light source. The precise amount of UV light you’ll need to dechlorinate your water depends on how much water you’re trying to dechlorinate, the strength of the light you’re using, and the presence of organic chemicals in the water. Typically, you should treat chlorinated water using a UV light at the 254 nanometer wavelength that has a radiant energy density of 600 milliliters (20.3  fl oz) per 1 square centimetre (0.16 sq in). UV light will remove chloramine as well as chlorine. This is also a suitable dechlorination process for drinking water."
        }
      ]
    }
  ],
  "text":" Dechlorinating Fish Tank or Pond Water Install an aerating sprayer for your fish pond. If you’re trying to dechlorinate pond water, use a spraying device (like a spraying nozzle connected to a hose) to add air into the water as it enters the pond. Chlorine is volatile and will naturally dissipate in open ponds, but aeration will speed up the process considerably. Aeration does not work for chloramine, however, which is a less volatile additive used by some municipal water authorities. You’ll need to add a dechlorination agent as well. Add a dechlorination agent to remove chlorine and chloramine. You can buy dechlorination agents at any pet store. Every dechlorination agent specifies the amount of water it’s designed to treat, so read the directions carefully. Adding the dechlorination agent requires unscrewing the bottle's lid, then turning the bottle upside down, allowing the proper amount to drip out. The water will be ready for immediate use. If you’re using the water in a fish tank with a biological filter, choose a dechlorination agent that doesn’t have an ammonia remover, which could cause problems in your filter. Aerate fish tank water using an air pump. You should always dechlorinate water before adding it to a fish tank, but aerating the water will also aid in removing chlorine. Fish tanks typically require an air pump to circulate the water, so you’ll get an aerating and chlorine removing agent as a bonus. Buy the appropriate pump for your tank’s size and type, and the pets you’ll be keeping in the tank. Dechlorinating Drinking Water Use an activated carbon filter for drinking water. Activated carbon is a special filter media that removes chlorine, chloramines, and organic compounds from water. Some activated carbon filters can be connected to your home’s water supply, or you can buy a filtered pitcher that uses an activated carbon filter. Activated carbon filters remove both chlorine and chloramine. Choose an activated carbon filter that has been certified by NSF International, a nonprofit that tests and certifies water filtration products. Install a reverse osmosis filter in your home. Reverse osmosis refers to the process in which ions and particles are removed from the water. Reverse osmosis systems can be installed directly beneath your kitchen sink or where your water supply enters your home, and are therefore very convenient relative to other dechlorination methods. But they’re also very expensive, often reaching several thousand U.S. dollars. Additionally, reverse osmosis filters are energy-intensive and produce large volumes of wastewater. Change your filter as needed. All filters need to be changed eventually. The amount of time that passes between filter changes depends on your filter’s size and how heavily it’s been used. Check the manufacturer’s directions to ensure you’re changing your filter with the appropriate frequency. Boil chlorinated water for 20 minutes. Boiling creates heat and aeration (via bubbles), the combination of which is sufficient to remove volatile chlorine after 20 minutes. If you’re trying to dechlorinate large batches of water, however, this method is probably not practical. Boiling for at least 20 minutes will also remove chloramine, which is added instead of chlorine in some areas. Dechlorinating Water for General Use Allow the chlorine to evaporate naturally. Fill a bucket or tub with the water you want to dechlorinate. Do not cover it, and place it in an area with limited airborne particles and debris to prevent contamination. Over time, the chlorine in the water will dissipate due to exposure to the sun and air. The precise length of time needed to dechlorinate water using this method depends on the volume of chlorine you’re attempting to remove and the amount of direct sunlight the water receives. Also, the wider and shallower the container, the faster the process will occur. Check the water regularly using a chlorine test kit to determine how much chlorine remains in the water. Evaporation won’t remove chloramine, which is used instead of chlorine in some water supplies. It’s also not recommended for drinking water since contamination can easily occur. Add 1 teaspoon of ascorbic acid per 1 gallon (3.8 L) of water. Powdered ascorbic acid (also known as vitamin C) neutralizes chlorine. Just sprinkle the ascorbic acid over the water and mix it in. This method works best for dechlorinating water meant for plants or hydroponics systems. Ascorbic acid is affordable and can be obtained from most pet stores. Ascorbic acid removes both chlorine and chloramine. It also shouldn't noticeably affect the flavor of the water, if you choose to use this method for drinking water. Use ultraviolet light to dechlorinate water. Place the water you wish to dechlorinate as close as possible to a UV light source. The precise amount of UV light you’ll need to dechlorinate your water depends on how much water you’re trying to dechlorinate, the strength of the light you’re using, and the presence of organic chemicals in the water. Typically, you should treat chlorinated water using a UV light at the 254 nanometer wavelength that has a radiant energy density of 600 milliliters (20.3  fl oz) per 1 square centimetre (0.16 sq in). UV light will remove chloramine as well as chlorine. This is also a suitable dechlorination process for drinking water.",
  "tyn_model":[
    "water",
    "chlorine",
    "dechlorination agent",
    "ascorbic acid",
    "activated carbon filter",
    "air pump",
    "activated carbon filters",
    "uv light",
    "aerating sprayer",
    "chloramine",
    "dechlorination agents",
    "fish tank water",
    "activated carbon",
    "water filtration products",
    "reverse osmosis systems",
    "reverse osmosis filters",
    "boiling",
    "bucket",
    "chlorine test kit",
    "vitamin c",
    "ultraviolet light"
  ],
  "tyn_section":[

  ]
}