{
  "title":"How to Make Fried Calamari",
  "url":"https://www.wikihow.com/Make-Fried-Calamari",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "steps":[
    {
      "headline":"Choose fresh squid.",
      "description":"It should smell fresh, feel dense and have undamaged tentacles and body. Use a pack of frozen squid and not squid that was thawed overnight in a fridge enough to begin melting. Bacteria will multiply faster in squiddy water at 1°C than squiddy ice at 0°C."
    },
    {
      "headline":"Run cold water over the squid to speed the thawing.",
      "description":"The faster it thaws, the less time it has to pick up a smell before you start cutting it into rings, which is a sign that it might go bad after more time goes by."
    },
    {
      "headline":"Take the squid body in one hand.",
      "description":"Next, pull the head and tentacles out of it with the other."
    },
    {
      "headline":"Remove the piece of cartilage from inside of the body.",
      "description":"That can be thrown away."
    },
    {
      "headline":"Hold the body with one hand.",
      "description":"Use the other hand to pull away the flaps and remove the skin."
    },
    {
      "headline":"Clean the squid by rinsing it under cold water.",
      "description":"After the rinsing, absorb as much water as possible to get it as dry as possible. The drier the squid, the crispier it will be when it is fried."
    },
    {
      "headline":"Cut the body into rings ⅓ to 1/2 inch (0.8 to 1.3 cm) thick.",
      "description":"Leave the tentacles whole or cut them in half if they are too large."
    },
    {
      "headline":"Place a large saucepan on the stove over medium heat.",
      "description":""
    },
    {
      "headline":"Add enough vegetable oil to the saucepan so that it is three inches (7.6 cm) deep.",
      "description":"Allow it to heat to 350 degrees F (176 C)."
    },
    {
      "headline":"Combine the following in a large bowl:",
      "description":"2 cups (454 g) of all-purpose flour 2 tbsp. (28 g) of dried parsley\nsalt and pepper to taste"
    },
    {
      "headline":"Coat the calamari.",
      "description":"Place a few pieces of calamari into the flour mixture. When the oil has reached 350 degrees, place it in the pan to fry."
    },
    {
      "headline":"Turn the calamari once it is golden and crispy on one side.",
      "description":"Fry the other side. Each batch should fry quickly, in about one minute."
    },
    {
      "headline":"Use a slotted spoon to remove the calamari from the hot oil.",
      "description":"Place it on a plate covered with a paper towel."
    },
    {
      "headline":"Repeat the frying process.",
      "description":"Continue cooking small batches of calamari, until it has all been fried and drained."
    },
    {
      "headline":"Season the calamari with salt while it is still hot.",
      "description":"Serve with lemon and tomato sauce."
    }
  ],
  "text":" Choose fresh squid. It should smell fresh, feel dense and have undamaged tentacles and body. Use a pack of frozen squid and not squid that was thawed overnight in a fridge enough to begin melting. Bacteria will multiply faster in squiddy water at 1°C than squiddy ice at 0°C. Run cold water over the squid to speed the thawing. The faster it thaws, the less time it has to pick up a smell before you start cutting it into rings, which is a sign that it might go bad after more time goes by. Take the squid body in one hand. Next, pull the head and tentacles out of it with the other. Remove the piece of cartilage from inside of the body. That can be thrown away. Hold the body with one hand. Use the other hand to pull away the flaps and remove the skin. Clean the squid by rinsing it under cold water. After the rinsing, absorb as much water as possible to get it as dry as possible. The drier the squid, the crispier it will be when it is fried. Cut the body into rings ⅓ to 1/2 inch (0.8 to 1.3 cm) thick. Leave the tentacles whole or cut them in half if they are too large. Place a large saucepan on the stove over medium heat.  Add enough vegetable oil to the saucepan so that it is three inches (7.6 cm) deep. Allow it to heat to 350 degrees F (176 C). Combine the following in a large bowl: 2 cups (454 g) of all-purpose flour 2 tbsp. (28 g) of dried parsley\nsalt and pepper to taste Coat the calamari. Place a few pieces of calamari into the flour mixture. When the oil has reached 350 degrees, place it in the pan to fry. Turn the calamari once it is golden and crispy on one side. Fry the other side. Each batch should fry quickly, in about one minute. Use a slotted spoon to remove the calamari from the hot oil. Place it on a plate covered with a paper towel. Repeat the frying process. Continue cooking small batches of calamari, until it has all been fried and drained. Season the calamari with salt while it is still hot. Serve with lemon and tomato sauce.",
  "tyn_model":[
    "squid",
    "water",
    "salt",
    "oil",
    "squiddy water",
    "squiddy ice",
    "cold water",
    "⅓ to",
    "large saucepan",
    "stove",
    "vegetable oil",
    "saucepan",
    "large bowl",
    "all-purpose flour",
    "dried parsley",
    "flour",
    "pan",
    "slotted spoon",
    "plate",
    "lemon",
    "tomato sauce"
  ],
  "tyn_section":[

  ]
}