{
  "title":"How to Find Error Coins",
  "url":"https://www.wikihow.com/Find-Error-Coins",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Collecting"
  ],
  "steps":[
    {
      "headline":"Sort coins according to denomination types.",
      "description":"It’s always advised to examine them by categories such as grouping them accordingly like dimes, nickels, pennies, etc. This will certainly make the work easier, quickly observing some differences of a coin to another if you evaluate them by groups. It is important not to get too hyped in the search, remember that if an error is too small then the value of the coin is not too much."
    },
    {
      "headline":"Examine the façade of the coin and its inscriptions, it is important to focus on the lettering and look for anything unusual or odd.",
      "description":"Look out for missing letters, any doubling, and anything out of the usual. Error coins get these abnormalities during the production process; usually dirt affects the polishing and stamping process resulting to coins different from the others. Look at the face of the coin on both sides in different angles to easily see errors."
    },
    {
      "headline":"Focus also on the mint-mark and the date indicated on coins, this is considered one of the greatest finds in errors in coins.",
      "description":"Finding errors like details with over-punches, re-punches and other doubling errors makes such coins valuable."
    },
    {
      "headline":"Check major details on both face sides of the coin like portraits, structures, and the like.",
      "description":"Doubling may also occur and try to find cracks, blank areas and other missing elements. On portraits, check on the details like chin, mouth, ears and eyes, doubling often also occur on these areas. Rim of coins should also be inspected where abnormalities also sometimes occur."
    },
    {
      "headline":"Systematically and slowly inspect the coin turning it from the top to the bottom not from one side to another.",
      "description":"If the orientation of the coin is on the right side up at starting point, the orientation after the turn should also be on the right side up. If orientation changes, then the coin is considered valuable. The government takes great care when it comes to correct orientation to prevent error coins reaching circulation. This is why you should make it a habit to check orientation of coins every time you hold one with the simple over-the-top-turn technique."
    },
    {
      "headline":"Don’t miss out on the edges of coins, using your palm roll the coin in order to have the chance to inspect all of the edges.",
      "description":"Look for missing reeds, seams, inconsistencies on lines, and other abnormalities. Don’t forget to check on edges that have lettering because doubling may also occur."
    },
    {
      "headline":"Always set aside coins that give you even a little suspicion, if one is busy but spots or suspects that there is something odd with a certain coin set it aside for further inspection later.",
      "description":"Finding valuable coins becomes easier and faster in time because the eye gets used to spotting small errors with practice."
    }
  ],
  "text":" Sort coins according to denomination types. It’s always advised to examine them by categories such as grouping them accordingly like dimes, nickels, pennies, etc. This will certainly make the work easier, quickly observing some differences of a coin to another if you evaluate them by groups. It is important not to get too hyped in the search, remember that if an error is too small then the value of the coin is not too much. Examine the façade of the coin and its inscriptions, it is important to focus on the lettering and look for anything unusual or odd. Look out for missing letters, any doubling, and anything out of the usual. Error coins get these abnormalities during the production process; usually dirt affects the polishing and stamping process resulting to coins different from the others. Look at the face of the coin on both sides in different angles to easily see errors. Focus also on the mint-mark and the date indicated on coins, this is considered one of the greatest finds in errors in coins. Finding errors like details with over-punches, re-punches and other doubling errors makes such coins valuable. Check major details on both face sides of the coin like portraits, structures, and the like. Doubling may also occur and try to find cracks, blank areas and other missing elements. On portraits, check on the details like chin, mouth, ears and eyes, doubling often also occur on these areas. Rim of coins should also be inspected where abnormalities also sometimes occur. Systematically and slowly inspect the coin turning it from the top to the bottom not from one side to another. If the orientation of the coin is on the right side up at starting point, the orientation after the turn should also be on the right side up. If orientation changes, then the coin is considered valuable. The government takes great care when it comes to correct orientation to prevent error coins reaching circulation. This is why you should make it a habit to check orientation of coins every time you hold one with the simple over-the-top-turn technique. Don’t miss out on the edges of coins, using your palm roll the coin in order to have the chance to inspect all of the edges. Look for missing reeds, seams, inconsistencies on lines, and other abnormalities. Don’t forget to check on edges that have lettering because doubling may also occur. Always set aside coins that give you even a little suspicion, if one is busy but spots or suspects that there is something odd with a certain coin set it aside for further inspection later. Finding valuable coins becomes easier and faster in time because the eye gets used to spotting small errors with practice.",
  "tyn_model":[
    "coins",
    "coin"
  ],
  "tyn_section":[

  ]
}