{
  "title":"How to Search Flickr",
  "url":"https://www.wikihow.com/Search-Flickr",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography"
  ],
  "methods":[
    {
      "name":"Basic Searches",
      "steps":[
        {
          "headline":"Type a word or phrase into the search bar on the right hand side of the Flickr home page.",
          "description":"Typing in \"cat,\" for example, will load a new screen with populated images tagged with the word \"cat. \"{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/66\\/Search-Flickr-Step-1Bullet1.jpg\\/v4-460px-Search-Flickr-Step-1Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/6\\/66\\/Search-Flickr-Step-1Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":346,\"bigWidth\":760,\"bigHeight\":571.0439560439561,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        },
        {
          "headline":"Choose to sort the results by relevancy, recentness or by interest.",
          "description":"Relevancy is the default sorting selection. This category tries to find images that most closely relate to your search term. The recent tab displays images with your search tag in order of when they were uploaded/updated. The interesting tab sorts the images by what users have designated as especially engaging or appealing."
        },
        {
          "headline":"Search within special groups or people.",
          "description":"Above the search bar is three options for search results: photo, groups and people. Searching for groups or people with the keyword \"cat\" would present corresponding groups with the word \"cat\" in them and people with the word \"cat\" in their username."
        },
        {
          "headline":"Click the \"Explore\" tab at the top to discover additional search options.",
          "description":"You can choose to browse images labeled \"Last 7 Days Interesting,\" which displays images without having to enter a search keyword. The \"Popular Tags\" option allows you to see the most common tags users have used to identify photos in the last 24 hours, the last week and of all time. Other search options include \"Most Recent Updates,\" which refreshes frequently, galleries with various themes, and a world map that enables you to find images uploaded from certain cities or regions across the world. The Explore tab also guides you to the Flickr blog, which showcases certain photos and photographers."
        }
      ]
    },
    {
      "name":"Method 2",
      "steps":[
        {
          "headline":"Type a word or phrase into the search box and click search.",
          "description":""
        },
        {
          "headline":"Choose \"Advanced Options\" to the right of the search bar once your images have loaded.",
          "description":""
        },
        {
          "headline":"Browse and change the various options to narrow down your keyword search.",
          "description":"You have the choice to search for all of the different words in your keyword phrase, the exact words in the phrase or any of the words. You can change the search from photos and videos to screenshots or illustrations and animation. You can also search by a specific date when the picture was taken or uploaded."
        },
        {
          "headline":"Click search at the bottom of the page.",
          "description":""
        }
      ]
    }
  ],
  "text":" Basic Searches Type a word or phrase into the search bar on the right hand side of the Flickr home page. Typing in \"cat,\" for example, will load a new screen with populated images tagged with the word \"cat. \"{\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/66\\/Search-Flickr-Step-1Bullet1.jpg\\/v4-460px-Search-Flickr-Step-1Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/6\\/66\\/Search-Flickr-Step-1Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":346,\"bigWidth\":760,\"bigHeight\":571.0439560439561,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Choose to sort the results by relevancy, recentness or by interest. Relevancy is the default sorting selection. This category tries to find images that most closely relate to your search term. The recent tab displays images with your search tag in order of when they were uploaded/updated. The interesting tab sorts the images by what users have designated as especially engaging or appealing. Search within special groups or people. Above the search bar is three options for search results: photo, groups and people. Searching for groups or people with the keyword \"cat\" would present corresponding groups with the word \"cat\" in them and people with the word \"cat\" in their username. Click the \"Explore\" tab at the top to discover additional search options. You can choose to browse images labeled \"Last 7 Days Interesting,\" which displays images without having to enter a search keyword. The \"Popular Tags\" option allows you to see the most common tags users have used to identify photos in the last 24 hours, the last week and of all time. Other search options include \"Most Recent Updates,\" which refreshes frequently, galleries with various themes, and a world map that enables you to find images uploaded from certain cities or regions across the world. The Explore tab also guides you to the Flickr blog, which showcases certain photos and photographers. Method 2 Type a word or phrase into the search box and click search.  Choose \"Advanced Options\" to the right of the search bar once your images have loaded.  Browse and change the various options to narrow down your keyword search. You have the choice to search for all of the different words in your keyword phrase, the exact words in the phrase or any of the words. You can change the search from photos and videos to screenshots or illustrations and animation. You can also search by a specific date when the picture was taken or uploaded. Click search at the bottom of the page. ",
  "tyn_model":[
    "flickr home page",
    "images",
    "flickr blog"
  ],
  "tyn_section":[

  ]
}