{
  "title":"How to Develop Your Own Drawing Style",
  "url":"https://www.wikihow.com/Develop-Your-Own-Drawing-Style",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Learning to Draw"
  ],
  "methods":[
    {
      "name":"Discovering Different Styles",
      "steps":[
        {
          "headline":"Research famous illustrators.",
          "description":"Do your research on famous artists of the past and present. By taking a look at their work, you can try to determine how it lays the foundations for contemporary illustration. When researching famous illustrators:\nTake note of how they use composition, color, and line to bring their art to life. Determine the tone and lines of your favorite artists and try to emulate them by using the same colors or line styles. Research the materials that they used and try to replicate the process by using the same materials. Famous historical illustrators include people like Jean André Castaigne, Edwin Austin Abbey, and Rose O'Neill. Some successful contemporary illustrators include Pat Perry, Dagna Majewska, and Mouni Feddag."
        },
        {
          "headline":"Visit art museums and galleries.",
          "description":"Visiting art museums and galleries will enable you to view other artist's illustrations in person, which is a different experience than seeing a picture in a book or online. Do a search online to find open art galleries near you. You may want to specify your search so that you can find illustrators that use the same medium or draw the same subject matter as you. Take note of their style and technique and find things that you like in other people's art. Things that you can notice in person that may not be obvious in a photo may include things like the texture of the drawing."
        },
        {
          "headline":"Purchase art books or graphic novels.",
          "description":"Graphic novels tell a story by using sequential art and text. Unlike comic books, graphic novels tell a complete and often time more complex story. Pick up a graphic novel at a comic book store and take note of the various styles that exist. Art books, on the other hand, allow you to view a variety of different pieces of art from artists that you appreciate in a textbook format. These are good to get if you're unfamiliar with an artist's work or you can't make it a museum. The primary types of graphic novel include, manga, superhero stories, personal narratives, and non-fiction. Some of the most popular graphic novels include titles like Uncle Scrooge, Persepolis, and Maus. Some popular contemporary art books include \"Every Person in New York,\" \"Beastly Verse,\" and \"Beloved Dog.\""
        }
      ]
    },
    {
      "name":"Developing Your Own Style",
      "steps":[
        {
          "headline":"Practice using different mediums.",
          "description":"Different mediums can open your eyes to new styles of art and inspire your current style. If you are always drawing in only one medium, consider switching to one that you don't use often. For instance, if you always draw in pencil or pen, consider changing to something like pastels or charcoal. While you'll have to adjust your technique to draw, it could inspire your overall style. You can also try doing other art forms like sculpture or painting if you feel like you have illustrator's block."
        },
        {
          "headline":"Draw using different techniques.",
          "description":"Sometimes artists can get caught up drawing using a particular technique, and it limits their body of work. For instance, if you're always used to drawing in an anime style, it could be holding you back from discovering other things you like to draw. Think outside of the box and draw inspiration from innovative artists around you. Other styles include photorealism, surrealism, abstraction, and manga. If you always draw cartoony, try to draw something realistic. Drawing in different styles can help hone your skills."
        },
        {
          "headline":"Determine which subject you like to draw the most.",
          "description":"Different illustrators enjoy drawing different things. Some artists prefer to concentrate on the human form while others prefer to sketch inanimate objects or landscapes. In addition, other illustrators like to draw architecture and some like to draw designs for clothes. Think of what you are trying to get out of your illustrations and decide on the subject matter that you like the most. Some artists are best known for drawing a particular subject, such as Georgia O'Keeffe who is best known for her distinct paintings of flowers."
        },
        {
          "headline":"Express yourself in your drawings.",
          "description":"Think of your emotions and favorite themes while you draw and try to translate that into your art. For example, if you want to convey dark emotions, you can portray that in your art by drawing serious subject matter like a violent or depressing scene. Show your frustration by using sharp, jagged lines. If you want to portray a serene scene, using sweeping bright colors and pick subject matter that will inspire people. Try doing quicker concept pieces instead of obsessing over getting something perfect if you are having a hard time completing a drawing. Try taking thirty or fewer seconds to draw something. Aim to get the form and idea of your subject matter, rather than drawing the minute details. Many artists stick to similar themes, colors, lines, and drawing techniques which distinguish their style from other artists. If you have a block in inspiration, concentrate less on achieving a unique style and focus more on getting your emotions out on paper."
        },
        {
          "headline":"Establish your line style.",
          "description":"Once you've established the medium, you'll be working in and the subject matter, it's time to set yourself apart visually. Think about your line thickness and how you'll be using your lines within your work. Ask yourself if you like drawing thick bold lines or would rather draw more intricate and detailed lines. Also determine if your lines are going to be short, sharp, and jagged, or smooth and long. Will your lines be dark and make the outline the focal point, or are colors and details more important for you? Vary your line width throughout a drawing, but try to maintain a cohesive style overall. The way you outline your drawings will influence your style heavily."
        },
        {
          "headline":"Determine the colors you'll use.",
          "description":"As an illustrator, color can sometimes play a huge role in the emotions and feelings you can evoke from an illustration. Often, darker tones like dark blue and black and can create an ominous feeling in a drawing while lighter tones like yellow, red, and orange can evoke positive emotions. The intensity and method of application also significantly change the way your drawing turns out. Decide whether color will even play a role in your illustrations as some artists prefer to draw in black and white. You may choose to color your drawings with paint, pastels, or colored pens, or scan them and do color edits in a software program."
        }
      ]
    },
    {
      "name":"Refining Your Skills",
      "steps":[
        {
          "headline":"Sign up for classes to learn the basics.",
          "description":"While formal education is never required for art, it will help you learn the basic illustration techniques like shading, adding texture, and composition. Sign up for a drawing or illustration class at your local community center or find a college that offers classes. Research different courses that are provided and choose one that interests you. Even if you've been drawing independently for years, taking a class may teach you something new and will surround you with other illustrators that you can give you feedback and tips. Things to consider when looking for classes include the class schedule and the cost of the courses. In addition to these basic techniques that every illustrator should have, there are also more advanced techniques used by many illustrators that include etching, stipple, and crosshatching."
        },
        {
          "headline":"Practice consistently and frequently.",
          "description":"Doodling or drawing images to take notes in class can help hone your skills, however, dedicated and concentrated practice enables you to make vast improvements in your technique. Set aside extra time each day to sit down and seriously draw something in your newly developed style. Pinpoint areas that you are weak in and deliberately practice drawing things you have difficulty illustrating. For instance, if you are great at drawing faces but bad at anatomy, take extra time to draw the human body until you become more proficient. Make sure that you're in an environment that you feel comfortable so that you can get the most out of your practice."
        },
        {
          "headline":"Get feedback from teachers and artists.",
          "description":"Even though your style is unique to you, it's important that you don't let your ego get in the way of actually improving. Though art is all subjective, there are things that you can do to improve your technique regardless of your experience. Have open and honest conversations about your drawings and take the advice if you feel it is valid. Many art classes will have critiques where other artists will comment on your work and talk about how you can improve. Don't let a suggestion get you down. Instead of being upset, examine what's being said and consider that it could improve your art. You can say, \"My feelings won't be hurt. I just want to know how I can make my drawings more appealing to people. Can you give me some advice?\""
        },
        {
          "headline":"Be unique.",
          "description":"Now that you've gotten the basics down, you should try to develop your own style that's unique to you. Take inspiration from different artists, different styles, and different techniques and combine your favorite things about each of them. Don't just become a carbon copy of another artist. Try to stand out on your own. For example, you can use the dynamic colors of Matt Lyon and combine it with the thick lined, black and white style of Matthieu Bessudo to get a unique style that's your own. Experimentation will lead to your results that you may be able to incorporate into your style."
        }
      ]
    }
  ],
  "text":" Discovering Different Styles Research famous illustrators. Do your research on famous artists of the past and present. By taking a look at their work, you can try to determine how it lays the foundations for contemporary illustration. When researching famous illustrators:\nTake note of how they use composition, color, and line to bring their art to life. Determine the tone and lines of your favorite artists and try to emulate them by using the same colors or line styles. Research the materials that they used and try to replicate the process by using the same materials. Famous historical illustrators include people like Jean André Castaigne, Edwin Austin Abbey, and Rose O'Neill. Some successful contemporary illustrators include Pat Perry, Dagna Majewska, and Mouni Feddag. Visit art museums and galleries. Visiting art museums and galleries will enable you to view other artist's illustrations in person, which is a different experience than seeing a picture in a book or online. Do a search online to find open art galleries near you. You may want to specify your search so that you can find illustrators that use the same medium or draw the same subject matter as you. Take note of their style and technique and find things that you like in other people's art. Things that you can notice in person that may not be obvious in a photo may include things like the texture of the drawing. Purchase art books or graphic novels. Graphic novels tell a story by using sequential art and text. Unlike comic books, graphic novels tell a complete and often time more complex story. Pick up a graphic novel at a comic book store and take note of the various styles that exist. Art books, on the other hand, allow you to view a variety of different pieces of art from artists that you appreciate in a textbook format. These are good to get if you're unfamiliar with an artist's work or you can't make it a museum. The primary types of graphic novel include, manga, superhero stories, personal narratives, and non-fiction. Some of the most popular graphic novels include titles like Uncle Scrooge, Persepolis, and Maus. Some popular contemporary art books include \"Every Person in New York,\" \"Beastly Verse,\" and \"Beloved Dog.\" Developing Your Own Style Practice using different mediums. Different mediums can open your eyes to new styles of art and inspire your current style. If you are always drawing in only one medium, consider switching to one that you don't use often. For instance, if you always draw in pencil or pen, consider changing to something like pastels or charcoal. While you'll have to adjust your technique to draw, it could inspire your overall style. You can also try doing other art forms like sculpture or painting if you feel like you have illustrator's block. Draw using different techniques. Sometimes artists can get caught up drawing using a particular technique, and it limits their body of work. For instance, if you're always used to drawing in an anime style, it could be holding you back from discovering other things you like to draw. Think outside of the box and draw inspiration from innovative artists around you. Other styles include photorealism, surrealism, abstraction, and manga. If you always draw cartoony, try to draw something realistic. Drawing in different styles can help hone your skills. Determine which subject you like to draw the most. Different illustrators enjoy drawing different things. Some artists prefer to concentrate on the human form while others prefer to sketch inanimate objects or landscapes. In addition, other illustrators like to draw architecture and some like to draw designs for clothes. Think of what you are trying to get out of your illustrations and decide on the subject matter that you like the most. Some artists are best known for drawing a particular subject, such as Georgia O'Keeffe who is best known for her distinct paintings of flowers. Express yourself in your drawings. Think of your emotions and favorite themes while you draw and try to translate that into your art. For example, if you want to convey dark emotions, you can portray that in your art by drawing serious subject matter like a violent or depressing scene. Show your frustration by using sharp, jagged lines. If you want to portray a serene scene, using sweeping bright colors and pick subject matter that will inspire people. Try doing quicker concept pieces instead of obsessing over getting something perfect if you are having a hard time completing a drawing. Try taking thirty or fewer seconds to draw something. Aim to get the form and idea of your subject matter, rather than drawing the minute details. Many artists stick to similar themes, colors, lines, and drawing techniques which distinguish their style from other artists. If you have a block in inspiration, concentrate less on achieving a unique style and focus more on getting your emotions out on paper. Establish your line style. Once you've established the medium, you'll be working in and the subject matter, it's time to set yourself apart visually. Think about your line thickness and how you'll be using your lines within your work. Ask yourself if you like drawing thick bold lines or would rather draw more intricate and detailed lines. Also determine if your lines are going to be short, sharp, and jagged, or smooth and long. Will your lines be dark and make the outline the focal point, or are colors and details more important for you? Vary your line width throughout a drawing, but try to maintain a cohesive style overall. The way you outline your drawings will influence your style heavily. Determine the colors you'll use. As an illustrator, color can sometimes play a huge role in the emotions and feelings you can evoke from an illustration. Often, darker tones like dark blue and black and can create an ominous feeling in a drawing while lighter tones like yellow, red, and orange can evoke positive emotions. The intensity and method of application also significantly change the way your drawing turns out. Decide whether color will even play a role in your illustrations as some artists prefer to draw in black and white. You may choose to color your drawings with paint, pastels, or colored pens, or scan them and do color edits in a software program. Refining Your Skills Sign up for classes to learn the basics. While formal education is never required for art, it will help you learn the basic illustration techniques like shading, adding texture, and composition. Sign up for a drawing or illustration class at your local community center or find a college that offers classes. Research different courses that are provided and choose one that interests you. Even if you've been drawing independently for years, taking a class may teach you something new and will surround you with other illustrators that you can give you feedback and tips. Things to consider when looking for classes include the class schedule and the cost of the courses. In addition to these basic techniques that every illustrator should have, there are also more advanced techniques used by many illustrators that include etching, stipple, and crosshatching. Practice consistently and frequently. Doodling or drawing images to take notes in class can help hone your skills, however, dedicated and concentrated practice enables you to make vast improvements in your technique. Set aside extra time each day to sit down and seriously draw something in your newly developed style. Pinpoint areas that you are weak in and deliberately practice drawing things you have difficulty illustrating. For instance, if you are great at drawing faces but bad at anatomy, take extra time to draw the human body until you become more proficient. Make sure that you're in an environment that you feel comfortable so that you can get the most out of your practice. Get feedback from teachers and artists. Even though your style is unique to you, it's important that you don't let your ego get in the way of actually improving. Though art is all subjective, there are things that you can do to improve your technique regardless of your experience. Have open and honest conversations about your drawings and take the advice if you feel it is valid. Many art classes will have critiques where other artists will comment on your work and talk about how you can improve. Don't let a suggestion get you down. Instead of being upset, examine what's being said and consider that it could improve your art. You can say, \"My feelings won't be hurt. I just want to know how I can make my drawings more appealing to people. Can you give me some advice?\" Be unique. Now that you've gotten the basics down, you should try to develop your own style that's unique to you. Take inspiration from different artists, different styles, and different techniques and combine your favorite things about each of them. Don't just become a carbon copy of another artist. Try to stand out on your own. For example, you can use the dynamic colors of Matt Lyon and combine it with the thick lined, black and white style of Matthieu Bessudo to get a unique style that's your own. Experimentation will lead to your results that you may be able to incorporate into your style.",
  "tyn_model":[
    "graphic novels",
    "graphic novel",
    "manga",
    "art books",
    "comic book",
    "pencil",
    "pastels",
    "charcoal",
    "cartoony",
    "illustrators",
    "colors",
    "illustrator",
    "color",
    "paint",
    "colored pens",
    "art classes"
  ],
  "tyn_section":[

  ]
}