{
  "title":"How to Add a Snap to Leather",
  "url":"https://www.wikihow.com/Add-a-Snap-to-Leather",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Leatherworking"
  ],
  "parts":[
    {
      "name":"Punching Holes for the Snap Components",
      "steps":[
        {
          "headline":"Gather your materials.",
          "description":"Adding a snap closure to leather is easy, but you will need some special tools and materials to do it. Before you begin, you will need:\n\nA snap closure kit. You can buy a snap closure kit that contains all or most of the components you will need to add a snap to leather. It should include all of the snap components and a setting tool as well, which is a small metal rod. A hole punch meant for adding snaps to leather. Some snap kits come with a hole punch, so check to see if one is included before you buy this item. If you need to buy one, you can either get a single hole punch that matches the snap you will be adding, or you can get an adjustable punch, which has multiple settings for different types of hole punches. A rawhide or rubber mallet. It is important to use a rawhide or rubber mallet to hammer the snaps into place because a metal hammer may weaken the snap components. Leather that you want to add the snap to. Scissors. You will only need a pair of scissors if you need to cut the leather. Pencil or pen. Setting anvil (optional). A setting anvil is a small metal block with a concave top that can be helpful for adding a snap with a curved cap. However, you can also set the snap on a hard, sturdy surface, such as a work bench, table, or concrete floor. If you are working on a surface that may get damaged if you hit it with a hammer, such as a wood table, then place a book or other thick hard object down to protect the surface."
        },
        {
          "headline":"Measure your leather to determine where to place the snap.",
          "description":"You should plan to position the snap closure pieces about ¾” (1.9 cm) from the ends of your leather. Make sure that you have enough excess leather to do this and still secure the leather as desired. Measure the leather and mark the areas where you want to place the snap closures. If you have too much extra leather on one end of a strip that you are connecting to make a bracelet, then cut some of the leather off to ensure that you do not have too much extra material extending past the snap."
        },
        {
          "headline":"Determine the size of the holes.",
          "description":"Your snap closure should have a diameter measurement on the packaging. This measurement is what you will need to use to determine how large to make the holes in your leather. For example, if your snap is ½” (1.3 cm) in diameter, then your hole will need to be the same size."
        },
        {
          "headline":"Punch the holes.",
          "description":"When you are ready to punch the holes, position the hole punch over the areas you have marked and punch the holes. If you are using an adjustable hole punch, then you will just need to squeeze the punch to make the hole. If you are using a hole punch that you need to hammer to make the hole, then position the punch over the area you have marked and hit the punch with the hammer to make the hole. Only punch one hole at a time. Do not try to punch through both sides of the leather at once."
        }
      ]
    },
    {
      "name":"Inserting the Snap Components",
      "steps":[
        {
          "headline":"Sort the snaps according to their components.",
          "description":"Before you insert the snap components, sort the pieces so that you know how everything fits together. You should have two capped pieces, a male component, and a female component. One of the capped pieces will fit with the male piece and the other will fit with the female piece. Match them up so that you will know which one is which. The female piece is the one that has an opening in it that the other side of the snap fits into. The male piece has a small nub extending from it that fits into the female piece."
        },
        {
          "headline":"Insert the capped post.",
          "description":"Place the capped post that goes with the female component on your setting anvil (if using) or work surface with the post facing up and the cap facing down. Then, lay the leather over the post so that the post pushes through the hole in the leather. The rough side (or back side) of your leather should be facing downwards."
        },
        {
          "headline":"Set the female piece on the post.",
          "description":"Next, place the female piece of the snap over the post that is coming through the hole in the leather. Then, use your setting tool to secure the female piece into place. To do this, place the setting tool so that the smaller end is inside of the female piece. Then, hit the other end of the setting tool with your mallet two or three times. After hitting the setting tool two or three times with a mallet, the female side of the snap should be secured."
        },
        {
          "headline":"Place the other capped post through the other hole.",
          "description":"Next, you will need to attach the male components to the other side of your leather. Place the capped post that goes with the male piece on your work surface with the post facing up. Insert the capped post through the hole on the opposite side of your leather. The rough side (or back side) of your leather should be facing upwards now."
        },
        {
          "headline":"Cover the post with the male piece.",
          "description":"Lay the male piece over the post and then use the setting tool to secure it in place. Place the wide end of the setting tool over the male piece. Then, hit the setting tool with a mallet two or three times to secure it. After the male piece is secured, your snap is ready to use!"
        }
      ]
    }
  ],
  "text":" Punching Holes for the Snap Components Gather your materials. Adding a snap closure to leather is easy, but you will need some special tools and materials to do it. Before you begin, you will need:\n\nA snap closure kit. You can buy a snap closure kit that contains all or most of the components you will need to add a snap to leather. It should include all of the snap components and a setting tool as well, which is a small metal rod. A hole punch meant for adding snaps to leather. Some snap kits come with a hole punch, so check to see if one is included before you buy this item. If you need to buy one, you can either get a single hole punch that matches the snap you will be adding, or you can get an adjustable punch, which has multiple settings for different types of hole punches. A rawhide or rubber mallet. It is important to use a rawhide or rubber mallet to hammer the snaps into place because a metal hammer may weaken the snap components. Leather that you want to add the snap to. Scissors. You will only need a pair of scissors if you need to cut the leather. Pencil or pen. Setting anvil (optional). A setting anvil is a small metal block with a concave top that can be helpful for adding a snap with a curved cap. However, you can also set the snap on a hard, sturdy surface, such as a work bench, table, or concrete floor. If you are working on a surface that may get damaged if you hit it with a hammer, such as a wood table, then place a book or other thick hard object down to protect the surface. Measure your leather to determine where to place the snap. You should plan to position the snap closure pieces about ¾” (1.9 cm) from the ends of your leather. Make sure that you have enough excess leather to do this and still secure the leather as desired. Measure the leather and mark the areas where you want to place the snap closures. If you have too much extra leather on one end of a strip that you are connecting to make a bracelet, then cut some of the leather off to ensure that you do not have too much extra material extending past the snap. Determine the size of the holes. Your snap closure should have a diameter measurement on the packaging. This measurement is what you will need to use to determine how large to make the holes in your leather. For example, if your snap is ½” (1.3 cm) in diameter, then your hole will need to be the same size. Punch the holes. When you are ready to punch the holes, position the hole punch over the areas you have marked and punch the holes. If you are using an adjustable hole punch, then you will just need to squeeze the punch to make the hole. If you are using a hole punch that you need to hammer to make the hole, then position the punch over the area you have marked and hit the punch with the hammer to make the hole. Only punch one hole at a time. Do not try to punch through both sides of the leather at once. Inserting the Snap Components Sort the snaps according to their components. Before you insert the snap components, sort the pieces so that you know how everything fits together. You should have two capped pieces, a male component, and a female component. One of the capped pieces will fit with the male piece and the other will fit with the female piece. Match them up so that you will know which one is which. The female piece is the one that has an opening in it that the other side of the snap fits into. The male piece has a small nub extending from it that fits into the female piece. Insert the capped post. Place the capped post that goes with the female component on your setting anvil (if using) or work surface with the post facing up and the cap facing down. Then, lay the leather over the post so that the post pushes through the hole in the leather. The rough side (or back side) of your leather should be facing downwards. Set the female piece on the post. Next, place the female piece of the snap over the post that is coming through the hole in the leather. Then, use your setting tool to secure the female piece into place. To do this, place the setting tool so that the smaller end is inside of the female piece. Then, hit the other end of the setting tool with your mallet two or three times. After hitting the setting tool two or three times with a mallet, the female side of the snap should be secured. Place the other capped post through the other hole. Next, you will need to attach the male components to the other side of your leather. Place the capped post that goes with the male piece on your work surface with the post facing up. Insert the capped post through the hole on the opposite side of your leather. The rough side (or back side) of your leather should be facing upwards now. Cover the post with the male piece. Lay the male piece over the post and then use the setting tool to secure it in place. Place the wide end of the setting tool over the male piece. Then, hit the setting tool with a mallet two or three times to secure it. After the male piece is secured, your snap is ready to use!",
  "tyn_model":[
    "leather",
    "hole punch",
    "mallet",
    "hammer",
    "setting tool",
    "snap closure kit",
    "scissors",
    "setting anvil",
    "” (",
    "snap kits",
    "rawhide or rubber mallet",
    "rawhide or rubber",
    "pencil",
    "pen",
    "anvil",
    "book"
  ],
  "tyn_section":[

  ]
}