{
  "title":"How to Install Ceiling Drywall",
  "url":"https://www.wikihow.com/Install-Ceiling-Drywall",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Walls and Ceilings",
    "Interior Walls",
    "Drywall Plasterboard and Gyprock",
    "Drywall"
  ],
  "parts":[
    {
      "name":"Preparing the Ceiling and Drywall",
      "steps":[
        {
          "headline":"Inspect the ceiling for obstructions or problems that need to be fixed.",
          "description":"Before you install the drywall, check to make sure electrical wires, ductwork, protruding pipes, and other obstructions won’t be in your way. As well, take this opportunity to make sure there aren’t any obvious issues, such as faulty plumbing, that would be easier to address without drywall in the way. Install furring strips to the framing in order to create a flat, even surface for drywall installation around these obstacles as necessary."
        },
        {
          "headline":"Find the ceiling joists and mark their location on the wall.",
          "description":"You’ll need to know where the ceiling joists are located at all times during this process. If you can’t see the joists, tap on the ceiling with a hammer and listen for a solid sound indicating wood framing. You can just use a pencil to mark the locations on the wall."
        },
        {
          "headline":"Mark the placement of light fixtures and vents on the drywall.",
          "description":"Note where the different light fixtures, vents, and electrical boxes are located on the wall and mark their locations on the drywall you plan to place on top of them. You’ll need to wait until after the drywall is attached to the ceiling before cutting holes in it for these fixtures. You might also precisely mark these locations on a plan of the ceiling, noting their exact distance from the walls."
        },
        {
          "headline":"Smooth the rough edges of the drywall pieces.",
          "description":"Smoothing the rough edges on the cut edges of your drywall pieces will ensure tight joints between the drywall. Use a surform tool to sand down the edges of the drywall until they’re smooth."
        },
        {
          "headline":"Build a T-brace if you’ll be working alone or without a lift.",
          "description":"A T-brace will provide the leverage and support needed to raise the drywall panels to the ceiling when you're working alone. Use a 2 feet (61 cm) piece of 1x4 and nail it to a 2x4 that is long enough to be 1 foot (30 cm) higher than the length from the floor to the ceiling. A T-brace isn’t necessary if you’re using a drywall lift, which is a machine that smoothly lifts drywall to the ceiling so you don’t have to lift it. Drywall lifts can be cheaply rented from department stores and most stores that sell construction equipment."
        }
      ]
    },
    {
      "name":"Attaching the Drywall to the Ceiling",
      "steps":[
        {
          "headline":"Apply adhesive to the joists where the first sheet of drywall will go.",
          "description":"Start in the corning and raise the first sheet of drywall to the ceiling so you can get an idea of the placement across the joists. Wait until you know where you're placing the sheet before you apply any adhesive to the joists. Drywall adhesive dries within 15 minutes, so make sure you’re ready to begin placing the drywall as soon as you apply the adhesive."
        },
        {
          "headline":"Raise the first piece of drywall to the ceiling.",
          "description":"Using your T-brace, or a friend to assist you, raise the first sheet of drywall to the ceiling and slide it snugly into the corner. Make sure that the tapered edges of the sheet are facing the floor. If you’re using a drywall lift, move the lift underneath the ceiling and place the drywall sheet on the lift so that it is directly under the corner of the ceiling. Lift it slowly, making sure the sheet doesn’t jostle or move out of position."
        },
        {
          "headline":"Repeat this process along the first wall.",
          "description":"Attach the next piece of drywall using this same process and continue along the wall, always ensuring that the tapered edges abut one another and are facing down. The tapered edges are designed to make the process of taping and mudding easier, so it’s important that they remain facing down."
        },
        {
          "headline":"Affix the drywall sheets permanently to the ceiling joists.",
          "description":"Use either nails or screws to attach the drywall to the joists. Drive the fasteners in .375 inches (0.95 cm) away from the edges of each sheet and space them 7 inches (18 cm) apart along the perimeter. Along the interior joist, install the fasteners at about 12 inches (30 cm) increments. The heads of the fasteners you choose should come in contact with the paper facing, sinking in slightly without breaking through the paper."
        },
        {
          "headline":"Start the second row with a half sheet of drywall to stagger the seams.",
          "description":"When you finish the first row of drywall and move on to the second, make sure the seams don’t line up between the two rows. Having staggered seams will enforce the stability of the drywall. Measure and mark the cut line at the vertical midpoint of the drywall sheet and use a utility knife to cut through the drywall. Tip the panel off of the floor or table at a slight angle, then push it down to break it in half. Use the same procedure to attach this half-piece of drywall as you used on the first row of drywall."
        },
        {
          "headline":"Repeat this process until the entire ceiling is covered.",
          "description":"Continue to place drywall in rows along the ceiling, affixing them in place with nails or screws. As you move from one row to the next, make sure to stagger the seams to ensure the drywall’s stability."
        },
        {
          "headline":"Go back and cut holes in the drywall for vents and fixtures.",
          "description":"Now that the drywall is set, go back and cut holes in the places you marked for vents, lights, and electrical boxes. Use a spiral cutout saw to make the cutting process quick and easy."
        }
      ]
    }
  ],
  "text":" Preparing the Ceiling and Drywall Inspect the ceiling for obstructions or problems that need to be fixed. Before you install the drywall, check to make sure electrical wires, ductwork, protruding pipes, and other obstructions won’t be in your way. As well, take this opportunity to make sure there aren’t any obvious issues, such as faulty plumbing, that would be easier to address without drywall in the way. Install furring strips to the framing in order to create a flat, even surface for drywall installation around these obstacles as necessary. Find the ceiling joists and mark their location on the wall. You’ll need to know where the ceiling joists are located at all times during this process. If you can’t see the joists, tap on the ceiling with a hammer and listen for a solid sound indicating wood framing. You can just use a pencil to mark the locations on the wall. Mark the placement of light fixtures and vents on the drywall. Note where the different light fixtures, vents, and electrical boxes are located on the wall and mark their locations on the drywall you plan to place on top of them. You’ll need to wait until after the drywall is attached to the ceiling before cutting holes in it for these fixtures. You might also precisely mark these locations on a plan of the ceiling, noting their exact distance from the walls. Smooth the rough edges of the drywall pieces. Smoothing the rough edges on the cut edges of your drywall pieces will ensure tight joints between the drywall. Use a surform tool to sand down the edges of the drywall until they’re smooth. Build a T-brace if you’ll be working alone or without a lift. A T-brace will provide the leverage and support needed to raise the drywall panels to the ceiling when you're working alone. Use a 2 feet (61 cm) piece of 1x4 and nail it to a 2x4 that is long enough to be 1 foot (30 cm) higher than the length from the floor to the ceiling. A T-brace isn’t necessary if you’re using a drywall lift, which is a machine that smoothly lifts drywall to the ceiling so you don’t have to lift it. Drywall lifts can be cheaply rented from department stores and most stores that sell construction equipment. Attaching the Drywall to the Ceiling Apply adhesive to the joists where the first sheet of drywall will go. Start in the corning and raise the first sheet of drywall to the ceiling so you can get an idea of the placement across the joists. Wait until you know where you're placing the sheet before you apply any adhesive to the joists. Drywall adhesive dries within 15 minutes, so make sure you’re ready to begin placing the drywall as soon as you apply the adhesive. Raise the first piece of drywall to the ceiling. Using your T-brace, or a friend to assist you, raise the first sheet of drywall to the ceiling and slide it snugly into the corner. Make sure that the tapered edges of the sheet are facing the floor. If you’re using a drywall lift, move the lift underneath the ceiling and place the drywall sheet on the lift so that it is directly under the corner of the ceiling. Lift it slowly, making sure the sheet doesn’t jostle or move out of position. Repeat this process along the first wall. Attach the next piece of drywall using this same process and continue along the wall, always ensuring that the tapered edges abut one another and are facing down. The tapered edges are designed to make the process of taping and mudding easier, so it’s important that they remain facing down. Affix the drywall sheets permanently to the ceiling joists. Use either nails or screws to attach the drywall to the joists. Drive the fasteners in .375 inches (0.95 cm) away from the edges of each sheet and space them 7 inches (18 cm) apart along the perimeter. Along the interior joist, install the fasteners at about 12 inches (30 cm) increments. The heads of the fasteners you choose should come in contact with the paper facing, sinking in slightly without breaking through the paper. Start the second row with a half sheet of drywall to stagger the seams. When you finish the first row of drywall and move on to the second, make sure the seams don’t line up between the two rows. Having staggered seams will enforce the stability of the drywall. Measure and mark the cut line at the vertical midpoint of the drywall sheet and use a utility knife to cut through the drywall. Tip the panel off of the floor or table at a slight angle, then push it down to break it in half. Use the same procedure to attach this half-piece of drywall as you used on the first row of drywall. Repeat this process until the entire ceiling is covered. Continue to place drywall in rows along the ceiling, affixing them in place with nails or screws. As you move from one row to the next, make sure to stagger the seams to ensure the drywall’s stability. Go back and cut holes in the drywall for vents and fixtures. Now that the drywall is set, go back and cut holes in the places you marked for vents, lights, and electrical boxes. Use a spiral cutout saw to make the cutting process quick and easy.",
  "tyn_model":[
    "drywall",
    "adhesive",
    "drywall lift",
    "drywall sheet",
    "nails",
    "screws",
    "fasteners",
    "paper",
    "furring",
    "hammer",
    "pencil",
    "electrical boxes",
    "surform tool",
    "drywall panels",
    "drywall lifts",
    "drywall adhesive",
    "drywall sheets",
    "utility knife",
    "spiral cutout saw"
  ],
  "tyn_section":[

  ]
}