{
  "title":"How to Make Tortilla Strips",
  "url":"https://www.wikihow.com/Make-Tortilla-Strips",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine"
  ],
  "methods":[
    {
      "name":"Making Basic Tortilla Strips",
      "steps":[
        {
          "headline":"Preheat your oven to 350°F (177°C).",
          "description":"If you'd like, you can also line two baking sheets with parchment paper. The parchment paper is not absolutely necessary, but it will make cleaning up easier."
        },
        {
          "headline":"Brush the tortillas with vegetable oil.",
          "description":"Measure out the oil into a small bowl, Then, use a basting brush (or something similar) to brush the oil onto the tortillas. The oil will help the tortillas turn crispy when you bake them."
        },
        {
          "headline":"Stack 2 to 3 tortillas on top of each other.",
          "description":"If you'd like to make smaller strips, cut the tortillas into quarters. At this time, you can also put the remaining tortillas into stacks as well, so that they will be ready for you."
        },
        {
          "headline":"Slice the tortillas into ¼ to ½-inch (0.64 to 1.27 centimeters) thick strips.",
          "description":"You can do this using a sharp knife or a pizza cutter. These narrow strips are perfect for tossing onto a soup or salad. If you'd like to make something more chip-like that you can eat with salsa (or other dips), cut the tortillas into 1-inch (2.54 centimeters) wide strips instead."
        },
        {
          "headline":"Spread the strips in a single layer on two baking sheets.",
          "description":"If you cannot fit all of the strips onto the baking sheets, save them for a separate batch. You don't want the strips to be clumped up or covered, or they won't bake evenly."
        },
        {
          "headline":"Bake the strips in the oven for 12 to 15 minutes, or until they are golden and crispy.",
          "description":"You can bake them one baking sheet at a time, or you can put both baking sheets into the oven. If you are baking both sheets at the same time, rotate them halfway through baking. This ensures that both sheets get baked the same amount."
        },
        {
          "headline":"Season the strips with salt.",
          "description":"Once the strips are baked, pull the baking sheets out of the even, and set them down on the counter or stove. Shake some salt onto the strips; how much salt you add is entirely up to you!"
        },
        {
          "headline":"Let the strips cool on the baking sheet, then serve them.",
          "description":"They make great toppings for salads, soups, and beans. You can also serve the wider ones on their own with some dip."
        }
      ]
    },
    {
      "name":"Making Seasoned Tortilla Strips",
      "steps":[
        {
          "headline":"Preheat the oven to 375°F (190°C).",
          "description":"If you'd like, you can also line two baking sheets with parchment paper. While not completely necessary, this will allow for easier clean up at the end."
        },
        {
          "headline":"In a small bowl, mix together the seasonings briskly with a fork, then set them aside.",
          "description":"Put 2 teaspoons of chili powder, ½ teaspoon of ground cumin, and ¼ to ½ teaspoon of cayenne pepper or ground red pepper into a small bowl. Add a dash of salt, then mix briskly together with a fork. Set the bowl aside. If these seasonings do not appeal to you, here are two other alternate seasonings you can try:\nFiesta-Lime:3 tablespoons lime juice\n1 teaspoon ground cumin\n1 teaspoon chili powder\n1 teaspoon salt\n\nGarlic and Onion:2 teaspoons chili powder\n⅓ teaspoon onion powder\n⅓ teaspoon garlic powder\n⅓ teaspoon salt\n⅓ teaspoon ground black pepper\n¼ teaspoon cayenne pepper"
        },
        {
          "headline":"Stack 2 to 3 tortillas on top of each other.",
          "description":"If you'd like to make smaller strips, cut the tortillas into quarters now using a sharp knife or a pizza cutter. At this time, you can also stack the remaining tortillas so that they will be all ready for you."
        },
        {
          "headline":"Cut the tortillas into ¼ to ½-inch (0.64 to 1.27 centimeters) wide strips.",
          "description":"These narrow strips will make perfect garnishes for soups, salads, beans, and other dishes. If you'd like to make more chip-like strips that you can scoop up salsa with, cut them into 1-inch (2.54 centimeters) wide strips instead."
        },
        {
          "headline":"Toss the strips with vegetable oil.",
          "description":"Pour the oil into a bowl, and dump the strips in. Gently toss the strips until they are all evenly coated with oil. You can do this using your hands or a pair of salad tongs."
        },
        {
          "headline":"Add in your seasoning and toss the strips again.",
          "description":"Keep tossing until the strips are evenly coated with seasoning."
        },
        {
          "headline":"Spread the strips out in a single layer on two large baking sheets.",
          "description":"Make sure that the strips are spread evenly and that they are not clumped together. If any of the strips are covered, they won't bake evenly."
        },
        {
          "headline":"Bake the strips for 10 to 15 minutes, or until they turn golden brown.",
          "description":"You can bake the sheets in the oven one at a time, or you can bake them at the same time. If you are baking both sheets at the same time, rotate them halfway through the baking process. This will ensure that the strips get baked the same amount."
        },
        {
          "headline":"Let the strips cool on the baking sheet before serving them.",
          "description":"You can toss them over a salad or soup, or serve them alongside some black beans. If you made the wider, chip-like strips, you can serve them with some salsa, guacamole, or your favorite dip."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Basic Tortilla Strips Preheat your oven to 350°F (177°C). If you'd like, you can also line two baking sheets with parchment paper. The parchment paper is not absolutely necessary, but it will make cleaning up easier. Brush the tortillas with vegetable oil. Measure out the oil into a small bowl, Then, use a basting brush (or something similar) to brush the oil onto the tortillas. The oil will help the tortillas turn crispy when you bake them. Stack 2 to 3 tortillas on top of each other. If you'd like to make smaller strips, cut the tortillas into quarters. At this time, you can also put the remaining tortillas into stacks as well, so that they will be ready for you. Slice the tortillas into ¼ to ½-inch (0.64 to 1.27 centimeters) thick strips. You can do this using a sharp knife or a pizza cutter. These narrow strips are perfect for tossing onto a soup or salad. If you'd like to make something more chip-like that you can eat with salsa (or other dips), cut the tortillas into 1-inch (2.54 centimeters) wide strips instead. Spread the strips in a single layer on two baking sheets. If you cannot fit all of the strips onto the baking sheets, save them for a separate batch. You don't want the strips to be clumped up or covered, or they won't bake evenly. Bake the strips in the oven for 12 to 15 minutes, or until they are golden and crispy. You can bake them one baking sheet at a time, or you can put both baking sheets into the oven. If you are baking both sheets at the same time, rotate them halfway through baking. This ensures that both sheets get baked the same amount. Season the strips with salt. Once the strips are baked, pull the baking sheets out of the even, and set them down on the counter or stove. Shake some salt onto the strips; how much salt you add is entirely up to you! Let the strips cool on the baking sheet, then serve them. They make great toppings for salads, soups, and beans. You can also serve the wider ones on their own with some dip. Making Seasoned Tortilla Strips Preheat the oven to 375°F (190°C). If you'd like, you can also line two baking sheets with parchment paper. While not completely necessary, this will allow for easier clean up at the end. In a small bowl, mix together the seasonings briskly with a fork, then set them aside. Put 2 teaspoons of chili powder, ½ teaspoon of ground cumin, and ¼ to ½ teaspoon of cayenne pepper or ground red pepper into a small bowl. Add a dash of salt, then mix briskly together with a fork. Set the bowl aside. If these seasonings do not appeal to you, here are two other alternate seasonings you can try:\nFiesta-Lime:3 tablespoons lime juice\n1 teaspoon ground cumin\n1 teaspoon chili powder\n1 teaspoon salt\n\nGarlic and Onion:2 teaspoons chili powder\n⅓ teaspoon onion powder\n⅓ teaspoon garlic powder\n⅓ teaspoon salt\n⅓ teaspoon ground black pepper\n¼ teaspoon cayenne pepper Stack 2 to 3 tortillas on top of each other. If you'd like to make smaller strips, cut the tortillas into quarters now using a sharp knife or a pizza cutter. At this time, you can also stack the remaining tortillas so that they will be all ready for you. Cut the tortillas into ¼ to ½-inch (0.64 to 1.27 centimeters) wide strips. These narrow strips will make perfect garnishes for soups, salads, beans, and other dishes. If you'd like to make more chip-like strips that you can scoop up salsa with, cut them into 1-inch (2.54 centimeters) wide strips instead. Toss the strips with vegetable oil. Pour the oil into a bowl, and dump the strips in. Gently toss the strips until they are all evenly coated with oil. You can do this using your hands or a pair of salad tongs. Add in your seasoning and toss the strips again. Keep tossing until the strips are evenly coated with seasoning. Spread the strips out in a single layer on two large baking sheets. Make sure that the strips are spread evenly and that they are not clumped together. If any of the strips are covered, they won't bake evenly. Bake the strips for 10 to 15 minutes, or until they turn golden brown. You can bake the sheets in the oven one at a time, or you can bake them at the same time. If you are baking both sheets at the same time, rotate them halfway through the baking process. This will ensure that the strips get baked the same amount. Let the strips cool on the baking sheet before serving them. You can toss them over a salad or soup, or serve them alongside some black beans. If you made the wider, chip-like strips, you can serve them with some salsa, guacamole, or your favorite dip. Finished. ",
  "tyn_model":[
    "tortillas",
    "baking sheets",
    "salt",
    "oven",
    "oil",
    "⅓ teaspoon",
    "parchment paper",
    "salsa",
    "baking sheet",
    "chili powder",
    "vegetable oil",
    "pizza cutter",
    "fork",
    "cayenne pepper",
    "bowl",
    "basting brush",
    "sharp knife",
    "stove",
    "seasonings",
    "ground cumin",
    "ground red pepper",
    "small bowl",
    "lime juice",
    "garlic",
    "onion",
    "garlic powder",
    "ground black pepper",
    "salad tongs",
    "seasoning",
    "black beans",
    "guacamole"
  ],
  "tyn_section":[

  ]
}