{
  "title":"How to Clean a Fireplace",
  "url":"https://www.wikihow.com/Clean-a-Fireplace",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Selecting Your Materials",
      "steps":[
        {
          "headline":"Use a store-bought cleaner for an easy solution.",
          "description":"You can use conventional household cleaners on your fireplace. There are also cleaners you can purchase specifically made for fireplaces. Ammonia can work well as a cleaner, but may be harsher on brick fireplaces. Oven cleaner can be applied to a fireplace. It can work well if there's a lot of built up burnt material in your fireplace. Browse your local hardware store for cleaners made for fireplaces. These may be less harsh on your fireplace. Fireplace cleaners, like Quick n' Brite for example, may need to be diluted prior to use, so be sure to read instructions."
        },
        {
          "headline":"Make a homemade cleaner for a natural option.",
          "description":"If you're adverse to chemicals, a homemade cleaner can work. You can usually make a cleaner with items from your kitchen. You can combine 2 tablespoons (30 mL) of cream of tartar with water to make a quality homemade cleaner. You can also mix equal parts vinegar and water for a cleaner. Put the cleaner in a spray bottle to apply it. Mix 2–3 tablespoons (30–44 mL) of dish soap with ½ cup (260 g) of baking soda. Work this into a paste for a quality homemade cleaner."
        },
        {
          "headline":"Make sure you have an all-purpose cleaning spray.",
          "description":"Before applying any cleaner, you apply an all-purpose cleaner to the fireplace. Something like 409 spray, which you can purchase at most supermarkets, would work well here. If you're using a store bought cleaner, make sure the cleaner you choose does not interact negatively with your all purpose spray."
        },
        {
          "headline":"Get a small brush to sweep the fireplace.",
          "description":"You will sweep the fireplace quickly before scrubbing, so grab a small broom. You can find small brooms at most department stores. Check the pet aisle. Oftentimes, small brooms and dustpans are sold to clean up cat litter. This could work for cleaning a fireplace."
        },
        {
          "headline":"Get an abrasive tool.",
          "description":"This is for scrubbing debris out of your fireplace. A scrub brush or an abrasive sponge would work for a fireplace. You can buy such products at most supermarkets and department stores."
        }
      ]
    },
    {
      "name":"Removing Soot",
      "steps":[
        {
          "headline":"Protect the surrounding area.",
          "description":"Wear an apron, or wear old clothes, to protect yourself from dirt or debris. Lay a tarp down over the floor around the fireplace. Cleaning the fireplace is a dirty task, and soot can be difficult to get out of clothes or carpeting. If you don't have a tarp, try using old clothes or towels you no longer use. Make sure it's material you are not attached to, as it will likely get ruined during the cleaning process."
        },
        {
          "headline":"Remove debris from the fireplace.",
          "description":"Any old wood, and other debris should be discarded prior to cleaning. Put on some cleaning gloves and get to work removing debris. If there is any wood that is salvageable, set this aside for later. You may have to use a vacuum to suck up very loose debris. Expert Answer\t\t\t\t\t\tQ\t\t\t\tA wikiHow reader asked: \"How do you clean ashes from a fireplace?\" Michelle Driscoll, MPH\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFounder, Mulberry Maids\t\t\t\t\t\t\t\t\t\tMichelle Driscoll is the Owner of Mulberry Maids based in northern Colorado. Driscoll received her Masters in Public Health from the Colorado School of Public Health in 2016. EXPERT ADVICE\t\t\t\tMichelle Driscoll, a cleaning expert, answers: \"Be sure to let the ashes completely cool and then shovel them into a bag. Then sweep and vacuum the residual soot to get all the remaining ash out of your fireplace.\""
        },
        {
          "headline":"Sweep the chimney from top to bottom.",
          "description":"Take your small brush and use this to sweep. Thoroughly sweep any dust or ashes from inside the chimney. It can help to sprinkle coffee grounds over the ashes first. This can give them a more solid texture, preventing ashes from scattering in the air. Sweep off the doorway to the chimney as well, as this is likely dusted with ash as well."
        },
        {
          "headline":"Spray down the fireplace.",
          "description":"The all-purpose cleaner goes on first. Spritz the inside of the fireplace with a light layer of this cleaner. The purpose of this is to wet the area, which begins the cleaning process. Make sure to get the entire inside of the fireplace wet before proceeding."
        },
        {
          "headline":"Use your abrasive tool dipped in cleaner to clean the fireplace.",
          "description":"Get the cleaner you're using, whether it's handmade or store-bought. Dip your abrasive tool in the cleaner and start scrubbing. Do not scrub too hard, as your brush is already abrasive. Use circular motions to apply until the fireplace is completely covered. If there are hard-to-reach cracks in your fireplace, use a toothbrush to clean these areas."
        },
        {
          "headline":"Let the cleaner sit on the fireplace.",
          "description":"If the chimney only has minor stains, 10 to 15 minutes should be sufficient. If the stains are very bad, wait at least 30 minutes. If you're using a store-bought cleaner, read the label carefully. There may be specific instructions on how long to let the cleaner sit."
        },
        {
          "headline":"Remove the buildup from the fireplace.",
          "description":"The cleaner should loosen up dirt and debris from the fireplace. You should now be able to easily remove them with some scrubbing and cleaning. Wet a cloth under warm or hot tap water. Buff the stain away. It should come off fairly easily. Usually, after this the process will be complete. However, for very stained or damaged fireplaces, you may need to do a second cleaning, or even a third."
        }
      ]
    },
    {
      "name":"Cleaning Fireplace Glass",
      "steps":[
        {
          "headline":"Dampen a cloth with water.",
          "description":"Ensure your fireplace is off and cool to the touch before beginning. Choose a rag that you don’t mind throwing out after cleaning the glass. You could use paper towels in place of a cloth, if desired."
        },
        {
          "headline":"Dip the damp cloth in ash.",
          "description":"Use the ash from the fireplace itself. Make sure the cloth is coated in ash, as this will actually help remove soot from the glass, even if it sounds counterintuitive."
        },
        {
          "headline":"Scrub the glass with the cloth.",
          "description":"Put some elbow grease into it! You’ll need to scrub pretty hard to get the glass clean. Keep working until all the soot or discoloration is removed."
        },
        {
          "headline":"Wipe the glass with a microfiber towel.",
          "description":"Once the glass is clean, remove any streaks or remaining residue with a clean microfiber towel."
        }
      ]
    },
    {
      "name":"Keeping Your Fireplace Clean",
      "steps":[
        {
          "headline":"Go for dry wood.",
          "description":"Dry wood burns much more efficiently than other types of wood. It also tends to produce less smoke, cutting down on staining within the fireplace. Make sure any wood you buy is dry or seasoned. If the wood is not labeled, ask someone at the place where you're purchasing the wood."
        },
        {
          "headline":"Vacuum the fireplace on a weekly basis.",
          "description":"This will cut back on the process of sweeping and removing debris when you clean the fireplace. However, take certain precautions. Make sure any embers have had at least 12 hours to dry before vacuuming."
        },
        {
          "headline":"Use water to drown a fire for emergencies only.",
          "description":"Fires in a fireplace should burn out naturally. The ashes will turn into a paste if wet, which is very difficult to clean. Only use water in the event of an emergency. Call emergency services immediately if a fire starts in your home. Even if you think you have a fire under control, professional firefighters should examine your home to make sure the fire is completely out."
        }
      ]
    }
  ],
  "text":" Selecting Your Materials Use a store-bought cleaner for an easy solution. You can use conventional household cleaners on your fireplace. There are also cleaners you can purchase specifically made for fireplaces. Ammonia can work well as a cleaner, but may be harsher on brick fireplaces. Oven cleaner can be applied to a fireplace. It can work well if there's a lot of built up burnt material in your fireplace. Browse your local hardware store for cleaners made for fireplaces. These may be less harsh on your fireplace. Fireplace cleaners, like Quick n' Brite for example, may need to be diluted prior to use, so be sure to read instructions. Make a homemade cleaner for a natural option. If you're adverse to chemicals, a homemade cleaner can work. You can usually make a cleaner with items from your kitchen. You can combine 2 tablespoons (30 mL) of cream of tartar with water to make a quality homemade cleaner. You can also mix equal parts vinegar and water for a cleaner. Put the cleaner in a spray bottle to apply it. Mix 2–3 tablespoons (30–44 mL) of dish soap with ½ cup (260 g) of baking soda. Work this into a paste for a quality homemade cleaner. Make sure you have an all-purpose cleaning spray. Before applying any cleaner, you apply an all-purpose cleaner to the fireplace. Something like 409 spray, which you can purchase at most supermarkets, would work well here. If you're using a store bought cleaner, make sure the cleaner you choose does not interact negatively with your all purpose spray. Get a small brush to sweep the fireplace. You will sweep the fireplace quickly before scrubbing, so grab a small broom. You can find small brooms at most department stores. Check the pet aisle. Oftentimes, small brooms and dustpans are sold to clean up cat litter. This could work for cleaning a fireplace. Get an abrasive tool. This is for scrubbing debris out of your fireplace. A scrub brush or an abrasive sponge would work for a fireplace. You can buy such products at most supermarkets and department stores. Removing Soot Protect the surrounding area. Wear an apron, or wear old clothes, to protect yourself from dirt or debris. Lay a tarp down over the floor around the fireplace. Cleaning the fireplace is a dirty task, and soot can be difficult to get out of clothes or carpeting. If you don't have a tarp, try using old clothes or towels you no longer use. Make sure it's material you are not attached to, as it will likely get ruined during the cleaning process. Remove debris from the fireplace. Any old wood, and other debris should be discarded prior to cleaning. Put on some cleaning gloves and get to work removing debris. If there is any wood that is salvageable, set this aside for later. You may have to use a vacuum to suck up very loose debris. Expert Answer\t\t\t\t\t\tQ\t\t\t\tA wikiHow reader asked: \"How do you clean ashes from a fireplace?\" Michelle Driscoll, MPH\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFounder, Mulberry Maids\t\t\t\t\t\t\t\t\t\tMichelle Driscoll is the Owner of Mulberry Maids based in northern Colorado. Driscoll received her Masters in Public Health from the Colorado School of Public Health in 2016. EXPERT ADVICE\t\t\t\tMichelle Driscoll, a cleaning expert, answers: \"Be sure to let the ashes completely cool and then shovel them into a bag. Then sweep and vacuum the residual soot to get all the remaining ash out of your fireplace.\" Sweep the chimney from top to bottom. Take your small brush and use this to sweep. Thoroughly sweep any dust or ashes from inside the chimney. It can help to sprinkle coffee grounds over the ashes first. This can give them a more solid texture, preventing ashes from scattering in the air. Sweep off the doorway to the chimney as well, as this is likely dusted with ash as well. Spray down the fireplace. The all-purpose cleaner goes on first. Spritz the inside of the fireplace with a light layer of this cleaner. The purpose of this is to wet the area, which begins the cleaning process. Make sure to get the entire inside of the fireplace wet before proceeding. Use your abrasive tool dipped in cleaner to clean the fireplace. Get the cleaner you're using, whether it's handmade or store-bought. Dip your abrasive tool in the cleaner and start scrubbing. Do not scrub too hard, as your brush is already abrasive. Use circular motions to apply until the fireplace is completely covered. If there are hard-to-reach cracks in your fireplace, use a toothbrush to clean these areas. Let the cleaner sit on the fireplace. If the chimney only has minor stains, 10 to 15 minutes should be sufficient. If the stains are very bad, wait at least 30 minutes. If you're using a store-bought cleaner, read the label carefully. There may be specific instructions on how long to let the cleaner sit. Remove the buildup from the fireplace. The cleaner should loosen up dirt and debris from the fireplace. You should now be able to easily remove them with some scrubbing and cleaning. Wet a cloth under warm or hot tap water. Buff the stain away. It should come off fairly easily. Usually, after this the process will be complete. However, for very stained or damaged fireplaces, you may need to do a second cleaning, or even a third. Cleaning Fireplace Glass Dampen a cloth with water. Ensure your fireplace is off and cool to the touch before beginning. Choose a rag that you don’t mind throwing out after cleaning the glass. You could use paper towels in place of a cloth, if desired. Dip the damp cloth in ash. Use the ash from the fireplace itself. Make sure the cloth is coated in ash, as this will actually help remove soot from the glass, even if it sounds counterintuitive. Scrub the glass with the cloth. Put some elbow grease into it! You’ll need to scrub pretty hard to get the glass clean. Keep working until all the soot or discoloration is removed. Wipe the glass with a microfiber towel. Once the glass is clean, remove any streaks or remaining residue with a clean microfiber towel. Keeping Your Fireplace Clean Go for dry wood. Dry wood burns much more efficiently than other types of wood. It also tends to produce less smoke, cutting down on staining within the fireplace. Make sure any wood you buy is dry or seasoned. If the wood is not labeled, ask someone at the place where you're purchasing the wood. Vacuum the fireplace on a weekly basis. This will cut back on the process of sweeping and removing debris when you clean the fireplace. However, take certain precautions. Make sure any embers have had at least 12 hours to dry before vacuuming. Use water to drown a fire for emergencies only. Fires in a fireplace should burn out naturally. The ashes will turn into a paste if wet, which is very difficult to clean. Only use water in the event of an emergency. Call emergency services immediately if a fire starts in your home. Even if you think you have a fire under control, professional firefighters should examine your home to make sure the fire is completely out.",
  "tyn_model":[
    "fireplace",
    "cleaner",
    "water",
    "cleaners",
    "abrasive tool",
    "all-purpose cleaner",
    "small brooms",
    "tarp",
    "mulberry maids",
    "cloth",
    "microfiber towel",
    "ammonia",
    "oven cleaner",
    "fireplace cleaners",
    "quick n' brite",
    "cream of tartar",
    "vinegar",
    "spray bottle",
    "dish soap",
    "baking soda",
    "all-purpose cleaning spray",
    "409 spray",
    "all purpose spray",
    "small broom",
    "dustpans",
    "litter",
    "scrub brush",
    "abrasive sponge",
    "removing soot",
    "soot",
    "towels",
    "cleaning gloves",
    "vacuum",
    "public health",
    "cleaning expert",
    "small brush",
    "coffee grounds",
    "toothbrush",
    "tap water",
    "paper towels",
    "elbow grease"
  ],
  "tyn_section":[

  ]
}