{
  "title":"How to Hire a Siding Contractor",
  "url":"https://www.wikihow.com/Hire-a-Siding-Contractor",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Walls and Ceilings",
    "Exterior Walls"
  ],
  "steps":[
    {
      "headline":"Find siding contractors in or near your area.",
      "description":"Most siding contractors are listed in the phone book or online. Ask friends, co-workers or neighbors if they have had any siding contractors do work on their house. Get recommendations from them. Visit a siding material supply store or home renovation center and ask for siding contractor referrals."
    },
    {
      "headline":"Interview potential contractors.",
      "description":"Choose 3 contractors and make an appointment with each one to visit your home and explain your needs. Choose 3 contractors and make an appointment with each one to visit your home and explain your needs. Check each siding contractor's license to ensure it is valid. Request a detailed, written quote from each contractor. Inquire about warranties and work guarantees. Get all warranty and guarantee information in writing. Examine each contractor's portfolio. Make sure the contractor is familiar with and has worked on projects using the type of siding you desire. Some contractors may specialize in certain types of siding, such as seamless vinyl or fiber cement siding. Consider each contractor's professional appearance, attitude and willingness to answer questions. The level of professionalism could reflect how seriously the contractor takes his job."
    },
    {
      "headline":"Ask each contractor for references.",
      "description":"Contact each reference and, if possible, visit the homes to view the work done by the siding contractor."
    },
    {
      "headline":"Discuss job details.",
      "description":"Review specific job responsibilities and expectations, such as old material removal, potential problems and time frame for completion. Ask the siding contractor whether he obtains any required permits or if you must get the permits."
    },
    {
      "headline":"Select the contractor who best meets your budget and needs.",
      "description":"Obtain a written and signed contract outlining material costs, labor charges, start date and estimated completion date. Include other matters of interest or concern. Look up reviews on Yelp or similar sites to make sure previous clients are happy with the work they delivered."
    }
  ],
  "text":" Find siding contractors in or near your area. Most siding contractors are listed in the phone book or online. Ask friends, co-workers or neighbors if they have had any siding contractors do work on their house. Get recommendations from them. Visit a siding material supply store or home renovation center and ask for siding contractor referrals. Interview potential contractors. Choose 3 contractors and make an appointment with each one to visit your home and explain your needs. Choose 3 contractors and make an appointment with each one to visit your home and explain your needs. Check each siding contractor's license to ensure it is valid. Request a detailed, written quote from each contractor. Inquire about warranties and work guarantees. Get all warranty and guarantee information in writing. Examine each contractor's portfolio. Make sure the contractor is familiar with and has worked on projects using the type of siding you desire. Some contractors may specialize in certain types of siding, such as seamless vinyl or fiber cement siding. Consider each contractor's professional appearance, attitude and willingness to answer questions. The level of professionalism could reflect how seriously the contractor takes his job. Ask each contractor for references. Contact each reference and, if possible, visit the homes to view the work done by the siding contractor. Discuss job details. Review specific job responsibilities and expectations, such as old material removal, potential problems and time frame for completion. Ask the siding contractor whether he obtains any required permits or if you must get the permits. Select the contractor who best meets your budget and needs. Obtain a written and signed contract outlining material costs, labor charges, start date and estimated completion date. Include other matters of interest or concern. Look up reviews on Yelp or similar sites to make sure previous clients are happy with the work they delivered.",
  "tyn_model":[
    "siding contractor",
    "siding",
    "siding contractors",
    "siding material supply store",
    "home renovation center",
    "fiber cement siding",
    "contractor"
  ],
  "tyn_section":[

  ]
}