{
  "title":"How to Make Butterscotch and Whiskey Brownies",
  "url":"https://www.wikihow.com/Make-Butterscotch-and-Whiskey-Brownies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Brownies"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350ºF or 180ºC.",
      "description":""
    },
    {
      "headline":"Mix the flour, baking powder, salt, and brown sugar together.",
      "description":""
    },
    {
      "headline":"Whisk the butter, milk, vanilla, and egg in a separate small bowl.",
      "description":""
    },
    {
      "headline":"Pour the liquid mixture into the dry mixture bowl.",
      "description":""
    },
    {
      "headline":"Pour in the whiskey and then fold the butterscotch chips in.",
      "description":""
    },
    {
      "headline":"Pour the batter into a greased 9 inch (23 cm) pan.",
      "description":"You may need to use a rubber spatula to help it into the pan and to cover it entirely."
    },
    {
      "headline":"Bake it for 20 minutes; use a toothpick to test the center.",
      "description":"The toothpick should not be completely clean but with very small bits of cookie dough on it."
    },
    {
      "headline":"Let them cool and then cut into squares for presentation.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 350ºF or 180ºC.  Mix the flour, baking powder, salt, and brown sugar together.  Whisk the butter, milk, vanilla, and egg in a separate small bowl.  Pour the liquid mixture into the dry mixture bowl.  Pour in the whiskey and then fold the butterscotch chips in.  Pour the batter into a greased 9 inch (23 cm) pan. You may need to use a rubber spatula to help it into the pan and to cover it entirely. Bake it for 20 minutes; use a toothpick to test the center. The toothpick should not be completely clean but with very small bits of cookie dough on it. Let them cool and then cut into squares for presentation.  Finished. ",
  "tyn_model":[
    "oven",
    "flour",
    "baking powder",
    "salt",
    "brown sugar",
    "butter",
    "milk",
    "vanilla",
    "small bowl",
    "whiskey",
    "butterscotch chips",
    "rubber spatula",
    "toothpick",
    "cookie dough"
  ],
  "tyn_section":[

  ]
}