{
  "title":"How to Tie up Tomatoes",
  "url":"https://www.wikihow.com/Tie-up-Tomatoes",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Vegetables",
    "Growing Tomatoes"
  ],
  "parts":[
    {
      "name":"Choosing the Right Time",
      "steps":[
        {
          "headline":"When your tomatoes are 6–10 inches (15.2–25.4 cm) tall tie them up.",
          "description":"Its best to do this before the plants begin to droop because they can catch diseases from the soil as soon as any leaves touch the ground. Foliage or fruit touching the ground exposes plants to diseases. Tomatoes will be cleaner and easier to collect."
        },
        {
          "headline":"Look for new growth.",
          "description":"Examine your plants as often as daily. Look for the first appearance of blossoms. Check for branches that are sagging. Also look for branches that are straying too far away from the trellis, stake or cage."
        },
        {
          "headline":"Plan to tie branches up throughout the growing season.",
          "description":"You'll need to tie both determinate and indeterminate varieties frequently. However, indeterminate tomato plants will need more attention. Indeterminate tomato plants make branches and foliage until the first killing frost. Determinate tomato plants have a shorter period of production and won't require tying after their primary harvest time."
        }
      ]
    },
    {
      "name":"Selecting a Material",
      "steps":[
        {
          "headline":"Choose a fabric.",
          "description":"Cut or rip old t-shirts or pantyhose. Alternately, use bedsheets or socks. Tear strips of varying lengths. Fabric is soft and stretchable, which allows for expansion as your plants grow. Fabric needs to be collected and properly disposed of after the growing season. Depending on the material, fabric can take anywhere from a year to decades before it fully decomposes."
        },
        {
          "headline":"Use string or twine.",
          "description":"Choose between nylon string or garden twine. Both options are weatherproof, but only certain types of twine are biodegradable. Sisal, hemp and cotton twine are compostable as long as they're untreated. You'll need to collect nylon at the end of the season. It takes decades to decompose on its own. Avoid using fishing line both because it will often cut into your plants and damage them, as well as being a threat to wildlife if you fail to remove it at the end of the growing season."
        },
        {
          "headline":"Use tape.",
          "description":"You can purchase Velcro or otherwise self-gripping garden tape. The advantage of garden tape is that you can tie up your whole tomato plant all at once. Unless “compostable” is stated on the package, assume that the tape is not biodegradable."
        },
        {
          "headline":"Try zip ties.",
          "description":"Purchase foam or plastic garden ties or zip ties. Zip ties are inexpensive. However, none of these options are compostable and will need to be collected at the end of the growing season. Another disadvantage to ties is that they don't have any expansion capability, so they can cut into the plants if they're applied too tightly, or the plants grow significantly. Foam ties provide cushion so that the ties are less likely to cut into the plant."
        }
      ]
    },
    {
      "name":"Applying the Ties",
      "steps":[
        {
          "headline":"Stake and tie young plants.",
          "description":"Drive a stake about a foot into the ground near each plant. Use wood, bamboo or plastic stakes, or make your own stakes with scrap materials. Tie a loose loop around the plant stem, and a knot around the stake. Stake and tie plants as soon as you transplant seedlings, or shortly thereafter."
        },
        {
          "headline":"Use a roll to tie up a whole plant at once.",
          "description":"Use gardening tape or twine. Secure the end of the roll to one of the lower branches. Starting at the bottom, circle the entire plant with the tape or string. Finish by tying a knot at the top of the support structure. This method is useful for plants bigger than three feet. As you wrap, place the tape or string at the strongest part of each branch, and wrap it around the cage wire or stake before moving upwards."
        },
        {
          "headline":"Secure the stalk.",
          "description":"Tie a string in a double knot around the stake. Find a part of the stalk that is just beneath a branch. Tie a loose double knot around the stalk of the plant. Tying a knot beneath a branch prevents downward slippage. Do this for every ten to twelve inches of growth."
        },
        {
          "headline":"Tie up individual branches.",
          "description":"Find the lower, beefy part of the branch which is below the fork. Wrap your tie around that part of the branch. Tie a double knot. Reach your tie around the tomato's support system, and tie another double knot there. Do this gently and carefully. Don't pull the knots or the line very tight."
        },
        {
          "headline":"You might also try the stake and weave method.",
          "description":"For a long row of plants, place a stake in the ground between each one and at each end of the rows. Then, tie the garden twine off at the stake at one end and weave it back and forth between the plants and stakes, tying it off tightly to each stake when you get to it. Then repeat weaving the other way."
        }
      ]
    }
  ],
  "text":" Choosing the Right Time When your tomatoes are 6–10 inches (15.2–25.4 cm) tall tie them up. Its best to do this before the plants begin to droop because they can catch diseases from the soil as soon as any leaves touch the ground. Foliage or fruit touching the ground exposes plants to diseases. Tomatoes will be cleaner and easier to collect. Look for new growth. Examine your plants as often as daily. Look for the first appearance of blossoms. Check for branches that are sagging. Also look for branches that are straying too far away from the trellis, stake or cage. Plan to tie branches up throughout the growing season. You'll need to tie both determinate and indeterminate varieties frequently. However, indeterminate tomato plants will need more attention. Indeterminate tomato plants make branches and foliage until the first killing frost. Determinate tomato plants have a shorter period of production and won't require tying after their primary harvest time. Selecting a Material Choose a fabric. Cut or rip old t-shirts or pantyhose. Alternately, use bedsheets or socks. Tear strips of varying lengths. Fabric is soft and stretchable, which allows for expansion as your plants grow. Fabric needs to be collected and properly disposed of after the growing season. Depending on the material, fabric can take anywhere from a year to decades before it fully decomposes. Use string or twine. Choose between nylon string or garden twine. Both options are weatherproof, but only certain types of twine are biodegradable. Sisal, hemp and cotton twine are compostable as long as they're untreated. You'll need to collect nylon at the end of the season. It takes decades to decompose on its own. Avoid using fishing line both because it will often cut into your plants and damage them, as well as being a threat to wildlife if you fail to remove it at the end of the growing season. Use tape. You can purchase Velcro or otherwise self-gripping garden tape. The advantage of garden tape is that you can tie up your whole tomato plant all at once. Unless “compostable” is stated on the package, assume that the tape is not biodegradable. Try zip ties. Purchase foam or plastic garden ties or zip ties. Zip ties are inexpensive. However, none of these options are compostable and will need to be collected at the end of the growing season. Another disadvantage to ties is that they don't have any expansion capability, so they can cut into the plants if they're applied too tightly, or the plants grow significantly. Foam ties provide cushion so that the ties are less likely to cut into the plant. Applying the Ties Stake and tie young plants. Drive a stake about a foot into the ground near each plant. Use wood, bamboo or plastic stakes, or make your own stakes with scrap materials. Tie a loose loop around the plant stem, and a knot around the stake. Stake and tie plants as soon as you transplant seedlings, or shortly thereafter. Use a roll to tie up a whole plant at once. Use gardening tape or twine. Secure the end of the roll to one of the lower branches. Starting at the bottom, circle the entire plant with the tape or string. Finish by tying a knot at the top of the support structure. This method is useful for plants bigger than three feet. As you wrap, place the tape or string at the strongest part of each branch, and wrap it around the cage wire or stake before moving upwards. Secure the stalk. Tie a string in a double knot around the stake. Find a part of the stalk that is just beneath a branch. Tie a loose double knot around the stalk of the plant. Tying a knot beneath a branch prevents downward slippage. Do this for every ten to twelve inches of growth. Tie up individual branches. Find the lower, beefy part of the branch which is below the fork. Wrap your tie around that part of the branch. Tie a double knot. Reach your tie around the tomato's support system, and tie another double knot there. Do this gently and carefully. Don't pull the knots or the line very tight. You might also try the stake and weave method. For a long row of plants, place a stake in the ground between each one and at each end of the rows. Then, tie the garden twine off at the stake at one end and weave it back and forth between the plants and stakes, tying it off tightly to each stake when you get to it. Then repeat weaving the other way.",
  "tyn_model":[
    "fabric",
    "tape",
    "twine",
    "zip ties",
    "stakes",
    "tomatoes",
    "garden twine",
    "garden tape",
    "stake",
    "string",
    "tie",
    "nylon string",
    "cotton twine",
    "nylon",
    "fishing line",
    "“compostable",
    "” is",
    "garden ties",
    "ties",
    "foam ties",
    "gardening tape",
    "fork",
    "tomato"
  ],
  "tyn_section":[

  ]
}