{
  "title":"How to Clean Drywall Dust",
  "url":"https://www.wikihow.com/Clean-Drywall-Dust",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "Dusting"
  ],
  "methods":[
    {
      "name":"Preparing the Area",
      "steps":[
        {
          "headline":"Block off all vents and openings with plastic sheeting.",
          "description":"Heavy-duty plastic sheeting helps to minimize how much dust gets dispersed through the air. Cover all the openings throughout your home, such as doorways and windows, with it. For best results, hang the sheeting from floor to ceiling. Cover all of the air vents and ductwork. Secure the plastic sheeting with masking tape."
        },
        {
          "headline":"Cover the floor and protect the furniture.",
          "description":"Move as much furniture out of the way as you can. Cover what can’t be moved with plastic sheeting, especially upholstered furniture, since the dust can work itself into the fabric. Secure the sheeting in place with bungee cords. Place plastic sheeting over the entire floor of your work area. If you have carpet in the rest of the house, consider covering the floors in every room with self-adhesive plastic lining."
        },
        {
          "headline":"Turn off the central heat and air circulation.",
          "description":"Leaving the system on will result in drywall dust getting into it, which will then spread throughout your home. Even though you’re covering all of the air ducts with plastic sheeting before you begin, it is still beneficial to turn off the circulation system. Be sure to leave the circulation system off until you’ve completed your task and cleaned up the dust afterward. Check your system’s air filter frequently in the weeks following the sanding. You will probably need to replace it soon after."
        },
        {
          "headline":"Place box fans in the windows.",
          "description":"Using box fans will help keep the room you are working in ventilated. Open the windows and place the box fans in them. Be sure to position the box fans so that air blows out of the room, not into it. Use plastic sheeting to seal off the area around the fans and window frames. Duct tape the plastic in place. If any of the windows have air conditioning units in them, remove them from the room. They get clogged with dust easily. Use the box fans on a low setting, which will cause the least air disturbance. Setting them on high will suck out a lot of the dust, but it will also increase the amount that’s moving through the air."
        },
        {
          "headline":"Remove the door and window screens.",
          "description":"This will allow the dust to move freely from inside to outside. It also improves the air circulation in the area. Not removing the screens will trap a lot of the dust in the room. You’ll also have to remove drywall dust from the screens after you’ve finished sanding."
        }
      ]
    },
    {
      "name":"Controlling the Dust While Sanding",
      "steps":[
        {
          "headline":"Take breaks to clean.",
          "description":"Because the dust is so pervasive, remove as much as you can before it has a chance to build up. It’s not ideal, but cleaning frequently throughout the project can help you reduce a lot of dust. How often you stop to clean is up to you, but at minimum you need to clean at least once per day. Wipe down surfaces with a microfiber towel or a damp cloth. Use a vacuum cleaner to get up the dust on the floor. Do not remove your face mask during cleaning. Breathing in drywall dust can cause serious health problems. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tBe sure to wear proper safety gear. Before you clean up drywall dust, it's important that you have on gloves and a facemask. You should also open the windows for ventilation."
        },
        {
          "headline":"Limit access to the work area.",
          "description":"Dry wall dust is such a fine powder that simply walking around in the work area stirs it up. Even after you’ve stopped sanding, the dust hangs in the air for quite a while. Walking through pushes it around in the air. The more people walk through the area, the faster the dust will spread. Restrict the work area to only others working on the project."
        },
        {
          "headline":"Designate one entryway.",
          "description":"It’s going to be difficult not to track dust in and out of the work area, so choose one entrance and seal the other entryways off. Lay a mat in front of the entrance. A mat isn’t going to make a huge difference, but at the very least you can reduce tracking dust by wiping the soles of your shoes off before leaving the area. If you’re doing work in your own home, removing your shoes and leaving them behind will help."
        }
      ]
    },
    {
      "name":"Cleaning Up After the Job",
      "steps":[
        {
          "headline":"Sweep first.",
          "description":"Start from the exterior and work your way to the center of the room. Take your time and sweep with gentle strokes to avoid stirring up the dust more than you have to. Use a dustpan to scoop up the dust pile and place it in a trash bag. Tie the bag up immediately to seal the dust in. If you are working with a significant amount of dusk, there are products you can buy that will help the dust cling to the floor. This will make it easier to sweep up. You can buy sweeping compound products at any home improvement store. They are usually sold in bags or buckets. The compound itself has a dust/sawdust-like consistency. To use, shake the compound over the floor where you want to sweep. It holds the dust down to the floor so that you can sweep it up more easily. Many of the products require 24 hours to settle over the dust before you can sweep it, so read the instructions carefully. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tSweep very gently so you don't send the dust into the air. Sweep the bulk of the dust into a pile on the floor and collect it into a garbage bag. It's important to sweep and pick up the dust slowly—drywall dust is very fine, and being too aggressive will cause the dust to go everywhere in the room. Repeat the sweeping until there's only residue remaining."
        },
        {
          "headline":"Vacuum the floors.",
          "description":"The most effective vacuum for this job is a wet/dry vacuum, also known as a Shopvac. If you don’t own one already, many home improvement stores rent them out. Use vacuum bags that are made specifically for collecting dry wall dust. For the finer particles, use a HEPA filter. The filters can get clogged so, if possible, use a filter that can be washed and reused. It’s also wise to have a back-up filter on hand, just in case. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tOur Expert Agrees:' Use an industrial vacuum cleaner, if possible, to vacuum up the drywall dust, and use an attachment to get to hard-to-reach areas like corners, shelves, and between floorboards.. A small or weak vacuum will not be effective in getting the dust out, and it's likely to damage the vacuum. Repeat the vacuuming as much as possible, changing the filter as needed."
        },
        {
          "headline":"Wipe everything down with a damp microfiber cloth.",
          "description":"Fill a bucket with cool water. Dip the cloth in the water and wring it out well – a soaking wet cloth can damage fresh drywall. Start at the top of the walls and work your way down. You’ll need to rinse and wring out the cloth often. Change the water in the bucket as soon as it gets cloudy. After the walls, wipe down every horizontal surface in the room. This includes baseboards, light fixtures, outlet covers, etc."
        },
        {
          "headline":"Vacuum a second time.",
          "description":"Insert a brush attachment for the second pass. Brush attachments help to get in the nooks and crannies. It also has a hose attached that will allow you to vacuum the walls. Start at the top and vacuum your way down to the bottom. After the walls, vacuum the floor again. You’ll will probably need to vacuum in the corners of the room and over the joints twice."
        },
        {
          "headline":"Spot clean with a damp microfiber cloth.",
          "description":"Check the room and wipe up any lingering dust that you see. Run the cloth over the baseboards and window ledges one more time. If you want to be extra vigilant, damp mop the floor as a final step. Make sure you’re using clean water in the bucket, even for the final wipe down."
        }
      ]
    }
  ],
  "text":" Preparing the Area Block off all vents and openings with plastic sheeting. Heavy-duty plastic sheeting helps to minimize how much dust gets dispersed through the air. Cover all the openings throughout your home, such as doorways and windows, with it. For best results, hang the sheeting from floor to ceiling. Cover all of the air vents and ductwork. Secure the plastic sheeting with masking tape. Cover the floor and protect the furniture. Move as much furniture out of the way as you can. Cover what can’t be moved with plastic sheeting, especially upholstered furniture, since the dust can work itself into the fabric. Secure the sheeting in place with bungee cords. Place plastic sheeting over the entire floor of your work area. If you have carpet in the rest of the house, consider covering the floors in every room with self-adhesive plastic lining. Turn off the central heat and air circulation. Leaving the system on will result in drywall dust getting into it, which will then spread throughout your home. Even though you’re covering all of the air ducts with plastic sheeting before you begin, it is still beneficial to turn off the circulation system. Be sure to leave the circulation system off until you’ve completed your task and cleaned up the dust afterward. Check your system’s air filter frequently in the weeks following the sanding. You will probably need to replace it soon after. Place box fans in the windows. Using box fans will help keep the room you are working in ventilated. Open the windows and place the box fans in them. Be sure to position the box fans so that air blows out of the room, not into it. Use plastic sheeting to seal off the area around the fans and window frames. Duct tape the plastic in place. If any of the windows have air conditioning units in them, remove them from the room. They get clogged with dust easily. Use the box fans on a low setting, which will cause the least air disturbance. Setting them on high will suck out a lot of the dust, but it will also increase the amount that’s moving through the air. Remove the door and window screens. This will allow the dust to move freely from inside to outside. It also improves the air circulation in the area. Not removing the screens will trap a lot of the dust in the room. You’ll also have to remove drywall dust from the screens after you’ve finished sanding. Controlling the Dust While Sanding Take breaks to clean. Because the dust is so pervasive, remove as much as you can before it has a chance to build up. It’s not ideal, but cleaning frequently throughout the project can help you reduce a lot of dust. How often you stop to clean is up to you, but at minimum you need to clean at least once per day. Wipe down surfaces with a microfiber towel or a damp cloth. Use a vacuum cleaner to get up the dust on the floor. Do not remove your face mask during cleaning. Breathing in drywall dust can cause serious health problems. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tBe sure to wear proper safety gear. Before you clean up drywall dust, it's important that you have on gloves and a facemask. You should also open the windows for ventilation. Limit access to the work area. Dry wall dust is such a fine powder that simply walking around in the work area stirs it up. Even after you’ve stopped sanding, the dust hangs in the air for quite a while. Walking through pushes it around in the air. The more people walk through the area, the faster the dust will spread. Restrict the work area to only others working on the project. Designate one entryway. It’s going to be difficult not to track dust in and out of the work area, so choose one entrance and seal the other entryways off. Lay a mat in front of the entrance. A mat isn’t going to make a huge difference, but at the very least you can reduce tracking dust by wiping the soles of your shoes off before leaving the area. If you’re doing work in your own home, removing your shoes and leaving them behind will help. Cleaning Up After the Job Sweep first. Start from the exterior and work your way to the center of the room. Take your time and sweep with gentle strokes to avoid stirring up the dust more than you have to. Use a dustpan to scoop up the dust pile and place it in a trash bag. Tie the bag up immediately to seal the dust in. If you are working with a significant amount of dusk, there are products you can buy that will help the dust cling to the floor. This will make it easier to sweep up. You can buy sweeping compound products at any home improvement store. They are usually sold in bags or buckets. The compound itself has a dust/sawdust-like consistency. To use, shake the compound over the floor where you want to sweep. It holds the dust down to the floor so that you can sweep it up more easily. Many of the products require 24 hours to settle over the dust before you can sweep it, so read the instructions carefully. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tSweep very gently so you don't send the dust into the air. Sweep the bulk of the dust into a pile on the floor and collect it into a garbage bag. It's important to sweep and pick up the dust slowly—drywall dust is very fine, and being too aggressive will cause the dust to go everywhere in the room. Repeat the sweeping until there's only residue remaining. Vacuum the floors. The most effective vacuum for this job is a wet/dry vacuum, also known as a Shopvac. If you don’t own one already, many home improvement stores rent them out. Use vacuum bags that are made specifically for collecting dry wall dust. For the finer particles, use a HEPA filter. The filters can get clogged so, if possible, use a filter that can be washed and reused. It’s also wise to have a back-up filter on hand, just in case. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRaymond Chiu\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\t\t\t\t\tRaymond Chiu is the Director of Operations for MaidSailors.com, a residential and commercial cleaning service based in New York City that provides home and office cleaning services at affordable prices. He has a Bachelors in Business Administration and Management from Baruch College. Raymond Chiu\t\t\tCleaning Guru & Director of Operations, Maid Sailors\t\t\t\tOur Expert Agrees:' Use an industrial vacuum cleaner, if possible, to vacuum up the drywall dust, and use an attachment to get to hard-to-reach areas like corners, shelves, and between floorboards.. A small or weak vacuum will not be effective in getting the dust out, and it's likely to damage the vacuum. Repeat the vacuuming as much as possible, changing the filter as needed. Wipe everything down with a damp microfiber cloth. Fill a bucket with cool water. Dip the cloth in the water and wring it out well – a soaking wet cloth can damage fresh drywall. Start at the top of the walls and work your way down. You’ll need to rinse and wring out the cloth often. Change the water in the bucket as soon as it gets cloudy. After the walls, wipe down every horizontal surface in the room. This includes baseboards, light fixtures, outlet covers, etc. Vacuum a second time. Insert a brush attachment for the second pass. Brush attachments help to get in the nooks and crannies. It also has a hose attached that will allow you to vacuum the walls. Start at the top and vacuum your way down to the bottom. After the walls, vacuum the floor again. You’ll will probably need to vacuum in the corners of the room and over the joints twice. Spot clean with a damp microfiber cloth. Check the room and wipe up any lingering dust that you see. Run the cloth over the baseboards and window ledges one more time. If you want to be extra vigilant, damp mop the floor as a final step. Make sure you’re using clean water in the bucket, even for the final wipe down.",
  "tyn_model":[
    "vacuum",
    "plastic sheeting",
    "dust",
    "drywall dust",
    "box fans",
    "water",
    "bucket",
    "vacuum cleaner",
    "mat",
    "filter",
    "microfiber cloth",
    "brush",
    "heavy-duty plastic sheeting",
    "sheeting",
    "masking tape",
    "self-adhesive plastic lining",
    "air filter",
    "air conditioning",
    "microfiber towel",
    "face mask",
    "cleaning guru",
    "gloves",
    "facemask",
    "dry wall dust",
    "dustpan",
    "trash bag",
    "sweeping compound",
    "home improvement store",
    "garbage bag",
    "—drywall",
    "vacuum bags",
    "hepa filter",
    "baruch college",
    "maid sailors\t\t\t\tour",
    "– a",
    "hose"
  ],
  "tyn_section":[

  ]
}