{
  "title":"How to Make Curly Fries",
  "url":"https://www.wikihow.com/Make-Curly-Fries",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals",
    "Fast Food"
  ],
  "methods":[
    {
      "name":"Cutting the Fries",
      "steps":[
        {
          "headline":"Start with the correct potato.",
          "description":"A potato with high starch and lower water content will always be best for french fries. Try using russet potatoes that are slightly older, if possible. To help maintain uniform shape, pick larger, evenly shaped potatoes."
        },
        {
          "headline":"Peel the fries.",
          "description":"Using a vegetable peeler or a paring knife, cut the skin off the potato moving the knife away from you. Remove any bruised and unsightly potato bits with a knife. Peeling is optional with fries. Keeping the skin on will keep them looking rustic, but peeling the skin away will leave your fries looking more even."
        },
        {
          "headline":"Put the fries through your cutter.",
          "description":"After the potatoes are prepared, run the fries through your curly fry cutter. This often involves wedging the potato between the slicer and the handle. Rotate the handle to force the potato through the slicer. Different models may vary but should be used roughly in the same way. Use a mandolin or fry cutter that contains a slicer for curly fries. This allows you to simply wash the potatoes and put them through the cutter. This equipment is available at most department stores and online."
        },
        {
          "headline":"Soak your fries in a bowl of cold water.",
          "description":"Soaking your fries in water removes excess starch and prevents the fries from getting stuck together. Soak your fries for five minutes and strain. Place them on a plate in a single layer then pat them with paper towels. Let them lay out for a few minutes to air dry."
        }
      ]
    },
    {
      "name":"Using a Deep Fryer",
      "steps":[
        {
          "headline":"Wash and rinse your cut fries in advance.",
          "description":"Allowing them to completely air dry will keep the oil from sputtering if you choose to deep fry them. Water can be very dangerous when introduced into oil so the less water you add to the frying oil, the better."
        },
        {
          "headline":"Blanch the fries in oil.",
          "description":"Blanching is a technique that uses lower-temperature oil for a long duration during frying. This ensures that the potato will be cooked all the way through. To blanch, heat the oil on a medium-low setting. Add your fries and cook for approximately eight minutes. When the fries make a “screaming” noise, they are ready to come out. The screeching is the sound of air whistling out of the inside as they cook. The fries shouldn’t be browned, but will be edible. Upon removing, allow the fries to drain on a paper towel to remove excess oil. When deep frying, use a deep pot or wok with a thick bottom. Fill it halfway with vegetable oil and allow to heat completely before using. Frying can be made much easier with the use of a frying thermometer. This will allow you to control the temperature more accurately. When blanching, ideal oil temperature should be 250 degrees Fahrenheit (121 Celsius)."
        },
        {
          "headline":"Allow the fries to rest.",
          "description":"Give the fries time to cool before frying a second time. For a quick turnaround, put them on a pan in a single layer inside the freezer. Otherwise, allow them to rest in the fridge overnight in a paper-towel lined sheet. No matter the method, allow the fries to come back to room temperature before the second frying. This allows even cooking."
        },
        {
          "headline":"Quick-fry the blanched fries.",
          "description":"Heat the oil to 325-350 degrees Fahrenheit (160 - 175 Celsius). Add the blanched fries to the oil in small batches to prevent over crowding. Cook for three to five minutes or until the fries are golden brown in color. Remove and pat excess oil off using paper towel. Serve immediately. Season with kosher salt, garlic salt, or seasoning salt."
        }
      ]
    },
    {
      "name":"Baking the Fries",
      "steps":[
        {
          "headline":"Toss in olive oil.",
          "description":"Toss the fries in a generous amount of olive oil. Keep tossing until all fries have an even coating of oil. If you’d like to spice your fries, now is an ideal time. Try using salt, pepper, garlic salt and chili powder. Arrange the fries in a single layer on a cookie sheet. Use more baking sheets and less fries per sheet. Keep the fries from touching one another to help them become crispy and cook evenly."
        },
        {
          "headline":"Heat the oven to 450 Fahrenheit (230 Celsius).",
          "description":"Wait for your oven to preheat. It may be tempting to put the fries in and be done with it, but wait. Allowing the oven to complete preheat means your fries will cook evenly and prevents them from getting soggy."
        },
        {
          "headline":"Bake for 15 minutes and flip.",
          "description":"After the fries bake for 15 minutes, give them a good flip. Either toss them in the pan or use a flipper to move them around. The flip will keep both sides of the fries browning and even crispiness."
        },
        {
          "headline":"Bake to preferred crispiness.",
          "description":"Generally, after flipping initially, your fries will need another 10-15 minutes baking time. When your fries are the desired golden brown, you know they are finished. Remove your fries from the oven and allow them to cool slightly before serving. Turn the oven to broil for the last few minutes if you desire extra crispiness. This will quickly give the fries a very deep brown color."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    },
    {
      "name":"Making Spiral Potatoes or Chips on a Stick",
      "steps":[
        {
          "headline":"Take a medium-sized potato and thread it onto a skewer.",
          "description":""
        },
        {
          "headline":"Slice the potato into small spirals by carefully rotating the potato.",
          "description":"Make sure the spirals are of same size so that they look good when you stretch them."
        },
        {
          "headline":"Spread it out.",
          "description":"Carefully spread the potato out onto the skewer."
        },
        {
          "headline":"Place them on an oven tray and drizzle some oil over it.",
          "description":"You may also add some salt and spices to it depending on how you want your potatoes to be."
        },
        {
          "headline":"Place them on the oven and let them sit in the oven until they're golden brown.",
          "description":"Bake them at 160 C for 25 minutes. The time may vary depending on the thickness of your slices."
        },
        {
          "headline":"Ready to eat.",
          "description":"You may serve it with a healthy meal or to accompany your burger."
        }
      ]
    }
  ],
  "text":" Cutting the Fries Start with the correct potato. A potato with high starch and lower water content will always be best for french fries. Try using russet potatoes that are slightly older, if possible. To help maintain uniform shape, pick larger, evenly shaped potatoes. Peel the fries. Using a vegetable peeler or a paring knife, cut the skin off the potato moving the knife away from you. Remove any bruised and unsightly potato bits with a knife. Peeling is optional with fries. Keeping the skin on will keep them looking rustic, but peeling the skin away will leave your fries looking more even. Put the fries through your cutter. After the potatoes are prepared, run the fries through your curly fry cutter. This often involves wedging the potato between the slicer and the handle. Rotate the handle to force the potato through the slicer. Different models may vary but should be used roughly in the same way. Use a mandolin or fry cutter that contains a slicer for curly fries. This allows you to simply wash the potatoes and put them through the cutter. This equipment is available at most department stores and online. Soak your fries in a bowl of cold water. Soaking your fries in water removes excess starch and prevents the fries from getting stuck together. Soak your fries for five minutes and strain. Place them on a plate in a single layer then pat them with paper towels. Let them lay out for a few minutes to air dry. Using a Deep Fryer Wash and rinse your cut fries in advance. Allowing them to completely air dry will keep the oil from sputtering if you choose to deep fry them. Water can be very dangerous when introduced into oil so the less water you add to the frying oil, the better. Blanch the fries in oil. Blanching is a technique that uses lower-temperature oil for a long duration during frying. This ensures that the potato will be cooked all the way through. To blanch, heat the oil on a medium-low setting. Add your fries and cook for approximately eight minutes. When the fries make a “screaming” noise, they are ready to come out. The screeching is the sound of air whistling out of the inside as they cook. The fries shouldn’t be browned, but will be edible. Upon removing, allow the fries to drain on a paper towel to remove excess oil. When deep frying, use a deep pot or wok with a thick bottom. Fill it halfway with vegetable oil and allow to heat completely before using. Frying can be made much easier with the use of a frying thermometer. This will allow you to control the temperature more accurately. When blanching, ideal oil temperature should be 250 degrees Fahrenheit (121 Celsius). Allow the fries to rest. Give the fries time to cool before frying a second time. For a quick turnaround, put them on a pan in a single layer inside the freezer. Otherwise, allow them to rest in the fridge overnight in a paper-towel lined sheet. No matter the method, allow the fries to come back to room temperature before the second frying. This allows even cooking. Quick-fry the blanched fries. Heat the oil to 325-350 degrees Fahrenheit (160 - 175 Celsius). Add the blanched fries to the oil in small batches to prevent over crowding. Cook for three to five minutes or until the fries are golden brown in color. Remove and pat excess oil off using paper towel. Serve immediately. Season with kosher salt, garlic salt, or seasoning salt. Baking the Fries Toss in olive oil. Toss the fries in a generous amount of olive oil. Keep tossing until all fries have an even coating of oil. If you’d like to spice your fries, now is an ideal time. Try using salt, pepper, garlic salt and chili powder. Arrange the fries in a single layer on a cookie sheet. Use more baking sheets and less fries per sheet. Keep the fries from touching one another to help them become crispy and cook evenly. Heat the oven to 450 Fahrenheit (230 Celsius). Wait for your oven to preheat. It may be tempting to put the fries in and be done with it, but wait. Allowing the oven to complete preheat means your fries will cook evenly and prevents them from getting soggy. Bake for 15 minutes and flip. After the fries bake for 15 minutes, give them a good flip. Either toss them in the pan or use a flipper to move them around. The flip will keep both sides of the fries browning and even crispiness. Bake to preferred crispiness. Generally, after flipping initially, your fries will need another 10-15 minutes baking time. When your fries are the desired golden brown, you know they are finished. Remove your fries from the oven and allow them to cool slightly before serving. Turn the oven to broil for the last few minutes if you desire extra crispiness. This will quickly give the fries a very deep brown color. Finished.  Making Spiral Potatoes or Chips on a Stick Take a medium-sized potato and thread it onto a skewer.  Slice the potato into small spirals by carefully rotating the potato. Make sure the spirals are of same size so that they look good when you stretch them. Spread it out. Carefully spread the potato out onto the skewer. Place them on an oven tray and drizzle some oil over it. You may also add some salt and spices to it depending on how you want your potatoes to be. Place them on the oven and let them sit in the oven until they're golden brown. Bake them at 160 C for 25 minutes. The time may vary depending on the thickness of your slices. Ready to eat. You may serve it with a healthy meal or to accompany your burger.",
  "tyn_model":[
    "potato",
    "oil",
    "oven",
    "potatoes",
    "water",
    "knife",
    "paper towel",
    "pan",
    "garlic salt",
    "olive oil",
    "french fries",
    "russet potatoes",
    "vegetable peeler",
    "paring knife",
    "fries",
    "curly fry cutter",
    "slicer",
    "mandolin",
    "fry cutter",
    "bowl",
    "plate",
    "paper towels",
    "deep fryer",
    "frying oil",
    "“screaming",
    "” noise",
    "pot",
    "wok",
    "vegetable oil",
    "frying thermometer",
    "freezer",
    "fridge",
    "kosher salt",
    "seasoning salt",
    "salt",
    "pepper",
    "chili powder",
    "cookie sheet",
    "baking sheets",
    "flipper",
    "skewer",
    "oven tray"
  ],
  "tyn_section":[

  ]
}