{
  "title":"How to Replace a Water Heater",
  "url":"https://www.wikihow.com/Replace-a-Water-Heater",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling",
    "Heating Systems"
  ],
  "methods":[
    {
      "name":"Planning and Preparation",
      "steps":[
        {
          "headline":"Know when your water heater needs to be replaced.",
          "description":"Water heaters will usually last somewhere between 8 to 15 years. If your water heater has stopped working, there's a good chance that it will need to be replaced. If you notice water dripping from the bottom of your tank or sitting in a rusty pool beneath it, this means that the steel tank has rusted through. This kind of damage is not fixable and the tank will need to be replaced. However, if you are experiencing problems such as insufficient or no hot water, your heater may just need to be fixed rather than replaced. If you're unsure what the problem is, call a professional plumber."
        },
        {
          "headline":"Call your local plumbing inspector.",
          "description":"Plumbing codes vary by region, so it's a good idea to call your local plumbing inspector to find out the specific requirements for your area and whether you need to get a permit before replacing your heater. It is also a good idea to provide a description of the new water heater and the materials you intend to use while installing it. The plumbing inspector may have some useful feedback or advice that will help you with your installation. If this is your first time replacing a water heater and you are concerned with safety, you can request for a local plumbing or electrical inspector to check your work."
        },
        {
          "headline":"Gather your tools and materials.",
          "description":"Replacing a water heater requires quite a number of tools and materials. You can save yourself time and frustration if you have all of the necessary items lined up and ready to go before you begin. Although the exact items will vary according to the type of water heater, the following guide should help:\n\nTools: screwdriver, adjustable wrench, pipe wrench, tube cutter, wire stripper/cutter electrical tape, plumbers tape, carpenter's level, tape measure, rags and safety glasses. Materials: new gas (or electric) water heater, water and gas piping, fittings, solder, pressure relief valve, discharge pipe, pipe thread compound, venting pipe and connectors."
        }
      ]
    },
    {
      "name":"Removing the Old Water Heater",
      "steps":[
        {
          "headline":"Turn off the gas supply.",
          "description":"The first step is to turn off the gas supply. You can do this by turning the gas shutoff valve by hand or using an adjustable wrench. When the gas is off, the valve handle should be at a right angle to the pipe. Check the pilot light to make sure it's out. Smell for the presence of gas before proceeding. If you're replacing an electric heater, remove the fuse or turn off the circuit breaker to cut off power to the water heater."
        },
        {
          "headline":"Drain the tank.",
          "description":"Switch off off the water supply by turning the shutoff valve on the cold water supply line. Start draining the tank by opening a hot water faucet on the lowest floor of the house. This will make the tank lighter and easier to move. Connect a hose to the drain valve on the tank and slowly open the valve. Allow the water to run off into a nearby drain or bucket. Be very careful, as the water may be scalding hot."
        },
        {
          "headline":"Disconnect the gas and water lines.",
          "description":"Once the tank has been drained, the next step is to disconnect the gas and water lines. Use two pipe wrenches to disconnect the gas line at the union or flare fitting. Then use a pipe wrench to unscrew the pipe from the gas control valve. If you have an electric water heater, simply disconnect the electrical service. Disconnect the hot and cold water lines. If the pipes have been soldered into place, you will need to cut them using a tubing cutter or a hacksaw. Try to ensure that the cuts are as straight as possible. Detach the vent from the water heater by removing the screws which connect the two. Push the vent pipe to one side."
        },
        {
          "headline":"Remove and discard the old tank.",
          "description":"Now that the old tank has been fully disconnected, carefully slide it out of the way. You may need some help doing this as older water heaters are often filled with sediment, making them very heavy. If your water heater is in the basement, consider renting an appliance dolly to help you bring the new heater down and the old heater up. Dispose of the old water heater safely and legally. Contact a local waste management department or sanitation agency for instructions on how to recycle a water heater. Most states have current laws prohibiting the dumping of appliances such as water heaters in dumps or landfills."
        }
      ]
    },
    {
      "name":"Installing the New Water Heater",
      "steps":[
        {
          "headline":"Set the new water heater in place.",
          "description":"Wipe up any pooled water from the floor, then move the new water heater into position. Twist the heater around so that the plumbing locations are lined up with the appropriate pipes. Use a carpenter's level to ensure that the heater is sitting straight. Use some wooden shims to adjust the level if necessary."
        },
        {
          "headline":"Install the temperature and pressure relief valve.",
          "description":"Wrap a couple of layers of Teflon tape around the threads of the new temperature and pressure relief valve (included with your water heater) and use a pipe wrench or pliers to screw it tightly into place. Attach the discharge drain pipe."
        },
        {
          "headline":"Attach the pipe assemblies.",
          "description":"Take two six inch lengths of ⁄4 inch (1.9 cm) copper pipe and attach a new adapter to each of them. Solder the adapters to the pipes at a work surface away from the water heater, as you don't want to place a heat source too close to the tank. Attach the adapters to the hot water output and cold water input at the top of the tank using pipe joint compound or Teflon tape. Some local plumbing codes will also require you to attach plastic lined nipples to the bottom of each pipe assembly. This prevents galvanic corrosion, something which is particular important in hard water areas."
        },
        {
          "headline":"Connect the hot and cold water lines.",
          "description":"To connect the hot and cold water lines, cut or extend the old pipes so they reach the newly connected ones. Solder the two edges of pipe together, using copper slip couplings or dielectric unions (to prevent electrolysis). If you can't get the old and new pipes to align properly, connect them using pieces of flexible copper pipes or 45 degree elbows."
        },
        {
          "headline":"Reattach the vent.",
          "description":"Grab the vent pipe and position it directly above the draft hood on the water heater. Use ⁄8 inch (1.0 cm) sheet metal screws to secure it tightly in place."
        },
        {
          "headline":"Connect the gas line.",
          "description":"Before you reassemble the gas line, clean the threaded ends of the pipes with a wire brush and rag, then apply a little piping compound to each. Use two pipe wrenches to screw the first nipple into the gas valve, then continue to reassemble the remaining fittings. The last connection should be the union fitting, as this connects the new line to the old. Once this is connected, you can turn on the gas supply valve. To connect electric heaters to their power supply, reconnect the power lines and ground wire to the junction box."
        },
        {
          "headline":"Check for leaks.",
          "description":"You can check for leaks by soaking a sponge in soapy water (made with dishwashing soap) and holding it against each newly connected joint on the water heater. If there's a leak, soap bubbles will form on the surface of the sponge. If this happens, you will need to tighten or reconnect the joints, or a call a professional plumber. If there are no bubbles, the joints are secure and you are free to turn on the water and power supply."
        },
        {
          "headline":"Refill the tank.",
          "description":"Turn on the main water supply and the cold water supply valve to start refilling the tank. Turn on a remote hot water faucet -- at first nothing may come out, or the water will splutter. Once a full flow of water is running from the faucet, the tank has been refilled."
        },
        {
          "headline":"Turn the power back on.",
          "description":"You can turn the new water heater on by lighting the pilot and setting the control knob to \"on\". Set the temperature somewhere between 110 and 130 degrees Fahrenheit. If your water heater is electric, turn the power on by reinstalling the fuse or resetting the circuit breaker in the power panel."
        }
      ]
    }
  ],
  "text":" Planning and Preparation Know when your water heater needs to be replaced. Water heaters will usually last somewhere between 8 to 15 years. If your water heater has stopped working, there's a good chance that it will need to be replaced. If you notice water dripping from the bottom of your tank or sitting in a rusty pool beneath it, this means that the steel tank has rusted through. This kind of damage is not fixable and the tank will need to be replaced. However, if you are experiencing problems such as insufficient or no hot water, your heater may just need to be fixed rather than replaced. If you're unsure what the problem is, call a professional plumber. Call your local plumbing inspector. Plumbing codes vary by region, so it's a good idea to call your local plumbing inspector to find out the specific requirements for your area and whether you need to get a permit before replacing your heater. It is also a good idea to provide a description of the new water heater and the materials you intend to use while installing it. The plumbing inspector may have some useful feedback or advice that will help you with your installation. If this is your first time replacing a water heater and you are concerned with safety, you can request for a local plumbing or electrical inspector to check your work. Gather your tools and materials. Replacing a water heater requires quite a number of tools and materials. You can save yourself time and frustration if you have all of the necessary items lined up and ready to go before you begin. Although the exact items will vary according to the type of water heater, the following guide should help:\n\nTools: screwdriver, adjustable wrench, pipe wrench, tube cutter, wire stripper/cutter electrical tape, plumbers tape, carpenter's level, tape measure, rags and safety glasses. Materials: new gas (or electric) water heater, water and gas piping, fittings, solder, pressure relief valve, discharge pipe, pipe thread compound, venting pipe and connectors. Removing the Old Water Heater Turn off the gas supply. The first step is to turn off the gas supply. You can do this by turning the gas shutoff valve by hand or using an adjustable wrench. When the gas is off, the valve handle should be at a right angle to the pipe. Check the pilot light to make sure it's out. Smell for the presence of gas before proceeding. If you're replacing an electric heater, remove the fuse or turn off the circuit breaker to cut off power to the water heater. Drain the tank. Switch off off the water supply by turning the shutoff valve on the cold water supply line. Start draining the tank by opening a hot water faucet on the lowest floor of the house. This will make the tank lighter and easier to move. Connect a hose to the drain valve on the tank and slowly open the valve. Allow the water to run off into a nearby drain or bucket. Be very careful, as the water may be scalding hot. Disconnect the gas and water lines. Once the tank has been drained, the next step is to disconnect the gas and water lines. Use two pipe wrenches to disconnect the gas line at the union or flare fitting. Then use a pipe wrench to unscrew the pipe from the gas control valve. If you have an electric water heater, simply disconnect the electrical service. Disconnect the hot and cold water lines. If the pipes have been soldered into place, you will need to cut them using a tubing cutter or a hacksaw. Try to ensure that the cuts are as straight as possible. Detach the vent from the water heater by removing the screws which connect the two. Push the vent pipe to one side. Remove and discard the old tank. Now that the old tank has been fully disconnected, carefully slide it out of the way. You may need some help doing this as older water heaters are often filled with sediment, making them very heavy. If your water heater is in the basement, consider renting an appliance dolly to help you bring the new heater down and the old heater up. Dispose of the old water heater safely and legally. Contact a local waste management department or sanitation agency for instructions on how to recycle a water heater. Most states have current laws prohibiting the dumping of appliances such as water heaters in dumps or landfills. Installing the New Water Heater Set the new water heater in place. Wipe up any pooled water from the floor, then move the new water heater into position. Twist the heater around so that the plumbing locations are lined up with the appropriate pipes. Use a carpenter's level to ensure that the heater is sitting straight. Use some wooden shims to adjust the level if necessary. Install the temperature and pressure relief valve. Wrap a couple of layers of Teflon tape around the threads of the new temperature and pressure relief valve (included with your water heater) and use a pipe wrench or pliers to screw it tightly into place. Attach the discharge drain pipe. Attach the pipe assemblies. Take two six inch lengths of ⁄4 inch (1.9 cm) copper pipe and attach a new adapter to each of them. Solder the adapters to the pipes at a work surface away from the water heater, as you don't want to place a heat source too close to the tank. Attach the adapters to the hot water output and cold water input at the top of the tank using pipe joint compound or Teflon tape. Some local plumbing codes will also require you to attach plastic lined nipples to the bottom of each pipe assembly. This prevents galvanic corrosion, something which is particular important in hard water areas. Connect the hot and cold water lines. To connect the hot and cold water lines, cut or extend the old pipes so they reach the newly connected ones. Solder the two edges of pipe together, using copper slip couplings or dielectric unions (to prevent electrolysis). If you can't get the old and new pipes to align properly, connect them using pieces of flexible copper pipes or 45 degree elbows. Reattach the vent. Grab the vent pipe and position it directly above the draft hood on the water heater. Use ⁄8 inch (1.0 cm) sheet metal screws to secure it tightly in place. Connect the gas line. Before you reassemble the gas line, clean the threaded ends of the pipes with a wire brush and rag, then apply a little piping compound to each. Use two pipe wrenches to screw the first nipple into the gas valve, then continue to reassemble the remaining fittings. The last connection should be the union fitting, as this connects the new line to the old. Once this is connected, you can turn on the gas supply valve. To connect electric heaters to their power supply, reconnect the power lines and ground wire to the junction box. Check for leaks. You can check for leaks by soaking a sponge in soapy water (made with dishwashing soap) and holding it against each newly connected joint on the water heater. If there's a leak, soap bubbles will form on the surface of the sponge. If this happens, you will need to tighten or reconnect the joints, or a call a professional plumber. If there are no bubbles, the joints are secure and you are free to turn on the water and power supply. Refill the tank. Turn on the main water supply and the cold water supply valve to start refilling the tank. Turn on a remote hot water faucet -- at first nothing may come out, or the water will splutter. Once a full flow of water is running from the faucet, the tank has been refilled. Turn the power back on. You can turn the new water heater on by lighting the pilot and setting the control knob to \"on\". Set the temperature somewhere between 110 and 130 degrees Fahrenheit. If your water heater is electric, turn the power on by reinstalling the fuse or resetting the circuit breaker in the power panel.",
  "tyn_model":[
    "water heater",
    "water",
    "heater",
    "water heaters",
    "pipe wrench",
    "adjustable wrench",
    "hot water",
    "pipe wrenches",
    "teflon tape",
    "adapters",
    "sponge",
    "plumber",
    "plumbing inspector",
    "plumbing or electrical inspector",
    "screwdriver",
    "tube cutter",
    "wire stripper/cutter",
    "electrical tape",
    "plumbers tape",
    "carpenter's level",
    "tape measure",
    "solder",
    "pipe thread",
    "electric heater",
    "hose",
    "electric water heater",
    "tubing cutter",
    "hacksaw",
    "appliance dolly",
    "pliers",
    "adapter",
    "pipe joint compound",
    "sheet metal screws",
    "wire brush",
    "piping compound",
    "electric heaters",
    "soapy water",
    "dishwashing soap",
    "cold water"
  ],
  "tyn_section":[

  ]
}