{
  "title":"How to Defrost Meat",
  "url":"https://www.wikihow.com/Defrost-Meat",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Thawing Meat in the Refrigerator",
      "steps":[
        {
          "headline":"Choose the refrigerator for slow, even defrosting.",
          "description":"The refrigerator method is easy and safe, requiring very little hands-on time. Additionally, you don’t have to worry about cooking thinner portions of the food or overheating the meat. However, it can take a long time for food to thaw, especially larger meats like a turkey or a pork roast. If you don’t have at least 24 hours to wait for the meat to defrost, choose a faster method."
        },
        {
          "headline":"Place the frozen meat on a plate.",
          "description":"Choose a large, sturdy plate that is big enough to hold all of the meat. The plate will prevent any moisture from falling from the thawing meat into your refrigerator. If the cut of meat is very large, such as a turkey or roast, place it on a large pan. Leave on any plastic packaging. This will protect the meat from falling food or debris in your refrigerator."
        },
        {
          "headline":"Refrigerate the frozen meat.",
          "description":"Place the plate of frozen meat in the refrigerator for at least 24 hours. For larger cuts of meat, allow 24 hours for every 5 pounds (2.3 kilograms) of meat. After the first 24 hours, check the meat periodically to see if it’s thawed. Poke the meat through the plastic or turn it over to see whether or not it’s done thawing. Wash your hands before and after touching the frozen meat to avoid food contamination."
        },
        {
          "headline":"Cook the meat or refreeze it.",
          "description":"Since refrigerator defrosting is such a gentle method, you don’t need to cook the meat right away. Instead, you can refreeze it for later use or cook it at a later date. For example:\nPoultry, fish, and ground meat can be kept in the refrigerator for an additional 1-2 days. Beef, pork, lamb, or veal will keep for another 3-5 days in the refrigerator."
        }
      ]
    },
    {
      "name":"Using Cold Water to Defrost Meat",
      "steps":[
        {
          "headline":"Choose the cold water method.",
          "description":"This method of defrosting is much faster than the refrigerator. Five pounds of meat (2.3 kilograms) or less can be defrosted within an hour, while larger cuts can take 2-3 hours. Additionally, you won’t risk cooking thinner parts of the meat like you would in a microwave. However, once defrosted, the food has to be cooked immediately."
        },
        {
          "headline":"Place the meat in a re-sealable bag.",
          "description":"The re-sealable bag will protect the meat from any bacteria in the air or the water. First, choose a large, freezer-grade re-sealable bag. Next, seal the meat inside, pressing the bag to remove most of the air. You don’t have to remove any plastic packaging before sealing the meat into the re-sealable bag."
        },
        {
          "headline":"Submerge the bag in bowl of cold water.",
          "description":"Choose a large bowl and place it in your sink. Fill the bowl with cold tap water. Next, place the re-sealable bag of meat into the water, submerging it completely. Let the meat sit in the water until it’s completely thaw. Every thirty minutes, dump out the water and refill it to keep the water fresh and cold. One or two pounds of meat (0.5 kilograms) can take 15-30 minutes. Larger pieces of meat can take 2-3 hours."
        },
        {
          "headline":"Cook the thawed meat immediately.",
          "description":"Even though the meat has been submerged in cold water, it has been exposed to warmer temperatures. Therefore, the meat must be cooked immediately after defrosting. If you want to refreeze the food, you must cook it first."
        }
      ]
    },
    {
      "name":"Defrosting Food in the Microwave",
      "steps":[
        {
          "headline":"Use the microwave for quick defrosting.",
          "description":"This quick method works best with smaller pieces of evenly cut meat. The microwave will defrost the meat in a matter of minutes. However, this method can also partially cook the meat or make it tough, affecting the quality of the dish. The thawed food must be cooked immediately after thawing. If you can’t cook it immediately, wait to thaw it until you need it."
        },
        {
          "headline":"Unwrap the meat and place it on a plate.",
          "description":"First, remove any plastic packaging from the meat. This packaging will retain moisture that will “boil” the outside of the meat. Next, place the meat on a large, microwave safe plate. If there are thinner portions of meat, place them near the center of the plate to stop them from cooking in the microwave. Microwave safe plates include ceramic and glass plates that don’t have any metal embellishments. Some frozen meats come on Styrofoam trays. These trays are not microwave safe and should be discarded."
        },
        {
          "headline":"Microwave the meat.",
          "description":"Each brand of microwave is slightly different. However, most brands have a special “defrost” button. To thaw the meat, place the meat in the microwave and press the “defrost” button. Then, your microwave will ask you to enter the weight of the meat. This measurement will be used to determine the thawing time for the meat. Before using the “defrost” feature, read your manufacturer manual."
        },
        {
          "headline":"Check the food periodically for “hot spots.” Every minute or so, pause the microwave and check on your meat.",
          "description":"Gently touch the sides to see if they’re warm. If they are, let the meat cool for a minute or so before continuing to defrost the meat. Once the microwave has finished defrosting the food, remove it from the microwave. Use a hand towel to remove the plate from the microwave to avoid burning your hand. Wash your hands before and after touching raw meat to avoid food contamination."
        },
        {
          "headline":"Cook the meat immediately.",
          "description":"When you use a microwave to thaw frozen meat, you expose the meat to warm temperatures that can encourage the growth of bacteria. Therefore, the meat must be cooked immediately to avoid any food contamination. If you want to refreeze the meat, you must cook it first."
        }
      ]
    }
  ],
  "text":" Thawing Meat in the Refrigerator Choose the refrigerator for slow, even defrosting. The refrigerator method is easy and safe, requiring very little hands-on time. Additionally, you don’t have to worry about cooking thinner portions of the food or overheating the meat. However, it can take a long time for food to thaw, especially larger meats like a turkey or a pork roast. If you don’t have at least 24 hours to wait for the meat to defrost, choose a faster method. Place the frozen meat on a plate. Choose a large, sturdy plate that is big enough to hold all of the meat. The plate will prevent any moisture from falling from the thawing meat into your refrigerator. If the cut of meat is very large, such as a turkey or roast, place it on a large pan. Leave on any plastic packaging. This will protect the meat from falling food or debris in your refrigerator. Refrigerate the frozen meat. Place the plate of frozen meat in the refrigerator for at least 24 hours. For larger cuts of meat, allow 24 hours for every 5 pounds (2.3 kilograms) of meat. After the first 24 hours, check the meat periodically to see if it’s thawed. Poke the meat through the plastic or turn it over to see whether or not it’s done thawing. Wash your hands before and after touching the frozen meat to avoid food contamination. Cook the meat or refreeze it. Since refrigerator defrosting is such a gentle method, you don’t need to cook the meat right away. Instead, you can refreeze it for later use or cook it at a later date. For example:\nPoultry, fish, and ground meat can be kept in the refrigerator for an additional 1-2 days. Beef, pork, lamb, or veal will keep for another 3-5 days in the refrigerator. Using Cold Water to Defrost Meat Choose the cold water method. This method of defrosting is much faster than the refrigerator. Five pounds of meat (2.3 kilograms) or less can be defrosted within an hour, while larger cuts can take 2-3 hours. Additionally, you won’t risk cooking thinner parts of the meat like you would in a microwave. However, once defrosted, the food has to be cooked immediately. Place the meat in a re-sealable bag. The re-sealable bag will protect the meat from any bacteria in the air or the water. First, choose a large, freezer-grade re-sealable bag. Next, seal the meat inside, pressing the bag to remove most of the air. You don’t have to remove any plastic packaging before sealing the meat into the re-sealable bag. Submerge the bag in bowl of cold water. Choose a large bowl and place it in your sink. Fill the bowl with cold tap water. Next, place the re-sealable bag of meat into the water, submerging it completely. Let the meat sit in the water until it’s completely thaw. Every thirty minutes, dump out the water and refill it to keep the water fresh and cold. One or two pounds of meat (0.5 kilograms) can take 15-30 minutes. Larger pieces of meat can take 2-3 hours. Cook the thawed meat immediately. Even though the meat has been submerged in cold water, it has been exposed to warmer temperatures. Therefore, the meat must be cooked immediately after defrosting. If you want to refreeze the food, you must cook it first. Defrosting Food in the Microwave Use the microwave for quick defrosting. This quick method works best with smaller pieces of evenly cut meat. The microwave will defrost the meat in a matter of minutes. However, this method can also partially cook the meat or make it tough, affecting the quality of the dish. The thawed food must be cooked immediately after thawing. If you can’t cook it immediately, wait to thaw it until you need it. Unwrap the meat and place it on a plate. First, remove any plastic packaging from the meat. This packaging will retain moisture that will “boil” the outside of the meat. Next, place the meat on a large, microwave safe plate. If there are thinner portions of meat, place them near the center of the plate to stop them from cooking in the microwave. Microwave safe plates include ceramic and glass plates that don’t have any metal embellishments. Some frozen meats come on Styrofoam trays. These trays are not microwave safe and should be discarded. Microwave the meat. Each brand of microwave is slightly different. However, most brands have a special “defrost” button. To thaw the meat, place the meat in the microwave and press the “defrost” button. Then, your microwave will ask you to enter the weight of the meat. This measurement will be used to determine the thawing time for the meat. Before using the “defrost” feature, read your manufacturer manual. Check the food periodically for “hot spots.” Every minute or so, pause the microwave and check on your meat. Gently touch the sides to see if they’re warm. If they are, let the meat cool for a minute or so before continuing to defrost the meat. Once the microwave has finished defrosting the food, remove it from the microwave. Use a hand towel to remove the plate from the microwave to avoid burning your hand. Wash your hands before and after touching raw meat to avoid food contamination. Cook the meat immediately. When you use a microwave to thaw frozen meat, you expose the meat to warm temperatures that can encourage the growth of bacteria. Therefore, the meat must be cooked immediately to avoid any food contamination. If you want to refreeze the meat, you must cook it first.",
  "tyn_model":[
    "microwave",
    "refrigerator",
    "plate",
    "water",
    "re-sealable bag",
    "“defrost",
    "cold water",
    "bowl",
    "” button",
    "turkey",
    "large pan",
    "plastic",
    "refrigerator defrosting",
    "fish",
    "lamb",
    "cold tap water",
    "“boil",
    "” the",
    "microwave safe plate",
    "microwave safe plates",
    "” feature",
    "“hot",
    "” every"
  ],
  "tyn_section":[

  ]
}