{
  "title":"How to Lay Concrete Blocks",
  "url":"https://www.wikihow.com/Lay-Concrete-Blocks",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Concrete"
  ],
  "methods":[
    {
      "name":"Gathering the Supplies",
      "steps":[
        {
          "headline":"Understand the available blocks.",
          "description":"There are many different varieties of concrete blocks used for modern construction. You'll typically use standard 8\" units, which will create the bulk of the foundation. Other types you might consider are single and double corner units, which provide a smooth square or rounded corner. Then you also have jamb blocks used for creating a doorway. Other special blocks are available for nearly every requirement you can think of. Sash blocks can be used when you want to create casement windows with an opening. Put header blocks at the top of a wall if you need to create space for roof supports or other construction supports. You can buy specialty blocks or even customize your building blocks to add a personal touch to your project."
        },
        {
          "headline":"Purchase footing.",
          "description":"Footing is the concrete base that is used as the base’s structure. You can either use dry footing that requires you to mix it with water to activate, or purchase prepared footing."
        },
        {
          "headline":"Gather the basic tools.",
          "description":"This type of project requires a lot of supplies that can be found at your nearest hardware store. Be sure you can afford the time it'll take you to construct, and weigh the price difference of hiring professionals. Collect these supplies if you decide to continue:\nTrowel\nGarden Hose\n3/8\" and 5/8\" Plywood\nWork Gloves\nLevel\nWheelbarrow\n100' of Cord\nMortar\nMasonry Chisel\n2x4 for Framing\nTie-in-Bars\nMortar Boards"
        },
        {
          "headline":"Ask a specialist.",
          "description":"If you're unsure about the specifics of what you should use for your project, consult a specialist at the hardware store. Typically the employees at the hardware store are knowledgeable about the needs of your project. It never hurts to ask if you're unsure."
        }
      ]
    },
    {
      "name":"Preparing the Footing",
      "steps":[
        {
          "headline":"Understand footing.",
          "description":"Every block of wall needs to be placed on a secure footing, which is made from concrete. Footing should be poured twice as deep as the thickness of the wall and twice as wide. If you're using standard blocks (8\"), then your footing should be at least 16\" wide. Footing is formed by using a frame of 2x4s and wooden stakes."
        },
        {
          "headline":"Prepare the 2x4s.",
          "description":"Double the width of the concrete block with two strips of 2x4s. Hold the 2x4s in place using wooden stakes along the outer wall. The 2x4s should be positioned so that they're secured by the stakes."
        },
        {
          "headline":"Be aware of the area.",
          "description":"Make sure you aren't preventing natural run-off water from the position of the footing. Observe the land in question for a few days prior to doing any work. Pay special attention to the area after it rains. You don't want to disrupt the flow of water so that it floods into your neighbor’s property."
        },
        {
          "headline":"Pour the base concrete.",
          "description":"This will secure your potential wall firmly to the base. Fill the frame up to the edge. Level the freshly poured concrete by running a 2x4 across the top. This will spread the concrete in an even manner. Fill any spots that are low with additional concrete."
        },
        {
          "headline":"Wait for the footing to dry.",
          "description":"Before you can begin building, you'll need to give the concrete ample time to dry. If you expect the footing to hold a substantial amount of weight, wait up to three days for it to dry."
        }
      ]
    },
    {
      "name":"Preparing to Lay the Concrete Blocks",
      "steps":[
        {
          "headline":"Plan and section off the corners.",
          "description":"Before you begin laying the blocks, visualize all the corners of your frame. Section off the corners with wooden stakes. Use a cord or string to tie off exactly where the corners’ edges will be. Attach a cord or string to the wooden stake used to mark the corners. The string should create a circumference around your work space."
        },
        {
          "headline":"Determine the number of blocks.",
          "description":"Lay out your blocks along the dried footing and see how many you'll need for the first layer. Don't seal these down. Use a 5x8 to separate the blocks to account for the mortar. Use corner blocks on the corners if available. After testing, remove the blocks and prepare for the real event."
        },
        {
          "headline":"Prepare the cement mortar.",
          "description":"Take the bag of dried concrete and measure out one dosage. Look on the bag's specifications for the brand you choose. Prepare a container to mix the dried mortar with water. Use a five gallon bucket that you don't mind damaging. Never mix more mortar than you can use."
        }
      ]
    },
    {
      "name":"Laying the Concrete Blocks",
      "steps":[
        {
          "headline":"Spread the mortar along the corner.",
          "description":"Use your trowel to spread a few slabs of mortar around the corner's base of the footing. Spread the mortar 1\" deep and 8\" wide in the marked area. Continue to spread the mortar to account for the distance of about three to four blocks."
        },
        {
          "headline":"Set the corner block.",
          "description":"It is important to lay the corner block down first. Again, use a corner block if they're available. Setting the corner first will ensure an even dispersal of the rest of the blocks."
        },
        {
          "headline":"Apply mortar to the side.",
          "description":"Apply mortar to each side of the concrete block using your trowel. You'll need to apply at least an inch to each side. Once applied, position the stone in the desired location. Try to align the corner to the string set up earlier. Don't apply mortar to outer edge of the corner. Try not to leave any gaps when applying mortar, or it’ll weaken the bond between the blocks."
        },
        {
          "headline":"Continue to lay the concrete blocks.",
          "description":"Start laying blocks from the corner or edge of the wall so you can work in one direction. Apply mortar at the end of the block before you place the block adjacent to it."
        },
        {
          "headline":"Check the alignment.",
          "description":"Before stacking more concrete blocks on top of your initial foundation, check if everything is aligned. Use your mason's level by laying it on the first set of blocks. Check both the outside and center section of the bricks. Tap the blocks for any alignment adjustments while the mortar is still wet. Do not try to move a block after the concrete has set. Measure the length and height every two or three layers."
        },
        {
          "headline":"Apply mortar to the top.",
          "description":"Place the mortar 1 inch (2.5 cm) deep and use the same width as the width of the block. You can then spread the mortar so it covers the length of about 3 blocks in the direction that you are laying the bricks."
        },
        {
          "headline":"Stack the blocks.",
          "description":"Lay the block down on top so the edge of the top block aligns with the halfway mark of the bottom block. You'll recognize the pattern as a standard among the construction sites. The top block will fit in between two bottom blocks."
        },
        {
          "headline":"Add reinforcement.",
          "description":"If you built fairly high walls, consider adding reinforcements. You can also use reinforcements if the ground pressure on the site is not stable. Place the 1/4\" reinforcement rods into the openings with the ends overlapping about 2\" or 3\"."
        }
      ]
    }
  ],
  "text":" Gathering the Supplies Understand the available blocks. There are many different varieties of concrete blocks used for modern construction. You'll typically use standard 8\" units, which will create the bulk of the foundation. Other types you might consider are single and double corner units, which provide a smooth square or rounded corner. Then you also have jamb blocks used for creating a doorway. Other special blocks are available for nearly every requirement you can think of. Sash blocks can be used when you want to create casement windows with an opening. Put header blocks at the top of a wall if you need to create space for roof supports or other construction supports. You can buy specialty blocks or even customize your building blocks to add a personal touch to your project. Purchase footing. Footing is the concrete base that is used as the base’s structure. You can either use dry footing that requires you to mix it with water to activate, or purchase prepared footing. Gather the basic tools. This type of project requires a lot of supplies that can be found at your nearest hardware store. Be sure you can afford the time it'll take you to construct, and weigh the price difference of hiring professionals. Collect these supplies if you decide to continue:\nTrowel\nGarden Hose\n3/8\" and 5/8\" Plywood\nWork Gloves\nLevel\nWheelbarrow\n100' of Cord\nMortar\nMasonry Chisel\n2x4 for Framing\nTie-in-Bars\nMortar Boards Ask a specialist. If you're unsure about the specifics of what you should use for your project, consult a specialist at the hardware store. Typically the employees at the hardware store are knowledgeable about the needs of your project. It never hurts to ask if you're unsure. Preparing the Footing Understand footing. Every block of wall needs to be placed on a secure footing, which is made from concrete. Footing should be poured twice as deep as the thickness of the wall and twice as wide. If you're using standard blocks (8\"), then your footing should be at least 16\" wide. Footing is formed by using a frame of 2x4s and wooden stakes. Prepare the 2x4s. Double the width of the concrete block with two strips of 2x4s. Hold the 2x4s in place using wooden stakes along the outer wall. The 2x4s should be positioned so that they're secured by the stakes. Be aware of the area. Make sure you aren't preventing natural run-off water from the position of the footing. Observe the land in question for a few days prior to doing any work. Pay special attention to the area after it rains. You don't want to disrupt the flow of water so that it floods into your neighbor’s property. Pour the base concrete. This will secure your potential wall firmly to the base. Fill the frame up to the edge. Level the freshly poured concrete by running a 2x4 across the top. This will spread the concrete in an even manner. Fill any spots that are low with additional concrete. Wait for the footing to dry. Before you can begin building, you'll need to give the concrete ample time to dry. If you expect the footing to hold a substantial amount of weight, wait up to three days for it to dry. Preparing to Lay the Concrete Blocks Plan and section off the corners. Before you begin laying the blocks, visualize all the corners of your frame. Section off the corners with wooden stakes. Use a cord or string to tie off exactly where the corners’ edges will be. Attach a cord or string to the wooden stake used to mark the corners. The string should create a circumference around your work space. Determine the number of blocks. Lay out your blocks along the dried footing and see how many you'll need for the first layer. Don't seal these down. Use a 5x8 to separate the blocks to account for the mortar. Use corner blocks on the corners if available. After testing, remove the blocks and prepare for the real event. Prepare the cement mortar. Take the bag of dried concrete and measure out one dosage. Look on the bag's specifications for the brand you choose. Prepare a container to mix the dried mortar with water. Use a five gallon bucket that you don't mind damaging. Never mix more mortar than you can use. Laying the Concrete Blocks Spread the mortar along the corner. Use your trowel to spread a few slabs of mortar around the corner's base of the footing. Spread the mortar 1\" deep and 8\" wide in the marked area. Continue to spread the mortar to account for the distance of about three to four blocks. Set the corner block. It is important to lay the corner block down first. Again, use a corner block if they're available. Setting the corner first will ensure an even dispersal of the rest of the blocks. Apply mortar to the side. Apply mortar to each side of the concrete block using your trowel. You'll need to apply at least an inch to each side. Once applied, position the stone in the desired location. Try to align the corner to the string set up earlier. Don't apply mortar to outer edge of the corner. Try not to leave any gaps when applying mortar, or it’ll weaken the bond between the blocks. Continue to lay the concrete blocks. Start laying blocks from the corner or edge of the wall so you can work in one direction. Apply mortar at the end of the block before you place the block adjacent to it. Check the alignment. Before stacking more concrete blocks on top of your initial foundation, check if everything is aligned. Use your mason's level by laying it on the first set of blocks. Check both the outside and center section of the bricks. Tap the blocks for any alignment adjustments while the mortar is still wet. Do not try to move a block after the concrete has set. Measure the length and height every two or three layers. Apply mortar to the top. Place the mortar 1 inch (2.5 cm) deep and use the same width as the width of the block. You can then spread the mortar so it covers the length of about 3 blocks in the direction that you are laying the bricks. Stack the blocks. Lay the block down on top so the edge of the top block aligns with the halfway mark of the bottom block. You'll recognize the pattern as a standard among the construction sites. The top block will fit in between two bottom blocks. Add reinforcement. If you built fairly high walls, consider adding reinforcements. You can also use reinforcements if the ground pressure on the site is not stable. Place the 1/4\" reinforcement rods into the openings with the ends overlapping about 2\" or 3\".",
  "tyn_model":[
    "mortar",
    "concrete",
    "water",
    "trowel",
    "concrete blocks",
    "wooden stakes",
    "concrete block",
    "cord",
    "reinforcements",
    "garden hose",
    "wheelbarrow",
    "cord\nmortar",
    "masonry chisel",
    "boards",
    "footing",
    "stakes",
    "string",
    "’ edges",
    "cement mortar",
    "five gallon bucket",
    "mason's level",
    "bricks",
    "reinforcement",
    "reinforcement rods"
  ],
  "tyn_section":[

  ]
}