{
  "title":"How to Make Vegetable Broth",
  "url":"https://www.wikihow.com/Make-Vegetable-Broth",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Making Basic Vegetable Broth",
      "steps":[
        {
          "headline":"Wash and chop the vegetables.",
          "description":"Rinse the carrots and celery under running water, and use your finger to scrub away visible dirt. Pat the vegetables dry with a clean towel. Transfer the vegetables to a cutting board, and use a sharp knife to cut them into 1-inch (2.5-cm) chunks. You can use any vegetables you like to make this broth, including tomatoes, mushrooms, parsnips, leeks, and green onions. Avoid starchy vegetables like potatoes, because they can make the broth cloudy. Don’t use broccoli, beans, zucchini, and cabbage to make the broth, because they can become bitter when simmered for too long."
        },
        {
          "headline":"Sauté the vegetables for five minutes.",
          "description":"Drizzle the oil into a Dutch oven or large stockpot. Turn the heat to medium and preheat the oil for two minutes. Transfer the vegetables to the stockpot and cook them for about five minutes, until they're soft and fragrant. Cooking the vegetables first will make for a more flavorful broth."
        },
        {
          "headline":"Cover the vegetables with water and add the aromatics.",
          "description":"Pour the water into the stockpot with the vegetables. Add the thyme, bay leaf, parsley, and peppercorns to the pot as well. Other aromatics you can add to flavor the broth include:\nGinger\nLemongrass\nRosemary\nParmesan rinds\nGarlic\nFennel"
        },
        {
          "headline":"Boil the broth and simmer it for an hour.",
          "description":"Cover the pot with a lid and turn the heat to medium-high. Keep a close eye on the broth and bring it to a boil. As soon as it starts to bubble, reduce the heat to medium-low, and continue cooking the broth for an hour."
        },
        {
          "headline":"Strain the broth.",
          "description":"After an hour, remove the broth from the heat. Place a colander inside a large glass bowl or stockpot. Pour the broth through the colander and into the bowl below to strain out the vegetables. For a very clear broth, line the colander with cheesecloth or paper towel before straining out the vegetables."
        },
        {
          "headline":"Use the broth and store leftovers for later.",
          "description":"Once the broth has been strained, it’s ready to eat or use in your favorite recipes. Leftover broth can be stored in the refrigerator for up to a week, or in the freezer for as long as three months."
        }
      ]
    },
    {
      "name":"Making Meaty Roasted Vegetable Broth",
      "steps":[
        {
          "headline":"Chop the vegetables.",
          "description":"Rinse the carrots, celery, and tomatoes under running water. Pat them dry with a clean towel. Cut these vegetables, the onion, and the mushrooms into cubes that are about 1 inch (2.5 cm). In this recipe, the mushrooms and tomatoes add a meatiness to the broth that makes it hearty and delicious. Roasting the vegetables before making the broth helps to make a rich broth with a lot of depth."
        },
        {
          "headline":"Roast the vegetables.",
          "description":"Transfer the carrots, celery, tomatoes, onions, and whole garlic cloves to a large baking or roasting dish. Drizzle oil over the vegetables and transfer them to a preheated 425 °F (218 °C) oven. Cook the vegetables for 40 minutes, stirring them every 10 to 15 minutes. Roasting the vegetables before making the broth will add a rich and meaty flavor to the broth."
        },
        {
          "headline":"Transfer the vegetables to a stockpot.",
          "description":"When the vegetables are soft and browned, remove them from the oven. Use a spoon to scoop out the roasted vegetables and move them into a large stockpot or saucepan."
        },
        {
          "headline":"Add the remaining ingredients.",
          "description":"In the stockpot, combine the roasted vegetables with the parsley, thyme, bay leaves, and salt. Cover the mixture with the water and put a lid on the stockpot. For additional flavors and spiciness, you can also add a teaspoon (2 g) each of coriander seeds and whole peppercorns to the broth."
        },
        {
          "headline":"Boil and simmer the broth.",
          "description":"Turn the heat to medium and bring the broth to a boil. When it starts to boil, reduce the heat to medium-low and move the lid aside so the stockpot is only partially covered. Continue simmering the broth for another 45 minutes."
        },
        {
          "headline":"Strain the broth.",
          "description":"Place a colander inside a large glass bowl or pot. Pour the broth into the colander to strain out the vegetables, leaving nothing but a clear broth in the bowl below. Instead of straining the broth, you can also leave the veggies in and eat this as a tasty vegetable soup."
        },
        {
          "headline":"Enjoy your broth.",
          "description":"The strained broth is ready to be eaten or added to your favorite soups, stews, and other dishes. If you have leftovers, transfer them to a glass jar and store them in the refrigerator for up to a week. For longer storage, transfer the broth to a freezer-safe container and store for up to three months."
        }
      ]
    },
    {
      "name":"Using Vegetable Broth",
      "steps":[
        {
          "headline":"Make soup or stew.",
          "description":"Homemade soups and stews are wonderful for warming up on a cold night, but they're also great as appetizers before a meal. There are many different types of soups you can make with a basic vegetable broth, including:\nVegetarian French onion\n\nVegetable soup\nLentil soup\nBeef stew"
        },
        {
          "headline":"Try homemade risotto.",
          "description":"Risotto is a creamy rice dish that you can make with meat, fish, or vegetable broth. The trick with risotto is to keep the broth warm, and to add it to the rice in small increments. This gives the rice time to fully soak up the broth, which makes it creamy and soft. You can use vegetable broth to make any grains, including basic rice, quinoa, and polenta."
        },
        {
          "headline":"Whip up some gravy.",
          "description":"There's no better way to finish mashed potatoes, French fries, meats, and savory pies than with homemade gravy. To make a simple gravy with your vegetable broth:\nHeat a cup (235 ml) of the broth in a small saucepan\nWhisk together in a small bowl a teaspoon (2 g) of cornstarch and just enough water to dissolve cornstarch\nPour the cornstarch slurry into the hot broth\nBring the broth to a boil, whisking regularly\nAdd salt, pepper, or additional spices if desired"
        }
      ]
    }
  ],
  "text":" Making Basic Vegetable Broth Wash and chop the vegetables. Rinse the carrots and celery under running water, and use your finger to scrub away visible dirt. Pat the vegetables dry with a clean towel. Transfer the vegetables to a cutting board, and use a sharp knife to cut them into 1-inch (2.5-cm) chunks. You can use any vegetables you like to make this broth, including tomatoes, mushrooms, parsnips, leeks, and green onions. Avoid starchy vegetables like potatoes, because they can make the broth cloudy. Don’t use broccoli, beans, zucchini, and cabbage to make the broth, because they can become bitter when simmered for too long. Sauté the vegetables for five minutes. Drizzle the oil into a Dutch oven or large stockpot. Turn the heat to medium and preheat the oil for two minutes. Transfer the vegetables to the stockpot and cook them for about five minutes, until they're soft and fragrant. Cooking the vegetables first will make for a more flavorful broth. Cover the vegetables with water and add the aromatics. Pour the water into the stockpot with the vegetables. Add the thyme, bay leaf, parsley, and peppercorns to the pot as well. Other aromatics you can add to flavor the broth include:\nGinger\nLemongrass\nRosemary\nParmesan rinds\nGarlic\nFennel Boil the broth and simmer it for an hour. Cover the pot with a lid and turn the heat to medium-high. Keep a close eye on the broth and bring it to a boil. As soon as it starts to bubble, reduce the heat to medium-low, and continue cooking the broth for an hour. Strain the broth. After an hour, remove the broth from the heat. Place a colander inside a large glass bowl or stockpot. Pour the broth through the colander and into the bowl below to strain out the vegetables. For a very clear broth, line the colander with cheesecloth or paper towel before straining out the vegetables. Use the broth and store leftovers for later. Once the broth has been strained, it’s ready to eat or use in your favorite recipes. Leftover broth can be stored in the refrigerator for up to a week, or in the freezer for as long as three months. Making Meaty Roasted Vegetable Broth Chop the vegetables. Rinse the carrots, celery, and tomatoes under running water. Pat them dry with a clean towel. Cut these vegetables, the onion, and the mushrooms into cubes that are about 1 inch (2.5 cm). In this recipe, the mushrooms and tomatoes add a meatiness to the broth that makes it hearty and delicious. Roasting the vegetables before making the broth helps to make a rich broth with a lot of depth. Roast the vegetables. Transfer the carrots, celery, tomatoes, onions, and whole garlic cloves to a large baking or roasting dish. Drizzle oil over the vegetables and transfer them to a preheated 425 °F (218 °C) oven. Cook the vegetables for 40 minutes, stirring them every 10 to 15 minutes. Roasting the vegetables before making the broth will add a rich and meaty flavor to the broth. Transfer the vegetables to a stockpot. When the vegetables are soft and browned, remove them from the oven. Use a spoon to scoop out the roasted vegetables and move them into a large stockpot or saucepan. Add the remaining ingredients. In the stockpot, combine the roasted vegetables with the parsley, thyme, bay leaves, and salt. Cover the mixture with the water and put a lid on the stockpot. For additional flavors and spiciness, you can also add a teaspoon (2 g) each of coriander seeds and whole peppercorns to the broth. Boil and simmer the broth. Turn the heat to medium and bring the broth to a boil. When it starts to boil, reduce the heat to medium-low and move the lid aside so the stockpot is only partially covered. Continue simmering the broth for another 45 minutes. Strain the broth. Place a colander inside a large glass bowl or pot. Pour the broth into the colander to strain out the vegetables, leaving nothing but a clear broth in the bowl below. Instead of straining the broth, you can also leave the veggies in and eat this as a tasty vegetable soup. Enjoy your broth. The strained broth is ready to be eaten or added to your favorite soups, stews, and other dishes. If you have leftovers, transfer them to a glass jar and store them in the refrigerator for up to a week. For longer storage, transfer the broth to a freezer-safe container and store for up to three months. Using Vegetable Broth Make soup or stew. Homemade soups and stews are wonderful for warming up on a cold night, but they're also great as appetizers before a meal. There are many different types of soups you can make with a basic vegetable broth, including:\nVegetarian French onion\n\nVegetable soup\nLentil soup\nBeef stew Try homemade risotto. Risotto is a creamy rice dish that you can make with meat, fish, or vegetable broth. The trick with risotto is to keep the broth warm, and to add it to the rice in small increments. This gives the rice time to fully soak up the broth, which makes it creamy and soft. You can use vegetable broth to make any grains, including basic rice, quinoa, and polenta. Whip up some gravy. There's no better way to finish mashed potatoes, French fries, meats, and savory pies than with homemade gravy. To make a simple gravy with your vegetable broth:\nHeat a cup (235 ml) of the broth in a small saucepan\nWhisk together in a small bowl a teaspoon (2 g) of cornstarch and just enough water to dissolve cornstarch\nPour the cornstarch slurry into the hot broth\nBring the broth to a boil, whisking regularly\nAdd salt, pepper, or additional spices if desired",
  "tyn_model":[
    "broth",
    "vegetables",
    "stockpot",
    "water",
    "colander",
    "vegetable broth",
    "tomatoes",
    "carrots",
    "celery",
    "mushrooms",
    "oil",
    "risotto",
    "thyme",
    "parsley",
    "garlic",
    "large glass bowl",
    "salt",
    "cornstarch",
    "parsnips",
    "leeks",
    "green onions",
    "potatoes",
    "broccoli",
    "beans",
    "zucchini",
    "cabbage",
    "dutch oven",
    "large stockpot",
    "bay leaf",
    "ginger",
    "rosemary",
    "parmesan rinds",
    "fennel",
    "pot",
    "bowl",
    "onion",
    "onions",
    "baking or roasting dish",
    "oven",
    "spoon",
    "large stockpot or saucepan",
    "bay leaves",
    "coriander",
    "glass jar",
    "refrigerator",
    "french onion\n\nvegetable soup",
    "beef stew",
    "rice",
    "gravy",
    "french fries",
    "homemade gravy",
    "small saucepan",
    "small bowl",
    "pepper"
  ],
  "tyn_section":[

  ]
}