{
  "title":"How to Build a Bar",
  "url":"https://www.wikihow.com/Build-a-Bar",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture"
  ],
  "methods":[
    {
      "name":"Build the Walls",
      "steps":[
        {
          "headline":"Lay out the plywood boards.",
          "description":"Lay out the 60” x 42” and both 24” x 42” plywood boards. They should be in a space and at a level which is safe and comfortable to work in."
        },
        {
          "headline":"Attach the framing.",
          "description":"Glue and then nail the framing into place. The 60” pieces go across the bottom and top of the front wall\nThe 24” pieces go across the top and bottom of the side wall\nTwo 37” pieces between the top and bottom pieces on all three walls\nOne 37” piece at the center of each side wall, and the remaining 37” should be evenly spaced on the front wall. Mark the placement of the 37” boards at the top edge of the wall boards, so that you can find them again if necessary."
        },
        {
          "headline":"Attach optional nailing blocks.",
          "description":"If you intend to install a footbar, place two 6” blocks on the front wall, between the 37” framing pieces (at whatever distance is necessary for the width of the footbar, so long as they can fit between the 37” pieces). Be sure to mark on the bottom edge of the plywood where these are located."
        },
        {
          "headline":"Place the feature wood.",
          "description":"You will need to buy whatever type of wood you want to be visible, so it should be fairly high quality. Lauan is recommended. Glue it to the frame and then very carefully nail it into place."
        }
      ]
    },
    {
      "name":"Add the Paneling",
      "steps":[
        {
          "headline":"Mark the position of the corner stiles.",
          "description":"The corner stiles of the front wall will need to be offset in order to form the corner joint and give the walls a solid look. The stile should overhang the panel by ¾”, such that the side of a similar board will be covered. Mark this placement but do not attach the stile."
        },
        {
          "headline":"Place rails on front panel.",
          "description":"Place the top and bottom 54 ½”  rails on the front panel, glueing them and then nailing them into place. Be sure to place the large rail at the bottom (where the nailing boards are located, if you chose to use them)."
        },
        {
          "headline":"Place stiles on front panel.",
          "description":"Place three of the the 31 ¼” stiles on the front wall, evenly spaced, between the rails."
        },
        {
          "headline":"Insert panel molding.",
          "description":"Using molding which is no wider than the stiles are thick, line the inside edges of the recessed panels with the moulding to give it a more seamless look (or go without if you’d prefer a craftsman feel). These will need to be mitered and then nailed into place with 1 ¼” nails."
        }
      ]
    },
    {
      "name":"Assemble the Base",
      "steps":[
        {
          "headline":"Attach side panels.",
          "description":"Standing the front wall and a side panel, glue the edge of the side panel to the back of the front wall. Be sure that the nice wood is facing outward and that you have the front wall the right side up (with the 6” nailing blocks at the bottom). Clamp these together, draw a line on the front wall where the center of the side panel is located and then drill pilot holes and place 3” screws along the line, joining the walls together. Repeat with the other side panel when complete. This step works best with two people."
        },
        {
          "headline":"Add corner stiles.",
          "description":"Attach a 42” 1x4 to each end of the front wall with glue and then nails, remembering to leave the overhang. Using the cut 42” 1x4’s, glue and nail those onto the side walls where they meets with the front wall, completing the corn stile."
        },
        {
          "headline":"Finish side panel details.",
          "description":"Glue and nail the remaining stiles and rails into place. The two remaining 42” 1x4’s will need to be placed at the other edge of the side walls, with the same ¾” overhang as with the front panel. The 42” 1x2’s are then placed next to these as endcaps for the wall. The rails will need to be measured and cut to fit between the side wall corner stiles and then the two remaining 31 ¼” stiles can be centered on the side panels. Place the remained of molding into the recessed panels when the stiles and rails are in place."
        }
      ]
    },
    {
      "name":"Create Bar-Top",
      "steps":[
        {
          "headline":"Measure and cut the bar-top base.",
          "description":"You will need to determine the measurements of the bar-top for yourself, as it will depend heavily upon your needs and preferences. Form the base from three pieces of plywood, the front piece wedge between the side pieces. The overhang should be at least 6”. Dimensions of roughly 12” x 50” for the front piece and 12” x 33 ½” for the side pieces is recommended."
        },
        {
          "headline":"Install the base.",
          "description":"Use 1 ¼” screws to attach the bar-top base to the walls, being careful to center your screws in the top edge of the wall."
        },
        {
          "headline":"Measure, cut and set the bar-top.",
          "description":"You will then need to cut to size a bar-top from whatever material you wish to use. The measurements will depend on the dimensions of your bar-top base. For the bar-top, the front piece will need to be longer than the side pieces, fitting in the opposite way to how the base was constructed (this will give it strength). The bar-top will also need to be narrower in order to fit the bar-top molding. Check the depth between the two slots on your molding to determine how much narrower the bar-top will need to be. Measure and cut the material accordingly and then place it using 1 ¼” nails. Try to place the nails in such a way that they will be covered by the lip of the molding (if it is wide enough to allow that)."
        },
        {
          "headline":"Install the molding.",
          "description":"Once that is done, measure your molding to fit and then miter the three pieces together at 45° (leaving it flat at the back ends so that it sits flush with the edge of the end cap). Nail it into place with 1 ¼” nails from the underside of the plywood base. You’re done!"
        }
      ]
    },
    {
      "name":"Adding Details and Variations",
      "steps":[
        {
          "headline":"Add storage and workspace.",
          "description":"You will want to add some kind of storage and counter space behind the bar, as the included instructions don’t provide any. You can do this in a number of ways. You could add a counter supported by brackets. You could find a stand-alone kitchen which fits in the space. You could build a series of shelves which fit into the space. It is also possible to simply leave it like it is. The decision is entirely up to you."
        },
        {
          "headline":"Attach the optional footbar.",
          "description":"If you want to add a footbar, you can do that. Simply be sure to add the additional 6” support blocks when building the frame, as described in the instructions. Attach the footbar using whichever method is recommended by the manufacturer. Get advice from your local hardware store staff."
        },
        {
          "headline":"Consider alternative surfaces.",
          "description":"You may want to consider various ways to customize the appearance of your bar. You can do this by using a unique bar-top surface (such as one made from stone or colored glass) or by painting or staining the wood. The recessed panels are another opportunity for customization, since you can add contrasting material (like tile) to add interest to the bar."
        }
      ]
    }
  ],
  "text":" Build the Walls Lay out the plywood boards. Lay out the 60” x 42” and both 24” x 42” plywood boards. They should be in a space and at a level which is safe and comfortable to work in. Attach the framing. Glue and then nail the framing into place. The 60” pieces go across the bottom and top of the front wall\nThe 24” pieces go across the top and bottom of the side wall\nTwo 37” pieces between the top and bottom pieces on all three walls\nOne 37” piece at the center of each side wall, and the remaining 37” should be evenly spaced on the front wall. Mark the placement of the 37” boards at the top edge of the wall boards, so that you can find them again if necessary. Attach optional nailing blocks. If you intend to install a footbar, place two 6” blocks on the front wall, between the 37” framing pieces (at whatever distance is necessary for the width of the footbar, so long as they can fit between the 37” pieces). Be sure to mark on the bottom edge of the plywood where these are located. Place the feature wood. You will need to buy whatever type of wood you want to be visible, so it should be fairly high quality. Lauan is recommended. Glue it to the frame and then very carefully nail it into place. Add the Paneling Mark the position of the corner stiles. The corner stiles of the front wall will need to be offset in order to form the corner joint and give the walls a solid look. The stile should overhang the panel by ¾”, such that the side of a similar board will be covered. Mark this placement but do not attach the stile. Place rails on front panel. Place the top and bottom 54 ½”  rails on the front panel, glueing them and then nailing them into place. Be sure to place the large rail at the bottom (where the nailing boards are located, if you chose to use them). Place stiles on front panel. Place three of the the 31 ¼” stiles on the front wall, evenly spaced, between the rails. Insert panel molding. Using molding which is no wider than the stiles are thick, line the inside edges of the recessed panels with the moulding to give it a more seamless look (or go without if you’d prefer a craftsman feel). These will need to be mitered and then nailed into place with 1 ¼” nails. Assemble the Base Attach side panels. Standing the front wall and a side panel, glue the edge of the side panel to the back of the front wall. Be sure that the nice wood is facing outward and that you have the front wall the right side up (with the 6” nailing blocks at the bottom). Clamp these together, draw a line on the front wall where the center of the side panel is located and then drill pilot holes and place 3” screws along the line, joining the walls together. Repeat with the other side panel when complete. This step works best with two people. Add corner stiles. Attach a 42” 1x4 to each end of the front wall with glue and then nails, remembering to leave the overhang. Using the cut 42” 1x4’s, glue and nail those onto the side walls where they meets with the front wall, completing the corn stile. Finish side panel details. Glue and nail the remaining stiles and rails into place. The two remaining 42” 1x4’s will need to be placed at the other edge of the side walls, with the same ¾” overhang as with the front panel. The 42” 1x2’s are then placed next to these as endcaps for the wall. The rails will need to be measured and cut to fit between the side wall corner stiles and then the two remaining 31 ¼” stiles can be centered on the side panels. Place the remained of molding into the recessed panels when the stiles and rails are in place. Create Bar-Top Measure and cut the bar-top base. You will need to determine the measurements of the bar-top for yourself, as it will depend heavily upon your needs and preferences. Form the base from three pieces of plywood, the front piece wedge between the side pieces. The overhang should be at least 6”. Dimensions of roughly 12” x 50” for the front piece and 12” x 33 ½” for the side pieces is recommended. Install the base. Use 1 ¼” screws to attach the bar-top base to the walls, being careful to center your screws in the top edge of the wall. Measure, cut and set the bar-top. You will then need to cut to size a bar-top from whatever material you wish to use. The measurements will depend on the dimensions of your bar-top base. For the bar-top, the front piece will need to be longer than the side pieces, fitting in the opposite way to how the base was constructed (this will give it strength). The bar-top will also need to be narrower in order to fit the bar-top molding. Check the depth between the two slots on your molding to determine how much narrower the bar-top will need to be. Measure and cut the material accordingly and then place it using 1 ¼” nails. Try to place the nails in such a way that they will be covered by the lip of the molding (if it is wide enough to allow that). Install the molding. Once that is done, measure your molding to fit and then miter the three pieces together at 45° (leaving it flat at the back ends so that it sits flush with the edge of the end cap). Nail it into place with 1 ¼” nails from the underside of the plywood base. You’re done! Adding Details and Variations Add storage and workspace. You will want to add some kind of storage and counter space behind the bar, as the included instructions don’t provide any. You can do this in a number of ways. You could add a counter supported by brackets. You could find a stand-alone kitchen which fits in the space. You could build a series of shelves which fit into the space. It is also possible to simply leave it like it is. The decision is entirely up to you. Attach the optional footbar. If you want to add a footbar, you can do that. Simply be sure to add the additional 6” support blocks when building the frame, as described in the instructions. Attach the footbar using whichever method is recommended by the manufacturer. Get advice from your local hardware store staff. Consider alternative surfaces. You may want to consider various ways to customize the appearance of your bar. You can do this by using a unique bar-top surface (such as one made from stone or colored glass) or by painting or staining the wood. The recessed panels are another opportunity for customization, since you can add contrasting material (like tile) to add interest to the bar.",
  "tyn_model":[
    "glue",
    "” x",
    "” pieces",
    "rails",
    "plywood",
    "” nails",
    "” 1x4",
    "” stiles",
    "” screws",
    "nails",
    "” for",
    "plywood boards",
    "” and",
    "” plywood",
    "framing",
    "” piece",
    "” should",
    "” boards",
    "nailing blocks",
    "” blocks",
    "” framing",
    "lauan",
    "paneling",
    "”,",
    "”  ",
    "panel molding",
    "moulding",
    "base attach",
    "” nailing",
    "” overhang",
    "” 1x2",
    "”.",
    "screws",
    "bar-",
    "brackets",
    "shelves",
    "” support"
  ],
  "tyn_section":[

  ]
}