{
  "title":"How to Make Wire Photo Holders",
  "url":"https://www.wikihow.com/Make-Wire-Photo-Holders",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Make Wire Scrolls for the Wire Photo Holder",
      "steps":[
        {
          "headline":"Cut the chicken wire to the desired length.",
          "description":"Allow an extra 10 to 12 inches (254 mm to 304 mm) for twisting the wire to make circular scrolls and to wrap the wire holders around the base."
        },
        {
          "headline":"Take 1 end of the wire at the tip and bend it inward.",
          "description":"Hold it tight, so that the wire curls. Continue bending it inward until you form a circle."
        },
        {
          "headline":"Pull the wire inward with the fingers.",
          "description":"Continue doing this until you notice a circular pattern forming. Once you form 5 to 6 circles, discontinue making the circles and instead gently bend the remaining wire inward and allow the remaining wire to hang down."
        },
        {
          "headline":"Grab another piece of wire and continue making the circles until you make 4 or 5 of picture holder scrolls.",
          "description":"Once you complete this, you can begin working on the base of the wire photo holder."
        }
      ]
    },
    {
      "name":"Create the Base of the Wire Photo Holder",
      "steps":[
        {
          "headline":"Use a rock or figurine that has a hole in the middle that extends all the way to the bottom of the figurine.",
          "description":"To add even more detail to the rock, you can use acrylic paint to paint a colorful theme on the rock, which matches the photos displayed above the rock or figurine."
        },
        {
          "headline":"Paint the rock with acrylic paint.",
          "description":"Paint the rock according to the theme of the pictures being displayed. When you have a beach-like theme, you can paint a small landscape of the beach on the rock. When you have a camping theme, you can paint a small campground with trees and mountains on the rock."
        },
        {
          "headline":"Apply embellishments to the rocks when you don't have paint on hand or when you want to add detail that is difficult to paint.",
          "description":"You can use scrap booking embellishments or card making embellishments to add elaborate detail to the photo holder."
        },
        {
          "headline":"Wait for the paint on the rock to dry.",
          "description":"Once the base is dry, you can begin attaching your wires to the base."
        }
      ]
    },
    {
      "name":"Attaching the Wire to the Base",
      "steps":[
        {
          "headline":"Place the bottom of the wire (the end without scrolls) underneath the rock.",
          "description":"Begin twisting the wire around the rock. After you complete 1 wrap around the circle, continue wrapping the wire until you reach the length where you want the scroll to be."
        },
        {
          "headline":"Twist the remaining wire on the rock into additional scrolls once you have completed a minimum of 3 rotations around the rock.",
          "description":""
        },
        {
          "headline":"Cut the remaining wire with the wire cutters.",
          "description":"Adjust the wire on the holder so that it extends upward."
        }
      ]
    },
    {
      "name":"Method 4",
      "steps":[
        {
          "headline":"Place photos in between the circular scrolls you created with the wire.",
          "description":"Keep in mind the more circles the picture passes through, the stronger the hold will be."
        },
        {
          "headline":"Adjust the picture on the wire.",
          "description":"To give the wire picture holder a fan like appearance, spread the wires on the picture holder outward."
        },
        {
          "headline":"Experiment with the look of the wires by adjusting the wires different ways.",
          "description":"To give the wire picture holder a special effect, push some of the wires forward and some backward."
        }
      ]
    }
  ],
  "text":" Make Wire Scrolls for the Wire Photo Holder Cut the chicken wire to the desired length. Allow an extra 10 to 12 inches (254 mm to 304 mm) for twisting the wire to make circular scrolls and to wrap the wire holders around the base. Take 1 end of the wire at the tip and bend it inward. Hold it tight, so that the wire curls. Continue bending it inward until you form a circle. Pull the wire inward with the fingers. Continue doing this until you notice a circular pattern forming. Once you form 5 to 6 circles, discontinue making the circles and instead gently bend the remaining wire inward and allow the remaining wire to hang down. Grab another piece of wire and continue making the circles until you make 4 or 5 of picture holder scrolls. Once you complete this, you can begin working on the base of the wire photo holder. Create the Base of the Wire Photo Holder Use a rock or figurine that has a hole in the middle that extends all the way to the bottom of the figurine. To add even more detail to the rock, you can use acrylic paint to paint a colorful theme on the rock, which matches the photos displayed above the rock or figurine. Paint the rock with acrylic paint. Paint the rock according to the theme of the pictures being displayed. When you have a beach-like theme, you can paint a small landscape of the beach on the rock. When you have a camping theme, you can paint a small campground with trees and mountains on the rock. Apply embellishments to the rocks when you don't have paint on hand or when you want to add detail that is difficult to paint. You can use scrap booking embellishments or card making embellishments to add elaborate detail to the photo holder. Wait for the paint on the rock to dry. Once the base is dry, you can begin attaching your wires to the base. Attaching the Wire to the Base Place the bottom of the wire (the end without scrolls) underneath the rock. Begin twisting the wire around the rock. After you complete 1 wrap around the circle, continue wrapping the wire until you reach the length where you want the scroll to be. Twist the remaining wire on the rock into additional scrolls once you have completed a minimum of 3 rotations around the rock.  Cut the remaining wire with the wire cutters. Adjust the wire on the holder so that it extends upward. Method 4 Place photos in between the circular scrolls you created with the wire. Keep in mind the more circles the picture passes through, the stronger the hold will be. Adjust the picture on the wire. To give the wire picture holder a fan like appearance, spread the wires on the picture holder outward. Experiment with the look of the wires by adjusting the wires different ways. To give the wire picture holder a special effect, push some of the wires forward and some backward.",
  "tyn_model":[
    "wire",
    "acrylic paint",
    "paint",
    "wire picture holder",
    "chicken wire",
    "wire holders",
    "picture holder",
    "wire photo holder",
    "rock",
    "scrap booking embellishments",
    "wires",
    "wire cutters"
  ],
  "tyn_section":[

  ]
}