{
  "title":"How to Make Filo Pastry",
  "url":"https://www.wikihow.com/Make-Filo-Pastry",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Pastries"
  ],
  "methods":[
    {
      "name":"Making the Dough",
      "steps":[
        {
          "headline":"Sift the flour and salt into a bowl, stirring to mix.",
          "description":"Whisk it up quickly to make sure it is all well mixed and evenly distributed, without chunks."
        },
        {
          "headline":"Make a well in the center of the flour, adding the olive oil, vinegar/lemon, and warm water.",
          "description":"A well is simply a hole in the center of the bowl of flour, which stores the liquids in one place so that you can mix them in gradually. Warm water will help you maneuver the dough, and start to loosen up the flour proteins. Use the hottest water you can get out of the tap for the best results."
        },
        {
          "headline":"Stir the mixture as you until it becomes a well-combined dough.",
          "description":"If you have a stand mixer, like a Kitchen-Aid, use the paddle attachment for 3-4 minutes. Otherwise, use a wooden spoon to fold the ingredients slowly into one another, working towards your well of liquids to slowly incorporate the flour. The dough should be shaggy, but still one consistent piece. If the dough is too dry or hard, and you have trouble mixing, add more water in 1-2 tablespoon increments. If the dough is too wet or soft, add more flour slowly, mixing it all in before adding more."
        },
        {
          "headline":"Place the dough on a lightly floured countertop and cover your hands in olive oil.",
          "description":"This is to help the kneading process. It also helps incorporate some more olive oil into the dough evenly."
        },
        {
          "headline":"Knead the dough for 10-15 minutes until smooth and shiny, adding oil to your hands if it sticks.",
          "description":"You want to really put your weight into the dough, working it into a shiny, consistent ball. To knead, pick up a third of the dough ball and fold it to the top of the dough. Then, use the heel of your hand to press this fold down into the center of the dough. Rotate the ball a quarter turn and repeat, pulling up a different third of dough. About halfway through kneading, flip the dough over and knead from the opposite side."
        },
        {
          "headline":"Place the dough in an oiled bowl, cover with a damp towel, and let it sit for 2 hours.",
          "description":"You can leave it overnight if you desire. This lets the glutens developed in the flour relax, which will make the dough much smoother and easier to work with without ripping. Want to work a bit faster? Leave it at room temperature for just one hour."
        }
      ]
    },
    {
      "name":"Forming Paper-Thin Layers By Hand",
      "steps":[
        {
          "headline":"Set the bowl out for 30-60 minutes to return to room temperature before shaping.",
          "description":"If you've been keeping the dough in the fridge, make sure to let it warm back up."
        },
        {
          "headline":"Cut the dough into 8-10 equal pieces.",
          "description":"The whole bowl of dough is far, far too big to roll out at once, so you'll need to take it in individual pieces."
        },
        {
          "headline":"Lay a piece of dough out on a lightly floured surface.",
          "description":"The flour prevents the dough from sticking. If it sticks to your hands or the rolling pin, sprinkle some flour on both of them to keep them dry and stick-free."
        },
        {
          "headline":"Roll the dough out as thin as you can with a rolling pin.",
          "description":"You won't get the necessary paper-thin dough just with the rolling pin, but you can get close. Work to form a long rectangle, as thin as you can get it, before moving on to your dowel. Remember to sprinkle more flour if the dough is sticking."
        },
        {
          "headline":"Grab your wooden dowel and slowly begin wrapping the sheet of dough around it.",
          "description":"Leaving the dough on the countertop, place the dowel on top of one of the short edges of dough. Curl the dough around the dowel, as if you were about to wind the dough around the dowel. If you don't have a dowel: Alternatively, you can thin the dough out using the back of your hands, like it was a pizza crust. Drape the dough over the back of both of your hands and slowly work them further and further apart, until the dough is almost see-through. Note, however, this commonly causes rips."
        },
        {
          "headline":"Roll the dowel over the dough pressing down and out to spread it thin.",
          "description":"This is the hardest part, and will take some practice. You want to roll the dowel forward to curl the dough around it. Think about making a Play-Doh snake on the table, using both hands to roll it forward. As you do, try to also push your hands outwards, spreading the dough along the side of the dowel as you work. Again, imagine you have a limited piece of Play-Doh and wanted to make a long, thin snake. The exact amount of pressure to exert is a matter of trial and error, but will come with some practice."
        },
        {
          "headline":"Unroll the dough from the dowel carefully.",
          "description":"When done, you should have a nice, round, and thin sheet of filo dough waiting for you. It's okay if there are a few rips -- it is to be expected in the early runs."
        },
        {
          "headline":"Pinch together any rips, or cut off any excess dough and use it to patch up holes.",
          "description":"With a dough this thin, the occasional rip is to be expected. The good news is that these rips won't affect the final flavor, or even the texture, of the finished pastry. Simply fold together to dough to cover up wrinkles, or use a little excess dough to iron over the holes. Large, nasty rips that can't be easily patched aren't ruined completely. Simply roll the dough back up, knead it for 1-2 minutes, then try to re-roll it out."
        },
        {
          "headline":"Place finished dough on parchment paper, then brush liberally with olive oil.",
          "description":"This prevents the dough from drying out, cracking, or sticking to other layers. Layer the finished, paper thin dough on top of each other, brushing each one with olive oil."
        }
      ]
    },
    {
      "name":"Forming Paper-Thin Layers with a Pasta Maker",
      "steps":[
        {
          "headline":"Set the bowl out for 30-60 minutes to return to room temperature before using.",
          "description":"If you've been keeping the dough in the fridge, make sure to let it warm back up."
        },
        {
          "headline":"Cut the dough into 12 even pieces.",
          "description":"These should be the perfect size to run through your pasta maker, but be aware the not all machines are created evenly. If you need to cut more, smaller pieces that is okay. This won't affect your final dough."
        },
        {
          "headline":"Roll out the dough lightly, forming a small disk.",
          "description":"Don't worry about getting it too thin at this stage, just get it started. The pasta machine will take care of the rest."
        },
        {
          "headline":"Run the dough through the pasta maker on its thickest setting.",
          "description":"This is usually \"1,\" as most pasta machines get thinner as the setting gets higher. You can usually tell which setting is wide and which is thin -- there is a very visible difference between the settings."
        },
        {
          "headline":"Sprinkle your fingers, the rollers, and dough with flour if it begins to stick.",
          "description":"This will prevent the dough from getting caught and ripping. You don't nee much, just a light dusting on your fingers will usually take care of any issues."
        },
        {
          "headline":"Keep running the dough on thinner settings with each pass.",
          "description":"Once you finish the first run, crank the machine up and run it again."
        },
        {
          "headline":"Pinch together any rips in the dough and run it again on the same setting.",
          "description":"If you rip the dough, don't worry too much. Pinch it back together, or cut off a little excess section to patch up the rip. Then run it through the last setting you just used to mend the dough up, proceeding with thinner settings after this. Depending on what you're making, it is usually okay if some of the dough rips. Filo dough is usually stacked and layered, meaning that only a pretty top layer matters."
        },
        {
          "headline":"Finish with a pass on the thinnest possible setting.",
          "description":"Keep working upwards on your pasta machine, being sure to handle the dough carefully as it gets thinner and thinner. Make your final pass on \"9,\" or whatever your pasta machine's highest setting is, and then set the dough aside."
        },
        {
          "headline":"Place finished dough on parchment paper and brush with olive oil before starting on the next piece.",
          "description":"This prevents the thin dough from drying out or cracking, and prevents the later layers from sticking. Use a cooking brush and liberally apply olive oil. You can now stack each thin layer of dough on top of each other, brushing the tops with oil, until you've thinned all the dough."
        }
      ]
    }
  ],
  "text":" Making the Dough Sift the flour and salt into a bowl, stirring to mix. Whisk it up quickly to make sure it is all well mixed and evenly distributed, without chunks. Make a well in the center of the flour, adding the olive oil, vinegar/lemon, and warm water. A well is simply a hole in the center of the bowl of flour, which stores the liquids in one place so that you can mix them in gradually. Warm water will help you maneuver the dough, and start to loosen up the flour proteins. Use the hottest water you can get out of the tap for the best results. Stir the mixture as you until it becomes a well-combined dough. If you have a stand mixer, like a Kitchen-Aid, use the paddle attachment for 3-4 minutes. Otherwise, use a wooden spoon to fold the ingredients slowly into one another, working towards your well of liquids to slowly incorporate the flour. The dough should be shaggy, but still one consistent piece. If the dough is too dry or hard, and you have trouble mixing, add more water in 1-2 tablespoon increments. If the dough is too wet or soft, add more flour slowly, mixing it all in before adding more. Place the dough on a lightly floured countertop and cover your hands in olive oil. This is to help the kneading process. It also helps incorporate some more olive oil into the dough evenly. Knead the dough for 10-15 minutes until smooth and shiny, adding oil to your hands if it sticks. You want to really put your weight into the dough, working it into a shiny, consistent ball. To knead, pick up a third of the dough ball and fold it to the top of the dough. Then, use the heel of your hand to press this fold down into the center of the dough. Rotate the ball a quarter turn and repeat, pulling up a different third of dough. About halfway through kneading, flip the dough over and knead from the opposite side. Place the dough in an oiled bowl, cover with a damp towel, and let it sit for 2 hours. You can leave it overnight if you desire. This lets the glutens developed in the flour relax, which will make the dough much smoother and easier to work with without ripping. Want to work a bit faster? Leave it at room temperature for just one hour. Forming Paper-Thin Layers By Hand Set the bowl out for 30-60 minutes to return to room temperature before shaping. If you've been keeping the dough in the fridge, make sure to let it warm back up. Cut the dough into 8-10 equal pieces. The whole bowl of dough is far, far too big to roll out at once, so you'll need to take it in individual pieces. Lay a piece of dough out on a lightly floured surface. The flour prevents the dough from sticking. If it sticks to your hands or the rolling pin, sprinkle some flour on both of them to keep them dry and stick-free. Roll the dough out as thin as you can with a rolling pin. You won't get the necessary paper-thin dough just with the rolling pin, but you can get close. Work to form a long rectangle, as thin as you can get it, before moving on to your dowel. Remember to sprinkle more flour if the dough is sticking. Grab your wooden dowel and slowly begin wrapping the sheet of dough around it. Leaving the dough on the countertop, place the dowel on top of one of the short edges of dough. Curl the dough around the dowel, as if you were about to wind the dough around the dowel. If you don't have a dowel: Alternatively, you can thin the dough out using the back of your hands, like it was a pizza crust. Drape the dough over the back of both of your hands and slowly work them further and further apart, until the dough is almost see-through. Note, however, this commonly causes rips. Roll the dowel over the dough pressing down and out to spread it thin. This is the hardest part, and will take some practice. You want to roll the dowel forward to curl the dough around it. Think about making a Play-Doh snake on the table, using both hands to roll it forward. As you do, try to also push your hands outwards, spreading the dough along the side of the dowel as you work. Again, imagine you have a limited piece of Play-Doh and wanted to make a long, thin snake. The exact amount of pressure to exert is a matter of trial and error, but will come with some practice. Unroll the dough from the dowel carefully. When done, you should have a nice, round, and thin sheet of filo dough waiting for you. It's okay if there are a few rips -- it is to be expected in the early runs. Pinch together any rips, or cut off any excess dough and use it to patch up holes. With a dough this thin, the occasional rip is to be expected. The good news is that these rips won't affect the final flavor, or even the texture, of the finished pastry. Simply fold together to dough to cover up wrinkles, or use a little excess dough to iron over the holes. Large, nasty rips that can't be easily patched aren't ruined completely. Simply roll the dough back up, knead it for 1-2 minutes, then try to re-roll it out. Place finished dough on parchment paper, then brush liberally with olive oil. This prevents the dough from drying out, cracking, or sticking to other layers. Layer the finished, paper thin dough on top of each other, brushing each one with olive oil. Forming Paper-Thin Layers with a Pasta Maker Set the bowl out for 30-60 minutes to return to room temperature before using. If you've been keeping the dough in the fridge, make sure to let it warm back up. Cut the dough into 12 even pieces. These should be the perfect size to run through your pasta maker, but be aware the not all machines are created evenly. If you need to cut more, smaller pieces that is okay. This won't affect your final dough. Roll out the dough lightly, forming a small disk. Don't worry about getting it too thin at this stage, just get it started. The pasta machine will take care of the rest. Run the dough through the pasta maker on its thickest setting. This is usually \"1,\" as most pasta machines get thinner as the setting gets higher. You can usually tell which setting is wide and which is thin -- there is a very visible difference between the settings. Sprinkle your fingers, the rollers, and dough with flour if it begins to stick. This will prevent the dough from getting caught and ripping. You don't nee much, just a light dusting on your fingers will usually take care of any issues. Keep running the dough on thinner settings with each pass. Once you finish the first run, crank the machine up and run it again. Pinch together any rips in the dough and run it again on the same setting. If you rip the dough, don't worry too much. Pinch it back together, or cut off a little excess section to patch up the rip. Then run it through the last setting you just used to mend the dough up, proceeding with thinner settings after this. Depending on what you're making, it is usually okay if some of the dough rips. Filo dough is usually stacked and layered, meaning that only a pretty top layer matters. Finish with a pass on the thinnest possible setting. Keep working upwards on your pasta machine, being sure to handle the dough carefully as it gets thinner and thinner. Make your final pass on \"9,\" or whatever your pasta machine's highest setting is, and then set the dough aside. Place finished dough on parchment paper and brush with olive oil before starting on the next piece. This prevents the thin dough from drying out or cracking, and prevents the later layers from sticking. Use a cooking brush and liberally apply olive oil. You can now stack each thin layer of dough on top of each other, brushing the tops with oil, until you've thinned all the dough.",
  "tyn_model":[
    "flour",
    "olive oil",
    "dowel",
    "dough",
    "bowl",
    "water",
    "rolling pin",
    "pasta maker",
    "pasta machine",
    "oil",
    "play-doh",
    "parchment paper",
    "salt",
    "vinegar",
    "lemon",
    "stand mixer",
    "kitchen-aid",
    "wooden spoon",
    "oiled bowl",
    "wooden dowel",
    "filo dough",
    "pastry",
    "pasta machines",
    "machine",
    "cooking brush"
  ],
  "tyn_section":[

  ]
}