{
  "title":"How to Make a Chocolate Yule Log",
  "url":"https://www.wikihow.com/Make-a-Chocolate-Yule-Log",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "parts":[
    {
      "name":"Making the Jelly Roll Cake",
      "steps":[
        {
          "headline":"Preheat your oven to 350ºF (177ºC) or Gas Mark 4.",
          "description":"Lower the rack to the center of your oven."
        },
        {
          "headline":"Spray a 17\" x 20\" (40cm x 30cm) pan with cooking spray.",
          "description":"Place a piece of parchment paper onto the sprayed pan, and spray the parchment with cooking spray."
        },
        {
          "headline":"Fill a saucepan halfway full of water.",
          "description":"Bring the water to a boil, and turn the heat down so that the water simmers."
        },
        {
          "headline":"Place a bowl on top of the saucepan.",
          "description":"Put the chopped chocolate into the bowl and allow it to melt, stirring occasionally with a plastic spoon. Remove the melted chocolate from the heat and allow it to cool slightly."
        },
        {
          "headline":"Combine 1/4 cup (50g) sugar and the egg yolks in a bowl.",
          "description":"Beat the mixture for 5 minutes, until the yolks are light and fluffy, using a handheld mixer or a stand mixer with a paddle attachment. You will know that the eggs are ready when you can pull the mixer blades out of the bowl, and the egg flows off of the blades slowly in a thin ribbon."
        },
        {
          "headline":"Add the vanilla extract and beat until just combined.",
          "description":"Then, add the cooled melted chocolate, mixing until the chocolate is just incorporated."
        },
        {
          "headline":"Whip the egg whites in a separate bowl using either a handheld mixer or a stand mixer with a whisk attachment.",
          "description":"When the whites are foamy, add the cream of tartar and beat the egg whites on high speed until soft peaks form. Add the remaining 2 tablespoons (28g) of sugar gradually until the peaks are stiff and glossy."
        },
        {
          "headline":"Fold the egg whites into the egg yolk mixture using a large flat plastic spatula.",
          "description":"Do not overmix these ingredients, or you'll deflate the batter."
        },
        {
          "headline":"Spread the batter into the prepared pan so that the top is even.",
          "description":""
        },
        {
          "headline":"Bake the cake for 15 to 17 minutes.",
          "description":"The cake should have lost its shine, and it should spring back when you touch the surface."
        },
        {
          "headline":"Allow the cake to cool on the stovetop.",
          "description":"Cover it with a clean, slightly damp towel."
        }
      ]
    },
    {
      "name":"Assembling the Yule Log",
      "steps":[
        {
          "headline":"Spread the chocolate cream over the surface of the cooled cake using an offset spatula.",
          "description":"Reserve 2 tablespoons of cream for later."
        },
        {
          "headline":"Roll the cake into a log by tucking one edge inward and rolling toward the opposite edge.",
          "description":"As you roll the cake, gently pull off the parchment paper. The cake may crack slightly, but don't allow it to break."
        },
        {
          "headline":"Cut off one end of the cake at an angle with a knife.",
          "description":"Set the slice aside."
        },
        {
          "headline":"Place the cake seam-side down onto a serving platter.",
          "description":"Attach the cut piece of cake to the side of the log using your reserved 2 tablespoons of chocolate cream."
        }
      ]
    },
    {
      "name":"Frosting the Yule Log",
      "steps":[
        {
          "headline":"Heat the frosting ingredients in a saucepan on the stovetop.",
          "description":"Bring the cream to a simmer so that the chocolate can melt."
        },
        {
          "headline":"Pour the cream and chocolate into a bowl.",
          "description":"Cover the bowl with plastic wrap and let it cool for a couple of hours."
        },
        {
          "headline":"Whip the cooled frosting mixture using a handheld mixer or a stand mixer with a whisk attachment.",
          "description":"Mix on high speed until the frosting has a creamy texture."
        },
        {
          "headline":"Spread the frosting over the surface of the rolled Yule log.",
          "description":"Remember to cover the ends."
        },
        {
          "headline":"Drag a fork lengthwise through the frosting so that the exterior of the log has the appearance of bark.",
          "description":"Tuck plastic holly berries and leaves around the log to give it a festive look."
        },
        {
          "headline":"Sprinkle the Yule log with powdered sugar.",
          "description":"Refrigerate the Yule log until about 1 hour before you decide to serve it."
        },
        {
          "headline":"Cut the Yule log and serve it with a cup of strong coffee.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Jelly Roll Cake Preheat your oven to 350ºF (177ºC) or Gas Mark 4. Lower the rack to the center of your oven. Spray a 17\" x 20\" (40cm x 30cm) pan with cooking spray. Place a piece of parchment paper onto the sprayed pan, and spray the parchment with cooking spray. Fill a saucepan halfway full of water. Bring the water to a boil, and turn the heat down so that the water simmers. Place a bowl on top of the saucepan. Put the chopped chocolate into the bowl and allow it to melt, stirring occasionally with a plastic spoon. Remove the melted chocolate from the heat and allow it to cool slightly. Combine 1/4 cup (50g) sugar and the egg yolks in a bowl. Beat the mixture for 5 minutes, until the yolks are light and fluffy, using a handheld mixer or a stand mixer with a paddle attachment. You will know that the eggs are ready when you can pull the mixer blades out of the bowl, and the egg flows off of the blades slowly in a thin ribbon. Add the vanilla extract and beat until just combined. Then, add the cooled melted chocolate, mixing until the chocolate is just incorporated. Whip the egg whites in a separate bowl using either a handheld mixer or a stand mixer with a whisk attachment. When the whites are foamy, add the cream of tartar and beat the egg whites on high speed until soft peaks form. Add the remaining 2 tablespoons (28g) of sugar gradually until the peaks are stiff and glossy. Fold the egg whites into the egg yolk mixture using a large flat plastic spatula. Do not overmix these ingredients, or you'll deflate the batter. Spread the batter into the prepared pan so that the top is even.  Bake the cake for 15 to 17 minutes. The cake should have lost its shine, and it should spring back when you touch the surface. Allow the cake to cool on the stovetop. Cover it with a clean, slightly damp towel. Assembling the Yule Log Spread the chocolate cream over the surface of the cooled cake using an offset spatula. Reserve 2 tablespoons of cream for later. Roll the cake into a log by tucking one edge inward and rolling toward the opposite edge. As you roll the cake, gently pull off the parchment paper. The cake may crack slightly, but don't allow it to break. Cut off one end of the cake at an angle with a knife. Set the slice aside. Place the cake seam-side down onto a serving platter. Attach the cut piece of cake to the side of the log using your reserved 2 tablespoons of chocolate cream. Frosting the Yule Log Heat the frosting ingredients in a saucepan on the stovetop. Bring the cream to a simmer so that the chocolate can melt. Pour the cream and chocolate into a bowl. Cover the bowl with plastic wrap and let it cool for a couple of hours. Whip the cooled frosting mixture using a handheld mixer or a stand mixer with a whisk attachment. Mix on high speed until the frosting has a creamy texture. Spread the frosting over the surface of the rolled Yule log. Remember to cover the ends. Drag a fork lengthwise through the frosting so that the exterior of the log has the appearance of bark. Tuck plastic holly berries and leaves around the log to give it a festive look. Sprinkle the Yule log with powdered sugar. Refrigerate the Yule log until about 1 hour before you decide to serve it. Cut the Yule log and serve it with a cup of strong coffee.  Finished. ",
  "tyn_model":[
    "bowl",
    "chocolate",
    "saucepan",
    "water",
    "handheld mixer",
    "stand mixer",
    "cream",
    "oven",
    "cooking spray",
    "parchment paper",
    "sugar",
    "whisk",
    "chocolate cream",
    "jelly roll cake",
    "plastic spoon",
    "eggs",
    "mixer blades",
    "vanilla extract",
    "cream of tartar",
    "egg yolk",
    "large flat plastic spatula",
    "spatula",
    "knife",
    "serving platter",
    "cake",
    "yule log",
    "plastic wrap",
    "fork",
    "powdered sugar",
    "strong coffee"
  ],
  "tyn_section":[

  ]
}