{
  "title":"How to Cook Orange Roughy",
  "url":"https://www.wikihow.com/Cook-Orange-Roughy",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Purchase the orange roughy.",
          "description":"Orange roughy is growing in popularity, and now can be found at most grocery stores or fish markets. When choosing orange roughy, look for a fish that has moist skin, clear eyes, and does not present a fishy odor. While orange roughy is most commonly sold in fillets, some locations may still sell the whole fish. If this is a problem, ask the fishmonger to clean the fish for you before you purchase it. Most grocery store or fish market experts will be willing to do this free of charge."
        },
        {
          "headline":"Season the fish.",
          "description":"Orange roughy, which is to be grilled, should be seasoned with a small amount of salt and pepper on both sides before starting the cooking process. Drizzling the fish with a small amount of freshly squeezed lemon juice is also a good choice."
        },
        {
          "headline":"Prepare the grill.",
          "description":"A grill that is being used to cook orange roughy should be quite hot. Start the grill at least 20 minutes before applying the fish for best cooking results."
        },
        {
          "headline":"Place the fish in the grilling basket.",
          "description":"Orange roughy has a relatively delicate texture. Because of this, grilling can be quite hard on the fish physically. To prevent tearing or damaging the flesh of the fish, consider placing it in a grilling basket. These are small \"cages\" which can be placed directly on top of a grill, and are effective at cooking a variety of foods which otherwise might not fare well on a grill."
        },
        {
          "headline":"Cook the fish.",
          "description":"In general, 4 minutes per side on the grill for the orange roughy is plenty of time to ensure complete cooking."
        }
      ]
    },
    {
      "name":"Broiling the Fish",
      "steps":[
        {
          "headline":"Season the fish.",
          "description":"Like during grilling, orange roughy which is to be broiled must also be seasoned before cooking. In this method, consider sprinkling the fish with a small amount of Cajun seasoning to enhance the cooking process."
        },
        {
          "headline":"Prepare the equipment.",
          "description":"To broil orange roughy, you will first need to set the oven to broil. In addition, spraying a large baking sheet or broiling pan with cooking spray is necessary to prevent the delicate flesh of the fish from sticking to the pan during cooking."
        },
        {
          "headline":"Place the fish in the oven.",
          "description":"Place the prepared fish on the greased baking sheet or broiling pan, and place in the oven. Ideally, the fish should be about 3 inches (7.6 cm) away from the heat source for best results."
        },
        {
          "headline":"Cook the fish.",
          "description":"Orange roughy should be broiled for approximately 6 minutes. Test with a fork to ensure the fish is tender before removing from the heat."
        }
      ]
    },
    {
      "name":"Microwaving the Fish",
      "steps":[
        {
          "headline":"Season the fish.",
          "description":"A light seasoning of lemon, salt, and pepper is ideal while microwaving orange roughy."
        },
        {
          "headline":"Cook the orange roughy.",
          "description":"Place the fish in a microwave-safe bowl, and place in the microwave. Cook with general heat for approximately 4 minutes, and check for doneness. If the fish does not flake easily with a fork, continue cooking for 30 second intervals until the fish appears to be completely cooked."
        }
      ]
    }
  ],
  "text":" Steps Purchase the orange roughy. Orange roughy is growing in popularity, and now can be found at most grocery stores or fish markets. When choosing orange roughy, look for a fish that has moist skin, clear eyes, and does not present a fishy odor. While orange roughy is most commonly sold in fillets, some locations may still sell the whole fish. If this is a problem, ask the fishmonger to clean the fish for you before you purchase it. Most grocery store or fish market experts will be willing to do this free of charge. Season the fish. Orange roughy, which is to be grilled, should be seasoned with a small amount of salt and pepper on both sides before starting the cooking process. Drizzling the fish with a small amount of freshly squeezed lemon juice is also a good choice. Prepare the grill. A grill that is being used to cook orange roughy should be quite hot. Start the grill at least 20 minutes before applying the fish for best cooking results. Place the fish in the grilling basket. Orange roughy has a relatively delicate texture. Because of this, grilling can be quite hard on the fish physically. To prevent tearing or damaging the flesh of the fish, consider placing it in a grilling basket. These are small \"cages\" which can be placed directly on top of a grill, and are effective at cooking a variety of foods which otherwise might not fare well on a grill. Cook the fish. In general, 4 minutes per side on the grill for the orange roughy is plenty of time to ensure complete cooking. Broiling the Fish Season the fish. Like during grilling, orange roughy which is to be broiled must also be seasoned before cooking. In this method, consider sprinkling the fish with a small amount of Cajun seasoning to enhance the cooking process. Prepare the equipment. To broil orange roughy, you will first need to set the oven to broil. In addition, spraying a large baking sheet or broiling pan with cooking spray is necessary to prevent the delicate flesh of the fish from sticking to the pan during cooking. Place the fish in the oven. Place the prepared fish on the greased baking sheet or broiling pan, and place in the oven. Ideally, the fish should be about 3 inches (7.6 cm) away from the heat source for best results. Cook the fish. Orange roughy should be broiled for approximately 6 minutes. Test with a fork to ensure the fish is tender before removing from the heat. Microwaving the Fish Season the fish. A light seasoning of lemon, salt, and pepper is ideal while microwaving orange roughy. Cook the orange roughy. Place the fish in a microwave-safe bowl, and place in the microwave. Cook with general heat for approximately 4 minutes, and check for doneness. If the fish does not flake easily with a fork, continue cooking for 30 second intervals until the fish appears to be completely cooked.",
  "tyn_model":[
    "orange roughy",
    "grill",
    "fish",
    "oven",
    "grilling basket",
    "fork",
    "fish market",
    "salt and pepper",
    "freshly squeezed lemon juice",
    "cajun seasoning",
    "baking sheet or",
    "broiling pan",
    "cooking spray",
    "baking sheet or broiling pan",
    "lemon",
    "salt",
    "pepper",
    "microwave-safe bowl",
    "microwave"
  ],
  "tyn_section":[

  ]
}