{
  "title":"How to Reduce Your Carbon Footprint in the Garden",
  "url":"https://www.wikihow.com/Reduce-Your-Carbon-Footprint-in-the-Garden",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Projects"
  ],
  "methods":[
    {
      "name":"Choosing the Right Plants",
      "steps":[
        {
          "headline":"Grow your own vegetables and fruits.",
          "description":"Set aside one corner of your garden for tending a few small crops like tomatoes, strawberries, beans, peppers, and squash. Fewer trips to the grocery store will help you save money and fuel, as well as say no to the plastic bags and packages that have a tendency to pile up once you’re there. Raising a selection of your own crops will also ensure that you always have fresh, healthy fruits and vegetables to eat. Make room for a patch of fresh herbs like rosemary, basil, and cilantro. You’ll then have everything you need to put together a delicious meal."
        },
        {
          "headline":"Fill in open space with trees, shrubs, and flowers.",
          "description":"The less grass there is covering your lawn, the less gas you'll consume while mowing it. In addition, trees and other large plants absorb carbon and convert it to clean, breathable oxygen, which helps to purify the air. Attractive, well-kept landscaping can also add value to your property, making it practical as well as responsible."
        },
        {
          "headline":"Plant shade-producing trees near your home.",
          "description":"A wall of natural shade can cool your home during the summer and block cold winds in the winter. Situate your trees near your fenceline to establish a boundary, or disperse them throughout your yard for more of a forest effect. Trees can offer privacy when strategically positioned near windows, patios, and property lines. Prune the lower branches of trees planted on the sunrise side of your home to keep them from obstructing the view."
        },
        {
          "headline":"Bring in more native plants that are well-suited for your area.",
          "description":"These species generally require less water and fertilizer, and will have all the nutrients they need in the surrounding soil. They’re also more resistant to common pests, which means you won’t be forced to saturate your lawn or garden with harmful pesticides. Consult a regional gardening handbook or use an online plant finder tool to learn what sorts of plants are indigenous to your area. Native plants play a vital role in supporting a diverse and flourishing local ecosystem."
        }
      ]
    },
    {
      "name":"Reducing, Reusing, and Recycling",
      "steps":[
        {
          "headline":"Decrease the overall size of your lawn.",
          "description":"Put in a paved patio or picnic area to create some outdoor living space. Alternatively, you could add ornamental touches like a man-made pond, rock garden, or bed of wildflowers  The idea is to limit the amount of space that has to be regularly mowed, fertilized, or sprayed. Grass itself is an unexpected source of serious carbon emissions. Downsizing therefore not only has the potential to beautify your property, but make it that much greener at the same time. Consider relocating your gardening hutch or workshed to one corner of your yard to cover up patches of unused grass."
        },
        {
          "headline":"Turn kitchen and garden waste into useful compost.",
          "description":"Buy or make a compost bin, or simply designate an out-of-the way corner of your yard as a dump site—all you need is a space about 3 square feet in size. You can throw in anything that’s biodegradable, including grass clippings, raked leaves, fruit and vegetable scraps, and even shredded newspaper or cardboard. Turn the compost frequently with a rake and keep it slightly moist to speed up the decomposition process. Never put meats, dairy products, or processed food items in your compost pile. The bacteria that accumulates when these items decompose can pose a health risk."
        },
        {
          "headline":"Apply mulch liberally around plants and trees to conserve water.",
          "description":"Spread the mulch a few inches away from the base of your plants and water it thoroughly. Mulch promotes healthy growth, prevents runoff, and smothers weeds. It even insulates root systems during particularly hot or cold stretches of weather. Shredded hardwood, pine straw, and recycled leaf mulches are among the most popular varieties used by environmentally-conscious gardeners. Avoid piling your mulch any higher than about 3–4 inches (7.6–10.2 cm). Too thick a layer can interfere with the absorption of water and nutrients."
        },
        {
          "headline":"Collect and store rainwater in barrels.",
          "description":"Set up your barrels near your garden so that you’ll always have a fresh supply of water close at hand. You can use this water to fill watering cans and give thirsty plants, trees, and crops just as much moisture as they need rather than letting the hose run interminably. If you live in an area that receives sparse precipitation, situate your rain barrels under a downspout to help them fill up faster. Rainwater can even be used for drinking once it’s been properly purified."
        },
        {
          "headline":"Stop using chemical fertilizers and pesticides.",
          "description":"These products contain chemicals that may be harmful to both the user and the surrounding environment. If you want to be more mindful of your cultivation practices, switch to all-natural organic fertilizers and pesticides, or learn to make your own from basic household items. You can also use the material from your compost pile for fertilizer, effectively killing two birds with one stone."
        }
      ]
    },
    {
      "name":"Using More Efficient Tools",
      "steps":[
        {
          "headline":"Make use of handheld tools whenever possible.",
          "description":"There are plenty of opportunities to go green while tending to the sweat-inducing work in your garden. Leave the gas-powered tools in the garage and start raking leaves and pulling weeds by hand. You could even downgrade to a push mower to keep your lawn tidy while getting a workout in! Other options for manual manicuring include tilling the soil with a trowel and using an axe to chop up downed trees."
        },
        {
          "headline":"Invest in a soaker hose.",
          "description":"Traditional irrigation systems like sprinklers are responsible for a lot of wasted water. With a soaker hose, you’re only giving your plants as much moisture as they can absorb at one time. And since that water is being deployed from ground level at an extremely low pressure, there’s less chance of overwatering or causing destructive runoff. Simply stretch your soaker hose out along the base of your plants and turn on the main water supply. You can even snake it throughout your garden to make sure the water is only going where you need it. Soaker hoses have been shown to use 30-50% less water on average than standard irrigation systems, which means you’ll be saving money while doing your part to save the planet."
        },
        {
          "headline":"Keep your electric and gas-powered equipment in good condition.",
          "description":"Get in the habit of performing routine maintenance on your tools. Replace air filters at regular intervals, and have cutting blades sharpened or changed as soon as they start to dull. By keeping your motorized equipment running efficiently, you can reduce their overall energy consumption. Most basic maintenance tasks are simple and inexpensive enough to take care of yourself."
        },
        {
          "headline":"Install solar landscape lighting to conserve energy.",
          "description":"Solar lights get their power directly from the sun, so they won’t put a drain on the local electricity or your wallet. They’re a cinch to put in—all you have to do is hang them up or stake them into the ground along the walkways in your garden. As an added bonus, most types come equipped with dimness sensors, so you’ll never have to worry about forgetting to turn them on and off. No wiring or complicated parts means no calls to the electrician for repairs. Another major advantage of solar lighting sources is that they’ll continue to provide illumination even in the event of a power outage."
        }
      ]
    }
  ],
  "text":" Choosing the Right Plants Grow your own vegetables and fruits. Set aside one corner of your garden for tending a few small crops like tomatoes, strawberries, beans, peppers, and squash. Fewer trips to the grocery store will help you save money and fuel, as well as say no to the plastic bags and packages that have a tendency to pile up once you’re there. Raising a selection of your own crops will also ensure that you always have fresh, healthy fruits and vegetables to eat. Make room for a patch of fresh herbs like rosemary, basil, and cilantro. You’ll then have everything you need to put together a delicious meal. Fill in open space with trees, shrubs, and flowers. The less grass there is covering your lawn, the less gas you'll consume while mowing it. In addition, trees and other large plants absorb carbon and convert it to clean, breathable oxygen, which helps to purify the air. Attractive, well-kept landscaping can also add value to your property, making it practical as well as responsible. Plant shade-producing trees near your home. A wall of natural shade can cool your home during the summer and block cold winds in the winter. Situate your trees near your fenceline to establish a boundary, or disperse them throughout your yard for more of a forest effect. Trees can offer privacy when strategically positioned near windows, patios, and property lines. Prune the lower branches of trees planted on the sunrise side of your home to keep them from obstructing the view. Bring in more native plants that are well-suited for your area. These species generally require less water and fertilizer, and will have all the nutrients they need in the surrounding soil. They’re also more resistant to common pests, which means you won’t be forced to saturate your lawn or garden with harmful pesticides. Consult a regional gardening handbook or use an online plant finder tool to learn what sorts of plants are indigenous to your area. Native plants play a vital role in supporting a diverse and flourishing local ecosystem. Reducing, Reusing, and Recycling Decrease the overall size of your lawn. Put in a paved patio or picnic area to create some outdoor living space. Alternatively, you could add ornamental touches like a man-made pond, rock garden, or bed of wildflowers  The idea is to limit the amount of space that has to be regularly mowed, fertilized, or sprayed. Grass itself is an unexpected source of serious carbon emissions. Downsizing therefore not only has the potential to beautify your property, but make it that much greener at the same time. Consider relocating your gardening hutch or workshed to one corner of your yard to cover up patches of unused grass. Turn kitchen and garden waste into useful compost. Buy or make a compost bin, or simply designate an out-of-the way corner of your yard as a dump site—all you need is a space about 3 square feet in size. You can throw in anything that’s biodegradable, including grass clippings, raked leaves, fruit and vegetable scraps, and even shredded newspaper or cardboard. Turn the compost frequently with a rake and keep it slightly moist to speed up the decomposition process. Never put meats, dairy products, or processed food items in your compost pile. The bacteria that accumulates when these items decompose can pose a health risk. Apply mulch liberally around plants and trees to conserve water. Spread the mulch a few inches away from the base of your plants and water it thoroughly. Mulch promotes healthy growth, prevents runoff, and smothers weeds. It even insulates root systems during particularly hot or cold stretches of weather. Shredded hardwood, pine straw, and recycled leaf mulches are among the most popular varieties used by environmentally-conscious gardeners. Avoid piling your mulch any higher than about 3–4 inches (7.6–10.2 cm). Too thick a layer can interfere with the absorption of water and nutrients. Collect and store rainwater in barrels. Set up your barrels near your garden so that you’ll always have a fresh supply of water close at hand. You can use this water to fill watering cans and give thirsty plants, trees, and crops just as much moisture as they need rather than letting the hose run interminably. If you live in an area that receives sparse precipitation, situate your rain barrels under a downspout to help them fill up faster. Rainwater can even be used for drinking once it’s been properly purified. Stop using chemical fertilizers and pesticides. These products contain chemicals that may be harmful to both the user and the surrounding environment. If you want to be more mindful of your cultivation practices, switch to all-natural organic fertilizers and pesticides, or learn to make your own from basic household items. You can also use the material from your compost pile for fertilizer, effectively killing two birds with one stone. Using More Efficient Tools Make use of handheld tools whenever possible. There are plenty of opportunities to go green while tending to the sweat-inducing work in your garden. Leave the gas-powered tools in the garage and start raking leaves and pulling weeds by hand. You could even downgrade to a push mower to keep your lawn tidy while getting a workout in! Other options for manual manicuring include tilling the soil with a trowel and using an axe to chop up downed trees. Invest in a soaker hose. Traditional irrigation systems like sprinklers are responsible for a lot of wasted water. With a soaker hose, you’re only giving your plants as much moisture as they can absorb at one time. And since that water is being deployed from ground level at an extremely low pressure, there’s less chance of overwatering or causing destructive runoff. Simply stretch your soaker hose out along the base of your plants and turn on the main water supply. You can even snake it throughout your garden to make sure the water is only going where you need it. Soaker hoses have been shown to use 30-50% less water on average than standard irrigation systems, which means you’ll be saving money while doing your part to save the planet. Keep your electric and gas-powered equipment in good condition. Get in the habit of performing routine maintenance on your tools. Replace air filters at regular intervals, and have cutting blades sharpened or changed as soon as they start to dull. By keeping your motorized equipment running efficiently, you can reduce their overall energy consumption. Most basic maintenance tasks are simple and inexpensive enough to take care of yourself. Install solar landscape lighting to conserve energy. Solar lights get their power directly from the sun, so they won’t put a drain on the local electricity or your wallet. They’re a cinch to put in—all you have to do is hang them up or stake them into the ground along the walkways in your garden. As an added bonus, most types come equipped with dimness sensors, so you’ll never have to worry about forgetting to turn them on and off. No wiring or complicated parts means no calls to the electrician for repairs. Another major advantage of solar lighting sources is that they’ll continue to provide illumination even in the event of a power outage.",
  "tyn_model":[
    "water",
    "trees",
    "mulch",
    "plants",
    "pesticides",
    "compost",
    "soaker hose",
    "vegetables",
    "—all",
    "tomatoes",
    "strawberries",
    "peppers",
    "squash",
    "herbs",
    "basil",
    "cilantro",
    "flowers",
    "plant finder tool",
    "grass",
    "compost bin",
    "rake",
    "pine straw",
    "recycled leaf mulches",
    "hose",
    "rain barrels",
    "rainwater",
    "fertilizers",
    "fertilizer",
    "trowel",
    "soaker hoses",
    "solar lights",
    "solar lighting"
  ],
  "tyn_section":[

  ]
}