{
  "title":"How to Make Pita Chips",
  "url":"https://www.wikihow.com/Make-Pita-Chips",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Snacks"
  ],
  "methods":[
    {
      "name":"Baking Basic Pita Chips",
      "steps":[
        {
          "headline":"Preheat the oven.",
          "description":"You need a hot oven to produce crunchy pita chips, so set your oven to 375 °F (191 °C) and let it preheat. Line a baking sheet with a layer of parchment paper. Use about a tablespoon (15 ml) of the oil and coat the parchment with a layer of oil using a pastry brush. You can also use a silicone baking mat instead of parchment paper."
        },
        {
          "headline":"Cut the pita bread into wedges.",
          "description":"Transfer the pitas to a cutting board and stack them on top of each other. Cut the pitas in half, and then cut each semicircle in half again. Cut those pita quarters in half again, and then cut the eighths in half for a total of 32 chips."
        },
        {
          "headline":"Oil the wedges.",
          "description":"Use the pastry brush to apply a thin coating of oil to the top and bottom of each pita wedge. You may not need the full quantity of oil, as long as each wedge is coated. Good oils for making pita chips include:\nOlive\nPeanut\nSafflower\nAvocado\nSunflower"
        },
        {
          "headline":"Add the seasonings.",
          "description":"Arrange the wedges in a single layer on the parchment-lined baking sheet. Sprinkle the top of each pita wedge with salt and pepper. Turn the wedges over and repeat on the other side. You can season the pita chips with any herbs and spices you like, such as:\nRosemary, thyme, oregano, and other herbs\nGarlic and onion powder\nCurry powder or garam masala\nCinnamon and sugar (in place of the salt and pepper)\nChinese five-spice\nChili powder\nItalian seasoning\nRas el hanout (an North African spice blend)"
        },
        {
          "headline":"Bake the chips for about 15 minutes.",
          "description":"After the first seven minutes, remove the chips from the oven and carefully turn them over. Bake the chips for an additional seven to 11 minutes. When the chips are crispy and golden brown, remove them from the oven."
        },
        {
          "headline":"Allow the chips to cool before serving.",
          "description":"Set the chips aside and allow them to cool for about 30 minutes. This cooling process is necessary because it will prevent burnt fingers, but also because the chips will crisp up fully as they cool."
        },
        {
          "headline":"Enjoy your chips and store leftovers.",
          "description":"Once the chips are cool to the touch and crispy, they're ready to enjoy with your favorite dips and snacks. Leftovers will keep for up to two days at room temperature. Store them in an airtight container to prevent them from going stale."
        }
      ]
    },
    {
      "name":"Making Homemade Pitas",
      "steps":[
        {
          "headline":"Combine the yeast and water.",
          "description":"In a large bowl, stir together the yeast and warm water. Set the mixture aside for about five minutes. This will give the yeast time to dissolve in the water. When the yeast is ready, it will be foamy and creamy-looking. The ideal water temperature for yeast is between 105 °F (41 °C) and 110 °F (43 °C). Water that’s too cold won’t activate the yeast, and water that’s too hot will kill it."
        },
        {
          "headline":"Add the flour, salt, and oil.",
          "description":"When the yeast is foamy and has dissolved, add the remaining ingredients. Stir the mixture with a spoon or fork to incorporate the flour and water and form a loose dough. You can also use a stand mixer outfitted with the dough hook to combine and knead the dough."
        },
        {
          "headline":"Knead the pita dough.",
          "description":"Sprinkle a counter or other flat work surface with a light dusting of additional flour. Turn the dough out onto the floured surface. Knead the dough with your hands until it forms a smooth and elastic-like ball, about six minutes. Add small amounts of additional flour if the dough sticks to your hands or the counter during kneading."
        },
        {
          "headline":"Set the dough aside to rise.",
          "description":"Drizzle the dough ball with a few drops of oil. Use your hands or a pastry brush to coat the entire ball with the oil. Transfer the dough ball to a clean bowl. Cover the bowl with a clean tea towel and set it aside for one to two hours. The dough is ready when it has doubled in size."
        },
        {
          "headline":"Divide the dough.",
          "description":"When the dough has had plenty of time to rise, remove the tea towel. Dust a clean counter with a small amount of flour, and turn the dough out onto the counter. Cut the dough in half four times to get eight equal wedges of dough. Roll each wedge into a ball."
        },
        {
          "headline":"Roll out the pitas.",
          "description":"Sprinkle a rolling pin with a dusting of flour. Flatten the first dough ball by pressing it down with the palm of your hand. Use the rolling pin to roll out the dough into a circle that’s 9 inches (23 cm) in diameter and a quarter-inch (6 mm) thick. Repeat with the remaining dough balls. Sprinkle the dough and rolling pin with additional flour as you roll if the dough starts sticking to the counter."
        },
        {
          "headline":"Preheat a skillet.",
          "description":"Place a cast iron or thick-bottomed skillet over medium-high heat and let it warm up for two to three minutes. When you think the skillet is hot enough, sprinkle in a few drops of water. The skillet is ready when the water sizzles and boils off immediately."
        },
        {
          "headline":"Coat the skillet with oil.",
          "description":"Add a couple of drops of oil to the preheated skillet. Use a pastry brush to spread the oil around the skillet and coat the entire surface with a thin layer of oil."
        },
        {
          "headline":"Cook each pita for about five minutes.",
          "description":"Transfer one of the rolled-out dough circles to the skillet. Let the dough cook for about 30 seconds. When it starts to bubble, flip the pita with a spatula. Cook the pita for one to two minutes, until toasted. Flip the pita again and cook for an additional one to two minutes. Remove the pita from the pan and transfer it to a wire cooling rack. Repeat with the remaining pitas."
        },
        {
          "headline":"Allow your pitas to cool before enjoying.",
          "description":"Your pitas are ready to eat as soon as they're cool enough to handle. You can use the pitas for wraps, sandwiches, or dipping, or you can turn them into pita chips. You can store leftover pitas at room temperature in an airtight container for a few days."
        }
      ]
    },
    {
      "name":"Serving Pita Chips",
      "steps":[
        {
          "headline":"Serve them with your favorite dips.",
          "description":"Pita chips are most often enjoyed with dip, and these chips are ideal because they're crunchy and sturdy, meaning they're less likely to break when you scoop. There are a number of spreads and condiments that you can dip your pita chips into, and some of the most popular include:\nHummus\nGuacamole\nBaba ghanoush\nCrab dip\nSalsa\nSpinach dip\nArtichoke and asiago dip"
        },
        {
          "headline":"Use the pita in place of croutons.",
          "description":"Pita chips are an excellent substitute for croutons in salads. You can garnish a finished salad with full pita chip wedges, or break the chips up and crumble them into your salad before serving. Good salads to finish with pita chip croutons include:\nGreek\nFattoush\nCaesar\nGarden\nCobb"
        },
        {
          "headline":"Pair them with cheese.",
          "description":"Most people are familiar with crackers and cheese, but there's no reason you can't enjoy pita chips and cheese as a snack, appetizer, or hors d’oeuvre at a party. You can serve the chips with wedges of cheese, creamed cheeses, or grated cheese melted onto the chips in the oven or microwave. Good cheeses to pair with pita chips include brie, cheddar, mozzarella, cream, blue, and gouda."
        },
        {
          "headline":"Dip them in chocolate.",
          "description":"Chocolate-dipped pita chips are a delicious and unique dessert dish or snack. Melt chocolate chips or a bar of chocolate over medium heat in a double boiler. Hold each chip by the wide end and dip the top half of the chip into the melted chocolate. Place the dipped chips on a parchment-lined baking sheet to harden. The best types of pita chips for this are plain, lightly salted, or cinnamon-sugar chips."
        },
        {
          "headline":"Make appetizers.",
          "description":"Pita chips are a perfect size for one- or two-bite appetizers that you can eat as a snack or serve at parties. You can top pita chips with any of your favorite ingredients. For a simple vegetarian appetizer, top each chip with:\nA small avocado wedge\nA thin tomato slice\nGrated or creamed cheese\nA sprinkle of diced green onion"
        }
      ]
    }
  ],
  "text":" Baking Basic Pita Chips Preheat the oven. You need a hot oven to produce crunchy pita chips, so set your oven to 375 °F (191 °C) and let it preheat. Line a baking sheet with a layer of parchment paper. Use about a tablespoon (15 ml) of the oil and coat the parchment with a layer of oil using a pastry brush. You can also use a silicone baking mat instead of parchment paper. Cut the pita bread into wedges. Transfer the pitas to a cutting board and stack them on top of each other. Cut the pitas in half, and then cut each semicircle in half again. Cut those pita quarters in half again, and then cut the eighths in half for a total of 32 chips. Oil the wedges. Use the pastry brush to apply a thin coating of oil to the top and bottom of each pita wedge. You may not need the full quantity of oil, as long as each wedge is coated. Good oils for making pita chips include:\nOlive\nPeanut\nSafflower\nAvocado\nSunflower Add the seasonings. Arrange the wedges in a single layer on the parchment-lined baking sheet. Sprinkle the top of each pita wedge with salt and pepper. Turn the wedges over and repeat on the other side. You can season the pita chips with any herbs and spices you like, such as:\nRosemary, thyme, oregano, and other herbs\nGarlic and onion powder\nCurry powder or garam masala\nCinnamon and sugar (in place of the salt and pepper)\nChinese five-spice\nChili powder\nItalian seasoning\nRas el hanout (an North African spice blend) Bake the chips for about 15 minutes. After the first seven minutes, remove the chips from the oven and carefully turn them over. Bake the chips for an additional seven to 11 minutes. When the chips are crispy and golden brown, remove them from the oven. Allow the chips to cool before serving. Set the chips aside and allow them to cool for about 30 minutes. This cooling process is necessary because it will prevent burnt fingers, but also because the chips will crisp up fully as they cool. Enjoy your chips and store leftovers. Once the chips are cool to the touch and crispy, they're ready to enjoy with your favorite dips and snacks. Leftovers will keep for up to two days at room temperature. Store them in an airtight container to prevent them from going stale. Making Homemade Pitas Combine the yeast and water. In a large bowl, stir together the yeast and warm water. Set the mixture aside for about five minutes. This will give the yeast time to dissolve in the water. When the yeast is ready, it will be foamy and creamy-looking. The ideal water temperature for yeast is between 105 °F (41 °C) and 110 °F (43 °C). Water that’s too cold won’t activate the yeast, and water that’s too hot will kill it. Add the flour, salt, and oil. When the yeast is foamy and has dissolved, add the remaining ingredients. Stir the mixture with a spoon or fork to incorporate the flour and water and form a loose dough. You can also use a stand mixer outfitted with the dough hook to combine and knead the dough. Knead the pita dough. Sprinkle a counter or other flat work surface with a light dusting of additional flour. Turn the dough out onto the floured surface. Knead the dough with your hands until it forms a smooth and elastic-like ball, about six minutes. Add small amounts of additional flour if the dough sticks to your hands or the counter during kneading. Set the dough aside to rise. Drizzle the dough ball with a few drops of oil. Use your hands or a pastry brush to coat the entire ball with the oil. Transfer the dough ball to a clean bowl. Cover the bowl with a clean tea towel and set it aside for one to two hours. The dough is ready when it has doubled in size. Divide the dough. When the dough has had plenty of time to rise, remove the tea towel. Dust a clean counter with a small amount of flour, and turn the dough out onto the counter. Cut the dough in half four times to get eight equal wedges of dough. Roll each wedge into a ball. Roll out the pitas. Sprinkle a rolling pin with a dusting of flour. Flatten the first dough ball by pressing it down with the palm of your hand. Use the rolling pin to roll out the dough into a circle that’s 9 inches (23 cm) in diameter and a quarter-inch (6 mm) thick. Repeat with the remaining dough balls. Sprinkle the dough and rolling pin with additional flour as you roll if the dough starts sticking to the counter. Preheat a skillet. Place a cast iron or thick-bottomed skillet over medium-high heat and let it warm up for two to three minutes. When you think the skillet is hot enough, sprinkle in a few drops of water. The skillet is ready when the water sizzles and boils off immediately. Coat the skillet with oil. Add a couple of drops of oil to the preheated skillet. Use a pastry brush to spread the oil around the skillet and coat the entire surface with a thin layer of oil. Cook each pita for about five minutes. Transfer one of the rolled-out dough circles to the skillet. Let the dough cook for about 30 seconds. When it starts to bubble, flip the pita with a spatula. Cook the pita for one to two minutes, until toasted. Flip the pita again and cook for an additional one to two minutes. Remove the pita from the pan and transfer it to a wire cooling rack. Repeat with the remaining pitas. Allow your pitas to cool before enjoying. Your pitas are ready to eat as soon as they're cool enough to handle. You can use the pitas for wraps, sandwiches, or dipping, or you can turn them into pita chips. You can store leftover pitas at room temperature in an airtight container for a few days. Serving Pita Chips Serve them with your favorite dips. Pita chips are most often enjoyed with dip, and these chips are ideal because they're crunchy and sturdy, meaning they're less likely to break when you scoop. There are a number of spreads and condiments that you can dip your pita chips into, and some of the most popular include:\nHummus\nGuacamole\nBaba ghanoush\nCrab dip\nSalsa\nSpinach dip\nArtichoke and asiago dip Use the pita in place of croutons. Pita chips are an excellent substitute for croutons in salads. You can garnish a finished salad with full pita chip wedges, or break the chips up and crumble them into your salad before serving. Good salads to finish with pita chip croutons include:\nGreek\nFattoush\nCaesar\nGarden\nCobb Pair them with cheese. Most people are familiar with crackers and cheese, but there's no reason you can't enjoy pita chips and cheese as a snack, appetizer, or hors d’oeuvre at a party. You can serve the chips with wedges of cheese, creamed cheeses, or grated cheese melted onto the chips in the oven or microwave. Good cheeses to pair with pita chips include brie, cheddar, mozzarella, cream, blue, and gouda. Dip them in chocolate. Chocolate-dipped pita chips are a delicious and unique dessert dish or snack. Melt chocolate chips or a bar of chocolate over medium heat in a double boiler. Hold each chip by the wide end and dip the top half of the chip into the melted chocolate. Place the dipped chips on a parchment-lined baking sheet to harden. The best types of pita chips for this are plain, lightly salted, or cinnamon-sugar chips. Make appetizers. Pita chips are a perfect size for one- or two-bite appetizers that you can eat as a snack or serve at parties. You can top pita chips with any of your favorite ingredients. For a simple vegetarian appetizer, top each chip with:\nA small avocado wedge\nA thin tomato slice\nGrated or creamed cheese\nA sprinkle of diced green onion",
  "tyn_model":[
    "pita chips",
    "oil",
    "water",
    "flour",
    "skillet",
    "oven",
    "pastry brush",
    "cheese",
    "yeast",
    "rolling pin",
    "chocolate",
    "baking sheet",
    "parchment paper",
    "avocado",
    "salt and pepper",
    "airtight container",
    "tea towel",
    "croutons",
    "parchment",
    "baking mat",
    "pita bread",
    "cutting board",
    "oils",
    "olive",
    "peanut",
    "safflower",
    "sunflower",
    "seasonings",
    "spices",
    "rosemary",
    "thyme",
    "oregano",
    "garlic",
    "onion powder",
    "curry powder",
    "cinnamon",
    "sugar",
    "chinese five-spice",
    "chili powder",
    "italian seasoning",
    "large bowl",
    "salt",
    "stand mixer",
    "pita dough",
    "bowl",
    "cast iron or thick-bottomed skillet",
    "spatula",
    "dips",
    "dip",
    "guacamole",
    "crab dip",
    "spinach",
    "artichoke",
    "asiago dip",
    "pita",
    "pita chip",
    "pita chip croutons",
    "crackers",
    "microwave",
    "brie",
    "cheddar",
    "mozzarella",
    "cream",
    "chocolate chips",
    "double boiler",
    "parchment-lined baking sheet",
    "grated or creamed cheese",
    "green onion"
  ],
  "tyn_section":[

  ]
}