{
  "title":"How to Cite a Photograph",
  "url":"https://www.wikihow.com/Cite-a-Photograph",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photographs"
  ],
  "methods":[
    {
      "name":"Selecting Your Citation Style",
      "steps":[
        {
          "headline":"Follow any style requirements associated with your project.",
          "description":"If you’re citing a photograph for a school paper or a formal publication, you might already be expected to follow a particular citation format. Consult with your teacher, professor, school, publisher, or supervisor to find out if they have a preferred citation style. If you live in the US, the most common citation styles are APA (American Psychological Association), MLA (Modern Language Association), and CMS (Chicago Manual of Style)."
        },
        {
          "headline":"Determine your citation style based on subject.",
          "description":"If you are allowed to set your own citation style, you should select one that is standard for the discipline in which you are writing. For example, APA is usually used for research papers in the social sciences, while CMS is used for publications and papers in literature, history, and the arts. If you are writing in a specialized discipline like the sciences or law and legal studies, choose a citation style that is specific to your discipline (e.g., Council of Science Editors for biology, or Association of Legal Writing Directors for legal studies)."
        },
        {
          "headline":"Use citation requirements set by your source.",
          "description":"In some cases, the source of a photograph may require you to provide particular information about the image, or cite the photo in a specific manner. For example, some photographic archives may require that you include an accession number or reproduction copy number in your citation."
        }
      ]
    },
    {
      "name":"Citing Photographs in Your Text",
      "steps":[
        {
          "headline":"Gather as much information as you can.",
          "description":"Depending on the source of your photograph, you may have a lot of information to work with, or very little. At minimum, try to find out:\nThe photographer’s name. The date of the photograph. The title of the photograph, if there is one. The names of any people or places represented in the photograph. The original source of the photograph, if it is reproduced or taken from somewhere else. The current location of the photograph, if it is in a gallery or archive."
        },
        {
          "headline":"Include the photographer’s name and the date in inline citations.",
          "description":"If your citation style uses inline citations (i.e., citations given in parentheses in the body of the text), you should include the photographer’s name and the date of the photograph, if known, in your citation. For example, in APA format, an inline citation would look like this: “The cat is shown carrying a toy mouse in its mouth (Smith, 2013).”\nIn MLA format, only the photographer’s name is needed. E.g., “Another image depicts the cat batting a ball of yarn (Smith).”\nIf you don’t know the photographer’s name, use a shortened title or description of the work. E.g., (Cat with Mouse, 2013)"
        },
        {
          "headline":"Give full information about the photo in footnotes and endnotes.",
          "description":"Some citation styles, like Chicago, use footnotes or endnotes instead of inline citations. Notes allow you to provide more complete information about your sources than inline citations. The format of a footnote or endnote will vary depending on which style you are using, but it should include the name of the photographer, title of the photograph, date, and current location of the photo. In the Chicago Manual of Style Format, a footnote citation for a photo should look like this: 27. Harold Rouse, Limestone Statue of an Egyptian Goddess, ca. 1933, photograph, Imaginary Museum of Ancient Art. If the photograph has no title, use a brief description in brackets. For example, [Cat Playing with a Toy Mouse]."
        },
        {
          "headline":"Cite the source of the photograph if it came from a publication.",
          "description":"If you got the photograph from a book or other publication, you will need to cite the source. For example:\nRoger Steele, Portrait of My Wife, 1982, black and white photograph, in The Works of Roger Steele, by Bob Smith (New York: Made-Up Books Inc., 2013), pl. 65. A photograph cited from the web should include the URL of the page where you found the image. E.g. : Azim Khan Ronnie, Prayer in Action, July 18, 2017, digital color photograph, National Geographic Photo of the Day, http://www.nationalgeographic.com/photography/photo-of-the-day/2017/07/islam-prayers-bangladesh/."
        },
        {
          "headline":"Provide a full citation of the photograph in your bibliography.",
          "description":"Much like a footnote or endnote, your bibliographic citation (the reference in your bibliography or “Works Cited” section at the end of the text) should include information about the photo that is as complete as possible. The format of this information will depend on your citation style. For example, in Chicago style, your bibliographic entry should look like this: Steele, Roger. Portrait of My Wife. 1982. Black and white photograph. In The Works of Roger Steele, by Bob Smith, pl. 65. New York: Made-Up Books, Inc., 2013. In MLA style: Steele, Roger. Portrait of My Wife. 1982. The Works of Roger Steele. By Bob Smith. New York: Made-Up Books, Inc., 2013. Pl. 65. Print. In APA style: Steele, R. (Photographer). (1982). Portrait of My Wife [photograph]. The Works of Roger Steele. By Bob Smith. New York, NY: Made-Up Books, Inc. Pl. 65."
        }
      ]
    },
    {
      "name":"Reproducing Photographs",
      "steps":[
        {
          "headline":"Create a figure number.",
          "description":"If you plan to reproduce photographs in your work, assigning a figure number to each image makes it easier to refer to the photos when you discuss them in your text. Each image should have a unique number within your document (e.g., Figure 1, Figure 2, etc. )."
        },
        {
          "headline":"Write a caption for the photograph.",
          "description":"Once you have assigned a figure number and decided where to place your image in the text, you will need to label your image with a descriptive caption. The caption should include full information about the photograph, including the photographer’s name, title of the photograph, date, and information about the source. For example, in Chicago Style, the caption underneath a photograph could say: Fig. 1. Reginald Pepper, Still Life with Haddock. 1919, black and white photographic print. The Estate of B. Wooster. From: B. Wooster, Pepper’s Pictures. London: Faux Publications, 1932. Pl. 275."
        },
        {
          "headline":"Include a credit line.",
          "description":"If you have obtained permission to use the photograph, you should indicate this in the caption. Write a line after the full citation in your caption indicating who owns the photograph and that you have their permission to use it. For example:\nFig. 1. Reginald Pepper, Still Life with Haddock. 1919, black and white photographic print. The Estate of B. Wooster. From: B. Wooster, Pepper’s Pictures. London: Faux Publications, 1932. Pl. 275. Copyright 1932 by the Estate of B. Wooster. Reprinted with permission. Some sources (for example, online museum databases or photographic archives) may provide blanket permission to reproduce their images for certain types of uses. Check your source for terms and conditions and detailed information on how to credit their images."
        }
      ]
    }
  ],
  "text":" Selecting Your Citation Style Follow any style requirements associated with your project. If you’re citing a photograph for a school paper or a formal publication, you might already be expected to follow a particular citation format. Consult with your teacher, professor, school, publisher, or supervisor to find out if they have a preferred citation style. If you live in the US, the most common citation styles are APA (American Psychological Association), MLA (Modern Language Association), and CMS (Chicago Manual of Style). Determine your citation style based on subject. If you are allowed to set your own citation style, you should select one that is standard for the discipline in which you are writing. For example, APA is usually used for research papers in the social sciences, while CMS is used for publications and papers in literature, history, and the arts. If you are writing in a specialized discipline like the sciences or law and legal studies, choose a citation style that is specific to your discipline (e.g., Council of Science Editors for biology, or Association of Legal Writing Directors for legal studies). Use citation requirements set by your source. In some cases, the source of a photograph may require you to provide particular information about the image, or cite the photo in a specific manner. For example, some photographic archives may require that you include an accession number or reproduction copy number in your citation. Citing Photographs in Your Text Gather as much information as you can. Depending on the source of your photograph, you may have a lot of information to work with, or very little. At minimum, try to find out:\nThe photographer’s name. The date of the photograph. The title of the photograph, if there is one. The names of any people or places represented in the photograph. The original source of the photograph, if it is reproduced or taken from somewhere else. The current location of the photograph, if it is in a gallery or archive. Include the photographer’s name and the date in inline citations. If your citation style uses inline citations (i.e., citations given in parentheses in the body of the text), you should include the photographer’s name and the date of the photograph, if known, in your citation. For example, in APA format, an inline citation would look like this: “The cat is shown carrying a toy mouse in its mouth (Smith, 2013).”\nIn MLA format, only the photographer’s name is needed. E.g., “Another image depicts the cat batting a ball of yarn (Smith).”\nIf you don’t know the photographer’s name, use a shortened title or description of the work. E.g., (Cat with Mouse, 2013) Give full information about the photo in footnotes and endnotes. Some citation styles, like Chicago, use footnotes or endnotes instead of inline citations. Notes allow you to provide more complete information about your sources than inline citations. The format of a footnote or endnote will vary depending on which style you are using, but it should include the name of the photographer, title of the photograph, date, and current location of the photo. In the Chicago Manual of Style Format, a footnote citation for a photo should look like this: 27. Harold Rouse, Limestone Statue of an Egyptian Goddess, ca. 1933, photograph, Imaginary Museum of Ancient Art. If the photograph has no title, use a brief description in brackets. For example, [Cat Playing with a Toy Mouse]. Cite the source of the photograph if it came from a publication. If you got the photograph from a book or other publication, you will need to cite the source. For example:\nRoger Steele, Portrait of My Wife, 1982, black and white photograph, in The Works of Roger Steele, by Bob Smith (New York: Made-Up Books Inc., 2013), pl. 65. A photograph cited from the web should include the URL of the page where you found the image. E.g. : Azim Khan Ronnie, Prayer in Action, July 18, 2017, digital color photograph, National Geographic Photo of the Day, http://www.nationalgeographic.com/photography/photo-of-the-day/2017/07/islam-prayers-bangladesh/. Provide a full citation of the photograph in your bibliography. Much like a footnote or endnote, your bibliographic citation (the reference in your bibliography or “Works Cited” section at the end of the text) should include information about the photo that is as complete as possible. The format of this information will depend on your citation style. For example, in Chicago style, your bibliographic entry should look like this: Steele, Roger. Portrait of My Wife. 1982. Black and white photograph. In The Works of Roger Steele, by Bob Smith, pl. 65. New York: Made-Up Books, Inc., 2013. In MLA style: Steele, Roger. Portrait of My Wife. 1982. The Works of Roger Steele. By Bob Smith. New York: Made-Up Books, Inc., 2013. Pl. 65. Print. In APA style: Steele, R. (Photographer). (1982). Portrait of My Wife [photograph]. The Works of Roger Steele. By Bob Smith. New York, NY: Made-Up Books, Inc. Pl. 65. Reproducing Photographs Create a figure number. If you plan to reproduce photographs in your work, assigning a figure number to each image makes it easier to refer to the photos when you discuss them in your text. Each image should have a unique number within your document (e.g., Figure 1, Figure 2, etc. ). Write a caption for the photograph. Once you have assigned a figure number and decided where to place your image in the text, you will need to label your image with a descriptive caption. The caption should include full information about the photograph, including the photographer’s name, title of the photograph, date, and information about the source. For example, in Chicago Style, the caption underneath a photograph could say: Fig. 1. Reginald Pepper, Still Life with Haddock. 1919, black and white photographic print. The Estate of B. Wooster. From: B. Wooster, Pepper’s Pictures. London: Faux Publications, 1932. Pl. 275. Include a credit line. If you have obtained permission to use the photograph, you should indicate this in the caption. Write a line after the full citation in your caption indicating who owns the photograph and that you have their permission to use it. For example:\nFig. 1. Reginald Pepper, Still Life with Haddock. 1919, black and white photographic print. The Estate of B. Wooster. From: B. Wooster, Pepper’s Pictures. London: Faux Publications, 1932. Pl. 275. Copyright 1932 by the Estate of B. Wooster. Reprinted with permission. Some sources (for example, online museum databases or photographic archives) may provide blanket permission to reproduce their images for certain types of uses. Check your source for terms and conditions and detailed information on how to credit their images.",
  "tyn_model":[
    "photograph",
    "photographic archives",
    "cat",
    "”\n",
    "photographic print",
    "cms",
    "“the",
    "“another",
    "yarn",
    "footnote",
    "footnote citation",
    "“works",
    "” section",
    "photographs",
    "pepper"
  ],
  "tyn_section":[

  ]
}