{
  "title":"How to Use a Power Washer",
  "url":"https://www.wikihow.com/Use-a-Power-Washer",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Paths and Paving"
  ],
  "methods":[
    {
      "name":"Preparing to Use a Power Washer",
      "steps":[
        {
          "headline":"Wear appropriate safety attire.",
          "description":"You should have safety goggles and protective footwear on. The footwear should also have a rubberized sole to minimize the risk of slipping on wet surfaces. You may want to wear long pants and a long-sleeved shirt to protect your limbs from flying dirt and debris."
        },
        {
          "headline":"Protect plants and breakable objects by moving them out of the way or covering them.",
          "description":""
        },
        {
          "headline":"Get the power washer ready for use.",
          "description":"Fill a gas power washer with engine oil and gasoline. Hold the start grip and pull to start the engine. Plug an electric power washer into a properly grounded outlet."
        },
        {
          "headline":"Connect a garden hose to the pressure washer water inlet.",
          "description":"Turn on the water supply before turning on the pressure washer to avoid damaging the pump."
        },
        {
          "headline":"Fill the reservoir or a bucket (on a siphon system) with a detergent solution if you want extra cleaning power.",
          "description":""
        },
        {
          "headline":"Attach the proper spray tip to the nozzle.",
          "description":"Certain tips may be required when using detergent. Make sure you read the manufacturer's instructions carefully."
        }
      ]
    },
    {
      "name":"Operating a Power Washer",
      "steps":[
        {
          "headline":"Position the spray tip at least 2 feet (0.61 m) (0.6 m) from the surface to start.",
          "description":"Gradually move the tip closer. You risk damaging the surface if you hold the tip closer than 12 inches (30.5 cm) (0.3 m)."
        },
        {
          "headline":"Hold the nozzle at a 45-degree angle to the surface.",
          "description":"These will help direct loosened debris away from you. Pull the trigger to begin spraying the water."
        },
        {
          "headline":"Move the spray in a side-to-side motion, without spraying too long in any one spot.",
          "description":""
        },
        {
          "headline":"Apply detergent by starting low and moving upwards.",
          "description":"Allow the detergent to soak for at least 3 minutes before rinsing. Don't wait long enough for it to dry. Rinse the surface by spraying water from the top down."
        },
        {
          "headline":"Follow the manufacturer's instructions for flushing the system after using detergent in a power washer.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preparing to Use a Power Washer Wear appropriate safety attire. You should have safety goggles and protective footwear on. The footwear should also have a rubberized sole to minimize the risk of slipping on wet surfaces. You may want to wear long pants and a long-sleeved shirt to protect your limbs from flying dirt and debris. Protect plants and breakable objects by moving them out of the way or covering them.  Get the power washer ready for use. Fill a gas power washer with engine oil and gasoline. Hold the start grip and pull to start the engine. Plug an electric power washer into a properly grounded outlet. Connect a garden hose to the pressure washer water inlet. Turn on the water supply before turning on the pressure washer to avoid damaging the pump. Fill the reservoir or a bucket (on a siphon system) with a detergent solution if you want extra cleaning power.  Attach the proper spray tip to the nozzle. Certain tips may be required when using detergent. Make sure you read the manufacturer's instructions carefully. Operating a Power Washer Position the spray tip at least 2 feet (0.61 m) (0.6 m) from the surface to start. Gradually move the tip closer. You risk damaging the surface if you hold the tip closer than 12 inches (30.5 cm) (0.3 m). Hold the nozzle at a 45-degree angle to the surface. These will help direct loosened debris away from you. Pull the trigger to begin spraying the water. Move the spray in a side-to-side motion, without spraying too long in any one spot.  Apply detergent by starting low and moving upwards. Allow the detergent to soak for at least 3 minutes before rinsing. Don't wait long enough for it to dry. Rinse the surface by spraying water from the top down. Follow the manufacturer's instructions for flushing the system after using detergent in a power washer. ",
  "tyn_model":[
    "power washer",
    "water",
    "detergent",
    "washer",
    "gasoline",
    "electric power washer",
    "garden hose",
    "pressure washer",
    "bucket",
    "detergent solution",
    "nozzle"
  ],
  "tyn_section":[

  ]
}