{
  "title":"How to Make a Gravel Garden",
  "url":"https://www.wikihow.com/Make-a-Gravel-Garden",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Theme and Feature Gardens"
  ],
  "parts":[
    {
      "name":"Adjusting the Soil",
      "steps":[
        {
          "headline":"Pull weeds and remove all plants from the garden.",
          "description":"Carefully remove the plants that you want to keep and place them to the side of the garden or in pots temporarily. When digging up the plants you want to keep, be sure not to sever any of the roots or separate the root ball at the bottom of the plant. If you’re going to be doing the project over a few days, wrap the roots of the plant in a plastic bag and mist them with water to keep them alive. Removing the weeds before you begin working will keep them from growing back once you lay the gravel."
        },
        {
          "headline":"Till the soil with compost or manure to encourage growth.",
          "description":"Adding compost or manure to your gravel garden will improve the soil composition and make it easier for the plants to grow there. Use a rake or garden till to dig about 4 inches (10 cm) into the ground and mix the dirt and compost or manure together. If you come across any large stones, put them to the side to incorporate into the gravel. You can find compost or manure at most home improvement stores or nurseries, or you can make your own compost pile at home."
        },
        {
          "headline":"Dig a border around the garden and add an edger to improve drainage.",
          "description":"If you have heavy soil, such as clay, you’ll need some extra drainage for the garden. Get enough edger, which is a metal strip, to border your entire gravel garden. Bury it 4–6 inches (10–15 cm) deep so it’s level with or just above the ground. The edger will define a permanent border between the gravel garden and your lawn or other garden beds and keep the gravel in place. Then, dig a border about 3 to 4 inches (7.6 to 10.2 cm) wide and 1 to 2 inches (2.5 to 5.1 cm) deep around the garden inside the edger. Fill the border with gravel to increase air in the soil and remove excess water that the plants can’t use. For gardens with regular soil, this step isn’t necessary, but adding a border won’t hurt your garden if you like the look of it."
        }
      ]
    },
    {
      "name":"Planting with a Weed Membrane",
      "steps":[
        {
          "headline":"Measure the area of the garden and cut the weed membrane to size.",
          "description":"Most weed membrane comes in large strips. Simply roll out the membrane and cut it to fit the shape of your garden. Be sure to use sharp scissors because the membrane can sometimes be difficult to cut. Then, lay the next strip with about 3 inches (7.6 cm) of overlap on the sides. Try to keep the membrane in straight lines to avoid wasting any material."
        },
        {
          "headline":"Secure the membrane with weights or pins at overlapping points.",
          "description":"To hold the membrane in place, you can use larger rocks that you’ve gathered, or special landscape staples. Place the rocks or staples about 2 feet (0.61 m) apart on the overlapping areas of the membrane. You can find landscape staples at most home improvement stores, or you can order them in bulk online. The number of staples needed will depend on the size of your garden and how many pieces of weed membrane you'll use."
        },
        {
          "headline":"Select the plants that you’d like to have in your garden.",
          "description":"Cacti, succulents, grasses, daisies, Mediterranean plants, and many herbs will thrive in the gravel garden because they require less water than other plants. Look for plants like lavender, yucca, lilies, juniper trees, lilacs, or stonecrop at your local nursery or home improvement store. If you have soil with a lot of clay in it, select larger and more established plants to ensure that their roots will attach to the soil when you plant them."
        },
        {
          "headline":"Position your plants and cut the membrane where you will plant them.",
          "description":"Once the membrane is in place, you can organize your garden how you’d like. Place your plants in groups of 2-3 different flowers or shrubs that look good together. Then, use scissors to cut a cross in the soil that is big enough to fit the roots of the plant when the flaps are folded back. For an eye-catching look, pair flowers, like lilies, with large shrubs, like juniper trees, to create a pop of color when the flowers bloom. Try to avoid planting smaller plants, like stonecrop, underneath of large bushes that might cast a shadow on them for part of the day. Make sure you give the plants enough space to grow to their full width! For most plants, their maximum size will be listed on the tag or you can look it up online. Avoid cutting a hole for the plant, because this makes the weed membrane useless in that area. Cutting a cross allows the membrane to be as close to the plant as possible to protect it from weeds."
        },
        {
          "headline":"Dig holes for the plants and lower them into the soil.",
          "description":"Fold the flaps of the membrane back and dig a hole just large enough to fit the plant and its roots. Lower the plant into the ground and cover it with the soil, pressing on the ground around the roots of the plant to level the ground. Add compost to the hole to provide extra nutrients for your plants. This is especially important when using a membrane/weed barrier as the soil beneath the gravel won’t be naturally enriched with organic matter. Avoid letting soil fall onto the membrane while you’re planting. If some does get onto the membrane, wipe it off before you lay the gravel."
        },
        {
          "headline":"Tuck the membrane flaps under the the plant and water thoroughly.",
          "description":"Fold the flaps back under the plant and make sure there are no gaps where you can see soil. Water each plant for about 30 seconds to saturate the soil before you lay the gravel. If the membrane is lifting, you can use a landscape pin or rock to hold it in place."
        }
      ]
    },
    {
      "name":"Adding Gravel to the Garden",
      "steps":[
        {
          "headline":"Spread the gravel mulch over the membrane.",
          "description":"Distribute the gravel around the garden as evenly as possible, pouring it over the membrane all over the garden. As a general rule 55 pounds (25 kg) of gravel will cover about 0.7 square yards (0.59 m) of the garden at a depth of about 2 inches (5.1 cm). You can order the gravel in bulk or buy it in bags from the  home improvement store. You can add large rocks or boulders to the area before you spread the gravel to add variety. Depending on the size of your garden and grade of the gravel, you might have to buy more or less gravel to cover the entire area of the garden. If your garden isn’t a square, measure the shape of a square around the garden and use the leftover gravel to fill in bare spots as needed throughout the year."
        },
        {
          "headline":"Use a rake to level the gravel to about 2 inches (5.1 cm) thick.",
          "description":"When you first apply the gravel, you’ll have some areas that are deeper than others. Pull a rake across the garden in straight lines to distribute the gravel evenly across the garden. If you have some areas that are still deeper than others, use a shovel to remove some of the gravel and then rake it smooth. Be careful when you’re leveling the gravel to not interfere with the plants. When you reach a plant, use the rake to go around the plant and even the gravel without damaging the leaves or pulling it from the ground."
        },
        {
          "headline":"Water around the plants twice a week with a gentle stream until they are established.",
          "description":"Your new plants may take up to a month before their roots are established in the soil. Water each plant for 30 seconds twice per week for a month to ensure that they’re growing and forming roots. After a month, you can cut back your watering to an as-needed basis. For areas that don’t get a lot of rain, water the garden once per month or more depending on your climate and the needs of your specific plants to ensure the plants have enough water. Be sure to use a mist or gentle stream to keep the gravel from moving when you water the plants. This applies to all plants, even watering succulents and cacti, to ensure that their roots become established in the soil."
        },
        {
          "headline":"Be vigilant about weeding around the plants to prevent overgrowth.",
          "description":"The first year of a gravel garden requires a lot of maintenance, especially around the new plants. Keep an eye out for weeds that might’ve grown through gaps in the membrane or around the base of your plants. Pull them as soon as you see them sprout from the gravel. After the first year, your plants will be more established and there will be fewer weeds to pull."
        }
      ]
    }
  ],
  "text":" Adjusting the Soil Pull weeds and remove all plants from the garden. Carefully remove the plants that you want to keep and place them to the side of the garden or in pots temporarily. When digging up the plants you want to keep, be sure not to sever any of the roots or separate the root ball at the bottom of the plant. If you’re going to be doing the project over a few days, wrap the roots of the plant in a plastic bag and mist them with water to keep them alive. Removing the weeds before you begin working will keep them from growing back once you lay the gravel. Till the soil with compost or manure to encourage growth. Adding compost or manure to your gravel garden will improve the soil composition and make it easier for the plants to grow there. Use a rake or garden till to dig about 4 inches (10 cm) into the ground and mix the dirt and compost or manure together. If you come across any large stones, put them to the side to incorporate into the gravel. You can find compost or manure at most home improvement stores or nurseries, or you can make your own compost pile at home. Dig a border around the garden and add an edger to improve drainage. If you have heavy soil, such as clay, you’ll need some extra drainage for the garden. Get enough edger, which is a metal strip, to border your entire gravel garden. Bury it 4–6 inches (10–15 cm) deep so it’s level with or just above the ground. The edger will define a permanent border between the gravel garden and your lawn or other garden beds and keep the gravel in place. Then, dig a border about 3 to 4 inches (7.6 to 10.2 cm) wide and 1 to 2 inches (2.5 to 5.1 cm) deep around the garden inside the edger. Fill the border with gravel to increase air in the soil and remove excess water that the plants can’t use. For gardens with regular soil, this step isn’t necessary, but adding a border won’t hurt your garden if you like the look of it. Planting with a Weed Membrane Measure the area of the garden and cut the weed membrane to size. Most weed membrane comes in large strips. Simply roll out the membrane and cut it to fit the shape of your garden. Be sure to use sharp scissors because the membrane can sometimes be difficult to cut. Then, lay the next strip with about 3 inches (7.6 cm) of overlap on the sides. Try to keep the membrane in straight lines to avoid wasting any material. Secure the membrane with weights or pins at overlapping points. To hold the membrane in place, you can use larger rocks that you’ve gathered, or special landscape staples. Place the rocks or staples about 2 feet (0.61 m) apart on the overlapping areas of the membrane. You can find landscape staples at most home improvement stores, or you can order them in bulk online. The number of staples needed will depend on the size of your garden and how many pieces of weed membrane you'll use. Select the plants that you’d like to have in your garden. Cacti, succulents, grasses, daisies, Mediterranean plants, and many herbs will thrive in the gravel garden because they require less water than other plants. Look for plants like lavender, yucca, lilies, juniper trees, lilacs, or stonecrop at your local nursery or home improvement store. If you have soil with a lot of clay in it, select larger and more established plants to ensure that their roots will attach to the soil when you plant them. Position your plants and cut the membrane where you will plant them. Once the membrane is in place, you can organize your garden how you’d like. Place your plants in groups of 2-3 different flowers or shrubs that look good together. Then, use scissors to cut a cross in the soil that is big enough to fit the roots of the plant when the flaps are folded back. For an eye-catching look, pair flowers, like lilies, with large shrubs, like juniper trees, to create a pop of color when the flowers bloom. Try to avoid planting smaller plants, like stonecrop, underneath of large bushes that might cast a shadow on them for part of the day. Make sure you give the plants enough space to grow to their full width! For most plants, their maximum size will be listed on the tag or you can look it up online. Avoid cutting a hole for the plant, because this makes the weed membrane useless in that area. Cutting a cross allows the membrane to be as close to the plant as possible to protect it from weeds. Dig holes for the plants and lower them into the soil. Fold the flaps of the membrane back and dig a hole just large enough to fit the plant and its roots. Lower the plant into the ground and cover it with the soil, pressing on the ground around the roots of the plant to level the ground. Add compost to the hole to provide extra nutrients for your plants. This is especially important when using a membrane/weed barrier as the soil beneath the gravel won’t be naturally enriched with organic matter. Avoid letting soil fall onto the membrane while you’re planting. If some does get onto the membrane, wipe it off before you lay the gravel. Tuck the membrane flaps under the the plant and water thoroughly. Fold the flaps back under the plant and make sure there are no gaps where you can see soil. Water each plant for about 30 seconds to saturate the soil before you lay the gravel. If the membrane is lifting, you can use a landscape pin or rock to hold it in place. Adding Gravel to the Garden Spread the gravel mulch over the membrane. Distribute the gravel around the garden as evenly as possible, pouring it over the membrane all over the garden. As a general rule 55 pounds (25 kg) of gravel will cover about 0.7 square yards (0.59 m) of the garden at a depth of about 2 inches (5.1 cm). You can order the gravel in bulk or buy it in bags from the  home improvement store. You can add large rocks or boulders to the area before you spread the gravel to add variety. Depending on the size of your garden and grade of the gravel, you might have to buy more or less gravel to cover the entire area of the garden. If your garden isn’t a square, measure the shape of a square around the garden and use the leftover gravel to fill in bare spots as needed throughout the year. Use a rake to level the gravel to about 2 inches (5.1 cm) thick. When you first apply the gravel, you’ll have some areas that are deeper than others. Pull a rake across the garden in straight lines to distribute the gravel evenly across the garden. If you have some areas that are still deeper than others, use a shovel to remove some of the gravel and then rake it smooth. Be careful when you’re leveling the gravel to not interfere with the plants. When you reach a plant, use the rake to go around the plant and even the gravel without damaging the leaves or pulling it from the ground. Water around the plants twice a week with a gentle stream until they are established. Your new plants may take up to a month before their roots are established in the soil. Water each plant for 30 seconds twice per week for a month to ensure that they’re growing and forming roots. After a month, you can cut back your watering to an as-needed basis. For areas that don’t get a lot of rain, water the garden once per month or more depending on your climate and the needs of your specific plants to ensure the plants have enough water. Be sure to use a mist or gentle stream to keep the gravel from moving when you water the plants. This applies to all plants, even watering succulents and cacti, to ensure that their roots become established in the soil. Be vigilant about weeding around the plants to prevent overgrowth. The first year of a gravel garden requires a lot of maintenance, especially around the new plants. Keep an eye out for weeds that might’ve grown through gaps in the membrane or around the base of your plants. Pull them as soon as you see them sprout from the gravel. After the first year, your plants will be more established and there will be fewer weeds to pull.",
  "tyn_model":[
    "gravel",
    "water",
    "compost",
    "weed membrane",
    "rake",
    "rocks",
    "edger",
    "scissors",
    "landscape staples",
    "weeds",
    "garden till",
    "compost or manure",
    "weights",
    "pins",
    "staples",
    "succulents",
    "herbs",
    "lilies",
    "lilacs",
    "bushes",
    "membrane",
    "soil",
    "landscape pin",
    "gravel mulch",
    "home improvement store",
    "shovel"
  ],
  "tyn_section":[

  ]
}