{
  "title":"How to Hatch Pokémon Eggs",
  "url":"https://www.wikihow.com/Hatch-Pok%C3%A9mon-Eggs",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Pokemon Video Games"
  ],
  "methods":[
    {
      "name":"Older Versions",
      "steps":[
        {
          "headline":"Get a Pokémon egg by leaving two Pokémon in the same egg group or a non-legendary Pokémon with ditto.",
          "description":"Every 255 steps there is a chance your Pokémon have laid an egg."
        },
        {
          "headline":"Get a Pokémon with the ability Magma Armor or Flame Body.",
          "description":"Slugma, Magcargo, Magby, Magmar, Magmortar Litwick, Lampent, Chandelure, Larvesta, and Volcarona have these abilities. Litwick and its evolutions may have Flash Fire as an ability, so check to make sure for them."
        },
        {
          "headline":"Put the Pokémon with Flame Body or Magma Armor in your party.",
          "description":"Magma Armor halves the number of egg cycles, and Flame Body halves the number of steps needed for the egg to hatch, thus making egg hatching more efficient."
        },
        {
          "headline":"Hatch the Pokémon egg by running around.",
          "description":"Use a fast bike and cycle up and down somewhere with a long stretch of open ground. Use the Mauville breeding line in Hoenn, the Solaceon breeding line in Sinnoh and the Cycling Road in Kanto. You can tell the egg's progress in hatching by checking its summary."
        }
      ]
    },
    {
      "name":"Ruby\\/Sapphire",
      "steps":[
        {
          "headline":"Find a mudslide.",
          "description":""
        },
        {
          "headline":"Use the Acro Bike to try to go up it.",
          "description":"Every time you fail you have taken one step. You can sit there with a weight on the forward button and it will hatch before you know it! Unfortunately, this error has been rectified in Emerald, so you'll have to use the Mauville breeding line. But, this was untouched in Gen IV games, so good luck!"
        }
      ]
    },
    {
      "name":"Diamond\\/Pearl",
      "steps":[
        {
          "headline":"Go to the Fuego Ironworks near Floaroma Town.",
          "description":""
        },
        {
          "headline":"Find a place where the slide tiles faces the wall.",
          "description":""
        },
        {
          "headline":"Position your character next to the wall then hold down the direction button that sends your character to the slide tile with a rubber band or bulldog clip.",
          "description":"Leave this for as long as necessary."
        }
      ]
    },
    {
      "name":"Pokémon X and Y",
      "steps":[
        {
          "headline":"Get a Ditto.",
          "description":"It doesn't matter what gender the Pokémon is. Ditto breeds with everything because of its transforming ability."
        },
        {
          "headline":"Place the Ditto and other the Pokémon you wish to breed with in the daycare on Route 7.",
          "description":""
        },
        {
          "headline":"Find Froufrou palace.",
          "description":"There will be a courtyard near by. Using your bicycle, ride around the courtyard and go back to the daycare to obtain your egg."
        },
        {
          "headline":"Go back to the courtyard and ride around until the egg hatches.",
          "description":""
        }
      ]
    },
    {
      "name":"Hatching an Egg in Pokémon GO Without Walking",
      "steps":[
        {
          "headline":"Secure your phone to a bike wheel.",
          "description":"Flip a bike upside down and attach your phone to the inside of one of the wheel's spokes. Pedal the bike with your hands and the Pokémon GO app will register movement, allowing an Egg in your possession to hatch as if you were walking."
        },
        {
          "headline":"Secure your phone to a fan.",
          "description":"With duct tape, secure your phone very carefully to the blade of a standing fan or to the top of a ceiling fan. With the fan on, Pokémon GO will register movement and make it possible to hatch your Egg. If you are using a standing fan, make sure that its base is secure and can handle the weight of the phone without falling over. The farther from the center of the fan you tape the phone, the more quickly it will cover distance."
        },
        {
          "headline":"Put your phone on top of a record/vinyl player.",
          "description":"With the record player turned on, your phone will spin around the perimeter and cover distance on the Pokémon app as if you were walking."
        },
        {
          "headline":"Put your phone on top of a Roomba.",
          "description":"As you may have gathered, you can hatch your Pokémon Eggs faster by putting your phone on essentially anything stable that makes detectable movements in the same direction. If you happen to have a flat-surfaced cleaning robot like a Roomba and you put your phone on top of it while it's in use, you've got an easy way to catalyze your Eggs' hatching - all while getting the dirt out of your carpet."
        },
        {
          "headline":"Place your phone on a toy train running on a looping railroad.",
          "description":"Adjust the speed to a slower pace if necessary and simply let it run its course. This hack was discovered by a Japanese Twitter user"
        },
        {
          "headline":"Simply leave the app open during bumper-to-bumper traffic.",
          "description":"Who knew traffic could be enjoyable before self-driving cars? If you're going under 20mph, the app will record your mileage for your egg incubation. Note: we do not encourage nor suggest actively playing Pokémon GO while driving; just let the meter run to hatch your egg."
        },
        {
          "headline":"Strap your phone to a dog.",
          "description":"Presumably yours, the dog should be medium to large sized. Let your dog do what he/she does best - wander. Be sure to keep your dog in sight to keep your phone from being stolen."
        },
        {
          "headline":"Attach your phone to a drone.",
          "description":"Extend your egg incubation to the stars above."
        },
        {
          "headline":"Turn off Google Maps.",
          "description":"Doing this can cause the game's location function to glitch, making your trainer avatar \"walk\" erratically near your location without you ever moving around."
        }
      ]
    },
    {
      "name":"Hatching an Egg in Pokémon GO",
      "steps":[
        {
          "headline":"Acquire a Pokémon Egg.",
          "description":"To hatch a Pokémon Egg in Pokémon Go, you need to find one first. To find an Egg, walk to your nearest PokéStop and activate it by spinning the medal that appears in its center. A number of items will appear, and one may be an Egg. Tap on it to collect it; if the PokéStop you visit does not yield you an egg, head to another PokéStop that appears as blue and try again."
        },
        {
          "headline":"Check how long the Egg will take to hatch.",
          "description":"Once you have an egg, you want to know how long it'll take you to hatch it once it's incubated. To do this:\nOpen your items by pressing the PokéBall on the bottom of the screen. Tap the \"Pokémon\" button. Tap \"Eggs\" in the top-right corner. Find your Egg and tap on it. On the screen, the Egg will display as either 2km, 5km, or 10km. This tells how far you need to travel in order to hatch the Egg (in kilometers)."
        },
        {
          "headline":"Incubate the egg.",
          "description":"Once you have your Egg, you must incubate it to hatch it. You can do this either using the Incubator you receive at the beginning of the game, or by buying more in the PokéShop. To incubate your egg:\nNavigate to your Eggs as described above. Tap on the Egg you wish to hatch. Select \"Incubate\" to begin the incubation process."
        },
        {
          "headline":"Travel the distance specified on the egg.",
          "description":"If your egg is a 5km egg, you will need to travel 5km to hatch it. So, get walking, jogging, skateboarding, or cycling! After you have travelled this distance, you will see a screen that says \"Oh?\" and your Pokémon will hatch! You must travel the distance specified with the app open. You cannot incubate your egg while traveling faster than 20mph. Pay attention to your surroundings while traveling with the app open. The longer the distance required, the rarer the Pokémon."
        },
        {
          "headline":"Incubate another Egg once one Egg hatches.",
          "description":"When the Egg you were incubating hatches, your Incubator will continue to \"deteriorate.\" Make the most of your Incubator by putting another egg into it as soon as possible. To hatch multiple eggs at once, you can purchase additional Incubators at the shop."
        }
      ]
    },
    {
      "name":"Hatching an egg in Pokémon Sun and Moon",
      "steps":[
        {
          "headline":"Put the egg in your party.",
          "description":""
        },
        {
          "headline":"Head to the small fenced in area with the hay bales directly across from the Pokémon Nursery on foot.",
          "description":""
        },
        {
          "headline":"Once in there get on Tauros and use the circle pad to spin around in circles while holding down the B button.",
          "description":"This is the quickest way hatch an egg."
        },
        {
          "headline":"Or you can just keep it in your party while you walk from place to place if you're in no hurry.",
          "description":""
        }
      ]
    }
  ],
  "text":" Older Versions Get a Pokémon egg by leaving two Pokémon in the same egg group or a non-legendary Pokémon with ditto. Every 255 steps there is a chance your Pokémon have laid an egg. Get a Pokémon with the ability Magma Armor or Flame Body. Slugma, Magcargo, Magby, Magmar, Magmortar Litwick, Lampent, Chandelure, Larvesta, and Volcarona have these abilities. Litwick and its evolutions may have Flash Fire as an ability, so check to make sure for them. Put the Pokémon with Flame Body or Magma Armor in your party. Magma Armor halves the number of egg cycles, and Flame Body halves the number of steps needed for the egg to hatch, thus making egg hatching more efficient. Hatch the Pokémon egg by running around. Use a fast bike and cycle up and down somewhere with a long stretch of open ground. Use the Mauville breeding line in Hoenn, the Solaceon breeding line in Sinnoh and the Cycling Road in Kanto. You can tell the egg's progress in hatching by checking its summary. Ruby\\/Sapphire Find a mudslide.  Use the Acro Bike to try to go up it. Every time you fail you have taken one step. You can sit there with a weight on the forward button and it will hatch before you know it! Unfortunately, this error has been rectified in Emerald, so you'll have to use the Mauville breeding line. But, this was untouched in Gen IV games, so good luck! Diamond\\/Pearl Go to the Fuego Ironworks near Floaroma Town.  Find a place where the slide tiles faces the wall.  Position your character next to the wall then hold down the direction button that sends your character to the slide tile with a rubber band or bulldog clip. Leave this for as long as necessary. Pokémon X and Y Get a Ditto. It doesn't matter what gender the Pokémon is. Ditto breeds with everything because of its transforming ability. Place the Ditto and other the Pokémon you wish to breed with in the daycare on Route 7.  Find Froufrou palace. There will be a courtyard near by. Using your bicycle, ride around the courtyard and go back to the daycare to obtain your egg. Go back to the courtyard and ride around until the egg hatches.  Hatching an Egg in Pokémon GO Without Walking Secure your phone to a bike wheel. Flip a bike upside down and attach your phone to the inside of one of the wheel's spokes. Pedal the bike with your hands and the Pokémon GO app will register movement, allowing an Egg in your possession to hatch as if you were walking. Secure your phone to a fan. With duct tape, secure your phone very carefully to the blade of a standing fan or to the top of a ceiling fan. With the fan on, Pokémon GO will register movement and make it possible to hatch your Egg. If you are using a standing fan, make sure that its base is secure and can handle the weight of the phone without falling over. The farther from the center of the fan you tape the phone, the more quickly it will cover distance. Put your phone on top of a record/vinyl player. With the record player turned on, your phone will spin around the perimeter and cover distance on the Pokémon app as if you were walking. Put your phone on top of a Roomba. As you may have gathered, you can hatch your Pokémon Eggs faster by putting your phone on essentially anything stable that makes detectable movements in the same direction. If you happen to have a flat-surfaced cleaning robot like a Roomba and you put your phone on top of it while it's in use, you've got an easy way to catalyze your Eggs' hatching - all while getting the dirt out of your carpet. Place your phone on a toy train running on a looping railroad. Adjust the speed to a slower pace if necessary and simply let it run its course. This hack was discovered by a Japanese Twitter user Simply leave the app open during bumper-to-bumper traffic. Who knew traffic could be enjoyable before self-driving cars? If you're going under 20mph, the app will record your mileage for your egg incubation. Note: we do not encourage nor suggest actively playing Pokémon GO while driving; just let the meter run to hatch your egg. Strap your phone to a dog. Presumably yours, the dog should be medium to large sized. Let your dog do what he/she does best - wander. Be sure to keep your dog in sight to keep your phone from being stolen. Attach your phone to a drone. Extend your egg incubation to the stars above. Turn off Google Maps. Doing this can cause the game's location function to glitch, making your trainer avatar \"walk\" erratically near your location without you ever moving around. Hatching an Egg in Pokémon GO Acquire a Pokémon Egg. To hatch a Pokémon Egg in Pokémon Go, you need to find one first. To find an Egg, walk to your nearest PokéStop and activate it by spinning the medal that appears in its center. A number of items will appear, and one may be an Egg. Tap on it to collect it; if the PokéStop you visit does not yield you an egg, head to another PokéStop that appears as blue and try again. Check how long the Egg will take to hatch. Once you have an egg, you want to know how long it'll take you to hatch it once it's incubated. To do this:\nOpen your items by pressing the PokéBall on the bottom of the screen. Tap the \"Pokémon\" button. Tap \"Eggs\" in the top-right corner. Find your Egg and tap on it. On the screen, the Egg will display as either 2km, 5km, or 10km. This tells how far you need to travel in order to hatch the Egg (in kilometers). Incubate the egg. Once you have your Egg, you must incubate it to hatch it. You can do this either using the Incubator you receive at the beginning of the game, or by buying more in the PokéShop. To incubate your egg:\nNavigate to your Eggs as described above. Tap on the Egg you wish to hatch. Select \"Incubate\" to begin the incubation process. Travel the distance specified on the egg. If your egg is a 5km egg, you will need to travel 5km to hatch it. So, get walking, jogging, skateboarding, or cycling! After you have travelled this distance, you will see a screen that says \"Oh?\" and your Pokémon will hatch! You must travel the distance specified with the app open. You cannot incubate your egg while traveling faster than 20mph. Pay attention to your surroundings while traveling with the app open. The longer the distance required, the rarer the Pokémon. Incubate another Egg once one Egg hatches. When the Egg you were incubating hatches, your Incubator will continue to \"deteriorate.\" Make the most of your Incubator by putting another egg into it as soon as possible. To hatch multiple eggs at once, you can purchase additional Incubators at the shop. Hatching an egg in Pokémon Sun and Moon Put the egg in your party.  Head to the small fenced in area with the hay bales directly across from the Pokémon Nursery on foot.  Once in there get on Tauros and use the circle pad to spin around in circles while holding down the B button. This is the quickest way hatch an egg. Or you can just keep it in your party while you walk from place to place if you're in no hurry. ",
  "tyn_model":[
    "phone",
    "pokémon go",
    "ditto",
    "pokémon",
    "pokémon egg",
    "incubator",
    "magby",
    "magmar",
    "lampent",
    "chandelure",
    "flame body",
    "acro bike",
    "rubber band",
    "bicycle",
    "bike wheel",
    "bike",
    "pokémon go app",
    "fan",
    "duct tape",
    "vinyl",
    "roomba",
    "drone",
    "google maps",
    "egg",
    "eggs",
    "incubators",
    "hay",
    "tauros"
  ],
  "tyn_section":[

  ]
}