{
  "title":"How to Make a Bubbling Brook Bracelet",
  "url":"https://www.wikihow.com/Make-a-Bubbling-Brook-Bracelet",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Beading"
  ],
  "steps":[
    {
      "headline":"Gather the necessary items.",
      "description":"These are listed in the \"Things You'll Need\" section below."
    },
    {
      "headline":"Measure your wrist.",
      "description":"Any measuring device will work, as long as it's accurate. (Note: The picture shows a 5\" wrist measurement.)"
    },
    {
      "headline":"Add 10 inches (25cm) to the wrist measurement, and then double the sum.",
      "description":"The photos show the example of adding 8\" (12.7cm) and then doubling (to 26\"), but better to be safe than sorry."
    },
    {
      "headline":"Measure the beading string or thread.",
      "description":""
    },
    {
      "headline":"Cut the thread.",
      "description":""
    },
    {
      "headline":"String the beads and clasp onto the string in the following order: 1 medium, 1 dark, 1 end of clasp, 1 dark, and 1 medium.",
      "description":"If you did this correctly, it should appear symmetrical."
    },
    {
      "headline":"Tie a square knot with the string.",
      "description":"With this first knot, it's important that it's centered, so while you're pulling the ends apart, hold onto the very ends of the string."
    },
    {
      "headline":"Add one light bead, threading the bead through both strings together.",
      "description":"It's quite alright if it goes over the knot, it's supposed to do that."
    },
    {
      "headline":"Now, separate the two strings.",
      "description":"Add one dark bead on each string, and add one medium bead on each string."
    },
    {
      "headline":"Now, thread one light bead through both strings together.",
      "description":"This pattern should look similar to the tightly-bundled section of beads (see the figure in the previous step) that are closest to the clasp."
    },
    {
      "headline":"Add one dark bead on each individual string, and then one medium bead on each individual string.",
      "description":"Now, put the two strings together, and thread one light bead through them. Continue in this fashion until you only have one more section to do before the bracelet fits you. Along the way, make sure you check how much longer the bracelet needs to be every once in a while. If you overdo it, you're going to have to start all over again."
    },
    {
      "headline":"Add 1 dark bead on each strand, 1 medium on each strand, and then the other end of the clasp to either side.",
      "description":"It's fine if it slides down over the beads in this last section."
    },
    {
      "headline":"Tie a double-square knot.",
      "description":""
    },
    {
      "headline":"Snip of the ends of the string, but be careful not to cut off the knot!",
      "description":""
    },
    {
      "headline":"Enjoy wearing it.",
      "description":"Don't forget to mention to your friends that you made it all by yourself (with the help of wikiHow, of course)!"
    }
  ],
  "text":" Gather the necessary items. These are listed in the \"Things You'll Need\" section below. Measure your wrist. Any measuring device will work, as long as it's accurate. (Note: The picture shows a 5\" wrist measurement.) Add 10 inches (25cm) to the wrist measurement, and then double the sum. The photos show the example of adding 8\" (12.7cm) and then doubling (to 26\"), but better to be safe than sorry. Measure the beading string or thread.  Cut the thread.  String the beads and clasp onto the string in the following order: 1 medium, 1 dark, 1 end of clasp, 1 dark, and 1 medium. If you did this correctly, it should appear symmetrical. Tie a square knot with the string. With this first knot, it's important that it's centered, so while you're pulling the ends apart, hold onto the very ends of the string. Add one light bead, threading the bead through both strings together. It's quite alright if it goes over the knot, it's supposed to do that. Now, separate the two strings. Add one dark bead on each string, and add one medium bead on each string. Now, thread one light bead through both strings together. This pattern should look similar to the tightly-bundled section of beads (see the figure in the previous step) that are closest to the clasp. Add one dark bead on each individual string, and then one medium bead on each individual string. Now, put the two strings together, and thread one light bead through them. Continue in this fashion until you only have one more section to do before the bracelet fits you. Along the way, make sure you check how much longer the bracelet needs to be every once in a while. If you overdo it, you're going to have to start all over again. Add 1 dark bead on each strand, 1 medium on each strand, and then the other end of the clasp to either side. It's fine if it slides down over the beads in this last section. Tie a double-square knot.  Snip of the ends of the string, but be careful not to cut off the knot!  Enjoy wearing it. Don't forget to mention to your friends that you made it all by yourself (with the help of wikiHow, of course)!",
  "tyn_model":[
    "thread",
    "beads",
    "string",
    "bracelet",
    "beading string"
  ],
  "tyn_section":[

  ]
}