{
  "title":"How to Grow Snapdragons",
  "url":"https://www.wikihow.com/Grow-Snapdragons",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Flowers"
  ],
  "parts":[
    {
      "name":"Starting Snapdragon Seeds",
      "steps":[
        {
          "headline":"Buy snapdragon seeds.",
          "description":"Snapdragons grow as thick, one to three-foot tall spikes adorned with colorful flowers. Different varieties produce flowers in different colors, so choose the one that works best with your flower garden's color scheme. Here are a few good choices:\nRocket series: this produces three-foot tall plants with flowers in red, pink, yellow, purple and white. Sonnet series: One and a half-foot tall plants in red, yellow, pink, purple and white. Liberty series: Two-foot tall plants in red, yellow, pink, purple, white, and several more variations."
        },
        {
          "headline":"Start the seeds indoors six to eight weeks before the last frost.",
          "description":"Snapdragons are easiest to grow from seed indoors in early spring. Prepare seedling pots with seed substrate (rather than regular potting soil). Scatter the seeds on the surface of the substrate and press lightly. Keep them in a warm, sunny window. Make sure to keep the substrate evenly moist. If you don't want to bother starting the seeds indoors, you can plant them outdoors in late fall. Press them into the prepared garden bed. With some luck, they'll come up in early spring. If you wish, you can completely skip this step and simply buy snapdragon seedlings from the nursery."
        },
        {
          "headline":"Nurture the seedlings until they're ready to plant.",
          "description":"Spend the six to eight weeks before the last frost keeping the seedlings well-watered and warm. When the seeds germinate and the seedlings sprout and grow leaves, the seedlings are strong enough to transplant outdoors. Keep them at a steady temperature between 60 and 70 degrees Fahrenheit. The seedlings will take 10 to 14 days to sprout."
        },
        {
          "headline":"Pinch off the tip of the stems when the seedlings have six leaves.",
          "description":"Pinching off the tip of the stems encourages more flowers to grow. You can do this with store-bought seedlings, too. Just make sure the seedlings have six leaves before pinching; otherwise, the plants may not yet be strong enough to withstand pinching."
        }
      ]
    },
    {
      "name":"Planting and Caring for Snapdragons",
      "steps":[
        {
          "headline":"Prepare the outdoor planting bed.",
          "description":"Snapdragons grow best in the cool temperatures of early spring, so you'll need to prepare the planting bed before the last frost of the year. They need full sun, and grow well in most types of neutral soil with a pH between 6.2 and 7. Amend the soil with organic matter, such as composted leaves, so the snapdragons will produce long-lasting flowers. To work organic matter into the soil, till the soil to a depth of six inches, apply six inches of organic matter, and mix. Make sure the soil drains well. Adding organic matter will help with drainage. Water poured into the planting bed should soak in right away. If it stands in a puddle, mix in more organic matter."
        },
        {
          "headline":"Plant the seedlings around the date of the last frost.",
          "description":"Snapdragons can withstand a frost or two, so the timing doesn't have to be exact."
        },
        {
          "headline":"Space the seedlings at least 1 foot (0.30 m) apart to prevent disease.",
          "description":"Snapdragons are vulnerable to rust, rot, and mildew. This spacing will provide plenty of airflow between each plant so that these problems don't develop. Water them immediately after planting."
        },
        {
          "headline":"Water only when the soil feels dry.",
          "description":"Overwatering will cause mold to grow on the plant, so wait until the soil feels a little dry before watering your snapdragons. When you water, water near the crown of the plants, rather than watering from overhead. The pressure from overhead watering can damage the flowers, so it's best to water closer to the roots. Water in the morning, rather than at night, so the water has time to be fully absorbed before nightfall. If water sits around the plants overnight, they could begin to develop rot or mildew."
        },
        {
          "headline":"Deadhead the stems.",
          "description":"When you see flowers that have already bloomed begin to wilt, pinch them off the snapdragon stems. This will encourage more flowers to bloom and keep the plants healthy."
        },
        {
          "headline":"Mulch the planting bed when the weather grows warm.",
          "description":"Use an organic mulch to cover the area around the snapdragons' roots. This will keep the root systems cool as the weather begins to get hot, and should help your snapdragons last longer before they begin to die off in the summer heat."
        },
        {
          "headline":"Collect the seeds.",
          "description":"As the plants mature, seed pods will form near the base of the stalks. Attach a brown lunch bag over the pods and let them naturally drop into the bags. You can dry out the seeds and plant them next year. As an alternative, you can let the seeds drop into the soil instead of catching and saving them. If you live in the right environment, snapdragons will self-seed. If you don't want to worry about the seeds, consider cutting the snapdragons at the height of their bloom, before they fade in the summer heat."
        },
        {
          "headline":"Remove diseased leaves.",
          "description":"If you do notice any rot or mildew on your plant, cut off any affected leaves or flowers. You should also clear away any diseased leaves that have fallen onto the ground. Watering the snapdragons in the morning and spacing them one foot apart will usually prevent disease. In many cases, it is easier to prevent mildew than it is to combat it."
        }
      ]
    }
  ],
  "text":" Starting Snapdragon Seeds Buy snapdragon seeds. Snapdragons grow as thick, one to three-foot tall spikes adorned with colorful flowers. Different varieties produce flowers in different colors, so choose the one that works best with your flower garden's color scheme. Here are a few good choices:\nRocket series: this produces three-foot tall plants with flowers in red, pink, yellow, purple and white. Sonnet series: One and a half-foot tall plants in red, yellow, pink, purple and white. Liberty series: Two-foot tall plants in red, yellow, pink, purple, white, and several more variations. Start the seeds indoors six to eight weeks before the last frost. Snapdragons are easiest to grow from seed indoors in early spring. Prepare seedling pots with seed substrate (rather than regular potting soil). Scatter the seeds on the surface of the substrate and press lightly. Keep them in a warm, sunny window. Make sure to keep the substrate evenly moist. If you don't want to bother starting the seeds indoors, you can plant them outdoors in late fall. Press them into the prepared garden bed. With some luck, they'll come up in early spring. If you wish, you can completely skip this step and simply buy snapdragon seedlings from the nursery. Nurture the seedlings until they're ready to plant. Spend the six to eight weeks before the last frost keeping the seedlings well-watered and warm. When the seeds germinate and the seedlings sprout and grow leaves, the seedlings are strong enough to transplant outdoors. Keep them at a steady temperature between 60 and 70 degrees Fahrenheit. The seedlings will take 10 to 14 days to sprout. Pinch off the tip of the stems when the seedlings have six leaves. Pinching off the tip of the stems encourages more flowers to grow. You can do this with store-bought seedlings, too. Just make sure the seedlings have six leaves before pinching; otherwise, the plants may not yet be strong enough to withstand pinching. Planting and Caring for Snapdragons Prepare the outdoor planting bed. Snapdragons grow best in the cool temperatures of early spring, so you'll need to prepare the planting bed before the last frost of the year. They need full sun, and grow well in most types of neutral soil with a pH between 6.2 and 7. Amend the soil with organic matter, such as composted leaves, so the snapdragons will produce long-lasting flowers. To work organic matter into the soil, till the soil to a depth of six inches, apply six inches of organic matter, and mix. Make sure the soil drains well. Adding organic matter will help with drainage. Water poured into the planting bed should soak in right away. If it stands in a puddle, mix in more organic matter. Plant the seedlings around the date of the last frost. Snapdragons can withstand a frost or two, so the timing doesn't have to be exact. Space the seedlings at least 1 foot (0.30 m) apart to prevent disease. Snapdragons are vulnerable to rust, rot, and mildew. This spacing will provide plenty of airflow between each plant so that these problems don't develop. Water them immediately after planting. Water only when the soil feels dry. Overwatering will cause mold to grow on the plant, so wait until the soil feels a little dry before watering your snapdragons. When you water, water near the crown of the plants, rather than watering from overhead. The pressure from overhead watering can damage the flowers, so it's best to water closer to the roots. Water in the morning, rather than at night, so the water has time to be fully absorbed before nightfall. If water sits around the plants overnight, they could begin to develop rot or mildew. Deadhead the stems. When you see flowers that have already bloomed begin to wilt, pinch them off the snapdragon stems. This will encourage more flowers to bloom and keep the plants healthy. Mulch the planting bed when the weather grows warm. Use an organic mulch to cover the area around the snapdragons' roots. This will keep the root systems cool as the weather begins to get hot, and should help your snapdragons last longer before they begin to die off in the summer heat. Collect the seeds. As the plants mature, seed pods will form near the base of the stalks. Attach a brown lunch bag over the pods and let them naturally drop into the bags. You can dry out the seeds and plant them next year. As an alternative, you can let the seeds drop into the soil instead of catching and saving them. If you live in the right environment, snapdragons will self-seed. If you don't want to worry about the seeds, consider cutting the snapdragons at the height of their bloom, before they fade in the summer heat. Remove diseased leaves. If you do notice any rot or mildew on your plant, cut off any affected leaves or flowers. You should also clear away any diseased leaves that have fallen onto the ground. Watering the snapdragons in the morning and spacing them one foot apart will usually prevent disease. In many cases, it is easier to prevent mildew than it is to combat it.",
  "tyn_model":[
    "snapdragons",
    "water",
    "organic matter",
    "snapdragon seeds",
    "sonnet",
    "seedling pots",
    "seed substrate",
    "potting soil",
    "snapdragon seedlings",
    "organic mulch",
    "lunch bag"
  ],
  "tyn_section":[

  ]
}