{
  "title":"How to Plumb a Pedestal Sink",
  "url":"https://www.wikihow.com/Plumb-a-Pedestal-Sink",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "steps":[
    {
      "headline":"Assure that the wall is substantial enough to support the sink.",
      "description":""
    },
    {
      "headline":"Follow the manufacturer's instructions to install the pop-up drain and the faucets.",
      "description":""
    },
    {
      "headline":"Set the sink onto the pedestal and level it with shims, if necessary.",
      "description":""
    },
    {
      "headline":"Use rubber stoppers to prevent the sink from rocking.",
      "description":"When the sink is level and stationary, mark the wall and floor for the mounting screws."
    },
    {
      "headline":"Mount the sink and caulk any gaps between it and the pedestal.",
      "description":""
    },
    {
      "headline":"Install the P-trap assembly and turn the water supply back on.",
      "description":""
    },
    {
      "headline":"Fill the sink with water and drain it to verify that there are no leaks.",
      "description":""
    },
    {
      "headline":"Tighten any leaky joints.",
      "description":"If your wall is made of drywall alone, you'll need to install backers."
    },
    {
      "headline":"Cut off the water supply at the main shutoff valve.",
      "description":""
    },
    {
      "headline":"Drain the hot and cold water lines into a bucket.",
      "description":""
    },
    {
      "headline":"Unscrew the mounting nuts that secure the trap to the bottom of the existing sink.",
      "description":""
    },
    {
      "headline":"Remove the trap by pulling it down.",
      "description":""
    },
    {
      "headline":"Slice through the water supply tubes using a hacksaw or a tubing cutter.",
      "description":"If your sink supply tubes are attached with bolts, unscrew them to disconnect the tubes."
    },
    {
      "headline":"Lift the existing sink out and remove the cabinet.",
      "description":""
    },
    {
      "headline":"Examine the placement of the supply and drain pipes once the sink is removed.",
      "description":""
    },
    {
      "headline":"Place the new sink and loosely install the faucet, drain and trap.",
      "description":""
    },
    {
      "headline":"Measure from the floor to the drain and determine the best place to conceal the water supply valves.",
      "description":""
    },
    {
      "headline":"Relocate the pipes by removing a section of the wall covering.",
      "description":""
    },
    {
      "headline":"Make sure you remove enough to accommodate the pipes as well as a wood panel to cover them.",
      "description":""
    },
    {
      "headline":"Use a keyhole saw to cut the wall and tilt the blade downward to keep it shallow.",
      "description":""
    },
    {
      "headline":"Mark the locations of the repositioned pipes along the wall stud.",
      "description":""
    },
    {
      "headline":"Indicate the center of the new sink on the bottom plate.",
      "description":""
    },
    {
      "headline":"Use a reciprocating saw to slice through the pipes.",
      "description":""
    },
    {
      "headline":"Connect the additional pipes with transition couplings.",
      "description":""
    },
    {
      "headline":"Assure that the transition couplings and the existing pipes are the same size in diameter.",
      "description":""
    },
    {
      "headline":"Connect the 1 1/2 inch (3.81 cm) drainage pipe to a PVC elbow using the transition coupling.",
      "description":""
    },
    {
      "headline":"Tighten the clamps with a pipe wrench.",
      "description":""
    },
    {
      "headline":"Route the PVC pipes so that the drain opening is centered over the marks on the bottom plate.",
      "description":""
    },
    {
      "headline":"Assure that the drains are properly placed and at the right height before permanently attaching them.",
      "description":""
    },
    {
      "headline":"Prime the ends, and the inside, of the fittings.",
      "description":""
    },
    {
      "headline":"Apply PVC adhesive to the primed areas and assemble the joints.",
      "description":""
    },
    {
      "headline":"Allow the adhesive to set for approximately 45 seconds before you let go of it.",
      "description":""
    },
    {
      "headline":"Finish the drain assembly by flexing the PVC just enough to allow for the last length of pipe.",
      "description":""
    },
    {
      "headline":"Cut the drain stub so that the drain adaptor will be flush against the wall.",
      "description":"Do not glue the stub until the drywall installation is complete."
    },
    {
      "headline":"Attach the copper pipes by soldering them, leaving enough excess to verify that there are no leaks.",
      "description":""
    },
    {
      "headline":"Install the shutoff valves after the wall covering is complete.",
      "description":""
    },
    {
      "headline":"Install the valves, drain stub and mounting for the sink.",
      "description":""
    }
  ],
  "text":" Assure that the wall is substantial enough to support the sink.  Follow the manufacturer's instructions to install the pop-up drain and the faucets.  Set the sink onto the pedestal and level it with shims, if necessary.  Use rubber stoppers to prevent the sink from rocking. When the sink is level and stationary, mark the wall and floor for the mounting screws. Mount the sink and caulk any gaps between it and the pedestal.  Install the P-trap assembly and turn the water supply back on.  Fill the sink with water and drain it to verify that there are no leaks.  Tighten any leaky joints. If your wall is made of drywall alone, you'll need to install backers. Cut off the water supply at the main shutoff valve.  Drain the hot and cold water lines into a bucket.  Unscrew the mounting nuts that secure the trap to the bottom of the existing sink.  Remove the trap by pulling it down.  Slice through the water supply tubes using a hacksaw or a tubing cutter. If your sink supply tubes are attached with bolts, unscrew them to disconnect the tubes. Lift the existing sink out and remove the cabinet.  Examine the placement of the supply and drain pipes once the sink is removed.  Place the new sink and loosely install the faucet, drain and trap.  Measure from the floor to the drain and determine the best place to conceal the water supply valves.  Relocate the pipes by removing a section of the wall covering.  Make sure you remove enough to accommodate the pipes as well as a wood panel to cover them.  Use a keyhole saw to cut the wall and tilt the blade downward to keep it shallow.  Mark the locations of the repositioned pipes along the wall stud.  Indicate the center of the new sink on the bottom plate.  Use a reciprocating saw to slice through the pipes.  Connect the additional pipes with transition couplings.  Assure that the transition couplings and the existing pipes are the same size in diameter.  Connect the 1 1/2 inch (3.81 cm) drainage pipe to a PVC elbow using the transition coupling.  Tighten the clamps with a pipe wrench.  Route the PVC pipes so that the drain opening is centered over the marks on the bottom plate.  Assure that the drains are properly placed and at the right height before permanently attaching them.  Prime the ends, and the inside, of the fittings.  Apply PVC adhesive to the primed areas and assemble the joints.  Allow the adhesive to set for approximately 45 seconds before you let go of it.  Finish the drain assembly by flexing the PVC just enough to allow for the last length of pipe.  Cut the drain stub so that the drain adaptor will be flush against the wall. Do not glue the stub until the drywall installation is complete. Attach the copper pipes by soldering them, leaving enough excess to verify that there are no leaks.  Install the shutoff valves after the wall covering is complete.  Install the valves, drain stub and mounting for the sink. ",
  "tyn_model":[
    "sink",
    "water",
    "shims",
    "rubber stoppers",
    "bucket",
    "water supply",
    "hacksaw",
    "keyhole saw",
    "reciprocating saw",
    "pvc elbow",
    "pipe wrench",
    "pvc pipes",
    "drains",
    "pvc adhesive",
    "adhesive",
    "pvc"
  ],
  "tyn_section":[

  ]
}