{
  "title":"How to Help Save the Environment While Shopping",
  "url":"https://www.wikihow.com/Help-Save-the-Environment-While-Shopping",
  "category_hierarchy":[
    "Home and Garden",
    "Sustainable Living"
  ],
  "steps":[
    {
      "headline":"Bring your own bags, preferably cloth or string.",
      "description":"Stores tend to be very easy-going about using plastic bags, which are often made of petroleum products and may take hundreds of years to decompose."
    },
    {
      "headline":"Choose paper over plastic, for if you were to ever use a store bag, paper is easier to recycle than plastic.",
      "description":""
    },
    {
      "headline":"Think of the packaging.",
      "description":"Larger items generally tend to use less packaging than smaller ones - a two liter bottle of soda not only consumes less packaging than a six-pack of individual bottle, but it also costs less."
    },
    {
      "headline":"Visit the local farmers' market.",
      "description":"Local produce is fresher, and it does not require large amounts of gas to ship it. You may even find specialty products that don't appear on your local grocery shelf. An added bonus: you get to meet friendly people and act as a real member of the community!"
    },
    {
      "headline":"Join a co op, for all the same reasons.",
      "description":""
    },
    {
      "headline":"Go shopping with a friend.",
      "description":"This can cut down on the use of gas to and from the market. You may even want to walk or bicycle together, enjoying a nice conversation."
    },
    {
      "headline":"Look for green \"Environmentally Friendly\" tags on the items you buy.",
      "description":"Buy local, buy organic."
    },
    {
      "headline":"Visit thrift shops.",
      "description":"There are great bargains, the quality is usually high, and you can get reduced rates by bringing in your own used clothes that you no longer want or need. It takes 4,000 gallons (15,141.6 L) of water to make one designer t-shirt. The most important step in \"Reduce, Reuse, Recycle\" is REDUCE. By reusing someone's goods, you are reducing the demand for new products."
    },
    {
      "headline":"Make a shopping list to avoid buying things that seem appealing but you will likely never use!",
      "description":"Don't buy just because you can. Know why you are purchasing something, and know that you can't borrow it or that you will use it very often."
    },
    {
      "headline":"Recycle - even at the restaurant.",
      "description":"Coffee Cups, cans, tins, Styrofoam plates; everything! There is bound to be a recycling bin, and if there is not, take a small (paper) bag, and drop it off later at a local recycling facility or drop it in your own recycling bin at home."
    },
    {
      "headline":"Compost - making a compost bin for all your food waste cuts down on what goes to the landfill, and it can be used for your garden!",
      "description":"Anything from tea bags or coffee grounds to banana peels to eggshells to paper kitchen towels can be put in there - as long as it will degrade."
    }
  ],
  "text":" Bring your own bags, preferably cloth or string. Stores tend to be very easy-going about using plastic bags, which are often made of petroleum products and may take hundreds of years to decompose. Choose paper over plastic, for if you were to ever use a store bag, paper is easier to recycle than plastic.  Think of the packaging. Larger items generally tend to use less packaging than smaller ones - a two liter bottle of soda not only consumes less packaging than a six-pack of individual bottle, but it also costs less. Visit the local farmers' market. Local produce is fresher, and it does not require large amounts of gas to ship it. You may even find specialty products that don't appear on your local grocery shelf. An added bonus: you get to meet friendly people and act as a real member of the community! Join a co op, for all the same reasons.  Go shopping with a friend. This can cut down on the use of gas to and from the market. You may even want to walk or bicycle together, enjoying a nice conversation. Look for green \"Environmentally Friendly\" tags on the items you buy. Buy local, buy organic. Visit thrift shops. There are great bargains, the quality is usually high, and you can get reduced rates by bringing in your own used clothes that you no longer want or need. It takes 4,000 gallons (15,141.6 L) of water to make one designer t-shirt. The most important step in \"Reduce, Reuse, Recycle\" is REDUCE. By reusing someone's goods, you are reducing the demand for new products. Make a shopping list to avoid buying things that seem appealing but you will likely never use! Don't buy just because you can. Know why you are purchasing something, and know that you can't borrow it or that you will use it very often. Recycle - even at the restaurant. Coffee Cups, cans, tins, Styrofoam plates; everything! There is bound to be a recycling bin, and if there is not, take a small (paper) bag, and drop it off later at a local recycling facility or drop it in your own recycling bin at home. Compost - making a compost bin for all your food waste cuts down on what goes to the landfill, and it can be used for your garden! Anything from tea bags or coffee grounds to banana peels to eggshells to paper kitchen towels can be put in there - as long as it will degrade.",
  "tyn_model":[
    "soda",
    "gas",
    "water",
    "coffee cups",
    "cans",
    "tins",
    "styrofoam plates",
    "compost",
    "compost bin",
    "tea bags",
    "coffee grounds"
  ],
  "tyn_section":[

  ]
}