{
  "title":"How to Catch a Bat in Your House",
  "url":"https://www.wikihow.com/Catch-a-Bat-in-Your-House",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control"
  ],
  "methods":[
    {
      "name":"Finding the Bat and Protecting Yourself",
      "steps":[
        {
          "headline":"Find the bat if it's hiding.",
          "description":"If you don't know where the bat is, start your search during the daytime, when the bat is asleep and easier to find and catch. Start looking in areas that don't see a lot of light, such as an attic or a secluded room. Look in places that the bat could hang from or crawl into, such as:\nOn curtains\nOn the back of furniture\nIn a houseplant\nOn hanging clothes\nBetween seat cushions\nUnder or behind cabinets or entertainment centers"
        },
        {
          "headline":"Keep pets and other people away.",
          "description":"The more people around the bat, the more stressed out and harder to catch it will be. Take any pets and children out of the room, and ask anyone else to leave as well."
        },
        {
          "headline":"Put on heavy, protective clothing.",
          "description":"Before you start trying to catch the bat, put on a thick, long-sleeved shirt or sweatshirt, long pants, and sturdy shoes or boots. Bats can bite and carry diseases like rabies, so it's important to protect your skin when you're nearby, especially if you don't know where the bat is. Avoid thin materials like cotton, which a bat can bite through."
        },
        {
          "headline":"Wear thick work gloves to protect your hands.",
          "description":"Your hands will be the most exposed to the bat, so put on thick leather gloves, or work gloves of a similarly strong material. If you don't have gloves, use a thick, rolled-up shirt of a heavy material. Avoid using a towel, since the bat's claws can get tangled in the loops."
        }
      ]
    },
    {
      "name":"Catching the Bat with a Bucket or Your Hands",
      "steps":[
        {
          "headline":"Close the doors and wait until the bat lands if it's flying around.",
          "description":"The bat will eventually get tired of flying around, so close the doors to keep it in one room and wait for it to land, keeping your eyes on it at all times. It will probably aim for a place where it can hang, such as behind curtains or upholstered furniture, on clothes that are hanging up, or even in house plants. Stay quiet and still while you wait for the bat to land. This will help it calm down more quickly. Don't try to catch the bat in mid-air. It's almost impossible, and will only panic the bat more. The bat doesn't want to touch you, so stay calm if it accidentally bumps into you. It will flit away as soon as it can."
        },
        {
          "headline":"Place a tub or bucket over the bat.",
          "description":"Once the bat has landed, carefully and quietly place a plastic tub, bucket, or similar container over it. This will prevent the bat from flying away while you work to remove it. Make sure the tub or bucket is large enough to comfortably fit the bat, so you don't accidentally injure it in the process. For best results, use a clear tub or bucket so you can see the bat as you trap and transport it."
        },
        {
          "headline":"Slide a piece of cardboard over the top of the bucket to trap it.",
          "description":"Work a piece of cardboard or stiff paper under the bucket to completely cover the opening. Keep the container as close to the wall or surface as possible, and be careful not to pinch the bat as you trap it inside. You can also use the lid of the bucket or tub (if it has one)."
        },
        {
          "headline":"Scoop it up with your hands if you don't have a bucket.",
          "description":"To catch the bat with your hands, approach it slowly and quietly, then reach down and smoothly pick it up in both of your hands, keeping a firm but gentle hold on it. Try to hold it so that its head is facing out, near the tips of your fingers, so you can keep the most pressure on its body. If the bat bites you, or if you get bat saliva in your eyes, nose, or mouth, seek medical attention immediately, since bats carry rabies."
        },
        {
          "headline":"Take the bat outside and release it onto a tree.",
          "description":"Quickly and carefully take the bucket outside to a nearby tree. Tilt it against the tree trunk and, holding the container at arms-length, carefully remove the cardboard to let the bat hop out. If you used your hands, hold the bat up against the tree trunk at arms-length. Carefully loosen your grip and let it hop out onto the tree. Bats typically can't take flight from the ground, so releasing it onto a tree will help it to escape more easily. This is especially important for a bat that's stressed and fatigued from flying around your house."
        },
        {
          "headline":"Seal up any potential entries once it's gone.",
          "description":"Check common bat entry points around your house, such as chimneys or openings that lead to attics or cellars. Seal them up as best you can, or hire a contractor to do so, to prevent another bat from getting into your house. Bats can enter or hide in any space that's big enough for 2 of your fingers."
        }
      ]
    },
    {
      "name":"Helping the Bat Escape",
      "steps":[
        {
          "headline":"Close interior doors into the room and turn off the lights.",
          "description":"If the bat won't land long enough for you to catch it, you can try to encourage it to escape instead. After locating the bat, close any doors to other rooms and turn off the lights. This will create a contained environment that's more comfortable for the bat, helping it to calm down and find an exit."
        },
        {
          "headline":"Open a window for the bat to escape.",
          "description":"Once the room is sealed off from the rest of the house, provide it an outside exit. Open up a large window (or a few), or prop open a door to the outside.The more windows you open, the more likely the bat will escape! Try to open windows near where the bat has been flying, so it's more likely to find the open air."
        },
        {
          "headline":"Leave the room for a while and stay quiet.",
          "description":"Ask everyone to leave the room, including children, pets, and other adults. Shut the door behind you and stay quiet to help the bat calm down even more."
        },
        {
          "headline":"Check to see if the bat is gone after 30 minutes.",
          "description":"Peek back into the room after about half an hour to see if the bat has left. Use a flashlight to look around for it. If it's still there, wait another hour and check again. If the bat still hasn't escaped but has calmed down enough to land, try to trap it with a bucket. If it's still flying around quickly, call pest control for help."
        }
      ]
    }
  ],
  "text":" Finding the Bat and Protecting Yourself Find the bat if it's hiding. If you don't know where the bat is, start your search during the daytime, when the bat is asleep and easier to find and catch. Start looking in areas that don't see a lot of light, such as an attic or a secluded room. Look in places that the bat could hang from or crawl into, such as:\nOn curtains\nOn the back of furniture\nIn a houseplant\nOn hanging clothes\nBetween seat cushions\nUnder or behind cabinets or entertainment centers Keep pets and other people away. The more people around the bat, the more stressed out and harder to catch it will be. Take any pets and children out of the room, and ask anyone else to leave as well. Put on heavy, protective clothing. Before you start trying to catch the bat, put on a thick, long-sleeved shirt or sweatshirt, long pants, and sturdy shoes or boots. Bats can bite and carry diseases like rabies, so it's important to protect your skin when you're nearby, especially if you don't know where the bat is. Avoid thin materials like cotton, which a bat can bite through. Wear thick work gloves to protect your hands. Your hands will be the most exposed to the bat, so put on thick leather gloves, or work gloves of a similarly strong material. If you don't have gloves, use a thick, rolled-up shirt of a heavy material. Avoid using a towel, since the bat's claws can get tangled in the loops. Catching the Bat with a Bucket or Your Hands Close the doors and wait until the bat lands if it's flying around. The bat will eventually get tired of flying around, so close the doors to keep it in one room and wait for it to land, keeping your eyes on it at all times. It will probably aim for a place where it can hang, such as behind curtains or upholstered furniture, on clothes that are hanging up, or even in house plants. Stay quiet and still while you wait for the bat to land. This will help it calm down more quickly. Don't try to catch the bat in mid-air. It's almost impossible, and will only panic the bat more. The bat doesn't want to touch you, so stay calm if it accidentally bumps into you. It will flit away as soon as it can. Place a tub or bucket over the bat. Once the bat has landed, carefully and quietly place a plastic tub, bucket, or similar container over it. This will prevent the bat from flying away while you work to remove it. Make sure the tub or bucket is large enough to comfortably fit the bat, so you don't accidentally injure it in the process. For best results, use a clear tub or bucket so you can see the bat as you trap and transport it. Slide a piece of cardboard over the top of the bucket to trap it. Work a piece of cardboard or stiff paper under the bucket to completely cover the opening. Keep the container as close to the wall or surface as possible, and be careful not to pinch the bat as you trap it inside. You can also use the lid of the bucket or tub (if it has one). Scoop it up with your hands if you don't have a bucket. To catch the bat with your hands, approach it slowly and quietly, then reach down and smoothly pick it up in both of your hands, keeping a firm but gentle hold on it. Try to hold it so that its head is facing out, near the tips of your fingers, so you can keep the most pressure on its body. If the bat bites you, or if you get bat saliva in your eyes, nose, or mouth, seek medical attention immediately, since bats carry rabies. Take the bat outside and release it onto a tree. Quickly and carefully take the bucket outside to a nearby tree. Tilt it against the tree trunk and, holding the container at arms-length, carefully remove the cardboard to let the bat hop out. If you used your hands, hold the bat up against the tree trunk at arms-length. Carefully loosen your grip and let it hop out onto the tree. Bats typically can't take flight from the ground, so releasing it onto a tree will help it to escape more easily. This is especially important for a bat that's stressed and fatigued from flying around your house. Seal up any potential entries once it's gone. Check common bat entry points around your house, such as chimneys or openings that lead to attics or cellars. Seal them up as best you can, or hire a contractor to do so, to prevent another bat from getting into your house. Bats can enter or hide in any space that's big enough for 2 of your fingers. Helping the Bat Escape Close interior doors into the room and turn off the lights. If the bat won't land long enough for you to catch it, you can try to encourage it to escape instead. After locating the bat, close any doors to other rooms and turn off the lights. This will create a contained environment that's more comfortable for the bat, helping it to calm down and find an exit. Open a window for the bat to escape. Once the room is sealed off from the rest of the house, provide it an outside exit. Open up a large window (or a few), or prop open a door to the outside.The more windows you open, the more likely the bat will escape! Try to open windows near where the bat has been flying, so it's more likely to find the open air. Leave the room for a while and stay quiet. Ask everyone to leave the room, including children, pets, and other adults. Shut the door behind you and stay quiet to help the bat calm down even more. Check to see if the bat is gone after 30 minutes. Peek back into the room after about half an hour to see if the bat has left. Use a flashlight to look around for it. If it's still there, wait another hour and check again. If the bat still hasn't escaped but has calmed down enough to land, try to trap it with a bucket. If it's still flying around quickly, call pest control for help.",
  "tyn_model":[
    "bat",
    "bucket",
    "tub",
    "cardboard",
    "container",
    "gloves",
    "towel",
    "bats",
    "pest control"
  ],
  "tyn_section":[

  ]
}