{
  "title":"How to Make Orzo",
  "url":"https://www.wikihow.com/Make-Orzo",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles"
  ],
  "methods":[
    {
      "name":"Simple Orzo",
      "steps":[
        {
          "headline":"Pour 4 tbsp.",
          "description":"of olive oil in a non-stick frying pan. A medium-sized pan is best. Heat the pan on medium heat until the oil warms up a bit, which should take 2 minutes. You can substitute butter for olive oil if that's what you prefer."
        },
        {
          "headline":"Add ½ pound of orzo to the pan.",
          "description":"Most orzo comes packaged in one-pound boxes, so use half the box."
        },
        {
          "headline":"Stir the orzo into the oil with a wooden spoon or rubber spatula.",
          "description":"You will want to lightly brown the pasta to give it a nutty flavor. This will take 2-5 minutes, depending on the heat. If it starts getting too dark too fast, take it off the stove. You want it to be toasted—not burnt."
        },
        {
          "headline":"Pour in 2 cups of chicken broth.",
          "description":"Pour in 1 cup at first, and then add the rest as time goes on so the rice absorbs it. You can stop after 1 1/2 cups if you'd like the orzo to be less creamy. The orzo will absorb the chicken broth similarly to the way rice would absorb the broth."
        },
        {
          "headline":"Turn up the heat to high and bring the mixture to a boil.",
          "description":"Then, reduce the heat to low and simmer the orzo and broth mixture for 10-15 minutes, or until the orzo is tender and has absorbed all of the broth. Sometimes you will find the orzo has absorbed the broth, but is still a bit tough. In that case, just add a bit more broth or water to the pan and keep cooking."
        },
        {
          "headline":"Serve.",
          "description":"Serve this tasty orzo on its own or eat it as a side dish with a main course like chicken or beef."
        }
      ]
    },
    {
      "name":"Creamy Garlic Parmesan Orzo",
      "steps":[
        {
          "headline":"Boil a pot of water.",
          "description":""
        },
        {
          "headline":"Pour 2 cups of orzo into the water.",
          "description":""
        },
        {
          "headline":"Cook the orzo over medium high heat for 10-12 minutes.",
          "description":"Read the directions on the package to see exactly how long the orzo should be cooked. When the orzo has expanded a bit and is ready to eat, drain it well."
        },
        {
          "headline":"Melt 1/3 cup of butter in a large skillet over medium heat.",
          "description":""
        },
        {
          "headline":"Add 1 chopped small onion to the skillet.",
          "description":"Sauté the onion until it's just softened, which should take about 3-4 minutes."
        },
        {
          "headline":"Add 2 tbsp.",
          "description":"minced garlic and 1/4 tbsp. of crushed red pepper flakes to the skillet. Cook the ingredients together for 2 minutes."
        },
        {
          "headline":"Reduce the heat to low.",
          "description":""
        },
        {
          "headline":"Place the rest of the ingredients in the skillet.",
          "description":"Add the cooked orzo, 1/2 cup of grated Parmesan cheese, 1/4-1/3 cup of half and half, 2-3 tbsp. of chopped parsley, and 1/2 tsp. of salt to the skillet. Toss the ingredients for 1-2 minutes to heat the orzo through."
        },
        {
          "headline":"Serve.",
          "description":"Season this creamy orzo with black pepper to taste and serve it immediately."
        }
      ]
    },
    {
      "name":"Primavera Orzo",
      "steps":[
        {
          "headline":"Heat 2 tbsp.",
          "description":"of extra-virgin olive oil in a skillet over medium high heat. Spread the oil into the pan by turning it from side to side until the oil spreads evenly over it."
        },
        {
          "headline":"Sauté the garlic, shallots, zucchini, and carrots in the skillet for 5 minutes.",
          "description":"Place 2 cloves of chopped garlic, 2 chopped shallots, 1 chopped zucchini, and 1 cup of chopped carrots in the pot and stir the ingredients a bit to combine the flavors."
        },
        {
          "headline":"Add the curry and chicken broth and bring it to a boil.",
          "description":"Place 1 tsp. of curry powder and 3 cups of chicken stock in the skillet and wait for the stock to boil."
        },
        {
          "headline":"Add 1 cup of uncooked orzo and cook the ingredients for 10 minutes.",
          "description":"Cover the orzo and reduce the heat to medium. Cook the ingredients together and stir them occasionally to combine the flavors. For all dente, cook the ingredients for 10 minutes. If you'd like the orzo to be a bit softer, cook it for another 1 or 2 additional minutes. Then, remove the skillet from heat."
        },
        {
          "headline":"Uncover the dish and stir in the cheese, parsley, and peas.",
          "description":"Stir in 1/2 cup of grated Parmesan, 3 tbsp. of chopped flat-leaf parsley, and 1 cup of peas."
        },
        {
          "headline":"Serve.",
          "description":"Season this dish with salt and pepper to taste and serve it immediately."
        }
      ]
    },
    {
      "name":"Mushroom Orzo",
      "steps":[
        {
          "headline":"Boil a medium-sized pot of water.",
          "description":""
        },
        {
          "headline":"Pour 3/4 cup of orzo into the water.",
          "description":""
        },
        {
          "headline":"Cook the orzo over medium high heat for 8-10 minutes.",
          "description":"Read the directions on the package to see exactly how long the orzo should be cooked. When the orzo has expanded a bit and is ready to eat, drain it well. Don't add any of the salt or butter that is included in the directions -- you will add it later."
        },
        {
          "headline":"Melt 1 1/2 tbsp.",
          "description":"of butter in a large skillet over medium heat for one minute. Cook the butter for one minute or until it's lightly browned."
        },
        {
          "headline":"Add the mushrooms, pepper, and salt to the skillet and cook them for 4 minutes.",
          "description":"Add 3 cups of sliced cremini mushrooms, 1/2 tsp. of black pepper, and 1/2 tsp. of salt to the skillet. Cook the ingredients for 4 minutes or until the mushrooms release their liquid. Continue to stir to combine the flavors."
        },
        {
          "headline":"Add 1/4 cup of lower-sodium chicken broth and 1 tbsp.",
          "description":"of white balsamic vinegar to the ingredients. Stir the ingredients for 30 seconds."
        },
        {
          "headline":"Stir in the cooked orzo and 1/4 cup of minced chives.",
          "description":"Stir the ingredients together for another minute, until the orzo is cooked through."
        },
        {
          "headline":"Serve.",
          "description":"Top the orzo with 1 oz. (1/4 cup) of shaved Pecorino Romano and enjoy it while it's hot."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Simple Orzo Pour 4 tbsp. of olive oil in a non-stick frying pan. A medium-sized pan is best. Heat the pan on medium heat until the oil warms up a bit, which should take 2 minutes. You can substitute butter for olive oil if that's what you prefer. Add ½ pound of orzo to the pan. Most orzo comes packaged in one-pound boxes, so use half the box. Stir the orzo into the oil with a wooden spoon or rubber spatula. You will want to lightly brown the pasta to give it a nutty flavor. This will take 2-5 minutes, depending on the heat. If it starts getting too dark too fast, take it off the stove. You want it to be toasted—not burnt. Pour in 2 cups of chicken broth. Pour in 1 cup at first, and then add the rest as time goes on so the rice absorbs it. You can stop after 1 1/2 cups if you'd like the orzo to be less creamy. The orzo will absorb the chicken broth similarly to the way rice would absorb the broth. Turn up the heat to high and bring the mixture to a boil. Then, reduce the heat to low and simmer the orzo and broth mixture for 10-15 minutes, or until the orzo is tender and has absorbed all of the broth. Sometimes you will find the orzo has absorbed the broth, but is still a bit tough. In that case, just add a bit more broth or water to the pan and keep cooking. Serve. Serve this tasty orzo on its own or eat it as a side dish with a main course like chicken or beef. Creamy Garlic Parmesan Orzo Boil a pot of water.  Pour 2 cups of orzo into the water.  Cook the orzo over medium high heat for 10-12 minutes. Read the directions on the package to see exactly how long the orzo should be cooked. When the orzo has expanded a bit and is ready to eat, drain it well. Melt 1/3 cup of butter in a large skillet over medium heat.  Add 1 chopped small onion to the skillet. Sauté the onion until it's just softened, which should take about 3-4 minutes. Add 2 tbsp. minced garlic and 1/4 tbsp. of crushed red pepper flakes to the skillet. Cook the ingredients together for 2 minutes. Reduce the heat to low.  Place the rest of the ingredients in the skillet. Add the cooked orzo, 1/2 cup of grated Parmesan cheese, 1/4-1/3 cup of half and half, 2-3 tbsp. of chopped parsley, and 1/2 tsp. of salt to the skillet. Toss the ingredients for 1-2 minutes to heat the orzo through. Serve. Season this creamy orzo with black pepper to taste and serve it immediately. Primavera Orzo Heat 2 tbsp. of extra-virgin olive oil in a skillet over medium high heat. Spread the oil into the pan by turning it from side to side until the oil spreads evenly over it. Sauté the garlic, shallots, zucchini, and carrots in the skillet for 5 minutes. Place 2 cloves of chopped garlic, 2 chopped shallots, 1 chopped zucchini, and 1 cup of chopped carrots in the pot and stir the ingredients a bit to combine the flavors. Add the curry and chicken broth and bring it to a boil. Place 1 tsp. of curry powder and 3 cups of chicken stock in the skillet and wait for the stock to boil. Add 1 cup of uncooked orzo and cook the ingredients for 10 minutes. Cover the orzo and reduce the heat to medium. Cook the ingredients together and stir them occasionally to combine the flavors. For all dente, cook the ingredients for 10 minutes. If you'd like the orzo to be a bit softer, cook it for another 1 or 2 additional minutes. Then, remove the skillet from heat. Uncover the dish and stir in the cheese, parsley, and peas. Stir in 1/2 cup of grated Parmesan, 3 tbsp. of chopped flat-leaf parsley, and 1 cup of peas. Serve. Season this dish with salt and pepper to taste and serve it immediately. Mushroom Orzo Boil a medium-sized pot of water.  Pour 3/4 cup of orzo into the water.  Cook the orzo over medium high heat for 8-10 minutes. Read the directions on the package to see exactly how long the orzo should be cooked. When the orzo has expanded a bit and is ready to eat, drain it well. Don't add any of the salt or butter that is included in the directions -- you will add it later. Melt 1 1/2 tbsp. of butter in a large skillet over medium heat for one minute. Cook the butter for one minute or until it's lightly browned. Add the mushrooms, pepper, and salt to the skillet and cook them for 4 minutes. Add 3 cups of sliced cremini mushrooms, 1/2 tsp. of black pepper, and 1/2 tsp. of salt to the skillet. Cook the ingredients for 4 minutes or until the mushrooms release their liquid. Continue to stir to combine the flavors. Add 1/4 cup of lower-sodium chicken broth and 1 tbsp. of white balsamic vinegar to the ingredients. Stir the ingredients for 30 seconds. Stir in the cooked orzo and 1/4 cup of minced chives. Stir the ingredients together for another minute, until the orzo is cooked through. Serve. Top the orzo with 1 oz. (1/4 cup) of shaved Pecorino Romano and enjoy it while it's hot. Finished. ",
  "tyn_model":[
    "skillet",
    "butter",
    "broth",
    "water",
    "salt",
    "orzo",
    "chicken broth",
    "garlic",
    "olive oil",
    "oil",
    "rice",
    "large skillet",
    "parsley",
    "black pepper",
    "shallots",
    "zucchini",
    "carrots",
    "peas",
    "mushrooms",
    "non-stick frying",
    "wooden spoon",
    "rubber spatula",
    "stove",
    "—not",
    "small onion",
    "onion",
    "crushed red pepper",
    "parmesan cheese",
    "half and half,",
    "extra-virgin olive oil",
    "pot",
    "curry",
    "curry powder",
    "chicken stock",
    "cheese",
    "parmesan",
    "flat-leaf parsley",
    "salt and pepper",
    "mushroom orzo",
    "medium-sized pot",
    "pepper",
    "cremini mushrooms",
    "lower-sodium chicken broth",
    "white balsamic vinegar",
    "chives",
    "pecorino romano"
  ],
  "tyn_section":[

  ]
}