{
  "title":"How to Draw a Cute Bird",
  "url":"https://www.wikihow.com/Draw-a-Cute-Bird",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "steps":[
    {
      "headline":"Draw a round triangular shape that looks like an egg to make the head.",
      "description":""
    },
    {
      "headline":"After drawing the head below this, draw an egg shape to be the body of the bird.",
      "description":"The top of the body should be large, and should taper down at the end."
    },
    {
      "headline":"The neck is simple.",
      "description":"Draw a curved line between the head and the body. Join these curves to make the neck."
    },
    {
      "headline":"After joining the neck lines with the body and the head to make the shape of the bird, the tail can be drawn.",
      "description":"The tail is simple to draw - just add some lines."
    },
    {
      "headline":"To draw the wing, draw a leaf shape and make a line across the body near the neck to connect them.",
      "description":""
    },
    {
      "headline":"After making the shape, draw some slight curves to make the feathers.",
      "description":"All the curves should join to make a single point to make a perfect wing."
    },
    {
      "headline":"One of the important parts is the elements of the face.",
      "description":"The eyes are really easy to draw. Only three round shapes are needed to make the eye. The bill has two parts- the top looks like a tent, while the bottom half is round. Add the crown as shown in the picture."
    },
    {
      "headline":"The last step is to draw it's two legs.",
      "description":"Make a round triangular shape for each foot and add some lines for the claws."
    },
    {
      "headline":"Color the bird if you wish.",
      "description":""
    }
  ],
  "text":" Draw a round triangular shape that looks like an egg to make the head.  After drawing the head below this, draw an egg shape to be the body of the bird. The top of the body should be large, and should taper down at the end. The neck is simple. Draw a curved line between the head and the body. Join these curves to make the neck. After joining the neck lines with the body and the head to make the shape of the bird, the tail can be drawn. The tail is simple to draw - just add some lines. To draw the wing, draw a leaf shape and make a line across the body near the neck to connect them.  After making the shape, draw some slight curves to make the feathers. All the curves should join to make a single point to make a perfect wing. One of the important parts is the elements of the face. The eyes are really easy to draw. Only three round shapes are needed to make the eye. The bill has two parts- the top looks like a tent, while the bottom half is round. Add the crown as shown in the picture. The last step is to draw it's two legs. Make a round triangular shape for each foot and add some lines for the claws. Color the bird if you wish. ",
  "tyn_model":[
    "bird",
    "feathers",
    "bill"
  ],
  "tyn_section":[

  ]
}