{
  "title":"How to Write a Get Together Invitation",
  "url":"https://www.wikihow.com/Write-a-Get-Together-Invitation",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Planning",
    "Invitations"
  ],
  "steps":[
    {
      "headline":"Decide what type of event you want to have: Formal, Casual or themed (pirates, spring, tropical, sports related, etc.)",
      "description":""
    },
    {
      "headline":"Figure out food.",
      "description":"Will you be asking everyone to participate in the food? If so, are you going to leave the type of dish to bring to each person, or will you tell them what to bring?"
    },
    {
      "headline":"Determine the time and place the event will be held.",
      "description":""
    },
    {
      "headline":"Pick the paper you will use based on the type of event.",
      "description":"If formal, a nice paper, if tropical a paper with a tropical background, etc."
    },
    {
      "headline":"Make sure your invitation has the details -- What, Where, When and How.",
      "description":"What you are invited to\nWhere the event will take place (small, typed directions with map may be inserted in the envelope)\nWhen is the exact time and date. How is what you are asking others to bring and if it is to be a special dress such as coat and tie, tropical dress, etc."
    },
    {
      "headline":"Print the invitations out 2-3 weeks before the event and mail them.",
      "description":"If it is a very formal invitation such as a wedding you will probably want a professional printer to do the work. They will provide the paper you will provide the wording."
    },
    {
      "headline":"Decide how you would like people to RSVP (French for réspondez s'il vous plaît meaning please reply.",
      "description":"List your email address or phone number for people to respond."
    },
    {
      "headline":"Decide the venue",
      "description":""
    }
  ],
  "text":" Decide what type of event you want to have: Formal, Casual or themed (pirates, spring, tropical, sports related, etc.)  Figure out food. Will you be asking everyone to participate in the food? If so, are you going to leave the type of dish to bring to each person, or will you tell them what to bring? Determine the time and place the event will be held.  Pick the paper you will use based on the type of event. If formal, a nice paper, if tropical a paper with a tropical background, etc. Make sure your invitation has the details -- What, Where, When and How. What you are invited to\nWhere the event will take place (small, typed directions with map may be inserted in the envelope)\nWhen is the exact time and date. How is what you are asking others to bring and if it is to be a special dress such as coat and tie, tropical dress, etc. Print the invitations out 2-3 weeks before the event and mail them. If it is a very formal invitation such as a wedding you will probably want a professional printer to do the work. They will provide the paper you will provide the wording. Decide how you would like people to RSVP (French for réspondez s'il vous plaît meaning please reply. List your email address or phone number for people to respond. Decide the venue ",
  "tyn_model":[
    "paper",
    "food",
    "printer"
  ],
  "tyn_section":[

  ]
}