{
  "title":"How to Make Peanut Butter Frosting",
  "url":"https://www.wikihow.com/Make-Peanut-Butter-Frosting",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Peanut Butter Frosting",
      "steps":[
        {
          "headline":"Beat the butters.",
          "description":"Whip the softened ½ cup of butter with the 1 cup of peanut butter in a large mixing bowl, using an electric mixer. Whip the mixture until it becomes fluffy. This process should take about 2 minutes."
        },
        {
          "headline":"Add the powdered sugar.",
          "description":"Gradually add in the 2 cups of powdered sugar to the butter mixture. The sugar should be added to the butters as the electric mixer continues to beat the ingredients at a slow speed. This mixing process should only take about 3-5 minutes. To slowly add the powdered sugar, hold the container of powdered sugar above the electric mixing bowl, and slowly tap the container, causing a little bit of powder to fall into the butter mixture at a time."
        },
        {
          "headline":"Adjust the frosting’s consistency.",
          "description":"Add in about 2-3 tablespoons of milk or cream as needed, depending on how thick you want the frosting. The more milk or cream you add, the thinner the frosting will be. The less milk or cream you add, the thicker the frosting will be."
        }
      ]
    },
    {
      "name":"Peanut Butter and Cream Cheese Frosting",
      "steps":[
        {
          "headline":"Mix the cream cheese and butter.",
          "description":"Mix the 8 oz. package of softened cream cheese with the ½ cup of peanut butter in a large mixing bowl, using an electric mixer. Mix until the ingredients become smooth. This mixing should take about 2-3 minutes."
        },
        {
          "headline":"Add the powdered sugar.",
          "description":"Add in the  3-3 ½ cups of powdered sugar. Add in the powdered sugar in gradually, making sure every addition is blended in well before adding the next bit of powder. This blending process should take about 3-5 minutes."
        },
        {
          "headline":"Add the vanilla.",
          "description":"Once the powdered sugar is well blended, add 1 teaspoon of vanilla. The vanilla shouldn't take very long to mix in with the rest of the ingredients, about 30 seconds. When you add the vanilla, make sure the electric mixer is still going. You want the mixer to be constantly mixing."
        },
        {
          "headline":"Blend to your desired consistency.",
          "description":"Once all the frosting ingredients are mixed in, add in 2 tablespoon of either milk or cream to change the consistency of the frosting to your liking. If you’re looking for a low-fat option, you can try using skim milk or reduced fat cream, along with reduced fat cream cheese."
        }
      ]
    },
    {
      "name":"Peanut Butter and Chocolate Frosting",
      "steps":[
        {
          "headline":"Beat the butters.",
          "description":"In a medium bowl, use an electric mixer to blend together the ½ cup of peanut butter, 2 tablespoons of softened butter, and a pinch of salt. Mix these ingredients together until they are light and smooth. This process should only take about 2 minutes."
        },
        {
          "headline":"Add in the wet ingredients.",
          "description":"Blend in the 1 teaspoon of vanilla along with 3 tablespoons of milk until they are well blended into the mixture."
        },
        {
          "headline":"Add in the dry ingredients.",
          "description":"Once the vanilla and milk are blended into the mixture, gradually add in 1 ½ cup of powdered sugar, and ¼ cup of cocoa powder, mixing on a low speed. The dry ingredients might gravitate toward the edges of the mixing bowl, so use a rubber spatula to kneed the mixture back into the center of the bowl where the mixing beater are."
        },
        {
          "headline":"Add milk for desired consistency.",
          "description":"Add in the 3-4 tablespoons of milk to the frosting mixture, carefully adding more milk, if necessary, to reach your desired frosting consistency."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Peanut Butter Frosting Beat the butters. Whip the softened ½ cup of butter with the 1 cup of peanut butter in a large mixing bowl, using an electric mixer. Whip the mixture until it becomes fluffy. This process should take about 2 minutes. Add the powdered sugar. Gradually add in the 2 cups of powdered sugar to the butter mixture. The sugar should be added to the butters as the electric mixer continues to beat the ingredients at a slow speed. This mixing process should only take about 3-5 minutes. To slowly add the powdered sugar, hold the container of powdered sugar above the electric mixing bowl, and slowly tap the container, causing a little bit of powder to fall into the butter mixture at a time. Adjust the frosting’s consistency. Add in about 2-3 tablespoons of milk or cream as needed, depending on how thick you want the frosting. The more milk or cream you add, the thinner the frosting will be. The less milk or cream you add, the thicker the frosting will be. Peanut Butter and Cream Cheese Frosting Mix the cream cheese and butter. Mix the 8 oz. package of softened cream cheese with the ½ cup of peanut butter in a large mixing bowl, using an electric mixer. Mix until the ingredients become smooth. This mixing should take about 2-3 minutes. Add the powdered sugar. Add in the  3-3 ½ cups of powdered sugar. Add in the powdered sugar in gradually, making sure every addition is blended in well before adding the next bit of powder. This blending process should take about 3-5 minutes. Add the vanilla. Once the powdered sugar is well blended, add 1 teaspoon of vanilla. The vanilla shouldn't take very long to mix in with the rest of the ingredients, about 30 seconds. When you add the vanilla, make sure the electric mixer is still going. You want the mixer to be constantly mixing. Blend to your desired consistency. Once all the frosting ingredients are mixed in, add in 2 tablespoon of either milk or cream to change the consistency of the frosting to your liking. If you’re looking for a low-fat option, you can try using skim milk or reduced fat cream, along with reduced fat cream cheese. Peanut Butter and Chocolate Frosting Beat the butters. In a medium bowl, use an electric mixer to blend together the ½ cup of peanut butter, 2 tablespoons of softened butter, and a pinch of salt. Mix these ingredients together until they are light and smooth. This process should only take about 2 minutes. Add in the wet ingredients. Blend in the 1 teaspoon of vanilla along with 3 tablespoons of milk until they are well blended into the mixture. Add in the dry ingredients. Once the vanilla and milk are blended into the mixture, gradually add in 1 ½ cup of powdered sugar, and ¼ cup of cocoa powder, mixing on a low speed. The dry ingredients might gravitate toward the edges of the mixing bowl, so use a rubber spatula to kneed the mixture back into the center of the bowl where the mixing beater are. Add milk for desired consistency. Add in the 3-4 tablespoons of milk to the frosting mixture, carefully adding more milk, if necessary, to reach your desired frosting consistency. Finished. ",
  "tyn_model":[
    "milk",
    "powdered sugar",
    "vanilla",
    "butter",
    "peanut butter",
    "electric mixer",
    "cream",
    "butters",
    "cream cheese",
    "large mixing bowl",
    "sugar",
    "peanut butter frosting",
    "electric mixing bowl",
    "mixer",
    "skim milk",
    "reduced fat cream",
    "reduced fat cream cheese",
    "chocolate frosting",
    "salt",
    "cocoa powder",
    "mixing bowl",
    "rubber spatula",
    "bowl",
    "mixing beater"
  ],
  "tyn_section":[

  ]
}