{
  "title":"How to Make Pumpkin Flavored Coffee",
  "url":"https://www.wikihow.com/Make-Pumpkin-Flavored-Coffee",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee",
    "Flavored Coffee"
  ],
  "steps":[
    {
      "headline":"Prepare the grounds.",
      "description":"Measure out your coffee grounds and spices. Place them in your coffeemaker of choice. Mr. Coffeemaker-style drip-brew coffeemakers will work, but for better results, use a French press, moka pot, or other coffee maker."
    },
    {
      "headline":"Stir.",
      "description":"Stir your pumpkin pie spices into the coffee grounds with a small spoon."
    },
    {
      "headline":"Add the mixture in the coffee maker.",
      "description":"Place the mixture of coffee-grounds and spices in your coffeemaker of choice."
    },
    {
      "headline":"Brew the coffee.",
      "description":"Brew the coffee as you normally would."
    },
    {
      "headline":"Enjoy!",
      "description":"The coffee is now infused with the taste of pumpkin pie, and chances are good the air is too! Pour in a sturdy mug, then stir in a teaspoon of vanilla extract, two ounces of warm milk, and a little sugar, if desired. Serve with a slice of pie or a dish of sugar cookies for dessert."
    }
  ],
  "text":" Prepare the grounds. Measure out your coffee grounds and spices. Place them in your coffeemaker of choice. Mr. Coffeemaker-style drip-brew coffeemakers will work, but for better results, use a French press, moka pot, or other coffee maker. Stir. Stir your pumpkin pie spices into the coffee grounds with a small spoon. Add the mixture in the coffee maker. Place the mixture of coffee-grounds and spices in your coffeemaker of choice. Brew the coffee. Brew the coffee as you normally would. Enjoy! The coffee is now infused with the taste of pumpkin pie, and chances are good the air is too! Pour in a sturdy mug, then stir in a teaspoon of vanilla extract, two ounces of warm milk, and a little sugar, if desired. Serve with a slice of pie or a dish of sugar cookies for dessert.",
  "tyn_model":[
    "coffee",
    "coffee grounds",
    "spices",
    "coffee maker",
    "french press",
    "moka pot",
    "pumpkin pie spices",
    "small spoon",
    "coffee-",
    "pumpkin pie",
    "mug",
    "vanilla extract",
    "warm milk",
    "sugar",
    "sugar cookies"
  ],
  "tyn_section":[

  ]
}