{
  "title":"How to Set Up Your Nintendo Wii",
  "url":"https://www.wikihow.com/Set-Up-Your-Nintendo-Wii",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo Wii"
  ],
  "parts":[
    {
      "name":"Setting up the Wii Hardware",
      "steps":[
        {
          "headline":"Place the Wii near your TV.",
          "description":"Make sure that the Wii is placed close enough for the cables to reach the TV and the power outlet. If you are using the vertical stand, first make sure that the stand is assembled by taking the vertical stand and the round piece of plastic and sliding them together until they click."
        },
        {
          "headline":"Connect your Wii to a power source.",
          "description":"Plug the power cable that came with your Wii into an electrical outlet, then plug the other end into the port on the far-left side of the back of the Wii."
        },
        {
          "headline":"Attach the sensor bar to the Wii.",
          "description":"Plug the thin, black-and-grey sensor bar's cable into the red port that's on the back of the Wii console, then place the sensor bar below and in front of your TV. Remove the covers over the sticky pads on the sensor's bottom to secure it in place. You can also place the sensor bar on top of your TV."
        },
        {
          "headline":"Connect the Wii to the TV.",
          "description":"Most Wii units come with red, white, and yellow A/V cables; plug the non-colored end of the cable into the flat, wide port on the back of the Wii unit, then attach the red, white, and yellow cables to the red, white, and yellow ports in the \"Video In\" section that's behind or on the side of your TV. The Wii requires Wii-specific cables in order to connect to your TV; standard A/V cables will not work. If you're trying to connect your Wii's A/V cables to a computer monitor, you'll have to buy an adapter for your monitor."
        },
        {
          "headline":"Insert batteries into the Wii remote.",
          "description":"Remove the back panel from the Wiimote and put two AA batteries in. These are included with the console if you bought it new. Use the printed + and - guides to ensure that the batteries are inserted correctly. If your Wii remote has a rubber jacket, you will need to remove it before you can access the battery cover."
        },
        {
          "headline":"Test the Wii remote.",
          "description":"Press A on the Wii remote to verify that the batteries are working. If you see the lights at the bottom of the remote briefly turn on or flash and then stay on, your remote is working. If the lights don't come on at all, try inserting new batteries."
        },
        {
          "headline":"Secure the wriststraps to the Wiimotes.",
          "description":"Wriststraps are very important when using the Wii, especially when playing games with lots of movement. The Wii remote is secured at the bottom of the Wiimote by looping the wriststrap through the hook. You can cinch the wriststrap around your wrist while you play."
        },
        {
          "headline":"Turn on your TV.",
          "description":"Press your TV's power button to turn on the set."
        },
        {
          "headline":"Switch to your Wii's input.",
          "description":"Press your TV's (or TV remote's) Input or Video button until you see the right number appear. Your Wii will be plugged into the A/V input, which is usually input number 1, 2, or 3. You can double-check your Wii's input number on your TV by looking for a number near the yellow, white, and red plugs on the back or side of your TV."
        },
        {
          "headline":"Turn on the Wii.",
          "description":"Press the Power button on the front of the Wii. After a few seconds, you should see the Wii setup screen appear on your TV. If you don't see or hear anything, ensure that your TV is set to the correct input, and that your A/V cable is connected correctly. Cycling through the available inputs will eventually cause the Wii's setup screen to display."
        },
        {
          "headline":"Synchronize your Wii remote with your console.",
          "description":"Once your remote is synchronized, you'll see one constant red light at the bottom of the remote, meaning that you can continue with setting up your Wii. To sync your remote:\nOpen the SD card slot on the front of your Wii console. Remove the battery cover on the Wii remote. Press the Sync button below the battery compartment. Wait for the lights at the bottom of the remote to start blinking. Press the red Sync button in the Wii's SD card slot."
        }
      ]
    },
    {
      "name":"Setting up the Wii Software",
      "steps":[
        {
          "headline":"Press the A button.",
          "description":"It's at the top of the remote. If your Wii has been set up before, your Wii may open to the home screen. If so, skip to the next part."
        },
        {
          "headline":"Select a language and press A.",
          "description":"This will select the language for your Wii's menus."
        },
        {
          "headline":"Select Continue and press A.",
          "description":"It's in the bottom-right corner of the screen."
        },
        {
          "headline":"Select a sensor bar position.",
          "description":"Select either Above TV or Below TV and press A, then select Continue."
        },
        {
          "headline":"Select a date.",
          "description":"Select the up or down arrows above or below the month, day, and year values, then press A to change them. Select Continue when you're done."
        },
        {
          "headline":"Select a time.",
          "description":"You'll do this the same way that you changed the date. Select Continue when you're done. Keep in mind that the clock here is in military time, meaning that you add 12 to the time in PM from noon through midnight (e.g., 12:00 PM would be \"1200\", but 3:00 PM would be \"1500\")."
        },
        {
          "headline":"Select a widescreen setting.",
          "description":"Select 4:3 for a normal TV or 16:9 for a widescreen TV, then select Continue."
        },
        {
          "headline":"Enter a nickname for your console.",
          "description":"Type in a name using the on-screen keyboard, then select Continue."
        },
        {
          "headline":"Select a country.",
          "description":"Select the country you're currently in and press A, then select Continue."
        },
        {
          "headline":"Select No and press A.",
          "description":"This will take you past the parental controls warning."
        },
        {
          "headline":"Press A.",
          "description":"This will acknowledge that you have read the Wii's burn-in reduction filter policy. Doing so will take you to the Wii home screen, signifying that your setup is complete. Depending on your Wii, a video displaying how to use your Wii may begin playing."
        }
      ]
    },
    {
      "name":"Setting up the Sensor Bar",
      "steps":[
        {
          "headline":"Select Wii and press A.",
          "description":"This option is in the bottom-left corner of the screen. Doing so prompts a pop-up menu."
        },
        {
          "headline":"Select Wii Options and press A.",
          "description":"It's an option in the pop-up menu. This will open the Wii Options page."
        },
        {
          "headline":"Scroll right, then select Sensor Bar and press A. Scrolling right takes you to the second page of the Wii Options screen, and the Sensor Bar option opens your Wii's sensor bar settings.",
          "description":""
        },
        {
          "headline":"Select Position and press A.",
          "description":"Doing so opens the Position menu. Skip this step if you don't want to reset the position you set during the Wii setup."
        },
        {
          "headline":"Select a position.",
          "description":"Select either Above TV or Below TV and press A."
        },
        {
          "headline":"Select Confirm and press A.",
          "description":"It's at the bottom of the screen. This will fine-tune your sensor based on its position."
        },
        {
          "headline":"Adjust your sensor bar's sensitivity.",
          "description":"Select Sensitivity and press A, then press + or - on your remote to increase or decrease your remote's sensitivity on-screen."
        },
        {
          "headline":"Press A.",
          "description":"This will confirm your decision and return you to the Sensor Bar page."
        }
      ]
    },
    {
      "name":"Going Online",
      "steps":[
        {
          "headline":"Exit the Sensor Bar page.",
          "description":"Select Back and press A to return to page two of the Options page. If you have an Ethernet USB adapter that you bought from Nintendo, you can plug it into the back of your console and then plug an Ethernet cable from your router into the adapter."
        },
        {
          "headline":"Select Internet and press A.",
          "description":"This will open the Internet settings."
        },
        {
          "headline":"Select Connection Settings and press A.",
          "description":"This will display a list of three connections. If the Wii has never been connected to the internet, all of the settings will say \"None\" next to the Connection number."
        },
        {
          "headline":"Select an unused connection and press A.",
          "description":""
        },
        {
          "headline":"Select Wireless and press A.",
          "description":"Doing so will take you to the wireless network page. If you're using Ethernet, select Wired and then select OK to connect to the Internet."
        },
        {
          "headline":"Select Search for an Access Point and press A.",
          "description":"This will bring up a list of the current available networks."
        },
        {
          "headline":"Select a network and press A.",
          "description":"This will bring up the connection's page. If the connection is public, selecting the network will prompt your Wii to connect to it automatically."
        },
        {
          "headline":"Enter your network's password.",
          "description":"If your network is password-protected, enter the password and press A."
        },
        {
          "headline":"Update your Wii.",
          "description":"Once you connect to either your wired or wireless network, you will be prompted to update your system. These updates can improve system functionality, and are required if you are playing online. Do not update your system if it is modded, or you will lose access to your Homebrew channel."
        },
        {
          "headline":"Add games and channels.",
          "description":"After updating your system, you will be connected to the internet every time the Wii is turned on. You can then add games and channels from the Wii store. Games will cost money to purchase, but most channels can be downloaded for free (some require a separate subscription to use). You can access the shop from the Wii Channels screen."
        }
      ]
    },
    {
      "name":"Playing Games",
      "steps":[
        {
          "headline":"Insert the game you want to play.",
          "description":"If there's nothing in your disc tray, you can insert the game into the disc drive to load it. Inserting the disc will open the game's channel, allowing you to start it by pressing the button on your screen. Make sure that you insert the disc the correct direction, with the label facing up. You can also download games from the Wii store and they will show up as channels in your Channel menu."
        },
        {
          "headline":"Use the Wiimote to play.",
          "description":"Depending on the game, you may be asked to swing your controller around to play the game. Make sure you have plenty of room to move, and that you won't bump into anyone or anything."
        },
        {
          "headline":"Play a GameCube game.",
          "description":"If you want to play a GameCube game in an RVL-001 Wii, you will need to use a GameCube controller, and plug it into one of the ports on the top (vertical) or left side (horizontal) of the Wii. You will need to open a flap to access the ports. You'll insert the GameCube game like you would a regular Wii game. Although the discs are smaller, they can be inserted into any part of the disc loader."
        }
      ]
    }
  ],
  "text":" Setting up the Wii Hardware Place the Wii near your TV. Make sure that the Wii is placed close enough for the cables to reach the TV and the power outlet. If you are using the vertical stand, first make sure that the stand is assembled by taking the vertical stand and the round piece of plastic and sliding them together until they click. Connect your Wii to a power source. Plug the power cable that came with your Wii into an electrical outlet, then plug the other end into the port on the far-left side of the back of the Wii. Attach the sensor bar to the Wii. Plug the thin, black-and-grey sensor bar's cable into the red port that's on the back of the Wii console, then place the sensor bar below and in front of your TV. Remove the covers over the sticky pads on the sensor's bottom to secure it in place. You can also place the sensor bar on top of your TV. Connect the Wii to the TV. Most Wii units come with red, white, and yellow A/V cables; plug the non-colored end of the cable into the flat, wide port on the back of the Wii unit, then attach the red, white, and yellow cables to the red, white, and yellow ports in the \"Video In\" section that's behind or on the side of your TV. The Wii requires Wii-specific cables in order to connect to your TV; standard A/V cables will not work. If you're trying to connect your Wii's A/V cables to a computer monitor, you'll have to buy an adapter for your monitor. Insert batteries into the Wii remote. Remove the back panel from the Wiimote and put two AA batteries in. These are included with the console if you bought it new. Use the printed + and - guides to ensure that the batteries are inserted correctly. If your Wii remote has a rubber jacket, you will need to remove it before you can access the battery cover. Test the Wii remote. Press A on the Wii remote to verify that the batteries are working. If you see the lights at the bottom of the remote briefly turn on or flash and then stay on, your remote is working. If the lights don't come on at all, try inserting new batteries. Secure the wriststraps to the Wiimotes. Wriststraps are very important when using the Wii, especially when playing games with lots of movement. The Wii remote is secured at the bottom of the Wiimote by looping the wriststrap through the hook. You can cinch the wriststrap around your wrist while you play. Turn on your TV. Press your TV's power button to turn on the set. Switch to your Wii's input. Press your TV's (or TV remote's) Input or Video button until you see the right number appear. Your Wii will be plugged into the A/V input, which is usually input number 1, 2, or 3. You can double-check your Wii's input number on your TV by looking for a number near the yellow, white, and red plugs on the back or side of your TV. Turn on the Wii. Press the Power button on the front of the Wii. After a few seconds, you should see the Wii setup screen appear on your TV. If you don't see or hear anything, ensure that your TV is set to the correct input, and that your A/V cable is connected correctly. Cycling through the available inputs will eventually cause the Wii's setup screen to display. Synchronize your Wii remote with your console. Once your remote is synchronized, you'll see one constant red light at the bottom of the remote, meaning that you can continue with setting up your Wii. To sync your remote:\nOpen the SD card slot on the front of your Wii console. Remove the battery cover on the Wii remote. Press the Sync button below the battery compartment. Wait for the lights at the bottom of the remote to start blinking. Press the red Sync button in the Wii's SD card slot. Setting up the Wii Software Press the A button. It's at the top of the remote. If your Wii has been set up before, your Wii may open to the home screen. If so, skip to the next part. Select a language and press A. This will select the language for your Wii's menus. Select Continue and press A. It's in the bottom-right corner of the screen. Select a sensor bar position. Select either Above TV or Below TV and press A, then select Continue. Select a date. Select the up or down arrows above or below the month, day, and year values, then press A to change them. Select Continue when you're done. Select a time. You'll do this the same way that you changed the date. Select Continue when you're done. Keep in mind that the clock here is in military time, meaning that you add 12 to the time in PM from noon through midnight (e.g., 12:00 PM would be \"1200\", but 3:00 PM would be \"1500\"). Select a widescreen setting. Select 4:3 for a normal TV or 16:9 for a widescreen TV, then select Continue. Enter a nickname for your console. Type in a name using the on-screen keyboard, then select Continue. Select a country. Select the country you're currently in and press A, then select Continue. Select No and press A. This will take you past the parental controls warning. Press A. This will acknowledge that you have read the Wii's burn-in reduction filter policy. Doing so will take you to the Wii home screen, signifying that your setup is complete. Depending on your Wii, a video displaying how to use your Wii may begin playing. Setting up the Sensor Bar Select Wii and press A. This option is in the bottom-left corner of the screen. Doing so prompts a pop-up menu. Select Wii Options and press A. It's an option in the pop-up menu. This will open the Wii Options page. Scroll right, then select Sensor Bar and press A. Scrolling right takes you to the second page of the Wii Options screen, and the Sensor Bar option opens your Wii's sensor bar settings.  Select Position and press A. Doing so opens the Position menu. Skip this step if you don't want to reset the position you set during the Wii setup. Select a position. Select either Above TV or Below TV and press A. Select Confirm and press A. It's at the bottom of the screen. This will fine-tune your sensor based on its position. Adjust your sensor bar's sensitivity. Select Sensitivity and press A, then press + or - on your remote to increase or decrease your remote's sensitivity on-screen. Press A. This will confirm your decision and return you to the Sensor Bar page. Going Online Exit the Sensor Bar page. Select Back and press A to return to page two of the Options page. If you have an Ethernet USB adapter that you bought from Nintendo, you can plug it into the back of your console and then plug an Ethernet cable from your router into the adapter. Select Internet and press A. This will open the Internet settings. Select Connection Settings and press A. This will display a list of three connections. If the Wii has never been connected to the internet, all of the settings will say \"None\" next to the Connection number. Select an unused connection and press A.  Select Wireless and press A. Doing so will take you to the wireless network page. If you're using Ethernet, select Wired and then select OK to connect to the Internet. Select Search for an Access Point and press A. This will bring up a list of the current available networks. Select a network and press A. This will bring up the connection's page. If the connection is public, selecting the network will prompt your Wii to connect to it automatically. Enter your network's password. If your network is password-protected, enter the password and press A. Update your Wii. Once you connect to either your wired or wireless network, you will be prompted to update your system. These updates can improve system functionality, and are required if you are playing online. Do not update your system if it is modded, or you will lose access to your Homebrew channel. Add games and channels. After updating your system, you will be connected to the internet every time the Wii is turned on. You can then add games and channels from the Wii store. Games will cost money to purchase, but most channels can be downloaded for free (some require a separate subscription to use). You can access the shop from the Wii Channels screen. Playing Games Insert the game you want to play. If there's nothing in your disc tray, you can insert the game into the disc drive to load it. Inserting the disc will open the game's channel, allowing you to start it by pressing the button on your screen. Make sure that you insert the disc the correct direction, with the label facing up. You can also download games from the Wii store and they will show up as channels in your Channel menu. Use the Wiimote to play. Depending on the game, you may be asked to swing your controller around to play the game. Make sure you have plenty of room to move, and that you won't bump into anyone or anything. Play a GameCube game. If you want to play a GameCube game in an RVL-001 Wii, you will need to use a GameCube controller, and plug it into one of the ports on the top (vertical) or left side (horizontal) of the Wii. You will need to open a flap to access the ports. You'll insert the GameCube game like you would a regular Wii game. Although the discs are smaller, they can be inserted into any part of the disc loader.",
  "tyn_model":[
    "wii",
    "tv",
    "wii remote",
    "batteries",
    "gamecube game",
    "wii options",
    "remote",
    "electrical outlet",
    "cables",
    "wiimotes",
    "tv remote",
    "a/v cable",
    "sd card slot",
    "language",
    "parental controls",
    "ethernet usb adapter",
    "ethernet cable",
    "wireless network page",
    "internet",
    "games",
    "wiimote",
    "controller",
    "gamecube controller",
    "discs"
  ],
  "tyn_section":[

  ]
}