{
  "title":"How to Make Apple Crumb Cake",
  "url":"https://www.wikihow.com/Make-Apple-Crumb-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Fruit Desserts"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350ºF/180ºC.",
      "description":"Butter a 10\" x 6.5\" glass pan."
    },
    {
      "headline":"Mix the brown sugar and butter together until fluffy.",
      "description":"Add the egg and vanilla and mix everything together."
    },
    {
      "headline":"Add the flour, baking soda, cinnamon, sour cream, and apples.",
      "description":"Carefully mix."
    },
    {
      "headline":"Pour the mixture into the glass pan and spread evenly with a spatula.",
      "description":"The mixture is quite thick, so you will need to spread it out."
    },
    {
      "headline":"Make the crumb topping by mixing all the ingredients until you get small \"crumbs\".",
      "description":"Use a stand mixer or fork to crumble the ingredients together. Sprinkle evenly over the top of the wet mixture."
    },
    {
      "headline":"Bake for 40 minutes.",
      "description":""
    },
    {
      "headline":"Make your favorite cup of tea and enjoy!",
      "description":""
    }
  ],
  "text":" Preheat the oven to 350ºF/180ºC. Butter a 10\" x 6.5\" glass pan. Mix the brown sugar and butter together until fluffy. Add the egg and vanilla and mix everything together. Add the flour, baking soda, cinnamon, sour cream, and apples. Carefully mix. Pour the mixture into the glass pan and spread evenly with a spatula. The mixture is quite thick, so you will need to spread it out. Make the crumb topping by mixing all the ingredients until you get small \"crumbs\". Use a stand mixer or fork to crumble the ingredients together. Sprinkle evenly over the top of the wet mixture. Bake for 40 minutes.  Make your favorite cup of tea and enjoy! ",
  "tyn_model":[
    "glass pan",
    "oven",
    "brown sugar",
    "butter",
    "egg",
    "vanilla",
    "flour",
    "baking soda",
    "cinnamon",
    "sour cream",
    "apples",
    "spatula",
    "stand mixer",
    "fork",
    "tea"
  ],
  "tyn_section":[

  ]
}