{
  "title":"How to Prepare Healthy Summer Recipes",
  "url":"https://www.wikihow.com/Prepare-Healthy-Summer-Recipes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Meal Planning"
  ],
  "steps":[
    {
      "headline":"Take advantage of local farmers' markets.",
      "description":"If you're not already familiar with a local farmers' markets, look for one. They're a large gathering of tent or stall food vendors and merchants whom sell fresh and farm-made produce at prices that are often better than the supermarket. Some of the most common foods sold at farmer's markets include potatoes, apples, bananas, green beans, fresh berries, peaches and other stone fruits, lots of greens, and corn husks, although the list is endless really! Specialty items that you might find at a farmer's market include honey, jams, olive oils, boutique or gourmet produced meats, breads, dips, infused oils, and more. Some vendors are ethnic food orientated, such as Indian, Thai, Korean, or Spanish, providing you with the opportunity to try foods you've not yet tasted. You can find out more about your local farmer's market by searching online, or calling your local chamber of commerce or municipality for more information. Even if the produce isn't as cheap as a supermarket, the benefit of a farmer's market is freshness, low mileage in terms of getting the produce from farm to table, and direct support for local growers. All of these are good reasons to try a local farmer's market!"
    },
    {
      "headline":"Focus on how to make your summer cooking more healthy.",
      "description":"Summer is a time of relaxation and that atmosphere should also invade the kitchen. When focusing on methods for cooking, think easy. Some of the healthiest cooking ways are the easiest, such as raw food (salads, etc. ), grilling, steaming, and barbecuing (which gets you out of the kitchen). Focus on using food at its freshest and on replenishing it quickly so that everything you eat still contains lots of nutrients. Purchase a book on seasonal cooking. This will help you to easily pinpoint summer oriented recipes without having to flick through the entire book. Another easy approach is to buy what is in season and to search for recipes using that ingredient online; simple but not always thought of!"
    },
    {
      "headline":"Grill fruits, vegetables and fish instead of meat.",
      "description":"Just about any vegetable, such as corn on the cob, peppers, asparagus, and onions can be easily grilled in minutes. Make fruit kebabs for kid lunches or put a slab of salmon on a grill instead of steak. Here are some ideas:\nGrill halibut\nGrill vegetables\n\nGrill a veggie panini."
    },
    {
      "headline":"Eat light.",
      "description":"You don't need to gorge yourself with a huge meal to be satisfied. Create healthy balanced salads as an appetizer or lunch. The possibilities of salad toppings and additions are endless, such as chopped pecans, low-fat salad dressing, dried fruit, and fresh vegetables."
    },
    {
      "headline":"Use fruit in different ways.",
      "description":"Rather than just peeling or cutting it up into pieces, drink fruit smoothies or use fruit as a salad ingredient. Follow some of these refreshing ideas:\nWatermelon lemonade\nWatermelon mint raspberry salad\nCherry pie salad\n\nBanana smoothie."
    },
    {
      "headline":"Use more berries in your cooking.",
      "description":"Berries are abundant during summer and they're really good for you. Strawberries, raspberries, blueberries, and more can be used in hundreds of different ways. Here is just a small sample of ideas:\nStrawberry salad\nBanana raspberry pie\nBlueberry julius\nStrawberry dressing for salads\nFish with berries\n\nBlueberry muffins."
    },
    {
      "headline":"Eat more trail mix snacks or fruits.",
      "description":"Nuts, raisins, and dried fruit are the best combinations for a treat or \"on-the-go\" snack. Drop an apple or a tangerine into your bag or a handful of grapes into a sandwich baggie. Having healthy options easily available will remove the temptation to eat nutrient-deficient foods in their place."
    },
    {
      "headline":"Keep the kids happy with fruit popsicles or fruit flavored ice cubes.",
      "description":"Add fruit ice cubes to a glass of orange juice or fruit punch for more flavor."
    },
    {
      "headline":"Re-hydrate with water.",
      "description":"Try to stay away from energy and sports drinks, especially for children. Despite the fact that they may replenish electrolytes and fluids, they also contain carbohydrates and caffeine amounts that lead to obesity and high blood pressure. As well, curb the soda drinks and flavored milks. Water is healthy, rehydrates instantly and keeps your body in great shape."
    }
  ],
  "text":" Take advantage of local farmers' markets. If you're not already familiar with a local farmers' markets, look for one. They're a large gathering of tent or stall food vendors and merchants whom sell fresh and farm-made produce at prices that are often better than the supermarket. Some of the most common foods sold at farmer's markets include potatoes, apples, bananas, green beans, fresh berries, peaches and other stone fruits, lots of greens, and corn husks, although the list is endless really! Specialty items that you might find at a farmer's market include honey, jams, olive oils, boutique or gourmet produced meats, breads, dips, infused oils, and more. Some vendors are ethnic food orientated, such as Indian, Thai, Korean, or Spanish, providing you with the opportunity to try foods you've not yet tasted. You can find out more about your local farmer's market by searching online, or calling your local chamber of commerce or municipality for more information. Even if the produce isn't as cheap as a supermarket, the benefit of a farmer's market is freshness, low mileage in terms of getting the produce from farm to table, and direct support for local growers. All of these are good reasons to try a local farmer's market! Focus on how to make your summer cooking more healthy. Summer is a time of relaxation and that atmosphere should also invade the kitchen. When focusing on methods for cooking, think easy. Some of the healthiest cooking ways are the easiest, such as raw food (salads, etc. ), grilling, steaming, and barbecuing (which gets you out of the kitchen). Focus on using food at its freshest and on replenishing it quickly so that everything you eat still contains lots of nutrients. Purchase a book on seasonal cooking. This will help you to easily pinpoint summer oriented recipes without having to flick through the entire book. Another easy approach is to buy what is in season and to search for recipes using that ingredient online; simple but not always thought of! Grill fruits, vegetables and fish instead of meat. Just about any vegetable, such as corn on the cob, peppers, asparagus, and onions can be easily grilled in minutes. Make fruit kebabs for kid lunches or put a slab of salmon on a grill instead of steak. Here are some ideas:\nGrill halibut\nGrill vegetables\n\nGrill a veggie panini. Eat light. You don't need to gorge yourself with a huge meal to be satisfied. Create healthy balanced salads as an appetizer or lunch. The possibilities of salad toppings and additions are endless, such as chopped pecans, low-fat salad dressing, dried fruit, and fresh vegetables. Use fruit in different ways. Rather than just peeling or cutting it up into pieces, drink fruit smoothies or use fruit as a salad ingredient. Follow some of these refreshing ideas:\nWatermelon lemonade\nWatermelon mint raspberry salad\nCherry pie salad\n\nBanana smoothie. Use more berries in your cooking. Berries are abundant during summer and they're really good for you. Strawberries, raspberries, blueberries, and more can be used in hundreds of different ways. Here is just a small sample of ideas:\nStrawberry salad\nBanana raspberry pie\nBlueberry julius\nStrawberry dressing for salads\nFish with berries\n\nBlueberry muffins. Eat more trail mix snacks or fruits. Nuts, raisins, and dried fruit are the best combinations for a treat or \"on-the-go\" snack. Drop an apple or a tangerine into your bag or a handful of grapes into a sandwich baggie. Having healthy options easily available will remove the temptation to eat nutrient-deficient foods in their place. Keep the kids happy with fruit popsicles or fruit flavored ice cubes. Add fruit ice cubes to a glass of orange juice or fruit punch for more flavor. Re-hydrate with water. Try to stay away from energy and sports drinks, especially for children. Despite the fact that they may replenish electrolytes and fluids, they also contain carbohydrates and caffeine amounts that lead to obesity and high blood pressure. As well, curb the soda drinks and flavored milks. Water is healthy, rehydrates instantly and keeps your body in great shape.",
  "tyn_model":[
    "berries",
    "farmer's market",
    "vegetables",
    "fruit",
    "fish",
    "water",
    "farmers' markets",
    "farmer's markets",
    "potatoes",
    "apples",
    "bananas",
    "green beans",
    "peaches",
    "corn husks",
    "honey",
    "jams",
    "olive oils",
    "food",
    "peppers",
    "onions",
    "salmon",
    "grill",
    "steak",
    "halibut",
    "low-fat salad dressing",
    "fruit smoothies",
    "cherry pie salad",
    "banana smoothie",
    "strawberries",
    "raspberries",
    "blueberries",
    "strawberry salad",
    "banana raspberry pie",
    "strawberry dressing",
    "blueberry muffins",
    "trail mix snacks",
    "fruits",
    "nuts",
    "raisins",
    "apple",
    "tangerine",
    "grapes",
    "sandwich baggie",
    "fruit popsicles",
    "ice cubes",
    "fruit ice cubes",
    "orange juice",
    "fruit punch",
    "soda drinks",
    "flavored milks"
  ],
  "tyn_section":[

  ]
}