{
  "title":"How to Bake Chicken Legs",
  "url":"https://www.wikihow.com/Bake-Chicken-Legs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "methods":[
    {
      "name":"Honey Baked Chicken Legs",
      "steps":[
        {
          "headline":"Preheat oven to 350 degrees.",
          "description":"To make sure that your oven is hot and ready to bake the chicken, start preheating it when you are ready to start seasoning the chicken."
        },
        {
          "headline":"Wash the chicken legs.",
          "description":"Remove the legs from the package and wash them thoroughly under cool, running water. Remove dangling pieces of fat or skin. After you have washed the meat, dry the meat with paper towels. This will help the flavors cling to the meat, and allow the skin to get crispy when cooked. Set the meat on a plate until you are ready to move on to the next step."
        },
        {
          "headline":"Season the chicken.",
          "description":"Combine the salt, garlic powder, flour and pepper in a large storage bag. Add the chicken to the bag and seal it. Shake the bag to toss the chicken legs until the pieces are evenly coated."
        },
        {
          "headline":"Heat the butter and olive oil in the pan.",
          "description":"Put the butter and olive oil in a metal or glass baking pan, and place the pan in the oven. Remove the pan when the butter is melted. This should only take a few minutes. Remember to use oven mitts to protect your hands when you remove the pan from the oven. Place the hot pan on a potholder or trivet."
        },
        {
          "headline":"Bake the chicken.",
          "description":"Place the seasoned chicken pieces in the pan with the hot butter and oil. Use tongs to coat them in the mixture. Bake the chicken for 30 minutes. Remember to use oven mitts to protect your hands when you remove the pan from the oven. Place the hot pan on a potholder or trivet. Remove the hot pan with care - don't let it tilt."
        },
        {
          "headline":"Make the honey mixture.",
          "description":"While the chicken bakes, place a saucepan over medium heat and add the honey, brown sugar, and lemon. Stir the mixture until the sugar is dissolved and then remove the pan from the heat."
        },
        {
          "headline":"Remove the chicken from the oven and pour the honey mixture over the pieces.",
          "description":"Put the chicken back into the oven and bake for another 35 minutes, or until the chicken skin looks crisp and brown. Chicken is done when it has reached an internal temperature of 180 degrees. Use a meat thermometer to check the temperature."
        },
        {
          "headline":"Serve the chicken.",
          "description":"Serve the chicken with vegetables, rice, or sides of your choice."
        }
      ]
    },
    {
      "name":"Spicy Hot Chicken Legs",
      "steps":[
        {
          "headline":"Preheat oven to 400 degrees.",
          "description":"To make sure that your oven is hot and ready to bake the chicken, start preheating it when you are ready to start seasoning the chicken."
        },
        {
          "headline":"Wash the chicken legs.",
          "description":"Remove the legs from the package and wash them thoroughly under cool, running water. Remove dangling pieces of fat or skin. After you have washed the meat, dry the meat with paper towels. This will help the flavors cling to the meat, and allow the skin to get crispy when cooked. Set the meat on a plate until you are ready to move on to the next step."
        },
        {
          "headline":"Melt butter in a saucepan.",
          "description":"Place butter in a saucepan over medium heat. After the butter has melted, add the cayenne, black pepper, salt, and lemon juice, and stir to combine. Remove the mixture from heat."
        },
        {
          "headline":"Coat the chicken in the butter mixture.",
          "description":"Using a pair of tongs, place each piece of chicken in the butter mixture one at a time. Swirl each piece around until it's fully coated. Place the chicken pieces in a metal or glass baking pan."
        },
        {
          "headline":"Bake the chicken.",
          "description":"Put the chicken in the oven and set a timer for 30 minutes. Check the chicken after 30 minutes. It should be ready when the skin is crispy and golden brown, or when the internal temperature has reached 180 degrees. Use a meat thermometer to check the temperature."
        },
        {
          "headline":"Serve the chicken.",
          "description":"Serve with mashed potatoes and a salad, or the side dishes of your choice."
        }
      ]
    },
    {
      "name":"Rosemary Garlic Chicken Legs",
      "steps":[
        {
          "headline":"Preheat oven to 350 degrees.",
          "description":"To make sure that your oven is hot and ready to bake the chicken, start preheating it when you are ready to start seasoning the chicken."
        },
        {
          "headline":"Wash the chicken legs.",
          "description":"Remove the legs from the package and wash them thoroughly under cool, running water. Remove dangling pieces of fat or skin. After you have washed the meat, dry the meat with paper towels. This will help the flavors cling to the meat, and allow the skin to get crispy when cooked. Set the meat on a plate until you are ready to move on to the next step."
        },
        {
          "headline":"Assemble the coating ingredients.",
          "description":"Place the flour in a shallow pan. Combine the eggs and milk in a separate pan. Combine the rosemary, garlic, breadcrumbs, and salt and pepper in a third shallow pan."
        },
        {
          "headline":"Coat the chicken.",
          "description":"Using a pair of tongs, coat each piece of chicken, one at a time. First coat each piece in the flour, then the egg mixture, and then the rosemary garlic mixture. Place the coated pieces of chicken in a glass or metal baking pan coated in olive oil."
        },
        {
          "headline":"Bake the chicken for 30 minutes.",
          "description":"The chicken is finished when it's sizzling and crispy, or when its internal temperature reaches 180 degrees. Use a meat thermometer to check the temperature."
        },
        {
          "headline":"Serve the chicken.",
          "description":"Serve with french green beans and wild rice, or the side dishes of your choice."
        }
      ]
    }
  ],
  "text":" Honey Baked Chicken Legs Preheat oven to 350 degrees. To make sure that your oven is hot and ready to bake the chicken, start preheating it when you are ready to start seasoning the chicken. Wash the chicken legs. Remove the legs from the package and wash them thoroughly under cool, running water. Remove dangling pieces of fat or skin. After you have washed the meat, dry the meat with paper towels. This will help the flavors cling to the meat, and allow the skin to get crispy when cooked. Set the meat on a plate until you are ready to move on to the next step. Season the chicken. Combine the salt, garlic powder, flour and pepper in a large storage bag. Add the chicken to the bag and seal it. Shake the bag to toss the chicken legs until the pieces are evenly coated. Heat the butter and olive oil in the pan. Put the butter and olive oil in a metal or glass baking pan, and place the pan in the oven. Remove the pan when the butter is melted. This should only take a few minutes. Remember to use oven mitts to protect your hands when you remove the pan from the oven. Place the hot pan on a potholder or trivet. Bake the chicken. Place the seasoned chicken pieces in the pan with the hot butter and oil. Use tongs to coat them in the mixture. Bake the chicken for 30 minutes. Remember to use oven mitts to protect your hands when you remove the pan from the oven. Place the hot pan on a potholder or trivet. Remove the hot pan with care - don't let it tilt. Make the honey mixture. While the chicken bakes, place a saucepan over medium heat and add the honey, brown sugar, and lemon. Stir the mixture until the sugar is dissolved and then remove the pan from the heat. Remove the chicken from the oven and pour the honey mixture over the pieces. Put the chicken back into the oven and bake for another 35 minutes, or until the chicken skin looks crisp and brown. Chicken is done when it has reached an internal temperature of 180 degrees. Use a meat thermometer to check the temperature. Serve the chicken. Serve the chicken with vegetables, rice, or sides of your choice. Spicy Hot Chicken Legs Preheat oven to 400 degrees. To make sure that your oven is hot and ready to bake the chicken, start preheating it when you are ready to start seasoning the chicken. Wash the chicken legs. Remove the legs from the package and wash them thoroughly under cool, running water. Remove dangling pieces of fat or skin. After you have washed the meat, dry the meat with paper towels. This will help the flavors cling to the meat, and allow the skin to get crispy when cooked. Set the meat on a plate until you are ready to move on to the next step. Melt butter in a saucepan. Place butter in a saucepan over medium heat. After the butter has melted, add the cayenne, black pepper, salt, and lemon juice, and stir to combine. Remove the mixture from heat. Coat the chicken in the butter mixture. Using a pair of tongs, place each piece of chicken in the butter mixture one at a time. Swirl each piece around until it's fully coated. Place the chicken pieces in a metal or glass baking pan. Bake the chicken. Put the chicken in the oven and set a timer for 30 minutes. Check the chicken after 30 minutes. It should be ready when the skin is crispy and golden brown, or when the internal temperature has reached 180 degrees. Use a meat thermometer to check the temperature. Serve the chicken. Serve with mashed potatoes and a salad, or the side dishes of your choice. Rosemary Garlic Chicken Legs Preheat oven to 350 degrees. To make sure that your oven is hot and ready to bake the chicken, start preheating it when you are ready to start seasoning the chicken. Wash the chicken legs. Remove the legs from the package and wash them thoroughly under cool, running water. Remove dangling pieces of fat or skin. After you have washed the meat, dry the meat with paper towels. This will help the flavors cling to the meat, and allow the skin to get crispy when cooked. Set the meat on a plate until you are ready to move on to the next step. Assemble the coating ingredients. Place the flour in a shallow pan. Combine the eggs and milk in a separate pan. Combine the rosemary, garlic, breadcrumbs, and salt and pepper in a third shallow pan. Coat the chicken. Using a pair of tongs, coat each piece of chicken, one at a time. First coat each piece in the flour, then the egg mixture, and then the rosemary garlic mixture. Place the coated pieces of chicken in a glass or metal baking pan coated in olive oil. Bake the chicken for 30 minutes. The chicken is finished when it's sizzling and crispy, or when its internal temperature reaches 180 degrees. Use a meat thermometer to check the temperature. Serve the chicken. Serve with french green beans and wild rice, or the side dishes of your choice.",
  "tyn_model":[
    "chicken",
    "oven",
    "butter",
    "water",
    "paper towels",
    "plate",
    "flour",
    "olive oil",
    "honey",
    "saucepan",
    "meat thermometer",
    "salt",
    "oven mitts",
    "lemon",
    "baking pan",
    "rosemary garlic",
    "garlic powder",
    "pepper",
    "large storage bag",
    "pan",
    "oil",
    "brown sugar",
    "sugar",
    "rice",
    "cayenne",
    "black pepper",
    "mashed potatoes",
    "eggs",
    "milk",
    "rosemary",
    "garlic",
    "salt and pepper",
    "french green beans",
    "wild rice"
  ],
  "tyn_section":[

  ]
}