{
  "title":"How to Buy Cooking Utensils",
  "url":"https://www.wikihow.com/Buy-Cooking-Utensils",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking Equipment",
    "Kitchen Utensils"
  ],
  "methods":[
    {
      "name":"Choosing Basics for Cooking and Baking",
      "steps":[
        {
          "headline":"Invest in a set of mixing bowls for your baking and cooking needs.",
          "description":"Mixing bowls are a great staple to have in your kitchen, and you can use them for so many different things! From mixing up a batter for cookies or tossing veggies in olive oil and seasoning, you’ll find yourself reaching for these bowls regularly. Consider the different types of bowls for your own needs:\nPlastic: these are inexpensive and won’t break easily, but they can sometimes absorb odors and oils from the dishes you prepare. Stainless steel: you can buy a set of nesting stainless steel bowls for about $30, and they’ll last for a very long time. Glass: can double as serving bowls and are often able to be safely used in the microwave and oven. Ceramic: these are more expensive, but they usually look a lot nicer than the other kinds of bowls. They can chip easily, though, and they’re very heavy. Copper: these are fashionable and effective but you have clean them after regular use. If you can, get a set of bowls that comes with fitted lids. This makes it a lot easier to store prepped foods and leftovers. Look for mixing bowls online or at your local home goods store. You can also often find sets at thrift stores—just make sure to clean them thoroughly before you use them."
        },
        {
          "headline":"Get a set of essential pots and pans so you can cook almost anything.",
          "description":"You could either buy a prepared set of pots and pans from a specific brand, or you could choose each item piecemeal and create your own unique set. It’s worth it to invest in nicer pieces so that they’ll last you a lifetime rather than getting the most inexpensive options. Whichever way you choose to go, make sure to get the following for your basic cooking needs:\nStainless steel skillet: to sear meats and cook sauces; use with acidic ingredients, like tomatoes and vinegar (the stainless steel won’t react with the acidity). Stainless steel stockpot: to make soups, stews, and chowders. Nonstick skillet: to cook eggs, fish, and other dishes that might easily stick to the pan (like a grilled cheese sandwich or a quesadilla). Cast-iron skillet: to cook meats and caramelize vegetables.Tip: Invest in a splatter guard to help keep your stovetop clean. It’ll catch pops of grease and sauce and keep them off of your stove, definitely minimizing how much you’ll have to clean up later."
        },
        {
          "headline":"Buy a set of rimmed baking sheets for both savory and sweet dishes.",
          "description":"Look for sheets made of aluminum for an affordable option that is also going to be pretty easy to clean. You can bake cookies, roast vegetables, and make many other dishes on baking sheets. Line your baking sheets with parchment paper to make cleanup that much simpler. After your dish is out of the oven, you can just throw away the parchment paper and wipe down the baking sheet without having to scrub away baked-on food. You can find baking sheets online or at your local home goods store. If you aren’t a professional baker, there’s no need to spend more than $10 to $20 for a set of sheets."
        },
        {
          "headline":"Use glass baking pans to make casseroles, roast meats, and veggies.",
          "description":"Glass distributes heat a lot more evenly than other types of vessels, and it’ll keep your dish warm for a really long time after it has come out of the oven. Lasagnas, casseroles, roasts, enchiladas, and lots of other delicious dishes can be easily cooked in a baking pan. Never use a glass pan to broil meats, as they are more likely to shatter. Pyrex is a well-trusted brand, as is OXO. You can often get sets of glass pans from these brands for $30 to $50, and they usually come with fitted lids, too."
        },
        {
          "headline":"Purchase a stand mixer to more easily prepare doughs and batters.",
          "description":"Cookies, cakes, breads, muffins, and even pizza doughs can be made at home, and a stand mixer will make the mixing process that much simpler for you. They’re larger pieces of equipment, so make sure you have a space for one on your counter. If you aren’t ready to commit to the price of a stand mixer, try a hand mixer instead. It’s smaller, less expensive, and easier to store. KitchenAid is the most popular standing mixer brand. Their mixers are more expensive, running anywhere from $200 to $300, but they come with great warranties, are easy to repair, and there are many attachments you can buy for them."
        },
        {
          "headline":"Look for specialty items if you enjoy making baked goods.",
          "description":"After you’ve gotten the basic baking items, you may find that you need more specialized equipment. Here are some common items that bakers keep in their kitchens:\nMuffin pan\nCake pan\nGlass pie pan\nSpringform pan\nTart pan\nLoaf pan"
        }
      ]
    },
    {
      "name":"Getting Utensils for Chopping and Dicing",
      "steps":[
        {
          "headline":"Invest in a chef’s knife, a paring knife, and a serrated knife.",
          "description":"These are the 3 essential knives that every cook needs to have in their kitchen. You can often buy these knives in a knife block along with other types, or you could buy them individually. Here is a breakdown of what each knife can do:\nChef’s knife: used for chopping, dicing, mincing, and cutting meats and vegetables. Paring knife: used for peeling, cutting, and trimming smaller pieces of food that you can hold in your hand, like a potato or an apple. Serrated knife: used to cut breads, cakes, fruits, and tomatoes. It’s worth it to spend a little more money on a quality knife. It should last you a lifetime if you take care of it. Avoid the lower end of the spectrum and instead, look for brands that run about $20 to $30 per knife."
        },
        {
          "headline":"Buy a honing rod or a knife sharpener to keep your knives sharp.",
          "description":"There’s no point in having good knives if they become too dull to use over time. You can expect to spend anywhere from $10 to $50 for your knife sharpener, just depending on what style and brand you decide to buy. If you keep your knives in good condition, they could last you an entire lifetime."
        },
        {
          "headline":"Purchase a sharp pair of kitchen shears to cut and trim meat.",
          "description":"Kitchen shears are shaped differently than a regular pair of scissors. They’re made specifically to cut through joints, flesh, and thick sections of meat. You can also use them to mince herbs, cut lettuce, trim bacon, and cut slits in breads and pies. You can buy a pair of kitchen shears for less than $10 online or at your local home goods store."
        },
        {
          "headline":"Use a vegetable peeler to remove the outer layer of veggies and fruits.",
          "description":"You can use a vegetable peeler on carrots, potatoes, apples, pears, broccoli stalks, asparagus stalks, beets, cucumbers, kiwi, and any other food item that has an outer layer. They’re really inexpensive, costing anywhere from $1 to $10, and they don’t take up much drawer space. You could even get a magnetized peeler that will stick to your fridge so that you never have to rummage through a drawer to find it."
        },
        {
          "headline":"Get a set of cutting boards to protect your counters from knife marks.",
          "description":"If you eat meat, get one cutting board that will be exclusively used for meat and a separate one for veggies. There are plastic, wood, bamboo, and glass cutting boards you can choose from:\nOpt for a plastic cutting board for meats and fish. The oils and liquids from the meat could potentially seep into a wooden cutting board. Use wood or bamboo for fruits and vegetables. Glass cutting boards can dull your knives over time. They’re best used as serving platters or cheese trays. A good cutting board can last you a lifetime. For a high-quality wooden board, you can expect to spend anywhere from $25 to $50. Plastic boards are a little less expensive, from $10 to $15."
        }
      ]
    },
    {
      "name":"Picking Tools for Stirring and Flipping",
      "steps":[
        {
          "headline":"Get spatulas for flipping, spreading, lifting and scraping.",
          "description":"Metal spatulas are great for flipping meats and veggies. Rubber or silicone spatulas are used on non-stick surfaces, and they’re great for spreading icing and scraping down the sides of bowls after you’ve made a tasty batter. It’s helpful to have one of each in your kitchen. Williams-Sonoma is a well-known maker of utensils. Their products are reasonably priced and are durable.Tip: You can often buy a set of cooking utensils that will include all of the basics. It’s usually a little less expensive to buy a set rather than purchasing each utensil individually."
        },
        {
          "headline":"Invest in a set of mixing spoons for stirring and mixing.",
          "description":"Two or three wooden spoons will come in handy when you’re cooking, baking, and mixing. You can also use them to serve and plate food. Don’t use wooden spoons in non-stick pans. Opt for a silicone spoon so it doesn’t scratch the coating on the pan. Wooden spoons can be as inexpensive or as expensive as you want. You could get a set of basic wooden spoons for $10, or you could get a more stylized set for up to $50. But, whichever way you go, they’ll stir and mix just the same."
        },
        {
          "headline":"Use a slotted spoon for foods that are cooked in liquid.",
          "description":"A slotted spoon allows you to remove the food without transferring the liquid at the same time. It’s helpful for certain kinds of pasta, like  ravioli or gnocchi, vegetables cooked in broth, and meats simmered in a sauce of some kind. Slotted spoons come in both metal and silicone forms. Foods are less likely to stick to silicone."
        },
        {
          "headline":"Purchase tongs to serve hot items without burning your hands.",
          "description":"You can get metal or silicone tongs. They come in handy when you need to pick up meat or vegetables or some kind of baked good that is too hot to touch. You can buy tongs for anywhere from $2 to $10. Tongs also come in handy if you need to turn meat or vegetables while they’re cooking. They give you a little more control than a spatula would."
        },
        {
          "headline":"Have a ladle on hand for serving soups, stews, and chowders.",
          "description":"A ladle is great for serving liquid-based dishes. It holds the most amount of liquid out of all the basic cooking utensils, and it is easy to hold even so that the liquid doesn’t spill over the sides. You can also use the ladle to stir soups, stews, and chowders so that you don’t have to get an additional utensil dirty."
        },
        {
          "headline":"Keep a whisk in the kitchen for blending together smooth ingredients.",
          "description":"A whisk comes in handy for much more than making scrambled eggs. You can also use it to sift flour, make a roux, whisk egg whites, make custard, stir up gravy, and many other tasks. Metal whisks are really durable, and silicone whisks are less likely to get ingredients stuck to them. If you know you’ll be needing to whisk egg whites for baking, use a metal whisk. Even on the more expensive side, you shouldn’t expect to spend more than $10 for a whisk."
        }
      ]
    },
    {
      "name":"Selecting Useful Gadgets",
      "steps":[
        {
          "headline":"Invest in a set of measuring cups and spoons.",
          "description":"Stainless steel is the best option as they will last longer and they won’t absorb any oils or scents. They also usually have the measurements enameled onto the handle so they won’t wear off as time passes. Stainless steel measuring cups will run you about $30 for an entire set. Plastic ones will cost about $10. You can buy them online or from your local home goods store.Did You Know: Liquids and solids are measured differently and they even have different measuring cups. Get a separate liquid-measuring cup for things like water, milk, wine, and oil."
        },
        {
          "headline":"Stock up on a few oven mitts so you can safely move hot dishes.",
          "description":"There are tons of different types of mitts to choose from. You can get hot pads, which are simple squares that can also be used underneath hot dishes so they don’t scald the counter or table. You could also get silicone mitts so that there is a lesser chance of a dish slipping out of your hands. Browse online or visit your local home goods store to check out the options. Have at least two oven mitts so that you can use one on each hand for heavy dishes. Oven mitts tend to get worn-out overtime, so don’t worry about investing a lot of money into a pair."
        },
        {
          "headline":"Have a thermometer to check the internal temperatures of meats.",
          "description":"This is different from a regular thermometer that you use to take a person’s temperature. It comes with a long prong that can be inserted inside a large piece of meat so you can make sure it has been cooked to a safe temperature. Meat thermometers can also be used to check the internal temperature of casseroles, egg dishes, and baked goods. Expect to spend about $10 to $15 for a meat thermometer. They can be bought online, at the grocery store, or at your local home goods store. Look for an instant-read monitor when making your purchase."
        },
        {
          "headline":"Get a manual or electric can opener for aluminum cans of food.",
          "description":"Even though lots of cans now come with pull-tabs, chances are you’ll definitely need to use a can opener at some time in your life. You can buy a can opener from $10 to $30, depending on what kind you decide to buy. Manual can openers take up a lot less space and can be used even when there is no electricity. They cost less than electric can openers. An electric can opener is a little bit faster and removes the lid for you so it doesn’t fall down into the can."
        },
        {
          "headline":"Keep a colander or strainer in the kitchen for pasta and vegetables.",
          "description":"A colander is really helpful when you have a pot full of liquid that needs to be drained away. You can also use it to easily rinse off fruits and vegetables or to drain canned foods. Stainless steel colanders will last a long time. Plastic ones are inexpensive, but they’re more likely to get misshapen if they accidentally come into contact with a hot burner or pan. A colander is an item you can buy once and use for the rest of your life. Sur La Table and Williams-Sonoma both make stainless steel options for about $30 to $40. It’s worth it to make the investment for a piece you’ll use for years to come."
        },
        {
          "headline":"Add more cooking utensils to your kitchen as you learn to cook.",
          "description":"Many cooking and baking tasks can be accomplished with the tools you already have, but there are gadgets made for every kind of situation to help make them a little bit easier. Consider these other cooking utensils:\nPotato masher: used to crush cooked foods, like potatoes, beans, and apples. Grater: used to grate cheese, vegetables, garlic, ginger, and citrus peels. Garlic press: used to quickly mince garlic. Immersion blender: used to puree soups. Citrus press or juicer: used to extract juice from lemons, limes, and oranges. Mandolin: used to slice vegetables and potatoes into thin pieces."
        }
      ]
    }
  ],
  "text":" Choosing Basics for Cooking and Baking Invest in a set of mixing bowls for your baking and cooking needs. Mixing bowls are a great staple to have in your kitchen, and you can use them for so many different things! From mixing up a batter for cookies or tossing veggies in olive oil and seasoning, you’ll find yourself reaching for these bowls regularly. Consider the different types of bowls for your own needs:\nPlastic: these are inexpensive and won’t break easily, but they can sometimes absorb odors and oils from the dishes you prepare. Stainless steel: you can buy a set of nesting stainless steel bowls for about $30, and they’ll last for a very long time. Glass: can double as serving bowls and are often able to be safely used in the microwave and oven. Ceramic: these are more expensive, but they usually look a lot nicer than the other kinds of bowls. They can chip easily, though, and they’re very heavy. Copper: these are fashionable and effective but you have clean them after regular use. If you can, get a set of bowls that comes with fitted lids. This makes it a lot easier to store prepped foods and leftovers. Look for mixing bowls online or at your local home goods store. You can also often find sets at thrift stores—just make sure to clean them thoroughly before you use them. Get a set of essential pots and pans so you can cook almost anything. You could either buy a prepared set of pots and pans from a specific brand, or you could choose each item piecemeal and create your own unique set. It’s worth it to invest in nicer pieces so that they’ll last you a lifetime rather than getting the most inexpensive options. Whichever way you choose to go, make sure to get the following for your basic cooking needs:\nStainless steel skillet: to sear meats and cook sauces; use with acidic ingredients, like tomatoes and vinegar (the stainless steel won’t react with the acidity). Stainless steel stockpot: to make soups, stews, and chowders. Nonstick skillet: to cook eggs, fish, and other dishes that might easily stick to the pan (like a grilled cheese sandwich or a quesadilla). Cast-iron skillet: to cook meats and caramelize vegetables.Tip: Invest in a splatter guard to help keep your stovetop clean. It’ll catch pops of grease and sauce and keep them off of your stove, definitely minimizing how much you’ll have to clean up later. Buy a set of rimmed baking sheets for both savory and sweet dishes. Look for sheets made of aluminum for an affordable option that is also going to be pretty easy to clean. You can bake cookies, roast vegetables, and make many other dishes on baking sheets. Line your baking sheets with parchment paper to make cleanup that much simpler. After your dish is out of the oven, you can just throw away the parchment paper and wipe down the baking sheet without having to scrub away baked-on food. You can find baking sheets online or at your local home goods store. If you aren’t a professional baker, there’s no need to spend more than $10 to $20 for a set of sheets. Use glass baking pans to make casseroles, roast meats, and veggies. Glass distributes heat a lot more evenly than other types of vessels, and it’ll keep your dish warm for a really long time after it has come out of the oven. Lasagnas, casseroles, roasts, enchiladas, and lots of other delicious dishes can be easily cooked in a baking pan. Never use a glass pan to broil meats, as they are more likely to shatter. Pyrex is a well-trusted brand, as is OXO. You can often get sets of glass pans from these brands for $30 to $50, and they usually come with fitted lids, too. Purchase a stand mixer to more easily prepare doughs and batters. Cookies, cakes, breads, muffins, and even pizza doughs can be made at home, and a stand mixer will make the mixing process that much simpler for you. They’re larger pieces of equipment, so make sure you have a space for one on your counter. If you aren’t ready to commit to the price of a stand mixer, try a hand mixer instead. It’s smaller, less expensive, and easier to store. KitchenAid is the most popular standing mixer brand. Their mixers are more expensive, running anywhere from $200 to $300, but they come with great warranties, are easy to repair, and there are many attachments you can buy for them. Look for specialty items if you enjoy making baked goods. After you’ve gotten the basic baking items, you may find that you need more specialized equipment. Here are some common items that bakers keep in their kitchens:\nMuffin pan\nCake pan\nGlass pie pan\nSpringform pan\nTart pan\nLoaf pan Getting Utensils for Chopping and Dicing Invest in a chef’s knife, a paring knife, and a serrated knife. These are the 3 essential knives that every cook needs to have in their kitchen. You can often buy these knives in a knife block along with other types, or you could buy them individually. Here is a breakdown of what each knife can do:\nChef’s knife: used for chopping, dicing, mincing, and cutting meats and vegetables. Paring knife: used for peeling, cutting, and trimming smaller pieces of food that you can hold in your hand, like a potato or an apple. Serrated knife: used to cut breads, cakes, fruits, and tomatoes. It’s worth it to spend a little more money on a quality knife. It should last you a lifetime if you take care of it. Avoid the lower end of the spectrum and instead, look for brands that run about $20 to $30 per knife. Buy a honing rod or a knife sharpener to keep your knives sharp. There’s no point in having good knives if they become too dull to use over time. You can expect to spend anywhere from $10 to $50 for your knife sharpener, just depending on what style and brand you decide to buy. If you keep your knives in good condition, they could last you an entire lifetime. Purchase a sharp pair of kitchen shears to cut and trim meat. Kitchen shears are shaped differently than a regular pair of scissors. They’re made specifically to cut through joints, flesh, and thick sections of meat. You can also use them to mince herbs, cut lettuce, trim bacon, and cut slits in breads and pies. You can buy a pair of kitchen shears for less than $10 online or at your local home goods store. Use a vegetable peeler to remove the outer layer of veggies and fruits. You can use a vegetable peeler on carrots, potatoes, apples, pears, broccoli stalks, asparagus stalks, beets, cucumbers, kiwi, and any other food item that has an outer layer. They’re really inexpensive, costing anywhere from $1 to $10, and they don’t take up much drawer space. You could even get a magnetized peeler that will stick to your fridge so that you never have to rummage through a drawer to find it. Get a set of cutting boards to protect your counters from knife marks. If you eat meat, get one cutting board that will be exclusively used for meat and a separate one for veggies. There are plastic, wood, bamboo, and glass cutting boards you can choose from:\nOpt for a plastic cutting board for meats and fish. The oils and liquids from the meat could potentially seep into a wooden cutting board. Use wood or bamboo for fruits and vegetables. Glass cutting boards can dull your knives over time. They’re best used as serving platters or cheese trays. A good cutting board can last you a lifetime. For a high-quality wooden board, you can expect to spend anywhere from $25 to $50. Plastic boards are a little less expensive, from $10 to $15. Picking Tools for Stirring and Flipping Get spatulas for flipping, spreading, lifting and scraping. Metal spatulas are great for flipping meats and veggies. Rubber or silicone spatulas are used on non-stick surfaces, and they’re great for spreading icing and scraping down the sides of bowls after you’ve made a tasty batter. It’s helpful to have one of each in your kitchen. Williams-Sonoma is a well-known maker of utensils. Their products are reasonably priced and are durable.Tip: You can often buy a set of cooking utensils that will include all of the basics. It’s usually a little less expensive to buy a set rather than purchasing each utensil individually. Invest in a set of mixing spoons for stirring and mixing. Two or three wooden spoons will come in handy when you’re cooking, baking, and mixing. You can also use them to serve and plate food. Don’t use wooden spoons in non-stick pans. Opt for a silicone spoon so it doesn’t scratch the coating on the pan. Wooden spoons can be as inexpensive or as expensive as you want. You could get a set of basic wooden spoons for $10, or you could get a more stylized set for up to $50. But, whichever way you go, they’ll stir and mix just the same. Use a slotted spoon for foods that are cooked in liquid. A slotted spoon allows you to remove the food without transferring the liquid at the same time. It’s helpful for certain kinds of pasta, like  ravioli or gnocchi, vegetables cooked in broth, and meats simmered in a sauce of some kind. Slotted spoons come in both metal and silicone forms. Foods are less likely to stick to silicone. Purchase tongs to serve hot items without burning your hands. You can get metal or silicone tongs. They come in handy when you need to pick up meat or vegetables or some kind of baked good that is too hot to touch. You can buy tongs for anywhere from $2 to $10. Tongs also come in handy if you need to turn meat or vegetables while they’re cooking. They give you a little more control than a spatula would. Have a ladle on hand for serving soups, stews, and chowders. A ladle is great for serving liquid-based dishes. It holds the most amount of liquid out of all the basic cooking utensils, and it is easy to hold even so that the liquid doesn’t spill over the sides. You can also use the ladle to stir soups, stews, and chowders so that you don’t have to get an additional utensil dirty. Keep a whisk in the kitchen for blending together smooth ingredients. A whisk comes in handy for much more than making scrambled eggs. You can also use it to sift flour, make a roux, whisk egg whites, make custard, stir up gravy, and many other tasks. Metal whisks are really durable, and silicone whisks are less likely to get ingredients stuck to them. If you know you’ll be needing to whisk egg whites for baking, use a metal whisk. Even on the more expensive side, you shouldn’t expect to spend more than $10 for a whisk. Selecting Useful Gadgets Invest in a set of measuring cups and spoons. Stainless steel is the best option as they will last longer and they won’t absorb any oils or scents. They also usually have the measurements enameled onto the handle so they won’t wear off as time passes. Stainless steel measuring cups will run you about $30 for an entire set. Plastic ones will cost about $10. You can buy them online or from your local home goods store.Did You Know: Liquids and solids are measured differently and they even have different measuring cups. Get a separate liquid-measuring cup for things like water, milk, wine, and oil. Stock up on a few oven mitts so you can safely move hot dishes. There are tons of different types of mitts to choose from. You can get hot pads, which are simple squares that can also be used underneath hot dishes so they don’t scald the counter or table. You could also get silicone mitts so that there is a lesser chance of a dish slipping out of your hands. Browse online or visit your local home goods store to check out the options. Have at least two oven mitts so that you can use one on each hand for heavy dishes. Oven mitts tend to get worn-out overtime, so don’t worry about investing a lot of money into a pair. Have a thermometer to check the internal temperatures of meats. This is different from a regular thermometer that you use to take a person’s temperature. It comes with a long prong that can be inserted inside a large piece of meat so you can make sure it has been cooked to a safe temperature. Meat thermometers can also be used to check the internal temperature of casseroles, egg dishes, and baked goods. Expect to spend about $10 to $15 for a meat thermometer. They can be bought online, at the grocery store, or at your local home goods store. Look for an instant-read monitor when making your purchase. Get a manual or electric can opener for aluminum cans of food. Even though lots of cans now come with pull-tabs, chances are you’ll definitely need to use a can opener at some time in your life. You can buy a can opener from $10 to $30, depending on what kind you decide to buy. Manual can openers take up a lot less space and can be used even when there is no electricity. They cost less than electric can openers. An electric can opener is a little bit faster and removes the lid for you so it doesn’t fall down into the can. Keep a colander or strainer in the kitchen for pasta and vegetables. A colander is really helpful when you have a pot full of liquid that needs to be drained away. You can also use it to easily rinse off fruits and vegetables or to drain canned foods. Stainless steel colanders will last a long time. Plastic ones are inexpensive, but they’re more likely to get misshapen if they accidentally come into contact with a hot burner or pan. A colander is an item you can buy once and use for the rest of your life. Sur La Table and Williams-Sonoma both make stainless steel options for about $30 to $40. It’s worth it to make the investment for a piece you’ll use for years to come. Add more cooking utensils to your kitchen as you learn to cook. Many cooking and baking tasks can be accomplished with the tools you already have, but there are gadgets made for every kind of situation to help make them a little bit easier. Consider these other cooking utensils:\nPotato masher: used to crush cooked foods, like potatoes, beans, and apples. Grater: used to grate cheese, vegetables, garlic, ginger, and citrus peels. Garlic press: used to quickly mince garlic. Immersion blender: used to puree soups. Citrus press or juicer: used to extract juice from lemons, limes, and oranges. Mandolin: used to slice vegetables and potatoes into thin pieces.",
  "tyn_model":[
    "bowls",
    "spoons",
    "baking sheets",
    "knives",
    "whisk",
    "can opener",
    "mixing bowls",
    "stand mixer",
    "kitchen shears",
    "spatulas",
    "cooking utensils",
    "tongs",
    "ladle",
    "oven mitts",
    "colander",
    "pans",
    "stainless steel",
    "parchment paper",
    "serrated knife",
    "knife",
    "knife sharpener",
    "vegetable peeler",
    "potatoes",
    "slotted spoon",
    "thermometer",
    "can openers",
    "garlic",
    "olive oil",
    "stainless steel bowls",
    "glass",
    "microwave",
    "ceramic",
    "copper",
    "home goods store",
    "—just",
    "pots and pans",
    "pots",
    "stainless steel skillet",
    "vinegar",
    "stainless steel stockpot",
    "nonstick skillet",
    "grilled cheese sandwich",
    "cast-iron skillet",
    "stovetop",
    "stove",
    "baking sheet",
    "oven",
    "baking pan",
    "glass pans",
    "hand mixer",
    "kitchenaid is",
    "mixer",
    "mixers",
    "cake pan",
    "glass pie pan",
    "springform pan",
    "loaf pan",
    "chef’s knife",
    "paring knife",
    "knife block",
    "honing rod",
    "scissors",
    "carrots",
    "apples",
    "cucumbers",
    "peeler",
    "cutting boards",
    "utensils",
    "mixing spoons",
    "spoon",
    "slotted spoons",
    "spatula",
    "dishes",
    "meats",
    "meat thermometers",
    "meat thermometer",
    "strainer",
    "stainless steel colanders",
    "potato masher",
    "grater",
    "vegetables",
    "ginger",
    "citrus peels",
    "garlic press",
    "immersion blender",
    "citrus press",
    "juicer",
    "lemons",
    "limes",
    "oranges",
    "mandolin"
  ],
  "tyn_section":[

  ]
}