{
  "title":"How to Make Cheese Sauce in the Microwave",
  "url":"https://www.wikihow.com/Make-Cheese-Sauce-in-the-Microwave",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Cheese"
  ],
  "steps":[
    {
      "headline":"Select a small to medium sized microwave-safe dish that is wide and shallow.",
      "description":"A glass pie plate or glass casserole dish works well. It will need to have walls, so a dinner plate isn't the best choice."
    },
    {
      "headline":"Grate plenty of cheese into the dish.",
      "description":"You don't have to measure. Just make a loosely packed layer an inch or so deep, depending on how much sauce you want to make and how large a dish you have."
    },
    {
      "headline":"Pour milk over the cheese until it just covers the cheese.",
      "description":""
    },
    {
      "headline":"Before adding the corn starch, pour a tablespoon or two of milk into the cornstarch and make a slurry; make sure all of the cornstarch is dissolved in the milk before you add it to the pie plate.",
      "description":""
    },
    {
      "headline":"Stir everything together with a fork, making sure to mix the cornstarch in and get it completely dissolved.",
      "description":""
    },
    {
      "headline":"Microwave the whole thing in the dish for two minutes.",
      "description":"Cover the dish if you want to save yourself some cleanup."
    },
    {
      "headline":"Stir with a fork again.",
      "description":"Break up and loosen any clumps of cheese that stick together, or to the bottom."
    },
    {
      "headline":"Repeat the microwaving and stirring until the sauce blends and thickens.",
      "description":"Microwave the sauce for about two minutes at a time, stirring in between. It will take about 2-4 two-minute cycles, depending on your microwave and quantities. If the sauce seems too thick, add more milk and microwave for 20-45 seconds, then stir thoroughly. If the sauce seems too thin, add more cheese and microwave for about 30 seconds-1 minute or until cheese is melted, then stir thoroughly."
    },
    {
      "headline":"Add salt to taste.",
      "description":"A little salt will help a lot to bring out the cheese flavor."
    },
    {
      "headline":"Serve hot.",
      "description":"Pour it over pasta, veggies, or whatever else needs to be a bit cheesier."
    }
  ],
  "text":" Select a small to medium sized microwave-safe dish that is wide and shallow. A glass pie plate or glass casserole dish works well. It will need to have walls, so a dinner plate isn't the best choice. Grate plenty of cheese into the dish. You don't have to measure. Just make a loosely packed layer an inch or so deep, depending on how much sauce you want to make and how large a dish you have. Pour milk over the cheese until it just covers the cheese.  Before adding the corn starch, pour a tablespoon or two of milk into the cornstarch and make a slurry; make sure all of the cornstarch is dissolved in the milk before you add it to the pie plate.  Stir everything together with a fork, making sure to mix the cornstarch in and get it completely dissolved.  Microwave the whole thing in the dish for two minutes. Cover the dish if you want to save yourself some cleanup. Stir with a fork again. Break up and loosen any clumps of cheese that stick together, or to the bottom. Repeat the microwaving and stirring until the sauce blends and thickens. Microwave the sauce for about two minutes at a time, stirring in between. It will take about 2-4 two-minute cycles, depending on your microwave and quantities. If the sauce seems too thick, add more milk and microwave for 20-45 seconds, then stir thoroughly. If the sauce seems too thin, add more cheese and microwave for about 30 seconds-1 minute or until cheese is melted, then stir thoroughly. Add salt to taste. A little salt will help a lot to bring out the cheese flavor. Serve hot. Pour it over pasta, veggies, or whatever else needs to be a bit cheesier.",
  "tyn_model":[
    "milk",
    "microwave",
    "cheese",
    "fork",
    "salt",
    "microwave-safe dish",
    "glass casserole dish",
    "dinner plate",
    "corn starch",
    "pie plate",
    "dish"
  ],
  "tyn_section":[

  ]
}