{
  "title":"How to Draw a Tiger",
  "url":"https://www.wikihow.com/Draw-a-Tiger",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "methods":[
    {
      "name":"A Full Body Tiger",
      "steps":[
        {
          "headline":"Draw a few basic shapes to start.",
          "description":"Sketch the head using a large circle and within that draw another to serve as the snout. Add circular facial guidelines to help you with features in subsequent steps."
        },
        {
          "headline":"Draw two round-cornered triangles for the ears and another smaller set of triangles inside that.",
          "description":"Draw a diamond shape for the nose and an inverted \"Y\" shape for the mouth. Add in two small circles for the eyes."
        },
        {
          "headline":"Draw three ovals as guides for the body.",
          "description":"Draw a small one for the neck and two large ones for the body."
        },
        {
          "headline":"Add in three large ovals for each leg.",
          "description":"Put a small circle for each foot, with small ovals for the paws."
        },
        {
          "headline":"Add in two lines for the tail.",
          "description":"They should be thicker at the base, tapering off to a slightly rounded end."
        },
        {
          "headline":"Sketch in the details.",
          "description":"Add fur, whiskers, and claws. Don't forget the tiger's trademark stripes!"
        },
        {
          "headline":"Outline the image and color it in!",
          "description":"Make sure all excess guidelines are erased, and use mostly orange/brown with darker stripes for the body."
        }
      ]
    },
    {
      "name":"A Tiger (Head View)",
      "steps":[
        {
          "headline":"Draw a circle for the main section of the head.",
          "description":""
        },
        {
          "headline":"Draw an inverted triangle with two lines at both sides for the nose.",
          "description":""
        },
        {
          "headline":"Draw two circles for the upper mouth.",
          "description":""
        },
        {
          "headline":"Draw a series of ovals for the lower mouth and ears.",
          "description":""
        },
        {
          "headline":"Draw curves on both sides of the head of your tiger.",
          "description":""
        },
        {
          "headline":"Draw the eyes with circles attached to curved triangles.",
          "description":""
        },
        {
          "headline":"Based on the outline, draw the tiger head(make the jagged lines when drawing the tiger to make it look like fur).",
          "description":""
        },
        {
          "headline":"Add stripes to the tiger.",
          "description":""
        },
        {
          "headline":"Erase the unnecessary outlines.",
          "description":""
        },
        {
          "headline":"Color your tiger!",
          "description":""
        }
      ]
    }
  ],
  "text":" A Full Body Tiger Draw a few basic shapes to start. Sketch the head using a large circle and within that draw another to serve as the snout. Add circular facial guidelines to help you with features in subsequent steps. Draw two round-cornered triangles for the ears and another smaller set of triangles inside that. Draw a diamond shape for the nose and an inverted \"Y\" shape for the mouth. Add in two small circles for the eyes. Draw three ovals as guides for the body. Draw a small one for the neck and two large ones for the body. Add in three large ovals for each leg. Put a small circle for each foot, with small ovals for the paws. Add in two lines for the tail. They should be thicker at the base, tapering off to a slightly rounded end. Sketch in the details. Add fur, whiskers, and claws. Don't forget the tiger's trademark stripes! Outline the image and color it in! Make sure all excess guidelines are erased, and use mostly orange/brown with darker stripes for the body. A Tiger (Head View) Draw a circle for the main section of the head.  Draw an inverted triangle with two lines at both sides for the nose.  Draw two circles for the upper mouth.  Draw a series of ovals for the lower mouth and ears.  Draw curves on both sides of the head of your tiger.  Draw the eyes with circles attached to curved triangles.  Based on the outline, draw the tiger head(make the jagged lines when drawing the tiger to make it look like fur).  Add stripes to the tiger.  Erase the unnecessary outlines.  Color your tiger! ",
  "tyn_model":[
    "tiger",
    "fur",
    "claws"
  ],
  "tyn_section":[

  ]
}