{
  "title":"How to Pick Tomatoes",
  "url":"https://www.wikihow.com/Pick-Tomatoes",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Harvest and Storage"
  ],
  "parts":[
    {
      "name":"Checking for Ripeness",
      "steps":[
        {
          "headline":"Research your variety to find out what color your tomatoes should be.",
          "description":"Although most tomatoes turn bright red when they’re ripe, some varieties can be orange, green, yellow, pink, or purple. Be sure you know what variety your tomatoes are so you’ll know what color they’ll be when they’re ripe. If you start your tomatoes from seeds, you could either check your seed packet or ask the person who giving you the seeds to find out what color your ripe tomatoes will be. If you buy seedlings, make sure you know the variety of tomato you are buying so you’ll know what color to expect."
        },
        {
          "headline":"Check your tomatoes for ripeness every 1-2 days.",
          "description":"Tomatoes can ripen quickly, so make sure you’re keeping a close eye on them. Every day or two, visit your tomato plants to look for a change in color. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaggie Moran\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHorticulturist\t\t\t\t\t\t\t\tMaggie Moran is a Professional Gardener in Pennsylvania. Maggie Moran\t\t\tHorticulturist\t\t\t\tExpert Trick: Pick some tomatoes while they're still green. Unless you plan on eating them all very soon, picking some tomatoes before they're ready lets them continue ripening and guarantees fresh tomatoes when you do need them!"
        },
        {
          "headline":"Examine your tomatoes to make sure the skin is smooth and shiny.",
          "description":"Ripe tomatoes have smooth, slightly shiny skin. Your tomatoes should be free of any dark spots or bruising, which can indicate rot."
        },
        {
          "headline":"Gently squeeze your tomatoes to test for firmness.",
          "description":"A ripe tomato will be slightly firm. If it’s too hard, it probably needs more time to ripen. If it’s too soft, it’s probably over-ripe and should be picked and thrown away."
        },
        {
          "headline":"Test the weight of the tomato in your hand.",
          "description":"As a tomato ripens, it becomes heavier. Try cupping an unripe tomato in one hand and a tomato you think may be ripe in the other. The ripe tomato should be noticeably more dense."
        },
        {
          "headline":"Check the smell.",
          "description":"A ripe tomato should have an earthy, sweet smell at the stem. If the tomato has a slightly tart aroma (or no smell at all) it’s probably not ripe yet."
        }
      ]
    },
    {
      "name":"Harvesting Ripe Tomatoes",
      "steps":[
        {
          "headline":"Carefully grasp your ripe tomato and gently twist it away from the stem.",
          "description":"When it’s time to harvest, gently take the tomato in one hand. Don’t squeeze too hard, or you’ll damage the fruit. Most ripe tomatoes will easily free themselves from their vine with a gentle twist. Try to snap the stalk just above the flower-shaped leaf on top, known as the calyx."
        },
        {
          "headline":"Use garden scissors to snip the vine if it doesn’t snap off easily.",
          "description":"Some varieties of tomatoes may have a thicker stalk, and you might not want to grasp delicate varieties like heirloom tomatoes hard enough to twist the stem. If this is the case, use garden scissors to cut the stalk, leaving just a little of the stem attached."
        },
        {
          "headline":"Harvest your tomatoes before they are ripe if they are cracking.",
          "description":"If you notice you are having a problem with your tomatoes cracking at the stem, you can try harvesting them just as they begin to change color and allow them to ripen indoors. Tomatoes that ripen off the vine tend not to have as much flavor as those which are vine-ripened."
        },
        {
          "headline":"Pull the plant up by its roots to ripen tomatoes before a frost.",
          "description":"Tomatoes should be harvested before the first frost, but there are usually still some unripened fruits left on the plant. If a cold snap is coming and you want to save the last of your tomatoes, pull the entire plant up by its roots and hang it upside down in a basement or a garage. You can then pick the fruits as they ripen."
        }
      ]
    },
    {
      "name":"Storing Your Tomatoes",
      "steps":[
        {
          "headline":"Store your tomatoes in a cabinet or on a shaded countertop.",
          "description":"If you set your tomatoes on a sunny windowsill, they may ripen too quickly and spoil before you can eat them. Keep them out of direct sunlight by placing them in a cupboard or in a shady spot on the counter instead. Try putting your tomatoes on a pretty plate to enjoy their bright color until you use them. Fresh tomatoes will last for about a week on the counter."
        },
        {
          "headline":"Place tomatoes in a paper bag with a banana to ripen them faster.",
          "description":"If you picked your tomatoes before they were ripe, you can help them ripen faster by placing them in a brown paper bag. Add a banana or a sliced apple to the bag. These fruits produce ethylene gas, which is a chemical that tomatoes produce during the ripening process."
        },
        {
          "headline":"Don’t refrigerate ripe tomatoes unless you have to.",
          "description":"Refrigeration will prolong the life of your tomatoes, but it also alters their fresh flavor and texture. Try to use as many of your tomatoes as you can without refrigerating them. If you do refrigerate your tomatoes, put them in the crisper to preserve their taste longer. Tomatoes should last for about 2 weeks in the refrigerator."
        },
        {
          "headline":"Freeze tomatoes whole to use later.",
          "description":"If you want to preserve your tomatoes for use later in sauces or soups, try freezing them whole. Just take the core out, then place the tomatoes in a freezer-safe bag or container. There’s no need to remove the skins, as these will slip off easily when you defrost the tomatoes. Frozen tomatoes will keep for up to 6 months in the freezer. To defrost the tomatoes, allow them to sit at room temperature for about 30 minutes."
        }
      ]
    }
  ],
  "text":" Checking for Ripeness Research your variety to find out what color your tomatoes should be. Although most tomatoes turn bright red when they’re ripe, some varieties can be orange, green, yellow, pink, or purple. Be sure you know what variety your tomatoes are so you’ll know what color they’ll be when they’re ripe. If you start your tomatoes from seeds, you could either check your seed packet or ask the person who giving you the seeds to find out what color your ripe tomatoes will be. If you buy seedlings, make sure you know the variety of tomato you are buying so you’ll know what color to expect. Check your tomatoes for ripeness every 1-2 days. Tomatoes can ripen quickly, so make sure you’re keeping a close eye on them. Every day or two, visit your tomato plants to look for a change in color. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMaggie Moran\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHorticulturist\t\t\t\t\t\t\t\tMaggie Moran is a Professional Gardener in Pennsylvania. Maggie Moran\t\t\tHorticulturist\t\t\t\tExpert Trick: Pick some tomatoes while they're still green. Unless you plan on eating them all very soon, picking some tomatoes before they're ready lets them continue ripening and guarantees fresh tomatoes when you do need them! Examine your tomatoes to make sure the skin is smooth and shiny. Ripe tomatoes have smooth, slightly shiny skin. Your tomatoes should be free of any dark spots or bruising, which can indicate rot. Gently squeeze your tomatoes to test for firmness. A ripe tomato will be slightly firm. If it’s too hard, it probably needs more time to ripen. If it’s too soft, it’s probably over-ripe and should be picked and thrown away. Test the weight of the tomato in your hand. As a tomato ripens, it becomes heavier. Try cupping an unripe tomato in one hand and a tomato you think may be ripe in the other. The ripe tomato should be noticeably more dense. Check the smell. A ripe tomato should have an earthy, sweet smell at the stem. If the tomato has a slightly tart aroma (or no smell at all) it’s probably not ripe yet. Harvesting Ripe Tomatoes Carefully grasp your ripe tomato and gently twist it away from the stem. When it’s time to harvest, gently take the tomato in one hand. Don’t squeeze too hard, or you’ll damage the fruit. Most ripe tomatoes will easily free themselves from their vine with a gentle twist. Try to snap the stalk just above the flower-shaped leaf on top, known as the calyx. Use garden scissors to snip the vine if it doesn’t snap off easily. Some varieties of tomatoes may have a thicker stalk, and you might not want to grasp delicate varieties like heirloom tomatoes hard enough to twist the stem. If this is the case, use garden scissors to cut the stalk, leaving just a little of the stem attached. Harvest your tomatoes before they are ripe if they are cracking. If you notice you are having a problem with your tomatoes cracking at the stem, you can try harvesting them just as they begin to change color and allow them to ripen indoors. Tomatoes that ripen off the vine tend not to have as much flavor as those which are vine-ripened. Pull the plant up by its roots to ripen tomatoes before a frost. Tomatoes should be harvested before the first frost, but there are usually still some unripened fruits left on the plant. If a cold snap is coming and you want to save the last of your tomatoes, pull the entire plant up by its roots and hang it upside down in a basement or a garage. You can then pick the fruits as they ripen. Storing Your Tomatoes Store your tomatoes in a cabinet or on a shaded countertop. If you set your tomatoes on a sunny windowsill, they may ripen too quickly and spoil before you can eat them. Keep them out of direct sunlight by placing them in a cupboard or in a shady spot on the counter instead. Try putting your tomatoes on a pretty plate to enjoy their bright color until you use them. Fresh tomatoes will last for about a week on the counter. Place tomatoes in a paper bag with a banana to ripen them faster. If you picked your tomatoes before they were ripe, you can help them ripen faster by placing them in a brown paper bag. Add a banana or a sliced apple to the bag. These fruits produce ethylene gas, which is a chemical that tomatoes produce during the ripening process. Don’t refrigerate ripe tomatoes unless you have to. Refrigeration will prolong the life of your tomatoes, but it also alters their fresh flavor and texture. Try to use as many of your tomatoes as you can without refrigerating them. If you do refrigerate your tomatoes, put them in the crisper to preserve their taste longer. Tomatoes should last for about 2 weeks in the refrigerator. Freeze tomatoes whole to use later. If you want to preserve your tomatoes for use later in sauces or soups, try freezing them whole. Just take the core out, then place the tomatoes in a freezer-safe bag or container. There’s no need to remove the skins, as these will slip off easily when you defrost the tomatoes. Frozen tomatoes will keep for up to 6 months in the freezer. To defrost the tomatoes, allow them to sit at room temperature for about 30 minutes.",
  "tyn_model":[
    "tomatoes",
    "tomato",
    "garden scissors",
    "banana",
    "gardener",
    "plate",
    "brown paper bag",
    "ethylene gas",
    "crisper",
    "refrigerator",
    "freezer-safe bag",
    "freezer"
  ],
  "tyn_section":[

  ]
}