{
  "title":"How to Make a New England Boiled Dinner",
  "url":"https://www.wikihow.com/Make-a-New-England-Boiled-Dinner",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "steps":[
    {
      "headline":"Place the corned beef brisket in a large pot along with 6 peppercorns.",
      "description":""
    },
    {
      "headline":"Cover the corned beef and peppercorns with cold water, place the lid on the pot, place it over medium-high heat and allow the water to come to a boil.",
      "description":""
    },
    {
      "headline":"Lower the heat once the water comes to a boil and simmer the beef for 4 to 5 hours, or until tender.",
      "description":""
    },
    {
      "headline":"Skim the fat off the top of the water with a spoon occasionally.",
      "description":""
    },
    {
      "headline":"Rinse all of the produce in cold water.",
      "description":"Cube the parsnips and carrots, peel the turnips and onions, quarter the potatoes, cut the cabbage into wedges and chop the parsley while the beef cooks."
    },
    {
      "headline":"Remove the beef from the pot once it is cooked, and place it in a warm area to rest.",
      "description":""
    },
    {
      "headline":"Place 1/2 lb.",
      "description":"(227 g) of salt pork in the simmering pot along with the prepared parsnips, turnips, onions, carrots and potatoes and allow them to cook for 30 minutes."
    },
    {
      "headline":"Put the cabbage wedges into the pot for the last 15 minutes of cooking, so that all of the vegetables will be ready at the same time.",
      "description":""
    },
    {
      "headline":"Make herb butter by mixing the chopped parsley into melted butter, while you wait for the vegetables to cook.",
      "description":""
    },
    {
      "headline":"Slice the corned beef against the grain with a sharp knife.",
      "description":""
    },
    {
      "headline":"Arrange the corned beef and vegetables on a platter, and discard the salt pork.",
      "description":""
    },
    {
      "headline":"Spoon the herb butter over the vegetables and serve with mustard and pickles.",
      "description":""
    }
  ],
  "text":" Place the corned beef brisket in a large pot along with 6 peppercorns.  Cover the corned beef and peppercorns with cold water, place the lid on the pot, place it over medium-high heat and allow the water to come to a boil.  Lower the heat once the water comes to a boil and simmer the beef for 4 to 5 hours, or until tender.  Skim the fat off the top of the water with a spoon occasionally.  Rinse all of the produce in cold water. Cube the parsnips and carrots, peel the turnips and onions, quarter the potatoes, cut the cabbage into wedges and chop the parsley while the beef cooks. Remove the beef from the pot once it is cooked, and place it in a warm area to rest.  Place 1/2 lb. (227 g) of salt pork in the simmering pot along with the prepared parsnips, turnips, onions, carrots and potatoes and allow them to cook for 30 minutes. Put the cabbage wedges into the pot for the last 15 minutes of cooking, so that all of the vegetables will be ready at the same time.  Make herb butter by mixing the chopped parsley into melted butter, while you wait for the vegetables to cook.  Slice the corned beef against the grain with a sharp knife.  Arrange the corned beef and vegetables on a platter, and discard the salt pork.  Spoon the herb butter over the vegetables and serve with mustard and pickles. ",
  "tyn_model":[
    "water",
    "corned beef",
    "pot",
    "parsnips",
    "carrots",
    "turnips",
    "onions",
    "potatoes",
    "cabbage",
    "parsley",
    "salt pork",
    "herb butter",
    "corned beef brisket",
    "large pot",
    "cold water",
    "spoon",
    "beef",
    "simmering pot",
    "melted butter",
    "sharp knife",
    "vegetables",
    "mustard",
    "pickles"
  ],
  "tyn_section":[

  ]
}