{
  "title":"How to Spray Stucco",
  "url":"https://www.wikihow.com/Spray-Stucco",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Brickwork and Stone Masonry"
  ],
  "methods":[
    {
      "name":"Testing the Stucco Sprayer",
      "steps":[
        {
          "headline":"Connect your stucco sprayer to a compressed air source.",
          "description":""
        },
        {
          "headline":"Pull the trigger.",
          "description":""
        },
        {
          "headline":"Let the sprayer run for 10 seconds.",
          "description":"If the sound of the air blast changes after that time, the sprayer is ready to use. If the sound changes after only 5 seconds, you can still use the sprayer, but with caution. The tone change indicates when the air pressure drops. A drop in air pressure means more air is being used than can flow through the line from the compressor."
        }
      ]
    },
    {
      "name":"Mixing the Stucco",
      "steps":[
        {
          "headline":"Fill a bucket a 5-gallon (about 19 liters) bucket of water to an inch from the top and a second 5-gallon bucket with 2.5 gallons (about 9.5 liters) of water.",
          "description":""
        },
        {
          "headline":"Clean out a mixer and lock it in an upright position.",
          "description":""
        },
        {
          "headline":"Start the mixer and set it to a rapid idle.",
          "description":""
        },
        {
          "headline":"Add 3.5 gallons of water (from the 5-gallon bucket), 2 buckets (120 lbs or 54.4 kg) of sand, and 1 bucket (around 80 lbs or 36.3 kg) of cement to the mix.",
          "description":"If the mix is too watery, pour in more cement. If the mix becomes too stiff, pour in more water then add more cement."
        },
        {
          "headline":"Add the rest of the water.",
          "description":"The stucco should have a toothpaste-like consistency at this point."
        },
        {
          "headline":"Add the remaining sand to the mix.",
          "description":"If it becomes too stiff, add water to it."
        },
        {
          "headline":"Turn off the mixer and take a sample of the mix.",
          "description":"You can use a long-handed cup or simply pour a bit of it into a wheelbarrow."
        },
        {
          "headline":"Place a full cup (240 ml) of mix on a trowel.",
          "description":"If it begins to slide off before the trowel is angled at 40 degrees, it is probably too wet."
        },
        {
          "headline":"Spray some mix on a wall or ceiling to test its consistency.",
          "description":"If it sticks, it is a good consistency. You may need to add water to the mix if it is too dry to stick. Likewise, if it is too wet to stick, add more sand to the mix."
        }
      ]
    },
    {
      "name":"Spraying the Stucco",
      "steps":[
        {
          "headline":"Fill the hopper with stucco mix.",
          "description":"Sprayers come with a small tank on the front called a \"hopper,\" which allows you to scoop out small amounts of stucco mix for each application. If the mix you're using pours out of the nozzle before you pull the trigger, thicken the stucco mix with more sand."
        },
        {
          "headline":"Spray the stucco mix on the target structure.",
          "description":"Point the stucco sprayer at the wall, making sure you are around 12 inches (30.5 cm) away and perpendicular to the wall. Spray in 1 to 2-second bursts. Try to keep the stucco coating even throughout the structure by constantly moving the sprayer up and down during the entire process, as spending too much time spraying one area may cause the stucco coating to be uneven across the structure."
        },
        {
          "headline":"Level out the stucco coating with a trowel and allow the stucco to set.",
          "description":"The trowel will help you smooth the stucco on to the structure. After the stucco sets, use the edge of the trowel to scrape off splatter and uneven stucco, then wipe the stucco surface down with a sponge and water."
        }
      ]
    }
  ],
  "text":" Testing the Stucco Sprayer Connect your stucco sprayer to a compressed air source.  Pull the trigger.  Let the sprayer run for 10 seconds. If the sound of the air blast changes after that time, the sprayer is ready to use. If the sound changes after only 5 seconds, you can still use the sprayer, but with caution. The tone change indicates when the air pressure drops. A drop in air pressure means more air is being used than can flow through the line from the compressor. Mixing the Stucco Fill a bucket a 5-gallon (about 19 liters) bucket of water to an inch from the top and a second 5-gallon bucket with 2.5 gallons (about 9.5 liters) of water.  Clean out a mixer and lock it in an upright position.  Start the mixer and set it to a rapid idle.  Add 3.5 gallons of water (from the 5-gallon bucket), 2 buckets (120 lbs or 54.4 kg) of sand, and 1 bucket (around 80 lbs or 36.3 kg) of cement to the mix. If the mix is too watery, pour in more cement. If the mix becomes too stiff, pour in more water then add more cement. Add the rest of the water. The stucco should have a toothpaste-like consistency at this point. Add the remaining sand to the mix. If it becomes too stiff, add water to it. Turn off the mixer and take a sample of the mix. You can use a long-handed cup or simply pour a bit of it into a wheelbarrow. Place a full cup (240 ml) of mix on a trowel. If it begins to slide off before the trowel is angled at 40 degrees, it is probably too wet. Spray some mix on a wall or ceiling to test its consistency. If it sticks, it is a good consistency. You may need to add water to the mix if it is too dry to stick. Likewise, if it is too wet to stick, add more sand to the mix. Spraying the Stucco Fill the hopper with stucco mix. Sprayers come with a small tank on the front called a \"hopper,\" which allows you to scoop out small amounts of stucco mix for each application. If the mix you're using pours out of the nozzle before you pull the trigger, thicken the stucco mix with more sand. Spray the stucco mix on the target structure. Point the stucco sprayer at the wall, making sure you are around 12 inches (30.5 cm) away and perpendicular to the wall. Spray in 1 to 2-second bursts. Try to keep the stucco coating even throughout the structure by constantly moving the sprayer up and down during the entire process, as spending too much time spraying one area may cause the stucco coating to be uneven across the structure. Level out the stucco coating with a trowel and allow the stucco to set. The trowel will help you smooth the stucco on to the structure. After the stucco sets, use the edge of the trowel to scrape off splatter and uneven stucco, then wipe the stucco surface down with a sponge and water.",
  "tyn_model":[
    "water",
    "sand",
    "trowel",
    "stucco mix",
    "stucco sprayer",
    "sprayer",
    "mixer",
    "cement",
    "hopper",
    "compressed air source",
    "compressor",
    "mix",
    "sponge"
  ],
  "tyn_section":[

  ]
}