{
  "title":"How to Make Bread Pudding With Challah Bread",
  "url":"https://www.wikihow.com/Make-Bread-Pudding-With-Challah-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Puddings"
  ],
  "steps":[
    {
      "headline":"Cut the challah bread into 1-inch (2.54-cm) thick slices, and cut each slice into 1-inch (2.54-cm) cubes.",
      "description":""
    },
    {
      "headline":"Place the challah bread cubes into a single layer in the baking dish to make bread pudding.",
      "description":""
    },
    {
      "headline":"Sprinkle a layer of chocolate chips or dried fruit on top of the first layer of bread cubes.",
      "description":"You can also spread a coating of jam on top of the first layer of bread."
    },
    {
      "headline":"Add another layer of bread cubes, and then add a third layer if there is room.",
      "description":"Set the baking dish aside."
    },
    {
      "headline":"Break between 4 to 6 eggs into a mixing bowl, depending on how rich you want the challah bread pudding to be.",
      "description":"Use 4 eggs for a less-rich pudding and 6 for a richer pudding."
    },
    {
      "headline":"Add 1 cup of sugar to the eggs, and beat with an electric mixer until combined and the sugar is dissolved.",
      "description":"Add 4 cups of milk to the mixture along with 1 tsp. vanilla extract and the melted butter. Beat to combine. You can substitute brandy or another liqueur for 1 to 2 tablespoons of the milk if you would like."
    },
    {
      "headline":"Pour the egg and milk mixture over the top of the challah bread in the baking dish.",
      "description":"Coat the bread cubes evenly with the custard mixture. You don't want any dry cubes in the challah bread pudding."
    },
    {
      "headline":"Sprinkle dried fruits or chocolate chips on top of the bread cubes if you'd like.",
      "description":""
    },
    {
      "headline":"Heat the oven to 350 degrees Fahrenheit (177 degrees Celsius).",
      "description":""
    },
    {
      "headline":"Let the bread cubes absorb the custard mixture while the oven preheats.",
      "description":"The mixture should soak for about 15 minutes."
    },
    {
      "headline":"Cover the baking dish with a layer of aluminum foil so that the bread cubes on top do not brown too quickly.",
      "description":""
    },
    {
      "headline":"Slide the baking dish into the oven, and bake for about 45 to 60 minutes until the custard mixture is set and not liquid anymore.",
      "description":""
    },
    {
      "headline":"Remove the aluminum foil from the baking dish, and let it cook for another 10 to 15 minutes to brown the top.",
      "description":"You can also turn on the broiler and slide the bread pudding into the broiler for 5 minutes to brown the top."
    },
    {
      "headline":"Sprinkle powdered sugar or cinnamon on top of the challah bread pudding.",
      "description":"You can also leave it plain."
    },
    {
      "headline":"Serve with whipped cream or a dollop of jam if you'd like.",
      "description":""
    }
  ],
  "text":" Cut the challah bread into 1-inch (2.54-cm) thick slices, and cut each slice into 1-inch (2.54-cm) cubes.  Place the challah bread cubes into a single layer in the baking dish to make bread pudding.  Sprinkle a layer of chocolate chips or dried fruit on top of the first layer of bread cubes. You can also spread a coating of jam on top of the first layer of bread. Add another layer of bread cubes, and then add a third layer if there is room. Set the baking dish aside. Break between 4 to 6 eggs into a mixing bowl, depending on how rich you want the challah bread pudding to be. Use 4 eggs for a less-rich pudding and 6 for a richer pudding. Add 1 cup of sugar to the eggs, and beat with an electric mixer until combined and the sugar is dissolved. Add 4 cups of milk to the mixture along with 1 tsp. vanilla extract and the melted butter. Beat to combine. You can substitute brandy or another liqueur for 1 to 2 tablespoons of the milk if you would like. Pour the egg and milk mixture over the top of the challah bread in the baking dish. Coat the bread cubes evenly with the custard mixture. You don't want any dry cubes in the challah bread pudding. Sprinkle dried fruits or chocolate chips on top of the bread cubes if you'd like.  Heat the oven to 350 degrees Fahrenheit (177 degrees Celsius).  Let the bread cubes absorb the custard mixture while the oven preheats. The mixture should soak for about 15 minutes. Cover the baking dish with a layer of aluminum foil so that the bread cubes on top do not brown too quickly.  Slide the baking dish into the oven, and bake for about 45 to 60 minutes until the custard mixture is set and not liquid anymore.  Remove the aluminum foil from the baking dish, and let it cook for another 10 to 15 minutes to brown the top. You can also turn on the broiler and slide the bread pudding into the broiler for 5 minutes to brown the top. Sprinkle powdered sugar or cinnamon on top of the challah bread pudding. You can also leave it plain. Serve with whipped cream or a dollop of jam if you'd like. ",
  "tyn_model":[
    "baking dish",
    "challah bread",
    "eggs",
    "challah bread pudding",
    "milk",
    "oven",
    "bread pudding",
    "chocolate chips",
    "sugar",
    "aluminum foil",
    "broiler",
    "dried fruit",
    "jam",
    "bread cubes",
    "mixing bowl",
    "electric mixer",
    "vanilla extract",
    "butter",
    "brandy",
    "custard",
    "powdered sugar",
    "cinnamon",
    "whipped cream"
  ],
  "tyn_section":[

  ]
}