{
  "title":"How to Care for Your Aloe Vera Plant",
  "url":"https://www.wikihow.com/Care-for-Your-Aloe-Vera-Plant",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Indoor and Patio Plants"
  ],
  "parts":[
    {
      "name":"Providing Basic Care",
      "steps":[
        {
          "headline":"Place the aloe in a sunny spot.",
          "description":"A sunny kitchen window or another sunny place in your house is perfect for an aloe plant. Aloe also does fine in areas with indirect sunlight. Aloe in full shade will not thrive, so make sure there's a least a little sun in the room where you place the aloe. You can move the plant outdoors in the summer months as long as there is no chance of frost. Aloe plants are made up of 95 percent water, and even a slight frost will freeze them and turn them to mush. If you live in a warm growing zone and are planting your aloe outdoors, choose a place that gets indirect sun (six to eight hours per day)."
        },
        {
          "headline":"Water deeply, but sparingly.",
          "description":"Aloe plants are pretty low-maintenance, since they don't require much water. Wait until the soil is dry at least two inches below the surface, then water slowly and deeply until you see water coming through the drainage holes. Do not water the aloe again until the soil is dry at least two inches below the surface once more. In most environments during April through October, you will need to water regularly. This equates to watering once every week, and twice per month in the winter. If you've just repotted your aloe, wait two or three days before watering. This gives the roots time to adjust to the new soil before taking in water. When in doubt, water less, not more. When aloe is overwatered, the roots begin to rot, and the plant eventually dies. It's better to wait a few extra days if you're not sure whether it's time to water. If you truly love your aloe plant, consider using rainwater. When it rains, the aloe gets watered, and when it doesn't the aloe goes without. This replicates the aloe's natural environment. However, this will not work during times of drought. Remember that overwatering may lead to root rot and fungus, so it is very important to avoid this."
        },
        {
          "headline":"Fertilize the aloe during the growing season.",
          "description":"From April through September, the aloe will grow vigorously. You can help it along if you'd like by providing some fertilizer twice a month during these months. Dilute a 15-30-15 fertilizer by mixing it with water, one part fertilizer to five parts water. Deliver the fertilizer on the days when you water. Stop fertilizing during the winter, since the plant can't use fertilizer when it isn't actively growing."
        },
        {
          "headline":"Watch for insects.",
          "description":"There are a few pests that are common fans of the aloe plant, such as mealy bugs. These bugs are flat and brown or tan and they like to suck on the sap from aloe plants. To prevent them, use a natural, non-toxic pesticide on your aloe plant."
        }
      ]
    },
    {
      "name":"Repotting Aloe",
      "steps":[
        {
          "headline":"Take a look at the pot the aloe came in.",
          "description":"Aloe plants often come in flimsy and small plastic pots when you first buy them. To help your aloe last for years, it's a good idea to repot it in in a bigger pot where it will have more room. If the aloe is already in a large, sturdy clay pot with holes in the bottom, you don't necessarily need to repot it."
        },
        {
          "headline":"Get a potting mix for cacti.",
          "description":"Aloe, like other cacti, prefer dry, sandy soil, and they don't do well in the rich moisture of regular potting soil. Check your garden store for a mix made especially for cacti or succulents, plants that store their water and prefer their roots to be dry instead of wet. If you live in growing zones 10 to 11, where there is no chance of freezing, you can grow your aloe outdoors as a garden plant instead of as an indoor house plant. Use 1/3 sand, 1/3 gravel, and 1/3 soil as your growing medium."
        },
        {
          "headline":"Chose a pot three times larger than the aloe's root ball.",
          "description":"The root ball is the mixture of roots and dirt at the base of the aloe plant. Aloe loves to spread out and grow, so you want to choose a big pot that gives your plant plenty of room. Get a clay pot with drainage holes and a tray to place underneath to catch the soil and water. Also, make sure that you do not let the pot sit in water. It needs to be able to drain. After several months or a year of care, you might notice your aloe plant is starting to outgrow its pot. If the aloe leaves are as tall as the pot, it's time to graduate your plant to a bigger container. Buy a new pot that's three times as large as the current size of the root ball and repot it."
        },
        {
          "headline":"Pot the aloe so that the leaves stand above the soil.",
          "description":"Fill the pot partially with soil, then set the aloe's root ball right in the middle. Place more soil around the root ball, all the way up to the base of the leaves. Pat it lightly with your hands to keep the aloe plant in place. Keep in mind that the soil should only cover the root ball. Place pebbles on top of the soil."
        },
        {
          "headline":"Spread pebbles or shells over the exposed dirt.",
          "description":"This will help to hold in moisture and replicate the aloe's natural environment. Choose any type of small pebbles, rocks or shells that you like. Press them lightly into the soil at the base of the plant."
        },
        {
          "headline":"Propagate the \"babies\".",
          "description":"These are the tiny aloe plants that sprout from the main plant. When you see a baby that has fully formed, detach it from the mother plant by severing it with a knife. Take care not to break the roots as you do this. Set it on a clean, dry shelf to let it callous over for a couple of days. Then repot it in a small pot using potting soil for succulents or cacti. If the baby has no roots, you can still propagate it. Fill a small pot with the correct potting soil and place the baby cut-side down on top of the soil. Instead of watering it, spritz it with water every few days. Eventually you should see some roots start to sprout. When you do, you can pot it in the soil."
        }
      ]
    }
  ],
  "text":" Providing Basic Care Place the aloe in a sunny spot. A sunny kitchen window or another sunny place in your house is perfect for an aloe plant. Aloe also does fine in areas with indirect sunlight. Aloe in full shade will not thrive, so make sure there's a least a little sun in the room where you place the aloe. You can move the plant outdoors in the summer months as long as there is no chance of frost. Aloe plants are made up of 95 percent water, and even a slight frost will freeze them and turn them to mush. If you live in a warm growing zone and are planting your aloe outdoors, choose a place that gets indirect sun (six to eight hours per day). Water deeply, but sparingly. Aloe plants are pretty low-maintenance, since they don't require much water. Wait until the soil is dry at least two inches below the surface, then water slowly and deeply until you see water coming through the drainage holes. Do not water the aloe again until the soil is dry at least two inches below the surface once more. In most environments during April through October, you will need to water regularly. This equates to watering once every week, and twice per month in the winter. If you've just repotted your aloe, wait two or three days before watering. This gives the roots time to adjust to the new soil before taking in water. When in doubt, water less, not more. When aloe is overwatered, the roots begin to rot, and the plant eventually dies. It's better to wait a few extra days if you're not sure whether it's time to water. If you truly love your aloe plant, consider using rainwater. When it rains, the aloe gets watered, and when it doesn't the aloe goes without. This replicates the aloe's natural environment. However, this will not work during times of drought. Remember that overwatering may lead to root rot and fungus, so it is very important to avoid this. Fertilize the aloe during the growing season. From April through September, the aloe will grow vigorously. You can help it along if you'd like by providing some fertilizer twice a month during these months. Dilute a 15-30-15 fertilizer by mixing it with water, one part fertilizer to five parts water. Deliver the fertilizer on the days when you water. Stop fertilizing during the winter, since the plant can't use fertilizer when it isn't actively growing. Watch for insects. There are a few pests that are common fans of the aloe plant, such as mealy bugs. These bugs are flat and brown or tan and they like to suck on the sap from aloe plants. To prevent them, use a natural, non-toxic pesticide on your aloe plant. Repotting Aloe Take a look at the pot the aloe came in. Aloe plants often come in flimsy and small plastic pots when you first buy them. To help your aloe last for years, it's a good idea to repot it in in a bigger pot where it will have more room. If the aloe is already in a large, sturdy clay pot with holes in the bottom, you don't necessarily need to repot it. Get a potting mix for cacti. Aloe, like other cacti, prefer dry, sandy soil, and they don't do well in the rich moisture of regular potting soil. Check your garden store for a mix made especially for cacti or succulents, plants that store their water and prefer their roots to be dry instead of wet. If you live in growing zones 10 to 11, where there is no chance of freezing, you can grow your aloe outdoors as a garden plant instead of as an indoor house plant. Use 1/3 sand, 1/3 gravel, and 1/3 soil as your growing medium. Chose a pot three times larger than the aloe's root ball. The root ball is the mixture of roots and dirt at the base of the aloe plant. Aloe loves to spread out and grow, so you want to choose a big pot that gives your plant plenty of room. Get a clay pot with drainage holes and a tray to place underneath to catch the soil and water. Also, make sure that you do not let the pot sit in water. It needs to be able to drain. After several months or a year of care, you might notice your aloe plant is starting to outgrow its pot. If the aloe leaves are as tall as the pot, it's time to graduate your plant to a bigger container. Buy a new pot that's three times as large as the current size of the root ball and repot it. Pot the aloe so that the leaves stand above the soil. Fill the pot partially with soil, then set the aloe's root ball right in the middle. Place more soil around the root ball, all the way up to the base of the leaves. Pat it lightly with your hands to keep the aloe plant in place. Keep in mind that the soil should only cover the root ball. Place pebbles on top of the soil. Spread pebbles or shells over the exposed dirt. This will help to hold in moisture and replicate the aloe's natural environment. Choose any type of small pebbles, rocks or shells that you like. Press them lightly into the soil at the base of the plant. Propagate the \"babies\". These are the tiny aloe plants that sprout from the main plant. When you see a baby that has fully formed, detach it from the mother plant by severing it with a knife. Take care not to break the roots as you do this. Set it on a clean, dry shelf to let it callous over for a couple of days. Then repot it in a small pot using potting soil for succulents or cacti. If the baby has no roots, you can still propagate it. Fill a small pot with the correct potting soil and place the baby cut-side down on top of the soil. Instead of watering it, spritz it with water every few days. Eventually you should see some roots start to sprout. When you do, you can pot it in the soil.",
  "tyn_model":[
    "water",
    "aloe",
    "fertilizer",
    "pot",
    "aloe plants",
    "aloe plant",
    "soil",
    "pebbles",
    "potting soil",
    "mealy bugs",
    "pesticide",
    "potting mix",
    "sand",
    "gravel",
    "dirt",
    "rocks",
    "knife"
  ],
  "tyn_section":[

  ]
}