{
  "title":"How to Make a Gaming Clan",
  "url":"https://www.wikihow.com/Make-a-Gaming-Clan",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "steps":[
    {
      "headline":"First, Think about the games your clan are going to play.",
      "description":"Choose online games like Halo, Call of Duty, Fortnite, Minecraft, and Terraria."
    },
    {
      "headline":"Now get some people to join the clan.",
      "description":"Talk to your friends, family, etc. Most games have their own page on Reddit, so that's a great place to start....."
    },
    {
      "headline":"Next, name your clan.",
      "description":"Choose names that are original (ex. Sect of the Late Yak) or collaborate with your clanmates to choose a name."
    },
    {
      "headline":"Get a website.",
      "description":"You will want a website so you can advertise and let people sign up. Webs is a good host for a website. They provide forums and members (webs.com). Try learning how to code, or ask a clanmate to do the coding for you. You can also make a profile on Twitter, Facebook or Tumblr too."
    },
    {
      "headline":"Come up with some rules .",
      "description":". . (E.G. You are not allowed in other clans while in this clan) and post them on the website where people can see them"
    },
    {
      "headline":"Create game servers.",
      "description":"Servers are easy to make depending on what games, Minecraft and Terraria servers are easy to set up since Mojang and Redigit (Terraria programmer) had released server kits respectively."
    },
    {
      "headline":"When you have servers, Have competitions on the server.",
      "description":"This brings the fun online with your clan members!"
    },
    {
      "headline":"Make alliances with other clans.",
      "description":"This will spread your clan around more and gives newcomers a choice."
    },
    {
      "headline":"HAVE FUN!",
      "description":""
    }
  ],
  "text":" First, Think about the games your clan are going to play. Choose online games like Halo, Call of Duty, Fortnite, Minecraft, and Terraria. Now get some people to join the clan. Talk to your friends, family, etc. Most games have their own page on Reddit, so that's a great place to start..... Next, name your clan. Choose names that are original (ex. Sect of the Late Yak) or collaborate with your clanmates to choose a name. Get a website. You will want a website so you can advertise and let people sign up. Webs is a good host for a website. They provide forums and members (webs.com). Try learning how to code, or ask a clanmate to do the coding for you. You can also make a profile on Twitter, Facebook or Tumblr too. Come up with some rules . . . (E.G. You are not allowed in other clans while in this clan) and post them on the website where people can see them Create game servers. Servers are easy to make depending on what games, Minecraft and Terraria servers are easy to set up since Mojang and Redigit (Terraria programmer) had released server kits respectively. When you have servers, Have competitions on the server. This brings the fun online with your clan members! Make alliances with other clans. This will spread your clan around more and gives newcomers a choice. HAVE FUN! ",
  "tyn_model":[
    "servers"
  ],
  "tyn_section":[

  ]
}