{
  "title":"How to Throw a Frisbee Backhand and Forehand",
  "url":"https://www.wikihow.com/Throw-a-Frisbee-Backhand-and-Forehand",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games",
    "Flying Discs and Frisbees"
  ],
  "methods":[
    {
      "name":"Equipment and Environment",
      "steps":[
        {
          "headline":"Using the proper Frisbee is vital to performing these throws correctly when one is a novice of ultimate Frisbee.",
          "description":"The kind of Frisbee you want to use is one that is the 175 grams (6.2 oz), which is the official weight for the game of Ultimate Frisbee. There are plenty of companies that make official ultimate discs, but a few include Discraft, which seems to be the most popular, and Wham-O, who were the inventors of the original Frisbee Flying Disc. All official Ultimate Frisbee discs are flat on the top, with the outside sloping down to a vertical lip around the entire circumference of the disc. The bottom  looks like a flat bowl, or a plate with a vertical lip. This shape allows the most control and distance for the thrower."
        },
        {
          "headline":"Ideal Weather Conditions: As can be pretty easily guessed, the most important condition that allows you to throw a Frisbee well is no wind.",
          "description":"When wind is a non-factor, the flying disc will go exactly where your muscles send it since there will be no outside force to blow it off course, slow it down, or even speed it up. As well as no wind, warmer temperatures (above 70 degrees Fahrenheit or so) are preferred, as warmer air will keep the Frisbee flying for a greater distance, and warmer temperatures are generally just more enjoyable. However, for health and safety reasons DO NOT practice these throws outside if the temperature is severely low or high, you are not comfortable with the current conditions, or the weather is too dangerous to be in for an extended period. Additionally, you may want someone to throw back and forth with, as retrieving your own throws can get quite tedious and boring! Now that we have gone over what we need to know before, we can move on to the mechanics."
        }
      ]
    },
    {
      "name":"Backhand",
      "steps":[
        {
          "headline":"Stand with the foot that corresponds to your dominant hand (the hand you will be throwing with) forward.",
          "description":""
        },
        {
          "headline":"Point your dominant shoulder in the direction you wish to throw.",
          "description":""
        },
        {
          "headline":"Turn your head the direction you wish to throw.",
          "description":"Basically, you will be standing parallel to the line of the Frisbee’s flight."
        },
        {
          "headline":"Spread your feet shoulders length apart and bend your knees slightly.",
          "description":""
        },
        {
          "headline":"Grip the Frisbee in your dominant hand, with your thumb resting over the top of the disc, and your other four fingers.",
          "description":""
        },
        {
          "headline":"Raise your throwing arm parallel to the ground and tuck the Frisbee into your chest.",
          "description":"Your forearm and your wrist should be bent inwards."
        },
        {
          "headline":"Step into your throw while keeping your toes pointed perpendicular to the direction of the throw.",
          "description":""
        },
        {
          "headline":"Move your forearm and wrist outward in a quick throwing motion, while keeping your entire arm parallel to the ground, and your shoulder in place.",
          "description":"Your shoulders should not move. Note: It is important during this step to keep your arm parallel to the ground, or the Frisbee will not fly flat and will veer off course."
        },
        {
          "headline":"Release (quickly) the flying disc just before your entire arm is straight and in a locked position.",
          "description":"The Frisbee should be out of your hand by the time your arm is in this position."
        },
        {
          "headline":"Repeat and practice, practice, practice!",
          "description":""
        }
      ]
    },
    {
      "name":"Forehand",
      "steps":[
        {
          "headline":"Stand with your non-dominant foot forward (the opposite of the foot used for a backhand throw).",
          "description":""
        },
        {
          "headline":"Point the toes of your forward-facing foot slightly inward of your target, and the toes of your other foot perpendicular to the direction of the Frisbee’s flight.",
          "description":"This allows for the best balance and comfort while throwing the forehand."
        },
        {
          "headline":"Point the shoulder of the arm you will not be using to throw toward your target.",
          "description":""
        },
        {
          "headline":"Turn your head towards your target.",
          "description":""
        },
        {
          "headline":"Spread your feet shoulders length apart and bend knees slightly.",
          "description":""
        },
        {
          "headline":"Grip the disc with your thumb over the top and squeeze your middle and index fingers together then against the inside of the bottom lip so only the middle finger is touching the Frisbee, next squeeze your pinky and ring finger together and against the outside lip of the Frisbee so that your pinky and ring finger are clamping the lip against your middle and index finger.",
          "description":"Only your middle and ring finger and thumb should be touching the disc. Your hand should look like the Spock hand clamping on the disc"
        },
        {
          "headline":"Raise your forearm parallel to the ground.",
          "description":"Your upper arm should essentially be straight down."
        },
        {
          "headline":"Bend your wrist back (outward) about 45 degrees.",
          "description":""
        },
        {
          "headline":"Cock your forearm back slightly, preparing to throw.",
          "description":""
        },
        {
          "headline":"Quickly move your forearm inward while simultaneously flicking your wrist towards your target.",
          "description":"Keep your middle finger pressed against the bottom lip until you release the disc. Most of the throws power should come from the flick of your wrist. *Note: Again, it is important during this step to always keep your forearm parallel to the ground, or the Frisbee will not fly flat and will veer off course."
        },
        {
          "headline":"Release the Frisbee just before your wrist is pointed towards your target, and watch it fly!",
          "description":""
        }
      ]
    }
  ],
  "text":" Equipment and Environment Using the proper Frisbee is vital to performing these throws correctly when one is a novice of ultimate Frisbee. The kind of Frisbee you want to use is one that is the 175 grams (6.2 oz), which is the official weight for the game of Ultimate Frisbee. There are plenty of companies that make official ultimate discs, but a few include Discraft, which seems to be the most popular, and Wham-O, who were the inventors of the original Frisbee Flying Disc. All official Ultimate Frisbee discs are flat on the top, with the outside sloping down to a vertical lip around the entire circumference of the disc. The bottom  looks like a flat bowl, or a plate with a vertical lip. This shape allows the most control and distance for the thrower. Ideal Weather Conditions: As can be pretty easily guessed, the most important condition that allows you to throw a Frisbee well is no wind. When wind is a non-factor, the flying disc will go exactly where your muscles send it since there will be no outside force to blow it off course, slow it down, or even speed it up. As well as no wind, warmer temperatures (above 70 degrees Fahrenheit or so) are preferred, as warmer air will keep the Frisbee flying for a greater distance, and warmer temperatures are generally just more enjoyable. However, for health and safety reasons DO NOT practice these throws outside if the temperature is severely low or high, you are not comfortable with the current conditions, or the weather is too dangerous to be in for an extended period. Additionally, you may want someone to throw back and forth with, as retrieving your own throws can get quite tedious and boring! Now that we have gone over what we need to know before, we can move on to the mechanics. Backhand Stand with the foot that corresponds to your dominant hand (the hand you will be throwing with) forward.  Point your dominant shoulder in the direction you wish to throw.  Turn your head the direction you wish to throw. Basically, you will be standing parallel to the line of the Frisbee’s flight. Spread your feet shoulders length apart and bend your knees slightly.  Grip the Frisbee in your dominant hand, with your thumb resting over the top of the disc, and your other four fingers.  Raise your throwing arm parallel to the ground and tuck the Frisbee into your chest. Your forearm and your wrist should be bent inwards. Step into your throw while keeping your toes pointed perpendicular to the direction of the throw.  Move your forearm and wrist outward in a quick throwing motion, while keeping your entire arm parallel to the ground, and your shoulder in place. Your shoulders should not move. Note: It is important during this step to keep your arm parallel to the ground, or the Frisbee will not fly flat and will veer off course. Release (quickly) the flying disc just before your entire arm is straight and in a locked position. The Frisbee should be out of your hand by the time your arm is in this position. Repeat and practice, practice, practice!  Forehand Stand with your non-dominant foot forward (the opposite of the foot used for a backhand throw).  Point the toes of your forward-facing foot slightly inward of your target, and the toes of your other foot perpendicular to the direction of the Frisbee’s flight. This allows for the best balance and comfort while throwing the forehand. Point the shoulder of the arm you will not be using to throw toward your target.  Turn your head towards your target.  Spread your feet shoulders length apart and bend knees slightly.  Grip the disc with your thumb over the top and squeeze your middle and index fingers together then against the inside of the bottom lip so only the middle finger is touching the Frisbee, next squeeze your pinky and ring finger together and against the outside lip of the Frisbee so that your pinky and ring finger are clamping the lip against your middle and index finger. Only your middle and ring finger and thumb should be touching the disc. Your hand should look like the Spock hand clamping on the disc Raise your forearm parallel to the ground. Your upper arm should essentially be straight down. Bend your wrist back (outward) about 45 degrees.  Cock your forearm back slightly, preparing to throw.  Quickly move your forearm inward while simultaneously flicking your wrist towards your target. Keep your middle finger pressed against the bottom lip until you release the disc. Most of the throws power should come from the flick of your wrist. *Note: Again, it is important during this step to always keep your forearm parallel to the ground, or the Frisbee will not fly flat and will veer off course. Release the Frisbee just before your wrist is pointed towards your target, and watch it fly! ",
  "tyn_model":[
    "frisbee",
    "frisbee flying disc",
    "bowl",
    "plate",
    "forearm"
  ],
  "tyn_section":[

  ]
}