{
  "title":"How to Cook Cereal Prawn",
  "url":"https://www.wikihow.com/Cook-Cereal-Prawn",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Prawns and Shrimp"
  ],
  "steps":[
    {
      "headline":"Place all ingredients on one spot that is easy to access.",
      "description":""
    },
    {
      "headline":"Clean prawns, leave shell on.",
      "description":""
    },
    {
      "headline":"Mix the corn flour with the milk powder.",
      "description":""
    },
    {
      "headline":"Beat the egg.",
      "description":""
    },
    {
      "headline":"Dip the prawns into the egg.",
      "description":""
    },
    {
      "headline":"Coat the prawns with the mixture of flour and milk powder.",
      "description":""
    },
    {
      "headline":"Deep fry the prawns.",
      "description":"Leave aside after cooked."
    },
    {
      "headline":"Melt the butter in a wok and add in curry leaves and chilli padi.",
      "description":"Stir fry until fragrant"
    },
    {
      "headline":"Add the cereal and stir fry, and a teaspoon of sugar after a minute.",
      "description":""
    },
    {
      "headline":"Add prawns and stir fry for a moment.",
      "description":"(You can turn down the fire so as not to overcook the cereal)"
    },
    {
      "headline":"Arrange aesthetically and it would be ready for serving.",
      "description":""
    }
  ],
  "text":" Place all ingredients on one spot that is easy to access.  Clean prawns, leave shell on.  Mix the corn flour with the milk powder.  Beat the egg.  Dip the prawns into the egg.  Coat the prawns with the mixture of flour and milk powder.  Deep fry the prawns. Leave aside after cooked. Melt the butter in a wok and add in curry leaves and chilli padi. Stir fry until fragrant Add the cereal and stir fry, and a teaspoon of sugar after a minute.  Add prawns and stir fry for a moment. (You can turn down the fire so as not to overcook the cereal) Arrange aesthetically and it would be ready for serving. ",
  "tyn_model":[
    "milk powder",
    "egg",
    "cereal",
    "corn flour",
    "flour",
    "butter",
    "wok",
    "curry leaves",
    "chilli padi",
    "sugar"
  ],
  "tyn_section":[

  ]
}