{
  "title":"How to Choose an Apple",
  "url":"https://www.wikihow.com/Choose-an-Apple",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "methods":[
    {
      "name":"Checking Apple Quality",
      "steps":[
        {
          "headline":"Look for obvious bad spots.",
          "description":"If you see spots that are rotten, dark brown, or too soft, the apple has likely already gone bad. Blemishes or lack of shininess do not automatically mean the apple is bad. Blemishes are a natural part of growing and are not the same as bruises or rotten spots. If you see a spot, gently wipe at it to see if it is just dirty or is a bad spot. Bruises may be small and not very deep, so these are fine because you can cut around them. If the apple has a large bruise or is mushy, it’s probably rotten deeper into the apple and not just on the surface. These deeply rotten ones are the ones you want to avoid."
        },
        {
          "headline":"Look for cuts.",
          "description":"Besides bruises, apples sometimes get small nicks or slices during picking and transport. This causes some of the flesh to be exposed and turn brown. Apples with excessive cuts should be avoided as a lot of the flesh will be exposed and bad. Again, a small cut here and there is nothing to worry about. You just want to make sure the whole apple isn’t covered in cuts."
        },
        {
          "headline":"Examine the color.",
          "description":"In general, apples tend to be a full red or slightly orange color when they are fully ripe. Granny Smith and Golden delicious are green and yellow, respectively, but otherwise an apple with a lot of green on it is probably not very ripe. You usually want to get the most red you can find. Apples with a full color have absorbed a lot of sunlight, so they tend to be more flavorful than dull looking apples. Apples won’t always be one solid color, but if half of the apple is still green (when it should be red) it has not ripened evenly and may not be the best choice."
        },
        {
          "headline":"Check the apple for firmness.",
          "description":"Hold the apple between your thumb and your index finger. Squeeze the apple gently. You don’t want to squeeze too hard or you will bruise it. If you give it a light squeeze and it doesn’t squish, this is a good apple. Squeeze a couple of spots around the apple to make sure the majority of it is firm."
        },
        {
          "headline":"Sniff the apple to detect foul odor.",
          "description":"If an apple is getting past its prime freshness, you can often tell by the smell. Give the apple a sniff and if it smells bad, it probably is. Good apples will have a pleasant aroma, while apples that have gone bad will smell rotten. It’s not an exact science but the smell is a strong indicator of quality."
        }
      ]
    },
    {
      "name":"Researching Your Options",
      "steps":[
        {
          "headline":"Decide what you want to do with the apple.",
          "description":"If you are baking or eating apples fresh, you may want to buy different kinds. If you want to bake a pie but you choose apples that don’t bake well, your food won’t turn out. If you plan ahead what purpose the apple will serve, you can make a more informed decision about which to buy. Fuji, Goldrush, and Red Delicious are great options for salad because they don’t visibly brown quickly. Jonamac, Spigold, and Cortland are recommended for apple butter because they retain flavor during cooking and pair well with the spices used. For making applesauce, use Jonagold, Cortland, and Yellow Delicious. If the skin in red, you can leave it on for pink colored applesauce."
        },
        {
          "headline":"Consult an apple guide.",
          "description":"Learning apple varieties will help you know better what to use different apples for. This is also helpful for personal preference, as some people like extra sweet apples and some prefer tart. Some apples are more crunchy and others are softer. For example, Red Delicious are a classic for snacking, but are not recommended for baking or using in sauces. On the other hand, Golden Delicious are great for both eating fresh and for pies and baking. Sweet apples include Ambrosia, Honeycrisp, and Fuji. Granny smith and Jazz apples are known to be a little more tart and tangy."
        },
        {
          "headline":"Go to the orchard when apples are in season.",
          "description":"While people usually buy apples in the store, which is easier and more convenient, getting apples from an orchard guarantees they are fresh. If you are able to get to an orchard, it might be worth the extra effort to get apples that are not weeks or months old, as store apples tend to be. Look online to find out if there is an orchard within driving distance of you and plan a trip. This can be a great activity for the whole family, not just a necessity trip."
        },
        {
          "headline":"Look into organic or locally grown apples.",
          "description":"Apple growers tend to use a lot of pesticides to keep the trees free of bugs. So non-organically grown apples carry a lot of pesticides with them to the store. Organic apples are free of pesticides and are therefore healthier for you. Farmer’s markets are a great way to get fresh apples. There’s also a good chance they come from smaller orchards which might mean they are tended more carefully. Buying locally also means a better chance of getting fresh apples because they don’t have to be transported from far away."
        }
      ]
    },
    {
      "name":"Picking Apples from the Tree",
      "steps":[
        {
          "headline":"Pick apples that come off the tree easily.",
          "description":"When you’re picking fresh from the tree, the best apples tend to come off easily when you pull them. Grab the apple, lift it up slightly, then gently twist. If it comes loose, it is probably ripe enough. If it’s hard to make it come loose, then it isn’t ready yet."
        },
        {
          "headline":"Pick apples toward the outside of the tree.",
          "description":"Apples tend to ripen first when they are on the outer branches, so when picking from the tree, stick to the furthest out. If you know it is later in the season, or the outside of the tree has already been picked over, move toward the inside. This doesn’t mean that the apples on inner branches aren’t ripe at all, just that they ripen slower."
        },
        {
          "headline":"Set apples gently into your basket.",
          "description":"When you are picking from the tree, or even buying in the store, it is important not to drop your apples into the container you’re carrying them in. It may be quicker to pick and drop, but you’ll bruise the apples and they won’t be as good to eat."
        }
      ]
    },
    {
      "name":"Storing Your Apples",
      "steps":[
        {
          "headline":"Separate apples from other fruit.",
          "description":"Apples release ethylene gas over time. This gas causes other fruit to ripen faster, so it won’t last as long. Store apples in an unsealed plastic bag, and when you can, store them in an area of the fridge away from other fruit. You want to leave the bag unsealed so the gas will dissipate from the apples themselves, too. If the gas is trapped in the bag with the apples, it will cause them to go bad faster, as well."
        },
        {
          "headline":"Store apples away from strong smelling foods.",
          "description":"Apples can absorb smells from other food if kept in close proximity. It is best to store apples in a drawer of their own whenever possible. At least try to put them in the fridge as far as possible from strong smelling foods. To help keep apples fresh, store other foods in tightly sealed containers so the smell will be contained and not spread through the fridge. Onions are a good example of a food that will pass its smell to apples. Other foods to keep sealed and away from apples are garlic, fish, and most types of pepper."
        },
        {
          "headline":"Eat or use unrefrigerated apples within 1 to 2 weeks.",
          "description":"You may choose to leave your apples out on the counter, which is fine. However, apples left out of the refrigerator will go bad much more quickly. Stored cold, apples can last 6-8 weeks, while room temperature apples only last 1-2 weeks. If you buy apples that are not quite as ripe as you want them, you can leave them out for a few days and then move them to the refrigerator. They won’t last as long as those kept cold the whole time, but longer than if you leave them out. Apples left out can also draw bugs, which is usually not an issue in the refrigerator."
        }
      ]
    }
  ],
  "text":" Checking Apple Quality Look for obvious bad spots. If you see spots that are rotten, dark brown, or too soft, the apple has likely already gone bad. Blemishes or lack of shininess do not automatically mean the apple is bad. Blemishes are a natural part of growing and are not the same as bruises or rotten spots. If you see a spot, gently wipe at it to see if it is just dirty or is a bad spot. Bruises may be small and not very deep, so these are fine because you can cut around them. If the apple has a large bruise or is mushy, it’s probably rotten deeper into the apple and not just on the surface. These deeply rotten ones are the ones you want to avoid. Look for cuts. Besides bruises, apples sometimes get small nicks or slices during picking and transport. This causes some of the flesh to be exposed and turn brown. Apples with excessive cuts should be avoided as a lot of the flesh will be exposed and bad. Again, a small cut here and there is nothing to worry about. You just want to make sure the whole apple isn’t covered in cuts. Examine the color. In general, apples tend to be a full red or slightly orange color when they are fully ripe. Granny Smith and Golden delicious are green and yellow, respectively, but otherwise an apple with a lot of green on it is probably not very ripe. You usually want to get the most red you can find. Apples with a full color have absorbed a lot of sunlight, so they tend to be more flavorful than dull looking apples. Apples won’t always be one solid color, but if half of the apple is still green (when it should be red) it has not ripened evenly and may not be the best choice. Check the apple for firmness. Hold the apple between your thumb and your index finger. Squeeze the apple gently. You don’t want to squeeze too hard or you will bruise it. If you give it a light squeeze and it doesn’t squish, this is a good apple. Squeeze a couple of spots around the apple to make sure the majority of it is firm. Sniff the apple to detect foul odor. If an apple is getting past its prime freshness, you can often tell by the smell. Give the apple a sniff and if it smells bad, it probably is. Good apples will have a pleasant aroma, while apples that have gone bad will smell rotten. It’s not an exact science but the smell is a strong indicator of quality. Researching Your Options Decide what you want to do with the apple. If you are baking or eating apples fresh, you may want to buy different kinds. If you want to bake a pie but you choose apples that don’t bake well, your food won’t turn out. If you plan ahead what purpose the apple will serve, you can make a more informed decision about which to buy. Fuji, Goldrush, and Red Delicious are great options for salad because they don’t visibly brown quickly. Jonamac, Spigold, and Cortland are recommended for apple butter because they retain flavor during cooking and pair well with the spices used. For making applesauce, use Jonagold, Cortland, and Yellow Delicious. If the skin in red, you can leave it on for pink colored applesauce. Consult an apple guide. Learning apple varieties will help you know better what to use different apples for. This is also helpful for personal preference, as some people like extra sweet apples and some prefer tart. Some apples are more crunchy and others are softer. For example, Red Delicious are a classic for snacking, but are not recommended for baking or using in sauces. On the other hand, Golden Delicious are great for both eating fresh and for pies and baking. Sweet apples include Ambrosia, Honeycrisp, and Fuji. Granny smith and Jazz apples are known to be a little more tart and tangy. Go to the orchard when apples are in season. While people usually buy apples in the store, which is easier and more convenient, getting apples from an orchard guarantees they are fresh. If you are able to get to an orchard, it might be worth the extra effort to get apples that are not weeks or months old, as store apples tend to be. Look online to find out if there is an orchard within driving distance of you and plan a trip. This can be a great activity for the whole family, not just a necessity trip. Look into organic or locally grown apples. Apple growers tend to use a lot of pesticides to keep the trees free of bugs. So non-organically grown apples carry a lot of pesticides with them to the store. Organic apples are free of pesticides and are therefore healthier for you. Farmer’s markets are a great way to get fresh apples. There’s also a good chance they come from smaller orchards which might mean they are tended more carefully. Buying locally also means a better chance of getting fresh apples because they don’t have to be transported from far away. Picking Apples from the Tree Pick apples that come off the tree easily. When you’re picking fresh from the tree, the best apples tend to come off easily when you pull them. Grab the apple, lift it up slightly, then gently twist. If it comes loose, it is probably ripe enough. If it’s hard to make it come loose, then it isn’t ready yet. Pick apples toward the outside of the tree. Apples tend to ripen first when they are on the outer branches, so when picking from the tree, stick to the furthest out. If you know it is later in the season, or the outside of the tree has already been picked over, move toward the inside. This doesn’t mean that the apples on inner branches aren’t ripe at all, just that they ripen slower. Set apples gently into your basket. When you are picking from the tree, or even buying in the store, it is important not to drop your apples into the container you’re carrying them in. It may be quicker to pick and drop, but you’ll bruise the apples and they won’t be as good to eat. Storing Your Apples Separate apples from other fruit. Apples release ethylene gas over time. This gas causes other fruit to ripen faster, so it won’t last as long. Store apples in an unsealed plastic bag, and when you can, store them in an area of the fridge away from other fruit. You want to leave the bag unsealed so the gas will dissipate from the apples themselves, too. If the gas is trapped in the bag with the apples, it will cause them to go bad faster, as well. Store apples away from strong smelling foods. Apples can absorb smells from other food if kept in close proximity. It is best to store apples in a drawer of their own whenever possible. At least try to put them in the fridge as far as possible from strong smelling foods. To help keep apples fresh, store other foods in tightly sealed containers so the smell will be contained and not spread through the fridge. Onions are a good example of a food that will pass its smell to apples. Other foods to keep sealed and away from apples are garlic, fish, and most types of pepper. Eat or use unrefrigerated apples within 1 to 2 weeks. You may choose to leave your apples out on the counter, which is fine. However, apples left out of the refrigerator will go bad much more quickly. Stored cold, apples can last 6-8 weeks, while room temperature apples only last 1-2 weeks. If you buy apples that are not quite as ripe as you want them, you can leave them out for a few days and then move them to the refrigerator. They won’t last as long as those kept cold the whole time, but longer than if you leave them out. Apples left out can also draw bugs, which is usually not an issue in the refrigerator.",
  "tyn_model":[
    "apples",
    "apple",
    "pesticides",
    "refrigerator",
    "golden delicious are",
    "fuji",
    "cortland",
    "applesauce",
    "blemishes",
    "jonamac",
    "spigold",
    "butter",
    "jonagold",
    "yellow delicious",
    "red delicious",
    "apple growers",
    "basket",
    "ethylene gas",
    "onions",
    "garlic",
    "fish",
    "pepper"
  ],
  "tyn_section":[

  ]
}