{
  "title":"How to Make a Grilled Italian Sandwich",
  "url":"https://www.wikihow.com/Make-a-Grilled-Italian-Sandwich",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals"
  ],
  "steps":[
    {
      "headline":"Put two 1 or 2 table spoons of extra virgin olive oil on a non stick pan.",
      "description":""
    },
    {
      "headline":"With a spatula spread the olive oil out enough to the size of a piece of bread.",
      "description":""
    },
    {
      "headline":"Place several very thin slices of fresh garlic in the olive oil.",
      "description":""
    },
    {
      "headline":"Start preparing your bread by thinly spreading the soft margarine with a butter knife  on the outside of each piece of bread that will be in contact with the pan, then sprinkle parmesan cheese on both sides of the bread evenly and completely, then run a spatula over the bread rubbing in the sprinkled cheese into the margarine as much as you can.",
      "description":"You can also rub in the cheese with the tips of your fingers if you like."
    },
    {
      "headline":"Turn the bread over and put Turkey, Capicola Ham, Parsley, Basil, and oregano on the ham, then toss on a slice of Provolone Cheese.",
      "description":""
    },
    {
      "headline":"Put your sandwich together making sure that the margarine and sprinkled cheese parts are on the outside of the bread.",
      "description":""
    },
    {
      "headline":"Turn the heat up real low on the stove to slowly heat up the oil and garlic, and when the garlic starts to barely cook, place your sandwich on and let it cook so ever slow.",
      "description":""
    },
    {
      "headline":"While the one side of the sandwich is slowly cooking, place thin slices of chopped or sliced garlic on the bread facing you and press into the bread with fingers or spatula.",
      "description":""
    },
    {
      "headline":"When you see that the bread is getting lightly brown underneath, turn the sandwich over and cook the other side the same.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Put two 1 or 2 table spoons of extra virgin olive oil on a non stick pan.  With a spatula spread the olive oil out enough to the size of a piece of bread.  Place several very thin slices of fresh garlic in the olive oil.  Start preparing your bread by thinly spreading the soft margarine with a butter knife  on the outside of each piece of bread that will be in contact with the pan, then sprinkle parmesan cheese on both sides of the bread evenly and completely, then run a spatula over the bread rubbing in the sprinkled cheese into the margarine as much as you can. You can also rub in the cheese with the tips of your fingers if you like. Turn the bread over and put Turkey, Capicola Ham, Parsley, Basil, and oregano on the ham, then toss on a slice of Provolone Cheese.  Put your sandwich together making sure that the margarine and sprinkled cheese parts are on the outside of the bread.  Turn the heat up real low on the stove to slowly heat up the oil and garlic, and when the garlic starts to barely cook, place your sandwich on and let it cook so ever slow.  While the one side of the sandwich is slowly cooking, place thin slices of chopped or sliced garlic on the bread facing you and press into the bread with fingers or spatula.  When you see that the bread is getting lightly brown underneath, turn the sandwich over and cook the other side the same.  Finished. ",
  "tyn_model":[
    "garlic",
    "spatula",
    "margarine",
    "olive oil",
    "table spoons",
    "extra virgin olive oil",
    "non stick pan",
    "butter knife",
    "parmesan cheese",
    "capicola ham",
    "parsley",
    "basil",
    "oregano",
    "ham",
    "provolone cheese",
    "stove",
    "oil"
  ],
  "tyn_section":[

  ]
}