{
  "title":"How to Reduce Game Lag",
  "url":"https://www.wikihow.com/Reduce-Game-Lag",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Electronic Game Strategies"
  ],
  "methods":[
    {
      "name":"Increasing FPS and Performance",
      "steps":[
        {
          "headline":"Make sure no other programs are running while you're playing.",
          "description":"If you have programs like iTunes or a torrent program running in the background, they could be eating up precious system resources. Tip: Press Ctrl+⇧ Shift+Esc to open the task manager and view any programs that are currently running. Check your system tray for programs that may be running in the background."
        },
        {
          "headline":"Update your graphics card drivers.",
          "description":"Your graphics card drivers are the software that controls your graphics card and allows it to interface with games. Running outdated drivers can have a big impact on your performance, as drivers are often tweaked in later releases for specific games. Try to make sure you're always running the latest version of your drivers. You can download the latest drivers from the Nvidia, AMD, or Intel website (depending on who manufactured your graphics adapter). See Update Your Video Card Drivers on Windows 7 for detailed instructions."
        },
        {
          "headline":"Lower your in-game settings.",
          "description":"The best way to get a big performance boost from your games is by lowering the graphical settings. This may make the game look a little worse, but can lead to massive gains in frames per second (FPS), which will provide a much smoother experience. Look for some of the following settings in your game's Graphic Options menu for a big impact:\nResolution - Games will look best when they're running at your monitor's native resolution, but you can make a big FPS improvement by dropping the resolution down. The game will look blockier, but should instantly feel smoother. Changing your resolution can give you one of the biggest performance boosts you can get. For example, switching from 1920×1080 to 1600×900 will often give you about a 20% boost in FPS. Anti-aliasing (AA) - This is the technique that smooths out the pixelated edges on objects, making edges look more natural. There are lots of different AA options (MSAA, FSAA, etc. ), but for now you just need to know that most of them have a big performance cost. Try turning AA off completely and see how your game plays. If you're getting super-smooth performance and want to try some AA, try FXAA if available first, as this is the cheapest AA solution. Also, stick to 2X or 4X solutions. Texture Quality - If you're getting intermittent stuttering while playing (as opposed to a low frame rate), you may want to lower your texture quality. This is especially important when playing newer video games with older video cards. Shadow Quality - Detailed shadows can take a whole lot of processing power, so try dropping your shadow quality to get a major performance boost. V-Sync - This locks the vertical sync to your monitor’s refresh rate which may force the game to run at a lower frame rate. You can disable this setting for a potential speed boost, however it may introduce screen tearing."
        },
        {
          "headline":"Run a version optimized for your hardware or drivers.",
          "description":"A game may come with an alternative version of the game that is optimized for 32-bit or 64-bit CPU processors or may come with a version that is optimized for your graphics driver such as DirectX 11 or above. Run the different executables and note which one provides better performance. There are two major graphics card manufacturers on the market, Nvidia and AMD. You may run into a game that was designed around one particular graphics card. The developer may provide a patch that resolves issues with a graphics card brand that is known to cause performance issues. Check discussion forums and developer websites for more information."
        },
        {
          "headline":"Disable integrated graphics card settings.",
          "description":"Certain computer configurations such as laptops that feature both an integrated graphics card and a high-end graphics card may cause programs to run on the integrated graphics card that features lower specifications. Nvidia graphics card drivers come with the Nvidia Control Panel software that allows you to change programs from using the Integrated Graphics card to your dedicated Nvidia graphics card. To open the Control panel, right click on an empty space on your desktop and click on “NVIDIA Control Panel.” On the left hand side click on “Manage 3D Settings.” In the main window pane click on the “Global Settings” tab and set the drop down labeled “Preferred graphics processor” to “High-performance NVIDIA processor” then close the window. This will change the graphics card settings for all programs. Check under the game’s settings to see which video card is being used as the primary display driver. If you have more than one video card installed, changing this setting to your video card that features high performance may resolve the issue. You can set your BIOS to disable the integrated graphics card. Check with your computer’s user manual or manufacturer’s website for more details on how to disable the integrated graphics card."
        },
        {
          "headline":"Search online for mods that increase performance.",
          "description":"You may run across a game that is not optimized for your hardware or is known to have poor performance. Search online for unofficial mods or enhancements that provide higher performance. Read reviews and discussion forums before downloading to ensure how to properly install the mod."
        },
        {
          "headline":"Read discussion forums.",
          "description":"Social hubs such as a developer or publisher’s game discussion hubs, gaming websites, and game download services such as Steam or GOG provide an outlet for those who face issues with a particular game they are running. Asking for help while providing your system specifications can help you identify issues that you may be facing. There are also other discussion threads to look out for when browsing forums. Tip: Developers may post about known issues, server maintenance, workarounds and compatibility issues with configurations of your hardware, the operating system, or conflicts with other programs. Other users may be facing the same issue as you and can sometimes provide a similar solution."
        },
        {
          "headline":"Perform virus and malware scans.",
          "description":"If you have a virus infection, the virus may be taking up a lot of your system resources. Removing infections will not only increase your game performance, but they will also improve your computer's security. Most virus infections can be removed using a combination of your antivirus program, Malwarebytes Anti-Malware, and AdwCleaner, both of which are free. See Remove Malware for more detailed instructions."
        }
      ]
    },
    {
      "name":"Reducing Ping",
      "steps":[
        {
          "headline":"Select game servers closer to you.",
          "description":"Many games have the option to either browse through available servers or set your matchmaking region. Selecting a location close to you is the absolute most effective way to decrease your ping. The process for this will vary wildly depending on the game you are playing. Look for location filters in your server browser, locations in the server name or description (US-West, EU, etc. ), or region settings in the matchmaking menu. Not all multiplayer games allow you to select a region, and may automatically try to connect you to the closest server or player to you."
        },
        {
          "headline":"Close any network-hogging programs on your computer.",
          "description":"Before playing your online game, make sure any bandwidth-chugging programs are closed. Torrents, streaming music, and open browsers can all have a big impact on your in-game lag. Close these programs before starting your game. Look in the System Tray for programs that may be running in the background."
        },
        {
          "headline":"Check if there are any other devices on your network taking bandwidth.",
          "description":"If someone is streaming video in the other room, you'll likely take a big hit to your ping. Try to time your gaming to when others aren't using the network, or ask politely if they can do something else for a while."
        },
        {
          "headline":"Connect your computer or game console to your router via Ethernet.",
          "description":"If your computer or video game console is connected to your network wirelessly, you may experience worse performance in-game. If your network setup allows it, try to run an Ethernet cable from your computer's Ethernet port to an open LAN port on your router. Note: You may need to select the wired connection if you are already connected wirelessly."
        },
        {
          "headline":"Reset your network hardware.",
          "description":"If you're noticing worse lag than usual, resetting your network hardware may solve the problem. This will disable your network for a short while, so close your game first and make sure you're not interrupting anyone else:\nRemove the power cable from your modem and from your router, if you have a separate one. Let your network hardware rest unplugged for about 30 seconds. Plug your modem back in and wait for it to boot up. This could take a minute or two. Plug your router back in after the modem finishes turning on, if you have one. The router may take an additional minute or two to turn back on."
        },
        {
          "headline":"Check for malware on your computer.",
          "description":"If you have a virus or adware infection, background processes may be eating up a lot of your bandwidth and processing power. Make sure your antivirus program is up to date, and run scans with Malwarebytes Anti-Malware and AdwCleaner (both free) to find and remove most common infections. See Remove Malware for more detailed instructions."
        },
        {
          "headline":"Enable QoS on your router (if possible).",
          "description":"If you have a router that supports QoS (Quality of Service) controls, you can use them to prioritize gaming traffic on your network. The process for activating these controls vary depending on your router, and not all routers have this feature. Most QoS default settings will prioritize gaming and web browsing over other traffic. You may need to look up specific settings for your router. See Access a Router for instructions on accessing your router's configuration page. The QoS settings, if they are available, can usually be found in the \"Traffic\" section."
        },
        {
          "headline":"Upgrade your router if you haven't in a while.",
          "description":"If you're connected wirelessly and you haven't upgraded your router in a few years, you may be able to get a much more stable connection with a new router. See Choose a Wireless Router for some tips on finding the right router. Look for routers with QoS controls, which can help prioritize gaming traffic on your network."
        },
        {
          "headline":"Check for available internet upgrades.",
          "description":"This is a bit of an extreme step, but you may be able to find a good deal on a major speed upgrade. If you haven't checked prices in a while, you may find that you're paying the same amount as a faster package."
        },
        {
          "headline":"Consider using a VPN service.",
          "description":"Sometimes, your ISP may route your traffic through a variety of servers before it reaches its destination. This can lead to bad ping, even if you are physically close to the server. If this is the case, a VPN may help reduce your ping as there will be less hops between you and the gaming server. A VPN cannot make you magically closer to the server. If you're trying to connect to a server overseas, you still have to contend with the speed of light and a VPN won't make much of a difference. In many cases, a VPN will actually increase your ping, as it's another hop your traffic needs to go through. VPNs are only really useful if your ISP throttles your gaming traffic or routes it in an unusual way. See Connect to a VPN for instructions on finding and connecting to a VPN service."
        }
      ]
    },
    {
      "name":"Optimizing Your Computer Hardware",
      "steps":[
        {
          "headline":"Consider overclocking your hardware.",
          "description":"If you have the right hardware, you may be able to squeeze more power out of it by increasing the clock speed and voltage. This is referred to as \"overclocking,\" and is not without risk. Increasing the voltage too much can fry your equipment, but if you can get more power out of your hardware you can see significant performance boosts. Heavy overclocking will require more advanced cooling techniques. Not all hardware can be overclocked. See Overclock a Graphics Card for instructions on overclocking your video card. See Overclock a CPU for instructions on overclocking your CPU."
        },
        {
          "headline":"Try a PC optimizer program.",
          "description":"There are several programs available that are designed to boost performance while playing games. These optimizers will suspend non-essential background processes, defrag your game folders, and perform other optimizations. Your mileage may vary with these, especially if you've already taken the time to close background programs and regularly maintain your hard drive. Popular boosting programs include:\nRazer Cortex\nGame Gain\nCCleaner\nAVG PC TuneUp"
        },
        {
          "headline":"Consider upgrading your hardware.",
          "description":"If you haven't upgraded your computer in a while, a few upgrades can go a long way towards increasing game performance. :\nRAM - Most games released these days require 4 GB of RAM at minimum, with 8 GB being recommended in most cases. RAM is pretty cheap, and installing it is easier than you may think. See Install RAM for instructions. Video Card - One of the best ways to improve your video games' performance is by upgrading your video card. These can get a little expensive, but even a mid-range card can provide a significant performance boost if you haven't upgraded in a while. See Install a Graphics Card for instructions. CPU - Your CPU is less important to gaming than it used to be, but if you're running a really old computer you may want to upgrade to a quad-core processor. Upgrading your CPU is usually the most complex task when it comes to computer upgrades, because it usually necessitates a new motherboard (and RAM), which will also require reinstalling Windows. See Install a New Processor for instructions."
        }
      ]
    }
  ],
  "text":" Increasing FPS and Performance Make sure no other programs are running while you're playing. If you have programs like iTunes or a torrent program running in the background, they could be eating up precious system resources. Tip: Press Ctrl+⇧ Shift+Esc to open the task manager and view any programs that are currently running. Check your system tray for programs that may be running in the background. Update your graphics card drivers. Your graphics card drivers are the software that controls your graphics card and allows it to interface with games. Running outdated drivers can have a big impact on your performance, as drivers are often tweaked in later releases for specific games. Try to make sure you're always running the latest version of your drivers. You can download the latest drivers from the Nvidia, AMD, or Intel website (depending on who manufactured your graphics adapter). See Update Your Video Card Drivers on Windows 7 for detailed instructions. Lower your in-game settings. The best way to get a big performance boost from your games is by lowering the graphical settings. This may make the game look a little worse, but can lead to massive gains in frames per second (FPS), which will provide a much smoother experience. Look for some of the following settings in your game's Graphic Options menu for a big impact:\nResolution - Games will look best when they're running at your monitor's native resolution, but you can make a big FPS improvement by dropping the resolution down. The game will look blockier, but should instantly feel smoother. Changing your resolution can give you one of the biggest performance boosts you can get. For example, switching from 1920×1080 to 1600×900 will often give you about a 20% boost in FPS. Anti-aliasing (AA) - This is the technique that smooths out the pixelated edges on objects, making edges look more natural. There are lots of different AA options (MSAA, FSAA, etc. ), but for now you just need to know that most of them have a big performance cost. Try turning AA off completely and see how your game plays. If you're getting super-smooth performance and want to try some AA, try FXAA if available first, as this is the cheapest AA solution. Also, stick to 2X or 4X solutions. Texture Quality - If you're getting intermittent stuttering while playing (as opposed to a low frame rate), you may want to lower your texture quality. This is especially important when playing newer video games with older video cards. Shadow Quality - Detailed shadows can take a whole lot of processing power, so try dropping your shadow quality to get a major performance boost. V-Sync - This locks the vertical sync to your monitor’s refresh rate which may force the game to run at a lower frame rate. You can disable this setting for a potential speed boost, however it may introduce screen tearing. Run a version optimized for your hardware or drivers. A game may come with an alternative version of the game that is optimized for 32-bit or 64-bit CPU processors or may come with a version that is optimized for your graphics driver such as DirectX 11 or above. Run the different executables and note which one provides better performance. There are two major graphics card manufacturers on the market, Nvidia and AMD. You may run into a game that was designed around one particular graphics card. The developer may provide a patch that resolves issues with a graphics card brand that is known to cause performance issues. Check discussion forums and developer websites for more information. Disable integrated graphics card settings. Certain computer configurations such as laptops that feature both an integrated graphics card and a high-end graphics card may cause programs to run on the integrated graphics card that features lower specifications. Nvidia graphics card drivers come with the Nvidia Control Panel software that allows you to change programs from using the Integrated Graphics card to your dedicated Nvidia graphics card. To open the Control panel, right click on an empty space on your desktop and click on “NVIDIA Control Panel.” On the left hand side click on “Manage 3D Settings.” In the main window pane click on the “Global Settings” tab and set the drop down labeled “Preferred graphics processor” to “High-performance NVIDIA processor” then close the window. This will change the graphics card settings for all programs. Check under the game’s settings to see which video card is being used as the primary display driver. If you have more than one video card installed, changing this setting to your video card that features high performance may resolve the issue. You can set your BIOS to disable the integrated graphics card. Check with your computer’s user manual or manufacturer’s website for more details on how to disable the integrated graphics card. Search online for mods that increase performance. You may run across a game that is not optimized for your hardware or is known to have poor performance. Search online for unofficial mods or enhancements that provide higher performance. Read reviews and discussion forums before downloading to ensure how to properly install the mod. Read discussion forums. Social hubs such as a developer or publisher’s game discussion hubs, gaming websites, and game download services such as Steam or GOG provide an outlet for those who face issues with a particular game they are running. Asking for help while providing your system specifications can help you identify issues that you may be facing. There are also other discussion threads to look out for when browsing forums. Tip: Developers may post about known issues, server maintenance, workarounds and compatibility issues with configurations of your hardware, the operating system, or conflicts with other programs. Other users may be facing the same issue as you and can sometimes provide a similar solution. Perform virus and malware scans. If you have a virus infection, the virus may be taking up a lot of your system resources. Removing infections will not only increase your game performance, but they will also improve your computer's security. Most virus infections can be removed using a combination of your antivirus program, Malwarebytes Anti-Malware, and AdwCleaner, both of which are free. See Remove Malware for more detailed instructions. Reducing Ping Select game servers closer to you. Many games have the option to either browse through available servers or set your matchmaking region. Selecting a location close to you is the absolute most effective way to decrease your ping. The process for this will vary wildly depending on the game you are playing. Look for location filters in your server browser, locations in the server name or description (US-West, EU, etc. ), or region settings in the matchmaking menu. Not all multiplayer games allow you to select a region, and may automatically try to connect you to the closest server or player to you. Close any network-hogging programs on your computer. Before playing your online game, make sure any bandwidth-chugging programs are closed. Torrents, streaming music, and open browsers can all have a big impact on your in-game lag. Close these programs before starting your game. Look in the System Tray for programs that may be running in the background. Check if there are any other devices on your network taking bandwidth. If someone is streaming video in the other room, you'll likely take a big hit to your ping. Try to time your gaming to when others aren't using the network, or ask politely if they can do something else for a while. Connect your computer or game console to your router via Ethernet. If your computer or video game console is connected to your network wirelessly, you may experience worse performance in-game. If your network setup allows it, try to run an Ethernet cable from your computer's Ethernet port to an open LAN port on your router. Note: You may need to select the wired connection if you are already connected wirelessly. Reset your network hardware. If you're noticing worse lag than usual, resetting your network hardware may solve the problem. This will disable your network for a short while, so close your game first and make sure you're not interrupting anyone else:\nRemove the power cable from your modem and from your router, if you have a separate one. Let your network hardware rest unplugged for about 30 seconds. Plug your modem back in and wait for it to boot up. This could take a minute or two. Plug your router back in after the modem finishes turning on, if you have one. The router may take an additional minute or two to turn back on. Check for malware on your computer. If you have a virus or adware infection, background processes may be eating up a lot of your bandwidth and processing power. Make sure your antivirus program is up to date, and run scans with Malwarebytes Anti-Malware and AdwCleaner (both free) to find and remove most common infections. See Remove Malware for more detailed instructions. Enable QoS on your router (if possible). If you have a router that supports QoS (Quality of Service) controls, you can use them to prioritize gaming traffic on your network. The process for activating these controls vary depending on your router, and not all routers have this feature. Most QoS default settings will prioritize gaming and web browsing over other traffic. You may need to look up specific settings for your router. See Access a Router for instructions on accessing your router's configuration page. The QoS settings, if they are available, can usually be found in the \"Traffic\" section. Upgrade your router if you haven't in a while. If you're connected wirelessly and you haven't upgraded your router in a few years, you may be able to get a much more stable connection with a new router. See Choose a Wireless Router for some tips on finding the right router. Look for routers with QoS controls, which can help prioritize gaming traffic on your network. Check for available internet upgrades. This is a bit of an extreme step, but you may be able to find a good deal on a major speed upgrade. If you haven't checked prices in a while, you may find that you're paying the same amount as a faster package. Consider using a VPN service. Sometimes, your ISP may route your traffic through a variety of servers before it reaches its destination. This can lead to bad ping, even if you are physically close to the server. If this is the case, a VPN may help reduce your ping as there will be less hops between you and the gaming server. A VPN cannot make you magically closer to the server. If you're trying to connect to a server overseas, you still have to contend with the speed of light and a VPN won't make much of a difference. In many cases, a VPN will actually increase your ping, as it's another hop your traffic needs to go through. VPNs are only really useful if your ISP throttles your gaming traffic or routes it in an unusual way. See Connect to a VPN for instructions on finding and connecting to a VPN service. Optimizing Your Computer Hardware Consider overclocking your hardware. If you have the right hardware, you may be able to squeeze more power out of it by increasing the clock speed and voltage. This is referred to as \"overclocking,\" and is not without risk. Increasing the voltage too much can fry your equipment, but if you can get more power out of your hardware you can see significant performance boosts. Heavy overclocking will require more advanced cooling techniques. Not all hardware can be overclocked. See Overclock a Graphics Card for instructions on overclocking your video card. See Overclock a CPU for instructions on overclocking your CPU. Try a PC optimizer program. There are several programs available that are designed to boost performance while playing games. These optimizers will suspend non-essential background processes, defrag your game folders, and perform other optimizations. Your mileage may vary with these, especially if you've already taken the time to close background programs and regularly maintain your hard drive. Popular boosting programs include:\nRazer Cortex\nGame Gain\nCCleaner\nAVG PC TuneUp Consider upgrading your hardware. If you haven't upgraded your computer in a while, a few upgrades can go a long way towards increasing game performance. :\nRAM - Most games released these days require 4 GB of RAM at minimum, with 8 GB being recommended in most cases. RAM is pretty cheap, and installing it is easier than you may think. See Install RAM for instructions. Video Card - One of the best ways to improve your video games' performance is by upgrading your video card. These can get a little expensive, but even a mid-range card can provide a significant performance boost if you haven't upgraded in a while. See Install a Graphics Card for instructions. CPU - Your CPU is less important to gaming than it used to be, but if you're running a really old computer you may want to upgrade to a quad-core processor. Upgrading your CPU is usually the most complex task when it comes to computer upgrades, because it usually necessitates a new motherboard (and RAM), which will also require reinstalling Windows. See Install a New Processor for instructions.",
  "tyn_model":[
    "router",
    "graphics card",
    "vpn",
    "ram",
    "aa",
    "cpu",
    "video card",
    "antivirus program",
    "modem",
    "routers",
    "computer",
    "⇧ shift+esc",
    "graphics card drivers",
    "anti-aliasing",
    "“nvidia",
    "” on",
    "“manage",
    "” in",
    "“global",
    "” tab",
    "“preferred",
    "” to",
    "“high",
    "” then",
    "ethernet cable",
    "vpns"
  ],
  "tyn_section":[

  ]
}