{
  "title":"How to Prepare the Soil for Strawberries",
  "url":"https://www.wikihow.com/Prepare-the-Soil-for-Strawberries",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Compost Mulch and Soil Preparation"
  ],
  "parts":[
    {
      "name":"Tilling and Amending the Soil",
      "steps":[
        {
          "headline":"Choose a warm and sunny location to plant.",
          "description":"Strawberries need about 8 to 10 hours of sunlight each day. Find an area that gets full or partial sunlight, and that will be nice and warm for the growing plants."
        },
        {
          "headline":"Find an area that’s free of weeds.",
          "description":"These plants do not do well with competition. To give them the best chance, choose an area that doesn’t have a lot of weed growth. You can remove a few weeds by hand if necessary, but don’t choose a location that’s overrun with them. Strawberries can also be grown in raised garden beds if you prefer. When preparing a raised bed for strawberries (instead of the garden), the difference is that you only have to till the soil to the depth of the bed."
        },
        {
          "headline":"Loosen the soil with a hoe or tiller.",
          "description":"Strawberries like soft and loose soil, so it’s important to till the ground a couple of times before planting. With a hoe or tiller, go over the entire garden bed and dig the soil to a depth of 12 inches (30 cm) to loosen it up. Don’t worry if the soil still seems a little hard-packed, as you're going to till it again when you amend it with compost."
        },
        {
          "headline":"Work in some organic matter.",
          "description":"Strawberries love fertile, rich, and slightly acidic soil. The ideal pH for them is between 5.5 and 6.5. You can add nutrients and some acidity to the soil by working in organic matter. Spread about 4 inches (10 cm) of organic matter on top of the bed, and use the hoe or tiller to work it thoroughly into the soil. Good organic matter for strawberries includes mature compost, aged manure, and peat moss. To test the pH of your soil, use a soil test kit, which you can purchase at hardware and garden stores."
        },
        {
          "headline":"Amend the soil for drainage and moisture-retention.",
          "description":"Strawberries also need moist but well-draining soil. To achieve this, spread 2 inches (5.1 cm) of pearlite or vermiculite on top of the bed and work it into the soil with the hoe or tiller. Pearlite and vermiculite both retain water, so they allow water to drain through the soil while also keeping it moist."
        },
        {
          "headline":"Rake fertilizer into the soil.",
          "description":"Spread a thin layer of powdered fertilizer over the entire garden bed. Use a small handful (about ⅛ cup) of fertilizer per plant. Use a rake to spread out the fertilizer, work it into the top layer of soil, and even out the garden bed. The best fertilizer for strawberries is a balanced one that contains equal parts nitrogen, phosphorus, and potassium, such as a 5-5-5. You can also buy fertilizers that are specifically formulated for strawberries and other fruiting plants."
        }
      ]
    },
    {
      "name":"Preparing Soil for Container Strawberries",
      "steps":[
        {
          "headline":"Choose the right pot.",
          "description":"Growing strawberries in containers is possible, and success can depend on choosing the right pot. Most importantly, to choose a pot with drainage holes in the bottom. The pots should be 8 to 12 inches (20 to 30 cm) in diameter. Pots you can use for strawberries include:Terra cotta planters\nSpecial strawberry containers\nLight colored plastic pots (lighter colors will keep the roots cooler)\nWooden vegetable crates"
        },
        {
          "headline":"Fill the pot halfway with potting soil.",
          "description":"A multi-purpose potting soil is ideal for strawberries, as long as the pH is between 5.5 and 6.5. You can test this with a soil test kit. Don’t fill the pot more than halfway, or you won’t have room for the other ingredients."
        },
        {
          "headline":"Amend the soil with pearlite and compost.",
          "description":"Fill the pot the rest of the way with equal parts pearlite and compost, and use your hand or a spade to mix everything thoroughly. The compost will enrich the soil with nutrients, and the pearlite will help the soil to retain moisture without being soggy, which is ideal for strawberries.You can use vermiculite instead of pearlite. In place of compost, you can also use aged manure or peat moss."
        }
      ]
    },
    {
      "name":"Planting Strawberries",
      "steps":[
        {
          "headline":"Aim to plant in early spring.",
          "description":"Strawberries are typically planted in spring as soon as the ground has thawed enough to be worked. This ensures that the plants and roots are well-established come the following winter. In warmer climates with mild winters, you can plant the strawberries in the fall and grow them over the winter."
        },
        {
          "headline":"Dig shallow holes in double rows.",
          "description":"Space the holes 18 inches (46 cm) apart, and in rows that are 24 inches (61 cm) apart. The holes should be just deep and wide enough to accommodate the root ball."
        },
        {
          "headline":"Fan out the roots.",
          "description":"Right before planting, use your fingers to gently spread out the roots of each strawberry plant. When plants are grown in seed pots, the roots become compacted. Unless you fan them out, the roots may continue to grow in the same direction instead of spreading out."
        },
        {
          "headline":"Place the plants in the ground and cover them with soil.",
          "description":"Place one strawberry plant in each hole. Cover the plants with just enough soil to cover the roots. The crown of the plant should be level with the soil surface; otherwise, the plants may rot. The crown is the area where the roots and stems meet."
        },
        {
          "headline":"Water the plants immediately.",
          "description":"Apply a generous amount of water to the freshly planted strawberries to help settle the soil around the roots. Provide the plants with about 1 inch (2.5 cm) of water each week, and make sure the soil stays moist. During periods of drought, you'll have to provide the plants with the entire 1 inch (2.5 cm) of water. During wet periods when it’s raining daily or several times per week, don’t water the plants at all."
        },
        {
          "headline":"Weed the area by hand as necessary.",
          "description":"Inspect the garden bed regularly for weeds. Remove any weeds that you do find by pulling them up by hand. This is especially important in the first few months after planting, because strawberries don’t like competition."
        }
      ]
    }
  ],
  "text":" Tilling and Amending the Soil Choose a warm and sunny location to plant. Strawberries need about 8 to 10 hours of sunlight each day. Find an area that gets full or partial sunlight, and that will be nice and warm for the growing plants. Find an area that’s free of weeds. These plants do not do well with competition. To give them the best chance, choose an area that doesn’t have a lot of weed growth. You can remove a few weeds by hand if necessary, but don’t choose a location that’s overrun with them. Strawberries can also be grown in raised garden beds if you prefer. When preparing a raised bed for strawberries (instead of the garden), the difference is that you only have to till the soil to the depth of the bed. Loosen the soil with a hoe or tiller. Strawberries like soft and loose soil, so it’s important to till the ground a couple of times before planting. With a hoe or tiller, go over the entire garden bed and dig the soil to a depth of 12 inches (30 cm) to loosen it up. Don’t worry if the soil still seems a little hard-packed, as you're going to till it again when you amend it with compost. Work in some organic matter. Strawberries love fertile, rich, and slightly acidic soil. The ideal pH for them is between 5.5 and 6.5. You can add nutrients and some acidity to the soil by working in organic matter. Spread about 4 inches (10 cm) of organic matter on top of the bed, and use the hoe or tiller to work it thoroughly into the soil. Good organic matter for strawberries includes mature compost, aged manure, and peat moss. To test the pH of your soil, use a soil test kit, which you can purchase at hardware and garden stores. Amend the soil for drainage and moisture-retention. Strawberries also need moist but well-draining soil. To achieve this, spread 2 inches (5.1 cm) of pearlite or vermiculite on top of the bed and work it into the soil with the hoe or tiller. Pearlite and vermiculite both retain water, so they allow water to drain through the soil while also keeping it moist. Rake fertilizer into the soil. Spread a thin layer of powdered fertilizer over the entire garden bed. Use a small handful (about ⅛ cup) of fertilizer per plant. Use a rake to spread out the fertilizer, work it into the top layer of soil, and even out the garden bed. The best fertilizer for strawberries is a balanced one that contains equal parts nitrogen, phosphorus, and potassium, such as a 5-5-5. You can also buy fertilizers that are specifically formulated for strawberries and other fruiting plants. Preparing Soil for Container Strawberries Choose the right pot. Growing strawberries in containers is possible, and success can depend on choosing the right pot. Most importantly, to choose a pot with drainage holes in the bottom. The pots should be 8 to 12 inches (20 to 30 cm) in diameter. Pots you can use for strawberries include:Terra cotta planters\nSpecial strawberry containers\nLight colored plastic pots (lighter colors will keep the roots cooler)\nWooden vegetable crates Fill the pot halfway with potting soil. A multi-purpose potting soil is ideal for strawberries, as long as the pH is between 5.5 and 6.5. You can test this with a soil test kit. Don’t fill the pot more than halfway, or you won’t have room for the other ingredients. Amend the soil with pearlite and compost. Fill the pot the rest of the way with equal parts pearlite and compost, and use your hand or a spade to mix everything thoroughly. The compost will enrich the soil with nutrients, and the pearlite will help the soil to retain moisture without being soggy, which is ideal for strawberries.You can use vermiculite instead of pearlite. In place of compost, you can also use aged manure or peat moss. Planting Strawberries Aim to plant in early spring. Strawberries are typically planted in spring as soon as the ground has thawed enough to be worked. This ensures that the plants and roots are well-established come the following winter. In warmer climates with mild winters, you can plant the strawberries in the fall and grow them over the winter. Dig shallow holes in double rows. Space the holes 18 inches (46 cm) apart, and in rows that are 24 inches (61 cm) apart. The holes should be just deep and wide enough to accommodate the root ball. Fan out the roots. Right before planting, use your fingers to gently spread out the roots of each strawberry plant. When plants are grown in seed pots, the roots become compacted. Unless you fan them out, the roots may continue to grow in the same direction instead of spreading out. Place the plants in the ground and cover them with soil. Place one strawberry plant in each hole. Cover the plants with just enough soil to cover the roots. The crown of the plant should be level with the soil surface; otherwise, the plants may rot. The crown is the area where the roots and stems meet. Water the plants immediately. Apply a generous amount of water to the freshly planted strawberries to help settle the soil around the roots. Provide the plants with about 1 inch (2.5 cm) of water each week, and make sure the soil stays moist. During periods of drought, you'll have to provide the plants with the entire 1 inch (2.5 cm) of water. During wet periods when it’s raining daily or several times per week, don’t water the plants at all. Weed the area by hand as necessary. Inspect the garden bed regularly for weeds. Remove any weeds that you do find by pulling them up by hand. This is especially important in the first few months after planting, because strawberries don’t like competition.",
  "tyn_model":[
    "strawberries",
    "pearlite",
    "compost",
    "pot",
    "water",
    "hoe",
    "tiller",
    "organic matter",
    "fertilizer",
    "peat moss",
    "vermiculite",
    "pots",
    "strawberry",
    "soil",
    "soil test kit",
    "powdered fertilizer",
    "⅛ cup",
    "rake",
    "fertilizers",
    "containers",
    "terra cotta planters",
    "strawberry containers",
    "vegetable crates",
    "potting soil",
    "spade",
    "aged manure",
    "garden bed"
  ],
  "tyn_section":[

  ]
}