{
  "title":"How to Buy Fresh Herbs",
  "url":"https://www.wikihow.com/Buy-Fresh-Herbs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "methods":[
    {
      "name":"Buying Fresh Herbs",
      "steps":[
        {
          "headline":"Choose herbs that look and smell fresh.",
          "description":"Signs of fresh herbs include:\nThe freshest herbs should resemble a living plant. The leaves should be vividly and uniformly colored. Stems should be crisp. The herb should not sag if you hold it upright. Fresh herbs have a pleasant, robust fragrance. They smell appetizing."
        },
        {
          "headline":"Reject herbs that look or smell past their prime.",
          "description":"Things to be concerned about include:\nPlants that have a dry appearance. Shriveled leaves or leaves that are turning brown or yellow. Limp or wilting herbs. Symptoms of decay, including the presence of slime or mold. Avoid any herb that has a foul aroma. Damaged stems and leaves. Herbs become less flavorful when oils exit via these imperfections. Herbs with faint or no fragrance."
        }
      ]
    },
    {
      "name":"Storing Your Purchase",
      "steps":[
        {
          "headline":"Keep live, potted herb plants on the kitchen counter.",
          "description":"The plants will survive for 10 to 20 days in your kitchen. Water the plants every other day. If you want live, potted plants to last longer, transplant them outdoors in your garden."
        },
        {
          "headline":"Keep store-bought plastic boxes of herbs in the refrigerator.",
          "description":"They will last for 7 to 10 days, depending on the herb variety."
        },
        {
          "headline":"Store bunched herbs in the refrigerator.",
          "description":"They'll keep for about 7 to 10 days, depending on the herb type. Snip about 1/2 inch (1.25 cm) off the ends of the stems. Stand the stems in a water-filled glass. Only the stem ends should be submerged, not the leafy part. Keep the glass refrigerated. Change the water each day. If you don't have room to store your herbs in a glass of water, wrap the trimmed herbs in a moist paper towel and keep them inside a plastic bag in the refrigerator."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Buying Fresh Herbs Choose herbs that look and smell fresh. Signs of fresh herbs include:\nThe freshest herbs should resemble a living plant. The leaves should be vividly and uniformly colored. Stems should be crisp. The herb should not sag if you hold it upright. Fresh herbs have a pleasant, robust fragrance. They smell appetizing. Reject herbs that look or smell past their prime. Things to be concerned about include:\nPlants that have a dry appearance. Shriveled leaves or leaves that are turning brown or yellow. Limp or wilting herbs. Symptoms of decay, including the presence of slime or mold. Avoid any herb that has a foul aroma. Damaged stems and leaves. Herbs become less flavorful when oils exit via these imperfections. Herbs with faint or no fragrance. Storing Your Purchase Keep live, potted herb plants on the kitchen counter. The plants will survive for 10 to 20 days in your kitchen. Water the plants every other day. If you want live, potted plants to last longer, transplant them outdoors in your garden. Keep store-bought plastic boxes of herbs in the refrigerator. They will last for 7 to 10 days, depending on the herb variety. Store bunched herbs in the refrigerator. They'll keep for about 7 to 10 days, depending on the herb type. Snip about 1/2 inch (1.25 cm) off the ends of the stems. Stand the stems in a water-filled glass. Only the stem ends should be submerged, not the leafy part. Keep the glass refrigerated. Change the water each day. If you don't have room to store your herbs in a glass of water, wrap the trimmed herbs in a moist paper towel and keep them inside a plastic bag in the refrigerator. Finished. ",
  "tyn_model":[
    "herbs",
    "water",
    "refrigerator",
    "herb",
    "glass"
  ],
  "tyn_section":[

  ]
}