{
  "title":"How to Simmer",
  "url":"https://www.wikihow.com/Simmer",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "methods":[
    {
      "name":"Identifying the Stages of Simmering",
      "steps":[
        {
          "headline":"Read the recipe closely.",
          "description":"In most cases, a recipe will suggest one of two ways to do it. It may ask you to bring the liquid of a dish to a simmer, which means to slowly bring the liquid to just below boiling point over low heat. The other common direction is to bring the liquid of a dish to the boiling point first, and then reduce it to a simmer. The two techniques yield different results, so it’s important to practice them properly. To simmer means to bring a liquid to a temperature that is just below the boiling point – somewhere between 185°F (85°C) and 205°F (96°C)."
        },
        {
          "headline":"Set the heat to medium-low for a gradual simmer.",
          "description":"Place the dish you're cooking on the burner and start off at a medium to low heat. Stay near the stovetop, since you will probably need to adjust the heat up or down as the liquid is brought up to a simmer. It’s a good rule of thumb to never turn your back on a simmer in progress until you’re sure you’ve reached a point of constant simmering. Experiment with a pot of water if you want to practice first. Try out different heat settings to get a feel for how the cooking liquid appears at different temperatures."
        },
        {
          "headline":"Observe the amount of bubbles rising to the surface.",
          "description":"You know something is simmering when there are pockets of tiny, continuous bubbles breaking the surface with irregular wisps of steam. Simmering is most commonly used to allow the flavors of a dish to infuse and to slow-cook meats until they are tender. A “slow simmer” is when a couple of tiny bubbles erupt every 1 or 2 seconds. A slow simmer is most often used to slow-cook stocks. A “rapid simmer” happens when larger pockets of small, continuous bubbles erupt at the surface, displaying wisps of steam, with larger bubbles beginning to show. A rapid simmer is sometimes referred to as a gentle boil; it's mostly used to thicken liquid into sauce."
        },
        {
          "headline":"Test for a temperature between 185°F (85°C) and 205°F (96°C) .",
          "description":"If you have a cooking thermometer, you can always test the liquid to find out if you’ve achieved a simmer. Most people don’t use a thermometer – they gauge by observation. You'll get more experienced at this as you go along. Temperatures between 185°F (85°C) and 205°F (96°C) are considered simmering. The range is relatively high because there are different levels of simmering, starting with a slow simmer and going up to a rapid simmer."
        },
        {
          "headline":"Regulate the heat to maintain a constant simmer.",
          "description":"Once you've reached the simmering point, you will need to adjust the heat between medium-low and low to maintain a constant simmer. Slightly adjust the heat up or down as needed. Once you’ve achieved a steady simmer, you will still need to stir the liquid occasionally. Whenever you introduce new ingredients to simmering liquid, the heat will definitely need to be adjusted. Some liquids and sauces require more frequent stirring than others. Check your recipe for details. Stay at your stove to supervise during this initial stage until you get a feel for how often it needs to be stirred."
        }
      ]
    },
    {
      "name":"Simmering and Reducing a Sauce",
      "steps":[
        {
          "headline":"Follow the recipe instructions to start the sauce.",
          "description":"Many recipes will ask you to make the sauce’s foundation and then simmer it for a certain amount of time. This will “reduce” the sauce. Essentially, this means to thicken the sauce’s consistency. When you reduce a sauce, the ingredients develop through a period of simmering into a thicker, richer, more flavorful substance. The longer you simmer the sauce, the thicker it will become and the more it will “reduce.”\nThe most commonly reduced sauces are tomato sauce, Béchamel sauce, balsamic reduction sauce, red wine reduction sauce and most sauces that begin with meat drippings. White sauces typically aren't reduced."
        },
        {
          "headline":"Reduce the heat to low.",
          "description":"Once you’ve created the foundation of your sauce, reduce the heat to low to bring it down to a simmer. You’ve reached a “simmer” when you see tiny, continuous bubbles breaking the surface of the sauce. You’ll also see irregular wisps of steam rise up from the sauce. As you’re bringing your sauce down to a simmer, stir it frequently. It’s best to stay with the sauce at least until a steady simmer is achieved. Avoid turning your back to do something else at this stage. Keep an eye on the sauce."
        },
        {
          "headline":"Regulate the heat and stir occasionally.",
          "description":"You may need to adjust the heat between medium-low and low to maintain simmering for an extended period of time. Once you’ve achieved a steady simmer, you can leave the sauce alone for longer periods of time without too much worry. You do need to return to the sauce to stir it occasionally. Regulating the heat properly and frequent stirring helps to prevent a sauce form getting burned. Keep a close eye on this. If it does burn and you don't notice, you'll end up stirring charred bits from the bottom of the pan into your sauce. Avoid scraping anything against the bottom of the pan if you've burned the sauce. Some sauces need more frequent stirring than others, so stay with your sauce for a while until you get a feel for how much stirring is required. Regulate the heat as needed to maintain the simmer."
        },
        {
          "headline":"Simmer the sauce until the desired consistency is acquired.",
          "description":"Some recipes will give you specific directions how long something needs to simmer. Others will tell you to simmer until you’ve reached the thickness you want. Many sauces can be simmered for hours, gradually growing thicker and more flavorful over time. Italian tomato sauce is a great example of a sauce that can be simmered over a period of hours to “reduce” it. The longer the sauce is simmered, the thicker and more “reduced” it becomes. The flavors become infused and rich. As long as you stir your sauce occasionally and maintain a steady simmer by regulating the temperature, your reduction will go smoothly."
        }
      ]
    },
    {
      "name":"Simmering Meats",
      "steps":[
        {
          "headline":"Spread vegetable oil all over the meat.",
          "description":"Instead of coating the skillet with vegetable oil, coat the pieces of meat with it. You will actually end up using less oil that way, so it’s a more heart-healthy approach. The meat will brown better, as well. In general, the ideal cuts of meat for this are tough and inexpensive. When simmered over time, they become tender. This approach works best for red meats like beef and lamb. If you’re working from a recipe, make sure to reference those directions frequently."
        },
        {
          "headline":"Brown the meat in a skillet over medium high-heat.",
          "description":"A cast-iron skillet is the best choice for this. Place the oil-coated pieces of meat into a medium-sized skillet over medium-high heat. Instead of putting all the meat in at once, brown the pieces in small batches. Use a utensil to move the meat around frequently so that it browns evenly. Remove each batch after browning. Put the browned meat on a clean plate and set it to the side."
        },
        {
          "headline":"Pour the liquid in the skillet and bring it to a boil.",
          "description":"After browning all of the meat and removing it from the skillet, pour in your cooking liquid. Depending on that you’re cooking, this will be some kind of stock or possibly wine. The heat should remain at a medium-high level until the liquid has reached a rolling boil. You know it’s boiling when bubbles are vigorously breaking on the surface and the liquid is moving and churning in the skillet."
        },
        {
          "headline":"Reduce the heat to low to bring it to a simmer.",
          "description":"Once you’ve reached the boiling point, lower the heat to bring the liquid down to a simmer. You’ll know it’s simmering when you see pockets of tiny, continuous bubbles breaking the surface, along with irregular wisps of steam. The liquid should be at the simmering point before you add the meat back to the skillet. Adding the meat to a simmering liquid will help it be as tender as possible."
        },
        {
          "headline":"Put the browned meat back into the skillet.",
          "description":"Once you’ve reached the simmer point, carefully add the pieces of meat back into the skillet. Regulate the heat as necessary and stir occasionally. You’ll probably need to adjust the heat between medium-low and low to maintain simmering. These basic guidelines are universal to get the simmer process started for most meats. The simmer time depends on the type of meat and what you’re making."
        }
      ]
    }
  ],
  "text":" Identifying the Stages of Simmering Read the recipe closely. In most cases, a recipe will suggest one of two ways to do it. It may ask you to bring the liquid of a dish to a simmer, which means to slowly bring the liquid to just below boiling point over low heat. The other common direction is to bring the liquid of a dish to the boiling point first, and then reduce it to a simmer. The two techniques yield different results, so it’s important to practice them properly. To simmer means to bring a liquid to a temperature that is just below the boiling point – somewhere between 185°F (85°C) and 205°F (96°C). Set the heat to medium-low for a gradual simmer. Place the dish you're cooking on the burner and start off at a medium to low heat. Stay near the stovetop, since you will probably need to adjust the heat up or down as the liquid is brought up to a simmer. It’s a good rule of thumb to never turn your back on a simmer in progress until you’re sure you’ve reached a point of constant simmering. Experiment with a pot of water if you want to practice first. Try out different heat settings to get a feel for how the cooking liquid appears at different temperatures. Observe the amount of bubbles rising to the surface. You know something is simmering when there are pockets of tiny, continuous bubbles breaking the surface with irregular wisps of steam. Simmering is most commonly used to allow the flavors of a dish to infuse and to slow-cook meats until they are tender. A “slow simmer” is when a couple of tiny bubbles erupt every 1 or 2 seconds. A slow simmer is most often used to slow-cook stocks. A “rapid simmer” happens when larger pockets of small, continuous bubbles erupt at the surface, displaying wisps of steam, with larger bubbles beginning to show. A rapid simmer is sometimes referred to as a gentle boil; it's mostly used to thicken liquid into sauce. Test for a temperature between 185°F (85°C) and 205°F (96°C) . If you have a cooking thermometer, you can always test the liquid to find out if you’ve achieved a simmer. Most people don’t use a thermometer – they gauge by observation. You'll get more experienced at this as you go along. Temperatures between 185°F (85°C) and 205°F (96°C) are considered simmering. The range is relatively high because there are different levels of simmering, starting with a slow simmer and going up to a rapid simmer. Regulate the heat to maintain a constant simmer. Once you've reached the simmering point, you will need to adjust the heat between medium-low and low to maintain a constant simmer. Slightly adjust the heat up or down as needed. Once you’ve achieved a steady simmer, you will still need to stir the liquid occasionally. Whenever you introduce new ingredients to simmering liquid, the heat will definitely need to be adjusted. Some liquids and sauces require more frequent stirring than others. Check your recipe for details. Stay at your stove to supervise during this initial stage until you get a feel for how often it needs to be stirred. Simmering and Reducing a Sauce Follow the recipe instructions to start the sauce. Many recipes will ask you to make the sauce’s foundation and then simmer it for a certain amount of time. This will “reduce” the sauce. Essentially, this means to thicken the sauce’s consistency. When you reduce a sauce, the ingredients develop through a period of simmering into a thicker, richer, more flavorful substance. The longer you simmer the sauce, the thicker it will become and the more it will “reduce.”\nThe most commonly reduced sauces are tomato sauce, Béchamel sauce, balsamic reduction sauce, red wine reduction sauce and most sauces that begin with meat drippings. White sauces typically aren't reduced. Reduce the heat to low. Once you’ve created the foundation of your sauce, reduce the heat to low to bring it down to a simmer. You’ve reached a “simmer” when you see tiny, continuous bubbles breaking the surface of the sauce. You’ll also see irregular wisps of steam rise up from the sauce. As you’re bringing your sauce down to a simmer, stir it frequently. It’s best to stay with the sauce at least until a steady simmer is achieved. Avoid turning your back to do something else at this stage. Keep an eye on the sauce. Regulate the heat and stir occasionally. You may need to adjust the heat between medium-low and low to maintain simmering for an extended period of time. Once you’ve achieved a steady simmer, you can leave the sauce alone for longer periods of time without too much worry. You do need to return to the sauce to stir it occasionally. Regulating the heat properly and frequent stirring helps to prevent a sauce form getting burned. Keep a close eye on this. If it does burn and you don't notice, you'll end up stirring charred bits from the bottom of the pan into your sauce. Avoid scraping anything against the bottom of the pan if you've burned the sauce. Some sauces need more frequent stirring than others, so stay with your sauce for a while until you get a feel for how much stirring is required. Regulate the heat as needed to maintain the simmer. Simmer the sauce until the desired consistency is acquired. Some recipes will give you specific directions how long something needs to simmer. Others will tell you to simmer until you’ve reached the thickness you want. Many sauces can be simmered for hours, gradually growing thicker and more flavorful over time. Italian tomato sauce is a great example of a sauce that can be simmered over a period of hours to “reduce” it. The longer the sauce is simmered, the thicker and more “reduced” it becomes. The flavors become infused and rich. As long as you stir your sauce occasionally and maintain a steady simmer by regulating the temperature, your reduction will go smoothly. Simmering Meats Spread vegetable oil all over the meat. Instead of coating the skillet with vegetable oil, coat the pieces of meat with it. You will actually end up using less oil that way, so it’s a more heart-healthy approach. The meat will brown better, as well. In general, the ideal cuts of meat for this are tough and inexpensive. When simmered over time, they become tender. This approach works best for red meats like beef and lamb. If you’re working from a recipe, make sure to reference those directions frequently. Brown the meat in a skillet over medium high-heat. A cast-iron skillet is the best choice for this. Place the oil-coated pieces of meat into a medium-sized skillet over medium-high heat. Instead of putting all the meat in at once, brown the pieces in small batches. Use a utensil to move the meat around frequently so that it browns evenly. Remove each batch after browning. Put the browned meat on a clean plate and set it to the side. Pour the liquid in the skillet and bring it to a boil. After browning all of the meat and removing it from the skillet, pour in your cooking liquid. Depending on that you’re cooking, this will be some kind of stock or possibly wine. The heat should remain at a medium-high level until the liquid has reached a rolling boil. You know it’s boiling when bubbles are vigorously breaking on the surface and the liquid is moving and churning in the skillet. Reduce the heat to low to bring it to a simmer. Once you’ve reached the boiling point, lower the heat to bring the liquid down to a simmer. You’ll know it’s simmering when you see pockets of tiny, continuous bubbles breaking the surface, along with irregular wisps of steam. The liquid should be at the simmering point before you add the meat back to the skillet. Adding the meat to a simmering liquid will help it be as tender as possible. Put the browned meat back into the skillet. Once you’ve reached the simmer point, carefully add the pieces of meat back into the skillet. Regulate the heat as necessary and stir occasionally. You’ll probably need to adjust the heat between medium-low and low to maintain simmering. These basic guidelines are universal to get the simmer process started for most meats. The simmer time depends on the type of meat and what you’re making.",
  "tyn_model":[
    "skillet",
    "sauce",
    "dish",
    "sauces",
    "“reduce",
    "pan",
    "” it",
    "vegetable oil",
    "– somewhere",
    "burner",
    "stovetop",
    "pot",
    "water",
    "simmering",
    "“slow",
    "” is",
    "“rapid",
    "” happens",
    "cooking thermometer",
    "thermometer",
    "– they",
    "stove",
    "” the",
    "”\n",
    "tomato sauce",
    "béchamel sauce",
    "balsamic reduction sauce",
    "red wine reduction sauce",
    "“simmer",
    "” when",
    "“reduced",
    "oil",
    "cast-iron skillet",
    "utensil",
    "plate",
    "stock",
    "wine",
    "meats"
  ],
  "tyn_section":[

  ]
}