{
  "title":"How to Make Coffee on a Stove",
  "url":"https://www.wikihow.com/Make-Coffee-on-a-Stove",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee",
    "Stove Coffee"
  ],
  "methods":[
    {
      "name":"Making “Cowboy Coffee” on Your Home Range",
      "steps":[
        {
          "headline":"Heat water on your stovetop.",
          "description":"A small pot or tea kettle will work fine. Add 8-10 ounces (one cup or a little more) of water per mug of coffee you desire. Bring the water just to boiling -- bubbling regularly but not vigorously."
        },
        {
          "headline":"Add 1-2 heaping tablespoons (depending on taste) of ground coffee per 8 oz.",
          "description":"of water. Stir just enough to help the coffee grounds circulate. Use a standard drip coffee grind. Try 2 tablespoons per mug at first. It is easier to weaken coffee that is too strong by diluting it than it is to strengthen coffee that is too weak. You can use instant coffee if desired. You will add 1-2 teaspoons per mug instead (refer to package directions)."
        },
        {
          "headline":"Remove the mixture from the heat and cover.",
          "description":"Let it rest for 2-3 minutes. Some people prefer to bring the mixture back up to a boil briefly, or even for up to 2 minutes. This will increase the bitterness of your brew, so know your taste in coffee before deciding."
        },
        {
          "headline":"Stir the coffee and let it sit, covered, for 2-3 more minutes.",
          "description":"This wait not only steeps the coffee in the water (longer wait = stronger coffee), it also allows the coffee grounds to settle on the bottom of the pot. Splashing a little cold water into the pot at the end may help the grounds settle at the bottom. Flicking drops off your wet fingertips should suffice for a single mug size brew."
        },
        {
          "headline":"Pour the coffee into your mug(s) -- carefully.",
          "description":"Pour slowly not only because the coffee is still quite hot, but because you want to leave most of the grounds -- now more like a brown sludge -- in the pot. Leave the last bit of the brew in the pot to trap most of the sludge there. If you have a tea strainer or similar filter, you can place it over your mug to help keep out even more of the sludge and rogue grounds."
        }
      ]
    },
    {
      "name":"Using a Moka Pot for “Stovetop Espresso”",
      "steps":[
        {
          "headline":"Understand how a moka pot works.",
          "description":"It is an Italian-designed metal vessel that disassembles into three parts, and uses steam pressure to brew coffee. Check Step 1 here for a good diagram and the following description of a moka pot:\nThey have three chambers, one for water, one for grounds and one for the finished product. The bottom chamber is for the water. It usually has a pressure valve as well. The middle chamber is for your finely ground coffee. Pack it in lightly. The top chamber is the collection point for the brewed espresso / coffee."
        },
        {
          "headline":"Preheat enough water for the bottom moka pot chamber in a separate kettle or pot.",
          "description":"When the water boils, remove it from the heat source. This step is not required but is recommended to prevent the metal moka pot from overheating and imparting a metallic taste."
        },
        {
          "headline":"Fill the bottom chamber of the moka pot with the water, almost to the valve ring.",
          "description":"There may be a guide line inside the chamber. Insert the filter basket."
        },
        {
          "headline":"Fill the basket with coffee, leveling the coffee off with your fingers.",
          "description":"Make sure there are no loose coffee grounds on the top edge of the filter basket that might hinder the seal. Use standard drip grind coffee -- roughly table salt consistency."
        },
        {
          "headline":"Screw the top and bottom of the moka pot together.",
          "description":"Make sure they are securely sealed, but do not tighten so much that you won't be able to get them back apart. Be careful so as to not spill the ground coffee into the water or either into the top chamber. Keep each in its own place for now."
        },
        {
          "headline":"Place the moka pot on the stove over moderate heat, leaving the top lid open.",
          "description":"When steam begins to form, the coffee will start to percolate up into the top chamber. You will hear a puffing sound as the steam emerges. The coffee will emerge as a rich brown stream which will lighten over time. Wait for the stream to reach the color of yellow honey, then remove the pot from the heat. Do not leave the pot on too long or you will scorch the coffee -- and that is not a taste most people enjoy."
        },
        {
          "headline":"Wrap the pot with a cold dish towel or run it under cold tap water.",
          "description":"Again, this is not absolutely necessary, but is recommended to prevent the coffee from acquiring a metallic taste."
        },
        {
          "headline":"Pour your finished brew into cups or a carafe.",
          "description":"If this semi-espresso is too strong for your liking, you can dilute it with water."
        }
      ]
    },
    {
      "name":"Making Turkish (or Greek) Coffee at Home",
      "steps":[
        {
          "headline":"Gather your materials.",
          "description":"A regular old pot and drip grind coffee will not do for this method. You'll need an ibrik (variously known as a cezve, briki, mbiki or toorka, among other names), a small metal pot (traditionally made of brass) which is thinner at the neck than base and usually has a long handle. You'll also need water and sugar (or, though less traditional, a sugar substitute), of course. This method requires Turkish grind coffee, which is as fine a grind as you are likely to encounter. Specialty shops, coffee roasters, Middle Eastern shops, and some mainstream retailers may have this grind. Also look at the grinding machine found in your grocery store's coffee aisle -- many of them actually have a Turkish grind setting. If grinding your own beans, make the grind as fine as you can."
        },
        {
          "headline":"Add sugar to the ibrik.",
          "description":"This is optional but traditional. Add to taste, but 2 teaspoons for an 8 ounce ibrik is probably a good reference point. You can substitute an artificial sweetener (such as aspartame) for the sugar as well."
        },
        {
          "headline":"Fill the ibrik with water until it reaches the neck.",
          "description":"Do not overfill -- leave some room in the neck for frothing or you will end up with a giant mess on your stove. If you want to make less coffee, you need a smaller ibrik. It needs to be filled to the lower neck to brew properly. A typical small ibrik is about 8 ounces, enough for two 3 oz. demitasse cups."
        },
        {
          "headline":"Add coffee to the water, but do not stir the coffee at this time.",
          "description":"Allow the coffee grounds to float on the top of the water. These floating grounds act as a barrier between the water and air, facilitating the frothing process. Depending on how strong you like your coffee, use one to two rounded teaspoons of coffee per demitasse serving, or roughly three rounded teaspoons (or one rounded tablespoon) for an 8 oz. ibrik."
        },
        {
          "headline":"Heat the ibrik on the stove.",
          "description":"Some people recommend using a low setting, but medium to high heat will also work. You'll just have to pay even closer attention to prevent a messy boil-over. The coffee will foam. Foaming is not the same as boiling. Do not let it boil, and really do not let it boil over unless you love vigorously scrubbing a scorched stovetop."
        },
        {
          "headline":"Remove it from the heat when the foaming reaches the top of the ibrik.",
          "description":"Let it settle back down, then -- finally -- you can stir it. Traditionally this process is repeated up to three more times. Put the ibrik back on the heat, wait for it to froth up to the top of the neck, then let it settle down and stir."
        },
        {
          "headline":"Pour the coffee into demitasse cups.",
          "description":"Let it rest for 1-2 minutes before drinking to let the grounds settle. When pouring, leave the last bit of coffee in the ibrik to trap some of the “sludge.”  Likewise, when drinking, leave the last bit in your cup. Turkish coffee is traditionally served with a glass of water as a palate cleanser."
        }
      ]
    }
  ],
  "text":" Making “Cowboy Coffee” on Your Home Range Heat water on your stovetop. A small pot or tea kettle will work fine. Add 8-10 ounces (one cup or a little more) of water per mug of coffee you desire. Bring the water just to boiling -- bubbling regularly but not vigorously. Add 1-2 heaping tablespoons (depending on taste) of ground coffee per 8 oz. of water. Stir just enough to help the coffee grounds circulate. Use a standard drip coffee grind. Try 2 tablespoons per mug at first. It is easier to weaken coffee that is too strong by diluting it than it is to strengthen coffee that is too weak. You can use instant coffee if desired. You will add 1-2 teaspoons per mug instead (refer to package directions). Remove the mixture from the heat and cover. Let it rest for 2-3 minutes. Some people prefer to bring the mixture back up to a boil briefly, or even for up to 2 minutes. This will increase the bitterness of your brew, so know your taste in coffee before deciding. Stir the coffee and let it sit, covered, for 2-3 more minutes. This wait not only steeps the coffee in the water (longer wait = stronger coffee), it also allows the coffee grounds to settle on the bottom of the pot. Splashing a little cold water into the pot at the end may help the grounds settle at the bottom. Flicking drops off your wet fingertips should suffice for a single mug size brew. Pour the coffee into your mug(s) -- carefully. Pour slowly not only because the coffee is still quite hot, but because you want to leave most of the grounds -- now more like a brown sludge -- in the pot. Leave the last bit of the brew in the pot to trap most of the sludge there. If you have a tea strainer or similar filter, you can place it over your mug to help keep out even more of the sludge and rogue grounds. Using a Moka Pot for “Stovetop Espresso” Understand how a moka pot works. It is an Italian-designed metal vessel that disassembles into three parts, and uses steam pressure to brew coffee. Check Step 1 here for a good diagram and the following description of a moka pot:\nThey have three chambers, one for water, one for grounds and one for the finished product. The bottom chamber is for the water. It usually has a pressure valve as well. The middle chamber is for your finely ground coffee. Pack it in lightly. The top chamber is the collection point for the brewed espresso / coffee. Preheat enough water for the bottom moka pot chamber in a separate kettle or pot. When the water boils, remove it from the heat source. This step is not required but is recommended to prevent the metal moka pot from overheating and imparting a metallic taste. Fill the bottom chamber of the moka pot with the water, almost to the valve ring. There may be a guide line inside the chamber. Insert the filter basket. Fill the basket with coffee, leveling the coffee off with your fingers. Make sure there are no loose coffee grounds on the top edge of the filter basket that might hinder the seal. Use standard drip grind coffee -- roughly table salt consistency. Screw the top and bottom of the moka pot together. Make sure they are securely sealed, but do not tighten so much that you won't be able to get them back apart. Be careful so as to not spill the ground coffee into the water or either into the top chamber. Keep each in its own place for now. Place the moka pot on the stove over moderate heat, leaving the top lid open. When steam begins to form, the coffee will start to percolate up into the top chamber. You will hear a puffing sound as the steam emerges. The coffee will emerge as a rich brown stream which will lighten over time. Wait for the stream to reach the color of yellow honey, then remove the pot from the heat. Do not leave the pot on too long or you will scorch the coffee -- and that is not a taste most people enjoy. Wrap the pot with a cold dish towel or run it under cold tap water. Again, this is not absolutely necessary, but is recommended to prevent the coffee from acquiring a metallic taste. Pour your finished brew into cups or a carafe. If this semi-espresso is too strong for your liking, you can dilute it with water. Making Turkish (or Greek) Coffee at Home Gather your materials. A regular old pot and drip grind coffee will not do for this method. You'll need an ibrik (variously known as a cezve, briki, mbiki or toorka, among other names), a small metal pot (traditionally made of brass) which is thinner at the neck than base and usually has a long handle. You'll also need water and sugar (or, though less traditional, a sugar substitute), of course. This method requires Turkish grind coffee, which is as fine a grind as you are likely to encounter. Specialty shops, coffee roasters, Middle Eastern shops, and some mainstream retailers may have this grind. Also look at the grinding machine found in your grocery store's coffee aisle -- many of them actually have a Turkish grind setting. If grinding your own beans, make the grind as fine as you can. Add sugar to the ibrik. This is optional but traditional. Add to taste, but 2 teaspoons for an 8 ounce ibrik is probably a good reference point. You can substitute an artificial sweetener (such as aspartame) for the sugar as well. Fill the ibrik with water until it reaches the neck. Do not overfill -- leave some room in the neck for frothing or you will end up with a giant mess on your stove. If you want to make less coffee, you need a smaller ibrik. It needs to be filled to the lower neck to brew properly. A typical small ibrik is about 8 ounces, enough for two 3 oz. demitasse cups. Add coffee to the water, but do not stir the coffee at this time. Allow the coffee grounds to float on the top of the water. These floating grounds act as a barrier between the water and air, facilitating the frothing process. Depending on how strong you like your coffee, use one to two rounded teaspoons of coffee per demitasse serving, or roughly three rounded teaspoons (or one rounded tablespoon) for an 8 oz. ibrik. Heat the ibrik on the stove. Some people recommend using a low setting, but medium to high heat will also work. You'll just have to pay even closer attention to prevent a messy boil-over. The coffee will foam. Foaming is not the same as boiling. Do not let it boil, and really do not let it boil over unless you love vigorously scrubbing a scorched stovetop. Remove it from the heat when the foaming reaches the top of the ibrik. Let it settle back down, then -- finally -- you can stir it. Traditionally this process is repeated up to three more times. Put the ibrik back on the heat, wait for it to froth up to the top of the neck, then let it settle down and stir. Pour the coffee into demitasse cups. Let it rest for 1-2 minutes before drinking to let the grounds settle. When pouring, leave the last bit of coffee in the ibrik to trap some of the “sludge.”  Likewise, when drinking, leave the last bit in your cup. Turkish coffee is traditionally served with a glass of water as a palate cleanser.",
  "tyn_model":[
    "water",
    "coffee",
    "moka pot",
    "pot",
    "sugar",
    "stove",
    "filter basket",
    "“cowboy",
    "” on",
    "tea kettle",
    "cold water",
    "tea strainer",
    "“stovetop",
    "” understand",
    "coffee grounds",
    "table salt",
    "coffee roasters",
    "ibrik",
    "stovetop",
    "demitasse cups",
    "“sludge",
    "”  "
  ],
  "tyn_section":[

  ]
}