{
  "title":"How to Buy a Strawberry Plant",
  "url":"https://www.wikihow.com/Buy-a-Strawberry-Plant",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Fruit"
  ],
  "methods":[
    {
      "name":"Choosing a Variety",
      "steps":[
        {
          "headline":"Purchase June-bearing varieties for the largest strawberries.",
          "description":"June-bearing strawberry plants are the most common varieties because they bear large, healthy fruit over a period of two to three weeks. Typically, June-bearing strawberries produce one crop per season. June-bearing strawberries are further classified into early, middle, and later-bearing varieties. To extend your harvest, plant one of each plant so they bear fruit at different times. June-bearing strawberries are best to plant in the late springtime, at least a week after the last frost. They respond well to organic, low-nitrogen fertilizers. June-bearing varieties prefer warm temperatures, so apply a 6-8 inch (15-20 cm) layer of mulch over the plant through the wintertime. Popular June-bearing varieties include: Earliglow, Honeoye, Seneca, Jewel, and Kent."
        },
        {
          "headline":"Buy everbearing strawberry varieties for two harvests per year.",
          "description":"Everbearing strawberry plants usually produce one harvest in the spring and one in the late summer or early fall. In ideal everbearing climates (60°F to 80°F, or 15.56 °C to 26.66°C), everbearing plants can produce three harvests. Everbearing varieties thrive best in warmer climates where temperatures do not drop as frequently. Popular everbearing varieties include: Alexandria, Fraises des Bois, Weisse Solemacher, Rügen, and Muricata."
        },
        {
          "headline":"Choose day-neutral strawberry plants for a good first yield.",
          "description":"June-bearing and everbearing varieties will take several years to reach their fullest harvest, but day-neutral plants produce good berries from their first year onward. Their berries, however, are usually smaller than other varieties. Day-neutral strawberry plants can be grown as annual or perennial plants. Annual have a life cycle of one harvesting season, while perennial plants regrow every spring. Day-neutral strawberries grow well when planted in late spring, and they enjoy cooler temperatures than other varieties. Popular day-neutral varieties include: Tristar, Albion, Tribute, Evie-2, and Seascape."
        },
        {
          "headline":"Decide on a strawberry plant based on your climate.",
          "description":"There are hundreds of strawberry varieties for you to choose from within the June-bearing, everbearing, and day-neutral branches. Pick a variety that will adapt best to your climate. A higher harvest will be achieved if your strawberry plant grows in the right temperature, soil composition, and weather pattern. You can find information about a specific variety's climate, ideal temperature or weather pattern, and preferred soil composition in gardening magazines, plant nurseries, or online."
        }
      ]
    },
    {
      "name":"Checking for Plant Health",
      "steps":[
        {
          "headline":"If the plant has blossomed, check for flourishing flowers.",
          "description":"Blossom blight is one of the more common fungi affecting strawberry plants. You can identify blossom blight as a gray mold covering the blossoms and flower stalks. Blossom blight spreads by touching another plant infected by the fungus, so one sick plant can poison your garden. Inspect the blossoms on your strawberry plant before purchasing, and avoid any sickly gray flowers."
        },
        {
          "headline":"Look for plants with unblemished, light-to-dark green leaves.",
          "description":"Unhealthy strawberry plants will have dull, short leaves because of stunted growth. Avoid buying plants with yellowing leaves or browning around the edges, which indicates that your plant did not receive enough water or nutrients while growing."
        },
        {
          "headline":"Be on the lookout for spotting.",
          "description":"If a strawberry plant is infected with fungus via spores or other infected plants, it will develop spotting on the leaves and stem. Spotting will look like tan, gray, or white spots. Once a plant is severely infected, very little can be done to reverse damage. Do not buy a plant with mild or moderate spotting. The fungus that causes spotting prefers hot, wet climates, so be on the lookout if you live in a humid environment."
        },
        {
          "headline":"Examine the plant for common strawberry pests.",
          "description":"Beetles, slugs, fruit flies, and weevils are all common strawberry plant pests. If the strawberry plant you choose at the nursery has plant pests, you can still purchase it. Just remember to remove these insects before you plant it in your garden to avoid adding more pests to your garden. Because so many pests have been reported on strawberry plants, purchase garden-safe insect spray at the nursery when you purchase your plants."
        },
        {
          "headline":"Avoid purchasing mildewed strawberry plants.",
          "description":"Strawberry plants, especially those raised in dark and moist spaces, are at-risk for powdery mildew development. Mildew spreads quickly and can easily ruin an entire garden. Check potential plants for a powdery growth covering the leaves and pepper-like black spots on the plant's underside."
        }
      ]
    },
    {
      "name":"Visiting Nurseries",
      "steps":[
        {
          "headline":"Buy at a home center nursery for basic varieties.",
          "description":"Large-scale retailers will have common strawberry plants like Honeoye, Earliglow, and Allstar. Your choices will be slimmer and the plants may not be as cared for. Most of the strawberry plants large home centers carry will be June-bearing varieties, so if you're interested in everbearing or day-neutral plants, you might check a smaller store. Large retailers will usually be the cheapest option and ideal if you're buying in bulk."
        },
        {
          "headline":"Check a locally-owned garden center for more varieties.",
          "description":"Small-scale nurseries will have a deeper, broader selection. Plants are usually cared for by experts and receive more attention than varieties at retailers. Usually specialty garden centers organize their wares by growing conditions, allowing you to choose a variety ideal for your garden."
        },
        {
          "headline":"Purchase from an online nursery as an alternative.",
          "description":"Online (or mail order) nurseries are usually a good source for fresh, seasonal plants. Make sure you carefully read the online catalog details before you purchase a plant variety. Because you cannot inspect the plant in-person, you'll want to research the online nursery to make sure they're a reputable source. If you're looking for a rare strawberry plant, an online nursery will likely be the cheapest option. Most online or mail-order plants are dormant when they're shipped, so you won't know if they are healthy until their growing season arrives."
        },
        {
          "headline":"Order one plant for every one or two quarts of berries you want.",
          "description":"This estimate assumes that each plant will survive to maturity, so if you have a specific minimum berry yield you want, buy a few extra plants just to make sure. As the plants mature, they will gradually yield more berries each season."
        }
      ]
    }
  ],
  "text":" Choosing a Variety Purchase June-bearing varieties for the largest strawberries. June-bearing strawberry plants are the most common varieties because they bear large, healthy fruit over a period of two to three weeks. Typically, June-bearing strawberries produce one crop per season. June-bearing strawberries are further classified into early, middle, and later-bearing varieties. To extend your harvest, plant one of each plant so they bear fruit at different times. June-bearing strawberries are best to plant in the late springtime, at least a week after the last frost. They respond well to organic, low-nitrogen fertilizers. June-bearing varieties prefer warm temperatures, so apply a 6-8 inch (15-20 cm) layer of mulch over the plant through the wintertime. Popular June-bearing varieties include: Earliglow, Honeoye, Seneca, Jewel, and Kent. Buy everbearing strawberry varieties for two harvests per year. Everbearing strawberry plants usually produce one harvest in the spring and one in the late summer or early fall. In ideal everbearing climates (60°F to 80°F, or 15.56 °C to 26.66°C), everbearing plants can produce three harvests. Everbearing varieties thrive best in warmer climates where temperatures do not drop as frequently. Popular everbearing varieties include: Alexandria, Fraises des Bois, Weisse Solemacher, Rügen, and Muricata. Choose day-neutral strawberry plants for a good first yield. June-bearing and everbearing varieties will take several years to reach their fullest harvest, but day-neutral plants produce good berries from their first year onward. Their berries, however, are usually smaller than other varieties. Day-neutral strawberry plants can be grown as annual or perennial plants. Annual have a life cycle of one harvesting season, while perennial plants regrow every spring. Day-neutral strawberries grow well when planted in late spring, and they enjoy cooler temperatures than other varieties. Popular day-neutral varieties include: Tristar, Albion, Tribute, Evie-2, and Seascape. Decide on a strawberry plant based on your climate. There are hundreds of strawberry varieties for you to choose from within the June-bearing, everbearing, and day-neutral branches. Pick a variety that will adapt best to your climate. A higher harvest will be achieved if your strawberry plant grows in the right temperature, soil composition, and weather pattern. You can find information about a specific variety's climate, ideal temperature or weather pattern, and preferred soil composition in gardening magazines, plant nurseries, or online. Checking for Plant Health If the plant has blossomed, check for flourishing flowers. Blossom blight is one of the more common fungi affecting strawberry plants. You can identify blossom blight as a gray mold covering the blossoms and flower stalks. Blossom blight spreads by touching another plant infected by the fungus, so one sick plant can poison your garden. Inspect the blossoms on your strawberry plant before purchasing, and avoid any sickly gray flowers. Look for plants with unblemished, light-to-dark green leaves. Unhealthy strawberry plants will have dull, short leaves because of stunted growth. Avoid buying plants with yellowing leaves or browning around the edges, which indicates that your plant did not receive enough water or nutrients while growing. Be on the lookout for spotting. If a strawberry plant is infected with fungus via spores or other infected plants, it will develop spotting on the leaves and stem. Spotting will look like tan, gray, or white spots. Once a plant is severely infected, very little can be done to reverse damage. Do not buy a plant with mild or moderate spotting. The fungus that causes spotting prefers hot, wet climates, so be on the lookout if you live in a humid environment. Examine the plant for common strawberry pests. Beetles, slugs, fruit flies, and weevils are all common strawberry plant pests. If the strawberry plant you choose at the nursery has plant pests, you can still purchase it. Just remember to remove these insects before you plant it in your garden to avoid adding more pests to your garden. Because so many pests have been reported on strawberry plants, purchase garden-safe insect spray at the nursery when you purchase your plants. Avoid purchasing mildewed strawberry plants. Strawberry plants, especially those raised in dark and moist spaces, are at-risk for powdery mildew development. Mildew spreads quickly and can easily ruin an entire garden. Check potential plants for a powdery growth covering the leaves and pepper-like black spots on the plant's underside. Visiting Nurseries Buy at a home center nursery for basic varieties. Large-scale retailers will have common strawberry plants like Honeoye, Earliglow, and Allstar. Your choices will be slimmer and the plants may not be as cared for. Most of the strawberry plants large home centers carry will be June-bearing varieties, so if you're interested in everbearing or day-neutral plants, you might check a smaller store. Large retailers will usually be the cheapest option and ideal if you're buying in bulk. Check a locally-owned garden center for more varieties. Small-scale nurseries will have a deeper, broader selection. Plants are usually cared for by experts and receive more attention than varieties at retailers. Usually specialty garden centers organize their wares by growing conditions, allowing you to choose a variety ideal for your garden. Purchase from an online nursery as an alternative. Online (or mail order) nurseries are usually a good source for fresh, seasonal plants. Make sure you carefully read the online catalog details before you purchase a plant variety. Because you cannot inspect the plant in-person, you'll want to research the online nursery to make sure they're a reputable source. If you're looking for a rare strawberry plant, an online nursery will likely be the cheapest option. Most online or mail-order plants are dormant when they're shipped, so you won't know if they are healthy until their growing season arrives. Order one plant for every one or two quarts of berries you want. This estimate assumes that each plant will survive to maturity, so if you have a specific minimum berry yield you want, buy a few extra plants just to make sure. As the plants mature, they will gradually yield more berries each season.",
  "tyn_model":[
    "strawberry",
    "strawberries",
    "berries",
    "plants",
    "mulch",
    "jewel",
    "kent",
    "alexandria",
    "day-neutral varieties",
    "blossom blight",
    "fungus",
    "fruit flies",
    "weevils",
    "garden-safe insect spray",
    "strawberry plants",
    "garden center",
    "garden centers"
  ],
  "tyn_section":[

  ]
}