{
  "title":"How to Draw Foghorn Leghorn",
  "url":"https://www.wikihow.com/Draw-Foghorn-Leghorn",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "steps":[
    {
      "headline":"Draw a large oval.",
      "description":"It should look like an egg (appropriately so, since old Foghorn Leghorn is a rooster) and will serve as the body. Draw guidelines inside of your oval. These will be useful for later steps."
    },
    {
      "headline":"Add a cylinder.",
      "description":"The cylinder should be wide at the bottom and narrow at the top; it will be the basis for the head and neck."
    },
    {
      "headline":"Draw a semicircle as a basis for the beak, and rectangles for the arms.",
      "description":"Add one large oval for the left hand and a few smaller ovals for the fingers. Draw a few simple lines in the bottom of the biggest oval, as a draft for the legs."
    },
    {
      "headline":"Inside the biggest oval, draw two ovals for the chest.",
      "description":"Add a few ovals on the top of the cylinder and at the very bottom of the drawing."
    },
    {
      "headline":"Connect the ovals and add a few more details for the eyes.",
      "description":"Add a topknot and feathers for the rooster's tail. Erase rough lines you don't need anymore."
    },
    {
      "headline":"Connect the parts of Foghorn's body, and add some of the smaller details.",
      "description":"Outline the image and erase the guidelines."
    },
    {
      "headline":"Color in the drawing, and he's done!",
      "description":"You can follow the guidelines here or do something completely different--the coloring choices are all yours."
    }
  ],
  "text":" Draw a large oval. It should look like an egg (appropriately so, since old Foghorn Leghorn is a rooster) and will serve as the body. Draw guidelines inside of your oval. These will be useful for later steps. Add a cylinder. The cylinder should be wide at the bottom and narrow at the top; it will be the basis for the head and neck. Draw a semicircle as a basis for the beak, and rectangles for the arms. Add one large oval for the left hand and a few smaller ovals for the fingers. Draw a few simple lines in the bottom of the biggest oval, as a draft for the legs. Inside the biggest oval, draw two ovals for the chest. Add a few ovals on the top of the cylinder and at the very bottom of the drawing. Connect the ovals and add a few more details for the eyes. Add a topknot and feathers for the rooster's tail. Erase rough lines you don't need anymore. Connect the parts of Foghorn's body, and add some of the smaller details. Outline the image and erase the guidelines. Color in the drawing, and he's done! You can follow the guidelines here or do something completely different--the coloring choices are all yours.",
  "tyn_model":[
    "foghorn leghorn",
    "topknot",
    "feathers",
    "rooster",
    "foghorn"
  ],
  "tyn_section":[

  ]
}