{
  "title":"How to Make a Melon, Avocado and Prawn Salad",
  "url":"https://www.wikihow.com/Make-a-Melon,-Avocado-and-Prawn-Salad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Salads",
    "Seafood and Fish Salads"
  ],
  "steps":[
    {
      "headline":"Finely chop the shallot for the dressing.",
      "description":""
    },
    {
      "headline":"Put it in a bowl and add olive oil, cider, vinegar and sugar.",
      "description":""
    },
    {
      "headline":"Stir well and add ground pepper.",
      "description":""
    },
    {
      "headline":"Put it aside.",
      "description":""
    },
    {
      "headline":"Strip coriander leaves for garnish.",
      "description":""
    },
    {
      "headline":"Cut rockmelon in small bits and throw seeds away.",
      "description":""
    },
    {
      "headline":"Remove skin and cut the flesh into narrow slices.",
      "description":""
    },
    {
      "headline":"Halve the avocados and slice them into cubes.",
      "description":""
    },
    {
      "headline":"Trim salad leaves and mix them with the dressing.",
      "description":""
    },
    {
      "headline":"Peel the shell of the prawns and dip them in flour.",
      "description":""
    },
    {
      "headline":"Start frying the prawns in low flame with a bit of butter.",
      "description":""
    },
    {
      "headline":"Mix the prawns together with the salad and you're ready to serve.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Finely chop the shallot for the dressing.  Put it in a bowl and add olive oil, cider, vinegar and sugar.  Stir well and add ground pepper.  Put it aside.  Strip coriander leaves for garnish.  Cut rockmelon in small bits and throw seeds away.  Remove skin and cut the flesh into narrow slices.  Halve the avocados and slice them into cubes.  Trim salad leaves and mix them with the dressing.  Peel the shell of the prawns and dip them in flour.  Start frying the prawns in low flame with a bit of butter.  Mix the prawns together with the salad and you're ready to serve.  Finished. ",
  "tyn_model":[
    "shallot",
    "bowl",
    "olive oil",
    "cider",
    "vinegar",
    "sugar",
    "ground pepper",
    "coriander",
    "rockmelon",
    "avocados",
    "salad leaves",
    "flour",
    "butter",
    "salad"
  ],
  "tyn_section":[

  ]
}