{
  "title":"How to Blacken Chicken",
  "url":"https://www.wikihow.com/Blacken-Chicken",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "steps":[
    {
      "headline":"Preheat the cast iron skillet on top of the stove over high heat.",
      "description":""
    },
    {
      "headline":"Mix the paprika, chili powder, garlic powder, onion powder, salt, pepper, cayenne and sugar in a medium bowl.",
      "description":""
    },
    {
      "headline":"Rinse the chicken breasts with water and pat them dry with paper towels.",
      "description":""
    },
    {
      "headline":"Pound the chicken with a meat tenderizer until they are 1/2 inch (1.77 cm) thick.",
      "description":""
    },
    {
      "headline":"Coat the chicken breasts in the melted butter.",
      "description":""
    },
    {
      "headline":"Place the chicken into the spice rub and coat both sides well.",
      "description":""
    },
    {
      "headline":"Put the chicken breasts into the cast iron skillet.",
      "description":"The sizzle will be loud and it should start smoking. Turn on the stove fan or open a window to help ventilate the smoke."
    },
    {
      "headline":"Cook the chicken for 2 to 3 minutes on one side, turn the chicken breasts over and cook for another 2 to 3 minutes.",
      "description":""
    },
    {
      "headline":"Check the blackened chicken with a meat thermometer to be sure it is done.",
      "description":"The internal temperature should read 165 degrees Fahrenheit (74 degrees Celsius)."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat the cast iron skillet on top of the stove over high heat.  Mix the paprika, chili powder, garlic powder, onion powder, salt, pepper, cayenne and sugar in a medium bowl.  Rinse the chicken breasts with water and pat them dry with paper towels.  Pound the chicken with a meat tenderizer until they are 1/2 inch (1.77 cm) thick.  Coat the chicken breasts in the melted butter.  Place the chicken into the spice rub and coat both sides well.  Put the chicken breasts into the cast iron skillet. The sizzle will be loud and it should start smoking. Turn on the stove fan or open a window to help ventilate the smoke. Cook the chicken for 2 to 3 minutes on one side, turn the chicken breasts over and cook for another 2 to 3 minutes.  Check the blackened chicken with a meat thermometer to be sure it is done. The internal temperature should read 165 degrees Fahrenheit (74 degrees Celsius). Finished. ",
  "tyn_model":[
    "cast iron skillet",
    "chicken breasts",
    "chicken",
    "stove",
    "paprika",
    "chili powder",
    "garlic powder",
    "onion powder",
    "salt",
    "pepper",
    "cayenne",
    "sugar",
    "medium bowl",
    "water",
    "paper towels",
    "meat tenderizer",
    "butter",
    "spice rub",
    "stove fan",
    "meat thermometer"
  ],
  "tyn_section":[

  ]
}