{
  "title":"How to Soften Butter Quickly",
  "url":"https://www.wikihow.com/Soften-Butter-Quickly",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Butter and Ghee"
  ],
  "methods":[
    {
      "name":"Cut Up the Butter",
      "steps":[
        {
          "headline":"Cut a stick of butter into smaller, 1-inch (2.50cm) chunks.",
          "description":""
        },
        {
          "headline":"Let the chunks of butter sit on a plate for about 15 to 20 minutes.",
          "description":"Since the butter is in smaller pieces, it has more surface area and will warm up more quickly."
        }
      ]
    },
    {
      "name":"Flatten the Butter",
      "steps":[
        {
          "headline":"Place the uncut stick of butter into a zip-top or sandwich bag.",
          "description":"Or you can put the butter in between 2 pieces of waxed paper."
        },
        {
          "headline":"Lay the butter on your work surface.",
          "description":"Use a rolling pin to roll over the butter in the bag or waxed paper to flatten it."
        },
        {
          "headline":"Roll the butter out to about 1/4-inch (.60cm) thick.",
          "description":"If you roll it too thinly, it will get very soft and almost melt. Use a meat hammer to flatten and soften the butter if you do not have a rolling pin."
        },
        {
          "headline":"Let the butter rest for about 3 minutes after rolling to come up to room temperature.",
          "description":""
        }
      ]
    },
    {
      "name":"Heat the Butter",
      "steps":[
        {
          "headline":"Fill the bottom saucepan on a double boiler 2/3 of the way full with water.",
          "description":"Set the pan on the stove, and heat it until the water is 190°F (90°C)."
        },
        {
          "headline":"Take the saucepan off of the heat.",
          "description":""
        },
        {
          "headline":"Set the butter in the top portion of the double boiler, and place it on top of the bottom saucepan.",
          "description":"Keep an eye on the butter. The heat from the water will soften it, but it can also cause the butter to melt if you let it sit too long."
        },
        {
          "headline":"Let the butter sit on the double boiler just until softened, and then remove.",
          "description":"Heat the water in a glass mixing bowl in the microwave if you do not have a double boiler. Place the butter in a mixing bowl that's slightly larger, and set it on top of the water-filled bowl to soften."
        }
      ]
    },
    {
      "name":"Microwave the Butter",
      "steps":[
        {
          "headline":"Set the butter in the microwave.",
          "description":"Remove the wrapper if it is made of metal."
        },
        {
          "headline":"Set the microwave to defrost mode or 30-percent power.",
          "description":"Heat the butter inside the microwave for 5 seconds."
        },
        {
          "headline":"Open the door of the microwave.",
          "description":"Touch the butter to test it for softness. If the butter is still hard, rotate it, then microwave it for another 5 seconds."
        },
        {
          "headline":"Continue microwaving the butter for 5 second intervals, and remove it from the microwave when it is soft.",
          "description":"Be careful not to let the butter melt."
        }
      ]
    }
  ],
  "text":" Cut Up the Butter Cut a stick of butter into smaller, 1-inch (2.50cm) chunks.  Let the chunks of butter sit on a plate for about 15 to 20 minutes. Since the butter is in smaller pieces, it has more surface area and will warm up more quickly. Flatten the Butter Place the uncut stick of butter into a zip-top or sandwich bag. Or you can put the butter in between 2 pieces of waxed paper. Lay the butter on your work surface. Use a rolling pin to roll over the butter in the bag or waxed paper to flatten it. Roll the butter out to about 1/4-inch (.60cm) thick. If you roll it too thinly, it will get very soft and almost melt. Use a meat hammer to flatten and soften the butter if you do not have a rolling pin. Let the butter rest for about 3 minutes after rolling to come up to room temperature.  Heat the Butter Fill the bottom saucepan on a double boiler 2/3 of the way full with water. Set the pan on the stove, and heat it until the water is 190°F (90°C). Take the saucepan off of the heat.  Set the butter in the top portion of the double boiler, and place it on top of the bottom saucepan. Keep an eye on the butter. The heat from the water will soften it, but it can also cause the butter to melt if you let it sit too long. Let the butter sit on the double boiler just until softened, and then remove. Heat the water in a glass mixing bowl in the microwave if you do not have a double boiler. Place the butter in a mixing bowl that's slightly larger, and set it on top of the water-filled bowl to soften. Microwave the Butter Set the butter in the microwave. Remove the wrapper if it is made of metal. Set the microwave to defrost mode or 30-percent power. Heat the butter inside the microwave for 5 seconds. Open the door of the microwave. Touch the butter to test it for softness. If the butter is still hard, rotate it, then microwave it for another 5 seconds. Continue microwaving the butter for 5 second intervals, and remove it from the microwave when it is soft. Be careful not to let the butter melt.",
  "tyn_model":[
    "butter",
    "microwave",
    "double boiler",
    "water",
    "saucepan",
    "waxed paper",
    "rolling pin",
    "plate",
    "zip-top or sandwich bag",
    "meat hammer",
    "stove",
    "glass mixing bowl",
    "mixing bowl"
  ],
  "tyn_section":[

  ]
}