{
  "title":"How to Make a Foreign Exchange Student Feel Welcome",
  "url":"https://www.wikihow.com/Make-a-Foreign-Exchange-Student-Feel-Welcome",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "House Guests"
  ],
  "methods":[
    {
      "name":"Treat your Exchange Student as a Member of your Family",
      "steps":[
        {
          "headline":"Show your student around the house, pointing out important things, such as the bathroom, their bedroom and the kitchen.",
          "description":"Help your student feel at home by pointing out where the snacks are located so that if they are hungry, they know where the food is. Find some foods that would probably have have at home. Cook food that is native to them."
        },
        {
          "headline":"Explain the rules of the house.",
          "description":"To welcome an exchange student, describe your expectations and set boundaries. If there is a language barrier, try using sign language or pictures to communicate with your student. Set a curfew. Treat your foreign exchange student like your own child. Include your exchange student in the household chores. If your own children are expected to complete chores, then your exchange student should complete them as well."
        },
        {
          "headline":"Ask your foreign exchange student if they have a favorite food or meal.",
          "description":"Providing them with food they are familiar with will help them feel welcome. If you don't know how to prepare the item, ask them if they will help you cook it."
        },
        {
          "headline":"Help your student feel at home by letting them use the Internet or satellite television.",
          "description":"Allow your student time to contact their family on the computer. This may help them feel at home. If you have satellite television, let them watch a program they are familiar with. Your student may miss hearing their own language, and watching a show in their language may help the student feel at home."
        },
        {
          "headline":"Include your student in family activities.",
          "description":"Welcome an exchange student by taking them to your favorite restaurant, or sharing a favorite hobby, such as hiking, with them."
        }
      ]
    },
    {
      "name":"Ask your Foreign Exchange Student Questions About Their Culture",
      "steps":[
        {
          "headline":"Find out if your student brought pictures of their family.",
          "description":"Even if you don't speak their language, you can use sign language to let them know you are interested in seeing pictures of their mom, dad and siblings."
        },
        {
          "headline":"Ask your student what the weather is like where they are from.",
          "description":"Welcome an exchange student by showing an interest in them. This may also help you learn more about their culture."
        },
        {
          "headline":"Find out if your foreign exchange student has religious preferences.",
          "description":"You can help a student feel at home by allowing them to practice their religion in your home, or making arrangements for them to attend a church or temple of their choice."
        }
      ]
    },
    {
      "name":"Help your Student Learn your Language",
      "steps":[
        {
          "headline":"Provide your foreign exchange student with children's books in your language.",
          "description":"Sit with your student, point to a picture in the book, and then say the word. Show them the matching written word so they can learn how to write in your language as well. Ask them how they say that word in their language. They are not at your house to teach you their language, but showing an interest may help your student feel at home."
        },
        {
          "headline":"Teach your student simple words and phrases, such as \"Mom,\" \"Dad,\" \"hello,\" \"goodbye,\" and \"my name is.\"",
          "description":""
        },
        {
          "headline":"Point out objects when you are with your foreign exchange student and say the word for that object.",
          "description":"Teach them the names of colors, shapes, numbers and the alphabet."
        }
      ]
    }
  ],
  "text":" Treat your Exchange Student as a Member of your Family Show your student around the house, pointing out important things, such as the bathroom, their bedroom and the kitchen. Help your student feel at home by pointing out where the snacks are located so that if they are hungry, they know where the food is. Find some foods that would probably have have at home. Cook food that is native to them. Explain the rules of the house. To welcome an exchange student, describe your expectations and set boundaries. If there is a language barrier, try using sign language or pictures to communicate with your student. Set a curfew. Treat your foreign exchange student like your own child. Include your exchange student in the household chores. If your own children are expected to complete chores, then your exchange student should complete them as well. Ask your foreign exchange student if they have a favorite food or meal. Providing them with food they are familiar with will help them feel welcome. If you don't know how to prepare the item, ask them if they will help you cook it. Help your student feel at home by letting them use the Internet or satellite television. Allow your student time to contact their family on the computer. This may help them feel at home. If you have satellite television, let them watch a program they are familiar with. Your student may miss hearing their own language, and watching a show in their language may help the student feel at home. Include your student in family activities. Welcome an exchange student by taking them to your favorite restaurant, or sharing a favorite hobby, such as hiking, with them. Ask your Foreign Exchange Student Questions About Their Culture Find out if your student brought pictures of their family. Even if you don't speak their language, you can use sign language to let them know you are interested in seeing pictures of their mom, dad and siblings. Ask your student what the weather is like where they are from. Welcome an exchange student by showing an interest in them. This may also help you learn more about their culture. Find out if your foreign exchange student has religious preferences. You can help a student feel at home by allowing them to practice their religion in your home, or making arrangements for them to attend a church or temple of their choice. Help your Student Learn your Language Provide your foreign exchange student with children's books in your language. Sit with your student, point to a picture in the book, and then say the word. Show them the matching written word so they can learn how to write in your language as well. Ask them how they say that word in their language. They are not at your house to teach you their language, but showing an interest may help your student feel at home. Teach your student simple words and phrases, such as \"Mom,\" \"Dad,\" \"hello,\" \"goodbye,\" and \"my name is.\"  Point out objects when you are with your foreign exchange student and say the word for that object. Teach them the names of colors, shapes, numbers and the alphabet.",
  "tyn_model":[
    "television",
    "children's books"
  ],
  "tyn_section":[

  ]
}