{
  "title":"How to Start an Organic Garden",
  "url":"https://www.wikihow.com/Start-an-Organic-Garden",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "parts":[
    {
      "name":"Creating Your Garden Site",
      "steps":[
        {
          "headline":"Get started early.",
          "description":"Get a jump on your gardening effort at any time of year by choosing a site for the garden, buying containers for a container garden, planting seedlings, building garden boxes, and making compost for your garden."
        },
        {
          "headline":"Choose a small site for your organic garden.",
          "description":"Think small, especially at first. Find a spot in your yard that gets at least 6 hours of sun a day. A well-maintained 4 ft × 4 ft (1.2 m × 1.2 m) garden can furnish all of the fresh vegetables that one person will eat. Even a window box or a few containers can be a starter garden."
        },
        {
          "headline":"Think about using your lawn as a garden.",
          "description":"A pristine lawn is a lot of work and, depending on your climate, may require a lot of fertilizer and water to keep green. It's also a mono-culture that is difficult to maintain. At the very least, consider letting clover and other plants in, and don't panic if a few weeds spring up. Consider planting something besides lawn or making your lawn smaller, especially in arid climates."
        },
        {
          "headline":"Consider a container garden.",
          "description":"Try growing in pots, boxes, or buckets on a patio. Even growing herbs in one of your south-facing windows to garnish your favorite dishes and soups is great fun. Even if you don’t have a sunny backyard or patio, you may be able to grow parsley, mints, garlic/green onions, chives, or even small tomatoes this way. 5 US gal (19 l) buckets can be easily converted to gardening containers by adding a layer of pebbles to the bottom and drilling 3 or 4 ⁄2 in (13 mm) holes on the bottom for drainage."
        }
      ]
    },
    {
      "name":"Making Organic Soil",
      "steps":[
        {
          "headline":"Make a compost pile.",
          "description":"Compost is the main ingredient for developing rich organic soil. You can use almost any kind of organic material to make compost that will enrich your soil, but the best things to start with are usually right there in your garden:\nFallen leaves\nWeeds (preferably before they go to seed)\nGrass clippings\nOld fruit and vegetable trimmings\nDon't use anything containing oil, fat, meat, grease, feces, dairy, or wood chips."
        },
        {
          "headline":"Test the pH of your soil.",
          "description":"Test the pH of your soil by buying pH test strips from a garden store. Stir a handful of soil with lukewarm distilled water until it's the consistency of a milkshake, then dip the pH test strip in. Hold it there for 20-30 seconds, then compare the strip to the test kit's key. The pH (acidity versus alkalinity) of your soil should be somewhere between 5.5 to 7.0 for plants to thrive. If your soil is too acidic (below 5.5), buy dolomite or quick lime to add to the soil, then retest. If your soil is too alkaline (above 7.0), add more organic matter, like peat moss or compost, then test the soil again."
        },
        {
          "headline":"Measure your soil's drainage.",
          "description":"Dig a hole in your garden or container 1 ft × 1 ft (0.30 m × 0.30 m) wide. Fill the hole with water and wait 24 hours. Then, fill the hole with water again and measure how fast the water drops with a tape measure. The ideal rate is 2 in (5.1 cm) per hour. Adding a few cups of compost or peat moss will help soil that drains too fast and soil that drains too slow. For a less scientific test, moisten your soil and grab a handful of it. The soil should hold together, but fall apart when you poke it with a finger. If your soil holds its shape or falls apart without a poke, add more organic matter (compost or peat moss) to improve its drainage."
        },
        {
          "headline":"Add organic soil from your compost heap.",
          "description":"The key to organic agriculture is great soil. Add as much organic material to your soil as you can, preferably from your compost heap. Soil that has been built up with plenty of organic matter is good for your garden for a lot of reasons:\nIt will nourish your plants without chemical fertilizers. It is easier to get shovels into—and weeds out of—enriched soil that isn't packed hard. It is softer, so plant roots can penetrate more easily and deeply. It will help water and air spend the right amount of time in contact with roots. Clay soils can be heavy and will stay wet for a long time. Sandy soils can drain water too quickly. Compost mitigates both conditions."
        }
      ]
    },
    {
      "name":"Planting and Maintaining Your Garden",
      "steps":[
        {
          "headline":"Choose plants for your organic garden.",
          "description":"Think about what you like to eat and how often you want to eat it. Plants like tomatoes, peppers, and squash will keep producing all year long, while vegetables like carrots and corn will only produce once. Buy seedlings from a garden store or farmer's market. Be sure to buy seedlings that haven't bloomed yet, and make sure to ask if they've been treated with chemicals. To be a true organic garden, your plants should be completely free of chemical fertilizers and pesticides."
        },
        {
          "headline":"Plant your seedlings in full sun after the last frost.",
          "description":"Plant seedlings into your organic, compost-rich soil and set them in areas where they'll receive full sun: at least 6 hours a day. Plant thickly to prevent weed growth. Companion plantings can fill in spaces in vegetable gardens, too, and will help you make the most of a small space. Spaces that are planted thickly enough will discourage weeds from growing between plants that you want."
        },
        {
          "headline":"Mulch areas around plants 2 in (5.1 cm) deep.",
          "description":"Organic mulches, including bark, wood chips, and grass clippings, gradually break down and enrich the soil. In the meantime, they control weeds, help to moderate soil temperatures, and slow evaporation, meaning that you can water less."
        },
        {
          "headline":"Water your garden in the morning.",
          "description":"Water in the morning, when the temperature is cool and there's less risk of evaporation, which will deprive your plants of water. Watering in the evening isn't ideal, as it keeps your plants wet overnight and encourages mildew. It's still preferable to watering in the middle of the day, though."
        },
        {
          "headline":"Weed your garden every few weeks.",
          "description":"Regularly taking off the green portions of weeds will deprive them of the nourishment they need to continue growing. Weeds are any plant you don't want growing in an area, and may include invasive ornamental or productive plants, such as ivy and mint. Use a hoe and keep it sharp. Try a Dutch hoe or scuffle hoe instead of a conventional gooseneck style hoe. Hoe each area frequently enough to keep green weeds down. Hand weed to remove the roots of perennial weeds that grow back. Also hand weed carefully around established plants, to avoid uprooting the plants you want. Try heat to control weeds in cracks, in the form of steam, a heat gun, boiling water, or even a small blowtorch, carefully applied."
        },
        {
          "headline":"Attract helpful creatures by adding seeds, compost, or flowers.",
          "description":"Many creatures can help your garden. Arrange the conditions of your garden to encourage them by:\nPutting out seed for birds\nAdding compost to your soil to attract worms\nPlanting alyssum, sunflowers, lemon balm, and parsley to invite beneficial insects"
        }
      ]
    }
  ],
  "text":" Creating Your Garden Site Get started early. Get a jump on your gardening effort at any time of year by choosing a site for the garden, buying containers for a container garden, planting seedlings, building garden boxes, and making compost for your garden. Choose a small site for your organic garden. Think small, especially at first. Find a spot in your yard that gets at least 6 hours of sun a day. A well-maintained 4 ft × 4 ft (1.2 m × 1.2 m) garden can furnish all of the fresh vegetables that one person will eat. Even a window box or a few containers can be a starter garden. Think about using your lawn as a garden. A pristine lawn is a lot of work and, depending on your climate, may require a lot of fertilizer and water to keep green. It's also a mono-culture that is difficult to maintain. At the very least, consider letting clover and other plants in, and don't panic if a few weeds spring up. Consider planting something besides lawn or making your lawn smaller, especially in arid climates. Consider a container garden. Try growing in pots, boxes, or buckets on a patio. Even growing herbs in one of your south-facing windows to garnish your favorite dishes and soups is great fun. Even if you don’t have a sunny backyard or patio, you may be able to grow parsley, mints, garlic/green onions, chives, or even small tomatoes this way. 5 US gal (19 l) buckets can be easily converted to gardening containers by adding a layer of pebbles to the bottom and drilling 3 or 4 ⁄2 in (13 mm) holes on the bottom for drainage. Making Organic Soil Make a compost pile. Compost is the main ingredient for developing rich organic soil. You can use almost any kind of organic material to make compost that will enrich your soil, but the best things to start with are usually right there in your garden:\nFallen leaves\nWeeds (preferably before they go to seed)\nGrass clippings\nOld fruit and vegetable trimmings\nDon't use anything containing oil, fat, meat, grease, feces, dairy, or wood chips. Test the pH of your soil. Test the pH of your soil by buying pH test strips from a garden store. Stir a handful of soil with lukewarm distilled water until it's the consistency of a milkshake, then dip the pH test strip in. Hold it there for 20-30 seconds, then compare the strip to the test kit's key. The pH (acidity versus alkalinity) of your soil should be somewhere between 5.5 to 7.0 for plants to thrive. If your soil is too acidic (below 5.5), buy dolomite or quick lime to add to the soil, then retest. If your soil is too alkaline (above 7.0), add more organic matter, like peat moss or compost, then test the soil again. Measure your soil's drainage. Dig a hole in your garden or container 1 ft × 1 ft (0.30 m × 0.30 m) wide. Fill the hole with water and wait 24 hours. Then, fill the hole with water again and measure how fast the water drops with a tape measure. The ideal rate is 2 in (5.1 cm) per hour. Adding a few cups of compost or peat moss will help soil that drains too fast and soil that drains too slow. For a less scientific test, moisten your soil and grab a handful of it. The soil should hold together, but fall apart when you poke it with a finger. If your soil holds its shape or falls apart without a poke, add more organic matter (compost or peat moss) to improve its drainage. Add organic soil from your compost heap. The key to organic agriculture is great soil. Add as much organic material to your soil as you can, preferably from your compost heap. Soil that has been built up with plenty of organic matter is good for your garden for a lot of reasons:\nIt will nourish your plants without chemical fertilizers. It is easier to get shovels into—and weeds out of—enriched soil that isn't packed hard. It is softer, so plant roots can penetrate more easily and deeply. It will help water and air spend the right amount of time in contact with roots. Clay soils can be heavy and will stay wet for a long time. Sandy soils can drain water too quickly. Compost mitigates both conditions. Planting and Maintaining Your Garden Choose plants for your organic garden. Think about what you like to eat and how often you want to eat it. Plants like tomatoes, peppers, and squash will keep producing all year long, while vegetables like carrots and corn will only produce once. Buy seedlings from a garden store or farmer's market. Be sure to buy seedlings that haven't bloomed yet, and make sure to ask if they've been treated with chemicals. To be a true organic garden, your plants should be completely free of chemical fertilizers and pesticides. Plant your seedlings in full sun after the last frost. Plant seedlings into your organic, compost-rich soil and set them in areas where they'll receive full sun: at least 6 hours a day. Plant thickly to prevent weed growth. Companion plantings can fill in spaces in vegetable gardens, too, and will help you make the most of a small space. Spaces that are planted thickly enough will discourage weeds from growing between plants that you want. Mulch areas around plants 2 in (5.1 cm) deep. Organic mulches, including bark, wood chips, and grass clippings, gradually break down and enrich the soil. In the meantime, they control weeds, help to moderate soil temperatures, and slow evaporation, meaning that you can water less. Water your garden in the morning. Water in the morning, when the temperature is cool and there's less risk of evaporation, which will deprive your plants of water. Watering in the evening isn't ideal, as it keeps your plants wet overnight and encourages mildew. It's still preferable to watering in the middle of the day, though. Weed your garden every few weeks. Regularly taking off the green portions of weeds will deprive them of the nourishment they need to continue growing. Weeds are any plant you don't want growing in an area, and may include invasive ornamental or productive plants, such as ivy and mint. Use a hoe and keep it sharp. Try a Dutch hoe or scuffle hoe instead of a conventional gooseneck style hoe. Hoe each area frequently enough to keep green weeds down. Hand weed to remove the roots of perennial weeds that grow back. Also hand weed carefully around established plants, to avoid uprooting the plants you want. Try heat to control weeds in cracks, in the form of steam, a heat gun, boiling water, or even a small blowtorch, carefully applied. Attract helpful creatures by adding seeds, compost, or flowers. Many creatures can help your garden. Arrange the conditions of your garden to encourage them by:\nPutting out seed for birds\nAdding compost to your soil to attract worms\nPlanting alyssum, sunflowers, lemon balm, and parsley to invite beneficial insects",
  "tyn_model":[
    "water",
    "compost",
    "hoe",
    "peat moss",
    "containers",
    "buckets",
    "parsley",
    "tomatoes",
    "garden store",
    "organic matter",
    "compost heap",
    "× 4",
    "× 1.2",
    "vegetables",
    "garden",
    "fertilizer",
    "clover",
    "container garden",
    "herbs",
    "garlic",
    "green onions",
    "chives",
    "pebbles",
    "compost pile",
    "ph test strips",
    "distilled water",
    "ph test strip",
    "dolomite",
    "quick lime",
    "× 1",
    "× 0.30",
    "tape measure",
    "compost or",
    "organic soil",
    "organic agriculture",
    "soil",
    "organic material",
    "—and",
    "—enriched",
    "plants",
    "peppers",
    "squash",
    "carrots",
    "corn",
    "pesticides",
    "mulch",
    "mulches",
    "weeds",
    "heat",
    "heat gun",
    "flowers",
    "alyssum",
    "sunflowers",
    "lemon balm"
  ],
  "tyn_section":[

  ]
}