{
  "title":"How to Change the Color of Grout",
  "url":"https://www.wikihow.com/Change-the-Color-of-Grout",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Tiles and Tiling",
    "Tiling Grout"
  ],
  "methods":[
    {
      "name":"Staining Grout",
      "steps":[
        {
          "headline":"Choose a grout stain.",
          "description":"Most often, people resort to dying their grout because it’s lost its previous luster and now appears brown and dingy. Rather than going back to the original hue, find a new color to cover up the wear and tear. Although it may sound strange, grout stains that are close in color to dirt are typically the most successful, because you won’t have to worry about the grout becoming discolored again over time. Light hued grouts blend in and hide the shape of your tiles, while dark grout makes your tiles stand out and is very bold. When possible, look for grout stains that are also a sealant, so that you can skip the final step of sealing the grout."
        },
        {
          "headline":"Clean the tile and grout.",
          "description":"Get out your cleaning supplies and grab a little elbow grease, because before you can begin staining your grout you need to give it a thorough cleaning. Use a bleach-water scrub to kill any mold or mildew that might cause problems. Although it might be uncomfortable, use a damp sponge/scrubbing brush to clean your grout and tile, even if it is on the floor. The grout stain cannot be applied to damp grout, so wait 30 minutes or longer after cleaning to begin the application process."
        },
        {
          "headline":"Apply the grout stain.",
          "description":"Some grout staining kits come with a small applicator brush, but if yours didn’t, simply use a very small stiff-bristled brush for application. Dip the brush in the grout stain, and carefully paint it onto only the grout. The stain is permanent and cannot be removed from your tile after it dries, so be careful to paint in the lines and wipe off any stain from the tile."
        },
        {
          "headline":"Add additional coats.",
          "description":"Depending on the look you’re going for, you may need to add more than one coat of grout stain. If so, wait at least 24 hours for the first layer to dry, and then carefully paint on the second coat of stain. Again, be careful not to accidentally get any stain on the tiles as it is very difficult to remove."
        },
        {
          "headline":"Seal the grout.",
          "description":"Some grouts are a combination of grout/sealant, but typically you’ll have to apply a special oil-based sealant to finish up your grout. This is especially important for areas that come into frequent contact with water (such as in a bathroom or near a kitchen sink). Follow the directions that accompany your sealant of choice as you paint over the grout."
        }
      ]
    },
    {
      "name":"Cleaning Your Grout",
      "steps":[
        {
          "headline":"Choose a scrubbing solution.",
          "description":"Grout, especially between floor tiles, gets especially dingy and dirty over time. Depending on the severity of your grout discoloration, you will need to use a different cleaning solution. For mild discoloration, use a combination of baking soda and hydrogen peroxide to form a paste. For more severe discoloration, use an oxygen bleach to whiten your grout."
        },
        {
          "headline":"Do a preliminary clean.",
          "description":"In order to avoid extra work when you really start scrubbing, do a mild clean down of your grout prior to deep-cleaning it. Use a mixture of bleach and water to kill mold and mildew, and wipe off any grime or dirt that might be present on the surface."
        },
        {
          "headline":"Apply your cleaner.",
          "description":"Working in small sections of tile/grout (try 1sq. ft. at a time), apply your cleaner to the grout. Leave it to set for 3-5 minutes, as this will make the scrubbing much easier."
        },
        {
          "headline":"Start scrubbing the grout.",
          "description":"Use a brand new toothbrush (electric is preferable) to scrub away the dirt and discoloration on the grout. This can be relatively time consuming, so don’t give up if at first you don’t succeed. Use fresh water and a rag to wipe off the cleaning residue, and apply another coat of your cleaner if necessary."
        },
        {
          "headline":"Continue cleaning your grout.",
          "description":"Work your way outwards from your starting point, using the aforementioned process. Add cleaner to small sections, let it set, and scrub away until bright, clean, and shiny grout can be seen underneath."
        },
        {
          "headline":"Finish up.",
          "description":"When you’re happy with your newly cleaned (and colored!) grout, you can do a final wipe down to remove any leftover cleaner. It is good to apply a sealant to your grout once a year, so when applicable apply an oil-based sealant to protect your grout."
        }
      ]
    }
  ],
  "text":" Staining Grout Choose a grout stain. Most often, people resort to dying their grout because it’s lost its previous luster and now appears brown and dingy. Rather than going back to the original hue, find a new color to cover up the wear and tear. Although it may sound strange, grout stains that are close in color to dirt are typically the most successful, because you won’t have to worry about the grout becoming discolored again over time. Light hued grouts blend in and hide the shape of your tiles, while dark grout makes your tiles stand out and is very bold. When possible, look for grout stains that are also a sealant, so that you can skip the final step of sealing the grout. Clean the tile and grout. Get out your cleaning supplies and grab a little elbow grease, because before you can begin staining your grout you need to give it a thorough cleaning. Use a bleach-water scrub to kill any mold or mildew that might cause problems. Although it might be uncomfortable, use a damp sponge/scrubbing brush to clean your grout and tile, even if it is on the floor. The grout stain cannot be applied to damp grout, so wait 30 minutes or longer after cleaning to begin the application process. Apply the grout stain. Some grout staining kits come with a small applicator brush, but if yours didn’t, simply use a very small stiff-bristled brush for application. Dip the brush in the grout stain, and carefully paint it onto only the grout. The stain is permanent and cannot be removed from your tile after it dries, so be careful to paint in the lines and wipe off any stain from the tile. Add additional coats. Depending on the look you’re going for, you may need to add more than one coat of grout stain. If so, wait at least 24 hours for the first layer to dry, and then carefully paint on the second coat of stain. Again, be careful not to accidentally get any stain on the tiles as it is very difficult to remove. Seal the grout. Some grouts are a combination of grout/sealant, but typically you’ll have to apply a special oil-based sealant to finish up your grout. This is especially important for areas that come into frequent contact with water (such as in a bathroom or near a kitchen sink). Follow the directions that accompany your sealant of choice as you paint over the grout. Cleaning Your Grout Choose a scrubbing solution. Grout, especially between floor tiles, gets especially dingy and dirty over time. Depending on the severity of your grout discoloration, you will need to use a different cleaning solution. For mild discoloration, use a combination of baking soda and hydrogen peroxide to form a paste. For more severe discoloration, use an oxygen bleach to whiten your grout. Do a preliminary clean. In order to avoid extra work when you really start scrubbing, do a mild clean down of your grout prior to deep-cleaning it. Use a mixture of bleach and water to kill mold and mildew, and wipe off any grime or dirt that might be present on the surface. Apply your cleaner. Working in small sections of tile/grout (try 1sq. ft. at a time), apply your cleaner to the grout. Leave it to set for 3-5 minutes, as this will make the scrubbing much easier. Start scrubbing the grout. Use a brand new toothbrush (electric is preferable) to scrub away the dirt and discoloration on the grout. This can be relatively time consuming, so don’t give up if at first you don’t succeed. Use fresh water and a rag to wipe off the cleaning residue, and apply another coat of your cleaner if necessary. Continue cleaning your grout. Work your way outwards from your starting point, using the aforementioned process. Add cleaner to small sections, let it set, and scrub away until bright, clean, and shiny grout can be seen underneath. Finish up. When you’re happy with your newly cleaned (and colored!) grout, you can do a final wipe down to remove any leftover cleaner. It is good to apply a sealant to your grout once a year, so when applicable apply an oil-based sealant to protect your grout.",
  "tyn_model":[
    "grout",
    "grout stain",
    "cleaner",
    "paint",
    "water",
    "sealant",
    "grout stains",
    "elbow grease",
    "bleach-water",
    "sponge",
    "scrubbing brush",
    "grout staining kits",
    "grouts",
    "baking soda",
    "hydrogen peroxide",
    "oxygen bleach",
    "bleach",
    "toothbrush",
    "oil-based sealant"
  ],
  "tyn_section":[

  ]
}