{
  "title":"How to Draw a Blowing Cloud",
  "url":"https://www.wikihow.com/Draw-a-Blowing-Cloud",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Geography and Nature",
    "Drawing Air"
  ],
  "steps":[
    {
      "headline":"Draw seven circles overlapping.",
      "description":"They should somewhat resemble a worm, and will form the body of your cloud. Make it so that the circles form a curve bending down."
    },
    {
      "headline":"Repeat the process for the top of the cloud.",
      "description":"This time, only use six circles. Also, this curve should be bending up."
    },
    {
      "headline":"Draw three more overlapping circles, connected to the main cloud by a cylinder.",
      "description":"Erase any excess guidelines within the actual cloud, but keep the outline formed by your circles."
    },
    {
      "headline":"Draw a W-shaped curve for the cloud's eyebrows.",
      "description":"Bend the tips so they point down. For the eyes, draw two nearly-straight lines (since the cloud has its eyes shut)."
    },
    {
      "headline":"Draw a stretched U-shaped curve for the nose.",
      "description":"Do the same for the cheeks, but with the curves bending inwards."
    },
    {
      "headline":"Draw the lips by adding a curve surrounding the wind's end and another U-shaped curve forming the outline of the lip.",
      "description":"Remember, this last one will be partially covered by the body of the wind."
    },
    {
      "headline":"Color your drawing.",
      "description":"Use a bright blue or grey for the cloud and a darker tone to outline everything. Shadowing can really emphasize certain points of your drawing, and the same is true for almost everything else you do with clouds."
    }
  ],
  "text":" Draw seven circles overlapping. They should somewhat resemble a worm, and will form the body of your cloud. Make it so that the circles form a curve bending down. Repeat the process for the top of the cloud. This time, only use six circles. Also, this curve should be bending up. Draw three more overlapping circles, connected to the main cloud by a cylinder. Erase any excess guidelines within the actual cloud, but keep the outline formed by your circles. Draw a W-shaped curve for the cloud's eyebrows. Bend the tips so they point down. For the eyes, draw two nearly-straight lines (since the cloud has its eyes shut). Draw a stretched U-shaped curve for the nose. Do the same for the cheeks, but with the curves bending inwards. Draw the lips by adding a curve surrounding the wind's end and another U-shaped curve forming the outline of the lip. Remember, this last one will be partially covered by the body of the wind. Color your drawing. Use a bright blue or grey for the cloud and a darker tone to outline everything. Shadowing can really emphasize certain points of your drawing, and the same is true for almost everything else you do with clouds.",
  "tyn_model":[
    "clouds"
  ],
  "tyn_section":[

  ]
}