{
  "title":"How to Reduce Dust in Your House",
  "url":"https://www.wikihow.com/Reduce-Dust-in-Your-House",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "House Cleaning"
  ],
  "methods":[
    {
      "name":"Filtering the Air",
      "steps":[
        {
          "headline":"Clean or upgrade your air filters.",
          "description":"If your house is heated and/or cooled by a central system, you can change the filters as a means of controlling dust levels in your air. Dust will continue to build up in your home, but a quality filter can slow down the rate of dust accumulation. A standard air filter will only filter big particles from the air to prevent damage to your heating or cooling systems. To prevent dust, it is recommended that you use high-quality paper or pleated fabric filters that are disposable and replace them every 1 to 3 months. The highest quality filters are HEPA (high-efficiency particulate arrestance), but you should only use these with compatible heating and cooling systems."
        },
        {
          "headline":"Get an air purifier.",
          "description":"These machines clean the air by trapping dust particles. They're great for high-dust households or families with dust allergies. Air purifiers only clean the air in the room they're in, so consider getting one for each bedroom and the living room."
        }
      ]
    },
    {
      "name":"Cleaning Up Dust",
      "steps":[
        {
          "headline":"Vacuum twice a week.",
          "description":"Using a vacuum equipped with a HEPA (high-efficiency particulate air) filter will ensure that you're sucking up as much dust as possible. Vacuum all the carpeting in your home, focusing especially on high-traffic areas. You can also vacuum other flooring. Vacuuming frequently really cuts down on how much dust is able to build up under furniture and in corners - you'll probably notice a difference right away. Be sure to change your vacuum filter frequently. Make sure your vacuum is in good working order. A broken vacuum will just spit the dust back into the air, making the problem worse."
        },
        {
          "headline":"Sweep the floors every few days.",
          "description":"Using a broom and dustpan to get rid of the dust on the floors you don't vacuum is another great way to reduce your household dust. Sweep frequently in areas that tend to have a lot of dust, like doorways, hallways and the kitchen floor. Toss out the dust in your garbage can to make sure it doesn't reenter your household."
        },
        {
          "headline":"Mop the floors often.",
          "description":"Going over your flooring with a wet mop is a great way to collect the dust you missed while sweeping. If you mop frequently, you'll be able to get the dust under control. Letting it go too long will make it a lot more difficult to clean up all the dust and dirt, and you may need to do some scrubbing."
        },
        {
          "headline":"Dust with microfiber cloths.",
          "description":"Not all dusting cloths are made alike. If dust is an issue in your house, it might be time to spring for a microfiber dusting cloth. This fabric is designed to trap dust and hold it. Using an old t-shirt or towel tends to move the dust around rather than actually getting rid of it. Same goes for feather dusters - your furniture will look cleaner, but the dust particles have simply moved into the air. Use microfiber cloths to dust all surfaces where dust tends to accumulate, like the top of your mantel, desk, side tables, and so on. Wet cloths tend to collect dust better than dry cloths, so when you're dusting furniture that isn't wooden, try wetting the cloth first. Wash microfiber cloths immediately after dusting to get rid of everything the cloth collected. Don't use dryer sheets when you run them through the dryer, though; fabric softener reduces the cloths' capacity to hold the dust."
        },
        {
          "headline":"Wash your bedding often.",
          "description":"Sheets, blankets, comforters and pillows are places where dust tends to accumulate, often causing people to wake up with stuffy noses from breathing dusty air all night. Every time you get in or out of bed, you unknowingly send swirls of dust into the air. The solution is to wash your bedding often, especially if you or your family members have dry skin, or if your pets sleep with you in the bed. Wash sheets and pillowcases about once a week if you have a high-dust household. Wash other bedding and blankets once every three or four weeks."
        },
        {
          "headline":"Beat your cushions and rugs once a month.",
          "description":"Like your bedding, your furniture cushions and your rugs have a tendency to pick up a lot of dust over time. Every time you sit on your couch or walk on your rug, you're sending dust into the air. Every 3 months, take your cushions and rugs outside for a few whacks and eliminate as much dust as you can. An old broom handle is a great tool to use for beating rugs and cushions. Beat them all over, not just in the same place. Keep beating rugs and cushions until you don't see dust particles flying into the air with every whack."
        },
        {
          "headline":"Clean your walls from top to bottom.",
          "description":"Every few months, when your house is due for a deep cleaning, go over the walls, trim and baseboards with microfiber cloths. Clean the top of the walls first, making your way down to the bottom. That way you'll be able to collect all the dust that falls down as you clean."
        }
      ]
    },
    {
      "name":"Clearing Away Clutter",
      "steps":[
        {
          "headline":"Get rid of knick-knacks.",
          "description":"If every room in your house has a lot of decorative items sitting around, it will be a lot harder to reduce your dust. Go through your house and do a sweep for dust-collecting items that you don't really need. This will leave your surfaces much easier to clean. For those items you really want to keep, consider moving some of them to a room that isn't used as frequently by your family. That way, the main rooms in your house won't be as likely to accumulate dust."
        },
        {
          "headline":"Remove piles of magazines and books.",
          "description":"As these items degrade over time, they produce a lot of dust. Having piles of them around the house is a sure way to create a dusty atmosphere. Place your books on bookshelves, and regularly recycle magazines and other paper items. Store paper items you want to keep in plastic bags so they won't make your house dusty."
        },
        {
          "headline":"Use fewer textiles in your house.",
          "description":"Throw blankets, pillows, tablecloths, and plushy furniture also contribute to household dust - by producing it and trapping it, too. If you can pare down your linen and cloth items, you'll see a reduction in the amount of dust flying around the house. Instead of buying cloth furniture, go for leather or wood. It may be that one piece of older furniture is disintegrating and producing dust. If so, get rid of it. Wash your blankets and pillows frequently."
        },
        {
          "headline":"Keep your closets clean.",
          "description":"Every time you open the door to your closet, tiny changes in air pressure cause flakes of fiber to shed from clothing and fabrics, and these flakes of dust accumulate on the ground. If your closet is messy, you are less likely to clean the closet floor during your cleaning routines. When the closet floor is clear, cleaning is simple and prevents the dust from leaving the closet and floating elsewhere. Hang up your clothes neatly instead of keeping them in piles or stacks. Have a place for your shoes to go, rather than throwing them all in a bin. Regularly vacuum the floor of your closet to reduce the amount of dust in there."
        },
        {
          "headline":"Keep unused clothing in boxes or bags.",
          "description":"Out-of-season clothing should be stored away rather than left out until next year. When clothing and fabrics are kept within closed containers, they are less likely to be disturbed, resulting in fewer pieces of dust. It is recommended that you store within transparent containers and bags so you can just look to see which items are where. When dust accumulates on the containers themselves, you can easily wipe them down."
        },
        {
          "headline":"Have people take off dirty shoes at the door.",
          "description":"Mud and dirt that gets tracked into the house will eventually contribute to your household dust as it dries out. On rainy days and during the winter months, you might consider asking people to take off their shoes at the door. That way, you can keep the dust produced by these items contained to one area, which you can clean frequently."
        },
        {
          "headline":"Groom your pets regularly.",
          "description":"Dogs and cats contribute  fur and dander to the household dust count. Brushing them regularly is a big help. Groom your pets in the bathroom or laundry room rather than on the living room couch or in the bedroom, since these areas are harder to keep clean. Also wash your pets' bedding frequently."
        }
      ]
    },
    {
      "name":"Seal Up Cracks",
      "steps":[
        {
          "headline":"Much of the dust is entering the house from outside.",
          "description":"Use caulk to seal cracks around door and window frames. As a bonus, your heating and air conditioning bills will be reduced."
        },
        {
          "headline":"Check any fireplaces for openings and for accumulations of ash and soot.",
          "description":"It may be necessary to hire a chimney sweep."
        },
        {
          "headline":"Check your clothes dryer for lint loss.",
          "description":"If there is lint inside the works of the dryer, this is a fire hazard and suggests that there is a problem with the venting system. Check the ductwork and exterior venting for holes and blockages. Fix as needed."
        }
      ]
    }
  ],
  "text":" Filtering the Air Clean or upgrade your air filters. If your house is heated and/or cooled by a central system, you can change the filters as a means of controlling dust levels in your air. Dust will continue to build up in your home, but a quality filter can slow down the rate of dust accumulation. A standard air filter will only filter big particles from the air to prevent damage to your heating or cooling systems. To prevent dust, it is recommended that you use high-quality paper or pleated fabric filters that are disposable and replace them every 1 to 3 months. The highest quality filters are HEPA (high-efficiency particulate arrestance), but you should only use these with compatible heating and cooling systems. Get an air purifier. These machines clean the air by trapping dust particles. They're great for high-dust households or families with dust allergies. Air purifiers only clean the air in the room they're in, so consider getting one for each bedroom and the living room. Cleaning Up Dust Vacuum twice a week. Using a vacuum equipped with a HEPA (high-efficiency particulate air) filter will ensure that you're sucking up as much dust as possible. Vacuum all the carpeting in your home, focusing especially on high-traffic areas. You can also vacuum other flooring. Vacuuming frequently really cuts down on how much dust is able to build up under furniture and in corners - you'll probably notice a difference right away. Be sure to change your vacuum filter frequently. Make sure your vacuum is in good working order. A broken vacuum will just spit the dust back into the air, making the problem worse. Sweep the floors every few days. Using a broom and dustpan to get rid of the dust on the floors you don't vacuum is another great way to reduce your household dust. Sweep frequently in areas that tend to have a lot of dust, like doorways, hallways and the kitchen floor. Toss out the dust in your garbage can to make sure it doesn't reenter your household. Mop the floors often. Going over your flooring with a wet mop is a great way to collect the dust you missed while sweeping. If you mop frequently, you'll be able to get the dust under control. Letting it go too long will make it a lot more difficult to clean up all the dust and dirt, and you may need to do some scrubbing. Dust with microfiber cloths. Not all dusting cloths are made alike. If dust is an issue in your house, it might be time to spring for a microfiber dusting cloth. This fabric is designed to trap dust and hold it. Using an old t-shirt or towel tends to move the dust around rather than actually getting rid of it. Same goes for feather dusters - your furniture will look cleaner, but the dust particles have simply moved into the air. Use microfiber cloths to dust all surfaces where dust tends to accumulate, like the top of your mantel, desk, side tables, and so on. Wet cloths tend to collect dust better than dry cloths, so when you're dusting furniture that isn't wooden, try wetting the cloth first. Wash microfiber cloths immediately after dusting to get rid of everything the cloth collected. Don't use dryer sheets when you run them through the dryer, though; fabric softener reduces the cloths' capacity to hold the dust. Wash your bedding often. Sheets, blankets, comforters and pillows are places where dust tends to accumulate, often causing people to wake up with stuffy noses from breathing dusty air all night. Every time you get in or out of bed, you unknowingly send swirls of dust into the air. The solution is to wash your bedding often, especially if you or your family members have dry skin, or if your pets sleep with you in the bed. Wash sheets and pillowcases about once a week if you have a high-dust household. Wash other bedding and blankets once every three or four weeks. Beat your cushions and rugs once a month. Like your bedding, your furniture cushions and your rugs have a tendency to pick up a lot of dust over time. Every time you sit on your couch or walk on your rug, you're sending dust into the air. Every 3 months, take your cushions and rugs outside for a few whacks and eliminate as much dust as you can. An old broom handle is a great tool to use for beating rugs and cushions. Beat them all over, not just in the same place. Keep beating rugs and cushions until you don't see dust particles flying into the air with every whack. Clean your walls from top to bottom. Every few months, when your house is due for a deep cleaning, go over the walls, trim and baseboards with microfiber cloths. Clean the top of the walls first, making your way down to the bottom. That way you'll be able to collect all the dust that falls down as you clean. Clearing Away Clutter Get rid of knick-knacks. If every room in your house has a lot of decorative items sitting around, it will be a lot harder to reduce your dust. Go through your house and do a sweep for dust-collecting items that you don't really need. This will leave your surfaces much easier to clean. For those items you really want to keep, consider moving some of them to a room that isn't used as frequently by your family. That way, the main rooms in your house won't be as likely to accumulate dust. Remove piles of magazines and books. As these items degrade over time, they produce a lot of dust. Having piles of them around the house is a sure way to create a dusty atmosphere. Place your books on bookshelves, and regularly recycle magazines and other paper items. Store paper items you want to keep in plastic bags so they won't make your house dusty. Use fewer textiles in your house. Throw blankets, pillows, tablecloths, and plushy furniture also contribute to household dust - by producing it and trapping it, too. If you can pare down your linen and cloth items, you'll see a reduction in the amount of dust flying around the house. Instead of buying cloth furniture, go for leather or wood. It may be that one piece of older furniture is disintegrating and producing dust. If so, get rid of it. Wash your blankets and pillows frequently. Keep your closets clean. Every time you open the door to your closet, tiny changes in air pressure cause flakes of fiber to shed from clothing and fabrics, and these flakes of dust accumulate on the ground. If your closet is messy, you are less likely to clean the closet floor during your cleaning routines. When the closet floor is clear, cleaning is simple and prevents the dust from leaving the closet and floating elsewhere. Hang up your clothes neatly instead of keeping them in piles or stacks. Have a place for your shoes to go, rather than throwing them all in a bin. Regularly vacuum the floor of your closet to reduce the amount of dust in there. Keep unused clothing in boxes or bags. Out-of-season clothing should be stored away rather than left out until next year. When clothing and fabrics are kept within closed containers, they are less likely to be disturbed, resulting in fewer pieces of dust. It is recommended that you store within transparent containers and bags so you can just look to see which items are where. When dust accumulates on the containers themselves, you can easily wipe them down. Have people take off dirty shoes at the door. Mud and dirt that gets tracked into the house will eventually contribute to your household dust as it dries out. On rainy days and during the winter months, you might consider asking people to take off their shoes at the door. That way, you can keep the dust produced by these items contained to one area, which you can clean frequently. Groom your pets regularly. Dogs and cats contribute  fur and dander to the household dust count. Brushing them regularly is a big help. Groom your pets in the bathroom or laundry room rather than on the living room couch or in the bedroom, since these areas are harder to keep clean. Also wash your pets' bedding frequently. Seal Up Cracks Much of the dust is entering the house from outside. Use caulk to seal cracks around door and window frames. As a bonus, your heating and air conditioning bills will be reduced. Check any fireplaces for openings and for accumulations of ash and soot. It may be necessary to hire a chimney sweep. Check your clothes dryer for lint loss. If there is lint inside the works of the dryer, this is a fire hazard and suggests that there is a problem with the venting system. Check the ductwork and exterior venting for holes and blockages. Fix as needed.",
  "tyn_model":[
    "vacuum",
    "microfiber cloths",
    "blankets",
    "magazines",
    "air filters",
    "filter",
    "air filter",
    "air purifier",
    "air purifiers",
    "vacuum filter",
    "broom",
    "garbage can",
    "mop",
    "dusting cloths",
    "microfiber dusting cloth",
    "feather dusters",
    "dryer sheets",
    "fabric softener",
    "sheets",
    "dust",
    "broom handle",
    "books",
    "textiles",
    "linen",
    "pillows",
    "fabrics",
    "mud",
    "dirt",
    "caulk",
    "chimney sweep",
    "clothes dryer",
    "dryer"
  ],
  "tyn_section":[

  ]
}