{
  "title":"How to Make Low Carb Chicken Soup",
  "url":"https://www.wikihow.com/Make-Low-Carb-Chicken-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "steps":[
    {
      "headline":"Put the chicken in the pot.",
      "description":"In a large enough pot, place the whole chicken and cover with water."
    },
    {
      "headline":"Place the pot on the stove over medium heat.",
      "description":""
    },
    {
      "headline":"Add the spices.",
      "description":"Add all the spices except the salt and paprika. You may use cheesecloth to make a spice sachet for ease of removal."
    },
    {
      "headline":"Bring the soon-to-be stock to a boil.",
      "description":"Then lower the heat and simmer for 2 hours. The chicken should pull apart easily."
    },
    {
      "headline":"Remove from heat and lift chicken out with a couple of large spoons or forks into a large bowl.",
      "description":"Be very careful to not drop the chicken or knock over the stock pot and don't burn yourself."
    },
    {
      "headline":"Remove the sachet or strain the broth into another pot to remove the cloves, peppercorns, and other annoyances.",
      "description":""
    },
    {
      "headline":"Skim the fat.",
      "description":"When the broth settles, start spooning out the oil and floaters from the surface of the broth into a measuring cup for disposal."
    },
    {
      "headline":"Put the broth pot back on the stove on low heat.",
      "description":""
    },
    {
      "headline":"Add all the vegetables, except red peppers (add those in the last 15 minutes).",
      "description":""
    },
    {
      "headline":"Add salt, paprika, and lemon juice.",
      "description":"Taste to make sure it's suitably flavored."
    },
    {
      "headline":"Add chicken meat.",
      "description":"Pull some of the meat (be careful it's hot) from the chicken and dice it up. Add this to the broth."
    },
    {
      "headline":"Simmer for another 30-45 minutes.",
      "description":""
    },
    {
      "headline":"Garnish and serve.Remove from heat and serve with green onion slices (small rings) on top.",
      "description":""
    }
  ],
  "text":" Put the chicken in the pot. In a large enough pot, place the whole chicken and cover with water. Place the pot on the stove over medium heat.  Add the spices. Add all the spices except the salt and paprika. You may use cheesecloth to make a spice sachet for ease of removal. Bring the soon-to-be stock to a boil. Then lower the heat and simmer for 2 hours. The chicken should pull apart easily. Remove from heat and lift chicken out with a couple of large spoons or forks into a large bowl. Be very careful to not drop the chicken or knock over the stock pot and don't burn yourself. Remove the sachet or strain the broth into another pot to remove the cloves, peppercorns, and other annoyances.  Skim the fat. When the broth settles, start spooning out the oil and floaters from the surface of the broth into a measuring cup for disposal. Put the broth pot back on the stove on low heat.  Add all the vegetables, except red peppers (add those in the last 15 minutes).  Add salt, paprika, and lemon juice. Taste to make sure it's suitably flavored. Add chicken meat. Pull some of the meat (be careful it's hot) from the chicken and dice it up. Add this to the broth. Simmer for another 30-45 minutes.  Garnish and serve.Remove from heat and serve with green onion slices (small rings) on top. ",
  "tyn_model":[
    "chicken",
    "broth",
    "pot",
    "stove",
    "salt",
    "paprika",
    "water",
    "spices",
    "cheesecloth",
    "stock",
    "large spoons",
    "forks",
    "large bowl",
    "stock pot",
    "oil",
    "measuring cup",
    "vegetables",
    "lemon juice",
    "chicken meat",
    "green onion"
  ],
  "tyn_section":[

  ]
}