{
  "title":"How to Build a Pokémon Deck",
  "url":"https://www.wikihow.com/Build-a-Pok%C3%A9mon-Deck",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "steps":[
    {
      "headline":"Think of the kind of deck you want.",
      "description":"Do you like to play Water and Fire Pokémon, or Psychic and Fighting? Most people only have two different types of Pokémon in their deck. Sometimes certain decks may effectively use more than two, and sometimes decks use only one. Try to make your types complement each other if possible — for example, Water and Electricity are good companions, as are Fire and Grass. Take into account the weaknesses of your types, too. If your Psychic-types have weakness to dark, play Fighting types (because most Dark Pokémon have Fighting weakness) to counter Dark-type Pokémon. Remember that you can use Pokémon with colorless attack cost in any kind of deck to bulk it up and fill in gaps. They are versatile and often have many helpful effects. Be aware, though, that no Pokémon has weaknesses to colorless type Pokémon."
    },
    {
      "headline":"Have a strategy in mind about how to win or get your opponent to lose.",
      "description":"In the Pokémon TCG, you can win in one of three ways: Collect your opponent's six prize cards, make your opponent run out of Pokémon on the field, or make your opponent run out of cards to draw at the beginning of his/her turn. Ask yourself:\nWhich condition will your deck focus on to win the game? How will it best achieve that? What are the ways that your opponent might counter your strategy? Which cards can you use to minimize your weaknesses and maximize your strengths?"
    },
    {
      "headline":"Remember to keep good balance as you choose.",
      "description":"Many decks stick with roughly 20 Pokémon, 25 trainers, and around 15 energies for a good mix, although it often depends on the type of deck you're playing. You may want to put in more energies than this, because shuffles can yield uneven hands with Pokémon to Energy ratios. For example, a Blastoise/Keldeo-EX Deck from the 2012 City Championships sported 14 Pokémon, 32 trainers, and 14 energy. It all depends on what you're trying to do."
    },
    {
      "headline":"Think about the game as a three-role play.",
      "description":"First of all, you need to run multiple copies of your main attacker, and you'll need more of the Basic Pokémon than of the Stage 2, fully evolved ones, to be sure that you have an Active Pokémon and plenty for your bench. Basic Pokémon can be knocked out quickly, so be sure you have some stage 1 or 2 cards up your sleeve. Evolve quickly to give your game some substance after the initial wave of weaker Pokémon. Add \"Back-up\" - multiples of the evolution chain - so that you will still be able to get your stage 1 & 2 Pokémon out. If you just do 1 of each then when the pre-evolution is knocked out you won't be able to play your strongest Pokémon cards. Plan from start to finish. Most decks have a 'start' card like Cleffa or Pichu. cards like these can help you set-up. Have one or two really big 1-hit K.O.ers you can draw for late in play."
    },
    {
      "headline":"Balance your cards.",
      "description":"It's good to use cards that help each other. It needs to be a good deck! Strategy is important! Look for synergies in cards. For example, Hydreigon and Darkrai-EX are a great at moving around Pokémon and energies freely. Look for other great combination to use for your advantage."
    },
    {
      "headline":"Choose trainers that best support your Pokémon.",
      "description":"You will need about 5-8 trainers that help you draw cards; if you can't get the cards you need, you can't win. Remember that you can put up to 4 of any given card in your deck. If your deck relies heavily on a card, you should boost your chances of drawing it by putting several copies of the card in your deck. You should have around 5 or so cards to support and boost up your Pokémon. Any remaining space can be used to combat against frequently used cards or weaknesses, or to refresh your hand/bench."
    },
    {
      "headline":"Test your deck by drawing as if you were playing against an opponent.",
      "description":"Remember, to begin play, you must draw at least one basic Pokémon, so be sure you have plenty of Basics to insure that you get a good opening draw. While you are testing, see if any adjustments to the Energy count can be made, as it can be tricky to estimate how many you will need in any given deck."
    },
    {
      "headline":"Include plenty of trainer and supporter cards.",
      "description":"The best decks tend to have more trainer/supporter cards than any other kind of card. Focus on trainers/supporters that help you draw the cards you will need. Also look for trainers/supporters that jive with your deck's strategy."
    },
    {
      "headline":"Don't stock too many evolutions.",
      "description":"Evolution takes precious time in battle. You should use evolution cards if they are vital to your strategy and if you have trainers to help you evolve quickly. The longer it takes to evolve your Pokémon, the more time your opponent has to attack and set up. Example: Charizard GX has an attack with a staggering 300 damage. However, it is quite a bad card. You have to evolve it twice and attach five energies before Charizard GX can use his main attack (then discards 3 attached energy)."
    }
  ],
  "text":" Think of the kind of deck you want. Do you like to play Water and Fire Pokémon, or Psychic and Fighting? Most people only have two different types of Pokémon in their deck. Sometimes certain decks may effectively use more than two, and sometimes decks use only one. Try to make your types complement each other if possible — for example, Water and Electricity are good companions, as are Fire and Grass. Take into account the weaknesses of your types, too. If your Psychic-types have weakness to dark, play Fighting types (because most Dark Pokémon have Fighting weakness) to counter Dark-type Pokémon. Remember that you can use Pokémon with colorless attack cost in any kind of deck to bulk it up and fill in gaps. They are versatile and often have many helpful effects. Be aware, though, that no Pokémon has weaknesses to colorless type Pokémon. Have a strategy in mind about how to win or get your opponent to lose. In the Pokémon TCG, you can win in one of three ways: Collect your opponent's six prize cards, make your opponent run out of Pokémon on the field, or make your opponent run out of cards to draw at the beginning of his/her turn. Ask yourself:\nWhich condition will your deck focus on to win the game? How will it best achieve that? What are the ways that your opponent might counter your strategy? Which cards can you use to minimize your weaknesses and maximize your strengths? Remember to keep good balance as you choose. Many decks stick with roughly 20 Pokémon, 25 trainers, and around 15 energies for a good mix, although it often depends on the type of deck you're playing. You may want to put in more energies than this, because shuffles can yield uneven hands with Pokémon to Energy ratios. For example, a Blastoise/Keldeo-EX Deck from the 2012 City Championships sported 14 Pokémon, 32 trainers, and 14 energy. It all depends on what you're trying to do. Think about the game as a three-role play. First of all, you need to run multiple copies of your main attacker, and you'll need more of the Basic Pokémon than of the Stage 2, fully evolved ones, to be sure that you have an Active Pokémon and plenty for your bench. Basic Pokémon can be knocked out quickly, so be sure you have some stage 1 or 2 cards up your sleeve. Evolve quickly to give your game some substance after the initial wave of weaker Pokémon. Add \"Back-up\" - multiples of the evolution chain - so that you will still be able to get your stage 1 & 2 Pokémon out. If you just do 1 of each then when the pre-evolution is knocked out you won't be able to play your strongest Pokémon cards. Plan from start to finish. Most decks have a 'start' card like Cleffa or Pichu. cards like these can help you set-up. Have one or two really big 1-hit K.O.ers you can draw for late in play. Balance your cards. It's good to use cards that help each other. It needs to be a good deck! Strategy is important! Look for synergies in cards. For example, Hydreigon and Darkrai-EX are a great at moving around Pokémon and energies freely. Look for other great combination to use for your advantage. Choose trainers that best support your Pokémon. You will need about 5-8 trainers that help you draw cards; if you can't get the cards you need, you can't win. Remember that you can put up to 4 of any given card in your deck. If your deck relies heavily on a card, you should boost your chances of drawing it by putting several copies of the card in your deck. You should have around 5 or so cards to support and boost up your Pokémon. Any remaining space can be used to combat against frequently used cards or weaknesses, or to refresh your hand/bench. Test your deck by drawing as if you were playing against an opponent. Remember, to begin play, you must draw at least one basic Pokémon, so be sure you have plenty of Basics to insure that you get a good opening draw. While you are testing, see if any adjustments to the Energy count can be made, as it can be tricky to estimate how many you will need in any given deck. Include plenty of trainer and supporter cards. The best decks tend to have more trainer/supporter cards than any other kind of card. Focus on trainers/supporters that help you draw the cards you will need. Also look for trainers/supporters that jive with your deck's strategy. Don't stock too many evolutions. Evolution takes precious time in battle. You should use evolution cards if they are vital to your strategy and if you have trainers to help you evolve quickly. The longer it takes to evolve your Pokémon, the more time your opponent has to attack and set up. Example: Charizard GX has an attack with a staggering 300 damage. However, it is quite a bad card. You have to evolve it twice and attach five energies before Charizard GX can use his main attack (then discards 3 attached energy).",
  "tyn_model":[
    "pokémon",
    "cards",
    "trainers",
    "— for",
    "water",
    "electricity",
    "fire",
    "grass",
    "psychic",
    "pokémon tcg",
    "energies",
    "blastoise",
    "hydreigon",
    "energy",
    "charizard"
  ],
  "tyn_section":[

  ]
}