{
  "title":"How to Draw Dominoes",
  "url":"https://www.wikihow.com/Draw-Dominoes",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Games Drawing"
  ],
  "steps":[
    {
      "headline":"Start by drawing a stretched diamond shape.",
      "description":"It should look like a door, but make it relatively small on your paper, since you still need to add shapes of the other dominoes."
    },
    {
      "headline":"Drawing parallel lines, connecting to the top and bottom ends.",
      "description":"This will give your domino depth, make it look more three-dimensional than it did before."
    },
    {
      "headline":"Add more dominoes.",
      "description":"Simply repeat the first two steps of the process, but overlap each domino that you add to the one before it."
    },
    {
      "headline":"To add a falling domino piece, tilt the diamond a little.",
      "description":"Make it look as though it's pressing against the last domino you drew, trying to push it away."
    },
    {
      "headline":"Add another falling domino by repeating the last step.",
      "description":"This domino should be slanting even more steeply, however, nearly parallel to the ground."
    },
    {
      "headline":"Draw the symbols that give the pieces their values.",
      "description":"Remember, they go from zero to six. Also remember to draw the dividing line in the middle."
    },
    {
      "headline":"Use a light orange for the pieces themselves, and black ink for the dots.",
      "description":"Use a contrasting color for the details. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/5\\/5a\\/Paint-Step-7.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/5\\/5a\\/Paint-Step-7.jpg\",\"smallWidth\":460,\"smallHeight\":444,\"bigWidth\":760,\"bigHeight\":733.4,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
    }
  ],
  "text":" Start by drawing a stretched diamond shape. It should look like a door, but make it relatively small on your paper, since you still need to add shapes of the other dominoes. Drawing parallel lines, connecting to the top and bottom ends. This will give your domino depth, make it look more three-dimensional than it did before. Add more dominoes. Simply repeat the first two steps of the process, but overlap each domino that you add to the one before it. To add a falling domino piece, tilt the diamond a little. Make it look as though it's pressing against the last domino you drew, trying to push it away. Add another falling domino by repeating the last step. This domino should be slanting even more steeply, however, nearly parallel to the ground. Draw the symbols that give the pieces their values. Remember, they go from zero to six. Also remember to draw the dividing line in the middle. Use a light orange for the pieces themselves, and black ink for the dots. Use a contrasting color for the details. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/5\\/5a\\/Paint-Step-7.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/5\\/5a\\/Paint-Step-7.jpg\",\"smallWidth\":460,\"smallHeight\":444,\"bigWidth\":760,\"bigHeight\":733.4,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}",
  "tyn_model":[
    "paper",
    "dominoes",
    "diamond",
    "ink"
  ],
  "tyn_section":[

  ]
}