{
  "title":"How to Tie a Taut Line Hitch",
  "url":"https://www.wikihow.com/Tie-a-Taut-Line-Hitch",
  "category_hierarchy":[
    "Hobbies and Crafts"
  ],
  "steps":[
    {
      "headline":"Wrap your rope around a your object (example: tree) so that the long end (standing end) is on your right side and the short end (bitter end) is on your left.",
      "description":""
    },
    {
      "headline":"Cross the bitter end over the standing end.",
      "description":""
    },
    {
      "headline":"Bring the bitter end under the standing end and up through the loop.",
      "description":"Bring the bitter end to the right."
    },
    {
      "headline":"Repeat the turn.",
      "description":"Bring the bitter end under the standing and up through the loop. Bring the bitter end to the left."
    },
    {
      "headline":"Pass the bitter under the standing end.",
      "description":""
    },
    {
      "headline":"Bring the bitter end back through the new loop you just created.",
      "description":"The purpose of this extra turn is to lock the knot when you need to make sure it holds."
    },
    {
      "headline":"Keeping the standing end tight, pull the slack out of the hitches you made.",
      "description":"You can slide the knot up and down the standing end. Loosen the tension on the standing end, and the knot will slide to adjust the size of the loop."
    }
  ],
  "text":" Wrap your rope around a your object (example: tree) so that the long end (standing end) is on your right side and the short end (bitter end) is on your left.  Cross the bitter end over the standing end.  Bring the bitter end under the standing end and up through the loop. Bring the bitter end to the right. Repeat the turn. Bring the bitter end under the standing and up through the loop. Bring the bitter end to the left. Pass the bitter under the standing end.  Bring the bitter end back through the new loop you just created. The purpose of this extra turn is to lock the knot when you need to make sure it holds. Keeping the standing end tight, pull the slack out of the hitches you made. You can slide the knot up and down the standing end. Loosen the tension on the standing end, and the knot will slide to adjust the size of the loop.",
  "tyn_model":[
    "bitter",
    "rope"
  ],
  "tyn_section":[

  ]
}