{
  "title":"How to Draw a Crown",
  "url":"https://www.wikihow.com/Draw-a-Crown",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing People",
    "Drawing Royalty"
  ],
  "methods":[
    {
      "name":"Drawing a Cartoon Crown",
      "steps":[
        {
          "headline":"Draw a horizontal rectangle.",
          "description":""
        },
        {
          "headline":"Add 2 curved lines in the middle and above the rectangle.",
          "description":""
        },
        {
          "headline":"Draw 5 triangles across the upper curved line.",
          "description":"Add small circles at the top of each triangle."
        },
        {
          "headline":"Add several circles for gems on the triangles and on the rectangle.",
          "description":""
        },
        {
          "headline":"Ink the drawing and then erase the sketch lines.",
          "description":""
        },
        {
          "headline":"Color the drawing and then you have your very own crown!",
          "description":""
        }
      ]
    },
    {
      "name":"Drawing a Traditional Crown",
      "steps":[
        {
          "headline":"Draw a rectangle of considerable size for the crown’s framework.",
          "description":""
        },
        {
          "headline":"Add a curve connecting the upper left corner of the rectangle to the upper right corner.",
          "description":"Draw two similar curves apart from each other near the bottom but inside the rectangle."
        },
        {
          "headline":"Draw the zig-zag lines in the middle curve, the straight lines which connect the midpoints of the zig-zags in the bottom curve, and small circles in each tip of the zig-zags.",
          "description":""
        },
        {
          "headline":"Draw zig-zag lines in between the middle and bottom curves and draw two curved lines which are part below the bottom curve.",
          "description":"The distance between the two new curves are wider near the center."
        },
        {
          "headline":"Draw circles at the center of the zig-zag shapes at the upper part of the crown.",
          "description":"Draw smaller circles at the middle of the zig-zags at the middle of the crown."
        },
        {
          "headline":"Add the details for the sides of the crown.",
          "description":"Draw outer circles to make the circles look embossed."
        },
        {
          "headline":"Trace with a pen.",
          "description":"Erase unnecessary lines."
        },
        {
          "headline":"Color according to your liking!",
          "description":""
        }
      ]
    }
  ],
  "text":" Drawing a Cartoon Crown Draw a horizontal rectangle.  Add 2 curved lines in the middle and above the rectangle.  Draw 5 triangles across the upper curved line. Add small circles at the top of each triangle. Add several circles for gems on the triangles and on the rectangle.  Ink the drawing and then erase the sketch lines.  Color the drawing and then you have your very own crown!  Drawing a Traditional Crown Draw a rectangle of considerable size for the crown’s framework.  Add a curve connecting the upper left corner of the rectangle to the upper right corner. Draw two similar curves apart from each other near the bottom but inside the rectangle. Draw the zig-zag lines in the middle curve, the straight lines which connect the midpoints of the zig-zags in the bottom curve, and small circles in each tip of the zig-zags.  Draw zig-zag lines in between the middle and bottom curves and draw two curved lines which are part below the bottom curve. The distance between the two new curves are wider near the center. Draw circles at the center of the zig-zag shapes at the upper part of the crown. Draw smaller circles at the middle of the zig-zags at the middle of the crown. Add the details for the sides of the crown. Draw outer circles to make the circles look embossed. Trace with a pen. Erase unnecessary lines. Color according to your liking! ",
  "tyn_model":[
    "pen"
  ],
  "tyn_section":[

  ]
}