{
  "title":"How to Access Kinect Pictures",
  "url":"https://www.wikihow.com/Access-Kinect-Pictures",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Xbox Kinect"
  ],
  "steps":[
    {
      "headline":"Connect your Xbox.",
      "description":"Make sure the Xbox is plugged into a power outlet. Then connect the Xbox to your television set by way of a VGA Audio Visual cord, Component Audio Visual cord, or HDMI cord."
    },
    {
      "headline":"Connect the Kinect to your Xbox.",
      "description":"The Kinect does not need another power supply (IF you have a new Xbox Slim with a built in Kinect port) otherwise you need an additional power brick to use the Kinect with older Xboxs. Make sure you have plenty of space to move around when operating the Kinect."
    },
    {
      "headline":"Turn on your Xbox and your television.",
      "description":"Your Xbox will need to install updates. Make sure they are all installed before attempting to use the Kinect."
    },
    {
      "headline":"Activate your Kinect.",
      "description":"This is done by waving your hand at the Kinect sensor. Make sure you are three to eight feet back from the controller to get a good reading. Hands-free control is now operational."
    },
    {
      "headline":"Sign in to Xbox using your LIVE gamer tag.",
      "description":""
    },
    {
      "headline":"Select your Xbox LIVE avatar under My Xbox.",
      "description":""
    },
    {
      "headline":"Go to Online Safety.",
      "description":""
    },
    {
      "headline":"Select Change Settings.",
      "description":""
    },
    {
      "headline":"Select Customize.",
      "description":""
    },
    {
      "headline":"Select Kinect Sharing.",
      "description":"Now your Kinect pictures will be able to be posted on the online Kinect database."
    },
    {
      "headline":"Play a Kinect game.",
      "description":"Most games have a feature which will take a snapshot of you as you go through the motions, performing whatever activity is necessary. When you are finished with a round or game, the game will show you your pictures."
    },
    {
      "headline":"Edit your pictures.",
      "description":"If the game does have picture option, there will be a button which allows you to view your pictures. Browse through these and delete those that you dislike or find embarrassing."
    },
    {
      "headline":"Share your pictures online.",
      "description":"Click on the Share Pictures button. You will now be able to select which pictures you would like to share on Kinect."
    },
    {
      "headline":"Go to Kinect on your computer.",
      "description":""
    },
    {
      "headline":"Sign in to Kinect Share using your Windows Live I.D.",
      "description":"and password. There will be several icons for each different game you have played which features picture capability. Under the icon and game name will be a thumbnail of your pictures."
    },
    {
      "headline":"Click on the game name.",
      "description":"You will now see a full range of thumbnails of all pictures you chose to share on Kinect Share. Use the links on the right hand side of the screen to share the pictures on social media sites, download, or print them."
    }
  ],
  "text":" Connect your Xbox. Make sure the Xbox is plugged into a power outlet. Then connect the Xbox to your television set by way of a VGA Audio Visual cord, Component Audio Visual cord, or HDMI cord. Connect the Kinect to your Xbox. The Kinect does not need another power supply (IF you have a new Xbox Slim with a built in Kinect port) otherwise you need an additional power brick to use the Kinect with older Xboxs. Make sure you have plenty of space to move around when operating the Kinect. Turn on your Xbox and your television. Your Xbox will need to install updates. Make sure they are all installed before attempting to use the Kinect. Activate your Kinect. This is done by waving your hand at the Kinect sensor. Make sure you are three to eight feet back from the controller to get a good reading. Hands-free control is now operational. Sign in to Xbox using your LIVE gamer tag.  Select your Xbox LIVE avatar under My Xbox.  Go to Online Safety.  Select Change Settings.  Select Customize.  Select Kinect Sharing. Now your Kinect pictures will be able to be posted on the online Kinect database. Play a Kinect game. Most games have a feature which will take a snapshot of you as you go through the motions, performing whatever activity is necessary. When you are finished with a round or game, the game will show you your pictures. Edit your pictures. If the game does have picture option, there will be a button which allows you to view your pictures. Browse through these and delete those that you dislike or find embarrassing. Share your pictures online. Click on the Share Pictures button. You will now be able to select which pictures you would like to share on Kinect. Go to Kinect on your computer.  Sign in to Kinect Share using your Windows Live I.D. and password. There will be several icons for each different game you have played which features picture capability. Under the icon and game name will be a thumbnail of your pictures. Click on the game name. You will now see a full range of thumbnails of all pictures you chose to share on Kinect Share. Use the links on the right hand side of the screen to share the pictures on social media sites, download, or print them.",
  "tyn_model":[
    "xbox",
    "kinect",
    "television",
    "xbox live avatar",
    "kinect share"
  ],
  "tyn_section":[

  ]
}