{
  "title":"How to Make a Vanilla Sponge Cake",
  "url":"https://www.wikihow.com/Make-a-Vanilla-Sponge-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Sponge Cakes"
  ],
  "methods":[
    {
      "name":"Making a Vanilla Sponge Cake",
      "steps":[
        {
          "headline":"Preheat the oven to 180ºC/350ºF.",
          "description":"Prepare the cake pan. Line the base with parchment/baking paper and grease the edges of the pan. Line a wire baking rack with parchment/baking paper."
        },
        {
          "headline":"Sift the flour and baking powder, using a flour sifter.",
          "description":""
        },
        {
          "headline":"Add the sugar in the baking powder and flour.",
          "description":""
        },
        {
          "headline":"Make sure the butter is at room temperature.",
          "description":"Beat the ingredients with an electric whisk."
        },
        {
          "headline":"Add the two eggs, again using the electric whisk.",
          "description":"And add the vanilla essence."
        },
        {
          "headline":"Pour the batter into a 20cm-/8-inch round tin.",
          "description":"Bake for 30 minutes."
        },
        {
          "headline":"Insert a skewer into the cake.",
          "description":"If it comes out clean it's ready, and if it doesn't, then bake for an extra five minutes."
        },
        {
          "headline":"Remove the sponge cake from the oven.",
          "description":"Tip onto the lined wire rack and leave to cool."
        },
        {
          "headline":"Sprinkle with icing sugar/confectioner's sugar as a garnish.",
          "description":"It's now ready to serve."
        }
      ]
    },
    {
      "name":"Making a Vanilla Sponge Cake Sandwich",
      "steps":[
        {
          "headline":"Preheat the oven to 180ºC/350ºF.",
          "description":"Prepare two sponge baking pans measuring 20cm round. Grease the sides and line the base with baking/parchment paper. Cover a wire baking rack with parchment paper."
        },
        {
          "headline":"Use an electric mixer to beat the ingredients.",
          "description":"Add the butter, vanilla extract and sugar to the mixing bowl. Beat until the mixture becomes fluffy and light."
        },
        {
          "headline":"Add the eggs one at a time.",
          "description":"Beat them into the mixture. Then beat in the milk."
        },
        {
          "headline":"Add the sifted flour, a half amount at a time.",
          "description":"Stir in each batch of flour thoroughly."
        },
        {
          "headline":"Transfer the sponge cake batter to each pan.",
          "description":"Divide the batter evenly."
        },
        {
          "headline":"Place the cake pans into the oven.",
          "description":"Bake for 30 minutes."
        },
        {
          "headline":"Remove from the oven.",
          "description":"Tip the two halves out onto the wire rack to cool. Turn them over to have the top side facing upward before leaving to cool."
        },
        {
          "headline":"Transfer the base half to a serving plate.",
          "description":"Spread the jam over the top of one half once cooled. Place the other half onto the jam covering to sandwich the two together. If you like, whipped cream can also be piped on top of the jam."
        },
        {
          "headline":"Serve.",
          "description":"If wished, you can dust with icing sugar to complete the look. Cut into slices for serving."
        }
      ]
    }
  ],
  "text":" Making a Vanilla Sponge Cake Preheat the oven to 180ºC/350ºF. Prepare the cake pan. Line the base with parchment/baking paper and grease the edges of the pan. Line a wire baking rack with parchment/baking paper. Sift the flour and baking powder, using a flour sifter.  Add the sugar in the baking powder and flour.  Make sure the butter is at room temperature. Beat the ingredients with an electric whisk. Add the two eggs, again using the electric whisk. And add the vanilla essence. Pour the batter into a 20cm-/8-inch round tin. Bake for 30 minutes. Insert a skewer into the cake. If it comes out clean it's ready, and if it doesn't, then bake for an extra five minutes. Remove the sponge cake from the oven. Tip onto the lined wire rack and leave to cool. Sprinkle with icing sugar/confectioner's sugar as a garnish. It's now ready to serve. Making a Vanilla Sponge Cake Sandwich Preheat the oven to 180ºC/350ºF. Prepare two sponge baking pans measuring 20cm round. Grease the sides and line the base with baking/parchment paper. Cover a wire baking rack with parchment paper. Use an electric mixer to beat the ingredients. Add the butter, vanilla extract and sugar to the mixing bowl. Beat until the mixture becomes fluffy and light. Add the eggs one at a time. Beat them into the mixture. Then beat in the milk. Add the sifted flour, a half amount at a time. Stir in each batch of flour thoroughly. Transfer the sponge cake batter to each pan. Divide the batter evenly. Place the cake pans into the oven. Bake for 30 minutes. Remove from the oven. Tip the two halves out onto the wire rack to cool. Turn them over to have the top side facing upward before leaving to cool. Transfer the base half to a serving plate. Spread the jam over the top of one half once cooled. Place the other half onto the jam covering to sandwich the two together. If you like, whipped cream can also be piped on top of the jam. Serve. If wished, you can dust with icing sugar to complete the look. Cut into slices for serving.",
  "tyn_model":[
    "oven",
    "flour",
    "parchment/baking paper",
    "baking powder",
    "sugar",
    "butter",
    "electric whisk",
    "eggs",
    "sponge cake",
    "wire rack",
    "icing sugar",
    "cake pan",
    "baking rack",
    "flour sifter",
    "vanilla essence",
    "confectioner's sugar",
    "sponge baking pans",
    "baking/parchment paper",
    "parchment paper",
    "electric mixer",
    "vanilla extract",
    "mixing bowl",
    "milk",
    "cake pans",
    "serving plate",
    "jam",
    "whipped cream"
  ],
  "tyn_section":[

  ]
}