{
  "title":"How to Paint Exterior Walls With a Paint Sprayer",
  "url":"https://www.wikihow.com/Paint-Exterior-Walls-With-a-Paint-Sprayer",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "steps":[
    {
      "headline":"Cover all plants, sidewalks, railings, and other sensitive surfaces around the wall with a tarp or a cloth.",
      "description":"Secure the tarp or cloth with stones or weights."
    },
    {
      "headline":"Cover any windows and doors in or around the wall with tarps or sheeting.",
      "description":"Secure the sheeting with tape so that there are no gaps between the tarp or sheeting and the wall or the surface."
    },
    {
      "headline":"Remove any elements that are not easily covered, such as protruding grates, screws, outlets, or switches.",
      "description":""
    },
    {
      "headline":"Practice using a paint sprayer against a disposable surface such as a plank of wood.",
      "description":""
    },
    {
      "headline":"Become familiar with the rate of spray, the ease with which the trigger moves, and the consistency of paint you desire.",
      "description":""
    },
    {
      "headline":"Plan a path along which you will paint the wall.",
      "description":"You should begin in corners and move laterally. Start at the top of the wall so that you can move down in smooth motions rather than being obliged to move up your ladder or stairs after starting at the bottom."
    },
    {
      "headline":"Begin to spray paint with a steady stream.",
      "description":"You should keep the sprayer about one foot (or 30 cm.) away from the wall. Make sure that the sprayer is at a 90-degree angle from the wall."
    },
    {
      "headline":"Maintain a constant motion as you paint.",
      "description":"Do not pause in one spot or let your finger off the trigger."
    },
    {
      "headline":"Take special care not to add additional paint to corners or other areas over which the sprayer passes constantly.",
      "description":""
    },
    {
      "headline":"Finish the coat of paint at the bottom of the wall by keeping the paint sprayer a few inches (or several cm.)",
      "description":"above the ground rather than pointing the tip towards the foundation."
    },
    {
      "headline":"Go over your first coat of paint again if you desire a more durable paint job or a deeper color.",
      "description":""
    }
  ],
  "text":" Cover all plants, sidewalks, railings, and other sensitive surfaces around the wall with a tarp or a cloth. Secure the tarp or cloth with stones or weights. Cover any windows and doors in or around the wall with tarps or sheeting. Secure the sheeting with tape so that there are no gaps between the tarp or sheeting and the wall or the surface. Remove any elements that are not easily covered, such as protruding grates, screws, outlets, or switches.  Practice using a paint sprayer against a disposable surface such as a plank of wood.  Become familiar with the rate of spray, the ease with which the trigger moves, and the consistency of paint you desire.  Plan a path along which you will paint the wall. You should begin in corners and move laterally. Start at the top of the wall so that you can move down in smooth motions rather than being obliged to move up your ladder or stairs after starting at the bottom. Begin to spray paint with a steady stream. You should keep the sprayer about one foot (or 30 cm.) away from the wall. Make sure that the sprayer is at a 90-degree angle from the wall. Maintain a constant motion as you paint. Do not pause in one spot or let your finger off the trigger. Take special care not to add additional paint to corners or other areas over which the sprayer passes constantly.  Finish the coat of paint at the bottom of the wall by keeping the paint sprayer a few inches (or several cm.) above the ground rather than pointing the tip towards the foundation. Go over your first coat of paint again if you desire a more durable paint job or a deeper color. ",
  "tyn_model":[
    "paint",
    "tarp",
    "sprayer",
    "paint sprayer",
    "tarps",
    "tape",
    "spray paint"
  ],
  "tyn_section":[

  ]
}