{
  "title":"How to Make a Cobb Salad",
  "url":"https://www.wikihow.com/Make-a-Cobb-Salad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Salads"
  ],
  "steps":[
    {
      "headline":"Select your lettuces.",
      "description":"The traditional recipe uses a blend of lettuces including Romaine, iceberg, watercress and endives but you can use any lettuce you wish. Some recipes use a baby lettuce blend or spring mix in place of the traditional lettuces."
    },
    {
      "headline":"Chop the lettuces, if you are using adult lettuces.",
      "description":"If you are using baby lettuces, they will be close to bite-sized and you can use it straight out of the pack."
    },
    {
      "headline":"Put a mound of the lettuce in the bottom of the dinner plate or pasta bowl.",
      "description":"The lip around the plate will keep the salad from sliding off when you eat it."
    },
    {
      "headline":"Cut a small tomato in half, remove the seeds and cut one of the halves into cubes.",
      "description":"Arrange the tomato in a line across the center of the bed of lettuce. The traditional recipe uses a red tomato but you can also use a yellow or orange tomato to give it a different color and flavor. You can also substitute the large tomato with 5 or 6 grape tomatoes."
    },
    {
      "headline":"Pull about 4 oz.",
      "description":"(.113 kg) of chicken breast into strips or cut it into cubes. Arrange the chicken in a line across the lettuce, next to the tomato. The traditional recipe uses broiled or roasted chicken breast but you can also use grilled breast or choose fried chicken tenders for a southern twist."
    },
    {
      "headline":"Arrange pieces of bacon in a line across the lettuce, on the other side of the tomato.",
      "description":"You can use any type of bacon you wish, including store-bought bacon bits."
    },
    {
      "headline":"Cut hard-boiled egg into chunks and line them up next to the bacon bits.",
      "description":"You can also cut the egg into slices but the Cobb is traditionally a chop salad."
    },
    {
      "headline":"Cut avocado into chunks and line them up next to the chicken breast.",
      "description":"You can also cut the avocado into slices."
    },
    {
      "headline":"Line up blue cheese or Roquefort crumbles next to the avocado and the boiled egg.",
      "description":"The entire surface of the salad should be covered with lines of toppings."
    },
    {
      "headline":"Chop chives and sprinkle them over the entire salad.",
      "description":""
    },
    {
      "headline":"Serve the dressing or your choice on the side.",
      "description":"The traditional dressing is a red wine vinaigrette but you can also use a blue cheese, ranch or balsamic dressing."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Select your lettuces. The traditional recipe uses a blend of lettuces including Romaine, iceberg, watercress and endives but you can use any lettuce you wish. Some recipes use a baby lettuce blend or spring mix in place of the traditional lettuces. Chop the lettuces, if you are using adult lettuces. If you are using baby lettuces, they will be close to bite-sized and you can use it straight out of the pack. Put a mound of the lettuce in the bottom of the dinner plate or pasta bowl. The lip around the plate will keep the salad from sliding off when you eat it. Cut a small tomato in half, remove the seeds and cut one of the halves into cubes. Arrange the tomato in a line across the center of the bed of lettuce. The traditional recipe uses a red tomato but you can also use a yellow or orange tomato to give it a different color and flavor. You can also substitute the large tomato with 5 or 6 grape tomatoes. Pull about 4 oz. (.113 kg) of chicken breast into strips or cut it into cubes. Arrange the chicken in a line across the lettuce, next to the tomato. The traditional recipe uses broiled or roasted chicken breast but you can also use grilled breast or choose fried chicken tenders for a southern twist. Arrange pieces of bacon in a line across the lettuce, on the other side of the tomato. You can use any type of bacon you wish, including store-bought bacon bits. Cut hard-boiled egg into chunks and line them up next to the bacon bits. You can also cut the egg into slices but the Cobb is traditionally a chop salad. Cut avocado into chunks and line them up next to the chicken breast. You can also cut the avocado into slices. Line up blue cheese or Roquefort crumbles next to the avocado and the boiled egg. The entire surface of the salad should be covered with lines of toppings. Chop chives and sprinkle them over the entire salad.  Serve the dressing or your choice on the side. The traditional dressing is a red wine vinaigrette but you can also use a blue cheese, ranch or balsamic dressing. Finished. ",
  "tyn_model":[
    "lettuce",
    "lettuces",
    "tomato",
    "bacon",
    "chicken breast",
    "avocado",
    "blue cheese",
    "iceberg",
    "watercress",
    "endives",
    "dinner plate",
    "pasta bowl",
    "plate",
    "chicken",
    "grilled breast",
    "egg",
    "roquefort crumbles",
    "boiled egg",
    "chives",
    "red wine vinaigrette",
    "balsamic dressing"
  ],
  "tyn_section":[

  ]
}