{
  "title":"How to Buy Tomatoes",
  "url":"https://www.wikihow.com/Buy-Tomatoes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "methods":[
    {
      "name":"Choosing Fresh, Ripe Tomatoes",
      "steps":[
        {
          "headline":"Opt for locally grown tomatoes for better flavor and nutrition.",
          "description":"Tomatoes that have been grown close to where you live require less shipping time. This means that they haven’t been picked as early as foreign-grown tomatoes, so they will have more flavor and nutrients. Look for a sign above the tomatoes in the supermarket to see where they have been grown. If you can’t find locally grown tomatoes in your supermarket, try going to a local farmers market instead."
        },
        {
          "headline":"Buy vine-ripened tomatoes, which also tend to be more flavorful and nutritious.",
          "description":"These tomatoes have a richer flavor, are redder, and are more nutrient-dense. Look for a sign above the tomatoes that advertises them as being vine-ripened. These are generally only available during the summer months, as they don’t store well. If the tomatoes are sold on a small piece of vine, you can presume that they were vine-ripened."
        },
        {
          "headline":"Pick tomatoes that have an even red color to ensure ripeness.",
          "description":"A consistent red color over the whole tomato indicates that it spent a good amount of time on the vine before it was picked. This helps to give the tomato a nice, earthy flavor. Avoid buying tomatoes with green or yellow patches, as this indicates that they haven’t ripened properly. Green tomatoes don’t tend to ripen well at home and will likely stay hard. This is a general rule; however, there are a few exceptions. Some heirloom and cherry tomatoes are delicious and perfectly ripe when they’re green, yellow, or even striped."
        },
        {
          "headline":"Choose tomatoes with a sweet, earthy smell to maximize flavor.",
          "description":"Pick up the tomatoes and smell them. You will notice that some tomatoes have a much richer smell than other tomatoes. The more fragrant the tomato, the better its flavour. This is because they have generally had more sun exposure than tomatoes with no fragrance. Try not to squeeze the tomatoes when you pick them up, as this can bruise them."
        },
        {
          "headline":"Look for tomatoes with smooth, unwrinkled skin.",
          "description":"Tomatoes that are rich in flavour tend to have nice tight skin. Check each tomato for signs of wrinkles and cuts before you buy it. Don’t worry if the tomato is a funny shape – this is natural. Just look at the quality of its skin. Avoid buying tomatoes that have been at the bottom of the tomato tray, as these will often have cuts and bruises on their skin."
        }
      ]
    },
    {
      "name":"Selecting Specific Tomato Types",
      "steps":[
        {
          "headline":"Purchase cherry tomatoes if you want really sweet tomatoes.",
          "description":"These small, round tomatoes are the perfect addition to salads and stir-fries. They have a delicious sweet taste that can help to add flavour to your dish. This yummy variety of tomatoes can also be enjoyed on their own. Cherry tomatoes can be red, yellow, and orange. If the store doesn’t have cherry tomatoes, opt for grape tomatoes instead, as these have a similar flavour."
        },
        {
          "headline":"Purchase Beefsteak tomatoes if you want to slice them.",
          "description":"This variety of tomatoes is one of the most popular supermarket types. Beefsteak tomatoes are normally large and round, and are easy to slice. This makes them perfect for salads and sandwiches. This tomato variety has quite a neutral flavour. Use Beefsteak tomatoes in any recipes that require tomatoes."
        },
        {
          "headline":"Buy Roma tomatoes if you’re making an Italian dish.",
          "description":"These tomatoes have a slightly oval shape and are often sold on a vine. They have a slightly herby taste, which makes them perfect for Italian dishes, such as Bolognese, Lasagne, and Pasta. These tomatoes can also be used in general cooking."
        },
        {
          "headline":"Use the versatile Campari variety for any recipe that requires tomatoes.",
          "description":"These tomatoes have a rich, fragrant taste and can be used in many different dishes. Use these tomatoes in any recipe that includes tomatoes, but doesn’t specify which type. This variety of tomato is also great for making sauces and chutneys with. These tomatoes are also known as vine tomatoes."
        },
        {
          "headline":"Opt for Kumato tomatoes if you want a slightly sour taste.",
          "description":"This variety of tomatoes have a slight purple tinge and are a little sour. Use these tomatoes in salads, as they taste fresh and look beautiful when they are cut up. If you can’t find these tomatoes in your supermarket, try looking in an organic fruit and vegetable store."
        },
        {
          "headline":"Buy heirloom tomatoes to add color and flavor to sandwiches and salads.",
          "description":"Heirloom tomatoes come in a range of colors, including red, yellow, and orange. Slice these tomatoes and add them to your dish to add beautiful bright colors. These tomatoes also have a delicious tangy flavor and help to add a slightly sour taste to your meal. Avoid using heirloom tomatoes if a recipe asks for regular tomatoes, as the taste is a little different."
        }
      ]
    },
    {
      "name":"Buying Canned and Pureed Tomatoes",
      "steps":[
        {
          "headline":"Opt for whole canned tomatoes if you want an unprocessed option.",
          "description":"This type of tomatoes tends to be the least processed and don’t normally have added seasonings and flavorings. This makes them more versatile, as it allows you to add your own flavors to the tomatoes. To turn these tomatoes into pureed tomatoes, simply blend them in a food processor."
        },
        {
          "headline":"Use canned, diced tomatoes in any recipe that requires them.",
          "description":"These tomatoes can be used as a quick substitute for their fresh counterpart. This is particularly useful if fresh tomatoes are out of season. These tomatoes taste delicious in soups, stews, and bolognese. If you prefer smaller pieces of tomatoes, opt for crushed tomatoes instead. These are the same as diced tomatoes, but are in slightly smaller chunks."
        },
        {
          "headline":"Choose tomato puree if you want to make a sauce.",
          "description":"Pureed tomatoes have a smooth consistency, which makes them the perfect base for a tomato sauce or a soup. Add a little salt and pepper to the puree to season your sauce. Complete the sauce with your favorite herbs and spices. Basil and thyme tastes delicious with tomato puree."
        }
      ]
    }
  ],
  "text":" Choosing Fresh, Ripe Tomatoes Opt for locally grown tomatoes for better flavor and nutrition. Tomatoes that have been grown close to where you live require less shipping time. This means that they haven’t been picked as early as foreign-grown tomatoes, so they will have more flavor and nutrients. Look for a sign above the tomatoes in the supermarket to see where they have been grown. If you can’t find locally grown tomatoes in your supermarket, try going to a local farmers market instead. Buy vine-ripened tomatoes, which also tend to be more flavorful and nutritious. These tomatoes have a richer flavor, are redder, and are more nutrient-dense. Look for a sign above the tomatoes that advertises them as being vine-ripened. These are generally only available during the summer months, as they don’t store well. If the tomatoes are sold on a small piece of vine, you can presume that they were vine-ripened. Pick tomatoes that have an even red color to ensure ripeness. A consistent red color over the whole tomato indicates that it spent a good amount of time on the vine before it was picked. This helps to give the tomato a nice, earthy flavor. Avoid buying tomatoes with green or yellow patches, as this indicates that they haven’t ripened properly. Green tomatoes don’t tend to ripen well at home and will likely stay hard. This is a general rule; however, there are a few exceptions. Some heirloom and cherry tomatoes are delicious and perfectly ripe when they’re green, yellow, or even striped. Choose tomatoes with a sweet, earthy smell to maximize flavor. Pick up the tomatoes and smell them. You will notice that some tomatoes have a much richer smell than other tomatoes. The more fragrant the tomato, the better its flavour. This is because they have generally had more sun exposure than tomatoes with no fragrance. Try not to squeeze the tomatoes when you pick them up, as this can bruise them. Look for tomatoes with smooth, unwrinkled skin. Tomatoes that are rich in flavour tend to have nice tight skin. Check each tomato for signs of wrinkles and cuts before you buy it. Don’t worry if the tomato is a funny shape – this is natural. Just look at the quality of its skin. Avoid buying tomatoes that have been at the bottom of the tomato tray, as these will often have cuts and bruises on their skin. Selecting Specific Tomato Types Purchase cherry tomatoes if you want really sweet tomatoes. These small, round tomatoes are the perfect addition to salads and stir-fries. They have a delicious sweet taste that can help to add flavour to your dish. This yummy variety of tomatoes can also be enjoyed on their own. Cherry tomatoes can be red, yellow, and orange. If the store doesn’t have cherry tomatoes, opt for grape tomatoes instead, as these have a similar flavour. Purchase Beefsteak tomatoes if you want to slice them. This variety of tomatoes is one of the most popular supermarket types. Beefsteak tomatoes are normally large and round, and are easy to slice. This makes them perfect for salads and sandwiches. This tomato variety has quite a neutral flavour. Use Beefsteak tomatoes in any recipes that require tomatoes. Buy Roma tomatoes if you’re making an Italian dish. These tomatoes have a slightly oval shape and are often sold on a vine. They have a slightly herby taste, which makes them perfect for Italian dishes, such as Bolognese, Lasagne, and Pasta. These tomatoes can also be used in general cooking. Use the versatile Campari variety for any recipe that requires tomatoes. These tomatoes have a rich, fragrant taste and can be used in many different dishes. Use these tomatoes in any recipe that includes tomatoes, but doesn’t specify which type. This variety of tomato is also great for making sauces and chutneys with. These tomatoes are also known as vine tomatoes. Opt for Kumato tomatoes if you want a slightly sour taste. This variety of tomatoes have a slight purple tinge and are a little sour. Use these tomatoes in salads, as they taste fresh and look beautiful when they are cut up. If you can’t find these tomatoes in your supermarket, try looking in an organic fruit and vegetable store. Buy heirloom tomatoes to add color and flavor to sandwiches and salads. Heirloom tomatoes come in a range of colors, including red, yellow, and orange. Slice these tomatoes and add them to your dish to add beautiful bright colors. These tomatoes also have a delicious tangy flavor and help to add a slightly sour taste to your meal. Avoid using heirloom tomatoes if a recipe asks for regular tomatoes, as the taste is a little different. Buying Canned and Pureed Tomatoes Opt for whole canned tomatoes if you want an unprocessed option. This type of tomatoes tends to be the least processed and don’t normally have added seasonings and flavorings. This makes them more versatile, as it allows you to add your own flavors to the tomatoes. To turn these tomatoes into pureed tomatoes, simply blend them in a food processor. Use canned, diced tomatoes in any recipe that requires them. These tomatoes can be used as a quick substitute for their fresh counterpart. This is particularly useful if fresh tomatoes are out of season. These tomatoes taste delicious in soups, stews, and bolognese. If you prefer smaller pieces of tomatoes, opt for crushed tomatoes instead. These are the same as diced tomatoes, but are in slightly smaller chunks. Choose tomato puree if you want to make a sauce. Pureed tomatoes have a smooth consistency, which makes them the perfect base for a tomato sauce or a soup. Add a little salt and pepper to the puree to season your sauce. Complete the sauce with your favorite herbs and spices. Basil and thyme tastes delicious with tomato puree.",
  "tyn_model":[
    "tomatoes",
    "tomato",
    "cherry tomatoes",
    "tomato puree",
    "– this",
    "tomato tray",
    "grape tomatoes",
    "beefsteak tomatoes",
    "roma tomatoes",
    "pasta",
    "food processor",
    "crushed tomatoes",
    "tomato sauce",
    "salt and pepper",
    "puree",
    "basil",
    "thyme"
  ],
  "tyn_section":[

  ]
}