{
  "title":"How to Get Butter out of Clothing",
  "url":"https://www.wikihow.com/Get-Butter-out-of-Clothing",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Stain Removal",
    "Food Stains"
  ],
  "methods":[
    {
      "name":"Using Dishsoap and Spot Treatment",
      "steps":[
        {
          "headline":"Rub dishwashing soap into the stain.",
          "description":"Because dishwashing soaps are designed to deal with the fatty, greasy food products that build up on pots, pans, and plates, they’re also a good way to deal with butter when it gets on clothing. Dampen the stained area with lukewarm water. Apply a small amount of dishwashing soap to the stain. Rub at the stain gently with your fingers, making sure to spread the soap throughout the stained fabric."
        },
        {
          "headline":"Rinse thoroughly.",
          "description":"Using a sink or bathtub faucet, run warm-to-hot water over the stained area until the soap had been rinsed from the fabric. Make sure you’re not just catching the soap somewhere else in the fabric of the garment; hold the fabric taut so you can see that the suds have run off and down the drain."
        },
        {
          "headline":"Pretreat the stain with prewash stain remover.",
          "description":"If you’re dealing with something as stubborn as a butter stain, treat it with a concentrated stain fighter before running it, finally, through the washing machine. You can purchase prewash stain removers in the laundry aisle at the grocery store, or you can make your own at home. If you wish to make your own prewash stain remover, mix the following ingredients together: 1 1/2 cups of water\n1/4 cup of liquid castile soap (if you cannot find this in a store, it can be easily purchased online)\n1/4 cup of vegetable glycerine (again, available for purchase online)\n5-10 drops of lemon essential oil\n\nOnce the ingredients have been mixed, apply the product to the stain, rubbing it into the fabric gently with your fingers. Let the fabric soak for at least an hour (see specific brand instructions if you purchased a product in-store) before putting the garment through the washing machine."
        },
        {
          "headline":"Wash the stained garment in the washing machine.",
          "description":"The hotter the water, the higher the likelihood of the butter stain coming out, so use the hottest temperature allowable for the fabric of the stained piece of clothing. However, check the garment tag carefully to make sure that the fabric won’t be damaged by high temperatures. If so, use a lower temperature setting."
        },
        {
          "headline":"Check the stain before drying.",
          "description":"If the stain hasn’t been removed yet, you don’t want to run it through the dryer; the heat will cause the stain to set more permanently in the fabric. If the stain has not yet been removed, repeat the process of applying dish soap, rinsing, pretreating the stain, and washing one more time before putting the garment through the dryer. After a second round of treatment, the stain should be removed."
        }
      ]
    },
    {
      "name":"Using Cornstarch or Talcum Powder",
      "steps":[
        {
          "headline":"Treat the stain while it’s still fresh.",
          "description":"This method will work best if you get to the stain while it’s still wet, before it’s had a chance to really set into the fabric."
        },
        {
          "headline":"Lay the garment out on a flat surface.",
          "description":"Choose a location out of the way, where it won’t get jostled or knocked to the ground. You don’t want to make a bigger mess than you already have by getting powder all over the place!"
        },
        {
          "headline":"Sprinkle the product onto the stain.",
          "description":"Talcum powder and cornstarch are both incredibly absorbent. When you cover the fresh butter stain with a generous layer of either product, the powder will draw the butter out of the garment. Pat the powder gently down into the stain, but don’t rub it into the fabric."
        },
        {
          "headline":"Let the powder sit for at least 30 minutes.",
          "description":"The longer you let it sit on the stain, the better your chances of the butter being completely removed. At minimum, let it sit for half an hour before moving on to the next step."
        },
        {
          "headline":"Scrub the stain with an old toothbrush.",
          "description":"Use the toothbrush to loosen the talcum powder or cornstarch from the surface of the stain. Brush it away with your fingers and assess how much stain has been left behind. If the stain has not been completely removed, repeat the process until it has."
        }
      ]
    },
    {
      "name":"Using WD-40, Hairspray, or Lighter Fluid As Your Last Resort",
      "steps":[
        {
          "headline":"Know that you’re taking a risk.",
          "description":"Although some people have found success using WD-40, hairspray, and lighter fluid on especially tough grease stains, you run a high risk of damaging your clothing — for example, lighter fluid can damage the color of dyed clothing. These products can also leave behind a terrible smell that is more difficult to mask than the original stain. Test the product on a small, easily hidden patch of fabric on the garment before applying it to the stain. Let it sit for half an hour, then check whether or not the cloth has been damaged in any way. If not, proceed to the next step."
        },
        {
          "headline":"Apply the product to the stain.",
          "description":"WD-40 and hairspray come in spray bottles, so be sure to apply the product from a close range, keeping the spray area constrained to the stain. Lighter fluid tends to squirt out in big gushes, so apply it to a paper towel or dishcloth first, then rub the towel onto the stain. This will ensure you don’t drench your garment in lighter fluid and can control the area you wish to treat."
        },
        {
          "headline":"Scrub the stain with an old toothbrush.",
          "description":"Don’t rub hard enough to damage the cloth, but really try to work the product into the fabric and stain."
        },
        {
          "headline":"Wait for at least one hour.",
          "description":"Give the product enough time to loosen the butter stain. Set the garment aside somewhere and forget about it for an hour."
        },
        {
          "headline":"Wash the garment as usual in the laundry.",
          "description":"Again, use the hottest possible water setting allowable for the fabric you’re dealing with. The hotter the water, the better the chances of stain removal. Check the garment to make sure the stain has been removed before running it through the dryer, as the heat will set the stain even further."
        }
      ]
    }
  ],
  "text":" Using Dishsoap and Spot Treatment Rub dishwashing soap into the stain. Because dishwashing soaps are designed to deal with the fatty, greasy food products that build up on pots, pans, and plates, they’re also a good way to deal with butter when it gets on clothing. Dampen the stained area with lukewarm water. Apply a small amount of dishwashing soap to the stain. Rub at the stain gently with your fingers, making sure to spread the soap throughout the stained fabric. Rinse thoroughly. Using a sink or bathtub faucet, run warm-to-hot water over the stained area until the soap had been rinsed from the fabric. Make sure you’re not just catching the soap somewhere else in the fabric of the garment; hold the fabric taut so you can see that the suds have run off and down the drain. Pretreat the stain with prewash stain remover. If you’re dealing with something as stubborn as a butter stain, treat it with a concentrated stain fighter before running it, finally, through the washing machine. You can purchase prewash stain removers in the laundry aisle at the grocery store, or you can make your own at home. If you wish to make your own prewash stain remover, mix the following ingredients together: 1 1/2 cups of water\n1/4 cup of liquid castile soap (if you cannot find this in a store, it can be easily purchased online)\n1/4 cup of vegetable glycerine (again, available for purchase online)\n5-10 drops of lemon essential oil\n\nOnce the ingredients have been mixed, apply the product to the stain, rubbing it into the fabric gently with your fingers. Let the fabric soak for at least an hour (see specific brand instructions if you purchased a product in-store) before putting the garment through the washing machine. Wash the stained garment in the washing machine. The hotter the water, the higher the likelihood of the butter stain coming out, so use the hottest temperature allowable for the fabric of the stained piece of clothing. However, check the garment tag carefully to make sure that the fabric won’t be damaged by high temperatures. If so, use a lower temperature setting. Check the stain before drying. If the stain hasn’t been removed yet, you don’t want to run it through the dryer; the heat will cause the stain to set more permanently in the fabric. If the stain has not yet been removed, repeat the process of applying dish soap, rinsing, pretreating the stain, and washing one more time before putting the garment through the dryer. After a second round of treatment, the stain should be removed. Using Cornstarch or Talcum Powder Treat the stain while it’s still fresh. This method will work best if you get to the stain while it’s still wet, before it’s had a chance to really set into the fabric. Lay the garment out on a flat surface. Choose a location out of the way, where it won’t get jostled or knocked to the ground. You don’t want to make a bigger mess than you already have by getting powder all over the place! Sprinkle the product onto the stain. Talcum powder and cornstarch are both incredibly absorbent. When you cover the fresh butter stain with a generous layer of either product, the powder will draw the butter out of the garment. Pat the powder gently down into the stain, but don’t rub it into the fabric. Let the powder sit for at least 30 minutes. The longer you let it sit on the stain, the better your chances of the butter being completely removed. At minimum, let it sit for half an hour before moving on to the next step. Scrub the stain with an old toothbrush. Use the toothbrush to loosen the talcum powder or cornstarch from the surface of the stain. Brush it away with your fingers and assess how much stain has been left behind. If the stain has not been completely removed, repeat the process until it has. Using WD-40, Hairspray, or Lighter Fluid As Your Last Resort Know that you’re taking a risk. Although some people have found success using WD-40, hairspray, and lighter fluid on especially tough grease stains, you run a high risk of damaging your clothing — for example, lighter fluid can damage the color of dyed clothing. These products can also leave behind a terrible smell that is more difficult to mask than the original stain. Test the product on a small, easily hidden patch of fabric on the garment before applying it to the stain. Let it sit for half an hour, then check whether or not the cloth has been damaged in any way. If not, proceed to the next step. Apply the product to the stain. WD-40 and hairspray come in spray bottles, so be sure to apply the product from a close range, keeping the spray area constrained to the stain. Lighter fluid tends to squirt out in big gushes, so apply it to a paper towel or dishcloth first, then rub the towel onto the stain. This will ensure you don’t drench your garment in lighter fluid and can control the area you wish to treat. Scrub the stain with an old toothbrush. Don’t rub hard enough to damage the cloth, but really try to work the product into the fabric and stain. Wait for at least one hour. Give the product enough time to loosen the butter stain. Set the garment aside somewhere and forget about it for an hour. Wash the garment as usual in the laundry. Again, use the hottest possible water setting allowable for the fabric you’re dealing with. The hotter the water, the better the chances of stain removal. Check the garment to make sure the stain has been removed before running it through the dryer, as the heat will set the stain even further.",
  "tyn_model":[
    "water",
    "soap",
    "butter",
    "dryer",
    "talcum powder",
    "dishwashing soap",
    "wd-40,",
    "hairspray",
    "lighter fluid",
    "prewash stain remover",
    "concentrated stain fighter",
    "prewash stain removers",
    "liquid castile soap",
    "vegetable glycerine",
    "lemon essential oil",
    "washing machine",
    "fabric",
    "dish soap",
    "cornstarch or",
    "cornstarch",
    "— for",
    "wd-40 and hairspray",
    "paper towel",
    "towel"
  ],
  "tyn_section":[

  ]
}