{
  "title":"How to Buy Good Chocolate",
  "url":"https://www.wikihow.com/Buy-Good-Chocolate",
  "category_hierarchy":[
    "Food and Entertaining",
    "Appreciation of Food",
    "Chocophilia"
  ],
  "methods":[
    {
      "name":"Examining the Chocolate Packaging",
      "steps":[
        {
          "headline":"Confirm that cocoa byproducts are the top ingredients.",
          "description":"Good chocolate will have cocoa solids (the actual chocolate) and cocoa butter (the creaminess of the chocolate) as top ingredients. High-quality dark chocolate consists simply of cocoa solids, cocoa butter, and possibly vanilla, lecithin (an ingredient that keeps the chocolate from separating), and sugar. If you browse the list of ingredients and see many ingredients you do not recognize, consider purchasing a different chocolate. Milk or milk solids may be an ingredient in milk and white chocolates. Avoid chocolates that have sugar as the top ingredient or include additional fats or Dutch cocoa."
        },
        {
          "headline":"Buy chocolate that has been made recently.",
          "description":"Check the date the chocolate was made: the more recently the chocolate was made, the fresher it will be. Aged chocolate will lose some of its quality and taste. Dark chocolate should be eaten within 1 year after purchasing, and both milk and white chocolate should be eaten within 6 months after purchasing. The production date is a bigger factor for retail chocolates that are expected to have a longer shelf life than handmade or specialty chocolates."
        },
        {
          "headline":"Expect to pay more for high-quality chocolate.",
          "description":"Good chocolate will cost more than commercial grade chocolate, as it should. If you are looking for top-quality chocolate, expect to pay more for the quality. If you're buying a well-made bar of dark chocolate, for example, you will likely pay three or four times what you would for a mass-produced milk chocolate bar. A high price doesn't guarantee high-quality chocolate, though. Some sellers may try to sell commercial grade chocolates at a higher price. Price inflation can be especially prevalent if the chocolates are “pretty,” such as bonbons or truffles."
        },
        {
          "headline":"Do not buy chocolate that has been “Dutched.” If chocolate has undergone “Dutching,” the raw cacao beans have been processed with alkali.",
          "description":"Treatment with alkali results in a lower-quality chocolate, which you should avoid purchasing. Treating chocolate with alkali substantially reduces its health benefits. The process removes many of the compounds in chocolate (especially Flavanol) that are good for your heart."
        },
        {
          "headline":"Buy semisweet or unsweetened chocolate for baking needs.",
          "description":"If you're purchasing chocolate to put in baked goods—like brownies or chocolate cake batter—you'll most likely need a semisweet or unsweetened dark chocolate. Baking chocolate is typically sold in bars and will have a very high cocoa percentage, often over 70% cacao. Follow your recipe's directions, and buy a variety of baking chocolate that corresponds with the suggested cacao percentage. Baking chocolates will be located in the baking section of any grocery store. If you'd like to find an organic or all-natural brand, check the organic section, or visit a health-food grocery store. Depending on the recipe you're following, you can also bake with semi-sweet chocolate chips, wafers, or cocoa powder."
        }
      ]
    },
    {
      "name":"Handling the Chocolate",
      "steps":[
        {
          "headline":"Smell the chocolate.",
          "description":"High-quality chocolate will have a strong, pleasant aroma. A lack of discernible smell indicates old or poor-quality chocolate. Chocolate that smells of anything else means it has not been stored well. Chocolate absorbs the odor and flavor of its environment, so pay attention to whatever is on display nearby. In some high-end chocolate establishments, the owner may allow you to open a bar or package of chocolate that you'd like to buy so that you can evaluate the chocolate. In most stores, of course, opening chocolates prior to purchasing them is discouraged."
        },
        {
          "headline":"Evaluate the surface of the chocolate.",
          "description":"Good chocolate will have a glossy surface. The surface should also be consistent with no blemishes. If the surface of the chocolate you're inspecting seems uneven or flaky, you're likely looking at a low-quality confection. If a wrapper is impeding your ability to see the surface of the chocolate, you will have to use one of the other tips on buying good chocolate to help you determine the chocolate's quality."
        },
        {
          "headline":"Listen to and watch how the chocolate breaks.",
          "description":"In order to determine if the chocolate is of high quality, you need to break it in half. The action will result in a clean snapping sound in a high-quality chocolate. The chocolate should also break clean and in a straight line. If the chocolate bends or falls apart when you break it, the quality is inferior. Milk or white chocolates will also often bend, rather than snap, when pressure is exerted."
        },
        {
          "headline":"Taste the chocolate for a bitter flavor.",
          "description":"A high-quality dark chocolate will have a strong, bitter taste, since it has not been diluted by milk or unnecessary add-ins. Beyond taste, high quality chocolates will begin to melt in your mouth immediately. The texture should be creamy and smooth. Personal preference also comes into play at this point. The quality here can only be decided by tasting the chocolate to see if it is of the variety you are looking for. Some people like a very dark, bitter chocolate (over 80% cacao), while others like a milder dark chocolate. Chocolate that is inferior will taste a little off or feel grainy in your mouth."
        }
      ]
    },
    {
      "name":"Finding a High-Quality Chocolate Store",
      "steps":[
        {
          "headline":"Look for a gourmet food store or chocolatier.",
          "description":"Both of these types of establishments will focus on selling exclusively high-quality dark (and possibly milk) chocolate. The owners or managers will know a great deal about where their beans are sourced, how the chocolate is produced, and what ingredients it contains. Often these shops are locally owned and operated, so you're unlikely to find a chocolatier chain. Gourmet food stores likely import their chocolate from around the world, giving you access to a huge variety of high-quality products. Check out Cost Plus World Market, if there's one in your area."
        },
        {
          "headline":"Shop at a natural-foods store.",
          "description":"Natural-foods or health-foods stores are more likely to stock high-quality, high-cacao, non-Dutched chocolates. The majority of these chocolates will probably be sold as individually packaged bars which have been made with fair-trade ingredients. Check out stores like Trader Joe's, Whole Foods, Vitamin Cottage, or Wild Oats. Your local supermarket, on the other hand, will stock primarily mass-produced, low quality chocolate in all varieties. However, some supermarket chains are stocking more natural, high-quality foods—chocolate included. If your grocery store has a “natural” section, look for good chocolates here."
        },
        {
          "headline":"Special order from a supermarket or online.",
          "description":"If you're a more experienced chocolate shopper and you have an idea of what you'd like to try—or if you're starting out and want to sample a dozen different brands of dark chocolate—special ordering may be your best option. Most supermarkets and natural-foods stores will be happy to accommodate your requests. You can also find a great deal of good chocolate vendors online. Check online stores like Worldwide Chocolate, Chocosphere, or even Amazon."
        }
      ]
    }
  ],
  "text":" Examining the Chocolate Packaging Confirm that cocoa byproducts are the top ingredients. Good chocolate will have cocoa solids (the actual chocolate) and cocoa butter (the creaminess of the chocolate) as top ingredients. High-quality dark chocolate consists simply of cocoa solids, cocoa butter, and possibly vanilla, lecithin (an ingredient that keeps the chocolate from separating), and sugar. If you browse the list of ingredients and see many ingredients you do not recognize, consider purchasing a different chocolate. Milk or milk solids may be an ingredient in milk and white chocolates. Avoid chocolates that have sugar as the top ingredient or include additional fats or Dutch cocoa. Buy chocolate that has been made recently. Check the date the chocolate was made: the more recently the chocolate was made, the fresher it will be. Aged chocolate will lose some of its quality and taste. Dark chocolate should be eaten within 1 year after purchasing, and both milk and white chocolate should be eaten within 6 months after purchasing. The production date is a bigger factor for retail chocolates that are expected to have a longer shelf life than handmade or specialty chocolates. Expect to pay more for high-quality chocolate. Good chocolate will cost more than commercial grade chocolate, as it should. If you are looking for top-quality chocolate, expect to pay more for the quality. If you're buying a well-made bar of dark chocolate, for example, you will likely pay three or four times what you would for a mass-produced milk chocolate bar. A high price doesn't guarantee high-quality chocolate, though. Some sellers may try to sell commercial grade chocolates at a higher price. Price inflation can be especially prevalent if the chocolates are “pretty,” such as bonbons or truffles. Do not buy chocolate that has been “Dutched.” If chocolate has undergone “Dutching,” the raw cacao beans have been processed with alkali. Treatment with alkali results in a lower-quality chocolate, which you should avoid purchasing. Treating chocolate with alkali substantially reduces its health benefits. The process removes many of the compounds in chocolate (especially Flavanol) that are good for your heart. Buy semisweet or unsweetened chocolate for baking needs. If you're purchasing chocolate to put in baked goods—like brownies or chocolate cake batter—you'll most likely need a semisweet or unsweetened dark chocolate. Baking chocolate is typically sold in bars and will have a very high cocoa percentage, often over 70% cacao. Follow your recipe's directions, and buy a variety of baking chocolate that corresponds with the suggested cacao percentage. Baking chocolates will be located in the baking section of any grocery store. If you'd like to find an organic or all-natural brand, check the organic section, or visit a health-food grocery store. Depending on the recipe you're following, you can also bake with semi-sweet chocolate chips, wafers, or cocoa powder. Handling the Chocolate Smell the chocolate. High-quality chocolate will have a strong, pleasant aroma. A lack of discernible smell indicates old or poor-quality chocolate. Chocolate that smells of anything else means it has not been stored well. Chocolate absorbs the odor and flavor of its environment, so pay attention to whatever is on display nearby. In some high-end chocolate establishments, the owner may allow you to open a bar or package of chocolate that you'd like to buy so that you can evaluate the chocolate. In most stores, of course, opening chocolates prior to purchasing them is discouraged. Evaluate the surface of the chocolate. Good chocolate will have a glossy surface. The surface should also be consistent with no blemishes. If the surface of the chocolate you're inspecting seems uneven or flaky, you're likely looking at a low-quality confection. If a wrapper is impeding your ability to see the surface of the chocolate, you will have to use one of the other tips on buying good chocolate to help you determine the chocolate's quality. Listen to and watch how the chocolate breaks. In order to determine if the chocolate is of high quality, you need to break it in half. The action will result in a clean snapping sound in a high-quality chocolate. The chocolate should also break clean and in a straight line. If the chocolate bends or falls apart when you break it, the quality is inferior. Milk or white chocolates will also often bend, rather than snap, when pressure is exerted. Taste the chocolate for a bitter flavor. A high-quality dark chocolate will have a strong, bitter taste, since it has not been diluted by milk or unnecessary add-ins. Beyond taste, high quality chocolates will begin to melt in your mouth immediately. The texture should be creamy and smooth. Personal preference also comes into play at this point. The quality here can only be decided by tasting the chocolate to see if it is of the variety you are looking for. Some people like a very dark, bitter chocolate (over 80% cacao), while others like a milder dark chocolate. Chocolate that is inferior will taste a little off or feel grainy in your mouth. Finding a High-Quality Chocolate Store Look for a gourmet food store or chocolatier. Both of these types of establishments will focus on selling exclusively high-quality dark (and possibly milk) chocolate. The owners or managers will know a great deal about where their beans are sourced, how the chocolate is produced, and what ingredients it contains. Often these shops are locally owned and operated, so you're unlikely to find a chocolatier chain. Gourmet food stores likely import their chocolate from around the world, giving you access to a huge variety of high-quality products. Check out Cost Plus World Market, if there's one in your area. Shop at a natural-foods store. Natural-foods or health-foods stores are more likely to stock high-quality, high-cacao, non-Dutched chocolates. The majority of these chocolates will probably be sold as individually packaged bars which have been made with fair-trade ingredients. Check out stores like Trader Joe's, Whole Foods, Vitamin Cottage, or Wild Oats. Your local supermarket, on the other hand, will stock primarily mass-produced, low quality chocolate in all varieties. However, some supermarket chains are stocking more natural, high-quality foods—chocolate included. If your grocery store has a “natural” section, look for good chocolates here. Special order from a supermarket or online. If you're a more experienced chocolate shopper and you have an idea of what you'd like to try—or if you're starting out and want to sample a dozen different brands of dark chocolate—special ordering may be your best option. Most supermarkets and natural-foods stores will be happy to accommodate your requests. You can also find a great deal of good chocolate vendors online. Check online stores like Worldwide Chocolate, Chocosphere, or even Amazon.",
  "tyn_model":[
    "chocolate",
    "chocolates",
    "cocoa butter",
    "dark chocolate",
    "sugar",
    "milk",
    "baking chocolate",
    "vanilla",
    "cocoa",
    "“pretty",
    "” such",
    "“dutched",
    "” if",
    "“dutching",
    "” the",
    "—like",
    "chocolate cake batter",
    "—you'll",
    "baking chocolates",
    "chocolate chips",
    "cocoa powder",
    "natural-foods store",
    "natural-foods or health-foods stores",
    "vitamin cottage,",
    "wild oats",
    "—chocolate",
    "“natural",
    "” section",
    "—or",
    "—special",
    "natural-foods stores"
  ],
  "tyn_section":[

  ]
}