{
  "title":"How to Take a Sauna",
  "url":"https://www.wikihow.com/Take-a-Sauna",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "parts":[
    {
      "name":"Going into the Sauna",
      "steps":[
        {
          "headline":"Plan on taking a sauna if you're in good health.",
          "description":"Saunas can be relaxing and therapeutic for most people, but you should avoid them if you have unstable angina pectoris, severe aortic stenosis, or recent myocardial infarction. You should also stay out of the sauna if you have kidney disease, liver failure, or are pregnant. If you're unsure if you should take a sauna, speak with your doctor."
        },
        {
          "headline":"Start drinking water at least 3 hours before saunaing.",
          "description":"Since your body sweats a lot in a sauna, you need to hydrate beforehand. You can drink water while you're in the sauna, but it's better to give your body a chance to get ready for the intense heat. Although there's no recommended water intake amount, drink at least 1 to 2 more glasses than you usually drink.Tip: Try to eat or snack on something so you don't feel dizzy or lightheaded when you sauna. You can eat a moderate-size meal at least 2 hours before going in the sauna. Avoid drinking alcohol immediately before or while you're in the sauna since it can increase your risk for low blood pressure, irregular heartbeat, and sudden death."
        },
        {
          "headline":"Bring clean towels and sandals to the sauna.",
          "description":"You'll need 1 towel to lay on the sauna bench so you can sit on it and 1 towel to wrap around your body during or after saunaing. If you're using a public sauna, wear sandals or flip flops. You could also bring in a light snack and some water to drink. Saunas can be dim, so bring a small light if you plan on reading in the sauna."
        },
        {
          "headline":"Turn on the sauna 30 minutes before using it if you're saunaing at home.",
          "description":"It can take a while for home saunas to heat up, so turn it on at least 30 minutes before you go in. Heat the sauna to between 140 to 170 °F (60 to 77 °C) so it's comfortable for you. Keep in mind that some home saunas have a limit on how hot you can set them. Many saunas allow you to set a timer, so the sauna's heater will turn off after a set amount of time."
        },
        {
          "headline":"Shower to remove dirt before you get in the sauna.",
          "description":"You don't want to track dirt into the sauna, so it's important to shower before, especially if you've been working out and are already sweaty. This will also keep the sauna smelling better. Avoid rubbing fragranced lotion or cream on your skin when you get out of the shower since they can clog your skin."
        }
      ]
    },
    {
      "name":"Enhancing Your Sauna Experience",
      "steps":[
        {
          "headline":"Disrobe or wrap just a towel around you.",
          "description":"Many people get completely naked before stepping into the sauna. Since you'll be sweating a lot, the sweat would simply soak your clothes if you wore them in. If you don't feel comfortable being naked in the sauna, take your clothes off and wrap a clean towel around you. You should also remove jewelry or watches before you go in since these can heat up and get covered in sweat."
        },
        {
          "headline":"Ask someone to do the sauna with you.",
          "description":"Saunaing is often a social experience where you go with a friend. You might enjoy chatting with a friend while you relax and you can ask them to pour cool water over you. It's also a good idea to bring a friend in case you feel dizzy or unwell. If you prefer to take a sauna without clothes on, find out if your friend is comfortable with this. If they aren't, you can loosely wrap a towel around yourself."
        },
        {
          "headline":"Sit or lay on a sauna bench.",
          "description":"Spread 1 of the clean towels you brought with you on the bench that you'd like to sit on. You could also spread it out if you'd like to lay across the sauna bench. It's important to always sit or lay on the towel and not the wood.Tip: The benches that are higher in the sauna are hotter than the ones lower to the ground. Start with the lower benches if you're new to saunaing and don't want to overdo it. Since public saunas are shared spaces, you may not be able to stretch out if there are already several people inside the sauna. Remember to be considerate in the sauna."
        },
        {
          "headline":"Relax while you enjoy the heat of the sauna.",
          "description":"It's easy to feel rushed as you're trying to get ready for the sauna, but try to slow down and relax when you're in it. Let your muscles relax and try not to think about things that are causing you stress. Breathe deeply and unwind. Never take your phone or tablet into the sauna. You should minimize distractions or socialize with those around you!"
        },
        {
          "headline":"Limit your time in the sauna to about 20 minutes.",
          "description":"The amount of time you spend in the sauna depends on how comfortable you are. You might only want to sauna for 5 minutes or you may want to stay in longer so you really work up a sweat. Leave the sauna after about 20 minutes or if you feel:\nDizzy\nLightheaded\nNauseated\nHeadache"
        },
        {
          "headline":"Take cooling-off breaks while you sauna.",
          "description":"Although you can stay in the sauna for up to 20 minutes in 1 sitting, you can take short breaks where you step out of the sauna. Get out and take a cold shower or step outside if it's cold. Then, go back to the hot sauna and enjoy the warmth. You can alternate the cold breaks with the hot sauna as often as you like."
        }
      ]
    },
    {
      "name":"Getting out of the Sauna",
      "steps":[
        {
          "headline":"Step out of the sauna and air dry your skin.",
          "description":"When you're ready to get out, simply leave the sauna and stand without toweling off. If you're wearing a towel, you can leave it on, but let the residual heat from the sauna dry your skin.Tip: If you want to cool your body down quickly, follow this Finnish tradition: jump straight into a cold lake! Don't put your clothes on right away because they can make you overheat and begin sweating again."
        },
        {
          "headline":"Drink water throughout the day.",
          "description":"You need to replace the fluids you lost when you sweated in the sauna. To rehydrate, begin drinking water as soon as you get out of the sauna. Although there isn't a specific amount you should drink, try to drink at least 1 or 2 more glasses of water than you usually drink. You could also drink an electroylyte-rich drink if you're tired of drinking water."
        },
        {
          "headline":"Eat a snack or a light meal.",
          "description":"You might be hungry after taking the sauna, so have a small meal or snack once you get out. Consider eating something salty to replace sodium you might have lost by sweating. You could eat pretzels, crackers, cheese, sausages, and fresh fruit, for instance."
        },
        {
          "headline":"Take it easy the rest of the day.",
          "description":"Enjoy the feeling of complete relaxation and avoid rushing off to do strenuous things. Give your body a chance to acclimate and try to have a peaceful, calm attitude throughout your day. If you find it difficult to sauna during the day, take a sauna at night!"
        }
      ]
    }
  ],
  "text":" Going into the Sauna Plan on taking a sauna if you're in good health. Saunas can be relaxing and therapeutic for most people, but you should avoid them if you have unstable angina pectoris, severe aortic stenosis, or recent myocardial infarction. You should also stay out of the sauna if you have kidney disease, liver failure, or are pregnant. If you're unsure if you should take a sauna, speak with your doctor. Start drinking water at least 3 hours before saunaing. Since your body sweats a lot in a sauna, you need to hydrate beforehand. You can drink water while you're in the sauna, but it's better to give your body a chance to get ready for the intense heat. Although there's no recommended water intake amount, drink at least 1 to 2 more glasses than you usually drink.Tip: Try to eat or snack on something so you don't feel dizzy or lightheaded when you sauna. You can eat a moderate-size meal at least 2 hours before going in the sauna. Avoid drinking alcohol immediately before or while you're in the sauna since it can increase your risk for low blood pressure, irregular heartbeat, and sudden death. Bring clean towels and sandals to the sauna. You'll need 1 towel to lay on the sauna bench so you can sit on it and 1 towel to wrap around your body during or after saunaing. If you're using a public sauna, wear sandals or flip flops. You could also bring in a light snack and some water to drink. Saunas can be dim, so bring a small light if you plan on reading in the sauna. Turn on the sauna 30 minutes before using it if you're saunaing at home. It can take a while for home saunas to heat up, so turn it on at least 30 minutes before you go in. Heat the sauna to between 140 to 170 °F (60 to 77 °C) so it's comfortable for you. Keep in mind that some home saunas have a limit on how hot you can set them. Many saunas allow you to set a timer, so the sauna's heater will turn off after a set amount of time. Shower to remove dirt before you get in the sauna. You don't want to track dirt into the sauna, so it's important to shower before, especially if you've been working out and are already sweaty. This will also keep the sauna smelling better. Avoid rubbing fragranced lotion or cream on your skin when you get out of the shower since they can clog your skin. Enhancing Your Sauna Experience Disrobe or wrap just a towel around you. Many people get completely naked before stepping into the sauna. Since you'll be sweating a lot, the sweat would simply soak your clothes if you wore them in. If you don't feel comfortable being naked in the sauna, take your clothes off and wrap a clean towel around you. You should also remove jewelry or watches before you go in since these can heat up and get covered in sweat. Ask someone to do the sauna with you. Saunaing is often a social experience where you go with a friend. You might enjoy chatting with a friend while you relax and you can ask them to pour cool water over you. It's also a good idea to bring a friend in case you feel dizzy or unwell. If you prefer to take a sauna without clothes on, find out if your friend is comfortable with this. If they aren't, you can loosely wrap a towel around yourself. Sit or lay on a sauna bench. Spread 1 of the clean towels you brought with you on the bench that you'd like to sit on. You could also spread it out if you'd like to lay across the sauna bench. It's important to always sit or lay on the towel and not the wood.Tip: The benches that are higher in the sauna are hotter than the ones lower to the ground. Start with the lower benches if you're new to saunaing and don't want to overdo it. Since public saunas are shared spaces, you may not be able to stretch out if there are already several people inside the sauna. Remember to be considerate in the sauna. Relax while you enjoy the heat of the sauna. It's easy to feel rushed as you're trying to get ready for the sauna, but try to slow down and relax when you're in it. Let your muscles relax and try not to think about things that are causing you stress. Breathe deeply and unwind. Never take your phone or tablet into the sauna. You should minimize distractions or socialize with those around you! Limit your time in the sauna to about 20 minutes. The amount of time you spend in the sauna depends on how comfortable you are. You might only want to sauna for 5 minutes or you may want to stay in longer so you really work up a sweat. Leave the sauna after about 20 minutes or if you feel:\nDizzy\nLightheaded\nNauseated\nHeadache Take cooling-off breaks while you sauna. Although you can stay in the sauna for up to 20 minutes in 1 sitting, you can take short breaks where you step out of the sauna. Get out and take a cold shower or step outside if it's cold. Then, go back to the hot sauna and enjoy the warmth. You can alternate the cold breaks with the hot sauna as often as you like. Getting out of the Sauna Step out of the sauna and air dry your skin. When you're ready to get out, simply leave the sauna and stand without toweling off. If you're wearing a towel, you can leave it on, but let the residual heat from the sauna dry your skin.Tip: If you want to cool your body down quickly, follow this Finnish tradition: jump straight into a cold lake! Don't put your clothes on right away because they can make you overheat and begin sweating again. Drink water throughout the day. You need to replace the fluids you lost when you sweated in the sauna. To rehydrate, begin drinking water as soon as you get out of the sauna. Although there isn't a specific amount you should drink, try to drink at least 1 or 2 more glasses of water than you usually drink. You could also drink an electroylyte-rich drink if you're tired of drinking water. Eat a snack or a light meal. You might be hungry after taking the sauna, so have a small meal or snack once you get out. Consider eating something salty to replace sodium you might have lost by sweating. You could eat pretzels, crackers, cheese, sausages, and fresh fruit, for instance. Take it easy the rest of the day. Enjoy the feeling of complete relaxation and avoid rushing off to do strenuous things. Give your body a chance to acclimate and try to have a peaceful, calm attitude throughout your day. If you find it difficult to sauna during the day, take a sauna at night!",
  "tyn_model":[
    "sauna",
    "water",
    "towel",
    "saunas",
    "towels",
    "shower",
    "alcohol",
    "sandals",
    "flip flops",
    "lotion",
    "sauna bench",
    "benches",
    "lake",
    "crackers",
    "cheese",
    "sausages"
  ],
  "tyn_section":[

  ]
}