{
  "title":"How to Eat Yucca",
  "url":"https://www.wikihow.com/Eat-Yucca",
  "category_hierarchy":[
    "Food and Entertaining",
    "Appreciation of Food",
    "Eating Techniques"
  ],
  "methods":[
    {
      "name":"Harvesting Yucca Flowers",
      "steps":[
        {
          "headline":"Identify yucca plants.",
          "description":"Before you can pick any yucca flowers to eat, you have to be able to locate them. The plants usually have tough, evergreen leaves that are shaped like swords and grow on tall, fibrous stalks. In ideal conditions, yucca can grow to up to 30-feet tall. Its ornamental, edible flowers are white and bell-shaped. They sprout off the plant’s stalks in clusters, and typically bloom in late spring and early summer. You’ll find the yucca plant in the Southern and Western parts of the United States, including New Mexico, Arizona, Colorado, Texas, and California. It also grows in Central and South America. When the flowers are first starting to bloom, there may be a greenish tint to their petals. The flowers also produce a light, sweet fragrance that can attract insects."
        },
        {
          "headline":"Remove the flowers at right time.",
          "description":"Timing is everything when you’re picking yucca flowers for to eat. When the blooms are older, they can take on an unpleasant, bitter taste. For the best flavor, you should eat the flowers within the first two to three days of their opening. When you pick yucca flowers at their freshest, they usually have a mild, sweet taste that is similar to asparagus or artichokes. It’s a good idea to taste the petals of one of the yucca before you begin harvesting a large number of flowers. That way, you won’t waste your time picking a bunch of blooms that are too bitter to be eaten."
        },
        {
          "headline":"Check for insects and snip.",
          "description":"Yucca flowers produce a nectar that is appealing to a variety of insects, including ants. There is also a moth that serves as the flowers’ only pollinator, which lays its eggs in the flowers. That means you may find larvae on the flowers, which you don’t want to eat. Examine each flower that you’re planning to harvest to make sure that there are no insects present before cutting them off the stalk. You can use garden shears to clip the flowers off the plant, but the stems aren’t usually that thick so regular scissors can work well too. If you’re harvesting a large number of yucca blooms, it helps to have a bag that you can cut the flowers directly into it so you don’t drop any."
        },
        {
          "headline":"Wash the flowers and discard center bulb.",
          "description":"Even if the yucca plants were grown on your property where you know pesticides weren’t used, you must clean them before you eat them. Shake them to remove any insects that you might not have seen, and then wash under a fine mist or jet of water. Next, remove the center bulb, along with the stamens and pistils, from each flower because it has a bitter taste. If you want to keep the petals intact and are concerned about the washing process damaging them, you can also set them in a strainer inside a large bowl of water and let them soak. After washing the flowers, make sure to drain them carefully. Place them on paper towel to dry, so it can absorb any excess moisture."
        }
      ]
    },
    {
      "name":"Eating Yucca Raw",
      "steps":[
        {
          "headline":"Mix yucca into salads.",
          "description":"One of the most common ways to eat raw yucca flowers is in a salad. Their sweet, asparagus- or artichoke-like flavor pairs well with a variety of greens, and their attractive white color can brighten up a salad. Start with a base of your favorite greens, such as loose leaf or wild lettuce, and add some garden herbs. Mint, parsley, dill, and fennel are all good options. Finally, mix in some yucca flowers for color and flavor. You can leave the yucca flowers in tact as a garnish for the top of the salad, or toss the petals with the rest of the greens and herbs. A light salad dressing, such as a simple vinaigrette, works best with this type of salad. Mixing in other edible wild flowers, such as violets or dandelion petals, can add more color to your salad. Other garden herbs you may want to consider for the salad include cilantro, basil, chamomile, and chives."
        },
        {
          "headline":"Garnish drinks.",
          "description":"Edible flowers make attractive garnishes for beverages, and the yucca flower’s attractive shape and white color make it an ideal candidate for dressing up your favorite drink. You can use them as a garnish in cocktails, such as a Bloody Mary, or use them to make a simple glass of iced tea appear more festive. If you’re having a party, consider floating some yucca flowers in a bowl of punch. If you don’t want to use the yucca as a garnish but still want to give your beverages a more decorative look, you can also freeze the petals inside ice cubes, and use them to keep your drinks cold."
        },
        {
          "headline":"Decorate cakes.",
          "description":"If you want to make the cake for a birthday party, shower, or any special occasion stand out a little more, consider decorating it with fresh yucca flowers. All you have to do is frost the cake with your favorite icing, and press the blooms into the frosting in whatever arrangement you like. For added interest, you can alternate the yucca with other edible flowers in different, such as pansies or violets. The yucca flowers will look best on a cake with frosting that is a different color, so there’s some contrast between the white blooms and the icing. If you’re using a vanilla or cream frosting, consider adding food coloring to tint it. While you can obviously place the flowers on the top of the cake, don’t overlook the sides. You can create a striking look by pressing them all along the edges. You can also use the yucca flowers to decorate cupcakes. In most cases, a single bloom will be enough to decorate each cupcake."
        }
      ]
    },
    {
      "name":"Cooking Yucca",
      "steps":[
        {
          "headline":"Boil the flowers.",
          "description":"Raw yucca flower contain saponin, which is an ingredient used in soaps and cleansing agents. While it’s not toxic, some people experience a reaction from it, ranging from an upset stomach to a dry, irritated feeling in the throat. Fortunately, if you experience a reaction, you can remove the saponin by boiling the flowers. Fill a pot with enough water to cover all of the yucca flowers you’re preparing, and bring it to a boil. Add the flowers to the boiling water, and allow them to cook for approximately five minutes. Not only will the saponin be removed, the flowers will be more tender as well. Once you’ve boiled the flowers, you can use them as you would raw yucca, such as in salads, or incorporate them in other recipes that call for edible flowers, such as soups and stews."
        },
        {
          "headline":"Fry the flowers.",
          "description":"If you can’t quite sell your family on eating yucca raw or even boiled, deep frying the flowers may help convince them to give it a try. Pull the petals off the flowers, gather stacks of 3 to 4 petals, and dip them in tempura batter. Heat a pot of your favorite oil for deep frying to 360 degrees and drop the stacks of petals into the oil one at a time, letting them fry for 2 to 3 minutes or until golden brown. For a basic tempura batter, combine ½ cup flour, ½ cup cornstarch, ⅛ teaspoon baking soda, and ½ teaspoon salt. Mix in 1 cup sparkling water and 1 egg yolk, and you’ll have enough batter for the petals from 12 to 15 yucca flowers. When you remove the fried flowers from the oil, place them on a plate or tray that’s lined with paper towel. It will absorb the excess oil, so the yucca isn’t too greasy. Hot sauce makes an ideal dipping sauce for deep fried yucca. If you aren’t a fan of deep fried foods, you can also add yucca petals to your favorite stir fry recipe."
        },
        {
          "headline":"Mix the flowers into egg dishes.",
          "description":"Yucca flowers are often used to complement eggs in dishes such as omelets and frittatas. You can simply toss raw petals into the ingredients for your favorite egg dish, or sautee them along with other ingredients, such as onions, garlic, mushrooms, and herbs before adding them to the omelet or frittata. In Mexico and Central America, it’s common to mix yucca petals into scrambled eggs or fried eggs dishes, such as huevos rancheros."
        }
      ]
    }
  ],
  "text":" Harvesting Yucca Flowers Identify yucca plants. Before you can pick any yucca flowers to eat, you have to be able to locate them. The plants usually have tough, evergreen leaves that are shaped like swords and grow on tall, fibrous stalks. In ideal conditions, yucca can grow to up to 30-feet tall. Its ornamental, edible flowers are white and bell-shaped. They sprout off the plant’s stalks in clusters, and typically bloom in late spring and early summer. You’ll find the yucca plant in the Southern and Western parts of the United States, including New Mexico, Arizona, Colorado, Texas, and California. It also grows in Central and South America. When the flowers are first starting to bloom, there may be a greenish tint to their petals. The flowers also produce a light, sweet fragrance that can attract insects. Remove the flowers at right time. Timing is everything when you’re picking yucca flowers for to eat. When the blooms are older, they can take on an unpleasant, bitter taste. For the best flavor, you should eat the flowers within the first two to three days of their opening. When you pick yucca flowers at their freshest, they usually have a mild, sweet taste that is similar to asparagus or artichokes. It’s a good idea to taste the petals of one of the yucca before you begin harvesting a large number of flowers. That way, you won’t waste your time picking a bunch of blooms that are too bitter to be eaten. Check for insects and snip. Yucca flowers produce a nectar that is appealing to a variety of insects, including ants. There is also a moth that serves as the flowers’ only pollinator, which lays its eggs in the flowers. That means you may find larvae on the flowers, which you don’t want to eat. Examine each flower that you’re planning to harvest to make sure that there are no insects present before cutting them off the stalk. You can use garden shears to clip the flowers off the plant, but the stems aren’t usually that thick so regular scissors can work well too. If you’re harvesting a large number of yucca blooms, it helps to have a bag that you can cut the flowers directly into it so you don’t drop any. Wash the flowers and discard center bulb. Even if the yucca plants were grown on your property where you know pesticides weren’t used, you must clean them before you eat them. Shake them to remove any insects that you might not have seen, and then wash under a fine mist or jet of water. Next, remove the center bulb, along with the stamens and pistils, from each flower because it has a bitter taste. If you want to keep the petals intact and are concerned about the washing process damaging them, you can also set them in a strainer inside a large bowl of water and let them soak. After washing the flowers, make sure to drain them carefully. Place them on paper towel to dry, so it can absorb any excess moisture. Eating Yucca Raw Mix yucca into salads. One of the most common ways to eat raw yucca flowers is in a salad. Their sweet, asparagus- or artichoke-like flavor pairs well with a variety of greens, and their attractive white color can brighten up a salad. Start with a base of your favorite greens, such as loose leaf or wild lettuce, and add some garden herbs. Mint, parsley, dill, and fennel are all good options. Finally, mix in some yucca flowers for color and flavor. You can leave the yucca flowers in tact as a garnish for the top of the salad, or toss the petals with the rest of the greens and herbs. A light salad dressing, such as a simple vinaigrette, works best with this type of salad. Mixing in other edible wild flowers, such as violets or dandelion petals, can add more color to your salad. Other garden herbs you may want to consider for the salad include cilantro, basil, chamomile, and chives. Garnish drinks. Edible flowers make attractive garnishes for beverages, and the yucca flower’s attractive shape and white color make it an ideal candidate for dressing up your favorite drink. You can use them as a garnish in cocktails, such as a Bloody Mary, or use them to make a simple glass of iced tea appear more festive. If you’re having a party, consider floating some yucca flowers in a bowl of punch. If you don’t want to use the yucca as a garnish but still want to give your beverages a more decorative look, you can also freeze the petals inside ice cubes, and use them to keep your drinks cold. Decorate cakes. If you want to make the cake for a birthday party, shower, or any special occasion stand out a little more, consider decorating it with fresh yucca flowers. All you have to do is frost the cake with your favorite icing, and press the blooms into the frosting in whatever arrangement you like. For added interest, you can alternate the yucca with other edible flowers in different, such as pansies or violets. The yucca flowers will look best on a cake with frosting that is a different color, so there’s some contrast between the white blooms and the icing. If you’re using a vanilla or cream frosting, consider adding food coloring to tint it. While you can obviously place the flowers on the top of the cake, don’t overlook the sides. You can create a striking look by pressing them all along the edges. You can also use the yucca flowers to decorate cupcakes. In most cases, a single bloom will be enough to decorate each cupcake. Cooking Yucca Boil the flowers. Raw yucca flower contain saponin, which is an ingredient used in soaps and cleansing agents. While it’s not toxic, some people experience a reaction from it, ranging from an upset stomach to a dry, irritated feeling in the throat. Fortunately, if you experience a reaction, you can remove the saponin by boiling the flowers. Fill a pot with enough water to cover all of the yucca flowers you’re preparing, and bring it to a boil. Add the flowers to the boiling water, and allow them to cook for approximately five minutes. Not only will the saponin be removed, the flowers will be more tender as well. Once you’ve boiled the flowers, you can use them as you would raw yucca, such as in salads, or incorporate them in other recipes that call for edible flowers, such as soups and stews. Fry the flowers. If you can’t quite sell your family on eating yucca raw or even boiled, deep frying the flowers may help convince them to give it a try. Pull the petals off the flowers, gather stacks of 3 to 4 petals, and dip them in tempura batter. Heat a pot of your favorite oil for deep frying to 360 degrees and drop the stacks of petals into the oil one at a time, letting them fry for 2 to 3 minutes or until golden brown. For a basic tempura batter, combine ½ cup flour, ½ cup cornstarch, ⅛ teaspoon baking soda, and ½ teaspoon salt. Mix in 1 cup sparkling water and 1 egg yolk, and you’ll have enough batter for the petals from 12 to 15 yucca flowers. When you remove the fried flowers from the oil, place them on a plate or tray that’s lined with paper towel. It will absorb the excess oil, so the yucca isn’t too greasy. Hot sauce makes an ideal dipping sauce for deep fried yucca. If you aren’t a fan of deep fried foods, you can also add yucca petals to your favorite stir fry recipe. Mix the flowers into egg dishes. Yucca flowers are often used to complement eggs in dishes such as omelets and frittatas. You can simply toss raw petals into the ingredients for your favorite egg dish, or sautee them along with other ingredients, such as onions, garlic, mushrooms, and herbs before adding them to the omelet or frittata. In Mexico and Central America, it’s common to mix yucca petals into scrambled eggs or fried eggs dishes, such as huevos rancheros.",
  "tyn_model":[
    "yucca flowers",
    "yucca",
    "water",
    "oil",
    "paper towel",
    "herbs",
    "icing",
    "frosting",
    "tempura batter",
    "yucca petals",
    "yucca plants",
    "yucca plant",
    "’ only",
    "garden shears",
    "scissors",
    "pesticides",
    "strainer",
    "lettuce",
    "garden herbs",
    "mint",
    "parsley",
    "dill",
    "fennel",
    "salad dressing",
    "cilantro",
    "basil",
    "chamomile",
    "chives",
    "yucca flower",
    "iced tea",
    "punch",
    "ice cubes",
    "edible flowers",
    "cake",
    "food coloring",
    "cooking yucca",
    "pot",
    "flowers",
    "deep frying",
    "flour",
    "⅛ teaspoon",
    "baking soda",
    "salt",
    "sparkling water",
    "plate",
    "hot sauce",
    "stir fry",
    "eggs",
    "egg dish",
    "onions",
    "garlic",
    "mushrooms",
    "scrambled eggs",
    "fried eggs dishes"
  ],
  "tyn_section":[

  ]
}