{
  "title":"How to Buy Green Coffee Beans",
  "url":"https://www.wikihow.com/Buy-Green-Coffee-Beans",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee",
    "Coffee Beans"
  ],
  "parts":[
    {
      "name":"Choosing a Region",
      "steps":[
        {
          "headline":"Buy beans from Central or South America for a light to medium roast.",
          "description":"Light and medium roasts are great if you want to taste the different complex flavors originating from the coffee bean. Central and South American green coffee beans are also known for their delicate floral and citrus flavors, so consider this region if you like your coffee to be a little sweet. Some popular coffee-yielding countries in Central and South America are:\n\nMexico: Many Mexican green coffee beans are organic, and they're known for light nutty and chocolaty flavors. Costa Rica: Costa Rican green coffee beans make a heavy roast with nut and citrus flavors. Brazil: Brazilian coffee is often delicate and sweet, with chocolate and nut flavors."
        },
        {
          "headline":"Get beans from the Middle East or East Africa for bold, distinct coffee.",
          "description":"Several countries in this region dry process their coffee beans, which makes sweeter, heavier coffee. The Middle East and East Africa are known for producing coffees with unique, complex flavors, so try beans from this region if you want a roast that's very distinct. A few coffee-fan favorites from the region are:\n\nKenya: Kenyan green coffee beans are known to produce complex roasts with flavors like black currant and citrus. Ethiopia: Each coffee-producing region in Ethiopia produces beans with distinct flavors, ranging from fruity and sweet to nutty and spicy."
        },
        {
          "headline":"Buy beans cultivated in Indonesia for an earthy-tasting roast.",
          "description":"Many coffee bean producers in Indonesia dry the beans on parchment over clay, giving the beans their distinct flavor and making them a great option if you enjoy earthy, mushroom flavors."
        },
        {
          "headline":"Try beans produced in the Caribbean Islands for a roast with an island profile.",
          "description":"Jamaica is a particular favorite among coffee connoisseurs. Other places that produce green coffee beans with an island profile are:\n\nHaiti: Haitian coffee is known for its rich sweet and smooth taste. Puerto Rico: Coffee beans from Puerto Rico produce a roast that is sweet with caramel and chocolate flavors."
        }
      ]
    },
    {
      "name":"Asking Sellers about Their Beans",
      "steps":[
        {
          "headline":"Find out if the coffee beans are arabica or robusta.",
          "description":"If you're buying beans in person, ask the seller. If you're ordering the beans online, check the seller's website. Arabica and robusta are the two main types of coffee beans. They're grown and produced differently, and there are differences in their quality and flavor:\nArabica coffee beans are generally considered to produce a roast with more desirable flavors. They're more expensive than robusta beans. Robusta coffee beans are considered to have a less desirable flavor profile than arabica beans, but they're cheaper and some people like to use them in blends and espresso."
        },
        {
          "headline":"Ask how the coffee beans were processed.",
          "description":"The seller should be able to tell you, or if you're ordering online, it should be listed on the seller's website. If not, call or email them and ask. Dry (natural) processing and wet (washed) processing are the two main ways that green coffee beans are processed. Dry processing produces coffee beans that are sweeter and heavier with a more distinct taste. Wet processing produces coffee beans that have a light, clean taste."
        },
        {
          "headline":"Inquire about the coffee beans' characteristics.",
          "description":"If you know how you like your coffee - light or heavy, fruity or nutty, etc - look for green coffee beans that have those characteristics. Ask the seller about the profiles for their different coffee beans. A few characteristics that you want to keep in mind are:\n\nFlavor: Find green coffee beans with flavor profiles that sound good to you. If you like sweet things, look for beans that have flavors like chocolate, berry, and caramel. Acidity: Coffee that's more acidic tastes cleaner, crisper, and more refreshing. Body: The body of a coffee is how it feels in your mouth. Some coffees feel thick in the mouth, while others feel lighter and thinner. Balance: When a coffee is balanced, it means no one flavor stands out over the others. With a balanced coffee, you can enjoy all of the flavors in the roast equally. Complexity: Look for coffee beans that produce a complex roast if you want something with a lot of different flavors and characteristics. Complex coffees are multidimensional."
        }
      ]
    },
    {
      "name":"Making the Purchase",
      "steps":[
        {
          "headline":"Have an idea of what you want before you go to the store.",
          "description":"You should still ask the seller questions once you get there, but it will help if you know what you're looking for beforehand. Know what region you want your green coffee beans to come from. If there are any characteristics or flavor profiles you're really interested in, write them down on a piece of paper and bring it with you so you can show the seller. Not sure where to buy green coffee beans in person? Search online for “green coffee bean vendors near me” to find a local vendor."
        },
        {
          "headline":"Order online only if it's a trusted green coffee bean vendor.",
          "description":"Ordering green coffee beans online opens up your options, but it's important you research sellers before you buy from them. Read reviews from other customers to see if the green coffee beans they received were the same as advertised. If you notice a vendor has a lot of bad reviews, look for a different vendor. Keep in mind it could take several weeks to receive your green coffee beans if you're ordering them online."
        },
        {
          "headline":"Buy a small amount of green coffee beans at first.",
          "description":"Take the beans home and roast them. If you like the way your coffee tastes, go back to the vendor and buy a larger quantity. This will save you from spending a lot on a batch of green coffee beans you don't like."
        },
        {
          "headline":"Make sure your beans aren't roasted before you buy them.",
          "description":"Both green and roasted coffee beans are whole coffee beans that are sold in bags, so always double check with the seller that the beans you're purchasing are unroasted, green coffee beans. If there's a “roasted on” date on the bag, that means the coffee beans aren't green. Even if the bag doesn't say the beans are roasted, ask the seller just to be sure."
        },
        {
          "headline":"Store your green coffee beans in a clean, sealed container after you buy them.",
          "description":"Transfer them from the bag they came in to the container. Keep the container away from sunlight, extreme temperatures, and humidity. Stored properly, green coffee beans can last up to a year without any change in flavor."
        }
      ]
    }
  ],
  "text":" Choosing a Region Buy beans from Central or South America for a light to medium roast. Light and medium roasts are great if you want to taste the different complex flavors originating from the coffee bean. Central and South American green coffee beans are also known for their delicate floral and citrus flavors, so consider this region if you like your coffee to be a little sweet. Some popular coffee-yielding countries in Central and South America are:\n\nMexico: Many Mexican green coffee beans are organic, and they're known for light nutty and chocolaty flavors. Costa Rica: Costa Rican green coffee beans make a heavy roast with nut and citrus flavors. Brazil: Brazilian coffee is often delicate and sweet, with chocolate and nut flavors. Get beans from the Middle East or East Africa for bold, distinct coffee. Several countries in this region dry process their coffee beans, which makes sweeter, heavier coffee. The Middle East and East Africa are known for producing coffees with unique, complex flavors, so try beans from this region if you want a roast that's very distinct. A few coffee-fan favorites from the region are:\n\nKenya: Kenyan green coffee beans are known to produce complex roasts with flavors like black currant and citrus. Ethiopia: Each coffee-producing region in Ethiopia produces beans with distinct flavors, ranging from fruity and sweet to nutty and spicy. Buy beans cultivated in Indonesia for an earthy-tasting roast. Many coffee bean producers in Indonesia dry the beans on parchment over clay, giving the beans their distinct flavor and making them a great option if you enjoy earthy, mushroom flavors. Try beans produced in the Caribbean Islands for a roast with an island profile. Jamaica is a particular favorite among coffee connoisseurs. Other places that produce green coffee beans with an island profile are:\n\nHaiti: Haitian coffee is known for its rich sweet and smooth taste. Puerto Rico: Coffee beans from Puerto Rico produce a roast that is sweet with caramel and chocolate flavors. Asking Sellers about Their Beans Find out if the coffee beans are arabica or robusta. If you're buying beans in person, ask the seller. If you're ordering the beans online, check the seller's website. Arabica and robusta are the two main types of coffee beans. They're grown and produced differently, and there are differences in their quality and flavor:\nArabica coffee beans are generally considered to produce a roast with more desirable flavors. They're more expensive than robusta beans. Robusta coffee beans are considered to have a less desirable flavor profile than arabica beans, but they're cheaper and some people like to use them in blends and espresso. Ask how the coffee beans were processed. The seller should be able to tell you, or if you're ordering online, it should be listed on the seller's website. If not, call or email them and ask. Dry (natural) processing and wet (washed) processing are the two main ways that green coffee beans are processed. Dry processing produces coffee beans that are sweeter and heavier with a more distinct taste. Wet processing produces coffee beans that have a light, clean taste. Inquire about the coffee beans' characteristics. If you know how you like your coffee - light or heavy, fruity or nutty, etc - look for green coffee beans that have those characteristics. Ask the seller about the profiles for their different coffee beans. A few characteristics that you want to keep in mind are:\n\nFlavor: Find green coffee beans with flavor profiles that sound good to you. If you like sweet things, look for beans that have flavors like chocolate, berry, and caramel. Acidity: Coffee that's more acidic tastes cleaner, crisper, and more refreshing. Body: The body of a coffee is how it feels in your mouth. Some coffees feel thick in the mouth, while others feel lighter and thinner. Balance: When a coffee is balanced, it means no one flavor stands out over the others. With a balanced coffee, you can enjoy all of the flavors in the roast equally. Complexity: Look for coffee beans that produce a complex roast if you want something with a lot of different flavors and characteristics. Complex coffees are multidimensional. Making the Purchase Have an idea of what you want before you go to the store. You should still ask the seller questions once you get there, but it will help if you know what you're looking for beforehand. Know what region you want your green coffee beans to come from. If there are any characteristics or flavor profiles you're really interested in, write them down on a piece of paper and bring it with you so you can show the seller. Not sure where to buy green coffee beans in person? Search online for “green coffee bean vendors near me” to find a local vendor. Order online only if it's a trusted green coffee bean vendor. Ordering green coffee beans online opens up your options, but it's important you research sellers before you buy from them. Read reviews from other customers to see if the green coffee beans they received were the same as advertised. If you notice a vendor has a lot of bad reviews, look for a different vendor. Keep in mind it could take several weeks to receive your green coffee beans if you're ordering them online. Buy a small amount of green coffee beans at first. Take the beans home and roast them. If you like the way your coffee tastes, go back to the vendor and buy a larger quantity. This will save you from spending a lot on a batch of green coffee beans you don't like. Make sure your beans aren't roasted before you buy them. Both green and roasted coffee beans are whole coffee beans that are sold in bags, so always double check with the seller that the beans you're purchasing are unroasted, green coffee beans. If there's a “roasted on” date on the bag, that means the coffee beans aren't green. Even if the bag doesn't say the beans are roasted, ask the seller just to be sure. Store your green coffee beans in a clean, sealed container after you buy them. Transfer them from the bag they came in to the container. Keep the container away from sunlight, extreme temperatures, and humidity. Stored properly, green coffee beans can last up to a year without any change in flavor.",
  "tyn_model":[
    "coffee",
    "coffee beans",
    "coffee bean",
    "green coffee beans",
    "container",
    "beans",
    "robusta",
    "“green",
    "” to",
    "green coffee bean",
    "“roasted",
    "” date"
  ],
  "tyn_section":[

  ]
}