{
  "title":"How to Buy a Droid on eBay",
  "url":"https://www.wikihow.com/Buy-a-Droid-on-eBay",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Collecting"
  ],
  "methods":[
    {
      "name":"Finding Droid Phones on eBay",
      "steps":[
        {
          "headline":"Type \"Droid\" in the search bar at the top of the eBay homepage.",
          "description":""
        },
        {
          "headline":"Select \"Cell Phones and Smartphones\" from the drop-down menu located to the right of the search bar.",
          "description":""
        },
        {
          "headline":"Hit the \"Search\" button.",
          "description":"You will be taken to a list of products related to the Droid smartphone."
        }
      ]
    },
    {
      "name":"Final Selection and Purchase",
      "steps":[
        {
          "headline":"View the details of the Droid phones on eBay by clicking on the results that you see in the search list.",
          "description":"Read the details closely to help you decide which phone you want to buy."
        },
        {
          "headline":"Open the details page of the phone that you have decided to buy and enter the maximum amount that you are willing to pay for it in the \"Place bid\" area.",
          "description":"Ebay will automatically increase your bid if someone else bids higher than you, but never bid higher than the amount that you have entered."
        },
        {
          "headline":"Go to the \"Bids/Offers\" page through the \"My eBay\" link at the top of the page.",
          "description":"After the bidding has ended you should see the status of the phone change to \"Won\" on the \"Bids/Offers\" page if you were the highest bidder."
        },
        {
          "headline":"Press the \"Pay Now\" button to pay for the phone using the on-screen instructions.",
          "description":"Payments can usually be made through PayPal although other payment methods such as credit card or check may also be available."
        },
        {
          "headline":"Look for the receipt that you receive in your email inbox after you have made the payment.",
          "description":"The receipt will have details about the payment and when you can expect your phone to arrive through the mail."
        }
      ]
    }
  ],
  "text":" Finding Droid Phones on eBay Type \"Droid\" in the search bar at the top of the eBay homepage.  Select \"Cell Phones and Smartphones\" from the drop-down menu located to the right of the search bar.  Hit the \"Search\" button. You will be taken to a list of products related to the Droid smartphone. Final Selection and Purchase View the details of the Droid phones on eBay by clicking on the results that you see in the search list. Read the details closely to help you decide which phone you want to buy. Open the details page of the phone that you have decided to buy and enter the maximum amount that you are willing to pay for it in the \"Place bid\" area. Ebay will automatically increase your bid if someone else bids higher than you, but never bid higher than the amount that you have entered. Go to the \"Bids/Offers\" page through the \"My eBay\" link at the top of the page. After the bidding has ended you should see the status of the phone change to \"Won\" on the \"Bids/Offers\" page if you were the highest bidder. Press the \"Pay Now\" button to pay for the phone using the on-screen instructions. Payments can usually be made through PayPal although other payment methods such as credit card or check may also be available. Look for the receipt that you receive in your email inbox after you have made the payment. The receipt will have details about the payment and when you can expect your phone to arrive through the mail.",
  "tyn_model":[
    "phone",
    "droid phones",
    "ebay",
    "cell phones",
    "smartphones",
    "smartphone",
    "paypal"
  ],
  "tyn_section":[

  ]
}