{
  "title":"How to Draw a Horse Saddle",
  "url":"https://www.wikihow.com/Draw-a-Horse-Saddle",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "steps":[
    {
      "headline":"Draw a half-circle shape.",
      "description":"Have the round part of the saddle be pointing downwards, as shown."
    },
    {
      "headline":"Draw a second half-circle shape overlapping the first.",
      "description":"Next to this sketch in a smaller, teardrop-like shape to serve as the base of the grip."
    },
    {
      "headline":"Draw a bone-like-shape for the grip.",
      "description":"This should be coming straight off the front of the saddle, so don't hesitate to draw it boldly."
    },
    {
      "headline":"Draw a banana-shaped form on top of the half circles.",
      "description":"This will serve as the seat itself. Also add a portion to the top of the grip."
    },
    {
      "headline":"Draw a curvy \"W\" for the fender.",
      "description":"Add stretched drop shapes for the stirrups."
    },
    {
      "headline":"Make the base of the stirrup by drawing two parallel sections.",
      "description":"These should connect the sides of the stirrup so a foot could rest in it comfortably."
    },
    {
      "headline":"Use different shades of brown to color in your saddle.",
      "description":"Alternately you can use bright colors and decorations, if you're putting the saddle on a flamboyant show horse--the overall look is up to you!"
    }
  ],
  "text":" Draw a half-circle shape. Have the round part of the saddle be pointing downwards, as shown. Draw a second half-circle shape overlapping the first. Next to this sketch in a smaller, teardrop-like shape to serve as the base of the grip. Draw a bone-like-shape for the grip. This should be coming straight off the front of the saddle, so don't hesitate to draw it boldly. Draw a banana-shaped form on top of the half circles. This will serve as the seat itself. Also add a portion to the top of the grip. Draw a curvy \"W\" for the fender. Add stretched drop shapes for the stirrups. Make the base of the stirrup by drawing two parallel sections. These should connect the sides of the stirrup so a foot could rest in it comfortably. Use different shades of brown to color in your saddle. Alternately you can use bright colors and decorations, if you're putting the saddle on a flamboyant show horse--the overall look is up to you!",
  "tyn_model":[
    "saddle",
    "stirrup"
  ],
  "tyn_section":[

  ]
}