{
  "title":"How to Make Tissue Paper Pompoms",
  "url":"https://www.wikihow.com/Make-Tissue-Paper-Pompoms",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Tissue and Crepe Paper Craft"
  ],
  "methods":[
    {
      "name":"Hanging Pompoms",
      "steps":[
        {
          "headline":"Have ten or more 20-26\" sheets of tissue paper.",
          "description":"It doesn't matter the color. You can use the same colors, vary different colors, or use similar-toned colors for a more flowery look. The best places to get tissue paper are GIANT, AC Moore, Michaels, or general craft supply stores. In many stores you can find it in the packaging section where the wrapping paper is."
        },
        {
          "headline":"Combine the pieces together on a flat surface and fold.",
          "description":"This should be the floor or a fairly large, cleared countertop. Accordion fold together starting from the shorter side. Make sure the fold is creased and about 1-1/2 inch wide. Fold as if you were making a paper fan."
        },
        {
          "headline":"Use floral wire to secure the now folded papers.",
          "description":"Loop the wire around the center of the folded papers and twist. This should be done once all the folding is finished. Cut the floral wire if there is too much excess. If you desire a more modern, festive look, cut the edges to a point. If you're going for a softer, flowery look, round the edges."
        },
        {
          "headline":"Carefully pull the pieces of paper to the center.",
          "description":"Pull one by one and fluff up as you go. Be careful! The tissue paper rips easily. Only do about half of the papers on each side so you end up with a ball."
        },
        {
          "headline":"Flip it over and repeat on the other side.",
          "description":"Make each side as even as possible."
        },
        {
          "headline":"Admire your fancy work and adjust as necessary.",
          "description":"You may need to mess it around a bit to see how it falls."
        },
        {
          "headline":"Hang your piece of art with clear fishing line.",
          "description":"This makes your pompoms appear as if they're floating! You may tie a length of monofilament to floral wire as an alternative."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    },
    {
      "name":"Napkin Ring Pompoms",
      "steps":[
        {
          "headline":"Stack four sheets of tissue.",
          "description":"They should be 20-by-30 inch sheets (50-by-76 cm). Choose a color that matches your napkins or is a complimentary accent. You can also use different colors in descending levels of tone for a classic, flowery feel."
        },
        {
          "headline":"Cut out a 10-by-5-inch rectangle.",
          "description":"This should go through all layers and make a mini version of a hanging pompom. Make sure to keep the papers perfectly stacked!"
        },
        {
          "headline":"Make accordion folds.",
          "description":"They should be 3/8 of an inch (about 1 cm) wide. Any wider and you won't have enough folds to create enough volume. They should be uniform in width; think of folding a fan."
        },
        {
          "headline":"Fold an 18-inch piece of floral wire in half.",
          "description":"This is used to create the base of the pompom. Slip it over the center of the tissue and twist to secure. Trim the ends of the tissue as you like. Make the ends pointy for a vibrant, spicy feel; make them rounded for something a bit more romantic and feminine."
        },
        {
          "headline":"Separate the layers.",
          "description":"Pull each one away from center one at a time. Be careful not to rip the tissue! It is very delicate."
        },
        {
          "headline":"Bend the wire into a loop to fit around the napkin.",
          "description":"Twist the end around the loop to secure. This doubles as your napkin ring. If you don't like the look of the floral wire, you can cover it with ribbon or otherwise adorn it."
        }
      ]
    }
  ],
  "text":" Hanging Pompoms Have ten or more 20-26\" sheets of tissue paper. It doesn't matter the color. You can use the same colors, vary different colors, or use similar-toned colors for a more flowery look. The best places to get tissue paper are GIANT, AC Moore, Michaels, or general craft supply stores. In many stores you can find it in the packaging section where the wrapping paper is. Combine the pieces together on a flat surface and fold. This should be the floor or a fairly large, cleared countertop. Accordion fold together starting from the shorter side. Make sure the fold is creased and about 1-1/2 inch wide. Fold as if you were making a paper fan. Use floral wire to secure the now folded papers. Loop the wire around the center of the folded papers and twist. This should be done once all the folding is finished. Cut the floral wire if there is too much excess. If you desire a more modern, festive look, cut the edges to a point. If you're going for a softer, flowery look, round the edges. Carefully pull the pieces of paper to the center. Pull one by one and fluff up as you go. Be careful! The tissue paper rips easily. Only do about half of the papers on each side so you end up with a ball. Flip it over and repeat on the other side. Make each side as even as possible. Admire your fancy work and adjust as necessary. You may need to mess it around a bit to see how it falls. Hang your piece of art with clear fishing line. This makes your pompoms appear as if they're floating! You may tie a length of monofilament to floral wire as an alternative. Finished.  Napkin Ring Pompoms Stack four sheets of tissue. They should be 20-by-30 inch sheets (50-by-76 cm). Choose a color that matches your napkins or is a complimentary accent. You can also use different colors in descending levels of tone for a classic, flowery feel. Cut out a 10-by-5-inch rectangle. This should go through all layers and make a mini version of a hanging pompom. Make sure to keep the papers perfectly stacked! Make accordion folds. They should be 3/8 of an inch (about 1 cm) wide. Any wider and you won't have enough folds to create enough volume. They should be uniform in width; think of folding a fan. Fold an 18-inch piece of floral wire in half. This is used to create the base of the pompom. Slip it over the center of the tissue and twist to secure. Trim the ends of the tissue as you like. Make the ends pointy for a vibrant, spicy feel; make them rounded for something a bit more romantic and feminine. Separate the layers. Pull each one away from center one at a time. Be careful not to rip the tissue! It is very delicate. Bend the wire into a loop to fit around the napkin. Twist the end around the loop to secure. This doubles as your napkin ring. If you don't like the look of the floral wire, you can cover it with ribbon or otherwise adorn it.",
  "tyn_model":[
    "floral wire",
    "tissue",
    "tissue paper",
    "paper",
    "wire",
    "napkin ring",
    "accordion",
    "clear fishing line",
    "napkins",
    "papers",
    "accordion folds",
    "napkin",
    "ribbon"
  ],
  "tyn_section":[

  ]
}