{
  "title":"How to Add Vinegar to Laundry",
  "url":"https://www.wikihow.com/Add-Vinegar-to-Laundry",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Laundry Cleaning Products"
  ],
  "methods":[
    {
      "name":"Cleaning Your Clothes",
      "steps":[
        {
          "headline":"Keep your clothes clean with vinegar.",
          "description":"Pour 1/2 cup of distilled white vinegar into your washing machine, instead of the detergent you would normally use. This will clean your clothes without the use of the harsh chemicals found in many commercial laundry detergents."
        },
        {
          "headline":"Use vinegar as a fabric softener.",
          "description":"Get 1 cup of white distilled vinegar ready. When a load of laundry reaches its last rinse cycle, pour the vinegar into the washer. This will act as a simple but effective natural fabric softener."
        },
        {
          "headline":"Pre-treat stains with vinegar.",
          "description":"Dilute 1/2 cup vinegar in a gallon of water. Apply this directly to stains on your fabrics, with a clean cloth or by pouring the solution right on the stain. Wash your clothes as you normally would."
        },
        {
          "headline":"Bleach clothes with a vinegar solution.",
          "description":"Mix 1/4 cup of lemon juice, 1/4 cup of borax, and 1/2 cup of vinegar. Use this as a gentle alternative whenever you would use bleach with your laundry."
        },
        {
          "headline":"Use vinegar to deodorize clothes.",
          "description":"If you have smelly clothes, add 1/2 to 1 cup of vinegar straight to the washer during the last rinse cycle. This will remove the smells from your clothes, without making them smell like vinegar."
        }
      ]
    },
    {
      "name":"Protecting Fabrics",
      "steps":[
        {
          "headline":"Stop colors from fading.",
          "description":"Pour 1/2 cup of white, distilled vinegar into a load of laundry to protect color from fading. This same technique will prevent dark colors like black and navy blue from becoming dull due to repeated washing. You can also re-treat fabrics with vinegar to keep their colors fast. Add 1/2 cup vinegar to one gallon of water. To keep colors from running, dip bright colors in the solution, then wash them."
        },
        {
          "headline":"Prevent static and lint.",
          "description":"Add 1/2 cup of white distilled vinegar to the last rinse cycle of a load of laundry. This will prevent the static that can make your clothes annoyingly stick to other clothing or to your body. For many fabrics, it can also help prevent the buildup of lint."
        },
        {
          "headline":"Remove buildup on clothes.",
          "description":"Regular detergents can cause soapy residue to accumulate on clothes and cause streaks or roughness. Add 1 cup of vinegar to a gallon of water. Soak your clothes in this solution, and then wash them. The buildup will be removed. This residue is particularly noticeable on whites, which can become yellowed over time. Black clothing will also appear to fade over time. Soaking them in a vinegar and water solution can reverse these effects."
        },
        {
          "headline":"Clean your washing machine.",
          "description":"Soapy residue can also build up inside your washing machine, eventually getting on your clothes. Once a month, put 1 cup of vinegar into your washer and run it without loading any clothes. This will remove the residue from the machine's tub."
        }
      ]
    }
  ],
  "text":" Cleaning Your Clothes Keep your clothes clean with vinegar. Pour 1/2 cup of distilled white vinegar into your washing machine, instead of the detergent you would normally use. This will clean your clothes without the use of the harsh chemicals found in many commercial laundry detergents. Use vinegar as a fabric softener. Get 1 cup of white distilled vinegar ready. When a load of laundry reaches its last rinse cycle, pour the vinegar into the washer. This will act as a simple but effective natural fabric softener. Pre-treat stains with vinegar. Dilute 1/2 cup vinegar in a gallon of water. Apply this directly to stains on your fabrics, with a clean cloth or by pouring the solution right on the stain. Wash your clothes as you normally would. Bleach clothes with a vinegar solution. Mix 1/4 cup of lemon juice, 1/4 cup of borax, and 1/2 cup of vinegar. Use this as a gentle alternative whenever you would use bleach with your laundry. Use vinegar to deodorize clothes. If you have smelly clothes, add 1/2 to 1 cup of vinegar straight to the washer during the last rinse cycle. This will remove the smells from your clothes, without making them smell like vinegar. Protecting Fabrics Stop colors from fading. Pour 1/2 cup of white, distilled vinegar into a load of laundry to protect color from fading. This same technique will prevent dark colors like black and navy blue from becoming dull due to repeated washing. You can also re-treat fabrics with vinegar to keep their colors fast. Add 1/2 cup vinegar to one gallon of water. To keep colors from running, dip bright colors in the solution, then wash them. Prevent static and lint. Add 1/2 cup of white distilled vinegar to the last rinse cycle of a load of laundry. This will prevent the static that can make your clothes annoyingly stick to other clothing or to your body. For many fabrics, it can also help prevent the buildup of lint. Remove buildup on clothes. Regular detergents can cause soapy residue to accumulate on clothes and cause streaks or roughness. Add 1 cup of vinegar to a gallon of water. Soak your clothes in this solution, and then wash them. The buildup will be removed. This residue is particularly noticeable on whites, which can become yellowed over time. Black clothing will also appear to fade over time. Soaking them in a vinegar and water solution can reverse these effects. Clean your washing machine. Soapy residue can also build up inside your washing machine, eventually getting on your clothes. Once a month, put 1 cup of vinegar into your washer and run it without loading any clothes. This will remove the residue from the machine's tub.",
  "tyn_model":[
    "vinegar",
    "water",
    "washer",
    "white distilled vinegar",
    "distilled white vinegar",
    "laundry detergents",
    "lemon",
    "borax",
    "bleach",
    "white, distilled vinegar",
    "laundry",
    "washing machine"
  ],
  "tyn_section":[

  ]
}