{
  "title":"How to Make Chocolate and Orange Muffins",
  "url":"https://www.wikihow.com/Make-Chocolate-and-Orange-Muffins",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Muffins"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to gas mark 5/375ºF/190ºC.",
      "description":""
    },
    {
      "headline":"Slice the orange into halves.",
      "description":"Using the grater, grate some of the orange skin into the bowl. You will use the rest later, so set it to the side and save it."
    },
    {
      "headline":"Sift the flour into a bowl.",
      "description":"Make sure it's smooth, with no lumps."
    },
    {
      "headline":"Add the chocolate chips, margarine, milk, sugar and egg into the bowl.",
      "description":""
    },
    {
      "headline":"Mix with the wooden spoon.",
      "description":"Make sure the mixture is lumpy and not smooth."
    },
    {
      "headline":"Using the tablespoon, scoop the mixture evenly into the muffin cases.",
      "description":""
    },
    {
      "headline":"Place in the oven for 15-20 minutes.",
      "description":""
    },
    {
      "headline":"Remove the muffins.",
      "description":"Stick a skewer though a few: if it comes out clean, then they are fully cooked. If not, place the muffins back in the oven for another 5 minutes or until fully cooked."
    },
    {
      "headline":"Place muffins to cool on a cooling rack.",
      "description":""
    }
  ],
  "text":" Preheat the oven to gas mark 5/375ºF/190ºC.  Slice the orange into halves. Using the grater, grate some of the orange skin into the bowl. You will use the rest later, so set it to the side and save it. Sift the flour into a bowl. Make sure it's smooth, with no lumps. Add the chocolate chips, margarine, milk, sugar and egg into the bowl.  Mix with the wooden spoon. Make sure the mixture is lumpy and not smooth. Using the tablespoon, scoop the mixture evenly into the muffin cases.  Place in the oven for 15-20 minutes.  Remove the muffins. Stick a skewer though a few: if it comes out clean, then they are fully cooked. If not, place the muffins back in the oven for another 5 minutes or until fully cooked. Place muffins to cool on a cooling rack. ",
  "tyn_model":[
    "oven",
    "bowl",
    "grater",
    "flour",
    "chocolate chips",
    "margarine",
    "milk",
    "sugar",
    "wooden spoon",
    "muffin cases",
    "skewer",
    "cooling rack"
  ],
  "tyn_section":[

  ]
}