{
  "title":"How to Make Improvised Cinnamon Pretzels",
  "url":"https://www.wikihow.com/Make-Improvised-Cinnamon-Pretzels",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets"
  ],
  "steps":[
    {
      "headline":"Gather your materials and ingredients.",
      "description":""
    },
    {
      "headline":"Take your bread and rip it into two halves, then twist and squish it into two ropes (mostly squishing).",
      "description":"Try to get rid of as many air pockets as possible while keeping the bread-rope from untwisting."
    },
    {
      "headline":"Place your frying pan over the heat source.",
      "description":"It's hot enough when a water droplet immediately sizzles and evaporates. Pour in oil/butter and spread it around with a spatula."
    },
    {
      "headline":"Drop in your bread-ropes, two to three at a time.",
      "description":"Flip them when they turn a golden brown color on one side."
    },
    {
      "headline":"When both sides are brown, remove the pretzel from the pan and place it on the paper towel.",
      "description":"Use the paper towel to absorb extra butter and/or oil and allow them to cool enough for you to pick them up."
    },
    {
      "headline":"Place the pretzels on a plate and sprinkle the sugar and cinnamon on.",
      "description":""
    }
  ],
  "text":" Gather your materials and ingredients.  Take your bread and rip it into two halves, then twist and squish it into two ropes (mostly squishing). Try to get rid of as many air pockets as possible while keeping the bread-rope from untwisting. Place your frying pan over the heat source. It's hot enough when a water droplet immediately sizzles and evaporates. Pour in oil/butter and spread it around with a spatula. Drop in your bread-ropes, two to three at a time. Flip them when they turn a golden brown color on one side. When both sides are brown, remove the pretzel from the pan and place it on the paper towel. Use the paper towel to absorb extra butter and/or oil and allow them to cool enough for you to pick them up. Place the pretzels on a plate and sprinkle the sugar and cinnamon on. ",
  "tyn_model":[
    "bread",
    "paper towel",
    "frying pan",
    "water",
    "oil/butter",
    "spatula",
    "butter",
    "oil",
    "plate",
    "sugar",
    "cinnamon"
  ],
  "tyn_section":[

  ]
}