{
  "title":"How to Buy Old PlayStation Games",
  "url":"https://www.wikihow.com/Buy-Old-PlayStation-Games",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation"
  ],
  "steps":[
    {
      "headline":"Open the Estarland website on your Internet browser.",
      "description":""
    },
    {
      "headline":"Pick the name of the console that you want to buy old games for (the console names are listed under \"Current Platforms\" on the left menu bar).",
      "description":"Estarland sells games for PS2 as well as the original PlayStation console."
    },
    {
      "headline":"Choose a game category from the list that appears on the left hand side.",
      "description":"Categories include Simulation, Sports, Puzzle and Driving among others."
    },
    {
      "headline":"Decide which game you want to buy and click on its name in the search results.",
      "description":"This will take you to a page displaying the game's description and features."
    },
    {
      "headline":"Buy the game by pressing the \"Add to cart\" button and completing the payment process.",
      "description":"Most games are usually shipped to you within 24 hours."
    }
  ],
  "text":" Open the Estarland website on your Internet browser.  Pick the name of the console that you want to buy old games for (the console names are listed under \"Current Platforms\" on the left menu bar). Estarland sells games for PS2 as well as the original PlayStation console. Choose a game category from the list that appears on the left hand side. Categories include Simulation, Sports, Puzzle and Driving among others. Decide which game you want to buy and click on its name in the search results. This will take you to a page displaying the game's description and features. Buy the game by pressing the \"Add to cart\" button and completing the payment process. Most games are usually shipped to you within 24 hours.",
  "tyn_model":[
    "games"
  ],
  "tyn_section":[

  ]
}