{
  "title":"How to Choose Plant Soil",
  "url":"https://www.wikihow.com/Choose-Plant-Soil",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Compost Mulch and Soil Preparation"
  ],
  "methods":[
    {
      "name":"Considering Your Plant's Needs",
      "steps":[
        {
          "headline":"Identify the needs of your plant.",
          "description":"Look your plant up online, flip through a plant identification book, or read the tag that accompanies the plant when you buy it. These are ways to find information about the specific needs of the plants you will be adding to your garden, and you can use this material to select the appropriate type of soil your plants require:\nConsider, for example, the amount of moisture your plant needs. A desert plant is going to require sandy potting soil that can drain more easily than the soil for a wetland plant. Take the PH level that your plant needs into account. While most potting mixes have a pH of 7.0, a plant like the African Violet requires a more acidic soil, specifically one with a pH of 6.0. Native plants will have specific soil requirements. Always read more about the specific needs of your plant or ask at your local nursery what the optimum soil and pH are for any given native plant."
        },
        {
          "headline":"Choose between organic and conventional potting soils.",
          "description":"Different plants will require various nutrients, some of which may not always be produced naturally. The following knowledge will allow you to make an informed decision when the time comes to select the best soil for your plants or garden:\nOrganic potting soil is eco-friendly, as it is composed of microorganisms, decaying plant material, worms, and other natural elements. It contains microscopic organisms that add nutrients and minerals to the soil. Conventional potting soils contain ingredients such as peat, manure, and black hummus. All fertilizer or nutrients in non-organic potting soil have been manufactured and added by humans."
        },
        {
          "headline":"Determine how often your plants will require fresh soil.",
          "description":"If your plants require new soil at the start of every season, conventional soil might be a better option for you, for whereas organic potting soil is reusable, conventional soil lasts only one grow season and can be disposed of afterwards. If you decide to go with organic soil, you will be able to safely recycle ecologically friendly materials in pots or spread them in your outdoor garden. Conventional soil must be discarded after only one season, when potted plants are no longer able to absorb nutrients from this soil; on the upside, you get to start every season anew with fresh, clean soil."
        }
      ]
    },
    {
      "name":"Selecting Soil Weight",
      "steps":[
        {
          "headline":"Select medium-weight potting soil for plants that are exposed to full sunlight.",
          "description":"Medium-weight soil holds water better than light soil. Lightweight soil may become too dry to support the plant when exposed to the sun for long periods of time. Soil weight will be listed on the bag you purchase."
        },
        {
          "headline":"Use lighter soil for hanging plants or for plants that grow in the shade.",
          "description":"If the soil is too heavy, it may become soggy and harm the plant. Re-pot a plant rooted in extremely light, airy soil when you get it home from the store, even if it is a hanging plant or a shade plant. Extremely light soil, composed of peat and sphagnum moss, dries out quickly and may kill your plant."
        },
        {
          "headline":"Avoid using heavy soil.",
          "description":"It may be too compacted for your potted plant and won't allow air to get to the roots. Heavy soil also may have too much sand or clay, which retains few nutrients, and may drain poorly, which can cause plant roots to rot. Use a sandier soil when planting desert plants. It should provide better drainage and contain fewer nutrients than the potting mix you use for most other plants. This will allow the plants to flourish."
        }
      ]
    },
    {
      "name":"Purchasing Fertilizer",
      "steps":[
        {
          "headline":"Note the ratio of the various types of fertilizer.",
          "description":"The minerals nitrogen, phosphorous, and potassium -- N-P-K -- are listed alongside three numbers on soil bags. For example, a mix of 20-10-10 means there is twice as much nitrogen as phosphorous or potassium. Different types of plants require different mixes of these minerals, so consult a plant identification guide to determine the right balance for your plant. Leafy plants require soil with more nitrogen. The higher nitrogen mix would be 20-10-10 on the bag. Flowering plants need more phosphorous in a ratio such as 10-20-10 for good blossoms and a healthy root structure. To promote plant health and foster disease resistance, use a ratio such as 10-10-20, which contains more potassium."
        },
        {
          "headline":"Replenish your plants' nutrition with a liquid fertilizer.",
          "description":"Spraying your plants with liquid fertilizer every two weeks will supply additional nutrients and contribute to your plants' healthy growth. Popular liquid fertilizers include seaweed or fish emulsion blends. You can purchase liquid fertilizer online or at most gardening stores."
        },
        {
          "headline":"Add fertilizer regularly.",
          "description":"Research the plants in your garden to learn how often they should be fertilized. If you cannot find this, read the directions on the fertilizer's label to get a general idea of how frequently you should use the fertilizer."
        }
      ]
    }
  ],
  "text":" Considering Your Plant's Needs Identify the needs of your plant. Look your plant up online, flip through a plant identification book, or read the tag that accompanies the plant when you buy it. These are ways to find information about the specific needs of the plants you will be adding to your garden, and you can use this material to select the appropriate type of soil your plants require:\nConsider, for example, the amount of moisture your plant needs. A desert plant is going to require sandy potting soil that can drain more easily than the soil for a wetland plant. Take the PH level that your plant needs into account. While most potting mixes have a pH of 7.0, a plant like the African Violet requires a more acidic soil, specifically one with a pH of 6.0. Native plants will have specific soil requirements. Always read more about the specific needs of your plant or ask at your local nursery what the optimum soil and pH are for any given native plant. Choose between organic and conventional potting soils. Different plants will require various nutrients, some of which may not always be produced naturally. The following knowledge will allow you to make an informed decision when the time comes to select the best soil for your plants or garden:\nOrganic potting soil is eco-friendly, as it is composed of microorganisms, decaying plant material, worms, and other natural elements. It contains microscopic organisms that add nutrients and minerals to the soil. Conventional potting soils contain ingredients such as peat, manure, and black hummus. All fertilizer or nutrients in non-organic potting soil have been manufactured and added by humans. Determine how often your plants will require fresh soil. If your plants require new soil at the start of every season, conventional soil might be a better option for you, for whereas organic potting soil is reusable, conventional soil lasts only one grow season and can be disposed of afterwards. If you decide to go with organic soil, you will be able to safely recycle ecologically friendly materials in pots or spread them in your outdoor garden. Conventional soil must be discarded after only one season, when potted plants are no longer able to absorb nutrients from this soil; on the upside, you get to start every season anew with fresh, clean soil. Selecting Soil Weight Select medium-weight potting soil for plants that are exposed to full sunlight. Medium-weight soil holds water better than light soil. Lightweight soil may become too dry to support the plant when exposed to the sun for long periods of time. Soil weight will be listed on the bag you purchase. Use lighter soil for hanging plants or for plants that grow in the shade. If the soil is too heavy, it may become soggy and harm the plant. Re-pot a plant rooted in extremely light, airy soil when you get it home from the store, even if it is a hanging plant or a shade plant. Extremely light soil, composed of peat and sphagnum moss, dries out quickly and may kill your plant. Avoid using heavy soil. It may be too compacted for your potted plant and won't allow air to get to the roots. Heavy soil also may have too much sand or clay, which retains few nutrients, and may drain poorly, which can cause plant roots to rot. Use a sandier soil when planting desert plants. It should provide better drainage and contain fewer nutrients than the potting mix you use for most other plants. This will allow the plants to flourish. Purchasing Fertilizer Note the ratio of the various types of fertilizer. The minerals nitrogen, phosphorous, and potassium -- N-P-K -- are listed alongside three numbers on soil bags. For example, a mix of 20-10-10 means there is twice as much nitrogen as phosphorous or potassium. Different types of plants require different mixes of these minerals, so consult a plant identification guide to determine the right balance for your plant. Leafy plants require soil with more nitrogen. The higher nitrogen mix would be 20-10-10 on the bag. Flowering plants need more phosphorous in a ratio such as 10-20-10 for good blossoms and a healthy root structure. To promote plant health and foster disease resistance, use a ratio such as 10-10-20, which contains more potassium. Replenish your plants' nutrition with a liquid fertilizer. Spraying your plants with liquid fertilizer every two weeks will supply additional nutrients and contribute to your plants' healthy growth. Popular liquid fertilizers include seaweed or fish emulsion blends. You can purchase liquid fertilizer online or at most gardening stores. Add fertilizer regularly. Research the plants in your garden to learn how often they should be fertilized. If you cannot find this, read the directions on the fertilizer's label to get a general idea of how frequently you should use the fertilizer.",
  "tyn_model":[
    "soil",
    "fertilizer",
    "potassium",
    "nitrogen",
    "liquid fertilizer",
    "plant identification book",
    "worms",
    "manure",
    "potting soil",
    "phosphorous",
    "fertilizers"
  ],
  "tyn_section":[

  ]
}