{
  "title":"How to Create a Perennial Garden",
  "url":"https://www.wikihow.com/Create-a-Perennial-Garden",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Theme and Feature Gardens"
  ],
  "methods":[
    {
      "name":"Choosing a Garden Site",
      "steps":[
        {
          "headline":"Consider environmental factors as well as convenience and visibility when selecting a garden site.The majority of perennial plants need about 10 hours of sun every day during the summer, but some need partial or full shade.",
          "description":"If you don't choose a sunny location for your garden, you'll have fewer options about which plants you can grow. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/90\\/Create-a-Perennial-Garden-Step-1Bullet1.jpg\\/v4-460px-Create-a-Perennial-Garden-Step-1Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/90\\/Create-a-Perennial-Garden-Step-1Bullet1.jpg\\/v4-760px-Create-a-Perennial-Garden-Step-1Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nCheck for good soil drainage. You want soil to drain water at the rate of about a foot an hour to prevent root rot. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/93\\/Create-a-Perennial-Garden-Step-1Bullet2.jpg\\/v4-460px-Create-a-Perennial-Garden-Step-1Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/93\\/Create-a-Perennial-Garden-Step-1Bullet2.jpg\\/v4-760px-Create-a-Perennial-Garden-Step-1Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nChoose a location that has plenty of air circulation. This limits diseases in perennial plants. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a1\\/Create-a-Perennial-Garden-Step-1Bullet3.jpg\\/v4-460px-Create-a-Perennial-Garden-Step-1Bullet3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a1\\/Create-a-Perennial-Garden-Step-1Bullet3.jpg\\/v4-760px-Create-a-Perennial-Garden-Step-1Bullet3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        },
        {
          "headline":"Select a site that is easy to reach for maintenance.",
          "description":"You want to be able to reach your plants from a minimum of 2 sides."
        }
      ]
    },
    {
      "name":"Designing a Perennial Garden",
      "steps":[
        {
          "headline":"Measure the site you've chosen for your garden.",
          "description":""
        },
        {
          "headline":"Draw the garden site to scale on graph paper.",
          "description":"Include the shape of the garden bed plus landmarks like trees, bushes, fences, and walls."
        },
        {
          "headline":"Choose your perennial plants and decide where to put them.",
          "description":"Vary the color of the flowers and foliage. Plan to put the same kind of plant in several places so the colors will repeat. This creates more visual appeal. Place plants according to height. The tallest plants should go in the back or center of the garden and the shortest in the front or around the edges. Plant perennials with varied blooming schedules so your garden will display colorful flowers throughout the year. Consider the light requirements of the plants. You may be able to arrange your plants so the tallest receive full sun while the shortest plants are shaded. Generally, however, you will have to limit your choices according to how much sun the garden gets."
        },
        {
          "headline":"Specify the locations where clusters of the same plant will be planted.",
          "description":"Show each plant in the cluster. Clusters consisting of odd numbers of plants arranged in triangular patterns are the most visually appealing."
        },
        {
          "headline":"Leave enough space between plants to accommodate growth.",
          "description":"Small plants need 6 to 12 inches (15 to 30 cm) between them\nMedium-sized plants need 12 to 18 inches (30 to 45 cm) between them. Tall plants need 18 to 36 inches (45 to 90 cm) between them."
        }
      ]
    },
    {
      "name":"Preparing a Garden Plot",
      "steps":[
        {
          "headline":"Strip grass and plants from the spot you've selected for the garden bed.",
          "description":""
        },
        {
          "headline":"Put edging around the bed.",
          "description":"This adds visual appeal and keeps the grass from invading the garden."
        },
        {
          "headline":"Amend the soil with organic materials.",
          "description":"Incorporate  compost, aged manure or sphagnum peat to a depth of 1 foot (30 cm). Buy 3 cubic yards (2.75 cubic meters) of organic material per 1,000 square feet (93 square meters) of garden."
        },
        {
          "headline":"Blend a phosphorus fertilizer into the soil.",
          "description":"Use a superphosphate fertilizer if the soil tests low in phosphorus."
        }
      ]
    },
    {
      "name":"Planting the Perennial Garden",
      "steps":[
        {
          "headline":"Plant perennials early enough in the year so they can get established before winter.",
          "description":"They will not bloom in the year that you plant them, but they may bloom the next year."
        },
        {
          "headline":"Leave perennials in their containers until planting time.",
          "description":"This keeps the roots from drying out."
        },
        {
          "headline":"Take care with the planting level.",
          "description":"Plant perennials in the ground at a level matching the level they had in the pot. Planting at the same level, and not deeper, allows the roots to breathe."
        },
        {
          "headline":"Water the perennial plants thoroughly and water often for the first two weeks afterward.",
          "description":"You may need to add more soil after the first watering."
        }
      ]
    }
  ],
  "text":" Choosing a Garden Site Consider environmental factors as well as convenience and visibility when selecting a garden site.The majority of perennial plants need about 10 hours of sun every day during the summer, but some need partial or full shade. If you don't choose a sunny location for your garden, you'll have fewer options about which plants you can grow. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/90\\/Create-a-Perennial-Garden-Step-1Bullet1.jpg\\/v4-460px-Create-a-Perennial-Garden-Step-1Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/90\\/Create-a-Perennial-Garden-Step-1Bullet1.jpg\\/v4-760px-Create-a-Perennial-Garden-Step-1Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nCheck for good soil drainage. You want soil to drain water at the rate of about a foot an hour to prevent root rot. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/93\\/Create-a-Perennial-Garden-Step-1Bullet2.jpg\\/v4-460px-Create-a-Perennial-Garden-Step-1Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/93\\/Create-a-Perennial-Garden-Step-1Bullet2.jpg\\/v4-760px-Create-a-Perennial-Garden-Step-1Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nChoose a location that has plenty of air circulation. This limits diseases in perennial plants. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a1\\/Create-a-Perennial-Garden-Step-1Bullet3.jpg\\/v4-460px-Create-a-Perennial-Garden-Step-1Bullet3.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/a\\/a1\\/Create-a-Perennial-Garden-Step-1Bullet3.jpg\\/v4-760px-Create-a-Perennial-Garden-Step-1Bullet3.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Select a site that is easy to reach for maintenance. You want to be able to reach your plants from a minimum of 2 sides. Designing a Perennial Garden Measure the site you've chosen for your garden.  Draw the garden site to scale on graph paper. Include the shape of the garden bed plus landmarks like trees, bushes, fences, and walls. Choose your perennial plants and decide where to put them. Vary the color of the flowers and foliage. Plan to put the same kind of plant in several places so the colors will repeat. This creates more visual appeal. Place plants according to height. The tallest plants should go in the back or center of the garden and the shortest in the front or around the edges. Plant perennials with varied blooming schedules so your garden will display colorful flowers throughout the year. Consider the light requirements of the plants. You may be able to arrange your plants so the tallest receive full sun while the shortest plants are shaded. Generally, however, you will have to limit your choices according to how much sun the garden gets. Specify the locations where clusters of the same plant will be planted. Show each plant in the cluster. Clusters consisting of odd numbers of plants arranged in triangular patterns are the most visually appealing. Leave enough space between plants to accommodate growth. Small plants need 6 to 12 inches (15 to 30 cm) between them\nMedium-sized plants need 12 to 18 inches (30 to 45 cm) between them. Tall plants need 18 to 36 inches (45 to 90 cm) between them. Preparing a Garden Plot Strip grass and plants from the spot you've selected for the garden bed.  Put edging around the bed. This adds visual appeal and keeps the grass from invading the garden. Amend the soil with organic materials. Incorporate  compost, aged manure or sphagnum peat to a depth of 1 foot (30 cm). Buy 3 cubic yards (2.75 cubic meters) of organic material per 1,000 square feet (93 square meters) of garden. Blend a phosphorus fertilizer into the soil. Use a superphosphate fertilizer if the soil tests low in phosphorus. Planting the Perennial Garden Plant perennials early enough in the year so they can get established before winter. They will not bloom in the year that you plant them, but they may bloom the next year. Leave perennials in their containers until planting time. This keeps the roots from drying out. Take care with the planting level. Plant perennials in the ground at a level matching the level they had in the pot. Planting at the same level, and not deeper, allows the roots to breathe. Water the perennial plants thoroughly and water often for the first two weeks afterward. You may need to add more soil after the first watering.",
  "tyn_model":[
    "water",
    "plants",
    "garden site",
    "soil",
    "graph paper",
    "bushes",
    "perennial plants",
    "organic materials",
    "compost",
    "aged manure",
    "sphagnum peat",
    "organic material",
    "phosphorus fertilizer",
    "superphosphate fertilizer",
    "perennials",
    "pot"
  ],
  "tyn_section":[

  ]
}