{
  "title":"How to Choose White Wine for Cooking",
  "url":"https://www.wikihow.com/Choose-White-Wine-for-Cooking",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Wine"
  ],
  "methods":[
    {
      "name":"Using Rich Dry White Wines for White Meat, Gravies, and Cream Sauces",
      "steps":[
        {
          "headline":"Use rich dry white wines for white meat.",
          "description":"A thicker wine with more noticeable flavors is a must for cooking chicken or any other white meat. A Chardonnay is the most popular and easily available thicker wine."
        },
        {
          "headline":"Use rich dry white wines for gravies and cream sauces.",
          "description":"Cooking gravies and sauces can require a bit more finesse than chicken or vegetables. You’ll want to be cautious to balance the acidity of the dish. Since gravies and sauces are liquid-based dishes, you’ll also have to closely monitor how much of the wine has reduced during cooking. Some reliable varieties of Chardonnay include:\nIndaba Chardonnay\nRoot 1 Chardonnay\nLismore Range Chardonnay"
        },
        {
          "headline":"Substitute sherry in sauce and gravy dishes.",
          "description":"Sherry is one of the most versatile wines in the game. It can be great for deglazing a pan and adding a depth of flavors to a cream sauce or gravy."
        }
      ]
    },
    {
      "name":"Using Crisp Dry White Wines for Seafood",
      "steps":[
        {
          "headline":"Use crisp dry white wines for seafood and shellfish.",
          "description":"These are perfect for adding a slightly fruity or earthy flavor to your seafood dishes. A lot of more acidic wines can actually break up the fattier parts of the fish, so monitor your acidity or you’ll risk over-extracting the protein. Pinot Grigio is typically the most popular version of a crisp dry white wine."
        },
        {
          "headline":"Use Vinho Verde as a substitute.",
          "description":"If you’re not into Pinot Grigio, Vinho Verde works great in its place. It’s usually a pretty cost effective replacement. A bottle from any of the major producers (Gazela, Nobilis, or Blanka) shouldn’t run you more than $10 at your local grocery store."
        },
        {
          "headline":"Substitute Assyrtiko for a creamier texture.",
          "description":"Assyrtiko has had a bit of a boom in popularity in the past 15 years. This will work great for both seafood and shellfish, adding a slightly creamier texture and some citrus flavors to your dish. GCW and Sigalas are probably the most popular brands of an Assyrtiko."
        }
      ]
    },
    {
      "name":"Using Light Dry White Wines for Vegetables",
      "steps":[
        {
          "headline":"Use light dry white wines for vegetables.",
          "description":"These are usually some of the easiest wines to cook with, so you won’t be facing big risks when just cooking vegetables. A Sauvignon Blanc is a popular option. These usually have floral and fruity aromas which will add a simple, but not overwhelming, element to your veggies."
        },
        {
          "headline":"Use Verdejo as a substitute.",
          "description":"This would qualify as a “hip” pick, as it’s not too many people’s first or second choice. Exclusively coming from a small region in Rueda, Spain, this wine boasts strong citrus and lime flavors. As a general rule, if your meal has any lime flavor notes, Verdejo will enhance those tastes! Some varietals include:\nArgami Rueda Verdejo\nDemimo Rueda Verdejo\nMarques de Cáceras Verdejo"
        },
        {
          "headline":"Substitute Grüner Veltliner for a peppery flavor.",
          "description":"This exotic wine variety will be sure to add green pepper and lime flavors to your vegetable dish. It can also be a little on the spicy or peppery side, so be careful not to overdo it when adding a Grüner Veltliner to your meal."
        }
      ]
    }
  ],
  "text":" Using Rich Dry White Wines for White Meat, Gravies, and Cream Sauces Use rich dry white wines for white meat. A thicker wine with more noticeable flavors is a must for cooking chicken or any other white meat. A Chardonnay is the most popular and easily available thicker wine. Use rich dry white wines for gravies and cream sauces. Cooking gravies and sauces can require a bit more finesse than chicken or vegetables. You’ll want to be cautious to balance the acidity of the dish. Since gravies and sauces are liquid-based dishes, you’ll also have to closely monitor how much of the wine has reduced during cooking. Some reliable varieties of Chardonnay include:\nIndaba Chardonnay\nRoot 1 Chardonnay\nLismore Range Chardonnay Substitute sherry in sauce and gravy dishes. Sherry is one of the most versatile wines in the game. It can be great for deglazing a pan and adding a depth of flavors to a cream sauce or gravy. Using Crisp Dry White Wines for Seafood Use crisp dry white wines for seafood and shellfish. These are perfect for adding a slightly fruity or earthy flavor to your seafood dishes. A lot of more acidic wines can actually break up the fattier parts of the fish, so monitor your acidity or you’ll risk over-extracting the protein. Pinot Grigio is typically the most popular version of a crisp dry white wine. Use Vinho Verde as a substitute. If you’re not into Pinot Grigio, Vinho Verde works great in its place. It’s usually a pretty cost effective replacement. A bottle from any of the major producers (Gazela, Nobilis, or Blanka) shouldn’t run you more than $10 at your local grocery store. Substitute Assyrtiko for a creamier texture. Assyrtiko has had a bit of a boom in popularity in the past 15 years. This will work great for both seafood and shellfish, adding a slightly creamier texture and some citrus flavors to your dish. GCW and Sigalas are probably the most popular brands of an Assyrtiko. Using Light Dry White Wines for Vegetables Use light dry white wines for vegetables. These are usually some of the easiest wines to cook with, so you won’t be facing big risks when just cooking vegetables. A Sauvignon Blanc is a popular option. These usually have floral and fruity aromas which will add a simple, but not overwhelming, element to your veggies. Use Verdejo as a substitute. This would qualify as a “hip” pick, as it’s not too many people’s first or second choice. Exclusively coming from a small region in Rueda, Spain, this wine boasts strong citrus and lime flavors. As a general rule, if your meal has any lime flavor notes, Verdejo will enhance those tastes! Some varietals include:\nArgami Rueda Verdejo\nDemimo Rueda Verdejo\nMarques de Cáceras Verdejo Substitute Grüner Veltliner for a peppery flavor. This exotic wine variety will be sure to add green pepper and lime flavors to your vegetable dish. It can also be a little on the spicy or peppery side, so be careful not to overdo it when adding a Grüner Veltliner to your meal.",
  "tyn_model":[
    "chardonnay",
    "wines",
    "wine",
    "sauces",
    "sherry",
    "vinho verde",
    "assyrtiko",
    "grüner veltliner",
    "vegetables",
    "gravy",
    "pinot grigio",
    "pinot",
    "sauvignon",
    "verdejo",
    "“hip",
    "” pick"
  ],
  "tyn_section":[

  ]
}