{
  "title":"How to Make Blondies",
  "url":"https://www.wikihow.com/Make-Blondies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Brownies"
  ],
  "methods":[
    {
      "name":"Baking a Blondie",
      "steps":[
        {
          "headline":"Preheat the oven to to 350 degrees.",
          "description":""
        },
        {
          "headline":"Butter and flour your baking dish.",
          "description":"Cover the sides of the baking pan with a thin layer of butter then sprinkle a dusting of flour around the pan.This prevents the blondies from sticking to the pan. You can also use baking spray as a healthier option."
        },
        {
          "headline":"Melt the butter.",
          "description":"You can melt the butter in either a sauce pot or in a glass dish in the microwave. Just heat the butter enough that it is completely melted -- it doesn't need to be hot. if using the microwave, heat the butter in 30 second intervals."
        },
        {
          "headline":"Mix the butter into the sugar.",
          "description":"While the butter is still melted, pour it into the sugar and quickly combine them. Let this mixture cool while you move on to the flour."
        },
        {
          "headline":"Whisk together the flour, salt, and baking powder in another bowl.",
          "description":"These make up your dry ingredients."
        },
        {
          "headline":"Whisk the egg and vanilla into the cooled sugar and butter mixture.",
          "description":"These form your wet ingredients. Make sure they are well mixed, but don't worry if some of the liquid is separated from the sugar. Do not whisk in the eggs until the sugar is cool to the touch, otherwise you risk cooking your eggs."
        },
        {
          "headline":"Fold the wet and dry ingredients together.",
          "description":"Combine the two bowls and, using a spatula, mix them together until you have a consistent batter. If you want any add-ins, like chocolate chips or nuts, add them now. Once there are no more chunks of flour or sugar the mixture is ready."
        },
        {
          "headline":"Pour the batter into the pan.",
          "description":"Even it out with your spatula so that the top is flat."
        },
        {
          "headline":"Cook the blondies for 20 minutes.",
          "description":"The bars will be golden brown on the tops and edges when they are finished. Stick a fork or wooden skewer through the center of the blondies and pull it out quickly. If there is wet batter on the knife then the blondies still need to cook. You may need to cook them for an extra 2-3 minutes depending on your oven's strength."
        }
      ]
    },
    {
      "name":"Variations",
      "steps":[
        {
          "headline":"Mix in chocolate, nuts, and dried fruit to customize you blondies.",
          "description":"Blondies form a great base for other ingredients. Simply mix 1 cup of the following into the batter right before you pour it in the pan:\nChocolate chips\nWhite chocolate\nDried cherries, cranberries, raspberries, etc. Chopped, walnuts, pecans, almonds."
        },
        {
          "headline":"Substitute mint or almond extract for vanilla.",
          "description":"You can easily change the flavor of your blondies with different extracts. You can even mix and match -- a tablespoon of both vanilla and almond has a nice, lightly sweetened flavor, for example."
        },
        {
          "headline":"Make fall-inspired pumpkin blondies.",
          "description":"Add 1 cup of pumpkin puree and a teaspoon of cinnamon, allspice, or nutmeg for \"Harvest Blondies.\" The result will be a hearty, lightly spiced Thanksgiving treat. These are also great with 1/2 cup walnuts, pecans, or chocolate chips."
        },
        {
          "headline":"Try white chocolate and cherry blondies.",
          "description":"Dried cherries and white chocolate go perfectly together for a rich, sweet blondie. You can also try a teaspoon of almond extract for a marzipan-like flavor."
        },
        {
          "headline":"Add 1/3 cup of bourbon for whiskey blondies.",
          "description":"These may sound odd, but the bourbon gives the cookie a caramelized tang that goes well with after-dinner drinks. Be sure to add an extra tablespoon of flour with the liquor to offset any additional liquid."
        },
        {
          "headline":"Add 1/8 teaspoon of baking powder to any recipe for lighter, flaky blondies.",
          "description":"Baking powder helps the batter rise in the oven, creating more air pockets for a lighter blondie."
        }
      ]
    }
  ],
  "text":" Baking a Blondie Preheat the oven to to 350 degrees.  Butter and flour your baking dish. Cover the sides of the baking pan with a thin layer of butter then sprinkle a dusting of flour around the pan.This prevents the blondies from sticking to the pan. You can also use baking spray as a healthier option. Melt the butter. You can melt the butter in either a sauce pot or in a glass dish in the microwave. Just heat the butter enough that it is completely melted -- it doesn't need to be hot. if using the microwave, heat the butter in 30 second intervals. Mix the butter into the sugar. While the butter is still melted, pour it into the sugar and quickly combine them. Let this mixture cool while you move on to the flour. Whisk together the flour, salt, and baking powder in another bowl. These make up your dry ingredients. Whisk the egg and vanilla into the cooled sugar and butter mixture. These form your wet ingredients. Make sure they are well mixed, but don't worry if some of the liquid is separated from the sugar. Do not whisk in the eggs until the sugar is cool to the touch, otherwise you risk cooking your eggs. Fold the wet and dry ingredients together. Combine the two bowls and, using a spatula, mix them together until you have a consistent batter. If you want any add-ins, like chocolate chips or nuts, add them now. Once there are no more chunks of flour or sugar the mixture is ready. Pour the batter into the pan. Even it out with your spatula so that the top is flat. Cook the blondies for 20 minutes. The bars will be golden brown on the tops and edges when they are finished. Stick a fork or wooden skewer through the center of the blondies and pull it out quickly. If there is wet batter on the knife then the blondies still need to cook. You may need to cook them for an extra 2-3 minutes depending on your oven's strength. Variations Mix in chocolate, nuts, and dried fruit to customize you blondies. Blondies form a great base for other ingredients. Simply mix 1 cup of the following into the batter right before you pour it in the pan:\nChocolate chips\nWhite chocolate\nDried cherries, cranberries, raspberries, etc. Chopped, walnuts, pecans, almonds. Substitute mint or almond extract for vanilla. You can easily change the flavor of your blondies with different extracts. You can even mix and match -- a tablespoon of both vanilla and almond has a nice, lightly sweetened flavor, for example. Make fall-inspired pumpkin blondies. Add 1 cup of pumpkin puree and a teaspoon of cinnamon, allspice, or nutmeg for \"Harvest Blondies.\" The result will be a hearty, lightly spiced Thanksgiving treat. These are also great with 1/2 cup walnuts, pecans, or chocolate chips. Try white chocolate and cherry blondies. Dried cherries and white chocolate go perfectly together for a rich, sweet blondie. You can also try a teaspoon of almond extract for a marzipan-like flavor. Add 1/3 cup of bourbon for whiskey blondies. These may sound odd, but the bourbon gives the cookie a caramelized tang that goes well with after-dinner drinks. Be sure to add an extra tablespoon of flour with the liquor to offset any additional liquid. Add 1/8 teaspoon of baking powder to any recipe for lighter, flaky blondies. Baking powder helps the batter rise in the oven, creating more air pockets for a lighter blondie.",
  "tyn_model":[
    "butter",
    "flour",
    "sugar",
    "oven",
    "baking powder",
    "vanilla",
    "chocolate chips",
    "chocolate",
    "microwave",
    "eggs",
    "spatula",
    "cherries",
    "walnuts",
    "pecans",
    "almond",
    "bourbon",
    "baking dish",
    "baking pan",
    "baking spray",
    "sauce pot",
    "glass dish",
    "salt",
    "bowl",
    "egg",
    "bowls",
    "fork",
    "knife",
    "nuts",
    "dried fruit",
    "white chocolate",
    "cranberries",
    "raspberries",
    "almonds",
    "mint",
    "pumpkin puree",
    "cinnamon",
    "allspice",
    "almond extract"
  ],
  "tyn_section":[

  ]
}