{
  "title":"How to Make Blueberry Ice Cream",
  "url":"https://www.wikihow.com/Make-Blueberry-Ice-Cream",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts",
    "Fruit Ice Cream"
  ],
  "steps":[
    {
      "headline":"Place the blueberries in a large saucepan.",
      "description":"Add the caster (superfine) sugar, bring to the boil, then simmer for 4 to 5 minutes until the berries burst."
    },
    {
      "headline":"Remove from the heat, and press through a fine sieve into a bowl to make a glossy coulis.",
      "description":"Leave to cool."
    },
    {
      "headline":"Place the cream into a large bowl.",
      "description":"With a whisk, lightly whip until the mixture just starts to thicken."
    },
    {
      "headline":"Fold the yogurt and icing sugar into the mixture until well combined and it has a smooth consistency.",
      "description":"Then stir in the blueberry coulis (pureed berry sauce)."
    },
    {
      "headline":"Transfer to a freeze-proof container with a lid.",
      "description":"Place in the freezer for about 4-5 hours until frozen. Remove the ice cream every hour and break up the ice crystals with a fork."
    },
    {
      "headline":"Remove from the freezer and leave in the fridge 15 minutes before serving to soften slightly.",
      "description":""
    },
    {
      "headline":"Serve.",
      "description":"Scoop out the ice cream and serve in bowls with more blueberries for dessert or place scoops into cones for a refreshing snack."
    }
  ],
  "text":" Place the blueberries in a large saucepan. Add the caster (superfine) sugar, bring to the boil, then simmer for 4 to 5 minutes until the berries burst. Remove from the heat, and press through a fine sieve into a bowl to make a glossy coulis. Leave to cool. Place the cream into a large bowl. With a whisk, lightly whip until the mixture just starts to thicken. Fold the yogurt and icing sugar into the mixture until well combined and it has a smooth consistency. Then stir in the blueberry coulis (pureed berry sauce). Transfer to a freeze-proof container with a lid. Place in the freezer for about 4-5 hours until frozen. Remove the ice cream every hour and break up the ice crystals with a fork. Remove from the freezer and leave in the fridge 15 minutes before serving to soften slightly.  Serve. Scoop out the ice cream and serve in bowls with more blueberries for dessert or place scoops into cones for a refreshing snack.",
  "tyn_model":[
    "freezer",
    "ice cream",
    "large saucepan",
    "sugar",
    "fine sieve",
    "bowl",
    "cream",
    "large bowl",
    "whisk",
    "yogurt",
    "icing sugar",
    "blueberry coulis",
    "freeze-proof container",
    "ice crystals",
    "fork",
    "blueberries"
  ],
  "tyn_section":[

  ]
}