{
  "title":"How to Cook Vegetable Curry",
  "url":"https://www.wikihow.com/Cook-Vegetable-Curry",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian"
  ],
  "steps":[
    {
      "headline":"Chop the onions and garlic and grind them well.",
      "description":"Fry the onions until golden brown, along with ginger and garlic."
    },
    {
      "headline":"Cube potatoes and other vegetables.",
      "description":""
    },
    {
      "headline":"Add the vegetables to the fried onion mixture, then add Cumin powder, Coriander powder, Turmeric,Paprika, 2-3 freshly chopped Chillies, plus a little Salt; also add a little toasted Cumin powder.",
      "description":"A small amount of Cinnamon and/or Fennel powder can be added as an option if desired. Fry these with the vegetables and onion mixture until well coated."
    },
    {
      "headline":"Mix water with vegetable stock cubes (optional).",
      "description":"Add a handful of freshly chopped coriander and simmer gently for 15-20 minutes."
    },
    {
      "headline":"Serve with pilau or plain rice, a bread, Naan or Chapati and some chutney.",
      "description":"Add yogurt after cooking, as well as tamarind paste."
    }
  ],
  "text":" Chop the onions and garlic and grind them well. Fry the onions until golden brown, along with ginger and garlic. Cube potatoes and other vegetables.  Add the vegetables to the fried onion mixture, then add Cumin powder, Coriander powder, Turmeric,Paprika, 2-3 freshly chopped Chillies, plus a little Salt; also add a little toasted Cumin powder. A small amount of Cinnamon and/or Fennel powder can be added as an option if desired. Fry these with the vegetables and onion mixture until well coated. Mix water with vegetable stock cubes (optional). Add a handful of freshly chopped coriander and simmer gently for 15-20 minutes. Serve with pilau or plain rice, a bread, Naan or Chapati and some chutney. Add yogurt after cooking, as well as tamarind paste.",
  "tyn_model":[
    "vegetables",
    "onions",
    "garlic",
    "coriander",
    "ginger",
    "potatoes",
    "fried onion",
    "cumin powder",
    "turmeric",
    "paprika",
    "salt",
    "cinnamon",
    "fennel",
    "onion",
    "water",
    "vegetable stock",
    "pilau or plain rice",
    "chutney",
    "yogurt",
    "tamarind paste"
  ],
  "tyn_section":[

  ]
}