{
  "title":"How to Draw a Floppy Hat",
  "url":"https://www.wikihow.com/Draw-a-Floppy-Hat",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Objects",
    "Drawing Clothes",
    "Drawing Hats"
  ],
  "steps":[
    {
      "headline":"Start by drawing a circle.",
      "description":"This will serve as the top of the hat."
    },
    {
      "headline":"Over the circle, draw an almond-shaped oval.",
      "description":"This is the basic shape of the rim."
    },
    {
      "headline":"Sketch out the slight folds almost in the shape of a square.",
      "description":"Curve the lines to show the unevenness of the fabric. When your satisfied, erase the unwanted lines and outline the drawing slightly."
    },
    {
      "headline":"Draw a ribbon in the right part of the hat.",
      "description":"Start by drawing two straight lines slightly above the rim of the hat. Then draw a circle with two triangles as the base for the bow. Add a few bends and folds around it to make the ribbon more natural looking."
    },
    {
      "headline":"If you want to make it \"pop\" in the drawing with felt pens or black liner.",
      "description":""
    },
    {
      "headline":"Erase the pencil (if you inked it) and add color.",
      "description":""
    }
  ],
  "text":" Start by drawing a circle. This will serve as the top of the hat. Over the circle, draw an almond-shaped oval. This is the basic shape of the rim. Sketch out the slight folds almost in the shape of a square. Curve the lines to show the unevenness of the fabric. When your satisfied, erase the unwanted lines and outline the drawing slightly. Draw a ribbon in the right part of the hat. Start by drawing two straight lines slightly above the rim of the hat. Then draw a circle with two triangles as the base for the bow. Add a few bends and folds around it to make the ribbon more natural looking. If you want to make it \"pop\" in the drawing with felt pens or black liner.  Erase the pencil (if you inked it) and add color. ",
  "tyn_model":[
    "ribbon",
    "fabric",
    "felt pens",
    "black liner",
    "pencil",
    "color"
  ],
  "tyn_section":[

  ]
}