{
  "title":"How to Make Players Hear Your Music on APB (All Points Bulletin)",
  "url":"https://www.wikihow.com/Make-Players-Hear-Your-Music-on-APB-(All-Points-Bulletin)",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games"
  ],
  "steps":[
    {
      "headline":"First you will need purchased music, downloaded or ripped, original purchased music works best and saves you lots of time.",
      "description":""
    },
    {
      "headline":"Make a file in My Documents called APB Music or name it anything you like.",
      "description":""
    },
    {
      "headline":"Drag your desired music into the file.",
      "description":""
    },
    {
      "headline":"Open APB and load a random district, then press 'P' once you have spawned.",
      "description":""
    },
    {
      "headline":"Now go to 'Import' and press 'Add', after press 'Start Import'.",
      "description":""
    },
    {
      "headline":"Once they are done, go to your playlist and look for your imported music, if they have a green thumbnail next to an imported song that means you don't have to identify them, if not you will have to go to 'Settings' and press 'Start Identify', this will allow Last.FM to detect the music you imported allowing others to possibly hear it.",
      "description":""
    },
    {
      "headline":"Now you can play your imported music and others that have the same imported music should be able to hear you!.",
      "description":""
    }
  ],
  "text":" First you will need purchased music, downloaded or ripped, original purchased music works best and saves you lots of time.  Make a file in My Documents called APB Music or name it anything you like.  Drag your desired music into the file.  Open APB and load a random district, then press 'P' once you have spawned.  Now go to 'Import' and press 'Add', after press 'Start Import'.  Once they are done, go to your playlist and look for your imported music, if they have a green thumbnail next to an imported song that means you don't have to identify them, if not you will have to go to 'Settings' and press 'Start Identify', this will allow Last.FM to detect the music you imported allowing others to possibly hear it.  Now you can play your imported music and others that have the same imported music should be able to hear you!. ",
  "tyn_model":[
    "music",
    "last.fm"
  ],
  "tyn_section":[

  ]
}