{
  "title":"How to Edit Photos on Google+",
  "url":"https://www.wikihow.com/Edit-Photos-on-Google%2B",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photography Editing"
  ],
  "methods":[
    {
      "name":"Adjusting a Photo - Desktop and Mobile",
      "steps":[
        {
          "headline":"Go to Google+ photos or launch the app and sign in.",
          "description":"You can download the GooglePhotos app from the App Store or Google Play Store. You can also access these photos through your Gmail account by selecting the menu icon from the upper right-hand corner (9 squares) and selecting \"Pictures\"."
        },
        {
          "headline":"Click on the photo you wish to edit.",
          "description":"The selected photo will expand."
        },
        {
          "headline":"Choose the pencil icon.",
          "description":"This will expose the editing tools. On desktops, this icon is found in the upper right-hand corner of the picture. On mobile, this icon is found at the bottom the screen to the left of the information icon (lowercase “i” in a circle) and the delete icon (trash can)."
        },
        {
          "headline":"Select the \"Tune\" icon.",
          "description":"This icon looks like three horizontal lines with adjusters. On desktops, this icon is found at the top of the new left-side menu. On mobile, this icon is found in the very bottom, left-hand corner of the screen."
        },
        {
          "headline":"Explore your editing options on desktop.",
          "description":"Here you have four editing tools. Click and drag the slider in order to adjust a setting and personalize your image. \"Light\" changes the brightness of your image. \"Color\" affects the vibrancy of your photo. By dragging the toggle all the way to the left, you can create a black and white photograph. \"Pop\" creates sharper lines and more distinct color palettes. \"Vignette\" applies a fading frame to your image."
        },
        {
          "headline":"Click on your photo and hold to compare it to the original.",
          "description":"At any point, you can compare to the original this way."
        },
        {
          "headline":"Explore your editing options on mobile.",
          "description":"Here you have five editing tools. Click on the tool you would like to use. To adjust the photo with the tool, drag the slider from left to right or right to left. “Auto” instantly adjusts the photo’s color and exposure. To undo “Auto”, click on the “Reset” icon. \"Light\" changes the brightness of your image. \"Color\" affects the vibrancy of your photo. By dragging the toggle all the way to the left, you can create a black and white photograph. \"Pop\" creates sharper lines and more distinct color palettes. \"Vignette\" applies a fading frame to your image."
        },
        {
          "headline":"Click on your photo and hold to compare it to the original.",
          "description":"At any point, you can compare to the original this way."
        },
        {
          "headline":"Save your changes.",
          "description":"Once you have finished making your edits, click the 3 dots icon near the top right corner of your photo and select \"Save copy\"."
        }
      ]
    },
    {
      "name":"Applying a Filter - Desktop and Mobile",
      "steps":[
        {
          "headline":"Go to Google+ photos or launch the app and sign in.",
          "description":"You can download the GooglePhotos app from the App Store or Google Play Store. You can also access these photos through your Gmail account by selecting the menu icon from the upper right-hand corner (9 squares) and selecting \"Pictures\"."
        },
        {
          "headline":"Select the photo you wish to edit.",
          "description":"The photo will expand."
        },
        {
          "headline":"Select the pencil icon.",
          "description":"This will expose the editing tools. On desktops, this icon is found in the upper right-hand corner of the picture. On mobile, this icon is found at the bottom the screen to the left of the information icon (lowercase “i” in a circle) and the delete icon (trash can)."
        },
        {
          "headline":"Click on the square icon with the “+” inside it.",
          "description":"This will launch all of the available filter options."
        },
        {
          "headline":"Click on a filter.",
          "description":"You may choose from fifteen different options, each of which change the \"feel\" of your photo by adjusting the color balance. Some filters (e.g. Phobos and Mars) help highlight the reds in your photo, while other (e.g. Ariel and Triton) will help bring out the greens\nFilters Pluto and Eris create a gray scale (black and white) version of your photo."
        },
        {
          "headline":"Click on your photo and hold to compare it to the original.",
          "description":"At any point, you can compare the edited image to the original this way."
        },
        {
          "headline":"Save your changes.",
          "description":"Once you have finished making your edits, click the 3 dots icon near the top right corner of your photo and select \"Save copy\"."
        }
      ]
    },
    {
      "name":"Cropping a Photo - Desktop and Mobile",
      "steps":[
        {
          "headline":"Go to Google+ photos or launch the app and sign in.",
          "description":"You can download the GooglePhotos app from the App Store or Google Play Store. You can also access these photos through your Gmail account by selecting the menu icon from the upper right-hand corner (9 squares) and selecting \"Pictures\"."
        },
        {
          "headline":"Choose the photo you wish to edit.",
          "description":"The photo you click will expand."
        },
        {
          "headline":"Click on the pencil icon.",
          "description":"This will expose the editing tools. On desktops, this icon is found in the upper right-hand corner of the picture. On mobile, this icon is found at the bottom the screen to the left of the information icon (lowercase “i” in a circle) and the delete icon (trash can)."
        },
        {
          "headline":"Select the crop icon (a square with two arrows circling it).",
          "description":"Clicking this icon will reveal the crop and rotation tools. Once selected, a box with highlighted corners and edges will appear around the picture. On desktops, find this icon in the upper-right corner. On mobile, find this icon in the very bottom, right-hand corner."
        },
        {
          "headline":"Manually adjust the size of the image on desktop and mobile.",
          "description":"You can crop the photo by clicking and dragging the highlighted corners and/or edges."
        },
        {
          "headline":"Automatically crop the photo on desktop only.",
          "description":"Use the Aspect Ratio feature to crop your photo to standard sizes. The tool keeps the photo’s length and width proportional. Click on the “Aspect Ratio” button (solid rectangle with dotted lines inside). This will reveal a drop-down menu. Select ratio from the menu:\n“Original” returns the photo to its original size. “Square” crops the photo to a square. “16:9” is the standard HDTV aspect ratio. “4:3” is the original ratio used for film and television\n“3:2” is the same ratio as a 4 x 6 inch print. “Flip” switches the numbers in the ration. For example, instead of an aspect ratio of 3:2, your image would have an aspect ratio of 2:3."
        },
        {
          "headline":"Click on your photo and hold to compare it to the original.",
          "description":"At any point during your edit, you can compare the edited image to the original this way."
        },
        {
          "headline":"Click “Done” to return to the editing tools.",
          "description":""
        },
        {
          "headline":"Save your changes.",
          "description":"Once you have finished making your edits, click the 3 dots icon near the top right corner of your photo and select \"Save copy\"."
        }
      ]
    },
    {
      "name":"Rotating a Photo - Desktop and Mobile",
      "steps":[
        {
          "headline":"Go to Google+ photos or launch the app and sign in.",
          "description":"You can download the GooglePhotos app from the App Store or Google Play Store. You can also access these photos through your Gmail account by selecting the menu icon from the upper right-hand corner (9 squares) and selecting \"Pictures\"."
        },
        {
          "headline":"Click on the photo you wish to edit.",
          "description":"The selected image will expand."
        },
        {
          "headline":"Select the pencil icon.",
          "description":"This will expose the editing tools. On desktops, this icon is found in the upper right-hand corner of the picture. On mobile, this icon is found at the bottom the screen to the left of the information icon (lowercase “i” in a circle) and the delete icon (trash can)."
        },
        {
          "headline":"Select the crop icon (a square icon with two arrows circling it).",
          "description":"Clicking this icon will reveal the crop and rotation tools. Once selected, a box with highlighted corners and edges will appear around the picture. On desktops, find this icon in the upper-right corner. On mobile, find this icon in the very bottom, right-hand corner."
        },
        {
          "headline":"Click on the “Rotate” icon to rotate the picture 90 degrees counterclockwise.",
          "description":"The icon is a diamond with a counterclockwise arrow around it. The rotation button only works in one direction (counter-clockwise) and for 90 degree at a time. Click it 4 times to return the photo to its original orientation."
        },
        {
          "headline":"Click on your photo and hold to compare it to the original.",
          "description":"At any point during your edit, you can compare the edited image to the original this way."
        },
        {
          "headline":"Click “Done” to return to the editing tools.",
          "description":""
        },
        {
          "headline":"Save your changes.",
          "description":"Once you have finished making your edits, click the 3 dots icon near the top right corner of your photo and select \"Save copy\"."
        }
      ]
    },
    {
      "name":"Undoing Edits",
      "steps":[
        {
          "headline":"Select the edited photo you wish to revert to the original image.",
          "description":"If you find that you are not happy with the saved changes you made, you may undo the edits at any time—even after you’ve logout of your account!"
        },
        {
          "headline":"Click on the pencil icon.",
          "description":"Find it in the upper right-hand corner of the picture and click to expose the editing tools."
        },
        {
          "headline":"Click “Undo Edits”.",
          "description":"This will undo all of the changes you have made to the photo and return it to the appearance it had when you initially uploaded it to Google+. \"Undo Edits\" will work even if you've previously saved your edit changes!"
        },
        {
          "headline":"Save your changes.",
          "description":"Once you have finished making your edits, click the 3 dots icon near the top right corner of your photo and select \"Save copy\"."
        }
      ]
    }
  ],
  "text":" Adjusting a Photo - Desktop and Mobile Go to Google+ photos or launch the app and sign in. You can download the GooglePhotos app from the App Store or Google Play Store. You can also access these photos through your Gmail account by selecting the menu icon from the upper right-hand corner (9 squares) and selecting \"Pictures\". Click on the photo you wish to edit. The selected photo will expand. Choose the pencil icon. This will expose the editing tools. On desktops, this icon is found in the upper right-hand corner of the picture. On mobile, this icon is found at the bottom the screen to the left of the information icon (lowercase “i” in a circle) and the delete icon (trash can). Select the \"Tune\" icon. This icon looks like three horizontal lines with adjusters. On desktops, this icon is found at the top of the new left-side menu. On mobile, this icon is found in the very bottom, left-hand corner of the screen. Explore your editing options on desktop. Here you have four editing tools. Click and drag the slider in order to adjust a setting and personalize your image. \"Light\" changes the brightness of your image. \"Color\" affects the vibrancy of your photo. By dragging the toggle all the way to the left, you can create a black and white photograph. \"Pop\" creates sharper lines and more distinct color palettes. \"Vignette\" applies a fading frame to your image. Click on your photo and hold to compare it to the original. At any point, you can compare to the original this way. Explore your editing options on mobile. Here you have five editing tools. Click on the tool you would like to use. To adjust the photo with the tool, drag the slider from left to right or right to left. “Auto” instantly adjusts the photo’s color and exposure. To undo “Auto”, click on the “Reset” icon. \"Light\" changes the brightness of your image. \"Color\" affects the vibrancy of your photo. By dragging the toggle all the way to the left, you can create a black and white photograph. \"Pop\" creates sharper lines and more distinct color palettes. \"Vignette\" applies a fading frame to your image. Click on your photo and hold to compare it to the original. At any point, you can compare to the original this way. Save your changes. Once you have finished making your edits, click the 3 dots icon near the top right corner of your photo and select \"Save copy\". Applying a Filter - Desktop and Mobile Go to Google+ photos or launch the app and sign in. You can download the GooglePhotos app from the App Store or Google Play Store. You can also access these photos through your Gmail account by selecting the menu icon from the upper right-hand corner (9 squares) and selecting \"Pictures\". Select the photo you wish to edit. The photo will expand. Select the pencil icon. This will expose the editing tools. On desktops, this icon is found in the upper right-hand corner of the picture. On mobile, this icon is found at the bottom the screen to the left of the information icon (lowercase “i” in a circle) and the delete icon (trash can). Click on the square icon with the “+” inside it. This will launch all of the available filter options. Click on a filter. You may choose from fifteen different options, each of which change the \"feel\" of your photo by adjusting the color balance. Some filters (e.g. Phobos and Mars) help highlight the reds in your photo, while other (e.g. Ariel and Triton) will help bring out the greens\nFilters Pluto and Eris create a gray scale (black and white) version of your photo. Click on your photo and hold to compare it to the original. At any point, you can compare the edited image to the original this way. Save your changes. Once you have finished making your edits, click the 3 dots icon near the top right corner of your photo and select \"Save copy\". Cropping a Photo - Desktop and Mobile Go to Google+ photos or launch the app and sign in. You can download the GooglePhotos app from the App Store or Google Play Store. You can also access these photos through your Gmail account by selecting the menu icon from the upper right-hand corner (9 squares) and selecting \"Pictures\". Choose the photo you wish to edit. The photo you click will expand. Click on the pencil icon. This will expose the editing tools. On desktops, this icon is found in the upper right-hand corner of the picture. On mobile, this icon is found at the bottom the screen to the left of the information icon (lowercase “i” in a circle) and the delete icon (trash can). Select the crop icon (a square with two arrows circling it). Clicking this icon will reveal the crop and rotation tools. Once selected, a box with highlighted corners and edges will appear around the picture. On desktops, find this icon in the upper-right corner. On mobile, find this icon in the very bottom, right-hand corner. Manually adjust the size of the image on desktop and mobile. You can crop the photo by clicking and dragging the highlighted corners and/or edges. Automatically crop the photo on desktop only. Use the Aspect Ratio feature to crop your photo to standard sizes. The tool keeps the photo’s length and width proportional. Click on the “Aspect Ratio” button (solid rectangle with dotted lines inside). This will reveal a drop-down menu. Select ratio from the menu:\n“Original” returns the photo to its original size. “Square” crops the photo to a square. “16:9” is the standard HDTV aspect ratio. “4:3” is the original ratio used for film and television\n“3:2” is the same ratio as a 4 x 6 inch print. “Flip” switches the numbers in the ration. For example, instead of an aspect ratio of 3:2, your image would have an aspect ratio of 2:3. Click on your photo and hold to compare it to the original. At any point during your edit, you can compare the edited image to the original this way. Click “Done” to return to the editing tools.  Save your changes. Once you have finished making your edits, click the 3 dots icon near the top right corner of your photo and select \"Save copy\". Rotating a Photo - Desktop and Mobile Go to Google+ photos or launch the app and sign in. You can download the GooglePhotos app from the App Store or Google Play Store. You can also access these photos through your Gmail account by selecting the menu icon from the upper right-hand corner (9 squares) and selecting \"Pictures\". Click on the photo you wish to edit. The selected image will expand. Select the pencil icon. This will expose the editing tools. On desktops, this icon is found in the upper right-hand corner of the picture. On mobile, this icon is found at the bottom the screen to the left of the information icon (lowercase “i” in a circle) and the delete icon (trash can). Select the crop icon (a square icon with two arrows circling it). Clicking this icon will reveal the crop and rotation tools. Once selected, a box with highlighted corners and edges will appear around the picture. On desktops, find this icon in the upper-right corner. On mobile, find this icon in the very bottom, right-hand corner. Click on the “Rotate” icon to rotate the picture 90 degrees counterclockwise. The icon is a diamond with a counterclockwise arrow around it. The rotation button only works in one direction (counter-clockwise) and for 90 degree at a time. Click it 4 times to return the photo to its original orientation. Click on your photo and hold to compare it to the original. At any point during your edit, you can compare the edited image to the original this way. Click “Done” to return to the editing tools.  Save your changes. Once you have finished making your edits, click the 3 dots icon near the top right corner of your photo and select \"Save copy\". Undoing Edits Select the edited photo you wish to revert to the original image. If you find that you are not happy with the saved changes you made, you may undo the edits at any time—even after you’ve logout of your account! Click on the pencil icon. Find it in the upper right-hand corner of the picture and click to expose the editing tools. Click “Undo Edits”. This will undo all of the changes you have made to the photo and return it to the appearance it had when you initially uploaded it to Google+. \"Undo Edits\" will work even if you've previously saved your edit changes! Save your changes. Once you have finished making your edits, click the 3 dots icon near the top right corner of your photo and select \"Save copy\".",
  "tyn_model":[
    "pencil",
    "“i",
    "” in",
    "” is",
    "slider",
    "“auto",
    "” icon",
    "filter",
    "filters",
    "“done",
    "” to",
    "” instantly",
    "”,",
    "“reset",
    "“+",
    "” inside",
    "mars",
    "ariel",
    "triton",
    "pluto",
    "gmail",
    "“aspect",
    "” button",
    "“original",
    "” returns",
    "“square",
    "” crops",
    "“16:9",
    "“4:3",
    "“3:2",
    "“flip",
    "” switches",
    "“rotate",
    "editing tools",
    "—even",
    "“undo",
    "”."
  ],
  "tyn_section":[

  ]
}