{
  "title":"How to Roast Garlic With a Norpro Garlic Baker",
  "url":"https://www.wikihow.com/Roast-Garlic-With-a-Norpro-Garlic-Baker",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "steps":[
    {
      "headline":"Purchase garlic that's fresh.",
      "description":"Do not roast garlic that's sprouted or it will taste bitter."
    },
    {
      "headline":"Soak the Norpro garlic baker domed lid in water for 10 minutes.",
      "description":""
    },
    {
      "headline":"Remove the garlic baker lid from the water.",
      "description":""
    },
    {
      "headline":"Remove some of the papery skins from the garlic cloves.",
      "description":""
    },
    {
      "headline":"Slice off the tops of the garlic to expose the garlic clove tops.",
      "description":""
    },
    {
      "headline":"Trim the garlic clove base so it will lay flat in the garlic baker.",
      "description":""
    },
    {
      "headline":"Drizzle olive oil over the garlic cloves.",
      "description":""
    },
    {
      "headline":"Sprinkle oregano, or other favorite herbs, over the garlic cloves.",
      "description":""
    },
    {
      "headline":"Season the garlic cloves with salt and pepper.",
      "description":""
    },
    {
      "headline":"Place the covered garlic baker in a cold oven.",
      "description":"Do not preheat the oven."
    },
    {
      "headline":"Bake the garlic cloves for 45 minutes at 325 degrees F or 163 degrees C.",
      "description":""
    },
    {
      "headline":"Baste the garlic cloves occasionally with olive oil.",
      "description":"This is optional."
    },
    {
      "headline":"Bake until the garlic cloves are tender and the husks are golden brown.",
      "description":""
    },
    {
      "headline":"Uncover the garlic cloves and allow until cool enough to squeeze the garlic out.",
      "description":""
    },
    {
      "headline":"Use as a condiment on French bread slices or use in recipes.",
      "description":"Roasted garlic goes well with mashed potatoes."
    }
  ],
  "text":" Purchase garlic that's fresh. Do not roast garlic that's sprouted or it will taste bitter. Soak the Norpro garlic baker domed lid in water for 10 minutes.  Remove the garlic baker lid from the water.  Remove some of the papery skins from the garlic cloves.  Slice off the tops of the garlic to expose the garlic clove tops.  Trim the garlic clove base so it will lay flat in the garlic baker.  Drizzle olive oil over the garlic cloves.  Sprinkle oregano, or other favorite herbs, over the garlic cloves.  Season the garlic cloves with salt and pepper.  Place the covered garlic baker in a cold oven. Do not preheat the oven. Bake the garlic cloves for 45 minutes at 325 degrees F or 163 degrees C.  Baste the garlic cloves occasionally with olive oil. This is optional. Bake until the garlic cloves are tender and the husks are golden brown.  Uncover the garlic cloves and allow until cool enough to squeeze the garlic out.  Use as a condiment on French bread slices or use in recipes. Roasted garlic goes well with mashed potatoes.",
  "tyn_model":[
    "garlic",
    "garlic baker",
    "water",
    "garlic clove",
    "olive oil",
    "garlic cloves",
    "oven",
    "norpro garlic baker",
    "oregano",
    "salt and pepper",
    "french bread",
    "potatoes"
  ],
  "tyn_section":[

  ]
}