{
  "title":"How to Choose a Wine to Cook With",
  "url":"https://www.wikihow.com/Choose-a-Wine-to-Cook-With",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Wine"
  ],
  "parts":[
    {
      "name":"Understanding the Basics",
      "steps":[
        {
          "headline":"Read the recipe.",
          "description":"Reading your recipe before you choose your cooking wine will help you narrow down your search. Even if you don't yet understand the difference between wine types, just knowing that you need a 'sweet white,' or a 'cup of dry red' will make the selection process a little less daunting."
        },
        {
          "headline":"Forget those bottles labeled 'cooking wine.'",
          "description":"While it might seem easy just to grab a bottle labeled 'cooking wine,' it's important to remember that this isn't the best 'wine' if you want to make an impressive meal. Cooking wine tastes more like a vinegar than a wine and will be located in the vinegar aisle at your local store. Choosing a wine to cook with means you will need to venture into the wine section of your supermarket, to your local liquor store, or to a winery. Liquor stores and wineries might be more helpful places to search for cooking wine as their staff will be trained in understanding the different properties of the wine that they are selling. They will easily be able to point you in the direction of sweet wines, dry wines, and dessert wines."
        },
        {
          "headline":"Taste some dry and sweet wines.Trying different wines will give you a taste for sweeter and dryer flavors.",
          "description":"Professionally speaking, a dry wine has no residual sugar, whereas a sweet wine does. In simple terms, some wines retain some excess sugar from the fermentation process, and as a result, they taste sweeter. Use sweet wines when baking desserts, and dryer wines when making savory dishes."
        },
        {
          "headline":"Choose a wine with a mid-range alcohol content.",
          "description":"Wines with an alcohol content of between 10 and 13 percent are best for cooking with, as wines that are too alcoholic will have less acidity (which is important for tenderizing), and will take a lot longer to reduce."
        }
      ]
    },
    {
      "name":"Choosing a White Cooking Wine",
      "steps":[
        {
          "headline":"Opt for a dry white if you are cooking white meat, fish, or creamy sauces.",
          "description":"Dry, crisp white is the most popular wine to cook with and can add wonderful flavor to creamy sauces, soups, chicken and shell fish dishes. Choose a rich, dry wine like Chardonnay for cream, or chicken dishes, a crisper Pinot Grigio for seafood options, and a lighter Sauvignon Blanc for veggies. Sweet white wines are used less in cooking, but if a recipe calls for a sweeter white, try out a Chenin Blanc, Muscat, or White Zinfandel."
        },
        {
          "headline":"Use a dry white to deglaze your pan.",
          "description":"Deglazing is the fancy way of saying 'removing bits of food from the pan with wine.' When you cook, bits of food often remain in the pan, and these are often the most flavorful. Deglazing allows you to maximise their flavor by mixing in some cool white wine to create a flavorsome broth, sauce, or stew. Sweeter wines might caramelize during the deglazing process, or add too much sweetness to your dish."
        },
        {
          "headline":"Choose a sparkling white for sorbets, savories or tangy vinaigrettes.",
          "description":"You can cook with sparkling wine as you would do normal wine, as the bubbles will disappear when they heat up. Sparkling wine is perfect for savory dishes (such as chicken, oysters, risotto, or fish), but it's also a great accompaniment to certain baked treats, sorbets, and salad vinaigrettes."
        }
      ]
    },
    {
      "name":"Opting for a Red Cooking Wine",
      "steps":[
        {
          "headline":"Opt for a dry red if you want rich flavors, or you are cooking red meat.",
          "description":"Dry reds are an excellent choice when cooking reductions, sauces, meaty stews, or Bolognese. Dry reds include Merlot, Cabernet Sauvignon, Shiraz/Syrah, and Cabernet Franc. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSamuel Bogue\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWine Director & Consultant\t\t\t\t\t\t\t\tSamuel Bogue is the Wine Director of the Ne Timeas Restaurant Group in San Francisco, California. He gained his Sommelier certification in 2013, is a Zagat \"30 Under 30\" award winner, and is a wine consultant for the San Francisco Bay Area's top restaurants. Samuel Bogue\t\t\tWine Director & Consultant\t\t\t\tOpt for a wine that's high in tannins to  complement a juicy steak. Tannins have a drying, astringent flavor profile. They're often used to pull out fat and moisture when you're tanning hides, and it does the same thing in your mouth. If you have, for instance, a nice fatty bite of steak, and you drink a wine that has higher tannins, immediately you'll feel your mouth start to dry out."
        },
        {
          "headline":"Choose a sweeter red if you are making a dessert.",
          "description":"Sweeter reds are wonderful with poached fruits like pears and can also be used in cakes and glazes. Some people might also choose a slightly sweeter red when making savory dishes like meatballs. Sweet reds include Rieslings, Madeira, and Sauternes."
        },
        {
          "headline":"Choose a rose' wine if you prefer a lighter flavor.",
          "description":"Rose' wines are made from red grapes, but the grape skins are removed very early on in the wine making process, hence the lighter color. Rose' wines can be delicious in desserts and with savory dishes. You can get both sweet and dry rose' wines, but the dryer varieties are better for cooking with and can be used in marinades and casseroles."
        },
        {
          "headline":"Use a pinot noir when cooking desserts to avoid tannins.",
          "description":"Tannins are bitter organic compounds and they are often found in red wines. These can make dishes taste bitter. However, proteins in meat luckily break these tannins down (a bit like milk breaks down tannins in a cup of tea!) If you are cooking a savory meat dish with red wine you need not worry about the tannins, as the protein in the meat will break them down. If you are making a dessert, a pinot noir is great choice."
        }
      ]
    },
    {
      "name":"Using Different Wines and Wine Substitutes",
      "steps":[
        {
          "headline":"Grab a sweet fortified wine like port or sherry if you like rich flavors.",
          "description":"Ports are great for a variety of dishes, from sweet desserts to savory reductions. You can use port to make a decadent sauce for your steak, and this often goes well with a blue cheese side. You can also use port and sherry in chocolate desserts and on top of cakes and brownies. Port is made from red grapes and is thus classified as a red wine, and sherry is made from white grapes and is, therefore, a white wine. However, both are far sweeter than normal drinking wines and both are categorized as dessert wines."
        },
        {
          "headline":"Choose a rice wine if you are cooking a Japanese or Chinese inspired dish.",
          "description":"Although Chinese rice wine isn't technically an alcohol, it can add great flavor to Asian style dishes. Japanese wine, otherwise known as 'Mirin' has about 10 % alcohol and is delicious in Asian barbeque sauces and glazes."
        },
        {
          "headline":"Make a substitution.",
          "description":"If you are cooking for people do not consume alcohol for religious, or personal reasons you can use some non-alcoholic substitutes. Replace dry red wines with red wine vinegar (this is acidic and great for deglazing your cooking pan) or cranberry or pomegranate juice for a sweeter red. If your recipe calls for a dry white wine use some white wine vinegar. Use white grape juice for a sweeter white or vegetable stock mixed with lemon juice for a more tangy flavor."
        }
      ]
    }
  ],
  "text":" Understanding the Basics Read the recipe. Reading your recipe before you choose your cooking wine will help you narrow down your search. Even if you don't yet understand the difference between wine types, just knowing that you need a 'sweet white,' or a 'cup of dry red' will make the selection process a little less daunting. Forget those bottles labeled 'cooking wine.' While it might seem easy just to grab a bottle labeled 'cooking wine,' it's important to remember that this isn't the best 'wine' if you want to make an impressive meal. Cooking wine tastes more like a vinegar than a wine and will be located in the vinegar aisle at your local store. Choosing a wine to cook with means you will need to venture into the wine section of your supermarket, to your local liquor store, or to a winery. Liquor stores and wineries might be more helpful places to search for cooking wine as their staff will be trained in understanding the different properties of the wine that they are selling. They will easily be able to point you in the direction of sweet wines, dry wines, and dessert wines. Taste some dry and sweet wines.Trying different wines will give you a taste for sweeter and dryer flavors. Professionally speaking, a dry wine has no residual sugar, whereas a sweet wine does. In simple terms, some wines retain some excess sugar from the fermentation process, and as a result, they taste sweeter. Use sweet wines when baking desserts, and dryer wines when making savory dishes. Choose a wine with a mid-range alcohol content. Wines with an alcohol content of between 10 and 13 percent are best for cooking with, as wines that are too alcoholic will have less acidity (which is important for tenderizing), and will take a lot longer to reduce. Choosing a White Cooking Wine Opt for a dry white if you are cooking white meat, fish, or creamy sauces. Dry, crisp white is the most popular wine to cook with and can add wonderful flavor to creamy sauces, soups, chicken and shell fish dishes. Choose a rich, dry wine like Chardonnay for cream, or chicken dishes, a crisper Pinot Grigio for seafood options, and a lighter Sauvignon Blanc for veggies. Sweet white wines are used less in cooking, but if a recipe calls for a sweeter white, try out a Chenin Blanc, Muscat, or White Zinfandel. Use a dry white to deglaze your pan. Deglazing is the fancy way of saying 'removing bits of food from the pan with wine.' When you cook, bits of food often remain in the pan, and these are often the most flavorful. Deglazing allows you to maximise their flavor by mixing in some cool white wine to create a flavorsome broth, sauce, or stew. Sweeter wines might caramelize during the deglazing process, or add too much sweetness to your dish. Choose a sparkling white for sorbets, savories or tangy vinaigrettes. You can cook with sparkling wine as you would do normal wine, as the bubbles will disappear when they heat up. Sparkling wine is perfect for savory dishes (such as chicken, oysters, risotto, or fish), but it's also a great accompaniment to certain baked treats, sorbets, and salad vinaigrettes. Opting for a Red Cooking Wine Opt for a dry red if you want rich flavors, or you are cooking red meat. Dry reds are an excellent choice when cooking reductions, sauces, meaty stews, or Bolognese. Dry reds include Merlot, Cabernet Sauvignon, Shiraz/Syrah, and Cabernet Franc. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSamuel Bogue\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWine Director & Consultant\t\t\t\t\t\t\t\tSamuel Bogue is the Wine Director of the Ne Timeas Restaurant Group in San Francisco, California. He gained his Sommelier certification in 2013, is a Zagat \"30 Under 30\" award winner, and is a wine consultant for the San Francisco Bay Area's top restaurants. Samuel Bogue\t\t\tWine Director & Consultant\t\t\t\tOpt for a wine that's high in tannins to  complement a juicy steak. Tannins have a drying, astringent flavor profile. They're often used to pull out fat and moisture when you're tanning hides, and it does the same thing in your mouth. If you have, for instance, a nice fatty bite of steak, and you drink a wine that has higher tannins, immediately you'll feel your mouth start to dry out. Choose a sweeter red if you are making a dessert. Sweeter reds are wonderful with poached fruits like pears and can also be used in cakes and glazes. Some people might also choose a slightly sweeter red when making savory dishes like meatballs. Sweet reds include Rieslings, Madeira, and Sauternes. Choose a rose' wine if you prefer a lighter flavor. Rose' wines are made from red grapes, but the grape skins are removed very early on in the wine making process, hence the lighter color. Rose' wines can be delicious in desserts and with savory dishes. You can get both sweet and dry rose' wines, but the dryer varieties are better for cooking with and can be used in marinades and casseroles. Use a pinot noir when cooking desserts to avoid tannins. Tannins are bitter organic compounds and they are often found in red wines. These can make dishes taste bitter. However, proteins in meat luckily break these tannins down (a bit like milk breaks down tannins in a cup of tea!) If you are cooking a savory meat dish with red wine you need not worry about the tannins, as the protein in the meat will break them down. If you are making a dessert, a pinot noir is great choice. Using Different Wines and Wine Substitutes Grab a sweet fortified wine like port or sherry if you like rich flavors. Ports are great for a variety of dishes, from sweet desserts to savory reductions. You can use port to make a decadent sauce for your steak, and this often goes well with a blue cheese side. You can also use port and sherry in chocolate desserts and on top of cakes and brownies. Port is made from red grapes and is thus classified as a red wine, and sherry is made from white grapes and is, therefore, a white wine. However, both are far sweeter than normal drinking wines and both are categorized as dessert wines. Choose a rice wine if you are cooking a Japanese or Chinese inspired dish. Although Chinese rice wine isn't technically an alcohol, it can add great flavor to Asian style dishes. Japanese wine, otherwise known as 'Mirin' has about 10 % alcohol and is delicious in Asian barbeque sauces and glazes. Make a substitution. If you are cooking for people do not consume alcohol for religious, or personal reasons you can use some non-alcoholic substitutes. Replace dry red wines with red wine vinegar (this is acidic and great for deglazing your cooking pan) or cranberry or pomegranate juice for a sweeter red. If your recipe calls for a dry white wine use some white wine vinegar. Use white grape juice for a sweeter white or vegetable stock mixed with lemon juice for a more tangy flavor.",
  "tyn_model":[
    "wine",
    "cooking wine",
    "port",
    "sherry",
    "vinegar",
    "wines",
    "sugar",
    "pinot",
    "sparkling wine",
    "chardonnay",
    "sauvignon blanc",
    "chenin blanc",
    "white zinfandel",
    "deglazing",
    "cool white wine",
    "sparkling white",
    "merlot",
    "cabernet sauvignon",
    "shiraz",
    "syrah",
    "cabernet franc",
    "sommelier",
    "tannins",
    "rieslings",
    "madeira",
    "sauternes",
    "rose' wine",
    "noir",
    "red wines",
    "milk",
    "red wine",
    "pinot noir",
    "ports",
    "blue cheese",
    "rice wine",
    "red wine vinegar",
    "cranberry",
    "white wine vinegar",
    "white grape juice",
    "vegetable stock",
    "lemon"
  ],
  "tyn_section":[

  ]
}