{
  "title":"How to Change the Heating Element in a Dryer",
  "url":"https://www.wikihow.com/Change-the-Heating-Element-in-a-Dryer",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Home Repairs"
  ],
  "steps":[
    {
      "headline":"Unplug the dryer.",
      "description":""
    },
    {
      "headline":"Take off dryer exhaust hose and remove the back panel.",
      "description":""
    },
    {
      "headline":"Look at the back of the dryer.",
      "description":"On the right side, you'll see a long metal (probably gray) housing. The Element is inside."
    },
    {
      "headline":"Unscrew the black sensor on top, and unscrew the black sensor on the bottom.",
      "description":""
    },
    {
      "headline":"Unhook the two wires just below the bottom sensor.",
      "description":"(These two sensors could be your problem (in 50% of the cases, it is). Also, there is a heating fuse to your left, under the larger casing on the left. It is about an inch long, and has two wires attached. This can also be your problem. One screw holds it in. If in doubt, take all these to the appliance store, and they'll test them with a voltmeter.)"
    },
    {
      "headline":"Gently lift up on the whole gray casing.",
      "description":"It should easily come loose. If not, lift a little harder and pull the bottom toward you. There may be a screw and small bracket at the top that needs to be removed. There are some hooks on the bottom that will come loose."
    },
    {
      "headline":"Turn it upside down; you'll see one screw holding the element in.",
      "description":"Take out the screw, and carefully pull out the element, which is a coil that heats up, on some metal housing. Examine the coil for breaks. If you have a voltmeter, test the element. Also test the Sensors. This will tell you what's broken."
    },
    {
      "headline":"Install the new element in the reverse of the above.",
      "description":"Replace the element, replace all the sensors and the back panel, as well as the exhaust hose. When done, try it out!"
    }
  ],
  "text":" Unplug the dryer.  Take off dryer exhaust hose and remove the back panel.  Look at the back of the dryer. On the right side, you'll see a long metal (probably gray) housing. The Element is inside. Unscrew the black sensor on top, and unscrew the black sensor on the bottom.  Unhook the two wires just below the bottom sensor. (These two sensors could be your problem (in 50% of the cases, it is). Also, there is a heating fuse to your left, under the larger casing on the left. It is about an inch long, and has two wires attached. This can also be your problem. One screw holds it in. If in doubt, take all these to the appliance store, and they'll test them with a voltmeter.) Gently lift up on the whole gray casing. It should easily come loose. If not, lift a little harder and pull the bottom toward you. There may be a screw and small bracket at the top that needs to be removed. There are some hooks on the bottom that will come loose. Turn it upside down; you'll see one screw holding the element in. Take out the screw, and carefully pull out the element, which is a coil that heats up, on some metal housing. Examine the coil for breaks. If you have a voltmeter, test the element. Also test the Sensors. This will tell you what's broken. Install the new element in the reverse of the above. Replace the element, replace all the sensors and the back panel, as well as the exhaust hose. When done, try it out!",
  "tyn_model":[
    "dryer",
    "sensors",
    "dryer exhaust",
    "appliance store",
    "screw",
    "voltmeter",
    "exhaust hose"
  ],
  "tyn_section":[

  ]
}