{
  "title":"How to Make a Soft Taco",
  "url":"https://www.wikihow.com/Make-a-Soft-Taco",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine",
    "Taco Dishes"
  ],
  "steps":[
    {
      "headline":"Cook the meat in a skillet.",
      "description":"When it is well cooked, then add the seasoning so this avoids drawing out juices."
    },
    {
      "headline":"Heat the tortillas in the microwave or between slightly dampened dish towels or paper towels in an oven (Don't dry them out.",
      "description":")."
    },
    {
      "headline":"Put meat in tortilla first, then add all the raw vegetables like lettuce, tomatoes, and the salsa.",
      "description":""
    },
    {
      "headline":"Then add the cheese (or you may like to melt the cheese over the meat in the microwave or such) and sour cream into the soft tortilla shell.",
      "description":""
    },
    {
      "headline":"Fold the tops of the tortillas together, tuck into a wrapper to avoid dripping juices and enjoy this delicious dish!",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Cook the meat in a skillet. When it is well cooked, then add the seasoning so this avoids drawing out juices. Heat the tortillas in the microwave or between slightly dampened dish towels or paper towels in an oven (Don't dry them out. ). Put meat in tortilla first, then add all the raw vegetables like lettuce, tomatoes, and the salsa.  Then add the cheese (or you may like to melt the cheese over the meat in the microwave or such) and sour cream into the soft tortilla shell.  Fold the tops of the tortillas together, tuck into a wrapper to avoid dripping juices and enjoy this delicious dish!  Finished. ",
  "tyn_model":[
    "tortillas",
    "skillet",
    "microwave",
    "dish towels",
    "tomatoes",
    "salsa",
    "cheese",
    "sour cream",
    "tortilla"
  ],
  "tyn_section":[

  ]
}