{
  "title":"How to Make a Candle in a Cup",
  "url":"https://www.wikihow.com/Make-a-Candle-in-a-Cup",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Candles"
  ],
  "steps":[
    {
      "headline":"Visit any thrift store, charity shop or bric-a-brac shop, to find old tea cups, eggs cups or coffee cups.",
      "description":"A stylish choice is to hunt for old china cups complete with saucers. Any ceramic or glass should be able to hold up to the heat of the candle."
    },
    {
      "headline":"Go to the craft store to buy wax, wicks that you can cut to the right size and candle dyes or scents.",
      "description":"If the wicks do not have metal tabs at the end, you will need to buy them as well; they are known as wick sustainers. Pick up a hot glue gun, if you do not already own one."
    },
    {
      "headline":"Clean your cups thoroughly.",
      "description":""
    },
    {
      "headline":"Plug in your hot glue gun.",
      "description":""
    },
    {
      "headline":"Secure your metal sustainer to your wick by squeezing it together with the metal, if it is not already attached.",
      "description":""
    },
    {
      "headline":"Place a dab of hot glue in the center of your cup and press the metal sustainer and wick on top of it.",
      "description":""
    },
    {
      "headline":"Cut the wick so that it is 2 inches (5 cm) above the top of the cup.",
      "description":""
    },
    {
      "headline":"Place the microwaveable wax in a microwaveable container, like a plastic measuring cup, and heat it according to the package directions.",
      "description":"You can also use leftover wax from candles that have been used up. Place the old candle wax in a small pan, and place that pan in a larger pan of simmering water. Use a thermometer to gauge when the wax has reached about 185 degrees Fahrenheit (85 degrees Celsius). Also use this method if you have bought paraffin wax flakes."
    },
    {
      "headline":"Add dye or scent if you choose.",
      "description":""
    },
    {
      "headline":"Carefully pour the wax in the cup until it is 1/2 inch (1.27 cm) below the cups rim.",
      "description":"Make sure to do this immediately after the wax has melted."
    },
    {
      "headline":"Straighten the wick immediately after pouring the wax.",
      "description":""
    },
    {
      "headline":"Clean your receptacles of glass while they are still hot.",
      "description":"Pour any remaining wax out and wipe clean with a paper towel. Clean with an all-purpose cleaner to remove remaining residue."
    },
    {
      "headline":"Wait for about an hour for the wax to dry.",
      "description":""
    },
    {
      "headline":"Trim the wick to about 1/2 inch (1.27 cm) above the rim.",
      "description":"Use your candle in a cup."
    }
  ],
  "text":" Visit any thrift store, charity shop or bric-a-brac shop, to find old tea cups, eggs cups or coffee cups. A stylish choice is to hunt for old china cups complete with saucers. Any ceramic or glass should be able to hold up to the heat of the candle. Go to the craft store to buy wax, wicks that you can cut to the right size and candle dyes or scents. If the wicks do not have metal tabs at the end, you will need to buy them as well; they are known as wick sustainers. Pick up a hot glue gun, if you do not already own one. Clean your cups thoroughly.  Plug in your hot glue gun.  Secure your metal sustainer to your wick by squeezing it together with the metal, if it is not already attached.  Place a dab of hot glue in the center of your cup and press the metal sustainer and wick on top of it.  Cut the wick so that it is 2 inches (5 cm) above the top of the cup.  Place the microwaveable wax in a microwaveable container, like a plastic measuring cup, and heat it according to the package directions. You can also use leftover wax from candles that have been used up. Place the old candle wax in a small pan, and place that pan in a larger pan of simmering water. Use a thermometer to gauge when the wax has reached about 185 degrees Fahrenheit (85 degrees Celsius). Also use this method if you have bought paraffin wax flakes. Add dye or scent if you choose.  Carefully pour the wax in the cup until it is 1/2 inch (1.27 cm) below the cups rim. Make sure to do this immediately after the wax has melted. Straighten the wick immediately after pouring the wax.  Clean your receptacles of glass while they are still hot. Pour any remaining wax out and wipe clean with a paper towel. Clean with an all-purpose cleaner to remove remaining residue. Wait for about an hour for the wax to dry.  Trim the wick to about 1/2 inch (1.27 cm) above the rim. Use your candle in a cup.",
  "tyn_model":[
    "wax",
    "hot glue",
    "tea cups",
    "saucers",
    "hot glue gun",
    "metal sustainer",
    "microwaveable wax",
    "microwaveable container",
    "candle wax",
    "simmering water",
    "paraffin wax",
    "glass",
    "paper towel",
    "all-purpose cleaner",
    "candle"
  ],
  "tyn_section":[

  ]
}