{
  "title":"How to Darken Grout",
  "url":"https://www.wikihow.com/Darken-Grout",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Tiles and Tiling",
    "Tiling Grout"
  ],
  "methods":[
    {
      "name":"Applying Grout Stain",
      "steps":[
        {
          "headline":"Prepare the colorant.",
          "description":"Pour a small amount of grout stain into a paint tray. This will allow easier access to the stain. You may add more stain to the tray when necessary."
        },
        {
          "headline":"Paint the grout.",
          "description":"Use a small artist's paintbrush and apply an even coat of stain to the grout. Use the stain sparingly on the brush and be careful not to allow any stain to pool in 1 area, as pools of stain will darken spots quickly due to the porous nature of grout. Allow the grout to dry for 1 hour."
        }
      ]
    },
    {
      "name":"Cleaning the Tiles",
      "steps":[
        {
          "headline":"Wipe the tiles.",
          "description":"Remove excess stain that may have overlapped onto the tiles by filling a spray bottle with water. Thoroughly spray the area and wipe down with a clean sponge."
        },
        {
          "headline":"Remove extra dried stain.",
          "description":"Use a nylon scrub pad to clean any stubborn dried stain from your tiles."
        }
      ]
    }
  ],
  "text":" Applying Grout Stain Prepare the colorant. Pour a small amount of grout stain into a paint tray. This will allow easier access to the stain. You may add more stain to the tray when necessary. Paint the grout. Use a small artist's paintbrush and apply an even coat of stain to the grout. Use the stain sparingly on the brush and be careful not to allow any stain to pool in 1 area, as pools of stain will darken spots quickly due to the porous nature of grout. Allow the grout to dry for 1 hour. Cleaning the Tiles Wipe the tiles. Remove excess stain that may have overlapped onto the tiles by filling a spray bottle with water. Thoroughly spray the area and wipe down with a clean sponge. Remove extra dried stain. Use a nylon scrub pad to clean any stubborn dried stain from your tiles.",
  "tyn_model":[
    "grout",
    "grout stain",
    "paint tray",
    "artist's paintbrush",
    "water",
    "sponge",
    "nylon scrub pad"
  ],
  "tyn_section":[

  ]
}