{
  "title":"How to Administer a Coffee Enema",
  "url":"https://www.wikihow.com/Administer-a-Coffee-Enema",
  "category_hierarchy":[
    "Food and Entertaining",
    "Appreciation of Food"
  ],
  "parts":[
    {
      "name":"Deciding Whether to Do a Coffee Enema",
      "steps":[
        {
          "headline":"Be aware of the risks.",
          "description":"Administering a coffee enema can have adverse health risks, including colitis, septicemia,, and rectal burns due to the temperature of the coffee. There have even been reports of coffee-enema-related deaths."
        },
        {
          "headline":"Realize the limitations of the treatment.",
          "description":"Despite holistic rumors  a coffee enema is unlikely to have significant effects. The caffeine absorption from a coffee enema is far less than drinking coffee, and it has a negligible effect on blood pressure and heart rate. While limited use may not be harmful to every user, the benefits appear to be minimal."
        },
        {
          "headline":"Speak with a healthcare practitioner.",
          "description":"If you are considering a coffee enema, talk to your doctor about it first. It is likely that your physician will advise against the treatment, but she may be able to offer alternatives or to give you additional information about your prognosis. Other health and lifestyle changes may have a greater effect on your wellbeing with fewer risks."
        },
        {
          "headline":"Consider alternatives.",
          "description":"Since the theory behind the coffee enema has to do with the body’s response to caffeine, you should try drinking coffee instead of using an enema. You will absorb more caffeine by drinking the coffee without the other health risks of the enema."
        },
        {
          "headline":"Minimize your risks.",
          "description":"If you choose do do a coffee enema despite the fact that there are few likely health benefits and many possible risks, then do what you can to minimize the risks:\nCool the temperature to an appropriate temperature to avoid burns. Keep equipment as sterile as possible. Watch for signs of infection and seek medical attention immediately if you experience a fever after administering a coffee enema. Do not discontinue other types of medical treatment in favor of this unproven alternative therapy. Do not share the enema equipment with anyone. Always wear vinyl or latex gloves when administering enemas."
        }
      ]
    },
    {
      "name":"Making the Coffee",
      "steps":[
        {
          "headline":"Boil slightly less than 1 quart (.946 liter) of unchlorinated, filtered water in a stainless steel pot.",
          "description":"Boil less than 1 quart because you will add ice cubes later. Use unchlorinated water to make the coffee because chlorine could kill the bacteria and germs your system needs to remain healthy."
        },
        {
          "headline":"Add 2 level tbsp.",
          "description":"(24 grams) of ground, caffeinated coffee and boil for 5 minutes."
        },
        {
          "headline":"Turn off the heat and remove the pan from the hot burner.",
          "description":""
        },
        {
          "headline":"Place 3 ice cubes (also made from unchlorinated, filtered water) in the pan.",
          "description":"This will settle the coffee grounds to the bottom of the pan and cool the liquid."
        },
        {
          "headline":"Strain the cooled coffee into a container through cheesecloth, cotton cloth or cotton muslin.",
          "description":"Strain the coffee into a container you will use only for enemas, as feces could get into the syringe when you refill the bulb for your second enema."
        },
        {
          "headline":"Add more ice cubes until the coffee is approximately body temperature.",
          "description":""
        }
      ]
    },
    {
      "name":"Syringe Enema",
      "steps":[
        {
          "headline":"Fill the syringe by squeezing the bulb flat and placing the tip in the coffee and releasing the bulb.",
          "description":"The bulb will suck in the coffee and should hold about 1 cup (236 ml) of coffee."
        },
        {
          "headline":"Lubricate the anus and the tip of the syringe with an appropriate lubricant.",
          "description":""
        },
        {
          "headline":"Insert the syringe gently and slowly into your rectum for about 4 inches.",
          "description":"If you encounter any resistance, stop. Piercing a colon is no fun if you do pierce your colon seek medical attention immediately by calling your local Emergency Medical service immediately. In the USA, that number is 911."
        },
        {
          "headline":"Squeeze the bulb gently to release the coffee into your rectum then slowly remove the syringe from your anus.",
          "description":""
        },
        {
          "headline":"Try to retain the coffee inside you for approximately 12 minutes.",
          "description":"Do not strain to hold the coffee. If you feel it necessary to move your bowels before 12 minutes pass do so."
        },
        {
          "headline":"Repeat the enema after you void.",
          "description":""
        },
        {
          "headline":"Wash the exterior with soapy hot water then rinse the interior of the syringe with a solution of 1 part hydrogen peroxide and 1 part water.",
          "description":"Rinse thoroughly with warm, clean water."
        }
      ]
    },
    {
      "name":"Enema Bag",
      "steps":[
        {
          "headline":"Clamp the tubing of the enema bag, then pour the cooled coffee into the bag with a funnel or pitcher.",
          "description":"Loosen the clamp a bit; some coffee will run out. When the air is removed from the tubing, clamp the tubing closed again."
        },
        {
          "headline":"Lubricate the nozzle and your anus with coconut oil, KY jelly, or another suitable lubricant.",
          "description":""
        },
        {
          "headline":"Insert the nozzle gently about 4 inches (10.16 cm) into your rectum.",
          "description":""
        },
        {
          "headline":"Unclamp the tubing until half the liquid enters you.",
          "description":"If you feel fullness or discomfort, clamp the tubing closed immediately. Remove the nozzle when you finish releasing the coffee into yourself."
        },
        {
          "headline":"Try to retain the coffee for 12 minutes.",
          "description":""
        },
        {
          "headline":"Repeat the enema after you void.",
          "description":""
        },
        {
          "headline":"Rinse the enema bag when you are done and hang it to dry.",
          "description":""
        }
      ]
    },
    {
      "name":"Disposable Enema",
      "steps":[
        {
          "headline":"Purchase two 8 oz (236 ml) size disposable enemas from your local drug store.",
          "description":""
        },
        {
          "headline":"Replace the liquid in these disposable enemas with coffee brewed above.",
          "description":""
        },
        {
          "headline":"Administer the  enema as per the package directions.",
          "description":"Ensure you remove the protective cover from the nozzle before you attempt to insert the nozzle."
        },
        {
          "headline":"Try to retain the coffee for approximately 12 minutes.",
          "description":""
        },
        {
          "headline":"Use the second enema after you void the first one.",
          "description":""
        },
        {
          "headline":"Try to retain the coffee for approximately 12 minutes before voiding.",
          "description":""
        },
        {
          "headline":"Appropriately dispose the  empty containers as hazardous waste.",
          "description":""
        }
      ]
    }
  ],
  "text":" Deciding Whether to Do a Coffee Enema Be aware of the risks. Administering a coffee enema can have adverse health risks, including colitis, septicemia,, and rectal burns due to the temperature of the coffee. There have even been reports of coffee-enema-related deaths. Realize the limitations of the treatment. Despite holistic rumors  a coffee enema is unlikely to have significant effects. The caffeine absorption from a coffee enema is far less than drinking coffee, and it has a negligible effect on blood pressure and heart rate. While limited use may not be harmful to every user, the benefits appear to be minimal. Speak with a healthcare practitioner. If you are considering a coffee enema, talk to your doctor about it first. It is likely that your physician will advise against the treatment, but she may be able to offer alternatives or to give you additional information about your prognosis. Other health and lifestyle changes may have a greater effect on your wellbeing with fewer risks. Consider alternatives. Since the theory behind the coffee enema has to do with the body’s response to caffeine, you should try drinking coffee instead of using an enema. You will absorb more caffeine by drinking the coffee without the other health risks of the enema. Minimize your risks. If you choose do do a coffee enema despite the fact that there are few likely health benefits and many possible risks, then do what you can to minimize the risks:\nCool the temperature to an appropriate temperature to avoid burns. Keep equipment as sterile as possible. Watch for signs of infection and seek medical attention immediately if you experience a fever after administering a coffee enema. Do not discontinue other types of medical treatment in favor of this unproven alternative therapy. Do not share the enema equipment with anyone. Always wear vinyl or latex gloves when administering enemas. Making the Coffee Boil slightly less than 1 quart (.946 liter) of unchlorinated, filtered water in a stainless steel pot. Boil less than 1 quart because you will add ice cubes later. Use unchlorinated water to make the coffee because chlorine could kill the bacteria and germs your system needs to remain healthy. Add 2 level tbsp. (24 grams) of ground, caffeinated coffee and boil for 5 minutes. Turn off the heat and remove the pan from the hot burner.  Place 3 ice cubes (also made from unchlorinated, filtered water) in the pan. This will settle the coffee grounds to the bottom of the pan and cool the liquid. Strain the cooled coffee into a container through cheesecloth, cotton cloth or cotton muslin. Strain the coffee into a container you will use only for enemas, as feces could get into the syringe when you refill the bulb for your second enema. Add more ice cubes until the coffee is approximately body temperature.  Syringe Enema Fill the syringe by squeezing the bulb flat and placing the tip in the coffee and releasing the bulb. The bulb will suck in the coffee and should hold about 1 cup (236 ml) of coffee. Lubricate the anus and the tip of the syringe with an appropriate lubricant.  Insert the syringe gently and slowly into your rectum for about 4 inches. If you encounter any resistance, stop. Piercing a colon is no fun if you do pierce your colon seek medical attention immediately by calling your local Emergency Medical service immediately. In the USA, that number is 911. Squeeze the bulb gently to release the coffee into your rectum then slowly remove the syringe from your anus.  Try to retain the coffee inside you for approximately 12 minutes. Do not strain to hold the coffee. If you feel it necessary to move your bowels before 12 minutes pass do so. Repeat the enema after you void.  Wash the exterior with soapy hot water then rinse the interior of the syringe with a solution of 1 part hydrogen peroxide and 1 part water. Rinse thoroughly with warm, clean water. Enema Bag Clamp the tubing of the enema bag, then pour the cooled coffee into the bag with a funnel or pitcher. Loosen the clamp a bit; some coffee will run out. When the air is removed from the tubing, clamp the tubing closed again. Lubricate the nozzle and your anus with coconut oil, KY jelly, or another suitable lubricant.  Insert the nozzle gently about 4 inches (10.16 cm) into your rectum.  Unclamp the tubing until half the liquid enters you. If you feel fullness or discomfort, clamp the tubing closed immediately. Remove the nozzle when you finish releasing the coffee into yourself. Try to retain the coffee for 12 minutes.  Repeat the enema after you void.  Rinse the enema bag when you are done and hang it to dry.  Disposable Enema Purchase two 8 oz (236 ml) size disposable enemas from your local drug store.  Replace the liquid in these disposable enemas with coffee brewed above.  Administer the  enema as per the package directions. Ensure you remove the protective cover from the nozzle before you attempt to insert the nozzle. Try to retain the coffee for approximately 12 minutes.  Use the second enema after you void the first one.  Try to retain the coffee for approximately 12 minutes before voiding.  Appropriately dispose the  empty containers as hazardous waste. ",
  "tyn_model":[
    "coffee",
    "coffee enema",
    "syringe",
    "water",
    "enema bag",
    "unchlorinated, filtered water",
    "ice cubes",
    "disposable enemas",
    "stainless steel pot",
    "chlorine",
    "hot water",
    "hydrogen peroxide",
    "funnel",
    "pitcher",
    "coconut oil",
    "ky jelly",
    "disposable enema",
    "containers",
    "hazardous waste"
  ],
  "tyn_section":[

  ]
}