{
  "title":"How to Plan a Child's Birthday Party",
  "url":"https://www.wikihow.com/Plan-a-Child%27s-Birthday-Party",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Parties for Children"
  ],
  "parts":[
    {
      "name":"Setting up the Basics",
      "steps":[
        {
          "headline":"Decide on your budget.",
          "description":"Whether the party includes entertainers, happens at a for-profit venue, or serves a meal will depend on how much you’re able to spend on the event. Use an Excel spreadsheet to start the process. First, put down how much you’re willing to spend. Afterwards you can begin to break down all the different sections of spending, such as food and decorations."
        },
        {
          "headline":"Have a joint party if your child’s friend is also celebrating a birthday.",
          "description":"If theirs is close enough, communicate with their parents and see if you could do a combined party. You might have to combine themes in order to make this work if the two kids are of the opposite gender. In the long run, this will save both money and hassle for everyone, but will require more communication. Make sure to go over the budget and planning with the other parents carefully so that each side can pay for things equally. Or you can split it up by duties; they can organize food and you can make the decorations. Just make sure that things are done fairly so that they’ll want to do another joint party with you the following year."
        },
        {
          "headline":"Pick a theme.",
          "description":"This can be a favorite subject like dinosaurs or Disney princesses. It can also come from their favorite television show or movie. A great way to get ideas of how to make a certain theme come to life is to visit sites like Pinterest to see what other parents have done with similar themes."
        },
        {
          "headline":"Choose the location.",
          "description":"The location will decide what kind of activities your guests will be able to engage in. Where you have it will have a lot to do with the age of your child and that of the guests. If it’s summer, the community pool is a great option for inexpensive fun. Museums are exciting and educational for younger kids who have inquisitive minds. Having it in the home allows for ease of mind in terms of safety because of the controlled environment. It also means more work to prepare everything for the big day. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRachel Weinshanker\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCertified Event & Wedding Planner\t\t\t\t\t\t\t\tRachel Weinshanker is a Certified Event and Wedding Planner and the Owner of San Diego Life Events, an award-winning wedding and event planning business based in San Diego, California. Rachel has over eight years of event planning experience, and her work has been featured in many notable publications. San Diego Life Events has been awarded the Wedding Wire Couple's Choice Award in 2018, 2019, and 2020. Rachel is a graduate from San Diego State University. Rachel Weinshanker\t\t\tCertified Event & Wedding Planner\t\t\t\tDid You Know? Guests enjoy parties in familiar spaces, so in addition to saving money on a venue, hosting your party in someone's home can create a sense of comfort and security."
        },
        {
          "headline":"Draft the guest list.",
          "description":"If your child is above the age of four or five, they should be involved in choosing who to invite. Do some investigating to find out who your child’s friends are and what the social circles at their school are like. Just because your child doesn’t want someone to come, it doesn’t always mean they shouldn’t be invited to the party. If one of the kids in the class is always being left out then make sure to include them. How would you feel if it was your child being excluded from everything? Kids sometimes don’t realize how their decisions impact others; this is a great time to teach them how to empathize with the people around them."
        },
        {
          "headline":"Send invitations.",
          "description":"Communicate all necessary information clearly, such as location, the intended activities, and the start and end time. Include a disclaimer that food will be offered and ask for the parents to send all information concerning their children’s allergies so you can plan accordingly. Also, provide your phone number and an RSVP date. That way you'll know who can and can't come so you can buy enough materials and food for everyone. Mention anything guests will need to bring, such as a swimsuit and towel if the party is at a pool."
        }
      ]
    },
    {
      "name":"Preparing Food and Activities",
      "steps":[
        {
          "headline":"Have dessert.",
          "description":"Cake and ice cream are usually musts, but it all depends on your child’s preferences. If you decide to get ice cream cake, make sure to set it out for a few minutes to thaw before you plan on cutting it."
        },
        {
          "headline":"Choose food that’s easy to cook.",
          "description":"If your party takes place just before noon or around six o’clock, then you’ll need to feed the kids a full meal. Candy and soda won’t cut it, unless you want a riot of hyper munchkins on your hands. If feeding everyone would break the budget, try and plan to have the party between two and five and so that you’ll only be expected to provide snacks. There are some great meals that can be made in bulk, which cuts down on the cost. You could provide spaghetti, chili dogs, or a taco bar. Be sure to ask your child which one they would prefer."
        },
        {
          "headline":"Keep allergies in mind.",
          "description":"After getting all RSVPs back, take into consideration any allergies the attending children have. If there are a few minor ones, work around them. If someone is allergic to peanut butter, choose alternative snacks. But if one or more of the children have an allergy like celiac, it might be easier to cook them their own individual meal. If you do this, make sure the meal is as fun and exciting as what’s being offered to everyone else; you don’t want them to feel excluded because of their allergy. This will mean buying some new cookware and dishware so that there is no possibility of there being contaminants in the food. Clean your house thoroughly and wipe down anything the children might touch or climb on if they’re allergic to materials that you use on a daily basis. If a child has a severe enough allergy, their parents might send them with an EpiPen. Make sure you know how to use one of these just in case of an emergency."
        },
        {
          "headline":"Provide healthy snacks.",
          "description":"It’s fine to give them some junk food, but try and balance that with healthier options. Bite-sized vegetables such as baby carrots and celery are perfect for children. Have some peanut butter or other kinds of fun dip to make these healthy choices a little more exciting to the young’uns. Fruit is also a sweet alternative to candy. Make sure to cut up all produce into small pieces if the party is for children under the age of five."
        },
        {
          "headline":"Plan exciting activities that match the theme.",
          "description":"You could buy a piñata, play limbo, purchase movies, or pick a craft to make, such as bracelets or a photo frame with a group picture. This also depends on if you’re having a house party, because outside venues will often run their own activities. A good opportunity for keeping a tight budget is to reach out to community contacts like baby sitters, police officers, or fire fighters so that they can put on a little interactive show for the youngsters. Libraries are also good resources for finding affordable fun for the group."
        },
        {
          "headline":"Plan at least one activity with exercise.",
          "description":"The parents of your child’s friends won’t be too happy if their children go home as hyperactive jumping beans. With all the cake, ice cream, and candy that you’re pumping into these kids, you’ll need to help them get their energy out in a productive way. Games like capture the flag or themed versions of tag are good options because their competitive nature makes kids forget they’re blowing off steam."
        }
      ]
    },
    {
      "name":"Decorating for Success",
      "steps":[
        {
          "headline":"Stay on the simple side.",
          "description":"Children don’t need super elaborate setups to have fun. Even very simple and minimalistic decorations can act as catalysts for their imagination. Refer to the research you did in the beginning stages of planning this party in order to remember all the brainstorming you did when you get to cutting and pasting. It can be easy to get carried away and break the budget when shopping for this part of the party."
        },
        {
          "headline":"Print out images.",
          "description":"Find fun pictures online that have to do with the theme and print out color versions. Then cut them out and glue the streamer material onto its edges to form a kind of frame. You can either put these directly on your walls using mounting putty or attach string to them and hang them from the ceiling. This way you can reinforce the theme while giving the kids fun things to look at and do it all at little cost."
        },
        {
          "headline":"Get a costume.",
          "description":"The best kind of décor is the kind your child can run around in. Dressing them up will make their day feel even more special and their imagination will be able to go wild. Though a costume will be more strain on the budget, it can also be used at Halloween and at other parties. Even if buying one means foregoing other items, you’ll get a lot more use out of it than any other decoration you may buy for the party. Making a costume is a great option as well."
        },
        {
          "headline":"Use streamers.",
          "description":"It’s easy to run them off walls, over lights, and across doorframes. You can also hang them vertically to hide pictures or other items in the house to reinforce the theme. Streamers are a great option for dressing up the house for cheap."
        }
      ]
    },
    {
      "name":"Putting on the Finishing Touches",
      "steps":[
        {
          "headline":"Make gift bags.",
          "description":"This isn’t essential, but it can provide a fun ending to the party. Center the items in them around the theme of the party, but you can also include generic treats like stickers and candy. If you have a craft that the kids do during the event, you can give them a container to tote it home in, which can also count as the party’s goody bag."
        },
        {
          "headline":"Childproof your home.",
          "description":"If you’re having the party at your house, make sure any possible dangers to the kids are taken care of. Put child safety coverings on all the outlets. Put all the knives in a container and put it far out of reach. Make sure that there isn’t any exposed wiring or rough wood that could give splinters. Try getting at the kids’ eye level and looking around the rooms that they’ll be in and see what could pose a danger to them."
        },
        {
          "headline":"Get extra help.",
          "description":"If you’re going to have a lot of young children running around your house, ask family members or friends to help you. That way, if one of the children bursts into tears or gets hurt, there are other adults who can help them while you keep an eye on the rest of the group."
        }
      ]
    }
  ],
  "text":" Setting up the Basics Decide on your budget. Whether the party includes entertainers, happens at a for-profit venue, or serves a meal will depend on how much you’re able to spend on the event. Use an Excel spreadsheet to start the process. First, put down how much you’re willing to spend. Afterwards you can begin to break down all the different sections of spending, such as food and decorations. Have a joint party if your child’s friend is also celebrating a birthday. If theirs is close enough, communicate with their parents and see if you could do a combined party. You might have to combine themes in order to make this work if the two kids are of the opposite gender. In the long run, this will save both money and hassle for everyone, but will require more communication. Make sure to go over the budget and planning with the other parents carefully so that each side can pay for things equally. Or you can split it up by duties; they can organize food and you can make the decorations. Just make sure that things are done fairly so that they’ll want to do another joint party with you the following year. Pick a theme. This can be a favorite subject like dinosaurs or Disney princesses. It can also come from their favorite television show or movie. A great way to get ideas of how to make a certain theme come to life is to visit sites like Pinterest to see what other parents have done with similar themes. Choose the location. The location will decide what kind of activities your guests will be able to engage in. Where you have it will have a lot to do with the age of your child and that of the guests. If it’s summer, the community pool is a great option for inexpensive fun. Museums are exciting and educational for younger kids who have inquisitive minds. Having it in the home allows for ease of mind in terms of safety because of the controlled environment. It also means more work to prepare everything for the big day. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRachel Weinshanker\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCertified Event & Wedding Planner\t\t\t\t\t\t\t\tRachel Weinshanker is a Certified Event and Wedding Planner and the Owner of San Diego Life Events, an award-winning wedding and event planning business based in San Diego, California. Rachel has over eight years of event planning experience, and her work has been featured in many notable publications. San Diego Life Events has been awarded the Wedding Wire Couple's Choice Award in 2018, 2019, and 2020. Rachel is a graduate from San Diego State University. Rachel Weinshanker\t\t\tCertified Event & Wedding Planner\t\t\t\tDid You Know? Guests enjoy parties in familiar spaces, so in addition to saving money on a venue, hosting your party in someone's home can create a sense of comfort and security. Draft the guest list. If your child is above the age of four or five, they should be involved in choosing who to invite. Do some investigating to find out who your child’s friends are and what the social circles at their school are like. Just because your child doesn’t want someone to come, it doesn’t always mean they shouldn’t be invited to the party. If one of the kids in the class is always being left out then make sure to include them. How would you feel if it was your child being excluded from everything? Kids sometimes don’t realize how their decisions impact others; this is a great time to teach them how to empathize with the people around them. Send invitations. Communicate all necessary information clearly, such as location, the intended activities, and the start and end time. Include a disclaimer that food will be offered and ask for the parents to send all information concerning their children’s allergies so you can plan accordingly. Also, provide your phone number and an RSVP date. That way you'll know who can and can't come so you can buy enough materials and food for everyone. Mention anything guests will need to bring, such as a swimsuit and towel if the party is at a pool. Preparing Food and Activities Have dessert. Cake and ice cream are usually musts, but it all depends on your child’s preferences. If you decide to get ice cream cake, make sure to set it out for a few minutes to thaw before you plan on cutting it. Choose food that’s easy to cook. If your party takes place just before noon or around six o’clock, then you’ll need to feed the kids a full meal. Candy and soda won’t cut it, unless you want a riot of hyper munchkins on your hands. If feeding everyone would break the budget, try and plan to have the party between two and five and so that you’ll only be expected to provide snacks. There are some great meals that can be made in bulk, which cuts down on the cost. You could provide spaghetti, chili dogs, or a taco bar. Be sure to ask your child which one they would prefer. Keep allergies in mind. After getting all RSVPs back, take into consideration any allergies the attending children have. If there are a few minor ones, work around them. If someone is allergic to peanut butter, choose alternative snacks. But if one or more of the children have an allergy like celiac, it might be easier to cook them their own individual meal. If you do this, make sure the meal is as fun and exciting as what’s being offered to everyone else; you don’t want them to feel excluded because of their allergy. This will mean buying some new cookware and dishware so that there is no possibility of there being contaminants in the food. Clean your house thoroughly and wipe down anything the children might touch or climb on if they’re allergic to materials that you use on a daily basis. If a child has a severe enough allergy, their parents might send them with an EpiPen. Make sure you know how to use one of these just in case of an emergency. Provide healthy snacks. It’s fine to give them some junk food, but try and balance that with healthier options. Bite-sized vegetables such as baby carrots and celery are perfect for children. Have some peanut butter or other kinds of fun dip to make these healthy choices a little more exciting to the young’uns. Fruit is also a sweet alternative to candy. Make sure to cut up all produce into small pieces if the party is for children under the age of five. Plan exciting activities that match the theme. You could buy a piñata, play limbo, purchase movies, or pick a craft to make, such as bracelets or a photo frame with a group picture. This also depends on if you’re having a house party, because outside venues will often run their own activities. A good opportunity for keeping a tight budget is to reach out to community contacts like baby sitters, police officers, or fire fighters so that they can put on a little interactive show for the youngsters. Libraries are also good resources for finding affordable fun for the group. Plan at least one activity with exercise. The parents of your child’s friends won’t be too happy if their children go home as hyperactive jumping beans. With all the cake, ice cream, and candy that you’re pumping into these kids, you’ll need to help them get their energy out in a productive way. Games like capture the flag or themed versions of tag are good options because their competitive nature makes kids forget they’re blowing off steam. Decorating for Success Stay on the simple side. Children don’t need super elaborate setups to have fun. Even very simple and minimalistic decorations can act as catalysts for their imagination. Refer to the research you did in the beginning stages of planning this party in order to remember all the brainstorming you did when you get to cutting and pasting. It can be easy to get carried away and break the budget when shopping for this part of the party. Print out images. Find fun pictures online that have to do with the theme and print out color versions. Then cut them out and glue the streamer material onto its edges to form a kind of frame. You can either put these directly on your walls using mounting putty or attach string to them and hang them from the ceiling. This way you can reinforce the theme while giving the kids fun things to look at and do it all at little cost. Get a costume. The best kind of décor is the kind your child can run around in. Dressing them up will make their day feel even more special and their imagination will be able to go wild. Though a costume will be more strain on the budget, it can also be used at Halloween and at other parties. Even if buying one means foregoing other items, you’ll get a lot more use out of it than any other decoration you may buy for the party. Making a costume is a great option as well. Use streamers. It’s easy to run them off walls, over lights, and across doorframes. You can also hang them vertically to hide pictures or other items in the house to reinforce the theme. Streamers are a great option for dressing up the house for cheap. Putting on the Finishing Touches Make gift bags. This isn’t essential, but it can provide a fun ending to the party. Center the items in them around the theme of the party, but you can also include generic treats like stickers and candy. If you have a craft that the kids do during the event, you can give them a container to tote it home in, which can also count as the party’s goody bag. Childproof your home. If you’re having the party at your house, make sure any possible dangers to the kids are taken care of. Put child safety coverings on all the outlets. Put all the knives in a container and put it far out of reach. Make sure that there isn’t any exposed wiring or rough wood that could give splinters. Try getting at the kids’ eye level and looking around the rooms that they’ll be in and see what could pose a danger to them. Get extra help. If you’re going to have a lot of young children running around your house, ask family members or friends to help you. That way, if one of the children bursts into tears or gets hurt, there are other adults who can help them while you keep an eye on the rest of the group.",
  "tyn_model":[
    "decorations",
    "candy",
    "food",
    "event planning",
    "cake",
    "ice cream",
    "peanut butter",
    "streamers",
    "container",
    "excel spreadsheet",
    "pool",
    "museums",
    "event and wedding planner",
    "san diego life events",
    "san diego state university",
    "event & wedding planner",
    "ice cream cake",
    "soda",
    "spaghetti",
    "chili dogs",
    "cookware",
    "dishware",
    "epipen.",
    "vegetables",
    "baby carrots",
    "celery",
    "fruit",
    "produce",
    "piñata",
    "streamer",
    "mounting putty",
    "stickers",
    "child safety coverings",
    "knives",
    "’ eye"
  ],
  "tyn_section":[

  ]
}