{
  "title":"How to Collect Stickers",
  "url":"https://www.wikihow.com/Collect-Stickers",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Collecting",
    "Paper Collectibles",
    "Collecting Stickers"
  ],
  "methods":[
    {
      "name":"Finding Fun Stickers",
      "steps":[
        {
          "headline":"Visit your local arts and crafts store or big box store.",
          "description":"Lots of places carry stickers in packages. Your local big box store is a good place to start, but for an even wider selection, visit an arts and crafts store and look in the scrapbooking collection. Check out the selection regularly so you can see what new stickers they carry. You can even find stickers at dollar stores or in the dollar section of larger stores."
        },
        {
          "headline":"Look for interesting and rare stickers on auction sites.",
          "description":"Websites like eBay will have a wide variety of stickers you can't find elsewhere, including vintage stickers. You may also be able to score deals, especially if you buy stickers in small lots. You can also find sites with sections dedicated just to stickers, such as Redbubble. When searching for stickers, think about what you want. You could type \"fruit stickers\" or \"vintage stickers\" to get a lot of hits, or narrow it down to \"strawberry stickers\" or \"vintage rock band stickers\" for fewer hits."
        },
        {
          "headline":"Check for artistic stickers at local craft fairs and on handmade websites.",
          "description":"If you want truly unique stickers, then local artists are the way to go. They typically only produce stickers in small batches, so you'll be one of a select few. You'll also be supporting local artists! For websites, explore places like Etsy or even Redbubble, which pays the artist a percentage of the purchase."
        },
        {
          "headline":"Try a sticker-of-the-month club.",
          "description":"A sticker-of-the-month club is like any subscription box. You pay a monthly fee, and in return, they send you a selection of cool new stickers, usually several sheets. It's a great way to get stickers without having to work too hard. Don't worry, they have sticker clubs for both adults and kids! A quick search on the internet will get you a handful of options."
        },
        {
          "headline":"Request free brand stickers from companies.",
          "description":"Some companies simply have sticker request forms on their website. You fill in the form, and they send you a free sticker. Some stickers will just feature the company's logos, while others may feature a related picture. Try emailing companies that don't have a form for stickers. Tell them who you are, and how much you love their brand. Then, ask for a sticker politely, and tell them you'll put it on something other people will see a lot, such as your water bottle, phone, or even your bike or car. Include your address. Some companies may request you send a self-addressed stamped envelope to get a sticker."
        },
        {
          "headline":"Explore freebie sticker sites.",
          "description":"Some blogs and websites have links to places you can get free stickers from. It can take a little while to browse through these sites, but you can find free stickers on them. Try a site like https://nikkisfreebiejeebies.com/category/free-stickers/30."
        },
        {
          "headline":"Ask or look for stickers at small, boutique and artistic stores.",
          "description":"Music stores, artistic stores, and other small businesses often print up stickers to promote their brand. Check around the register for them the next time you're in or ask a staff member if they carry them."
        }
      ]
    },
    {
      "name":"Using Organizers for Your Stickers",
      "steps":[
        {
          "headline":"Use a sticker-organizing binder.",
          "description":"These binders are made specifically for the purpose of keeping your stickers. They have plastic sleeves inside for holding sheets of stickers, and you can simply slip your sheets in. You can find these binders at some craft stores."
        },
        {
          "headline":"Put your stickers in a standard binder with page protectors.",
          "description":"Another option is to simply create your own sticker-organizing binder. You just need any regular binder, though bigger may be better if you plan to grow your collection. Then, buy a package of plastic sleeves that fit in binders. You could also use folder pockets for a sturdier organizer, but you'll be able to see the stickers better in the plastic sleeves."
        },
        {
          "headline":"Repurpose an old photo album for a free solution.",
          "description":"Use a photo album that has sleeves, and you can slip your sheets of stickers into the sleeves. You'll likely need a larger album so your sheets don't stick out the top. You can also buy a new photo album."
        },
        {
          "headline":"Throw your stickers in bins if you have a large collection.",
          "description":"Plastic bins are a good way to organize stickers because they keep water out and you can see inside them. Try buying bins of about the same size, and then you can stack them up together. Label the outside of the bins with stickers from the collection or a permanent marker so you know what's inside. If you want to organize the stickers inside the bins, make dividers from cardstock and label them at the top so you can easily find what you need."
        },
        {
          "headline":"Create a sticker board to display your stickers.",
          "description":"For one option, simply stick your stickers on a wooden board or even a foam-core board. Then you can move it around how you'd like. You can also adhere the stickers to thin magnets, cut them out, and place them on a metal sheet or refrigerator to display them. You can also slip your stickers into sleeves and use magnets to attach them to a metal board if you don't want to \"use\" your stickers or remove them from the sheets."
        }
      ]
    },
    {
      "name":"Organizing Your Stickers",
      "steps":[
        {
          "headline":"Categorize your stickers by theme.",
          "description":"One way to organize your stickers is to simply sort them into sleeves by theme. For instance, you might have one sleeve that's all cats and another that's autumn stickers. You can get as specific or as broad as you want. For instance, if you have a lot of cat stickers, you might have a sleeve for black cats, another for cartoon cats, and another for tabbies. You could also organize your sleeves by holiday if you have a lot of holiday-themed stickers."
        },
        {
          "headline":"Stick similarly styled stickers together for use with projects.",
          "description":"Maybe you have a lot of anime-style stickers or you have a collection of just comic book stickers. Maybe you have a collection of certain kinds of cartoon cats or you have preppy stickers. Organizing them in these styles will help you find the right sticker for the right project. Similarly, you might organize stickers by what you use them for. Maybe you have some that you use for your planner, while others are for writing letters."
        },
        {
          "headline":"Put your favorites in sleeves together to make it easy to find them.",
          "description":"You want to be able to easily access the stickers you like the best. Once you put them in sleeves, try organizing them so that your favorites are in the front of the collection. Then, you don't have to flip through everything to find them."
        },
        {
          "headline":"Sort your stickers by size so you can find small or large ones easily.",
          "description":"You'll find very small stickers and very large stickers, so if size is important to you, try organizing by how big they are. That way, you'll be able to find all your tiny stickers when you need to add something small to a piece of mail."
        },
        {
          "headline":"Mix and match your artistic styles.",
          "description":"You don't have to use just 1 organizational style. You could have a collection of just small stickers, and then organize the rest of your stickers by theme. Alternatively, you could subdivide your collection; for instance, if you organize by size first, you can organize by theme inside the collection."
        }
      ]
    }
  ],
  "text":" Finding Fun Stickers Visit your local arts and crafts store or big box store. Lots of places carry stickers in packages. Your local big box store is a good place to start, but for an even wider selection, visit an arts and crafts store and look in the scrapbooking collection. Check out the selection regularly so you can see what new stickers they carry. You can even find stickers at dollar stores or in the dollar section of larger stores. Look for interesting and rare stickers on auction sites. Websites like eBay will have a wide variety of stickers you can't find elsewhere, including vintage stickers. You may also be able to score deals, especially if you buy stickers in small lots. You can also find sites with sections dedicated just to stickers, such as Redbubble. When searching for stickers, think about what you want. You could type \"fruit stickers\" or \"vintage stickers\" to get a lot of hits, or narrow it down to \"strawberry stickers\" or \"vintage rock band stickers\" for fewer hits. Check for artistic stickers at local craft fairs and on handmade websites. If you want truly unique stickers, then local artists are the way to go. They typically only produce stickers in small batches, so you'll be one of a select few. You'll also be supporting local artists! For websites, explore places like Etsy or even Redbubble, which pays the artist a percentage of the purchase. Try a sticker-of-the-month club. A sticker-of-the-month club is like any subscription box. You pay a monthly fee, and in return, they send you a selection of cool new stickers, usually several sheets. It's a great way to get stickers without having to work too hard. Don't worry, they have sticker clubs for both adults and kids! A quick search on the internet will get you a handful of options. Request free brand stickers from companies. Some companies simply have sticker request forms on their website. You fill in the form, and they send you a free sticker. Some stickers will just feature the company's logos, while others may feature a related picture. Try emailing companies that don't have a form for stickers. Tell them who you are, and how much you love their brand. Then, ask for a sticker politely, and tell them you'll put it on something other people will see a lot, such as your water bottle, phone, or even your bike or car. Include your address. Some companies may request you send a self-addressed stamped envelope to get a sticker. Explore freebie sticker sites. Some blogs and websites have links to places you can get free stickers from. It can take a little while to browse through these sites, but you can find free stickers on them. Try a site like https://nikkisfreebiejeebies.com/category/free-stickers/30. Ask or look for stickers at small, boutique and artistic stores. Music stores, artistic stores, and other small businesses often print up stickers to promote their brand. Check around the register for them the next time you're in or ask a staff member if they carry them. Using Organizers for Your Stickers Use a sticker-organizing binder. These binders are made specifically for the purpose of keeping your stickers. They have plastic sleeves inside for holding sheets of stickers, and you can simply slip your sheets in. You can find these binders at some craft stores. Put your stickers in a standard binder with page protectors. Another option is to simply create your own sticker-organizing binder. You just need any regular binder, though bigger may be better if you plan to grow your collection. Then, buy a package of plastic sleeves that fit in binders. You could also use folder pockets for a sturdier organizer, but you'll be able to see the stickers better in the plastic sleeves. Repurpose an old photo album for a free solution. Use a photo album that has sleeves, and you can slip your sheets of stickers into the sleeves. You'll likely need a larger album so your sheets don't stick out the top. You can also buy a new photo album. Throw your stickers in bins if you have a large collection. Plastic bins are a good way to organize stickers because they keep water out and you can see inside them. Try buying bins of about the same size, and then you can stack them up together. Label the outside of the bins with stickers from the collection or a permanent marker so you know what's inside. If you want to organize the stickers inside the bins, make dividers from cardstock and label them at the top so you can easily find what you need. Create a sticker board to display your stickers. For one option, simply stick your stickers on a wooden board or even a foam-core board. Then you can move it around how you'd like. You can also adhere the stickers to thin magnets, cut them out, and place them on a metal sheet or refrigerator to display them. You can also slip your stickers into sleeves and use magnets to attach them to a metal board if you don't want to \"use\" your stickers or remove them from the sheets. Organizing Your Stickers Categorize your stickers by theme. One way to organize your stickers is to simply sort them into sleeves by theme. For instance, you might have one sleeve that's all cats and another that's autumn stickers. You can get as specific or as broad as you want. For instance, if you have a lot of cat stickers, you might have a sleeve for black cats, another for cartoon cats, and another for tabbies. You could also organize your sleeves by holiday if you have a lot of holiday-themed stickers. Stick similarly styled stickers together for use with projects. Maybe you have a lot of anime-style stickers or you have a collection of just comic book stickers. Maybe you have a collection of certain kinds of cartoon cats or you have preppy stickers. Organizing them in these styles will help you find the right sticker for the right project. Similarly, you might organize stickers by what you use them for. Maybe you have some that you use for your planner, while others are for writing letters. Put your favorites in sleeves together to make it easy to find them. You want to be able to easily access the stickers you like the best. Once you put them in sleeves, try organizing them so that your favorites are in the front of the collection. Then, you don't have to flip through everything to find them. Sort your stickers by size so you can find small or large ones easily. You'll find very small stickers and very large stickers, so if size is important to you, try organizing by how big they are. That way, you'll be able to find all your tiny stickers when you need to add something small to a piece of mail. Mix and match your artistic styles. You don't have to use just 1 organizational style. You could have a collection of just small stickers, and then organize the rest of your stickers by theme. Alternatively, you could subdivide your collection; for instance, if you organize by size first, you can organize by theme inside the collection.",
  "tyn_model":[
    "stickers",
    "sticker-organizing binder",
    "binder",
    "photo album",
    "magnets",
    "arts and crafts store",
    "sticker",
    "sticker clubs",
    "water",
    "permanent marker",
    "sticker board",
    "foam-core board",
    "refrigerator",
    "organizational style"
  ],
  "tyn_section":[

  ]
}