{
  "title":"How to Draw a Praying Mantis",
  "url":"https://www.wikihow.com/Draw-a-Praying-Mantis",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "steps":[
    {
      "headline":"Draw basic shapes.",
      "description":"Add ovals, circles and lines. Don't worry if it does not look like as what you want. These are just your guidelines."
    },
    {
      "headline":"Second, draw the head including the eyes and the mouth.",
      "description":""
    },
    {
      "headline":"Draw his two arms on front.",
      "description":"Some part of the arms must have jagged lines."
    },
    {
      "headline":"Create three diagonal lines for the neck portion.",
      "description":""
    },
    {
      "headline":"Then draw the wings.",
      "description":""
    },
    {
      "headline":"Now draw the middle two feet.",
      "description":"As you notice, these are much thinner compare to the arms."
    },
    {
      "headline":"Draw the behind legs.",
      "description":""
    },
    {
      "headline":"Then create the body.",
      "description":""
    },
    {
      "headline":"Add more lines or details to your drawing.",
      "description":""
    },
    {
      "headline":"Then all your lines are done.",
      "description":"All you need to do on the next step is to clean up your drawing."
    },
    {
      "headline":"Then here you go.",
      "description":"Your drawing is done. Keep up the good work!"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Draw basic shapes. Add ovals, circles and lines. Don't worry if it does not look like as what you want. These are just your guidelines. Second, draw the head including the eyes and the mouth.  Draw his two arms on front. Some part of the arms must have jagged lines. Create three diagonal lines for the neck portion.  Then draw the wings.  Now draw the middle two feet. As you notice, these are much thinner compare to the arms. Draw the behind legs.  Then create the body.  Add more lines or details to your drawing.  Then all your lines are done. All you need to do on the next step is to clean up your drawing. Then here you go. Your drawing is done. Keep up the good work! Finished. ",
  "tyn_model":[

  ],
  "tyn_section":[

  ]
}