{
  "title":"How to Make a Mai Tai Cocktail",
  "url":"https://www.wikihow.com/Make-a-Mai-Tai-Cocktail",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Cocktails",
    "Rum Based Cocktails"
  ],
  "steps":[
    {
      "headline":"Crush enough ice to fill a double old fashioned glass by either using a blender, ice crusher, or smashing ice in a plastic bag with a rolling pin or other blunt object, and add to a cocktail shaker.",
      "description":""
    },
    {
      "headline":"Juice limes either with a fruit juicer, juice reamer, or by manually squeezing to produce the required amount of lime juice.",
      "description":""
    },
    {
      "headline":"Add liquid ingredients.",
      "description":""
    },
    {
      "headline":"Add a section of spent lime shell.",
      "description":""
    },
    {
      "headline":"Shake vigorously for 10 seconds, or until the outside of the shaker frosts.",
      "description":""
    },
    {
      "headline":"Pour the contents of the shaker into a double old fashioned glass.",
      "description":""
    },
    {
      "headline":"Add more crushed ice to fill the glass.",
      "description":""
    },
    {
      "headline":"Garnish with a sprig of mint or your choice of lemon/lime",
      "description":""
    }
  ],
  "text":" Crush enough ice to fill a double old fashioned glass by either using a blender, ice crusher, or smashing ice in a plastic bag with a rolling pin or other blunt object, and add to a cocktail shaker.  Juice limes either with a fruit juicer, juice reamer, or by manually squeezing to produce the required amount of lime juice.  Add liquid ingredients.  Add a section of spent lime shell.  Shake vigorously for 10 seconds, or until the outside of the shaker frosts.  Pour the contents of the shaker into a double old fashioned glass.  Add more crushed ice to fill the glass.  Garnish with a sprig of mint or your choice of lemon/lime ",
  "tyn_model":[
    "ice",
    "shaker",
    "blender",
    "ice crusher",
    "cocktail shaker",
    "limes",
    "fruit juicer",
    "juice reamer",
    "lime juice",
    "lime",
    "double old fashioned glass",
    "crushed ice",
    "mint",
    "lemon"
  ],
  "tyn_section":[

  ]
}