{
  "title":"How to Defeat Sophia Leigh in the Tomb Raider 3 Video Game",
  "url":"https://www.wikihow.com/Defeat-Sophia-Leigh-in-the-Tomb-Raider-3-Video-Game",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Tomb Raider Video Games"
  ],
  "steps":[
    {
      "headline":"When the level starts you'll be in Sophia Leigh's office.",
      "description":"Make sure your Pistols are equipped."
    },
    {
      "headline":"Leave the room and run up to the platform located outside, and climb up by holding down Forward whilst holding down Action.",
      "description":"Press Roll and walk to the ledge, Jump straight up, immediately followed by action (Keep Action held down whilst holding forward once Lara is hanging from the monkey bars, then she'll move forward)"
    },
    {
      "headline":"Once you've gotten across the monkey bars release Action, and go up the large step, by going up to it and holding down Forward and Action simultaneously, she will then go up the step.",
      "description":"SECRET: Whilst on the other side of the block, use Walk and forward to walk to the edge, then stop... Now Walk back 3 steps, then press Roll immediately followed by Action (hold down the Action button) now shimmy to the Left. Release Action, then hold Action down as soon as you let go. Now climb up, and you should be in a crouch or crawl position. Go to the other side of the crawl space, turn the other way, then use Back and Action to go in, once you hear the small tune. pick up the items then go back outside the way you came in"
    },
    {
      "headline":"Turn right then use Forward and Action to pull Lara on to the ledge above you.",
      "description":"Keep the buttons held down until she's on the ledge"
    },
    {
      "headline":"Turn left until you see a switch, go up to it and press Action to push it.",
      "description":""
    },
    {
      "headline":"Then go back the way you came from.",
      "description":"On your way back, pick up the Small MediPack."
    },
    {
      "headline":"Use Forward and Action to climb up the block.",
      "description":""
    },
    {
      "headline":"Climb up onto the ledges until you see the climbing wall on the other side of London.",
      "description":"On your way to the climbing wall, pick up the Small MediPack. Make a small diagonal Jump to grab on to the climbing wall, immediately press Action after pressing Jump. Whilst Action is being held press Forward to climb up the ledge."
    },
    {
      "headline":"Now looking down you'll see a crawl space, pick up the Small MediPack beside it and then go in...",
      "description":""
    },
    {
      "headline":"Now turn around, move forward, and press Jump immediately followed by Action.",
      "description":""
    },
    {
      "headline":"Do a running jump",
      "description":"CAUTION: DO NOT press the Jump button while / whilst running until you run to the very edge of the building."
    },
    {
      "headline":"Shoot the Power Box.",
      "description":""
    },
    {
      "headline":"Climb onto the Power Box, and do a running jump to the other side.",
      "description":"CAUTION: Don't step on the metal until pushing the near by switch."
    },
    {
      "headline":"Pick up the artifact.",
      "description":"RESULTS: are given to you when you pick up the artifact."
    }
  ],
  "text":" When the level starts you'll be in Sophia Leigh's office. Make sure your Pistols are equipped. Leave the room and run up to the platform located outside, and climb up by holding down Forward whilst holding down Action. Press Roll and walk to the ledge, Jump straight up, immediately followed by action (Keep Action held down whilst holding forward once Lara is hanging from the monkey bars, then she'll move forward) Once you've gotten across the monkey bars release Action, and go up the large step, by going up to it and holding down Forward and Action simultaneously, she will then go up the step. SECRET: Whilst on the other side of the block, use Walk and forward to walk to the edge, then stop... Now Walk back 3 steps, then press Roll immediately followed by Action (hold down the Action button) now shimmy to the Left. Release Action, then hold Action down as soon as you let go. Now climb up, and you should be in a crouch or crawl position. Go to the other side of the crawl space, turn the other way, then use Back and Action to go in, once you hear the small tune. pick up the items then go back outside the way you came in Turn right then use Forward and Action to pull Lara on to the ledge above you. Keep the buttons held down until she's on the ledge Turn left until you see a switch, go up to it and press Action to push it.  Then go back the way you came from. On your way back, pick up the Small MediPack. Use Forward and Action to climb up the block.  Climb up onto the ledges until you see the climbing wall on the other side of London. On your way to the climbing wall, pick up the Small MediPack. Make a small diagonal Jump to grab on to the climbing wall, immediately press Action after pressing Jump. Whilst Action is being held press Forward to climb up the ledge. Now looking down you'll see a crawl space, pick up the Small MediPack beside it and then go in...  Now turn around, move forward, and press Jump immediately followed by Action.  Do a running jump CAUTION: DO NOT press the Jump button while / whilst running until you run to the very edge of the building. Shoot the Power Box.  Climb onto the Power Box, and do a running jump to the other side. CAUTION: Don't step on the metal until pushing the near by switch. Pick up the artifact. RESULTS: are given to you when you pick up the artifact.",
  "tyn_model":[
    "climbing wall",
    "monkey bars",
    "small medipack",
    "pistols",
    "power box"
  ],
  "tyn_section":[

  ]
}