{
  "title":"How to Carve Wooden Guns",
  "url":"https://www.wikihow.com/Carve-Wooden-Guns",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Woodworking",
    "Wooden Sports Equipment"
  ],
  "steps":[
    {
      "headline":"Select a suitable, piece of wood that is able to be carved.",
      "description":"It should be soft enough to carve, but tough enough to be durable. If you are lucky, you may even find one with a grain that fits the curves of the project."
    },
    {
      "headline":"Mark out the basic outline.",
      "description":"Use a photograph from a book or magazine as a guide, and freehand the basic shape. Unless you are trying to make a scale replica, this will give pretty good results."
    },
    {
      "headline":"Saw out the outline with a circular saw for straight cuts, and a jigsaw for curves.",
      "description":""
    },
    {
      "headline":"Sand out the contours with a small hand grinder and a coarse sanding disc.",
      "description":""
    },
    {
      "headline":"Drill out any holes that occur on the gun you are replicating, such as the barrel, and here, a hole in the stock.",
      "description":""
    },
    {
      "headline":"Finish sanding by hand, and install a trigger guard and trigger formed from aluminum wire.",
      "description":""
    },
    {
      "headline":"Paint it to make it more realistic if you wish.",
      "description":""
    },
    {
      "headline":"Give it to your young soldier, and let the fun begin.",
      "description":""
    }
  ],
  "text":" Select a suitable, piece of wood that is able to be carved. It should be soft enough to carve, but tough enough to be durable. If you are lucky, you may even find one with a grain that fits the curves of the project. Mark out the basic outline. Use a photograph from a book or magazine as a guide, and freehand the basic shape. Unless you are trying to make a scale replica, this will give pretty good results. Saw out the outline with a circular saw for straight cuts, and a jigsaw for curves.  Sand out the contours with a small hand grinder and a coarse sanding disc.  Drill out any holes that occur on the gun you are replicating, such as the barrel, and here, a hole in the stock.  Finish sanding by hand, and install a trigger guard and trigger formed from aluminum wire.  Paint it to make it more realistic if you wish.  Give it to your young soldier, and let the fun begin. ",
  "tyn_model":[
    "saw",
    "circular saw",
    "jigsaw",
    "small hand grinder",
    "coarse sanding disc",
    "aluminum wire"
  ],
  "tyn_section":[

  ]
}