{
  "title":"How to Kill Yawn in Resident Evil",
  "url":"https://www.wikihow.com/Kill-Yawn-in-Resident-Evil",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Resident Evil"
  ],
  "methods":[
    {
      "name":"First Encounter",
      "steps":[
        {
          "headline":"Go to the attic of the mansion, through the door unlocked with the Shield Key.",
          "description":""
        },
        {
          "headline":"Go forward in the room.",
          "description":"A cutscene will be triggered where the giant snake, Yawn appears in front of you. If you are playing as Jill, Richard will burst into the room, say \"It's payback time!\" and help out."
        },
        {
          "headline":"With the cutscene over, start shooting Yawn with the Shotgun.",
          "description":"When he raises his head and prepares to strike, run out of the way."
        },
        {
          "headline":"After shooting him for a while, there will be a cutscene where it looks like he dies.",
          "description":"If as Jill, she will thank Richard. Yawn will then rise from the dead and lunge over directly towards Jill. Richard pushed her out of the way, but he gets eaten instead."
        },
        {
          "headline":"Shoot him some more until he retreats.",
          "description":""
        },
        {
          "headline":"Collect the Assault Shotgun (Jill), Death Mask and, depending on your difficulty level, the Shotgun Shells.",
          "description":""
        },
        {
          "headline":"If you were bitten by Yawn, you will be poisoned.",
          "description":"Go to the Medical Save Room (appears as \"Drug Rm.\" on your file if you save there) and get some Serum, the same thing you used on Richard."
        }
      ]
    },
    {
      "name":"Second Encounter",
      "steps":[
        {
          "headline":"Head to the library of the mansion, in the corridor off the arrowhead hallway with the knights where you got the Armor Key and replaced it with the False Key.",
          "description":""
        },
        {
          "headline":"Go up the steps and unlock that door with the Helmet Key.",
          "description":""
        },
        {
          "headline":"Go down the ladder.",
          "description":""
        },
        {
          "headline":"You will see a cutscene where Yawn comes out again.",
          "description":""
        },
        {
          "headline":"Wind around the bookshelves and turn around to shoot him every now and then.",
          "description":""
        },
        {
          "headline":"Right before he dies, there will be a cutscene where he hits the bookshelf and books fall down.",
          "description":""
        },
        {
          "headline":"In the pile of books, pick up one of the books he knocks down and examine it to find the Eagle medal in it.",
          "description":""
        },
        {
          "headline":"Grab the herbs by the entrance and head out.",
          "description":""
        }
      ]
    }
  ],
  "text":" First Encounter Go to the attic of the mansion, through the door unlocked with the Shield Key.  Go forward in the room. A cutscene will be triggered where the giant snake, Yawn appears in front of you. If you are playing as Jill, Richard will burst into the room, say \"It's payback time!\" and help out. With the cutscene over, start shooting Yawn with the Shotgun. When he raises his head and prepares to strike, run out of the way. After shooting him for a while, there will be a cutscene where it looks like he dies. If as Jill, she will thank Richard. Yawn will then rise from the dead and lunge over directly towards Jill. Richard pushed her out of the way, but he gets eaten instead. Shoot him some more until he retreats.  Collect the Assault Shotgun (Jill), Death Mask and, depending on your difficulty level, the Shotgun Shells.  If you were bitten by Yawn, you will be poisoned. Go to the Medical Save Room (appears as \"Drug Rm.\" on your file if you save there) and get some Serum, the same thing you used on Richard. Second Encounter Head to the library of the mansion, in the corridor off the arrowhead hallway with the knights where you got the Armor Key and replaced it with the False Key.  Go up the steps and unlock that door with the Helmet Key.  Go down the ladder.  You will see a cutscene where Yawn comes out again.  Wind around the bookshelves and turn around to shoot him every now and then.  Right before he dies, there will be a cutscene where he hits the bookshelf and books fall down.  In the pile of books, pick up one of the books he knocks down and examine it to find the Eagle medal in it.  Grab the herbs by the entrance and head out. ",
  "tyn_model":[
    "shotgun",
    "books",
    "shield key",
    "richard",
    "assault shotgun",
    "death mask",
    "serum",
    "armor key",
    "herbs"
  ],
  "tyn_section":[

  ]
}