{
  "title":"How to Drink Whiskey",
  "url":"https://www.wikihow.com/Drink-Whiskey",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks"
  ],
  "methods":[
    {
      "name":"Drinking Whiskey Straight",
      "steps":[
        {
          "headline":"Pour your whiskey into a glass.",
          "description":"Select a small glass tumbler, such as a lowball glass. To really get the most out of the scent and flavor of the whiskey, use a tulip-shaped whiskey glass. Try to avoid using a plastic or polystyrene cup as you might find that materials other than glass impart their own flavor to the whiskey. For a really old-fashioned experience (and if you don’t mind a little metallic flavor), try drinking your whiskey from a tin cup. A little whiskey goes a long way. Start by pouring yourself 1 finger (about 30-50 mL): wrap your index finger around the bottom of the glass and pour up to the height of the top edge of your index finger."
        },
        {
          "headline":"Try the whiskey neat before adding water or ice.",
          "description":"Before you add anything else to the whiskey, at least sample a little of it in its pure state. This will not only give you a better idea of the whiskey’s flavor and aroma, but will also help you decide whether or not you really want to mix it with anything. If you enjoy the taste of alcohol, you may prefer drinking your whiskey neat."
        },
        {
          "headline":"Smell the whiskey 2 or 3 times before tasting it.",
          "description":"Put your nose in the glass and take a deep huff. You may need to do this a few times to really get a sense of the aroma, since the smell of alcohol may be overpowering on the first sniff. Then you may start to notice other notes, like spices and wood. Tip: Using a tulip-shaped whiskey glass can enhance the smell of the whiskey since the narrow opening helps trap and concentrate the vapors at the top of the glass. Keep your mouth open while you smell the whiskey to enhance both your sense of smell and sense of taste, which will allow you to understand the whiskey better."
        },
        {
          "headline":"Roll the whiskey around in your mouth before swallowing.",
          "description":"Don’t just gulp the whiskey down. Take a small sip and move it around on your tongue. After you swallow, wait for a moment before taking another sip so that you can appreciate the aftertaste. You may notice flavors such as caramel, toffee, or vanilla. Some people like to “chew” their whiskey before swallowing it, making sure that it coats the entire tongue and inside of the mouth. Breathing through your nose as you swallow the whiskey can also help you experience the aroma more fully. If you don’t like the taste of the whiskey on your first sip, don’t give up on it right away. The first sip may taste overwhelmingly like alcohol, but you will probably begin to notice other flavors on your second or third taste. It's an acquired taste, so it takes time to truly appreciate the complex flavors and aromas of whiskey."
        },
        {
          "headline":"Add a splash of water to enhance the flavor.",
          "description":"Add a few drops of fresh, clean water to your whiskey and give it a quick stir with a straw. Doing this will dull the harshness of the alcohol and bring out the other, more subtle flavors of the whiskey. Experiment with adding water little-by-little until you achieve the flavor you’re looking for. Note: It’s not clear why water makes whiskey taste better, but some scientists think the water traps chemicals that cause unpleasant flavors, or that it drives the tastier components to the surface."
        },
        {
          "headline":"Toss in a chunk of ice if you want a refreshing chill.",
          "description":"Put a large ice cube or an ice ball in your whiskey if you’d like it extra cold. While some whiskey aficionados turn up their noses at the idea of drinking whiskey on the rocks, there’s nothing wrong with adding a little ice if you like. It's your drink, so make it how you like! Do keep in mind that the ice will dilute the whiskey as it melts. The coldness of the ice can also numb your taste buds a bit, making it harder to pick up on the subtler flavors. Larger pieces of ice will melt more slowly than small ones, so they won’t dilute the drink as quickly. Alternatively, you can use chilled whiskey stones, which are soapstone chunks that chill the whiskey without diluting it."
        },
        {
          "headline":"Take your time finishing your drink.",
          "description":"Since part of the appeal of whiskey is its flavor, you’ll probably get the most out of it if you sip it slowly instead of slamming it back like a shot. Give yourself 30 to 60 minutes to slowly finish your whiskey. If you like shooting whiskey, that’s fine, too! Experiment with savoring your whiskey slowly or knocking it back in one gulp, and see which you prefer."
        }
      ]
    },
    {
      "name":"Trying Whiskey Cocktails",
      "steps":[
        {
          "headline":"Try a classic Old Fashioned if you want a sweet and simple cocktail.",
          "description":"This is the granddaddy of whiskey cocktails. Depending on your tastes, you can use a variety of whiskeys for the drink, from sweeter bourbons (the traditional choice) to more subtle and spicy rye whiskeys. To make an Old Fashioned:\nMuddle a sugar cube and 3 dashes of bitters in the bottom of a rocks glass. Pour in 1 shot of whiskey and some ice, then stir until the ice begins to melt. Add another shot of whiskey. Garnish the drink with a cherry or an orange twist."
        },
        {
          "headline":"Mix up a cool Mint Julep for something light and refreshing.",
          "description":"This classic Kentucky cocktail is made with sweet bourbon. The better the bourbon, the better the drink. You should always use fresh mint and muddle the mint (lightly smash it with the sugar cube) at the bottom of the glass before adding the bourbon. Mix 2 fluid ounces (59 mL) of bourbon with a sugar cube and a handful of crushed ice along with the muddled mint. For a deliciously frosty glass, use a tall glass or silver beaker that is pre-chilled. Use a napkin or doily so that you don’t ruin the frost by touching it with your bare hands."
        },
        {
          "headline":"Give a Manhattan a try if you enjoy a sweet and slightly bitter taste.",
          "description":"Manhattans are a little bitter for some people, but others swear by the sweet/bitter combo. Like the Old Fashioned, you can adjust the whiskey you use for a better cocktail -- rye for something stronger, bourbon for something sweeter. To make a Manhattan, pour the following into a mixer with ice, then pour the liquid into a glass:\n2 fluid ounces (59 mL) of whiskey\n1 fluid ounce (30 mL) of sweet vermouth\n1 to 2 dashes of bitters, such as Angostura\nA small length of orange peel\nThis type of cocktail made with Scotch and orange bitters instead of rye and aromatic bitters is called a Rob Roy."
        },
        {
          "headline":"Have a whiskey sour if you prefer your cocktails tart and fruity.",
          "description":"This simple, easy drink doesn't call for much, but adds a nice sour punch to your drink that goes down easily. To make one, simply shake the following together in a mixer with plenty of ice:\n2 fluid ounces (59 mL) of whiskey\n1 fluid ounce (30 mL) of fresh-squeezed lemon juice or a packet of sours\n1 teaspoon (about 4 grams) of sugar\nA Boston Sour adds in 1 egg white as well for a frothy, more substantial drink."
        },
        {
          "headline":"Warm up with a sweet and spicy Hot Toddy.",
          "description":"A Hot Toddy is a warm drink brewed with whiskey and spices. This is a wonderfully comforting drink on a cold, rainy day. Typically, it is made with Irish whiskey. To make a Hot Toddy, pour your whiskey into a glass, then heat up the following ingredients and pour them over the whiskey once the mixture is simmering:\n2 fluid ounces (59 ml) of water\n3 cloves\n1 cinnamon stick\n0.5 in (1.3 cm) piece of ginger, peeled and sliced (optional)\n1 strip of lemon peel\n2 fluid ounces (59 mL) of whiskey\n2 teaspoons (9.9 mL) of honey (adjustable to your sweetness preferences)\n1 or 2 teaspoons (4.9 or 9.9 mL) of lemon juice\nA dash of nutmeg"
        }
      ]
    },
    {
      "name":"Selecting a Scotch",
      "steps":[
        {
          "headline":"Choose a Speyside or Highlands scotch if you want a sweeter flavor.",
          "description":"Scotch flavors tend to vary a bit depending on the region in Scotland where they were produced. While this is not a hard and fast rule, Speyside and Highlands scotches are generally more fruity and sweet than other types of scotch. Tip: If you’re new to drinking scotch, a Speyside like Glenfiddich or a Highlands like Glenmorangie may be good options for you. These scotches are both at the lower end of the alcohol content range, at approximately 40% by volume (or 80 proof), and bottles cost around $30-$40 USD. Speyside and the Highlands are both home to large numbers of distilleries, so you can expect quite a bit of variation between bottles. Experiment with different Speysides and Highlands until you find one you like."
        },
        {
          "headline":"Try a Lowlands scotch if you prefer a lighter body.",
          "description":"If you like whiskey that feels light and smooth and has a floral or grassy finish, Lowlands scotch is a good choice. These malt whiskeys are known for being gentler than many other types of scotch, and they make excellent aperitifs. There are only a few operating distilleries in the Lowlands today. The 2 oldest and most famous distilleries currently in business in the region are Auchentoshan and Glenkinchie. Like most scotches, Lowlands whiskeys are single malts, meaning that they are made with malted barley from a single distillery. Malting involves letting the grain germinate in water before fermentation. Most scotches tend to have a milder flavor than other malts because of the special double or triple distillation process they go through. Generally, they have an alcohol content of about 40% (80-proof)."
        },
        {
          "headline":"Opt for Islay, Islands, or Campbeltown if you like strong or peaty flavors.",
          "description":"These regions are known for producing whiskeys with strong, complex flavors, often with overtones of smoke, peat, and salt. These are good choices if you don’t like sweet or floral drinks, but they may be overwhelming for a first-time whiskey drinker. Islay scotches are known for their strong flavors, which come from the peat fuel that is used during the malting process. Some of the most famous Islay scotches distilleries are Lagavulin, Ardbeg, and Laphroaig. For a somewhat lighter flavor, try a Bruichladdich scotch. Islands scotches are also peaty, but are milder and sweeter than Islay scotches. Try a Tobermory or Highland Park, or choose an Arran bottle for a lighter and fruitier taste. Choose Talisker for a smoky and peaty taste. Campbeltown scotches are complex and slightly salty, with peaty notes similar to those found in Islay's. The major distilleries are Glen Scotia, Longrow, and Springbank."
        }
      ]
    },
    {
      "name":"Choosing a Bourbon",
      "steps":[
        {
          "headline":"Start with a wheated bourbon for a softer taste.",
          "description":"If you’re new to drinking bourbon, you may wish to start with a variety that has a high wheat content. The wheat imparts a softer, gentler flavor to the bourbon, which can make it more palatable than some other bourbons to someone who isn’t used to whiskey. Note: All bourbon whiskeys are blends made with at least 51% corn, along with barley and (usually) a third grain for flavor. Some popular wheated bourbons include Maker’s Mark, Old Fitzgerald, and Pappy Van Winkel. These bourbons tend to have notes of caramel, vanilla, and bread."
        },
        {
          "headline":"Try a traditional bourbon if you like sweet whiskey.",
          "description":"Traditional bourbons have a relatively high corn content (around 70%) and are made with rye instead of wheat. The corn lends sweetness to the whiskey, while the rye gives it a hint of spice. Popular traditional bourbons include Knob Creek, Jim Beam, and Wild Turkey. If you really like the sweetness of the corn, try a bourbon with a higher corn content, such as Old Charter (80% corn) or Baby Bourbon from Tuthilltown Spirits (100% corn)."
        },
        {
          "headline":"Pick a high rye bourbon for extra spice.",
          "description":"Bourbons with a high rye content have bold, spicy flavors. If you enjoy bolder whiskeys, look for a bourbon made with more than 10% rye, such as Old Grand-Dad, Four Roses, or Bulleit. Four Roses Single Barrel has a rye content of 35%, making it the most rye-heavy bourbon on the market. If you like the spiciness of rye but also enjoy whiskey with a fruity flavor, Bulleit is a good choice."
        },
        {
          "headline":"Experiment with single-barrel bourbons to discover unique flavors.",
          "description":"If you’re feeling adventurous, try a variety of single-barrel bourbons. As the name suggests, these bourbons are bottled from the products of a single barrel instead of a blend of different barrels. The flavors of these whiskeys are affected by factors such as how long they were aged, the wood from which the barrel was made, and conditions in the warehouse where they were stored. A few popular single barrel options include Elijah Craig 18-Year-Old, Wild Turkey Kentucky Spirit, and Eagle Rare. Flavors range from woody and smoky to smooth and spicy-sweet. While these bourbons can be quite pricey, “single-barrel” does not always equate to prohibitively expensive. You can get a bottle of Eagle Rare 10 Year Old for around $20 USD."
        }
      ]
    },
    {
      "name":"Picking Other Whiskey Varieties",
      "steps":[
        {
          "headline":"Choose Irish whiskey if you prefer a light body.",
          "description":"Irish whiskeys tend to be fruitier and lighter than their American and Scottish cousins, with a less pronounced alcohol burn. Because of their gentler flavor, these are a good starting point if you’re new to drinking whiskey. Note: Irish whiskeys usually contain a mixture of malted and unmalted barley and are traditionally distilled in a copper pot. “Pot still” whiskeys are said to be particularly full-bodied and rich. Irish whiskeys are typically aged in the barrel for at least 3 years, helping them achieve their characteristic smooth finish. Jameson and Bushmills White Label are 2 of the most popular Irish whiskeys. Whiskey connoisseurs also recommend Greenspot, Redbreast 12 Year Old, or Clontarf."
        },
        {
          "headline":"Pick a Canadian whiskey if you want a unique blend.",
          "description":"Canadian whiskeys are typically blends, meaning they contain a mixture of grain and malt whiskeys. You may find that many blended whiskeys taste smoother than whiskeys made from a single distillation. In addition to containing blends of grain, Canadian whiskeys can also be made with other ingredients, such as wine or any 2-year-old spirit. Because of the wide variety of blends and distillation techniques available in Canada, Canadian whiskeys come in a huge range of flavors. For example, you might try a JP Wiser’s 18 Year Old if you want a smoky, earthy flavor. If you prefer something fruity, sweet, and soft, Corby’s Pike Creek is a good bet."
        },
        {
          "headline":"Try rye whiskey for a bold and spicy flavor.",
          "description":"Like bourbon, rye whiskey is an American spirit aged in barrels made from American oak. In order to qualify as a rye, a whiskey must be made with at least 51% rye grain. Rye tends to be more peppery and savory than many whiskeys, so you may want to grab a bottle of rye if you aren’t a fan of sweeter spirits. Popular rye brands include Old Overholt, Wild Turkey, and Bulleit."
        },
        {
          "headline":"Get whiskey that’s been aged longer for a smooth finish.",
          "description":"If you don’t like a strong alcohol burn, look for whiskeys that have had more time to mature. As whiskey ages, the wood from the barrel softens the harshness of the drink. As the wood draws out some of the harsher flavors from the whiskey, it also adds its own distinct flavors to the mix. Note: Unlike wine, whiskey’s flavor does not improve if it sits for a while in a bottle. The important part of the aging process takes place in the barrel, before the whiskey is bottled. Older is not always better. Whiskey that’s been aged too long (e.g., 23 versus 15 years) can sometimes soak up too many tannins from the wood, resulting in an unpleasant flavor."
        },
        {
          "headline":"Try a variety of whiskeys in each style.",
          "description":"Even within a single type of whiskey, you will encounter a lot of variation. For example, don’t just try one kind of Irish whiskey and decide it’s not for you—you might prefer another bottle that was aged a little longer or has a higher or lower alcohol content. If you can, compare cheaper varieties with more expensive ones. You may find that the pricier bottles are not necessarily your favorites!"
        }
      ]
    }
  ],
  "text":" Drinking Whiskey Straight Pour your whiskey into a glass. Select a small glass tumbler, such as a lowball glass. To really get the most out of the scent and flavor of the whiskey, use a tulip-shaped whiskey glass. Try to avoid using a plastic or polystyrene cup as you might find that materials other than glass impart their own flavor to the whiskey. For a really old-fashioned experience (and if you don’t mind a little metallic flavor), try drinking your whiskey from a tin cup. A little whiskey goes a long way. Start by pouring yourself 1 finger (about 30-50 mL): wrap your index finger around the bottom of the glass and pour up to the height of the top edge of your index finger. Try the whiskey neat before adding water or ice. Before you add anything else to the whiskey, at least sample a little of it in its pure state. This will not only give you a better idea of the whiskey’s flavor and aroma, but will also help you decide whether or not you really want to mix it with anything. If you enjoy the taste of alcohol, you may prefer drinking your whiskey neat. Smell the whiskey 2 or 3 times before tasting it. Put your nose in the glass and take a deep huff. You may need to do this a few times to really get a sense of the aroma, since the smell of alcohol may be overpowering on the first sniff. Then you may start to notice other notes, like spices and wood. Tip: Using a tulip-shaped whiskey glass can enhance the smell of the whiskey since the narrow opening helps trap and concentrate the vapors at the top of the glass. Keep your mouth open while you smell the whiskey to enhance both your sense of smell and sense of taste, which will allow you to understand the whiskey better. Roll the whiskey around in your mouth before swallowing. Don’t just gulp the whiskey down. Take a small sip and move it around on your tongue. After you swallow, wait for a moment before taking another sip so that you can appreciate the aftertaste. You may notice flavors such as caramel, toffee, or vanilla. Some people like to “chew” their whiskey before swallowing it, making sure that it coats the entire tongue and inside of the mouth. Breathing through your nose as you swallow the whiskey can also help you experience the aroma more fully. If you don’t like the taste of the whiskey on your first sip, don’t give up on it right away. The first sip may taste overwhelmingly like alcohol, but you will probably begin to notice other flavors on your second or third taste. It's an acquired taste, so it takes time to truly appreciate the complex flavors and aromas of whiskey. Add a splash of water to enhance the flavor. Add a few drops of fresh, clean water to your whiskey and give it a quick stir with a straw. Doing this will dull the harshness of the alcohol and bring out the other, more subtle flavors of the whiskey. Experiment with adding water little-by-little until you achieve the flavor you’re looking for. Note: It’s not clear why water makes whiskey taste better, but some scientists think the water traps chemicals that cause unpleasant flavors, or that it drives the tastier components to the surface. Toss in a chunk of ice if you want a refreshing chill. Put a large ice cube or an ice ball in your whiskey if you’d like it extra cold. While some whiskey aficionados turn up their noses at the idea of drinking whiskey on the rocks, there’s nothing wrong with adding a little ice if you like. It's your drink, so make it how you like! Do keep in mind that the ice will dilute the whiskey as it melts. The coldness of the ice can also numb your taste buds a bit, making it harder to pick up on the subtler flavors. Larger pieces of ice will melt more slowly than small ones, so they won’t dilute the drink as quickly. Alternatively, you can use chilled whiskey stones, which are soapstone chunks that chill the whiskey without diluting it. Take your time finishing your drink. Since part of the appeal of whiskey is its flavor, you’ll probably get the most out of it if you sip it slowly instead of slamming it back like a shot. Give yourself 30 to 60 minutes to slowly finish your whiskey. If you like shooting whiskey, that’s fine, too! Experiment with savoring your whiskey slowly or knocking it back in one gulp, and see which you prefer. Trying Whiskey Cocktails Try a classic Old Fashioned if you want a sweet and simple cocktail. This is the granddaddy of whiskey cocktails. Depending on your tastes, you can use a variety of whiskeys for the drink, from sweeter bourbons (the traditional choice) to more subtle and spicy rye whiskeys. To make an Old Fashioned:\nMuddle a sugar cube and 3 dashes of bitters in the bottom of a rocks glass. Pour in 1 shot of whiskey and some ice, then stir until the ice begins to melt. Add another shot of whiskey. Garnish the drink with a cherry or an orange twist. Mix up a cool Mint Julep for something light and refreshing. This classic Kentucky cocktail is made with sweet bourbon. The better the bourbon, the better the drink. You should always use fresh mint and muddle the mint (lightly smash it with the sugar cube) at the bottom of the glass before adding the bourbon. Mix 2 fluid ounces (59 mL) of bourbon with a sugar cube and a handful of crushed ice along with the muddled mint. For a deliciously frosty glass, use a tall glass or silver beaker that is pre-chilled. Use a napkin or doily so that you don’t ruin the frost by touching it with your bare hands. Give a Manhattan a try if you enjoy a sweet and slightly bitter taste. Manhattans are a little bitter for some people, but others swear by the sweet/bitter combo. Like the Old Fashioned, you can adjust the whiskey you use for a better cocktail -- rye for something stronger, bourbon for something sweeter. To make a Manhattan, pour the following into a mixer with ice, then pour the liquid into a glass:\n2 fluid ounces (59 mL) of whiskey\n1 fluid ounce (30 mL) of sweet vermouth\n1 to 2 dashes of bitters, such as Angostura\nA small length of orange peel\nThis type of cocktail made with Scotch and orange bitters instead of rye and aromatic bitters is called a Rob Roy. Have a whiskey sour if you prefer your cocktails tart and fruity. This simple, easy drink doesn't call for much, but adds a nice sour punch to your drink that goes down easily. To make one, simply shake the following together in a mixer with plenty of ice:\n2 fluid ounces (59 mL) of whiskey\n1 fluid ounce (30 mL) of fresh-squeezed lemon juice or a packet of sours\n1 teaspoon (about 4 grams) of sugar\nA Boston Sour adds in 1 egg white as well for a frothy, more substantial drink. Warm up with a sweet and spicy Hot Toddy. A Hot Toddy is a warm drink brewed with whiskey and spices. This is a wonderfully comforting drink on a cold, rainy day. Typically, it is made with Irish whiskey. To make a Hot Toddy, pour your whiskey into a glass, then heat up the following ingredients and pour them over the whiskey once the mixture is simmering:\n2 fluid ounces (59 ml) of water\n3 cloves\n1 cinnamon stick\n0.5 in (1.3 cm) piece of ginger, peeled and sliced (optional)\n1 strip of lemon peel\n2 fluid ounces (59 mL) of whiskey\n2 teaspoons (9.9 mL) of honey (adjustable to your sweetness preferences)\n1 or 2 teaspoons (4.9 or 9.9 mL) of lemon juice\nA dash of nutmeg Selecting a Scotch Choose a Speyside or Highlands scotch if you want a sweeter flavor. Scotch flavors tend to vary a bit depending on the region in Scotland where they were produced. While this is not a hard and fast rule, Speyside and Highlands scotches are generally more fruity and sweet than other types of scotch. Tip: If you’re new to drinking scotch, a Speyside like Glenfiddich or a Highlands like Glenmorangie may be good options for you. These scotches are both at the lower end of the alcohol content range, at approximately 40% by volume (or 80 proof), and bottles cost around $30-$40 USD. Speyside and the Highlands are both home to large numbers of distilleries, so you can expect quite a bit of variation between bottles. Experiment with different Speysides and Highlands until you find one you like. Try a Lowlands scotch if you prefer a lighter body. If you like whiskey that feels light and smooth and has a floral or grassy finish, Lowlands scotch is a good choice. These malt whiskeys are known for being gentler than many other types of scotch, and they make excellent aperitifs. There are only a few operating distilleries in the Lowlands today. The 2 oldest and most famous distilleries currently in business in the region are Auchentoshan and Glenkinchie. Like most scotches, Lowlands whiskeys are single malts, meaning that they are made with malted barley from a single distillery. Malting involves letting the grain germinate in water before fermentation. Most scotches tend to have a milder flavor than other malts because of the special double or triple distillation process they go through. Generally, they have an alcohol content of about 40% (80-proof). Opt for Islay, Islands, or Campbeltown if you like strong or peaty flavors. These regions are known for producing whiskeys with strong, complex flavors, often with overtones of smoke, peat, and salt. These are good choices if you don’t like sweet or floral drinks, but they may be overwhelming for a first-time whiskey drinker. Islay scotches are known for their strong flavors, which come from the peat fuel that is used during the malting process. Some of the most famous Islay scotches distilleries are Lagavulin, Ardbeg, and Laphroaig. For a somewhat lighter flavor, try a Bruichladdich scotch. Islands scotches are also peaty, but are milder and sweeter than Islay scotches. Try a Tobermory or Highland Park, or choose an Arran bottle for a lighter and fruitier taste. Choose Talisker for a smoky and peaty taste. Campbeltown scotches are complex and slightly salty, with peaty notes similar to those found in Islay's. The major distilleries are Glen Scotia, Longrow, and Springbank. Choosing a Bourbon Start with a wheated bourbon for a softer taste. If you’re new to drinking bourbon, you may wish to start with a variety that has a high wheat content. The wheat imparts a softer, gentler flavor to the bourbon, which can make it more palatable than some other bourbons to someone who isn’t used to whiskey. Note: All bourbon whiskeys are blends made with at least 51% corn, along with barley and (usually) a third grain for flavor. Some popular wheated bourbons include Maker’s Mark, Old Fitzgerald, and Pappy Van Winkel. These bourbons tend to have notes of caramel, vanilla, and bread. Try a traditional bourbon if you like sweet whiskey. Traditional bourbons have a relatively high corn content (around 70%) and are made with rye instead of wheat. The corn lends sweetness to the whiskey, while the rye gives it a hint of spice. Popular traditional bourbons include Knob Creek, Jim Beam, and Wild Turkey. If you really like the sweetness of the corn, try a bourbon with a higher corn content, such as Old Charter (80% corn) or Baby Bourbon from Tuthilltown Spirits (100% corn). Pick a high rye bourbon for extra spice. Bourbons with a high rye content have bold, spicy flavors. If you enjoy bolder whiskeys, look for a bourbon made with more than 10% rye, such as Old Grand-Dad, Four Roses, or Bulleit. Four Roses Single Barrel has a rye content of 35%, making it the most rye-heavy bourbon on the market. If you like the spiciness of rye but also enjoy whiskey with a fruity flavor, Bulleit is a good choice. Experiment with single-barrel bourbons to discover unique flavors. If you’re feeling adventurous, try a variety of single-barrel bourbons. As the name suggests, these bourbons are bottled from the products of a single barrel instead of a blend of different barrels. The flavors of these whiskeys are affected by factors such as how long they were aged, the wood from which the barrel was made, and conditions in the warehouse where they were stored. A few popular single barrel options include Elijah Craig 18-Year-Old, Wild Turkey Kentucky Spirit, and Eagle Rare. Flavors range from woody and smoky to smooth and spicy-sweet. While these bourbons can be quite pricey, “single-barrel” does not always equate to prohibitively expensive. You can get a bottle of Eagle Rare 10 Year Old for around $20 USD. Picking Other Whiskey Varieties Choose Irish whiskey if you prefer a light body. Irish whiskeys tend to be fruitier and lighter than their American and Scottish cousins, with a less pronounced alcohol burn. Because of their gentler flavor, these are a good starting point if you’re new to drinking whiskey. Note: Irish whiskeys usually contain a mixture of malted and unmalted barley and are traditionally distilled in a copper pot. “Pot still” whiskeys are said to be particularly full-bodied and rich. Irish whiskeys are typically aged in the barrel for at least 3 years, helping them achieve their characteristic smooth finish. Jameson and Bushmills White Label are 2 of the most popular Irish whiskeys. Whiskey connoisseurs also recommend Greenspot, Redbreast 12 Year Old, or Clontarf. Pick a Canadian whiskey if you want a unique blend. Canadian whiskeys are typically blends, meaning they contain a mixture of grain and malt whiskeys. You may find that many blended whiskeys taste smoother than whiskeys made from a single distillation. In addition to containing blends of grain, Canadian whiskeys can also be made with other ingredients, such as wine or any 2-year-old spirit. Because of the wide variety of blends and distillation techniques available in Canada, Canadian whiskeys come in a huge range of flavors. For example, you might try a JP Wiser’s 18 Year Old if you want a smoky, earthy flavor. If you prefer something fruity, sweet, and soft, Corby’s Pike Creek is a good bet. Try rye whiskey for a bold and spicy flavor. Like bourbon, rye whiskey is an American spirit aged in barrels made from American oak. In order to qualify as a rye, a whiskey must be made with at least 51% rye grain. Rye tends to be more peppery and savory than many whiskeys, so you may want to grab a bottle of rye if you aren’t a fan of sweeter spirits. Popular rye brands include Old Overholt, Wild Turkey, and Bulleit. Get whiskey that’s been aged longer for a smooth finish. If you don’t like a strong alcohol burn, look for whiskeys that have had more time to mature. As whiskey ages, the wood from the barrel softens the harshness of the drink. As the wood draws out some of the harsher flavors from the whiskey, it also adds its own distinct flavors to the mix. Note: Unlike wine, whiskey’s flavor does not improve if it sits for a while in a bottle. The important part of the aging process takes place in the barrel, before the whiskey is bottled. Older is not always better. Whiskey that’s been aged too long (e.g., 23 versus 15 years) can sometimes soak up too many tannins from the wood, resulting in an unpleasant flavor. Try a variety of whiskeys in each style. Even within a single type of whiskey, you will encounter a lot of variation. For example, don’t just try one kind of Irish whiskey and decide it’s not for you—you might prefer another bottle that was aged a little longer or has a higher or lower alcohol content. If you can, compare cheaper varieties with more expensive ones. You may find that the pricier bottles are not necessarily your favorites!",
  "tyn_model":[
    "whiskey",
    "bourbon",
    "scotch",
    "ice",
    "whiskeys",
    "water",
    "glass",
    "rye",
    "scotches",
    "alcohol",
    "corn",
    "old fashioned",
    "sugar",
    "bitters",
    "sugar cube",
    "mixer",
    "lemon",
    "highlands",
    "barley",
    "peat",
    "bourbons",
    "wild turkey",
    "bulleit",
    "eagle rare",
    "wine",
    "rye whiskey",
    "tumbler",
    "whiskey glass",
    "“chew",
    "” their",
    "straw",
    "ice cube",
    "ice ball",
    "rye whiskeys",
    "rocks glass",
    "crushed ice",
    "mint",
    "tall glass or silver beaker",
    "napkin",
    "manhattan",
    "sweet vermouth",
    "angostura",
    "orange peel",
    "orange bitters",
    "aromatic bitters",
    "rob roy",
    "whiskey sour",
    "lemon juice",
    "boston sour",
    "cinnamon stick",
    "ginger",
    "honey",
    "salt",
    "islay scotches",
    "talisker",
    "wheated bourbon",
    "wheat",
    "bourbon whiskeys",
    "maker’s mark",
    "old fitzgerald,",
    "vanilla",
    "jim beam",
    "old charter",
    "four roses",
    "four roses single barrel",
    "elijah craig 18-year-old",
    "wild turkey kentucky spirit",
    "“single",
    "” does",
    "irish whiskey",
    "“pot",
    "” whiskeys",
    "jameson",
    "corby’s",
    "barrel",
    "—you"
  ],
  "tyn_section":[

  ]
}