{
  "title":"How to Make a Low Fat Stir Fry",
  "url":"https://www.wikihow.com/Make-a-Low-Fat-Stir-Fry",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Chinese Dishes"
  ],
  "methods":[
    {
      "name":"Choose Your Ingredients",
      "steps":[
        {
          "headline":"Select low fat proteins.",
          "description":"Meats such as chicken breast, lean pork, shrimp, fish and some lean cuts of beef are all great choices for a stir fry. Cooking these meats at a high temperature for a short cooking time will prevent them from drying out. Tofu is a vegetarian option, just be sure to choose firm tofu so that it will stand up to the rigors of stir frying. Cut the proteins into bite size pieces so that they cook quickly and evenly. Allow 4 to 6 oz. (113 to 170 g) of meat per person."
        },
        {
          "headline":"Select fresh vegetables.",
          "description":"Fresh vegetables work best in a stir fry because they retain the liquid that is otherwise lost when defrosting frozen vegetables. Choose colorful vegetables such as red bell peppers, carrots, celery, broccoli or whatever vegetables you like best. Cut the vegetables into uniform sizes so that they cook evenly. Allow about 1 cup of chopped vegetables per person."
        },
        {
          "headline":"Select aromatics.",
          "description":"Onions, garlic and ginger work well in any stir fry. They impart authentic flavors without overwhelming the dish. 1 tsp. (5 ml) of grated ginger and 1 small minced clove of garlic per person is enough to add flavor to your stir fry. Feel free to add more if you like ginger and garlic."
        },
        {
          "headline":"Choose an oil.",
          "description":"Choose an oil that can withstand higher temperatures before smoking. Oils such as peanut, canola and extra light olive oil are all good options. 1 tbsp. (15 ml) of oil per person is sufficient."
        },
        {
          "headline":"Prepare a slurry.",
          "description":"A slurry is a mixture of water and a thickening agent. For a stir fry, a slurry should be a combination of water and cornstarch. For each person, combine 1/2 cup (120 ml) of water with 1 tbsp. (15 ml) of cornstarch. Stir well until combined. Set aside until the last step of cooking."
        },
        {
          "headline":"Choose a pan.",
          "description":"Traditional stir fry pans are woks. These are deep pans with narrow rounded bottoms. The opening is wide and the sides are sloped. You can, however, make a stir fry in any pan that can withstand high heat, even non-stick pans. If you use a non-stick pan, you can reduce the amount of oil by half for a stir fry that is even more low fat."
        }
      ]
    },
    {
      "name":"Cook the Stir Fry",
      "steps":[
        {
          "headline":"Add the oil.",
          "description":"Add the oil to your pan and allow it to become very hot. The oil should shimmer, but not quite begin to smoke."
        },
        {
          "headline":"Add the protein.",
          "description":"While the pan is still very hot, add the cubed or cut protein being very careful not to splash hot oil. Using a silicone or wooden spoon or spatula, briskly move the protein around the pan until it is nearly cooked. During the last minute of cooking time add the onion, garlic and ginger and allow it to cook until aromatic. Constantly stir the contents of your pan."
        },
        {
          "headline":"Add the vegetables.",
          "description":"Remove the protein from the wok or pan and place the pan back on the heat. When heated, add the vegetables and stir briskly until they are crisp tender. This could take 2 to 3 minutes depending on your vegetables of choice."
        },
        {
          "headline":"Combine and serve.",
          "description":"When the vegetables are crisp tender, add the cooked meat to the pan. Then pour in the slurry and allow the mixture to boil. Continue stirring until it boils and then season and serve. Do not overcook or your vegetables will become limp and your meat dry."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Choose Your Ingredients Select low fat proteins. Meats such as chicken breast, lean pork, shrimp, fish and some lean cuts of beef are all great choices for a stir fry. Cooking these meats at a high temperature for a short cooking time will prevent them from drying out. Tofu is a vegetarian option, just be sure to choose firm tofu so that it will stand up to the rigors of stir frying. Cut the proteins into bite size pieces so that they cook quickly and evenly. Allow 4 to 6 oz. (113 to 170 g) of meat per person. Select fresh vegetables. Fresh vegetables work best in a stir fry because they retain the liquid that is otherwise lost when defrosting frozen vegetables. Choose colorful vegetables such as red bell peppers, carrots, celery, broccoli or whatever vegetables you like best. Cut the vegetables into uniform sizes so that they cook evenly. Allow about 1 cup of chopped vegetables per person. Select aromatics. Onions, garlic and ginger work well in any stir fry. They impart authentic flavors without overwhelming the dish. 1 tsp. (5 ml) of grated ginger and 1 small minced clove of garlic per person is enough to add flavor to your stir fry. Feel free to add more if you like ginger and garlic. Choose an oil. Choose an oil that can withstand higher temperatures before smoking. Oils such as peanut, canola and extra light olive oil are all good options. 1 tbsp. (15 ml) of oil per person is sufficient. Prepare a slurry. A slurry is a mixture of water and a thickening agent. For a stir fry, a slurry should be a combination of water and cornstarch. For each person, combine 1/2 cup (120 ml) of water with 1 tbsp. (15 ml) of cornstarch. Stir well until combined. Set aside until the last step of cooking. Choose a pan. Traditional stir fry pans are woks. These are deep pans with narrow rounded bottoms. The opening is wide and the sides are sloped. You can, however, make a stir fry in any pan that can withstand high heat, even non-stick pans. If you use a non-stick pan, you can reduce the amount of oil by half for a stir fry that is even more low fat. Cook the Stir Fry Add the oil. Add the oil to your pan and allow it to become very hot. The oil should shimmer, but not quite begin to smoke. Add the protein. While the pan is still very hot, add the cubed or cut protein being very careful not to splash hot oil. Using a silicone or wooden spoon or spatula, briskly move the protein around the pan until it is nearly cooked. During the last minute of cooking time add the onion, garlic and ginger and allow it to cook until aromatic. Constantly stir the contents of your pan. Add the vegetables. Remove the protein from the wok or pan and place the pan back on the heat. When heated, add the vegetables and stir briskly until they are crisp tender. This could take 2 to 3 minutes depending on your vegetables of choice. Combine and serve. When the vegetables are crisp tender, add the cooked meat to the pan. Then pour in the slurry and allow the mixture to boil. Continue stirring until it boils and then season and serve. Do not overcook or your vegetables will become limp and your meat dry. Finished. ",
  "tyn_model":[
    "vegetables",
    "oil",
    "pan",
    "garlic",
    "ginger",
    "water",
    "cornstarch",
    "shrimp",
    "fish",
    "tofu",
    "stir frying",
    "stir fry",
    "carrots",
    "celery",
    "broccoli",
    "onions",
    "oils",
    "canola",
    "olive oil",
    "stir fry pans",
    "onion",
    "wok",
    "slurry",
    "meat"
  ],
  "tyn_section":[

  ]
}