{
  "title":"How to Be Ready in a Volcanic Eruption",
  "url":"https://www.wikihow.com/Be-Ready-in-a-Volcanic-Eruption",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "methods":[
    {
      "name":"Before",
      "steps":[
        {
          "headline":"Evaluate sites for risk of volcanic disasters before even putting up structures in these sites.",
          "description":""
        },
        {
          "headline":"Reinforce existing building structures and build protective works such as dikes to deflect lava and lava flow.",
          "description":""
        },
        {
          "headline":"Have an emergency disaster plan in place especially for evacuation and communication.",
          "description":""
        }
      ]
    },
    {
      "name":"During",
      "steps":[
        {
          "headline":"Listen to and heed the warnings given.",
          "description":""
        },
        {
          "headline":"Stay Away from the area during volcanic activity.",
          "description":""
        },
        {
          "headline":"Cover your nose with a wet piece of cloth so that you will not inhale the smoke.",
          "description":""
        },
        {
          "headline":"Cover your eyes from dust and smoke.",
          "description":""
        },
        {
          "headline":"Evacuate from the place as soon as the authorities tell you to do so.",
          "description":""
        }
      ]
    },
    {
      "name":"After",
      "steps":[
        {
          "headline":"Help people requiring special assistance like the infants, elderly, and the disabled.",
          "description":""
        },
        {
          "headline":"Avoid areas where there might be volcanic ash fall.",
          "description":"Volcanic ash can cause respiratory ailments. It can also worsen respiratory diseases like asthma, bronchitis, and emphysema."
        },
        {
          "headline":"Unless advised to evacuate, stay indoors and wear a face mask to protect your lungs; wear glasses to protect you eyes.",
          "description":""
        },
        {
          "headline":"When outdoors or when evacuating, cover your mouth and nose; wear goggles to protect your eyes; wear glasses instead of contact lenses; and keep your skin protected from volcanic ash to avoid irritation.",
          "description":""
        },
        {
          "headline":"Remove ash from roofs.",
          "description":"Volcanic ash is heavy especially when wet and can cause roofs to collapse."
        },
        {
          "headline":"Avoid driving during heavy ash fall.",
          "description":""
        }
      ]
    }
  ],
  "text":" Before Evaluate sites for risk of volcanic disasters before even putting up structures in these sites.  Reinforce existing building structures and build protective works such as dikes to deflect lava and lava flow.  Have an emergency disaster plan in place especially for evacuation and communication.  During Listen to and heed the warnings given.  Stay Away from the area during volcanic activity.  Cover your nose with a wet piece of cloth so that you will not inhale the smoke.  Cover your eyes from dust and smoke.  Evacuate from the place as soon as the authorities tell you to do so.  After Help people requiring special assistance like the infants, elderly, and the disabled.  Avoid areas where there might be volcanic ash fall. Volcanic ash can cause respiratory ailments. It can also worsen respiratory diseases like asthma, bronchitis, and emphysema. Unless advised to evacuate, stay indoors and wear a face mask to protect your lungs; wear glasses to protect you eyes.  When outdoors or when evacuating, cover your mouth and nose; wear goggles to protect your eyes; wear glasses instead of contact lenses; and keep your skin protected from volcanic ash to avoid irritation.  Remove ash from roofs. Volcanic ash is heavy especially when wet and can cause roofs to collapse. Avoid driving during heavy ash fall. ",
  "tyn_model":[
    "volcanic ash",
    "glasses",
    "face mask",
    "goggles",
    "contact lenses"
  ],
  "tyn_section":[

  ]
}