{
  "title":"How to Make Vegetable Biryani",
  "url":"https://www.wikihow.com/Make-Vegetable-Biryani",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Vegetarian Indian Dishes"
  ],
  "parts":[
    {
      "name":"Preparing Ingredients",
      "steps":[
        {
          "headline":"Make a trip to the local Indian store or international market to purchase ingredients you may not find at a regular grocery store.",
          "description":"The ingredients you’ll likely want to purchase are:\nPaneer (though you can try to make your own if you’re adventurous)\nCardamom pods\nCloves\nCinnamon sticks\nBiryani mix\nCumin seeds"
        },
        {
          "headline":"Soak 1 1/2 cups of long-grain (preferably basmati) rice for at least half an hour.",
          "description":"Soaking rice before you cook it results in a lighter, fluffier final product, and that’s very important in a biryani! Though you only have to soak for a minimum of half an hour, feel free to soak it for longer. Some people soak it overnight."
        },
        {
          "headline":"Peel your potatoes and carrots.",
          "description":"Do this over a sink, table, or garbage can so the peels don’t drop everywhere. Always direct the peeler away from your body, and be careful not to cut your fingers during this process. You’ll peel:\nTwo medium-sized carrots\nOne russet potato"
        },
        {
          "headline":"Chop your vegetables.",
          "description":"You don’t want small pieces, as you often do when chopping vegetables. Chop them into fairly large chunks. The vegetables you’re preparing are:\n10-12 cauliflower florets\nTwo peeled carrots\nOne peeled potato\nOne medium yellow onion\nThree or four green chili peppers. Feel free to use fewer if you don’t like spicy food."
        },
        {
          "headline":"Chop two tablespoons each of mint and cilantro.",
          "description":"Roll each bunch of herbs into a tight roll shaped like a pencil and hold it stable with your off-hand. Run your knife through it by chopping down the length of the roll you’ve made. It doesn’t matter if you keep the mint and cilantro separate or not, once you’ve chopped them, as they’ll be added together. It is important that you have equal portions of each herb."
        },
        {
          "headline":"Make a ginger garlic paste.",
          "description":"You may be able to purchase this in a store (especially an international market), but it’s so easy to make, you might as well make it at home. Place about five cloves of garlic and a two-inch thumb of ginger into a blender and begin blending. Add about 1 teaspoon of oil or water — however much it needs to get your mixture to a smooth paste. You can save the leftover paste in the fridge, or freeze it if you want to store it for a longer period of time."
        }
      ]
    },
    {
      "name":"Making Rice",
      "steps":[
        {
          "headline":"Bring water to a boil in a pot.",
          "description":"You should use about four cups of water, and salt it to both regulate the temperature, ensuring an even cook, and to add taste to the rice that’s cooked in it."
        },
        {
          "headline":"Add some oil and whole garam masala to the water.",
          "description":"Though you can purchase garam masala powder at the store, to get the best flavor out of your biryani, you should use the actual individual components that go into the powder. Use one cinnamon stick, three or four cardamom pods, and four or five cloves. Add that with 1 tablespoon of vegetable oil in the water. It’s important to pack every component of the dish with flavor. You don’t want flavorful vegetables mixed in with bland white rice."
        },
        {
          "headline":"Drain the soaked rice.",
          "description":"Pour it into a colander or strainer to make sure you’re not adding too much water to the pot, which might cause it to boil over later."
        },
        {
          "headline":"Add the rice to the pot of boiling water.",
          "description":"Because you’ve soaked your rice for at least half an hour, it’s going to cook much faster than it normally would. If you soak it for an hour, it could cook through completely in 3-4 minutes, so keep an eye on it."
        },
        {
          "headline":"Drain the rice when it’s about ¾ cooked through.",
          "description":"You’re going to finish cooking it with the vegetables, so remove it from the boiling water early. Test how cooked through it is by spooning some out and chewing it. It should still be toothy when you decide to stop boiling it. Drain the rice in a colander or large strainer. Set it aside."
        }
      ]
    },
    {
      "name":"Making Vegetable Biryani",
      "steps":[
        {
          "headline":"Add whole garam masala to vegetable oil that has been brought up to medium heat in a large, deep, preferably non-stick pan.",
          "description":"Use the same garam masala ingredients used when cooking the rice: one cinnamon stick, three or four cardamom pods, and four or five cloves, but don't add the cumin seeds yet. Sauté them until the scents start to come out. Bite the cardamom pods to break them open slightly before adding them to the oil. This helps their flavor get out. Don’t let the oil get too hot before adding the garam masala, as it will splatter and could burn you. If you can’t find any of the ingredients in this recipe (cardamom pods, for example) at the regular grocery store, try your local Indian grocery. Mexican grocery stores and East Asian grocery stores may also have some of these ingredients. If your town does not have any international grocery stores, you can purchase these spices easily online. If you don’t have any deep pans, use a pot with a broad base. It’s important that your vegetables have a lot of room to cook."
        },
        {
          "headline":"Add ½ teaspoon of cumin seeds.",
          "description":"If you add them too early, they may have a burnt taste and smell, so don’t add these to the fresh oil in the previous step. Stir it around until the seeds are distributed throughout your pan."
        },
        {
          "headline":"Add the ginger-garlic paste you made in the “prep” phase.",
          "description":"This paste has a strong taste that some people will want in moderation, while others won’t be able to get enough of. Use at least 1 ½ tablespoons of the paste, but add more if you’d like. Stir the paste around until it’s been distributed throughout your pan."
        },
        {
          "headline":"Add the vegetables you chopped in the “prep” phase.",
          "description":"This will include carrots, potatoes, onions, and cauliflower, and green chili peppers. Add salt to taste. Cook them in the ginger garlic paste mixture until they’re about ¾ as cooked as you’d like them to be. They should still have a little bite and resistance to them when you bite into them. They’ll be slightly browned, but not cooked all the way through. Stir occasionally to make sure the vegetables aren’t burning to the pan."
        },
        {
          "headline":"Sprinkle in about half of the cilantro and mint leaves your chopped during the “prep” phase.",
          "description":"You’ll ad the rest of it later, as finishing herbs, so don’t dump all of it in there now!"
        },
        {
          "headline":"Add the store-bought biryani masala.",
          "description":"Again, this can be purchased either in an international or Indian market or online. Use the entire packet, and mix it evenly into the vegetables so they are evenly coated with the biryani spice mix."
        },
        {
          "headline":"Add about half of the yogurt this recipe calls for — ¼ cup at this time.",
          "description":"Just hold onto the rest of the yogurt for a little bit. We’ll use it soon!"
        },
        {
          "headline":"Add the whole packet of paneer.",
          "description":"Stir the pan until all of the ingredients have been evenly coated in the biryani mix."
        },
        {
          "headline":"Combine the rice and vegetables.",
          "description":"Both of these components have been cooked about ¾ of the way, and you want to finish cooking the together. This way, their flavors will start to meld together, and you’ll have a more flavorful final dish. Remove half of the vegetables from the pan and set them aside. Spread the remaining vegetables into an even layer at the bottom of the pan. Add the rest of the yogurt (1/4 cup), along with 4 oz of cashew nuts. Stir to combine, and check the seasoning at this point. Add salt if you need to."
        },
        {
          "headline":"Add half of the rice in an even layer over the mixture.",
          "description":"Add the remaining vegetable over the bed of rice and spread them across the surface\nTop this layer with the rest of the rice, and spread it out in an even layer"
        },
        {
          "headline":"Add your finishing herbs.",
          "description":"Sprinkle the rest of the chopped cilantro and mint leaves that you set aside earlier onto the top bed of rice."
        },
        {
          "headline":"Cover the pot with a lid so it can steam-cook to completion.",
          "description":"You’ll know it’s finished when the rice is light and fluffy and soft without being mushy."
        }
      ]
    }
  ],
  "text":" Preparing Ingredients Make a trip to the local Indian store or international market to purchase ingredients you may not find at a regular grocery store. The ingredients you’ll likely want to purchase are:\nPaneer (though you can try to make your own if you’re adventurous)\nCardamom pods\nCloves\nCinnamon sticks\nBiryani mix\nCumin seeds Soak 1 1/2 cups of long-grain (preferably basmati) rice for at least half an hour. Soaking rice before you cook it results in a lighter, fluffier final product, and that’s very important in a biryani! Though you only have to soak for a minimum of half an hour, feel free to soak it for longer. Some people soak it overnight. Peel your potatoes and carrots. Do this over a sink, table, or garbage can so the peels don’t drop everywhere. Always direct the peeler away from your body, and be careful not to cut your fingers during this process. You’ll peel:\nTwo medium-sized carrots\nOne russet potato Chop your vegetables. You don’t want small pieces, as you often do when chopping vegetables. Chop them into fairly large chunks. The vegetables you’re preparing are:\n10-12 cauliflower florets\nTwo peeled carrots\nOne peeled potato\nOne medium yellow onion\nThree or four green chili peppers. Feel free to use fewer if you don’t like spicy food. Chop two tablespoons each of mint and cilantro. Roll each bunch of herbs into a tight roll shaped like a pencil and hold it stable with your off-hand. Run your knife through it by chopping down the length of the roll you’ve made. It doesn’t matter if you keep the mint and cilantro separate or not, once you’ve chopped them, as they’ll be added together. It is important that you have equal portions of each herb. Make a ginger garlic paste. You may be able to purchase this in a store (especially an international market), but it’s so easy to make, you might as well make it at home. Place about five cloves of garlic and a two-inch thumb of ginger into a blender and begin blending. Add about 1 teaspoon of oil or water — however much it needs to get your mixture to a smooth paste. You can save the leftover paste in the fridge, or freeze it if you want to store it for a longer period of time. Making Rice Bring water to a boil in a pot. You should use about four cups of water, and salt it to both regulate the temperature, ensuring an even cook, and to add taste to the rice that’s cooked in it. Add some oil and whole garam masala to the water. Though you can purchase garam masala powder at the store, to get the best flavor out of your biryani, you should use the actual individual components that go into the powder. Use one cinnamon stick, three or four cardamom pods, and four or five cloves. Add that with 1 tablespoon of vegetable oil in the water. It’s important to pack every component of the dish with flavor. You don’t want flavorful vegetables mixed in with bland white rice. Drain the soaked rice. Pour it into a colander or strainer to make sure you’re not adding too much water to the pot, which might cause it to boil over later. Add the rice to the pot of boiling water. Because you’ve soaked your rice for at least half an hour, it’s going to cook much faster than it normally would. If you soak it for an hour, it could cook through completely in 3-4 minutes, so keep an eye on it. Drain the rice when it’s about ¾ cooked through. You’re going to finish cooking it with the vegetables, so remove it from the boiling water early. Test how cooked through it is by spooning some out and chewing it. It should still be toothy when you decide to stop boiling it. Drain the rice in a colander or large strainer. Set it aside. Making Vegetable Biryani Add whole garam masala to vegetable oil that has been brought up to medium heat in a large, deep, preferably non-stick pan. Use the same garam masala ingredients used when cooking the rice: one cinnamon stick, three or four cardamom pods, and four or five cloves, but don't add the cumin seeds yet. Sauté them until the scents start to come out. Bite the cardamom pods to break them open slightly before adding them to the oil. This helps their flavor get out. Don’t let the oil get too hot before adding the garam masala, as it will splatter and could burn you. If you can’t find any of the ingredients in this recipe (cardamom pods, for example) at the regular grocery store, try your local Indian grocery. Mexican grocery stores and East Asian grocery stores may also have some of these ingredients. If your town does not have any international grocery stores, you can purchase these spices easily online. If you don’t have any deep pans, use a pot with a broad base. It’s important that your vegetables have a lot of room to cook. Add ½ teaspoon of cumin seeds. If you add them too early, they may have a burnt taste and smell, so don’t add these to the fresh oil in the previous step. Stir it around until the seeds are distributed throughout your pan. Add the ginger-garlic paste you made in the “prep” phase. This paste has a strong taste that some people will want in moderation, while others won’t be able to get enough of. Use at least 1 ½ tablespoons of the paste, but add more if you’d like. Stir the paste around until it’s been distributed throughout your pan. Add the vegetables you chopped in the “prep” phase. This will include carrots, potatoes, onions, and cauliflower, and green chili peppers. Add salt to taste. Cook them in the ginger garlic paste mixture until they’re about ¾ as cooked as you’d like them to be. They should still have a little bite and resistance to them when you bite into them. They’ll be slightly browned, but not cooked all the way through. Stir occasionally to make sure the vegetables aren’t burning to the pan. Sprinkle in about half of the cilantro and mint leaves your chopped during the “prep” phase. You’ll ad the rest of it later, as finishing herbs, so don’t dump all of it in there now! Add the store-bought biryani masala. Again, this can be purchased either in an international or Indian market or online. Use the entire packet, and mix it evenly into the vegetables so they are evenly coated with the biryani spice mix. Add about half of the yogurt this recipe calls for — ¼ cup at this time. Just hold onto the rest of the yogurt for a little bit. We’ll use it soon! Add the whole packet of paneer. Stir the pan until all of the ingredients have been evenly coated in the biryani mix. Combine the rice and vegetables. Both of these components have been cooked about ¾ of the way, and you want to finish cooking the together. This way, their flavors will start to meld together, and you’ll have a more flavorful final dish. Remove half of the vegetables from the pan and set them aside. Spread the remaining vegetables into an even layer at the bottom of the pan. Add the rest of the yogurt (1/4 cup), along with 4 oz of cashew nuts. Stir to combine, and check the seasoning at this point. Add salt if you need to. Add half of the rice in an even layer over the mixture. Add the remaining vegetable over the bed of rice and spread them across the surface\nTop this layer with the rest of the rice, and spread it out in an even layer Add your finishing herbs. Sprinkle the rest of the chopped cilantro and mint leaves that you set aside earlier onto the top bed of rice. Cover the pot with a lid so it can steam-cook to completion. You’ll know it’s finished when the rice is light and fluffy and soft without being mushy.",
  "tyn_model":[
    "rice",
    "vegetables",
    "water",
    "carrots",
    "mint",
    "cilantro",
    "oil",
    "cardamom",
    "cinnamon",
    "cumin",
    "pot",
    "salt",
    "garam masala",
    "“prep",
    "” phase",
    "yogurt",
    "paneer",
    "biryani mix",
    "potatoes",
    "green chili peppers",
    "herbs",
    "ginger garlic",
    "vegetable oil",
    "colander",
    "pan",
    "cardamom pods",
    "peeler",
    "russet potato",
    "cauliflower florets",
    "potato",
    "yellow onion",
    "knife",
    "garlic",
    "ginger",
    "blender",
    "— however",
    "garam masala powder",
    "strainer",
    "non-stick pan",
    "garam masala ingredients",
    "fresh oil",
    "ginger-garlic",
    "onions",
    "cauliflower",
    "biryani masala",
    "biryani spice mix",
    "— ¼",
    "cashew nuts",
    "vegetable"
  ],
  "tyn_section":[

  ]
}