{
  "title":"How to Make Vegan Onion Rings",
  "url":"https://www.wikihow.com/Make-Vegan-Onion-Rings",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan"
  ],
  "steps":[
    {
      "headline":"Make up the egg substitute if you haven't already done so; add the seasoning to the egg substitute to spice it up.",
      "description":"Peel and cut the onions into rings of a suitable thickness."
    },
    {
      "headline":"Preheat the oven to 350ºF/180ºC.",
      "description":"Prepare the baking sheet by lining it with parchment paper."
    },
    {
      "headline":"Combine the flour, salt and pepper in the mixing bowl.",
      "description":""
    },
    {
      "headline":"Pour the breadcrumbs into the third mixing bowl.",
      "description":""
    },
    {
      "headline":"Using tongs, dip the onion rings into the flour bowl and make sure each ring is coated well.",
      "description":""
    },
    {
      "headline":"Dip the floured onion rings into the egg substitute bowl and coat well.",
      "description":""
    },
    {
      "headline":"Finish up by dipping the wet onion ring into the breadcrumbs bowl.",
      "description":""
    },
    {
      "headline":"Place the onion rings onto the prepared baking sheet/tray.",
      "description":""
    },
    {
      "headline":"Place the rings in the preheated oven once they have been prepared.",
      "description":"Bake for around 25 minutes or until lightly browned."
    },
    {
      "headline":"Remove from the oven.",
      "description":"Serve. These can be eaten as a side accompaniment, as part of a meal of homemade chips or wedges and salad or they can be added to dishes to give them an added tastiness."
    }
  ],
  "text":" Make up the egg substitute if you haven't already done so; add the seasoning to the egg substitute to spice it up. Peel and cut the onions into rings of a suitable thickness. Preheat the oven to 350ºF/180ºC. Prepare the baking sheet by lining it with parchment paper. Combine the flour, salt and pepper in the mixing bowl.  Pour the breadcrumbs into the third mixing bowl.  Using tongs, dip the onion rings into the flour bowl and make sure each ring is coated well.  Dip the floured onion rings into the egg substitute bowl and coat well.  Finish up by dipping the wet onion ring into the breadcrumbs bowl.  Place the onion rings onto the prepared baking sheet/tray.  Place the rings in the preheated oven once they have been prepared. Bake for around 25 minutes or until lightly browned. Remove from the oven. Serve. These can be eaten as a side accompaniment, as part of a meal of homemade chips or wedges and salad or they can be added to dishes to give them an added tastiness.",
  "tyn_model":[
    "oven",
    "egg substitute",
    "baking sheet",
    "flour",
    "mixing bowl",
    "onions",
    "parchment paper",
    "salt",
    "pepper",
    "breadcrumbs",
    "onion ring",
    "breadcrumbs bowl",
    "onion rings"
  ],
  "tyn_section":[

  ]
}