{
  "title":"How to Make Vegan Mincemeat Pies",
  "url":"https://www.wikihow.com/Make-Vegan-Mincemeat-Pies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan",
    "Vegan Baking"
  ],
  "steps":[
    {
      "headline":"Make the mincemeat.",
      "description":"Place all of the ingredients apart from the caster (superfine) sugar into the mixing bowl. If you don't want to mix by hand, use a food processor, which will make a finer mincemeat."
    },
    {
      "headline":"Preheat the oven to 200ºC or 400ºF.",
      "description":"Prepare the pie or muffin tin (pan) by greasing or flouring each hole."
    },
    {
      "headline":"Make the pie dough.",
      "description":"Sift the flour and salt into the other mixing bowl. Add the margarine and using your fingertips, gently and quickly rub the fat into the flour. The mix is ready when it resembles breadcrumbs."
    },
    {
      "headline":"Pour in the cold water.",
      "description":"Press the mix together to form a dough."
    },
    {
      "headline":"Remove the dough from the bowl and place on a floured surface.",
      "description":"Roll the dough out fairly thinly. Cut 12 centimeter (4.7 in) (4 3/4\") circles and 10 centimeter (3.9 in) (4\") circles from the dough with round dough or biscuit (cookie) cutters."
    },
    {
      "headline":"Press a larger circle into the pie or muffin tin (pan).",
      "description":"Place a heaped teaspoon of mincemeat into the middle of the dough. Cover with a smaller circle. Repeat until all circles have been turned into mincemeat pies."
    },
    {
      "headline":"Press fork tines around the edges of each pie to seal closed.",
      "description":"Stab the fork in the middle of the pie to create steam escape holes. Alternatively, simply pinch the edges together and make one small neat hole in the middle of each pie."
    },
    {
      "headline":"Place the pies into the preheated oven.",
      "description":"Bake for around 10 minutes or until the pies start to brown lightly."
    },
    {
      "headline":"Remove from the oven.",
      "description":"Place the entire tin (pan) on the wire cooling rack and leave there to cool."
    },
    {
      "headline":"Sprinkle with the sugar.",
      "description":"Serve warm or cold."
    }
  ],
  "text":" Make the mincemeat. Place all of the ingredients apart from the caster (superfine) sugar into the mixing bowl. If you don't want to mix by hand, use a food processor, which will make a finer mincemeat. Preheat the oven to 200ºC or 400ºF. Prepare the pie or muffin tin (pan) by greasing or flouring each hole. Make the pie dough. Sift the flour and salt into the other mixing bowl. Add the margarine and using your fingertips, gently and quickly rub the fat into the flour. The mix is ready when it resembles breadcrumbs. Pour in the cold water. Press the mix together to form a dough. Remove the dough from the bowl and place on a floured surface. Roll the dough out fairly thinly. Cut 12 centimeter (4.7 in) (4 3/4\") circles and 10 centimeter (3.9 in) (4\") circles from the dough with round dough or biscuit (cookie) cutters. Press a larger circle into the pie or muffin tin (pan). Place a heaped teaspoon of mincemeat into the middle of the dough. Cover with a smaller circle. Repeat until all circles have been turned into mincemeat pies. Press fork tines around the edges of each pie to seal closed. Stab the fork in the middle of the pie to create steam escape holes. Alternatively, simply pinch the edges together and make one small neat hole in the middle of each pie. Place the pies into the preheated oven. Bake for around 10 minutes or until the pies start to brown lightly. Remove from the oven. Place the entire tin (pan) on the wire cooling rack and leave there to cool. Sprinkle with the sugar. Serve warm or cold.",
  "tyn_model":[
    "oven",
    "sugar",
    "mixing bowl",
    "pie or muffin tin",
    "flour",
    "fork",
    "food processor",
    "salt",
    "margarine",
    "cold water",
    "bowl",
    "round dough or biscuit (cookie) cutters",
    "mincemeat pies"
  ],
  "tyn_section":[

  ]
}