{
  "title":"How to Use Nuts in Desserts",
  "url":"https://www.wikihow.com/Use-Nuts-in-Desserts",
  "category_hierarchy":[
    "Food and Entertaining",
    "Nuts and Seeds"
  ],
  "steps":[
    {
      "headline":"Use nuts as toppings and fillings for puddings, crumbles and dessert cakes.",
      "description":"For a topping, add a glaze and it's really something special that can be served up at a dinner party. Some ideas for puddings include:\nChoco nut pudding\nBaked apple and almond pudding\nBlack walnut and sweet potato pudding\n\nRocky road pudding. And see How to make cherry nut topping."
    },
    {
      "headline":"Make baklava for dessert.",
      "description":"This Middle Eastern delight is an excellent dessert that can be eaten with a side of whipped cream or by itself. It also goes well with coffee and tea. Here are some suggestions:\nTraditional baklava\nRosewater baklava\nApple baklava\n\nAlmond baklava."
    },
    {
      "headline":"Make dessert pies with nuts.",
      "description":"There are many traditional nut pies that will serve as an excellent dessert. Some examples include:\nPecan pie\nDried apricot and walnut tart\nMixed nut toffee tart\n\nChocolate peanut butter tarts."
    },
    {
      "headline":"Cream nuts to use as fillings or to substitute for cream.Nut creams can be very useful at dessert time, helping to fill out a dessert pie or dish, or serving as a non-dairy alternative to cream.",
      "description":"For example:\n\nCashew cream."
    },
    {
      "headline":"Add nuts to ice cream or make ice cream from nuts.",
      "description":"Nuts are often an integral part of ice cream toppings or fillings. Here are just a few ideas:\nMake a pine nut sundae\nCassata ice cream\nRose and pistachio ice cream\n\nDairy free banana and walnut ice cream."
    },
    {
      "headline":"Make nut cakes for dessert.",
      "description":"Cake can make an excellent dessert, especially when slice thinly and with a dollop of cream or ice cream added to one side. Here are some ideas:\nWalnut and pecan torte\nCarrot nut cake\nWalnut chocolate bread cake\nCinnamon and walnut pumpkin cake\nGluten free orange and almond cake\nCherry almond cake\nAlmond crunch chocolate confetti cake\nLime, coconut and almond cake\n\nGerman chocolate cake."
    }
  ],
  "text":" Use nuts as toppings and fillings for puddings, crumbles and dessert cakes. For a topping, add a glaze and it's really something special that can be served up at a dinner party. Some ideas for puddings include:\nChoco nut pudding\nBaked apple and almond pudding\nBlack walnut and sweet potato pudding\n\nRocky road pudding. And see How to make cherry nut topping. Make baklava for dessert. This Middle Eastern delight is an excellent dessert that can be eaten with a side of whipped cream or by itself. It also goes well with coffee and tea. Here are some suggestions:\nTraditional baklava\nRosewater baklava\nApple baklava\n\nAlmond baklava. Make dessert pies with nuts. There are many traditional nut pies that will serve as an excellent dessert. Some examples include:\nPecan pie\nDried apricot and walnut tart\nMixed nut toffee tart\n\nChocolate peanut butter tarts. Cream nuts to use as fillings or to substitute for cream.Nut creams can be very useful at dessert time, helping to fill out a dessert pie or dish, or serving as a non-dairy alternative to cream. For example:\n\nCashew cream. Add nuts to ice cream or make ice cream from nuts. Nuts are often an integral part of ice cream toppings or fillings. Here are just a few ideas:\nMake a pine nut sundae\nCassata ice cream\nRose and pistachio ice cream\n\nDairy free banana and walnut ice cream. Make nut cakes for dessert. Cake can make an excellent dessert, especially when slice thinly and with a dollop of cream or ice cream added to one side. Here are some ideas:\nWalnut and pecan torte\nCarrot nut cake\nWalnut chocolate bread cake\nCinnamon and walnut pumpkin cake\nGluten free orange and almond cake\nCherry almond cake\nAlmond crunch chocolate confetti cake\nLime, coconut and almond cake\n\nGerman chocolate cake.",
  "tyn_model":[
    "ice cream",
    "nuts",
    "cream",
    "baklava",
    "walnut",
    "dessert cakes",
    "choco nut pudding",
    "baked apple and almond pudding",
    "black walnut and sweet potato pudding",
    "pudding",
    "cherry nut",
    "middle eastern delight",
    "whipped cream",
    "dessert pies",
    "nut pies",
    "peanut butter tarts",
    "nut creams",
    "dessert pie",
    "pine nut",
    "banana",
    "nut cakes",
    "cake",
    "cream or ice cream",
    "chocolate bread cake",
    "chocolate confetti cake",
    "chocolate cake"
  ],
  "tyn_section":[

  ]
}