{
  "title":"How to Propose to Her Using a Scavenger Hunt Game",
  "url":"https://www.wikihow.com/Propose-to-Her-Using-a-Scavenger-Hunt-Game",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "steps":[
    {
      "headline":"Plan your wedding proposal to her involving your friends.",
      "description":"Make sure that the way that they know about this is discreet, so that the only person who doesn’t know is your beloved. This will ensure that you can can flawlessly execute your plan."
    },
    {
      "headline":"Obtain the necessary materials.",
      "description":"For the scavenger hunt, everybody is required to bring a digital camera, mode of transportation and a formal dress, the last of which is required to pull off the proposal at the end of the hunt."
    },
    {
      "headline":"Keep yourself out of the hunt.",
      "description":"In order for this to work, you will not be part of the team performing tasks from the list. Instead, you will be included as part of the final task that should lead your wife-to-be to your location. Once you arrive, you can catch her off-guard and ask for her hand in marriage."
    },
    {
      "headline":"Start with the end in mind.",
      "description":"Think of the best place where your final task will take place. Places to consider include the beach, a hotel room (it’s going to cost you a bit though, but what the heck, right? ), a restaurant where you guys often eat together or right in front of a cathedral. Just make sure that the place you choose is somewhere meaningful to both of you or her."
    },
    {
      "headline":"Assign your friends to groups.",
      "description":"The idea here is that everybody involved in the scavenger hunt, with the exception of the woman you love, knows that you will propose. A team composed of at least three of your friends and assigning each team tasks will help you carry out your plan. Appoint some of your friends to accompany your soon-to-be-fiancé and ask them to regularly inform you of their whereabouts while the scavenger hunt is ongoing. It doesn’t matter how many teams you have assigned, but the more participants, the merrier the hunt should be, right?"
    },
    {
      "headline":"Give each group a list of the things they should accomplish for the scavenger hunt.",
      "description":"Extend your hunting grounds by making them go to unfamiliar territory. This should buy you more time to decorate the place, set up a table of champagne and strawberries, change into your best clothes or other things you need to do before she gets to her final task. Tell each group they can’t move on to the next task without finishing the task before it; of course, the only group who’ll be doing this strictly is the group she belongs to. Instruct them to take pictures or videos of them doing the task so they have proof. Here is an example of a scavenger hunt list:\nGo to the park and make a stranger tell you you’re beautiful or handsome without telling them you’re playing a game. At least two persons from the group should do this (2/3) to proceed to the next task. From the park, buy two hot dogs and then proceed to the nearest mall with three floors. On the ground level of the mall, find a couple and have them eat the hot dogs. Wait for them to finish eating the hot dogs before proceeding to the second floor of the mall. On the second level of the mall, find a clothing store and have a male member of the group try on a woman’s clothing or a female member try on men’s clothing – it should be whole attire. Ask a saleslady if it looks good on you, if she says “no,” the group may proceed to the next task. If she says yes, change into something else then ask a different saleslady until you get a “no” for an answer. Go to the third level of the mall, look for a girl or a boy wearing pink and have two members in their team take a picture with him or her. Don’t forget to get the photos printed. Go down to the second level of the mall and look for the saleslady whom you got to say “no” and ask her to sign the photos. Go down the ground level and find someone who would be willing to accept the photos and keep them. Outside the mall, all three members of the group should ask a stranger for a quarter. Keep the quarters afterwards as you will need them. At the nearest museum, each of the members needs to ask three strangers for their names and mobile phone numbers. Outside the museum, look for the nearest payphone and use the quarters to call the numbers you gathered. Ask the person on the other end if he/she’s the guy/girl you met in the museum, do 10 push ups in front of the payphone for every fake number you called. Go to the nearest public toilet and change into formal attire. Have your photo taken in front of the public toilet’s entrance, then proceed to the next area."
    },
    {
      "headline":"Tell the other groups to forfeit the game somewhere around item 6 or 7 on their list, but tell them to change into their formal attire.",
      "description":"Make everything appear realistic as if they are really playing the game. However, everybody except the group with your soon-to-be-wife should be at the venue before she gets there. While she’s playing the game, you can ask your friends to help you set up everything you need."
    },
    {
      "headline":"When she’s finally at the venue, walk to her slowly before telling her what you really feel and how much she means to you.",
      "description":"Tell her that compliments like being handsome, smart or funny mean nothing to you if it did not come from her; that hot dogs taste so much better than gourmet meals if you’re eating them together; and that you’d be willing to look like a complete idiot in a woman’s clothing if she asks you to. Most importantly, tell her how much you love her, pull out the ring in your pocket then pop the question “May I have the honor of spending the rest of my life with you?”."
    }
  ],
  "text":" Plan your wedding proposal to her involving your friends. Make sure that the way that they know about this is discreet, so that the only person who doesn’t know is your beloved. This will ensure that you can can flawlessly execute your plan. Obtain the necessary materials. For the scavenger hunt, everybody is required to bring a digital camera, mode of transportation and a formal dress, the last of which is required to pull off the proposal at the end of the hunt. Keep yourself out of the hunt. In order for this to work, you will not be part of the team performing tasks from the list. Instead, you will be included as part of the final task that should lead your wife-to-be to your location. Once you arrive, you can catch her off-guard and ask for her hand in marriage. Start with the end in mind. Think of the best place where your final task will take place. Places to consider include the beach, a hotel room (it’s going to cost you a bit though, but what the heck, right? ), a restaurant where you guys often eat together or right in front of a cathedral. Just make sure that the place you choose is somewhere meaningful to both of you or her. Assign your friends to groups. The idea here is that everybody involved in the scavenger hunt, with the exception of the woman you love, knows that you will propose. A team composed of at least three of your friends and assigning each team tasks will help you carry out your plan. Appoint some of your friends to accompany your soon-to-be-fiancé and ask them to regularly inform you of their whereabouts while the scavenger hunt is ongoing. It doesn’t matter how many teams you have assigned, but the more participants, the merrier the hunt should be, right? Give each group a list of the things they should accomplish for the scavenger hunt. Extend your hunting grounds by making them go to unfamiliar territory. This should buy you more time to decorate the place, set up a table of champagne and strawberries, change into your best clothes or other things you need to do before she gets to her final task. Tell each group they can’t move on to the next task without finishing the task before it; of course, the only group who’ll be doing this strictly is the group she belongs to. Instruct them to take pictures or videos of them doing the task so they have proof. Here is an example of a scavenger hunt list:\nGo to the park and make a stranger tell you you’re beautiful or handsome without telling them you’re playing a game. At least two persons from the group should do this (2/3) to proceed to the next task. From the park, buy two hot dogs and then proceed to the nearest mall with three floors. On the ground level of the mall, find a couple and have them eat the hot dogs. Wait for them to finish eating the hot dogs before proceeding to the second floor of the mall. On the second level of the mall, find a clothing store and have a male member of the group try on a woman’s clothing or a female member try on men’s clothing – it should be whole attire. Ask a saleslady if it looks good on you, if she says “no,” the group may proceed to the next task. If she says yes, change into something else then ask a different saleslady until you get a “no” for an answer. Go to the third level of the mall, look for a girl or a boy wearing pink and have two members in their team take a picture with him or her. Don’t forget to get the photos printed. Go down to the second level of the mall and look for the saleslady whom you got to say “no” and ask her to sign the photos. Go down the ground level and find someone who would be willing to accept the photos and keep them. Outside the mall, all three members of the group should ask a stranger for a quarter. Keep the quarters afterwards as you will need them. At the nearest museum, each of the members needs to ask three strangers for their names and mobile phone numbers. Outside the museum, look for the nearest payphone and use the quarters to call the numbers you gathered. Ask the person on the other end if he/she’s the guy/girl you met in the museum, do 10 push ups in front of the payphone for every fake number you called. Go to the nearest public toilet and change into formal attire. Have your photo taken in front of the public toilet’s entrance, then proceed to the next area. Tell the other groups to forfeit the game somewhere around item 6 or 7 on their list, but tell them to change into their formal attire. Make everything appear realistic as if they are really playing the game. However, everybody except the group with your soon-to-be-wife should be at the venue before she gets there. While she’s playing the game, you can ask your friends to help you set up everything you need. When she’s finally at the venue, walk to her slowly before telling her what you really feel and how much she means to you. Tell her that compliments like being handsome, smart or funny mean nothing to you if it did not come from her; that hot dogs taste so much better than gourmet meals if you’re eating them together; and that you’d be willing to look like a complete idiot in a woman’s clothing if she asks you to. Most importantly, tell her how much you love her, pull out the ring in your pocket then pop the question “May I have the honor of spending the rest of my life with you?”.",
  "tyn_model":[
    "hot dogs",
    "“no",
    "quarters",
    "digital camera",
    "champagne",
    "strawberries",
    "dogs",
    "– it",
    "” the",
    "” for",
    "” and",
    "mobile phone numbers",
    "“may",
    "”."
  ],
  "tyn_section":[

  ]
}