{
  "title":"How to Make Vegan Chocolate Sauce Pudding",
  "url":"https://www.wikihow.com/Make-Vegan-Chocolate-Sauce-Pudding",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan",
    "Vegan Baking"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 180ºC/350ºF.",
      "description":"Prepare the pudding dish by greasing or lining with baking (parchment) paper."
    },
    {
      "headline":"Sift the flour with the baking powder, salt, sugar and cocoa into a mixing bowl.",
      "description":""
    },
    {
      "headline":"Add the margarine or oil, soy (or other) milk and vanilla.",
      "description":"Combine thoroughly."
    },
    {
      "headline":"Pour the pudding batter into the prepared pudding dish.",
      "description":""
    },
    {
      "headline":"Make the sauce.",
      "description":"Mix the brown sugar and cocoa together. Sprinkle this mix over the pudding top. Carefully pour over the 2 cups of boiling water."
    },
    {
      "headline":"Place the pudding in the oven.",
      "description":"Bake for 40 minutes."
    },
    {
      "headline":"Remove from the heat.",
      "description":"Serve immediately. The pudding is self-saucing but some soy cream or vegan ice cream make nice additions to it."
    }
  ],
  "text":" Preheat the oven to 180ºC/350ºF. Prepare the pudding dish by greasing or lining with baking (parchment) paper. Sift the flour with the baking powder, salt, sugar and cocoa into a mixing bowl.  Add the margarine or oil, soy (or other) milk and vanilla. Combine thoroughly. Pour the pudding batter into the prepared pudding dish.  Make the sauce. Mix the brown sugar and cocoa together. Sprinkle this mix over the pudding top. Carefully pour over the 2 cups of boiling water. Place the pudding in the oven. Bake for 40 minutes. Remove from the heat. Serve immediately. The pudding is self-saucing but some soy cream or vegan ice cream make nice additions to it.",
  "tyn_model":[
    "oven",
    "pudding dish",
    "cocoa",
    "baking (parchment) paper",
    "flour",
    "baking powder",
    "salt",
    "sugar",
    "mixing bowl",
    "margarine or oil",
    "soy (or other) milk",
    "vanilla",
    "brown sugar",
    "water",
    "vegan ice cream"
  ],
  "tyn_section":[

  ]
}