{
  "title":"How to Make an Apricot and Walnut Cake (Vegan)",
  "url":"https://www.wikihow.com/Make-an-Apricot-and-Walnut-Cake-(Vegan)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan",
    "Vegan Baking"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 390ºF (200ºC) and line or grease your cake pan.",
      "description":""
    },
    {
      "headline":"Mix the flour, mashed potato flakes, sugar and baking powder in the mixing bowl.",
      "description":""
    },
    {
      "headline":"Add the ground almonds, coconut milk and pureed apple to the dry ingredients.",
      "description":""
    },
    {
      "headline":"Mix all the ingredients together to combine them well until they form a smooth batter.",
      "description":""
    },
    {
      "headline":"Add the apricots and walnuts and mix through quickly.",
      "description":""
    },
    {
      "headline":"Pour the batter into the prepared cake pan.",
      "description":""
    },
    {
      "headline":"Place the cake in the preheated oven and bake it for 1 hour or until a toothpick inserted into the cake comes out clean.",
      "description":""
    },
    {
      "headline":"Remove the cake from the oven when it's done and allow it to cool on a wire cooling rack.",
      "description":""
    },
    {
      "headline":"Unmold the cake and place it on your serving dish when it's completely cooled to room temperature.",
      "description":""
    },
    {
      "headline":"Cut the cake into portions and serve.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 390ºF (200ºC) and line or grease your cake pan.  Mix the flour, mashed potato flakes, sugar and baking powder in the mixing bowl.  Add the ground almonds, coconut milk and pureed apple to the dry ingredients.  Mix all the ingredients together to combine them well until they form a smooth batter.  Add the apricots and walnuts and mix through quickly.  Pour the batter into the prepared cake pan.  Place the cake in the preheated oven and bake it for 1 hour or until a toothpick inserted into the cake comes out clean.  Remove the cake from the oven when it's done and allow it to cool on a wire cooling rack.  Unmold the cake and place it on your serving dish when it's completely cooled to room temperature.  Cut the cake into portions and serve. ",
  "tyn_model":[
    "oven",
    "cake pan",
    "cake",
    "flour",
    "mashed potato flakes",
    "sugar",
    "baking powder",
    "mixing bowl",
    "almonds",
    "coconut milk",
    "pureed apple",
    "apricots",
    "walnuts"
  ],
  "tyn_section":[

  ]
}