{
  "title":"How to Cook a Whole Chicken",
  "url":"https://www.wikihow.com/Cook-a-Whole-Chicken",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "methods":[
    {
      "name":"Making Slow Cooker Whole Chicken",
      "steps":[
        {
          "headline":"Rinse and dry the chicken.",
          "description":"Wash the chicken off with cool water, and pat dry with a paper towel. Also, take the giblets out of the cavity. Sprinkle the chicken with salt and pepper. Set the chicken in a slow cooker."
        },
        {
          "headline":"Add the onions, carrots, celery, thyme, and lemon juice to the pot.",
          "description":"You can scatter the vegetables over the top of the chicken. Smash the garlic cloves with the side of your knife. Add the garlic to the pot, too. To smash the garlic, place the garlic on a flat surface. Place a large knife on top of it, flat side down. Smash the other side of the the knife with your hand."
        },
        {
          "headline":"Set the cooker to high.",
          "description":"Leave the chicken alone for 6 hours."
        },
        {
          "headline":"Take the chicken out.",
          "description":"Set it on a plate. Pour the juices into a saucepan. Skim off as much fat as possible from the top. To skim off the fat, use a spoon to pull the top layer of fat off the top of the juice. Discard the juice."
        },
        {
          "headline":"Mix the cornstarch with 2 tablespoons (29.6 ml) of water.",
          "description":"Whisk it together to remove any lumps."
        },
        {
          "headline":"Pour into the saucepan with the juices.",
          "description":"Whisk it together."
        },
        {
          "headline":"Boil the juices.",
          "description":"Boil the saucepan over high heat, stirring constantly. When it starts to thicken, cook it another 5 minutes."
        },
        {
          "headline":"Serve in pieces.",
          "description":"Cut up the chicken, and use the thickened pan juices as a gravy."
        }
      ]
    },
    {
      "name":"Chunky Chicken Soup",
      "steps":[
        {
          "headline":"Peel and chop the onion.",
          "description":"Slice through the middle of the onion. Peel off the outer layer of skin. Place the half onion face down on the chopping board. Slice it one way. Turn the onion, and slice it the other way, resulting in chopped onion."
        },
        {
          "headline":"Wash and slice the celery.",
          "description":"Once they are clean, line up the celery stalks. Chop along the stalks."
        },
        {
          "headline":"Peel and chop the carrots.",
          "description":"Use a vegetable peeler to peel the carrots. Chop the carrots into chunks."
        },
        {
          "headline":"Peel and chop the parsnips.",
          "description":"Take off the peel with a vegetable peeler. Chop up the parsnips."
        },
        {
          "headline":"Add all the ingredients to the pot, holding the pepper for later.",
          "description":"Using a large soup pot, put in the chicken, chopped vegetables, chicken broth, and salt."
        },
        {
          "headline":"Bring it up to a boil.",
          "description":"Once it's boiling, cover it, and reduce the heat to medium-low. You want it to simmer for about an hour and a half. The chicken should be falling off the bone."
        },
        {
          "headline":"Remove the chicken from the pot.",
          "description":"On a large platter, pull the meat off the bones. Leave the skin behind. Shred the chicken, and then add it back to the pot."
        },
        {
          "headline":"Serve in bowls.",
          "description":"Add the pepper to the individual bowls."
        }
      ]
    },
    {
      "name":"Basic Roast Chicken",
      "steps":[
        {
          "headline":"Heat up the oven to 425 °F (218 °C).",
          "description":"Take the chicken giblets out of the inside of the chicken."
        },
        {
          "headline":"Rinse and dry the chicken.",
          "description":"Wash the chicken in cool water inside and out. Use a paper towel to dry off the chicken. Sprinkle the whole chicken with salt and pepper."
        },
        {
          "headline":"Slice the onion.",
          "description":"Slice the onion in half. Remove the outer skin of the onion. Slice the onion into thick slices."
        },
        {
          "headline":"Peel and chop the carrots.",
          "description":"Peel the carrots with a vegetable peeler. Chop them into large chunks."
        },
        {
          "headline":"Remove the tops of the fennel bulb.",
          "description":"Cut the fennel bulb into large chunks."
        },
        {
          "headline":"Add the thyme, garlic, and lemon to the inside of the chicken.",
          "description":"Place the chicken in a roasting pan. Use a string to keep the legs together. Push the tips of the wings under the chicken."
        },
        {
          "headline":"Rub the outside of the chicken with butter.",
          "description":"Add more salt and pepper."
        },
        {
          "headline":"Throw the rest of the vegetables into the pan.",
          "description":"Add salt and pepper. Also add in the olive oil and and the rest of the thyme. Use a spoon to mix it up."
        },
        {
          "headline":"Place the chicken in the oven.",
          "description":"Let it cook for about an hour and a half. The juices from the chicken should be clear when done."
        },
        {
          "headline":"Let the chicken sit.",
          "description":"After you remove the chicken and vegetables to a platter, cover it for 20 minutes before slicing."
        }
      ]
    },
    {
      "name":"Preparing Massaman Curry Roast Chicken",
      "steps":[
        {
          "headline":"Place the chicken in a roasting pan.",
          "description":"Take the chicken out of the package, and put it in a large enough roasting pan."
        },
        {
          "headline":"Cut half the ginger into pieces.",
          "description":"Place it inside the chicken, along with the lemongrass and two quarters of the lime. To keep the ingredients inside, use kitchen twine to tie the legs together."
        },
        {
          "headline":"Stir together the oil and 1 teaspoon of the curry paste.",
          "description":"Massage the mixture into the chicken with your hands. Sprinkle the chicken with salt and pepper. Cover the pan with foil."
        },
        {
          "headline":"Heat the oven to 390 °F (199 °C).",
          "description":"Set the chicken in the oven for 35 minutes. Remove the foil."
        },
        {
          "headline":"Put in the potatoes.",
          "description":"Stir them up in the pan juices. Place the pan back in the oven to roast for 40 more minutes."
        },
        {
          "headline":"Remove the chicken from the oven.",
          "description":"Take the chicken out of the pan. Place it on a serving dish. Put the baking pan on the stove over medium heat."
        },
        {
          "headline":"Add in the ginger and curry paste.",
          "description":"Peel the ginger, and then grate it into the dish. Add the curry paste. Let it cook on the stove for 2 minutes."
        },
        {
          "headline":"Pour in the coconut milk and sugar.",
          "description":"Bring the sauce to a boil, letting it go for 5 minutes."
        },
        {
          "headline":"Add the beans.",
          "description":"Cook them for 4 minutes."
        },
        {
          "headline":"Pour in the fish sauce, lime, and juices from the chicken plate.",
          "description":"Add in the fish sauce. Juice the other half of the lime, and pour in any juices from the serving plate."
        },
        {
          "headline":"Serve over rice.",
          "description":"Add peanuts on top for extra flavor."
        }
      ]
    }
  ],
  "text":" Making Slow Cooker Whole Chicken Rinse and dry the chicken. Wash the chicken off with cool water, and pat dry with a paper towel. Also, take the giblets out of the cavity. Sprinkle the chicken with salt and pepper. Set the chicken in a slow cooker. Add the onions, carrots, celery, thyme, and lemon juice to the pot. You can scatter the vegetables over the top of the chicken. Smash the garlic cloves with the side of your knife. Add the garlic to the pot, too. To smash the garlic, place the garlic on a flat surface. Place a large knife on top of it, flat side down. Smash the other side of the the knife with your hand. Set the cooker to high. Leave the chicken alone for 6 hours. Take the chicken out. Set it on a plate. Pour the juices into a saucepan. Skim off as much fat as possible from the top. To skim off the fat, use a spoon to pull the top layer of fat off the top of the juice. Discard the juice. Mix the cornstarch with 2 tablespoons (29.6 ml) of water. Whisk it together to remove any lumps. Pour into the saucepan with the juices. Whisk it together. Boil the juices. Boil the saucepan over high heat, stirring constantly. When it starts to thicken, cook it another 5 minutes. Serve in pieces. Cut up the chicken, and use the thickened pan juices as a gravy. Chunky Chicken Soup Peel and chop the onion. Slice through the middle of the onion. Peel off the outer layer of skin. Place the half onion face down on the chopping board. Slice it one way. Turn the onion, and slice it the other way, resulting in chopped onion. Wash and slice the celery. Once they are clean, line up the celery stalks. Chop along the stalks. Peel and chop the carrots. Use a vegetable peeler to peel the carrots. Chop the carrots into chunks. Peel and chop the parsnips. Take off the peel with a vegetable peeler. Chop up the parsnips. Add all the ingredients to the pot, holding the pepper for later. Using a large soup pot, put in the chicken, chopped vegetables, chicken broth, and salt. Bring it up to a boil. Once it's boiling, cover it, and reduce the heat to medium-low. You want it to simmer for about an hour and a half. The chicken should be falling off the bone. Remove the chicken from the pot. On a large platter, pull the meat off the bones. Leave the skin behind. Shred the chicken, and then add it back to the pot. Serve in bowls. Add the pepper to the individual bowls. Basic Roast Chicken Heat up the oven to 425 °F (218 °C). Take the chicken giblets out of the inside of the chicken. Rinse and dry the chicken. Wash the chicken in cool water inside and out. Use a paper towel to dry off the chicken. Sprinkle the whole chicken with salt and pepper. Slice the onion. Slice the onion in half. Remove the outer skin of the onion. Slice the onion into thick slices. Peel and chop the carrots. Peel the carrots with a vegetable peeler. Chop them into large chunks. Remove the tops of the fennel bulb. Cut the fennel bulb into large chunks. Add the thyme, garlic, and lemon to the inside of the chicken. Place the chicken in a roasting pan. Use a string to keep the legs together. Push the tips of the wings under the chicken. Rub the outside of the chicken with butter. Add more salt and pepper. Throw the rest of the vegetables into the pan. Add salt and pepper. Also add in the olive oil and and the rest of the thyme. Use a spoon to mix it up. Place the chicken in the oven. Let it cook for about an hour and a half. The juices from the chicken should be clear when done. Let the chicken sit. After you remove the chicken and vegetables to a platter, cover it for 20 minutes before slicing. Preparing Massaman Curry Roast Chicken Place the chicken in a roasting pan. Take the chicken out of the package, and put it in a large enough roasting pan. Cut half the ginger into pieces. Place it inside the chicken, along with the lemongrass and two quarters of the lime. To keep the ingredients inside, use kitchen twine to tie the legs together. Stir together the oil and 1 teaspoon of the curry paste. Massage the mixture into the chicken with your hands. Sprinkle the chicken with salt and pepper. Cover the pan with foil. Heat the oven to 390 °F (199 °C). Set the chicken in the oven for 35 minutes. Remove the foil. Put in the potatoes. Stir them up in the pan juices. Place the pan back in the oven to roast for 40 more minutes. Remove the chicken from the oven. Take the chicken out of the pan. Place it on a serving dish. Put the baking pan on the stove over medium heat. Add in the ginger and curry paste. Peel the ginger, and then grate it into the dish. Add the curry paste. Let it cook on the stove for 2 minutes. Pour in the coconut milk and sugar. Bring the sauce to a boil, letting it go for 5 minutes. Add the beans. Cook them for 4 minutes. Pour in the fish sauce, lime, and juices from the chicken plate. Add in the fish sauce. Juice the other half of the lime, and pour in any juices from the serving plate. Serve over rice. Add peanuts on top for extra flavor.",
  "tyn_model":[
    "chicken",
    "onion",
    "carrots",
    "oven",
    "salt and pepper",
    "garlic",
    "pot",
    "vegetables",
    "water",
    "celery",
    "thyme",
    "saucepan",
    "vegetable peeler",
    "roasting pan",
    "ginger",
    "lime",
    "curry paste",
    "paper towel",
    "lemon",
    "knife",
    "spoon",
    "pepper",
    "foil",
    "fish sauce",
    "making slow cooker whole",
    "slow cooker",
    "onions",
    "large knife",
    "cooker",
    "plate",
    "cornstarch",
    "chopping board",
    "parsnips",
    "soup pot",
    "chicken broth",
    "salt",
    "chicken giblets",
    "butter",
    "olive oil",
    "curry roast chicken",
    "lemongrass",
    "kitchen twine",
    "oil",
    "potatoes",
    "serving dish",
    "baking pan",
    "coconut milk",
    "sugar",
    "beans",
    "chicken plate",
    "serving plate",
    "rice",
    "peanuts"
  ],
  "tyn_section":[

  ]
}