{
  "title":"How to Choose Wire for Jewelry",
  "url":"https://www.wikihow.com/Choose-Wire-for-Jewelry",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Selecting the Gauge",
      "steps":[
        {
          "headline":"Craft delicate jewelry with 30-gauge or 28-gauge (0.25 to 0.32 mm) wire.",
          "description":"Gauge refers to the thickness of a wire, and the higher the number, the thinner the wire. 30 and 28-gauge wires are very thin, so they are great for making rings, stringing seed beads, and making small chains. You can even knit and crochet with this type of wire. Use jewelry making tools with very fine tips if you select a wire in one of these gauges."
        },
        {
          "headline":"String small beads with 26-gauge (0.40 mm) wire.",
          "description":"This is a thin wire, so it works well if you’re stringing seed-beads or other small beads. You can also use this wire to wrap small beads and stones or to create small headpins. You may also knit and crochet with this wire. Select jewelry making tools with fine tips to work with this type of wire."
        },
        {
          "headline":"Go with 24-gauge (0.51 mm) wire for most beading projects.",
          "description":"This gauge fits through most beads and it isn't too bulky, so it works well for stringing beads, such as for a necklace or bracelet. You can also use it to wire-wrap small beads, crystals, stones, and pearls, or to add intricate details to your jewelry, such as coils. Regular jewelry-making tools are fine for working with this type of wire. Wire in this gauge has a tendency to get kinks, so you may want to buy a wire-straightening tool."
        },
        {
          "headline":"Create stone settings, earrings, and pendants with 22 to 21-gauge (0.64 to 0.75 mm) wire.",
          "description":"This is a medium-thin gauge wire, so it works well for wire-wrapping more delicate beads and crystals. Try using this type of wire if you want to wire wrap something small and delicate, such as a small crystal or stone. Use regular jewelry-making tools with this wire.Tip: Always check to see if the wire you want to use will fit through a bead before you start working with it. Insert the end of the wire through each of the beads you’ll be stringing. If the wire won’t fit through one of them, choose a smaller gauge."
        },
        {
          "headline":"Choose 20-gauge (0.81 mm) wire for general jewelry-making needs.",
          "description":"This is a medium-sized wire that is easier to work with than thicker gauges, but it holds its structure well. You can use it to make ear wires, small wire clasps, and headpins. It’s also good for wire-wrapping beads and stones. However, since this is a thicker wire, it’s unlikely to fit through most beads. Use regular jewelry-making tools when working with this wire."
        },
        {
          "headline":"Make clasps, jump rings, and pins with 18-gauge (1 mm) wire.",
          "description":"This medium-thick gauge wire can also be used for thicker chains or for stringing large glass beads. It holds its structure well, so you can also use it to create structured details on jewelry and to wire-wrap larger stones and beads. Use regular jewelry-making tools when working with this wire."
        },
        {
          "headline":"Sculpt jewelry with 16 to 14-gauge (1.3 to 1.6 mm) wire.",
          "description":"This is a thick, heavy wire, so it holds its shape very well. Go with this wire if you want to create structured pieces, such as bangles and necklaces. This wire may also work well for wire-wrapping larger stones and beads. Use heavy-duty tools when working with wires in these gauges."
        }
      ]
    },
    {
      "name":"Choosing a Wire Type",
      "steps":[
        {
          "headline":"Opt for round wire for most jewelry-making projects.",
          "description":"You can use round wire to do just about anything in jewelry-making. You can string beads with it, wire-wrap stones and beads, create ear-wires, or add accents to your jewelry. This is also a great choice if you are new to jewelry-making since round wire is often easier to manipulate."
        },
        {
          "headline":"Try half-round wire for ring shanks and binding bundles of wire.",
          "description":"Half round wire is flat on one side and round on the other side, so it’s great for projects that would benefit from a flat side on the wire, such as bundling and creating rings. Don’t use this wire if you need to string beads with it as it may not fit through some beads. Keep this wire straight as you work with it. Twisting it will turn the flat side out, which may look messy or unappealing."
        },
        {
          "headline":"Choose square-wire to create a more modern-looking piece of jewelry.",
          "description":"You can shape square wire into shapes to use as earrings, pendants, and bangles. You can also twist square wire to create subtle accents in a structured piece. This is an easy way to create a modern-looking piece of jewelry. Try making a pair of square-shaped earrings or a square-shaped bangle with square wire.Tip: Note that wire-wrapping a bead or stone with square wire may be more challenging, so you may want to practice with round wire first."
        },
        {
          "headline":"Select twisted wire for an intricate or antique look.",
          "description":"You can purchase wire that consists of 2 or more twisted or braided strands. This type of wire works well for wire-wrapping stones and beads. It’s also great for creating accents on your jewelry. If you want to string beads with this type of wire, check to ensure that the beads will fir through it first as twisted wire tends to be thicker. Tiger tail wire is a very common twisted wire in jewelry making. It is a braided stainless steel wire that is coated in nylon. It is very strong and comes in a number of colors. It cannot be used for wire wrapping, but it can be used to give the look of an \"invisible\" setting, where the beads look like they are floating."
        },
        {
          "headline":"Choose memory wire for making bangles and structured loops.",
          "description":"Memory wire is made from carbon steel or stainless steel. It is great for bangles or other loops because it returns to the loop it was made into in the factory. However, it won’t work for any projects that require wrapping. This type of wire is best for creating accents and forming structured shapes for your jewelry. You can find memory wire in round and flat types and in many different finishes, such as silver, gold, yellow gold, and brass."
        },
        {
          "headline":"Go with French wire to secure beads and add accents.",
          "description":"French wire is a coiled wire that comes in copper, gold-plated, silver-plated, sterling silver, and vermeil. The smaller the coil, the more precious the metal, and the more expensive it is. However, you often only need a small amount to accent your jewelry with French wire. Do not pull on the wire as this will undo the coil and ruin the wire."
        }
      ]
    },
    {
      "name":"Picking a Wire Finish",
      "steps":[
        {
          "headline":"Choose color-coated copper, aluminum, or niobium for a budget-friendly option.",
          "description":"These types of wire are much less expensive than other types and they come in many different finishes. You can purchase copper, aluminum, or niobium wire that is coated with a colored enamel. You can find wire in every color from gold to red to black to orange! The color won’t fade over time, either."
        },
        {
          "headline":"Try gold or sterling silver wire for creating long-lasting, classic jewelry.",
          "description":"Sterling silver and gold wires are more expensive than color-coated wires, but they may hold up better and allow you to create a more luxurious looking piece of jewelry. This is also a good option for anyone who has a sensitivity to other types of metals. Gold-filled wire has 100 times more gold in it than gold-plated wire. This is an expensive wire, so reserve it for special projects. Warning: You may want to stay away from jewelry wire containing nickel. It often causes an allergic reaction. The average colored craft wire is nickel-plated, so be aware of this before choosing it."
        },
        {
          "headline":"Opt for gold or silver-plated wire to get the look of a luxurious metal for less.",
          "description":"Gold and silver-plated wires are great for creating a fancy look. They are less expensive than gold and silver-filled wires, but less expensive than color-coated wires. Keep in mind that these wires are still filled with copper or aluminum on the inside, so they can be easily ruined by rough handling or abrasive tools."
        },
        {
          "headline":"Make your jewelry with uncoated copper wire to achieve a patina.",
          "description":"The patina is the natural color change that takes place in the metal over time, such as how a penny changes from bright and shiny to matte and brown over time. If you like the look of copper as it ages, then making your item from uncoated copper wire may be a good choice. The copper wire will start out shiny and gradually change as it ages. If you want to keep the wire shiny, choose a copper color-coated wire instead.Tip: To choose a wire finish, hold the wire next to the beads, stones, crystals, or other items you want to incorporate into the piece to see what looks best."
        }
      ]
    }
  ],
  "text":" Selecting the Gauge Craft delicate jewelry with 30-gauge or 28-gauge (0.25 to 0.32 mm) wire. Gauge refers to the thickness of a wire, and the higher the number, the thinner the wire. 30 and 28-gauge wires are very thin, so they are great for making rings, stringing seed beads, and making small chains. You can even knit and crochet with this type of wire. Use jewelry making tools with very fine tips if you select a wire in one of these gauges. String small beads with 26-gauge (0.40 mm) wire. This is a thin wire, so it works well if you’re stringing seed-beads or other small beads. You can also use this wire to wrap small beads and stones or to create small headpins. You may also knit and crochet with this wire. Select jewelry making tools with fine tips to work with this type of wire. Go with 24-gauge (0.51 mm) wire for most beading projects. This gauge fits through most beads and it isn't too bulky, so it works well for stringing beads, such as for a necklace or bracelet. You can also use it to wire-wrap small beads, crystals, stones, and pearls, or to add intricate details to your jewelry, such as coils. Regular jewelry-making tools are fine for working with this type of wire. Wire in this gauge has a tendency to get kinks, so you may want to buy a wire-straightening tool. Create stone settings, earrings, and pendants with 22 to 21-gauge (0.64 to 0.75 mm) wire. This is a medium-thin gauge wire, so it works well for wire-wrapping more delicate beads and crystals. Try using this type of wire if you want to wire wrap something small and delicate, such as a small crystal or stone. Use regular jewelry-making tools with this wire.Tip: Always check to see if the wire you want to use will fit through a bead before you start working with it. Insert the end of the wire through each of the beads you’ll be stringing. If the wire won’t fit through one of them, choose a smaller gauge. Choose 20-gauge (0.81 mm) wire for general jewelry-making needs. This is a medium-sized wire that is easier to work with than thicker gauges, but it holds its structure well. You can use it to make ear wires, small wire clasps, and headpins. It’s also good for wire-wrapping beads and stones. However, since this is a thicker wire, it’s unlikely to fit through most beads. Use regular jewelry-making tools when working with this wire. Make clasps, jump rings, and pins with 18-gauge (1 mm) wire. This medium-thick gauge wire can also be used for thicker chains or for stringing large glass beads. It holds its structure well, so you can also use it to create structured details on jewelry and to wire-wrap larger stones and beads. Use regular jewelry-making tools when working with this wire. Sculpt jewelry with 16 to 14-gauge (1.3 to 1.6 mm) wire. This is a thick, heavy wire, so it holds its shape very well. Go with this wire if you want to create structured pieces, such as bangles and necklaces. This wire may also work well for wire-wrapping larger stones and beads. Use heavy-duty tools when working with wires in these gauges. Choosing a Wire Type Opt for round wire for most jewelry-making projects. You can use round wire to do just about anything in jewelry-making. You can string beads with it, wire-wrap stones and beads, create ear-wires, or add accents to your jewelry. This is also a great choice if you are new to jewelry-making since round wire is often easier to manipulate. Try half-round wire for ring shanks and binding bundles of wire. Half round wire is flat on one side and round on the other side, so it’s great for projects that would benefit from a flat side on the wire, such as bundling and creating rings. Don’t use this wire if you need to string beads with it as it may not fit through some beads. Keep this wire straight as you work with it. Twisting it will turn the flat side out, which may look messy or unappealing. Choose square-wire to create a more modern-looking piece of jewelry. You can shape square wire into shapes to use as earrings, pendants, and bangles. You can also twist square wire to create subtle accents in a structured piece. This is an easy way to create a modern-looking piece of jewelry. Try making a pair of square-shaped earrings or a square-shaped bangle with square wire.Tip: Note that wire-wrapping a bead or stone with square wire may be more challenging, so you may want to practice with round wire first. Select twisted wire for an intricate or antique look. You can purchase wire that consists of 2 or more twisted or braided strands. This type of wire works well for wire-wrapping stones and beads. It’s also great for creating accents on your jewelry. If you want to string beads with this type of wire, check to ensure that the beads will fir through it first as twisted wire tends to be thicker. Tiger tail wire is a very common twisted wire in jewelry making. It is a braided stainless steel wire that is coated in nylon. It is very strong and comes in a number of colors. It cannot be used for wire wrapping, but it can be used to give the look of an \"invisible\" setting, where the beads look like they are floating. Choose memory wire for making bangles and structured loops. Memory wire is made from carbon steel or stainless steel. It is great for bangles or other loops because it returns to the loop it was made into in the factory. However, it won’t work for any projects that require wrapping. This type of wire is best for creating accents and forming structured shapes for your jewelry. You can find memory wire in round and flat types and in many different finishes, such as silver, gold, yellow gold, and brass. Go with French wire to secure beads and add accents. French wire is a coiled wire that comes in copper, gold-plated, silver-plated, sterling silver, and vermeil. The smaller the coil, the more precious the metal, and the more expensive it is. However, you often only need a small amount to accent your jewelry with French wire. Do not pull on the wire as this will undo the coil and ruin the wire. Picking a Wire Finish Choose color-coated copper, aluminum, or niobium for a budget-friendly option. These types of wire are much less expensive than other types and they come in many different finishes. You can purchase copper, aluminum, or niobium wire that is coated with a colored enamel. You can find wire in every color from gold to red to black to orange! The color won’t fade over time, either. Try gold or sterling silver wire for creating long-lasting, classic jewelry. Sterling silver and gold wires are more expensive than color-coated wires, but they may hold up better and allow you to create a more luxurious looking piece of jewelry. This is also a good option for anyone who has a sensitivity to other types of metals. Gold-filled wire has 100 times more gold in it than gold-plated wire. This is an expensive wire, so reserve it for special projects. Warning: You may want to stay away from jewelry wire containing nickel. It often causes an allergic reaction. The average colored craft wire is nickel-plated, so be aware of this before choosing it. Opt for gold or silver-plated wire to get the look of a luxurious metal for less. Gold and silver-plated wires are great for creating a fancy look. They are less expensive than gold and silver-filled wires, but less expensive than color-coated wires. Keep in mind that these wires are still filled with copper or aluminum on the inside, so they can be easily ruined by rough handling or abrasive tools. Make your jewelry with uncoated copper wire to achieve a patina. The patina is the natural color change that takes place in the metal over time, such as how a penny changes from bright and shiny to matte and brown over time. If you like the look of copper as it ages, then making your item from uncoated copper wire may be a good choice. The copper wire will start out shiny and gradually change as it ages. If you want to keep the wire shiny, choose a copper color-coated wire instead.Tip: To choose a wire finish, hold the wire next to the beads, stones, crystals, or other items you want to incorporate into the piece to see what looks best.",
  "tyn_model":[
    "wire",
    "wires",
    "jewelry",
    "jewelry-making tools",
    "beads",
    "memory wire",
    "french wire",
    "copper wire",
    "stones",
    "twisted wire",
    "jewelry making tools",
    "jewelry making",
    "wire-straightening tool",
    "pins",
    "square wire",
    "tiger tail wire",
    "stainless steel wire",
    "jewelry wire"
  ],
  "tyn_section":[

  ]
}