{
  "title":"How to Buy Dessert Wine",
  "url":"https://www.wikihow.com/Buy-Dessert-Wine",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Wine"
  ],
  "methods":[
    {
      "name":"Choosing a Wine",
      "steps":[
        {
          "headline":"Familiarize yourself with the different types of dessert wine.",
          "description":"There are many different types of dessert wines. They vary based on the grapes used and how they are prepared. The dessert wines can be divided up as follows:\nNoble rot wines: This type of wine is made from rotten grapes. The grapes are covered in a mold called Botrytis cinerea, commonly known as noble rot. The mold removes water content from the grapes, concentrating the sugar. Sauternes (Bordeaux, France), Riesling Auslese (\"late picked\") and beerenauslese (Germany), and trockenbeerenauslese are well-known noble rot dessert wines. Ice wines: Grapes are left on the vine late into the season until they freeze. Freezing the grapes dehydrates the grapes, resulting in a very sweet wine. Ice wines are rare and expensive. Raisin wines: Similar to ice and noble rot wines, winemakers produce raisin wines by letting grapes air dry on the vine to reduce the grapes' water content. Check the label for “vin de paille” or “pasitto”\nFortified wines: These wines are made by adding alcohol during or after the fermentation process. Stopping fermentation allows the wine to retain more of its natural sugars while the addition of spirits increases the alcohol content. Well known fortified wines include Sherry, Port, and Madeira. Late harvest wines: Grapes are left on the vine until they get very ripe and sweet. Common late harvest dessert wines include Riesling, Muscat, Pinot Gris, and Gewürztraminer."
        },
        {
          "headline":"Choose a bottle size.",
          "description":"Most dessert wine is sold in smaller 375 ml (12.7 oz.) bottles because dessert wines are so much richer and flavor intense than standard wines. A little bit goes a long way. Larger sizes are available at greater cost; however, a smaller selection of wines is likely to be available if you choose to purchase a larger size. When choosing the size consider the following:\nTake into account that the standard pour when you serve dessert wine is 2 oz. (59.1 ml). Estimate how much wine you will need based on the number of people you will be serving."
        },
        {
          "headline":"Find a good place to purchase dessert wine.",
          "description":"Wine can be sourced from many places but not all wine retailers will carry quality dessert wines or a large variety of such wines. Check out the local supermarket, liquor store and chain wine stores but don't be afraid of looking at the more boutique or specialized wine selling retailers to broaden the possibilities of finding dessert wines. For example, you might find a local wine merchant who has taken a particular interest in specializing in dessert wines. Other more specialized places can include wine clubs and their catalogs, direct buying from a wine producer or buying online."
        },
        {
          "headline":"Read the label.",
          "description":"You can recognize a dessert wine by looking for key words on the label. The phrases are often in their original language so it is helpful to know what you are looking for. Here are some common words:\n\"Vin de paille\" is French for \"straw wine\" made with grapes that have been dried while still on the vine. \"Passito\" is an Italian wine made from dried raisins. “Vendage Tardive,” \"auslese,\" and “Spätlese” are late harvest wines. \"Demi-Sec\" means \"off dry\" in French. \"Amabile\" means \"slightly sweet\" in Italian. \"Semi Secco\" means \"off dry\" in Italian. \"Doux\" means \"sweet\" in French. \"Dolce\" means sweet in Italian. \"Dulce\" means \"sweet\" in Spanish. \"Moelleux\" is \"sweet\" for some French wines."
        },
        {
          "headline":"Work with a wine merchant.",
          "description":"Visit a liquor store that has a large wine selection and a knowledgeable staff. Tell the staff how you plan to serve the wine, your price range, and any special flavors you may be looking for in a dessert wine. If you are not looking for anything in particular, tell the staff the flavors you typically enjoy and ask them to pick something out for you. For example, you may tell the staff that you like flavors like honey and exotic fruits. They will then be able to find a wine that has those flavors."
        },
        {
          "headline":"Set a budget.",
          "description":"It will be difficult to find a quality dessert wine for under $15. Dessert wine is generally more expensive than regular wine due to its more complicated production processes and because twice as many grapes are needed to make each bottle of wine compared to other wines. Tell the staff at the liquor store how much money you are willing to spend. You will have a lot of good options at the $15-$20 price range. You can also use the website Winesearcher to find dessert wines and see the different prices."
        }
      ]
    },
    {
      "name":"Pairing Wine with Dessert",
      "steps":[
        {
          "headline":"Ask for help.",
          "description":"The staff at the liquor store or wine shop are your greatest resource when pairing wine with food. Let them know the dessert that you are planning to serve or if you plan to use the wine as dessert. Stores that specialize in wine are usually better places to get help than picking up wine at a grocery store or large retailer."
        },
        {
          "headline":"Match the color.",
          "description":"The darker the color of your dessert, the darker the color of the wine should be. Desserts can be grouped into three categories: vanilla and custards, fruit and spice, and caramels and chocolates. Common parings include:\nWhite wines (e.g. late harvest Riesling) and sparkling wines (e.g. demi-sec champagne, Asti Spumanti) pair well with custard and vanilla. For desserts that contain fruits and spices (e.g. apple pie, fruit cobblers) white wines and pink champagne are a good choice. For desserts containing chocolate and caramel, red wines (e.g. late harvest Pinot Noir, Grenache, Port (a fortified wine)), and Grappa are good pairings."
        },
        {
          "headline":"Choose a dessert wine that is sweeter than the dessert.",
          "description":"As a general rule, the wine should be as sweet or sweeter than the dessert you are eating. If the dessert is sweeter than the wine, your wine will taste bitter. This requires knowledge of the sweetness of both the wine and the dessert. Pairing with chocolate is often the most difficult because it is very sweet and tends to coat your mouth when you eat it. Ruby ports and Hungarian Tokay are usually a good pairing. Most white dessert wines will not pair well with chocolate based desserts. If you are unsure of the sweetness of the wine, simply smell it. If you smell honey, molasses, or butterscotch, you are on the right track. If you swirl the glass of wine, sweet wines will be thicker and stick to the glass more."
        },
        {
          "headline":"Look for complementary flavors.",
          "description":"Although each wine varies, many white dessert wines have fruit and/or honey flavors. If your dessert is fruit, has fruity flavors, and/or honey flavors, a white wine would be best. If your dessert has buttery and caramel flavors, an amber colored sweet wine is a good choice.. If you do not know which wine to choose, a Port or a champagne are very versatile and pair well with most desserts. If drinking the noble rot wines, enjoy them with such desserts as sticky-toffee pudding, sweet syrup dumplings, pineapple upside down cake and custard-based desserts such as crème brulée and crème caramel."
        },
        {
          "headline":"Use wine as dessert.",
          "description":"Dessert wines do not have to be paired with food. Wine can actually be your dessert. A Sauternes, port, or a beerenauslese wine are good choices. If you are serving wine for dessert, fill the dessert wine glass with 3 oz of wine and sip it slowly."
        }
      ]
    },
    {
      "name":"Serving the Wine",
      "steps":[
        {
          "headline":"Pay attention to the temperature.",
          "description":"The temperature of the wine influences how the wine tastes. People tend to drink red wines too warm and white wines too cold. If the white wine is too cold, you will not taste much flavor. If the red wine is too warm, the taste of alcohol will be stronger than usual. Store white wines between 40°F and 55°F. If you store them in a temperature controlled wine cellar, place them in the refrigerator for one hour before you plan to drink them. Store red wines between 55°F and 70°F. If you store them in a temperature controlled cellar, remove them from the storage 30 minutes before you plan to drink them. If you do not have temperature controlled cellar, store your reds at room temperature and your whites in the refrigerator. Put the reds in the refrigerator 30 minutes before you plan to drink them, and take your whites out of the refrigerator 30 minutes before you plan to drink them."
        },
        {
          "headline":"Choose how you'd like to serve the wine.",
          "description":"Dessert wine can be served alone or with a dessert. It's a good idea to try it alone first and see how you like it, then to pair it with a dessert another time. There is no wrong way to drink dessert wine. Brandy, port, and grappa are usually served after you eat your dessert. You can also serve the dessert wine after your main meal and before you eat your dessert."
        },
        {
          "headline":"Serve in a small glass.",
          "description":"Dessert wines should be served in a 3 oz. glass. Sip your wine in a relaxed fashion. It is meant to be savored and enjoyed. The small glass directs the wine to the back of your mouth so that you are not overcome by the sweetness of the wine. Dessert wines typically have a higher alcohol content than other wines. The small glass is helpful for this as well."
        }
      ]
    }
  ],
  "text":" Choosing a Wine Familiarize yourself with the different types of dessert wine. There are many different types of dessert wines. They vary based on the grapes used and how they are prepared. The dessert wines can be divided up as follows:\nNoble rot wines: This type of wine is made from rotten grapes. The grapes are covered in a mold called Botrytis cinerea, commonly known as noble rot. The mold removes water content from the grapes, concentrating the sugar. Sauternes (Bordeaux, France), Riesling Auslese (\"late picked\") and beerenauslese (Germany), and trockenbeerenauslese are well-known noble rot dessert wines. Ice wines: Grapes are left on the vine late into the season until they freeze. Freezing the grapes dehydrates the grapes, resulting in a very sweet wine. Ice wines are rare and expensive. Raisin wines: Similar to ice and noble rot wines, winemakers produce raisin wines by letting grapes air dry on the vine to reduce the grapes' water content. Check the label for “vin de paille” or “pasitto”\nFortified wines: These wines are made by adding alcohol during or after the fermentation process. Stopping fermentation allows the wine to retain more of its natural sugars while the addition of spirits increases the alcohol content. Well known fortified wines include Sherry, Port, and Madeira. Late harvest wines: Grapes are left on the vine until they get very ripe and sweet. Common late harvest dessert wines include Riesling, Muscat, Pinot Gris, and Gewürztraminer. Choose a bottle size. Most dessert wine is sold in smaller 375 ml (12.7 oz.) bottles because dessert wines are so much richer and flavor intense than standard wines. A little bit goes a long way. Larger sizes are available at greater cost; however, a smaller selection of wines is likely to be available if you choose to purchase a larger size. When choosing the size consider the following:\nTake into account that the standard pour when you serve dessert wine is 2 oz. (59.1 ml). Estimate how much wine you will need based on the number of people you will be serving. Find a good place to purchase dessert wine. Wine can be sourced from many places but not all wine retailers will carry quality dessert wines or a large variety of such wines. Check out the local supermarket, liquor store and chain wine stores but don't be afraid of looking at the more boutique or specialized wine selling retailers to broaden the possibilities of finding dessert wines. For example, you might find a local wine merchant who has taken a particular interest in specializing in dessert wines. Other more specialized places can include wine clubs and their catalogs, direct buying from a wine producer or buying online. Read the label. You can recognize a dessert wine by looking for key words on the label. The phrases are often in their original language so it is helpful to know what you are looking for. Here are some common words:\n\"Vin de paille\" is French for \"straw wine\" made with grapes that have been dried while still on the vine. \"Passito\" is an Italian wine made from dried raisins. “Vendage Tardive,” \"auslese,\" and “Spätlese” are late harvest wines. \"Demi-Sec\" means \"off dry\" in French. \"Amabile\" means \"slightly sweet\" in Italian. \"Semi Secco\" means \"off dry\" in Italian. \"Doux\" means \"sweet\" in French. \"Dolce\" means sweet in Italian. \"Dulce\" means \"sweet\" in Spanish. \"Moelleux\" is \"sweet\" for some French wines. Work with a wine merchant. Visit a liquor store that has a large wine selection and a knowledgeable staff. Tell the staff how you plan to serve the wine, your price range, and any special flavors you may be looking for in a dessert wine. If you are not looking for anything in particular, tell the staff the flavors you typically enjoy and ask them to pick something out for you. For example, you may tell the staff that you like flavors like honey and exotic fruits. They will then be able to find a wine that has those flavors. Set a budget. It will be difficult to find a quality dessert wine for under $15. Dessert wine is generally more expensive than regular wine due to its more complicated production processes and because twice as many grapes are needed to make each bottle of wine compared to other wines. Tell the staff at the liquor store how much money you are willing to spend. You will have a lot of good options at the $15-$20 price range. You can also use the website Winesearcher to find dessert wines and see the different prices. Pairing Wine with Dessert Ask for help. The staff at the liquor store or wine shop are your greatest resource when pairing wine with food. Let them know the dessert that you are planning to serve or if you plan to use the wine as dessert. Stores that specialize in wine are usually better places to get help than picking up wine at a grocery store or large retailer. Match the color. The darker the color of your dessert, the darker the color of the wine should be. Desserts can be grouped into three categories: vanilla and custards, fruit and spice, and caramels and chocolates. Common parings include:\nWhite wines (e.g. late harvest Riesling) and sparkling wines (e.g. demi-sec champagne, Asti Spumanti) pair well with custard and vanilla. For desserts that contain fruits and spices (e.g. apple pie, fruit cobblers) white wines and pink champagne are a good choice. For desserts containing chocolate and caramel, red wines (e.g. late harvest Pinot Noir, Grenache, Port (a fortified wine)), and Grappa are good pairings. Choose a dessert wine that is sweeter than the dessert. As a general rule, the wine should be as sweet or sweeter than the dessert you are eating. If the dessert is sweeter than the wine, your wine will taste bitter. This requires knowledge of the sweetness of both the wine and the dessert. Pairing with chocolate is often the most difficult because it is very sweet and tends to coat your mouth when you eat it. Ruby ports and Hungarian Tokay are usually a good pairing. Most white dessert wines will not pair well with chocolate based desserts. If you are unsure of the sweetness of the wine, simply smell it. If you smell honey, molasses, or butterscotch, you are on the right track. If you swirl the glass of wine, sweet wines will be thicker and stick to the glass more. Look for complementary flavors. Although each wine varies, many white dessert wines have fruit and/or honey flavors. If your dessert is fruit, has fruity flavors, and/or honey flavors, a white wine would be best. If your dessert has buttery and caramel flavors, an amber colored sweet wine is a good choice.. If you do not know which wine to choose, a Port or a champagne are very versatile and pair well with most desserts. If drinking the noble rot wines, enjoy them with such desserts as sticky-toffee pudding, sweet syrup dumplings, pineapple upside down cake and custard-based desserts such as crème brulée and crème caramel. Use wine as dessert. Dessert wines do not have to be paired with food. Wine can actually be your dessert. A Sauternes, port, or a beerenauslese wine are good choices. If you are serving wine for dessert, fill the dessert wine glass with 3 oz of wine and sip it slowly. Serving the Wine Pay attention to the temperature. The temperature of the wine influences how the wine tastes. People tend to drink red wines too warm and white wines too cold. If the white wine is too cold, you will not taste much flavor. If the red wine is too warm, the taste of alcohol will be stronger than usual. Store white wines between 40°F and 55°F. If you store them in a temperature controlled wine cellar, place them in the refrigerator for one hour before you plan to drink them. Store red wines between 55°F and 70°F. If you store them in a temperature controlled cellar, remove them from the storage 30 minutes before you plan to drink them. If you do not have temperature controlled cellar, store your reds at room temperature and your whites in the refrigerator. Put the reds in the refrigerator 30 minutes before you plan to drink them, and take your whites out of the refrigerator 30 minutes before you plan to drink them. Choose how you'd like to serve the wine. Dessert wine can be served alone or with a dessert. It's a good idea to try it alone first and see how you like it, then to pair it with a dessert another time. There is no wrong way to drink dessert wine. Brandy, port, and grappa are usually served after you eat your dessert. You can also serve the dessert wine after your main meal and before you eat your dessert. Serve in a small glass. Dessert wines should be served in a 3 oz. glass. Sip your wine in a relaxed fashion. It is meant to be savored and enjoyed. The small glass directs the wine to the back of your mouth so that you are not overcome by the sweetness of the wine. Dessert wines typically have a higher alcohol content than other wines. The small glass is helpful for this as well.",
  "tyn_model":[
    "wine",
    "dessert wine",
    "wines",
    "port",
    "grapes",
    "refrigerator",
    "dessert wines",
    "noble rot wines",
    "sauternes",
    "pinot",
    "liquor store",
    "vanilla",
    "champagne",
    "glass",
    "temperature controlled cellar",
    "noble rot",
    "water",
    "sugar",
    "noble rot dessert wines",
    "“vin",
    "” or",
    "“pasitto",
    "”\n",
    "alcohol",
    "spirits",
    "fortified wines",
    "sherry",
    "muscat",
    "wine clubs",
    "raisins",
    "“vendage",
    "” \"",
    "“spätlese",
    "” are",
    "doux",
    "dolce",
    "dulce",
    "wine shop",
    "dessert",
    "caramels",
    "chocolates",
    "riesling",
    "custard",
    "pink champagne",
    "red wines",
    "grenache",
    "grappa",
    "chocolate",
    "ruby ports",
    "hungarian tokay",
    "molasses",
    "butterscotch",
    "white wine",
    "sweet wine",
    "sticky-toffee pudding",
    "sweet syrup",
    "dessert wine glass",
    "red wine",
    "brandy"
  ],
  "tyn_section":[

  ]
}