{
  "title":"How to Make a Nice Cozy Bed",
  "url":"https://www.wikihow.com/Make-a-Nice-Cozy-Bed",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "methods":[
    {
      "name":"Getting Cozy Bedding",
      "steps":[
        {
          "headline":"Use a quality mattress.",
          "description":"Start your cozy bed with a great mattress, which can make the most difference in the comfort of your bed, especially for sleep. Choose memory foam, pillow-top, and other mattress varieties according to your preference. Choose an innerspring or air mattress if you prefer a softer mattress. Try memory foam or latex if you prefer a firmer mattress or suffer from lower back pain. You can also supplement any mattress with a lush mattress topper, which fits over the corners of your mattress like a fitted sheet would, and comes in all the same materials that mattresses and comforters do to create the texture and coziness you want."
        },
        {
          "headline":"Find sheets that fit and feel soft.",
          "description":"Use a fitted and flat sheet on your bed that are the right size for your mattress. Ideally, they should also be made of a high-quality fabric for the most comfort. Cotton flannel provides extra coziness and warmth and silk is very smooth and warm for cold months. Choose a blend of cotton with a small amount of polyester for a fabric that is soft but wrinkles less easily. Look for 100% Egyptian, organic, or pima cotton for the most luxurious fabrics, which are typically softer and more durable at a higher thread count (the number of threads in a square inch of fabric). Choose a percale weave if you prefer your sheets a little crisper and lighter, or sateen for a finish that feels heavier and more supple."
        },
        {
          "headline":"Find fluffy comforters and blankets.",
          "description":"Get a great down comforter, quilt, or other comfortable blanket of your choice as a main source of warmth and softness for your bed. Then use additional throw blankets for extra coziness and warmth. Invest in a real down comforter for light and fluffy warmth, or a down alternative if you are allergic. Get a duvet cover for the comforter that can be removed and cleaned more easily than the comforter itself. Look for knit fabrics, faux fur, cashmere, or other materials that are soft to the touch when you shop for throw blankets. Layering these on the bed can create extra volume, warmth, and comfort."
        },
        {
          "headline":"Vary the shapes and sizes of pillows.",
          "description":"Buy your preferred texture of pillow for sleeping, be it soft, firm, or shaped. Then add on additional pillows for comfort and decoration to lend support and coziness when you’re sitting or lying down. Choose a firm pillow if you prefer or are prone to sleeping on your side, a medium-firm one if you sleep on your back, and a soft one if you sleep on your stomach. Try a memory foam material for your main sleeping pillow if you want something that will conform to and offer full support for your head and neck. You can also buy shaped pillows like a wedge to lend support when sitting or lying propped up. Try a long body pillow for extra comfort while you’re sleeping, as well as a nice cushioning against a wall or daybed frame if your mattress is up against one."
        }
      ]
    },
    {
      "name":"Making the Bed",
      "steps":[
        {
          "headline":"Fit the sheets neatly.",
          "description":"Put a fitted sheet onto your mattress first, followed by a flat (top) sheet. Make sure both are pulled and tucked in neatly to avoid wrinkles and hanging edges. If you have a mattress topper, put this on before your fitted sheet. They will typically have elastic bands or elastic corners like a fitted sheet to easily fit onto the mattress. Tuck in alternate diagonal corners of a fitted sheet to avoid it popping up. Make sure the fitted sheet you have has enough depth to fit fully over and tuck under your mattress, and isn’t too tight or stretched out. Lay down a top sheet with the wide hem toward the head of the bed and the colored or patterned side facing down so it shows when folded over. Create crisp and neat ”hospital corners” with the flat sheet by tucking under the end first, then the sides, of the excess material."
        },
        {
          "headline":"Put on a comforter and pillows.",
          "description":"Lay a blanket or comforter on top of your flat sheet, then fold the top of the sheet down over the blanket to display the pattern and leave room for your sleeping pillows. Fluff pillows and place them in between the folded-down bedding and headboard of your bed. Try putting down a light blanket first, followed by a comforter and then a throw blanket. Layering like this makes it easy to adjust to your ideal warmth, while also creating a visual coziness. Layer pillows according to size, with the largest closest to the headboard of the bed. Square Euro size pillows are first, then King and Standard sizes, followed by Lumbar or roll-shaped pillows."
        },
        {
          "headline":"Top with decorative pillows and blankets.",
          "description":"Put the finishing cozy touches on your bed by adding on plenty of extra blankets and pillows. Use a variety of soft textures to create an even more plush and luxurious look and feel for the surface of your bed. Place larger decorative pillows behind your sleeping pillows, against the headboard, while smaller decorative pillows should be placed in front of other pillows. Throw blankets can be spread across the bed or thrown casually at the foot. Avoid using decorative pillows that aren’t comfortable to sit or lay against, such as ones that are overstuffed or are covered with coarse fabric or beading. Stick to the same soft cottons, knits, and faux furs that will be the most cozy."
        },
        {
          "headline":"Leave some things imperfect.",
          "description":"Avoid having your bed too neatly made by arranging some elements more casually. Imperfect bedding looks cozier and more inviting than a flawless bed that you don’t even want to mess up to get into. Try keeping a corner of the bedding folded down, sheets and blankets untucked, and pillows strewn casually to make your bed more accessible and inviting. If you like having your bedding super crisp and well-made, try keeping just one item more casually arranged, like a throw pillow at the foot of the bed."
        }
      ]
    },
    {
      "name":"Creating a Cozy Atmosphere",
      "steps":[
        {
          "headline":"Use a space heater or electric blanket.",
          "description":"Create cozy warmth in colder seasons by heating the space around your bed with a space heater. Or, try an electric heated blanket for even more warmth right in your bed. Choose a radiant heater if you want to heat the objects in a room (like your bed and yourself) that it’s pointed at. Choose a combustion heater to heat the air in the entire room. Take care to follow all safety instructions for space heaters and heated blankets. Don’t put a space heater too close to bedding or other linens, and turn it off when you leave the room."
        },
        {
          "headline":"Include dark colors and plenty of texture.",
          "description":"Choose dark colors for your bedding, curtains, or even the walls of your bedroom. Darker tones help a space feel more closed in around you, in a good, cozy way. Mix up the textures in the space as well to create further comfort. Incorporate a variety of textures into your bed and bedroom by including several rugs, curtains, and of course your throw pillows and blankets. Layer on faux furs, knits, quilts, and any different fabrics and textures you can think of. If you want to include dark colors but don’t want the space to look too dark, try using a gradient of colors for different items. Black, grey, and silver are a great combination, as are a dark navy blue, medium blue, and light blue."
        },
        {
          "headline":"Create a calming scent in the room.",
          "description":"Light scented candles, use a spray, or disperse essential oils in a diffuser to add a relaxing scent to the air around your bed. Stick to natural fragrances for the best effect. Try scents like lavender, Roman chamomile, and sandalwood for traditionally relaxing scents, or anything else that helps make you feel cozy. Some scented sprays are designed or safe for use directly on pillows and bed linens. Spritz some of this spray lightly on your bedding to distribute the scent right where you’ll sleep or relax."
        },
        {
          "headline":"Create soft mood lighting.",
          "description":"Use lamps, lanterns, and strings of lights around your bed for softer, cozier lighting. Favor natural light during the day and low light or no light at night. Turn out an overhead light and use low lamps and string lights instead to create softer, dimmer light. Replace bulbs in overhead lights or lamps with lightbulbs in a warm hue that are 40 watts or lower, or use a dimmer switch in place of a regular on-off switch to quickly make your main lighting softer."
        },
        {
          "headline":"Put on relaxing music or sounds.",
          "description":"Create a cozy ambience by putting on your favorite relaxing music or sound effects. Use your favorite slow-paced music played at a low volume, or use a soundtrack of relaxing sounds to make the setting extra calming and inviting. Stick to acoustic music, ballads, classical, or other slow-tempo music for the most universally relaxing sounds. However, you should also stick to your preferences to choose whatever calms you down the most. Try websites or CDs that feature sounds like those of falling rain or a crackling fire. Unless rain is already falling outside where you live or you happen to have a fireplace in your bedroom, these recorded sounds can help replicate the cozy feeling that the real thing elicits."
        }
      ]
    }
  ],
  "text":" Getting Cozy Bedding Use a quality mattress. Start your cozy bed with a great mattress, which can make the most difference in the comfort of your bed, especially for sleep. Choose memory foam, pillow-top, and other mattress varieties according to your preference. Choose an innerspring or air mattress if you prefer a softer mattress. Try memory foam or latex if you prefer a firmer mattress or suffer from lower back pain. You can also supplement any mattress with a lush mattress topper, which fits over the corners of your mattress like a fitted sheet would, and comes in all the same materials that mattresses and comforters do to create the texture and coziness you want. Find sheets that fit and feel soft. Use a fitted and flat sheet on your bed that are the right size for your mattress. Ideally, they should also be made of a high-quality fabric for the most comfort. Cotton flannel provides extra coziness and warmth and silk is very smooth and warm for cold months. Choose a blend of cotton with a small amount of polyester for a fabric that is soft but wrinkles less easily. Look for 100% Egyptian, organic, or pima cotton for the most luxurious fabrics, which are typically softer and more durable at a higher thread count (the number of threads in a square inch of fabric). Choose a percale weave if you prefer your sheets a little crisper and lighter, or sateen for a finish that feels heavier and more supple. Find fluffy comforters and blankets. Get a great down comforter, quilt, or other comfortable blanket of your choice as a main source of warmth and softness for your bed. Then use additional throw blankets for extra coziness and warmth. Invest in a real down comforter for light and fluffy warmth, or a down alternative if you are allergic. Get a duvet cover for the comforter that can be removed and cleaned more easily than the comforter itself. Look for knit fabrics, faux fur, cashmere, or other materials that are soft to the touch when you shop for throw blankets. Layering these on the bed can create extra volume, warmth, and comfort. Vary the shapes and sizes of pillows. Buy your preferred texture of pillow for sleeping, be it soft, firm, or shaped. Then add on additional pillows for comfort and decoration to lend support and coziness when you’re sitting or lying down. Choose a firm pillow if you prefer or are prone to sleeping on your side, a medium-firm one if you sleep on your back, and a soft one if you sleep on your stomach. Try a memory foam material for your main sleeping pillow if you want something that will conform to and offer full support for your head and neck. You can also buy shaped pillows like a wedge to lend support when sitting or lying propped up. Try a long body pillow for extra comfort while you’re sleeping, as well as a nice cushioning against a wall or daybed frame if your mattress is up against one. Making the Bed Fit the sheets neatly. Put a fitted sheet onto your mattress first, followed by a flat (top) sheet. Make sure both are pulled and tucked in neatly to avoid wrinkles and hanging edges. If you have a mattress topper, put this on before your fitted sheet. They will typically have elastic bands or elastic corners like a fitted sheet to easily fit onto the mattress. Tuck in alternate diagonal corners of a fitted sheet to avoid it popping up. Make sure the fitted sheet you have has enough depth to fit fully over and tuck under your mattress, and isn’t too tight or stretched out. Lay down a top sheet with the wide hem toward the head of the bed and the colored or patterned side facing down so it shows when folded over. Create crisp and neat ”hospital corners” with the flat sheet by tucking under the end first, then the sides, of the excess material. Put on a comforter and pillows. Lay a blanket or comforter on top of your flat sheet, then fold the top of the sheet down over the blanket to display the pattern and leave room for your sleeping pillows. Fluff pillows and place them in between the folded-down bedding and headboard of your bed. Try putting down a light blanket first, followed by a comforter and then a throw blanket. Layering like this makes it easy to adjust to your ideal warmth, while also creating a visual coziness. Layer pillows according to size, with the largest closest to the headboard of the bed. Square Euro size pillows are first, then King and Standard sizes, followed by Lumbar or roll-shaped pillows. Top with decorative pillows and blankets. Put the finishing cozy touches on your bed by adding on plenty of extra blankets and pillows. Use a variety of soft textures to create an even more plush and luxurious look and feel for the surface of your bed. Place larger decorative pillows behind your sleeping pillows, against the headboard, while smaller decorative pillows should be placed in front of other pillows. Throw blankets can be spread across the bed or thrown casually at the foot. Avoid using decorative pillows that aren’t comfortable to sit or lay against, such as ones that are overstuffed or are covered with coarse fabric or beading. Stick to the same soft cottons, knits, and faux furs that will be the most cozy. Leave some things imperfect. Avoid having your bed too neatly made by arranging some elements more casually. Imperfect bedding looks cozier and more inviting than a flawless bed that you don’t even want to mess up to get into. Try keeping a corner of the bedding folded down, sheets and blankets untucked, and pillows strewn casually to make your bed more accessible and inviting. If you like having your bedding super crisp and well-made, try keeping just one item more casually arranged, like a throw pillow at the foot of the bed. Creating a Cozy Atmosphere Use a space heater or electric blanket. Create cozy warmth in colder seasons by heating the space around your bed with a space heater. Or, try an electric heated blanket for even more warmth right in your bed. Choose a radiant heater if you want to heat the objects in a room (like your bed and yourself) that it’s pointed at. Choose a combustion heater to heat the air in the entire room. Take care to follow all safety instructions for space heaters and heated blankets. Don’t put a space heater too close to bedding or other linens, and turn it off when you leave the room. Include dark colors and plenty of texture. Choose dark colors for your bedding, curtains, or even the walls of your bedroom. Darker tones help a space feel more closed in around you, in a good, cozy way. Mix up the textures in the space as well to create further comfort. Incorporate a variety of textures into your bed and bedroom by including several rugs, curtains, and of course your throw pillows and blankets. Layer on faux furs, knits, quilts, and any different fabrics and textures you can think of. If you want to include dark colors but don’t want the space to look too dark, try using a gradient of colors for different items. Black, grey, and silver are a great combination, as are a dark navy blue, medium blue, and light blue. Create a calming scent in the room. Light scented candles, use a spray, or disperse essential oils in a diffuser to add a relaxing scent to the air around your bed. Stick to natural fragrances for the best effect. Try scents like lavender, Roman chamomile, and sandalwood for traditionally relaxing scents, or anything else that helps make you feel cozy. Some scented sprays are designed or safe for use directly on pillows and bed linens. Spritz some of this spray lightly on your bedding to distribute the scent right where you’ll sleep or relax. Create soft mood lighting. Use lamps, lanterns, and strings of lights around your bed for softer, cozier lighting. Favor natural light during the day and low light or no light at night. Turn out an overhead light and use low lamps and string lights instead to create softer, dimmer light. Replace bulbs in overhead lights or lamps with lightbulbs in a warm hue that are 40 watts or lower, or use a dimmer switch in place of a regular on-off switch to quickly make your main lighting softer. Put on relaxing music or sounds. Create a cozy ambience by putting on your favorite relaxing music or sound effects. Use your favorite slow-paced music played at a low volume, or use a soundtrack of relaxing sounds to make the setting extra calming and inviting. Stick to acoustic music, ballads, classical, or other slow-tempo music for the most universally relaxing sounds. However, you should also stick to your preferences to choose whatever calms you down the most. Try websites or CDs that feature sounds like those of falling rain or a crackling fire. Unless rain is already falling outside where you live or you happen to have a fireplace in your bedroom, these recorded sounds can help replicate the cozy feeling that the real thing elicits.",
  "tyn_model":[
    "pillows",
    "fitted sheet",
    "blankets",
    "mattress",
    "sheets",
    "sheet",
    "pillow",
    "comforter",
    "blanket",
    "space heater",
    "memory foam",
    "mattress topper",
    "fabric",
    "cotton",
    "down comforter",
    "pillow-top",
    "silk",
    "polyester",
    "quilt",
    "duvet",
    "throw blankets",
    "memory foam material",
    "”hospital",
    "” with",
    "throw blanket",
    "sleeping pillows",
    "throw pillow",
    "electric blanket",
    "electric heated blanket",
    "radiant heater",
    "combustion heater",
    "space heaters",
    "heated blankets",
    "rugs",
    "curtains",
    "throw pillows",
    "quilts",
    "candles",
    "essential oils",
    "diffuser",
    "lavender",
    "chamomile",
    "scented sprays",
    "lamps",
    "fireplace"
  ],
  "tyn_section":[

  ]
}