{
  "title":"How to Build Your PlayStation 2 Game Collection for Cheap",
  "url":"https://www.wikihow.com/Build-Your-PlayStation-2-Game-Collection-for-Cheap",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation 2"
  ],
  "steps":[
    {
      "headline":"Start researching the popular titles.",
      "description":"Such as Devil May Cry series from 1 - 3, Silent Hill games, Resident Evil games, Final Fantasy games, Max Payne 1 and 2, Grand Theft Auto series, God of War I & 2, and any other games that is considered as a popular title. Those games are a great start to your collection."
    },
    {
      "headline":"Evaluate just how much you could afford to spend.",
      "description":"You can't just walk into the store and expect to pay for it if you don't know how much you could afford to spend."
    },
    {
      "headline":"If you consider shopping at GameStop, get an Edge card.",
      "description":"It's a type of discount card for GameStop, it'll give you 10% off of any used games."
    },
    {
      "headline":"Don't just shop at one store, be a smart shopper by shopping at more than one store.",
      "description":""
    },
    {
      "headline":"Try to only get the games you know you will play.",
      "description":"There is no point to have a game if you don't bother playing it at least once in a while."
    },
    {
      "headline":"Consider getting them as gifts from your family.",
      "description":"Sometimes if your family is nice enough they might decide to get a game for you on your birthday or during the holidays."
    },
    {
      "headline":"Wait till a special offer or Christmastime/Boxing Day.",
      "description":"During those kinds of days, there's sometimes a discount for games you wanted. So waiting could sometimes pay off."
    }
  ],
  "text":" Start researching the popular titles. Such as Devil May Cry series from 1 - 3, Silent Hill games, Resident Evil games, Final Fantasy games, Max Payne 1 and 2, Grand Theft Auto series, God of War I & 2, and any other games that is considered as a popular title. Those games are a great start to your collection. Evaluate just how much you could afford to spend. You can't just walk into the store and expect to pay for it if you don't know how much you could afford to spend. If you consider shopping at GameStop, get an Edge card. It's a type of discount card for GameStop, it'll give you 10% off of any used games. Don't just shop at one store, be a smart shopper by shopping at more than one store.  Try to only get the games you know you will play. There is no point to have a game if you don't bother playing it at least once in a while. Consider getting them as gifts from your family. Sometimes if your family is nice enough they might decide to get a game for you on your birthday or during the holidays. Wait till a special offer or Christmastime/Boxing Day. During those kinds of days, there's sometimes a discount for games you wanted. So waiting could sometimes pay off.",
  "tyn_model":[
    "games",
    "game",
    "resident evil games",
    "final fantasy games",
    "max payne 1 and 2,"
  ],
  "tyn_section":[

  ]
}