{
  "title":"How to Make Raspberry Meringue Pie",
  "url":"https://www.wikihow.com/Make-Raspberry-Meringue-Pie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies"
  ],
  "methods":[
    {
      "name":"Pie Crust",
      "steps":[
        {
          "headline":"Combine crumbs and sugar with a fork in a medium sized bowl.",
          "description":""
        },
        {
          "headline":"Stir in softened butter and squash into crumbs and sugar with a fork.",
          "description":"This may take a little while. You want the it to be kind of like crumbs."
        },
        {
          "headline":"Pack mixture into a 9 in.",
          "description":"pie pan and press firmly on bottom and up the sides. Set the crust aside."
        }
      ]
    },
    {
      "name":"Filling",
      "steps":[
        {
          "headline":"Put the frozen raspberries in a bowl with a paper towel on top.",
          "description":"Place the raspberries in the microwave for 5 minutes."
        },
        {
          "headline":"Remove from the microwave, and put in a small strainer over a bowl so that the juice will run into the bowl, but the seeds and raspberries stay behind.",
          "description":""
        },
        {
          "headline":"Use a knife to squash the raspberries so as to get most of the juice out.",
          "description":"Set the juice aside."
        },
        {
          "headline":"Whip the egg yolk until it is a lemon color and mixed thoroughly.",
          "description":"Set this aside in a medium sized bowl."
        },
        {
          "headline":"Combine the sugar, cornstarch and salt in a saucepan.",
          "description":""
        },
        {
          "headline":"Gradually stir in the cold water until it is smooth.",
          "description":""
        },
        {
          "headline":"Cook over medium heat until it is thickened and bubbly.",
          "description":""
        },
        {
          "headline":"Reduce heat so it's on a lower setting; cook and stir 2 minutes more.",
          "description":"Afterwards, remove it from the heat."
        },
        {
          "headline":"Stir half of the hot filling into the egg yolk (in the separate bowl, do not pour the egg yolk into the saucepan; mix it together quickly.",
          "description":""
        },
        {
          "headline":"Afterwards, return all the filling to the pan and stir.",
          "description":""
        },
        {
          "headline":"Bring to a gentle boil; cook and stir for 2 more minutes.",
          "description":""
        },
        {
          "headline":"Remove from the heat and place in the bowl used to whip the egg yolks in.",
          "description":""
        },
        {
          "headline":"Stir in the raspberry juice and butter.",
          "description":""
        },
        {
          "headline":"Pour into the pie crust and spread evenly.",
          "description":""
        },
        {
          "headline":"Place the it in the refrigerator while making the meringue.",
          "description":""
        }
      ]
    },
    {
      "name":"Meringue",
      "steps":[
        {
          "headline":"In a small mixing bowl, beat egg whites and cream of tartar on medium speed until foamy.",
          "description":"(Use an electric mixer.)"
        },
        {
          "headline":"Gradually add the sugar, beating at high speed until when you life up the beaters, stiff peaks form.",
          "description":""
        },
        {
          "headline":"Spread evenly over the hot filling, sealing the edges to the crust.",
          "description":""
        },
        {
          "headline":"Use one of the beaters to dip into the meringue (very lightly), and pull out while twisting the beater to form a peak.",
          "description":"Do this as many times as desired."
        },
        {
          "headline":"Bake at 350 °F (177 °C) for 15 - 20 minutes or until the meringue is a light golden brown.",
          "description":""
        },
        {
          "headline":"Cool on a wire rack for 1 hour; refrigerate for at least 3 hours before serving.",
          "description":""
        }
      ]
    }
  ],
  "text":" Pie Crust Combine crumbs and sugar with a fork in a medium sized bowl.  Stir in softened butter and squash into crumbs and sugar with a fork. This may take a little while. You want the it to be kind of like crumbs. Pack mixture into a 9 in. pie pan and press firmly on bottom and up the sides. Set the crust aside. Filling Put the frozen raspberries in a bowl with a paper towel on top. Place the raspberries in the microwave for 5 minutes. Remove from the microwave, and put in a small strainer over a bowl so that the juice will run into the bowl, but the seeds and raspberries stay behind.  Use a knife to squash the raspberries so as to get most of the juice out. Set the juice aside. Whip the egg yolk until it is a lemon color and mixed thoroughly. Set this aside in a medium sized bowl. Combine the sugar, cornstarch and salt in a saucepan.  Gradually stir in the cold water until it is smooth.  Cook over medium heat until it is thickened and bubbly.  Reduce heat so it's on a lower setting; cook and stir 2 minutes more. Afterwards, remove it from the heat. Stir half of the hot filling into the egg yolk (in the separate bowl, do not pour the egg yolk into the saucepan; mix it together quickly.  Afterwards, return all the filling to the pan and stir.  Bring to a gentle boil; cook and stir for 2 more minutes.  Remove from the heat and place in the bowl used to whip the egg yolks in.  Stir in the raspberry juice and butter.  Pour into the pie crust and spread evenly.  Place the it in the refrigerator while making the meringue.  Meringue In a small mixing bowl, beat egg whites and cream of tartar on medium speed until foamy. (Use an electric mixer.) Gradually add the sugar, beating at high speed until when you life up the beaters, stiff peaks form.  Spread evenly over the hot filling, sealing the edges to the crust.  Use one of the beaters to dip into the meringue (very lightly), and pull out while twisting the beater to form a peak. Do this as many times as desired. Bake at 350 °F (177 °C) for 15 - 20 minutes or until the meringue is a light golden brown.  Cool on a wire rack for 1 hour; refrigerate for at least 3 hours before serving. ",
  "tyn_model":[
    "bowl",
    "sugar",
    "raspberries",
    "meringue",
    "fork",
    "butter",
    "microwave",
    "saucepan",
    "beaters",
    "medium sized bowl",
    "squash",
    "pie pan",
    "paper towel",
    "strainer",
    "knife",
    "cornstarch",
    "salt",
    "water",
    "egg yolk",
    "pan",
    "raspberry juice",
    "pie crust",
    "refrigerator",
    "small mixing bowl",
    "cream",
    "of tartar",
    "electric mixer",
    "beater"
  ],
  "tyn_section":[

  ]
}