{
  "title":"How to Make a Salad Bar",
  "url":"https://www.wikihow.com/Make-a-Salad-Bar",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Salads"
  ],
  "steps":[
    {
      "headline":"Set up a table to lay out your salad bar.",
      "description":""
    },
    {
      "headline":"Cover the table with a pretty tablecloth suitable for the occasion.",
      "description":""
    },
    {
      "headline":"Place the flatware and plates at the start of the salad bar service.",
      "description":""
    },
    {
      "headline":"Arrange the salad bar items on the table.",
      "description":"Make sure to keep hot foods hot and cold foods cold. In other words have something to keep foods at the appropriate temperature."
    },
    {
      "headline":"Suggested salad bar ingredients:",
      "description":"Pasta salad Potato salad Fruit salad Mixed salad greens and toppings for the salad greens Grated hard-cooked eggs  Grated cheese  Cooked meats and poultry such as ham or chicken, julienned Cut up veggies such as carrots, cucumbers, red onion, broccoli florets, tomatoes, mushrooms  Chopped nuts or seeds such as pumpkin seeds  Cooked and chilled legumes such as kidney beans or garbanzo beans"
    },
    {
      "headline":"Chilled salad dressings such as Ranch, French, Blue Cheese or Italian",
      "description":""
    },
    {
      "headline":"Have your guests pick up their appropriate dinnerware, flatware and napkins before moving down the salad bar to select their salad fixings.",
      "description":""
    }
  ],
  "text":" Set up a table to lay out your salad bar.  Cover the table with a pretty tablecloth suitable for the occasion.  Place the flatware and plates at the start of the salad bar service.  Arrange the salad bar items on the table. Make sure to keep hot foods hot and cold foods cold. In other words have something to keep foods at the appropriate temperature. Suggested salad bar ingredients: Pasta salad Potato salad Fruit salad Mixed salad greens and toppings for the salad greens Grated hard-cooked eggs  Grated cheese  Cooked meats and poultry such as ham or chicken, julienned Cut up veggies such as carrots, cucumbers, red onion, broccoli florets, tomatoes, mushrooms  Chopped nuts or seeds such as pumpkin seeds  Cooked and chilled legumes such as kidney beans or garbanzo beans Chilled salad dressings such as Ranch, French, Blue Cheese or Italian  Have your guests pick up their appropriate dinnerware, flatware and napkins before moving down the salad bar to select their salad fixings. ",
  "tyn_model":[
    "salad bar",
    "flatware",
    "plates",
    "cheese",
    "carrots",
    "cucumbers",
    "red onion",
    "broccoli",
    "tomatoes",
    "mushrooms",
    "nuts",
    "pumpkin seeds",
    "napkins"
  ],
  "tyn_section":[

  ]
}