{
  "title":"How to Make a Graph",
  "url":"https://www.wikihow.com/Make-a-Graph",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Shapes"
  ],
  "methods":[
    {
      "name":"Draw and Label Your Graph",
      "steps":[
        {
          "headline":"Draw the grid.",
          "description":"You will first need a grid on which to draw your graph. You can either purchase grid paper or you can draw it yourself using a ruler. Make sure that the lines are straight and evenly spaced. They should be a distance apart as is appropriate for the graph you intend to produce. You can have an L-shaped graph or a t-shaped graph. It will depend on whether or not you need to show negative values. The L or t base will be your main axis, or the baseline for your values. The horizontal line is called the x-axis and the vertical line is called the y-axis."
        },
        {
          "headline":"Decide your labels.",
          "description":"You will need to determine what will go on the x and y axes. This will depend on the type of data you are trying to show. The two should be correlated and accurately present the data you are trying to show. Assign the label to the axes and then label the intervals of change in evenly spaced increments along the axes. One common example would be for the x-axis to represent time and the y-axis to represent a value that changes over time."
        },
        {
          "headline":"Be careful of spacing.",
          "description":"You will want to carefully determine the increments by looking closely at the data you need to represent. Be sure that you have enough space to clearly show all of your data. Both axes should go beyond the last datapoint you need to show."
        }
      ]
    },
    {
      "name":"Fill in Data",
      "steps":[
        {
          "headline":"Make a bar graph.",
          "description":"A bar graph, usually used to show how much of one thing exists compared to another, is easy to create and looks like a series of vertical or horizontal rectangles of different lengths. The y-axis will indicate how much of something there is and the x-axis will represent what you are measuring (if you want your rectangles to be vertical). If you would like them to be horizontal, switch which type of data goes on which axis. A histogram is a special bar graph designed to show the distribution of data. On this type of bar graph, both axes will have number values, since numbers will be the value being measured."
        },
        {
          "headline":"Make a line graph.",
          "description":"This type of graph shows data as points and connects those points with a line. It is useful for showing how a particular variable has changed over time, like weight, height, salary, or a company’s GDP for example. An area graph is a special kind of line graph, which shows multiple sets of these changes on the same graph so as to make them easy to compare. The area below each line will be filled in a different color. This allows people to easily see which data sets were more negative or positive. An example of the type of data used on such a chart is showing the change over time in average house prices in three separate neighborhoods."
        },
        {
          "headline":"Make a pie chart.",
          "description":"This is a circle graph which is comprised of a circle, broken up into individually colored sections which represent data. These sections or slices are sized relative to the amount of data they represent. This type of chart is useful for showing how the different parts of a whole compare to each other. It is difficult to draw accurately by hand, however, since you need to be able to calculate the angles necessary to represent percentages of a whole. Drawing one will require a protractor, though there are many computer programs and websites which will make a chart for you if you enter the data. For example, you can use a pie chart to show relatively how many members of a class are of a particular ethnicity or what types of colleges or work forces students from a particular high school went on to after graduating."
        }
      ]
    }
  ],
  "text":" Draw and Label Your Graph Draw the grid. You will first need a grid on which to draw your graph. You can either purchase grid paper or you can draw it yourself using a ruler. Make sure that the lines are straight and evenly spaced. They should be a distance apart as is appropriate for the graph you intend to produce. You can have an L-shaped graph or a t-shaped graph. It will depend on whether or not you need to show negative values. The L or t base will be your main axis, or the baseline for your values. The horizontal line is called the x-axis and the vertical line is called the y-axis. Decide your labels. You will need to determine what will go on the x and y axes. This will depend on the type of data you are trying to show. The two should be correlated and accurately present the data you are trying to show. Assign the label to the axes and then label the intervals of change in evenly spaced increments along the axes. One common example would be for the x-axis to represent time and the y-axis to represent a value that changes over time. Be careful of spacing. You will want to carefully determine the increments by looking closely at the data you need to represent. Be sure that you have enough space to clearly show all of your data. Both axes should go beyond the last datapoint you need to show. Fill in Data Make a bar graph. A bar graph, usually used to show how much of one thing exists compared to another, is easy to create and looks like a series of vertical or horizontal rectangles of different lengths. The y-axis will indicate how much of something there is and the x-axis will represent what you are measuring (if you want your rectangles to be vertical). If you would like them to be horizontal, switch which type of data goes on which axis. A histogram is a special bar graph designed to show the distribution of data. On this type of bar graph, both axes will have number values, since numbers will be the value being measured. Make a line graph. This type of graph shows data as points and connects those points with a line. It is useful for showing how a particular variable has changed over time, like weight, height, salary, or a company’s GDP for example. An area graph is a special kind of line graph, which shows multiple sets of these changes on the same graph so as to make them easy to compare. The area below each line will be filled in a different color. This allows people to easily see which data sets were more negative or positive. An example of the type of data used on such a chart is showing the change over time in average house prices in three separate neighborhoods. Make a pie chart. This is a circle graph which is comprised of a circle, broken up into individually colored sections which represent data. These sections or slices are sized relative to the amount of data they represent. This type of chart is useful for showing how the different parts of a whole compare to each other. It is difficult to draw accurately by hand, however, since you need to be able to calculate the angles necessary to represent percentages of a whole. Drawing one will require a protractor, though there are many computer programs and websites which will make a chart for you if you enter the data. For example, you can use a pie chart to show relatively how many members of a class are of a particular ethnicity or what types of colleges or work forces students from a particular high school went on to after graduating.",
  "tyn_model":[
    "pie chart",
    "grid paper",
    "ruler",
    "labels",
    "bar graph",
    "histogram",
    "line graph",
    "protractor"
  ],
  "tyn_section":[

  ]
}