{
  "title":"How to Clean Your Gems and Diamonds",
  "url":"https://www.wikihow.com/Clean-Your-Gems-and-Diamonds",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Rocks and Minerals",
    "Gemstones",
    "Diamonds"
  ],
  "steps":[
    {
      "headline":"Use soft brushes for hard gems.",
      "description":"A popular tool of choice is a soft-bristle toothbrush. The brush must be soft; otherwise, you might do more harm than good to your stone or setting. A hard-bristle brush might even damage the metal holding your gems and diamonds. It is better not to risk it. To clean your jewelry, get a warm bowl of water and scrub with a few drops of ordinary liquid dish detergent."
    },
    {
      "headline":"Use regular glass cleaner.",
      "description":"One very popular cleaning method among jewelers is to simply wipe down your gems with regular household glass cleaner. The cleaner quickly removes oil and dirt while leaving behind a vibrant shine. Wear rubber gloves if you don't want to get the scent on your skin."
    },
    {
      "headline":"Remove grime your jewelry with window cleaner.",
      "description":"Fill a bowl with lukewarm, soapy water and let your jewelry soak. If you use a sink, use a plug or drain stopper so your precious gems don't accidentally spiral down into your home plumbing. Transfer your jewelry into another bowl filled with glass cleaner for a few moments, and then use your soft brush to wipe away any residual dirt. Rinse under water and let dry. Simply spray the window cleaner onto your jewelry and wipe dry with a lint-free cloth. If you are allergic to any chemicals, you may want to avoid spraying them, as they will find their way onto your skin. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6b\\/Clean-Your-Gems-and-Diamonds-Step-3Bullet1.jpg\\/v4-459px-Clean-Your-Gems-and-Diamonds-Step-3Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6b\\/Clean-Your-Gems-and-Diamonds-Step-3Bullet1.jpg\\/v4-759px-Clean-Your-Gems-and-Diamonds-Step-3Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
    },
    {
      "headline":"Use ultrasonic cleaner.",
      "description":"If you want to step it up a bit, baby your gems and diamonds with an ultrasonic cleaner. These devices combine high-end technology and efficiency to provide unstoppable gem-scouring power! Bonus: Ultrasonic cleaners are completely hands-off when it comes to grime. You won't even have to get your hands dirty."
    },
    {
      "headline":"Try good old-fashioned baking soda.",
      "description":"Baking soda has an amazing amount of cleaning uses, and can also get the grime off of your jewelry. Combine the baking soda with water to create a paste, then use a soft brush to gently scrub your gems and metals. Next, dry and polish the ring with a lint-free cloth and your jewelry will shine. (If your jewelry is very dirty, a stronger chemical solution will get your diamonds and gems sparkling better.)"
    },
    {
      "headline":"Use an ammonia cleaner.",
      "description":"If you use ammonia, you'll know that it is a very strong chemical — cut the solution with water. Typically, one part ammonia to three parts water will make a safe solution that won't harm your jewelry."
    }
  ],
  "text":" Use soft brushes for hard gems. A popular tool of choice is a soft-bristle toothbrush. The brush must be soft; otherwise, you might do more harm than good to your stone or setting. A hard-bristle brush might even damage the metal holding your gems and diamonds. It is better not to risk it. To clean your jewelry, get a warm bowl of water and scrub with a few drops of ordinary liquid dish detergent. Use regular glass cleaner. One very popular cleaning method among jewelers is to simply wipe down your gems with regular household glass cleaner. The cleaner quickly removes oil and dirt while leaving behind a vibrant shine. Wear rubber gloves if you don't want to get the scent on your skin. Remove grime your jewelry with window cleaner. Fill a bowl with lukewarm, soapy water and let your jewelry soak. If you use a sink, use a plug or drain stopper so your precious gems don't accidentally spiral down into your home plumbing. Transfer your jewelry into another bowl filled with glass cleaner for a few moments, and then use your soft brush to wipe away any residual dirt. Rinse under water and let dry. Simply spray the window cleaner onto your jewelry and wipe dry with a lint-free cloth. If you are allergic to any chemicals, you may want to avoid spraying them, as they will find their way onto your skin. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6b\\/Clean-Your-Gems-and-Diamonds-Step-3Bullet1.jpg\\/v4-459px-Clean-Your-Gems-and-Diamonds-Step-3Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/6b\\/Clean-Your-Gems-and-Diamonds-Step-3Bullet1.jpg\\/v4-759px-Clean-Your-Gems-and-Diamonds-Step-3Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Use ultrasonic cleaner. If you want to step it up a bit, baby your gems and diamonds with an ultrasonic cleaner. These devices combine high-end technology and efficiency to provide unstoppable gem-scouring power! Bonus: Ultrasonic cleaners are completely hands-off when it comes to grime. You won't even have to get your hands dirty. Try good old-fashioned baking soda. Baking soda has an amazing amount of cleaning uses, and can also get the grime off of your jewelry. Combine the baking soda with water to create a paste, then use a soft brush to gently scrub your gems and metals. Next, dry and polish the ring with a lint-free cloth and your jewelry will shine. (If your jewelry is very dirty, a stronger chemical solution will get your diamonds and gems sparkling better.) Use an ammonia cleaner. If you use ammonia, you'll know that it is a very strong chemical — cut the solution with water. Typically, one part ammonia to three parts water will make a safe solution that won't harm your jewelry.",
  "tyn_model":[
    "water",
    "baking soda",
    "glass cleaner",
    "window cleaner",
    "bowl",
    "gems",
    "ultrasonic cleaner",
    "ammonia",
    "toothbrush",
    "regular glass cleaner",
    "diamonds",
    "ultrasonic cleaners",
    "ammonia cleaner",
    "— cut"
  ],
  "tyn_section":[

  ]
}