{
  "title":"How to Make Mini Blueberry Muffins",
  "url":"https://www.wikihow.com/Make-Mini-Blueberry-Muffins",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Muffins"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350ºF/180ºC.",
      "description":""
    },
    {
      "headline":"Combine and sift the flour, baking powder, and salt together in a medium mixing bowl.",
      "description":""
    },
    {
      "headline":"Use a mixer to cream the sugar and butter together in a large mixing bowl.",
      "description":""
    },
    {
      "headline":"Mix in the egg and applesauce into the butter mixture.",
      "description":""
    },
    {
      "headline":"Alternate pouring and mixing while adding the milk and flour into the bowl.",
      "description":"You want to achieve a smooth batter."
    },
    {
      "headline":"Fold in the blueberries last.",
      "description":""
    },
    {
      "headline":"Pour the batter into the mini muffin tins, about two thirds full.",
      "description":""
    },
    {
      "headline":"Bake 350 degrees for 10 to 12 minutes, or until golden brown.",
      "description":""
    },
    {
      "headline":"Check the muffins to see if they have been baked fully by inserting a toothpick into the centre of a muffin.",
      "description":"If the toothpick is clean when it has been removed form the muffin, the muffins have finished baking. If the toothpick has batter on it when it has been removed from the muffin, leave the muffins in the oven to bake for a few more minutes. Test again until the toothpick is clean when it has been removed from the muffin."
    },
    {
      "headline":"Cool.",
      "description":"Leave the muffins in the pan for ten minutes. Remove the muffins from the pan onto a cooling rack."
    },
    {
      "headline":"Serve.",
      "description":"These make an ideal addition to the lunchbox or as hiker's snacks."
    }
  ],
  "text":" Preheat the oven to 350ºF/180ºC.  Combine and sift the flour, baking powder, and salt together in a medium mixing bowl.  Use a mixer to cream the sugar and butter together in a large mixing bowl.  Mix in the egg and applesauce into the butter mixture.  Alternate pouring and mixing while adding the milk and flour into the bowl. You want to achieve a smooth batter. Fold in the blueberries last.  Pour the batter into the mini muffin tins, about two thirds full.  Bake 350 degrees for 10 to 12 minutes, or until golden brown.  Check the muffins to see if they have been baked fully by inserting a toothpick into the centre of a muffin. If the toothpick is clean when it has been removed form the muffin, the muffins have finished baking. If the toothpick has batter on it when it has been removed from the muffin, leave the muffins in the oven to bake for a few more minutes. Test again until the toothpick is clean when it has been removed from the muffin. Cool. Leave the muffins in the pan for ten minutes. Remove the muffins from the pan onto a cooling rack. Serve. These make an ideal addition to the lunchbox or as hiker's snacks.",
  "tyn_model":[
    "oven",
    "flour",
    "butter",
    "pan",
    "baking powder",
    "salt",
    "medium mixing bowl",
    "mixer",
    "sugar",
    "applesauce",
    "milk",
    "bowl",
    "blueberries",
    "mini muffin tins"
  ],
  "tyn_section":[

  ]
}