{
  "title":"How to Deter Thieves with a Video Monitoring System",
  "url":"https://www.wikihow.com/Deter-Thieves-with-a-Video-Monitoring-System",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "methods":[
    {
      "name":"Deterring Theft at Your Business",
      "steps":[
        {
          "headline":"Install cameras in conspicuous locations.",
          "description":"Potential thieves must know that they are being monitored by video cameras in order for the system to deter them. Accordingly, place your cameras in places where they will be noticed. Ideally, these cameras will also cover those areas that cannot be easily monitored by on-duty staff. For instance, hallways or other areas of a building that are relatively obscured are ideal locations for video cameras. If deterrence is your only goal, you can save money by using fake cameras. Fake cameras look exactly the same as real security cameras, and may be equally effective in deterring potential thieves."
        },
        {
          "headline":"Place signs to deter customer theft.",
          "description":"Place signs notifying customers that they are being monitored via video. Signs alone can deter potential thieves from attempting to steal from your business. Place signs near the entrance, as well as any areas that are not easily monitored by staff. Further, place signs within dressing rooms and restrooms that notify customers that shoplifters will be prosecuted."
        },
        {
          "headline":"Monitor employees.",
          "description":"Retail and production employees are sometimes guilty of theft. In fact, in the U.S. alone, dozens of billions of dollars’ worth of goods are stolen by businesses’ employees each year. Potential thieves on your staff may be deterred by video monitoring systems. However, they may also be aware of any gaps in the camera’s coverage, so video monitoring systems alone cannot prevent employee theft. To prevent and diminish losses, install cameras covering your most valuable wares. For instance, place a camera in all storage areas, as well as those areas where any expensive equipment is kept. Only grant access to information about your video monitoring system to the minimum number of staff to ensure it can be used effectively."
        },
        {
          "headline":"Keep back entrances covered.",
          "description":"An important place to monitor is your business’s back entrance. Placing a camera in this location will help deter anyone attempting to exit unnoticed or trying to enter with quick access to any back offices. Further, cameras on back entrances allow you to monitor anybody and anything that may come and go out your back door. Make sure the camera is visible from within the building if you’re hoping to deter retail theft. If you have a loading dock, install a camera outside to allow employees to check to make sure no one is waiting to break in before opening a back door."
        },
        {
          "headline":"Place a camera at transaction locations.",
          "description":"Cameras at cash registers and other places where money is handled can prevent both customer and employee theft. Cameras in these locations work best when they have a view from above, and can directly monitor any exchange of cash. Cameras of this sort may be especially effective in deterring theft in a retail or service environment."
        },
        {
          "headline":"Consider keeping your doors locked and under surveillance.",
          "description":"Businesses that are prime target for theft, such as jewelry retailers or factories that produce expensive goods may benefit from a monitored entrance system. Install a lock and camera at each entrance to the facility. This will help ensure you can control who is allowed into the facility. The presence of camera at the front door means that you also have footage of everyone who enters, thus deterring any criminal behavior."
        },
        {
          "headline":"Account for legal concerns.",
          "description":"There are legal concerns associated with using a video monitoring system. Laws governing these technologies vary depending on state and country. Usually, you are allowed to monitor public areas. However, make sure every camera you install is positioned and operated legally. Often, employee break rooms are off-limits for cameras. Never place a camera in a restroom or locker room. As a rule of thumb, do not install a camera anywhere someone may have a reasonable expectation of privacy. If you are unsure, speak with a lawyer in your area about the legality of a video monitoring system on your premises."
        }
      ]
    },
    {
      "name":"Installing a Video Monitoring System at Home",
      "steps":[
        {
          "headline":"Place cameras outside your home.",
          "description":"The exterior of your home is particularly important, as potential thieves who see the cameras may immediately be deterred. Place cameras in locations that cover all entrances to both the property and your home itself. If you have gates or garages, don’t forget to train cameras on their entrances as well. Cover any doors into your home, as well as large windows, with a clearly visible camera. If your primary motivation for installing a video monitoring system is deterrence, consider installing fake cameras. Since these cameras will look just like real security cameras, they can be equally effective in deterring potential thieves. You can acquire fake cameras from a hardware store or online."
        },
        {
          "headline":"Post signs indicating surveillance.",
          "description":"Whether or not you actually install cameras, post signs that say the area is under video surveillance. This alone may help deter thieves. Of course, if a potential thief can see cameras, they are more likely to be deterred. Check to see if the company who made your cameras also provides security signs. You can also purchase these sorts of signs from hardware stores or online. Put signs in locations that are clearly visible. Place window clings on exterior doors and ground floor windows. Also place signs on any gates to your property."
        },
        {
          "headline":"Respect your friends’ and family’s privacy.",
          "description":"Minimize the number of cameras inside your home. While cameras outside your home can deter thieves from entering, cameras inside your home may make your family members or visitors uncomfortable. Never place cameras in bedrooms or bathrooms, or any other area where people might assume privacy. Do not record audio on home security systems. While some video monitoring systems also offer the capability to record audio, this is illegal in some places. Further, audio recording is unlikely to help deter theft."
        },
        {
          "headline":"Consider a monitored alarm system.",
          "description":"For a home environment, monitored alarm systems may be the best option for security. These alarm systems can be used with or without a video monitoring system. The major benefit of a monitored alarm system is that they can help interrupt a theft in progress. Most monitored alarm systems rely on security professionals monitoring your video and/or alarm system in a monitoring center. These centers are staffed 24 hours a day, and will contact you or law enforcement if a theft or other crime occurs."
        },
        {
          "headline":"Weigh other home security options.",
          "description":"Modern security systems include many options. In addition to video monitoring systems, you can install perimeter alarms, motion sensors, and automatic locks and lights. You can even incorporate smoke and carbon monoxide detectors into a home security system. All of these features can be part of a monitored alarm system, or you can install them yourself to deter or interrupt crimes and ensure you and your family’s safety."
        }
      ]
    },
    {
      "name":"Selecting the Right Cameras",
      "steps":[
        {
          "headline":"Picking the right type of cameras.",
          "description":"There are innumerable types of video monitoring systems. One of the most important components is the type of cameras you choose to use. Choose a camera based on your location, intended use, and necessary image quality. The higher a camera’s resolution, the greater picture quality it will provide. Some cameras have special features, such as panning, tilting, zooming, and night vision. For deterrence, you’ll likely want to opt for overt cameras, which are designed to be plainly visible. Covert cameras – such as those hidden within a speaker or smoke detector – can help identify a recurring issue with theft by capturing a crime without the perpetrator knowing. Discreet cameras may be best for some environments. These are visible to someone who is looking, but will not negatively affect the feel of an environment. An example is a dome camera, covered by an unobtrusive glass dome."
        },
        {
          "headline":"Weigh the benefits of box cameras.",
          "description":"Box cameras are the most common type of security camera, as they can be fitted with different types of lenses for particular uses. They are often usable both outdoors and indoors. They also usually offer good enough resolution and “noise reduction” – which prevents blurriness – to function adequately as security cameras. Expect to pay between $130 and $470 for each box camera you use."
        },
        {
          "headline":"Consider using dome cameras.",
          "description":"Dome cameras are more popular in office environments, or other places where there is concern about the visual impact of security cameras. Dome cameras also have a variety of capabilities, including infrared and low-light monitoring. These are also especially resistant to weather and criminal tampering. Dome cameras usually have a shorter depth of vision compared to box cameras. #*Expect to pay anywhere from $90 to $1,300 per camera. Dome cameras offer the best pan/zoom/tilt capability, including the potential to zoom in 60x and offer a 360-degree view. Costs can rise as high as $11,300 each for the highest-resolution models."
        },
        {
          "headline":"Ensure you have adequate frame rate.",
          "description":"If the main utility of your video monitoring system is deterrence, you may not need high quality cameras. Frame rate, measured in frames per second (fps), is usually 6 to 10 fps for security cameras. However, if you hope to record and identify criminals, you need cameras that will be able to clearly identify perpetrators. Choose a camera with higher frame rate for improved image quality – 30mps is considered “full motion.” These are more expensive and produce video that requires large amounts of storage capacity."
        },
        {
          "headline":"Choose a camera with the right LUX capabilities.",
          "description":"A camera’s lux refers to its ability to shoot footage in various levels of light. A 10,000 LUX means a camera can take quality footage in bright light, while 0 LUX means that the camera can shoot in total darkness. If a camera will be located in full sun, choose an option with at least a 7,000 LUX. For surveillance areas during the night, opt for an option with as low a LUX rating as possible – ideally between 0.5 and 0.1."
        },
        {
          "headline":"Ensure adequate signal to noise ratio.",
          "description":"A camera’s signal – or the actual picture acquired – can be distorted by outside factors, called noise. The ratio of signal to noise (measured in db) varies from camera to camera, and is especially important when your video monitoring system will be in close proximity to other electrical components. Shoot for at least 40db signal to noise ratio. Whereas 20 to 30db may result in a grainy feed, 60db would provide static-free video."
        },
        {
          "headline":"Consider a special lens.",
          "description":"An extremely important component of a camera is its lens. The quality of a lens will determine the camera’s ability to shoot at different distances, or in a wide angle format. Lenses are often sold separately from cameras, especially on high-end models. This allows you to choose the lenses that are ideal for the environment you’ll be monitoring. Opt for a fixed focal length lens for a camera with a stationary point of view. These lenses are the cheapest, at $46 to $400 each. Use variable focal length lenses if you want to be able to adjust a camera’s focus. Lenses of this sort will allow you to manually adjust your field of view, and will cost between $40 and $660 depending on the range of the focal length. Motorized zoom lenses allow you to control your video image remotely. Namely, you’ll be able to zoom anywhere from 2x to 60x. Costs for these lenses start around $700. The strongest zoom lenses can cost nearly $10,000 each!"
        }
      ]
    },
    {
      "name":"Choosing Other Components of a Video Monitoring System",
      "steps":[
        {
          "headline":"Determine whether you need a hard-wired or wireless system.",
          "description":"Cameras can either be hardwired and feed directly to monitors, or send footage over a wireless network. Wired systems are much cheaper, and can potentially be more secure. However, wireless systems can more easily be installed, and may even be necessary in certain environments. Your video monitoring system can also include some cameras that are wired, and some that are wireless. Expect to pay from $400 to $2,400 or more for a video monitoring system, based mostly on the number and quality of cameras you need. Package deals that include cameras, monitors, and storage equipment can help keep costs low."
        },
        {
          "headline":"Select monitors to view security footage.",
          "description":"To view live security footage, you’ll need to set up your cameras to feed the footage to monitors. Size and type of monitoring screens should be determined by the clarity of the image you need, as well as the number of video feeds you hope to monitor. Choose a large screen to allow the simultaneous monitoring of several camera feeds. Monitors are the least important component of your video monitoring system. Most LCD or LED flat screens will be more than adequate to show security footage. In an LCD monitor, look for a resolution of at least 1366 x 768 and a high contrast ratio of about 3500:1. These will cost between $350 and $8,000 per screen, depending on size. Choose an LED screen if the footage will be viewed in a brightly lit place, or will endure a great deal of use. Shoot for an LED with a resolution of 1280 x 1024 and a contrast ratio of about 1000:1. Expect to pay between $200 and $1,200. Ideally, match the resolution of the camera you’re using to the resolution the monitor is capable of supporting."
        },
        {
          "headline":"Consider your video storage approach.",
          "description":"If you want to be able to view recorded security footage, you need equipment to allow you to do so. First, decide between storage on a hard drive at your facility, or automatic storage to an online platform. The number of cameras you use and the amount of footage you hope to store will determine how much storage you need. You will likely need more storage that you think. Talk to a video monitoring system dealer or use an online storage calculator to help determine how much storage you’ll need."
        }
      ]
    }
  ],
  "text":" Deterring Theft at Your Business Install cameras in conspicuous locations. Potential thieves must know that they are being monitored by video cameras in order for the system to deter them. Accordingly, place your cameras in places where they will be noticed. Ideally, these cameras will also cover those areas that cannot be easily monitored by on-duty staff. For instance, hallways or other areas of a building that are relatively obscured are ideal locations for video cameras. If deterrence is your only goal, you can save money by using fake cameras. Fake cameras look exactly the same as real security cameras, and may be equally effective in deterring potential thieves. Place signs to deter customer theft. Place signs notifying customers that they are being monitored via video. Signs alone can deter potential thieves from attempting to steal from your business. Place signs near the entrance, as well as any areas that are not easily monitored by staff. Further, place signs within dressing rooms and restrooms that notify customers that shoplifters will be prosecuted. Monitor employees. Retail and production employees are sometimes guilty of theft. In fact, in the U.S. alone, dozens of billions of dollars’ worth of goods are stolen by businesses’ employees each year. Potential thieves on your staff may be deterred by video monitoring systems. However, they may also be aware of any gaps in the camera’s coverage, so video monitoring systems alone cannot prevent employee theft. To prevent and diminish losses, install cameras covering your most valuable wares. For instance, place a camera in all storage areas, as well as those areas where any expensive equipment is kept. Only grant access to information about your video monitoring system to the minimum number of staff to ensure it can be used effectively. Keep back entrances covered. An important place to monitor is your business’s back entrance. Placing a camera in this location will help deter anyone attempting to exit unnoticed or trying to enter with quick access to any back offices. Further, cameras on back entrances allow you to monitor anybody and anything that may come and go out your back door. Make sure the camera is visible from within the building if you’re hoping to deter retail theft. If you have a loading dock, install a camera outside to allow employees to check to make sure no one is waiting to break in before opening a back door. Place a camera at transaction locations. Cameras at cash registers and other places where money is handled can prevent both customer and employee theft. Cameras in these locations work best when they have a view from above, and can directly monitor any exchange of cash. Cameras of this sort may be especially effective in deterring theft in a retail or service environment. Consider keeping your doors locked and under surveillance. Businesses that are prime target for theft, such as jewelry retailers or factories that produce expensive goods may benefit from a monitored entrance system. Install a lock and camera at each entrance to the facility. This will help ensure you can control who is allowed into the facility. The presence of camera at the front door means that you also have footage of everyone who enters, thus deterring any criminal behavior. Account for legal concerns. There are legal concerns associated with using a video monitoring system. Laws governing these technologies vary depending on state and country. Usually, you are allowed to monitor public areas. However, make sure every camera you install is positioned and operated legally. Often, employee break rooms are off-limits for cameras. Never place a camera in a restroom or locker room. As a rule of thumb, do not install a camera anywhere someone may have a reasonable expectation of privacy. If you are unsure, speak with a lawyer in your area about the legality of a video monitoring system on your premises. Installing a Video Monitoring System at Home Place cameras outside your home. The exterior of your home is particularly important, as potential thieves who see the cameras may immediately be deterred. Place cameras in locations that cover all entrances to both the property and your home itself. If you have gates or garages, don’t forget to train cameras on their entrances as well. Cover any doors into your home, as well as large windows, with a clearly visible camera. If your primary motivation for installing a video monitoring system is deterrence, consider installing fake cameras. Since these cameras will look just like real security cameras, they can be equally effective in deterring potential thieves. You can acquire fake cameras from a hardware store or online. Post signs indicating surveillance. Whether or not you actually install cameras, post signs that say the area is under video surveillance. This alone may help deter thieves. Of course, if a potential thief can see cameras, they are more likely to be deterred. Check to see if the company who made your cameras also provides security signs. You can also purchase these sorts of signs from hardware stores or online. Put signs in locations that are clearly visible. Place window clings on exterior doors and ground floor windows. Also place signs on any gates to your property. Respect your friends’ and family’s privacy. Minimize the number of cameras inside your home. While cameras outside your home can deter thieves from entering, cameras inside your home may make your family members or visitors uncomfortable. Never place cameras in bedrooms or bathrooms, or any other area where people might assume privacy. Do not record audio on home security systems. While some video monitoring systems also offer the capability to record audio, this is illegal in some places. Further, audio recording is unlikely to help deter theft. Consider a monitored alarm system. For a home environment, monitored alarm systems may be the best option for security. These alarm systems can be used with or without a video monitoring system. The major benefit of a monitored alarm system is that they can help interrupt a theft in progress. Most monitored alarm systems rely on security professionals monitoring your video and/or alarm system in a monitoring center. These centers are staffed 24 hours a day, and will contact you or law enforcement if a theft or other crime occurs. Weigh other home security options. Modern security systems include many options. In addition to video monitoring systems, you can install perimeter alarms, motion sensors, and automatic locks and lights. You can even incorporate smoke and carbon monoxide detectors into a home security system. All of these features can be part of a monitored alarm system, or you can install them yourself to deter or interrupt crimes and ensure you and your family’s safety. Selecting the Right Cameras Picking the right type of cameras. There are innumerable types of video monitoring systems. One of the most important components is the type of cameras you choose to use. Choose a camera based on your location, intended use, and necessary image quality. The higher a camera’s resolution, the greater picture quality it will provide. Some cameras have special features, such as panning, tilting, zooming, and night vision. For deterrence, you’ll likely want to opt for overt cameras, which are designed to be plainly visible. Covert cameras – such as those hidden within a speaker or smoke detector – can help identify a recurring issue with theft by capturing a crime without the perpetrator knowing. Discreet cameras may be best for some environments. These are visible to someone who is looking, but will not negatively affect the feel of an environment. An example is a dome camera, covered by an unobtrusive glass dome. Weigh the benefits of box cameras. Box cameras are the most common type of security camera, as they can be fitted with different types of lenses for particular uses. They are often usable both outdoors and indoors. They also usually offer good enough resolution and “noise reduction” – which prevents blurriness – to function adequately as security cameras. Expect to pay between $130 and $470 for each box camera you use. Consider using dome cameras. Dome cameras are more popular in office environments, or other places where there is concern about the visual impact of security cameras. Dome cameras also have a variety of capabilities, including infrared and low-light monitoring. These are also especially resistant to weather and criminal tampering. Dome cameras usually have a shorter depth of vision compared to box cameras. #*Expect to pay anywhere from $90 to $1,300 per camera. Dome cameras offer the best pan/zoom/tilt capability, including the potential to zoom in 60x and offer a 360-degree view. Costs can rise as high as $11,300 each for the highest-resolution models. Ensure you have adequate frame rate. If the main utility of your video monitoring system is deterrence, you may not need high quality cameras. Frame rate, measured in frames per second (fps), is usually 6 to 10 fps for security cameras. However, if you hope to record and identify criminals, you need cameras that will be able to clearly identify perpetrators. Choose a camera with higher frame rate for improved image quality – 30mps is considered “full motion.” These are more expensive and produce video that requires large amounts of storage capacity. Choose a camera with the right LUX capabilities. A camera’s lux refers to its ability to shoot footage in various levels of light. A 10,000 LUX means a camera can take quality footage in bright light, while 0 LUX means that the camera can shoot in total darkness. If a camera will be located in full sun, choose an option with at least a 7,000 LUX. For surveillance areas during the night, opt for an option with as low a LUX rating as possible – ideally between 0.5 and 0.1. Ensure adequate signal to noise ratio. A camera’s signal – or the actual picture acquired – can be distorted by outside factors, called noise. The ratio of signal to noise (measured in db) varies from camera to camera, and is especially important when your video monitoring system will be in close proximity to other electrical components. Shoot for at least 40db signal to noise ratio. Whereas 20 to 30db may result in a grainy feed, 60db would provide static-free video. Consider a special lens. An extremely important component of a camera is its lens. The quality of a lens will determine the camera’s ability to shoot at different distances, or in a wide angle format. Lenses are often sold separately from cameras, especially on high-end models. This allows you to choose the lenses that are ideal for the environment you’ll be monitoring. Opt for a fixed focal length lens for a camera with a stationary point of view. These lenses are the cheapest, at $46 to $400 each. Use variable focal length lenses if you want to be able to adjust a camera’s focus. Lenses of this sort will allow you to manually adjust your field of view, and will cost between $40 and $660 depending on the range of the focal length. Motorized zoom lenses allow you to control your video image remotely. Namely, you’ll be able to zoom anywhere from 2x to 60x. Costs for these lenses start around $700. The strongest zoom lenses can cost nearly $10,000 each! Choosing Other Components of a Video Monitoring System Determine whether you need a hard-wired or wireless system. Cameras can either be hardwired and feed directly to monitors, or send footage over a wireless network. Wired systems are much cheaper, and can potentially be more secure. However, wireless systems can more easily be installed, and may even be necessary in certain environments. Your video monitoring system can also include some cameras that are wired, and some that are wireless. Expect to pay from $400 to $2,400 or more for a video monitoring system, based mostly on the number and quality of cameras you need. Package deals that include cameras, monitors, and storage equipment can help keep costs low. Select monitors to view security footage. To view live security footage, you’ll need to set up your cameras to feed the footage to monitors. Size and type of monitoring screens should be determined by the clarity of the image you need, as well as the number of video feeds you hope to monitor. Choose a large screen to allow the simultaneous monitoring of several camera feeds. Monitors are the least important component of your video monitoring system. Most LCD or LED flat screens will be more than adequate to show security footage. In an LCD monitor, look for a resolution of at least 1366 x 768 and a high contrast ratio of about 3500:1. These will cost between $350 and $8,000 per screen, depending on size. Choose an LED screen if the footage will be viewed in a brightly lit place, or will endure a great deal of use. Shoot for an LED with a resolution of 1280 x 1024 and a contrast ratio of about 1000:1. Expect to pay between $200 and $1,200. Ideally, match the resolution of the camera you’re using to the resolution the monitor is capable of supporting. Consider your video storage approach. If you want to be able to view recorded security footage, you need equipment to allow you to do so. First, decide between storage on a hard drive at your facility, or automatic storage to an online platform. The number of cameras you use and the amount of footage you hope to store will determine how much storage you need. You will likely need more storage that you think. Talk to a video monitoring system dealer or use an online storage calculator to help determine how much storage you’ll need.",
  "tyn_model":[
    "cameras",
    "camera",
    "video monitoring",
    "monitors",
    "video monitoring system",
    "lens",
    "lenses",
    "– can",
    "dome",
    "zoom lenses",
    "’ worth",
    "’ employees",
    "’ and",
    "carbon monoxide detectors",
    "– such",
    "“noise",
    "” –",
    "– to",
    "box camera",
    "dome cameras",
    "– 30mps",
    "“full",
    "” these",
    "– ideally",
    "– or",
    "monitor",
    "video monitoring system dealer"
  ],
  "tyn_section":[

  ]
}