{
  "title":"How to Make a Sauna Oil Blend",
  "url":"https://www.wikihow.com/Make-a-Sauna-Oil-Blend",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "steps":[
    {
      "headline":"Obtain one or more of the essential oils that are considered to be beneficial for use in a sauna.",
      "description":"These include lavender, pine, grapefruit, eucalyptus, lime, rosemary, lemon and birch."
    },
    {
      "headline":"Single method: If you are using just one essential oil, place 3 - 4 drops of your desired essential oil into the water bucket intended for the hot coals.",
      "description":"It is now ready to be added to the sauna coals."
    },
    {
      "headline":"Blended method: If you are making a special blend that will release several essential oil scents at once, follow the suggested oils above and create a blend.",
      "description":"One energizing and detoxing blend is:\n3 drops pine\n3 drops rosemary\n4 drops lime\n8 drops grapefruit"
    },
    {
      "headline":"Experiment with your own blends using the suggested essential oils above, provided that you are confident with blending.",
      "description":"If in doubt as to quantities, ask your oil supplier for advice or do research in a trusted aromatherapy manual. If you are unsure for any reason, stick with the single essential oil addition. With any blend, only add 3 - 4 drops of the resulting blend per bucket of water at a time."
    },
    {
      "headline":"Sit back, relax and breathe deeply.",
      "description":""
    }
  ],
  "text":" Obtain one or more of the essential oils that are considered to be beneficial for use in a sauna. These include lavender, pine, grapefruit, eucalyptus, lime, rosemary, lemon and birch. Single method: If you are using just one essential oil, place 3 - 4 drops of your desired essential oil into the water bucket intended for the hot coals. It is now ready to be added to the sauna coals. Blended method: If you are making a special blend that will release several essential oil scents at once, follow the suggested oils above and create a blend. One energizing and detoxing blend is:\n3 drops pine\n3 drops rosemary\n4 drops lime\n8 drops grapefruit Experiment with your own blends using the suggested essential oils above, provided that you are confident with blending. If in doubt as to quantities, ask your oil supplier for advice or do research in a trusted aromatherapy manual. If you are unsure for any reason, stick with the single essential oil addition. With any blend, only add 3 - 4 drops of the resulting blend per bucket of water at a time. Sit back, relax and breathe deeply. ",
  "tyn_model":[
    "essential oil",
    "essential oils",
    "pine",
    "lime",
    "rosemary",
    "water",
    "lemon",
    "birch",
    "grapefruit",
    "aromatherapy manual"
  ],
  "tyn_section":[

  ]
}