{
  "title":"How to Buy Vintage Typewriters",
  "url":"https://www.wikihow.com/Buy-Vintage-Typewriters",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Collecting",
    "Antiques"
  ],
  "methods":[
    {
      "name":"Choosing Your Type of Vintage Typewriter",
      "steps":[
        {
          "headline":"Opt for a Standard if you plan on heavy use.",
          "description":"Standards, which usually weigh between 15 to 25 pounds (6.8 to 11.3 kg), can take up a lot of space in your desk or writing office, but they're made to be used frequently. If you want a typewriter for daily use, consider a Standard so you don't have to worry about maintenance and repair."
        },
        {
          "headline":"Select a Portable for a lightweight option.",
          "description":"Portable typewriters are built to fit in a carrying case and are therefore great to travel with. However, they may not perform well and are traditionally more fragile than Standard typewriters."
        },
        {
          "headline":"Set your budget.",
          "description":"If you're not careful with your typewriter selection, you can end up paying over $600, so make sure you set your budget before you start looking. You can easily find a vintage typewriter that works for less than $200, though there's a chance it won't be refurbished or might have some minor issues. One way to keep costs down is to purchase a damaged or even broken typewriter and take it to a repair shop. Even better: fix it yourself! Portables are currently more popular than Standard typewriters because of their attractive cases, so they can be more expensive. The older your typewriter, the more expensive it will be. The most reasonably priced typewriters will be ones that were manufactured in the 1980s and '90s."
        }
      ]
    },
    {
      "name":"Browsing the Internet",
      "steps":[
        {
          "headline":"Monitor eBay for cheaper typewriters.",
          "description":"Typewriters on eBay are traditionally cheap because many eBay sellers don't know much about typewriters. However, these auctions can also be a gamble because there is no guarantee of condition. Oftentimes, the seller does not even know how to tell if a typewriter is in good condition or not. If you purchase a typewriter from an unknowledgeable seller, make sure they know how to properly pack their typewriter. The typewriter should be placed in a box with 4 inches (10 cm) of space on every side, and then filled with bubble wrap, foam plastic or shipping peanuts. The carriage release lever should be rubber banded down so that the carriage can slide left. This prevents damage to the escapement which is a sensitive mechanism deep inside the machine. The cast iron on Standard sized machines is easily broken in shipment if not properly packaged."
        },
        {
          "headline":"Try Etsy for more knowledgeable sellers.",
          "description":"Etsy sellers may be in the habit of selling multiple typewriters, and should therefore be able to provide better information about the typewriter quality. However, Etsy sellers may be in the practice of purchasing cheap typewriters and reselling them at a higher value, so be prepared to pay more on Etsy."
        },
        {
          "headline":"Buy from a trusted online seller to guarantee quality.",
          "description":"Online websites like http://www.typewriters101.com, http://www.vintagetypewritershoppe.com, and http://mytypewriter.com are great options because they can tell you about the typewriter condition and tend to price typewriters fairly. You can also find a wide variety of typewriters on these sites, so if you have a particular typewriter in mind this might be your best bet."
        },
        {
          "headline":"Check the return policy before you purchase.",
          "description":"Ideally, your typewriter vendor will have a full or partial return policy. This helps cover you in the case of a poor-quality product or one that was damaged in transit."
        }
      ]
    },
    {
      "name":"Finding Typewriters in Person",
      "steps":[
        {
          "headline":"Shop at antique stores.",
          "description":"You'll have a relatively easy time finding typewriters at antique stores, but when purchasing from antique stores, you should be wary of overpricing. Antique store owners are often aware of the value of their vintage typewriters, so they may overprice their typewriters or try to sell you one that's in bad shape. Always ask to use the typewriter before purchasing."
        },
        {
          "headline":"Find flea markets that specialize in antiques.",
          "description":"While an everyday flea market probably won't have vintage typewriters, antique flea markets often do. Because of the volume and nature of the wares, these one-day sales can be better deals than most other reliable vintage stores. If you're on a budget and don't have a specific typewriter in mind, this could be the place for you!"
        },
        {
          "headline":"Check out donation stores.",
          "description":"Donation stores like Goodwill and Salvation Army may have old typewriters that have been donated by someone who does not need or want it anymore. While there is a good chance that these typewriters are partially or completely broken, there's also a chance you'll find that perfect, hidden typewriter in the back of the store, just waiting for you."
        },
        {
          "headline":"Visit garage and estate sales.",
          "description":"Finding a typewriter at a garage or estate sale can take a lot of patience, but you can usually get a great deal if you do find one. If you're hunting for vintage typewriters in these types of sales, make sure you arrive early! There will probably be others in your area who have the same idea."
        }
      ]
    },
    {
      "name":"Repairing a Broken Typewriter",
      "steps":[
        {
          "headline":"Reinstall the ribbon or ribbon spool.",
          "description":"A broken or spent ribbon spool is the most common problem in old typewriters, and unless you bought one that was being used, you'll probably have to change yours out before using your typewriter. Consult your typewriter's handbook if you're not sure how to change the ribbon spool, or ask your local typewriter repair shop for a walk-through. To change the ribbon spool, lift the ribbon cover and find the lock key that holds the carriage in place. Wind the old ribbon on the hand spool and remove. Place the new ribbon on the right-hand side, and secure the loose end of the ribbon on the left spool. Thread the ribbon and wind as necessary. If you're currently using the ribbon and you see the ink dull, that's a sign you need a new one!"
        },
        {
          "headline":"Refurbish surface-issues.",
          "description":"Remove any material that's sticking to the typewriter. Gently wipe off dirt and grease with a cotton ball dipped in water. Trim ragged or torn leather edges and glue down any loose pieces with superglue. Repair any damage to a Portable typewriter wooden case with wood glue. Let the glue dry for 24 hours before moving. If your typewriter is rusty, use rust remover carefully. Never leave rust remover on a metal surface without observation."
        },
        {
          "headline":"Take serious issues to a licensed repair shop.",
          "description":"Attempting to fix a seriously broken typewriter on your own will probably only lead to further damage. Resist the urge to tinker with the typewriter and instead find a local repair shop that can help. If there is no shop that can help you locally, find a repair shop online that accepts shipped typewriters for repair."
        }
      ]
    }
  ],
  "text":" Choosing Your Type of Vintage Typewriter Opt for a Standard if you plan on heavy use. Standards, which usually weigh between 15 to 25 pounds (6.8 to 11.3 kg), can take up a lot of space in your desk or writing office, but they're made to be used frequently. If you want a typewriter for daily use, consider a Standard so you don't have to worry about maintenance and repair. Select a Portable for a lightweight option. Portable typewriters are built to fit in a carrying case and are therefore great to travel with. However, they may not perform well and are traditionally more fragile than Standard typewriters. Set your budget. If you're not careful with your typewriter selection, you can end up paying over $600, so make sure you set your budget before you start looking. You can easily find a vintage typewriter that works for less than $200, though there's a chance it won't be refurbished or might have some minor issues. One way to keep costs down is to purchase a damaged or even broken typewriter and take it to a repair shop. Even better: fix it yourself! Portables are currently more popular than Standard typewriters because of their attractive cases, so they can be more expensive. The older your typewriter, the more expensive it will be. The most reasonably priced typewriters will be ones that were manufactured in the 1980s and '90s. Browsing the Internet Monitor eBay for cheaper typewriters. Typewriters on eBay are traditionally cheap because many eBay sellers don't know much about typewriters. However, these auctions can also be a gamble because there is no guarantee of condition. Oftentimes, the seller does not even know how to tell if a typewriter is in good condition or not. If you purchase a typewriter from an unknowledgeable seller, make sure they know how to properly pack their typewriter. The typewriter should be placed in a box with 4 inches (10 cm) of space on every side, and then filled with bubble wrap, foam plastic or shipping peanuts. The carriage release lever should be rubber banded down so that the carriage can slide left. This prevents damage to the escapement which is a sensitive mechanism deep inside the machine. The cast iron on Standard sized machines is easily broken in shipment if not properly packaged. Try Etsy for more knowledgeable sellers. Etsy sellers may be in the habit of selling multiple typewriters, and should therefore be able to provide better information about the typewriter quality. However, Etsy sellers may be in the practice of purchasing cheap typewriters and reselling them at a higher value, so be prepared to pay more on Etsy. Buy from a trusted online seller to guarantee quality. Online websites like http://www.typewriters101.com, http://www.vintagetypewritershoppe.com, and http://mytypewriter.com are great options because they can tell you about the typewriter condition and tend to price typewriters fairly. You can also find a wide variety of typewriters on these sites, so if you have a particular typewriter in mind this might be your best bet. Check the return policy before you purchase. Ideally, your typewriter vendor will have a full or partial return policy. This helps cover you in the case of a poor-quality product or one that was damaged in transit. Finding Typewriters in Person Shop at antique stores. You'll have a relatively easy time finding typewriters at antique stores, but when purchasing from antique stores, you should be wary of overpricing. Antique store owners are often aware of the value of their vintage typewriters, so they may overprice their typewriters or try to sell you one that's in bad shape. Always ask to use the typewriter before purchasing. Find flea markets that specialize in antiques. While an everyday flea market probably won't have vintage typewriters, antique flea markets often do. Because of the volume and nature of the wares, these one-day sales can be better deals than most other reliable vintage stores. If you're on a budget and don't have a specific typewriter in mind, this could be the place for you! Check out donation stores. Donation stores like Goodwill and Salvation Army may have old typewriters that have been donated by someone who does not need or want it anymore. While there is a good chance that these typewriters are partially or completely broken, there's also a chance you'll find that perfect, hidden typewriter in the back of the store, just waiting for you. Visit garage and estate sales. Finding a typewriter at a garage or estate sale can take a lot of patience, but you can usually get a great deal if you do find one. If you're hunting for vintage typewriters in these types of sales, make sure you arrive early! There will probably be others in your area who have the same idea. Repairing a Broken Typewriter Reinstall the ribbon or ribbon spool. A broken or spent ribbon spool is the most common problem in old typewriters, and unless you bought one that was being used, you'll probably have to change yours out before using your typewriter. Consult your typewriter's handbook if you're not sure how to change the ribbon spool, or ask your local typewriter repair shop for a walk-through. To change the ribbon spool, lift the ribbon cover and find the lock key that holds the carriage in place. Wind the old ribbon on the hand spool and remove. Place the new ribbon on the right-hand side, and secure the loose end of the ribbon on the left spool. Thread the ribbon and wind as necessary. If you're currently using the ribbon and you see the ink dull, that's a sign you need a new one! Refurbish surface-issues. Remove any material that's sticking to the typewriter. Gently wipe off dirt and grease with a cotton ball dipped in water. Trim ragged or torn leather edges and glue down any loose pieces with superglue. Repair any damage to a Portable typewriter wooden case with wood glue. Let the glue dry for 24 hours before moving. If your typewriter is rusty, use rust remover carefully. Never leave rust remover on a metal surface without observation. Take serious issues to a licensed repair shop. Attempting to fix a seriously broken typewriter on your own will probably only lead to further damage. Resist the urge to tinker with the typewriter and instead find a local repair shop that can help. If there is no shop that can help you locally, find a repair shop online that accepts shipped typewriters for repair.",
  "tyn_model":[
    "typewriter",
    "typewriters",
    "ribbon",
    "glue",
    "rust remover",
    "standard",
    "portable",
    "bubble wrap",
    "foam plastic",
    "shipping peanuts",
    "cast iron",
    "typewriter repair",
    "cotton ball",
    "water",
    "superglue",
    "wood glue"
  ],
  "tyn_section":[

  ]
}