{
  "title":"How to Bake Oatmeal Bread With Honey Using a Bread Machine",
  "url":"https://www.wikihow.com/Bake-Oatmeal-Bread-With-Honey-Using-a-Bread-Machine",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads"
  ],
  "steps":[
    {
      "headline":"Start by filling your bread machine mixing container with hot water.",
      "description":"This warms the container so that the ingredients are not cooled by the container. Let it stand for a couple minutes and pour the water out."
    },
    {
      "headline":"Measure and put into the bread machine mixer: 1 cup warm water, 3 tablespoons honey, 2 cups bread flower, 1 rounded cup thick rolled oats, 2 tablespoons dry milk, 1 teaspoon salt.",
      "description":""
    },
    {
      "headline":"Poke the corners of the dry mixture with a spoon, creating depressions in the corners.",
      "description":"In each corner pour about 1 1/2 teaspoons olive oil."
    },
    {
      "headline":"Create a small bowl in the center of the dry ingredients with a spoon and add 2 level teaspoons of active dry yeast.",
      "description":""
    },
    {
      "headline":"Select the \"Dough\" setting on your bread machine.",
      "description":"Let it run until it turns off. (Usually 45 minutes to an hour depending on your specific bread machine)"
    },
    {
      "headline":"While the bread is mixing, rub a film of shortening on the inside of a bread pan.",
      "description":"Be sure to cover the entire surface. Put about 1 heaping tablespoon of flour in the pan and shake it to cover the sides and bottom with flour. Pour excess flour out of the pan."
    },
    {
      "headline":"When the bread machine finishes, oil your hands with a small amount of olive oil and pour the dough out of the bread machine onto a floured surface.",
      "description":"Gently knead a few times, folding the dough each time. Form it into a loaf to the length of the bread pan and put it into the pan. Lightly brush olive oil (optional) onto the loaf and cover it with a tea towel (not a terrycloth towel) and let it rise to just above the sides of the pan."
    },
    {
      "headline":"Preheat your oven to 375 degrees or 350 degrees for convection.",
      "description":"When the dough has risen put it in the oven on the lower rack. Bake for 35 minutes or so until you can tap on the top of the loaf and it pops right back up."
    },
    {
      "headline":"Tip the loaf pan on its side and and ease it out of the pan onto a wire cooling rack.",
      "description":"Brush the top with butter or margarine. Allow the loaf to cool."
    },
    {
      "headline":"Let the loaf rest for 30 minutes before you cut it if you want a warm delicious piece of freshly baked bread.",
      "description":"Yum!"
    }
  ],
  "text":" Start by filling your bread machine mixing container with hot water. This warms the container so that the ingredients are not cooled by the container. Let it stand for a couple minutes and pour the water out. Measure and put into the bread machine mixer: 1 cup warm water, 3 tablespoons honey, 2 cups bread flower, 1 rounded cup thick rolled oats, 2 tablespoons dry milk, 1 teaspoon salt.  Poke the corners of the dry mixture with a spoon, creating depressions in the corners. In each corner pour about 1 1/2 teaspoons olive oil. Create a small bowl in the center of the dry ingredients with a spoon and add 2 level teaspoons of active dry yeast.  Select the \"Dough\" setting on your bread machine. Let it run until it turns off. (Usually 45 minutes to an hour depending on your specific bread machine) While the bread is mixing, rub a film of shortening on the inside of a bread pan. Be sure to cover the entire surface. Put about 1 heaping tablespoon of flour in the pan and shake it to cover the sides and bottom with flour. Pour excess flour out of the pan. When the bread machine finishes, oil your hands with a small amount of olive oil and pour the dough out of the bread machine onto a floured surface. Gently knead a few times, folding the dough each time. Form it into a loaf to the length of the bread pan and put it into the pan. Lightly brush olive oil (optional) onto the loaf and cover it with a tea towel (not a terrycloth towel) and let it rise to just above the sides of the pan. Preheat your oven to 375 degrees or 350 degrees for convection. When the dough has risen put it in the oven on the lower rack. Bake for 35 minutes or so until you can tap on the top of the loaf and it pops right back up. Tip the loaf pan on its side and and ease it out of the pan onto a wire cooling rack. Brush the top with butter or margarine. Allow the loaf to cool. Let the loaf rest for 30 minutes before you cut it if you want a warm delicious piece of freshly baked bread. Yum!",
  "tyn_model":[
    "bread machine",
    "olive oil",
    "flour",
    "spoon",
    "bread pan",
    "oven",
    "mixing container",
    "hot water",
    "water",
    "bread machine mixer",
    "warm water",
    "honey",
    "bread flower",
    "thick rolled oats",
    "dry milk",
    "salt",
    "active dry yeast",
    "tea towel",
    "terrycloth towel",
    "loaf pan",
    "butter",
    "margarine"
  ],
  "tyn_section":[

  ]
}