{
  "title":"How to Make a Taco Salad",
  "url":"https://www.wikihow.com/Make-a-Taco-Salad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine",
    "Taco Dishes"
  ],
  "methods":[
    {
      "name":"Making Quick, Easy Taco Salad",
      "steps":[
        {
          "headline":"Chop your vegetables.",
          "description":"Use a sharp knife to chop the lettuce, tomato, and bell pepper into small, cubed pieces. Set the lettuce and tomato aside — you'll use them later on. To save time, you can chop the bell pepper first, then finish the other vegetables while you're waiting for the ground beef to finish browning in the next step."
        },
        {
          "headline":"Brown ground beef with the bell pepper on the stove.",
          "description":"Heat a frying pan over medium-high heat. Add the beef with a little cooking oil and use your spoon or spatula to break it into small chunks. After a few minutes, add the chopped bell pepper. Cook, stirring frequently, until brown all over and no pinkness remains. This should take about five to seven minutes. When you're done cooking, there will be a little excess grease in the pan. Carefully drain this into a container that won't melt from the heat and toss in the garbage. Don't pour it down the sink — this can clog the drain. In a pinch, you can also microwave ground beef for five to seven minutes, breaking it up and stirring at the three minute mark."
        },
        {
          "headline":"Add salsa to the mix and heat to a boil.",
          "description":"Pour your bottled salsa directly into the pan with the drained beef and bell pepper. Stir well to combine. Do not attempt to drain the salsa or get rid of excess moisture. Let this mixture cook until it reaches a healthy boil."
        },
        {
          "headline":"Simmer until thick.",
          "description":"When you notice boiling, reduce the heat to medium or low. The boiling should decrease to a light simmer. Cover loosely (with a gap in the lid to allow steam to escape). Simmer at this heat for 10-12 minutes or until the mixture is pleasantly thick. Stir every few minutes. Keep an eye on the texture and thickness of your mixture to prevent burning. The cooking time here will vary greatly depending on the starting thickness of your salsa. Very liquid salsas may take the full 12 minutes to thicken, but chunkier salsas will be ready much sooner. When it's done, your mixture should be thick enough to hold together in a spoon without running over the edges."
        },
        {
          "headline":"Layer lettuce and meat mixture on each serving plate.",
          "description":"Take a generous pinch of your chopped lettuce and set it in the center of each plate. Spoon a helping of the meat/salsa mixture over this bed of lettuce."
        },
        {
          "headline":"Top with chips, remaining vegetables and cheese.",
          "description":"When each plate has a serving of meat over a bed of lettuce, sprinkle each with the chopped tomatoes, crumbled chips, shredded cheese, and the rest of the lettuce. Your easy taco salad is now ready to eat. This dish can be eaten with a spoon or fork, but you may want to serve it with additional chips or hot tortillas for a rustic \"eat with your hands\" experience."
        }
      ]
    },
    {
      "name":"Making Deluxe Taco Salad",
      "steps":[
        {
          "headline":"Chop your vegetables.",
          "description":"This recipe is a little more complex than the one above, but the result is a fuller, more impressive dish. The recipe starts basically the same way: chop your lettuce, bell pepper, and tomatoes into small pieces so they'll cook quickly. For this recipe, you'll also want to chop about two medium onions and slice a handful of olives. If you are including the optional green onions and cilantro, chop these up at this point as well."
        },
        {
          "headline":"Combine the vegetables.",
          "description":"In this recipe, you will make your own chunky salsa rather than using storebought salsa. Add chopped onions, tomatoes, bell peppers, and olives to a large mixing bowl. If you are using the optional cilantro and green onions, add these as well. Mix well to combine. Don't worry if the tomatoes make the mixture a little watery. Set aside when combined. If you have a lime handy, squeezing half of it over the mixture can lend it a bit of a tangy flavor. You can also try using a squirt of bottled lime juice. This isn't required, however."
        },
        {
          "headline":"Brown and drain the ground beef.",
          "description":"Set a frying pan over medium-high heat for about three minutes. Add a little cooking spray or oil and crumble the beef into the pan. Cook until well-browned and no pinkness remains (about five to ten minutes), stirring and breaking up the meat with your spoon or spatula. As noted above, when the meat is finished cooking, some grease will remain in the pan. Drain this carefully and dispose in the garbage."
        },
        {
          "headline":"Add taco seasoning and water.",
          "description":"Pour the water into the pan with the beef, followed by the seasoning. Stir well so that the beef is evenly coated (the water will make this easier). Simmer until the water evaporates. If you don't have taco seasoning, it's not hard to make your own. Most commercial seasonings are just chili powder, cumin, paprika, and coriander, with a little salt, onion powder, and/or cayenne added for flavor. See our article on taco seasoning mix for step-by-step recipes."
        },
        {
          "headline":"Layer ingredients over a bed of lettuce.",
          "description":"Put a generous pinch of lettuce in the center of each serving plate. On top of this, arrange your beef, beans, vegetables, and cheese in layers to give each serving a multi-tiered presentation. Now is your chance to get creative. There's no \"right\" order to layer your ingredients, so feel free to arrange them however you want. You can also use the sample order below, which works well:\n\n(Bottom) Bed of lettuce\nSeasoned beef\nBeans\nChopped vegetable mixture\nSprinkled lettuce\n\n(Top) Shredded cheese"
        },
        {
          "headline":"Arrange the chips in an appealing pattern around each serving.",
          "description":"In this recipe, the tortilla chips are used like miniature spoons that you can eat. Arrange a generous portion of chips around each salad in a way that you find pleasing. Again, the exact arrangement here is up to you. One idea is to try laying chips in a circle around the edge of the plate, for instance. You can also wedge the chips in the salad itself at an angle to make something that looks like a flower. Keep a bowl of chips handy for when your guests run out of chips on their plates."
        },
        {
          "headline":"Garnish with sour cream and guacamole.",
          "description":"To finish off your taco salad, put a portion of guacamole and sour cream on each plate. You can put these on the side or on top of the salad itself. If you're not sure whether your guests like these ingredients, putting them on the side is probably safest. To get a clean presentation, try using a melon baller or a tablespoon to get round, even scoops of each ingredient."
        }
      ]
    },
    {
      "name":"Serving Suggestions",
      "steps":[
        {
          "headline":"Serve in a crisp taco shell \"bowl\".",
          "description":"If you order a taco salad from a restaurant, there's a good chance that you will receive it in a hard tortilla bowl (or \"tostada\") that looks a little like a giant, folded tortilla chip. You can replicate this at home easily. Just buy tortilla bowls from your local supermarket (your best bet is to look in the Latin foods section) and layer your taco salad inside the bowls instead of on a bed of lettuce. You can also make your own tostadas if you wish — see our article on the subject for instructions."
        },
        {
          "headline":"Serve with Spanish rice.",
          "description":"With its distinct flavor and reddish-orange color, there's no mistaking well-prepared Spanish rice. Prepare the rice on its own in a slow cooker or a separate pot (cooking times will generally be longer than for the beef, etc., so you'll probably want to start it first). Serve the rice on the side of the salad plate or use it as a layer in the salad itself. See our article on Spanish Rice for a selection of easy recipes."
        },
        {
          "headline":"Serve with latin-style beans.",
          "description":"Beans are a filling side dish that round out a taco salad well. With their high protein and fiber content, they're also quite nutritious. Try serving your taco salad with a generous scoop of beans on the side and provide a few extra chips or tortillas to eat it with. Refried beans are a favorite often served at Mexican restaurants. See WikiHow's refried bean article for an easy recipe. Seasoned black beans provide a healthier alternative (see our black beans recipe)."
        },
        {
          "headline":"Toss vegetables with salad dressing for flavor.",
          "description":"Adding a few spoonfuls of your favorite dressing to your vegetable mixture can give your salad a richer, more complex flavor for almost no extra effort. Simply stir, shake or toss the vegetables to mix the dressing in well, then use them in the recipe as normal. While there's no \"right\" dressing to use for this, the simple, tangy-sweet flavor of Catalina dressing tends to be a good choice. A good recipe is available here."
        },
        {
          "headline":"Consider non-beef alternatives.",
          "description":"Ground beef is generally the most common meat used in taco salads, but it's far from your only choice. Many types of shredded or ground meats can be substituted — you may even like them more once you try them. Some choices (like ground poultry) will generally even make a leaner, healthier choice. Prepare these beef alternatives as you normally would: cook them in the pan, drain them, and season them before assembling your salad. A few ideas are below:\nGround chicken\nGround turkey\nPork carnitas\nShredded/pulled barbecue pork\nFlank/strip steak, chopped or sliced thin"
        }
      ]
    }
  ],
  "text":" Making Quick, Easy Taco Salad Chop your vegetables. Use a sharp knife to chop the lettuce, tomato, and bell pepper into small, cubed pieces. Set the lettuce and tomato aside — you'll use them later on. To save time, you can chop the bell pepper first, then finish the other vegetables while you're waiting for the ground beef to finish browning in the next step. Brown ground beef with the bell pepper on the stove. Heat a frying pan over medium-high heat. Add the beef with a little cooking oil and use your spoon or spatula to break it into small chunks. After a few minutes, add the chopped bell pepper. Cook, stirring frequently, until brown all over and no pinkness remains. This should take about five to seven minutes. When you're done cooking, there will be a little excess grease in the pan. Carefully drain this into a container that won't melt from the heat and toss in the garbage. Don't pour it down the sink — this can clog the drain. In a pinch, you can also microwave ground beef for five to seven minutes, breaking it up and stirring at the three minute mark. Add salsa to the mix and heat to a boil. Pour your bottled salsa directly into the pan with the drained beef and bell pepper. Stir well to combine. Do not attempt to drain the salsa or get rid of excess moisture. Let this mixture cook until it reaches a healthy boil. Simmer until thick. When you notice boiling, reduce the heat to medium or low. The boiling should decrease to a light simmer. Cover loosely (with a gap in the lid to allow steam to escape). Simmer at this heat for 10-12 minutes or until the mixture is pleasantly thick. Stir every few minutes. Keep an eye on the texture and thickness of your mixture to prevent burning. The cooking time here will vary greatly depending on the starting thickness of your salsa. Very liquid salsas may take the full 12 minutes to thicken, but chunkier salsas will be ready much sooner. When it's done, your mixture should be thick enough to hold together in a spoon without running over the edges. Layer lettuce and meat mixture on each serving plate. Take a generous pinch of your chopped lettuce and set it in the center of each plate. Spoon a helping of the meat/salsa mixture over this bed of lettuce. Top with chips, remaining vegetables and cheese. When each plate has a serving of meat over a bed of lettuce, sprinkle each with the chopped tomatoes, crumbled chips, shredded cheese, and the rest of the lettuce. Your easy taco salad is now ready to eat. This dish can be eaten with a spoon or fork, but you may want to serve it with additional chips or hot tortillas for a rustic \"eat with your hands\" experience. Making Deluxe Taco Salad Chop your vegetables. This recipe is a little more complex than the one above, but the result is a fuller, more impressive dish. The recipe starts basically the same way: chop your lettuce, bell pepper, and tomatoes into small pieces so they'll cook quickly. For this recipe, you'll also want to chop about two medium onions and slice a handful of olives. If you are including the optional green onions and cilantro, chop these up at this point as well. Combine the vegetables. In this recipe, you will make your own chunky salsa rather than using storebought salsa. Add chopped onions, tomatoes, bell peppers, and olives to a large mixing bowl. If you are using the optional cilantro and green onions, add these as well. Mix well to combine. Don't worry if the tomatoes make the mixture a little watery. Set aside when combined. If you have a lime handy, squeezing half of it over the mixture can lend it a bit of a tangy flavor. You can also try using a squirt of bottled lime juice. This isn't required, however. Brown and drain the ground beef. Set a frying pan over medium-high heat for about three minutes. Add a little cooking spray or oil and crumble the beef into the pan. Cook until well-browned and no pinkness remains (about five to ten minutes), stirring and breaking up the meat with your spoon or spatula. As noted above, when the meat is finished cooking, some grease will remain in the pan. Drain this carefully and dispose in the garbage. Add taco seasoning and water. Pour the water into the pan with the beef, followed by the seasoning. Stir well so that the beef is evenly coated (the water will make this easier). Simmer until the water evaporates. If you don't have taco seasoning, it's not hard to make your own. Most commercial seasonings are just chili powder, cumin, paprika, and coriander, with a little salt, onion powder, and/or cayenne added for flavor. See our article on taco seasoning mix for step-by-step recipes. Layer ingredients over a bed of lettuce. Put a generous pinch of lettuce in the center of each serving plate. On top of this, arrange your beef, beans, vegetables, and cheese in layers to give each serving a multi-tiered presentation. Now is your chance to get creative. There's no \"right\" order to layer your ingredients, so feel free to arrange them however you want. You can also use the sample order below, which works well:\n\n(Bottom) Bed of lettuce\nSeasoned beef\nBeans\nChopped vegetable mixture\nSprinkled lettuce\n\n(Top) Shredded cheese Arrange the chips in an appealing pattern around each serving. In this recipe, the tortilla chips are used like miniature spoons that you can eat. Arrange a generous portion of chips around each salad in a way that you find pleasing. Again, the exact arrangement here is up to you. One idea is to try laying chips in a circle around the edge of the plate, for instance. You can also wedge the chips in the salad itself at an angle to make something that looks like a flower. Keep a bowl of chips handy for when your guests run out of chips on their plates. Garnish with sour cream and guacamole. To finish off your taco salad, put a portion of guacamole and sour cream on each plate. You can put these on the side or on top of the salad itself. If you're not sure whether your guests like these ingredients, putting them on the side is probably safest. To get a clean presentation, try using a melon baller or a tablespoon to get round, even scoops of each ingredient. Serving Suggestions Serve in a crisp taco shell \"bowl\". If you order a taco salad from a restaurant, there's a good chance that you will receive it in a hard tortilla bowl (or \"tostada\") that looks a little like a giant, folded tortilla chip. You can replicate this at home easily. Just buy tortilla bowls from your local supermarket (your best bet is to look in the Latin foods section) and layer your taco salad inside the bowls instead of on a bed of lettuce. You can also make your own tostadas if you wish — see our article on the subject for instructions. Serve with Spanish rice. With its distinct flavor and reddish-orange color, there's no mistaking well-prepared Spanish rice. Prepare the rice on its own in a slow cooker or a separate pot (cooking times will generally be longer than for the beef, etc., so you'll probably want to start it first). Serve the rice on the side of the salad plate or use it as a layer in the salad itself. See our article on Spanish Rice for a selection of easy recipes. Serve with latin-style beans. Beans are a filling side dish that round out a taco salad well. With their high protein and fiber content, they're also quite nutritious. Try serving your taco salad with a generous scoop of beans on the side and provide a few extra chips or tortillas to eat it with. Refried beans are a favorite often served at Mexican restaurants. See WikiHow's refried bean article for an easy recipe. Seasoned black beans provide a healthier alternative (see our black beans recipe). Toss vegetables with salad dressing for flavor. Adding a few spoonfuls of your favorite dressing to your vegetable mixture can give your salad a richer, more complex flavor for almost no extra effort. Simply stir, shake or toss the vegetables to mix the dressing in well, then use them in the recipe as normal. While there's no \"right\" dressing to use for this, the simple, tangy-sweet flavor of Catalina dressing tends to be a good choice. A good recipe is available here. Consider non-beef alternatives. Ground beef is generally the most common meat used in taco salads, but it's far from your only choice. Many types of shredded or ground meats can be substituted — you may even like them more once you try them. Some choices (like ground poultry) will generally even make a leaner, healthier choice. Prepare these beef alternatives as you normally would: cook them in the pan, drain them, and season them before assembling your salad. A few ideas are below:\nGround chicken\nGround turkey\nPork carnitas\nShredded/pulled barbecue pork\nFlank/strip steak, chopped or sliced thin",
  "tyn_model":[
    "lettuce",
    "vegetables",
    "bell pepper",
    "salsa",
    "taco salad",
    "beef",
    "beans",
    "ground beef",
    "cheese",
    "tomatoes",
    "water",
    "spoon",
    "taco seasoning",
    "rice",
    "tomato",
    "— you",
    "frying pan",
    "spatula",
    "meat",
    "chips",
    "onions",
    "olives",
    "green onions",
    "cilantro",
    "sour cream",
    "guacamole",
    "spanish rice",
    "stove",
    "cooking oil",
    "— this",
    "microwave",
    "tortillas",
    "bell peppers",
    "large mixing bowl",
    "lime",
    "lime juice",
    "cooking spray",
    "chili powder",
    "coriander",
    "salt",
    "onion powder",
    "tortilla chips",
    "bowl",
    "melon",
    "taco shell \"",
    "tortilla bowl",
    "tortilla bowls",
    "— see",
    "slow cooker",
    "salad plate",
    "refried beans",
    "refried bean",
    "black beans",
    "salad dressing",
    "catalina dressing",
    "meats",
    "ground poultry",
    "pan",
    "ground chicken",
    "ground turkey",
    "barbecue pork"
  ],
  "tyn_section":[

  ]
}