{
  "title":"How to Teach Children Chess",
  "url":"https://www.wikihow.com/Teach-Children-Chess",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Board Games",
    "Strategy Board Games",
    "Chess"
  ],
  "methods":[
    {
      "name":"Introducing the Board and Pieces",
      "steps":[
        {
          "headline":"Explain the chess board.",
          "description":"A chess board has 8 rows and 8 columns. There are 64 squares total. Half of the squares are a light color and half of the squares are a dark color. If you do not have a chess board, you can draw one on a dry erase board or chalk board. If you are teaching in a classroom, it may help to number the horizontal squares from 1 to 8, and letter the vertical squares from “a” to “h.” You can then use a coordinate system while you are teaching."
        },
        {
          "headline":"Begin teaching the pieces.",
          "description":"Explain the pawns, knights, rooks, bishops, king, and queen. Note the differences in how each piece looks. Place the pieces on the board so the child can see the proper position. The knight usually looks like a horse. The bishop looks like a hat. The king is the most important piece because the object of the game is to capture the opponent’s king. Point out the difference in the shape of the queen and king pieces\nRooks are also called castles."
        },
        {
          "headline":"Continue explaining the pieces.",
          "description":"Go through each piece and explain how each piece moves on the board. Make sure the child understands a piece before you move on to the next. A pawn can move two spaces from its starting position, but only one space after that. A pawn can only capture a piece when it moves diagonally and can never move backwards. A knight is the only piece that can jump over another piece. It moves in an “L” shape. It can move 2 spaces horizontally and then one space vertically, or it can move 2 spaces vertically and then one space horizontally. The bishop can move diagonally and any number of squares. Rooks can move any number of squares forwards, backwards, or horizontally. The rook cannot move diagonally. The queen can move in any direction and any number of squares. It is one of the most powerful pieces. The king can move one space in any direction, but two kings can never be side by side."
        },
        {
          "headline":"Place all the pieces on the board.",
          "description":"Set up a chess board with all of the pieces. Your child should be able to identify each piece by name. Once they have the names down, begin to focus on the movement each piece makes. If you are using the coordinates method, this is how the chess board should be set up:\nEach player gets 8 pawns that lie on the 2nd and 7th rows\nRooks/castles are in column A and H of rows 1 and 8. The queen is on column D of rows 8 and 1. The bishop is on column C and F of rows 8 and 1. The knights are on column B and G of rows 8 and 1. The king is in column E of rows 8 and 1."
        }
      ]
    },
    {
      "name":"Playing Games to Teach Movement",
      "steps":[
        {
          "headline":"Play a pawns only game.",
          "description":"Set up the chess board with only pawns. The goal of the game is to move as many of your pawns to the other side of the board. If two pawns meet and cannot move, they are stuck. Remind the child that the pawn can only move one space forward unless it is capturing the opponent’s pawn. If it is capturing, it can move one space diagonally. An alternate goal of the game can be to see who can move a single pawn to the other side first. Remind the child that the white pawn moves first and that pawns can take two spaces on a first move. This helps the child get used to playing the pawns."
        },
        {
          "headline":"Add the bishops.",
          "description":"Once the child has a good grasp of pawn movement, add the bishops to the game. The goal of the game remains the same. Remind the child that the bishops can only move diagonally. This game teaches the child to:\nUse their pawns to protect their bishop. Decide the best time to let their bishop out in front of their pawns. Get their bishop behind their opponent’s pawns. Understand the limitations that come with only being allowed to move the bishop diagonally."
        },
        {
          "headline":"Introduce the rooks.",
          "description":"Place the rooks, bishops, and pawns on the board. The objective is still to get a pawn all the way to the other side of the board. Remind the child that the rook can move any number of squares vertically or horizontally, but it cannot jump another piece. The child should learn the importance of keeping the rook until the end of the game. At this stage, the child should also begin to see the difference between taking their opponent’s piece and winning the actual game."
        },
        {
          "headline":"Place the knights on the board.",
          "description":"Allow the child to move the knights on an empty board. The “L” movement is very unique and may take a little time. Pick a spot on the board that the child needs to get the knight to. Have them think through the number of moves it may take to get there. Once the child is comfortable with the knights, add the pawns and play a game as you have done with the other pieces."
        },
        {
          "headline":"Play with knights, rooks, bishops, and pawns.",
          "description":"Set up the board with all of these pieces. The goal is still to get a pawn to the other side first. This is a complex game, but your child should be ready for it because of the gradual buildup. The child should begin to learn different patterns and how the pieces work together. If your child is having difficulty, go back to some of the more simple games. Your child should progress through each stage at their own pace."
        },
        {
          "headline":"Play with the queen, king, pawn, and rook.",
          "description":"This game allows you to introduce the concept of check and checkmate. Check means the king is in danger. Checkmate means the king can no longer move anywhere. Only add 4 pawns for each player to the game. Remind your child that the white piece always move first and once they take their hand off a piece, their move is over. Focus on the movements that the king and queen pieces can make."
        },
        {
          "headline":"Play a full game of chess.",
          "description":"If your child is comfortable with the movements of each piece, have them play a full game of chess. The goal of this game is to capture the opponent’s king. Remind your child that getting a pawn to the other side will only earn them a queen now. Again, if your child want to go back to simpler games, allow them to do so."
        }
      ]
    },
    {
      "name":"Focusing on More Difficult Movements",
      "steps":[
        {
          "headline":"Explain pawn promotion.",
          "description":"A pawn is promoted when it reaches the other side of the board. It will become a queen, rook, bishop, or knight. Once the pawn reaches the other side, you can replace it with the piece of your choosing. Pawns are most commonly promoted to queens. You can have more than one queen on the board. You may say, \"If your pawn makes it to the other side of the board, it can become a different piece. You can choose the piece that you turn it into. The queen is usually best.\""
        },
        {
          "headline":"Explain en passant.",
          "description":"En passant happens when a player moves the pawn two spaces on the first movement and the pawn is next to the opponent’s pawn. If this happens, the opponent can use their pawn to capture your pawn. Your opponent must capture your pawn during the next move. If the pawn is not captured during the next move, your pawn can remain.. This move may never happen naturally. Set up the board to demonstrate how this happens. A pawn can never be promoted to a king."
        },
        {
          "headline":"Explain what the term \"castling\" means.",
          "description":"Castling involves moving the king and the rook at the same time. If there is nothing between the king and the rook/castle and neither of the pieces have been moved yet, this move can happen. The king moves two spaces towards the castle and then the castle jumps to the other side of the king. The king and the rook must be in their original positions to castle. You cannot castle if the king is in check."
        }
      ]
    },
    {
      "name":"Being A Good Teacher",
      "steps":[
        {
          "headline":"Make learning fun.",
          "description":"Talk about the pieces like they are soldiers in a war and describe the game as a battle. You can also create an entire storyline around the battle to increase excitement. If your child is into technology, there are computer games, video games, and apps that can be used to supplement their learning. These games are also helpful for teaching strategy and can present different scenarios. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tVitaly Neimer\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInternational Chess Master\t\t\t\t\t\t\t\tVitaly Neimer is an International Chess Master and Certified Professional Chess Coach with over 15 years of training experience. He has been a part of the United States' Webster SPICE national chess champion team and is also a two-time Israeli national chess champion. Vitaly Neimer\t\t\tInternational Chess Master\t\t\t\tExpert Trick: Keep children engaged in learning by turning the movements into a story or fairy tale. You could, for example, try explaining that the pawn can move twice because there's a trampoline that he uses. Be creative!"
        },
        {
          "headline":"Be encouraging.",
          "description":"Give your child praise when they accomplish something. It does not matter if it is big or small. Checking a king and setting up the board correctly are both accomplishments. Also, encourage your child if they are not doing well. You may say, “It’s ok that you did not win. You still made some really nice moves with your knights during the game.”"
        },
        {
          "headline":"Allow them to make mistakes.",
          "description":"Play and teach them the rules while playing. Correct them if they make illegal moves. Let them make a few moves to encourage them. Make deliberate blunders and give them an opportunity to win a few games. Once your child has the basic moves down, learning comes from playing and experiencing different scenarios. Emphasize that learning is a lifelong process and they can always improve their game."
        }
      ]
    }
  ],
  "text":" Introducing the Board and Pieces Explain the chess board. A chess board has 8 rows and 8 columns. There are 64 squares total. Half of the squares are a light color and half of the squares are a dark color. If you do not have a chess board, you can draw one on a dry erase board or chalk board. If you are teaching in a classroom, it may help to number the horizontal squares from 1 to 8, and letter the vertical squares from “a” to “h.” You can then use a coordinate system while you are teaching. Begin teaching the pieces. Explain the pawns, knights, rooks, bishops, king, and queen. Note the differences in how each piece looks. Place the pieces on the board so the child can see the proper position. The knight usually looks like a horse. The bishop looks like a hat. The king is the most important piece because the object of the game is to capture the opponent’s king. Point out the difference in the shape of the queen and king pieces\nRooks are also called castles. Continue explaining the pieces. Go through each piece and explain how each piece moves on the board. Make sure the child understands a piece before you move on to the next. A pawn can move two spaces from its starting position, but only one space after that. A pawn can only capture a piece when it moves diagonally and can never move backwards. A knight is the only piece that can jump over another piece. It moves in an “L” shape. It can move 2 spaces horizontally and then one space vertically, or it can move 2 spaces vertically and then one space horizontally. The bishop can move diagonally and any number of squares. Rooks can move any number of squares forwards, backwards, or horizontally. The rook cannot move diagonally. The queen can move in any direction and any number of squares. It is one of the most powerful pieces. The king can move one space in any direction, but two kings can never be side by side. Place all the pieces on the board. Set up a chess board with all of the pieces. Your child should be able to identify each piece by name. Once they have the names down, begin to focus on the movement each piece makes. If you are using the coordinates method, this is how the chess board should be set up:\nEach player gets 8 pawns that lie on the 2nd and 7th rows\nRooks/castles are in column A and H of rows 1 and 8. The queen is on column D of rows 8 and 1. The bishop is on column C and F of rows 8 and 1. The knights are on column B and G of rows 8 and 1. The king is in column E of rows 8 and 1. Playing Games to Teach Movement Play a pawns only game. Set up the chess board with only pawns. The goal of the game is to move as many of your pawns to the other side of the board. If two pawns meet and cannot move, they are stuck. Remind the child that the pawn can only move one space forward unless it is capturing the opponent’s pawn. If it is capturing, it can move one space diagonally. An alternate goal of the game can be to see who can move a single pawn to the other side first. Remind the child that the white pawn moves first and that pawns can take two spaces on a first move. This helps the child get used to playing the pawns. Add the bishops. Once the child has a good grasp of pawn movement, add the bishops to the game. The goal of the game remains the same. Remind the child that the bishops can only move diagonally. This game teaches the child to:\nUse their pawns to protect their bishop. Decide the best time to let their bishop out in front of their pawns. Get their bishop behind their opponent’s pawns. Understand the limitations that come with only being allowed to move the bishop diagonally. Introduce the rooks. Place the rooks, bishops, and pawns on the board. The objective is still to get a pawn all the way to the other side of the board. Remind the child that the rook can move any number of squares vertically or horizontally, but it cannot jump another piece. The child should learn the importance of keeping the rook until the end of the game. At this stage, the child should also begin to see the difference between taking their opponent’s piece and winning the actual game. Place the knights on the board. Allow the child to move the knights on an empty board. The “L” movement is very unique and may take a little time. Pick a spot on the board that the child needs to get the knight to. Have them think through the number of moves it may take to get there. Once the child is comfortable with the knights, add the pawns and play a game as you have done with the other pieces. Play with knights, rooks, bishops, and pawns. Set up the board with all of these pieces. The goal is still to get a pawn to the other side first. This is a complex game, but your child should be ready for it because of the gradual buildup. The child should begin to learn different patterns and how the pieces work together. If your child is having difficulty, go back to some of the more simple games. Your child should progress through each stage at their own pace. Play with the queen, king, pawn, and rook. This game allows you to introduce the concept of check and checkmate. Check means the king is in danger. Checkmate means the king can no longer move anywhere. Only add 4 pawns for each player to the game. Remind your child that the white piece always move first and once they take their hand off a piece, their move is over. Focus on the movements that the king and queen pieces can make. Play a full game of chess. If your child is comfortable with the movements of each piece, have them play a full game of chess. The goal of this game is to capture the opponent’s king. Remind your child that getting a pawn to the other side will only earn them a queen now. Again, if your child want to go back to simpler games, allow them to do so. Focusing on More Difficult Movements Explain pawn promotion. A pawn is promoted when it reaches the other side of the board. It will become a queen, rook, bishop, or knight. Once the pawn reaches the other side, you can replace it with the piece of your choosing. Pawns are most commonly promoted to queens. You can have more than one queen on the board. You may say, \"If your pawn makes it to the other side of the board, it can become a different piece. You can choose the piece that you turn it into. The queen is usually best.\" Explain en passant. En passant happens when a player moves the pawn two spaces on the first movement and the pawn is next to the opponent’s pawn. If this happens, the opponent can use their pawn to capture your pawn. Your opponent must capture your pawn during the next move. If the pawn is not captured during the next move, your pawn can remain.. This move may never happen naturally. Set up the board to demonstrate how this happens. A pawn can never be promoted to a king. Explain what the term \"castling\" means. Castling involves moving the king and the rook at the same time. If there is nothing between the king and the rook/castle and neither of the pieces have been moved yet, this move can happen. The king moves two spaces towards the castle and then the castle jumps to the other side of the king. The king and the rook must be in their original positions to castle. You cannot castle if the king is in check. Being A Good Teacher Make learning fun. Talk about the pieces like they are soldiers in a war and describe the game as a battle. You can also create an entire storyline around the battle to increase excitement. If your child is into technology, there are computer games, video games, and apps that can be used to supplement their learning. These games are also helpful for teaching strategy and can present different scenarios. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tVitaly Neimer\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInternational Chess Master\t\t\t\t\t\t\t\tVitaly Neimer is an International Chess Master and Certified Professional Chess Coach with over 15 years of training experience. He has been a part of the United States' Webster SPICE national chess champion team and is also a two-time Israeli national chess champion. Vitaly Neimer\t\t\tInternational Chess Master\t\t\t\tExpert Trick: Keep children engaged in learning by turning the movements into a story or fairy tale. You could, for example, try explaining that the pawn can move twice because there's a trampoline that he uses. Be creative! Be encouraging. Give your child praise when they accomplish something. It does not matter if it is big or small. Checking a king and setting up the board correctly are both accomplishments. Also, encourage your child if they are not doing well. You may say, “It’s ok that you did not win. You still made some really nice moves with your knights during the game.” Allow them to make mistakes. Play and teach them the rules while playing. Correct them if they make illegal moves. Let them make a few moves to encourage them. Make deliberate blunders and give them an opportunity to win a few games. Once your child has the basic moves down, learning comes from playing and experiencing different scenarios. Emphasize that learning is a lifelong process and they can always improve their game.",
  "tyn_model":[
    "rook",
    "chess board",
    "board",
    "bishops",
    "knights",
    "castle",
    "rooks",
    "pawn",
    "“l",
    "bishop",
    "king",
    "chess",
    "dry erase board",
    "chalk board",
    "“a",
    "” to",
    "“h.",
    "” you",
    "knight",
    "” shape",
    "kings",
    "” movement",
    "castling",
    "neimer",
    "international chess master",
    "trampoline",
    "“it",
    "” allow"
  ],
  "tyn_section":[

  ]
}