{
  "title":"How to Add a Buy It Now on eBay",
  "url":"https://www.wikihow.com/Add-a-Buy-It-Now-on-eBay",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Collecting"
  ],
  "steps":[
    {
      "headline":"Log in to eBay.com with your user name and password.",
      "description":""
    },
    {
      "headline":"Select the \"sell an item\" link at the top of the web page.",
      "description":"If you have a serial number, ISBN or UPC code for your product, enter it in the search box and click \"search.\" EBay will attempt to locate your product for you and fill in much of the information for you. If you do not have any of the numbers, simply describe the product yourself as accurately as possible."
    },
    {
      "headline":"Enter all the specifics for your item, including its condition and age.",
      "description":"You can add details to give your buyers a better idea of what your item is, how it performs and whether they should expect problems with it."
    },
    {
      "headline":"Upload a picture of your item or choose the picture assigned through the UPC code search.",
      "description":"More pictures can increase the likelihood of a quick sale. Buyers are reluctant to purchase an item online if there are no pictures of the actual item."
    },
    {
      "headline":"Provide a sale price.",
      "description":"Select \"Fixed Price\" tab from the \"Choose how you'd like to sell your item\" section of the listing."
    },
    {
      "headline":"Enter a price in the \"Buy It Now\" box.",
      "description":"If you are using the \"Fixed Price\" option, this will be the only price you have to enter. You can also select the \"Online Auction\" option tab and enter a starting sale price and a \"Buy It Now\" price."
    },
    {
      "headline":"Complete your listing with details for your preferred payment method and shipping method and costs.",
      "description":""
    },
    {
      "headline":"Click the \"Continue\" button to move to the next stage of the process.",
      "description":""
    },
    {
      "headline":"Preview your listing, make any needed changes and then finalize your listing.",
      "description":""
    }
  ],
  "text":" Log in to eBay.com with your user name and password.  Select the \"sell an item\" link at the top of the web page. If you have a serial number, ISBN or UPC code for your product, enter it in the search box and click \"search.\" EBay will attempt to locate your product for you and fill in much of the information for you. If you do not have any of the numbers, simply describe the product yourself as accurately as possible. Enter all the specifics for your item, including its condition and age. You can add details to give your buyers a better idea of what your item is, how it performs and whether they should expect problems with it. Upload a picture of your item or choose the picture assigned through the UPC code search. More pictures can increase the likelihood of a quick sale. Buyers are reluctant to purchase an item online if there are no pictures of the actual item. Provide a sale price. Select \"Fixed Price\" tab from the \"Choose how you'd like to sell your item\" section of the listing. Enter a price in the \"Buy It Now\" box. If you are using the \"Fixed Price\" option, this will be the only price you have to enter. You can also select the \"Online Auction\" option tab and enter a starting sale price and a \"Buy It Now\" price. Complete your listing with details for your preferred payment method and shipping method and costs.  Click the \"Continue\" button to move to the next stage of the process.  Preview your listing, make any needed changes and then finalize your listing. ",
  "tyn_model":[
    "ebay"
  ],
  "tyn_section":[

  ]
}