{
  "title":"How to Do a Pinky Break",
  "url":"https://www.wikihow.com/Do-a-Pinky-Break",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "methods":[
    {
      "name":"Holding a Pinky Break",
      "steps":[
        {
          "headline":"Hold a deck of cards facedown in your left hand using a dealer’s grip.",
          "description":"This means hold it with your thumb on the left side of the deck and your index finger at the top right corner of the deck. Place the rest of your fingers along the right side of the deck. Make sure you have a loose grip on the cards so you will be able to separate them easily with your pinky."
        },
        {
          "headline":"Hold the deck so it sits squarely in your hand with the top edge angled up.",
          "description":"Hold the deck so the cards are flush on each side. Angle the deck slightly up to present a view to the audience of the top edge of the deck (the edges of the cards that are facing away from you) so it looks like a square and complete pack. This will help hide the break. Make sure that nobody can see the back part of the deck. This is where the break will be visible, so make sure only you can see that part."
        },
        {
          "headline":"Separate the deck slightly with your pinky finger to break it.",
          "description":"Slightly lift up part of the deck to create a break in it where you want to. Stick just enough of the flesh of the tip of your pinky finger in the break to keep the cards separated. Try not to let the cards separate at all at the top edge of the deck. This is the part you will present to the audience, so you need to keep the illusion going that the deck is whole and untampered with."
        },
        {
          "headline":"Cover the top of the deck with your index finger.",
          "description":"This helps hide the break if the cards begin to separate at the front part that the audience will be looking at. Hold your index finger so it curls over as much of the front part of the deck as you can cover. Once you get good at the pinky break, the cards won’t normally separate at the front part of the deck. They will only be slightly separated at the back right-hand corner."
        },
        {
          "headline":"Practice until you are able to create and hold the break secretly.",
          "description":"This means that the break will be visible only at the bottom edge of the deck (the edge that is facing you). Practice by yourself until you master the pinky break, then move on to incorporating it in other tricks.Tip: Practice holding a pinky break in front of a mirror so you can see your hands from an audience’s perspective and learn how to hide the pinky break. The pinky break is mainly used to mark a card position that you want to control when doing card magic tricks. Another important technique that can incorporate the pinky break is called the double lift."
        }
      ]
    },
    {
      "name":"Using a Pinky Break with a Double Lift",
      "steps":[
        {
          "headline":"Hold the deck in your left hand with a dealer’s grip.",
          "description":"Place the deck of cards squarely in your left hand with your thumb on the left top corner. Put your index finger on the front right corner and your other 3 fingers along the right-hand side.Tip: The double lift is a technique that lets you lift the top 2 cards off the deck while making it look like you are just lifting up 1 card. You can then use a pinky break to help you keep the top 2 cards separated so you can use them as required by the trick you are doing. Make sure you will be able to get good leverage with your thumb to bend the deck down at the top left corner."
        },
        {
          "headline":"Bend the top left corner of the deck down with your thumb.",
          "description":"Apply downward pressure to the top left corner of the deck with your thumb until it bends down slightly. Don’t release any cards until you are sure you have good control of the corner of the deck with your thumb. When you do this in front of an audience, turn the deck towards you briefly so they won’t be able to see that you are bending the corner down."
        },
        {
          "headline":"Release the top 2 cards of the deck from under your thumb.",
          "description":"Carefully slide your thumb down just enough to release the top 2 cards from under it. Keep holding the rest of the deck under it until you grab the top 2 cards off. Practice doing this until you can release 2 cards in very quick succession so there is no chance of the audience noticing what you are doing."
        },
        {
          "headline":"Pick up the top 2 cards with the thumb and middle finger of your right hand.",
          "description":"Place your middle finger on the top edge of the cards and your thumb on the bottom edge. Carefully lift them up so they stay perfectly together and look like 1 card. This is when you would show the bottom card of the 2 cards to your audience or do whatever your magic trick calls for."
        },
        {
          "headline":"Put the cards back on top of the deck with your pinky underneath them.",
          "description":"Put the cards back on top of your deck with a bit of the flesh of your pinky finger squeezed between them and the rest of the deck to create a pinky break. Hold the pinky break to keep those 2 cards separated from the deck at the back right-hand corner. When you are doing the pinky break and double lift in front of an audience, it’s a good idea to talk to use misdirection techniques so that they don’t focus as much on what you are doing with your hands and the deck. For example, you can use flashy \"magic\" hand gestures with your free hand to draw their eyes to other motions."
        }
      ]
    }
  ],
  "text":" Holding a Pinky Break Hold a deck of cards facedown in your left hand using a dealer’s grip. This means hold it with your thumb on the left side of the deck and your index finger at the top right corner of the deck. Place the rest of your fingers along the right side of the deck. Make sure you have a loose grip on the cards so you will be able to separate them easily with your pinky. Hold the deck so it sits squarely in your hand with the top edge angled up. Hold the deck so the cards are flush on each side. Angle the deck slightly up to present a view to the audience of the top edge of the deck (the edges of the cards that are facing away from you) so it looks like a square and complete pack. This will help hide the break. Make sure that nobody can see the back part of the deck. This is where the break will be visible, so make sure only you can see that part. Separate the deck slightly with your pinky finger to break it. Slightly lift up part of the deck to create a break in it where you want to. Stick just enough of the flesh of the tip of your pinky finger in the break to keep the cards separated. Try not to let the cards separate at all at the top edge of the deck. This is the part you will present to the audience, so you need to keep the illusion going that the deck is whole and untampered with. Cover the top of the deck with your index finger. This helps hide the break if the cards begin to separate at the front part that the audience will be looking at. Hold your index finger so it curls over as much of the front part of the deck as you can cover. Once you get good at the pinky break, the cards won’t normally separate at the front part of the deck. They will only be slightly separated at the back right-hand corner. Practice until you are able to create and hold the break secretly. This means that the break will be visible only at the bottom edge of the deck (the edge that is facing you). Practice by yourself until you master the pinky break, then move on to incorporating it in other tricks.Tip: Practice holding a pinky break in front of a mirror so you can see your hands from an audience’s perspective and learn how to hide the pinky break. The pinky break is mainly used to mark a card position that you want to control when doing card magic tricks. Another important technique that can incorporate the pinky break is called the double lift. Using a Pinky Break with a Double Lift Hold the deck in your left hand with a dealer’s grip. Place the deck of cards squarely in your left hand with your thumb on the left top corner. Put your index finger on the front right corner and your other 3 fingers along the right-hand side.Tip: The double lift is a technique that lets you lift the top 2 cards off the deck while making it look like you are just lifting up 1 card. You can then use a pinky break to help you keep the top 2 cards separated so you can use them as required by the trick you are doing. Make sure you will be able to get good leverage with your thumb to bend the deck down at the top left corner. Bend the top left corner of the deck down with your thumb. Apply downward pressure to the top left corner of the deck with your thumb until it bends down slightly. Don’t release any cards until you are sure you have good control of the corner of the deck with your thumb. When you do this in front of an audience, turn the deck towards you briefly so they won’t be able to see that you are bending the corner down. Release the top 2 cards of the deck from under your thumb. Carefully slide your thumb down just enough to release the top 2 cards from under it. Keep holding the rest of the deck under it until you grab the top 2 cards off. Practice doing this until you can release 2 cards in very quick succession so there is no chance of the audience noticing what you are doing. Pick up the top 2 cards with the thumb and middle finger of your right hand. Place your middle finger on the top edge of the cards and your thumb on the bottom edge. Carefully lift them up so they stay perfectly together and look like 1 card. This is when you would show the bottom card of the 2 cards to your audience or do whatever your magic trick calls for. Put the cards back on top of the deck with your pinky underneath them. Put the cards back on top of your deck with a bit of the flesh of your pinky finger squeezed between them and the rest of the deck to create a pinky break. Hold the pinky break to keep those 2 cards separated from the deck at the back right-hand corner. When you are doing the pinky break and double lift in front of an audience, it’s a good idea to talk to use misdirection techniques so that they don’t focus as much on what you are doing with your hands and the deck. For example, you can use flashy \"magic\" hand gestures with your free hand to draw their eyes to other motions.",
  "tyn_model":[
    "cards",
    "deck",
    "thumb",
    "mirror",
    "card magic tricks"
  ],
  "tyn_section":[

  ]
}