{
  "title":"How to Keep a Sketchbook Without Losing Interest",
  "url":"https://www.wikihow.com/Keep-a-Sketchbook-Without-Losing-Interest",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Styles",
    "Sketching"
  ],
  "steps":[
    {
      "headline":"Buy a sketchbook.",
      "description":"You might buy one at a bookstore or craft store, or you might make one out of a composition notebook. It's recommended that you create your own because some people feel a stronger bond when doing so. It also helps ensure that your never bored with how it turns out and it also really gets the creative juices flowing. Just make sure it's in your price range and that you won't get tired of it after a while."
    },
    {
      "headline":"Start off small.",
      "description":"First pages can be intimidating. You don't know how to start and there's this white page staring you down. Don't panic. Draw your lunch, write depressing poetry (yes, writing is allowed in a sketchbook), brainstorm through doodles about a voodoo doll your going to make, journal about your day... don't let it get to you. Once you get in the rhythm, you'll be so used to it. It'll be like breathing or blinking your eyelids...you won't even notice."
    },
    {
      "headline":"Use alternative media.",
      "description":"Acrylics, watercolor, charcoal, crayons, markers or heck. I even once mixed water with ground coffee and used it to paint three pages brown. Be creative, be inspired. There are thousands of things you could use to vent your creativity with. Don't be afraid to use them."
    },
    {
      "headline":"Stay inspired.",
      "description":"Go for a walk and draw the cracks in the sidewalk, draw every bite you take out of an apple, or draw your friends in various poses. The more you draw, the better and more experienced you become."
    },
    {
      "headline":"Don't be afraid to warp pages in your sketchbook.",
      "description":"Glue in ticket stubs, paint all over the pages you don't like, create newspaper collages, make it creative. Who knows what good ideas may come of it?"
    }
  ],
  "text":" Buy a sketchbook. You might buy one at a bookstore or craft store, or you might make one out of a composition notebook. It's recommended that you create your own because some people feel a stronger bond when doing so. It also helps ensure that your never bored with how it turns out and it also really gets the creative juices flowing. Just make sure it's in your price range and that you won't get tired of it after a while. Start off small. First pages can be intimidating. You don't know how to start and there's this white page staring you down. Don't panic. Draw your lunch, write depressing poetry (yes, writing is allowed in a sketchbook), brainstorm through doodles about a voodoo doll your going to make, journal about your day... don't let it get to you. Once you get in the rhythm, you'll be so used to it. It'll be like breathing or blinking your eyelids...you won't even notice. Use alternative media. Acrylics, watercolor, charcoal, crayons, markers or heck. I even once mixed water with ground coffee and used it to paint three pages brown. Be creative, be inspired. There are thousands of things you could use to vent your creativity with. Don't be afraid to use them. Stay inspired. Go for a walk and draw the cracks in the sidewalk, draw every bite you take out of an apple, or draw your friends in various poses. The more you draw, the better and more experienced you become. Don't be afraid to warp pages in your sketchbook. Glue in ticket stubs, paint all over the pages you don't like, create newspaper collages, make it creative. Who knows what good ideas may come of it?",
  "tyn_model":[
    "sketchbook",
    "composition notebook",
    "charcoal",
    "crayons",
    "markers",
    "water",
    "ground coffee",
    "apple",
    "glue",
    "paint"
  ],
  "tyn_section":[

  ]
}