{
  "title":"How to Buy Mint Plants",
  "url":"https://www.wikihow.com/Buy-Mint-Plants",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "parts":[
    {
      "name":"Finding Places to Buy or Acquire Mint",
      "steps":[
        {
          "headline":"Pick a local nursery for plants.",
          "description":"Often, the best sources for plants are well-respected local nurseries. These nurseries will often have experts who can answer any questions you have. Ask around to find the best nurseries in your area. Home improvement stores and other big chains often focus on just providing the cheapest price. Sometimes their quality can be hit-or-miss."
        },
        {
          "headline":"Check online or mail-order catalogs.",
          "description":"Another good option is ordering a mint plant through the mail. You can still get high-quality plants, and you'll have a larger selection of varieties."
        },
        {
          "headline":"Buy mint at a farmer's market or grocery store.",
          "description":"Mint is easy to grow from a cutting even without roots. When you purchase mint, leave a cutting in a glass of water. Make sure it gets some sun, and it will grow roots. You can then plant it."
        },
        {
          "headline":"Ask a friend for a root cutting.",
          "description":"Mint grows well from a cutting, so if you know someone who has a mint plant, you can simply ask for one. Most gardeners are more than happy to part with a cutting, as mint needs to be thinned often. Plant root cuttings in the soil, just as you would a regular plant."
        }
      ]
    },
    {
      "name":"Choosing a Plant",
      "steps":[
        {
          "headline":"Decide on a variety.",
          "description":"You have many options when it comes to mint varieties. Some unusual varieties include ginger mint, chocolate mint, and apple mint. Choose what you want based on the flavor or look you desire. Take a sniff of each plant to see which is most appealing to you."
        },
        {
          "headline":"Look for plants that are bright green and sturdy.",
          "description":"A healthy plant will have new growth that is bright green, full, and leafy. The mint should look and feel sturdy."
        },
        {
          "headline":"Avoid plants with yellow or orange spots and blisters (rust).",
          "description":"Most reputable dealers should weed plants with rust out. However, you should still be on the lookout. Rust will show up as blisters on the leaves, as well as black, yellow, and orange spots. The stems may might not look as green as they should, and they may be deformed."
        },
        {
          "headline":"Look for a bug-free plant.",
          "description":"You don't want to buy a plant that's infested with pests, as they could kill your plant. Mint is susceptible to spider mites, flea beetles, and root weevils, to name a few. Check the leaves, stem, and soil for signs of an infestation. There may be an infestation if you run your hand over the plant and then small flying insects appear."
        }
      ]
    },
    {
      "name":"Keeping Your Mint Healthy",
      "steps":[
        {
          "headline":"Buy a pot for your mint plant.",
          "description":"You can plant mint in the ground, but it is very aggressive. It can take over other parts of your garden. A pot helps keep the mint contained. However, make sure you buy a pot that gives your mint room to grow. You only need a single plant in your pot, as it will spread out a good deal."
        },
        {
          "headline":"Give it full sun or partial shade.",
          "description":"When choosing a location, pick one with the most sun you can find. Of course, you'll need to make sure the soil doesn't dry out. However, partial shade is also suitable for growing mint."
        },
        {
          "headline":"Provide a slightly acidic to neutral soil.",
          "description":"When choosing a potting soil, look for one that has pH between 6 and 7, which mint likes best. However, mint is not too particular, and it will grow in many soils. Also, add a bit of mulch on top, which will help create a moist soil that mint loves."
        },
        {
          "headline":"Lay a thin layer of fertilizer on top of the mint's soil every few weeks.",
          "description":"Get a water-soluble all-purpose fertilizer. Sprinkle a thin layer of it on top of the soil every few weeks to help with the plants' growth and overall health.Don't fertilize mint plants that are kept inside, or else they may lose their flavor."
        },
        {
          "headline":"Regularly pull off flower buds during the summer.",
          "description":"Pinch off the small purple, pink, and/or white flower buds on the mint plants as you notice them. This will help to elongate the harvesting season."
        },
        {
          "headline":"Harvest the mint all the way down to the first or second layer of leaves.",
          "description":"Cut or pick the leaves off and leave a few that are on the bottom 1-2 (2.5-5 cm) inches of the plant. This will allow any dead leaves to be removed and will promote growth.Younger mint leaves are more flavorful."
        }
      ]
    }
  ],
  "text":" Finding Places to Buy or Acquire Mint Pick a local nursery for plants. Often, the best sources for plants are well-respected local nurseries. These nurseries will often have experts who can answer any questions you have. Ask around to find the best nurseries in your area. Home improvement stores and other big chains often focus on just providing the cheapest price. Sometimes their quality can be hit-or-miss. Check online or mail-order catalogs. Another good option is ordering a mint plant through the mail. You can still get high-quality plants, and you'll have a larger selection of varieties. Buy mint at a farmer's market or grocery store. Mint is easy to grow from a cutting even without roots. When you purchase mint, leave a cutting in a glass of water. Make sure it gets some sun, and it will grow roots. You can then plant it. Ask a friend for a root cutting. Mint grows well from a cutting, so if you know someone who has a mint plant, you can simply ask for one. Most gardeners are more than happy to part with a cutting, as mint needs to be thinned often. Plant root cuttings in the soil, just as you would a regular plant. Choosing a Plant Decide on a variety. You have many options when it comes to mint varieties. Some unusual varieties include ginger mint, chocolate mint, and apple mint. Choose what you want based on the flavor or look you desire. Take a sniff of each plant to see which is most appealing to you. Look for plants that are bright green and sturdy. A healthy plant will have new growth that is bright green, full, and leafy. The mint should look and feel sturdy. Avoid plants with yellow or orange spots and blisters (rust). Most reputable dealers should weed plants with rust out. However, you should still be on the lookout. Rust will show up as blisters on the leaves, as well as black, yellow, and orange spots. The stems may might not look as green as they should, and they may be deformed. Look for a bug-free plant. You don't want to buy a plant that's infested with pests, as they could kill your plant. Mint is susceptible to spider mites, flea beetles, and root weevils, to name a few. Check the leaves, stem, and soil for signs of an infestation. There may be an infestation if you run your hand over the plant and then small flying insects appear. Keeping Your Mint Healthy Buy a pot for your mint plant. You can plant mint in the ground, but it is very aggressive. It can take over other parts of your garden. A pot helps keep the mint contained. However, make sure you buy a pot that gives your mint room to grow. You only need a single plant in your pot, as it will spread out a good deal. Give it full sun or partial shade. When choosing a location, pick one with the most sun you can find. Of course, you'll need to make sure the soil doesn't dry out. However, partial shade is also suitable for growing mint. Provide a slightly acidic to neutral soil. When choosing a potting soil, look for one that has pH between 6 and 7, which mint likes best. However, mint is not too particular, and it will grow in many soils. Also, add a bit of mulch on top, which will help create a moist soil that mint loves. Lay a thin layer of fertilizer on top of the mint's soil every few weeks. Get a water-soluble all-purpose fertilizer. Sprinkle a thin layer of it on top of the soil every few weeks to help with the plants' growth and overall health.Don't fertilize mint plants that are kept inside, or else they may lose their flavor. Regularly pull off flower buds during the summer. Pinch off the small purple, pink, and/or white flower buds on the mint plants as you notice them. This will help to elongate the harvesting season. Harvest the mint all the way down to the first or second layer of leaves. Cut or pick the leaves off and leave a few that are on the bottom 1-2 (2.5-5 cm) inches of the plant. This will allow any dead leaves to be removed and will promote growth.Younger mint leaves are more flavorful.",
  "tyn_model":[
    "mint",
    "plants",
    "pot",
    "water",
    "rust",
    "flea beetles",
    "potting soil",
    "mulch",
    "fertilizer",
    "all-purpose fertilizer"
  ],
  "tyn_section":[

  ]
}