{
  "title":"How to Cook Arepas",
  "url":"https://www.wikihow.com/Cook-Arepas",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine"
  ],
  "methods":[
    {
      "name":"Making Arepas",
      "steps":[
        {
          "headline":"Mix the ingredients.",
          "description":"Place the maize flour and a pinch of salt in a large mixing bowl. Use your fingers or a whisk to thoroughly combine them. Measure warm water and slowly pour it over the flour. Buy maize flour that has been pre-cooked, such as Harina P.A.N., the classic flour used in Venezuela. This flour is gluten and preservative free and comes in both white and yellow. If maize flour isn't available in your area, you can substitute it for fine-ground cornmeal or flour but make sure it is pre-cooked."
        },
        {
          "headline":"Knead the dough.",
          "description":"Use your hands to knead the flour and water together to create a soft, pliable dough. Continue kneading until the dough has no more grainy lumps and can be rolled into a ball without falling apart. If the dough seems too wet, add a few tablespoons of flour and continue kneading. If the dough falls apart easily, add a tablespoon or two of warm water. Continue adding water until the dough has reached the correct texture."
        },
        {
          "headline":"Shape the arepas.",
          "description":"Take a handful of dough in your hands and shape it into a ball, then press it with your palms to form a large patty shape. It should be about 1/2 inch thick and 3 or 4 inches across, depending on how large you want your arepas to be. Place the first arepa on a baking sheet and continue shaping arepas until you run out of dough. If you want to save the arepas to be cooked later, you may cover the baking sheet with plastic wrap and place it in the refrigerator for 3 or 4 days. You can freeze uncooked arepas, too. Wrap each one in plastic wrap and place them in a seal-able freezer container. They will keep this way for several months."
        },
        {
          "headline":"Use the traditional wire rack, which holds the arepas about 2.5 cm above the heating element in the stove, to cook them the Colombian way.",
          "description":""
        },
        {
          "headline":"To cook them the Venezuelan way, preheat the oven to 250°C/480°F.",
          "description":"Do this when you're ready to cook the arepas, before you begin to fry them. The oven should be fully preheated before you place the arepas inside."
        },
        {
          "headline":"Fry the arepas.",
          "description":"Heat a spoonful of oil in a large cast iron skillet or frying pan over medium high heat. When the oil is hot, place a few arepas in the pan and let them fry until a crust forms on one side, about 3 or 4 minutes. Flip them over and fry on the other side until a golden brown crust has formed. Set them on a baking sheet and finish frying the remaining arepas."
        },
        {
          "headline":"Bake the arepas.",
          "description":"Once all the arepas have been fried and placed on a baking sheet, place them in the preheated oven. Bake them for 15 minutes. When you think they're ready, take them out of the oven and tap the top of the arepas. If they sound hollow - as if there is nothing inside - that means the arepas are ready."
        },
        {
          "headline":"Slice the arepas.",
          "description":"Use a sharp knife to slice the arepas in half lengthwise, then stuff with your favorite filling and enjoy."
        }
      ]
    },
    {
      "name":"Filling Arepas",
      "steps":[
        {
          "headline":"Make a breakfast filling.",
          "description":"In Venezuela, arepas are often filled with ham and cheese for breakfast. Choose deviled ham salad or smoked ham and pair it with cheese like Guayanes, Paisa, or Duro. If you can't find one of the traditional Venezuelan cheese varieties, you can substitute queso fresco or mozzarella. For a less traditional but equally delicious breakfast filling, try scrambled eggs and salsa."
        },
        {
          "headline":"Make a snack filling.",
          "description":"Arepas are often eaten plain, or with a simple filling of cheese as a snack. For a heartier snack, make one of these simple arepa fillings:\nChicken salad and avocado. Combine chopped chicken meat, mayonnaise, diced onions, and diced celery with salt and pepper to taste. Spread it over one half of the arepa and add a few slices of avocado, then top with the other arepa half. Black beans and salsa. Spread black bean paste or whole black beans on one side of the arepa, and top with spicy salsa. You can also add a few slices of cheese to make the arepa richer."
        },
        {
          "headline":"Make De Pabellón arepas.",
          "description":"After arepas, de Pabellón is Venezuela's most treasured dish. The combination of the two is exquisite. A de Pabellón arepa consists of the following ingredients:\nPulled or shredded beef, black beans, and fried plantains. This is the most classic version. Top the beef, beans and plantains with a fried egg and cheese to take it over the top."
        }
      ]
    }
  ],
  "text":" Making Arepas Mix the ingredients. Place the maize flour and a pinch of salt in a large mixing bowl. Use your fingers or a whisk to thoroughly combine them. Measure warm water and slowly pour it over the flour. Buy maize flour that has been pre-cooked, such as Harina P.A.N., the classic flour used in Venezuela. This flour is gluten and preservative free and comes in both white and yellow. If maize flour isn't available in your area, you can substitute it for fine-ground cornmeal or flour but make sure it is pre-cooked. Knead the dough. Use your hands to knead the flour and water together to create a soft, pliable dough. Continue kneading until the dough has no more grainy lumps and can be rolled into a ball without falling apart. If the dough seems too wet, add a few tablespoons of flour and continue kneading. If the dough falls apart easily, add a tablespoon or two of warm water. Continue adding water until the dough has reached the correct texture. Shape the arepas. Take a handful of dough in your hands and shape it into a ball, then press it with your palms to form a large patty shape. It should be about 1/2 inch thick and 3 or 4 inches across, depending on how large you want your arepas to be. Place the first arepa on a baking sheet and continue shaping arepas until you run out of dough. If you want to save the arepas to be cooked later, you may cover the baking sheet with plastic wrap and place it in the refrigerator for 3 or 4 days. You can freeze uncooked arepas, too. Wrap each one in plastic wrap and place them in a seal-able freezer container. They will keep this way for several months. Use the traditional wire rack, which holds the arepas about 2.5 cm above the heating element in the stove, to cook them the Colombian way.  To cook them the Venezuelan way, preheat the oven to 250°C/480°F. Do this when you're ready to cook the arepas, before you begin to fry them. The oven should be fully preheated before you place the arepas inside. Fry the arepas. Heat a spoonful of oil in a large cast iron skillet or frying pan over medium high heat. When the oil is hot, place a few arepas in the pan and let them fry until a crust forms on one side, about 3 or 4 minutes. Flip them over and fry on the other side until a golden brown crust has formed. Set them on a baking sheet and finish frying the remaining arepas. Bake the arepas. Once all the arepas have been fried and placed on a baking sheet, place them in the preheated oven. Bake them for 15 minutes. When you think they're ready, take them out of the oven and tap the top of the arepas. If they sound hollow - as if there is nothing inside - that means the arepas are ready. Slice the arepas. Use a sharp knife to slice the arepas in half lengthwise, then stuff with your favorite filling and enjoy. Filling Arepas Make a breakfast filling. In Venezuela, arepas are often filled with ham and cheese for breakfast. Choose deviled ham salad or smoked ham and pair it with cheese like Guayanes, Paisa, or Duro. If you can't find one of the traditional Venezuelan cheese varieties, you can substitute queso fresco or mozzarella. For a less traditional but equally delicious breakfast filling, try scrambled eggs and salsa. Make a snack filling. Arepas are often eaten plain, or with a simple filling of cheese as a snack. For a heartier snack, make one of these simple arepa fillings:\nChicken salad and avocado. Combine chopped chicken meat, mayonnaise, diced onions, and diced celery with salt and pepper to taste. Spread it over one half of the arepa and add a few slices of avocado, then top with the other arepa half. Black beans and salsa. Spread black bean paste or whole black beans on one side of the arepa, and top with spicy salsa. You can also add a few slices of cheese to make the arepa richer. Make De Pabellón arepas. After arepas, de Pabellón is Venezuela's most treasured dish. The combination of the two is exquisite. A de Pabellón arepa consists of the following ingredients:\nPulled or shredded beef, black beans, and fried plantains. This is the most classic version. Top the beef, beans and plantains with a fried egg and cheese to take it over the top.",
  "tyn_model":[
    "flour",
    "cheese",
    "water",
    "baking sheet",
    "oven",
    "maize flour",
    "black beans",
    "plastic wrap",
    "oil",
    "salsa",
    "avocado",
    "beef",
    "plantains",
    "salt",
    "large mixing bowl",
    "whisk",
    "refrigerator",
    "freezer container",
    "wire rack",
    "stove",
    "large cast iron skillet",
    "frying pan",
    "sharp knife",
    "ham",
    "deviled ham salad",
    "smoked ham",
    "mozzarella",
    "eggs",
    "mayonnaise",
    "onions",
    "celery",
    "salt and pepper",
    "black bean paste",
    "spicy salsa",
    "de pabellón",
    "beans",
    "fried egg"
  ],
  "tyn_section":[

  ]
}