{
  "title":"How to Make Chocolate Peanut Butter Brownies",
  "url":"https://www.wikihow.com/Make-Chocolate-Peanut-Butter-Brownies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Brownies"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Preheat the oven to 320ºF/160ºC.",
          "description":""
        },
        {
          "headline":"Melt the butter.",
          "description":"Melt the butter in a saucepan. When the butter has melted, you take the pan away from the cooking plate and put it aside."
        },
        {
          "headline":"Pour the cocoa, sugar, water, vanilla and salt into the bowl of a mixer.",
          "description":"Mix it on low speed. While it’s mixing, you pour the melted butter into the bowl. When everything is fully blended, you stop the machine."
        },
        {
          "headline":"Crack the eggs into the bowl, and start the machine again.",
          "description":"Be careful not to mix it for too long. As soon as everything is mixed, you turn off the machine."
        },
        {
          "headline":"Use a rubber scraper.",
          "description":"Use it around the edge of the bowl, so that you get as much of the mixture as possible."
        },
        {
          "headline":"Pour 45 g wheat into a the bowl, and mix everything using the rubber scraper.",
          "description":""
        },
        {
          "headline":"Add the nuts into the mix, and stir.",
          "description":""
        },
        {
          "headline":"Take out a baking pan.",
          "description":"It can be a good idea to use aluminum foil, and spray it with cooking spray. Pour the batter into the pan and put it into the preheated oven. Bake it for about 25 minutes."
        },
        {
          "headline":"Let it cool off when it's done.",
          "description":"Then you put it in the freezer for about 20 minutes."
        }
      ]
    },
    {
      "name":"Peanut Butter Layer",
      "steps":[
        {
          "headline":"Whip together all the ingredients in the mixer.",
          "description":"Mix it well. If you think it looks a bit dry, you just add some more milk than the recipe says."
        },
        {
          "headline":"Take the brownies out of the fridge.",
          "description":"Then pour the peanut mixture onto the cake. Put it in the freezer for at least 30 minutes."
        }
      ]
    },
    {
      "name":"Ganache",
      "steps":[
        {
          "headline":"Warm the milk and vanilla.",
          "description":"When the milk starts to boil, you immediately take it off the cooking plate."
        },
        {
          "headline":"Place the chocolate pieces in a bowl, and pour the warm milk over them.",
          "description":"Let it rest for a couple of minutes. When the chocolate looks like it has melted, whip it lightly until it gets thick."
        },
        {
          "headline":"Pour it over the rest of the cake.",
          "description":"Use a frosting spatula to make it as smooth as possible. Put it into the freezer for at least one hour."
        },
        {
          "headline":"Ready to serve.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Steps Preheat the oven to 320ºF/160ºC.  Melt the butter. Melt the butter in a saucepan. When the butter has melted, you take the pan away from the cooking plate and put it aside. Pour the cocoa, sugar, water, vanilla and salt into the bowl of a mixer. Mix it on low speed. While it’s mixing, you pour the melted butter into the bowl. When everything is fully blended, you stop the machine. Crack the eggs into the bowl, and start the machine again. Be careful not to mix it for too long. As soon as everything is mixed, you turn off the machine. Use a rubber scraper. Use it around the edge of the bowl, so that you get as much of the mixture as possible. Pour 45 g wheat into a the bowl, and mix everything using the rubber scraper.  Add the nuts into the mix, and stir.  Take out a baking pan. It can be a good idea to use aluminum foil, and spray it with cooking spray. Pour the batter into the pan and put it into the preheated oven. Bake it for about 25 minutes. Let it cool off when it's done. Then you put it in the freezer for about 20 minutes. Peanut Butter Layer Whip together all the ingredients in the mixer. Mix it well. If you think it looks a bit dry, you just add some more milk than the recipe says. Take the brownies out of the fridge. Then pour the peanut mixture onto the cake. Put it in the freezer for at least 30 minutes. Ganache Warm the milk and vanilla. When the milk starts to boil, you immediately take it off the cooking plate. Place the chocolate pieces in a bowl, and pour the warm milk over them. Let it rest for a couple of minutes. When the chocolate looks like it has melted, whip it lightly until it gets thick. Pour it over the rest of the cake. Use a frosting spatula to make it as smooth as possible. Put it into the freezer for at least one hour. Ready to serve.  Finished. ",
  "tyn_model":[
    "bowl",
    "butter",
    "milk",
    "oven",
    "cooking plate",
    "vanilla",
    "mixer",
    "rubber scraper",
    "chocolate",
    "saucepan",
    "cocoa",
    "sugar",
    "water",
    "salt",
    "eggs",
    "wheat",
    "baking pan",
    "aluminum foil",
    "cooking spray",
    "peanut butter",
    "peanut",
    "ganache",
    "frosting spatula",
    "freezer"
  ],
  "tyn_section":[

  ]
}