{
  "title":"How to Grow a Sensitive Plant",
  "url":"https://www.wikihow.com/Grow-a-Sensitive-Plant",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "parts":[
    {
      "name":"Planting Mimosa Pudica",
      "steps":[
        {
          "headline":"Obtain your seeds.",
          "description":"Get your sensitive plant seeds from a trusted online vendor such as an eBay seller with good feedback."
        },
        {
          "headline":"Soak the seeds in water.",
          "description":"Soak the Mimosa pudica seeds in a container of warm tap water for 24 to 48 hours before you plant your seeds. This will help them to sprout faster."
        },
        {
          "headline":"Plant the seeds.",
          "description":"Plant the seeds one-eighth inch deep in a flower pot or cup of soil. Use a good potting mix with added perlite to allow good drainage and air circulation between the roots. Cover the flower pot or cup with clear plastic wrap and wait for the plants to sprout. This should take about a week."
        },
        {
          "headline":"Place the sensitive plant in a warm location.",
          "description":"Remove the clear wrap or greenhouse cover and place the young Mimosa pudica in a warm and mostly sunny location once they have popped above the soil."
        }
      ]
    },
    {
      "name":"Propagating a Mimosa Pudica",
      "steps":[
        {
          "headline":"Cut a 4 inch (10 cm) shoot from a mature sensitive plant.",
          "description":"You can plant the shoot and grow a new sensitive plant from it. Make sure the shoot you cut has at least one leaf node on it."
        },
        {
          "headline":"Plant the shoot in a pot using a peat moss and perlite potting mixture.",
          "description":"To plant the shoot, dig a small hole in the potting mixture and place the root-end of the shoot in it. Then, fill in the hole.If you want the shoot to grow roots before you pot it, put it in a glass of water after you cut it and set it in a sunny location. Once the roots start to form, transfer the shoot to a pot."
        },
        {
          "headline":"Cover the top of the pot with plastic wrap.",
          "description":"The plastic wrap will create a humid environment for the shoot to get established in."
        },
        {
          "headline":"Keep the soil moist until the shoot gets established.",
          "description":"Check on the soil daily to make sure it isn't dry. If it is, water it thoroughly until the soil is moist, but not soaked."
        }
      ]
    },
    {
      "name":"Caring For Mimosa Pudica",
      "steps":[
        {
          "headline":"Maintain the correct temperature.",
          "description":"Mimosa pudica or sensitive plants prefer warm, sunny, indoor locations (like in a window) with temperatures between 65 to 70 °F (18 to 21 °C). The sensitive plant can survive outdoors in the summer (in hardiness zones 9 to 11) but it has a tendency to spread and become weedy."
        },
        {
          "headline":"Water and fertilize the plant.",
          "description":"The sensitive plant should be watered regularly to keep the soil moist, but not soggy. Try to use loamy soil for improved drainage, as this can prevent root rot. During growing season, fertilize the sensitive plant approximately every two weeks with a diluted high-potassium fertilizer."
        },
        {
          "headline":"Prevent disease.",
          "description":"The sensitive plant is not particularly prone to disease, but it may become infested with some common pests, such as red spider mites, mealy bugs, and thrips. These can be removed by spraying the plant with a direct stream of water or neem oil every few days. Avoid using insecticidal soaps, as these can turn the leaves of the plant black."
        }
      ]
    }
  ],
  "text":" Planting Mimosa Pudica Obtain your seeds. Get your sensitive plant seeds from a trusted online vendor such as an eBay seller with good feedback. Soak the seeds in water. Soak the Mimosa pudica seeds in a container of warm tap water for 24 to 48 hours before you plant your seeds. This will help them to sprout faster. Plant the seeds. Plant the seeds one-eighth inch deep in a flower pot or cup of soil. Use a good potting mix with added perlite to allow good drainage and air circulation between the roots. Cover the flower pot or cup with clear plastic wrap and wait for the plants to sprout. This should take about a week. Place the sensitive plant in a warm location. Remove the clear wrap or greenhouse cover and place the young Mimosa pudica in a warm and mostly sunny location once they have popped above the soil. Propagating a Mimosa Pudica Cut a 4 inch (10 cm) shoot from a mature sensitive plant. You can plant the shoot and grow a new sensitive plant from it. Make sure the shoot you cut has at least one leaf node on it. Plant the shoot in a pot using a peat moss and perlite potting mixture. To plant the shoot, dig a small hole in the potting mixture and place the root-end of the shoot in it. Then, fill in the hole.If you want the shoot to grow roots before you pot it, put it in a glass of water after you cut it and set it in a sunny location. Once the roots start to form, transfer the shoot to a pot. Cover the top of the pot with plastic wrap. The plastic wrap will create a humid environment for the shoot to get established in. Keep the soil moist until the shoot gets established. Check on the soil daily to make sure it isn't dry. If it is, water it thoroughly until the soil is moist, but not soaked. Caring For Mimosa Pudica Maintain the correct temperature. Mimosa pudica or sensitive plants prefer warm, sunny, indoor locations (like in a window) with temperatures between 65 to 70 °F (18 to 21 °C). The sensitive plant can survive outdoors in the summer (in hardiness zones 9 to 11) but it has a tendency to spread and become weedy. Water and fertilize the plant. The sensitive plant should be watered regularly to keep the soil moist, but not soggy. Try to use loamy soil for improved drainage, as this can prevent root rot. During growing season, fertilize the sensitive plant approximately every two weeks with a diluted high-potassium fertilizer. Prevent disease. The sensitive plant is not particularly prone to disease, but it may become infested with some common pests, such as red spider mites, mealy bugs, and thrips. These can be removed by spraying the plant with a direct stream of water or neem oil every few days. Avoid using insecticidal soaps, as these can turn the leaves of the plant black.",
  "tyn_model":[
    "water",
    "pot",
    "mimosa pudica",
    "flower pot",
    "plastic wrap",
    "tap water",
    "clear plastic wrap",
    "clear wrap",
    "greenhouse cover",
    "peat moss",
    "perlite potting mixture",
    "potting mixture",
    "high-potassium fertilizer",
    "neem oil",
    "insecticidal soaps"
  ],
  "tyn_section":[

  ]
}