{
  "title":"How to Make Nutella and Banana Wontons",
  "url":"https://www.wikihow.com/Make-Nutella-and-Banana-Wontons",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets"
  ],
  "steps":[
    {
      "headline":"Make a \"chocolate piping bag\".",
      "description":"Spoon the Nutella spread into a sandwich size plastic sealable bag, seal it, and snip off a small bottom corner."
    },
    {
      "headline":"Place a banana slice and a generous squirt of Nutella in the middle of a wonton wrapper.",
      "description":""
    },
    {
      "headline":"Use fork prongs or a pastry brush to gently wipe egg wash on the edges of the wrapper.",
      "description":""
    },
    {
      "headline":"Fold the wrapper over into a triangle.",
      "description":"You might need to nudge the banana and chocolate away from you to get a nicer crease. Be sure to push out any air before sealing."
    },
    {
      "headline":"Fry the wontons.",
      "description":"Heat the vegetable oil in a medium deep skillet and carefully add the wontons in. Just work on cooking as many as can comfortably fit without touching each other. Flip each one over when golden brown and fry on the other side."
    },
    {
      "headline":"Remove the fried wontons from the skillet and place them on paper towels to dry.",
      "description":""
    },
    {
      "headline":"Serve with cinnamon sugar or powdered sugar.",
      "description":""
    }
  ],
  "text":" Make a \"chocolate piping bag\". Spoon the Nutella spread into a sandwich size plastic sealable bag, seal it, and snip off a small bottom corner. Place a banana slice and a generous squirt of Nutella in the middle of a wonton wrapper.  Use fork prongs or a pastry brush to gently wipe egg wash on the edges of the wrapper.  Fold the wrapper over into a triangle. You might need to nudge the banana and chocolate away from you to get a nicer crease. Be sure to push out any air before sealing. Fry the wontons. Heat the vegetable oil in a medium deep skillet and carefully add the wontons in. Just work on cooking as many as can comfortably fit without touching each other. Flip each one over when golden brown and fry on the other side. Remove the fried wontons from the skillet and place them on paper towels to dry.  Serve with cinnamon sugar or powdered sugar. ",
  "tyn_model":[
    "banana",
    "skillet",
    "chocolate piping bag",
    "nutella spread",
    "nutella",
    "wonton",
    "fork prongs",
    "pastry brush",
    "chocolate",
    "vegetable oil",
    "paper towels",
    "cinnamon sugar",
    "powdered sugar"
  ],
  "tyn_section":[

  ]
}