{
  "title":"How to Make a Clothes Pin Butterfly",
  "url":"https://www.wikihow.com/Make-a-Clothes-Pin-Butterfly",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Preparing the Base of the Clothes Pin",
      "steps":[
        {
          "headline":"Decide on the design for the butterfly's eyes and mouth.",
          "description":"These can be very simple, such as just two dots and a semi-circle curve drawn with a marker. Or, you might like to stick on two googly eyes or make spots of glitter or use fabric such as felt to make the eyes and mouth. Be as simple or complicated as you'd like."
        },
        {
          "headline":"Add the eyes and mouth.",
          "description":"Depending on what you've chosen to do, add the eyes and mouth to the upper end of one side of the clothes pin, at the end away from the spring. If using any items that require gluing, allow to dry before proceeding."
        }
      ]
    },
    {
      "name":"Making the Butterfly's Wings",
      "steps":[
        {
          "headline":"Place a coffee filter down on the work space.",
          "description":"With a pencil, draw two wing shapes. These can be as simple as two triangles, or more elaborate, such as using curved or pointed edges."
        },
        {
          "headline":"Cut out the two wing shapes you've drawn out.",
          "description":""
        },
        {
          "headline":"Decorate the wings as liked.",
          "description":"You can paint, draw on or add glitter glue to the wings to make them prettier. Let the paint or glue dry before adding to the butterfly. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/9f\\/Make-a-Clothes-Pin-Butterfly-Step-5Bullet1.jpg\\/v4-460px-Make-a-Clothes-Pin-Butterfly-Step-5Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/9f\\/Make-a-Clothes-Pin-Butterfly-Step-5Bullet1.jpg\\/v4-760px-Make-a-Clothes-Pin-Butterfly-Step-5Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        }
      ]
    },
    {
      "name":"Assembling the Butterfly",
      "steps":[
        {
          "headline":"Open up the clothes pin at the spring.",
          "description":"Drop the wings in and shut closed. There you have a butterfly!"
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preparing the Base of the Clothes Pin Decide on the design for the butterfly's eyes and mouth. These can be very simple, such as just two dots and a semi-circle curve drawn with a marker. Or, you might like to stick on two googly eyes or make spots of glitter or use fabric such as felt to make the eyes and mouth. Be as simple or complicated as you'd like. Add the eyes and mouth. Depending on what you've chosen to do, add the eyes and mouth to the upper end of one side of the clothes pin, at the end away from the spring. If using any items that require gluing, allow to dry before proceeding. Making the Butterfly's Wings Place a coffee filter down on the work space. With a pencil, draw two wing shapes. These can be as simple as two triangles, or more elaborate, such as using curved or pointed edges. Cut out the two wing shapes you've drawn out.  Decorate the wings as liked. You can paint, draw on or add glitter glue to the wings to make them prettier. Let the paint or glue dry before adding to the butterfly. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/9f\\/Make-a-Clothes-Pin-Butterfly-Step-5Bullet1.jpg\\/v4-460px-Make-a-Clothes-Pin-Butterfly-Step-5Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/9\\/9f\\/Make-a-Clothes-Pin-Butterfly-Step-5Bullet1.jpg\\/v4-760px-Make-a-Clothes-Pin-Butterfly-Step-5Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Assembling the Butterfly Open up the clothes pin at the spring. Drop the wings in and shut closed. There you have a butterfly! Finished. ",
  "tyn_model":[
    "clothes pin",
    "clothes-",
    "marker",
    "glitter",
    "coffee filter",
    "pencil",
    "glitter glue",
    "paint",
    "glue",
    "clothes-pin",
    "parser",
    "butterfly"
  ],
  "tyn_section":[

  ]
}