{
  "title":"How to Make Chocolate Flavored Pancakes",
  "url":"https://www.wikihow.com/Make-Chocolate-Flavored-Pancakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Pancakes"
  ],
  "methods":[
    {
      "name":"Cocoa Pancakes",
      "steps":[
        {
          "headline":"Add in the flour then pour in milk.",
          "description":""
        },
        {
          "headline":"Beat egg and cocoa separately and add to flour and milk mixture.",
          "description":""
        },
        {
          "headline":"Mix well until lumps are out.",
          "description":""
        },
        {
          "headline":"Grease the pan and turn the stove on to a medium high heat.",
          "description":""
        },
        {
          "headline":"Use a ladle to add a scoop of the batter onto the heated pan.",
          "description":""
        },
        {
          "headline":"Wait until there are bubbles on top of the batter.",
          "description":"Flip the pancake over when it's golden brown."
        },
        {
          "headline":"Cook for an additional 3 minutes or so, or until done.",
          "description":""
        },
        {
          "headline":"Serve on a serving plate and enjoy.",
          "description":""
        }
      ]
    },
    {
      "name":"Chocolate Spread Pancakes",
      "steps":[
        {
          "headline":"Make the pancake batter.",
          "description":"Mix the flour, milk and eggs together to make a batter. Melt the chocolate spread or chocolate before adding to the batter, then tip in. Whisk it all together till there are no lumps."
        },
        {
          "headline":"Heat the vegetable oil in a large non-stick frying pan on medium heat.",
          "description":""
        },
        {
          "headline":"Add a ladle of batter into the pan.",
          "description":"Swirl it in a circular motion. Keep swirling until the batter has spread evenly into a circle covering the base of the pan."
        },
        {
          "headline":"Let it fry for about 30-40 seconds.",
          "description":"Use a spatula to check that the bottom of the pancake has turned golden-brown."
        },
        {
          "headline":"Flip the pancake in the pan and let the other side fry for 30-40 seconds.",
          "description":""
        },
        {
          "headline":"Remove it from the pan once both sides of the pancake are golden brown.",
          "description":"Then serve it on a plate."
        },
        {
          "headline":"Drizzle chocolate syrup on top of the pancake for an added boost.",
          "description":"It's absolutely delicious!"
        }
      ]
    }
  ],
  "text":" Cocoa Pancakes Add in the flour then pour in milk.  Beat egg and cocoa separately and add to flour and milk mixture.  Mix well until lumps are out.  Grease the pan and turn the stove on to a medium high heat.  Use a ladle to add a scoop of the batter onto the heated pan.  Wait until there are bubbles on top of the batter. Flip the pancake over when it's golden brown. Cook for an additional 3 minutes or so, or until done.  Serve on a serving plate and enjoy.  Chocolate Spread Pancakes Make the pancake batter. Mix the flour, milk and eggs together to make a batter. Melt the chocolate spread or chocolate before adding to the batter, then tip in. Whisk it all together till there are no lumps. Heat the vegetable oil in a large non-stick frying pan on medium heat.  Add a ladle of batter into the pan. Swirl it in a circular motion. Keep swirling until the batter has spread evenly into a circle covering the base of the pan. Let it fry for about 30-40 seconds. Use a spatula to check that the bottom of the pancake has turned golden-brown. Flip the pancake in the pan and let the other side fry for 30-40 seconds.  Remove it from the pan once both sides of the pancake are golden brown. Then serve it on a plate. Drizzle chocolate syrup on top of the pancake for an added boost. It's absolutely delicious!",
  "tyn_model":[
    "flour",
    "milk",
    "chocolate spread",
    "pan",
    "cocoa",
    "stove",
    "ladle",
    "serving plate",
    "eggs",
    "chocolate",
    "vegetable oil",
    "large non-stick frying",
    "spatula",
    "plate",
    "chocolate syrup"
  ],
  "tyn_section":[

  ]
}