{
  "title":"How to Have Fun Making Smoothies",
  "url":"https://www.wikihow.com/Have-Fun-Making-Smoothies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk",
    "Smoothies"
  ],
  "steps":[
    {
      "headline":"Think about what kind of smoothie you want to make.",
      "description":"If you're entertaining a group of people, you don't want to end up making too little and if you're making something for yourself, you don't want to make too much. Also, think about what you're in the mood for. Do you want to make a healthy, fruit smoothie or want a dessert one with chocolate?"
    },
    {
      "headline":"Find a blender.",
      "description":"Plug the base in, then put the container part on top of that. Instead of using a blender, some people use other kitchen appliances that do the same job, for example a food processor."
    },
    {
      "headline":"Get the essential needs to make a smoothie.",
      "description":"Ice cubes should only be in a little amount; about 4 to 6 cubes is enough, depending on the size. Ice cream is more for milkshakes and the flavor of the ice cream is up to you. Strawberry, chocolate, and vanilla are the top flavors in shakes. Milk is added in smoothies and shakes, but use a little portion because you don't want to overpower the other flavors."
    },
    {
      "headline":"Add fruits and other foods.",
      "description":"Chop up strawberries, bananas, and other tasty foods. Make sure that the fruit is fully washed before putting it into the blender and the action of chopping or cutting the fruit makes it easier in the blending process."
    },
    {
      "headline":"Add your liquid.",
      "description":"For a citrus taste, you can put in some orange juice or even lemonade. If you are going for a chocolate smoothie, squeeze in some chocolate syrup."
    },
    {
      "headline":"Blend everything together!",
      "description":"If you're adding ice cubes, be sure that they're all completely blended in with the mixture. Having chunks or pieces of ice isn't tasteful to chew on while drinking the smoothie. You can blend your drink for 15 seconds to a minute, depending how much stuff you put into the blender."
    },
    {
      "headline":"Pour it into glasses.",
      "description":"Top your drink(s) with whipped cream or sprinkle nuts on the top. Give your guests something to smile about and place a cherry or an umbrella drink on the top."
    },
    {
      "headline":"Be sure to clean up your mess afterwards.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Think about what kind of smoothie you want to make. If you're entertaining a group of people, you don't want to end up making too little and if you're making something for yourself, you don't want to make too much. Also, think about what you're in the mood for. Do you want to make a healthy, fruit smoothie or want a dessert one with chocolate? Find a blender. Plug the base in, then put the container part on top of that. Instead of using a blender, some people use other kitchen appliances that do the same job, for example a food processor. Get the essential needs to make a smoothie. Ice cubes should only be in a little amount; about 4 to 6 cubes is enough, depending on the size. Ice cream is more for milkshakes and the flavor of the ice cream is up to you. Strawberry, chocolate, and vanilla are the top flavors in shakes. Milk is added in smoothies and shakes, but use a little portion because you don't want to overpower the other flavors. Add fruits and other foods. Chop up strawberries, bananas, and other tasty foods. Make sure that the fruit is fully washed before putting it into the blender and the action of chopping or cutting the fruit makes it easier in the blending process. Add your liquid. For a citrus taste, you can put in some orange juice or even lemonade. If you are going for a chocolate smoothie, squeeze in some chocolate syrup. Blend everything together! If you're adding ice cubes, be sure that they're all completely blended in with the mixture. Having chunks or pieces of ice isn't tasteful to chew on while drinking the smoothie. You can blend your drink for 15 seconds to a minute, depending how much stuff you put into the blender. Pour it into glasses. Top your drink(s) with whipped cream or sprinkle nuts on the top. Give your guests something to smile about and place a cherry or an umbrella drink on the top. Be sure to clean up your mess afterwards.  Finished. ",
  "tyn_model":[
    "blender",
    "ice cream",
    "food processor",
    "strawberry",
    "chocolate",
    "vanilla",
    "milk",
    "strawberries",
    "bananas",
    "orange juice",
    "lemonade",
    "chocolate syrup",
    "ice cubes",
    "ice",
    "whipped cream"
  ],
  "tyn_section":[

  ]
}