{
  "title":"How to Find K K Slider on Animal Crossing",
  "url":"https://www.wikihow.com/Find-K-K-Slider-on-Animal-Crossing",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo DS",
    "Animal Crossing: Wild World"
  ],
  "steps":[
    {
      "headline":"Wait until the day of the week is Saturday and the time is 8:00 pm.",
      "description":"If you don't want to wait, then you can time travel from the menu when it shows you in your bed."
    },
    {
      "headline":"Go to the Museum.",
      "description":"The location of that varies by town. Look on your map if you are having trouble finding it. Once you've arrived there, turn to the left and go into the Coffee Shop. On the small stage, you should see a white dog with a guitar."
    },
    {
      "headline":"Talk to him and he will ask if you want to hear a song.",
      "description":"Type in the name of the song you would like. If you can't think of a song, or just don't feel like picking one out, then you can ask him for a random song."
    },
    {
      "headline":"Sit back and listen!",
      "description":"The game credits will go through while the song is playing, so you may want to do something else if you're not willing to look at the credits while waiting."
    },
    {
      "headline":"Wait for the song to finish.",
      "description":"After the song is over, KK should give you a copy to put on your stereo. If you're doing something else, check your DS periodically to see where he is with the song, or at least keep the volume up."
    }
  ],
  "text":" Wait until the day of the week is Saturday and the time is 8:00 pm. If you don't want to wait, then you can time travel from the menu when it shows you in your bed. Go to the Museum. The location of that varies by town. Look on your map if you are having trouble finding it. Once you've arrived there, turn to the left and go into the Coffee Shop. On the small stage, you should see a white dog with a guitar. Talk to him and he will ask if you want to hear a song. Type in the name of the song you would like. If you can't think of a song, or just don't feel like picking one out, then you can ask him for a random song. Sit back and listen! The game credits will go through while the song is playing, so you may want to do something else if you're not willing to look at the credits while waiting. Wait for the song to finish. After the song is over, KK should give you a copy to put on your stereo. If you're doing something else, check your DS periodically to see where he is with the song, or at least keep the volume up.",
  "tyn_model":[
    "guitar",
    "ds"
  ],
  "tyn_section":[

  ]
}