{
  "title":"How to Make Chicken Avocado Pasta",
  "url":"https://www.wikihow.com/Make-Chicken-Avocado-Pasta",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles"
  ],
  "steps":[
    {
      "headline":"Thaw the chicken breast in the microwave.",
      "description":""
    },
    {
      "headline":"Begin boiling two medium sized pots of water.",
      "description":""
    },
    {
      "headline":"While the water is boiling, cut the thawed chicken into bite sized pieces.",
      "description":""
    },
    {
      "headline":"The water should be boiling by this time.",
      "description":"Place the pieces of chicken into one of the pots and about a cup and a half of pasta noodles into the other pot."
    },
    {
      "headline":"While you're waiting for the chicken and noodles to cook, slice up half an avocado into small pieces.",
      "description":""
    },
    {
      "headline":"When the noodles and chicken are ready, put them into a bowl.",
      "description":"Add the avocado, some sauce or dressing of your choice, Parmesan cheese, and a little oregano to create more taste. Mix it all together."
    },
    {
      "headline":"The finished recipe.",
      "description":""
    },
    {
      "headline":"Enjoy your delicious home-made pasta recipe full of healthy goodness!",
      "description":""
    }
  ],
  "text":" Thaw the chicken breast in the microwave.  Begin boiling two medium sized pots of water.  While the water is boiling, cut the thawed chicken into bite sized pieces.  The water should be boiling by this time. Place the pieces of chicken into one of the pots and about a cup and a half of pasta noodles into the other pot. While you're waiting for the chicken and noodles to cook, slice up half an avocado into small pieces.  When the noodles and chicken are ready, put them into a bowl. Add the avocado, some sauce or dressing of your choice, Parmesan cheese, and a little oregano to create more taste. Mix it all together. The finished recipe.  Enjoy your delicious home-made pasta recipe full of healthy goodness! ",
  "tyn_model":[
    "water",
    "avocado",
    "microwave",
    "pasta noodles",
    "chicken",
    "bowl",
    "parmesan cheese",
    "oregano"
  ],
  "tyn_section":[

  ]
}