{
  "title":"How to Faux Paint a Wall",
  "url":"https://www.wikihow.com/Faux-Paint-a-Wall",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "parts":[
    {
      "name":"Choosing a Faux Painting Technique",
      "steps":[
        {
          "headline":"Decide whether you want a smoother or a more worn look.",
          "description":"Ragging generally gives the smoothest texture. Color wash gives the most worn look, while sponging gives a very textured appearance."
        },
        {
          "headline":"Decide how many coats of paint you want.",
          "description":"The more paint you add to your surface, the more textured the surface will appear. A single coat leaves brush or rag marks on the wall, while a second coat will mostly cover these and provide a more even appearance."
        }
      ]
    },
    {
      "name":"Choosing Faux Paint and Materials",
      "steps":[
        {
          "headline":"Pick a color for your faux paint.",
          "description":"Look at paint samples in a store to see how paint will appear when applied. You can tweak the brightness of the paint by adding a light or darker base coat, and you can also mix two colors to create different tones."
        },
        {
          "headline":"Purchase your faux paint and painting materials.",
          "description":"Buy the paint, base coat, and other materials--a brush, rag, or sponge, as well spackling paste for filling irregularities in the wall--at a paint or home supply store. Consult sales staff to make sure you are buying the right colors for your faux paint and base coat."
        }
      ]
    },
    {
      "name":"Preparation",
      "steps":[
        {
          "headline":"Apply painter's tape to all windows, doors, trim, the ceiling, and the floor.",
          "description":""
        },
        {
          "headline":"Wash the wall with a wet rag and soapy water.",
          "description":""
        },
        {
          "headline":"Fill any holes or cracks with spackling paste.",
          "description":""
        },
        {
          "headline":"Apply a semi-gloss base coat to the wall using a roller.",
          "description":"The base coat is necessary to protect the wall and for the faux paint gloss to appear how it should. Dip the roller in the base coat and apply it to the wall with long, even strokes from ceiling to floor."
        },
        {
          "headline":"Let the base coat dry for 3 to 6 hours.",
          "description":""
        },
        {
          "headline":"Apply a second base coat on top of the first.",
          "description":""
        },
        {
          "headline":"Wait 24 hours.",
          "description":""
        }
      ]
    },
    {
      "name":"Color Wash",
      "steps":[
        {
          "headline":"Dip a paint brush into the faux glaze so that the tips of the bristles are wet.",
          "description":""
        },
        {
          "headline":"Brush the glaze onto the wall in fast, diagonal strokes.",
          "description":"Your strokes should crisscross one another and look informal. Painting a series of X's is one good way to get the desired look. Allow sections of base coat to appear through the glaze; do not cover the entire wall."
        },
        {
          "headline":"Rub the brush strokes gently with a dry rag to soften the appearance of bristle marks.",
          "description":""
        },
        {
          "headline":"Let the glaze dry for approximately 4 hours.",
          "description":""
        },
        {
          "headline":"Apply a second glaze coat, if desired.",
          "description":""
        }
      ]
    },
    {
      "name":"Sponging",
      "steps":[
        {
          "headline":"Dip a sponge into water and ring it out thoroughly.",
          "description":""
        },
        {
          "headline":"Brush glaze onto the sponge using a paint brush.",
          "description":""
        },
        {
          "headline":"Apply glaze to the wall by pressing the sponge gently onto the wall in random patterns.",
          "description":"Let the base coat show through in sections. To create the proper effect, rotate the sponge before each application and do not apply glaze in a pattern. Press the sponge against the wall gently; squeezing or pushing hard will create odd spots of darker color."
        },
        {
          "headline":"Continue until the wall is covered.",
          "description":""
        },
        {
          "headline":"Let the glaze dry for approximately 4 hours.",
          "description":""
        },
        {
          "headline":"Apply a second glaze coat, if desired.",
          "description":""
        }
      ]
    },
    {
      "name":"Ragging",
      "steps":[
        {
          "headline":"Dip a rag in water and ring it out thoroughly.",
          "description":""
        },
        {
          "headline":"Dip the rag into glaze and blot it until no glaze is dripping off.",
          "description":""
        },
        {
          "headline":"Ball the rag in your fist.",
          "description":""
        },
        {
          "headline":"Apply glaze to the wall by gently pressing the rag against it in random patterns.",
          "description":"Let the base coat show through in sections."
        },
        {
          "headline":"Refold the rag after each application to produce random patterns.",
          "description":""
        },
        {
          "headline":"Roll the rag across the wall occasionally to produce a dimpled effect.",
          "description":""
        },
        {
          "headline":"Continue until the wall is covered.",
          "description":""
        },
        {
          "headline":"Let the glaze dry for approximately 4 hours.",
          "description":""
        },
        {
          "headline":"Apply a second glaze coat, if desired.",
          "description":""
        }
      ]
    }
  ],
  "text":" Choosing a Faux Painting Technique Decide whether you want a smoother or a more worn look. Ragging generally gives the smoothest texture. Color wash gives the most worn look, while sponging gives a very textured appearance. Decide how many coats of paint you want. The more paint you add to your surface, the more textured the surface will appear. A single coat leaves brush or rag marks on the wall, while a second coat will mostly cover these and provide a more even appearance. Choosing Faux Paint and Materials Pick a color for your faux paint. Look at paint samples in a store to see how paint will appear when applied. You can tweak the brightness of the paint by adding a light or darker base coat, and you can also mix two colors to create different tones. Purchase your faux paint and painting materials. Buy the paint, base coat, and other materials--a brush, rag, or sponge, as well spackling paste for filling irregularities in the wall--at a paint or home supply store. Consult sales staff to make sure you are buying the right colors for your faux paint and base coat. Preparation Apply painter's tape to all windows, doors, trim, the ceiling, and the floor.  Wash the wall with a wet rag and soapy water.  Fill any holes or cracks with spackling paste.  Apply a semi-gloss base coat to the wall using a roller. The base coat is necessary to protect the wall and for the faux paint gloss to appear how it should. Dip the roller in the base coat and apply it to the wall with long, even strokes from ceiling to floor. Let the base coat dry for 3 to 6 hours.  Apply a second base coat on top of the first.  Wait 24 hours.  Color Wash Dip a paint brush into the faux glaze so that the tips of the bristles are wet.  Brush the glaze onto the wall in fast, diagonal strokes. Your strokes should crisscross one another and look informal. Painting a series of X's is one good way to get the desired look. Allow sections of base coat to appear through the glaze; do not cover the entire wall. Rub the brush strokes gently with a dry rag to soften the appearance of bristle marks.  Let the glaze dry for approximately 4 hours.  Apply a second glaze coat, if desired.  Sponging Dip a sponge into water and ring it out thoroughly.  Brush glaze onto the sponge using a paint brush.  Apply glaze to the wall by pressing the sponge gently onto the wall in random patterns. Let the base coat show through in sections. To create the proper effect, rotate the sponge before each application and do not apply glaze in a pattern. Press the sponge against the wall gently; squeezing or pushing hard will create odd spots of darker color. Continue until the wall is covered.  Let the glaze dry for approximately 4 hours.  Apply a second glaze coat, if desired.  Ragging Dip a rag in water and ring it out thoroughly.  Dip the rag into glaze and blot it until no glaze is dripping off.  Ball the rag in your fist.  Apply glaze to the wall by gently pressing the rag against it in random patterns. Let the base coat show through in sections. Refold the rag after each application to produce random patterns.  Roll the rag across the wall occasionally to produce a dimpled effect.  Continue until the wall is covered.  Let the glaze dry for approximately 4 hours.  Apply a second glaze coat, if desired. ",
  "tyn_model":[
    "paint",
    "sponge",
    "color wash",
    "sponging",
    "roller",
    "paint brush",
    "water",
    "rag",
    "brush",
    "painter's tape",
    "wet rag",
    "soapy water",
    "spackling paste",
    "faux paint",
    "dry rag",
    "glaze"
  ],
  "tyn_section":[

  ]
}