{
  "title":"How to Tidy a Messy Bedroom",
  "url":"https://www.wikihow.com/Tidy-a-Messy-Bedroom",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "parts":[
    {
      "name":"Cleaning floor mess",
      "steps":[
        {
          "headline":"Don't panic.",
          "description":"Your bedroom can never be too messy to tidy!"
        },
        {
          "headline":"Start with the floor.",
          "description":"If there are any clothes on the floor, pick them up and sort them into dirty laundry and clean clothes. Put the dirty clothes into your wash basket and the clean clothes into your drawers and cupboards. It might be safe to assume that all clothes found on the floor need to go into the dirty pile."
        },
        {
          "headline":"Pick up all miscellaneous items from the floor.",
          "description":"Put them where they are meant to be. If these items don't yet have a home, you'll need to spend some time making one for them. This can include clearing away items you no longer want or use, to make room for the homeless new items."
        },
        {
          "headline":"Vacuum or sweep and mop the floor.",
          "description":"Ensure that it is nice and clean before moving on to the next sections."
        }
      ]
    },
    {
      "name":"Cleaning up cupboard and drawer mess",
      "steps":[
        {
          "headline":"Pull out everything from the cupboard and put it onto the now-clean floor.",
          "description":"Sort everything out into groups and make sure you have space for everything to go back into the cupboard. Put the heaviest clothing in the bottom of the wardrobe and work your way up to the lightest. This is a good chance to color coordinate your clothes. This can make it easier to see combinations. Use this chance to ensure that only the current season's clothes are on show. Put other seasonal clothing into under-the bed storage boxes or at the back of the cupboard. That way, these items won't in the way when you want to wear the current season's items."
        },
        {
          "headline":"Take all your clothes out of your drawers.",
          "description":"Place them either on the floor or on your bed and separate them into these groups: Underwear, tops, bottoms and pajamas. Then put your underwear into the top drawer, tops into the next, bottoms in the next and finally pajamas in the last. If you have more drawers than this, you could make them into messy drawers for bits and pieces you do not have anywhere to put or you could simply put belts, dungarees or anything item of clothing that does not have a grouping yet."
        }
      ]
    },
    {
      "name":"Clearing up papers and books",
      "steps":[
        {
          "headline":"Sort any papers on your desk into two piles like you did with the laundry.",
          "description":"Make a pile of used paper with drawings or writing on and another pile of blank paper that can be re-used. Then put the used paper in the bin and the blank paper somewhere out of the way but so you can get to it easily. Put your pens and pencils away into small boxes and other places that are in arms reach. If your desk and papers aren't kept in your bedroom, skip this step."
        },
        {
          "headline":"Take out all your books from your bookshelf, or just rearranging the books that are out of place.",
          "description":"If you have taken all the books out, start off by sorting them into series, say if you had the full Harry Potter series you would make sure they stayed together; You could even put them in order. Remember you should always put the heaviest books at the bottom and work your way up to the lightest which would be at the top. If you don't keep books in your bedroom, skip this step."
        }
      ]
    }
  ],
  "text":" Cleaning floor mess Don't panic. Your bedroom can never be too messy to tidy! Start with the floor. If there are any clothes on the floor, pick them up and sort them into dirty laundry and clean clothes. Put the dirty clothes into your wash basket and the clean clothes into your drawers and cupboards. It might be safe to assume that all clothes found on the floor need to go into the dirty pile. Pick up all miscellaneous items from the floor. Put them where they are meant to be. If these items don't yet have a home, you'll need to spend some time making one for them. This can include clearing away items you no longer want or use, to make room for the homeless new items. Vacuum or sweep and mop the floor. Ensure that it is nice and clean before moving on to the next sections. Cleaning up cupboard and drawer mess Pull out everything from the cupboard and put it onto the now-clean floor. Sort everything out into groups and make sure you have space for everything to go back into the cupboard. Put the heaviest clothing in the bottom of the wardrobe and work your way up to the lightest. This is a good chance to color coordinate your clothes. This can make it easier to see combinations. Use this chance to ensure that only the current season's clothes are on show. Put other seasonal clothing into under-the bed storage boxes or at the back of the cupboard. That way, these items won't in the way when you want to wear the current season's items. Take all your clothes out of your drawers. Place them either on the floor or on your bed and separate them into these groups: Underwear, tops, bottoms and pajamas. Then put your underwear into the top drawer, tops into the next, bottoms in the next and finally pajamas in the last. If you have more drawers than this, you could make them into messy drawers for bits and pieces you do not have anywhere to put or you could simply put belts, dungarees or anything item of clothing that does not have a grouping yet. Clearing up papers and books Sort any papers on your desk into two piles like you did with the laundry. Make a pile of used paper with drawings or writing on and another pile of blank paper that can be re-used. Then put the used paper in the bin and the blank paper somewhere out of the way but so you can get to it easily. Put your pens and pencils away into small boxes and other places that are in arms reach. If your desk and papers aren't kept in your bedroom, skip this step. Take out all your books from your bookshelf, or just rearranging the books that are out of place. If you have taken all the books out, start off by sorting them into series, say if you had the full Harry Potter series you would make sure they stayed together; You could even put them in order. Remember you should always put the heaviest books at the bottom and work your way up to the lightest which would be at the top. If you don't keep books in your bedroom, skip this step.",
  "tyn_model":[
    "books",
    "wardrobe",
    "underwear",
    "pajamas",
    "laundry",
    "pens"
  ],
  "tyn_section":[

  ]
}