{
  "title":"How to Add Protein to a Salad",
  "url":"https://www.wikihow.com/Add-Protein-to-a-Salad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Salads"
  ],
  "methods":[
    {
      "name":"Adding Basic Animal Protein",
      "steps":[
        {
          "headline":"Add lean meats.",
          "description":"Animal proteins are the most common and well-known sources of protein. When choosing meats, opt for high-quality sources that are grass-fed and free of antibiotics and growth hormones. This information is typically displayed on the packaging. White-meat poultry (31 grams of protein in three ounces) is a lean protein, which is especially healthy without the skin (which is high in saturated fat). Pork Tenderloin (3 grams of protein in three ounces) is not as lean as chicken, but it is becoming leaner—now generally 31% leaner than it was 20 years ago. Lean beef (22 grams of protein in  three ounces) is a great source of nutrients like zinc, iron, and vitamin B12, and is also low in saturated fat, possessing only one more gram than skinless chicken."
        },
        {
          "headline":"Try some seafood.",
          "description":"Seafood is typically high in protein but low in fat. Most fish and shellfish are a great source of protein, as well as all of the essential amino acids our bodies require. Shrimp (20 grams of protein in three ounces) are low in calories and contain key nutrients like vitamin B12 and antioxidants. Scallops (17 grams of protein in three ounces) are low fat and a good source of important vitamins and minerals. Filets of fish vary in protein content, but typically contain about one-third of the recommended daily amount in three ounces. Salmon, mahi-mahi, and especially tuna are popular choices as salad toppings, but any fish you like will do."
        },
        {
          "headline":"Top your salad with an egg.",
          "description":"Eggs carry most of their protein in the egg white. The whites of an egg contain approximately 4 grams of protein while the yolks contain around 2.7 grams. Most commonly, an egg is hardboiled and then diced or cut into wedges when adding it to a salad. If you feel like mixing it up, try topping your salad with a poached egg, a method used to make Salad Lyonnaise. The poached egg acts as a dressing-like sauce."
        }
      ]
    },
    {
      "name":"Adding Vegetarian and Vegan Protein",
      "steps":[
        {
          "headline":"Add a meat substitute.",
          "description":"There are a number of options for vegetarians and vegans when it comes to protein sources as well. Choose from some of the following options:\nTofu (8 grams of protein in three ounces) is probably one of the most well-known meat substitutes. Tofu is made of condensed soy milk and is an excellent source of nutrients, including all the essential amino acids our bodies need to function. Tempeh (16 grams of protein in three ounces) is a cake of partially cooked soybeans. It is a nutty, mushroom  plant protein that is still fairly unknown to most people. Seitan (36 grams of protein per half cup) is made from vital wheat gluten. It is often referred to as “the vegetarian wheat meat” because of its “meaty” texture."
        },
        {
          "headline":"Top with toasted chickpeas.",
          "description":"Chickpeas are low in calories, high in fiber, and a great source of protein, containing about 7.3 grams per half cup. They provide a nice crunch to your salad. (Try using them instead of croutons!)"
        },
        {
          "headline":"Sprinkle with nuts or seeds.",
          "description":"Adding nuts and seeds gives your salad a nice texture and some extra crunch. You have quite a variety to choose from as well:\nAlmonds (approximately 5 to 6 grams of protein per ounce)\nChia seeds (4.7 grams of protein per ounce)\nSunflower seeds (7.3 grams of protein per quarter cup)\nSesame and poppy seeds (5.4 grams of protein per quarter cup)"
        },
        {
          "headline":"Add beans.",
          "description":"Beans are an often over-looked option for salads. However, adding beans can give your salad a heartier and more filling texture in addition to adding protein. Don’t be afraid to experiment with this flavorful option! Black beans are somewhat sweet and go well with smoky flavors, like chipotle and bacon. Pair them with brightly-colored vegetables for a great salad. Kidney bean are best known for their use in chili, but they can also make a great addition to a spinach salad. White beans also work for salads. Try adding them to a Caprese salad for a unique dish."
        }
      ]
    },
    {
      "name":"Choosing a High-Quality Leafy Green",
      "steps":[
        {
          "headline":"Try kale.",
          "description":"A great source of vitamins A, C, and K, kale is recognized as one of the healthiest vegetables. It is also has more protein than most greens with 4 grams of protein in just one cup. While it’s a bit unconventional, kale can be a great base for your salad."
        },
        {
          "headline":"Use cabbage.",
          "description":"An excellent source of vitamin C, cabbage also has more protein than some other leafy greens. Cabbage (particularly savoy cabbage) also makes a nice salad. One cup of cabbage contains 1 gram of protein."
        },
        {
          "headline":"Make a spinach salad.",
          "description":"This popular green will also add a little more protein than iceberg lettuce. It contains 0.86 grams of protein in one cup. In addition, it is flavorful and a good source of vitamins A and C."
        },
        {
          "headline":"Use red and green leaf and romaine lettuce.",
          "description":"One of the most common types of greens used in salads, this type of lettuce provides a nice crunch as well as nutrients. One cup of this green is high in vitamin A and folate and contains 0.37 grams of protein."
        }
      ]
    }
  ],
  "text":" Adding Basic Animal Protein Add lean meats. Animal proteins are the most common and well-known sources of protein. When choosing meats, opt for high-quality sources that are grass-fed and free of antibiotics and growth hormones. This information is typically displayed on the packaging. White-meat poultry (31 grams of protein in three ounces) is a lean protein, which is especially healthy without the skin (which is high in saturated fat). Pork Tenderloin (3 grams of protein in three ounces) is not as lean as chicken, but it is becoming leaner—now generally 31% leaner than it was 20 years ago. Lean beef (22 grams of protein in  three ounces) is a great source of nutrients like zinc, iron, and vitamin B12, and is also low in saturated fat, possessing only one more gram than skinless chicken. Try some seafood. Seafood is typically high in protein but low in fat. Most fish and shellfish are a great source of protein, as well as all of the essential amino acids our bodies require. Shrimp (20 grams of protein in three ounces) are low in calories and contain key nutrients like vitamin B12 and antioxidants. Scallops (17 grams of protein in three ounces) are low fat and a good source of important vitamins and minerals. Filets of fish vary in protein content, but typically contain about one-third of the recommended daily amount in three ounces. Salmon, mahi-mahi, and especially tuna are popular choices as salad toppings, but any fish you like will do. Top your salad with an egg. Eggs carry most of their protein in the egg white. The whites of an egg contain approximately 4 grams of protein while the yolks contain around 2.7 grams. Most commonly, an egg is hardboiled and then diced or cut into wedges when adding it to a salad. If you feel like mixing it up, try topping your salad with a poached egg, a method used to make Salad Lyonnaise. The poached egg acts as a dressing-like sauce. Adding Vegetarian and Vegan Protein Add a meat substitute. There are a number of options for vegetarians and vegans when it comes to protein sources as well. Choose from some of the following options:\nTofu (8 grams of protein in three ounces) is probably one of the most well-known meat substitutes. Tofu is made of condensed soy milk and is an excellent source of nutrients, including all the essential amino acids our bodies need to function. Tempeh (16 grams of protein in three ounces) is a cake of partially cooked soybeans. It is a nutty, mushroom  plant protein that is still fairly unknown to most people. Seitan (36 grams of protein per half cup) is made from vital wheat gluten. It is often referred to as “the vegetarian wheat meat” because of its “meaty” texture. Top with toasted chickpeas. Chickpeas are low in calories, high in fiber, and a great source of protein, containing about 7.3 grams per half cup. They provide a nice crunch to your salad. (Try using them instead of croutons!) Sprinkle with nuts or seeds. Adding nuts and seeds gives your salad a nice texture and some extra crunch. You have quite a variety to choose from as well:\nAlmonds (approximately 5 to 6 grams of protein per ounce)\nChia seeds (4.7 grams of protein per ounce)\nSunflower seeds (7.3 grams of protein per quarter cup)\nSesame and poppy seeds (5.4 grams of protein per quarter cup) Add beans. Beans are an often over-looked option for salads. However, adding beans can give your salad a heartier and more filling texture in addition to adding protein. Don’t be afraid to experiment with this flavorful option! Black beans are somewhat sweet and go well with smoky flavors, like chipotle and bacon. Pair them with brightly-colored vegetables for a great salad. Kidney bean are best known for their use in chili, but they can also make a great addition to a spinach salad. White beans also work for salads. Try adding them to a Caprese salad for a unique dish. Choosing a High-Quality Leafy Green Try kale. A great source of vitamins A, C, and K, kale is recognized as one of the healthiest vegetables. It is also has more protein than most greens with 4 grams of protein in just one cup. While it’s a bit unconventional, kale can be a great base for your salad. Use cabbage. An excellent source of vitamin C, cabbage also has more protein than some other leafy greens. Cabbage (particularly savoy cabbage) also makes a nice salad. One cup of cabbage contains 1 gram of protein. Make a spinach salad. This popular green will also add a little more protein than iceberg lettuce. It contains 0.86 grams of protein in one cup. In addition, it is flavorful and a good source of vitamins A and C. Use red and green leaf and romaine lettuce. One of the most common types of greens used in salads, this type of lettuce provides a nice crunch as well as nutrients. One cup of this green is high in vitamin A and folate and contains 0.37 grams of protein.",
  "tyn_model":[
    "beans",
    "cabbage",
    "kale",
    "meats",
    "seafood",
    "fish",
    "egg",
    "tofu",
    "chickpeas",
    "nuts",
    "vegetables",
    "lettuce",
    "proteins",
    "poultry",
    "pork",
    "chicken",
    "—now",
    "beef",
    "vitamin b12,",
    "saturated fat",
    "shellfish",
    "shrimp",
    "scallops",
    "salmon",
    "tuna",
    "eggs",
    "poached egg",
    "lyonnaise",
    "tempeh",
    "seitan",
    "wheat gluten",
    "“the",
    "” because",
    "“meaty",
    "” texture",
    "croutons",
    "almonds",
    "chia seeds",
    "sunflower",
    "sesame",
    "poppy seeds",
    "bacon",
    "chili",
    "greens",
    "spinach",
    "romaine lettuce"
  ],
  "tyn_section":[

  ]
}