{
  "title":"How to Make Vegan Pesto",
  "url":"https://www.wikihow.com/Make-Vegan-Pesto",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan"
  ],
  "methods":[
    {
      "name":"Green Pesto with Toasted Pine Nuts",
      "steps":[
        {
          "headline":"Put the toasted nuts and all other ingredients into a food processor.",
          "description":""
        },
        {
          "headline":"Process them together until the mixture is smooth and consistent.",
          "description":""
        },
        {
          "headline":"Garnish with black pepper.",
          "description":"Then serve on pasta or as a dipping sauce."
        }
      ]
    },
    {
      "name":"Green Pesto",
      "steps":[
        {
          "headline":"Place the basil leaves, pine nuts, and crushed garlic into the food processor or blender.",
          "description":"Process or blend until the mixture turns into a smooth consistency."
        },
        {
          "headline":"Drizzle the olive oil and, if using, the vegan Parmesan cheese.",
          "description":"Keep the processor or blender working as this is done. Combine completely."
        },
        {
          "headline":"Remove from the appliance.",
          "description":"Add salt and pepper to taste. The pesto is now ready for adding to pasta or for use in any recipe."
        }
      ]
    },
    {
      "name":"Red Pesto",
      "steps":[
        {
          "headline":"Add the red bell peppers/capsicums, basil leaves, pine nuts and crushed garlic to the food processor or food blender.",
          "description":"Process or blend until smooth."
        },
        {
          "headline":"Drizzle the olive oil and, if using, the vegan Parmesan cheese.",
          "description":"Keep the processor or blender working as this is done. Combine completely."
        },
        {
          "headline":"Remove from the appliance.",
          "description":"Add salt and pepper to taste. The pesto is now ready for adding to pasta or for use in any recipe."
        }
      ]
    }
  ],
  "text":" Green Pesto with Toasted Pine Nuts Put the toasted nuts and all other ingredients into a food processor.  Process them together until the mixture is smooth and consistent.  Garnish with black pepper. Then serve on pasta or as a dipping sauce. Green Pesto Place the basil leaves, pine nuts, and crushed garlic into the food processor or blender. Process or blend until the mixture turns into a smooth consistency. Drizzle the olive oil and, if using, the vegan Parmesan cheese. Keep the processor or blender working as this is done. Combine completely. Remove from the appliance. Add salt and pepper to taste. The pesto is now ready for adding to pasta or for use in any recipe. Red Pesto Add the red bell peppers/capsicums, basil leaves, pine nuts and crushed garlic to the food processor or food blender. Process or blend until smooth. Drizzle the olive oil and, if using, the vegan Parmesan cheese. Keep the processor or blender working as this is done. Combine completely. Remove from the appliance. Add salt and pepper to taste. The pesto is now ready for adding to pasta or for use in any recipe.",
  "tyn_model":[
    "food processor",
    "blender",
    "basil",
    "pine nuts",
    "olive oil",
    "parmesan cheese",
    "processor",
    "black pepper",
    "green pesto",
    "garlic",
    "salt and pepper",
    "red bell peppers",
    "capsicums",
    "crushed garlic",
    "food blender",
    "salt"
  ],
  "tyn_section":[

  ]
}