{
  "title":"How to Make Vegan Buche De Noel",
  "url":"https://www.wikihow.com/Make-Vegan-Buche-De-Noel",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan",
    "Vegan Baking"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 180ºC or 350ºF.",
      "description":""
    },
    {
      "headline":"Mix the dark chocolate spread carefully with the ground almonds and flour in a mixing bowl.",
      "description":""
    },
    {
      "headline":"Add a little coffee and mix in.",
      "description":"Then add the yoghurt, sugar and baking soda. Combine until the mixture is smooth and shiny. If the mixture appears too dry, add a little more coffee to moisten."
    },
    {
      "headline":"Pour the mixture into a loaf pan or mould.",
      "description":"Either use a lined or greased pan to ensure that the mixture doesn't stick during cooking. If using a silicone mould, there is no need to grease or line it."
    },
    {
      "headline":"Put the log mixture into the oven.",
      "description":"Bake for 40 minutes or until a skewer stuck into it comes out clean."
    },
    {
      "headline":"Remove the log from the oven.",
      "description":"Place it on a wire cooling rack to cool completely."
    },
    {
      "headline":"Make the topping.",
      "description":"Whisk the butter with the sugar. Add the ground hazelnuts and mix through."
    },
    {
      "headline":"Spread the topping over the log cake right across the top and down each of the sides.",
      "description":""
    },
    {
      "headline":"Finish up by sticking sheets of chocolate along each side of the edges of the cake.",
      "description":""
    },
    {
      "headline":"Place in the refrigerator to chill for several hours.",
      "description":""
    },
    {
      "headline":"Garnish as wished.",
      "description":"You might like to add some plastic holly or a holiday scene; just follow your imagination."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 180ºC or 350ºF.  Mix the dark chocolate spread carefully with the ground almonds and flour in a mixing bowl.  Add a little coffee and mix in. Then add the yoghurt, sugar and baking soda. Combine until the mixture is smooth and shiny. If the mixture appears too dry, add a little more coffee to moisten. Pour the mixture into a loaf pan or mould. Either use a lined or greased pan to ensure that the mixture doesn't stick during cooking. If using a silicone mould, there is no need to grease or line it. Put the log mixture into the oven. Bake for 40 minutes or until a skewer stuck into it comes out clean. Remove the log from the oven. Place it on a wire cooling rack to cool completely. Make the topping. Whisk the butter with the sugar. Add the ground hazelnuts and mix through. Spread the topping over the log cake right across the top and down each of the sides.  Finish up by sticking sheets of chocolate along each side of the edges of the cake.  Place in the refrigerator to chill for several hours.  Garnish as wished. You might like to add some plastic holly or a holiday scene; just follow your imagination. Finished. ",
  "tyn_model":[
    "oven",
    "coffee",
    "sugar",
    "dark chocolate",
    "ground almonds",
    "flour",
    "mixing bowl",
    "yoghurt",
    "baking soda",
    "loaf pan",
    "butter",
    "hazelnuts",
    "log cake",
    "chocolate",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}