{
  "title":"How to Make a Wilderness Survival Kit",
  "url":"https://www.wikihow.com/Make-a-Wilderness-Survival-Kit",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness",
    "Hazard Survival Equipment"
  ],
  "methods":[
    {
      "name":"Preparing the Essentials",
      "steps":[
        {
          "headline":"Select a container for your kit.",
          "description":"The size and type of container will vary, depending on where you intend to store it, and how portable you'll need it to be. A sturdy backpack is a popular choice for smaller, highly portable kits. Military surplus packs are popular, since they are designed for rugged use and are often available for less money than purpose-made survival packs. A cooler or other lidded plastic container could also be used. Although they are less portable than a pack or bag, they have the advantage of being waterproof. If you choose compact enough items, most of the essentials for short-term wilderness survival can fit in a small, waterproof container like an empty coffee can. If you choose a pack or other non-waterproof container, make sure that any moisture-sensitive items in your kit (matches, electronics, etc.) are stored in their own waterproof containers, such as a zip-lock bag."
        },
        {
          "headline":"Be prepared to purify water.",
          "description":"Clean water for drinking and cooking is perhaps the most important resource to consider in any wilderness survival scenario. Water purification tablets are an effective, and widely available, option. There are different kinds of tablets available, but all work by chemically destroying the microorganisms present in natural water sources, some of which can cause sickness when consumed. Make sure to familiarize yourself with the tablets' instructions beforehand, so you'll know how to use them should you need to. Regardless of the purification method you choose, you will need access to a container to gather and purify water. A simple steel cup, or a lightweight cooking pot will suffice. Portable water filters are also available. While requiring more work, and taking up more space, than tablets, filters do not add any unpleasant chemical taste to water. If you are preparing for a wilderness location where water is not easy to find (such as a desert), you should be sure to pack some purified water. Water is heavy, and will make your kit less portable, but it is an essential resource. One gallon of water per person, per day is ideal."
        },
        {
          "headline":"Select cordage to include in your kit.",
          "description":"Few pieces of equipment are more versatile and useful than a simple length of sturdy cord. Most backpackers and survival experts prefer parachute cord, which is relatively lightweight and extremely durable. There are a huge variety of survival applications for cord or rope. Here are just a few:\nBundling firewood for easier carrying. Hanging a blanket or tarp for use as shelter. Suspending your pack from a tree, out of the reach of bears or other animals."
        },
        {
          "headline":"Carry a flashlight.",
          "description":"A good flashlight is essential for finding your way around at night, and can even be used as a signal in an emergency. It is worth investing in a good-quality model. Cheap, plastic flashlights may break very easily when used in rugged conditions. LED lights are usually preferred. They tend to be more expensive than traditional lights, but they provide a superior level of brightness, durability, and battery life. Be sure to include extra batteries for your flashlight. Hand-crank models which do not require batteries are available. Some find them to be a hassle to use, since they must be repeatedly re-cranked during extended use."
        },
        {
          "headline":"Bring a knife or multi-tool.",
          "description":"Few things are more useful in a survival scenario than a knife. Knives can be used to shave wood to make tinder, cut chord or rope, prepare fish or game, and even open cans in a pinch. Multi-tools are folding, pocket sized devices which contain a knife, as well as pliers, screwdrivers, and other tools, depending on the model. These are a popular choice, since they provide the benefit of many tools in a small package. Some survival experts prefer a simple fixed-blade (non-folding) knife with a blade around 3\" to a multi-tool, or other folding knife. Fixed-blade knives are more durable than folding tools, but are perhaps less versatile than a folding multi-tool."
        },
        {
          "headline":"Prepare a first-aid kit.",
          "description":"Many fully assembled kits are available for purchase, although it is often more economical to create your own. A basic first aid kit suitable for wilderness survival scenarios should include:\nAdhesive bandages for superficial cuts. Antibacterial ointment for treating superficial wounds. Roller gauze, for dressing deeper cuts and other wounds. Medical tape for securing the gauze. A small pair of scissors for cutting gauze and medical tape. Tweezers for removing splinters or debris from wounds. A wound disinfectant, such as medical iodine solution, for cleaning wounds. Sterile cotton applicators or swabs for applying ointment or disinfectant to wounds. Painkiller tablets, such as acetaminophen. Allergy medication, and emergency supplies of any prescription medications you may need."
        },
        {
          "headline":"Incorporate a lighter or other fire source.",
          "description":"Even if you know how to light a fire without one, having a lighter makes lighting a fire in an emergency much easier. Make sure to get some practice starting a fire before you venture out into the wilderness. Various kinds of fire strikers are available, which you can use to create sparks to help you start a fire. Be warned, however, that using a fire striker to start a fire can be challenging. If you plan to bring one, make sure you get some practice\nYou should also consider packing a container of tinder, or fire starting material. Drier lint is a popular choice, since it burns very readily. Old newspaper is another good choice. While not as convenient as a lighter, wood or cardboard matches require no fuel to light. Look for waterproof camping matches, or store your matches in a waterproof container."
        }
      ]
    },
    {
      "name":"Customizing Your Kit",
      "steps":[
        {
          "headline":"Prepare for inclement weather.",
          "description":"What gear you select will depend primarily on the wilderness climate you're concerned about. For instance, if rain is a concern, consider packing a poncho, and ensure that your moisture-sensitive gear is stored in a waterproof container. If heat and sunburn are concerns, pack sunscreen, a pair of sunglasses, and as much extra drinking water as you can manage. If you are worried about colder temperatures, packing a spare hat, scarf, and gloves or mittens would be a good idea. In any survival scenario, packing a change of clothes can be valuable, especially if you become wet. A small bag of spare clothes can also serve as a pillow, should you need one."
        },
        {
          "headline":"Include a small tent or other portable shelter.",
          "description":"While not a necessity if you do not anticipate needing a kit for longer than a day or two, bringing a shelter of some kind can be a great comfort in the wilderness (especially if it rains). While camping tents offer excellent shelter, they can be quite bulky to pack. Look for compact models designed for backpackers. With a little know how, you can use a tarp, cord or rope, and some structural material such as sticks to make a tent. Since a folded up tarp often takes up far less room than a disassembled tent, this option can save you a lot of space in your kit. Get plenty of practice using the technique beforehand, though."
        },
        {
          "headline":"Pack a wool blanket.",
          "description":"Wool blankets are warm, durable, and highly water resistant. While not a necessity in all survival scenarios, having access to a wool blanket can be a great comfort, especially if you find that you must sleep in the wilderness for one or multiple nights. While many survival experts prefer wool, other options are available. So-called \"space blankets\" are another popular choice. These metallic foil blankets are excellent insulators, and will do a great job keeping you warm. A compact sleeping bag is another useful addition to a survival kit, although they typically require more room to store than a simple blanket."
        },
        {
          "headline":"Store non-perishable food in your kit.",
          "description":"While not as necessary as water for your survival in the short term, having a small supply of non-perishable food can provide you with the energy you may need should you need to spend more than a day or two in the wilderness. Canned food is a popular choice, but dried foods may be a better option, since they are typically much lighter weight. Here are some good options:\nMeat jerky, or meatless jerky substitute for vegetarians. Dried fruit. Nuts or trail mix. Protein bars. Pre-prepared, \"just add water\", dried meals are also available."
        },
        {
          "headline":"Add a pot or other cooking container to your kit.",
          "description":"While not strictly-speaking necessary, a container in which to boil water or cook food may be useful to you. Boiling water is a good method for disinfecting water, and having access to hot water can make bathing and dealing with cold temperatures easier. If you decide to pack a cooking pot, make sure you will have a way of safely handling it when hot. Metal handles will become very hot over an open fire, and you should be careful not to burn yourself."
        },
        {
          "headline":"Take a compass and maps.",
          "description":"If you know how to read a map and use a compass to navigate, these tools can be invaluable, allowing you to make your way towards safety. Be sure to get plenty of practice with these skills before you enter a wilderness survival situation. Even without a map, a compass can help you travel in a consistent direction, instead of walking around in circles."
        },
        {
          "headline":"Incorporate additional tools.",
          "description":"If you are preparing a large survival kit, such as one intended for storing in a vehicle rather than carried on your person, you might consider packing a couple larger tools, such as a hatchet. Your choice of tools should be informed by what conditions you expect to encounter. If you expect to need to gather and use firewood, a hatchet or axe might be useful. Making tent poles from small trees or branches is greatly assisted by having access to a folding saw. A shovel can assist you in digging fire pits, or preparing flat ground to sleep on."
        }
      ]
    }
  ],
  "text":" Preparing the Essentials Select a container for your kit. The size and type of container will vary, depending on where you intend to store it, and how portable you'll need it to be. A sturdy backpack is a popular choice for smaller, highly portable kits. Military surplus packs are popular, since they are designed for rugged use and are often available for less money than purpose-made survival packs. A cooler or other lidded plastic container could also be used. Although they are less portable than a pack or bag, they have the advantage of being waterproof. If you choose compact enough items, most of the essentials for short-term wilderness survival can fit in a small, waterproof container like an empty coffee can. If you choose a pack or other non-waterproof container, make sure that any moisture-sensitive items in your kit (matches, electronics, etc.) are stored in their own waterproof containers, such as a zip-lock bag. Be prepared to purify water. Clean water for drinking and cooking is perhaps the most important resource to consider in any wilderness survival scenario. Water purification tablets are an effective, and widely available, option. There are different kinds of tablets available, but all work by chemically destroying the microorganisms present in natural water sources, some of which can cause sickness when consumed. Make sure to familiarize yourself with the tablets' instructions beforehand, so you'll know how to use them should you need to. Regardless of the purification method you choose, you will need access to a container to gather and purify water. A simple steel cup, or a lightweight cooking pot will suffice. Portable water filters are also available. While requiring more work, and taking up more space, than tablets, filters do not add any unpleasant chemical taste to water. If you are preparing for a wilderness location where water is not easy to find (such as a desert), you should be sure to pack some purified water. Water is heavy, and will make your kit less portable, but it is an essential resource. One gallon of water per person, per day is ideal. Select cordage to include in your kit. Few pieces of equipment are more versatile and useful than a simple length of sturdy cord. Most backpackers and survival experts prefer parachute cord, which is relatively lightweight and extremely durable. There are a huge variety of survival applications for cord or rope. Here are just a few:\nBundling firewood for easier carrying. Hanging a blanket or tarp for use as shelter. Suspending your pack from a tree, out of the reach of bears or other animals. Carry a flashlight. A good flashlight is essential for finding your way around at night, and can even be used as a signal in an emergency. It is worth investing in a good-quality model. Cheap, plastic flashlights may break very easily when used in rugged conditions. LED lights are usually preferred. They tend to be more expensive than traditional lights, but they provide a superior level of brightness, durability, and battery life. Be sure to include extra batteries for your flashlight. Hand-crank models which do not require batteries are available. Some find them to be a hassle to use, since they must be repeatedly re-cranked during extended use. Bring a knife or multi-tool. Few things are more useful in a survival scenario than a knife. Knives can be used to shave wood to make tinder, cut chord or rope, prepare fish or game, and even open cans in a pinch. Multi-tools are folding, pocket sized devices which contain a knife, as well as pliers, screwdrivers, and other tools, depending on the model. These are a popular choice, since they provide the benefit of many tools in a small package. Some survival experts prefer a simple fixed-blade (non-folding) knife with a blade around 3\" to a multi-tool, or other folding knife. Fixed-blade knives are more durable than folding tools, but are perhaps less versatile than a folding multi-tool. Prepare a first-aid kit. Many fully assembled kits are available for purchase, although it is often more economical to create your own. A basic first aid kit suitable for wilderness survival scenarios should include:\nAdhesive bandages for superficial cuts. Antibacterial ointment for treating superficial wounds. Roller gauze, for dressing deeper cuts and other wounds. Medical tape for securing the gauze. A small pair of scissors for cutting gauze and medical tape. Tweezers for removing splinters or debris from wounds. A wound disinfectant, such as medical iodine solution, for cleaning wounds. Sterile cotton applicators or swabs for applying ointment or disinfectant to wounds. Painkiller tablets, such as acetaminophen. Allergy medication, and emergency supplies of any prescription medications you may need. Incorporate a lighter or other fire source. Even if you know how to light a fire without one, having a lighter makes lighting a fire in an emergency much easier. Make sure to get some practice starting a fire before you venture out into the wilderness. Various kinds of fire strikers are available, which you can use to create sparks to help you start a fire. Be warned, however, that using a fire striker to start a fire can be challenging. If you plan to bring one, make sure you get some practice\nYou should also consider packing a container of tinder, or fire starting material. Drier lint is a popular choice, since it burns very readily. Old newspaper is another good choice. While not as convenient as a lighter, wood or cardboard matches require no fuel to light. Look for waterproof camping matches, or store your matches in a waterproof container. Customizing Your Kit Prepare for inclement weather. What gear you select will depend primarily on the wilderness climate you're concerned about. For instance, if rain is a concern, consider packing a poncho, and ensure that your moisture-sensitive gear is stored in a waterproof container. If heat and sunburn are concerns, pack sunscreen, a pair of sunglasses, and as much extra drinking water as you can manage. If you are worried about colder temperatures, packing a spare hat, scarf, and gloves or mittens would be a good idea. In any survival scenario, packing a change of clothes can be valuable, especially if you become wet. A small bag of spare clothes can also serve as a pillow, should you need one. Include a small tent or other portable shelter. While not a necessity if you do not anticipate needing a kit for longer than a day or two, bringing a shelter of some kind can be a great comfort in the wilderness (especially if it rains). While camping tents offer excellent shelter, they can be quite bulky to pack. Look for compact models designed for backpackers. With a little know how, you can use a tarp, cord or rope, and some structural material such as sticks to make a tent. Since a folded up tarp often takes up far less room than a disassembled tent, this option can save you a lot of space in your kit. Get plenty of practice using the technique beforehand, though. Pack a wool blanket. Wool blankets are warm, durable, and highly water resistant. While not a necessity in all survival scenarios, having access to a wool blanket can be a great comfort, especially if you find that you must sleep in the wilderness for one or multiple nights. While many survival experts prefer wool, other options are available. So-called \"space blankets\" are another popular choice. These metallic foil blankets are excellent insulators, and will do a great job keeping you warm. A compact sleeping bag is another useful addition to a survival kit, although they typically require more room to store than a simple blanket. Store non-perishable food in your kit. While not as necessary as water for your survival in the short term, having a small supply of non-perishable food can provide you with the energy you may need should you need to spend more than a day or two in the wilderness. Canned food is a popular choice, but dried foods may be a better option, since they are typically much lighter weight. Here are some good options:\nMeat jerky, or meatless jerky substitute for vegetarians. Dried fruit. Nuts or trail mix. Protein bars. Pre-prepared, \"just add water\", dried meals are also available. Add a pot or other cooking container to your kit. While not strictly-speaking necessary, a container in which to boil water or cook food may be useful to you. Boiling water is a good method for disinfecting water, and having access to hot water can make bathing and dealing with cold temperatures easier. If you decide to pack a cooking pot, make sure you will have a way of safely handling it when hot. Metal handles will become very hot over an open fire, and you should be careful not to burn yourself. Take a compass and maps. If you know how to read a map and use a compass to navigate, these tools can be invaluable, allowing you to make your way towards safety. Be sure to get plenty of practice with these skills before you enter a wilderness survival situation. Even without a map, a compass can help you travel in a consistent direction, instead of walking around in circles. Incorporate additional tools. If you are preparing a large survival kit, such as one intended for storing in a vehicle rather than carried on your person, you might consider packing a couple larger tools, such as a hatchet. Your choice of tools should be informed by what conditions you expect to encounter. If you expect to need to gather and use firewood, a hatchet or axe might be useful. Making tent poles from small trees or branches is greatly assisted by having access to a folding saw. A shovel can assist you in digging fire pits, or preparing flat ground to sleep on.",
  "tyn_model":[
    "water",
    "knife",
    "container",
    "blanket",
    "flashlight",
    "tent",
    "compass",
    "rope",
    "knives",
    "tools",
    "medical tape",
    "lighter",
    "tarp",
    "hatchet",
    "backpack",
    "survival packs",
    "cooler",
    "pack",
    "zip-lock bag",
    "water purification tablets",
    "filters",
    "parachute cord",
    "firewood",
    "flashlights",
    "tool",
    "pliers",
    "screwdrivers",
    "multi-tool",
    "first-aid kit",
    "first aid kit",
    "antibacterial ointment",
    "roller gauze",
    "scissors",
    "tweezers",
    "medical iodine solution",
    "sterile cotton applicators",
    "fire strikers",
    "fire striker",
    "tinder",
    "fire starting material",
    "drier lint is",
    "newspaper",
    "matches",
    "poncho",
    "waterproof container",
    "sunscreen",
    "sunglasses",
    "hat",
    "scarf",
    "gloves",
    "camping tents",
    "wool blanket",
    "wool blankets",
    "space blankets",
    "sleeping bag",
    "survival kit",
    "food",
    "meat jerky",
    "meatless jerky",
    "fruit",
    "protein bars",
    "pot",
    "cooking pot",
    "maps",
    "map",
    "axe",
    "tent poles",
    "shovel"
  ],
  "tyn_section":[

  ]
}