{
  "title":"How to Stamp Concrete with Elite Crete System's Concrete Solutions",
  "url":"https://www.wikihow.com/Stamp-Concrete-with-Elite-Crete-System%27s-Concrete-Solutions",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Concrete",
    "Decorating Concrete"
  ],
  "steps":[
    {
      "headline":"Pressure wash the surface with a 3200 PSI pressure washer.",
      "description":"The goal here is to remove any foreign particles in the pores of the substrate and also to remove any loose concrete."
    },
    {
      "headline":"Mix 1 part muriatic acid with 8 parts of clean water and put this in a watering jug or pump up sprayer.",
      "description":"It is important to use a plastic sprayer as the muriatic acid will corrode metal sprayers."
    },
    {
      "headline":"Spray the acid and water mixture on the surface.",
      "description":"You should hear a light fizzle after you have applied it."
    },
    {
      "headline":"Use the same plastic sprayer and mix 1 part ammonia with 8 parts of clean water.",
      "description":"The acid then ammonia wash will neutralize the ph of the concrete and also open the capillaries of the surface."
    },
    {
      "headline":"Give the surface a good rinse with water.",
      "description":""
    },
    {
      "headline":"Mask and tape off any area or surface you do not wish to get your stamped concrete coatings on.",
      "description":""
    },
    {
      "headline":"Mix Elite Crete System's Thin-Finish in a 20 liter (5.3 US gal) bucket.",
      "description":""
    },
    {
      "headline":"Wet the concrete again and apply initial base coat of Thin-Finish.",
      "description":"Be sure to remove any puddles before apply base coat. All tool joints and expansion joints must be honer. Failing to do so may result in cracks showing on the surface some time in the future. It is important that the first base coat is entirely dry before proceeding to this step. Once the base coat is dry you will wet the surface and apply the bond coat in the same manner as you applied the base coat."
    },
    {
      "headline":"Mix 4 bags of Elite Crete System's Texture-Pave with water in 4 20 liter (5.3 US gal) buckets.",
      "description":""
    },
    {
      "headline":"Wet the surface of the bond coat and remove any standing puddles.",
      "description":""
    },
    {
      "headline":"Pour the 4 mixed bags of Texture-Pave on the wet bond coat with a gauge rake that is set to1/4\".",
      "description":"This should spread to approximately 9 to 10 m2. Use a trowel to fix the edges and a magic trowel or squeegee on a pole to fix the gauge rake application lines. The Texture-Pave now needs to begin to cure. The amount of time this takes depends on the environmental conditions on the day, this can be anywhere from 15 minutes to 45 minutes. You can test the hardness by very lightly placing your thumb into the Texture pave no more than a few millimetres. If you can leave a mark and barley any sand sticks to your thumb you can proceed to the next step."
    },
    {
      "headline":"Using a pump up sprayer, apply Elite Crete System's Clean-Print liquid release agent to the Texture-Pave and also to your textured concrete stamp.",
      "description":""
    },
    {
      "headline":"Place your textured concrete stamps on the curing Texture-Pave, overlapping each stamp by at least 8 centimeter (3.1 in).",
      "description":"Step on the textured concrete stamps and be sure to place your feet over every cm but do not stand on the edges of the stamps. Once the surface has been stamped, slowly peel off the textures concrete stamps and move to the next unstamped area and repeat this step. A smaller touch-up skin can be used on the edges."
    },
    {
      "headline":"Use your steel trowel to clean up the excess on the edges of the concrete.",
      "description":""
    },
    {
      "headline":"Once you have completed stamping all of the Texture-Pave, you must allow it to dry and have all of the Clean-Print evaporated before proceeding.",
      "description":""
    },
    {
      "headline":"Use a grey pencil to mark out all of the ares you wish to cut.",
      "description":"Wearing eye protection, use a small hand grinder to score the surface with the desired lines or patterns. You do not need to go deep."
    },
    {
      "headline":"Blow the surface clean, removing all dust before proceeding to the next step.",
      "description":""
    },
    {
      "headline":"Add 60 ml of portion control colorant  with 3.8 liters (1.0 US gal) of Ultra-Stone antiquing stain then dilute this mixture with 11.5 liters (3.0 US gal) of clean water.",
      "description":""
    },
    {
      "headline":"Use a pump up sprayer to apply the coloured mixture.",
      "description":"1 liter (0.3 US gal) should cover approximately 3.8 m2 per litre."
    },
    {
      "headline":"Once the previous step has completely dried, apply a professional grade sealer, such as CSS Emulsion.",
      "description":"The sealer should have at least two coats with the second being thicker then the first."
    }
  ],
  "text":" Pressure wash the surface with a 3200 PSI pressure washer. The goal here is to remove any foreign particles in the pores of the substrate and also to remove any loose concrete. Mix 1 part muriatic acid with 8 parts of clean water and put this in a watering jug or pump up sprayer. It is important to use a plastic sprayer as the muriatic acid will corrode metal sprayers. Spray the acid and water mixture on the surface. You should hear a light fizzle after you have applied it. Use the same plastic sprayer and mix 1 part ammonia with 8 parts of clean water. The acid then ammonia wash will neutralize the ph of the concrete and also open the capillaries of the surface. Give the surface a good rinse with water.  Mask and tape off any area or surface you do not wish to get your stamped concrete coatings on.  Mix Elite Crete System's Thin-Finish in a 20 liter (5.3 US gal) bucket.  Wet the concrete again and apply initial base coat of Thin-Finish. Be sure to remove any puddles before apply base coat. All tool joints and expansion joints must be honer. Failing to do so may result in cracks showing on the surface some time in the future. It is important that the first base coat is entirely dry before proceeding to this step. Once the base coat is dry you will wet the surface and apply the bond coat in the same manner as you applied the base coat. Mix 4 bags of Elite Crete System's Texture-Pave with water in 4 20 liter (5.3 US gal) buckets.  Wet the surface of the bond coat and remove any standing puddles.  Pour the 4 mixed bags of Texture-Pave on the wet bond coat with a gauge rake that is set to1/4\". This should spread to approximately 9 to 10 m2. Use a trowel to fix the edges and a magic trowel or squeegee on a pole to fix the gauge rake application lines. The Texture-Pave now needs to begin to cure. The amount of time this takes depends on the environmental conditions on the day, this can be anywhere from 15 minutes to 45 minutes. You can test the hardness by very lightly placing your thumb into the Texture pave no more than a few millimetres. If you can leave a mark and barley any sand sticks to your thumb you can proceed to the next step. Using a pump up sprayer, apply Elite Crete System's Clean-Print liquid release agent to the Texture-Pave and also to your textured concrete stamp.  Place your textured concrete stamps on the curing Texture-Pave, overlapping each stamp by at least 8 centimeter (3.1 in). Step on the textured concrete stamps and be sure to place your feet over every cm but do not stand on the edges of the stamps. Once the surface has been stamped, slowly peel off the textures concrete stamps and move to the next unstamped area and repeat this step. A smaller touch-up skin can be used on the edges. Use your steel trowel to clean up the excess on the edges of the concrete.  Once you have completed stamping all of the Texture-Pave, you must allow it to dry and have all of the Clean-Print evaporated before proceeding.  Use a grey pencil to mark out all of the ares you wish to cut. Wearing eye protection, use a small hand grinder to score the surface with the desired lines or patterns. You do not need to go deep. Blow the surface clean, removing all dust before proceeding to the next step.  Add 60 ml of portion control colorant  with 3.8 liters (1.0 US gal) of Ultra-Stone antiquing stain then dilute this mixture with 11.5 liters (3.0 US gal) of clean water.  Use a pump up sprayer to apply the coloured mixture. 1 liter (0.3 US gal) should cover approximately 3.8 m2 per litre. Once the previous step has completely dried, apply a professional grade sealer, such as CSS Emulsion. The sealer should have at least two coats with the second being thicker then the first.",
  "tyn_model":[
    "water",
    "texture-pave",
    "pump up sprayer",
    "elite crete system",
    "muriatic acid",
    "plastic sprayer",
    "thin-finish",
    "concrete",
    "gauge rake",
    "pressure washer",
    "watering jug",
    "ammonia",
    "ammonia wash",
    "buckets",
    "trowel",
    "magic trowel",
    "texture-",
    "texture pave",
    "sand",
    "clean-print liquid release agent",
    "textures concrete",
    "steel trowel",
    "clean-print",
    "grey pencil",
    "small hand grinder",
    "portion control colorant",
    "ultra-stone antiquing stain"
  ],
  "tyn_section":[

  ]
}