{
  "title":"How to Make Gluten Free Almond and Chocolate Chip Cookies",
  "url":"https://www.wikihow.com/Make-Gluten-Free-Almond-and-Chocolate-Chip-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Specialty Diet Recipes",
    "Gluten Free Dishes"
  ],
  "methods":[
    {
      "name":"Prepare the Batter",
      "steps":[
        {
          "headline":"Cream the butter and sugar using an electric mixer in a medium bowl until they're light and fluffy.",
          "description":""
        },
        {
          "headline":"Add the egg and beat well until it's combined.",
          "description":""
        },
        {
          "headline":"Place a fine metal sieve over another medium bowl.",
          "description":""
        },
        {
          "headline":"Add the flour, potato starch and baking powder to the sieve and sift the contents gently into your bowl.",
          "description":""
        },
        {
          "headline":"Fold about 1/3 of the flour mixture into the egg mixture using a rubber spatula.",
          "description":"You'll want to fold rather than mix these dry ingredients into your wet ingredients to avoid beating the air out of your butter mixture."
        },
        {
          "headline":"Continue adding more of the flour mixture to the wet ingredients until it's all incorporated.",
          "description":""
        },
        {
          "headline":"Fold in the almond meal gently into the batter until it's just incorporated.",
          "description":"The consistency of the batter should be thick and sticky."
        },
        {
          "headline":"Add the roughly chopped almond chocolate to the batter and mix it together until it's just combined.",
          "description":"If you prefer not including this final ingredient in the recipe, you can skip this step to make a plain-flavored almond cookie."
        }
      ]
    },
    {
      "name":"Form the Cookies",
      "steps":[
        {
          "headline":"Roll heaped teaspoons of the batter into balls using your hands and place them on your cookie sheet, placing them about 2\" apart.",
          "description":""
        },
        {
          "headline":"Flatten each ball with a fork.",
          "description":""
        }
      ]
    },
    {
      "name":"Baking",
      "steps":[
        {
          "headline":"Bake your cookies at 350 °F (180 °C) for 12 to 15 minutes, depending on how hot your oven gets.",
          "description":""
        },
        {
          "headline":"Take them out of the oven once they've turned light golden brown and put them gently on a cooling rack.",
          "description":""
        },
        {
          "headline":"Serve them at room temperature or store them on a plate covered with a clear and dry dishcloth until you're ready to eat them.",
          "description":""
        }
      ]
    }
  ],
  "text":" Prepare the Batter Cream the butter and sugar using an electric mixer in a medium bowl until they're light and fluffy.  Add the egg and beat well until it's combined.  Place a fine metal sieve over another medium bowl.  Add the flour, potato starch and baking powder to the sieve and sift the contents gently into your bowl.  Fold about 1/3 of the flour mixture into the egg mixture using a rubber spatula. You'll want to fold rather than mix these dry ingredients into your wet ingredients to avoid beating the air out of your butter mixture. Continue adding more of the flour mixture to the wet ingredients until it's all incorporated.  Fold in the almond meal gently into the batter until it's just incorporated. The consistency of the batter should be thick and sticky. Add the roughly chopped almond chocolate to the batter and mix it together until it's just combined. If you prefer not including this final ingredient in the recipe, you can skip this step to make a plain-flavored almond cookie. Form the Cookies Roll heaped teaspoons of the batter into balls using your hands and place them on your cookie sheet, placing them about 2\" apart.  Flatten each ball with a fork.  Baking Bake your cookies at 350 °F (180 °C) for 12 to 15 minutes, depending on how hot your oven gets.  Take them out of the oven once they've turned light golden brown and put them gently on a cooling rack.  Serve them at room temperature or store them on a plate covered with a clear and dry dishcloth until you're ready to eat them. ",
  "tyn_model":[
    "flour",
    "butter",
    "medium bowl",
    "oven",
    "sugar",
    "electric mixer",
    "fine metal sieve",
    "potato starch",
    "baking powder",
    "sieve",
    "bowl",
    "egg",
    "rubber spatula",
    "almond meal",
    "almond chocolate",
    "almond cookie",
    "cookie sheet",
    "fork",
    "plate"
  ],
  "tyn_section":[

  ]
}