{
  "title":"How to Buy Anthurium Plants",
  "url":"https://www.wikihow.com/Buy-Anthurium-Plants",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Indoor and Patio Plants"
  ],
  "steps":[
    {
      "headline":"Purchase an anthurium plant from a nursery that specializes in tropical plants.",
      "description":"Anthurium plants are available in the tropical plant section of many local garden centers. Several commercial tropical plant distributors also offer anthurium plants for online ordering. For the best selection, look for a retailer that offers several different types of anthurium plants, rather than just 1 species."
    },
    {
      "headline":"Evaluate the temperature of the garden center.",
      "description":"If you are purchasing an anthurium plant locally, make sure the tropical plant area of the garden center has a daytime temperature of 78 to 90 degrees F (25.5 to 32.2 degrees C) and a nighttime temperature of 70 to 75 degrees F (21.2 to 23.8 degrees C). Anthuriums can not tolerate extreme heat or cold. Extreme heat, or temperatures above 90 degrees F (32.2 degrees C), may scorch the leaves, fade the flower color, and reduce the life of the foliage. Extreme cold, or temperatures below 45 degrees F (7.2 degrees C), may cause the leaves to yellow and stunt the plant's growth. Ask online retailers about temperature conditions in the anthurium plant greenhouses before placing an order. Many online distributors provide information about the growing conditions on their websites."
    },
    {
      "headline":"Examine the anthurium plant container.",
      "description":"Carefully inspect the entire container, including the bottom. Look for tears or cracks in the container. Do not purchase anthurium plants potted in cracked containers because the plant may have root damage because of a faulty container."
    },
    {
      "headline":"Asses the soil.",
      "description":"Anthurium plants thrive in coarse, well-drained potting media. Look for potting soil that is an equal mix of pine bark, peat moss and pearlite, which is a volcanic glass with a high water content."
    },
    {
      "headline":"Inspect the stem.",
      "description":"To support the bloom, the stem of the anthurium plant should be straight, long and of medium to heavy thickness. Anthurium plant stems may grow up to 20 inches (50.8 cm), so be sure the stem looks strong enough to hold blooms at that height. Analyze where the stems are in the pot. The stems should be directly in the center of the pot. If the stems are located too close to the side of the container, the potted plant may become unstable."
    },
    {
      "headline":"Buy an anthurium plant with healthy leaves.",
      "description":"Mature anthurium leaves are large and grow from long stalks. The leaves should be bright green and feel waxy. Look for leaves that are smooth and without defects like blotches or tears. Do not purchase anthurium plants with yellow or brown leaves. Look for anthurium with a minimum of four leaves on each plant, which is the number of leaves necessary for successful growth."
    },
    {
      "headline":"Evaluate the spathe.",
      "description":"What most people call the flower on an anthurium plant is actually a spathe, or a waxy protective cover for the plant's tiny flowers. Purchase a plant that has at least one bloom on it so you can analyze its appearance. Determine what color spathe you prefer. Anthurium spathes come in various colors, including red, pink, orange, coral, yellow, and white. Look for anthurium spathes in bright, uniform colors. Consider the shape of the spathe. Anthurium spathes come in three shapes:  standard, obake and tulip. Standard spathes are heart-shaped, while tulip spathes resemble the shape of tulip blooms. Obake spathes are the largest, and often have a slightly twisted appearance. Asses the texture of the spathe. The surface of the spathe should be glossy and waxy with a slightly crinkled appearance."
    },
    {
      "headline":"Purchase fertile anthurium plants.",
      "description":"Select an anthurium plant with both open and closed buds. The new buds are an indication of the plant's fertility."
    },
    {
      "headline":"Examine the plants for signs of insects.",
      "description":"Mites, lice, thrips, white flies and nematodes are common anthurium plant pests. Because the insects are small and hard to spot, look for signs of insect damage, such as leaf discoloration or bite marks on the leaves or stems."
    },
    {
      "headline":"Inspect the plant for disease.",
      "description":"Anthurium plants are subject to bacterial and fungal diseases. If possible, lift the plant out of its container to examine the roots for fungal disease. If the roots are wet and mushy, the plant may be suffering from root rot. Also, look for discolored or spotted leaves, which can be a sign of mold infestation."
    }
  ],
  "text":" Purchase an anthurium plant from a nursery that specializes in tropical plants. Anthurium plants are available in the tropical plant section of many local garden centers. Several commercial tropical plant distributors also offer anthurium plants for online ordering. For the best selection, look for a retailer that offers several different types of anthurium plants, rather than just 1 species. Evaluate the temperature of the garden center. If you are purchasing an anthurium plant locally, make sure the tropical plant area of the garden center has a daytime temperature of 78 to 90 degrees F (25.5 to 32.2 degrees C) and a nighttime temperature of 70 to 75 degrees F (21.2 to 23.8 degrees C). Anthuriums can not tolerate extreme heat or cold. Extreme heat, or temperatures above 90 degrees F (32.2 degrees C), may scorch the leaves, fade the flower color, and reduce the life of the foliage. Extreme cold, or temperatures below 45 degrees F (7.2 degrees C), may cause the leaves to yellow and stunt the plant's growth. Ask online retailers about temperature conditions in the anthurium plant greenhouses before placing an order. Many online distributors provide information about the growing conditions on their websites. Examine the anthurium plant container. Carefully inspect the entire container, including the bottom. Look for tears or cracks in the container. Do not purchase anthurium plants potted in cracked containers because the plant may have root damage because of a faulty container. Asses the soil. Anthurium plants thrive in coarse, well-drained potting media. Look for potting soil that is an equal mix of pine bark, peat moss and pearlite, which is a volcanic glass with a high water content. Inspect the stem. To support the bloom, the stem of the anthurium plant should be straight, long and of medium to heavy thickness. Anthurium plant stems may grow up to 20 inches (50.8 cm), so be sure the stem looks strong enough to hold blooms at that height. Analyze where the stems are in the pot. The stems should be directly in the center of the pot. If the stems are located too close to the side of the container, the potted plant may become unstable. Buy an anthurium plant with healthy leaves. Mature anthurium leaves are large and grow from long stalks. The leaves should be bright green and feel waxy. Look for leaves that are smooth and without defects like blotches or tears. Do not purchase anthurium plants with yellow or brown leaves. Look for anthurium with a minimum of four leaves on each plant, which is the number of leaves necessary for successful growth. Evaluate the spathe. What most people call the flower on an anthurium plant is actually a spathe, or a waxy protective cover for the plant's tiny flowers. Purchase a plant that has at least one bloom on it so you can analyze its appearance. Determine what color spathe you prefer. Anthurium spathes come in various colors, including red, pink, orange, coral, yellow, and white. Look for anthurium spathes in bright, uniform colors. Consider the shape of the spathe. Anthurium spathes come in three shapes:  standard, obake and tulip. Standard spathes are heart-shaped, while tulip spathes resemble the shape of tulip blooms. Obake spathes are the largest, and often have a slightly twisted appearance. Asses the texture of the spathe. The surface of the spathe should be glossy and waxy with a slightly crinkled appearance. Purchase fertile anthurium plants. Select an anthurium plant with both open and closed buds. The new buds are an indication of the plant's fertility. Examine the plants for signs of insects. Mites, lice, thrips, white flies and nematodes are common anthurium plant pests. Because the insects are small and hard to spot, look for signs of insect damage, such as leaf discoloration or bite marks on the leaves or stems. Inspect the plant for disease. Anthurium plants are subject to bacterial and fungal diseases. If possible, lift the plant out of its container to examine the roots for fungal disease. If the roots are wet and mushy, the plant may be suffering from root rot. Also, look for discolored or spotted leaves, which can be a sign of mold infestation.",
  "tyn_model":[
    "anthurium plant",
    "spathe",
    "anthurium plants",
    "anthurium spathes",
    "garden center",
    "pot",
    "container",
    "tropical plant distributors",
    "tropical plant",
    "anthuriums",
    "potting media",
    "potting soil",
    "peat moss",
    "volcanic glass",
    "potted plant",
    "tulip",
    "spathes",
    "white flies",
    "insects"
  ],
  "tyn_section":[

  ]
}