{
  "title":"How to Stream Media from PC to PS3 Using PlayStation Media Server",
  "url":"https://www.wikihow.com/Stream-Media-from-PC-to-PS3-Using-PlayStation-Media-Server",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation 3"
  ],
  "steps":[
    {
      "headline":"Verify that your computer is connected to the internet.",
      "description":"Download the application - Java PS3 Media Server. Choose the version that pertains to your operating system."
    },
    {
      "headline":"Install the chosen application to your computer.",
      "description":""
    },
    {
      "headline":"Turn the Playstation 3 on and verify that it is connected to the same  network that your host computer is connected to.",
      "description":"(the computer that you  downloaded the software onto)"
    },
    {
      "headline":"From the computer, start the application.",
      "description":"It should look something like this"
    },
    {
      "headline":"On the main console of the Playstation 3, scroll to video and choose the host computer's name.",
      "description":"It should look like this"
    },
    {
      "headline":"Next, browse to the directory that contains your media the same way you would if it was on your computer.",
      "description":"(My movie collection is located inside a portable hard drive labeled as F:\\ [FreeAgent GoFlex Drive])"
    },
    {
      "headline":"Choose a file and enjoy.",
      "description":""
    }
  ],
  "text":" Verify that your computer is connected to the internet. Download the application - Java PS3 Media Server. Choose the version that pertains to your operating system. Install the chosen application to your computer.  Turn the Playstation 3 on and verify that it is connected to the same  network that your host computer is connected to. (the computer that you  downloaded the software onto) From the computer, start the application. It should look something like this On the main console of the Playstation 3, scroll to video and choose the host computer's name. It should look like this Next, browse to the directory that contains your media the same way you would if it was on your computer. (My movie collection is located inside a portable hard drive labeled as F:\\ [FreeAgent GoFlex Drive]) Choose a file and enjoy. ",
  "tyn_model":[
    "playstation 3",
    "portable hard drive",
    "freeagent goflex drive"
  ],
  "tyn_section":[

  ]
}