{
  "title":"How to Make an Airlock for Fermenting Wine",
  "url":"https://www.wikihow.com/Make-an-Airlock-for-Fermenting-Wine",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Wine"
  ],
  "steps":[
    {
      "headline":"Take the cork and clamp it in a clean vise.",
      "description":""
    },
    {
      "headline":"Drill a small hole all the way through the cork.",
      "description":""
    },
    {
      "headline":"Slowly and carefully enlarge the hole until the tube fits snugly in the cork.",
      "description":""
    },
    {
      "headline":"Push it about 1/4 of an inch out of the bottom of the cork.",
      "description":""
    },
    {
      "headline":"Carefully seal around the tube on both sides with caulk.",
      "description":""
    },
    {
      "headline":"Push the nub for the one way valve on to the end of the tube.",
      "description":""
    },
    {
      "headline":"Attach more tubing on to the other end of the one way valve.",
      "description":""
    },
    {
      "headline":"Seal the ends with caulk.",
      "description":""
    },
    {
      "headline":"Add your beer or wine to the bottle you took the cork from.",
      "description":""
    },
    {
      "headline":"Stick the cork back into the bottle.",
      "description":""
    },
    {
      "headline":"Let it ferment.",
      "description":""
    }
  ],
  "text":" Take the cork and clamp it in a clean vise.  Drill a small hole all the way through the cork.  Slowly and carefully enlarge the hole until the tube fits snugly in the cork.  Push it about 1/4 of an inch out of the bottom of the cork.  Carefully seal around the tube on both sides with caulk.  Push the nub for the one way valve on to the end of the tube.  Attach more tubing on to the other end of the one way valve.  Seal the ends with caulk.  Add your beer or wine to the bottle you took the cork from.  Stick the cork back into the bottle.  Let it ferment. ",
  "tyn_model":[
    "caulk",
    "beer",
    "wine"
  ],
  "tyn_section":[

  ]
}