{
  "title":"How to Make a Den out of Your Unused Shed",
  "url":"https://www.wikihow.com/Make-a-Den-out-of-Your-Unused-Shed",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Outdoor Buildings",
    "Sheds"
  ],
  "steps":[
    {
      "headline":"Make sure you have a good sized shed, at least enough room for you, a friend and a table to fit inside!",
      "description":"Clear it out so there is nothing left inside."
    },
    {
      "headline":"Decide on which colour paint you might use to do up the inside.",
      "description":"If you are unsure of what colours to use, go to a DIY store and buy tester pots of paint, then paint small squares of the paint on to the shed to help you decide."
    },
    {
      "headline":"Once you have painted your shed, you might want to add gloss onto it to stop you getting that horrible feeling when you run your fingers down a painted wall.",
      "description":""
    },
    {
      "headline":"Once everything is dry, you can choose to leave the floor as it is, or add carpet, tiles, or even just an old rug that is large enough to fit the whole place!",
      "description":""
    },
    {
      "headline":"Next, you would probably be thinking already about shelves.",
      "description":"You don't have to buy shelves from a store, you can use planks of wood and ask an adult to drill them in to the walls. Try not to put anything valuable on the shelves. (see warnings)"
    },
    {
      "headline":"Find things to sit on.",
      "description":"Your den will be starting to take shape by now! Your next step would be to add something to sit on, like a small sofa or some of those huge beanbags, or even just large pillows!"
    },
    {
      "headline":"Decorate.",
      "description":"At the moment, sitting in your den would be pretty boring. Instead of things used by plugs, the cheap way of getting these appliances, is using battery operated ones. These are usually quite hard to find in supermarkets and department stores, so you are best looking online. Keeping a drawer or box of batteries in your den would be handy, because if you didn't, if you had run out of batteries for something, you'd have to go back into your house and storm about saying, \"WHERE ON EARTH ARE THE BATTERIES?!!\""
    },
    {
      "headline":"By now, you've pretty much got a cool den, but an idea is to put up hooks for coats and things and maybe a doormat or shoe rack could be added to stop your floor getting dirty.",
      "description":""
    },
    {
      "headline":"If you have any big windows in your den, you could get curtains, blankets or large bits of material to cover them up, especially at night.",
      "description":""
    }
  ],
  "text":" Make sure you have a good sized shed, at least enough room for you, a friend and a table to fit inside! Clear it out so there is nothing left inside. Decide on which colour paint you might use to do up the inside. If you are unsure of what colours to use, go to a DIY store and buy tester pots of paint, then paint small squares of the paint on to the shed to help you decide. Once you have painted your shed, you might want to add gloss onto it to stop you getting that horrible feeling when you run your fingers down a painted wall.  Once everything is dry, you can choose to leave the floor as it is, or add carpet, tiles, or even just an old rug that is large enough to fit the whole place!  Next, you would probably be thinking already about shelves. You don't have to buy shelves from a store, you can use planks of wood and ask an adult to drill them in to the walls. Try not to put anything valuable on the shelves. (see warnings) Find things to sit on. Your den will be starting to take shape by now! Your next step would be to add something to sit on, like a small sofa or some of those huge beanbags, or even just large pillows! Decorate. At the moment, sitting in your den would be pretty boring. Instead of things used by plugs, the cheap way of getting these appliances, is using battery operated ones. These are usually quite hard to find in supermarkets and department stores, so you are best looking online. Keeping a drawer or box of batteries in your den would be handy, because if you didn't, if you had run out of batteries for something, you'd have to go back into your house and storm about saying, \"WHERE ON EARTH ARE THE BATTERIES?!!\" By now, you've pretty much got a cool den, but an idea is to put up hooks for coats and things and maybe a doormat or shoe rack could be added to stop your floor getting dirty.  If you have any big windows in your den, you could get curtains, blankets or large bits of material to cover them up, especially at night. ",
  "tyn_model":[
    "paint",
    "shelves",
    "batteries",
    "tiles",
    "battery operated ones",
    "curtains",
    "blankets"
  ],
  "tyn_section":[

  ]
}