{
  "title":"How to Make Rum Balls",
  "url":"https://www.wikihow.com/Make-Rum-Balls",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Confectionery Balls"
  ],
  "steps":[
    {
      "headline":"Assemble the ingredients.",
      "description":""
    },
    {
      "headline":"Melt the chocolate chips in a double boiler or a microwave on low power.",
      "description":"Be very careful if you use a microwave. The chocolate chips tend not to look melted and the tendency is to overheat them. Seven minutes on power level 2 with a stir every few minutes in a standard microwave is sufficient. Cool the chips."
    },
    {
      "headline":"Cream the margarine or margarine and butter mixture and add to the melted chocolate chips.",
      "description":""
    },
    {
      "headline":"Blend in egg and powdered (icing) sugar, while continually mixing.",
      "description":""
    },
    {
      "headline":"Slowly stir in the rum.",
      "description":""
    },
    {
      "headline":"Pour the mixture into a container with little head space and cover with plastic wrap or a very tight lid.",
      "description":"Sealing the container is important if you want to preserve the alcohol. Place the container in the fridge for 3+ hours or until the mixture is solid. You can leave the mixture to chill overnight, if you wish."
    },
    {
      "headline":"Roll into balls of whatever size you prefer and roll on a plate of garnish to finish them off.",
      "description":"You can also serve them plain."
    },
    {
      "headline":"Store in a closed container in the freezer.",
      "description":"You can serve them right from the freezer, since they rarely freeze."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Assemble the ingredients.  Melt the chocolate chips in a double boiler or a microwave on low power. Be very careful if you use a microwave. The chocolate chips tend not to look melted and the tendency is to overheat them. Seven minutes on power level 2 with a stir every few minutes in a standard microwave is sufficient. Cool the chips. Cream the margarine or margarine and butter mixture and add to the melted chocolate chips.  Blend in egg and powdered (icing) sugar, while continually mixing.  Slowly stir in the rum.  Pour the mixture into a container with little head space and cover with plastic wrap or a very tight lid. Sealing the container is important if you want to preserve the alcohol. Place the container in the fridge for 3+ hours or until the mixture is solid. You can leave the mixture to chill overnight, if you wish. Roll into balls of whatever size you prefer and roll on a plate of garnish to finish them off. You can also serve them plain. Store in a closed container in the freezer. You can serve them right from the freezer, since they rarely freeze. Finished. ",
  "tyn_model":[
    "chocolate chips",
    "microwave",
    "margarine",
    "container",
    "double boiler",
    "butter",
    "egg",
    "sugar",
    "rum",
    "plastic wrap",
    "alcohol",
    "fridge",
    "freezer"
  ],
  "tyn_section":[

  ]
}