{
  "title":"How to Make Stuffed Loin of Lamb",
  "url":"https://www.wikihow.com/Make-Stuffed-Loin-of-Lamb",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Beef and Lamb"
  ],
  "methods":[
    {
      "name":"Making the Stuffing",
      "steps":[
        {
          "headline":"Melt the butter in a pan on low heat and add finely chopped onions.",
          "description":"Cook for 1 minute stirring constantly and add the finely chopped apricots."
        },
        {
          "headline":"Remove from heat when the onions are slightly browned and stir in green peppercorns and chutney.",
          "description":""
        },
        {
          "headline":"Cool for 5 minutes.",
          "description":""
        },
        {
          "headline":"Stir in breadcrumbs and egg yolk",
          "description":""
        }
      ]
    },
    {
      "name":"Making the Lamb",
      "steps":[
        {
          "headline":"Open loin of lamb, fat side down on the board.",
          "description":""
        },
        {
          "headline":"Put prepared stuffing along the center of the lamb.",
          "description":""
        },
        {
          "headline":"Roll up securely and tie with string at 2.5 centimeter (1.0 in) intervals.",
          "description":""
        },
        {
          "headline":"Sprinkle oil onto a baking dish and spread evenly with a paper towel.",
          "description":""
        },
        {
          "headline":"Add lamb and bake in a moderate oven for an hour.",
          "description":"Baste regularly with combined melted jelly and brandy to give the lamb a rich glaze."
        },
        {
          "headline":"Carve the stuffed lamb.",
          "description":"Can be served hot or cold."
        }
      ]
    }
  ],
  "text":" Making the Stuffing Melt the butter in a pan on low heat and add finely chopped onions. Cook for 1 minute stirring constantly and add the finely chopped apricots. Remove from heat when the onions are slightly browned and stir in green peppercorns and chutney.  Cool for 5 minutes.  Stir in breadcrumbs and egg yolk  Making the Lamb Open loin of lamb, fat side down on the board.  Put prepared stuffing along the center of the lamb.  Roll up securely and tie with string at 2.5 centimeter (1.0 in) intervals.  Sprinkle oil onto a baking dish and spread evenly with a paper towel.  Add lamb and bake in a moderate oven for an hour. Baste regularly with combined melted jelly and brandy to give the lamb a rich glaze. Carve the stuffed lamb. Can be served hot or cold.",
  "tyn_model":[
    "onions",
    "lamb",
    "butter",
    "pan",
    "apricots",
    "green peppercorns",
    "chutney",
    "breadcrumbs",
    "egg yolk",
    "oil",
    "baking dish",
    "paper towel",
    "moderate oven",
    "jelly",
    "brandy"
  ],
  "tyn_section":[

  ]
}