{
  "title":"How to Make Panforte",
  "url":"https://www.wikihow.com/Make-Panforte",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "European Cuisine",
    "Italian Cuisine"
  ],
  "steps":[
    {
      "headline":"Assemble the items needed.",
      "description":"These are listed below under \"Things You'll Need\"."
    },
    {
      "headline":"Preheat the oven to 150ºC/300ºF.",
      "description":"Lay baking paper (parchment paper) across the baking pan. You can also grease it if wished and add the paper over the top."
    },
    {
      "headline":"Toast the almonds.",
      "description":"Use a grill or broiler. The almonds should be toasted until they just turn golden in colour. Set aside to cool."
    },
    {
      "headline":"Once cooled, place the toasted almonds in a heatproof bowl.",
      "description":"Add the hazelnuts, mixed peel, candied pineapple, cocoa powder, flour and spices. Mix well."
    },
    {
      "headline":"Place the small saucepan on the heat source.",
      "description":"Pour in the honey and sugar. Cook over a low heat until the sugar dissolves."
    },
    {
      "headline":"Cook the syrup until it turns the soft ball stage.",
      "description":"This means that a teaspoon of the syrup is soft and easily bent or pressed when dropped into cold water. The colour should be golden to brown."
    },
    {
      "headline":"Pour the syrup over the nut mixture in the bowl.",
      "description":"Mix well and move quickly to mix before the syrup hardens."
    },
    {
      "headline":"Spoon the mixture into the prepared pan.",
      "description":"Press down evenly. Keep working quickly as the mixture hardens the more it cools. The surface should appear smooth."
    },
    {
      "headline":"Place into the oven to bake.",
      "description":"Bake for 35 minutes. Since this cake neither changes colour nor rises, you must keep an eye on the time to work out when it's ready. Set the timer!"
    },
    {
      "headline":"Remove from the oven.",
      "description":"Leave to cool in the pan. When it has cooled enough to firm up, remove from the tin and peel off the parchment paper. Leave on a wire cooling rack to cool completely."
    },
    {
      "headline":"Dust heavily with icing sugar (confectioners sugar).",
      "description":"Slice into finger lengths or long triangles. It is now ready to serve. This makes an excellent gift when added to gift boxes suitable for food. Alternatively, wrap an uncut circle of it in cellophane and tie with a ribbon."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Assemble the items needed. These are listed below under \"Things You'll Need\". Preheat the oven to 150ºC/300ºF. Lay baking paper (parchment paper) across the baking pan. You can also grease it if wished and add the paper over the top. Toast the almonds. Use a grill or broiler. The almonds should be toasted until they just turn golden in colour. Set aside to cool. Once cooled, place the toasted almonds in a heatproof bowl. Add the hazelnuts, mixed peel, candied pineapple, cocoa powder, flour and spices. Mix well. Place the small saucepan on the heat source. Pour in the honey and sugar. Cook over a low heat until the sugar dissolves. Cook the syrup until it turns the soft ball stage. This means that a teaspoon of the syrup is soft and easily bent or pressed when dropped into cold water. The colour should be golden to brown. Pour the syrup over the nut mixture in the bowl. Mix well and move quickly to mix before the syrup hardens. Spoon the mixture into the prepared pan. Press down evenly. Keep working quickly as the mixture hardens the more it cools. The surface should appear smooth. Place into the oven to bake. Bake for 35 minutes. Since this cake neither changes colour nor rises, you must keep an eye on the time to work out when it's ready. Set the timer! Remove from the oven. Leave to cool in the pan. When it has cooled enough to firm up, remove from the tin and peel off the parchment paper. Leave on a wire cooling rack to cool completely. Dust heavily with icing sugar (confectioners sugar). Slice into finger lengths or long triangles. It is now ready to serve. This makes an excellent gift when added to gift boxes suitable for food. Alternatively, wrap an uncut circle of it in cellophane and tie with a ribbon. Finished. ",
  "tyn_model":[
    "oven",
    "almonds",
    "parchment paper",
    "sugar",
    "baking paper",
    "baking pan",
    "grill or broiler",
    "heatproof bowl",
    "hazelnuts",
    "pineapple",
    "cocoa powder",
    "flour",
    "spices",
    "small saucepan",
    "honey",
    "water",
    "nut",
    "bowl",
    "icing sugar",
    "confectioners sugar",
    "cellophane",
    "ribbon"
  ],
  "tyn_section":[

  ]
}