{
  "title":"How to Fry Pork Chops",
  "url":"https://www.wikihow.com/Fry-Pork-Chops",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Pork",
    "Pork Chops"
  ],
  "methods":[
    {
      "name":"Basic Fried Pork Chops",
      "steps":[
        {
          "headline":"Start with fresh pork chops.",
          "description":"Choose either bone-in or boneless pork chops. The boneless chops tend to have less fat, but they aren't quite as flavorful. Bone-in chops are less expensive and release a lot of delicious flavor as they cook."
        },
        {
          "headline":"Rinse the pork chops and pat them dry.",
          "description":""
        },
        {
          "headline":"Season the pork chops.",
          "description":"Sprinkle both sides with salt and pepper. Add other seasonings like garlic powder or paprika if you'd like."
        },
        {
          "headline":"Heat the butter in a skillet over medium high.",
          "description":"Let the butter melt completely before proceeding. The pan should be nice and hot."
        },
        {
          "headline":"Lay the pork chops in the pan.",
          "description":"Make sure none of them are overlapping. If you need to fry the pork chops two at a time because your pan isn't large enough for four, that's fine."
        },
        {
          "headline":"Flip them to the other side after 3 or 4 minutes.",
          "description":"If the pork chops are thicker than an inch, give them a bit longer."
        },
        {
          "headline":"Let them cook on the second side for another 3 or 4 minutes.",
          "description":""
        },
        {
          "headline":"Remove the pork chops from the pan and put them on a plate.",
          "description":""
        }
      ]
    },
    {
      "name":"Breaded Pork Chops",
      "steps":[
        {
          "headline":"Wash the pork chops and pat them dry.",
          "description":""
        },
        {
          "headline":"Mix up an egg wash. Place the egg and milk in a bowl and use a whisk to stir them together.",
          "description":""
        },
        {
          "headline":"Mix the flour coating.",
          "description":"Place the flour, salt, pepper and paprika in a bowl. Stir them together until they're well mixed."
        },
        {
          "headline":"Heat the oil in a skillet.",
          "description":"Pour it into the skillet and heat it over medium high. Let the pan get hot before proceeding."
        },
        {
          "headline":"Dip a pork chop in the egg mixture.",
          "description":"Use tongs or your fingers to dip it in the bowl so that the egg covers both sides."
        },
        {
          "headline":"Dredge it in the flour mixture.",
          "description":"Make sure it gets completely coated."
        },
        {
          "headline":"Lay the pork chop in the pan.",
          "description":""
        },
        {
          "headline":"Repeat with the remaining pork chops.",
          "description":""
        },
        {
          "headline":"Flip the pork chops after 3 - 4 minutes.",
          "description":""
        },
        {
          "headline":"Cook the pork chops for another 3 - 4 minutes.",
          "description":"They're ready when they are deep golden brown."
        },
        {
          "headline":"Remove them from the pan and serve.",
          "description":""
        }
      ]
    },
    {
      "name":"Honey Glazed Pork Chops",
      "steps":[
        {
          "headline":"Wash the pork chops and pat them dry.",
          "description":""
        },
        {
          "headline":"Season the pork chops with salt and pepper.",
          "description":""
        },
        {
          "headline":"Heat the oil in a skillet over medium high heat.",
          "description":""
        },
        {
          "headline":"Lay the pork chops in the pan.",
          "description":"Make sure none are overlapping."
        },
        {
          "headline":"Cook them on the first side for 3 - 4 minutes.",
          "description":""
        },
        {
          "headline":"Flip the pork chops.",
          "description":""
        },
        {
          "headline":"Cover each pork chop with a tablespoon of honey.",
          "description":""
        },
        {
          "headline":"Flip the pork chops again after 3 - 4 minutes.",
          "description":""
        },
        {
          "headline":"Remove the pork chops from the pan and serve.",
          "description":""
        }
      ]
    },
    {
      "name":"Cracker Pork Chops",
      "steps":[
        {
          "headline":"Rinse the pork chops off with water.",
          "description":"Pat them dry with a paper towel."
        },
        {
          "headline":"Whisk the eggs and milk in a bowl.",
          "description":""
        },
        {
          "headline":"In a separate bowl, mix the crushed crackers, salt and pepper.",
          "description":""
        },
        {
          "headline":"Heat the cooking oil in a skillet on medium high.",
          "description":""
        },
        {
          "headline":"Dip each pork chop in the egg mixture.",
          "description":"Completely cover the pork chop on both sides."
        },
        {
          "headline":"Dip each egg-coated pork chop in the cracker mixture.",
          "description":"Again, make sure it's completely covered on both sides."
        },
        {
          "headline":"Lay each pork chop in the skillet.",
          "description":""
        },
        {
          "headline":"Check the pork chops after 5 minutes.",
          "description":"If they are a deep golden brown color, flip to the other side."
        },
        {
          "headline":"Wait until the other side is deep golden brown before removing.",
          "description":"The pork chops are done when a deep golden brown color on each side and the meat isn't pink on the inside."
        },
        {
          "headline":"Serve immediately.",
          "description":""
        }
      ]
    },
    {
      "name":"Double-Breaded Pork Chops",
      "steps":[
        {
          "headline":"Wash the pork chops and pat dry.",
          "description":""
        },
        {
          "headline":"Make a breading from the flour, salt, and pepper.",
          "description":"For the second coat, use Italian breadcrumbs, or add herbs such as herbes de Provence to plain breadcrumbs. If you have grated Parmesan cheese available, add it to the second coat."
        },
        {
          "headline":"Whisk two eggs together.",
          "description":"Using a fork, place each chop into the egg mixture, then into the flour mixture, coating well."
        },
        {
          "headline":"Return the chop to the egg mixture once more, and then into the second coat.",
          "description":"This will create a thicker coating that is crunchy and lovely to eat. Kids especially like it."
        },
        {
          "headline":"Cook in oil at medium temperature.",
          "description":"Cook until brown, around 3 to 4 minutes. Turn over and cook the other side for an additional 3 minutes, or until brown."
        },
        {
          "headline":"Drain on paper towel in layers to keep them warm.",
          "description":""
        },
        {
          "headline":"Serve with homemade applesauce and potatoes.",
          "description":""
        }
      ]
    }
  ],
  "text":" Basic Fried Pork Chops Start with fresh pork chops. Choose either bone-in or boneless pork chops. The boneless chops tend to have less fat, but they aren't quite as flavorful. Bone-in chops are less expensive and release a lot of delicious flavor as they cook. Rinse the pork chops and pat them dry.  Season the pork chops. Sprinkle both sides with salt and pepper. Add other seasonings like garlic powder or paprika if you'd like. Heat the butter in a skillet over medium high. Let the butter melt completely before proceeding. The pan should be nice and hot. Lay the pork chops in the pan. Make sure none of them are overlapping. If you need to fry the pork chops two at a time because your pan isn't large enough for four, that's fine. Flip them to the other side after 3 or 4 minutes. If the pork chops are thicker than an inch, give them a bit longer. Let them cook on the second side for another 3 or 4 minutes.  Remove the pork chops from the pan and put them on a plate.  Breaded Pork Chops Wash the pork chops and pat them dry.  Mix up an egg wash. Place the egg and milk in a bowl and use a whisk to stir them together.  Mix the flour coating. Place the flour, salt, pepper and paprika in a bowl. Stir them together until they're well mixed. Heat the oil in a skillet. Pour it into the skillet and heat it over medium high. Let the pan get hot before proceeding. Dip a pork chop in the egg mixture. Use tongs or your fingers to dip it in the bowl so that the egg covers both sides. Dredge it in the flour mixture. Make sure it gets completely coated. Lay the pork chop in the pan.  Repeat with the remaining pork chops.  Flip the pork chops after 3 - 4 minutes.  Cook the pork chops for another 3 - 4 minutes. They're ready when they are deep golden brown. Remove them from the pan and serve.  Honey Glazed Pork Chops Wash the pork chops and pat them dry.  Season the pork chops with salt and pepper.  Heat the oil in a skillet over medium high heat.  Lay the pork chops in the pan. Make sure none are overlapping. Cook them on the first side for 3 - 4 minutes.  Flip the pork chops.  Cover each pork chop with a tablespoon of honey.  Flip the pork chops again after 3 - 4 minutes.  Remove the pork chops from the pan and serve.  Cracker Pork Chops Rinse the pork chops off with water. Pat them dry with a paper towel. Whisk the eggs and milk in a bowl.  In a separate bowl, mix the crushed crackers, salt and pepper.  Heat the cooking oil in a skillet on medium high.  Dip each pork chop in the egg mixture. Completely cover the pork chop on both sides. Dip each egg-coated pork chop in the cracker mixture. Again, make sure it's completely covered on both sides. Lay each pork chop in the skillet.  Check the pork chops after 5 minutes. If they are a deep golden brown color, flip to the other side. Wait until the other side is deep golden brown before removing. The pork chops are done when a deep golden brown color on each side and the meat isn't pink on the inside. Serve immediately.  Double-Breaded Pork Chops Wash the pork chops and pat dry.  Make a breading from the flour, salt, and pepper. For the second coat, use Italian breadcrumbs, or add herbs such as herbes de Provence to plain breadcrumbs. If you have grated Parmesan cheese available, add it to the second coat. Whisk two eggs together. Using a fork, place each chop into the egg mixture, then into the flour mixture, coating well. Return the chop to the egg mixture once more, and then into the second coat. This will create a thicker coating that is crunchy and lovely to eat. Kids especially like it. Cook in oil at medium temperature. Cook until brown, around 3 to 4 minutes. Turn over and cook the other side for an additional 3 minutes, or until brown. Drain on paper towel in layers to keep them warm.  Serve with homemade applesauce and potatoes. ",
  "tyn_model":[
    "skillet",
    "flour",
    "bowl",
    "egg",
    "pork chops",
    "salt",
    "pepper",
    "oil",
    "salt and pepper",
    "butter",
    "milk",
    "paper towel",
    "eggs",
    "garlic powder",
    "plate",
    "egg wash",
    "whisk",
    "paprika",
    "honey glazed pork chops",
    "pan",
    "honey",
    "water",
    "crackers",
    "cooking oil",
    "cracker",
    "italian breadcrumbs",
    "fork",
    "applesauce",
    "potatoes"
  ],
  "tyn_section":[

  ]
}