{
  "title":"How to Draw a Bird out of a Cursive L",
  "url":"https://www.wikihow.com/Draw-a-Bird-out-of-a-Cursive-L",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Text and Lettering",
    "Drawing Shape Words"
  ],
  "steps":[
    {
      "headline":"Start off  by drawing your script L.",
      "description":""
    },
    {
      "headline":"Next, draw a circle in the top of the L Then cut it in half.",
      "description":""
    },
    {
      "headline":"Next, Put a circle in the bottom half and eyelashes on the center line.",
      "description":"Since this step may be hard to read, it is in the pictures."
    },
    {
      "headline":"Now draw a beak.",
      "description":"Your going to start at the top where you put the eyeball but on the outside of the loop. Take a look at this picture."
    },
    {
      "headline":"Now draw a smile on the beak and a nostril above the smile.",
      "description":""
    },
    {
      "headline":"Draw a belly by starting at where the beak ends and going down to the end of the L.",
      "description":""
    },
    {
      "headline":"Draw a feather on the back of the bird.",
      "description":""
    },
    {
      "headline":"Draw lines at the bottom loop and then they will look like feathers.",
      "description":""
    },
    {
      "headline":"Add circles on the line to look like it's standing on a cage.",
      "description":""
    },
    {
      "headline":"Color your drawing any colors you want!",
      "description":""
    }
  ],
  "text":" Start off  by drawing your script L.  Next, draw a circle in the top of the L Then cut it in half.  Next, Put a circle in the bottom half and eyelashes on the center line. Since this step may be hard to read, it is in the pictures. Now draw a beak. Your going to start at the top where you put the eyeball but on the outside of the loop. Take a look at this picture. Now draw a smile on the beak and a nostril above the smile.  Draw a belly by starting at where the beak ends and going down to the end of the L.  Draw a feather on the back of the bird.  Draw lines at the bottom loop and then they will look like feathers.  Add circles on the line to look like it's standing on a cage.  Color your drawing any colors you want! ",
  "tyn_model":[
    "feather",
    "bird",
    "feathers"
  ],
  "tyn_section":[

  ]
}