{
  "title":"How to Make Bacon Brittle",
  "url":"https://www.wikihow.com/Make-Bacon-Brittle",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Pork",
    "Bacon"
  ],
  "steps":[
    {
      "headline":"Heat the oven to 400 degrees.",
      "description":""
    },
    {
      "headline":"Place the bacon onto a silicon lined baking sheet.",
      "description":"Place on the middle shelf of the oven and bake. Remove after 15 minutes or when the bacon is deep brown."
    },
    {
      "headline":"Place the baked bacon onto paper towel to soak up excess grease.",
      "description":"Leave to cool. Once cooled, crumble into small pieces."
    },
    {
      "headline":"Save 1 tablespoon of bacon fat.Wash the silicon sheet and line the baking sheet again.",
      "description":"Baste with the bacon fat."
    },
    {
      "headline":"Pour the sugar and water into the saucepan.",
      "description":"Cook over high heat, stirring constantly to dissolve the sugar. After the sugar is dissolved, cook another 10 to 15 minutes. The sugar mixture is ready when it turns a deep brown color. If you have a candy thermometer, the reading should be 350 degrees."
    },
    {
      "headline":"Remove from the heat.",
      "description":"Add the crumbled bacon pieces and stir through to distribute evenly."
    },
    {
      "headline":"Pour immediately over the bacon fat covered silicon sheet.",
      "description":""
    },
    {
      "headline":"Leave to sit at room temperature.",
      "description":"It will harden in about 20 minutes to half an hour."
    },
    {
      "headline":"Once completely cooled, break into pieces for eating.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Heat the oven to 400 degrees.  Place the bacon onto a silicon lined baking sheet. Place on the middle shelf of the oven and bake. Remove after 15 minutes or when the bacon is deep brown. Place the baked bacon onto paper towel to soak up excess grease. Leave to cool. Once cooled, crumble into small pieces. Save 1 tablespoon of bacon fat.Wash the silicon sheet and line the baking sheet again. Baste with the bacon fat. Pour the sugar and water into the saucepan. Cook over high heat, stirring constantly to dissolve the sugar. After the sugar is dissolved, cook another 10 to 15 minutes. The sugar mixture is ready when it turns a deep brown color. If you have a candy thermometer, the reading should be 350 degrees. Remove from the heat. Add the crumbled bacon pieces and stir through to distribute evenly. Pour immediately over the bacon fat covered silicon sheet.  Leave to sit at room temperature. It will harden in about 20 minutes to half an hour. Once completely cooled, break into pieces for eating.  Finished. ",
  "tyn_model":[
    "sugar",
    "bacon fat",
    "oven",
    "silicon lined baking sheet",
    "paper towel",
    "silicon sheet",
    "baking sheet",
    "water",
    "saucepan",
    "candy thermometer",
    "bacon"
  ],
  "tyn_section":[

  ]
}