{
  "title":"How to Make Brunch for New Year's Day",
  "url":"https://www.wikihow.com/Make-Brunch-for-New-Year%27s-Day",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "steps":[
    {
      "headline":"Set a late time for the brunch.",
      "description":"Don't start any earlier than 11:00am and keep the brunch running for several hours to allow people the chance to turn up when it's convenient. Consider having an open house for friends and family to drop by any time during a long, drawn out brunch. Let every guest arriving know that this is a very casual, very comfortable affair. It's not about dressing up, just about catching up and sharing goodwill for the forthcoming year. In contrast to Christmas preparations, the brunch should be a low-key affair, in which everyone can unwind and sloth about."
    },
    {
      "headline":"Set the table.",
      "description":"Keep some of the New Year's traditions in mind when setting the table for the event. Choose flowers that are thought to bring good luck, such as magnolias, irises, peonies, lotuses, chrysanthemums, and plum blossoms."
    },
    {
      "headline":"Use pomegranates to make cocktails or mock tails.",
      "description":"The pomegranate has the meaning of abundance and for this reason, it is often included in the New Year's Day meals of Mediterranean countries. Other ways to enjoy pomegranates at your brunch include:\nPomegranate soup\nPomegranate mojito\n\nWhite grape pomegranate juice."
    },
    {
      "headline":"Make a spread consisting of foods thought to bring good luck.",
      "description":"Drawing from a wide range of traditions concerned with luck, here are some suggestions for foods to use:\nCabbage – thought to represent money. For example, serve cabbage soup, coleslaw, stuffed cabbage, etc. Lentils – thought to symbolize coins. For example, serve Lentil shepherd's pie, Spanish lentils and Puy lentils. Pork – because pigs represent progress and a rich life. For example, serve Hawaiian pork chops, pork loin Parmesan and Downeast pork ribs. Long noodles – thought to signify a long life. For example, serve Asian salmon noodles. Collards – these represent dollars in the South of the USA. For example, serve African collard greens, collard greens Southern style and collard greens and ham in a crockpot. Spring rolls – these are thought to look like gold bars. For example, serve crispy vegetable spring rolls, original spring rolls and spring rolls."
    },
    {
      "headline":"Consider serving tapas.",
      "description":"Tapas portions can be an excellent way of providing a wider variety of food styles to suit everyone, that can be brought out continuously during the day. Better still, much of this can be bought or prepared the day before, letting you relax more as the host. Some tapas ideas for you: chorizo and garbanzo tapas, caponata, patatas bravas and Spanish tortilla."
    },
    {
      "headline":"For dessert, serve Bundt cake or circular sweet treat.",
      "description":"The idea of a ring represents bringing closure to the year that has passed. You can even include a small trinket in the cake. The idea behind this is that the person who finds it is destined to have an especially fortunate year ahead. Some ideas include:\nStrawberry bundt cake\n\nApple bundt cake."
    },
    {
      "headline":"Let your guests know that it is important to leave a few morsels unfinished on their plates.",
      "description":"To this signifies having enough stocked in your pantry for the coming year."
    }
  ],
  "text":" Set a late time for the brunch. Don't start any earlier than 11:00am and keep the brunch running for several hours to allow people the chance to turn up when it's convenient. Consider having an open house for friends and family to drop by any time during a long, drawn out brunch. Let every guest arriving know that this is a very casual, very comfortable affair. It's not about dressing up, just about catching up and sharing goodwill for the forthcoming year. In contrast to Christmas preparations, the brunch should be a low-key affair, in which everyone can unwind and sloth about. Set the table. Keep some of the New Year's traditions in mind when setting the table for the event. Choose flowers that are thought to bring good luck, such as magnolias, irises, peonies, lotuses, chrysanthemums, and plum blossoms. Use pomegranates to make cocktails or mock tails. The pomegranate has the meaning of abundance and for this reason, it is often included in the New Year's Day meals of Mediterranean countries. Other ways to enjoy pomegranates at your brunch include:\nPomegranate soup\nPomegranate mojito\n\nWhite grape pomegranate juice. Make a spread consisting of foods thought to bring good luck. Drawing from a wide range of traditions concerned with luck, here are some suggestions for foods to use:\nCabbage – thought to represent money. For example, serve cabbage soup, coleslaw, stuffed cabbage, etc. Lentils – thought to symbolize coins. For example, serve Lentil shepherd's pie, Spanish lentils and Puy lentils. Pork – because pigs represent progress and a rich life. For example, serve Hawaiian pork chops, pork loin Parmesan and Downeast pork ribs. Long noodles – thought to signify a long life. For example, serve Asian salmon noodles. Collards – these represent dollars in the South of the USA. For example, serve African collard greens, collard greens Southern style and collard greens and ham in a crockpot. Spring rolls – these are thought to look like gold bars. For example, serve crispy vegetable spring rolls, original spring rolls and spring rolls. Consider serving tapas. Tapas portions can be an excellent way of providing a wider variety of food styles to suit everyone, that can be brought out continuously during the day. Better still, much of this can be bought or prepared the day before, letting you relax more as the host. Some tapas ideas for you: chorizo and garbanzo tapas, caponata, patatas bravas and Spanish tortilla. For dessert, serve Bundt cake or circular sweet treat. The idea of a ring represents bringing closure to the year that has passed. You can even include a small trinket in the cake. The idea behind this is that the person who finds it is destined to have an especially fortunate year ahead. Some ideas include:\nStrawberry bundt cake\n\nApple bundt cake. Let your guests know that it is important to leave a few morsels unfinished on their plates. To this signifies having enough stocked in your pantry for the coming year.",
  "tyn_model":[
    "– thought",
    "lentils",
    "tapas",
    "pomegranates",
    "– these",
    "collard greens",
    "bundt cake",
    "brunch",
    "flowers",
    "magnolias",
    "irises",
    "peonies",
    "lotuses",
    "chrysanthemums",
    "pomegranate",
    "pomegranate soup",
    "pomegranate mojito",
    "white grape pomegranate",
    "cabbage",
    "cabbage soup",
    "coleslaw",
    "stuffed cabbage",
    "pork",
    "– because",
    "pork loin",
    "pork ribs",
    "ham",
    "crockpot",
    "caponata",
    "spanish tortilla",
    "apple"
  ],
  "tyn_section":[

  ]
}