{
  "title":"How to Make a Chocolate Ice Cream Pie",
  "url":"https://www.wikihow.com/Make-a-Chocolate-Ice-Cream-Pie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies"
  ],
  "methods":[
    {
      "name":"Basic Chocolate Ice Cream Pie",
      "steps":[
        {
          "headline":"Beat together the vanilla ice cream and pudding in a large bowl.",
          "description":"Whisk well in a large bowl until properly combined."
        },
        {
          "headline":"Pour the mixture into the pie crusts.",
          "description":""
        },
        {
          "headline":"Freeze the pies for 5-7 hours until the pies are firm.",
          "description":""
        },
        {
          "headline":"Allow the pies to sit for ten minutes before slicing.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Slice the pies with a cutting knife and lay the pieces on a serving plate. Garnish with whipped topping or chocolate syrup. Enjoy!"
        }
      ]
    },
    {
      "name":"Triple Chocolate Ice Cream Pie",
      "steps":[
        {
          "headline":"Scoop a pint of chocolate ice cream into the pie crust.",
          "description":"Spread it around slowly and smoothly with a rubber spatula."
        },
        {
          "headline":"Freeze the pie for half an hour until firm.",
          "description":""
        },
        {
          "headline":"Drizzle a half cup of the hot fudge sauce over the pie.",
          "description":"Use a fork or squirt bottle to drizzle it around slowly over the entire pie."
        },
        {
          "headline":"Scoop the vanilla, coffee, and remaining chocolate ice cream on top.",
          "description":"Using a small ice cream scoop, scoop balls of the different flavored ice cream and add them on the pie."
        },
        {
          "headline":"Drizzle the remaining hot fudge sauce over the pie.",
          "description":""
        },
        {
          "headline":"Freeze the ice cream pie for about two hours until firm.",
          "description":""
        },
        {
          "headline":"Allow the pie to sit for about 15-30 minutes before slicing.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Slice the pie with a cutting knife and lay the pieces on a serving plate. Garnish with whipped topping or extra hot fudge sauce. Enjoy!"
        }
      ]
    },
    {
      "name":"Chocolate Candy Bar Ice Cream Pie",
      "steps":[
        {
          "headline":"Spread two tablespoons of hot fudge sauce over the crust.",
          "description":"This prepares the pie crust for chilling and prevents it from cracking."
        },
        {
          "headline":"In a separate bowl, stir the candy bar pieces with the ice cream.",
          "description":"Mix well until fully combined."
        },
        {
          "headline":"Pour the mixture into a pie crust.",
          "description":"Smoothly spread it with a rubber spatula."
        },
        {
          "headline":"Freeze the ice cream pie for about two hours until firm.",
          "description":""
        },
        {
          "headline":"Prepare the whipped cream topping.",
          "description":"Beat the powdered sugar and whipping cream with an electric mixer in a mixing bowl. Continue mixing until light and fluffy, and stiff peaks are visible."
        },
        {
          "headline":"Spread the whipped cream topping and fudge over the pie.",
          "description":"Smoothly spread it around with a rubber spatula. Drizzle the remaining hot fudge sauce over it as well."
        },
        {
          "headline":"Freeze the pie once more for an hour until firm.",
          "description":""
        },
        {
          "headline":"Allow the pie to sit for about 15-30 minutes before slicing.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Slice the pie with a cutting knife and lay the pieces on a serving plate. Garnish with whipped topping or extra hot fudge sauce. Enjoy!"
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Basic Chocolate Ice Cream Pie Beat together the vanilla ice cream and pudding in a large bowl. Whisk well in a large bowl until properly combined. Pour the mixture into the pie crusts.  Freeze the pies for 5-7 hours until the pies are firm.  Allow the pies to sit for ten minutes before slicing.  Serve. Slice the pies with a cutting knife and lay the pieces on a serving plate. Garnish with whipped topping or chocolate syrup. Enjoy! Triple Chocolate Ice Cream Pie Scoop a pint of chocolate ice cream into the pie crust. Spread it around slowly and smoothly with a rubber spatula. Freeze the pie for half an hour until firm.  Drizzle a half cup of the hot fudge sauce over the pie. Use a fork or squirt bottle to drizzle it around slowly over the entire pie. Scoop the vanilla, coffee, and remaining chocolate ice cream on top. Using a small ice cream scoop, scoop balls of the different flavored ice cream and add them on the pie. Drizzle the remaining hot fudge sauce over the pie.  Freeze the ice cream pie for about two hours until firm.  Allow the pie to sit for about 15-30 minutes before slicing.  Serve. Slice the pie with a cutting knife and lay the pieces on a serving plate. Garnish with whipped topping or extra hot fudge sauce. Enjoy! Chocolate Candy Bar Ice Cream Pie Spread two tablespoons of hot fudge sauce over the crust. This prepares the pie crust for chilling and prevents it from cracking. In a separate bowl, stir the candy bar pieces with the ice cream. Mix well until fully combined. Pour the mixture into a pie crust. Smoothly spread it with a rubber spatula. Freeze the ice cream pie for about two hours until firm.  Prepare the whipped cream topping. Beat the powdered sugar and whipping cream with an electric mixer in a mixing bowl. Continue mixing until light and fluffy, and stiff peaks are visible. Spread the whipped cream topping and fudge over the pie. Smoothly spread it around with a rubber spatula. Drizzle the remaining hot fudge sauce over it as well. Freeze the pie once more for an hour until firm.  Allow the pie to sit for about 15-30 minutes before slicing.  Serve. Slice the pie with a cutting knife and lay the pieces on a serving plate. Garnish with whipped topping or extra hot fudge sauce. Enjoy! Finished. ",
  "tyn_model":[
    "hot fudge sauce",
    "chocolate ice cream",
    "cutting knife",
    "serving plate",
    "whipped topping",
    "rubber spatula",
    "ice cream",
    "large bowl",
    "pie crust",
    "extra hot fudge sauce",
    "whipped cream",
    "vanilla ice cream",
    "pie crusts",
    "chocolate syrup",
    "fork",
    "vanilla",
    "coffee",
    "ice cream scoop",
    "ice cream pie",
    "chocolate candy bar ice cream pie",
    "candy bar",
    "powdered sugar",
    "whipping cream",
    "electric mixer",
    "mixing bowl",
    "fudge"
  ],
  "tyn_section":[

  ]
}