{
  "title":"How to Make Sorbet",
  "url":"https://www.wikihow.com/Make-Sorbet",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts",
    "Sorbet and Sherbet"
  ],
  "methods":[
    {
      "name":"Making Your Fruit Base",
      "steps":[
        {
          "headline":"Choose seasonal, fresh fruit.",
          "description":"The fresher and tastier the fruit you choose is, the better your sorbet will taste in the end. Getting local fruit that is very fresh is often the most cost-effective way to get tasty, ripe fruit. The amount of fruit you get will determine how much sorbet you have. In order to make a quart of sorbet, try to get about 2 pounds of fruit (which should yield about 4 cups of puree)."
        },
        {
          "headline":"Select a fruit that is high in fiber or pectin.",
          "description":"While you can make sorbet with any fruit, some fruits (such as citrus and pomegranate) are more challenging for beginners. Fruits that are high in pectin (such as berries) or high in fiber (such as strawberries, peaches, mangoes, or bananas) make getting a creamier sorbet texture easier."
        },
        {
          "headline":"Wash and chop the fruit.",
          "description":"Wash your fruit, remove any tops, cores, seeds, or ends, and cut into smallish pieces. Cutting the fruit ahead of time will make the pureeing process go more smoothly."
        },
        {
          "headline":"Puree the fruit.",
          "description":"Use a food processor or blender to puree your fruit. Make sure that the mixture is free of lumps and remove any errant seeds that got through. You should have about 4 cups of pureed fruit. If you have less, you might want to puree a little more fruit to have the right balance of fruit and sugar."
        },
        {
          "headline":"Strain the mixture.",
          "description":"This step may be optional, depending upon the fruit you’re using and what kind of texture you’d like for your final product. If you want a delicate texture, strain the fruit. If you don’t mind a rougher texture, you can leave the pulp in."
        }
      ]
    },
    {
      "name":"Adding the Sugar",
      "steps":[
        {
          "headline":"Understand the importance of sugar in a sorbet.",
          "description":"The amount of sugar in your sorbet base will determine the texture of your final product. Too much sugar will keep the sorbet from freezing, while too little sugar will leave you with an icy final product. The right amount of sugar in a sorbet also depend on the sugar content of the fruit itself, which is difficult to quantify. The “pros” use a tool called a refractometer that allows for measuring how much sugar is present in a solution. However, you can also just experiment with different batches of sorbet to determine how much sugar works best for you!"
        },
        {
          "headline":"Use a 4:1 ratio.",
          "description":"In general, the best ratio for making sorbet is 4 parts of fruit puree to 1 part sugar. In most recipes, this means 4 cups of pureed fruit to 1 cup of sugar. If you are using a very sweet fruit, you might want to use a bit less sugar. A tart fruit (such as lemon) may require a bit more sugar. It is best to start with the standard 4:1 ratio and then experiment with adding more or less sugar to subsequent batches as you master the art of sorbet."
        },
        {
          "headline":"Decide whether to use simple syrup.",
          "description":"Simple syrup, a mixture of sugar and water, is recommended in many sorbet recipes. Dissolving the sugar in water makes the texture more even and allows it to blend into the pureed fruit more easily. However, some sorbet purists point out that the use of as simple syrup waters down the flavor of sorbet (by adding water). If you do choose to use simple syrup, dissolve 1 cup of sugar into 1 cup boiling (or near-boiling) water. Then allow the solution to cool completely. You can either add the cooled simple syrup to the pureed fruit or add the pureed fruit to simple syrup while it is still hot (in the pan) and allow the mixture to cool together."
        },
        {
          "headline":"Add alcohol if desired.",
          "description":"Alcohol, like sugar, lowers the freezing point of a solution, which affects the texture of sorbet. If you add alcohol, be sure to add it sparingly (too much can keep the sorbet from freezing at all) and be sure that the flavor will complement the fruit in the sorbet. A few ideas are:\nStrawberry with rum (daiquiri, anyone?) Pear with a Riesling wine\nBlackberry with merlot wine\nOrange with chocolate liqueur"
        },
        {
          "headline":"Consider using corn syrup.",
          "description":"Some fruits that are very thin or low in fiber, such as lemon, may freeze into a sorbet more effectively if combined with corn syrup instead of granulated sugar."
        },
        {
          "headline":"Do the “egg float” test.",
          "description":"To determine whether your mixture has the right amount of sugar in it, try floating a (washed and dried) large egg in the pureed fruit and sugar mix. A nickel-sized portion of the egg should be visible. If the egg sinks or a very small amount of the egg is visible, add more sugar to your mixture. If more than a nickel-sized portion of egg is visible, you have too much sugar and you should add more fruit puree, fruit juice, or water to lessen the sugar ratio."
        },
        {
          "headline":"Chill the mixture.",
          "description":"When you have the perfect ratio of fruit and sugar, cool your mixture in the fridge to get it ready to turn into sorbet."
        }
      ]
    },
    {
      "name":"Using an Ice Cream Maker",
      "steps":[
        {
          "headline":"Consult your machine’s manual.",
          "description":"The best way to use an ice cream machine is to follow the instructions that came with the model of machine you purchased. If you do not have the instructions, you can likely find time on the manufacturer’s website. However, the description below should fit most ice cream makers."
        },
        {
          "headline":"Freeze the bowl.",
          "description":"Many ice cream makers come with a bowl that should be frozen completely (usually for 24-hours) prior to making ice cream. Sometimes the bowl has liquid between the inner and outer walls of the bowl that freezes to help keep the product cold. Old-fashioned ice cream makers that do not have a frozen bowl may have a stainless steel (or other metal) bowl that sits inside a bucket of ice and rock salt. The salt helps melt the ice, which makes for a colder environment around the outside of the bowl."
        },
        {
          "headline":"Place the bowl into the machine and add the paddle or stirrer.",
          "description":"Most ice cream machines have a detachable paddle that stirs the mixture inside. Put the paddle in place per the manufacturer’s instructions."
        },
        {
          "headline":"Pour the sorbet mixture in the bowl.",
          "description":"Remove the sorbet mixture from your refrigerator (where it has been cooling) and carefully pour it into the ice cream maker bowl."
        },
        {
          "headline":"Turn the machine on.",
          "description":"The ice cream maker should do most (if not all) of the work for you. Turn it on and it will spin for a set amount of time or until the mixture is frozen. Some models have a timer on them for a pre-determined length of mixing time, while others will automatically shut off once they meet a certain amount of resistance (caused by the frozen mixture)."
        },
        {
          "headline":"Re-freeze the mixture for a firmer texture.",
          "description":"Depending on your machine, your sorbet may be very soft when it finishes mixing. If this is the case, you may want to place the sorbet in an air-tight container and put it in your freezer to harden."
        }
      ]
    },
    {
      "name":"Freezing Sorbet Without an Ice Cream Maker",
      "steps":[
        {
          "headline":"Freeze the mixture.",
          "description":"Once you have made your fruit puree and sugar mixture, place it in the freezer. You might want to remove it from the freezer to stir it occasionally as it freezes. Otherwise, you can just let it freeze hard."
        },
        {
          "headline":"Remove the frozen mixture and blend it.",
          "description":"Remove the frozen sorbet mixture from the freezer and blend it. You can use a blender, a food processor, or a stand mixer. Whatever you use, you may need to let it thaw slightly before it will cooperate with the blending process."
        },
        {
          "headline":"Re-freeze the mixture.",
          "description":"Once you have blended the frozen mixture, freeze it again. This should give you a product with a consistency that is more like sorbet from an ice cream machine."
        }
      ]
    },
    {
      "name":"Serving the Sorbet",
      "steps":[
        {
          "headline":"Eat as soon as possible.",
          "description":"The fresher the sorbet is, the better it will taste. You should eat it within a week of making it, but it will be best the day that you make it."
        },
        {
          "headline":"Scoop into small bowls.",
          "description":"While some people may want to eat an entire quart of sorbet right out of the carton with a spoon, if you’re serving guests, you’ll likely want to make your presentation nice. You can scoop the ice cream out with an ice cream scoop or large spoon."
        },
        {
          "headline":"Garnish if desired.",
          "description":"If you want to get fancy, garnish your sorbet. You can place a whole piece of fruit on top, garnish with a sprig of mint or another herb, or drizzle with a colorful syrup or reduction."
        },
        {
          "headline":"Store in an air-tight container.",
          "description":"You can store your sorbet for up to a week. It is best if stored in the back of your freezer, behind other food items and away from the door to regulate the temperature more effectively."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making Your Fruit Base Choose seasonal, fresh fruit. The fresher and tastier the fruit you choose is, the better your sorbet will taste in the end. Getting local fruit that is very fresh is often the most cost-effective way to get tasty, ripe fruit. The amount of fruit you get will determine how much sorbet you have. In order to make a quart of sorbet, try to get about 2 pounds of fruit (which should yield about 4 cups of puree). Select a fruit that is high in fiber or pectin. While you can make sorbet with any fruit, some fruits (such as citrus and pomegranate) are more challenging for beginners. Fruits that are high in pectin (such as berries) or high in fiber (such as strawberries, peaches, mangoes, or bananas) make getting a creamier sorbet texture easier. Wash and chop the fruit. Wash your fruit, remove any tops, cores, seeds, or ends, and cut into smallish pieces. Cutting the fruit ahead of time will make the pureeing process go more smoothly. Puree the fruit. Use a food processor or blender to puree your fruit. Make sure that the mixture is free of lumps and remove any errant seeds that got through. You should have about 4 cups of pureed fruit. If you have less, you might want to puree a little more fruit to have the right balance of fruit and sugar. Strain the mixture. This step may be optional, depending upon the fruit you’re using and what kind of texture you’d like for your final product. If you want a delicate texture, strain the fruit. If you don’t mind a rougher texture, you can leave the pulp in. Adding the Sugar Understand the importance of sugar in a sorbet. The amount of sugar in your sorbet base will determine the texture of your final product. Too much sugar will keep the sorbet from freezing, while too little sugar will leave you with an icy final product. The right amount of sugar in a sorbet also depend on the sugar content of the fruit itself, which is difficult to quantify. The “pros” use a tool called a refractometer that allows for measuring how much sugar is present in a solution. However, you can also just experiment with different batches of sorbet to determine how much sugar works best for you! Use a 4:1 ratio. In general, the best ratio for making sorbet is 4 parts of fruit puree to 1 part sugar. In most recipes, this means 4 cups of pureed fruit to 1 cup of sugar. If you are using a very sweet fruit, you might want to use a bit less sugar. A tart fruit (such as lemon) may require a bit more sugar. It is best to start with the standard 4:1 ratio and then experiment with adding more or less sugar to subsequent batches as you master the art of sorbet. Decide whether to use simple syrup. Simple syrup, a mixture of sugar and water, is recommended in many sorbet recipes. Dissolving the sugar in water makes the texture more even and allows it to blend into the pureed fruit more easily. However, some sorbet purists point out that the use of as simple syrup waters down the flavor of sorbet (by adding water). If you do choose to use simple syrup, dissolve 1 cup of sugar into 1 cup boiling (or near-boiling) water. Then allow the solution to cool completely. You can either add the cooled simple syrup to the pureed fruit or add the pureed fruit to simple syrup while it is still hot (in the pan) and allow the mixture to cool together. Add alcohol if desired. Alcohol, like sugar, lowers the freezing point of a solution, which affects the texture of sorbet. If you add alcohol, be sure to add it sparingly (too much can keep the sorbet from freezing at all) and be sure that the flavor will complement the fruit in the sorbet. A few ideas are:\nStrawberry with rum (daiquiri, anyone?) Pear with a Riesling wine\nBlackberry with merlot wine\nOrange with chocolate liqueur Consider using corn syrup. Some fruits that are very thin or low in fiber, such as lemon, may freeze into a sorbet more effectively if combined with corn syrup instead of granulated sugar. Do the “egg float” test. To determine whether your mixture has the right amount of sugar in it, try floating a (washed and dried) large egg in the pureed fruit and sugar mix. A nickel-sized portion of the egg should be visible. If the egg sinks or a very small amount of the egg is visible, add more sugar to your mixture. If more than a nickel-sized portion of egg is visible, you have too much sugar and you should add more fruit puree, fruit juice, or water to lessen the sugar ratio. Chill the mixture. When you have the perfect ratio of fruit and sugar, cool your mixture in the fridge to get it ready to turn into sorbet. Using an Ice Cream Maker Consult your machine’s manual. The best way to use an ice cream machine is to follow the instructions that came with the model of machine you purchased. If you do not have the instructions, you can likely find time on the manufacturer’s website. However, the description below should fit most ice cream makers. Freeze the bowl. Many ice cream makers come with a bowl that should be frozen completely (usually for 24-hours) prior to making ice cream. Sometimes the bowl has liquid between the inner and outer walls of the bowl that freezes to help keep the product cold. Old-fashioned ice cream makers that do not have a frozen bowl may have a stainless steel (or other metal) bowl that sits inside a bucket of ice and rock salt. The salt helps melt the ice, which makes for a colder environment around the outside of the bowl. Place the bowl into the machine and add the paddle or stirrer. Most ice cream machines have a detachable paddle that stirs the mixture inside. Put the paddle in place per the manufacturer’s instructions. Pour the sorbet mixture in the bowl. Remove the sorbet mixture from your refrigerator (where it has been cooling) and carefully pour it into the ice cream maker bowl. Turn the machine on. The ice cream maker should do most (if not all) of the work for you. Turn it on and it will spin for a set amount of time or until the mixture is frozen. Some models have a timer on them for a pre-determined length of mixing time, while others will automatically shut off once they meet a certain amount of resistance (caused by the frozen mixture). Re-freeze the mixture for a firmer texture. Depending on your machine, your sorbet may be very soft when it finishes mixing. If this is the case, you may want to place the sorbet in an air-tight container and put it in your freezer to harden. Freezing Sorbet Without an Ice Cream Maker Freeze the mixture. Once you have made your fruit puree and sugar mixture, place it in the freezer. You might want to remove it from the freezer to stir it occasionally as it freezes. Otherwise, you can just let it freeze hard. Remove the frozen mixture and blend it. Remove the frozen sorbet mixture from the freezer and blend it. You can use a blender, a food processor, or a stand mixer. Whatever you use, you may need to let it thaw slightly before it will cooperate with the blending process. Re-freeze the mixture. Once you have blended the frozen mixture, freeze it again. This should give you a product with a consistency that is more like sorbet from an ice cream machine. Serving the Sorbet Eat as soon as possible. The fresher the sorbet is, the better it will taste. You should eat it within a week of making it, but it will be best the day that you make it. Scoop into small bowls. While some people may want to eat an entire quart of sorbet right out of the carton with a spoon, if you’re serving guests, you’ll likely want to make your presentation nice. You can scoop the ice cream out with an ice cream scoop or large spoon. Garnish if desired. If you want to get fancy, garnish your sorbet. You can place a whole piece of fruit on top, garnish with a sprig of mint or another herb, or drizzle with a colorful syrup or reduction. Store in an air-tight container. You can store your sorbet for up to a week. It is best if stored in the back of your freezer, behind other food items and away from the door to regulate the temperature more effectively. Finished. ",
  "tyn_model":[
    "sugar",
    "sorbet",
    "fruit",
    "simple syrup",
    "water",
    "bowl",
    "freezer",
    "ice cream maker",
    "alcohol",
    "ice cream",
    "ice cream makers",
    "food processor",
    "blender",
    "corn syrup",
    "fruit puree",
    "air-tight container",
    "citrus",
    "berries",
    "strawberries",
    "bananas",
    "“pros",
    "” use",
    "sorbet purists",
    "strawberry",
    "rum",
    "riesling wine",
    "blackberry",
    "merlot wine",
    "orange",
    "chocolate liqueur",
    "lemon",
    "granulated sugar",
    "“egg",
    "” test",
    "egg",
    "fruit juice",
    "ice and rock salt",
    "salt",
    "stirrer",
    "ice cream machines",
    "stand mixer",
    "ice cream machine",
    "bowls",
    "spoon",
    "ice cream scoop",
    "mint",
    "colorful syrup"
  ],
  "tyn_section":[

  ]
}