{
  "title":"How to Make a Chocolate Syrup Treat",
  "url":"https://www.wikihow.com/Make-a-Chocolate-Syrup-Treat",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Syrups"
  ],
  "steps":[
    {
      "headline":"Get a big bowl.",
      "description":""
    },
    {
      "headline":"Layer Oreos in the bottom.",
      "description":""
    },
    {
      "headline":"Put a lot of ice cream on top.",
      "description":""
    },
    {
      "headline":"On top of the ice cream, squirt a whole lot of chocolate syrup.",
      "description":""
    },
    {
      "headline":"Make a whipped cream mixture in a separate bowl.",
      "description":"Fill it with whipped cream. Stir in M&Ms, rainbow sprinkles, chocolate sprinkles and crushed Oreos."
    },
    {
      "headline":"Pour the whipped cream mixture into the big bowl.",
      "description":""
    },
    {
      "headline":"Freeze the big bowl for an hour.",
      "description":""
    },
    {
      "headline":"Take it out, and let it heat up for 5 seconds in the microwave, or until at cold temperature, not freezing.",
      "description":""
    },
    {
      "headline":"Cut it like pie and serve in plates.",
      "description":"Now you can eat it."
    }
  ],
  "text":" Get a big bowl.  Layer Oreos in the bottom.  Put a lot of ice cream on top.  On top of the ice cream, squirt a whole lot of chocolate syrup.  Make a whipped cream mixture in a separate bowl. Fill it with whipped cream. Stir in M&Ms, rainbow sprinkles, chocolate sprinkles and crushed Oreos. Pour the whipped cream mixture into the big bowl.  Freeze the big bowl for an hour.  Take it out, and let it heat up for 5 seconds in the microwave, or until at cold temperature, not freezing.  Cut it like pie and serve in plates. Now you can eat it.",
  "tyn_model":[
    "whipped cream",
    "ice cream",
    "bowl",
    "chocolate syrup",
    "rainbow sprinkles",
    "chocolate sprinkles",
    "oreos",
    "microwave",
    "plates"
  ],
  "tyn_section":[

  ]
}