{
  "title":"How to Make Espresso Vodka",
  "url":"https://www.wikihow.com/Make-Espresso-Vodka",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Infused Spirits and Liqueurs"
  ],
  "steps":[
    {
      "headline":"Assemble the ingredients and items needed.",
      "description":""
    },
    {
      "headline":"Pour the espresso into the saucepan.",
      "description":"Heat over a moderate heat."
    },
    {
      "headline":"Add the sugar.",
      "description":"Stir constantly until it dissolves."
    },
    {
      "headline":"Remove from the heat once the sugar has dissolved.",
      "description":"Set aside to cool."
    },
    {
      "headline":"Once cooled, pour in the vodka and vanilla.",
      "description":"Mix briefly. If using the vanilla pod, leave until the next step."
    },
    {
      "headline":"Pour the vodka coffee mixture into the glass jar.",
      "description":"Store in a dark and dry place for a minimum of 48 hours. Store longer if wished/possible. The longer it is stored, the longer it infuses."
    },
    {
      "headline":"Strain the liquid into the storage bottle.",
      "description":"Keep with the rest of your alcohol until needed."
    },
    {
      "headline":"Serve.",
      "description":"Add to cocktails, coffee, desserts or drink neat."
    }
  ],
  "text":" Assemble the ingredients and items needed.  Pour the espresso into the saucepan. Heat over a moderate heat. Add the sugar. Stir constantly until it dissolves. Remove from the heat once the sugar has dissolved. Set aside to cool. Once cooled, pour in the vodka and vanilla. Mix briefly. If using the vanilla pod, leave until the next step. Pour the vodka coffee mixture into the glass jar. Store in a dark and dry place for a minimum of 48 hours. Store longer if wished/possible. The longer it is stored, the longer it infuses. Strain the liquid into the storage bottle. Keep with the rest of your alcohol until needed. Serve. Add to cocktails, coffee, desserts or drink neat.",
  "tyn_model":[
    "sugar",
    "vanilla",
    "espresso",
    "saucepan",
    "vodka",
    "vodka coffee",
    "glass jar",
    "storage bottle",
    "alcohol"
  ],
  "tyn_section":[

  ]
}