{
  "title":"How to Make a Homemade Twix Candy Bar",
  "url":"https://www.wikihow.com/Make-a-Homemade-Twix-Candy-Bar",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy"
  ],
  "steps":[
    {
      "headline":"Beat the butter, sugar, and egg until the mixture is light and fluffy.",
      "description":""
    },
    {
      "headline":"Add the vanilla extract, flour and salt.",
      "description":"Mix until the dough is workable."
    },
    {
      "headline":"Refrigerate the dough until it is firm.",
      "description":""
    },
    {
      "headline":"Take out the dough from the refrigerator, several hours later.",
      "description":"Roll the dough to an even height, about the same height as shortbread cookies."
    },
    {
      "headline":"Preheat an oven to 300 °F (150 °C).",
      "description":""
    },
    {
      "headline":"Bake the dough for 10-15 minutes.",
      "description":""
    },
    {
      "headline":"Flip the baked dough over.",
      "description":"Bake the dough for an additional 10-15 minutes."
    },
    {
      "headline":"Take the shortbread dough out of the oven and set to the side.",
      "description":"Turn off the oven."
    },
    {
      "headline":"Clean the bowls you used to prepare the shortbread dough.",
      "description":""
    },
    {
      "headline":"Place and mix together the caramels, milk and a dash of salt.",
      "description":""
    },
    {
      "headline":"Microwave the caramels for a maximum of one minute.",
      "description":""
    },
    {
      "headline":"Remove and stir the mixture until it is melted.",
      "description":""
    },
    {
      "headline":"Pour the warm caramel over the shortbread.",
      "description":""
    },
    {
      "headline":"Cut the shortbread and caramel cookie into thin strips that are 1/2\" x 3\" (1.5 cm x 7.5 cm).",
      "description":"Arrange the strips on a cookie sheet lined with parchment paper."
    },
    {
      "headline":"Freeze the pieces for a few hours, to firm them up.",
      "description":""
    },
    {
      "headline":"Clean your utensils once again and reuse.",
      "description":""
    },
    {
      "headline":"Mix together the tempered chocolate chips along with a teaspoon of shortening and butter.",
      "description":""
    },
    {
      "headline":"Dip each bar into the chocolate mixture.",
      "description":"Make sure it coats the entire piece (including the bottom of the bar)."
    },
    {
      "headline":"Use a whisking brush to coat the top side and sides of the bars.",
      "description":""
    },
    {
      "headline":"Allow the Twix bars to set.",
      "description":"Do not attempt to move them from the cookie sheet until they are completely set."
    },
    {
      "headline":"Enjoy your homemade Twix candy bar.",
      "description":""
    }
  ],
  "text":" Beat the butter, sugar, and egg until the mixture is light and fluffy.  Add the vanilla extract, flour and salt. Mix until the dough is workable. Refrigerate the dough until it is firm.  Take out the dough from the refrigerator, several hours later. Roll the dough to an even height, about the same height as shortbread cookies. Preheat an oven to 300 °F (150 °C).  Bake the dough for 10-15 minutes.  Flip the baked dough over. Bake the dough for an additional 10-15 minutes. Take the shortbread dough out of the oven and set to the side. Turn off the oven. Clean the bowls you used to prepare the shortbread dough.  Place and mix together the caramels, milk and a dash of salt.  Microwave the caramels for a maximum of one minute.  Remove and stir the mixture until it is melted.  Pour the warm caramel over the shortbread.  Cut the shortbread and caramel cookie into thin strips that are 1/2\" x 3\" (1.5 cm x 7.5 cm). Arrange the strips on a cookie sheet lined with parchment paper. Freeze the pieces for a few hours, to firm them up.  Clean your utensils once again and reuse.  Mix together the tempered chocolate chips along with a teaspoon of shortening and butter.  Dip each bar into the chocolate mixture. Make sure it coats the entire piece (including the bottom of the bar). Use a whisking brush to coat the top side and sides of the bars.  Allow the Twix bars to set. Do not attempt to move them from the cookie sheet until they are completely set. Enjoy your homemade Twix candy bar. ",
  "tyn_model":[
    "oven",
    "butter",
    "salt",
    "sugar",
    "vanilla extract",
    "flour",
    "refrigerator",
    "shortbread cookies",
    "shortbread dough",
    "bowls",
    "caramels",
    "milk",
    "caramel",
    "caramel cookie",
    "cookie sheet",
    "parchment paper",
    "utensils",
    "chocolate chips",
    "shortening",
    "chocolate",
    "whisking brush",
    "twix bars",
    "twix candy bar"
  ],
  "tyn_section":[

  ]
}