{
  "title":"How to Cook Malai Kofta",
  "url":"https://www.wikihow.com/Cook-Malai-Kofta",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Vegetarian Indian Dishes"
  ],
  "methods":[
    {
      "name":"Making the Kofta",
      "steps":[
        {
          "headline":"Strain the water from the paneer.",
          "description":"This may take a few hours, so prepare enough in advance."
        },
        {
          "headline":"Mix the paneer.",
          "description":"Mix it with all of the ingredients specified in the kofta section of the ingredients list above, except for the oil and additional flour for rolling."
        },
        {
          "headline":"Shape the mixture into balls.",
          "description":"Roll them in about 3 tbsp. of flour."
        },
        {
          "headline":"Heat the oil in a deep frying pan.",
          "description":"Heat until the consistency of the oil is similar to that of water. Fry 3 or 4 balls at a time until they are a golden brown. Remove and place on kitchen paper to soak up some of the fat."
        }
      ]
    },
    {
      "name":"Sauce",
      "steps":[
        {
          "headline":"Combine the masala and water in a pan.",
          "description":"Cook at medium high heat."
        },
        {
          "headline":"Add the remaining ingredients.",
          "description":"When the masala mixture begins to boil, stir in the rest of the ingredients specified in the gravy section of the ingredients list, except for the chopped coriander."
        },
        {
          "headline":"Stir the mixture.",
          "description":"Then reduce the heat to low and cook for 10 minutes. Add the kofta (paneer balls) and turn off the heat."
        },
        {
          "headline":"Garnish the dish.",
          "description":"Sprinkle with the chopped coriander. Serve with steamed rice and the bread of choice."
        }
      ]
    }
  ],
  "text":" Making the Kofta Strain the water from the paneer. This may take a few hours, so prepare enough in advance. Mix the paneer. Mix it with all of the ingredients specified in the kofta section of the ingredients list above, except for the oil and additional flour for rolling. Shape the mixture into balls. Roll them in about 3 tbsp. of flour. Heat the oil in a deep frying pan. Heat until the consistency of the oil is similar to that of water. Fry 3 or 4 balls at a time until they are a golden brown. Remove and place on kitchen paper to soak up some of the fat. Sauce Combine the masala and water in a pan. Cook at medium high heat. Add the remaining ingredients. When the masala mixture begins to boil, stir in the rest of the ingredients specified in the gravy section of the ingredients list, except for the chopped coriander. Stir the mixture. Then reduce the heat to low and cook for 10 minutes. Add the kofta (paneer balls) and turn off the heat. Garnish the dish. Sprinkle with the chopped coriander. Serve with steamed rice and the bread of choice.",
  "tyn_model":[
    "water",
    "oil",
    "paneer",
    "flour",
    "coriander",
    "deep frying pan",
    "kitchen paper",
    "pan",
    "steamed rice"
  ],
  "tyn_section":[

  ]
}