{
  "title":"How to Repair a Washerless Faucet",
  "url":"https://www.wikihow.com/Repair-a-Washerless-Faucet",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Getting Started",
      "steps":[
        {
          "headline":"Shut off the water.",
          "description":"Look under your sink for a water shutoff valve. Turn it to the closed position, and test the faucet to make sure the water is not flowing. If you are repairing a bath faucet, shut off the house water supply at the main valve. You may also need to remove the spout or handles to reveal the faucet mechanism,."
        },
        {
          "headline":"Plug the sink drain.",
          "description":"Stuff a rag or other object into the drain to prevent small parts from falling into the pipes."
        },
        {
          "headline":"Consider buying a repair kit.",
          "description":"Most washerless faucet leaks require a replacement part to fix. If you know your faucet manufacturer, you can order a repair kit that contains all the parts you need. Otherwise, you will need to disassemble your faucet and take the faulty part to a hardware or plumbing store to identify and order."
        },
        {
          "headline":"Move on to the instructions that match your faucet.",
          "description":"There are several types of washerless faucet. The faucet will be easier to identify once you've removed the handle. Ball faucets have a single handle that rotates over a ball. One handled faucets on a cylinder may be cartridge or ceramic disk faucets. The cartridge is more likely as it needs repairs more often, so start with those instructions. If they don't match what you see, try the ceramic disk instructions. Two handled washerless faucets are cartridge faucets."
        }
      ]
    },
    {
      "name":"Ball Faucet",
      "steps":[
        {
          "headline":"Remove the handle.",
          "description":"Unscrew the handle and set it aside. You should see a metal cap with a small threaded washer (the adjusting ring) set into it."
        },
        {
          "headline":"Repair a leaking handle.",
          "description":"If the water leaks from the handle, you can usually fix the problem quickly:\nPlace a kitchen knife or putty knife into the slots on top of the washer. (If necessary, you can buy a repair kit with a special tool for this purpose.) Turn the ring a short distance clockwise. Replace the handle and turn on the water. If the handle still drips, turn off water and tighten further. Tighten in small movements only. Overtightening can make the handle difficult to turn."
        },
        {
          "headline":"Consider a full replacement.",
          "description":"If the leak comes from the spout, or if adjusting the washer didn't fix the problem, consider buying a new faucet. Ball faucets are difficult to repair and do not have a long lifespan compared to other options. Removing the whole thing and installing a new one is much easier. If you do decide to repair it yourself, continue on to the next step."
        },
        {
          "headline":"Disassemble the faucet.",
          "description":"Leaks coming from the spout happen due to corroded or broken parts further down in the faucet. Carefully remove each of the following, noting (or photographing) how the parts fit together:\nRemove the top metal cap and collar with slip-joint pliers, then lift out the spout. Lift out the plastic cam and cam washer. If you cannot remove this with pliers, your faucet may require a special tool from a repair kit. Remove the ball."
        },
        {
          "headline":"Inspect the ball for wear.",
          "description":"If the ball looks pitted or corroded, it needs replacement. You must find a part exactly the same size, but it does not need to be the same material. Plastic balls are cheaper, while brass balls last longer. If the ball looks fine apart from slight mineral buildup, dissolve the mineral with a few drops of distilled white vinegar and scrub with a plastic scouring pad. Even if the ball is corroded, inspect the other parts as described below. More than one part may need replacement."
        },
        {
          "headline":"Carefully remove the valve seats and springs.",
          "description":"The ball sits on top of valves that control the water flow. Carefully remove the two valve seats with needle-nose pliers or a pencil. A spring should pop out as you remove each one. If a valve seat or spring shows signs of wear, you will need to replace that part."
        },
        {
          "headline":"Inspect the O-rings.",
          "description":"The final parts that tend to wear down are the O-rings at the base of the faucet body. If these are corroded, cut them off and replace them with new O-rings. Coat the new O-rings in nontoxic, heat-proof plumber's grease before sliding them on."
        },
        {
          "headline":"Reassemble the faucet.",
          "description":"Once all parts are cleaned or replaced, reassemble the parts in the reverse order you removed them. Pay special attention at these points:\nLine up the slot or mark on the ball with the notch on the faucet body. Line up the lug on the cam with the same notch. To reinstall the spout, twist while pushing down hard."
        },
        {
          "headline":"Make final corrections.",
          "description":"If the spout still leaks, make sure each part is tight. If the handle leaks, tighten the adjustment ring at the top of the mechanism, as described at the start of this section."
        }
      ]
    },
    {
      "name":"Cartridge Faucet",
      "steps":[
        {
          "headline":"Remove the cap, handle, and spout.",
          "description":"Pry off the top cap with a screwdriver; the screw will usually be underneath this cap. Unscrew the handle, then pull it back and upward to remove it. Pull away the spout as well. You may need to lever out the handle with a screwdriver. Take care not to apply too much force, or the handle will break."
        },
        {
          "headline":"Look for retaining clips or nuts.",
          "description":"The cartridge inside is a cylinder tapering to a thin stem pointed upward. Depending on your model, you may need to remove one or more of the following before you can get to it:\nA retaining nut above the cartridge, removable with slip joint pliers. A horizontal metal clip holding the cartridge down. This may be removable by hand or small pliers. A tiny plastic retaining clip at the base or side of the cartridge. Use needlenose pliers to pull this out carefully. Note its position so you can reinstall it later."
        },
        {
          "headline":"Note the position of the cartridge.",
          "description":"Look for identifying features on the cartridge, such as a tab or notch. Make a note of their position compared to the notches on the faucet body underneath it. If you later reinstall the cartridge in a 180º position, you could switch the hot and cold taps."
        },
        {
          "headline":"Remove the cartridge.",
          "description":"Grip the stem of the cartridge with a pair of pliers. Attempt to twist and lift without using excessive force. Some cartridges require a special tool to remove, ordered from a plumbing parts store."
        },
        {
          "headline":"Replace damaged O-rings.",
          "description":"There are usually several O-rings along the body of the cartridge, plus a couple more on the faucet body. If any of these show signs of wear, replace them:\nCut away the old O-rings. Apply nontoxic, heatproof plumber's grease to the new O-rings. Slide the O-rings over the cartridge or faucet body to the same position."
        },
        {
          "headline":"Reassemble the faucet.",
          "description":"Line up the cartridge in the position you noted and push it down to fit into the faucet body. Reassemble the other parts on top of the cartridge."
        }
      ]
    },
    {
      "name":"Ceramic Disk Faucet",
      "steps":[
        {
          "headline":"Remove the handle and cap.",
          "description":"You may need to tilt the handle back or remove a decorative cap to reveal the screw. Unscrew the handle, remove it, then remove the escutcheon cap underneath. Some faucets have a locking nut you'll have to remove as well."
        },
        {
          "headline":"Unscrew the cylinder.",
          "description":"You should see a cylinder with a protruding stem. Loosen the two screws fastening this in place, and lift the whole assembly out. Note the position of the cylinder, as the base has inlet holes which must match the holes underneath it. If the cylinder does not lift easily, try cleaning its edges with a few drops of distilled white vinegar. If that still doesn't work, you can get a special extraction tool for this purpose from a plumbing store."
        },
        {
          "headline":"Inspect the O-rings or seals.",
          "description":"Two-handled ceramic disk faucets usually have a simple O-ring around the cylinder, plus a seal and spring underneath. One-handled ceramic disk faucets usually have three seals underneath the cylinder. Corroded O-rings can be replaced with a new O-ring after greasing it with nontoxic, heatproof plumber's grease. The seals can be more of a pain to work with, but you can install them in much the same way if they are damaged. Take the old seals to a hardware store to ask for replacement.s"
        },
        {
          "headline":"Consider replacing the ceramic disk assembly.",
          "description":"The cylinder and the disk inside it are sturdy and rarely need replacement. However, replacements are usually cheap, and just need to be screwed in. If you can't find the source of the problem, or just don't want to deal with the tiny seals, order a replacement with the exact same dimensions and shape."
        },
        {
          "headline":"Clean the cylinder openings if necessary.",
          "description":"If there is mineral buildup on the cylinder, clean the openings with distilled white vinegar and a plastic scouring pad. Rinse thoroughly."
        },
        {
          "headline":"Reassemble.",
          "description":"Insert each component in the reverse order you disassembled them. Make sure all connections are tight."
        },
        {
          "headline":"Restore water carefully.",
          "description":"A rapid increase in water pressure could fracture the disk inside the cylinder. Move the faucet to the \"on\" position, then turn on the water valve gradually."
        }
      ]
    }
  ],
  "text":" Getting Started Shut off the water. Look under your sink for a water shutoff valve. Turn it to the closed position, and test the faucet to make sure the water is not flowing. If you are repairing a bath faucet, shut off the house water supply at the main valve. You may also need to remove the spout or handles to reveal the faucet mechanism,. Plug the sink drain. Stuff a rag or other object into the drain to prevent small parts from falling into the pipes. Consider buying a repair kit. Most washerless faucet leaks require a replacement part to fix. If you know your faucet manufacturer, you can order a repair kit that contains all the parts you need. Otherwise, you will need to disassemble your faucet and take the faulty part to a hardware or plumbing store to identify and order. Move on to the instructions that match your faucet. There are several types of washerless faucet. The faucet will be easier to identify once you've removed the handle. Ball faucets have a single handle that rotates over a ball. One handled faucets on a cylinder may be cartridge or ceramic disk faucets. The cartridge is more likely as it needs repairs more often, so start with those instructions. If they don't match what you see, try the ceramic disk instructions. Two handled washerless faucets are cartridge faucets. Ball Faucet Remove the handle. Unscrew the handle and set it aside. You should see a metal cap with a small threaded washer (the adjusting ring) set into it. Repair a leaking handle. If the water leaks from the handle, you can usually fix the problem quickly:\nPlace a kitchen knife or putty knife into the slots on top of the washer. (If necessary, you can buy a repair kit with a special tool for this purpose.) Turn the ring a short distance clockwise. Replace the handle and turn on the water. If the handle still drips, turn off water and tighten further. Tighten in small movements only. Overtightening can make the handle difficult to turn. Consider a full replacement. If the leak comes from the spout, or if adjusting the washer didn't fix the problem, consider buying a new faucet. Ball faucets are difficult to repair and do not have a long lifespan compared to other options. Removing the whole thing and installing a new one is much easier. If you do decide to repair it yourself, continue on to the next step. Disassemble the faucet. Leaks coming from the spout happen due to corroded or broken parts further down in the faucet. Carefully remove each of the following, noting (or photographing) how the parts fit together:\nRemove the top metal cap and collar with slip-joint pliers, then lift out the spout. Lift out the plastic cam and cam washer. If you cannot remove this with pliers, your faucet may require a special tool from a repair kit. Remove the ball. Inspect the ball for wear. If the ball looks pitted or corroded, it needs replacement. You must find a part exactly the same size, but it does not need to be the same material. Plastic balls are cheaper, while brass balls last longer. If the ball looks fine apart from slight mineral buildup, dissolve the mineral with a few drops of distilled white vinegar and scrub with a plastic scouring pad. Even if the ball is corroded, inspect the other parts as described below. More than one part may need replacement. Carefully remove the valve seats and springs. The ball sits on top of valves that control the water flow. Carefully remove the two valve seats with needle-nose pliers or a pencil. A spring should pop out as you remove each one. If a valve seat or spring shows signs of wear, you will need to replace that part. Inspect the O-rings. The final parts that tend to wear down are the O-rings at the base of the faucet body. If these are corroded, cut them off and replace them with new O-rings. Coat the new O-rings in nontoxic, heat-proof plumber's grease before sliding them on. Reassemble the faucet. Once all parts are cleaned or replaced, reassemble the parts in the reverse order you removed them. Pay special attention at these points:\nLine up the slot or mark on the ball with the notch on the faucet body. Line up the lug on the cam with the same notch. To reinstall the spout, twist while pushing down hard. Make final corrections. If the spout still leaks, make sure each part is tight. If the handle leaks, tighten the adjustment ring at the top of the mechanism, as described at the start of this section. Cartridge Faucet Remove the cap, handle, and spout. Pry off the top cap with a screwdriver; the screw will usually be underneath this cap. Unscrew the handle, then pull it back and upward to remove it. Pull away the spout as well. You may need to lever out the handle with a screwdriver. Take care not to apply too much force, or the handle will break. Look for retaining clips or nuts. The cartridge inside is a cylinder tapering to a thin stem pointed upward. Depending on your model, you may need to remove one or more of the following before you can get to it:\nA retaining nut above the cartridge, removable with slip joint pliers. A horizontal metal clip holding the cartridge down. This may be removable by hand or small pliers. A tiny plastic retaining clip at the base or side of the cartridge. Use needlenose pliers to pull this out carefully. Note its position so you can reinstall it later. Note the position of the cartridge. Look for identifying features on the cartridge, such as a tab or notch. Make a note of their position compared to the notches on the faucet body underneath it. If you later reinstall the cartridge in a 180º position, you could switch the hot and cold taps. Remove the cartridge. Grip the stem of the cartridge with a pair of pliers. Attempt to twist and lift without using excessive force. Some cartridges require a special tool to remove, ordered from a plumbing parts store. Replace damaged O-rings. There are usually several O-rings along the body of the cartridge, plus a couple more on the faucet body. If any of these show signs of wear, replace them:\nCut away the old O-rings. Apply nontoxic, heatproof plumber's grease to the new O-rings. Slide the O-rings over the cartridge or faucet body to the same position. Reassemble the faucet. Line up the cartridge in the position you noted and push it down to fit into the faucet body. Reassemble the other parts on top of the cartridge. Ceramic Disk Faucet Remove the handle and cap. You may need to tilt the handle back or remove a decorative cap to reveal the screw. Unscrew the handle, remove it, then remove the escutcheon cap underneath. Some faucets have a locking nut you'll have to remove as well. Unscrew the cylinder. You should see a cylinder with a protruding stem. Loosen the two screws fastening this in place, and lift the whole assembly out. Note the position of the cylinder, as the base has inlet holes which must match the holes underneath it. If the cylinder does not lift easily, try cleaning its edges with a few drops of distilled white vinegar. If that still doesn't work, you can get a special extraction tool for this purpose from a plumbing store. Inspect the O-rings or seals. Two-handled ceramic disk faucets usually have a simple O-ring around the cylinder, plus a seal and spring underneath. One-handled ceramic disk faucets usually have three seals underneath the cylinder. Corroded O-rings can be replaced with a new O-ring after greasing it with nontoxic, heatproof plumber's grease. The seals can be more of a pain to work with, but you can install them in much the same way if they are damaged. Take the old seals to a hardware store to ask for replacement.s Consider replacing the ceramic disk assembly. The cylinder and the disk inside it are sturdy and rarely need replacement. However, replacements are usually cheap, and just need to be screwed in. If you can't find the source of the problem, or just don't want to deal with the tiny seals, order a replacement with the exact same dimensions and shape. Clean the cylinder openings if necessary. If there is mineral buildup on the cylinder, clean the openings with distilled white vinegar and a plastic scouring pad. Rinse thoroughly. Reassemble. Insert each component in the reverse order you disassembled them. Make sure all connections are tight. Restore water carefully. A rapid increase in water pressure could fracture the disk inside the cylinder. Move the faucet to the \"on\" position, then turn on the water valve gradually.",
  "tyn_model":[
    "water",
    "faucet",
    "pliers",
    "plumber's grease",
    "washerless faucet",
    "ceramic disk",
    "washer",
    "faucets",
    "distilled white vinegar",
    "plastic scouring pad",
    "screwdriver",
    "kitchen knife",
    "putty knife",
    "slip-joint pliers",
    "needle-nose pliers",
    "pencil",
    "cartridge faucet",
    "slip joint pliers",
    "needlenose pliers",
    "ceramic disk faucet",
    "escutcheon cap",
    "ceramic disk faucets",
    "white vinegar"
  ],
  "tyn_section":[

  ]
}