{
  "title":"How to Cook Shirataki Noodles",
  "url":"https://www.wikihow.com/Cook-Shirataki-Noodles",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles"
  ],
  "parts":[
    {
      "name":"Boiling the Noodles",
      "steps":[
        {
          "headline":"Open the packaging.",
          "description":"Remove some packages by pulling the plastic away at any spot that is labeled “pull here”. Open packages without this feature by simply cutting them with a good pair of scissors. Keep in mind many Shirataki packages will have liquid in them. Don't worry about any smell the noodles might have."
        },
        {
          "headline":"Rinse the Shirataki noodles.",
          "description":"Rinsing noodles for 2-3 minutes will remove any residue from the manufacturing process. Use cold water when rinsing. Use a strainer for best results. Rinse the noodles thoroughly."
        },
        {
          "headline":"Prepare water for boiling.",
          "description":"Place a pot of water on your stove top. Turn the burner on underneath it to start raising the temperature of the water. Keep watch over the water to prevent it from boiling over. Turn the heat down if the water is boiling too strongly."
        },
        {
          "headline":"Add noodles to boiling water.",
          "description":"Boil the noodles for 2 or 3 minutes. Try to get the noodles soft or otherwise at your preferred level of firmness. Boiling noodles too long will result in rubbery noodles. Don't boil too long as the water will evaporate, resulting in burnt noodles."
        },
        {
          "headline":"Strain the water from the noodles.",
          "description":"Grab a strainer and put it in your sink. Pick up the pot with the water and noodles. Bring the pot over to the strainer and slowly pour the water and noodles into the strainer. Dump the noodles out of the strainer and back into your pot. Pour the water and noodles out slowly into the strainer. Be careful! Your water will be hot and can cause burns and injury."
        }
      ]
    },
    {
      "name":"Roasting the Noodles",
      "steps":[
        {
          "headline":"Heat up a pan.",
          "description":"Put a pan on your stove top and bring up the temperature of it. Add some cooking oil at this stage. Heat until the oil sizzles. Use a cast iron pan for best results."
        },
        {
          "headline":"Add the noodles to the hot pan.",
          "description":"Dry roast them for about 1 minute. Stir them occasionally to prevent them from sticking to your pan and to roast them evenly. Thicker noodles will take longer to cook. Thin noodles will cook quickly. Take care not to overcook them."
        },
        {
          "headline":"Remove noodles when dry.",
          "description":"Roast the noodles until they are dried. Stir them and listen for a squeaking noise. Take them away from heat when they make this noise or are cooked to your preference. Dry roasting will help remove any rubbery texture the Shirataki noodles might have."
        }
      ]
    },
    {
      "name":"Serving the Noodles",
      "steps":[
        {
          "headline":"Add the noodles to another dish.",
          "description":"Use the noodles as an ingredient for another recipe you have prepared. Mixing the noodles into another recipe can be a great way to enhance a meal you already enjoy. Shirataki noodles don't have a flavor of their own, so they won't affect the taste of your dish. Increase the serving size of your dish without increasing the calories."
        },
        {
          "headline":"Add other ingredients to your noodles.",
          "description":"Turn your noodles into the main course by adding any flavor or ingredients you enjoy. Mix in these other ingredients to impart their flavor into your Shirataki noodles. Use any flavors or ingredients you like. Shirataki noodles are great at absorbing whatever flavors they mix with."
        },
        {
          "headline":"Enjoy!",
          "description":"Have fun experimenting with new recipes, adding Shirataki noodles to new dishes, or using new flavors."
        }
      ]
    }
  ],
  "text":" Boiling the Noodles Open the packaging. Remove some packages by pulling the plastic away at any spot that is labeled “pull here”. Open packages without this feature by simply cutting them with a good pair of scissors. Keep in mind many Shirataki packages will have liquid in them. Don't worry about any smell the noodles might have. Rinse the Shirataki noodles. Rinsing noodles for 2-3 minutes will remove any residue from the manufacturing process. Use cold water when rinsing. Use a strainer for best results. Rinse the noodles thoroughly. Prepare water for boiling. Place a pot of water on your stove top. Turn the burner on underneath it to start raising the temperature of the water. Keep watch over the water to prevent it from boiling over. Turn the heat down if the water is boiling too strongly. Add noodles to boiling water. Boil the noodles for 2 or 3 minutes. Try to get the noodles soft or otherwise at your preferred level of firmness. Boiling noodles too long will result in rubbery noodles. Don't boil too long as the water will evaporate, resulting in burnt noodles. Strain the water from the noodles. Grab a strainer and put it in your sink. Pick up the pot with the water and noodles. Bring the pot over to the strainer and slowly pour the water and noodles into the strainer. Dump the noodles out of the strainer and back into your pot. Pour the water and noodles out slowly into the strainer. Be careful! Your water will be hot and can cause burns and injury. Roasting the Noodles Heat up a pan. Put a pan on your stove top and bring up the temperature of it. Add some cooking oil at this stage. Heat until the oil sizzles. Use a cast iron pan for best results. Add the noodles to the hot pan. Dry roast them for about 1 minute. Stir them occasionally to prevent them from sticking to your pan and to roast them evenly. Thicker noodles will take longer to cook. Thin noodles will cook quickly. Take care not to overcook them. Remove noodles when dry. Roast the noodles until they are dried. Stir them and listen for a squeaking noise. Take them away from heat when they make this noise or are cooked to your preference. Dry roasting will help remove any rubbery texture the Shirataki noodles might have. Serving the Noodles Add the noodles to another dish. Use the noodles as an ingredient for another recipe you have prepared. Mixing the noodles into another recipe can be a great way to enhance a meal you already enjoy. Shirataki noodles don't have a flavor of their own, so they won't affect the taste of your dish. Increase the serving size of your dish without increasing the calories. Add other ingredients to your noodles. Turn your noodles into the main course by adding any flavor or ingredients you enjoy. Mix in these other ingredients to impart their flavor into your Shirataki noodles. Use any flavors or ingredients you like. Shirataki noodles are great at absorbing whatever flavors they mix with. Enjoy! Have fun experimenting with new recipes, adding Shirataki noodles to new dishes, or using new flavors.",
  "tyn_model":[
    "water",
    "noodles",
    "strainer",
    "shirataki noodles",
    "pot",
    "pan",
    "“pull",
    "”.",
    "stove top",
    "cooking oil",
    "cast iron pan"
  ],
  "tyn_section":[

  ]
}