{
  "title":"How to Play Pass the Ice Cream",
  "url":"https://www.wikihow.com/Play-Pass-the-Ice-Cream",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Games for Children"
  ],
  "steps":[
    {
      "headline":"Buy the supplies for the game from the store.",
      "description":"You can't play this game if you don't have the material. Ask your parents to go with you to the store. Buy some icecream (any flavour works) and some icecream toppings. Remember to not buy typically toppings or else the game wouldn't be fun. Buy an even amount of good toppings and bad toppings to make the game more interesting."
    },
    {
      "headline":"Prepare for the game.",
      "description":"You need a half gallon of your favorite ice cream and a variety of toppings. Set the icecream out to thaw until it's soft enough to scoop. Place the icecream toppings into small bowls, make sure to refill the bowls when they get empty."
    },
    {
      "headline":"Have enough players.",
      "description":"Have at least 4-10 players, you could have more but the game could get out of hand."
    },
    {
      "headline":"Figure out who is going first second third etc.",
      "description":"Have all the participants roll a dice, whoever gets the biggest number goes first the second biggest number second etc. Have people face off if they both got the same number. Have one of your parents think of a number between 1-10, whoever gets the number is first the second closest second etc."
    },
    {
      "headline":"Have everyone sit down so the game can start.",
      "description":"Sit in a big circle around the icecream and the toppings. Give everyone and spoon for eating the icecream. Have a trash bin handy just in case."
    },
    {
      "headline":"Start the game.",
      "description":"Have a parent blindfold whoever is going first so they can't see the toppings. The player can take the blindfold off once they're done picking a topping. Use a tablespoon spoon (not the spoon you're going to eat with) and add the topping to the icecream then pass the icecream and the blindfold to the person on your right to continue the game."
    },
    {
      "headline":"The second person has to eat a spoonful of the ice cream.",
      "description":"Scoop a spoonful of icecream into your mouth, open your mouth wide to show everyone you ate the icecream."
    },
    {
      "headline":"After the second person finishes their spoon, they then add a second topping.",
      "description":"Wear a blindfold to pick a topping. Take off the blindfold and add a tablespoon of the topping to the icecream. Pass it to the person on the right."
    },
    {
      "headline":"Continue to pass the icecream, wear the blindfold, and add the toppings.",
      "description":"Remember this game is just for fun so don't cheat!"
    },
    {
      "headline":"Punish a player if they don't eat the icecream.",
      "description":"If a person does not want to eat the ice cream, then they are out and will have to do the \"punishment\". These can be laid out before hand so they are appropriate for those who are playing. A good punishment could be having them do something embarrassing or eating something gross."
    },
    {
      "headline":"Continue until you have a winner.",
      "description":"To win you can't pass on eating the icecream when it's your turn. Reward the winner with a special prize such as candy or a crown."
    }
  ],
  "text":" Buy the supplies for the game from the store. You can't play this game if you don't have the material. Ask your parents to go with you to the store. Buy some icecream (any flavour works) and some icecream toppings. Remember to not buy typically toppings or else the game wouldn't be fun. Buy an even amount of good toppings and bad toppings to make the game more interesting. Prepare for the game. You need a half gallon of your favorite ice cream and a variety of toppings. Set the icecream out to thaw until it's soft enough to scoop. Place the icecream toppings into small bowls, make sure to refill the bowls when they get empty. Have enough players. Have at least 4-10 players, you could have more but the game could get out of hand. Figure out who is going first second third etc. Have all the participants roll a dice, whoever gets the biggest number goes first the second biggest number second etc. Have people face off if they both got the same number. Have one of your parents think of a number between 1-10, whoever gets the number is first the second closest second etc. Have everyone sit down so the game can start. Sit in a big circle around the icecream and the toppings. Give everyone and spoon for eating the icecream. Have a trash bin handy just in case. Start the game. Have a parent blindfold whoever is going first so they can't see the toppings. The player can take the blindfold off once they're done picking a topping. Use a tablespoon spoon (not the spoon you're going to eat with) and add the topping to the icecream then pass the icecream and the blindfold to the person on your right to continue the game. The second person has to eat a spoonful of the ice cream. Scoop a spoonful of icecream into your mouth, open your mouth wide to show everyone you ate the icecream. After the second person finishes their spoon, they then add a second topping. Wear a blindfold to pick a topping. Take off the blindfold and add a tablespoon of the topping to the icecream. Pass it to the person on the right. Continue to pass the icecream, wear the blindfold, and add the toppings. Remember this game is just for fun so don't cheat! Punish a player if they don't eat the icecream. If a person does not want to eat the ice cream, then they are out and will have to do the \"punishment\". These can be laid out before hand so they are appropriate for those who are playing. A good punishment could be having them do something embarrassing or eating something gross. Continue until you have a winner. To win you can't pass on eating the icecream when it's your turn. Reward the winner with a special prize such as candy or a crown.",
  "tyn_model":[
    "icecream",
    "ice cream",
    "spoon",
    "icecream toppings",
    "dice",
    "tablespoon spoon",
    "candy"
  ],
  "tyn_section":[

  ]
}