{
  "title":"How to Check Whether a PSN ID Is Available",
  "url":"https://www.wikihow.com/Check-Whether-a-PSN-ID-Is-Available",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation 3"
  ],
  "methods":[
    {
      "name":"Using the PlayStation Website",
      "steps":[
        {
          "headline":"Open the PlayStation website.",
          "description":"Go to https://www.playstation.com/ in your computer's web browser."
        },
        {
          "headline":"Click Sign In.",
          "description":"It's in the upper-right side of the PlayStation home page."
        },
        {
          "headline":"Click Create New Account.",
          "description":"This button is below the sign-in field that's in the middle of the page."
        },
        {
          "headline":"Click Start.",
          "description":"It's a blue button in the middle of the page. This will open the account creation form."
        },
        {
          "headline":"Enter your account's sign-in details.",
          "description":"Type an email address into the \"Sign-In ID\" text box, then enter a password into both of the \"Password\" text boxes. Make sure that your email address works, since you'll need to verify your account at your provided email address later."
        },
        {
          "headline":"Click Next.",
          "description":"It's in the top-right corner of the page."
        },
        {
          "headline":"Select your date of birth.",
          "description":"Using the drop-down boxes in the \"Date of Birth\" section, indicate the month, day, and year of your birth. You can also change your region and language settings here if they differ from your preferences. You must be at least 18 years old to create your own master account, though you can create a sub account under someone else's account if you're between 7 and 17."
        },
        {
          "headline":"Click Next.",
          "description":"It's in the upper-right side of the page."
        },
        {
          "headline":"Add your address details.",
          "description":"You'll need to enter your city, state, and ZIP code in the \"City\", \"State/Province\", and \"Postal Code\" text boxes, respectively."
        },
        {
          "headline":"Click Next.",
          "description":"It's in the upper-right side of the page. This will take you to the PSN Profile page, which is where you'll be able to test your user ID."
        },
        {
          "headline":"Enter your real name.",
          "description":"Do so in the \"Name\" section. Your first name goes in the top box in this section, while your last name goes in the bottom box here."
        },
        {
          "headline":"Enter your preferred PSN ID.",
          "description":"Type this ID into the \"Online ID\" text box at the top of the page. Make sure that this is exactly the PSN ID that you want to use, since you don't get to change it later. Your PSN ID cannot be the same username that your email address uses."
        },
        {
          "headline":"Check your PSN ID's availability.",
          "description":"Click Next in the top-right corner of the page; if you're taken to the \"Finish\" page or an \"I'm not a robot\" checkbox, your PSN ID is available! If the page refreshes and a red line of text that says \"This online ID is already in use.\" appears below the \"Online ID\" text box, you'll need to come up with a different ID."
        },
        {
          "headline":"Finish creating your account if you like.",
          "description":"If you just wanted to check an ID for availability, you don't have to complete the account creation process. Otherwise, do the following:\nCheck the \"I'm not a robot\" box and click Continue if prompted. Click Agree and Create Account\n\nOpen the inbox for the email address that you used to sign up for your account. Open the \"Account registration confirmation\" email from PlayStation. Click the blue Verify Now button."
        }
      ]
    },
    {
      "name":"Using a PlayStation 4",
      "steps":[
        {
          "headline":"Turn on your PS4 and a connected controller.",
          "description":"You can create a PSN ID from your PlayStation 4's sign-in page."
        },
        {
          "headline":"Select New User.",
          "description":"Scroll over to the New User option and press the X button on your PlayStation 4 controller."
        },
        {
          "headline":"Select Create a User.",
          "description":"It's near the bottom of the page."
        },
        {
          "headline":"Select Accept.",
          "description":"This option is in the bottom-right corner of the screen."
        },
        {
          "headline":"Select Next.",
          "description":"It's at the bottom of the screen."
        },
        {
          "headline":"Select New to PlayStation™ Network - Create an Account.",
          "description":"This option is at the very bottom of the screen."
        },
        {
          "headline":"Select Sign Up Now.",
          "description":"Doing so will open the account creation page."
        },
        {
          "headline":"Enter your location and age information.",
          "description":"Use the \"Date of Birth\" boxes to select the month, date, and year of your birth. You can also change the region and language information if it's incorrect. You must be at least 18 years old to create your own master account, though you can create a sub account under someone else's account if you're between 7 and 17."
        },
        {
          "headline":"Select Next.",
          "description":"It's at the bottom of the screen."
        },
        {
          "headline":"Add your address details.",
          "description":"You'll need to enter your ZIP code, city, and state (or province) in the \"Postal Code\", \"City\", and \"State/Province\" boxes, respectively. When you enter your postal code, the \"City\" and \"State/Province\" boxes should automatically fill."
        },
        {
          "headline":"Select Next.",
          "description":""
        },
        {
          "headline":"Enter your account's sign-in details.",
          "description":"Type an email address into the \"Sign-In ID (Email Address)\" text box, then enter a password in the \"Password\" and \"Confirm Password\" text boxes."
        },
        {
          "headline":"Select Next.",
          "description":""
        },
        {
          "headline":"Select an avatar.",
          "description":"This is what will stand in as your PSN profile picture. Scroll through the available avatars until you find one that you like, then press X."
        },
        {
          "headline":"Add your first and last name.",
          "description":"Do so in the \"First Name\" and \"Last Name\" text boxes."
        },
        {
          "headline":"Enter your preferred PSN ID.",
          "description":"Type this ID into the \"Online ID\" text box at the top of the page. Make sure that this is exactly the PSN ID that you want to use, since you don't get to change it later. Your PSN ID cannot be the same username that your email address uses."
        },
        {
          "headline":"Check your PSN ID's availability.",
          "description":"Scroll down to the Next button and wait for it to become selectable. If you're able to select Next after a few seconds, your PSN ID is available! If you see a \"This online ID is already in use\" message appear to the right of the Online ID box, your selected ID isn't available. You'll need to select a different one."
        },
        {
          "headline":"Finish setting up your PSN account if you like.",
          "description":"Follow the rest of the on-screen prompts to finish setting up your account. If you only wanted to use your PS4 to check for your username's availability, you can instead exit the setup by pressing the circle button until you arrive back at the home page. You may have to verify your email address by opening its inbox, opening the email from Sony, and clicking Verify Now before you can use your PSN account."
        }
      ]
    }
  ],
  "text":" Using the PlayStation Website Open the PlayStation website. Go to https://www.playstation.com/ in your computer's web browser. Click Sign In. It's in the upper-right side of the PlayStation home page. Click Create New Account. This button is below the sign-in field that's in the middle of the page. Click Start. It's a blue button in the middle of the page. This will open the account creation form. Enter your account's sign-in details. Type an email address into the \"Sign-In ID\" text box, then enter a password into both of the \"Password\" text boxes. Make sure that your email address works, since you'll need to verify your account at your provided email address later. Click Next. It's in the top-right corner of the page. Select your date of birth. Using the drop-down boxes in the \"Date of Birth\" section, indicate the month, day, and year of your birth. You can also change your region and language settings here if they differ from your preferences. You must be at least 18 years old to create your own master account, though you can create a sub account under someone else's account if you're between 7 and 17. Click Next. It's in the upper-right side of the page. Add your address details. You'll need to enter your city, state, and ZIP code in the \"City\", \"State/Province\", and \"Postal Code\" text boxes, respectively. Click Next. It's in the upper-right side of the page. This will take you to the PSN Profile page, which is where you'll be able to test your user ID. Enter your real name. Do so in the \"Name\" section. Your first name goes in the top box in this section, while your last name goes in the bottom box here. Enter your preferred PSN ID. Type this ID into the \"Online ID\" text box at the top of the page. Make sure that this is exactly the PSN ID that you want to use, since you don't get to change it later. Your PSN ID cannot be the same username that your email address uses. Check your PSN ID's availability. Click Next in the top-right corner of the page; if you're taken to the \"Finish\" page or an \"I'm not a robot\" checkbox, your PSN ID is available! If the page refreshes and a red line of text that says \"This online ID is already in use.\" appears below the \"Online ID\" text box, you'll need to come up with a different ID. Finish creating your account if you like. If you just wanted to check an ID for availability, you don't have to complete the account creation process. Otherwise, do the following:\nCheck the \"I'm not a robot\" box and click Continue if prompted. Click Agree and Create Account\n\nOpen the inbox for the email address that you used to sign up for your account. Open the \"Account registration confirmation\" email from PlayStation. Click the blue Verify Now button. Using a PlayStation 4 Turn on your PS4 and a connected controller. You can create a PSN ID from your PlayStation 4's sign-in page. Select New User. Scroll over to the New User option and press the X button on your PlayStation 4 controller. Select Create a User. It's near the bottom of the page. Select Accept. This option is in the bottom-right corner of the screen. Select Next. It's at the bottom of the screen. Select New to PlayStation™ Network - Create an Account. This option is at the very bottom of the screen. Select Sign Up Now. Doing so will open the account creation page. Enter your location and age information. Use the \"Date of Birth\" boxes to select the month, date, and year of your birth. You can also change the region and language information if it's incorrect. You must be at least 18 years old to create your own master account, though you can create a sub account under someone else's account if you're between 7 and 17. Select Next. It's at the bottom of the screen. Add your address details. You'll need to enter your ZIP code, city, and state (or province) in the \"Postal Code\", \"City\", and \"State/Province\" boxes, respectively. When you enter your postal code, the \"City\" and \"State/Province\" boxes should automatically fill. Select Next.  Enter your account's sign-in details. Type an email address into the \"Sign-In ID (Email Address)\" text box, then enter a password in the \"Password\" and \"Confirm Password\" text boxes. Select Next.  Select an avatar. This is what will stand in as your PSN profile picture. Scroll through the available avatars until you find one that you like, then press X. Add your first and last name. Do so in the \"First Name\" and \"Last Name\" text boxes. Enter your preferred PSN ID. Type this ID into the \"Online ID\" text box at the top of the page. Make sure that this is exactly the PSN ID that you want to use, since you don't get to change it later. Your PSN ID cannot be the same username that your email address uses. Check your PSN ID's availability. Scroll down to the Next button and wait for it to become selectable. If you're able to select Next after a few seconds, your PSN ID is available! If you see a \"This online ID is already in use\" message appear to the right of the Online ID box, your selected ID isn't available. You'll need to select a different one. Finish setting up your PSN account if you like. Follow the rest of the on-screen prompts to finish setting up your account. If you only wanted to use your PS4 to check for your username's availability, you can instead exit the setup by pressing the circle button until you arrive back at the home page. You may have to verify your email address by opening its inbox, opening the email from Sony, and clicking Verify Now before you can use your PSN account.",
  "tyn_model":[
    "playstation 4",
    "playstation",
    "psn id",
    "ps4",
    "psn profile",
    "playstation™ network",
    "psn"
  ],
  "tyn_section":[

  ]
}