{
  "title":"How to Attach a Patch to a Uniform Using Iron on Fusing Tape",
  "url":"https://www.wikihow.com/Attach-a-Patch-to-a-Uniform-Using-Iron-on-Fusing-Tape",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Ironing"
  ],
  "steps":[
    {
      "headline":"Purchase iron-on fusing tape (Stitch Witchery is one brand name) at a fabric or crafts store.",
      "description":"You can also buy a small piece of fusible interfacing to use instead of the fusing tape. ⁄4 yard (0.2 m) should be enough for quite a few badges."
    },
    {
      "headline":"Preheat the iron to the setting recommended on the fusing tape or interfacing.",
      "description":""
    },
    {
      "headline":"Place the uniform or garment on an ironing board or table with the outside of the uniform or garment facing up.",
      "description":"Position the patch carefully making sure you know where you want it to go. Hold it in place with a straight pin or safety pin. Try on the uniform or garment to be sure the patch is correctly positioned. Put the uniform or garment back on the ironing board with the outside facing up."
    },
    {
      "headline":"Cut the fusing tape to slightly smaller than the size of the patch.",
      "description":"The slightly smaller part is important because you don't want to get the fusible stuff on the iron or press cloth."
    },
    {
      "headline":"Remove the pin carefully and place the iron-on fusing tape on the uniform or garment and then the patch on top of it facing up, being careful to keep the patch in the same position.",
      "description":""
    },
    {
      "headline":"Get a damp paper towel or damp white cloth (like an old t-shirt) to use as a pressing cloth.",
      "description":"Place the damp cloth or paper towel on top of the patch."
    },
    {
      "headline":"Press and hold the iron down on top of the press cloth for the length of time specified on the fusing tape directions, usually 15 to 30 seconds.",
      "description":"If necessary lift the iron up and press it down again in an overlapping pattern to cover the whole patch. Usually the patch will be well-fused if the press cloth is dry where the iron was. Let the material cool for a minute or two."
    },
    {
      "headline":"Lift the press cloth off.",
      "description":"Check that the patch is well attached. If it is, the uniform or garment can now be laundered and dried and the patch should stay on fine."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Purchase iron-on fusing tape (Stitch Witchery is one brand name) at a fabric or crafts store. You can also buy a small piece of fusible interfacing to use instead of the fusing tape. ⁄4 yard (0.2 m) should be enough for quite a few badges. Preheat the iron to the setting recommended on the fusing tape or interfacing.  Place the uniform or garment on an ironing board or table with the outside of the uniform or garment facing up. Position the patch carefully making sure you know where you want it to go. Hold it in place with a straight pin or safety pin. Try on the uniform or garment to be sure the patch is correctly positioned. Put the uniform or garment back on the ironing board with the outside facing up. Cut the fusing tape to slightly smaller than the size of the patch. The slightly smaller part is important because you don't want to get the fusible stuff on the iron or press cloth. Remove the pin carefully and place the iron-on fusing tape on the uniform or garment and then the patch on top of it facing up, being careful to keep the patch in the same position.  Get a damp paper towel or damp white cloth (like an old t-shirt) to use as a pressing cloth. Place the damp cloth or paper towel on top of the patch. Press and hold the iron down on top of the press cloth for the length of time specified on the fusing tape directions, usually 15 to 30 seconds. If necessary lift the iron up and press it down again in an overlapping pattern to cover the whole patch. Usually the patch will be well-fused if the press cloth is dry where the iron was. Let the material cool for a minute or two. Lift the press cloth off. Check that the patch is well attached. If it is, the uniform or garment can now be laundered and dried and the patch should stay on fine. Finished. ",
  "tyn_model":[
    "iron",
    "fusing tape",
    "iron-on fusing tape",
    "ironing board",
    "press cloth",
    "fusible interfacing",
    "straight pin",
    "safety pin",
    "iron or press",
    "paper towel"
  ],
  "tyn_section":[

  ]
}