{
  "title":"How to Remove Bathroom Mold",
  "url":"https://www.wikihow.com/Remove-Bathroom-Mold",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Mold and Mildew Treatment"
  ],
  "methods":[
    {
      "name":"Making a Mold Removal Solution",
      "steps":[
        {
          "headline":"Create a vinegar solution for a safe, non-toxic mold killer.",
          "description":"White vinegar is a great way to remove mold from a variety of different surfaces. Pour the vinegar directly into a spray bottle to use it. It doesn’t need to be diluted at all, as it is the most effective when it isn’t watered down. You don’t need to rinse away the vinegar after you have used it. Although the smell can be unpleasant, it usually clears within 1-2 hours. You can open a window or turn on a fan to help the smell disappear faster. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIlya Ornatov\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Founder, NW Maids\t\t\t\t\t\t\t\tIlya Ornatov is the Founder and Owner of NW Maids, a cleaning service in Seattle, Washington. Ilya founded NW Maids in 2014, with an emphasis on upfront pricing, easy online booking, and thorough cleaning services. Ilya Ornatov\t\t\tCleaning Guru & Founder, NW Maids\t\t\t\tExpert Trick: If you need to treat a large area, or if you don't want your bathroom to have a pungent vinegar scent, you can dilute the vinegar with water in a 2:1 ratio. This will give you more solution to spray and cut the smell without lowering the anti-fungal power of vinegar!"
        },
        {
          "headline":"Use a Borax solution for a natural mold remover.",
          "description":"Borax is a natural insecticide and fungicide. Mix together 1 cup (204 g) of Borax with 1 US gal (3.8 L)of water and then pour the solution into a spray bottle. Simply spray the solution directly on the surface you want to clean. Borax doesn’t need to be rinsed off, as it can prevent more mold from growing in the future. You can find Borax in the laundry section of grocery stores. It is a white mineral powder. Borax is dangerous to consume, but unlike bleach, it doesn't release toxic fumes."
        },
        {
          "headline":"Choose a bleach solution as a last resort.",
          "description":"Although bleach is effective at killing mold on non-porous surfaces such as showers, basins, and tiles, it is a toxic substance and needs to be used carefully. Create a bleach solution with 1 part bleach to 10 parts water and place this into a spray bottle. You don’t need to rinse the bleach solution away afterward unless pets or small children might touch the surface. Always wear gloves when working with bleach and keep the area well-ventilated to avoid inhaling the fumes. Bleach can cause eye, lung, and skin irritations."
        }
      ]
    },
    {
      "name":"Using the Cleaning Solution",
      "steps":[
        {
          "headline":"Spray the mold cleaning solution over the area you wish to clean.",
          "description":"Get the spray bottle with your chosen cleaning solution inside. Generously spray the entire area with the solution so that there is a visible, even coating. Try not to completely saturate the area, as otherwise, there will be excessive liquid to clean up later. Aim to apply enough of the cleaning solution so that the area is visibly wet, but not so much that puddles form. Be very careful not to slip if you are working on floor tiles or grouting."
        },
        {
          "headline":"Wipe smooth surfaces with a cleaning cloth to remove the mold.",
          "description":"Fold a cleaning cloth into quarters and wipe the entire area where you sprayed the cleaning solution. The mold should wipe away easily onto the cloth. Use a new side of the cloth whenever the first side gets saturated or too dirty. You may need to swap cleaning cloths throughout the process, especially if you are cleaning a large area. Alternatively, you can use a sponge instead of a cloth if you prefer. Smooth surfaces include showers, baths, basins, and tiles."
        },
        {
          "headline":"Use a scrubbing brush to remove stubborn mold from smooth surfaces.",
          "description":"If the mold remains, it’s time to take more serious measures! Scrub the affected area vigorously until the mold comes away. Try to clean any mold away as soon as it grows so that you don't need to resort to scrubbing. Have a dedicated scrubbing brush strictly for bathroom mold to prevent spreading the spores throughout your home."
        },
        {
          "headline":"Scrub grout or caulking with a toothbrush.",
          "description":"Use a back and forward motion to remove mold from grout or caulking with an old toothbrush. Rinse the toothbrush under running water to remove any mold while you clean, as this prevents the mold spores from spreading throughout the bathroom. Use a dedicated toothbrush for cleaning mold in the bathroom so that the spores don’t spread throughout your home. You can use a larger scrubbing brush if you prefer, but a toothbrush is the easiest to use in tight spaces. You can purchase specialty grout scrubbers from home improvement stores."
        },
        {
          "headline":"Dry the cleaned area with a cleaning cloth.",
          "description":"Remove the excess liquid from the area that you cleaned to keep the bathroom dry and to prevent slips. Run the cloth over all of the smooth surfaces and the grout or caulking to remove the excess moisture. This also removes any mold that has been scrubbed loose. You may need to swap cleaning cloths if the first one gets too saturated. Pay attention to any small crevices or corners to prevent the liquid from pooling up and more mold from forming."
        },
        {
          "headline":"Replace the grout or caulking if you can’t remove the mold stains.",
          "description":"If the mold builds up too much, you won’t be able to scrub it away. In this case, use a flathead screwdriver to dig into the grout or caulking, and then lift it up to remove it. Apply the new grout or caulking and clean it regularly to prevent the mold forming more stains. You can apply a sealer over the new grout or caulking to prevent it from being stained."
        }
      ]
    },
    {
      "name":"Preventing Bathroom Mold",
      "steps":[
        {
          "headline":"Turn the bathroom fan on when the bath or shower is in use.",
          "description":"A bathroom fan is very effective at reducing the humidity in the room. Turn the fan on when you start running the bath or the shower and keep it on for at least 5 minutes afterward to help clear the steam. If possible, try to keep the fan on until all of the steam is gone. Open the window and turn the fan on to reduce the humidity the most effectively."
        },
        {
          "headline":"Open the window after you have a bath or a shower.",
          "description":"Mold grows faster when there are high humidity and water levels, such as when the bath or shower are used. Open the window straight after using the bath or shower to let the excess water evaporate and the steam escape. Keep the window open until the bathroom is dry. Try to remember to open the window every time to limit mold growth."
        },
        {
          "headline":"Dry all of the surfaces if you are worried about the moisture levels.",
          "description":"Although regular cleaning and keeping the bathroom well-ventilated should be effective at keeping mold at bay, sometimes these precautions aren’t enough. If you find a spot in your bathroom where mold keeps returning, use a cleaning cloth to dry it whenever there is excess water. Some common mold areas may include the basin or the shower tiles. You can use a squeegee instead of a cloth on tiles and glass doors."
        }
      ]
    },
    {
      "name":"Staying Safe",
      "steps":[
        {
          "headline":"Use rubber gloves whenever you are working with mold.",
          "description":"Keep yourself safe by not touching mold with your bare hands. If you are using vinegar or Borax to clean the mold, regular household rubber gloves are fine. However, if you are working with bleach, choose natural rubber or PVC gloves instead. Take the gloves off as soon as you are finished cleaning so that the spores don’t spread throughout your home."
        },
        {
          "headline":"Wear old clothes and wash them in hot water after cleaning mold.",
          "description":"It’s best to wear old clothes that you don’t mind getting stained or damaged by the cleaning solutions and hot water wash cycle. Always use hot water to wash your clothes with immediately after you have finished cleaning so that the spores trapped in the fabric are killed and don’t spread. It’s especially important that you wear old clothes if you are using bleach. This is because bleach can remove the color from fabrics."
        },
        {
          "headline":"Keep the bathroom ventilated while you are cleaning.",
          "description":"Open as many windows are possible and turn on the bathroom fan if there is one. This helps to prevent you inhaling the mold spores and any toxic fumes that may be released by the cleaning solutions. You can also bring a portable fan into the bathroom if you have one."
        }
      ]
    }
  ],
  "text":" Making a Mold Removal Solution Create a vinegar solution for a safe, non-toxic mold killer. White vinegar is a great way to remove mold from a variety of different surfaces. Pour the vinegar directly into a spray bottle to use it. It doesn’t need to be diluted at all, as it is the most effective when it isn’t watered down. You don’t need to rinse away the vinegar after you have used it. Although the smell can be unpleasant, it usually clears within 1-2 hours. You can open a window or turn on a fan to help the smell disappear faster. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIlya Ornatov\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru & Founder, NW Maids\t\t\t\t\t\t\t\tIlya Ornatov is the Founder and Owner of NW Maids, a cleaning service in Seattle, Washington. Ilya founded NW Maids in 2014, with an emphasis on upfront pricing, easy online booking, and thorough cleaning services. Ilya Ornatov\t\t\tCleaning Guru & Founder, NW Maids\t\t\t\tExpert Trick: If you need to treat a large area, or if you don't want your bathroom to have a pungent vinegar scent, you can dilute the vinegar with water in a 2:1 ratio. This will give you more solution to spray and cut the smell without lowering the anti-fungal power of vinegar! Use a Borax solution for a natural mold remover. Borax is a natural insecticide and fungicide. Mix together 1 cup (204 g) of Borax with 1 US gal (3.8 L)of water and then pour the solution into a spray bottle. Simply spray the solution directly on the surface you want to clean. Borax doesn’t need to be rinsed off, as it can prevent more mold from growing in the future. You can find Borax in the laundry section of grocery stores. It is a white mineral powder. Borax is dangerous to consume, but unlike bleach, it doesn't release toxic fumes. Choose a bleach solution as a last resort. Although bleach is effective at killing mold on non-porous surfaces such as showers, basins, and tiles, it is a toxic substance and needs to be used carefully. Create a bleach solution with 1 part bleach to 10 parts water and place this into a spray bottle. You don’t need to rinse the bleach solution away afterward unless pets or small children might touch the surface. Always wear gloves when working with bleach and keep the area well-ventilated to avoid inhaling the fumes. Bleach can cause eye, lung, and skin irritations. Using the Cleaning Solution Spray the mold cleaning solution over the area you wish to clean. Get the spray bottle with your chosen cleaning solution inside. Generously spray the entire area with the solution so that there is a visible, even coating. Try not to completely saturate the area, as otherwise, there will be excessive liquid to clean up later. Aim to apply enough of the cleaning solution so that the area is visibly wet, but not so much that puddles form. Be very careful not to slip if you are working on floor tiles or grouting. Wipe smooth surfaces with a cleaning cloth to remove the mold. Fold a cleaning cloth into quarters and wipe the entire area where you sprayed the cleaning solution. The mold should wipe away easily onto the cloth. Use a new side of the cloth whenever the first side gets saturated or too dirty. You may need to swap cleaning cloths throughout the process, especially if you are cleaning a large area. Alternatively, you can use a sponge instead of a cloth if you prefer. Smooth surfaces include showers, baths, basins, and tiles. Use a scrubbing brush to remove stubborn mold from smooth surfaces. If the mold remains, it’s time to take more serious measures! Scrub the affected area vigorously until the mold comes away. Try to clean any mold away as soon as it grows so that you don't need to resort to scrubbing. Have a dedicated scrubbing brush strictly for bathroom mold to prevent spreading the spores throughout your home. Scrub grout or caulking with a toothbrush. Use a back and forward motion to remove mold from grout or caulking with an old toothbrush. Rinse the toothbrush under running water to remove any mold while you clean, as this prevents the mold spores from spreading throughout the bathroom. Use a dedicated toothbrush for cleaning mold in the bathroom so that the spores don’t spread throughout your home. You can use a larger scrubbing brush if you prefer, but a toothbrush is the easiest to use in tight spaces. You can purchase specialty grout scrubbers from home improvement stores. Dry the cleaned area with a cleaning cloth. Remove the excess liquid from the area that you cleaned to keep the bathroom dry and to prevent slips. Run the cloth over all of the smooth surfaces and the grout or caulking to remove the excess moisture. This also removes any mold that has been scrubbed loose. You may need to swap cleaning cloths if the first one gets too saturated. Pay attention to any small crevices or corners to prevent the liquid from pooling up and more mold from forming. Replace the grout or caulking if you can’t remove the mold stains. If the mold builds up too much, you won’t be able to scrub it away. In this case, use a flathead screwdriver to dig into the grout or caulking, and then lift it up to remove it. Apply the new grout or caulking and clean it regularly to prevent the mold forming more stains. You can apply a sealer over the new grout or caulking to prevent it from being stained. Preventing Bathroom Mold Turn the bathroom fan on when the bath or shower is in use. A bathroom fan is very effective at reducing the humidity in the room. Turn the fan on when you start running the bath or the shower and keep it on for at least 5 minutes afterward to help clear the steam. If possible, try to keep the fan on until all of the steam is gone. Open the window and turn the fan on to reduce the humidity the most effectively. Open the window after you have a bath or a shower. Mold grows faster when there are high humidity and water levels, such as when the bath or shower are used. Open the window straight after using the bath or shower to let the excess water evaporate and the steam escape. Keep the window open until the bathroom is dry. Try to remember to open the window every time to limit mold growth. Dry all of the surfaces if you are worried about the moisture levels. Although regular cleaning and keeping the bathroom well-ventilated should be effective at keeping mold at bay, sometimes these precautions aren’t enough. If you find a spot in your bathroom where mold keeps returning, use a cleaning cloth to dry it whenever there is excess water. Some common mold areas may include the basin or the shower tiles. You can use a squeegee instead of a cloth on tiles and glass doors. Staying Safe Use rubber gloves whenever you are working with mold. Keep yourself safe by not touching mold with your bare hands. If you are using vinegar or Borax to clean the mold, regular household rubber gloves are fine. However, if you are working with bleach, choose natural rubber or PVC gloves instead. Take the gloves off as soon as you are finished cleaning so that the spores don’t spread throughout your home. Wear old clothes and wash them in hot water after cleaning mold. It’s best to wear old clothes that you don’t mind getting stained or damaged by the cleaning solutions and hot water wash cycle. Always use hot water to wash your clothes with immediately after you have finished cleaning so that the spores trapped in the fabric are killed and don’t spread. It’s especially important that you wear old clothes if you are using bleach. This is because bleach can remove the color from fabrics. Keep the bathroom ventilated while you are cleaning. Open as many windows are possible and turn on the bathroom fan if there is one. This helps to prevent you inhaling the mold spores and any toxic fumes that may be released by the cleaning solutions. You can also bring a portable fan into the bathroom if you have one.",
  "tyn_model":[
    "bleach",
    "vinegar",
    "fan",
    "borax",
    "grout",
    "spray bottle",
    "water",
    "caulking",
    "toothbrush",
    "cleaning solution",
    "cleaning cloth",
    "cleaning cloths",
    "scrubbing brush",
    "bathroom fan",
    "hot water",
    "white vinegar",
    "cleaning service",
    "sponge",
    "grout scrubbers",
    "flathead screwdriver",
    "sealer",
    "window",
    "squeegee",
    "rubber gloves"
  ],
  "tyn_section":[

  ]
}