{
  "title":"How to Make Spaghetti Sauce from Fresh Tomatoes",
  "url":"https://www.wikihow.com/Make-Spaghetti-Sauce-from-Fresh-Tomatoes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles",
    "Pasta Sauce Recipes"
  ],
  "parts":[
    {
      "name":"Preparing the Tomatoes",
      "steps":[
        {
          "headline":"Gather the recipe ingredients.",
          "description":"Spaghetti sauce from fresh tomatoes is one of the easiest and most delicious toppings for a pasta dish. This recipe will take you a total of about 45 minutes to make. The prep work will take 20 minutes and the cook time is 25 minutes. It will yield 2 1/2 to 3 cups (1,134 to 1,361 grams) of sauce. Each serving of sauce is about ½ cup (118 milliliters). This recipe will create 5 to 6 servings."
        },
        {
          "headline":"Score the tomatoes.",
          "description":"Rinse each tomato individually to remove any dirt. Once clean, score each one. To “score” means to cut a small “X” into the stem end of the tomato with a sharp knife. This will make their skins very easy to pull off after blanching them. Your “X” doesn’t have to be perfect, just slice the basic shape into the tomato’s end. Blanching is when you place vegetables into boiling water for a few minutes and then run very cold water over them. Be sure to use the ripest tomatoes for best results."
        },
        {
          "headline":"Boil a pot of water and blanch the tomatoes.",
          "description":"Once the water is boiling, drop several of the tomatoes into the pot. Leave them to boil for 2 to 3 minutes. When you see the skins beginning to fall off, use tongs to carefully pull the tomatoes out. Place a strainer or colander in your sink and begin to transfer the blanched tomatoes into it. You will probably have to blanch the tomatoes in batches. Run very cold water over the ones in the colander while you finish blanching the rest. Along with making the skins easy to remove, blanching will also preserve the texture and color of the tomatoes."
        },
        {
          "headline":"Peel the tomato skins off with a small knife.",
          "description":"Run cold water over the blanched tomatoes until they can be safely handled. Use a small, sharp knife to remove the skins. They should come off very easily. Discard the skins. Cut the skinless tomatoes in half, then use the knife to cut out the core. Use your fingers to dig out most of the remaining seeds and discard them. Dice the tomatoes into large chunks."
        }
      ]
    },
    {
      "name":"Cooking the Sauce",
      "steps":[
        {
          "headline":"Sauté the onion and garlic in olive oil.",
          "description":"Finely chop the onion and mince the garlic. Put 4 tablespoons (60 milliliters) of extra virgin olive oil in a large saucepan. Heat the oil over medium heat until it begins to sizzle. Transfer the onion into the saucepan and cook for several minutes until it gets tender. Stir it often. You’ll know it’s ready when the onion is soft and looks slightly translucent. Add the minced garlic to the saucepan. Stir frequently. Sauté for about 60 seconds or until the garlic becomes fragrant."
        },
        {
          "headline":"Add the tomato, seasoning and basil to the saucepan.",
          "description":"Carefully add the diced, skinless tomatoes to the pan. Add a dash of sea salt and freshly ground black paper (to taste). Mince the basil and add half of it to the pan. Reserve the other half of the fresh basil for the end of the recipe. Stir the sauce well to make sure the basil properly mixes into the sauce."
        },
        {
          "headline":"Reduce the heat to low and simmer the sauce.",
          "description":"Once everything is added to the pot, reduce the heat to low. Allow the sauce to simmer uncovered for about 20 minutes. To simmer means to cook food at just below the boiling point. You'll know it’s simmering when you see a couple of small bubbles breaking the surface every 1 to 2 seconds. Adjust the heat up or down as necessary to maintain the simmer."
        }
      ]
    },
    {
      "name":"Putting It All Together",
      "steps":[
        {
          "headline":"Check the consistency of the sauce.",
          "description":"After simmering for 20 minutes, the sauce will have become quite a bit thicker. It will be fairly chunky and should appear to be a vibrantly red hue. If you prefer your sauce to be slightly thicker, continue to simmer it for another 10 minutes, stirring occasionally. The longer a sauce simmers, the thicker it becomes. When your sauce has reached your preferred consistency, stir the rest of the minced basil into the sauce. Remove the sauce from heat."
        },
        {
          "headline":"Boil water and cook the pasta.",
          "description":"Bring a pot of water to a boil and place the pasta of your choice in it to cook. Any kind of pasta will go well with this sauce – fettuccine, tagliatelle and spaghetti noodles are the most traditional options. Since all pastas differ in cook time, check the packaging of yours and follow the directions until the noodles are tender. Once the pasta noodles are done, remove the pot from heat. Drain the noodles well before plating them."
        },
        {
          "headline":"Plate the pasta and ladle the sauce over the noodles.",
          "description":"Carefully place a serving of pasta onto each plate. Use a large spoon or ladle to pour about ½ cup (118 milliliters) of the tomato sauce over each serving. Serve the dish with grated Parmesan or Pecorino Romano cheese. Garnish the plates with fresh basil leaves and/or lightly toasted pine nuts (optional). Thick, crusty garlic bread and a well-tossed Caesar salad would both compliment this dish (optional)."
        },
        {
          "headline":"Try a few variations.",
          "description":"Consider substituting the pasta noodles with wheat pasta or gluten-free pasta. Add a few more fresh herbs to the sauce, such as rosemary and thyme, or use a small amount of additional fresh herbs to garnish each plate. You can easily add additional veggies to your sauce; mushrooms are very popular. Simply add them in right after you sauté the onions and garlic. Meatballs are another favorite addition to this sauce. Beef, pork, chicken and turkey are all great candidates for meatballs. Start by making your favorite version and then brown the meatballs. Put together the sauce and allow it to simmer for about 20 minutes. Add the browned meatballs to the sauce and simmer for an additional 30 minutes. For vegans, try substituting the cheese with nutritional yeast. Simply sprinkle a small amount on top of the noodles and sauce right before you serve the pasta. The yeast will add a cheesy richness to the dish. This tomato sauce would also work well on homemade pizzas or as a tasty dipping sauce for bread sticks."
        }
      ]
    }
  ],
  "text":" Preparing the Tomatoes Gather the recipe ingredients. Spaghetti sauce from fresh tomatoes is one of the easiest and most delicious toppings for a pasta dish. This recipe will take you a total of about 45 minutes to make. The prep work will take 20 minutes and the cook time is 25 minutes. It will yield 2 1/2 to 3 cups (1,134 to 1,361 grams) of sauce. Each serving of sauce is about ½ cup (118 milliliters). This recipe will create 5 to 6 servings. Score the tomatoes. Rinse each tomato individually to remove any dirt. Once clean, score each one. To “score” means to cut a small “X” into the stem end of the tomato with a sharp knife. This will make their skins very easy to pull off after blanching them. Your “X” doesn’t have to be perfect, just slice the basic shape into the tomato’s end. Blanching is when you place vegetables into boiling water for a few minutes and then run very cold water over them. Be sure to use the ripest tomatoes for best results. Boil a pot of water and blanch the tomatoes. Once the water is boiling, drop several of the tomatoes into the pot. Leave them to boil for 2 to 3 minutes. When you see the skins beginning to fall off, use tongs to carefully pull the tomatoes out. Place a strainer or colander in your sink and begin to transfer the blanched tomatoes into it. You will probably have to blanch the tomatoes in batches. Run very cold water over the ones in the colander while you finish blanching the rest. Along with making the skins easy to remove, blanching will also preserve the texture and color of the tomatoes. Peel the tomato skins off with a small knife. Run cold water over the blanched tomatoes until they can be safely handled. Use a small, sharp knife to remove the skins. They should come off very easily. Discard the skins. Cut the skinless tomatoes in half, then use the knife to cut out the core. Use your fingers to dig out most of the remaining seeds and discard them. Dice the tomatoes into large chunks. Cooking the Sauce Sauté the onion and garlic in olive oil. Finely chop the onion and mince the garlic. Put 4 tablespoons (60 milliliters) of extra virgin olive oil in a large saucepan. Heat the oil over medium heat until it begins to sizzle. Transfer the onion into the saucepan and cook for several minutes until it gets tender. Stir it often. You’ll know it’s ready when the onion is soft and looks slightly translucent. Add the minced garlic to the saucepan. Stir frequently. Sauté for about 60 seconds or until the garlic becomes fragrant. Add the tomato, seasoning and basil to the saucepan. Carefully add the diced, skinless tomatoes to the pan. Add a dash of sea salt and freshly ground black paper (to taste). Mince the basil and add half of it to the pan. Reserve the other half of the fresh basil for the end of the recipe. Stir the sauce well to make sure the basil properly mixes into the sauce. Reduce the heat to low and simmer the sauce. Once everything is added to the pot, reduce the heat to low. Allow the sauce to simmer uncovered for about 20 minutes. To simmer means to cook food at just below the boiling point. You'll know it’s simmering when you see a couple of small bubbles breaking the surface every 1 to 2 seconds. Adjust the heat up or down as necessary to maintain the simmer. Putting It All Together Check the consistency of the sauce. After simmering for 20 minutes, the sauce will have become quite a bit thicker. It will be fairly chunky and should appear to be a vibrantly red hue. If you prefer your sauce to be slightly thicker, continue to simmer it for another 10 minutes, stirring occasionally. The longer a sauce simmers, the thicker it becomes. When your sauce has reached your preferred consistency, stir the rest of the minced basil into the sauce. Remove the sauce from heat. Boil water and cook the pasta. Bring a pot of water to a boil and place the pasta of your choice in it to cook. Any kind of pasta will go well with this sauce – fettuccine, tagliatelle and spaghetti noodles are the most traditional options. Since all pastas differ in cook time, check the packaging of yours and follow the directions until the noodles are tender. Once the pasta noodles are done, remove the pot from heat. Drain the noodles well before plating them. Plate the pasta and ladle the sauce over the noodles. Carefully place a serving of pasta onto each plate. Use a large spoon or ladle to pour about ½ cup (118 milliliters) of the tomato sauce over each serving. Serve the dish with grated Parmesan or Pecorino Romano cheese. Garnish the plates with fresh basil leaves and/or lightly toasted pine nuts (optional). Thick, crusty garlic bread and a well-tossed Caesar salad would both compliment this dish (optional). Try a few variations. Consider substituting the pasta noodles with wheat pasta or gluten-free pasta. Add a few more fresh herbs to the sauce, such as rosemary and thyme, or use a small amount of additional fresh herbs to garnish each plate. You can easily add additional veggies to your sauce; mushrooms are very popular. Simply add them in right after you sauté the onions and garlic. Meatballs are another favorite addition to this sauce. Beef, pork, chicken and turkey are all great candidates for meatballs. Start by making your favorite version and then brown the meatballs. Put together the sauce and allow it to simmer for about 20 minutes. Add the browned meatballs to the sauce and simmer for an additional 30 minutes. For vegans, try substituting the cheese with nutritional yeast. Simply sprinkle a small amount on top of the noodles and sauce right before you serve the pasta. The yeast will add a cheesy richness to the dish. This tomato sauce would also work well on homemade pizzas or as a tasty dipping sauce for bread sticks.",
  "tyn_model":[
    "tomatoes",
    "water",
    "garlic",
    "basil",
    "onion",
    "saucepan",
    "pot",
    "“x",
    "colander",
    "tomato",
    "pasta",
    "tomato sauce",
    "spaghetti sauce",
    "“score",
    "” means",
    "” into",
    "” does",
    "vegetables",
    "strainer",
    "small knife",
    "knife",
    "olive oil",
    "extra virgin olive oil",
    "large saucepan",
    "oil",
    "sea salt",
    "freshly ground black paper",
    "– fettuccine",
    "spaghetti noodles",
    "spoon",
    "parmesan",
    "pine nuts",
    "garlic bread",
    "caesar salad",
    "rosemary",
    "thyme",
    "mushrooms",
    "onions",
    "meatballs",
    "nutritional yeast",
    "noodles",
    "yeast"
  ],
  "tyn_section":[

  ]
}