{
  "title":"How to Save Energy in the Office",
  "url":"https://www.wikihow.com/Save-Energy-in-the-Office",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling"
  ],
  "methods":[
    {
      "name":"Updating the Office Equipment",
      "steps":[
        {
          "headline":"Upgrade your office equipment to energy saving models.",
          "description":"Certain older models of computers, printers, copy machines, and other types of office equipment can use up to between 50 and 90 percent more energy than energy-efficient models. Look for office equipment with energy saving features, usually bearing the “Energy Star” logo. This certifies that the equipment is made to reduce energy usage. Energy Star certification can be found on computers, printers, copiers, refrigerators, televisions, windows, thermostats, and ceiling fans, as well as other appliances and equipment."
        },
        {
          "headline":"Remind everyone in the office to turn off their electronics at the end of the day.",
          "description":"It’s important that everyone also power down electronics when they are not in use. Contrary to popular belief, shutting off your computer at the end of the day will not shorten its lifespan and can save a lot of energy. It can also help to use a power strip for each group of electronics in the office. You can then use the strip’s on/off button to turn off the power to all the appliances at once when they are not in use. Remind everyone in the office to unplug \"vampire electronics\" once they are fully charged, like your cellphone or your laptop computer. Once your cellphone is fully charged, unplug the charger from the electrical outlet, as it will still draw in energy if it is left plugged in. You can also encourage everyone in the office to make sure their computers have the power down option set as well as the hibernation option set. Screen savers do not save energy. In fact, they are considered energy wasters. Your computer must provide twice as much energy to light up your computer screen when the screensaver option is turned on as it normally does when your computer is running. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tTry forming a green team in your office. A green team is typically a few people that get together once a month and discuss ways to make the office more eco-friendly. You can tackle things like trying to remove disposable items like paper plates and plastic spoons from the kitchen, as well as how to implement office composting and recycling programs."
        },
        {
          "headline":"Suggest switching to laptops and getting rid of desktops.",
          "description":"If your office is considering a computer upgrade, suggest switching to laptops instead of desktops. Laptops use much less energy than desktop computers."
        },
        {
          "headline":"Switch to green power in the office.",
          "description":"You can also suggest that your office switch to green power for all electricity in the office. Green Power is a program offered by some energy providers that can reduce your office’s carbon footprint. GreenPower providers are part of a government-accredited program to offer clean, renewable electricity in offices in an attempt to reduce greenhouse gas emissions. Your supervisor can contact your office’s energy company and ask them if they offer GreenPower for the office to reduce the office’s energy consumption on a day to day basis."
        }
      ]
    },
    {
      "name":"Adjusting the Office Environment",
      "steps":[
        {
          "headline":"Make sure all lights are turned off in your office at the end of the day.",
          "description":"To conserve electricity, create an office policy to ensure all the lights in your office are turned off, including lights in bathrooms, kitchen areas, and meeting rooms. You should also tell your employees to switch off lights in a room if they are going to be out of there for longer than a few minutes at a time. During the day, maximize natural daylight by using natural light instead of overhead or fluorescent lights. Turning off one fluorescent light for an hour a day can save 30 kg of carbon dioxide emissions per year. Consider areas in the office where there is excessive lighting or lights that are turned on in rooms that are barely used. Remove these lights or suggest not using lights if daylight is enough. As well, switch the light bulbs to energy-saving bulbs, such as compact fluorescent (CFL) or LED bulbs, to save more energy."
        },
        {
          "headline":"Install weather strips on doors and around windows.",
          "description":"This will prevent air from escaping your office when the air conditioner or heater is running, which can be especially important for offices located in regions of the country that experience extreme temperatures. You can also prevent drafts in the office by keeping the front doors of the office closed and making sure the door shuts firmly behind someone as they leave so heat or air does not escape to the outside. You should also clean and repair your office's heating, venting, and air conditioning (HVAC) system on a routine basis, or hire a repairman to come at least once a month. A clean and working HVAC system will help reduce your energy bills and make it easier for your office’s HVAC system to cool or heat your office. Make sure all air vents are clear of paper, files, and other office supplies. Blocked air vents means your HVAC system has to work harder and use more energy to circulate cold or warm air in the office."
        },
        {
          "headline":"Modify the temperature in the office based on the season.",
          "description":"Conserve your heat energy by setting the thermostat in the office at different temperatures in the winter and in the summer. In the winter, set the thermostat at 68 degrees or less during the day and at 55 degrees at night when no one is in the office. In the summer, setting the thermostat at 78 degrees or more will also help to reduce energy use in the office. During the winter, keep shades and blinds open in the office during a sunny day. This will heat the room naturally. Close the blinds at night to reduce the amount of heat lost via the windows. In the summer, keep shades and blinds closed to avoid overheating the room. As well, after office hours and during weekends, energy can be saved by increasing the temperature of the thermostat during hot weather, and by lowering the temperature in cold weather."
        }
      ]
    }
  ],
  "text":" Updating the Office Equipment Upgrade your office equipment to energy saving models. Certain older models of computers, printers, copy machines, and other types of office equipment can use up to between 50 and 90 percent more energy than energy-efficient models. Look for office equipment with energy saving features, usually bearing the “Energy Star” logo. This certifies that the equipment is made to reduce energy usage. Energy Star certification can be found on computers, printers, copiers, refrigerators, televisions, windows, thermostats, and ceiling fans, as well as other appliances and equipment. Remind everyone in the office to turn off their electronics at the end of the day. It’s important that everyone also power down electronics when they are not in use. Contrary to popular belief, shutting off your computer at the end of the day will not shorten its lifespan and can save a lot of energy. It can also help to use a power strip for each group of electronics in the office. You can then use the strip’s on/off button to turn off the power to all the appliances at once when they are not in use. Remind everyone in the office to unplug \"vampire electronics\" once they are fully charged, like your cellphone or your laptop computer. Once your cellphone is fully charged, unplug the charger from the electrical outlet, as it will still draw in energy if it is left plugged in. You can also encourage everyone in the office to make sure their computers have the power down option set as well as the hibernation option set. Screen savers do not save energy. In fact, they are considered energy wasters. Your computer must provide twice as much energy to light up your computer screen when the screensaver option is turned on as it normally does when your computer is running. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tTry forming a green team in your office. A green team is typically a few people that get together once a month and discuss ways to make the office more eco-friendly. You can tackle things like trying to remove disposable items like paper plates and plastic spoons from the kitchen, as well as how to implement office composting and recycling programs. Suggest switching to laptops and getting rid of desktops. If your office is considering a computer upgrade, suggest switching to laptops instead of desktops. Laptops use much less energy than desktop computers. Switch to green power in the office. You can also suggest that your office switch to green power for all electricity in the office. Green Power is a program offered by some energy providers that can reduce your office’s carbon footprint. GreenPower providers are part of a government-accredited program to offer clean, renewable electricity in offices in an attempt to reduce greenhouse gas emissions. Your supervisor can contact your office’s energy company and ask them if they offer GreenPower for the office to reduce the office’s energy consumption on a day to day basis. Adjusting the Office Environment Make sure all lights are turned off in your office at the end of the day. To conserve electricity, create an office policy to ensure all the lights in your office are turned off, including lights in bathrooms, kitchen areas, and meeting rooms. You should also tell your employees to switch off lights in a room if they are going to be out of there for longer than a few minutes at a time. During the day, maximize natural daylight by using natural light instead of overhead or fluorescent lights. Turning off one fluorescent light for an hour a day can save 30 kg of carbon dioxide emissions per year. Consider areas in the office where there is excessive lighting or lights that are turned on in rooms that are barely used. Remove these lights or suggest not using lights if daylight is enough. As well, switch the light bulbs to energy-saving bulbs, such as compact fluorescent (CFL) or LED bulbs, to save more energy. Install weather strips on doors and around windows. This will prevent air from escaping your office when the air conditioner or heater is running, which can be especially important for offices located in regions of the country that experience extreme temperatures. You can also prevent drafts in the office by keeping the front doors of the office closed and making sure the door shuts firmly behind someone as they leave so heat or air does not escape to the outside. You should also clean and repair your office's heating, venting, and air conditioning (HVAC) system on a routine basis, or hire a repairman to come at least once a month. A clean and working HVAC system will help reduce your energy bills and make it easier for your office’s HVAC system to cool or heat your office. Make sure all air vents are clear of paper, files, and other office supplies. Blocked air vents means your HVAC system has to work harder and use more energy to circulate cold or warm air in the office. Modify the temperature in the office based on the season. Conserve your heat energy by setting the thermostat in the office at different temperatures in the winter and in the summer. In the winter, set the thermostat at 68 degrees or less during the day and at 55 degrees at night when no one is in the office. In the summer, setting the thermostat at 78 degrees or more will also help to reduce energy use in the office. During the winter, keep shades and blinds open in the office during a sunny day. This will heat the room naturally. Close the blinds at night to reduce the amount of heat lost via the windows. In the summer, keep shades and blinds closed to avoid overheating the room. As well, after office hours and during weekends, energy can be saved by increasing the temperature of the thermostat during hot weather, and by lowering the temperature in cold weather.",
  "tyn_model":[
    "green power",
    "thermostat",
    "computers",
    "printers",
    "“energy",
    "” logo",
    "energy star",
    "copiers",
    "refrigerators",
    "televisions",
    "thermostats",
    "computer",
    "power strip",
    "charger",
    "electrical outlet",
    "eco-friendly living",
    "plates",
    "natural light",
    "compact fluorescent (cfl) or led bulbs",
    "air conditioner",
    "heater",
    "heating, venting, and air conditioning",
    "shades"
  ],
  "tyn_section":[

  ]
}