{
  "title":"How to Find Discount Craft Supplies",
  "url":"https://www.wikihow.com/Find-Discount-Craft-Supplies",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "steps":[
    {
      "headline":"Get to know the basic prices for the craft supplies you use.",
      "description":"This is especially important if you are just beginning a new craft. If you know what everyday prices are, you know what a good discount will be."
    },
    {
      "headline":"Clip coupons in your Sunday paper or online.",
      "description":"Most craft stores, such as Michael's and JoAnn's Fabrics feature coupons that are worth 20 to 75 percent off items. This is especially popular if you are looking to buy fabric or scrapbooking materials. Go online to coupon websites, such as coupons.com. couponcabin.com, smartsource.com, retailmenot.com and couponmom.com to see if there are any applicable coupons. These are usually good for online purchases and they can be put in an online form just before purchase. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/d\\/df\\/Find-Discount-Craft-Supplies-Step-2Bullet1.jpg\\/v4-460px-Find-Discount-Craft-Supplies-Step-2Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/d\\/df\\/Find-Discount-Craft-Supplies-Step-2Bullet1.jpg\\/v4-760px-Find-Discount-Craft-Supplies-Step-2Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
    },
    {
      "headline":"Buy batting online or from Walmart or other large discount stores, instead of buying it from a local craft store.",
      "description":""
    },
    {
      "headline":"Buy your craft supplies out of season.",
      "description":"Go out in January to look for Christmas crafting material. Shop each month after a holiday or season and store them until you are ready to use them."
    },
    {
      "headline":"Check the clearance sections of your favorite craft supply sites or stores.",
      "description":"These areas will often feature scrapbooking materials that are out of season. Storing up early will help you to store and save discount crafts. The clearance section is often at the end of the aisles or an aisle on its own. Even larger box stores like Target, Tesco and more have discount craft supplies at the end of the aisles. Keep an eye on these sections throughout the year."
    },
    {
      "headline":"Shop online on sites like Amazon.com, Overstock.com.",
      "description":"save-on-crafts.com or discountschoolsupply.com. Sign up for email newsletters that will let you know when there are large sales. Set Google Alerts for your favorite websites; you can specify a site and search terms, such as sale and scrap-booking."
    },
    {
      "headline":"Buy in bulk in places like Sam's Club and Costco.",
      "description":"These places offer top-grade office supplies in large quantities at a discount from most office supply stores."
    },
    {
      "headline":"Get refillable ink cartridges.",
      "description":"Buying ink cartridges for your printer can cost anywhere from $10 to $50 for a single cartridge, depending upon the type of printer you have. Investing in refillable cartridges can save up to 75 percent off those prices."
    },
    {
      "headline":"Request catalogs for places like Sunshine Discount Crafts and Oriental Trading Company.",
      "description":"The catalogs offer bulk party decorations and craft supplies throughout the year and for all holidays."
    }
  ],
  "text":" Get to know the basic prices for the craft supplies you use. This is especially important if you are just beginning a new craft. If you know what everyday prices are, you know what a good discount will be. Clip coupons in your Sunday paper or online. Most craft stores, such as Michael's and JoAnn's Fabrics feature coupons that are worth 20 to 75 percent off items. This is especially popular if you are looking to buy fabric or scrapbooking materials. Go online to coupon websites, such as coupons.com. couponcabin.com, smartsource.com, retailmenot.com and couponmom.com to see if there are any applicable coupons. These are usually good for online purchases and they can be put in an online form just before purchase. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/d\\/df\\/Find-Discount-Craft-Supplies-Step-2Bullet1.jpg\\/v4-460px-Find-Discount-Craft-Supplies-Step-2Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/d\\/df\\/Find-Discount-Craft-Supplies-Step-2Bullet1.jpg\\/v4-760px-Find-Discount-Craft-Supplies-Step-2Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Buy batting online or from Walmart or other large discount stores, instead of buying it from a local craft store.  Buy your craft supplies out of season. Go out in January to look for Christmas crafting material. Shop each month after a holiday or season and store them until you are ready to use them. Check the clearance sections of your favorite craft supply sites or stores. These areas will often feature scrapbooking materials that are out of season. Storing up early will help you to store and save discount crafts. The clearance section is often at the end of the aisles or an aisle on its own. Even larger box stores like Target, Tesco and more have discount craft supplies at the end of the aisles. Keep an eye on these sections throughout the year. Shop online on sites like Amazon.com, Overstock.com. save-on-crafts.com or discountschoolsupply.com. Sign up for email newsletters that will let you know when there are large sales. Set Google Alerts for your favorite websites; you can specify a site and search terms, such as sale and scrap-booking. Buy in bulk in places like Sam's Club and Costco. These places offer top-grade office supplies in large quantities at a discount from most office supply stores. Get refillable ink cartridges. Buying ink cartridges for your printer can cost anywhere from $10 to $50 for a single cartridge, depending upon the type of printer you have. Investing in refillable cartridges can save up to 75 percent off those prices. Request catalogs for places like Sunshine Discount Crafts and Oriental Trading Company. The catalogs offer bulk party decorations and craft supplies throughout the year and for all holidays.",
  "tyn_model":[
    "printer",
    "coupons",
    "fabric",
    "coupon",
    "parser",
    "scrap-",
    "ink cartridges",
    "oriental trading"
  ],
  "tyn_section":[

  ]
}