{
  "title":"How to Dye Pasta For Crafts",
  "url":"https://www.wikihow.com/Dye-Pasta-For-Crafts",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids",
    "Food Crafts"
  ],
  "steps":[
    {
      "headline":"Gather as many bowls as colors you plan to dye.",
      "description":"You can also use medium to large-sized bags, as long as they seal very tightly."
    },
    {
      "headline":"Fill each bowl or bag 3/4 full of the pasta you would like to use.",
      "description":"This will vary greatly on the amount of pasta you need for your projects. If you are doing crafts, you may only need 1/2 cup of pasta for each bowl, but if you are doing projects for a classroom, you may want to fill a large bag with a pack of pasta."
    },
    {
      "headline":"Fill the bowl or bag with alcohol or vinegar.",
      "description":"Most sources suggest alcohol is the most effective. This is also called alcohol when it is sold in stores. The liquid should cover all or most of the pasta."
    },
    {
      "headline":"Add your coloring.",
      "description":"You should buy the drops, rather than the type. If you used about 1/2 cup (58 g) of alcohol, you should use drops of coloring. Increase the number of drops according to the amount of alcohol you used. If you want to have very colors, use a few drops."
    },
    {
      "headline":"Place the bags or bowls on top of a sheet so they are easy to use and set out of the way.",
      "description":"You will need to store them overnight so you need to make sure they cannot be spilled. Allow them to sit for 8 hours."
    },
    {
      "headline":"Stir the bowls or shake the bags occasionally so that you can make sure the inside and outside of the pasta is dyed.",
      "description":""
    },
    {
      "headline":"Strain the liquid out of the bowl.",
      "description":"If you are using a bag, you can puncture a hole in it over the sink and allow it to drain out."
    },
    {
      "headline":"Place a layer of towels on top of your sheets.",
      "description":"Lay each color of pasta onto a separate sheet to dry. Allow it to dry for 2 hours, depending upon how much pasta you used."
    },
    {
      "headline":"String them onto necklaces or glue them onto paper in order to complete arts and crafts with children.",
      "description":"They are versatile and can be saved for months without fading. However, they should not be eaten once dyed because of the alcohol."
    }
  ],
  "text":" Gather as many bowls as colors you plan to dye. You can also use medium to large-sized bags, as long as they seal very tightly. Fill each bowl or bag 3/4 full of the pasta you would like to use. This will vary greatly on the amount of pasta you need for your projects. If you are doing crafts, you may only need 1/2 cup of pasta for each bowl, but if you are doing projects for a classroom, you may want to fill a large bag with a pack of pasta. Fill the bowl or bag with alcohol or vinegar. Most sources suggest alcohol is the most effective. This is also called alcohol when it is sold in stores. The liquid should cover all or most of the pasta. Add your coloring. You should buy the drops, rather than the type. If you used about 1/2 cup (58 g) of alcohol, you should use drops of coloring. Increase the number of drops according to the amount of alcohol you used. If you want to have very colors, use a few drops. Place the bags or bowls on top of a sheet so they are easy to use and set out of the way. You will need to store them overnight so you need to make sure they cannot be spilled. Allow them to sit for 8 hours. Stir the bowls or shake the bags occasionally so that you can make sure the inside and outside of the pasta is dyed.  Strain the liquid out of the bowl. If you are using a bag, you can puncture a hole in it over the sink and allow it to drain out. Place a layer of towels on top of your sheets. Lay each color of pasta onto a separate sheet to dry. Allow it to dry for 2 hours, depending upon how much pasta you used. String them onto necklaces or glue them onto paper in order to complete arts and crafts with children. They are versatile and can be saved for months without fading. However, they should not be eaten once dyed because of the alcohol.",
  "tyn_model":[
    "pasta",
    "alcohol",
    "bowl",
    "bowls",
    "coloring",
    "vinegar",
    "sink",
    "towels"
  ],
  "tyn_section":[

  ]
}