{
  "title":"How to Bread Pork Chops",
  "url":"https://www.wikihow.com/Bread-Pork-Chops",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Pork",
    "Pork Chops"
  ],
  "steps":[
    {
      "headline":"Place enough flour to coat pork chops in a pie pan or flat dish.",
      "description":"Use approximately 1 cup of flour for every 4 to 5 pork chops."
    },
    {
      "headline":"Fill another dish with enough breadcrumbs to coat the pork chops.",
      "description":"Use approximately 2 cups of breadcrumbs for every 4 to 5 pork chops. Use more breadcrumbs than you think you will need. It takes more breadcrumbs than flour to achieve total coverage of all the pork chops."
    },
    {
      "headline":"Season the flour and/or the breadcrumbs.",
      "description":"Use approximately 2 tablespoons of mild dried herbs and spices for each cup of flour, and 3 tablespoons for each cup of breadcrumbs. You may want to start off seasoning just one of the two mixes until you determine your ideal balance in taste. Typical seasonings for pork chop breading include salt, black pepper, sage, thyme, paprika, Italian spice mix, and garlic powder. You can experiment with using both fresh and dried herbs, but if you’re frying the meat instead of baking it, be cautious with the amount of fresh herbs you use because they can burn quickly and leave a bitter taste to the meat."
    },
    {
      "headline":"Using a fork, beat 1 egg per 2 pork chops in a wide-rimmed bowl or upturned plate.",
      "description":""
    },
    {
      "headline":"Use your left hand, which will be your dry hand, to cake each chop with the flour.",
      "description":"To avoid a pasty taste and lumpy texture, shake off the excess flour before moving onto the next step in the process."
    },
    {
      "headline":"Pick up the chop with your left hand and transfer it to your right hand.",
      "description":""
    },
    {
      "headline":"Use your right hand, which will be your wet hand, to dunk the floured pork chop in the beaten egg.",
      "description":""
    },
    {
      "headline":"Move the chop from the egg to the dish of breadcrumbs with your right hand.",
      "description":""
    },
    {
      "headline":"Encrust the pork chop with the breadcrumbs using your left hand and pat them firmly into the meat.",
      "description":""
    },
    {
      "headline":"Use your left hand to lift the breaded pork chop out of the breadcrumb dish and onto a waiting platter.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Place enough flour to coat pork chops in a pie pan or flat dish. Use approximately 1 cup of flour for every 4 to 5 pork chops. Fill another dish with enough breadcrumbs to coat the pork chops. Use approximately 2 cups of breadcrumbs for every 4 to 5 pork chops. Use more breadcrumbs than you think you will need. It takes more breadcrumbs than flour to achieve total coverage of all the pork chops. Season the flour and/or the breadcrumbs. Use approximately 2 tablespoons of mild dried herbs and spices for each cup of flour, and 3 tablespoons for each cup of breadcrumbs. You may want to start off seasoning just one of the two mixes until you determine your ideal balance in taste. Typical seasonings for pork chop breading include salt, black pepper, sage, thyme, paprika, Italian spice mix, and garlic powder. You can experiment with using both fresh and dried herbs, but if you’re frying the meat instead of baking it, be cautious with the amount of fresh herbs you use because they can burn quickly and leave a bitter taste to the meat. Using a fork, beat 1 egg per 2 pork chops in a wide-rimmed bowl or upturned plate.  Use your left hand, which will be your dry hand, to cake each chop with the flour. To avoid a pasty taste and lumpy texture, shake off the excess flour before moving onto the next step in the process. Pick up the chop with your left hand and transfer it to your right hand.  Use your right hand, which will be your wet hand, to dunk the floured pork chop in the beaten egg.  Move the chop from the egg to the dish of breadcrumbs with your right hand.  Encrust the pork chop with the breadcrumbs using your left hand and pat them firmly into the meat.  Use your left hand to lift the breaded pork chop out of the breadcrumb dish and onto a waiting platter.  Finished. ",
  "tyn_model":[
    "breadcrumbs",
    "flour",
    "herbs",
    "pie pan or flat dish",
    "mild dried herbs",
    "spices",
    "pork chop breading",
    "salt",
    "black pepper",
    "sage",
    "thyme",
    "paprika",
    "italian spice mix",
    "garlic powder",
    "fork",
    "egg",
    "breadcrumb dish",
    "platter"
  ],
  "tyn_section":[

  ]
}