{
  "title":"How to Season a Turkey Breast",
  "url":"https://www.wikihow.com/Season-a-Turkey-Breast",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "steps":[
    {
      "headline":"Combine enough salt and poultry seasoning in a small bowl to cover twice the surface area of your turkey breast.",
      "description":"Use roughly 1/3 salt and 2/3 poultry seasoning. Start with 1/3 cup salt to 2/3 cup other seasonings and then make more if you run out."
    },
    {
      "headline":"Add olive oil to the bowl to form a spreadable paste.",
      "description":"Alternatively, you can rub the turkey breast with oil before rubbing it with the salt mix instead of adding the salt directly to the spices. If you’re using garlic as well to season your turkey breast, you can add a tablespoon of crushed garlic to the mix at this stage of the process."
    },
    {
      "headline":"Place the whole turkey breast, skin side up, on a rack set over a plate.",
      "description":""
    },
    {
      "headline":"Wipe the turkey breast dry with paper towels before seasoning it.",
      "description":""
    },
    {
      "headline":"Loosen the turkey skin from the meat.",
      "description":"Use a thumb or forefinger to gently pry the skin up and away, leaving it connected to the meat at the edges."
    },
    {
      "headline":"Spread half of the seasoning paste underneath the skin in an even layer with your fingers.",
      "description":"If you chose to rub the breast with oil before rubbing it with the seasonings, make sure to massage some oil into the meat beneath the skin as well."
    },
    {
      "headline":"Spread the remainder of the seasoning paste on top of the skin and rub it in making sure to coat the whole breast.",
      "description":""
    },
    {
      "headline":"Transfer the breast and the rack into a roasting pan and allow the turkey breast to rest, seasoned, at room temperature for 1 hour before cooking.",
      "description":"For better flavor, put the turkey breast in the refrigerator overnight. The next day, let the meat reach room temperature again before roasting."
    }
  ],
  "text":" Combine enough salt and poultry seasoning in a small bowl to cover twice the surface area of your turkey breast. Use roughly 1/3 salt and 2/3 poultry seasoning. Start with 1/3 cup salt to 2/3 cup other seasonings and then make more if you run out. Add olive oil to the bowl to form a spreadable paste. Alternatively, you can rub the turkey breast with oil before rubbing it with the salt mix instead of adding the salt directly to the spices. If you’re using garlic as well to season your turkey breast, you can add a tablespoon of crushed garlic to the mix at this stage of the process. Place the whole turkey breast, skin side up, on a rack set over a plate.  Wipe the turkey breast dry with paper towels before seasoning it.  Loosen the turkey skin from the meat. Use a thumb or forefinger to gently pry the skin up and away, leaving it connected to the meat at the edges. Spread half of the seasoning paste underneath the skin in an even layer with your fingers. If you chose to rub the breast with oil before rubbing it with the seasonings, make sure to massage some oil into the meat beneath the skin as well. Spread the remainder of the seasoning paste on top of the skin and rub it in making sure to coat the whole breast.  Transfer the breast and the rack into a roasting pan and allow the turkey breast to rest, seasoned, at room temperature for 1 hour before cooking. For better flavor, put the turkey breast in the refrigerator overnight. The next day, let the meat reach room temperature again before roasting.",
  "tyn_model":[
    "salt",
    "oil",
    "poultry seasoning",
    "small bowl",
    "olive oil",
    "bowl",
    "salt mix",
    "garlic",
    "crushed garlic",
    "plate",
    "paper towels",
    "seasonings",
    "roasting pan",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}