{
  "title":"How to Make Vegan Southern Style Collard Greens",
  "url":"https://www.wikihow.com/Make-Vegan-Southern-Style-Collard-Greens",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan"
  ],
  "methods":[
    {
      "name":"Prepare the Greens",
      "steps":[
        {
          "headline":"Fill a large bowl with cold water.",
          "description":""
        },
        {
          "headline":"Place greens in the bowl.",
          "description":"Some water may overflow if you overfilled the bowl, so it’s a good idea to place the bowl in the sink before submerging the greens."
        },
        {
          "headline":"Swirl the greens around to loosen the dirt on them and then let the water settle for the sediment to drop to the bottom of the bowl.",
          "description":""
        },
        {
          "headline":"Empty and rinse the bowl and repeat the process once more to ensure that each batch of greens is clean.",
          "description":"You may need to repeat this process on each batch more than once if you’re still finding sediment in the bowl after each wash."
        },
        {
          "headline":"Dry the greens a bit by letting them drain on a clean dish rack.",
          "description":""
        },
        {
          "headline":"To start to devein the leaves, take one collard green leaf and bend it in half along the vein.",
          "description":""
        },
        {
          "headline":"Rip the leaves from the vein.",
          "description":"Discard the vein and place the torn leaves in a separate bowl. Repeat this process until all of your greens are trimmed."
        }
      ]
    },
    {
      "name":"Cooking the Greens",
      "steps":[
        {
          "headline":"Heat a nonstick skillet over medium-high heat and pour oil or vegan butter into the pan.",
          "description":"Allow it to heat without burning, turning the pan frequently to distribute the oil or vegan butter over the bottom of it."
        },
        {
          "headline":"Place the garlic into the hot oil or butter.",
          "description":"Reduce the heat to medium. Stir the garlic frequently to prevent burning."
        },
        {
          "headline":"Place one batch of collard greens into the skillet.",
          "description":"Allow the greens to wilt completely before adding another batch. Mix them with a spatula or a wooden spool."
        },
        {
          "headline":"Season liberally with salt and pepper.",
          "description":"Serve the greens immediately or cover the greens to keep them warm."
        },
        {
          "headline":"Add your pepper flakes to the greens before serving if you’re making the spicy version of this dish.",
          "description":""
        }
      ]
    }
  ],
  "text":" Prepare the Greens Fill a large bowl with cold water.  Place greens in the bowl. Some water may overflow if you overfilled the bowl, so it’s a good idea to place the bowl in the sink before submerging the greens. Swirl the greens around to loosen the dirt on them and then let the water settle for the sediment to drop to the bottom of the bowl.  Empty and rinse the bowl and repeat the process once more to ensure that each batch of greens is clean. You may need to repeat this process on each batch more than once if you’re still finding sediment in the bowl after each wash. Dry the greens a bit by letting them drain on a clean dish rack.  To start to devein the leaves, take one collard green leaf and bend it in half along the vein.  Rip the leaves from the vein. Discard the vein and place the torn leaves in a separate bowl. Repeat this process until all of your greens are trimmed. Cooking the Greens Heat a nonstick skillet over medium-high heat and pour oil or vegan butter into the pan. Allow it to heat without burning, turning the pan frequently to distribute the oil or vegan butter over the bottom of it. Place the garlic into the hot oil or butter. Reduce the heat to medium. Stir the garlic frequently to prevent burning. Place one batch of collard greens into the skillet. Allow the greens to wilt completely before adding another batch. Mix them with a spatula or a wooden spool. Season liberally with salt and pepper. Serve the greens immediately or cover the greens to keep them warm. Add your pepper flakes to the greens before serving if you’re making the spicy version of this dish. ",
  "tyn_model":[
    "bowl",
    "water",
    "oil or vegan butter",
    "garlic",
    "large bowl",
    "cold water",
    "collard green leaf",
    "nonstick skillet",
    "oil or butter",
    "collard greens",
    "skillet",
    "spatula",
    "wooden spool",
    "salt and pepper",
    "pepper flakes"
  ],
  "tyn_section":[

  ]
}