{
  "title":"How to Make Peppermint Hot Chocolate",
  "url":"https://www.wikihow.com/Make-Peppermint-Hot-Chocolate",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Chocolate and Cocoa Drinks"
  ],
  "methods":[
    {
      "name":"Making Simple Peppermint Hot Chocolate",
      "steps":[
        {
          "headline":"Tear open a packet of hot cocoa mix and pour the powder into a mug.",
          "description":"If your hot cocoa mix comes in a box, measure out 2 tablespoons. Adding the powder first will help it mix better when you add the milk, water, or coffee."
        },
        {
          "headline":"Crush a candy cane into small pieces.",
          "description":"Put a candy cane in a plastic, resealable bag. Whack the candy with a hammer or rolling pin until it breaks into small pieces. Try to use the kind of zippered bag you'd put into your freezer. It'll be more durable because it is made from thicker plastic."
        },
        {
          "headline":"Add the crushed candy cane into the mug.",
          "description":"Unzip the plastic bag, and carefully tip the crushed candy into the mug. Consider saving a little bit to use as a garnish later."
        },
        {
          "headline":"Heat 1 cup (240 milliliters) of water, milk, or coffee.",
          "description":"Any of the three will work. Water will give you the most basic cocoa, while milk will give you the richest. If you like coffee, you might like a peppermint mocha instead. Whatever you choose to use must be very hot or the powder won't dissolve well. Heat water in a kettle or in the microwave (about 1 to 2 minutes). This will give you a lighter hot cocoa. Heat milk in a saucepan or in the microwave(about 1 to 2 minutes). This will give you a richer, creamer hot cocoa. Brew a cup of coffee if you want a peppermint mocha. For a richer peppermint mocha, add a splash of milk or half-and-half."
        },
        {
          "headline":"Pour the hot liquid into the mug.",
          "description":"Don't worry if you see the cocoa powder float to the top."
        },
        {
          "headline":"Stir with a spoon until everything is mixed together.",
          "description":"Keep stirring until the cocoa powder and candy dissolve completely. You should not see any powdery clumps of cocoa or candy pieces."
        },
        {
          "headline":"Garnish and serve the hot chocolate.",
          "description":"Add a swirl of whipped cream on top of the hot chocolate. For a pop of color, sprinkle some more crushed candy pieces on top. If you don't like whipped cream, plop in a few marshmallows instead. If you have any extra candy canes, you can stick it into the hot chocolate, and use it to stir."
        }
      ]
    },
    {
      "name":"Making Peppermint Hot Chocolate from Scratch",
      "steps":[
        {
          "headline":"Pour 2 cups (475 milliliters) of milk into a small saucepan.",
          "description":"You can use any type of milk you want, but whole milk will give you a richer hot chocolate than skim milk."
        },
        {
          "headline":"Break the chocolate into smaller pieces.",
          "description":"You can use your fingers, or whack it a few times with a rolling pin. Breaking the chocolate into smaller pieces will help it melt faster. You can also use chocolate chips instead."
        },
        {
          "headline":"Add the chocolate to the saucepan.",
          "description":"The chocolate will give you a richer hot chocolate once it melts, as opposed to powdered cocoa."
        },
        {
          "headline":"Heat the chocolate and milk over low heat until the chocolate melts.",
          "description":"Stir the mixture from time to time so that it does not scorch. You can use a whisk or spatula. Don't let it come to a boil, or the chocolate will burn."
        },
        {
          "headline":"Add the sugar and peppermint extract.",
          "description":"This will give you that peppermint taste. If you want your hot chocolate to be less sweet, you can use less sugar, or skip it."
        },
        {
          "headline":"Stir the mixture until the sugar dissolves.",
          "description":"Keep an eye on the saucepan, and don't let the sugar burn. If it does, it will caramelize and ruin the flavor."
        },
        {
          "headline":"Pour the hot chocolate into 2 mugs.",
          "description":"You can pour directly from the pot and into the mugs. If the pot is too heavy for you, use a soup ladle to scoop the hot chocolate out, and pour it into the mugs."
        },
        {
          "headline":"Garnish and serve the hot chocolate.",
          "description":"Swirl some whipped cream on top of the hot chocolate, and add a sprinkle of crushed candy cane. If you don't like whipped cream, toss in a few marshmallows instead. For a more festive treat, stick a candy cane into the hot chocolate."
        }
      ]
    },
    {
      "name":"Making White Peppermint Hot Chocolate",
      "steps":[
        {
          "headline":"Pour the milk into a medium saucepan.",
          "description":"You can use any type of milk you want, but whole milk will give you a creamier hot chocolate than skim."
        },
        {
          "headline":"Break the chocolate into smaller pieces.",
          "description":"This will help it melt faster. You can break it apart using your fingers, or whack it with a rolling pin a few times. You can also use chocolate chips instead."
        },
        {
          "headline":"Add the chocolate to the saucepan.",
          "description":"Hot chocolate made from melted chocolate is richer than the kind made from a powder.."
        },
        {
          "headline":"Heat the milk and chocolate over medium-low heat until it begins to simmer.",
          "description":"Stir from time to time with a whisk or spatula so that it does not scorch. Don't let it come to a boil."
        },
        {
          "headline":"Remove the saucepan from the stove once the chocolate melts.",
          "description":"Set it down on a heat-safe surface."
        },
        {
          "headline":"Stir in the peppermint and vanilla extracts.",
          "description":"You are adding the vanilla extract to help give the white chocolate some flavor, so that it does not taste too much like milk. If you'd like a more minty flavor, use a little bit more peppermint extract."
        },
        {
          "headline":"Pour the mixture into 2 mugs.",
          "description":"Simply pour the hot chocolate straight from the pot and into the mugs. If the saucepan is too heavy for you to lift, use a soup ladle to scoop up the hot chocolate, and transfer it to the mugs."
        },
        {
          "headline":"Garnish and serve the hot chocolate.",
          "description":"Marshmallows go well with hot chocolate, but you can also top it with whipped cream instead. If you really want to get fancy, sprinkle some crushed peppermint candy can over the whipped cream. If you have any candy canes, you can stick it into the hot chocolate as a final touch."
        }
      ]
    },
    {
      "name":"Making Vegan Peppermint Hot Chocolate",
      "steps":[
        {
          "headline":"Add the coconut oil, cocoa powder, maple syrup, and sea salt into a small saucepan.",
          "description":"The coconut oil will give the hot chocolate a creamier texture. The sea salt will help cut down on the sweetness, and bring out the flavor of the chocolate. If you like your drinks really sweet, omit the sea salt. Make sure that you use refined coconut oil, or you will get a coconut flavor, which may not work well with peppermint."
        },
        {
          "headline":"Stir the ingredients together until they are smooth.",
          "description":"Because you are working with such small amounts, you might want to use a spoon or fork. Don't worry about turning the heat on just yet."
        },
        {
          "headline":"Add the nondairy milk.",
          "description":"You can use whatever milk you like, such as almond or soy. If you are simply allergic to dairy (and not vegan) you might like lactose-free cow's milk."
        },
        {
          "headline":"Turn the heat to low, and cook for 5 minutes.",
          "description":"Stir the mixture with a whisk to keep it from scorching."
        },
        {
          "headline":"Remove from heat and stir in the peppermint extract.",
          "description":"Place the saucepan down on a heat-safe surface first, then add the peppermint extract. Give the hot chocolate a final stir so that it mixes in evenly."
        },
        {
          "headline":"Pour the mixture into 2 mugs.",
          "description":"If the saucepan is too heavy, use a soup ladle to transfer the hot chocolate from pot to mug."
        },
        {
          "headline":"Garnish and serve.",
          "description":"Add a swirl of dairy-free whipped cream on top and sprinkle some crushed peppermint candy pieces on top. If you don't like whipped cream, plop in a few vegan marshmallows instead. If you have any candy canes, stick one into each mug for a festive touch."
        }
      ]
    }
  ],
  "text":" Making Simple Peppermint Hot Chocolate Tear open a packet of hot cocoa mix and pour the powder into a mug. If your hot cocoa mix comes in a box, measure out 2 tablespoons. Adding the powder first will help it mix better when you add the milk, water, or coffee. Crush a candy cane into small pieces. Put a candy cane in a plastic, resealable bag. Whack the candy with a hammer or rolling pin until it breaks into small pieces. Try to use the kind of zippered bag you'd put into your freezer. It'll be more durable because it is made from thicker plastic. Add the crushed candy cane into the mug. Unzip the plastic bag, and carefully tip the crushed candy into the mug. Consider saving a little bit to use as a garnish later. Heat 1 cup (240 milliliters) of water, milk, or coffee. Any of the three will work. Water will give you the most basic cocoa, while milk will give you the richest. If you like coffee, you might like a peppermint mocha instead. Whatever you choose to use must be very hot or the powder won't dissolve well. Heat water in a kettle or in the microwave (about 1 to 2 minutes). This will give you a lighter hot cocoa. Heat milk in a saucepan or in the microwave(about 1 to 2 minutes). This will give you a richer, creamer hot cocoa. Brew a cup of coffee if you want a peppermint mocha. For a richer peppermint mocha, add a splash of milk or half-and-half. Pour the hot liquid into the mug. Don't worry if you see the cocoa powder float to the top. Stir with a spoon until everything is mixed together. Keep stirring until the cocoa powder and candy dissolve completely. You should not see any powdery clumps of cocoa or candy pieces. Garnish and serve the hot chocolate. Add a swirl of whipped cream on top of the hot chocolate. For a pop of color, sprinkle some more crushed candy pieces on top. If you don't like whipped cream, plop in a few marshmallows instead. If you have any extra candy canes, you can stick it into the hot chocolate, and use it to stir. Making Peppermint Hot Chocolate from Scratch Pour 2 cups (475 milliliters) of milk into a small saucepan. You can use any type of milk you want, but whole milk will give you a richer hot chocolate than skim milk. Break the chocolate into smaller pieces. You can use your fingers, or whack it a few times with a rolling pin. Breaking the chocolate into smaller pieces will help it melt faster. You can also use chocolate chips instead. Add the chocolate to the saucepan. The chocolate will give you a richer hot chocolate once it melts, as opposed to powdered cocoa. Heat the chocolate and milk over low heat until the chocolate melts. Stir the mixture from time to time so that it does not scorch. You can use a whisk or spatula. Don't let it come to a boil, or the chocolate will burn. Add the sugar and peppermint extract. This will give you that peppermint taste. If you want your hot chocolate to be less sweet, you can use less sugar, or skip it. Stir the mixture until the sugar dissolves. Keep an eye on the saucepan, and don't let the sugar burn. If it does, it will caramelize and ruin the flavor. Pour the hot chocolate into 2 mugs. You can pour directly from the pot and into the mugs. If the pot is too heavy for you, use a soup ladle to scoop the hot chocolate out, and pour it into the mugs. Garnish and serve the hot chocolate. Swirl some whipped cream on top of the hot chocolate, and add a sprinkle of crushed candy cane. If you don't like whipped cream, toss in a few marshmallows instead. For a more festive treat, stick a candy cane into the hot chocolate. Making White Peppermint Hot Chocolate Pour the milk into a medium saucepan. You can use any type of milk you want, but whole milk will give you a creamier hot chocolate than skim. Break the chocolate into smaller pieces. This will help it melt faster. You can break it apart using your fingers, or whack it with a rolling pin a few times. You can also use chocolate chips instead. Add the chocolate to the saucepan. Hot chocolate made from melted chocolate is richer than the kind made from a powder.. Heat the milk and chocolate over medium-low heat until it begins to simmer. Stir from time to time with a whisk or spatula so that it does not scorch. Don't let it come to a boil. Remove the saucepan from the stove once the chocolate melts. Set it down on a heat-safe surface. Stir in the peppermint and vanilla extracts. You are adding the vanilla extract to help give the white chocolate some flavor, so that it does not taste too much like milk. If you'd like a more minty flavor, use a little bit more peppermint extract. Pour the mixture into 2 mugs. Simply pour the hot chocolate straight from the pot and into the mugs. If the saucepan is too heavy for you to lift, use a soup ladle to scoop up the hot chocolate, and transfer it to the mugs. Garnish and serve the hot chocolate. Marshmallows go well with hot chocolate, but you can also top it with whipped cream instead. If you really want to get fancy, sprinkle some crushed peppermint candy can over the whipped cream. If you have any candy canes, you can stick it into the hot chocolate as a final touch. Making Vegan Peppermint Hot Chocolate Add the coconut oil, cocoa powder, maple syrup, and sea salt into a small saucepan. The coconut oil will give the hot chocolate a creamier texture. The sea salt will help cut down on the sweetness, and bring out the flavor of the chocolate. If you like your drinks really sweet, omit the sea salt. Make sure that you use refined coconut oil, or you will get a coconut flavor, which may not work well with peppermint. Stir the ingredients together until they are smooth. Because you are working with such small amounts, you might want to use a spoon or fork. Don't worry about turning the heat on just yet. Add the nondairy milk. You can use whatever milk you like, such as almond or soy. If you are simply allergic to dairy (and not vegan) you might like lactose-free cow's milk. Turn the heat to low, and cook for 5 minutes. Stir the mixture with a whisk to keep it from scorching. Remove from heat and stir in the peppermint extract. Place the saucepan down on a heat-safe surface first, then add the peppermint extract. Give the hot chocolate a final stir so that it mixes in evenly. Pour the mixture into 2 mugs. If the saucepan is too heavy, use a soup ladle to transfer the hot chocolate from pot to mug. Garnish and serve. Add a swirl of dairy-free whipped cream on top and sprinkle some crushed peppermint candy pieces on top. If you don't like whipped cream, plop in a few vegan marshmallows instead. If you have any candy canes, stick one into each mug for a festive touch.",
  "tyn_model":[
    "chocolate",
    "milk",
    "whipped cream",
    "saucepan",
    "hot chocolate",
    "candy cane",
    "mug",
    "water",
    "coffee",
    "sugar",
    "cocoa powder",
    "marshmallows",
    "candy canes",
    "whisk",
    "pot",
    "soup ladle",
    "coconut oil",
    "sea salt",
    "hot cocoa",
    "spoon",
    "small saucepan",
    "rolling pin",
    "chocolate chips",
    "spatula",
    "vanilla",
    "plastic bag",
    "microwave",
    "cocoa",
    "medium saucepan",
    "stove",
    "maple syrup",
    "fork",
    "nondairy milk",
    "cow's milk"
  ],
  "tyn_section":[

  ]
}