{
  "title":"How to Fertilize Carnivorous Plants",
  "url":"https://www.wikihow.com/Fertilize-Carnivorous-Plants",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Compost Mulch and Soil Preparation",
    "Fertilizers"
  ],
  "steps":[
    {
      "headline":"Place your carnivorous plants in soil that lacks nutrients.",
      "description":"Since carnivorous plants rely on insects as their main food source, these plants thrive best in specific types of soil. Use horticultural sand or sphagnum peat moss as the soil for your carnivorous plants."
    },
    {
      "headline":"Supply your plant with water that does not contain nutrients.",
      "description":"Carnivorous plants thrive best in conditions that lack nutrients, and the minerals commonly found in most water types can over-fertilize your plant. Use distilled water or collect fresh rainwater to feed your carnivorous plant."
    },
    {
      "headline":"Keep the soil of your carnivorous plants damp or wet.",
      "description":"Most carnivorous plants require damp soil at all times, with the moisture level of the soil varying depending on the exact breed of your plant. Store your carnivorous plant in a pot or planter that contains a tray or saucer you can keep filled with water throughout the day. Pour water into the tray or saucer instead of directly into the plant's flytrap; as this may falsely trigger the plant into closing its flytrap."
    },
    {
      "headline":"Expose your carnivorous plants to sunlight at all times.",
      "description":"These plants can thrive indoors or outdoors, as long as they are exposed to direct sunlight. Place your carnivorous plant under bright fluorescent bulbs for approximately 12 to 14 consecutive hours if you are unable to place the plant in direct sunlight."
    },
    {
      "headline":"Fertilize your carnivorous plants with insects.",
      "description":"Most carnivorous plants only require 1 or 2 insects per month to thrive healthily. Buy freeze-dried insects, crickets, or wingless fruit flies that measure approximately one-third of the size of your carnivorous plant. Use tweezers to carefully place the insect on the trigger hairs of your carnivorous plant. Depending on the type of plant you have, the location of the trigger hairs on your plant will vary."
    }
  ],
  "text":" Place your carnivorous plants in soil that lacks nutrients. Since carnivorous plants rely on insects as their main food source, these plants thrive best in specific types of soil. Use horticultural sand or sphagnum peat moss as the soil for your carnivorous plants. Supply your plant with water that does not contain nutrients. Carnivorous plants thrive best in conditions that lack nutrients, and the minerals commonly found in most water types can over-fertilize your plant. Use distilled water or collect fresh rainwater to feed your carnivorous plant. Keep the soil of your carnivorous plants damp or wet. Most carnivorous plants require damp soil at all times, with the moisture level of the soil varying depending on the exact breed of your plant. Store your carnivorous plant in a pot or planter that contains a tray or saucer you can keep filled with water throughout the day. Pour water into the tray or saucer instead of directly into the plant's flytrap; as this may falsely trigger the plant into closing its flytrap. Expose your carnivorous plants to sunlight at all times. These plants can thrive indoors or outdoors, as long as they are exposed to direct sunlight. Place your carnivorous plant under bright fluorescent bulbs for approximately 12 to 14 consecutive hours if you are unable to place the plant in direct sunlight. Fertilize your carnivorous plants with insects. Most carnivorous plants only require 1 or 2 insects per month to thrive healthily. Buy freeze-dried insects, crickets, or wingless fruit flies that measure approximately one-third of the size of your carnivorous plant. Use tweezers to carefully place the insect on the trigger hairs of your carnivorous plant. Depending on the type of plant you have, the location of the trigger hairs on your plant will vary.",
  "tyn_model":[
    "water",
    "tray",
    "insects",
    "horticultural sand",
    "pot",
    "freeze-dried insects",
    "crickets",
    "tweezers"
  ],
  "tyn_section":[

  ]
}