{
  "title":"How to Cook a Noodles and Egg Quick Meal",
  "url":"https://www.wikihow.com/Cook-a-Noodles-and-Egg-Quick-Meal",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles"
  ],
  "steps":[
    {
      "headline":"Bring 6 cups of water and a teaspoon of salt to a boil.",
      "description":"Alternatively use the quantity of water suggested on the packaging for the quantity of noodles or pasta you require."
    },
    {
      "headline":"Add noodles or pasta to the pot to cook.",
      "description":"Be guided by the packaging to cook to best results."
    },
    {
      "headline":"Test the noodles to ensure they are soft enough to eat.",
      "description":""
    },
    {
      "headline":"Take noodles or pasta out of pot and put into a strainer.",
      "description":""
    },
    {
      "headline":"Shock noodles for 30 seconds (rinse under cold water) and put in a bowl.",
      "description":""
    },
    {
      "headline":"Scramble an egg in a frying pan and place in a bowl.",
      "description":""
    },
    {
      "headline":"Melt 2 tablespoons of butter or margarine in the frying pan.",
      "description":""
    },
    {
      "headline":"Put noodles in the frying pan and season.",
      "description":""
    },
    {
      "headline":"Add egg and mix into the noodles.",
      "description":""
    },
    {
      "headline":"Add any additional seasonings you want.",
      "description":""
    },
    {
      "headline":"Put into a bowl and enjoy.",
      "description":""
    }
  ],
  "text":" Bring 6 cups of water and a teaspoon of salt to a boil. Alternatively use the quantity of water suggested on the packaging for the quantity of noodles or pasta you require. Add noodles or pasta to the pot to cook. Be guided by the packaging to cook to best results. Test the noodles to ensure they are soft enough to eat.  Take noodles or pasta out of pot and put into a strainer.  Shock noodles for 30 seconds (rinse under cold water) and put in a bowl.  Scramble an egg in a frying pan and place in a bowl.  Melt 2 tablespoons of butter or margarine in the frying pan.  Put noodles in the frying pan and season.  Add egg and mix into the noodles.  Add any additional seasonings you want.  Put into a bowl and enjoy. ",
  "tyn_model":[
    "water",
    "bowl",
    "frying pan",
    "pot",
    "salt",
    "noodles",
    "strainer",
    "butter",
    "margarine",
    "seasonings"
  ],
  "tyn_section":[

  ]
}