{
  "title":"How to Create a Meal Plan for Swimmers",
  "url":"https://www.wikihow.com/Create-a-Meal-Plan-for-Swimmers",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Meal Planning"
  ],
  "methods":[
    {
      "name":"Estimate Energy Requirements",
      "steps":[
        {
          "headline":"Determine resting metabolic rate.",
          "description":"This is your daily calorie requirement without taking added activity into consideration. Up to 75 percent of calories burned in a day are burned due to normal activities, such as sitting and breathing. The other 25 percent are available for extra physical activities. In order to ensure you have enough extra calories, you need to determine a few things first. Change weight in lbs to weight in kg. This is done by dividing weight in lbs by 2.2. Convert height from feet to inches. This is done by multiplying height in feet by 12 and then adding the remaining inches to the answer. For example, if you are 5 foot 6 inches (15.2 cm) you would multiply 5 by 12 to get 60 inches (152.4 cm). Then you would add the remaining 6 inches (15.2 cm) of your height to answer to show your height is 66 inches (167.6 cm). Convert height from inches to cm. This is done by multiplying your height in inches by 2.54. Calculate resting metabolic rate. If you are a women, use this equation: (9.99 x weight (kg)) + (6.25 x height (cm)) – (4.92 x age) – 161 = RMR. If you are a man, use this equation: (9.99 x weight (kg)) + (6.25 x height (cm)) – (4.92 x age) + 5 = RMR."
        },
        {
          "headline":"Determine your activity level.",
          "description":"If you swim for 1 hour, then you would be considered active and need to add at least 600 to 800 calories to your normal calorie consumption. If you swim for less than an hour, you would be considered moderately active and need to add at least 200 to 400 calories to your normal calorie consumption. If you swim and do other strenuous exercise or lead a very active life, you need to consider yourself active to ensure you take in enough calories. Add activity calories to resting metabolic rate to get daily energy requirements. Be sure to increase calories to match workout needs. If you begin training for a race, you may need to increase calorie consumption to match increased activity level."
        }
      ]
    },
    {
      "name":"Manage Your Calorie Intake",
      "steps":[
        {
          "headline":"Choose a variety of foods.",
          "description":"You will need every food group to maintain optimal health while swimming and this includes fats and oils. Meals should contain fruit, vegetable, protein and grain. The meals need to be filling without causing you to be overfull."
        },
        {
          "headline":"Do not skip breakfast.",
          "description":"Since you are swimming regularly, your metabolism will increase. This increase in metabolism is for the whole day, not just during and after the workout. It is because of this that eating breakfast is very important. You will need the calories to maintain weight and make it through the day without feeling sluggish or “foggy.”\nInclude a protein, fruit or vegetable, grain and dairy in breakfast. It should be somewhere between 400 and 800 calories."
        },
        {
          "headline":"Eat snacks.",
          "description":"In order to hit calorie amount needed and maintain a healthy diet, snacks are vital. Without the snacks your body may become overtired because of lack of fuel. The snack can be a protein, fruit or vegetable and should include a grain. The grain, fruit and vegetable helps reload the carbohydrates you have burned and protein will sustain energy. Go light on high fiber snacks. Fiber will cause bloating if consumed to excess and will interrupt a workout. It is best to start light on fiber and see what works best for you. If you don’t notice issues, then you can increase the amount of fiber. Fiber will be found mainly in whole fruits and vegetables. An after-workout snack should be eaten within an hour and should consist of protein and carbohydrates to help muscles rebuild. You will need 2 to 7 oz. of protein a day while swimming, the more calories you are consuming, the more protein you will need."
        }
      ]
    },
    {
      "name":"Schedule Your Meals Properly",
      "steps":[
        {
          "headline":"Plan meals around workouts.",
          "description":"Eat larger meals at least an hour before swimming and at least an hour after swimming. Eat light before swimming, but make sure you eat something to have the fuel for the workout. You should eat less protein and fat before the swim because it takes longer to digest and won’t be able to be used as fuel. Carbohydrates are very important before the workout. Eat a snack within an hour after swimming to rebuild muscles. Wait at least an hour after the swim to eat a larger meal. This will give your body time to rest after the activity and let digestion return to normal. Immediately after a workout, you digest food slower and so eating a heavy meal can cause you to feel overly full."
        },
        {
          "headline":"Eat right on race day.",
          "description":"Eat more protein. This will help stabilize blood sugar if you need to go longer between meals. Eat breakfast. Make it a light breakfast if the race is in the morning and a heavy breakfast if the race is in the afternoon. Bring plenty of high carbohydrate snacks. This can be fruits, fruit juice, vegetables and crackers. You will need these on hand for breaks to boost energy quickly. Drink plenty of water. You should consume enough water so that you don’t feel thirsty and your pee is clear. Water is important because it keeps you hydrated and keeps muscle cramps and headaches away."
        }
      ]
    }
  ],
  "text":" Estimate Energy Requirements Determine resting metabolic rate. This is your daily calorie requirement without taking added activity into consideration. Up to 75 percent of calories burned in a day are burned due to normal activities, such as sitting and breathing. The other 25 percent are available for extra physical activities. In order to ensure you have enough extra calories, you need to determine a few things first. Change weight in lbs to weight in kg. This is done by dividing weight in lbs by 2.2. Convert height from feet to inches. This is done by multiplying height in feet by 12 and then adding the remaining inches to the answer. For example, if you are 5 foot 6 inches (15.2 cm) you would multiply 5 by 12 to get 60 inches (152.4 cm). Then you would add the remaining 6 inches (15.2 cm) of your height to answer to show your height is 66 inches (167.6 cm). Convert height from inches to cm. This is done by multiplying your height in inches by 2.54. Calculate resting metabolic rate. If you are a women, use this equation: (9.99 x weight (kg)) + (6.25 x height (cm)) – (4.92 x age) – 161 = RMR. If you are a man, use this equation: (9.99 x weight (kg)) + (6.25 x height (cm)) – (4.92 x age) + 5 = RMR. Determine your activity level. If you swim for 1 hour, then you would be considered active and need to add at least 600 to 800 calories to your normal calorie consumption. If you swim for less than an hour, you would be considered moderately active and need to add at least 200 to 400 calories to your normal calorie consumption. If you swim and do other strenuous exercise or lead a very active life, you need to consider yourself active to ensure you take in enough calories. Add activity calories to resting metabolic rate to get daily energy requirements. Be sure to increase calories to match workout needs. If you begin training for a race, you may need to increase calorie consumption to match increased activity level. Manage Your Calorie Intake Choose a variety of foods. You will need every food group to maintain optimal health while swimming and this includes fats and oils. Meals should contain fruit, vegetable, protein and grain. The meals need to be filling without causing you to be overfull. Do not skip breakfast. Since you are swimming regularly, your metabolism will increase. This increase in metabolism is for the whole day, not just during and after the workout. It is because of this that eating breakfast is very important. You will need the calories to maintain weight and make it through the day without feeling sluggish or “foggy.”\nInclude a protein, fruit or vegetable, grain and dairy in breakfast. It should be somewhere between 400 and 800 calories. Eat snacks. In order to hit calorie amount needed and maintain a healthy diet, snacks are vital. Without the snacks your body may become overtired because of lack of fuel. The snack can be a protein, fruit or vegetable and should include a grain. The grain, fruit and vegetable helps reload the carbohydrates you have burned and protein will sustain energy. Go light on high fiber snacks. Fiber will cause bloating if consumed to excess and will interrupt a workout. It is best to start light on fiber and see what works best for you. If you don’t notice issues, then you can increase the amount of fiber. Fiber will be found mainly in whole fruits and vegetables. An after-workout snack should be eaten within an hour and should consist of protein and carbohydrates to help muscles rebuild. You will need 2 to 7 oz. of protein a day while swimming, the more calories you are consuming, the more protein you will need. Schedule Your Meals Properly Plan meals around workouts. Eat larger meals at least an hour before swimming and at least an hour after swimming. Eat light before swimming, but make sure you eat something to have the fuel for the workout. You should eat less protein and fat before the swim because it takes longer to digest and won’t be able to be used as fuel. Carbohydrates are very important before the workout. Eat a snack within an hour after swimming to rebuild muscles. Wait at least an hour after the swim to eat a larger meal. This will give your body time to rest after the activity and let digestion return to normal. Immediately after a workout, you digest food slower and so eating a heavy meal can cause you to feel overly full. Eat right on race day. Eat more protein. This will help stabilize blood sugar if you need to go longer between meals. Eat breakfast. Make it a light breakfast if the race is in the morning and a heavy breakfast if the race is in the afternoon. Bring plenty of high carbohydrate snacks. This can be fruits, fruit juice, vegetables and crackers. You will need these on hand for breaks to boost energy quickly. Drink plenty of water. You should consume enough water so that you don’t feel thirsty and your pee is clear. Water is important because it keeps you hydrated and keeps muscle cramps and headaches away.",
  "tyn_model":[
    "fiber",
    "swim",
    "water",
    "– (",
    "grain",
    "protein",
    "– 161",
    "“foggy",
    "”\n",
    "dairy",
    "snacks",
    "fruits",
    "vegetables",
    "crackers"
  ],
  "tyn_section":[

  ]
}