{
  "title":"How to Remove Red Wine Stains from Leather",
  "url":"https://www.wikihow.com/Remove-Red-Wine-Stains-from-Leather",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Stain Removal",
    "Drink Stains",
    "Treating Wine Stains"
  ],
  "methods":[
    {
      "name":"Determining Whether You Can Do It Yourself",
      "steps":[
        {
          "headline":"See if the leather is finished or unfinished.",
          "description":"If the leather is naked or aniline, it has no protective treatment, and will need to be cleaned by a professional. Wet a paper towel, and let one drop of water fall onto the leather. If it soaks into the leather instantly, do not attempt to clean it yourself. If it remains in a bead on the surface, however, the leather can withstand home treatment."
        },
        {
          "headline":"Evaluate how old the stain is.",
          "description":"If it is a fresh, still-wet stain, you stand a good chance of being able to nip this problem in the bud. If the stain is old and well set, however, the leather will likely need to be professionally re-dyed."
        },
        {
          "headline":"Consult the instructions.",
          "description":"Many leather objects come with instructions or a tag that offer instructions for cleaning. This may give you an idea of what will and will not work in removing a stain."
        },
        {
          "headline":"Do a spot test.",
          "description":"Apply whatever cleaning agent you plan on using to an inconspicuous part of the leather object. It should be an area rarely, if ever, visible. Let it dry, and see how the leather holds up. Because time is of the essence with leather stains, if the stain is still wet, you may not want to wait for the spot test to fully dry before moving on to the actual stain. This is a bit of a gamble, so you need to weigh your concerns about doing further damage by cleaning against your concerns about allowing the stain to set. There is no single right answer, as the right course of action varies from leather to leather."
        }
      ]
    },
    {
      "name":"Using Hydrogen Peroxide",
      "steps":[
        {
          "headline":"Absorb as much of the wine as you can.",
          "description":"Use a clean paper towel to blot up as much of the liquid as you can. Do not rub, or press too hard. Just blot gently."
        },
        {
          "headline":"Apply hydrogen peroxide.",
          "description":"Dip another piece of clean paper towel in hydrogen peroxide, and wring it out so that it is damp but not dripping wet. Place the towel over the stain, and use a heavy object to apply pressure, pressing the peroxide into the leather."
        },
        {
          "headline":"Wait and see.",
          "description":"Let the hydrogen peroxide do its work for half an hour. Remove it, and see how it looks. If the stain is still there, wet a new paper towel with hydrogen peroxide, and repeat the process for another half hour. Keep in mind that the moisture from the paper towel will temporarily leave a wet mark on the leather. Be sure not to confuse this with the stain itself."
        },
        {
          "headline":"Condition the leather.",
          "description":"Use a soft cloth to rub a small amount of leather conditioner into the affected area. This will help restore the leather’s texture. Let it dry again."
        }
      ]
    },
    {
      "name":"Using Baking Soda",
      "steps":[
        {
          "headline":"Apply baking soda to the stain.",
          "description":"This step will only work if the stain is still wet. Sprinkle on a light coating of baking soda. Let it sit and absorb as much as possible. Give it fifteen minutes or so."
        },
        {
          "headline":"Rub it into the leather a bit.",
          "description":"Gently massage the baking soda into the stain with a clean rag or towel, using more pressure as you determine the leather’s ability to endure it."
        },
        {
          "headline":"Add hydrogen peroxide to the baking soda if the stain remains.",
          "description":"Measure a teaspoon of hydrogen peroxide into a small bowl, and add enough baking soda to create a paste. Gently work this into the leather with a clean paper towel. Use quick circular motions, and keep at it for at least a minute for each square foot or smaller. Work inward from the outermost part of the stain."
        },
        {
          "headline":"Clean off the baking soda.",
          "description":"Wet a washcloth or lint-free paper towel, and wring it out so that it is damp, but not too wet. Gently wipe off the baking soda. Let it dry for at least 24 hours."
        },
        {
          "headline":"Condition the leather.",
          "description":"Use a soft cloth to rub a small amount of leather conditioner into the affected area. This will help restore the leather’s texture. Let it dry again."
        }
      ]
    },
    {
      "name":"Using Vinegar",
      "steps":[
        {
          "headline":"Dilute the vinegar.",
          "description":"Make a solution of roughly equal parts water and white vinegar. If in doubt, err on the side of too much water. If you have it, add a few drops of leather cleaner to the solution."
        },
        {
          "headline":"Apply the solution.",
          "description":"Gently massage a thin layer of the mixture into the stain with a clean rag or towel. Let it sit for at least 10 minutes, up to an hour."
        },
        {
          "headline":"Clean it off.",
          "description":"Wet a clean rag, and gently blot away the vinegar solution with one corner. Then use another clean corner to do a second wipe, to ensure the mixture has been completely removed. Pat it dry with a clean paper towel. Let it dry for at least 24 hours."
        },
        {
          "headline":"Condition the leather.",
          "description":"Use a soft cloth to rub a small amount of leather conditioner into the affected area. This will help restore the leather’s texture. Let it dry again."
        }
      ]
    },
    {
      "name":"Using Shaving Cream",
      "steps":[
        {
          "headline":"Apply the shaving cream.",
          "description":"Shake the bottle well. Squirt a small amount of white, foaming shaving cream on the stain."
        },
        {
          "headline":"Rub it in.",
          "description":"Gently massage the shaving cream into the stain with a clean rag or towel. Do not be too rough."
        },
        {
          "headline":"Wipe it off.",
          "description":"Blot the shaving cream off with a clean paper towel. Do not rub, just dab it gently. Let it dry for at least 24 hours."
        },
        {
          "headline":"Condition the leather.",
          "description":"Use a soft cloth to rub a small amount of leather conditioner into the affected area. This will help restore the leather’s texture. Let it dry again."
        }
      ]
    }
  ],
  "text":" Determining Whether You Can Do It Yourself See if the leather is finished or unfinished. If the leather is naked or aniline, it has no protective treatment, and will need to be cleaned by a professional. Wet a paper towel, and let one drop of water fall onto the leather. If it soaks into the leather instantly, do not attempt to clean it yourself. If it remains in a bead on the surface, however, the leather can withstand home treatment. Evaluate how old the stain is. If it is a fresh, still-wet stain, you stand a good chance of being able to nip this problem in the bud. If the stain is old and well set, however, the leather will likely need to be professionally re-dyed. Consult the instructions. Many leather objects come with instructions or a tag that offer instructions for cleaning. This may give you an idea of what will and will not work in removing a stain. Do a spot test. Apply whatever cleaning agent you plan on using to an inconspicuous part of the leather object. It should be an area rarely, if ever, visible. Let it dry, and see how the leather holds up. Because time is of the essence with leather stains, if the stain is still wet, you may not want to wait for the spot test to fully dry before moving on to the actual stain. This is a bit of a gamble, so you need to weigh your concerns about doing further damage by cleaning against your concerns about allowing the stain to set. There is no single right answer, as the right course of action varies from leather to leather. Using Hydrogen Peroxide Absorb as much of the wine as you can. Use a clean paper towel to blot up as much of the liquid as you can. Do not rub, or press too hard. Just blot gently. Apply hydrogen peroxide. Dip another piece of clean paper towel in hydrogen peroxide, and wring it out so that it is damp but not dripping wet. Place the towel over the stain, and use a heavy object to apply pressure, pressing the peroxide into the leather. Wait and see. Let the hydrogen peroxide do its work for half an hour. Remove it, and see how it looks. If the stain is still there, wet a new paper towel with hydrogen peroxide, and repeat the process for another half hour. Keep in mind that the moisture from the paper towel will temporarily leave a wet mark on the leather. Be sure not to confuse this with the stain itself. Condition the leather. Use a soft cloth to rub a small amount of leather conditioner into the affected area. This will help restore the leather’s texture. Let it dry again. Using Baking Soda Apply baking soda to the stain. This step will only work if the stain is still wet. Sprinkle on a light coating of baking soda. Let it sit and absorb as much as possible. Give it fifteen minutes or so. Rub it into the leather a bit. Gently massage the baking soda into the stain with a clean rag or towel, using more pressure as you determine the leather’s ability to endure it. Add hydrogen peroxide to the baking soda if the stain remains. Measure a teaspoon of hydrogen peroxide into a small bowl, and add enough baking soda to create a paste. Gently work this into the leather with a clean paper towel. Use quick circular motions, and keep at it for at least a minute for each square foot or smaller. Work inward from the outermost part of the stain. Clean off the baking soda. Wet a washcloth or lint-free paper towel, and wring it out so that it is damp, but not too wet. Gently wipe off the baking soda. Let it dry for at least 24 hours. Condition the leather. Use a soft cloth to rub a small amount of leather conditioner into the affected area. This will help restore the leather’s texture. Let it dry again. Using Vinegar Dilute the vinegar. Make a solution of roughly equal parts water and white vinegar. If in doubt, err on the side of too much water. If you have it, add a few drops of leather cleaner to the solution. Apply the solution. Gently massage a thin layer of the mixture into the stain with a clean rag or towel. Let it sit for at least 10 minutes, up to an hour. Clean it off. Wet a clean rag, and gently blot away the vinegar solution with one corner. Then use another clean corner to do a second wipe, to ensure the mixture has been completely removed. Pat it dry with a clean paper towel. Let it dry for at least 24 hours. Condition the leather. Use a soft cloth to rub a small amount of leather conditioner into the affected area. This will help restore the leather’s texture. Let it dry again. Using Shaving Cream Apply the shaving cream. Shake the bottle well. Squirt a small amount of white, foaming shaving cream on the stain. Rub it in. Gently massage the shaving cream into the stain with a clean rag or towel. Do not be too rough. Wipe it off. Blot the shaving cream off with a clean paper towel. Do not rub, just dab it gently. Let it dry for at least 24 hours. Condition the leather. Use a soft cloth to rub a small amount of leather conditioner into the affected area. This will help restore the leather’s texture. Let it dry again.",
  "tyn_model":[
    "paper towel",
    "baking soda",
    "hydrogen peroxide",
    "leather conditioner",
    "shaving cream",
    "water",
    "vinegar",
    "towel",
    "cleaning agent",
    "white vinegar",
    "leather cleaner"
  ],
  "tyn_section":[

  ]
}