{
  "title":"How to Make Chicken Mole",
  "url":"https://www.wikihow.com/Make-Chicken-Mole",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "methods":[
    {
      "name":"Making the Mole",
      "steps":[
        {
          "headline":"Cut or tear the chilies into large pieces.",
          "description":"Toast them in a dry skillet over medium heat for about 2 minutes."
        },
        {
          "headline":"Put the toasted chilies in a bowl with the raisins and cover them with hot water.",
          "description":"Soak until they are softened (should take about 30 minutes)."
        },
        {
          "headline":"Toast the almonds, sesame seeds, peppercorns, cinnamon stick, oregano, and thyme in the same skillet over medium heat for 2 minutes.",
          "description":"Then grind them in a spice grinder and add the powder to a blender."
        },
        {
          "headline":"Cook the olive oil, garlic, onions, and serrano in the same skillet until lightly browned.",
          "description":"Then add the tomatoes. Cook vegetables until they are soft (this should take 10-15 minutes). Then add them to the blender."
        },
        {
          "headline":"Add the chocolate, soaked chilies, and raisins to the blender.",
          "description":"You should also pour in some of the water that the chilies and raisins were soaked in."
        },
        {
          "headline":"Puree.",
          "description":"Add more of the water used to soak the raisins and chiles as needed to make a smooth sauce. this will make about 4 cups of mole. The recipe calls for two cups—the leftovers can be frozen and reused at another time."
        }
      ]
    },
    {
      "name":"Making the Chicken",
      "steps":[
        {
          "headline":"Pour the lemon juice over the chicken.",
          "description":"Season well with salt and pepper."
        },
        {
          "headline":"Heat 3 tablespoons of olive oil in a large, heavy-bottomed skillet.",
          "description":"Brown the chicken on all sides."
        },
        {
          "headline":"Remove the browned chicken and put it on a plate.",
          "description":"Leave the oil in the pan."
        },
        {
          "headline":"Pour 2 cups of the mole sauce into the same skillet and simmer for about 5 minutes.",
          "description":""
        },
        {
          "headline":"Add the chicken stock.",
          "description":"Return the browned chicken pieces to the pan and simmer, covered, until the chicken is cooked through (this should take 20-25 minutes)"
        },
        {
          "headline":"While waiting, put the onion and radish slices into a bowl.",
          "description":"Add the lime juice and remaining 2 tablespoons of olive oil. Season with salt. Mix well and serve with the chicken."
        },
        {
          "headline":"Serve over cooked white rice with the onion and radish salad.",
          "description":"Garnish everything with cilantro leaves."
        }
      ]
    }
  ],
  "text":" Making the Mole Cut or tear the chilies into large pieces. Toast them in a dry skillet over medium heat for about 2 minutes. Put the toasted chilies in a bowl with the raisins and cover them with hot water. Soak until they are softened (should take about 30 minutes). Toast the almonds, sesame seeds, peppercorns, cinnamon stick, oregano, and thyme in the same skillet over medium heat for 2 minutes. Then grind them in a spice grinder and add the powder to a blender. Cook the olive oil, garlic, onions, and serrano in the same skillet until lightly browned. Then add the tomatoes. Cook vegetables until they are soft (this should take 10-15 minutes). Then add them to the blender. Add the chocolate, soaked chilies, and raisins to the blender. You should also pour in some of the water that the chilies and raisins were soaked in. Puree. Add more of the water used to soak the raisins and chiles as needed to make a smooth sauce. this will make about 4 cups of mole. The recipe calls for two cups—the leftovers can be frozen and reused at another time. Making the Chicken Pour the lemon juice over the chicken. Season well with salt and pepper. Heat 3 tablespoons of olive oil in a large, heavy-bottomed skillet. Brown the chicken on all sides. Remove the browned chicken and put it on a plate. Leave the oil in the pan. Pour 2 cups of the mole sauce into the same skillet and simmer for about 5 minutes.  Add the chicken stock. Return the browned chicken pieces to the pan and simmer, covered, until the chicken is cooked through (this should take 20-25 minutes) While waiting, put the onion and radish slices into a bowl. Add the lime juice and remaining 2 tablespoons of olive oil. Season with salt. Mix well and serve with the chicken. Serve over cooked white rice with the onion and radish salad. Garnish everything with cilantro leaves.",
  "tyn_model":[
    "skillet",
    "blender",
    "olive oil",
    "bowl",
    "raisins",
    "water",
    "onion",
    "radish",
    "dry skillet",
    "hot water",
    "almonds",
    "sesame seeds",
    "peppercorns",
    "cinnamon stick",
    "oregano",
    "thyme",
    "spice grinder",
    "garlic",
    "onions",
    "serrano",
    "tomatoes",
    "vegetables",
    "chocolate",
    "chilies",
    "chiles",
    "—the",
    "lemon juice",
    "salt and pepper",
    "large, heavy-bottomed skillet",
    "plate",
    "oil",
    "mole sauce",
    "chicken stock",
    "lime",
    "salt",
    "white rice",
    "cilantro"
  ],
  "tyn_section":[

  ]
}