{
  "title":"How to Make Collard Greens and Ham in a Crockpot",
  "url":"https://www.wikihow.com/Make-Collard-Greens-and-Ham-in-a-Crockpot",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Pork"
  ],
  "steps":[
    {
      "headline":"Rinse Collard greens well.",
      "description":""
    },
    {
      "headline":"Remove any thick stems and tear or chop leaves into strips.",
      "description":""
    },
    {
      "headline":"Chop fat back or bacon into little bits, then cook in a skillet until the fat renders and the fat back is crunchy (or, if using bacon, until the bacon is translucent).",
      "description":""
    },
    {
      "headline":"Place fat back or bacon, with some of the drippings, into the bottom of the crockpot.",
      "description":""
    },
    {
      "headline":"Add the greens, ham hock, salt, pepper, and chicken stock or water into the crockpot.",
      "description":""
    },
    {
      "headline":"Cover and cook on low for 6 hours or on high for 3 hours.",
      "description":""
    },
    {
      "headline":"Remove ham hock, discard skin and shred meat, returning meat to crockpot.",
      "description":""
    },
    {
      "headline":"Serve greens with minced onion, vinegar, red wine vinaigrette, and/or Tabasco sauce, if desired.",
      "description":""
    }
  ],
  "text":" Rinse Collard greens well.  Remove any thick stems and tear or chop leaves into strips.  Chop fat back or bacon into little bits, then cook in a skillet until the fat renders and the fat back is crunchy (or, if using bacon, until the bacon is translucent).  Place fat back or bacon, with some of the drippings, into the bottom of the crockpot.  Add the greens, ham hock, salt, pepper, and chicken stock or water into the crockpot.  Cover and cook on low for 6 hours or on high for 3 hours.  Remove ham hock, discard skin and shred meat, returning meat to crockpot.  Serve greens with minced onion, vinegar, red wine vinaigrette, and/or Tabasco sauce, if desired. ",
  "tyn_model":[
    "bacon",
    "crockpot",
    "ham",
    "collard greens",
    "skillet",
    "salt",
    "pepper",
    "chicken stock",
    "water",
    "onion",
    "vinegar",
    "red wine vinaigrette",
    "tabasco sauce"
  ],
  "tyn_section":[

  ]
}