{
  "title":"How to Easily Level up in Dead Rising",
  "url":"https://www.wikihow.com/Easily-Level-up-in-Dead-Rising",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Dead Rising"
  ],
  "methods":[
    {
      "name":"Going to the Bookstore",
      "steps":[
        {
          "headline":"Once you have access to the air ducts, go into the warehouse and to the mall.",
          "description":""
        },
        {
          "headline":"Next, take a right and around the stair area is a bookstore called Bachman's Bookporium.",
          "description":"Go in it."
        },
        {
          "headline":"Look around until you find a book called \"Horror Novel 2\" Pick it up.",
          "description":""
        },
        {
          "headline":"Continue the game normally until you reach the Entrance Plaza with brad.",
          "description":""
        },
        {
          "headline":"Up the stairs and around the corner there will be a bookstore called The Sinister Read.",
          "description":"Go in it."
        },
        {
          "headline":"Find the book called \"Horror Novel 1\" and pick it up.",
          "description":""
        },
        {
          "headline":"Now go into the park and to the parking lot.",
          "description":"get in the car and go into the Maintenance Tunnel."
        },
        {
          "headline":"Once you're in, take a left and then another left and take out all the zombies near the trucks.",
          "description":""
        },
        {
          "headline":"Then get out and get into the van.",
          "description":""
        },
        {
          "headline":"Go out the way you came in and continue.",
          "description":"Every 50 zombies killed WILL get you       750 PP, and Every 1,000 zombies killed will get you about 30,000 PP!"
        }
      ]
    },
    {
      "name":"Going to the Food Court",
      "steps":[
        {
          "headline":"Play the game up until Carlito appears at the Food Court.",
          "description":"Near where you start out there's a few dishes on the wall."
        },
        {
          "headline":"Shoot the plates with the gun and you get PP per dish destroyed.",
          "description":"Plus a 10,000 bonus for all of them."
        },
        {
          "headline":"(Don't worry if your guns run out.",
          "description":"Talk to brad for another one.)"
        },
        {
          "headline":"In the Al Fresca Plaza.",
          "description":"Go into the Flexin' exercise place."
        },
        {
          "headline":"Run on all the treadmills and you'll get 20,000 PP.",
          "description":"Then another 20,000 for destroying the sandbags."
        }
      ]
    }
  ],
  "text":" Going to the Bookstore Once you have access to the air ducts, go into the warehouse and to the mall.  Next, take a right and around the stair area is a bookstore called Bachman's Bookporium. Go in it. Look around until you find a book called \"Horror Novel 2\" Pick it up.  Continue the game normally until you reach the Entrance Plaza with brad.  Up the stairs and around the corner there will be a bookstore called The Sinister Read. Go in it. Find the book called \"Horror Novel 1\" and pick it up.  Now go into the park and to the parking lot. get in the car and go into the Maintenance Tunnel. Once you're in, take a left and then another left and take out all the zombies near the trucks.  Then get out and get into the van.  Go out the way you came in and continue. Every 50 zombies killed WILL get you       750 PP, and Every 1,000 zombies killed will get you about 30,000 PP! Going to the Food Court Play the game up until Carlito appears at the Food Court. Near where you start out there's a few dishes on the wall. Shoot the plates with the gun and you get PP per dish destroyed. Plus a 10,000 bonus for all of them. (Don't worry if your guns run out. Talk to brad for another one.) In the Al Fresca Plaza. Go into the Flexin' exercise place. Run on all the treadmills and you'll get 20,000 PP. Then another 20,000 for destroying the sandbags.",
  "tyn_model":[
    "van",
    "dishes",
    "plates",
    "gun",
    "pp",
    "guns",
    "sandbags"
  ],
  "tyn_section":[

  ]
}