{
  "title":"How to Make Vegan Leek Quiche",
  "url":"https://www.wikihow.com/Make-Vegan-Leek-Quiche",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan"
  ],
  "steps":[
    {
      "headline":"Melt the margarine gently in a saucepan.",
      "description":""
    },
    {
      "headline":"Add the chopped shallots and leeks and quickly cover in the melted butter.",
      "description":"Season with the salt and pepper and a generous amount of nutmeg."
    },
    {
      "headline":"Add the potato slices.",
      "description":"Cook over a low heat for about 20 to 30 minutes."
    },
    {
      "headline":"Remove from the heat and leave to cool down again.",
      "description":""
    },
    {
      "headline":"Remove the potatoes from the saucepan and put them to one side.",
      "description":"Preheat the oven to 220ºC/430ºF."
    },
    {
      "headline":"Grease a quiche dish and put the cooked leeks and shallots into it.",
      "description":""
    },
    {
      "headline":"Add the Brewer's yeast, soy milk, and the sifted flour in a bowl.",
      "description":"Beat together well."
    },
    {
      "headline":"Pour the liquid mixture over the leeks and shallots in the quiche dish.",
      "description":""
    },
    {
      "headline":"Arrange the potato slices neatly atop the mixture.",
      "description":""
    },
    {
      "headline":"Place in the oven.",
      "description":"Allow to bake for approximately half an hour."
    },
    {
      "headline":"Remove from the oven.",
      "description":"The quiche can be eaten hot or cold, depending on personal preference. It goes well with a salad of choice."
    }
  ],
  "text":" Melt the margarine gently in a saucepan.  Add the chopped shallots and leeks and quickly cover in the melted butter. Season with the salt and pepper and a generous amount of nutmeg. Add the potato slices. Cook over a low heat for about 20 to 30 minutes. Remove from the heat and leave to cool down again.  Remove the potatoes from the saucepan and put them to one side. Preheat the oven to 220ºC/430ºF. Grease a quiche dish and put the cooked leeks and shallots into it.  Add the Brewer's yeast, soy milk, and the sifted flour in a bowl. Beat together well. Pour the liquid mixture over the leeks and shallots in the quiche dish.  Arrange the potato slices neatly atop the mixture.  Place in the oven. Allow to bake for approximately half an hour. Remove from the oven. The quiche can be eaten hot or cold, depending on personal preference. It goes well with a salad of choice.",
  "tyn_model":[
    "leeks",
    "oven",
    "saucepan",
    "shallots",
    "potato",
    "quiche dish",
    "margarine",
    "butter",
    "salt and pepper",
    "nutmeg",
    "potatoes",
    "brewer's yeast",
    "soy milk",
    "flour",
    "bowl"
  ],
  "tyn_section":[

  ]
}