{
  "title":"How to Make Sachertorte",
  "url":"https://www.wikihow.com/Make-Sachertorte",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Chocolate Cakes"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 170 degrees.",
      "description":""
    },
    {
      "headline":"Melt 175 g. of the chocolate.",
      "description":""
    },
    {
      "headline":"Mix the butter with the sugar until soft.",
      "description":"Sift the flour and put it into the mix, together with the yeast. Stir everything until it is nice and smooth, without lumps."
    },
    {
      "headline":"Separate the eggs.",
      "description":"Put all the yolks in your flour mix one by one. Mix till smooth after each one, then add the melted chocolate."
    },
    {
      "headline":"Beat the egg whites with a pinch of salt.",
      "description":"Then lightly scoop it into your cake batter."
    },
    {
      "headline":"Smear some butter into a suitable cake pan and dust with normal flour.",
      "description":"Pour the cake batters into it and bake for 60 minutes in your preheated oven. After that, take it out and let it cool down for 5 more minutes."
    },
    {
      "headline":"Heat the confiture till it's fluid.",
      "description":""
    },
    {
      "headline":"Take your cake out of the mould and smear the top with the warm confiture.",
      "description":""
    },
    {
      "headline":"Melt the rest of the chocolate au bain marie, add the icing sugar and a spoonful of butter.",
      "description":"Stir until smooth and put it on the cake (on top of the confiture and at the edges.) Wait until set and serve the cake."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 170 degrees.  Melt 175 g. of the chocolate.  Mix the butter with the sugar until soft. Sift the flour and put it into the mix, together with the yeast. Stir everything until it is nice and smooth, without lumps. Separate the eggs. Put all the yolks in your flour mix one by one. Mix till smooth after each one, then add the melted chocolate. Beat the egg whites with a pinch of salt. Then lightly scoop it into your cake batter. Smear some butter into a suitable cake pan and dust with normal flour. Pour the cake batters into it and bake for 60 minutes in your preheated oven. After that, take it out and let it cool down for 5 more minutes. Heat the confiture till it's fluid.  Take your cake out of the mould and smear the top with the warm confiture.  Melt the rest of the chocolate au bain marie, add the icing sugar and a spoonful of butter. Stir until smooth and put it on the cake (on top of the confiture and at the edges.) Wait until set and serve the cake. Finished. ",
  "tyn_model":[
    "butter",
    "flour",
    "oven",
    "chocolate",
    "sugar",
    "yeast",
    "eggs",
    "salt",
    "cake batter",
    "cake pan",
    "chocolate au bain marie",
    "icing sugar"
  ],
  "tyn_section":[

  ]
}