{
  "title":"How to Buy Used Gardening Equipment",
  "url":"https://www.wikihow.com/Buy-Used-Gardening-Equipment",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "parts":[
    {
      "name":"Finding Used Gardening Equipment",
      "steps":[
        {
          "headline":"Look for used equipment in classified ads.",
          "description":"Check the classified section of your local newspaper to see if anybody in your area is selling used gardening tools. In most cases, you’ll find ads for equipment in either the merchandise or appliances section. Most people post their ads in the Sunday edition, though you may find some great deals throughout the week as well. In addition to the paper itself, many news organizations post classified ads on their official website."
        },
        {
          "headline":"Browse yard and estate sales to find pre-owned tools.",
          "description":"Whether or not you find anything at these sales is largely a matter of luck. However, if you do run across a piece of high-quality equipment, you’ll usually be able to snag it for a lower price than anywhere else. Check websites like Craigslist and your local newspaper’s classified section for information on upcoming estate sales and neighborhood-wide yard sales. Yard and estate sales are first come, first served, so make sure you arrive as early as possible. If you go to a sale and don’t see any gardening equipment, ask the homeowner if they have any. They may own something that they’d be willing to part with even though it’s not on display."
        },
        {
          "headline":"Look for pre-owned equipment at thrift stores.",
          "description":"Independent thrift stores and thrift store chains like Goodwill and the Salvation Army often carry a variety of used gardening tools and supplies. These stores usually sell their goods as-is, so make sure you examine potential purchases carefully. Thrift stores get most of their merchandise from donations, so check them during the fall and spring when lots of people are clearing out their sheds and garages."
        },
        {
          "headline":"Buy used tools through online websites.",
          "description":"Look for gardening equipment on digital stores like eBay, Craigslist, and the Facebook Marketplace, which let users list and sell their own personal items. In addition, make sure you check websites like https://www.freecycle.org/ to see if anybody in your area is giving tools away for free. On websites like Craigslist, you can also post a “Wanted” ad seeking a specific tool or piece of equipment."
        },
        {
          "headline":"Take the equipment for a test run.",
          "description":"This will help you ensure that the tool is in good working order for its intended use. If the seller won't let you try out the equipment, then you may want to consider other options. For example, you could mow a small plot of grass before buying a used lawnmower. If it's not possible to try out the tool before buying it, ask the seller if you can buy it under a probationary period that would let you try it before committing to the purchase."
        }
      ]
    },
    {
      "name":"Examining the Equipment",
      "steps":[
        {
          "headline":"Avoid purchasing damaged tools.",
          "description":"Though used tools will never be quite as pristine as new ones, you should still look out for tell-tale signs indicating that the item may break in the near future. Some things to watch for include:\nMajor dents, tears, or cracks\nHeavy rust and flaking\nLoose handles or tool heads\nRotting wood"
        },
        {
          "headline":"Examine repainted tools carefully for signs of damage.",
          "description":"In most cases, a repainted gardening tool is nothing to worry about. However, some people may use a fresh coat of paint to conceal damages and other defects in the equipment. Certain sellers may try to pass a generic piece of equipment off as something more valuable by painting the tool in brand-specific colors."
        },
        {
          "headline":"Turn on motorized devices to make sure they run properly.",
          "description":"If you’re purchasing an automated or electrical gardening tool like a mower, rototiller, chipper, or chainsaw, make sure you test the piece of equipment before committing to the purchase. Along with ensuring that the device turns on, look for defects and signs of wear like:\nOil or transmission leaks\nDirty oil\nExcessive vibrations\nGrinding noises\nRusted spark plugs"
        },
        {
          "headline":"Check to see if the tool comes with all its required parts.",
          "description":"When examining a complex piece of equipment, look it over carefully to make sure it has all the parts and attachments it’s supposed to. This includes things the tool needs to function, such as a motor, as well as any optional or cosmetic attachments. For brand-name products, look up the piece of equipment online to see what parts it’s supposed to come with."
        }
      ]
    },
    {
      "name":"Deciding Whether to Make the Purchase",
      "steps":[
        {
          "headline":"Purchase equipment that you know you’ll use.",
          "description":"It’s easy to get swept away in the excitement of deal hunting, but doing so can lead to some pretty poor purchasing decisions. When deciding whether or not you’re going to buy a piece of equipment, make sure to ask yourself:\nWill I use this tool in the near future? Is this tool in good enough condition for the price? Is this tool powerful enough to accomplish what I need it to?"
        },
        {
          "headline":"Compare the price of the tool with the cost of getting a new one.",
          "description":"If possible, visit nearby equipment dealers to see what new gardening tools are going for. If you’re analyzing a potential purchase on the spot, look up similar pieces of equipment on shopping websites for a rough estimate of how much you’ll save by buying used. For low-maintenance manual tools like shovels and hoes, even a small discount can make the purchase worthwhile. For complex or motorized equipment like mowers, a small discount may not be worth losing out on a new tool warranty."
        },
        {
          "headline":"Check local repair rates before buying expensive equipment.",
          "description":"Before you put down hundreds of dollars on a piece of gardening equipment, check with nearby mechanics or repair companies to see how much it would cost to fix the tool if it broke. Used tools come with no warranties, so make your purchase with the knowledge that you may have to pay extra to repair it. If possible, look online to see how long the piece of equipment normally lasts for and if the model was ever recalled. This is particularly important for complex tools like lawn mowers and wood chippers."
        },
        {
          "headline":"Examine online listings carefully to make sure they aren’t scams.",
          "description":"Before purchasing a piece of gardening equipment online, read through the listing text carefully and look over the seller’s customer feedback scores. Remember: if the listing is extremely cheap and seems too good to be true, it probably is. Scam artists often use stock images and corporate ad copy to sell their items. Stay away from sellers who ask you to make your purchase through a separate, unverified website. If a listing seems like it may be a scam, message the seller and ask for additional information. If they fulfill your request, there’s a good chance the post is legitimate. Before purchasing a tool that’s being sold as-is, make sure you’re aware of anything that’s wrong with it. If possible, ask the seller to send additional photos or videos showing the tool up close and in action."
        }
      ]
    }
  ],
  "text":" Finding Used Gardening Equipment Look for used equipment in classified ads. Check the classified section of your local newspaper to see if anybody in your area is selling used gardening tools. In most cases, you’ll find ads for equipment in either the merchandise or appliances section. Most people post their ads in the Sunday edition, though you may find some great deals throughout the week as well. In addition to the paper itself, many news organizations post classified ads on their official website. Browse yard and estate sales to find pre-owned tools. Whether or not you find anything at these sales is largely a matter of luck. However, if you do run across a piece of high-quality equipment, you’ll usually be able to snag it for a lower price than anywhere else. Check websites like Craigslist and your local newspaper’s classified section for information on upcoming estate sales and neighborhood-wide yard sales. Yard and estate sales are first come, first served, so make sure you arrive as early as possible. If you go to a sale and don’t see any gardening equipment, ask the homeowner if they have any. They may own something that they’d be willing to part with even though it’s not on display. Look for pre-owned equipment at thrift stores. Independent thrift stores and thrift store chains like Goodwill and the Salvation Army often carry a variety of used gardening tools and supplies. These stores usually sell their goods as-is, so make sure you examine potential purchases carefully. Thrift stores get most of their merchandise from donations, so check them during the fall and spring when lots of people are clearing out their sheds and garages. Buy used tools through online websites. Look for gardening equipment on digital stores like eBay, Craigslist, and the Facebook Marketplace, which let users list and sell their own personal items. In addition, make sure you check websites like https://www.freecycle.org/ to see if anybody in your area is giving tools away for free. On websites like Craigslist, you can also post a “Wanted” ad seeking a specific tool or piece of equipment. Take the equipment for a test run. This will help you ensure that the tool is in good working order for its intended use. If the seller won't let you try out the equipment, then you may want to consider other options. For example, you could mow a small plot of grass before buying a used lawnmower. If it's not possible to try out the tool before buying it, ask the seller if you can buy it under a probationary period that would let you try it before committing to the purchase. Examining the Equipment Avoid purchasing damaged tools. Though used tools will never be quite as pristine as new ones, you should still look out for tell-tale signs indicating that the item may break in the near future. Some things to watch for include:\nMajor dents, tears, or cracks\nHeavy rust and flaking\nLoose handles or tool heads\nRotting wood Examine repainted tools carefully for signs of damage. In most cases, a repainted gardening tool is nothing to worry about. However, some people may use a fresh coat of paint to conceal damages and other defects in the equipment. Certain sellers may try to pass a generic piece of equipment off as something more valuable by painting the tool in brand-specific colors. Turn on motorized devices to make sure they run properly. If you’re purchasing an automated or electrical gardening tool like a mower, rototiller, chipper, or chainsaw, make sure you test the piece of equipment before committing to the purchase. Along with ensuring that the device turns on, look for defects and signs of wear like:\nOil or transmission leaks\nDirty oil\nExcessive vibrations\nGrinding noises\nRusted spark plugs Check to see if the tool comes with all its required parts. When examining a complex piece of equipment, look it over carefully to make sure it has all the parts and attachments it’s supposed to. This includes things the tool needs to function, such as a motor, as well as any optional or cosmetic attachments. For brand-name products, look up the piece of equipment online to see what parts it’s supposed to come with. Deciding Whether to Make the Purchase Purchase equipment that you know you’ll use. It’s easy to get swept away in the excitement of deal hunting, but doing so can lead to some pretty poor purchasing decisions. When deciding whether or not you’re going to buy a piece of equipment, make sure to ask yourself:\nWill I use this tool in the near future? Is this tool in good enough condition for the price? Is this tool powerful enough to accomplish what I need it to? Compare the price of the tool with the cost of getting a new one. If possible, visit nearby equipment dealers to see what new gardening tools are going for. If you’re analyzing a potential purchase on the spot, look up similar pieces of equipment on shopping websites for a rough estimate of how much you’ll save by buying used. For low-maintenance manual tools like shovels and hoes, even a small discount can make the purchase worthwhile. For complex or motorized equipment like mowers, a small discount may not be worth losing out on a new tool warranty. Check local repair rates before buying expensive equipment. Before you put down hundreds of dollars on a piece of gardening equipment, check with nearby mechanics or repair companies to see how much it would cost to fix the tool if it broke. Used tools come with no warranties, so make your purchase with the knowledge that you may have to pay extra to repair it. If possible, look online to see how long the piece of equipment normally lasts for and if the model was ever recalled. This is particularly important for complex tools like lawn mowers and wood chippers. Examine online listings carefully to make sure they aren’t scams. Before purchasing a piece of gardening equipment online, read through the listing text carefully and look over the seller’s customer feedback scores. Remember: if the listing is extremely cheap and seems too good to be true, it probably is. Scam artists often use stock images and corporate ad copy to sell their items. Stay away from sellers who ask you to make your purchase through a separate, unverified website. If a listing seems like it may be a scam, message the seller and ask for additional information. If they fulfill your request, there’s a good chance the post is legitimate. Before purchasing a tool that’s being sold as-is, make sure you’re aware of anything that’s wrong with it. If possible, ask the seller to send additional photos or videos showing the tool up close and in action.",
  "tyn_model":[
    "tools",
    "gardening tools",
    "tool",
    "“wanted",
    "” ad",
    "lawnmower.",
    "mower",
    "rototiller",
    "chipper",
    "chainsaw",
    "mowers",
    "lawn mowers",
    "wood chippers",
    "gardening equipment"
  ],
  "tyn_section":[

  ]
}