{
  "title":"How to Become a Good Poker Player",
  "url":"https://www.wikihow.com/Become-a-Good-Poker-Player",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "methods":[
    {
      "name":"Perfecting Your Poker Face",
      "steps":[
        {
          "headline":"Relax your face and jaw.",
          "description":"Remain calm and maintain a poker face by relaxing your face muscles. Avoid tightening your eyes, raising your eyebrows, or smiling. Even if you perform minute facial changes, these changes can tighten your facial muscles and give your opponents an idea of your hand."
        },
        {
          "headline":"Use sunglasses to conceal your eye movements.",
          "description":"If you’re worried about giving away too much with your eyes, consider wearing dark sunglasses to help maintain your poker face. However, even with sunglasses, try to keep your eyes as still as possible. Movement in your eyes can give away your emotions by triggering muscles on the side of your face."
        },
        {
          "headline":"Throw your opponents off by smiling.",
          "description":"Sometimes, smiling and acting confident, having conversations with your opponents, and putting on the show of being relaxed and easygoing can be just as deceptive as the best poker face. If you act positive, you might also be able to trick your opponents into folding prematurely!"
        },
        {
          "headline":"Master body language.",
          "description":"Nervous tics like knuckle cracking, nail biting, and fidgeting can reveal your emotions and therefore your hand to your opponents. Remain still and silent in order to throw them off. If that doesn’t work for you, fold your hands together or bring a stress ball and squeeze it constantly."
        },
        {
          "headline":"Record yourself playing poker for practice.",
          "description":"Make sure the game you’re playing is real when you record; without stakes, you might not exhibit any problematic tics. Put the camera somewhere that’s easy to forget about, to help you relax and display your tics. Play back the video and look for any emotional tells, or ask a friend to guess what cards you had at any point in the video, and take note of what made them think the way they did."
        },
        {
          "headline":"Remain consistent.",
          "description":"No matter what kind of poker face you choose, the most important thing is that you remain consistent. Whether you’re dealt the worst hand possible or the best hand you’ve ever seen, remaining cool and maintaining your poker face will throw off your opponents!"
        }
      ]
    },
    {
      "name":"Adapting Strategy Based on Position",
      "steps":[
        {
          "headline":"Play conservatively in early position.",
          "description":"Early position, or the seats to the left of the dealer, requires a conservative player, because when you bet in early position you’re betting before anyone else does. Early position players have to decide whether they want to bet, check, fold, or raise without seeing what the other players are going to do. When you’re sitting in early position, only play the best hands. If you’re in early position, be careful with bluffing or other “fake outs” because you don’t yet have a sense of what the other players have."
        },
        {
          "headline":"Remain cautious in middle position.",
          "description":"Middle position has the advantage of seeing how the early position players bet, but the disadvantage of playing before the late position players bet. While you can play looser in middle position than in early position, remain cautious and don’t try to be too fancy. Unlike early position, where you shouldn’t play anything but the best hands, you can play mediocre hands in middle position, but avoid playing truly awful hands or going for long bluffs. Remember that while you have a sense of the table based on early position, someone in late position could surprise you. Plan accordingly."
        },
        {
          "headline":"Leverage your late position for more playing power.",
          "description":"Late position, which is also called betting position, gives you the best information before betting. Adapt whether or not you bet, call, fold, or check based on what others at the table have done. You can play relatively bad hands in this position. For example, if you’re playing Texas Hold’em and there are only a few low bets on the table and you have a mediocre hand like a pair of 7s, late position is a good place to play that hand. Conversely, you might also want to fold a good hand in late position if you think someone who came earlier is going to beat that hand. If no one at the table has bet, late position players can win by simply betting."
        }
      ]
    },
    {
      "name":"Identifying Good Hands",
      "steps":[
        {
          "headline":"Memorize bad hands.",
          "description":"No matter what type of poker you’re playing, some hands will be worse than others. When you’re just starting out, memorize the worst hands you can get in poker, and immediately fold as soon as you draw those. This will prevent you from playing a bad game, and losing money on a bad hand. Some examples of bad hands in Texas Hold’em are a 2 and 7, a 2 and 8, and a 3 and 8. One example of a bad hand in Five Card Draw is a hand with a 2, 3, 4, 5, and 7, with all four suits represented."
        },
        {
          "headline":"Capitalize on good hands.",
          "description":"Teach yourself the stand-out hands in traditional poker plays and ruthlessly pursue the pot when you get dealt such a hand. Be careful to hide your poker tells and try to play off how good your hand is for as long as possible. Good hands in Texas Hold’em include Ace-Ace, King-King, and Queen-Queen. Because of the way Five Card Draw works, the best hand is a fully-completed Royal Flush or similar high card."
        },
        {
          "headline":"Don’t rely exclusively on your starting hand.",
          "description":"While your starting hand is a good indicator of how the game will probably go, there are many ways to increase your odds and change your chances in poker. At the end of each round, think about who is still in, what the pot is, who is bluffing, and how you think your hand compares. Make decisions on whether to bet, call, fold, or raise throughout the game, and don’t be afraid to leave a game if you’re doing poorly, even if you’ve already put some money in the pot."
        },
        {
          "headline":"Learn how to count cards.",
          "description":"No matter what type of poker you’re playing, the odds are always firmly rooted in math and information. Practice counting cards so you know what cards are remaining and what your chances are of drawing the card you need."
        }
      ]
    },
    {
      "name":"Recognizing Poker Tells",
      "steps":[
        {
          "headline":"Look for tics and fidgeting.",
          "description":"Check to see if your opponent has widened eyes, is drumming their fingers, or bouncing their legs. These and other body language tics can indicate nervousness. Depending on how they’re betting, that can either mean they have a good hand or, more likely, that they have a bad one."
        },
        {
          "headline":"Identify when someone is trying to bluff a good hand by faking indifference.",
          "description":"If you’re playing against someone who is acting uninterested in the game but stays in despite heavy betting, chances are they have a strong hand. As much as they might try to pretend they’re not excited about their cards, their willingness to stay in the game shows there’s something going on under the surface."
        },
        {
          "headline":"Observe if your opponent looks at their chips.",
          "description":"If your opponent checks their cards and then looks at their chips, there’s a chance they just did that because they want to know how much they can bet. Be cautious though, that also might be a sign of nerves at getting a bad hand and not having too many chips left!"
        },
        {
          "headline":"Notice if an opponent is trying to stare you down.",
          "description":"Often, novice poker players try to intimidate competitors by staring them down and being more aggressive when they have bad hands, especially if their hand is good but not good enough (like a low pair). Conversely, if an opponent who usually makes eye contact suddenly starts avoiding eye contact, that could mean they have a great hand and are trying to hide it."
        }
      ]
    }
  ],
  "text":" Perfecting Your Poker Face Relax your face and jaw. Remain calm and maintain a poker face by relaxing your face muscles. Avoid tightening your eyes, raising your eyebrows, or smiling. Even if you perform minute facial changes, these changes can tighten your facial muscles and give your opponents an idea of your hand. Use sunglasses to conceal your eye movements. If you’re worried about giving away too much with your eyes, consider wearing dark sunglasses to help maintain your poker face. However, even with sunglasses, try to keep your eyes as still as possible. Movement in your eyes can give away your emotions by triggering muscles on the side of your face. Throw your opponents off by smiling. Sometimes, smiling and acting confident, having conversations with your opponents, and putting on the show of being relaxed and easygoing can be just as deceptive as the best poker face. If you act positive, you might also be able to trick your opponents into folding prematurely! Master body language. Nervous tics like knuckle cracking, nail biting, and fidgeting can reveal your emotions and therefore your hand to your opponents. Remain still and silent in order to throw them off. If that doesn’t work for you, fold your hands together or bring a stress ball and squeeze it constantly. Record yourself playing poker for practice. Make sure the game you’re playing is real when you record; without stakes, you might not exhibit any problematic tics. Put the camera somewhere that’s easy to forget about, to help you relax and display your tics. Play back the video and look for any emotional tells, or ask a friend to guess what cards you had at any point in the video, and take note of what made them think the way they did. Remain consistent. No matter what kind of poker face you choose, the most important thing is that you remain consistent. Whether you’re dealt the worst hand possible or the best hand you’ve ever seen, remaining cool and maintaining your poker face will throw off your opponents! Adapting Strategy Based on Position Play conservatively in early position. Early position, or the seats to the left of the dealer, requires a conservative player, because when you bet in early position you’re betting before anyone else does. Early position players have to decide whether they want to bet, check, fold, or raise without seeing what the other players are going to do. When you’re sitting in early position, only play the best hands. If you’re in early position, be careful with bluffing or other “fake outs” because you don’t yet have a sense of what the other players have. Remain cautious in middle position. Middle position has the advantage of seeing how the early position players bet, but the disadvantage of playing before the late position players bet. While you can play looser in middle position than in early position, remain cautious and don’t try to be too fancy. Unlike early position, where you shouldn’t play anything but the best hands, you can play mediocre hands in middle position, but avoid playing truly awful hands or going for long bluffs. Remember that while you have a sense of the table based on early position, someone in late position could surprise you. Plan accordingly. Leverage your late position for more playing power. Late position, which is also called betting position, gives you the best information before betting. Adapt whether or not you bet, call, fold, or check based on what others at the table have done. You can play relatively bad hands in this position. For example, if you’re playing Texas Hold’em and there are only a few low bets on the table and you have a mediocre hand like a pair of 7s, late position is a good place to play that hand. Conversely, you might also want to fold a good hand in late position if you think someone who came earlier is going to beat that hand. If no one at the table has bet, late position players can win by simply betting. Identifying Good Hands Memorize bad hands. No matter what type of poker you’re playing, some hands will be worse than others. When you’re just starting out, memorize the worst hands you can get in poker, and immediately fold as soon as you draw those. This will prevent you from playing a bad game, and losing money on a bad hand. Some examples of bad hands in Texas Hold’em are a 2 and 7, a 2 and 8, and a 3 and 8. One example of a bad hand in Five Card Draw is a hand with a 2, 3, 4, 5, and 7, with all four suits represented. Capitalize on good hands. Teach yourself the stand-out hands in traditional poker plays and ruthlessly pursue the pot when you get dealt such a hand. Be careful to hide your poker tells and try to play off how good your hand is for as long as possible. Good hands in Texas Hold’em include Ace-Ace, King-King, and Queen-Queen. Because of the way Five Card Draw works, the best hand is a fully-completed Royal Flush or similar high card. Don’t rely exclusively on your starting hand. While your starting hand is a good indicator of how the game will probably go, there are many ways to increase your odds and change your chances in poker. At the end of each round, think about who is still in, what the pot is, who is bluffing, and how you think your hand compares. Make decisions on whether to bet, call, fold, or raise throughout the game, and don’t be afraid to leave a game if you’re doing poorly, even if you’ve already put some money in the pot. Learn how to count cards. No matter what type of poker you’re playing, the odds are always firmly rooted in math and information. Practice counting cards so you know what cards are remaining and what your chances are of drawing the card you need. Recognizing Poker Tells Look for tics and fidgeting. Check to see if your opponent has widened eyes, is drumming their fingers, or bouncing their legs. These and other body language tics can indicate nervousness. Depending on how they’re betting, that can either mean they have a good hand or, more likely, that they have a bad one. Identify when someone is trying to bluff a good hand by faking indifference. If you’re playing against someone who is acting uninterested in the game but stays in despite heavy betting, chances are they have a strong hand. As much as they might try to pretend they’re not excited about their cards, their willingness to stay in the game shows there’s something going on under the surface. Observe if your opponent looks at their chips. If your opponent checks their cards and then looks at their chips, there’s a chance they just did that because they want to know how much they can bet. Be cautious though, that also might be a sign of nerves at getting a bad hand and not having too many chips left! Notice if an opponent is trying to stare you down. Often, novice poker players try to intimidate competitors by staring them down and being more aggressive when they have bad hands, especially if their hand is good but not good enough (like a low pair). Conversely, if an opponent who usually makes eye contact suddenly starts avoiding eye contact, that could mean they have a great hand and are trying to hide it.",
  "tyn_model":[
    "poker",
    "sunglasses",
    "cards",
    "stress ball",
    "camera",
    "“fake",
    "” because",
    "pot",
    "five card draw",
    "chips"
  ],
  "tyn_section":[

  ]
}