{
  "title":"How to Avoid Snapping when Losing a Video Game",
  "url":"https://www.wikihow.com/Avoid-Snapping-when-Losing-a-Video-Game",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "methods":[
    {
      "name":"Controlling Your Emotions",
      "steps":[
        {
          "headline":"Control yourself before you break your controller.",
          "description":"What happened the last time your snapped? You probably didn’t sit down, take a few cheap hits in Mortal Kombat, and spike your controller into smithereens. Chances are, you got worked up over the course of back-to-back-to-back headshots right as your character spawned. Who wouldn’t snap!? Watch out for signs that you’re about to snap and try to chill before it happens. Before each new mission, level, or respawn, take a moment to gauge your heartrate. Gaming is fun, so your love muscle is probably pumping like mad. That said, if it’s going a little too fast, and your cheeks are flushed, take a breather. If you start spewing words your grandmother wouldn’t like, put your controller down immediately. You’re nearing meltdown."
        },
        {
          "headline":"Take a break.",
          "description":"In between epic campaigns - or every other Tetris level – get up. Walk to the kitchen. Eat a carrot. Have a glass of water. Go outside. Listen to the birds sing or contemplate the stars. The point is: give your brain or your mouth something else to ruminate. You don’t have to give up on beating the game tonight – you totally still can. You’re more likely to do so with your mood intact if you take quick breaks from time to time. In fact, your virtual sword may fall with heavier swings if you give yours eyes and thumbs a break periodically."
        },
        {
          "headline":"Plan healthy distractions ahead of time.",
          "description":"In order to help you chill after a loss, have a non-video game entertainment option already planned out. This doesn’t have to be anything grandiose. For instance, set that magazine you’ve been meaning to read next to you. Even better, get your running shoes out or pump up your bike tires. When you feel your blood begin to boil, blow some steam by working out. You can always return to your game if you so desire. Working a healthy activity into your day may even help you execute in the virtual realm. Game for shorter periods of time. This may sound like a terrible idea, but it’s an important step if you want to do a better job of keeping your cool. Your patience will begin to run thin during marathon gaming sessions. Set a timer for yourself at the start of a gaming session. Have a plan for what to do when the timer goes off."
        },
        {
          "headline":"Game in comfort.",
          "description":"Discomfort unrelated to the game may also make you agitated. If it’s uncomfortably hot in your gaming arena… er, room, you’re much more liable to snap. If you’ve been postponing dinner to continue your quest, this too shall increase your risk of snapping. Though you should work on controlling your temper regardless of environment, it’s easier to do so when you’re comfortable. If it feels like the furnace of Mordor or the ice plains of Hoth, adjust that thermostat. Keep an apple beside your console. Not only might this remind you to collect real-world nutrients to prevent a meltdown, it will also offer another distraction within easy reach."
        }
      ]
    },
    {
      "name":"Adjusting Your Mindset",
      "steps":[
        {
          "headline":"Take responsibility for your actions.",
          "description":"It’s extremely important to recognize that you alone are responsible for your real world behavior. In order to avoid snapping, recognize that it is you and you alone that allows yourself to behave this way. You must accept this responsibility in order to start changing your behavior. You won’t get better at a game unless you recognize how you can approach it differently. The same rule applies to how you handle a loss emotionally. Acknowledge the issue so you can begin addressing it."
        },
        {
          "headline":"After you snap, reflect.",
          "description":"There are several questions you can ask yourself to help prevent it from happening again. Foremost, gauge how you feel after your composure returns. Literally ask yourself, “How am I feeling right now?” You might not like your answer, but that’s okay. Next, ask yourself, “Did that contribute anything positive to my day?”  It’s a loaded question – but be honest with yourself. By forcing your mind to acknowledge your behavior, you may be able to keep your emotions in check next time you lose in a video game. Adjust the wording of questions like this however you wish. The point is to acknowledge that it doesn’t feel good when you snap. Other options include, “Did that solve anything?” or “How did that improve the situation?”"
        },
        {
          "headline":"Laugh at yourself.",
          "description":"Don’t mock or judge yourself. You should, however, look for the humor in these situations. Though this may not happen easily, it can help the process of self-reflection by easing the rapid emotional descent you’ve just endured. While laughing might not seem proactive, the ability to do so indicates that you’ve regained control of your emotions. This is vital to making a decision about how to prevent another meltdown."
        },
        {
          "headline":"Learn from the loss.",
          "description":"You’re probably thinking: “Yeah, right! They’re just a nooby &@*%-cheat!” Well, that nooby &@*%-cheat is roaring with laughter in some darkened, victory-filled dungeon. Instead of losing your cool, start thinking about how to make sure it never happens again. While someone else might be at fault – or deserve some credit – the fact of the matter is that you were in a situation that led to your loss. Immediately think about why you lost. Try to identify the specific decision that put you in position to lose. Ask yourself, “What you could have done differently to prevent this loss?”\nPlan how you’ll approach the same scenario differently next time. This will not only help your game improve, it will also keep you from losing your cool."
        },
        {
          "headline":"Give yourself a “talking to.”  You may need a dose of tough love.",
          "description":"This may be especially effective if you’re the one that dishes it out. If you keep snapping, sit yourself down and think about what’s actually happening: You are sitting on a couch, staring at a box, and holding a piece of plastic. Further, remind yourself video games are supposed to be fun. State these or other brutally honest points to yourself out loud. It may not be fun to force yourself back into the real world, but it may help you control yourself next time around. On the other hand, congratulate yourself too. Take note of healthy responses to losses, and recognize that this is evidence of improvement controlling your emotions. This will have real-world, positive effects on your life outside of gaming."
        }
      ]
    },
    {
      "name":"Getting Help",
      "steps":[
        {
          "headline":"Ask for help from other gamers.",
          "description":"Though live gameplay usually doesn’t show it, the gaming community definitely watches out for its own. Whether you’re looking for advice on how to approach a particular game scenario so you don’t lose again, or need help controlling your temper after losses, plenty of people are able to give you advice. Start by talking to other friends that game. The harder they game, the more likely they’ll have endured a similar situation. In particular, ask about specific things they do to keep their cool. You can also find plenty of advice online. You can even find play-by-play advice about how to avoid losing in certain ways. Avoid paying for gaming advice online. There are plenty of free options on blogs. If you can’t find what you’re looking for, post a question on a popular message board. Even if nobody knows what to tell you, someone will tell you where to look!"
        },
        {
          "headline":"Recognize that video games contribute to aggression.",
          "description":"Put simply, there is objective, scientific evidence that video games cause aggression. This aggression is not necessarily tied to gunning down hundreds of electric blips on a computerized version of D-Day or cutting your way through a horde of the undead. Instead, aggression is actually tied to poor performance. It’s losing itself that causes gamers to fantasize or engage in violence. If you can’t control your temper enough to follow a loss with healthy behavior, it may be time to take a break from gaming altogether. If you can focus on how to improve after a loss, and keep having fun – stick with it. Not only will you get better at keeping your cool – you’ll lose less too! If you ever have thoughts about hurting others, such as the desire to hit someone, see a mental health professional to talk about your anger."
        },
        {
          "headline":"See a mental health professional.",
          "description":"If you are in any way concerned about your ability to control your temper, or the amount of time you’re spending playing video games, set up an appointment to speak with someone about it. Mental health professionals can help you learn to control both your emotions and your behavior. If you’re still in school, see a school counselor at your earliest convenience. Outside of school, any mental health professional will help you identify your options. There are support groups online and in person for emotional control issues as well as gaming addiction."
        }
      ]
    }
  ],
  "text":" Controlling Your Emotions Control yourself before you break your controller. What happened the last time your snapped? You probably didn’t sit down, take a few cheap hits in Mortal Kombat, and spike your controller into smithereens. Chances are, you got worked up over the course of back-to-back-to-back headshots right as your character spawned. Who wouldn’t snap!? Watch out for signs that you’re about to snap and try to chill before it happens. Before each new mission, level, or respawn, take a moment to gauge your heartrate. Gaming is fun, so your love muscle is probably pumping like mad. That said, if it’s going a little too fast, and your cheeks are flushed, take a breather. If you start spewing words your grandmother wouldn’t like, put your controller down immediately. You’re nearing meltdown. Take a break. In between epic campaigns - or every other Tetris level – get up. Walk to the kitchen. Eat a carrot. Have a glass of water. Go outside. Listen to the birds sing or contemplate the stars. The point is: give your brain or your mouth something else to ruminate. You don’t have to give up on beating the game tonight – you totally still can. You’re more likely to do so with your mood intact if you take quick breaks from time to time. In fact, your virtual sword may fall with heavier swings if you give yours eyes and thumbs a break periodically. Plan healthy distractions ahead of time. In order to help you chill after a loss, have a non-video game entertainment option already planned out. This doesn’t have to be anything grandiose. For instance, set that magazine you’ve been meaning to read next to you. Even better, get your running shoes out or pump up your bike tires. When you feel your blood begin to boil, blow some steam by working out. You can always return to your game if you so desire. Working a healthy activity into your day may even help you execute in the virtual realm. Game for shorter periods of time. This may sound like a terrible idea, but it’s an important step if you want to do a better job of keeping your cool. Your patience will begin to run thin during marathon gaming sessions. Set a timer for yourself at the start of a gaming session. Have a plan for what to do when the timer goes off. Game in comfort. Discomfort unrelated to the game may also make you agitated. If it’s uncomfortably hot in your gaming arena… er, room, you’re much more liable to snap. If you’ve been postponing dinner to continue your quest, this too shall increase your risk of snapping. Though you should work on controlling your temper regardless of environment, it’s easier to do so when you’re comfortable. If it feels like the furnace of Mordor or the ice plains of Hoth, adjust that thermostat. Keep an apple beside your console. Not only might this remind you to collect real-world nutrients to prevent a meltdown, it will also offer another distraction within easy reach. Adjusting Your Mindset Take responsibility for your actions. It’s extremely important to recognize that you alone are responsible for your real world behavior. In order to avoid snapping, recognize that it is you and you alone that allows yourself to behave this way. You must accept this responsibility in order to start changing your behavior. You won’t get better at a game unless you recognize how you can approach it differently. The same rule applies to how you handle a loss emotionally. Acknowledge the issue so you can begin addressing it. After you snap, reflect. There are several questions you can ask yourself to help prevent it from happening again. Foremost, gauge how you feel after your composure returns. Literally ask yourself, “How am I feeling right now?” You might not like your answer, but that’s okay. Next, ask yourself, “Did that contribute anything positive to my day?”  It’s a loaded question – but be honest with yourself. By forcing your mind to acknowledge your behavior, you may be able to keep your emotions in check next time you lose in a video game. Adjust the wording of questions like this however you wish. The point is to acknowledge that it doesn’t feel good when you snap. Other options include, “Did that solve anything?” or “How did that improve the situation?” Laugh at yourself. Don’t mock or judge yourself. You should, however, look for the humor in these situations. Though this may not happen easily, it can help the process of self-reflection by easing the rapid emotional descent you’ve just endured. While laughing might not seem proactive, the ability to do so indicates that you’ve regained control of your emotions. This is vital to making a decision about how to prevent another meltdown. Learn from the loss. You’re probably thinking: “Yeah, right! They’re just a nooby &@*%-cheat!” Well, that nooby &@*%-cheat is roaring with laughter in some darkened, victory-filled dungeon. Instead of losing your cool, start thinking about how to make sure it never happens again. While someone else might be at fault – or deserve some credit – the fact of the matter is that you were in a situation that led to your loss. Immediately think about why you lost. Try to identify the specific decision that put you in position to lose. Ask yourself, “What you could have done differently to prevent this loss?”\nPlan how you’ll approach the same scenario differently next time. This will not only help your game improve, it will also keep you from losing your cool. Give yourself a “talking to.”  You may need a dose of tough love. This may be especially effective if you’re the one that dishes it out. If you keep snapping, sit yourself down and think about what’s actually happening: You are sitting on a couch, staring at a box, and holding a piece of plastic. Further, remind yourself video games are supposed to be fun. State these or other brutally honest points to yourself out loud. It may not be fun to force yourself back into the real world, but it may help you control yourself next time around. On the other hand, congratulate yourself too. Take note of healthy responses to losses, and recognize that this is evidence of improvement controlling your emotions. This will have real-world, positive effects on your life outside of gaming. Getting Help Ask for help from other gamers. Though live gameplay usually doesn’t show it, the gaming community definitely watches out for its own. Whether you’re looking for advice on how to approach a particular game scenario so you don’t lose again, or need help controlling your temper after losses, plenty of people are able to give you advice. Start by talking to other friends that game. The harder they game, the more likely they’ll have endured a similar situation. In particular, ask about specific things they do to keep their cool. You can also find plenty of advice online. You can even find play-by-play advice about how to avoid losing in certain ways. Avoid paying for gaming advice online. There are plenty of free options on blogs. If you can’t find what you’re looking for, post a question on a popular message board. Even if nobody knows what to tell you, someone will tell you where to look! Recognize that video games contribute to aggression. Put simply, there is objective, scientific evidence that video games cause aggression. This aggression is not necessarily tied to gunning down hundreds of electric blips on a computerized version of D-Day or cutting your way through a horde of the undead. Instead, aggression is actually tied to poor performance. It’s losing itself that causes gamers to fantasize or engage in violence. If you can’t control your temper enough to follow a loss with healthy behavior, it may be time to take a break from gaming altogether. If you can focus on how to improve after a loss, and keep having fun – stick with it. Not only will you get better at keeping your cool – you’ll lose less too! If you ever have thoughts about hurting others, such as the desire to hit someone, see a mental health professional to talk about your anger. See a mental health professional. If you are in any way concerned about your ability to control your temper, or the amount of time you’re spending playing video games, set up an appointment to speak with someone about it. Mental health professionals can help you learn to control both your emotions and your behavior. If you’re still in school, see a school counselor at your earliest convenience. Outside of school, any mental health professional will help you identify your options. There are support groups online and in person for emotional control issues as well as gaming addiction.",
  "tyn_model":[
    "controller",
    "mental health professional",
    "– you",
    "“how",
    "“did",
    "”  ",
    "mortal kombat",
    "tetris level",
    "– get",
    "carrot",
    "water",
    "timer",
    "… er",
    "apple",
    "” you",
    "– but",
    "” or",
    "” laugh",
    "“yeah",
    "” well",
    "– or",
    "– the",
    "“what",
    "”\n",
    "“talking",
    "video games",
    "electric blips",
    "– stick",
    "mental health professionals"
  ],
  "tyn_section":[

  ]
}