{
  "title":"How to Submit a Review on the Nintendo eShop",
  "url":"https://www.wikihow.com/Submit-a-Review-on-the-Nintendo-eShop",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo 3DS"
  ],
  "steps":[
    {
      "headline":"Turn the 3DS on.",
      "description":"Make sure it is connected to the Internet."
    },
    {
      "headline":"Launch the Nintendo eShop.",
      "description":""
    },
    {
      "headline":"Slide to  the beginning of the screen.",
      "description":"Tap Rate Titles. You could also tap Menu and then Rate Titles from the home screen."
    },
    {
      "headline":"Select the title that you want to review.",
      "description":"You cannot rate a title that you have not played on that 3DS system, or a Nintendo DS title."
    },
    {
      "headline":"Answer the five questions.",
      "description":"What gender is the person who spent the most time playing this title? What age is the person who spent the most time playing this title? Give this title a rating from one to five stars\nWho do you think this title appeals to? What kind of play style is this title more suited for?"
    },
    {
      "headline":"Tap Submit.",
      "description":""
    }
  ],
  "text":" Turn the 3DS on. Make sure it is connected to the Internet. Launch the Nintendo eShop.  Slide to  the beginning of the screen. Tap Rate Titles. You could also tap Menu and then Rate Titles from the home screen. Select the title that you want to review. You cannot rate a title that you have not played on that 3DS system, or a Nintendo DS title. Answer the five questions. What gender is the person who spent the most time playing this title? What age is the person who spent the most time playing this title? Give this title a rating from one to five stars\nWho do you think this title appeals to? What kind of play style is this title more suited for? Tap Submit. ",
  "tyn_model":[
    "3ds",
    "nintendo eshop",
    "3ds system",
    "nintendo ds"
  ],
  "tyn_section":[

  ]
}