{
  "title":"How to Cook Corn in the Microwave",
  "url":"https://www.wikihow.com/Cook-Corn-in-the-Microwave",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Maize"
  ],
  "methods":[
    {
      "name":"Corn on the Cob",
      "steps":[
        {
          "headline":"Set up to four ears of corn in the microwave.",
          "description":"Cooking whole, raw corn on the cob is a cinch. Gather your corn (husks on) and set them in the microwave. You may place them on a paper towel or a microwave-safe plate, but as long as the husks are on and your microwave is clean, this isn't required. If you're cooking more than four ears, limit yourself to batches of four at a time — many microwaves will have trouble heating more than four at once. Don't take the husks off yet. If you've already done this, your corn isn't ruined, but leaving the husks on will help keep the ears moist and delicious. You can wrap the ears in a paper towel if desired to duplicate the effect of the husks."
        },
        {
          "headline":"Microwave for at least three minutes.",
          "description":"Set your microwave to \"HIGH\" or its default cooking setting for between three and five minutes. Depending on the number of ears you're cooking, the precise cooking time can vary — one online source recommends three minutes for one or two ears and four minutes for three or four ears. Because microwaves can vary in terms of cooking strength, you may find that it's a good idea to cook a little less time than you think you need to, then check on the corn. You can always cook the corn for an extra minute or two if needed, but you can't \"undo\" the damage once it's overdone."
        },
        {
          "headline":"Let the corn cool.",
          "description":"After a few minutes in the microwave, the ears' outer husks may not feel terribly hot, but the insides are likely piping hot. To avoid injury, set the corn (husks still on) on a wire cooling rack for about five minutes to cool. You're ready to proceed when the silks (the stringy part inside the husk) and the tops of the leaves are cool enough to handle with your bare hands."
        },
        {
          "headline":"Shuck just before serving.",
          "description":"One of the benefits of leaving the husks on (besides preserving the internal moisture of the ears of corn) is that they act like insulators, keeping the kernels fairly warm. As soon as you take the husks off, however, the kernels will start to cool much more rapidly, so wait until right before you're ready to eat to do your shucking. Be careful while you shuck the corn — the insides can still be hot. If you're unsure, peel back the husk a little bit and carefully feel the kernels with the back of your hand. For a step-by-step guide, see our corn-husking article."
        }
      ]
    },
    {
      "name":"Canned\\/Refrigerated Corn",
      "steps":[
        {
          "headline":"Drain the corn.",
          "description":"Cooking corn off-the-cob (whether it's from a can or cut from the cob itself) is easy with a microwave. Start by draining the corn of any excess liquid — you want your finished product to be soft, delicious corn kernels, not corn soup. See below for instructions. Canned corn: Open the can with a can opener until the lid is connected by just a small piece of metal. Tip the can into the sink, keeping the lid on, and let the excess liquid drain. Remove the lid and pour the corn into a strainer, then rinse with water and allow to drain. Refrigerated corn: Draining is less of an issue here because there will usually be less excess moisture. Toss the corn lightly in a strainer or use a slotted spoon to drain the corn."
        },
        {
          "headline":"Add salt, pepper, and butter.",
          "description":"Season your corn now for a delicious taste as soon as it comes out of the microwave! Salt and pepper give the sweet corn kernels an excellent savory dimension, while butter keeps them moist and gives a smooth texture. You may use as much salt, pepper, and butter as you wish. If you're unsure, adding about one tablespoon of butter for every 12-ounce can of corn (the equivalent of about 1.5 cups of loose corn) and salt and pepper to taste should give great results."
        },
        {
          "headline":"Cover and cook for approximately four minutes.",
          "description":"Making sure that your corn is in a microwave-safe container, transfer it to the microwave and cook it on \"HIGH\" or your preferred setting for about three minutes. Stop the microwave and stir every minute or so to ensure the butter and seasonings are combining well. Don't use an airtight cover or lid — you want to keep the moisture in, but if steam builds up in an airtight container, it can cause an explosion. Leave the lid oven a crack to allow excess steam to escape."
        },
        {
          "headline":"Remove from microwave, stir, and serve.",
          "description":"Carefully remove the corn from the microwave, take the lid off, and check to see that the corn has heated evenly. If so, stir the mixture and serve immediately. If not, feel free to return it to the microwave for a minute or two. If you are cooking a large amount of corn (more than a can or two), be ready to microwave for a little extra time. In general, the more food you microwave at once, the longer it will take to cook."
        }
      ]
    },
    {
      "name":"Frozen Corn",
      "steps":[
        {
          "headline":"Add frozen corn to a microwave-safe bowl.",
          "description":"Open your packet of frozen corn and pour it into a large microwave-safe bowl. If you like, you can break up any clumps of frozen-together kernels to ensure the corn cooks more evenly, but this is not required."
        },
        {
          "headline":"Optionally, add water.",
          "description":"At this point, you can add a small amount of water to the bowl if you would like your corn slightly softer when it's done. The extra water will boil and steam the corn as it cooks, breaking it down a little more than it would from ordinary cooking and giving it a softer texture. You may add as much or as little water as you want — you can always drain excess water after you're done if you add too much. A good general rule is to use about two tablespoons of water for every pound (16 ounces) of frozen corn you use."
        },
        {
          "headline":"Microwave for four to five minutes.",
          "description":"Set your microwave to \"HIGH\" or your preferred cooking setting and let the corn heat for about four or five minutes. Every minute or two, pause the microwave and stir the corn to ensure even heating. Note: These directions assume you're using about one pound (16 ounces) of frozen corn. If you're using significantly less, you may want to shorten this cooking period to about two or three minutes to ensure your corn does not burn or dry out."
        },
        {
          "headline":"Repeat as necessary.",
          "description":"After the first cooking period, check your corn. Depending on how much corn you used and the strength of your microwave, it may or may not be evenly-heated at this point. If you detect cold spots, stir the corn and return it to the microwave to cook in two-minute intervals. Repeat this pattern until your corn is all the way cooked."
        },
        {
          "headline":"Season and serve.",
          "description":"When your corn has heated evenly and no icy spots remain, it's ready to eat! At this point, you can add whatever seasonings you want and enjoy. For one pound of corn, about a tablespoon and a half of butter and salt and pepper to taste will give an excellent \"classic\" savory flavor. There may be some excess water at the bottom of your corn from the  melted ice when you finish microwaving. If this is the case, you can carefully pour it into the sink (taking care to avoid touching it, as it will likely be hot) or toss the corn in a strainer to remove it."
        },
        {
          "headline":"Enjoy!",
          "description":""
        }
      ]
    }
  ],
  "text":" Corn on the Cob Set up to four ears of corn in the microwave. Cooking whole, raw corn on the cob is a cinch. Gather your corn (husks on) and set them in the microwave. You may place them on a paper towel or a microwave-safe plate, but as long as the husks are on and your microwave is clean, this isn't required. If you're cooking more than four ears, limit yourself to batches of four at a time — many microwaves will have trouble heating more than four at once. Don't take the husks off yet. If you've already done this, your corn isn't ruined, but leaving the husks on will help keep the ears moist and delicious. You can wrap the ears in a paper towel if desired to duplicate the effect of the husks. Microwave for at least three minutes. Set your microwave to \"HIGH\" or its default cooking setting for between three and five minutes. Depending on the number of ears you're cooking, the precise cooking time can vary — one online source recommends three minutes for one or two ears and four minutes for three or four ears. Because microwaves can vary in terms of cooking strength, you may find that it's a good idea to cook a little less time than you think you need to, then check on the corn. You can always cook the corn for an extra minute or two if needed, but you can't \"undo\" the damage once it's overdone. Let the corn cool. After a few minutes in the microwave, the ears' outer husks may not feel terribly hot, but the insides are likely piping hot. To avoid injury, set the corn (husks still on) on a wire cooling rack for about five minutes to cool. You're ready to proceed when the silks (the stringy part inside the husk) and the tops of the leaves are cool enough to handle with your bare hands. Shuck just before serving. One of the benefits of leaving the husks on (besides preserving the internal moisture of the ears of corn) is that they act like insulators, keeping the kernels fairly warm. As soon as you take the husks off, however, the kernels will start to cool much more rapidly, so wait until right before you're ready to eat to do your shucking. Be careful while you shuck the corn — the insides can still be hot. If you're unsure, peel back the husk a little bit and carefully feel the kernels with the back of your hand. For a step-by-step guide, see our corn-husking article. Canned\\/Refrigerated Corn Drain the corn. Cooking corn off-the-cob (whether it's from a can or cut from the cob itself) is easy with a microwave. Start by draining the corn of any excess liquid — you want your finished product to be soft, delicious corn kernels, not corn soup. See below for instructions. Canned corn: Open the can with a can opener until the lid is connected by just a small piece of metal. Tip the can into the sink, keeping the lid on, and let the excess liquid drain. Remove the lid and pour the corn into a strainer, then rinse with water and allow to drain. Refrigerated corn: Draining is less of an issue here because there will usually be less excess moisture. Toss the corn lightly in a strainer or use a slotted spoon to drain the corn. Add salt, pepper, and butter. Season your corn now for a delicious taste as soon as it comes out of the microwave! Salt and pepper give the sweet corn kernels an excellent savory dimension, while butter keeps them moist and gives a smooth texture. You may use as much salt, pepper, and butter as you wish. If you're unsure, adding about one tablespoon of butter for every 12-ounce can of corn (the equivalent of about 1.5 cups of loose corn) and salt and pepper to taste should give great results. Cover and cook for approximately four minutes. Making sure that your corn is in a microwave-safe container, transfer it to the microwave and cook it on \"HIGH\" or your preferred setting for about three minutes. Stop the microwave and stir every minute or so to ensure the butter and seasonings are combining well. Don't use an airtight cover or lid — you want to keep the moisture in, but if steam builds up in an airtight container, it can cause an explosion. Leave the lid oven a crack to allow excess steam to escape. Remove from microwave, stir, and serve. Carefully remove the corn from the microwave, take the lid off, and check to see that the corn has heated evenly. If so, stir the mixture and serve immediately. If not, feel free to return it to the microwave for a minute or two. If you are cooking a large amount of corn (more than a can or two), be ready to microwave for a little extra time. In general, the more food you microwave at once, the longer it will take to cook. Frozen Corn Add frozen corn to a microwave-safe bowl. Open your packet of frozen corn and pour it into a large microwave-safe bowl. If you like, you can break up any clumps of frozen-together kernels to ensure the corn cooks more evenly, but this is not required. Optionally, add water. At this point, you can add a small amount of water to the bowl if you would like your corn slightly softer when it's done. The extra water will boil and steam the corn as it cooks, breaking it down a little more than it would from ordinary cooking and giving it a softer texture. You may add as much or as little water as you want — you can always drain excess water after you're done if you add too much. A good general rule is to use about two tablespoons of water for every pound (16 ounces) of frozen corn you use. Microwave for four to five minutes. Set your microwave to \"HIGH\" or your preferred cooking setting and let the corn heat for about four or five minutes. Every minute or two, pause the microwave and stir the corn to ensure even heating. Note: These directions assume you're using about one pound (16 ounces) of frozen corn. If you're using significantly less, you may want to shorten this cooking period to about two or three minutes to ensure your corn does not burn or dry out. Repeat as necessary. After the first cooking period, check your corn. Depending on how much corn you used and the strength of your microwave, it may or may not be evenly-heated at this point. If you detect cold spots, stir the corn and return it to the microwave to cook in two-minute intervals. Repeat this pattern until your corn is all the way cooked. Season and serve. When your corn has heated evenly and no icy spots remain, it's ready to eat! At this point, you can add whatever seasonings you want and enjoy. For one pound of corn, about a tablespoon and a half of butter and salt and pepper to taste will give an excellent \"classic\" savory flavor. There may be some excess water at the bottom of your corn from the  melted ice when you finish microwaving. If this is the case, you can carefully pour it into the sink (taking care to avoid touching it, as it will likely be hot) or toss the corn in a strainer to remove it. Enjoy! ",
  "tyn_model":[
    "corn",
    "microwave",
    "water",
    "butter",
    "— you",
    "strainer",
    "frozen corn",
    "microwaves",
    "salt",
    "pepper",
    "seasonings",
    "microwave-safe bowl",
    "microwave-safe plate",
    "— many",
    "— one",
    "— the",
    "corn-husking",
    "corn soup",
    "can opener",
    "slotted spoon",
    "salt, pepper",
    "microwave-safe",
    "airtight cover",
    "airtight container",
    "bowl",
    "salt and pepper",
    "ice"
  ],
  "tyn_section":[

  ]
}