{
  "title":"How to Slice Cheese",
  "url":"https://www.wikihow.com/Slice-Cheese",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Cheese"
  ],
  "methods":[
    {
      "name":"Slicing Cheese Wedges",
      "steps":[
        {
          "headline":"Use a sharp knife to cut smaller wedges if you have wheels or pyramids.",
          "description":"If you have a wheel or pyramid of cheese, you can easily cut it into smaller wedges to serve and eat. Use a sharp knife, and place the tip of your knife at the center of your cheese. Cut your cheese into even wedges about 1–2 inches (2.5–5.1 cm) wide. Make even slices around the entirety of your wheel or pyramid. Then, you can cut the wedges into smaller slices depending on your cheese type. You can do this for soft, medium, or hard cheeses. When you are finished, you should have about 8-16 slices, depending on the size of your cheese and the thickness of your sections."
        },
        {
          "headline":"Cut off the wax rind from your semi-soft wedge before you eat it.",
          "description":"If your cheese has a protective wax rind, cut this off before you slice your wedge. Take your knife and place it immediately next to the wax outer layer. Insert your knife into the cheese with medium pressure, and make 1 slice along the longest edge of your wedge. Then, turn your knife and make another slice to remove the wax on the shorter edge. You should easily cut away the wax in 1-3 slices. For example, slice off the wax from gouda and edam cheese wedges."
        },
        {
          "headline":"Make your cuts along the long edge if you are slicing soft wedges.",
          "description":"If you picked up a wedge of soft cheese cheese from the supermarket, you can easily cut it with a sharp knife. Cut your slices across the wedge’s longest side, angling your knife from the tip as you make your slices. This will slice your wedge into thin, even pieces of cheese. You can slice your cheese as thick or thin as you’d like. Aim for about ⁄4–⁄2 inch (0.64–1.27 cm) wide slices."
        },
        {
          "headline":"Chop your cheese width-wise if you have a semi-firm or hard wedge.",
          "description":"To make your cuts, lay your cheese wedge on its side, and position your knife at the shortest, thinnest side of your cheese. Cut your wedge down the width of your cheese and make a slice every ⁄4–⁄4 inch (0.64–1.91 cm) depending on how big of pieces you’d like. When you get to the last piece at the thickest side of your wedge, cut it in half lengthwise rather than width-wise. If your wedge is on the larger side, you may want to slice it in half first. Slice your cheddar, asiago, goya, and romano cheeses like this, for example."
        },
        {
          "headline":"Cut from the center on a bias if you are slicing a blue cheese wedge.",
          "description":"Lay your cheese wedge on its side, and position a sharp blade at the center of the narrow end. Point your knife to the outer side, and make  your slice in a radial pattern. Continue making slices until you reach the other side of your wedge. Each slice should be between ⁄4–⁄3 inch (0.64–1.69 cm) wide. This works best with firm blue cheese wedges."
        }
      ]
    },
    {
      "name":"Cutting Blocks of Cheese",
      "steps":[
        {
          "headline":"Chop semi-firm cheese blocks into triangles.",
          "description":"If you want to slice your cheese bricks into triangular bites, first cut your block in half to get 2 rectangles. Then, slice each half into rectangle pieces roughly ⁄8 inch (0.32 cm) thick. Finally, cut each slice at its diagonal to get 2 triangles per slice. This is a great way to slice different cheddar cheeses."
        },
        {
          "headline":"Slice your cheese into evenly spaced coins if cutting logs of cheese.",
          "description":"Unwrap your cheese log, and position your knife about ⁄8–⁄4 inch (0.32–0.64 cm) from the edge. Make 1 slice by pressing your knife into the cheese with medium, downward pressure. Lift up on your knife, and repeat this another ⁄8–⁄4 inch (0.32–0.64 cm) down your log. Do this until you have chopped all of your cheese log. You will have about 10-18 coins of cheese, depending on the size of your slices. Do this for fresh or aged goat and mozzarella cheeses."
        },
        {
          "headline":"Cut even cross-section slices if slicing rectangular blocks of cheese.",
          "description":"With a large knife, start making slices into your rectangular chunks of cheese about ⁄8–⁄4 inch (0.32–0.64 cm) thick. Do this by inserting your knife into your cheese starting at 1 end, and making evenly spaced cuts down the length of your cheese. Your slices should all be about the same thickness, though you can adjust the thickness of your slices to your liking. You can slice blocks of cheeses including Swiss, cheddar, colby jack, and pepper jack."
        }
      ]
    },
    {
      "name":"Using the Right Knife",
      "steps":[
        {
          "headline":"Use a soft cheese knife to easily cut soft to semi-soft cheeses.",
          "description":"Soft cheese knives are long, sharp blades with a pointed end. In addition, they have holes in the blade which prevent the cheese from sticking to your knife. To make your slices, angle your knife at the long edge of your cheese and press down into the block with firm, even pressure. For example, this knife works great when cutting Havarti. You can use the points at the end of the knife to pick up your cheese after you slice it."
        },
        {
          "headline":"Grab a cabana to cut decisive pieces of crumbly cheeses.",
          "description":"A cabana is a wide, bell shaped cheese knife helpful to chop off chunks. To use, insert it into a wheel of cheese, and pull away the knife to separate your bite from the rest. Use a scooping motion to lift up your cheese. Use this to cut chunks of blue and goat cheese, for example."
        },
        {
          "headline":"Cut your medium-soft or medium-hard cheeses with a wire cheese slicer.",
          "description":"Wire cheese slicers are helpful tools to easily slice through bricks of medium cheeses. To use, lift up on the handle of the wire slicer, and sit your cheese overtop the cut guideline where you want to make your slice. Then, simply press down on the handle to lower your wire into your cheese and make your cuts. Pull back on your block to separate your slice. You can make your slices as thick as you’d like. A typical slice is about ⁄8–⁄4 inch (0.32–0.64 cm) thick."
        },
        {
          "headline":"Use a cheese plane to slice very thin pieces of hard cheeses.",
          "description":"A cheese plane is a wide cheese grater used by hand. Place your block of cheese on its thinnest side, and position your cheese plane at the edge of the top face. Slowly and firmly drag your cheese plane over the entirety of your cheese. As you do this, the groove in the plane will slice your cheese. Use a cheese plane for Swiss and Emmental cheeses if you want very thin slices."
        },
        {
          "headline":"Chop hard cheeses with a core knife.",
          "description":"“Core” means heart in Italian, and it is a cheese knife with a sharp, pointed tip. Take a chunk of your cheese, and angle the sharp edge of your core at the cheese. Press downward on your core to chip off pieces from your chunk. Use these to slice off pieces of parmesan or cheddar cheeses."
        },
        {
          "headline":"Cut slices or cubes of hard cheeses with a cleaver.",
          "description":"A cleaver is a wide blade, sharp-edged tool used to make decisive cuts. It is wide enough to slice through an entire block of cheese in 1 motion. Simply put your cleaver on your block of cheese, and press downward in a single motion. To make cubes, slice your cheese and then make additional chops to create square shapes. Use a cleaver to section off Swiss and cheddar cheeses, for example."
        }
      ]
    }
  ],
  "text":" Slicing Cheese Wedges Use a sharp knife to cut smaller wedges if you have wheels or pyramids. If you have a wheel or pyramid of cheese, you can easily cut it into smaller wedges to serve and eat. Use a sharp knife, and place the tip of your knife at the center of your cheese. Cut your cheese into even wedges about 1–2 inches (2.5–5.1 cm) wide. Make even slices around the entirety of your wheel or pyramid. Then, you can cut the wedges into smaller slices depending on your cheese type. You can do this for soft, medium, or hard cheeses. When you are finished, you should have about 8-16 slices, depending on the size of your cheese and the thickness of your sections. Cut off the wax rind from your semi-soft wedge before you eat it. If your cheese has a protective wax rind, cut this off before you slice your wedge. Take your knife and place it immediately next to the wax outer layer. Insert your knife into the cheese with medium pressure, and make 1 slice along the longest edge of your wedge. Then, turn your knife and make another slice to remove the wax on the shorter edge. You should easily cut away the wax in 1-3 slices. For example, slice off the wax from gouda and edam cheese wedges. Make your cuts along the long edge if you are slicing soft wedges. If you picked up a wedge of soft cheese cheese from the supermarket, you can easily cut it with a sharp knife. Cut your slices across the wedge’s longest side, angling your knife from the tip as you make your slices. This will slice your wedge into thin, even pieces of cheese. You can slice your cheese as thick or thin as you’d like. Aim for about ⁄4–⁄2 inch (0.64–1.27 cm) wide slices. Chop your cheese width-wise if you have a semi-firm or hard wedge. To make your cuts, lay your cheese wedge on its side, and position your knife at the shortest, thinnest side of your cheese. Cut your wedge down the width of your cheese and make a slice every ⁄4–⁄4 inch (0.64–1.91 cm) depending on how big of pieces you’d like. When you get to the last piece at the thickest side of your wedge, cut it in half lengthwise rather than width-wise. If your wedge is on the larger side, you may want to slice it in half first. Slice your cheddar, asiago, goya, and romano cheeses like this, for example. Cut from the center on a bias if you are slicing a blue cheese wedge. Lay your cheese wedge on its side, and position a sharp blade at the center of the narrow end. Point your knife to the outer side, and make  your slice in a radial pattern. Continue making slices until you reach the other side of your wedge. Each slice should be between ⁄4–⁄3 inch (0.64–1.69 cm) wide. This works best with firm blue cheese wedges. Cutting Blocks of Cheese Chop semi-firm cheese blocks into triangles. If you want to slice your cheese bricks into triangular bites, first cut your block in half to get 2 rectangles. Then, slice each half into rectangle pieces roughly ⁄8 inch (0.32 cm) thick. Finally, cut each slice at its diagonal to get 2 triangles per slice. This is a great way to slice different cheddar cheeses. Slice your cheese into evenly spaced coins if cutting logs of cheese. Unwrap your cheese log, and position your knife about ⁄8–⁄4 inch (0.32–0.64 cm) from the edge. Make 1 slice by pressing your knife into the cheese with medium, downward pressure. Lift up on your knife, and repeat this another ⁄8–⁄4 inch (0.32–0.64 cm) down your log. Do this until you have chopped all of your cheese log. You will have about 10-18 coins of cheese, depending on the size of your slices. Do this for fresh or aged goat and mozzarella cheeses. Cut even cross-section slices if slicing rectangular blocks of cheese. With a large knife, start making slices into your rectangular chunks of cheese about ⁄8–⁄4 inch (0.32–0.64 cm) thick. Do this by inserting your knife into your cheese starting at 1 end, and making evenly spaced cuts down the length of your cheese. Your slices should all be about the same thickness, though you can adjust the thickness of your slices to your liking. You can slice blocks of cheeses including Swiss, cheddar, colby jack, and pepper jack. Using the Right Knife Use a soft cheese knife to easily cut soft to semi-soft cheeses. Soft cheese knives are long, sharp blades with a pointed end. In addition, they have holes in the blade which prevent the cheese from sticking to your knife. To make your slices, angle your knife at the long edge of your cheese and press down into the block with firm, even pressure. For example, this knife works great when cutting Havarti. You can use the points at the end of the knife to pick up your cheese after you slice it. Grab a cabana to cut decisive pieces of crumbly cheeses. A cabana is a wide, bell shaped cheese knife helpful to chop off chunks. To use, insert it into a wheel of cheese, and pull away the knife to separate your bite from the rest. Use a scooping motion to lift up your cheese. Use this to cut chunks of blue and goat cheese, for example. Cut your medium-soft or medium-hard cheeses with a wire cheese slicer. Wire cheese slicers are helpful tools to easily slice through bricks of medium cheeses. To use, lift up on the handle of the wire slicer, and sit your cheese overtop the cut guideline where you want to make your slice. Then, simply press down on the handle to lower your wire into your cheese and make your cuts. Pull back on your block to separate your slice. You can make your slices as thick as you’d like. A typical slice is about ⁄8–⁄4 inch (0.32–0.64 cm) thick. Use a cheese plane to slice very thin pieces of hard cheeses. A cheese plane is a wide cheese grater used by hand. Place your block of cheese on its thinnest side, and position your cheese plane at the edge of the top face. Slowly and firmly drag your cheese plane over the entirety of your cheese. As you do this, the groove in the plane will slice your cheese. Use a cheese plane for Swiss and Emmental cheeses if you want very thin slices. Chop hard cheeses with a core knife. “Core” means heart in Italian, and it is a cheese knife with a sharp, pointed tip. Take a chunk of your cheese, and angle the sharp edge of your core at the cheese. Press downward on your core to chip off pieces from your chunk. Use these to slice off pieces of parmesan or cheddar cheeses. Cut slices or cubes of hard cheeses with a cleaver. A cleaver is a wide blade, sharp-edged tool used to make decisive cuts. It is wide enough to slice through an entire block of cheese in 1 motion. Simply put your cleaver on your block of cheese, and press downward in a single motion. To make cubes, slice your cheese and then make additional chops to create square shapes. Use a cleaver to section off Swiss and cheddar cheeses, for example.",
  "tyn_model":[
    "knife",
    "cheese",
    "cheese plane",
    "cleaver",
    "sharp knife",
    "blue cheese",
    "cheese knife",
    "slicing cheese",
    "wax rind",
    "wax",
    "edam cheese",
    "cheddar",
    "cheese wedge",
    "cheese bricks",
    "cheese log",
    "colby jack",
    "pepper jack",
    "soft cheese knife",
    "soft cheese knives",
    "cabana",
    "goat cheese",
    "wire cheese slicer",
    "wire cheese slicers",
    "wire slicer",
    "wire",
    "cheese grater",
    "core knife",
    "“core",
    "” means"
  ],
  "tyn_section":[

  ]
}