{
  "title":"How to Make Okinawan Dangos",
  "url":"https://www.wikihow.com/Make-Okinawan-Dangos",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Japanese Dishes"
  ],
  "steps":[
    {
      "headline":"Combine the flour, baking powder, salt, and sugar in a large mixing bowl.",
      "description":""
    },
    {
      "headline":"Mix the eggs, vanilla, and milk in a medium mixing bowl.",
      "description":""
    },
    {
      "headline":"Slowly incorporate the dry with the wet ingredients.",
      "description":"The dough will form into a semi-sticky mixture, so be sure to avoid over-beating it."
    },
    {
      "headline":"Use a wok as a deep fryer with canola or vegetable oil.",
      "description":"Be sure to add enough oil to cover the doughnuts, but leave at least two inches (5cm) from the top."
    },
    {
      "headline":"Use an ice cream or cookie dough scoop to create small round balls.",
      "description":"Drop them in the hot oil."
    },
    {
      "headline":"Fry the balls until golden brown.",
      "description":"Drain any excess oil on paper towels."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Combine the flour, baking powder, salt, and sugar in a large mixing bowl.  Mix the eggs, vanilla, and milk in a medium mixing bowl.  Slowly incorporate the dry with the wet ingredients. The dough will form into a semi-sticky mixture, so be sure to avoid over-beating it. Use a wok as a deep fryer with canola or vegetable oil. Be sure to add enough oil to cover the doughnuts, but leave at least two inches (5cm) from the top. Use an ice cream or cookie dough scoop to create small round balls. Drop them in the hot oil. Fry the balls until golden brown. Drain any excess oil on paper towels. Finished. ",
  "tyn_model":[
    "oil",
    "flour",
    "baking powder",
    "salt",
    "sugar",
    "large mixing bowl",
    "eggs",
    "vanilla",
    "milk",
    "medium mixing bowl",
    "wok",
    "deep fryer",
    "canola or vegetable oil",
    "ice cream or",
    "cookie dough scoop",
    "paper towels"
  ],
  "tyn_section":[

  ]
}