{
  "title":"How to Make Rose Petal Sandwiches",
  "url":"https://www.wikihow.com/Make-Rose-Petal-Sandwiches",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "steps":[
    {
      "headline":"Butter slices of sandwich bread.",
      "description":"Do as many as you think you'll need for guests. It's up to you whether or not you cut off the crust. Judge it by how nice the crust looks on the bread you're using."
    },
    {
      "headline":"Add petals to each sandwich.",
      "description":"There is a bit of a trick to this, in that you need to let the petals slightly overlap the edges of the sandwiches in order for them to be seen by guests. It's also a good idea to vary the colours being added if you have a variety of colours. The colour theme is up to you though."
    },
    {
      "headline":"Cut the sandwiches into quarters.",
      "description":"The petals should show from every edge of the sandwich."
    },
    {
      "headline":"Arrange the rose petal sandwich quarters on a pretty tray or plate for serving.",
      "description":"Placing doilies under the sandwiches can be an effective arrangement decoration."
    }
  ],
  "text":" Butter slices of sandwich bread. Do as many as you think you'll need for guests. It's up to you whether or not you cut off the crust. Judge it by how nice the crust looks on the bread you're using. Add petals to each sandwich. There is a bit of a trick to this, in that you need to let the petals slightly overlap the edges of the sandwiches in order for them to be seen by guests. It's also a good idea to vary the colours being added if you have a variety of colours. The colour theme is up to you though. Cut the sandwiches into quarters. The petals should show from every edge of the sandwich. Arrange the rose petal sandwich quarters on a pretty tray or plate for serving. Placing doilies under the sandwiches can be an effective arrangement decoration.",
  "tyn_model":[
    "petals",
    "sandwich bread",
    "rose petal",
    "plate",
    "doilies"
  ],
  "tyn_section":[

  ]
}