{
  "title":"How to Find Suitable Wrapping Materials for Confectionery",
  "url":"https://www.wikihow.com/Find-Suitable-Wrapping-Materials-for-Confectionery",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy"
  ],
  "steps":[
    {
      "headline":"Find materials for individual wrapping of sweets.",
      "description":"Some ideas include:\nGreaseproof or wax paper. This is more suited to home use rather than for gift giving or sales though. Clear cellophane or kitchen plastic wrap are good options to show off the sweet inside. These are good for gifts and sales too. Coloured cellophane is another option. Kitchen foil or metallic wrapping paper can provide a sense of richness, akin to the chocolates wrapped up in commercial boxes. Small cupcake/sweet cases used for truffles or chocolates are another possibility."
    },
    {
      "headline":"Wrap sweets in a line of cellophane with bows or knots between them.",
      "description":"This can made into a fun necklace for children's prizes, gifts or charity sales items."
    },
    {
      "headline":"Place unwrapped sweets into larger containers or sweet boxes to serve as the \"wrapping\".",
      "description":"Line the container with foil or paper sweet cases and arrange the sweets into the container or box."
    },
    {
      "headline":"Use origami.",
      "description":"If you're good at making origami, place individual truffles or substantial sweets inside an origami box or design. Line the base with foil to prevent stains weeping through the paper."
    }
  ],
  "text":" Find materials for individual wrapping of sweets. Some ideas include:\nGreaseproof or wax paper. This is more suited to home use rather than for gift giving or sales though. Clear cellophane or kitchen plastic wrap are good options to show off the sweet inside. These are good for gifts and sales too. Coloured cellophane is another option. Kitchen foil or metallic wrapping paper can provide a sense of richness, akin to the chocolates wrapped up in commercial boxes. Small cupcake/sweet cases used for truffles or chocolates are another possibility. Wrap sweets in a line of cellophane with bows or knots between them. This can made into a fun necklace for children's prizes, gifts or charity sales items. Place unwrapped sweets into larger containers or sweet boxes to serve as the \"wrapping\". Line the container with foil or paper sweet cases and arrange the sweets into the container or box. Use origami. If you're good at making origami, place individual truffles or substantial sweets inside an origami box or design. Line the base with foil to prevent stains weeping through the paper.",
  "tyn_model":[
    "cellophane",
    "sweets",
    "foil",
    "wax paper",
    "kitchen plastic wrap",
    "kitchen foil",
    "sweet boxes"
  ],
  "tyn_section":[

  ]
}