{
  "title":"How to Make Permanent Self Adhesive Labels",
  "url":"https://www.wikihow.com/Make-Permanent-Self-Adhesive-Labels",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Plastic and Adhesive Projects"
  ],
  "steps":[
    {
      "headline":"Lay out your labels in a word processor, using whatever font you find attractive.",
      "description":"A simple, \"Sans-Serif\" font in  size 32 or 48 point type makes for easy legibility, but you can use fancy fonts or even Clip-Art if you desire something more fun and comical."
    },
    {
      "headline":"Print the labels on your chosen paper stock using the laser printer.",
      "description":""
    },
    {
      "headline":"In a well-ventilated area, such as the garage or outdoors, spray one or two fairly heavy coats of the polyurethane varnish to the printed side of the paper, making sure to cover the entire text area, including margins on all sides.",
      "description":""
    },
    {
      "headline":"After the spray has dried (which should only take 20 or 30 minutes), carefully apply the sticky side of the double-sided tape to the area behind each block of text.",
      "description":"Leave the protective waxed-paper backing on the tape for now. Again, be sure to cover the entire area behind the text as well as ample margins."
    },
    {
      "headline":"Using a paper cutter (you can use scissors, but the cutter makes it easier to get everything square and straight), carefully cut apart the individual labels, leaving a visually pleasing amount of white space around the text.",
      "description":"You'll be cutting through the polyurethane, the paper, and the carpet tape, so it may take a little work."
    },
    {
      "headline":"Carefully peel the backing off the carpet tape and apply the labels to your chosen surfaces.",
      "description":"They should resist moisture, fingerprints, and dirt almost as well as labels printed on a laminating label printer."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Lay out your labels in a word processor, using whatever font you find attractive. A simple, \"Sans-Serif\" font in  size 32 or 48 point type makes for easy legibility, but you can use fancy fonts or even Clip-Art if you desire something more fun and comical. Print the labels on your chosen paper stock using the laser printer.  In a well-ventilated area, such as the garage or outdoors, spray one or two fairly heavy coats of the polyurethane varnish to the printed side of the paper, making sure to cover the entire text area, including margins on all sides.  After the spray has dried (which should only take 20 or 30 minutes), carefully apply the sticky side of the double-sided tape to the area behind each block of text. Leave the protective waxed-paper backing on the tape for now. Again, be sure to cover the entire area behind the text as well as ample margins. Using a paper cutter (you can use scissors, but the cutter makes it easier to get everything square and straight), carefully cut apart the individual labels, leaving a visually pleasing amount of white space around the text. You'll be cutting through the polyurethane, the paper, and the carpet tape, so it may take a little work. Carefully peel the backing off the carpet tape and apply the labels to your chosen surfaces. They should resist moisture, fingerprints, and dirt almost as well as labels printed on a laminating label printer. Finished. ",
  "tyn_model":[
    "carpet tape",
    "word processor",
    "clip-art",
    "laser printer",
    "polyurethane varnish",
    "tape",
    "waxed-paper",
    "paper cutter",
    "scissors",
    "polyurethane",
    "paper",
    "laminating label printer"
  ],
  "tyn_section":[

  ]
}