{
  "title":"How to Design Your Own Game Character",
  "url":"https://www.wikihow.com/Design-Your-Own-Game-Character",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Creating Games"
  ],
  "steps":[
    {
      "headline":"Have an idea of what role the character has.",
      "description":"This is the basis of all character building and I will explain why later. For now, think whether the character is the main character and what significance it will have in the game."
    },
    {
      "headline":"Now you know whether this character is a main character or not, you can decide the gender.",
      "description":"The gender is crucial to the character as it will unlock a whole half side to the personalities that are considered normal and personalities that are not for that gender E.G Fighting is considered a men's sport, Fingernail painting is considered a female activity. Because this is a game you will want to see what significance gender has on the game world, for example, in a medieval setting females are not as highly respected as men. So this character will have difficulties in that setting."
    },
    {
      "headline":"Once you know what gender your character is and what role he/she plays, piece together a personality type (this does not include intellect).",
      "description":"Ask yourself the following questions: As a main character/Sidekick/Friend does he/she personality help fulfill their role? Is he/she aggressive or kind or both? Is he/she hardworking? Is he/she very social or not social? Is he/she very perceiving in personality? Choose whether each trait is environmental or not"
    },
    {
      "headline":"Now you have a personality to work on, you should now see what strengths and weaknesses the character has.",
      "description":"Is he/she strong? Is he/she intelligent? Is he/she social? The more weaknesses the more interesting it will be too, because it will add more suspense as the character will be in more trouble more often due to clumsiness or low intelligence. What is the characters background? How involved is the character to the game world? Decide whether the background suits the personality or is a result of the personality. This may not want to be revealed all at once to the player to create more dynamic suspense. Give each character something unique. Something that people know them for. Whether the character is a boy or a girl, they should have their own unique thing. Could it be the clothes they wear? The condition they have? Something in their appearance? It could be anything really..."
    },
    {
      "headline":"Find relationships for the character; What relationships does the character have to other characters in the game?",
      "description":"What don't the others like about him/her? What do they like?"
    },
    {
      "headline":"If the character is a main character or someone who will help you, what style does the character play like?",
      "description":"E.G If its in a shooting game, does he run in and shoot everyone like a madman? or keep calm."
    },
    {
      "headline":"Once you know all of these, create more characters.",
      "description":"Keep in mind your other characters may be a result of this characters traits."
    }
  ],
  "text":" Have an idea of what role the character has. This is the basis of all character building and I will explain why later. For now, think whether the character is the main character and what significance it will have in the game. Now you know whether this character is a main character or not, you can decide the gender. The gender is crucial to the character as it will unlock a whole half side to the personalities that are considered normal and personalities that are not for that gender E.G Fighting is considered a men's sport, Fingernail painting is considered a female activity. Because this is a game you will want to see what significance gender has on the game world, for example, in a medieval setting females are not as highly respected as men. So this character will have difficulties in that setting. Once you know what gender your character is and what role he/she plays, piece together a personality type (this does not include intellect). Ask yourself the following questions: As a main character/Sidekick/Friend does he/she personality help fulfill their role? Is he/she aggressive or kind or both? Is he/she hardworking? Is he/she very social or not social? Is he/she very perceiving in personality? Choose whether each trait is environmental or not Now you have a personality to work on, you should now see what strengths and weaknesses the character has. Is he/she strong? Is he/she intelligent? Is he/she social? The more weaknesses the more interesting it will be too, because it will add more suspense as the character will be in more trouble more often due to clumsiness or low intelligence. What is the characters background? How involved is the character to the game world? Decide whether the background suits the personality or is a result of the personality. This may not want to be revealed all at once to the player to create more dynamic suspense. Give each character something unique. Something that people know them for. Whether the character is a boy or a girl, they should have their own unique thing. Could it be the clothes they wear? The condition they have? Something in their appearance? It could be anything really... Find relationships for the character; What relationships does the character have to other characters in the game? What don't the others like about him/her? What do they like? If the character is a main character or someone who will help you, what style does the character play like? E.G If its in a shooting game, does he run in and shoot everyone like a madman? or keep calm. Once you know all of these, create more characters. Keep in mind your other characters may be a result of this characters traits.",
  "tyn_model":[

  ],
  "tyn_section":[

  ]
}