{
  "title":"How to Decorate a Funky Female Teen's Room",
  "url":"https://www.wikihow.com/Decorate-a-Funky-Female-Teen%27s-Room",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "steps":[
    {
      "headline":"Paint it!",
      "description":"Choose what color you want your room to be. It's best to match the colors of the walls to the colors on your bedspread/comforter, as you can't match the comforter to the walls. This is important, because the stuff in your room with have to more or less coordinate with your walls. You can either paint your whole room one color, or paint different walls different colors. Bold colors like fuchsia, lime green, orange, and bright blue are funky and will spice up your room."
    },
    {
      "headline":"Get some funky furniture!",
      "description":"You don't have to get brand-new furniture for your room. You can refurnish the furniture that you already have by painting them! Use cool techniques like using a sponge to dab neon colors on your boring bed. This not only makes your bed look unique and awesome, but it will give it a cool texture, too! If you can find them, there are chairs shaped as shoes and other cool things that will definitely make your room remembered."
    },
    {
      "headline":"Get some good blinds or curtains.",
      "description":"You can cover up boring blinds with cool curtains that match your room. If you have a plain white pull-down shade, try to paint the whole thing with different colors or paint a collage of things you like. Try putting some beaded curtains in front of your window, or even your door! If you can remove the doors on your closet, you can hang string curtains on a rod in the doorway."
    },
    {
      "headline":"Lighting is key.",
      "description":"You definitely don't need to stick to the boring floor lamps and desk lamps that your parents have in their rooms. There are some really awesome lamps out there! Go to stores like IKEA and check out their lighting section. They have lights in neon colors, as well as lights in cool shapes and designs. These will definitely make a statement in your bedroom. You can also use lanterns for a funky touch."
    },
    {
      "headline":"Add a bunch of cool toss pillows on your bed.",
      "description":"These will make your bed look cozy and inviting, and will help match up different aspects of your room. Try to get as many different colors, shapes, and sizes as possible. Ones with sequins will really add flair to your room. If you are low on money you could try to make some yourself; it's really simple."
    },
    {
      "headline":"Chairs!",
      "description":"When your friends come over, you don't want them to have to sit on the floor! Add beanbag chairs, moon chairs, or other chairs for you and your friends to crash in. Add a toss pillow or two on them to make them look more comfy and inviting."
    },
    {
      "headline":"Don't forget a mirror!",
      "description":"You'll need a spot in your room to examine your outfits, hair, and makeup. You could buy a plain mirror and spice it up with a feather boa, or buy a mirror with a funky frame such as a mosaic mirror."
    },
    {
      "headline":"Rugs!",
      "description":"Add some cool rugs to your room, especially if you have a really lame carpet. Put some near your bed, near the entrance of your room, or in the middle of your room. There are many different rugs in different textures, shapes, sizes, and colors out there, so look around to find some that you like."
    },
    {
      "headline":"Add a garbage can under your desk.",
      "description":"You don't want junk sitting around your room! Buy a little garbage can from a furniture store, or even save a few bucks by getting it from the dollar store."
    },
    {
      "headline":"Personalize your room!",
      "description":"All the tips above are great, but the best way to express your personality is to personalize your room. Add posters of hot celebrities and bands on your walls. Put framed pictures of you, your friends, and/or your partner on your desk, walls, and bedside table. Display your jewelry or sports trophies. Show off your makeup. Decorate your room with stuff that makes your room look like it belongs to you!"
    },
    {
      "headline":"Another really funky idea is to put your old too small jeans and use them as a wallpaper!",
      "description":""
    }
  ],
  "text":" Paint it! Choose what color you want your room to be. It's best to match the colors of the walls to the colors on your bedspread/comforter, as you can't match the comforter to the walls. This is important, because the stuff in your room with have to more or less coordinate with your walls. You can either paint your whole room one color, or paint different walls different colors. Bold colors like fuchsia, lime green, orange, and bright blue are funky and will spice up your room. Get some funky furniture! You don't have to get brand-new furniture for your room. You can refurnish the furniture that you already have by painting them! Use cool techniques like using a sponge to dab neon colors on your boring bed. This not only makes your bed look unique and awesome, but it will give it a cool texture, too! If you can find them, there are chairs shaped as shoes and other cool things that will definitely make your room remembered. Get some good blinds or curtains. You can cover up boring blinds with cool curtains that match your room. If you have a plain white pull-down shade, try to paint the whole thing with different colors or paint a collage of things you like. Try putting some beaded curtains in front of your window, or even your door! If you can remove the doors on your closet, you can hang string curtains on a rod in the doorway. Lighting is key. You definitely don't need to stick to the boring floor lamps and desk lamps that your parents have in their rooms. There are some really awesome lamps out there! Go to stores like IKEA and check out their lighting section. They have lights in neon colors, as well as lights in cool shapes and designs. These will definitely make a statement in your bedroom. You can also use lanterns for a funky touch. Add a bunch of cool toss pillows on your bed. These will make your bed look cozy and inviting, and will help match up different aspects of your room. Try to get as many different colors, shapes, and sizes as possible. Ones with sequins will really add flair to your room. If you are low on money you could try to make some yourself; it's really simple. Chairs! When your friends come over, you don't want them to have to sit on the floor! Add beanbag chairs, moon chairs, or other chairs for you and your friends to crash in. Add a toss pillow or two on them to make them look more comfy and inviting. Don't forget a mirror! You'll need a spot in your room to examine your outfits, hair, and makeup. You could buy a plain mirror and spice it up with a feather boa, or buy a mirror with a funky frame such as a mosaic mirror. Rugs! Add some cool rugs to your room, especially if you have a really lame carpet. Put some near your bed, near the entrance of your room, or in the middle of your room. There are many different rugs in different textures, shapes, sizes, and colors out there, so look around to find some that you like. Add a garbage can under your desk. You don't want junk sitting around your room! Buy a little garbage can from a furniture store, or even save a few bucks by getting it from the dollar store. Personalize your room! All the tips above are great, but the best way to express your personality is to personalize your room. Add posters of hot celebrities and bands on your walls. Put framed pictures of you, your friends, and/or your partner on your desk, walls, and bedside table. Display your jewelry or sports trophies. Show off your makeup. Decorate your room with stuff that makes your room look like it belongs to you! Another really funky idea is to put your old too small jeans and use them as a wallpaper! ",
  "tyn_model":[
    "mirror",
    "chairs",
    "curtains",
    "rugs",
    "garbage can",
    "sponge",
    "beaded curtains",
    "lamps",
    "lanterns",
    "pillows"
  ],
  "tyn_section":[

  ]
}