{
  "title":"How to Make a Blueberry Muffin ''Jiffy'' Pie",
  "url":"https://www.wikihow.com/Make-a-Blueberry-Muffin-%27%27Jiffy%27%27-Pie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies"
  ],
  "steps":[
    {
      "headline":"Pour the jiffy mix in a bowl make sure to stir your blueberry’s all around so its distributed evenly.",
      "description":"If not you will have an uneven blueberry muffin pie/muffins."
    },
    {
      "headline":"Pour the milk into your pan or muffin tray make sure that if your pouring the mix into a muffin pan be sure to make them all even.",
      "description":"If you want to have less calories in your mix be sure to use water instead of milk."
    },
    {
      "headline":"Crack the egg and stir it up prior to mixing it (this will make it easier to stir).",
      "description":""
    },
    {
      "headline":"Add the two teaspoons of melted shortening.",
      "description":"It's best to set it out prior to baking (this will make it softer to blend). You can even use a 1-½ tsp of vegetable oil instead of shortening."
    },
    {
      "headline":"Pour two teaspoons of sugar into the mixture for extra sweetness.",
      "description":"It is not needed its already sweet from blue berries. If you're watching out for those calories, there is no need for it besides it’s already tasty."
    },
    {
      "headline":"Mix all the ingredients be sure once again to mix all the berries.",
      "description":""
    },
    {
      "headline":"Be sure to pour the mixture into a lightly oiled pan for baking.",
      "description":""
    },
    {
      "headline":"Place the pan into preheated oven of 400 degrees.",
      "description":"Now cook for 15 to 20 minutes depending on if you want it dark or lightly golden brown."
    },
    {
      "headline":"Be sure to check on them halfway to see if the top is turning golden brown.",
      "description":"Then take out the pan or muffin tray."
    },
    {
      "headline":"Let it sit for at least 5 minutes and serve golden blueberry muffin pie or muffins warm.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Pour the jiffy mix in a bowl make sure to stir your blueberry’s all around so its distributed evenly. If not you will have an uneven blueberry muffin pie/muffins. Pour the milk into your pan or muffin tray make sure that if your pouring the mix into a muffin pan be sure to make them all even. If you want to have less calories in your mix be sure to use water instead of milk. Crack the egg and stir it up prior to mixing it (this will make it easier to stir).  Add the two teaspoons of melted shortening. It's best to set it out prior to baking (this will make it softer to blend). You can even use a 1-½ tsp of vegetable oil instead of shortening. Pour two teaspoons of sugar into the mixture for extra sweetness. It is not needed its already sweet from blue berries. If you're watching out for those calories, there is no need for it besides it’s already tasty. Mix all the ingredients be sure once again to mix all the berries.  Be sure to pour the mixture into a lightly oiled pan for baking.  Place the pan into preheated oven of 400 degrees. Now cook for 15 to 20 minutes depending on if you want it dark or lightly golden brown. Be sure to check on them halfway to see if the top is turning golden brown. Then take out the pan or muffin tray. Let it sit for at least 5 minutes and serve golden blueberry muffin pie or muffins warm.  Finished. ",
  "tyn_model":[
    "blueberry muffin pie",
    "milk",
    "muffin tray",
    "shortening",
    "bowl",
    "muffin pan",
    "water",
    "egg",
    "vegetable oil",
    "sugar",
    "berries",
    "preheated oven",
    "pan"
  ],
  "tyn_section":[

  ]
}