{
  "title":"How to Eat Authentic Japanese Cuisine",
  "url":"https://www.wikihow.com/Eat-Authentic-Japanese-Cuisine",
  "category_hierarchy":[
    "Food and Entertaining",
    "Dining Out"
  ],
  "methods":[
    {
      "name":"Japanese Table Manners",
      "steps":[
        {
          "headline":"Transfer food from shared dishes to your own individual dish.",
          "description":"In addition to following Japanese tradition, this table manner will reduce bacteria that can spread when multiple people eat from the same bowl or plate. Use serving spoons, serving chopsticks, or the opposite end of your own chopsticks to move food from shared dishes onto your own plate."
        },
        {
          "headline":"Eat all food with chopsticks.",
          "description":"Sometimes you may allowed to use a spoon when eating specific types of soups or meals. If this is the case, the spoon will be served with your meal. Place your chopsticks on the table in front of you with their tips pointing to the left if you need to set them down during or after your meal."
        },
        {
          "headline":"Hold rice or soup bowls in one hand as you eat.",
          "description":"Use chopsticks with your free hand to eat rice from the rice bowl, or use your free hand to hold a soup bowl as you drink directly from the bowl."
        },
        {
          "headline":"Separate large pieces of food with chopsticks.",
          "description":"This can be done by exerting pressure on the chopsticks to tear the food apart. Take small bites from large pieces of food that you are unable to separate."
        },
        {
          "headline":"Eat all sushi with one bite.",
          "description":"Sushi is often specifically prepared and decorated in a manner that is intended to be eaten in one bite."
        },
        {
          "headline":"Finish all food that has been served to your individual plate.",
          "description":"The Japanese culture considers it good table manners to eat every item on your plate, including every grain of rice."
        },
        {
          "headline":"Serve beverages to others at your table, when alcohol is consumed.",
          "description":"When alcohol is served, everyone at the table must serve each other instead of pouring their own drinks. Observe the amount of alcohol in everyone's drinking glasses throughout the meal and refill drinks as needed."
        }
      ]
    },
    {
      "name":"Japanese Flavoring Methods",
      "steps":[
        {
          "headline":"Use a minimal amount of soy sauce on all food.",
          "description":"An excessive amount of soy sauce can overpower the taste of Japanese cuisine. Also, it can be considered bad table manners if you waste soy sauce by using more than you end up eating. Pour soy sauce into a small serving dish provided with your meal. Dip small pieces of food or small amounts of rice into the sauce for flavoring."
        },
        {
          "headline":"Use small amounts of wasabi to flavor your food.",
          "description":"Wasabi can largely overpower the flavor of most dishes if used in excess. It can also offend sushi chefs if wasabi is added liberally to a piece of sushi after it has already been prepared. Request that your sushi be made without wasabi if you do not like its taste. This will prevent the sushi chef from being offended if you do not eat the sushi."
        }
      ]
    }
  ],
  "text":" Japanese Table Manners Transfer food from shared dishes to your own individual dish. In addition to following Japanese tradition, this table manner will reduce bacteria that can spread when multiple people eat from the same bowl or plate. Use serving spoons, serving chopsticks, or the opposite end of your own chopsticks to move food from shared dishes onto your own plate. Eat all food with chopsticks. Sometimes you may allowed to use a spoon when eating specific types of soups or meals. If this is the case, the spoon will be served with your meal. Place your chopsticks on the table in front of you with their tips pointing to the left if you need to set them down during or after your meal. Hold rice or soup bowls in one hand as you eat. Use chopsticks with your free hand to eat rice from the rice bowl, or use your free hand to hold a soup bowl as you drink directly from the bowl. Separate large pieces of food with chopsticks. This can be done by exerting pressure on the chopsticks to tear the food apart. Take small bites from large pieces of food that you are unable to separate. Eat all sushi with one bite. Sushi is often specifically prepared and decorated in a manner that is intended to be eaten in one bite. Finish all food that has been served to your individual plate. The Japanese culture considers it good table manners to eat every item on your plate, including every grain of rice. Serve beverages to others at your table, when alcohol is consumed. When alcohol is served, everyone at the table must serve each other instead of pouring their own drinks. Observe the amount of alcohol in everyone's drinking glasses throughout the meal and refill drinks as needed. Japanese Flavoring Methods Use a minimal amount of soy sauce on all food. An excessive amount of soy sauce can overpower the taste of Japanese cuisine. Also, it can be considered bad table manners if you waste soy sauce by using more than you end up eating. Pour soy sauce into a small serving dish provided with your meal. Dip small pieces of food or small amounts of rice into the sauce for flavoring. Use small amounts of wasabi to flavor your food. Wasabi can largely overpower the flavor of most dishes if used in excess. It can also offend sushi chefs if wasabi is added liberally to a piece of sushi after it has already been prepared. Request that your sushi be made without wasabi if you do not like its taste. This will prevent the sushi chef from being offended if you do not eat the sushi.",
  "tyn_model":[
    "chopsticks",
    "sushi",
    "soy sauce",
    "wasabi",
    "rice",
    "spoon",
    "spoons",
    "rice or",
    "rice bowl",
    "soup bowl",
    "beverages",
    "sushi chef"
  ],
  "tyn_section":[

  ]
}