{
  "title":"How to Cook Spicy Potatoe Sabji",
  "url":"https://www.wikihow.com/Cook-Spicy-Potatoe-Sabji",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Potato Dishes"
  ],
  "steps":[
    {
      "headline":"Take some potatoes, peel them and wash them thoroughly.",
      "description":""
    },
    {
      "headline":"Dice them into large pieces, small or medium according to your requirement.",
      "description":""
    },
    {
      "headline":"Take a frying pan.",
      "description":"Pour some oil onto it and heat it."
    },
    {
      "headline":"Put some mustard seeds and dry chili.",
      "description":"A sound like burning crackers will be heard, fry them in oil until the sound is no longer heard."
    },
    {
      "headline":"Add the diced potatoes into the oil.",
      "description":"Add salt to taste."
    },
    {
      "headline":"Add chili powder, turmeric powder, pepper powder, a little garam masala and chicken masala.",
      "description":"Mix it well together."
    },
    {
      "headline":"Close the pan with a lid.",
      "description":"After a few minutes check if the potatoes are soft enough (they must be easy to eat)."
    },
    {
      "headline":"Then mix it again.",
      "description":"Your potato curry is now ready to eat!"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Take some potatoes, peel them and wash them thoroughly.  Dice them into large pieces, small or medium according to your requirement.  Take a frying pan. Pour some oil onto it and heat it. Put some mustard seeds and dry chili. A sound like burning crackers will be heard, fry them in oil until the sound is no longer heard. Add the diced potatoes into the oil. Add salt to taste. Add chili powder, turmeric powder, pepper powder, a little garam masala and chicken masala. Mix it well together. Close the pan with a lid. After a few minutes check if the potatoes are soft enough (they must be easy to eat). Then mix it again. Your potato curry is now ready to eat! Finished. ",
  "tyn_model":[
    "potatoes",
    "oil",
    "frying pan",
    "mustard seeds",
    "chili",
    "salt",
    "chili powder",
    "turmeric powder",
    "pepper",
    "garam masala",
    "chicken masala",
    "potato curry"
  ],
  "tyn_section":[

  ]
}