{
  "title":"How to Make Absolute Baby Back Ribs",
  "url":"https://www.wikihow.com/Make-Absolute-Baby-Back-Ribs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Pork"
  ],
  "steps":[
    {
      "headline":"Rinse the meat well with cold water.",
      "description":""
    },
    {
      "headline":"Aerate the ribs.",
      "description":"Take a sturdy knife and make slits about a 1/4 in. deep on both sides of the ribs."
    },
    {
      "headline":"Cut the slab of ribs into four big pieces.",
      "description":"Place in a large zip lock bag."
    },
    {
      "headline":"Slice the oranges in half.",
      "description":"Squeeze the juice of half of the oranges into the bag and seal the bag."
    },
    {
      "headline":"Toss the ribs in the orange juice.",
      "description":"Open the bag and squeeze the other orange halves into the bag. Close it, and toss until evenly coated."
    },
    {
      "headline":"Grab a medium bowl.",
      "description":"Combine 1/2 of the bottle of the Scott's Barbecue Sauce, the oil, and two shots of vodka."
    },
    {
      "headline":"Whisk the liquids together.",
      "description":"While whisking, add all the spices, the minced onion, and the celery seed. Whisk thoroughly to combine all the ingredients."
    },
    {
      "headline":"Pour the marinade into the bag with the meat.",
      "description":"Get as much of the air out of the bag as you can and seal it."
    },
    {
      "headline":"Toss the meat until it is evenly coated.",
      "description":"Preferably, the ribs should marinate for at least 20 hours, but two to four hours will suffice."
    },
    {
      "headline":"Grab another medium bowl with a lid.",
      "description":"Combine the regular Barbecue sauce, the vinegar, the sugar, the mustard, the remaining Scott's sauce, and two shots of vodka."
    },
    {
      "headline":"Whisk well.",
      "description":"Place the bowl in a microwave, and heat for about thirty seconds. Take it out, mix it once more, and put the lid on the bowl."
    },
    {
      "headline":"Take the last shot of vodka and pour it down your throat!",
      "description":""
    },
    {
      "headline":"Check that your grill is hot.",
      "description":"Once you are ready to cook, place the ribs meat side up on the hot grill, leaving space in the middle of the grill so the heat can cook the meat evenly."
    },
    {
      "headline":"Cook the ribs for about 40 minutes, turning every ten minutes.",
      "description":"After the meat is done, start brushing the sauce onto the ribs and keep turning them."
    },
    {
      "headline":"Remove the ribs from the grill.",
      "description":"Once you have sauced the meat to your liking, bring the ribs into the house. Cut them into individual pieces."
    },
    {
      "headline":"Drizzle the remaining sauce on the ribs.",
      "description":"Toss lightly. Paired with homemade potato chips and a nice dinner wine or Heineken, you have a sexy meal that is easy to prepare!"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Rinse the meat well with cold water.  Aerate the ribs. Take a sturdy knife and make slits about a 1/4 in. deep on both sides of the ribs. Cut the slab of ribs into four big pieces. Place in a large zip lock bag. Slice the oranges in half. Squeeze the juice of half of the oranges into the bag and seal the bag. Toss the ribs in the orange juice. Open the bag and squeeze the other orange halves into the bag. Close it, and toss until evenly coated. Grab a medium bowl. Combine 1/2 of the bottle of the Scott's Barbecue Sauce, the oil, and two shots of vodka. Whisk the liquids together. While whisking, add all the spices, the minced onion, and the celery seed. Whisk thoroughly to combine all the ingredients. Pour the marinade into the bag with the meat. Get as much of the air out of the bag as you can and seal it. Toss the meat until it is evenly coated. Preferably, the ribs should marinate for at least 20 hours, but two to four hours will suffice. Grab another medium bowl with a lid. Combine the regular Barbecue sauce, the vinegar, the sugar, the mustard, the remaining Scott's sauce, and two shots of vodka. Whisk well. Place the bowl in a microwave, and heat for about thirty seconds. Take it out, mix it once more, and put the lid on the bowl. Take the last shot of vodka and pour it down your throat!  Check that your grill is hot. Once you are ready to cook, place the ribs meat side up on the hot grill, leaving space in the middle of the grill so the heat can cook the meat evenly. Cook the ribs for about 40 minutes, turning every ten minutes. After the meat is done, start brushing the sauce onto the ribs and keep turning them. Remove the ribs from the grill. Once you have sauced the meat to your liking, bring the ribs into the house. Cut them into individual pieces. Drizzle the remaining sauce on the ribs. Toss lightly. Paired with homemade potato chips and a nice dinner wine or Heineken, you have a sexy meal that is easy to prepare! Finished. ",
  "tyn_model":[
    "ribs",
    "grill",
    "vodka",
    "oranges",
    "medium bowl",
    "bowl",
    "cold water",
    "knife",
    "zip lock bag",
    "orange juice",
    "orange",
    "scott's barbecue sauce",
    "oil",
    "spices",
    "celery seed",
    "barbecue sauce",
    "vinegar",
    "sugar",
    "mustard",
    "scott's sauce",
    "whisk",
    "microwave",
    "potato chips",
    "heineken"
  ],
  "tyn_section":[

  ]
}