{
  "title":"How to Make Clay Mushrooms",
  "url":"https://www.wikihow.com/Make-Clay-Mushrooms",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts",
    "Mushroom Crafts"
  ],
  "parts":[
    {
      "name":"Shaping the Clay",
      "steps":[
        {
          "headline":"Choose suitable clay.",
          "description":"You can use any kind, from the type that needs glazing to Fimo, just so long as it will be durable enough for your end purposes."
        },
        {
          "headline":"Choose a color for the cap of the mushroom.",
          "description":"Mold it into a shape that resembles a shallow cup."
        },
        {
          "headline":"Choose a color for the stem of the mushroom.",
          "description":"Roll the stem of the mushroom into a medium-sized cylindrical shape with rounded edges. Braid the stem, as it allows you to use two color choices, which can add to the interest. Note that tan is a good color choice for a stem, as it matches easily with almost any other color."
        },
        {
          "headline":"Decorate the mushroom.",
          "description":"It can be as simple as adding spots to the mushroom cap or more detailed. Cut little windows for the stem or have little people sit on top of the mushroom."
        }
      ]
    },
    {
      "name":"Baking the Mushroom Figure",
      "steps":[
        {
          "headline":"Check the clay package or wrapping for heating instructions and information.",
          "description":"This is to ensure the clay figure becomes hard. What is required for baking will vary depending on what clay you are using and how large your sculpture piece is. To keep the mushroom from getting squished in the baking process, bake the cap and the stem separately, side by side with some space between. Then attach them with strong glue––super glue works well."
        },
        {
          "headline":"After putting the clay into the oven, keep an eye on it.",
          "description":"Clay can burn if baked for too long."
        },
        {
          "headline":"Take the mushroom out of the oven when baked enough.",
          "description":"Let it cool before you handle it."
        },
        {
          "headline":"Decide what to do with the mushroom(s).",
          "description":"The clay mushroom can be used as a display item, a gift, an item for your garden or anything else you can think of!"
        }
      ]
    }
  ],
  "text":" Shaping the Clay Choose suitable clay. You can use any kind, from the type that needs glazing to Fimo, just so long as it will be durable enough for your end purposes. Choose a color for the cap of the mushroom. Mold it into a shape that resembles a shallow cup. Choose a color for the stem of the mushroom. Roll the stem of the mushroom into a medium-sized cylindrical shape with rounded edges. Braid the stem, as it allows you to use two color choices, which can add to the interest. Note that tan is a good color choice for a stem, as it matches easily with almost any other color. Decorate the mushroom. It can be as simple as adding spots to the mushroom cap or more detailed. Cut little windows for the stem or have little people sit on top of the mushroom. Baking the Mushroom Figure Check the clay package or wrapping for heating instructions and information. This is to ensure the clay figure becomes hard. What is required for baking will vary depending on what clay you are using and how large your sculpture piece is. To keep the mushroom from getting squished in the baking process, bake the cap and the stem separately, side by side with some space between. Then attach them with strong glue––super glue works well. After putting the clay into the oven, keep an eye on it. Clay can burn if baked for too long. Take the mushroom out of the oven when baked enough. Let it cool before you handle it. Decide what to do with the mushroom(s). The clay mushroom can be used as a display item, a gift, an item for your garden or anything else you can think of!",
  "tyn_model":[
    "clay",
    "oven",
    "strong glue––super",
    "glue"
  ],
  "tyn_section":[

  ]
}