{
  "title":"How to Get Rid of Roaches with Borax",
  "url":"https://www.wikihow.com/Get-Rid-of-Roaches-with-Borax",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control",
    "Cockroach Control"
  ],
  "parts":[
    {
      "name":"Determining Target Areas",
      "steps":[
        {
          "headline":"Inventory potential roach habitats in your home.",
          "description":"Roaches are omnivorous and seek dark, moist places . Inspect areas around the baseboards of your floor, under or around pipes, anywhere there is food waste, behind electrical outlet covers, and narrow, hard to reach spaces are ripe for potential infestation. Roaches prefer to leave their eggs protected in dark crevices if they are not viviparous or oviparous."
        },
        {
          "headline":"Check these areas for infestation.",
          "description":"You can do this by blowing a portable fan around the area to provoke an escape response, or by using an intense sudden light source to provoke the escape response . Leaving bait out without any pesticide is not recommended, as it will simply encourage infestation."
        },
        {
          "headline":"Note any areas roaches would live, feed, or lay eggs.",
          "description":"These are areas with regular food contact, exposure to water, or that are dark and inaccessible. These areas should be targeted regardless of observed infestation. Boric acid has a strong prophylactic effect that kills generations of insects over time."
        },
        {
          "headline":"Check areas roaches may live for unpleasant smells.",
          "description":"Cockroaches have a number of scent glands used in communication and courtship that produce a distinctive smell, in some cases sweet, in others oily and musky. These are telltale signs of an area that is infested and should be targeted. Some cockroaches are perching insects that can thrive on top of high surfaces like shelves, and these should be inventoried and cleared for application of the insecticide."
        },
        {
          "headline":"Clean areas of any food debris or standing water.",
          "description":"Make sure this is done before preparing or applying the insecticide. Clean surfaces and preventing standing water from building up deprive cockroaches of resources. Bait is unnecessary with this insecticide, and eggs are less likely to be spread where there is no feeding resource for the female insect."
        }
      ]
    },
    {
      "name":"Preparing the Borax",
      "steps":[
        {
          "headline":"Use borax if you are uncomfortable making boric acid.",
          "description":"Boric acid is a more effective insecticide, more soluble in water, and is equally unlikely to produce any lasting harm in humans. Both can be applied as a powder and have identical methods of killing the insect."
        },
        {
          "headline":"React excess hydrochloric acid (muriatic acid) with Borax to produce boric acid and salt water.",
          "description":"Boric acid will appear as large white crystals in suspension. Boric acid can be bought as well, and is less hazardous than hydrochloric acid, which is required to convert borax into the far more effective insecticide, boric acid. Hydrochloric acid is sold commonly as muriatic acid as a solution to acidify swimming pools. Hydrochloric acid should be handled with extreme caution. Use gloves, eye protection, and respiratory protection (in a well-ventilated area) and can cause significant harm. Have baking soda on hand to neutralize any strong-acid reaction that is unintended. Do not use water to treat strong acid burns."
        },
        {
          "headline":"Filter out the boric acid crystals.",
          "description":"Treat any excess solution with baking soda to neutralize the strong acid. Do not pour the solution down the sink until you are sure it is neutralized. Use litmus paper to test the acidity of the excess solution. When the crystals are dry they are ready for storage."
        }
      ]
    },
    {
      "name":"Laying the Insecticide",
      "steps":[
        {
          "headline":"Take the borax or boric acid and place it in a container.",
          "description":"Make sure it is clean, inert, clearly labelled container and free of moisture. Proper storage and labeling is key to maintaining safety and avoiding accidentally ingesting the product, as it is visually quite similar to table salt. Avoiding moisture will prevent unwanted large chunks from forming. A recycled ketchup bottle can be used as a kind of bellows to distribute the insecticide powder in the tight space of an electrical outlet with minimal risk. Squeeze the bottle to test and make sure dust comes out (take care to not get any in your eyes, mouth or nose). Make sure the hole of the bottle you’re using is large enough for the borax crystals to go through freely. Borax is soluble in hot water, as is boric acid and can be dissolved and put in a spray bottle, and the dried residue of aqueous boric acid is essentially undetectable to the insect and low risk to humans. However, if you are applying it near electrical outlets use it as a powder."
        },
        {
          "headline":"Sprinkle or spray the borax or boric acid on target areas.",
          "description":"It is unnecessary to mix it with bait, as it is not repellant to insects normally, and is tracked by the insect and spread as a surface toxin to other insects. Once you have covered the areas take care that no food preparation or dusting occurs to prevent accidental ingestion."
        },
        {
          "headline":"Remove electrical outlet covers, dust inside the walls with borax.",
          "description":"This is an easy access to interior spaces in walls where roaches live and lay eggs. Spray the borax into the space using your bottle like a bellows, squeezing repeatedly. Replace the outlet covers when done. Do not use dissolved borax."
        },
        {
          "headline":"Cover any noted areas with a light dusting of insecticide.",
          "description":"The insecticide will spread among the colony through contact. Complete coverage is desirable, but if any targeted areas have infestations, the insecticide will spread to other insects and kill them, and will not affect the desirability of food to the insects considerably."
        },
        {
          "headline":"Sprinkle the borax or boric acid, dry, on any carpet or rug.",
          "description":"The borax will destroy eggs and larvae in the carpet. Vacuum up the powder some 20 minutes after application. Any eggs or insects killed will go up with them. Follow any rug care instructions. If you targeted carpeted areas, vacuum a short time after application. Any eggs will be killed in short order, but the insecticide dust can cause lung irritation or toxicity in pets and small children. It is not advisable to leave it in an area where it will be kicked up as dust continually."
        },
        {
          "headline":"Wipe down any targeted areas with a damp cloth before using the surface.",
          "description":"Reapply treatment after use, or after several days if roaches are still a problem. This is a relatively slow insecticide, but an extremely effective one. Continue the treatment in this manner until the roaches are gone."
        }
      ]
    }
  ],
  "text":" Determining Target Areas Inventory potential roach habitats in your home. Roaches are omnivorous and seek dark, moist places . Inspect areas around the baseboards of your floor, under or around pipes, anywhere there is food waste, behind electrical outlet covers, and narrow, hard to reach spaces are ripe for potential infestation. Roaches prefer to leave their eggs protected in dark crevices if they are not viviparous or oviparous. Check these areas for infestation. You can do this by blowing a portable fan around the area to provoke an escape response, or by using an intense sudden light source to provoke the escape response . Leaving bait out without any pesticide is not recommended, as it will simply encourage infestation. Note any areas roaches would live, feed, or lay eggs. These are areas with regular food contact, exposure to water, or that are dark and inaccessible. These areas should be targeted regardless of observed infestation. Boric acid has a strong prophylactic effect that kills generations of insects over time. Check areas roaches may live for unpleasant smells. Cockroaches have a number of scent glands used in communication and courtship that produce a distinctive smell, in some cases sweet, in others oily and musky. These are telltale signs of an area that is infested and should be targeted. Some cockroaches are perching insects that can thrive on top of high surfaces like shelves, and these should be inventoried and cleared for application of the insecticide. Clean areas of any food debris or standing water. Make sure this is done before preparing or applying the insecticide. Clean surfaces and preventing standing water from building up deprive cockroaches of resources. Bait is unnecessary with this insecticide, and eggs are less likely to be spread where there is no feeding resource for the female insect. Preparing the Borax Use borax if you are uncomfortable making boric acid. Boric acid is a more effective insecticide, more soluble in water, and is equally unlikely to produce any lasting harm in humans. Both can be applied as a powder and have identical methods of killing the insect. React excess hydrochloric acid (muriatic acid) with Borax to produce boric acid and salt water. Boric acid will appear as large white crystals in suspension. Boric acid can be bought as well, and is less hazardous than hydrochloric acid, which is required to convert borax into the far more effective insecticide, boric acid. Hydrochloric acid is sold commonly as muriatic acid as a solution to acidify swimming pools. Hydrochloric acid should be handled with extreme caution. Use gloves, eye protection, and respiratory protection (in a well-ventilated area) and can cause significant harm. Have baking soda on hand to neutralize any strong-acid reaction that is unintended. Do not use water to treat strong acid burns. Filter out the boric acid crystals. Treat any excess solution with baking soda to neutralize the strong acid. Do not pour the solution down the sink until you are sure it is neutralized. Use litmus paper to test the acidity of the excess solution. When the crystals are dry they are ready for storage. Laying the Insecticide Take the borax or boric acid and place it in a container. Make sure it is clean, inert, clearly labelled container and free of moisture. Proper storage and labeling is key to maintaining safety and avoiding accidentally ingesting the product, as it is visually quite similar to table salt. Avoiding moisture will prevent unwanted large chunks from forming. A recycled ketchup bottle can be used as a kind of bellows to distribute the insecticide powder in the tight space of an electrical outlet with minimal risk. Squeeze the bottle to test and make sure dust comes out (take care to not get any in your eyes, mouth or nose). Make sure the hole of the bottle you’re using is large enough for the borax crystals to go through freely. Borax is soluble in hot water, as is boric acid and can be dissolved and put in a spray bottle, and the dried residue of aqueous boric acid is essentially undetectable to the insect and low risk to humans. However, if you are applying it near electrical outlets use it as a powder. Sprinkle or spray the borax or boric acid on target areas. It is unnecessary to mix it with bait, as it is not repellant to insects normally, and is tracked by the insect and spread as a surface toxin to other insects. Once you have covered the areas take care that no food preparation or dusting occurs to prevent accidental ingestion. Remove electrical outlet covers, dust inside the walls with borax. This is an easy access to interior spaces in walls where roaches live and lay eggs. Spray the borax into the space using your bottle like a bellows, squeezing repeatedly. Replace the outlet covers when done. Do not use dissolved borax. Cover any noted areas with a light dusting of insecticide. The insecticide will spread among the colony through contact. Complete coverage is desirable, but if any targeted areas have infestations, the insecticide will spread to other insects and kill them, and will not affect the desirability of food to the insects considerably. Sprinkle the borax or boric acid, dry, on any carpet or rug. The borax will destroy eggs and larvae in the carpet. Vacuum up the powder some 20 minutes after application. Any eggs or insects killed will go up with them. Follow any rug care instructions. If you targeted carpeted areas, vacuum a short time after application. Any eggs will be killed in short order, but the insecticide dust can cause lung irritation or toxicity in pets and small children. It is not advisable to leave it in an area where it will be kicked up as dust continually. Wipe down any targeted areas with a damp cloth before using the surface. Reapply treatment after use, or after several days if roaches are still a problem. This is a relatively slow insecticide, but an extremely effective one. Continue the treatment in this manner until the roaches are gone.",
  "tyn_model":[
    "borax",
    "boric acid",
    "water",
    "insecticide",
    "hydrochloric acid",
    "roaches",
    "cockroaches",
    "baking soda",
    "roach",
    "fan",
    "pesticide",
    "salt water",
    "muriatic acid",
    "litmus paper",
    "container",
    "table salt",
    "ketchup bottle",
    "bottle",
    "spray bottle",
    "vacuum",
    "insecticide dust"
  ],
  "tyn_section":[

  ]
}