{
  "title":"How to Make Vodka Infused Plums",
  "url":"https://www.wikihow.com/Make-Vodka-Infused-Plums",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Infused Spirits and Liqueurs"
  ],
  "steps":[
    {
      "headline":"Clean and sterilize a quart-sized jar.",
      "description":"Make sure that the jar has an airtight lid."
    },
    {
      "headline":"Wash the plums in a stream of cool water.",
      "description":"Consider using organic plums or plums grown without pesticides since you won’t be peeling the fruit. This will limit your exposure to dangerous chemicals."
    },
    {
      "headline":"Place the plums in the jar and pour the vodka over the plums.",
      "description":""
    },
    {
      "headline":"If you want to create a sweet syrup, add the granulated sugar.",
      "description":"If you prefer your plums without the syrup, then leave the sugar out of the recipe."
    },
    {
      "headline":"Save the vodka bottle and lid; you may want to enjoy the plum-infused vodka that this recipe will create.",
      "description":""
    },
    {
      "headline":"Cover the jar tightly and find a cool, dry place in which to store it.",
      "description":""
    },
    {
      "headline":"If you have used sugar, then check every few days to see whether the sugar has dissolved.",
      "description":"If the sugar has not dissolved, shake the jar gently."
    },
    {
      "headline":"Leave the jar undisturbed for about 3 months and when you are ready to open it, remove the plums with a slotted spoon and place them in a bowl.",
      "description":""
    },
    {
      "headline":"Strain the vodka through a coffee filter and pour it through a funnel into its original container.",
      "description":""
    },
    {
      "headline":"Tighten the cap of your vodka bottle and store it for another use.",
      "description":"The color of your infused vodka may vary depending on the variety of plums that you used."
    },
    {
      "headline":"Use the plums in another recipe or store them in your refrigerator.",
      "description":""
    }
  ],
  "text":" Clean and sterilize a quart-sized jar. Make sure that the jar has an airtight lid. Wash the plums in a stream of cool water. Consider using organic plums or plums grown without pesticides since you won’t be peeling the fruit. This will limit your exposure to dangerous chemicals. Place the plums in the jar and pour the vodka over the plums.  If you want to create a sweet syrup, add the granulated sugar. If you prefer your plums without the syrup, then leave the sugar out of the recipe. Save the vodka bottle and lid; you may want to enjoy the plum-infused vodka that this recipe will create.  Cover the jar tightly and find a cool, dry place in which to store it.  If you have used sugar, then check every few days to see whether the sugar has dissolved. If the sugar has not dissolved, shake the jar gently. Leave the jar undisturbed for about 3 months and when you are ready to open it, remove the plums with a slotted spoon and place them in a bowl.  Strain the vodka through a coffee filter and pour it through a funnel into its original container.  Tighten the cap of your vodka bottle and store it for another use. The color of your infused vodka may vary depending on the variety of plums that you used. Use the plums in another recipe or store them in your refrigerator. ",
  "tyn_model":[
    "sugar",
    "jar",
    "vodka",
    "vodka bottle",
    "water",
    "slotted spoon",
    "bowl",
    "coffee filter",
    "plums",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}