{
  "title":"How to Make a Shiso Mojito",
  "url":"https://www.wikihow.com/Make-a-Shiso-Mojito",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Cocktails",
    "Mojitos"
  ],
  "methods":[
    {
      "name":"Making a Green Tea Shiso Mojito",
      "steps":[
        {
          "headline":"Muddle the lime juice, shiso and sugar together in a Collins glass using a muddler, a pestle or the back of a spoon.",
          "description":"You want the leaves to be slightly bruised, and you want to smell the aroma of the shiso."
        },
        {
          "headline":"Add ice until the glass is 2/3 full.",
          "description":""
        },
        {
          "headline":"Add the green tea and the rum to fill the glass.",
          "description":""
        },
        {
          "headline":"Garnish the drink with a lime wedge or a shiso leaf, or both.",
          "description":""
        }
      ]
    },
    {
      "name":"Making a Shiso Yuzu Mojito",
      "steps":[
        {
          "headline":"Tear 4 of the shiso leaves into large pieces, saving 1 whole leaf for garnish.",
          "description":""
        },
        {
          "headline":"Muddle the brown sugar, shiso leaves and yuzu zest in the bottom of an old-fashioned glass.",
          "description":""
        },
        {
          "headline":"Add the vodka, the lime juice and some ice cubes.",
          "description":"Stir the drink with a spoon."
        },
        {
          "headline":"Top the drink with club soda and with more ice, as needed.",
          "description":""
        },
        {
          "headline":"Garnish with the reserved shiso leaf.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making a Green Tea Shiso Mojito Muddle the lime juice, shiso and sugar together in a Collins glass using a muddler, a pestle or the back of a spoon. You want the leaves to be slightly bruised, and you want to smell the aroma of the shiso. Add ice until the glass is 2/3 full.  Add the green tea and the rum to fill the glass.  Garnish the drink with a lime wedge or a shiso leaf, or both.  Making a Shiso Yuzu Mojito Tear 4 of the shiso leaves into large pieces, saving 1 whole leaf for garnish.  Muddle the brown sugar, shiso leaves and yuzu zest in the bottom of an old-fashioned glass.  Add the vodka, the lime juice and some ice cubes. Stir the drink with a spoon. Top the drink with club soda and with more ice, as needed.  Garnish with the reserved shiso leaf. ",
  "tyn_model":[
    "green tea",
    "lime juice",
    "spoon",
    "ice",
    "sugar",
    "glass",
    "muddler,",
    "pestle",
    "rum",
    "lime wedge",
    "brown sugar",
    "yuzu zest",
    "old-fashioned glass",
    "vodka",
    "ice cubes",
    "club soda"
  ],
  "tyn_section":[

  ]
}