{
  "title":"How to Serve Rum",
  "url":"https://www.wikihow.com/Serve-Rum",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs"
  ],
  "methods":[
    {
      "name":"Making Cocktails with Rum",
      "steps":[
        {
          "headline":"Try a simple mixed drink.",
          "description":"Mix rum with just 1 other beverage, such as a soda. This is an easy way to enjoy any quality of rum. It’s also a drink that can be made at virtually any bar. Go for the classic Rum and Coke by starting with approximately 2  fl oz (59 mL) of light or dark rum and adding a dark cola to taste. Pour over ice, garnish with a lime wedge, and serve. Try a spicier mixed drink, called a Dark 'n’ Stormy, by filling a highball glass with ice, adding 2 shots of Gosling’s Black Seal Rum, and topping it off with ginger beer. Garnish with a lime wedge and serve. (Note that Gosling Brother's Ltd. trademarked the name of this drink, so legally, it must be made with Gosling's rum.)"
        },
        {
          "headline":"Make a mojito.",
          "description":"Try a classic rum cocktail, the mojito. Use light rum, mint leaves, lime, sugar, and club soda for this refreshing drink. Put several wedges of lime and fresh mint leaves into a glass and muddle them to release their flavors if you wish. Add ice and 2  fl oz (59 mL) of light rum. Fill the rest of the glass with club soda, then stir in sugar to taste. Try adding other fruit flavors to a mojito, like strawberry or pineapple, by adding either the fresh fruit or juice."
        },
        {
          "headline":"Get fruity with a daiquiri.",
          "description":"Make a daiquiri by mixing light rum with fresh lime juice and simple syrup (sugar boiled into a syrup consistency). This drink typically uses nearly any combination of fruit juices with the basic ingredients. Build on the basic recipe of 2  fl oz (59 mL) of light rum, ⁄4  fl oz (22 mL) of fresh lime juice, and ⁄4  fl oz (7.4 mL) of simple syrup with fruits like banana, strawberry, pineapple, etc. Line the rim of a glass with brown sugar and a fresh wedge of whatever fruit you use for a common daiquiri presentation. Serve the drink neat in a martini glass."
        },
        {
          "headline":"Try a more complex Mai Tai.",
          "description":"Make a Mai Tai by using a few more specialty ingredients than other rum cocktails. Use orgeat—a high-quality almond sugar syrup—and orange curacao—a liqueur from a dried citrus peel—to make this refreshing drink. Combine 2  fl oz (59 mL) of dark rum with ⁄4  fl oz (22 mL) of lime juice, ⁄4  fl oz (7.4 mL) of simple syrup, ⁄2  fl oz (15 mL) of orange curacao, and ⁄4  fl oz (7.4 mL) of orgeat and pour over ice. Top with a lime wedge and a mint leaf. If you don’t have the specialty ingredients for this cocktail on hand, you can substitute cheaper almond syrup for orgeat and triple sec for orange curacao."
        }
      ]
    },
    {
      "name":"Enjoying Rum on its Own",
      "steps":[
        {
          "headline":"Buy a high-quality rum.",
          "description":"Stick to a quality “sipping rum” to enjoy it neat, meaning at room temperature with no other additions. Look for bottles sourced from the Bahamas and Latin American countries for more traditional varieties. Look for higher quality in light rum by avoiding flavored or “over proofed” varieties, like Bacardi 151. This type of liquor has 75% ABV or higher, rather than the typical 40% ABV. Look for higher quality in gold rum by avoiding brands that color the rum artificially to achieve the traditional amber color. While alcohol companies aren’t required to list ingredients, you can generally count on more expensive brands for rum that isn’t dyed. Look for higher quality in dark rum by buying a more expensive variety. For spiced rum, avoid cheaper brands that simply dye light rum darker. You want gold or even dark rum that is infused with spices like anise, cinnamon, pepper, and rosemary."
        },
        {
          "headline":"Sip rum slowly.",
          "description":"Pour rum for sipping into a small glass. Warm the glass in your hands and sip slowly to enjoy the full flavor. Smell the aromas of the rum from a distance so you don’t hurt your nose, and take small sips to let the flavor access all parts of your tongue. Drink sipping rum at room temperature, or on the rocks if you wish."
        },
        {
          "headline":"Try a unique rum like rhum agricole or cachaça.",
          "description":"Look for specialty alternatives to traditional rum for a new experience. Rhum agricole and cachaça use only fresh-pressed juice from sugar cane, so they have a very different flavor from traditional rim. These specialized, “pure” forms of rum are considered such because they use the fresh sugar cane juice rather than molasses and use little to no other ingredients in processing. Try rhum agricole or cachaça neat to experience the full flavor. Cachaça is also typically used in a Caipirinha, a cocktail popular in Brazil, where cachaça is the national liquor."
        }
      ]
    },
    {
      "name":"Adding Rum to Hot Drinks",
      "steps":[
        {
          "headline":"Try hot buttered rum.",
          "description":"Enjoy the flavors of rum when heated in this simple drink. Use a variety of fresh spices and butter to add a rich flavor to the rum. Combine brown sugar, cinnamon, nutmeg, and cloves with butter. Put in a mug with 3  fl oz (89 mL) of dark rum and fill up with hot water. Try a creamy variation of this drink by adding heated milk to the mixture instead of or in addition to the water."
        },
        {
          "headline":"Add rum to hot chocolate or coffee.",
          "description":"Brew your favorite coffee drink or classic hot cocoa, then add 1–2  fl oz (30–59 mL) of rum for a boozy twist. Use a hot chocolate packet, or make your own by heating whole milk and adding rum and bittersweet chocolate or cocoa powder. Add rum to any freshly brewed strong coffee, including espresso drinks like an Americano or latte. Sweeten to taste with sugar or your sweetener of choice."
        },
        {
          "headline":"Make a rum hot toddy.",
          "description":"Use rum to make a traditional hot toddy. Add honey and spices to this classic warming drink with medicinal origins. Put 1  fl oz (30 mL) of a spiced rum, 1 tablespoon (15 mL) of honey, and a quarter of a lemon in a mug, then fill it with hot water and stir to melt the honey. Add cinnamon sugar to taste. Substitute spiced rum for a gold or dark rum if you wish, and add more of your own fresh spices and garnishes if you wish, like orange peel."
        }
      ]
    }
  ],
  "text":" Making Cocktails with Rum Try a simple mixed drink. Mix rum with just 1 other beverage, such as a soda. This is an easy way to enjoy any quality of rum. It’s also a drink that can be made at virtually any bar. Go for the classic Rum and Coke by starting with approximately 2  fl oz (59 mL) of light or dark rum and adding a dark cola to taste. Pour over ice, garnish with a lime wedge, and serve. Try a spicier mixed drink, called a Dark 'n’ Stormy, by filling a highball glass with ice, adding 2 shots of Gosling’s Black Seal Rum, and topping it off with ginger beer. Garnish with a lime wedge and serve. (Note that Gosling Brother's Ltd. trademarked the name of this drink, so legally, it must be made with Gosling's rum.) Make a mojito. Try a classic rum cocktail, the mojito. Use light rum, mint leaves, lime, sugar, and club soda for this refreshing drink. Put several wedges of lime and fresh mint leaves into a glass and muddle them to release their flavors if you wish. Add ice and 2  fl oz (59 mL) of light rum. Fill the rest of the glass with club soda, then stir in sugar to taste. Try adding other fruit flavors to a mojito, like strawberry or pineapple, by adding either the fresh fruit or juice. Get fruity with a daiquiri. Make a daiquiri by mixing light rum with fresh lime juice and simple syrup (sugar boiled into a syrup consistency). This drink typically uses nearly any combination of fruit juices with the basic ingredients. Build on the basic recipe of 2  fl oz (59 mL) of light rum, ⁄4  fl oz (22 mL) of fresh lime juice, and ⁄4  fl oz (7.4 mL) of simple syrup with fruits like banana, strawberry, pineapple, etc. Line the rim of a glass with brown sugar and a fresh wedge of whatever fruit you use for a common daiquiri presentation. Serve the drink neat in a martini glass. Try a more complex Mai Tai. Make a Mai Tai by using a few more specialty ingredients than other rum cocktails. Use orgeat—a high-quality almond sugar syrup—and orange curacao—a liqueur from a dried citrus peel—to make this refreshing drink. Combine 2  fl oz (59 mL) of dark rum with ⁄4  fl oz (22 mL) of lime juice, ⁄4  fl oz (7.4 mL) of simple syrup, ⁄2  fl oz (15 mL) of orange curacao, and ⁄4  fl oz (7.4 mL) of orgeat and pour over ice. Top with a lime wedge and a mint leaf. If you don’t have the specialty ingredients for this cocktail on hand, you can substitute cheaper almond syrup for orgeat and triple sec for orange curacao. Enjoying Rum on its Own Buy a high-quality rum. Stick to a quality “sipping rum” to enjoy it neat, meaning at room temperature with no other additions. Look for bottles sourced from the Bahamas and Latin American countries for more traditional varieties. Look for higher quality in light rum by avoiding flavored or “over proofed” varieties, like Bacardi 151. This type of liquor has 75% ABV or higher, rather than the typical 40% ABV. Look for higher quality in gold rum by avoiding brands that color the rum artificially to achieve the traditional amber color. While alcohol companies aren’t required to list ingredients, you can generally count on more expensive brands for rum that isn’t dyed. Look for higher quality in dark rum by buying a more expensive variety. For spiced rum, avoid cheaper brands that simply dye light rum darker. You want gold or even dark rum that is infused with spices like anise, cinnamon, pepper, and rosemary. Sip rum slowly. Pour rum for sipping into a small glass. Warm the glass in your hands and sip slowly to enjoy the full flavor. Smell the aromas of the rum from a distance so you don’t hurt your nose, and take small sips to let the flavor access all parts of your tongue. Drink sipping rum at room temperature, or on the rocks if you wish. Try a unique rum like rhum agricole or cachaça. Look for specialty alternatives to traditional rum for a new experience. Rhum agricole and cachaça use only fresh-pressed juice from sugar cane, so they have a very different flavor from traditional rim. These specialized, “pure” forms of rum are considered such because they use the fresh sugar cane juice rather than molasses and use little to no other ingredients in processing. Try rhum agricole or cachaça neat to experience the full flavor. Cachaça is also typically used in a Caipirinha, a cocktail popular in Brazil, where cachaça is the national liquor. Adding Rum to Hot Drinks Try hot buttered rum. Enjoy the flavors of rum when heated in this simple drink. Use a variety of fresh spices and butter to add a rich flavor to the rum. Combine brown sugar, cinnamon, nutmeg, and cloves with butter. Put in a mug with 3  fl oz (89 mL) of dark rum and fill up with hot water. Try a creamy variation of this drink by adding heated milk to the mixture instead of or in addition to the water. Add rum to hot chocolate or coffee. Brew your favorite coffee drink or classic hot cocoa, then add 1–2  fl oz (30–59 mL) of rum for a boozy twist. Use a hot chocolate packet, or make your own by heating whole milk and adding rum and bittersweet chocolate or cocoa powder. Add rum to any freshly brewed strong coffee, including espresso drinks like an Americano or latte. Sweeten to taste with sugar or your sweetener of choice. Make a rum hot toddy. Use rum to make a traditional hot toddy. Add honey and spices to this classic warming drink with medicinal origins. Put 1  fl oz (30 mL) of a spiced rum, 1 tablespoon (15 mL) of honey, and a quarter of a lemon in a mug, then fill it with hot water and stir to melt the honey. Add cinnamon sugar to taste. Substitute spiced rum for a gold or dark rum if you wish, and add more of your own fresh spices and garnishes if you wish, like orange peel.",
  "tyn_model":[
    "rum",
    "ice",
    "lime",
    "sugar",
    "glass",
    "light rum",
    "simple syrup",
    "orgeat",
    "orange curacao",
    "rhum agricole",
    "cachaça",
    "honey",
    "lime wedge",
    "club soda",
    "fresh lime juice",
    "brown sugar",
    "—a",
    "dark rum",
    "cinnamon",
    "butter",
    "mug",
    "hot water",
    "milk",
    "hot chocolate",
    "spiced rum",
    "soda",
    "coke",
    "dark cola",
    "’ stormy",
    "gosling’s black seal rum",
    "ginger beer",
    "gosling's rum",
    "fresh mint",
    "daiquiri",
    "fruit juices",
    "pineapple",
    "martini glass",
    "mai tai",
    "almond sugar syrup",
    "—and",
    "citrus peel",
    "—to",
    "lime juice",
    "mint leaf",
    "almond syrup",
    "triple sec",
    "“sipping",
    "” to",
    "“over",
    "” varieties",
    "bacardi 151",
    "liquor",
    "alcohol",
    "sugar cane",
    "“pure",
    "” forms",
    "sugar cane juice",
    "molasses",
    "nutmeg",
    "cloves",
    "water",
    "coffee",
    "cocoa",
    "bittersweet chocolate",
    "cocoa powder",
    "spices",
    "lemon",
    "cinnamon sugar",
    "orange peel"
  ],
  "tyn_section":[

  ]
}