{
  "title":"How to Make Vegan Black Bean Soup",
  "url":"https://www.wikihow.com/Make-Vegan-Black-Bean-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan"
  ],
  "methods":[
    {
      "name":"Preparing the Dried Beans",
      "steps":[
        {
          "headline":"Place the dried beans in a stockpot or Dutch oven.",
          "description":""
        },
        {
          "headline":"Cover the beans with water and add a generous pinch of salt.",
          "description":""
        },
        {
          "headline":"Bring the water to a boil.",
          "description":""
        },
        {
          "headline":"Turn down the heat so that the water comes to a simmer.",
          "description":""
        },
        {
          "headline":"Cover the pot of beans and allow them to cook for about an hour, checking on them occasionally.",
          "description":""
        }
      ]
    },
    {
      "name":"Preparing the Black Bean Soup",
      "steps":[
        {
          "headline":"Add two bay leaves to the boiling water and continue to simmer the beans.",
          "description":""
        },
        {
          "headline":"Heat the olive oil over medium-high heat in a nonstick skillet.",
          "description":""
        },
        {
          "headline":"Add the onion, bell pepper and garlic, along with a large pinch of salt, and cook the vegetables for 5 minutes or until they begin to brown, stirring them occasionally with a spatula or spoon.",
          "description":"The salt helps the vegetables to release their water."
        },
        {
          "headline":"Add the oregano, cumin and paprika and cook for 1 additional minute.",
          "description":""
        },
        {
          "headline":"Remove the skillet from the heat, take out the bay leaves from the beans and discard them.",
          "description":""
        },
        {
          "headline":"Add the onion mixture to the beans and stir it together with the spatula or spoon until everything is well combined.",
          "description":""
        }
      ]
    },
    {
      "name":"Pureeing the Soup with an Immersion Blender",
      "steps":[
        {
          "headline":"Remove your soup from the heat.",
          "description":""
        },
        {
          "headline":"Assemble your immersion blender and insert it deep into the soup.",
          "description":"Do not turn the blender on until it is completely submerged."
        },
        {
          "headline":"Start the blender on low speed and puree a little bit of soup at a time.",
          "description":"Watch carefully so that you puree your soup to the correct texture."
        },
        {
          "headline":"Turn the blender off before you pull it out of your soup.",
          "description":""
        },
        {
          "headline":"Remove the blender from the soup when it has came to a stop and set it aside for cleaning.",
          "description":""
        }
      ]
    },
    {
      "name":"Pureeing the Soup in a Traditional Blender",
      "steps":[
        {
          "headline":"Ladle some soup into the blender pitcher until the pitcher is half full.",
          "description":""
        },
        {
          "headline":"Replace the lid with the vent removed and cover the lid with a clean dishtowel.",
          "description":""
        },
        {
          "headline":"Puree the mixture to the consistency that you desire.",
          "description":""
        },
        {
          "headline":"Pour the blended portion of the soup into a large bowl or a new clean pot.",
          "description":""
        },
        {
          "headline":"Ladle more soup into the blender pitcher, again filling the pitcher about halfway full.",
          "description":""
        },
        {
          "headline":"Replace the lid and puree the mixture again to the desired consistency.",
          "description":""
        },
        {
          "headline":"Repeat the steps until all of the soup is pureed.",
          "description":""
        }
      ]
    },
    {
      "name":"Making the Salsa",
      "steps":[
        {
          "headline":"Take an orange and remove the peel and the white pith with a chef’s knife.",
          "description":""
        },
        {
          "headline":"Cut a slit into the orange using a chef’s knife.",
          "description":"The slit should go from the exterior of the orange to the center of the orange."
        },
        {
          "headline":"Cut another slit about 1/4” to the right of the first one.",
          "description":"This will create a triangular section of orange."
        },
        {
          "headline":"Remove the section and place it in a medium bowl.",
          "description":""
        },
        {
          "headline":"Continue cutting out triangular orange sections until the entire orange is sectioned.",
          "description":""
        },
        {
          "headline":"Combine the red onion, jalapeno and cilantro with the oranges.",
          "description":""
        },
        {
          "headline":"Taste a spoonful of the mixture and add salt a little bit at a time until the salsa tastes right to you.",
          "description":""
        }
      ]
    },
    {
      "name":"Assembling the Soup",
      "steps":[
        {
          "headline":"Ladle the soup into serving bowls.",
          "description":""
        },
        {
          "headline":"Place one tablespoon of the orange-jalapeno on top of the soup.",
          "description":""
        },
        {
          "headline":"Serve the soup.",
          "description":"You can garnish the bowl with lime wedges, if desired."
        }
      ]
    }
  ],
  "text":" Preparing the Dried Beans Place the dried beans in a stockpot or Dutch oven.  Cover the beans with water and add a generous pinch of salt.  Bring the water to a boil.  Turn down the heat so that the water comes to a simmer.  Cover the pot of beans and allow them to cook for about an hour, checking on them occasionally.  Preparing the Black Bean Soup Add two bay leaves to the boiling water and continue to simmer the beans.  Heat the olive oil over medium-high heat in a nonstick skillet.  Add the onion, bell pepper and garlic, along with a large pinch of salt, and cook the vegetables for 5 minutes or until they begin to brown, stirring them occasionally with a spatula or spoon. The salt helps the vegetables to release their water. Add the oregano, cumin and paprika and cook for 1 additional minute.  Remove the skillet from the heat, take out the bay leaves from the beans and discard them.  Add the onion mixture to the beans and stir it together with the spatula or spoon until everything is well combined.  Pureeing the Soup with an Immersion Blender Remove your soup from the heat.  Assemble your immersion blender and insert it deep into the soup. Do not turn the blender on until it is completely submerged. Start the blender on low speed and puree a little bit of soup at a time. Watch carefully so that you puree your soup to the correct texture. Turn the blender off before you pull it out of your soup.  Remove the blender from the soup when it has came to a stop and set it aside for cleaning.  Pureeing the Soup in a Traditional Blender Ladle some soup into the blender pitcher until the pitcher is half full.  Replace the lid with the vent removed and cover the lid with a clean dishtowel.  Puree the mixture to the consistency that you desire.  Pour the blended portion of the soup into a large bowl or a new clean pot.  Ladle more soup into the blender pitcher, again filling the pitcher about halfway full.  Replace the lid and puree the mixture again to the desired consistency.  Repeat the steps until all of the soup is pureed.  Making the Salsa Take an orange and remove the peel and the white pith with a chef’s knife.  Cut a slit into the orange using a chef’s knife. The slit should go from the exterior of the orange to the center of the orange. Cut another slit about 1/4” to the right of the first one. This will create a triangular section of orange. Remove the section and place it in a medium bowl.  Continue cutting out triangular orange sections until the entire orange is sectioned.  Combine the red onion, jalapeno and cilantro with the oranges.  Taste a spoonful of the mixture and add salt a little bit at a time until the salsa tastes right to you.  Assembling the Soup Ladle the soup into serving bowls.  Place one tablespoon of the orange-jalapeno on top of the soup.  Serve the soup. You can garnish the bowl with lime wedges, if desired.",
  "tyn_model":[
    "blender",
    "water",
    "salt",
    "onion",
    "spatula",
    "beans",
    "soup",
    "blender pitcher",
    "pitcher",
    "chef’s knife",
    "dried beans",
    "stockpot or",
    "dutch oven",
    "pot",
    "black bean soup",
    "olive oil",
    "nonstick skillet",
    "bell pepper",
    "garlic",
    "oregano",
    "cumin",
    "paprika",
    "skillet",
    "bay",
    "spoon",
    "immersion blender",
    "dishtowel",
    "large bowl",
    "orange",
    "” to",
    "medium bowl",
    "red onion",
    "jalapeno",
    "cilantro",
    "oranges",
    "salsa",
    "bowls",
    "orange-jalapeno",
    "lime wedges"
  ],
  "tyn_section":[

  ]
}