{
  "title":"How to Salt‐Speckle Paper",
  "url":"https://www.wikihow.com/Salt%E2%80%90Speckle-Paper",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Papermaking"
  ],
  "methods":[
    {
      "name":"Using Salt on Wet Watercolor Paper",
      "steps":[
        {
          "headline":"Paint a layer of water over the area.",
          "description":"If you want to do the whole page at once, dip your brush in clean water and paint the entire page to get it wet. If you want to keep the effect to a smaller part of the page, just cover that area with water. You don't need to use any special stroke for this. You can go back and forth with your brush or cover the area with small circles. You can use whatever kind of paintbrush you prefer, such as a flat sable brush or a round-tipped brush. Flat brushes are best for doing long blocks of color across the page, while a round-tipped brush may be better if you want curved or circular patterns."
        },
        {
          "headline":"Add watercolors to the wet area.",
          "description":"To be able to see the speckled effect, you need color behind the salt. Dip your paintbrush in a color of your choosing, and then paint it across the wet area. You can add more than one color if you want colors to fade into one another. If you're using more than one color, try adding the first color in long lines across the page. When you add the next color, blend it into the previous color by lightly going over part of the same area. You can create a similar blending effect by working in circular motions. After adding the first color in circular motions, work around the edges with a second color so it fades into the first one. To be able to see the effect better, use darker colors."
        },
        {
          "headline":"Sprinkle the salt on the page while the paint is still wet.",
          "description":"Plain table salt is fine for this project. Sprinkle it on in a light layer everywhere you want the speckled effect. You don't need to cover the page with a thick layer of salt; just add a light sprinkling across the area, like stars."
        },
        {
          "headline":"Let the paint dry completely for as long as 30 minutes.",
          "description":"As the paint dries, the salt lifts the pigment from the paint, leaving white or light-colored spots across the paper. However, if you try to remove it too early, you may end up with a muddled effect instead. Watercolors dry quickly, so check back on it in 10-15 minutes."
        },
        {
          "headline":"Brush the salt off the paper with your hand or a paintbrush.",
          "description":"Once the paint and salt are completely dry, the salt should come off easily. You can brush it off gently with your hand to remove it. Alternatively, use a paintbrush to get it off the paper so you don't get salt all over your hand. Try to be gentle, as you could scratch your painting with the salt if you're not. You may need to rub at some of the salt with your fingers to get it off."
        }
      ]
    },
    {
      "name":"Creating Different Effects with Salt",
      "steps":[
        {
          "headline":"Vary the grain size to get different effects.",
          "description":"Add larger crystals, such as rock salt, kosher salt, or ice cream salt, to create larger speckles across the paper. For smaller speckles, use table salt or another fine grain salt. Try using both to add dimension. For instance, if you're trying to make stars, using various sizes can help create the illusion that some stars are closer and some are farther away."
        },
        {
          "headline":"Add the salt immediately to the wet paint for a more wide-spread effect.",
          "description":"If you sprinkle the salt on right after you add the paint, you'll get softer speckles. Each individual salted area will be larger and tend to blur into the next salted area. You could use this technique to create clouds, for instance."
        },
        {
          "headline":"Wait 1-2 minutes for the paint to dry for more concentrated speckles.",
          "description":"If the paint is slightly drier, the salt areas won't spread out as much. Your salt speckles will also have a more defined, crystal-like shape than if you sprinkle the salt on immediately. This effect works best for things like snow or stars."
        },
        {
          "headline":"Try adding salt to water to get bursts of color.",
          "description":"Instead of sprinkling the salt onto the paint, pour about 1/2 tablespoon (8.5 grams) into 8 fluid ounces (240 mL) of water. Stir it together to dissolve it completely, then paint your page with the salted water. Add drops of watercolor paint in different areas. Instead of spreading like it would with just water, you'll get sunbursts or spikes of color going out from each dot. You could also try combining this technique with speckling to see what happens!"
        }
      ]
    }
  ],
  "text":" Using Salt on Wet Watercolor Paper Paint a layer of water over the area. If you want to do the whole page at once, dip your brush in clean water and paint the entire page to get it wet. If you want to keep the effect to a smaller part of the page, just cover that area with water. You don't need to use any special stroke for this. You can go back and forth with your brush or cover the area with small circles. You can use whatever kind of paintbrush you prefer, such as a flat sable brush or a round-tipped brush. Flat brushes are best for doing long blocks of color across the page, while a round-tipped brush may be better if you want curved or circular patterns. Add watercolors to the wet area. To be able to see the speckled effect, you need color behind the salt. Dip your paintbrush in a color of your choosing, and then paint it across the wet area. You can add more than one color if you want colors to fade into one another. If you're using more than one color, try adding the first color in long lines across the page. When you add the next color, blend it into the previous color by lightly going over part of the same area. You can create a similar blending effect by working in circular motions. After adding the first color in circular motions, work around the edges with a second color so it fades into the first one. To be able to see the effect better, use darker colors. Sprinkle the salt on the page while the paint is still wet. Plain table salt is fine for this project. Sprinkle it on in a light layer everywhere you want the speckled effect. You don't need to cover the page with a thick layer of salt; just add a light sprinkling across the area, like stars. Let the paint dry completely for as long as 30 minutes. As the paint dries, the salt lifts the pigment from the paint, leaving white or light-colored spots across the paper. However, if you try to remove it too early, you may end up with a muddled effect instead. Watercolors dry quickly, so check back on it in 10-15 minutes. Brush the salt off the paper with your hand or a paintbrush. Once the paint and salt are completely dry, the salt should come off easily. You can brush it off gently with your hand to remove it. Alternatively, use a paintbrush to get it off the paper so you don't get salt all over your hand. Try to be gentle, as you could scratch your painting with the salt if you're not. You may need to rub at some of the salt with your fingers to get it off. Creating Different Effects with Salt Vary the grain size to get different effects. Add larger crystals, such as rock salt, kosher salt, or ice cream salt, to create larger speckles across the paper. For smaller speckles, use table salt or another fine grain salt. Try using both to add dimension. For instance, if you're trying to make stars, using various sizes can help create the illusion that some stars are closer and some are farther away. Add the salt immediately to the wet paint for a more wide-spread effect. If you sprinkle the salt on right after you add the paint, you'll get softer speckles. Each individual salted area will be larger and tend to blur into the next salted area. You could use this technique to create clouds, for instance. Wait 1-2 minutes for the paint to dry for more concentrated speckles. If the paint is slightly drier, the salt areas won't spread out as much. Your salt speckles will also have a more defined, crystal-like shape than if you sprinkle the salt on immediately. This effect works best for things like snow or stars. Try adding salt to water to get bursts of color. Instead of sprinkling the salt onto the paint, pour about 1/2 tablespoon (8.5 grams) into 8 fluid ounces (240 mL) of water. Stir it together to dissolve it completely, then paint your page with the salted water. Add drops of watercolor paint in different areas. Instead of spreading like it would with just water, you'll get sunbursts or spikes of color going out from each dot. You could also try combining this technique with speckling to see what happens!",
  "tyn_model":[
    "salt",
    "paint",
    "water",
    "watercolors",
    "table salt",
    "paintbrush",
    "rock salt",
    "kosher salt",
    "ice cream salt",
    "fine grain salt",
    "salted water",
    "watercolor paint"
  ],
  "tyn_section":[

  ]
}