{
  "title":"How to EV Train Your Pokémon",
  "url":"https://www.wikihow.com/EV-Train-Your-Pok%C3%A9mon",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Pokemon Video Games"
  ],
  "methods":[
    {
      "name":"Breeding Your Pokémon",
      "steps":[
        {
          "headline":"Start EV training from birth.",
          "description":"EV training begins at birth. If you want perfect control over your Pokémon’s EVs, you’ll want to start from the minute they’re born, when their EVs are still a blank slate. Breed Pokémon in order to get eggs in your desired species that you can raise and train to be the best!"
        },
        {
          "headline":"Use Pokémon with good stats to get Pokémon with good stats.",
          "description":"Since many of a Pokémon’s initial states (or IVs) are determined by their parents stats, you will want to use Pokémon with good stats in order to breed Pokémon with good stats. Just make sure that you understand how to breed Pokémon."
        },
        {
          "headline":"Check your Pokémon’s IVs.",
          "description":"Once you have a couple of newborn Pokémon, check their IVs using online tools. Google \"IV Calculator\" and input your Pokémon stats. The best IV for any one stat is 31, but IVs of 29 or 30 are also usable. Take the best out of several Pokémon or stop when you have one with really good stats."
        }
      ]
    },
    {
      "name":"Battle-Training EV",
      "steps":[
        {
          "headline":"Pick your battles carefully.",
          "description":"Every time your Pokémon fights in a battle, even if it’s only for a single turn, it will gain EV points from that battle. Because of this, you will want to be very careful about using your Pokémon in battles until they have maxed out their EVs. Only bring out your EV training Pokémon when you encounter a beneficial battle. Each type of Pokémon will give your Pokémon different EV points when they battle. Know which Pokémon give which EV points and only fight if those are EV points that you want."
        },
        {
          "headline":"Switch Pokémon if you need to.",
          "description":"In the early stages of EV training, your Pokémon may not be able to defeat the Pokémon it needs to in order to gain the EV points you want. You can deal with this in a few ways. One way is to get an Exp. Share, which when held by a Pokémon will give it the experience and EVs from a battle even if it does not fight. Another trick is to use the Pokémon in only one round and then switch it for another, stronger Pokémon."
        },
        {
          "headline":"Fight the right Pokémon.",
          "description":"Some Pokémon give only 1 EV point when they are battled, while some give 3 points! If you want to EV train your Pokémon quickly, try to have them battle the Pokémon who give the most points in the stat you are trying to improve. For example, fighting a Nidoqueen gives 3 EV points to HP, while fighting a Machamp gives 3 EV points to Attack. Keep in mind, however, that while some Pokémon may give a high number of EV points in a particular stat, those Pokémon may be hard to find. You may be better off fighting Pokémon which are easy to encounter but still give at least a point or two in the stat (or stats) you want."
        }
      ]
    },
    {
      "name":"Boosting Training Efficiency",
      "steps":[
        {
          "headline":"Use vitamins.",
          "description":"Vitamins will give your Pokémon 10 EV points in a particular stat. You can give your Pokémon up to 10 vitamins, meaning that this is a fast way to get 100 EV points (out of the limit of 510 EV points). Vitamins cost $9,800 each. You can buy Vitamins from Shopping Mall 9 in Black and White."
        },
        {
          "headline":"Use items.",
          "description":"There are a variety of items that you can equip on your Pokémon to make them gain EV points faster. The best item is the Macho Brace, which doubles all EV points gained but cuts your Pokémon’s speed. Other items, like a Power Weight or a Power Belt, only double a single stat but still cut the speed."
        },
        {
          "headline":"Try to contract Pokérus.",
          "description":"Pokérus is a Pokémon virus. Though rare, Pokérus is a status affliction that cannot be cured via Pokémon Center. Although it is possible to battle a Pokémon with Pokérus (which can only be received by said method by battling with a Pokémon and not by running), you will most likely have better luck receiving one over trade. Much like a regular virus, once one of your Pokémon catches the virus, it can spread to your other Pokémon. This virus will double the EVs you get from battles and works with the other items which increase EVs gained. However, your Pokémon will only have it for a certain period of time and then they will heal, usually around a day after contracting Pokérus. Find out if your Pokémon has Pokérus by checking their status effects. You'll also be told by the nurse at a Pokémon Center if your Pokémon has Pokérus. Keep in mind that this virus is very rare. You may never encounter it."
        },
        {
          "headline":"Find and use wings.",
          "description":"Wings are items which can occasionally be found on Marvellous Bridge and Driftveil Drawbridge. These increase a given stat by 1 EV point. While these give less points than vitamins, they don’t have a limit, so you can use as many as you want (assuming you can find them). The major downside it that the wings only increase 1 stat and which wing you find is random. It is also time consuming to find the wings."
        },
        {
          "headline":"Use items from Join Avenue.",
          "description":"Join Avenue will have a number of items available for sale which can raise your EVs. Try the items at the Dojo or Cafe to make your EVs rise as much as 48 points. Be aware, however, that this can be very expensive. Secret Dish A, for example, which raises your HP EVs by 48 points costs $72000!"
        },
        {
          "headline":"Use Rare Candies to level your Pokémon.",
          "description":"Since your EV Trained Pokémon will only see so many battles, you will need to have an alternative way to level it. The best way to do this is to use Rare Candies. These raise your Pokémon 1 level. They cost $4800 and are found in a lot of different places, depending on which game you are playing."
        }
      ]
    },
    {
      "name":"Resetting Your EVs",
      "steps":[
        {
          "headline":"Be careful about resetting your EVs.",
          "description":"Each Pokémon can only have 510 EV points. Only 252 of those points can be in any one stat. You may want to reset your EVs, say, if you accidentally used your Pokémon in a battle or if you decided to EV train a Pokémon after you had had it for a little while and it had seen a few battles. However, you will want to avoid items which might lower your EVs if you do not want them lowered."
        },
        {
          "headline":"Use berries.",
          "description":"If you are playing Black or White, you can use Berries to lower your EVs. They are pretty much the opposite of vitamins in that they reduce a given EV number by 10. However, in Black and White, the Berries can only be found and grown in the Dream World."
        },
        {
          "headline":"Use items from Join Avenue.",
          "description":"Join Avenue will have a number of items available for sale which can lower your EVs. Your best bet for items which lower EVs will come from the Beauty Salon, as these will very effectively lower EVs."
        }
      ]
    }
  ],
  "text":" Breeding Your Pokémon Start EV training from birth. EV training begins at birth. If you want perfect control over your Pokémon’s EVs, you’ll want to start from the minute they’re born, when their EVs are still a blank slate. Breed Pokémon in order to get eggs in your desired species that you can raise and train to be the best! Use Pokémon with good stats to get Pokémon with good stats. Since many of a Pokémon’s initial states (or IVs) are determined by their parents stats, you will want to use Pokémon with good stats in order to breed Pokémon with good stats. Just make sure that you understand how to breed Pokémon. Check your Pokémon’s IVs. Once you have a couple of newborn Pokémon, check their IVs using online tools. Google \"IV Calculator\" and input your Pokémon stats. The best IV for any one stat is 31, but IVs of 29 or 30 are also usable. Take the best out of several Pokémon or stop when you have one with really good stats. Battle-Training EV Pick your battles carefully. Every time your Pokémon fights in a battle, even if it’s only for a single turn, it will gain EV points from that battle. Because of this, you will want to be very careful about using your Pokémon in battles until they have maxed out their EVs. Only bring out your EV training Pokémon when you encounter a beneficial battle. Each type of Pokémon will give your Pokémon different EV points when they battle. Know which Pokémon give which EV points and only fight if those are EV points that you want. Switch Pokémon if you need to. In the early stages of EV training, your Pokémon may not be able to defeat the Pokémon it needs to in order to gain the EV points you want. You can deal with this in a few ways. One way is to get an Exp. Share, which when held by a Pokémon will give it the experience and EVs from a battle even if it does not fight. Another trick is to use the Pokémon in only one round and then switch it for another, stronger Pokémon. Fight the right Pokémon. Some Pokémon give only 1 EV point when they are battled, while some give 3 points! If you want to EV train your Pokémon quickly, try to have them battle the Pokémon who give the most points in the stat you are trying to improve. For example, fighting a Nidoqueen gives 3 EV points to HP, while fighting a Machamp gives 3 EV points to Attack. Keep in mind, however, that while some Pokémon may give a high number of EV points in a particular stat, those Pokémon may be hard to find. You may be better off fighting Pokémon which are easy to encounter but still give at least a point or two in the stat (or stats) you want. Boosting Training Efficiency Use vitamins. Vitamins will give your Pokémon 10 EV points in a particular stat. You can give your Pokémon up to 10 vitamins, meaning that this is a fast way to get 100 EV points (out of the limit of 510 EV points). Vitamins cost $9,800 each. You can buy Vitamins from Shopping Mall 9 in Black and White. Use items. There are a variety of items that you can equip on your Pokémon to make them gain EV points faster. The best item is the Macho Brace, which doubles all EV points gained but cuts your Pokémon’s speed. Other items, like a Power Weight or a Power Belt, only double a single stat but still cut the speed. Try to contract Pokérus. Pokérus is a Pokémon virus. Though rare, Pokérus is a status affliction that cannot be cured via Pokémon Center. Although it is possible to battle a Pokémon with Pokérus (which can only be received by said method by battling with a Pokémon and not by running), you will most likely have better luck receiving one over trade. Much like a regular virus, once one of your Pokémon catches the virus, it can spread to your other Pokémon. This virus will double the EVs you get from battles and works with the other items which increase EVs gained. However, your Pokémon will only have it for a certain period of time and then they will heal, usually around a day after contracting Pokérus. Find out if your Pokémon has Pokérus by checking their status effects. You'll also be told by the nurse at a Pokémon Center if your Pokémon has Pokérus. Keep in mind that this virus is very rare. You may never encounter it. Find and use wings. Wings are items which can occasionally be found on Marvellous Bridge and Driftveil Drawbridge. These increase a given stat by 1 EV point. While these give less points than vitamins, they don’t have a limit, so you can use as many as you want (assuming you can find them). The major downside it that the wings only increase 1 stat and which wing you find is random. It is also time consuming to find the wings. Use items from Join Avenue. Join Avenue will have a number of items available for sale which can raise your EVs. Try the items at the Dojo or Cafe to make your EVs rise as much as 48 points. Be aware, however, that this can be very expensive. Secret Dish A, for example, which raises your HP EVs by 48 points costs $72000! Use Rare Candies to level your Pokémon. Since your EV Trained Pokémon will only see so many battles, you will need to have an alternative way to level it. The best way to do this is to use Rare Candies. These raise your Pokémon 1 level. They cost $4800 and are found in a lot of different places, depending on which game you are playing. Resetting Your EVs Be careful about resetting your EVs. Each Pokémon can only have 510 EV points. Only 252 of those points can be in any one stat. You may want to reset your EVs, say, if you accidentally used your Pokémon in a battle or if you decided to EV train a Pokémon after you had had it for a little while and it had seen a few battles. However, you will want to avoid items which might lower your EVs if you do not want them lowered. Use berries. If you are playing Black or White, you can use Berries to lower your EVs. They are pretty much the opposite of vitamins in that they reduce a given EV number by 10. However, in Black and White, the Berries can only be found and grown in the Dream World. Use items from Join Avenue. Join Avenue will have a number of items available for sale which can lower your EVs. Your best bet for items which lower EVs will come from the Beauty Salon, as these will very effectively lower EVs.",
  "tyn_model":[
    "pokémon",
    "vitamins",
    "pokérus",
    "evs",
    "wings",
    "berries",
    "pokémon center",
    "candies",
    "ev training",
    "iv",
    "machamp"
  ],
  "tyn_section":[

  ]
}