{
  "title":"How to Prevent and Clean Mold on Plastic Shower Curtains",
  "url":"https://www.wikihow.com/Prevent-and-Clean-Mold-on-Plastic-Shower-Curtains",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Doors and Windows",
    "Window Treatments",
    "Curtains"
  ],
  "steps":[
    {
      "headline":"Take your shower curtain off the rod.",
      "description":"This is easily done by unhooking the fasteners."
    },
    {
      "headline":"Put the shower curtain in your washer with a few towels that need washing and add the usual detergent.",
      "description":""
    },
    {
      "headline":"Use hot water and the usual cycle for washing your towels and shower curtain.",
      "description":""
    },
    {
      "headline":"Do not use fabric softeners.",
      "description":"These should not be used on towels anyway since they affect absorbency."
    },
    {
      "headline":"Shake or drip dry your shower curtain.",
      "description":""
    },
    {
      "headline":"Rehang your sparkling clean shower curtain.",
      "description":""
    },
    {
      "headline":"After you shower leave your shower curtain open (not bunched up) so that it may dry without accumulating mold or mildew.",
      "description":"It's best to compact the shower curtain a little by opening both ends and also moving the rings midway toward each end toward the center. This distributes gentle bends across the shower curtain rather than trapping water by crumpling or folding it over on itself. Not only will the curtain still be fully exposed to air, but air will be free to slowly circulate around it from the sides and overhead to more rapidly dry the entire interior of the shower area. This works even better if you leave the bathroom door open a little after a shower."
    }
  ],
  "text":" Take your shower curtain off the rod. This is easily done by unhooking the fasteners. Put the shower curtain in your washer with a few towels that need washing and add the usual detergent.  Use hot water and the usual cycle for washing your towels and shower curtain.  Do not use fabric softeners. These should not be used on towels anyway since they affect absorbency. Shake or drip dry your shower curtain.  Rehang your sparkling clean shower curtain.  After you shower leave your shower curtain open (not bunched up) so that it may dry without accumulating mold or mildew. It's best to compact the shower curtain a little by opening both ends and also moving the rings midway toward each end toward the center. This distributes gentle bends across the shower curtain rather than trapping water by crumpling or folding it over on itself. Not only will the curtain still be fully exposed to air, but air will be free to slowly circulate around it from the sides and overhead to more rapidly dry the entire interior of the shower area. This works even better if you leave the bathroom door open a little after a shower.",
  "tyn_model":[
    "shower curtain",
    "washer",
    "fabric softeners",
    "water",
    "air"
  ],
  "tyn_section":[

  ]
}