{
  "title":"How to Thaw Frozen Fish",
  "url":"https://www.wikihow.com/Thaw-Frozen-Fish",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Preservation Techniques",
    "Freezing Food"
  ],
  "methods":[
    {
      "name":"Thawing in the Refrigerator",
      "steps":[
        {
          "headline":"Purchase frozen fish in a sealed container.",
          "description":"Make sure the fish you're thawing is in good condition before you thaw it and eat it. Frozen fish should be packaged in plastic that has not been torn or crushed. When you're buying frozen seafood, examine it closely to make sure it seems safe to eat. Purchase seafood that is completely frozen, not partially thawed. It should be stored in the freezer case below the \"frost line.\" Don't buy fish that has ice crystals or frost inside covering the fish. That means it has been in storage for a very long time, and may no longer be good to eat."
        },
        {
          "headline":"Place it in the refrigerator overnight to thaw it gradually.",
          "description":"The night before you know you want to make fish the next day, put it in the refrigerator so it will slowly defrost. This keeps the fish at a constantly cool temperature while also allowing it to thaw completely. Thawing fish in the refrigerator is the best way to preserve its taste and texture. Thawing fish in the refrigerator takes several hours. If you're out of time, try a different method. Don't be tempted to just place it on the counter to let it thaw; the outer portions of the fish could start to go bad before the inside is completely defrosted. When using this method to thaw vacuum packaged fish, make sure to remove or open the packaging before leaving the fish in the refrigerator. Not doing so can lead to development of toxin producing bacteria."
        },
        {
          "headline":"Check the thawed fish to make sure it's good.",
          "description":"Thawed fish should have the same texture and smell as fresh fish. While it might not have the same fresh, bright color, it shouldn't be mottled or discolored. Sniff the fish; if it smells too fishy or decayed, it's no longer usable. Thawed fish may have a slightly fishy smell, but it shouldn't be off-putting."
        },
        {
          "headline":"Cook the fish according to your recipe.",
          "description":"Thawed fish can be used in place of fresh fish in any recipe. Cook the fish to the proper temperature. Fish is typically finished cooking when it's no longer translucent and the texture is flaky and firm."
        }
      ]
    },
    {
      "name":"Thawing Fish Quickly",
      "steps":[
        {
          "headline":"Seal it in a plastic bag.",
          "description":"Place the fish in a plastic bag and tie the bag in a knot to completely seal it. You don't want the water to actually touch the fish. The cool temperature of the water will be able to thaw the fish through the bag."
        },
        {
          "headline":"Place the fish in a pot of cold water.",
          "description":"If the fish floats, put a plate or another weight on top to keep it completely submerged. The fish will thaw quickly in the cold water. Let it sit for about an hour to make sure it thaws completely before using. As an alternative, you can run the fish under cold running water to thaw it out. The water doesn't have to run rapidly; a steady stream will do. This will defrost the fish more rapidly than placing it in a pot of cold water. However, use running water only for thinner fish filets, since you don't want to waste too much water by running it for half an hour or more. Check the fish to see whether it has completely defrosted by pressing your finger against the flesh. If it still feels frozen in the middle, let it continue to thaw. Don't thaw fish in hot water. This will thaw the fish unevenly and too quickly, changing its taste and texture. Thawing in hot water will also make the outer edges susceptible to getting contaminated with bacteria before the inside of the fish is finished thawing."
        },
        {
          "headline":"Consider defrosting it in the microwave.",
          "description":"Use the “defrost” setting in your microwave as an alternative to icy water. Place your fish in a microwave-safe container and defrost it for several minutes. Check on the fish often, and stop the defrost cycle while the fish is still icy but malleable. Use this method only if you're planning to cook the fish immediately after thawing. Be careful not to actually cook the fish in the microwave; take it out while it's still cold to make sure the texture and flavor don't start to deteriorate."
        }
      ]
    },
    {
      "name":"Cooking Frozen Fish",
      "steps":[
        {
          "headline":"Rinse the fish when you remove it from the freezer.",
          "description":"This will get rid of any ice crystals and other buildup it acquired while it was frozen. Give it a good rinse under cool running water. Dry it off with a paper towel before proceeding."
        },
        {
          "headline":"Cook the fish right away.",
          "description":"If you don't have the time or inclination to defrost a piece of fish, you can skip the hassle and cook it frozen. Certain cooking methods allow you to turn a piece of frozen fish into a delicious dinner with no intermediary thawing step. Try these methods:\n\n Steaming. Place the fish in an inch or two of broth and slowly steam it. It's healthy, delicious cooking method that results in silky fish, whether you start with fresh or raw fish. Baking. Brush the fish with olive oil and place it in a roasting pan. Bake the fish until it's no longer opaque and easily flakes apart. Use a foil packet on the grill. If you really want to grill the fish, brush it with oil and sprinkle it with seasonings, then wrap it up in a foil packet and crimp the edges. Place it on a hot grill. The fish will steam in the packet and taste delicious when it's finished. Add it to soup or stew. If you have shrimp, mussels or clams that are frozen, you can simply add them to stew or soup that's simmering hot. The seafood will start cooking in the seasoned liquid and be ready to eat within a few minutes."
        },
        {
          "headline":"Know which recipes require thawed fish.",
          "description":"Some recipes require that fish be thawed in order to achieve the right texture and cook evenly. For example, grilling frozen fish might cause you to end up with a piece of fish that's overcooked on the outside and cold on the inside. Frying frozen fish might also result in undercooked pieces. Check the recipe you're using and see if it specifies that you must use thawed fish for best results. If you're not sure whether you can cook the fish while it's frozen, it's probably better to defrost it first, just in case. However, if a recipe specifies that the fish should be thawed, you can still take a risk and cook it frozen. Just add a few minutes to the specified cooking time, and make sure the fish is cooked through before you serve it."
        }
      ]
    }
  ],
  "text":" Thawing in the Refrigerator Purchase frozen fish in a sealed container. Make sure the fish you're thawing is in good condition before you thaw it and eat it. Frozen fish should be packaged in plastic that has not been torn or crushed. When you're buying frozen seafood, examine it closely to make sure it seems safe to eat. Purchase seafood that is completely frozen, not partially thawed. It should be stored in the freezer case below the \"frost line.\" Don't buy fish that has ice crystals or frost inside covering the fish. That means it has been in storage for a very long time, and may no longer be good to eat. Place it in the refrigerator overnight to thaw it gradually. The night before you know you want to make fish the next day, put it in the refrigerator so it will slowly defrost. This keeps the fish at a constantly cool temperature while also allowing it to thaw completely. Thawing fish in the refrigerator is the best way to preserve its taste and texture. Thawing fish in the refrigerator takes several hours. If you're out of time, try a different method. Don't be tempted to just place it on the counter to let it thaw; the outer portions of the fish could start to go bad before the inside is completely defrosted. When using this method to thaw vacuum packaged fish, make sure to remove or open the packaging before leaving the fish in the refrigerator. Not doing so can lead to development of toxin producing bacteria. Check the thawed fish to make sure it's good. Thawed fish should have the same texture and smell as fresh fish. While it might not have the same fresh, bright color, it shouldn't be mottled or discolored. Sniff the fish; if it smells too fishy or decayed, it's no longer usable. Thawed fish may have a slightly fishy smell, but it shouldn't be off-putting. Cook the fish according to your recipe. Thawed fish can be used in place of fresh fish in any recipe. Cook the fish to the proper temperature. Fish is typically finished cooking when it's no longer translucent and the texture is flaky and firm. Thawing Fish Quickly Seal it in a plastic bag. Place the fish in a plastic bag and tie the bag in a knot to completely seal it. You don't want the water to actually touch the fish. The cool temperature of the water will be able to thaw the fish through the bag. Place the fish in a pot of cold water. If the fish floats, put a plate or another weight on top to keep it completely submerged. The fish will thaw quickly in the cold water. Let it sit for about an hour to make sure it thaws completely before using. As an alternative, you can run the fish under cold running water to thaw it out. The water doesn't have to run rapidly; a steady stream will do. This will defrost the fish more rapidly than placing it in a pot of cold water. However, use running water only for thinner fish filets, since you don't want to waste too much water by running it for half an hour or more. Check the fish to see whether it has completely defrosted by pressing your finger against the flesh. If it still feels frozen in the middle, let it continue to thaw. Don't thaw fish in hot water. This will thaw the fish unevenly and too quickly, changing its taste and texture. Thawing in hot water will also make the outer edges susceptible to getting contaminated with bacteria before the inside of the fish is finished thawing. Consider defrosting it in the microwave. Use the “defrost” setting in your microwave as an alternative to icy water. Place your fish in a microwave-safe container and defrost it for several minutes. Check on the fish often, and stop the defrost cycle while the fish is still icy but malleable. Use this method only if you're planning to cook the fish immediately after thawing. Be careful not to actually cook the fish in the microwave; take it out while it's still cold to make sure the texture and flavor don't start to deteriorate. Cooking Frozen Fish Rinse the fish when you remove it from the freezer. This will get rid of any ice crystals and other buildup it acquired while it was frozen. Give it a good rinse under cool running water. Dry it off with a paper towel before proceeding. Cook the fish right away. If you don't have the time or inclination to defrost a piece of fish, you can skip the hassle and cook it frozen. Certain cooking methods allow you to turn a piece of frozen fish into a delicious dinner with no intermediary thawing step. Try these methods:\n\n Steaming. Place the fish in an inch or two of broth and slowly steam it. It's healthy, delicious cooking method that results in silky fish, whether you start with fresh or raw fish. Baking. Brush the fish with olive oil and place it in a roasting pan. Bake the fish until it's no longer opaque and easily flakes apart. Use a foil packet on the grill. If you really want to grill the fish, brush it with oil and sprinkle it with seasonings, then wrap it up in a foil packet and crimp the edges. Place it on a hot grill. The fish will steam in the packet and taste delicious when it's finished. Add it to soup or stew. If you have shrimp, mussels or clams that are frozen, you can simply add them to stew or soup that's simmering hot. The seafood will start cooking in the seasoned liquid and be ready to eat within a few minutes. Know which recipes require thawed fish. Some recipes require that fish be thawed in order to achieve the right texture and cook evenly. For example, grilling frozen fish might cause you to end up with a piece of fish that's overcooked on the outside and cold on the inside. Frying frozen fish might also result in undercooked pieces. Check the recipe you're using and see if it specifies that you must use thawed fish for best results. If you're not sure whether you can cook the fish while it's frozen, it's probably better to defrost it first, just in case. However, if a recipe specifies that the fish should be thawed, you can still take a risk and cook it frozen. Just add a few minutes to the specified cooking time, and make sure the fish is cooked through before you serve it.",
  "tyn_model":[
    "fish",
    "water",
    "refrigerator",
    "seafood",
    "microwave",
    "plastic bag",
    "foil packet",
    "grill",
    "freezer case",
    "plate",
    "“defrost",
    "” setting",
    "microwave-safe container",
    "freezer",
    "broth",
    "olive oil",
    "roasting pan",
    "oil",
    "seasonings",
    "shrimp",
    "mussels"
  ],
  "tyn_section":[

  ]
}