{
  "title":"How to Make Strawberry Cupcakes",
  "url":"https://www.wikihow.com/Make-Strawberry-Cupcakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Cupcakes"
  ],
  "methods":[
    {
      "name":"Dried strawberry cupcakes",
      "steps":[
        {
          "headline":"Arrange the cupcake cases in a muffin pan.",
          "description":"Preheat the oven to 175ºC."
        },
        {
          "headline":"Pour the eggs into the mixing bowl.",
          "description":"Crack in the eggs and mix."
        },
        {
          "headline":"Add sifted flour and baking powder to the liquid mixture.",
          "description":""
        },
        {
          "headline":"In a separate glass container, mix the olive oil and milk.",
          "description":"Pour this into the cake batter. Mix well."
        },
        {
          "headline":"Pour the batter into cupcake cases.",
          "description":"Use a teaspoon to transfer."
        },
        {
          "headline":"Sprinkle in even amounts of dried strawberries.",
          "description":""
        },
        {
          "headline":"Place in the oven.",
          "description":"Bake for 25 minutes."
        },
        {
          "headline":"Remove from the oven and set on a wire cooling rack to cool.",
          "description":"Frost the cupcakes and enjoy!"
        }
      ]
    },
    {
      "name":"Fresh strawberry cupcakes",
      "steps":[
        {
          "headline":"Preheat the oven to 180ºC.",
          "description":"Place cupcake cases into a muffin pan."
        },
        {
          "headline":"Sift the flour and baking powder into the mixing bowl.",
          "description":""
        },
        {
          "headline":"In another mixing bowl, beat together the sugar and butter until creamy.",
          "description":"Add the vanilla."
        },
        {
          "headline":"Gradually add the eggs, one at a time.",
          "description":"Beat in well after adding each one."
        },
        {
          "headline":"Pour the flour mix into the liquid mix.",
          "description":"Stir together."
        },
        {
          "headline":"Pour in the milk.",
          "description":"Then, pour the strawberry puree into the batter. Mix well to combine."
        },
        {
          "headline":"Pour the batter into the cupcake cases.",
          "description":""
        },
        {
          "headline":"Place in the oven and bake for 13-15 minutes.",
          "description":""
        },
        {
          "headline":"Remove from the oven.",
          "description":"Cool on a wire baking rack."
        }
      ]
    },
    {
      "name":"Strawberry jam cupcakes",
      "steps":[
        {
          "headline":"Place the cupcake cases into a muffin pan.",
          "description":"Preheat the oven to 160ºC."
        },
        {
          "headline":"Place the butter and sugar into the mixing bowl.",
          "description":"Add the vanilla. Cream together until light and fluffy."
        },
        {
          "headline":"Fold in the eggs.",
          "description":"Add one at a time and beat in well each time."
        },
        {
          "headline":"Fold the sifted flour into the batter.",
          "description":""
        },
        {
          "headline":"Pour 1 tablespoon of the batter into each cupcake case.",
          "description":"Add 1 teaspoon of strawberry jam into the center of the batter."
        },
        {
          "headline":"Add another tablespoon of cupcake butter over the top of the jam.",
          "description":""
        },
        {
          "headline":"Place the pan into the oven.",
          "description":"Bake for 15 to 20 minutes."
        },
        {
          "headline":"Remove from the oven and allow to cool before adding a topping.",
          "description":"Be aware the jam is very hot; only serve the cupcakes once the cupcakes have cooled."
        }
      ]
    },
    {
      "name":"Frosting and topping ideas for strawberry cupcakes",
      "steps":[
        {
          "headline":"Make a fresh strawberry topping.",
          "description":"Frost or ice the cupcake with frosting of choice and add fresh strawberries:\nAdd a whole strawberry or half a strawberry. Either stand up the strawberry or lay on its side. Add a strawberry fan. Cut a strawberry into a fan shape and arrange on the frosting or icing fanned out. Cut the real strawberry into a shape, such as a heart shape. Dip real strawberries in chocolate, allow to set and place on the cupcakes."
        },
        {
          "headline":"Mold a strawberry using red fondant, sugar paste or marzipan.",
          "description":"Frost or ice each cupcake and add a strawberry figure to each one."
        },
        {
          "headline":"Add an edible strawberry candy to the frosting or icing.",
          "description":""
        },
        {
          "headline":"Add pureed strawberry to the icing sugar or confectioners sugar.",
          "description":"Once mixed to a decent consistency, add to the cupcakes as usual."
        },
        {
          "headline":"Ice or frost the cupcakes with strawberry red cupcakes.",
          "description":"Pipe small melted chocolate \"pips\" across the red surface at even spaces. Add a green candy leaf or green fondant leaf at the \"top\" of the strawberry."
        }
      ]
    }
  ],
  "text":" Dried strawberry cupcakes Arrange the cupcake cases in a muffin pan. Preheat the oven to 175ºC. Pour the eggs into the mixing bowl. Crack in the eggs and mix. Add sifted flour and baking powder to the liquid mixture.  In a separate glass container, mix the olive oil and milk. Pour this into the cake batter. Mix well. Pour the batter into cupcake cases. Use a teaspoon to transfer. Sprinkle in even amounts of dried strawberries.  Place in the oven. Bake for 25 minutes. Remove from the oven and set on a wire cooling rack to cool. Frost the cupcakes and enjoy! Fresh strawberry cupcakes Preheat the oven to 180ºC. Place cupcake cases into a muffin pan. Sift the flour and baking powder into the mixing bowl.  In another mixing bowl, beat together the sugar and butter until creamy. Add the vanilla. Gradually add the eggs, one at a time. Beat in well after adding each one. Pour the flour mix into the liquid mix. Stir together. Pour in the milk. Then, pour the strawberry puree into the batter. Mix well to combine. Pour the batter into the cupcake cases.  Place in the oven and bake for 13-15 minutes.  Remove from the oven. Cool on a wire baking rack. Strawberry jam cupcakes Place the cupcake cases into a muffin pan. Preheat the oven to 160ºC. Place the butter and sugar into the mixing bowl. Add the vanilla. Cream together until light and fluffy. Fold in the eggs. Add one at a time and beat in well each time. Fold the sifted flour into the batter.  Pour 1 tablespoon of the batter into each cupcake case. Add 1 teaspoon of strawberry jam into the center of the batter. Add another tablespoon of cupcake butter over the top of the jam.  Place the pan into the oven. Bake for 15 to 20 minutes. Remove from the oven and allow to cool before adding a topping. Be aware the jam is very hot; only serve the cupcakes once the cupcakes have cooled. Frosting and topping ideas for strawberry cupcakes Make a fresh strawberry topping. Frost or ice the cupcake with frosting of choice and add fresh strawberries:\nAdd a whole strawberry or half a strawberry. Either stand up the strawberry or lay on its side. Add a strawberry fan. Cut a strawberry into a fan shape and arrange on the frosting or icing fanned out. Cut the real strawberry into a shape, such as a heart shape. Dip real strawberries in chocolate, allow to set and place on the cupcakes. Mold a strawberry using red fondant, sugar paste or marzipan. Frost or ice each cupcake and add a strawberry figure to each one. Add an edible strawberry candy to the frosting or icing.  Add pureed strawberry to the icing sugar or confectioners sugar. Once mixed to a decent consistency, add to the cupcakes as usual. Ice or frost the cupcakes with strawberry red cupcakes. Pipe small melted chocolate \"pips\" across the red surface at even spaces. Add a green candy leaf or green fondant leaf at the \"top\" of the strawberry.",
  "tyn_model":[
    "oven",
    "strawberry",
    "cupcake cases",
    "eggs",
    "mixing bowl",
    "flour",
    "muffin pan",
    "strawberries",
    "baking powder",
    "milk",
    "sugar",
    "butter",
    "vanilla",
    "strawberry jam",
    "icing",
    "chocolate",
    "glass container",
    "olive oil",
    "cake batter",
    "strawberry puree",
    "cupcake case",
    "cupcake butter",
    "strawberry fan",
    "frosting",
    "red fondant",
    "sugar paste",
    "marzipan",
    "edible strawberry candy",
    "icing sugar",
    "confectioners sugar",
    "strawberry red cupcakes",
    "fondant"
  ],
  "tyn_section":[

  ]
}