{
  "title":"How to Make Taco Salad",
  "url":"https://www.wikihow.com/Make-Taco-Salad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine",
    "Taco Dishes"
  ],
  "methods":[
    {
      "name":"Making a Basic Taco Salad",
      "steps":[
        {
          "headline":"Mix the salsa and sour cream together in a small bowl using a fork or mini whisk, then set it aside.",
          "description":"Keep mixing until the color is uniform and there are no unmixed streaks. Set the dressing aside, preferably in the fridge, so that it's nice and cold. Make sure that you are using the smooth kind of salsa and not the chunky kind; do not use pico de gallo."
        },
        {
          "headline":"Cook the ground sirloin over medium-high heat.",
          "description":"Place a large skillet onto the stove, and turn the heat up to medium-high. Add the beef, and use a wooden spoon or spatula to break it up. Cook the meat, stirring occasionally, until it turns brown and starts to crumble."
        },
        {
          "headline":"Mix the water and taco seasoning in a cup.",
          "description":"Tear open the package of taco seasoning, and pour it into a cup. Add the water, and mix the two together using a fork or mini whisk."
        },
        {
          "headline":"Pour the seasoning into the skillet, lower the heat, and simmer for 5 minutes.",
          "description":"Stir the meat occasionally to help the flavors mix and the meat to cook evenly."
        },
        {
          "headline":"Drain the beef, then set it aside to cool.",
          "description":"This will prevent your salad from wilting or becoming too soggy."
        },
        {
          "headline":"Put the beef, lettuce, tomatoes, beans, olives, and half of the cheese into a large bowl.",
          "description":"Save the rest of the cheese for garnishing, and do not add the chips yet. To prevent the salad from getting too soggy, make sure that the meat is cool and drained. The beans and tomatoes should also be drained. You don't have to include all of the ingredients. If you don't like olives, leave them out! If you don't like beans, consider using corn instead. You can add some extra ingredients as well, such as chopped avocado or diced onion. Anything that could be found in a taco will work."
        },
        {
          "headline":"Add the dressing, and toss the salad.",
          "description":"You can do this using a pair of salad tongs, or two large spoons. Scoop the salad from the bottom of the bowl, and drop it back gently on top. Keep doing this until the dressing is evenly distributed throughout the salad."
        },
        {
          "headline":"Garnish the salad with the rest of the cheese, and serve it with tortilla chips.",
          "description":"You can tuck the chips around the sides of the bowl, or you can keep them separate, so that people can grab them as they please; not everyone enjoys soggy chips! You can garnish the salad with and additional cup (cc grams) of salsa."
        }
      ]
    },
    {
      "name":"Making a Deluxe Taco Salad",
      "steps":[
        {
          "headline":"Combine the salsa and sour cream to make the dressing.",
          "description":"In a small bowl, mix the salsa and sour cream together using a fork or mini whisk. Keep mixing until the color is even and there are no streaks. Set the dressing aside. Use the smooth kind of salsa and not the chunky kind (ie: pico de gallo)."
        },
        {
          "headline":"Heat the oil over medium heat in a medium-sized skillet, then add the onion and garlic.",
          "description":"Once the oil starts to sizzle, add the chopped onion and minced garlic. Give everything a stir with a wooden spoon or spatula, and make sure that the onion and garlic aren't clumped together into a pile."
        },
        {
          "headline":"Cook the onion and garlic until they turn soft.",
          "description":"This will take about 1 to 2 minutes. While they are cooking, stir them often with a wooden spoon or spatula. This ensures that they cook evenly."
        },
        {
          "headline":"Add the beef, and cook it for another 5 minutes, stirring often.",
          "description":"Once the onion and garlic have turned soft, add the beef, and use a wooden spoon or spatula to break it up. Cook the beef until it turns brown and starts to crumble, about 5 minutes. If you don't have beef, try it with ground turkey instead!"
        },
        {
          "headline":"Add the tomatoes, beans, cumin, chili powder, and salt, and cook for another 2 to 3 minutes.",
          "description":"To prevent your salad from becoming too soggy, make sure that the beans and chopped tomatoes are fully drained before you add them in. You are ready for the next step when the tomatoes start to break down."
        },
        {
          "headline":"Take the skillet off the heat, then add the cilantro and half of the dressing.",
          "description":"Gently fold the mixture together until everything is evenly combined. Save the rest of the dressing for later."
        },
        {
          "headline":"Toss the remaining dressing with the lettuce in a large bowl.",
          "description":"You can do this using two large spoons or a pair of salad tongs. Grab the lettuce from the bottom of the bowl, and drop it gently back on top. Keep tossing the lettuce until it is evenly coated with the dressing."
        },
        {
          "headline":"Distribute the lettuce between 4 plates, then scoop the meat mixture on top.",
          "description":"This will prevent the meat mixture from wiling the salad too much. It will also make for a nicer presentation."
        },
        {
          "headline":"Garnish the salads with shredded cheese and tortilla chips, and serve.",
          "description":"You can place the chips around the salad and scatter the cheese on top. You can also serve the cheese and chips separately to prevent them from getting too soggy."
        }
      ]
    },
    {
      "name":"Making a Vegetarian Taco Salad",
      "steps":[
        {
          "headline":"Have 1½ cups (375 grams) of cooked, long-grain brown rice ready.",
          "description":"You can use leftover rice from last night's dinner, or you can make fresh rice. If you do not have any cooked rice on hand, you will have to make some now:\nIn a small saucepan, combine 1 cup (240 milliliters) of water and ½ cup (115 grams) of rice. Bring the rice and water to a boil. Reduce the heat to low, cover the saucepan, and simmer until the water has been absorbed, about 40 minutes. Remove the saucepan from heat, and let the rice stand, covered, for 10 minutes."
        },
        {
          "headline":"Prepare the fresh salsa dressing, then set it aside.",
          "description":"In a small bowl, combine ⅓ cup (85 grams) of bottled salsa, ½ cup (25 grams) of chopped, fresh cilantro, and ½ teaspoon dried oregano. Chop 3 large tomatoes, drain off any juices, and add them to the bowl. Toss the salsa mixture, then set it aside. Make sure that you are using the smooth kind of bottled salsa, and not the chunky, \"pico de gallo\" kind."
        },
        {
          "headline":"Heat the oil in a skillet over medium heat, then add the onion and corn, and cook until the onion turns brown.",
          "description":"Pour the oil into a large skillet, and place the skillet onto the stove. Turn the heat up the medium, then add the onion and corn. Cook the onion and corn, stirring often with a wooden spoon or spatula, until the onion turns brown. This will take about 5 minutes."
        },
        {
          "headline":"Add the chopped tomato, rice, beans, chili powder, oregano, and teaspoon salt, and cook for another 5 minutes.",
          "description":"To prevent your salad from becoming too soggy, make sure that you drain all liquid from the tomatoes and the beans."
        },
        {
          "headline":"Take the rice mixture off the stove, and let it cool.",
          "description":"This will prevent it from wilting the lettuce. If there is a lot of liquid in the skillet, it would be a good idea to drain it as well."
        },
        {
          "headline":"In a large bowl, toss the rice mixture with the lettuce, half of the salsa dressing, and ⅔ cups (65 grams) of shredded cheese.",
          "description":"Save the rest of the salsa dressing and shredded cheese for later."
        },
        {
          "headline":"Garnish the salad with the rest of the cheese.",
          "description":"You can also add the tortilla chips directly into the salad, or you can keep them in a separate bowl. If the chips sit too long in the salad, they will become soggy; not everyone likes soggy chips."
        },
        {
          "headline":"Serve the salad with the rest of the salsa dressing and lime wedges.",
          "description":"Keep the salsa and lime wedges in separate bowls, so that people can use as much as they like."
        }
      ]
    }
  ],
  "text":" Making a Basic Taco Salad Mix the salsa and sour cream together in a small bowl using a fork or mini whisk, then set it aside. Keep mixing until the color is uniform and there are no unmixed streaks. Set the dressing aside, preferably in the fridge, so that it's nice and cold. Make sure that you are using the smooth kind of salsa and not the chunky kind; do not use pico de gallo. Cook the ground sirloin over medium-high heat. Place a large skillet onto the stove, and turn the heat up to medium-high. Add the beef, and use a wooden spoon or spatula to break it up. Cook the meat, stirring occasionally, until it turns brown and starts to crumble. Mix the water and taco seasoning in a cup. Tear open the package of taco seasoning, and pour it into a cup. Add the water, and mix the two together using a fork or mini whisk. Pour the seasoning into the skillet, lower the heat, and simmer for 5 minutes. Stir the meat occasionally to help the flavors mix and the meat to cook evenly. Drain the beef, then set it aside to cool. This will prevent your salad from wilting or becoming too soggy. Put the beef, lettuce, tomatoes, beans, olives, and half of the cheese into a large bowl. Save the rest of the cheese for garnishing, and do not add the chips yet. To prevent the salad from getting too soggy, make sure that the meat is cool and drained. The beans and tomatoes should also be drained. You don't have to include all of the ingredients. If you don't like olives, leave them out! If you don't like beans, consider using corn instead. You can add some extra ingredients as well, such as chopped avocado or diced onion. Anything that could be found in a taco will work. Add the dressing, and toss the salad. You can do this using a pair of salad tongs, or two large spoons. Scoop the salad from the bottom of the bowl, and drop it back gently on top. Keep doing this until the dressing is evenly distributed throughout the salad. Garnish the salad with the rest of the cheese, and serve it with tortilla chips. You can tuck the chips around the sides of the bowl, or you can keep them separate, so that people can grab them as they please; not everyone enjoys soggy chips! You can garnish the salad with and additional cup (cc grams) of salsa. Making a Deluxe Taco Salad Combine the salsa and sour cream to make the dressing. In a small bowl, mix the salsa and sour cream together using a fork or mini whisk. Keep mixing until the color is even and there are no streaks. Set the dressing aside. Use the smooth kind of salsa and not the chunky kind (ie: pico de gallo). Heat the oil over medium heat in a medium-sized skillet, then add the onion and garlic. Once the oil starts to sizzle, add the chopped onion and minced garlic. Give everything a stir with a wooden spoon or spatula, and make sure that the onion and garlic aren't clumped together into a pile. Cook the onion and garlic until they turn soft. This will take about 1 to 2 minutes. While they are cooking, stir them often with a wooden spoon or spatula. This ensures that they cook evenly. Add the beef, and cook it for another 5 minutes, stirring often. Once the onion and garlic have turned soft, add the beef, and use a wooden spoon or spatula to break it up. Cook the beef until it turns brown and starts to crumble, about 5 minutes. If you don't have beef, try it with ground turkey instead! Add the tomatoes, beans, cumin, chili powder, and salt, and cook for another 2 to 3 minutes. To prevent your salad from becoming too soggy, make sure that the beans and chopped tomatoes are fully drained before you add them in. You are ready for the next step when the tomatoes start to break down. Take the skillet off the heat, then add the cilantro and half of the dressing. Gently fold the mixture together until everything is evenly combined. Save the rest of the dressing for later. Toss the remaining dressing with the lettuce in a large bowl. You can do this using two large spoons or a pair of salad tongs. Grab the lettuce from the bottom of the bowl, and drop it gently back on top. Keep tossing the lettuce until it is evenly coated with the dressing. Distribute the lettuce between 4 plates, then scoop the meat mixture on top. This will prevent the meat mixture from wiling the salad too much. It will also make for a nicer presentation. Garnish the salads with shredded cheese and tortilla chips, and serve. You can place the chips around the salad and scatter the cheese on top. You can also serve the cheese and chips separately to prevent them from getting too soggy. Making a Vegetarian Taco Salad Have 1½ cups (375 grams) of cooked, long-grain brown rice ready. You can use leftover rice from last night's dinner, or you can make fresh rice. If you do not have any cooked rice on hand, you will have to make some now:\nIn a small saucepan, combine 1 cup (240 milliliters) of water and ½ cup (115 grams) of rice. Bring the rice and water to a boil. Reduce the heat to low, cover the saucepan, and simmer until the water has been absorbed, about 40 minutes. Remove the saucepan from heat, and let the rice stand, covered, for 10 minutes. Prepare the fresh salsa dressing, then set it aside. In a small bowl, combine ⅓ cup (85 grams) of bottled salsa, ½ cup (25 grams) of chopped, fresh cilantro, and ½ teaspoon dried oregano. Chop 3 large tomatoes, drain off any juices, and add them to the bowl. Toss the salsa mixture, then set it aside. Make sure that you are using the smooth kind of bottled salsa, and not the chunky, \"pico de gallo\" kind. Heat the oil in a skillet over medium heat, then add the onion and corn, and cook until the onion turns brown. Pour the oil into a large skillet, and place the skillet onto the stove. Turn the heat up the medium, then add the onion and corn. Cook the onion and corn, stirring often with a wooden spoon or spatula, until the onion turns brown. This will take about 5 minutes. Add the chopped tomato, rice, beans, chili powder, oregano, and teaspoon salt, and cook for another 5 minutes. To prevent your salad from becoming too soggy, make sure that you drain all liquid from the tomatoes and the beans. Take the rice mixture off the stove, and let it cool. This will prevent it from wilting the lettuce. If there is a lot of liquid in the skillet, it would be a good idea to drain it as well. In a large bowl, toss the rice mixture with the lettuce, half of the salsa dressing, and ⅔ cups (65 grams) of shredded cheese. Save the rest of the salsa dressing and shredded cheese for later. Garnish the salad with the rest of the cheese. You can also add the tortilla chips directly into the salad, or you can keep them in a separate bowl. If the chips sit too long in the salad, they will become soggy; not everyone likes soggy chips. Serve the salad with the rest of the salsa dressing and lime wedges. Keep the salsa and lime wedges in separate bowls, so that people can use as much as they like.",
  "tyn_model":[
    "salsa",
    "onion",
    "rice",
    "beef",
    "lettuce",
    "tomatoes",
    "wooden spoon",
    "water",
    "skillet",
    "beans",
    "garlic",
    "bowl",
    "oil",
    "sour cream",
    "stove",
    "cheese",
    "corn",
    "tortilla chips",
    "shredded cheese",
    "salsa dressing",
    "pico de gallo",
    "large skillet",
    "taco seasoning",
    "olives",
    "large bowl",
    "salad tongs",
    "spatula",
    "chili powder",
    "salt",
    "cilantro",
    "saucepan",
    "oregano",
    "lime wedges",
    "fork or mini whisk",
    "avocado",
    "dressing",
    "large spoons",
    "mini whisk",
    "medium-sized skillet",
    "ground turkey",
    "cumin",
    "brown rice",
    "small saucepan",
    "fresh salsa",
    "small bowl",
    "⅓ cup",
    "bottled salsa",
    "tomato",
    "⅔ cups"
  ],
  "tyn_section":[

  ]
}