{
  "title":"How to Make Vegan Cream of Tomato Soup",
  "url":"https://www.wikihow.com/Make-Vegan-Cream-of-Tomato-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Preparing the Rosemary Croutons",
      "steps":[
        {
          "headline":"Preheat your oven to 375°F (190°C) and spray a flat baking sheet with nonstick cooking spray.",
          "description":""
        },
        {
          "headline":"Toss the bread cubes, olive oil, garlic and rosemary in a large bowl, using either a spoon or clean hands.",
          "description":"Make sure that all the ingredients are well combined."
        },
        {
          "headline":"Spread the cubes onto the baking sheet.",
          "description":"Bake them for 12 to 15 minutes, depending on the desirable crispiness you wish."
        },
        {
          "headline":"Remove the croutons from the oven and set the baking sheet on your range top so the croutons can cool.",
          "description":""
        }
      ]
    },
    {
      "name":"Preparing the Tomato Soup",
      "steps":[
        {
          "headline":"Place the onion, garlic cloves, coconut oil and tomato paste into either a blender or a food processor.",
          "description":""
        },
        {
          "headline":"Puree the mixture until it is smooth.",
          "description":""
        },
        {
          "headline":"Pour the puree into a large saucepan and heat it over medium-high heat until it boils.",
          "description":""
        },
        {
          "headline":"Lower the heat to medium and cook the puree for 1 or 2 minutes until it is heated through.",
          "description":"Stir the puree occasionally with a large spoon that won’t be stained by the tomato paste."
        },
        {
          "headline":"Stir in the thyme, vegetable broth and pureed tomatoes.",
          "description":""
        },
        {
          "headline":"Cook the soup until it has heated through, which should take about 3 minutes.",
          "description":""
        },
        {
          "headline":"Add the Coconut Dream and coconut milk creamer, stirring to combine.",
          "description":"Cook the soup for an additional five minutes."
        },
        {
          "headline":"Taste the soup.",
          "description":"Add salt and pepper in small increments until it has the taste that you wish."
        },
        {
          "headline":"Ladle the soup into serving bowls.",
          "description":""
        },
        {
          "headline":"Drizzle a little olive oil over the soup.",
          "description":""
        },
        {
          "headline":"Top the soup with the homemade croutons or serve it with a slice of toasted bread.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preparing the Rosemary Croutons Preheat your oven to 375°F (190°C) and spray a flat baking sheet with nonstick cooking spray.  Toss the bread cubes, olive oil, garlic and rosemary in a large bowl, using either a spoon or clean hands. Make sure that all the ingredients are well combined. Spread the cubes onto the baking sheet. Bake them for 12 to 15 minutes, depending on the desirable crispiness you wish. Remove the croutons from the oven and set the baking sheet on your range top so the croutons can cool.  Preparing the Tomato Soup Place the onion, garlic cloves, coconut oil and tomato paste into either a blender or a food processor.  Puree the mixture until it is smooth.  Pour the puree into a large saucepan and heat it over medium-high heat until it boils.  Lower the heat to medium and cook the puree for 1 or 2 minutes until it is heated through. Stir the puree occasionally with a large spoon that won’t be stained by the tomato paste. Stir in the thyme, vegetable broth and pureed tomatoes.  Cook the soup until it has heated through, which should take about 3 minutes.  Add the Coconut Dream and coconut milk creamer, stirring to combine. Cook the soup for an additional five minutes. Taste the soup. Add salt and pepper in small increments until it has the taste that you wish. Ladle the soup into serving bowls.  Drizzle a little olive oil over the soup.  Top the soup with the homemade croutons or serve it with a slice of toasted bread. ",
  "tyn_model":[
    "baking sheet",
    "oven",
    "olive oil",
    "garlic",
    "tomato paste",
    "nonstick cooking spray",
    "rosemary",
    "tomato soup",
    "onion",
    "coconut oil",
    "blender",
    "food processor",
    "large saucepan",
    "thyme",
    "vegetable broth",
    "tomatoes",
    "coconut dream",
    "coconut milk",
    "creamer",
    "salt",
    "pepper",
    "serving bowls",
    "croutons",
    "toasted bread"
  ],
  "tyn_section":[

  ]
}