{
  "title":"How to Make Vegan Cream of Nettle Soup",
  "url":"https://www.wikihow.com/Make-Vegan-Cream-of-Nettle-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan"
  ],
  "methods":[
    {
      "name":"Softening the Vegetables",
      "steps":[
        {
          "headline":"Melt the vegan butter in a large saucepan over medium heat.",
          "description":"You want the butter to melt, but you do not want it to brown."
        },
        {
          "headline":"Add the onion and garlic and sauté them in the butter until the onions are softened, stirring them occasionally with a wooden spoon.",
          "description":""
        },
        {
          "headline":"Add the nettles to the pot.",
          "description":""
        },
        {
          "headline":"Continue cooking the vegetables until the nettles have wilted.",
          "description":""
        }
      ]
    },
    {
      "name":"Adding the Cream",
      "steps":[
        {
          "headline":"Sprinkle the vegetables with the flour.",
          "description":""
        },
        {
          "headline":"Add 1/2 cup of the soy milk and stir the mixture well to assimilate the flour.",
          "description":""
        },
        {
          "headline":"Continue adding the soy milk in 1/2 cup increments and stirring until the soy milk and flour blend to form a creamy texture.",
          "description":""
        },
        {
          "headline":"Add the vegetable stock to your soup to thin out the cream.",
          "description":"Add 1/4 cup of liquid at a time to ensure that you don’t make the soup too thin."
        },
        {
          "headline":"Taste the soup and add salt and pepper in small increments until the soup is properly seasoned.",
          "description":""
        },
        {
          "headline":"Ladle the soup into bowls and serve it with a slice of bread spread with vegan butter.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Softening the Vegetables Melt the vegan butter in a large saucepan over medium heat. You want the butter to melt, but you do not want it to brown. Add the onion and garlic and sauté them in the butter until the onions are softened, stirring them occasionally with a wooden spoon.  Add the nettles to the pot.  Continue cooking the vegetables until the nettles have wilted.  Adding the Cream Sprinkle the vegetables with the flour.  Add 1/2 cup of the soy milk and stir the mixture well to assimilate the flour.  Continue adding the soy milk in 1/2 cup increments and stirring until the soy milk and flour blend to form a creamy texture.  Add the vegetable stock to your soup to thin out the cream. Add 1/4 cup of liquid at a time to ensure that you don’t make the soup too thin. Taste the soup and add salt and pepper in small increments until the soup is properly seasoned.  Ladle the soup into bowls and serve it with a slice of bread spread with vegan butter.  Finished. ",
  "tyn_model":[
    "flour",
    "soy milk",
    "vegan butter",
    "butter",
    "cream",
    "large saucepan",
    "onion",
    "garlic",
    "onions",
    "wooden spoon",
    "nettles",
    "pot",
    "vegetables",
    "vegetable stock",
    "salt",
    "pepper",
    "bread"
  ],
  "tyn_section":[

  ]
}