{
  "title":"How to Add an External Hard Drive to a PlayStation 3",
  "url":"https://www.wikihow.com/Add-an-External-Hard-Drive-to-a-PlayStation-3",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation 3"
  ],
  "parts":[
    {
      "name":"Formatting the Hard Drive on Windows",
      "steps":[
        {
          "headline":"Plug the hard drive into your computer.",
          "description":"You'll do this using the USB cable that came with your external hard drive. USB ports resemble thin, rectangular slots on your computer's casing."
        },
        {
          "headline":"Open the Start menu.",
          "description":"Do so either by clicking the Windows logo in the bottom-left corner of the screen, or by pressing the ⊞ Win key."
        },
        {
          "headline":"Type \"this pc\" into Start.",
          "description":"You should see a computer monitor-shaped icon appear at the top of the window."
        },
        {
          "headline":"Click This PC.",
          "description":"It's a monitor-shaped icon at the top of the Start window. Doing so opens the This PC app."
        },
        {
          "headline":"Right-click the hard drive's icon.",
          "description":"You'll typically see this in the middle of the page. On a laptop with a trackpad, use two fingers to tap the trackpad rather than right-clicking."
        },
        {
          "headline":"Click Properties.",
          "description":"It's at the bottom of the right-click drop-down menu."
        },
        {
          "headline":"Look at the \"File System\" value.",
          "description":"This option is near the top of the General tab of Properties. If the \"File System\" value says anything other than \"FAT32\", you'll need to reformat your drive. If the \"File System\" value does say \"FAT32\", skip forward to connecting your hard drive."
        },
        {
          "headline":"Close the Properties window.",
          "description":"Click the X in the top-right corner of the window to do so."
        },
        {
          "headline":"Right-click the external hard drive again, then click Format.",
          "description":"It's near the middle of the drop-down menu. Formatting your hard drive will erase any files on it."
        },
        {
          "headline":"Click the \"File System\" box.",
          "description":"It's directly below the \"File System\" heading. Doing so invokes a drop-down menu."
        },
        {
          "headline":"Click FAT32.",
          "description":"This is the file format you'll need in order to use your hard drive with your PS3."
        },
        {
          "headline":"Click Start, then click OK.",
          "description":"Doing so begins the formatting procedure. This process' length will vary depending on your computer's age and the drive's size."
        },
        {
          "headline":"Click OK when prompted.",
          "description":"You'll do so on the pop-up window letting you know that your hard drive has been formatted."
        },
        {
          "headline":"Double-click your external hard drive.",
          "description":"It should still be listed in the This PC window."
        },
        {
          "headline":"Create four folders in your hard drive.",
          "description":"To do so, either right-click the hard drive's window, select New, and click New Folder, or click Home at the top of the window and then click New Folder. The folders must be named exactly like so:\nMUSIC\nPHOTO\nGAME\nVIDEO"
        },
        {
          "headline":"Close This PC and remove your hard drive.",
          "description":"You are now ready to attach your external hard drive to your PS3. If you want to add music, photos, or videos to your hard drive before attaching it to your PlayStation 3, place them in the appropriate folders (e.g., music goes in the MUSIC folder)."
        }
      ]
    },
    {
      "name":"Formatting the Hard Drive on Mac",
      "steps":[
        {
          "headline":"Plug the hard drive into your computer.",
          "description":"You'll do this using the USB cable that came with your external hard drive. USB ports resemble thin, rectangular slots on your computer's casing. Some Mac computers don't have USB ports, although you can buy an adapter."
        },
        {
          "headline":"Open the Finder.",
          "description":"It's a blue, face-like app in your Mac's dock."
        },
        {
          "headline":"Use two fingers to click the hard drive's name.",
          "description":"It's on the left side of the Finder window. Doing so invokes a drop-down menu."
        },
        {
          "headline":"Click Get Info.",
          "description":"This option is in the middle of the drop-down menu."
        },
        {
          "headline":"Look at the \"Format\" value.",
          "description":"You'll see the \"Format\" heading in the General group of information. If the format here doesn't have \"FAT32\" listed, you must format your hard drive for PS3 compatibility before continuing. If the hard drive does have \"FAT32\" listed next to \"Format\", you can proceed with attaching your hard drive to your PS3."
        },
        {
          "headline":"Open Spotlight.",
          "description":"Click the magnifying glass icon in the top-right corner of your Mac's screen to do so."
        },
        {
          "headline":"Type disk utility into Spotlight.",
          "description":"Doing so will bring up a list of matching programs on your Mac."
        },
        {
          "headline":"Click Disk Utility.",
          "description":"It should be the top option in the Spotlight search results."
        },
        {
          "headline":"Click your hard drive's name.",
          "description":"It's in the left-hand sidebar."
        },
        {
          "headline":"Click the Erase tab.",
          "description":"This option is at the top of the Disk Utility window."
        },
        {
          "headline":"Click the \"Format\" box.",
          "description":"It's in the middle of the page."
        },
        {
          "headline":"Click FAT32.",
          "description":"This option is in the drop-down menu. Doing so will set your hard drive's format preference as FAT32, which is compatible with PS3 architecture. You may also need to add a name to your hard drive in the field below this one."
        },
        {
          "headline":"Click Erase.",
          "description":"It's at the bottom of the page. Doing so will erase and re-format your hard drive; when the process is done, you can exit the Disk Utility. Naturally, this will erase your hard drive. If you have any sensitive information on your hard drive, first copy it to your computer."
        },
        {
          "headline":"Open the Finder, then select your hard drive.",
          "description":"The hard drive's now-blank window will appear."
        },
        {
          "headline":"Create four folders in your hard drive.",
          "description":"To do so, either click File in the top-left side of the page and then click New Folder, or tap the trackpad with two fingers and then click New Folder. The folders must be named exactly like so:\nMUSIC\nPHOTO\nGAME\nVIDEO"
        },
        {
          "headline":"Remove your hard drive.",
          "description":"You're now ready to attach your hard drive to the PS3."
        }
      ]
    },
    {
      "name":"Adding the Hard Drive to the PS3",
      "steps":[
        {
          "headline":"Attach the hard drive to the PlayStation 3.",
          "description":"To do so, connect the hard drive's USB cable to the PS3's USB port. The PS3's USB ports are on the front side of the console."
        },
        {
          "headline":"Turn on the PS3 and an attached controller.",
          "description":"The easiest way to do this is by pressing the PS button on the controller. You can also press the power button on the PS3 and the controller individually."
        },
        {
          "headline":"Scroll left to select Settings.",
          "description":"It's near the far-left side of the PlayStation 3 menu."
        },
        {
          "headline":"Scroll down to select System Settings and press X.",
          "description":"It's near the bottom of the Settings menu."
        },
        {
          "headline":"Scroll down to select Backup Utility and press X.",
          "description":"This option is near the middle of the System Settings menu."
        },
        {
          "headline":"Select Back Up and press X.",
          "description":"It should be the first option on this page."
        },
        {
          "headline":"Select Yes when prompted, then press X.",
          "description":"This will take you to the hard drive selection page."
        },
        {
          "headline":"Select your hard drive's name, then press X.",
          "description":"Unless you have multiple USB drives connected, your hard drive should be the only option here. Doing so will back up your PS3's data to the hard drive. You can't run games off of the hard drive, but you can back up your existing game files to the hard drive and then delete the games from your PS3's internal drive to clear up space."
        }
      ]
    }
  ],
  "text":" Formatting the Hard Drive on Windows Plug the hard drive into your computer. You'll do this using the USB cable that came with your external hard drive. USB ports resemble thin, rectangular slots on your computer's casing. Open the Start menu. Do so either by clicking the Windows logo in the bottom-left corner of the screen, or by pressing the ⊞ Win key. Type \"this pc\" into Start. You should see a computer monitor-shaped icon appear at the top of the window. Click This PC. It's a monitor-shaped icon at the top of the Start window. Doing so opens the This PC app. Right-click the hard drive's icon. You'll typically see this in the middle of the page. On a laptop with a trackpad, use two fingers to tap the trackpad rather than right-clicking. Click Properties. It's at the bottom of the right-click drop-down menu. Look at the \"File System\" value. This option is near the top of the General tab of Properties. If the \"File System\" value says anything other than \"FAT32\", you'll need to reformat your drive. If the \"File System\" value does say \"FAT32\", skip forward to connecting your hard drive. Close the Properties window. Click the X in the top-right corner of the window to do so. Right-click the external hard drive again, then click Format. It's near the middle of the drop-down menu. Formatting your hard drive will erase any files on it. Click the \"File System\" box. It's directly below the \"File System\" heading. Doing so invokes a drop-down menu. Click FAT32. This is the file format you'll need in order to use your hard drive with your PS3. Click Start, then click OK. Doing so begins the formatting procedure. This process' length will vary depending on your computer's age and the drive's size. Click OK when prompted. You'll do so on the pop-up window letting you know that your hard drive has been formatted. Double-click your external hard drive. It should still be listed in the This PC window. Create four folders in your hard drive. To do so, either right-click the hard drive's window, select New, and click New Folder, or click Home at the top of the window and then click New Folder. The folders must be named exactly like so:\nMUSIC\nPHOTO\nGAME\nVIDEO Close This PC and remove your hard drive. You are now ready to attach your external hard drive to your PS3. If you want to add music, photos, or videos to your hard drive before attaching it to your PlayStation 3, place them in the appropriate folders (e.g., music goes in the MUSIC folder). Formatting the Hard Drive on Mac Plug the hard drive into your computer. You'll do this using the USB cable that came with your external hard drive. USB ports resemble thin, rectangular slots on your computer's casing. Some Mac computers don't have USB ports, although you can buy an adapter. Open the Finder. It's a blue, face-like app in your Mac's dock. Use two fingers to click the hard drive's name. It's on the left side of the Finder window. Doing so invokes a drop-down menu. Click Get Info. This option is in the middle of the drop-down menu. Look at the \"Format\" value. You'll see the \"Format\" heading in the General group of information. If the format here doesn't have \"FAT32\" listed, you must format your hard drive for PS3 compatibility before continuing. If the hard drive does have \"FAT32\" listed next to \"Format\", you can proceed with attaching your hard drive to your PS3. Open Spotlight. Click the magnifying glass icon in the top-right corner of your Mac's screen to do so. Type disk utility into Spotlight. Doing so will bring up a list of matching programs on your Mac. Click Disk Utility. It should be the top option in the Spotlight search results. Click your hard drive's name. It's in the left-hand sidebar. Click the Erase tab. This option is at the top of the Disk Utility window. Click the \"Format\" box. It's in the middle of the page. Click FAT32. This option is in the drop-down menu. Doing so will set your hard drive's format preference as FAT32, which is compatible with PS3 architecture. You may also need to add a name to your hard drive in the field below this one. Click Erase. It's at the bottom of the page. Doing so will erase and re-format your hard drive; when the process is done, you can exit the Disk Utility. Naturally, this will erase your hard drive. If you have any sensitive information on your hard drive, first copy it to your computer. Open the Finder, then select your hard drive. The hard drive's now-blank window will appear. Create four folders in your hard drive. To do so, either click File in the top-left side of the page and then click New Folder, or tap the trackpad with two fingers and then click New Folder. The folders must be named exactly like so:\nMUSIC\nPHOTO\nGAME\nVIDEO Remove your hard drive. You're now ready to attach your hard drive to the PS3. Adding the Hard Drive to the PS3 Attach the hard drive to the PlayStation 3. To do so, connect the hard drive's USB cable to the PS3's USB port. The PS3's USB ports are on the front side of the console. Turn on the PS3 and an attached controller. The easiest way to do this is by pressing the PS button on the controller. You can also press the power button on the PS3 and the controller individually. Scroll left to select Settings. It's near the far-left side of the PlayStation 3 menu. Scroll down to select System Settings and press X. It's near the bottom of the Settings menu. Scroll down to select Backup Utility and press X. This option is near the middle of the System Settings menu. Select Back Up and press X. It should be the first option on this page. Select Yes when prompted, then press X. This will take you to the hard drive selection page. Select your hard drive's name, then press X. Unless you have multiple USB drives connected, your hard drive should be the only option here. Doing so will back up your PS3's data to the hard drive. You can't run games off of the hard drive, but you can back up your existing game files to the hard drive and then delete the games from your PS3's internal drive to clear up space.",
  "tyn_model":[
    "hard drive",
    "playstation 3",
    "finder",
    "mac",
    "disk utility",
    "usb cable",
    "ps3",
    "usb ports",
    "⊞ win",
    "laptop",
    "external hard drive",
    "pc",
    "usb",
    "spotlight",
    "magnifying glass",
    "console"
  ],
  "tyn_section":[

  ]
}