{
  "title":"How to Make a Photo Calendar with Snapfish",
  "url":"https://www.wikihow.com/Make-a-Photo-Calendar-with-Snapfish",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Digital Technology Art and Craft Projects"
  ],
  "steps":[
    {
      "headline":"Go on a photo sharing website such as Snapfish and create an account.",
      "description":"You will need an account if you wish to upload photos and purchase products."
    },
    {
      "headline":"Upload Pictures to your photo sharing website.",
      "description":"There should be a button that says upload once you have logged into your account. Choose pictures that you want to upload to make your calendar. If you want, you can choose pictures from an event or trip, or just any pictures you like. You can choose multiple pictures because most calendars can have multiple pictures on one page."
    },
    {
      "headline":"Go to 'projects' where you will find a button titled \"New Projects\"  Click this button and you will have a list of options.",
      "description":"Click \"Calendar\" and it will direct you to a page with different types of calendars. They all have different styles, but choose the one you want to make."
    },
    {
      "headline":"Pick the design of your calendar.",
      "description":"There are different designs available. Some are for holidays, while others are solid colors or patterns. Choose one that you like, or would go well with the pictures. For example, if you are making a calendar with lots of summer photos, do not choose a background with Christmas designs."
    },
    {
      "headline":"Choose the size you would like, and the month you would like it to begin in.",
      "description":"Remember that larger calendars will be more expensive than small ones. When you are done, click \"create\""
    },
    {
      "headline":"Click on the button \"get photos\"  You will be able to choose which photos you want to use in the photo book.",
      "description":"Remember, you can only use pictures you have uploaded to Snapfish. If you need to upload more, you can now."
    },
    {
      "headline":"Choose layouts and backgrounds for each page.",
      "description":"Use the tabs at the bottom of the page to switch between layouts and backgrounds. Play around with different styles."
    },
    {
      "headline":"When you finish adding pictures and captions to your Calendar, click the order button at the bottom of the screen.",
      "description":"To buy the calendar, click the button \"add to cart\""
    },
    {
      "headline":"A message will pop up asking if you want to proceed to checkout.",
      "description":"Click yes unless you are going to buy something else. Click yes on the checkout screen to buy the calendar. Enter your shipping and billing information to finish."
    }
  ],
  "text":" Go on a photo sharing website such as Snapfish and create an account. You will need an account if you wish to upload photos and purchase products. Upload Pictures to your photo sharing website. There should be a button that says upload once you have logged into your account. Choose pictures that you want to upload to make your calendar. If you want, you can choose pictures from an event or trip, or just any pictures you like. You can choose multiple pictures because most calendars can have multiple pictures on one page. Go to 'projects' where you will find a button titled \"New Projects\"  Click this button and you will have a list of options. Click \"Calendar\" and it will direct you to a page with different types of calendars. They all have different styles, but choose the one you want to make. Pick the design of your calendar. There are different designs available. Some are for holidays, while others are solid colors or patterns. Choose one that you like, or would go well with the pictures. For example, if you are making a calendar with lots of summer photos, do not choose a background with Christmas designs. Choose the size you would like, and the month you would like it to begin in. Remember that larger calendars will be more expensive than small ones. When you are done, click \"create\" Click on the button \"get photos\"  You will be able to choose which photos you want to use in the photo book. Remember, you can only use pictures you have uploaded to Snapfish. If you need to upload more, you can now. Choose layouts and backgrounds for each page. Use the tabs at the bottom of the page to switch between layouts and backgrounds. Play around with different styles. When you finish adding pictures and captions to your Calendar, click the order button at the bottom of the screen. To buy the calendar, click the button \"add to cart\" A message will pop up asking if you want to proceed to checkout. Click yes unless you are going to buy something else. Click yes on the checkout screen to buy the calendar. Enter your shipping and billing information to finish.",
  "tyn_model":[
    "calendar",
    "calendars",
    "photo sharing website such as",
    "photo sharing website",
    "photo book",
    "snapfish."
  ],
  "tyn_section":[

  ]
}