{
  "title":"How to Make Palak Paneer",
  "url":"https://www.wikihow.com/Make-Palak-Paneer",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Vegetarian Indian Dishes"
  ],
  "methods":[
    {
      "name":"Making Palak Paneer",
      "steps":[
        {
          "headline":"Clean the spinach, then drop it in boiling water for 2 minutes.",
          "description":"Blanching the spinach quickly cooks it while leaving the bright, attractive color intact. Once the water is boiling in a big saucepot, drop the spinach in and stir it once. After two minutes, remove it and drain off the boiling water. Add a tablespoon of salt to the water, like making pasta, for stronger flavored spinach. The timing here is important. Do not leave the spinach on for more than 3 minutes."
        },
        {
          "headline":"As soon as the spinach comes off the heat, rinse it in cold water for 1 minute.",
          "description":"This immediately removes the heat from the spinach, halting the cooking process to keep the spinach nice and green."
        },
        {
          "headline":"Drain the water, then blend the spinach into a smooth puree.",
          "description":"Some people like a few chunks of spinach in their dish, while others want a completely smooth green curry. You can blend the spinach for as long as you want to get your desired consistency. If you didn't salt the water when blanching, add a pinch of salt now."
        },
        {
          "headline":"In a large saucepan, heat the ghee until melted and add the chopped onion.",
          "description":"Turn the stove on medium and plop in a tablespoon of ghee. Chop one large onion finely and get it cooking once the oil is hot. Add a pinch of salt as soon as the onions hit the pan, and stir occasionally to prevent burning."
        },
        {
          "headline":"After 1-2 minutes, add 4-5 cloves minced garlic, 2-3 chopped green chilis, and 1 tablespoon finely minced ginger.",
          "description":"Add them to the onions shortly after they start cooking, then stir well to make sure everything is coated. Cook for 2-3 minutes, until the raw smell is gone and the onions are starting to turn clear."
        },
        {
          "headline":"Toss in any of your desired spices or tomatoes, if desired.",
          "description":"Some recipes call for one can of crushed tomatoes, or freshly cut tomatoes, and some Indian chefs like to spice their curry with a few different flavors. If you want a simple, but still delicious curry, just move on. If you're a little more adventurous, now is the time to add the following ingredients. Cook for about a minute, stirring constantly. 1 12oz can crushed red tomatoes OR 1 cup chopped cherry tomatoes. 1 teaspoon dry fenugreek leaves (sold sometimes as \"kasuri methi; highly recommended)\n\n1/2 teaspoon crushed red pepper and/or cayenne\n1/2 teaspoon turmeric and/or ground cumin\n1/4 teaspoon ground cardamon"
        },
        {
          "headline":"Add the spinach puree, 3-4 tablespoons milk or heavy cream, and cook for 2 minutes.",
          "description":"Keep the heat on medium and add in your spinach mixture. The cream or milk will help cut some of the spice and lead to a richer, fuller dish, but you could also use coconut milk, water, or chicken stock for a lighter dish. The mixture should be brought to a light simmer, with small bubbles breaking the surface."
        },
        {
          "headline":"Add salt, pepper, and garam masala to taste.",
          "description":"This is the point where you should be sampling heavily. If it tastes great, leave it alone as it cooks. More likely than not, you'll want to play with the seasonings, and garam masala is highly recommended to get a subtle, rich, and restaurant-quality taste."
        },
        {
          "headline":"Add the paneer cubes and stir, cooking together for 2-3 minutes before serving.",
          "description":"The paneer just needs to get hot, and the dish is ready to serve. For an even tastier dish, fry the paneer cubes until the edges are golden brown in a separate dish, cooking them in a little bit of ghee or olive oil. Then toss them in the paneer for 2-3 minutes and serve!"
        }
      ]
    },
    {
      "name":"Making Homemade Paneer (Cheese)",
      "steps":[
        {
          "headline":"Bring half a gallon of whole milk to a simmer over medium heat.",
          "description":"Use a medium sized saucepan, stirring occasionally and making sure there is no burning or scalding on the bottom. Make sure you do not use UHT pasteurized milk. This milk won't curdle, meaning it cannot be used to make paneer. For a slightly healthier but less rich paneer, you can use 2% milk. Do not use 1% or skim, however, as they both struggle to curdle correctly. You do not want the milk to boil. If you have a thermometer, you want it around 190-200°F"
        },
        {
          "headline":"When the milk is foamy and steamy, add 1/4 of lemon juice and remove from the heat.",
          "description":"The acid in the lemon will actually break down the milk and cause it to curdle, which allows it to form solids. You can also use 1/4 cup of white vinegar, in place of lemon, though it will have a slightly different taste."
        },
        {
          "headline":"Stir in the lemon juice and let the mixture sit, undisturbed, for 10 minutes.",
          "description":"This will let the acid do its work, and by the end of the 10 minutes the milk should look watery and yellow. If it doesn't, add another tablespoon of lemon juice or vinegar and wait an extra 2-3 minutes. If it still doesn't curdle, you're likely using UHT pasteurized milk."
        },
        {
          "headline":"Line a strainer with cheesecloth and place the curdles in, squeezing the excess liquid out.",
          "description":"Once the majority of water has drained out the bottom of the colander or strainer, wrap the cheesecloth around the curds and press down to squeeze out any extra water. A gently, slow, but firm squeeze should get out any last bits of whey. For added flavor, salt the paneer after you're done with a 1/2 teaspoon of salt."
        },
        {
          "headline":"Gather the paneer curds in the cheese cloth and press into a rough square on a cutting board.",
          "description":"Pull the cheese cloth out of the strainer and use it to mold the paneer inside it into a block. It should only take some gentle pressing and shaping to get a rough cube."
        },
        {
          "headline":"Place a flat plate on your paneer cube and weight it down, pressing it for 20-60 minutes.",
          "description":"A couple of large books, a mixing bowl filled with water, or a cast-iron pan should be heavy enough to press the cheese out. This will remove any last liquid and form the dense, delicious cheese cubes that will make your Palak Paneer really stand out on the table. Once it is done pressing, cut and serve. You can keep paneer in the refrigerator for up to four days after making it."
        }
      ]
    }
  ],
  "text":" Making Palak Paneer Clean the spinach, then drop it in boiling water for 2 minutes. Blanching the spinach quickly cooks it while leaving the bright, attractive color intact. Once the water is boiling in a big saucepot, drop the spinach in and stir it once. After two minutes, remove it and drain off the boiling water. Add a tablespoon of salt to the water, like making pasta, for stronger flavored spinach. The timing here is important. Do not leave the spinach on for more than 3 minutes. As soon as the spinach comes off the heat, rinse it in cold water for 1 minute. This immediately removes the heat from the spinach, halting the cooking process to keep the spinach nice and green. Drain the water, then blend the spinach into a smooth puree. Some people like a few chunks of spinach in their dish, while others want a completely smooth green curry. You can blend the spinach for as long as you want to get your desired consistency. If you didn't salt the water when blanching, add a pinch of salt now. In a large saucepan, heat the ghee until melted and add the chopped onion. Turn the stove on medium and plop in a tablespoon of ghee. Chop one large onion finely and get it cooking once the oil is hot. Add a pinch of salt as soon as the onions hit the pan, and stir occasionally to prevent burning. After 1-2 minutes, add 4-5 cloves minced garlic, 2-3 chopped green chilis, and 1 tablespoon finely minced ginger. Add them to the onions shortly after they start cooking, then stir well to make sure everything is coated. Cook for 2-3 minutes, until the raw smell is gone and the onions are starting to turn clear. Toss in any of your desired spices or tomatoes, if desired. Some recipes call for one can of crushed tomatoes, or freshly cut tomatoes, and some Indian chefs like to spice their curry with a few different flavors. If you want a simple, but still delicious curry, just move on. If you're a little more adventurous, now is the time to add the following ingredients. Cook for about a minute, stirring constantly. 1 12oz can crushed red tomatoes OR 1 cup chopped cherry tomatoes. 1 teaspoon dry fenugreek leaves (sold sometimes as \"kasuri methi; highly recommended)\n\n1/2 teaspoon crushed red pepper and/or cayenne\n1/2 teaspoon turmeric and/or ground cumin\n1/4 teaspoon ground cardamon Add the spinach puree, 3-4 tablespoons milk or heavy cream, and cook for 2 minutes. Keep the heat on medium and add in your spinach mixture. The cream or milk will help cut some of the spice and lead to a richer, fuller dish, but you could also use coconut milk, water, or chicken stock for a lighter dish. The mixture should be brought to a light simmer, with small bubbles breaking the surface. Add salt, pepper, and garam masala to taste. This is the point where you should be sampling heavily. If it tastes great, leave it alone as it cooks. More likely than not, you'll want to play with the seasonings, and garam masala is highly recommended to get a subtle, rich, and restaurant-quality taste. Add the paneer cubes and stir, cooking together for 2-3 minutes before serving. The paneer just needs to get hot, and the dish is ready to serve. For an even tastier dish, fry the paneer cubes until the edges are golden brown in a separate dish, cooking them in a little bit of ghee or olive oil. Then toss them in the paneer for 2-3 minutes and serve! Making Homemade Paneer (Cheese) Bring half a gallon of whole milk to a simmer over medium heat. Use a medium sized saucepan, stirring occasionally and making sure there is no burning or scalding on the bottom. Make sure you do not use UHT pasteurized milk. This milk won't curdle, meaning it cannot be used to make paneer. For a slightly healthier but less rich paneer, you can use 2% milk. Do not use 1% or skim, however, as they both struggle to curdle correctly. You do not want the milk to boil. If you have a thermometer, you want it around 190-200°F When the milk is foamy and steamy, add 1/4 of lemon juice and remove from the heat. The acid in the lemon will actually break down the milk and cause it to curdle, which allows it to form solids. You can also use 1/4 cup of white vinegar, in place of lemon, though it will have a slightly different taste. Stir in the lemon juice and let the mixture sit, undisturbed, for 10 minutes. This will let the acid do its work, and by the end of the 10 minutes the milk should look watery and yellow. If it doesn't, add another tablespoon of lemon juice or vinegar and wait an extra 2-3 minutes. If it still doesn't curdle, you're likely using UHT pasteurized milk. Line a strainer with cheesecloth and place the curdles in, squeezing the excess liquid out. Once the majority of water has drained out the bottom of the colander or strainer, wrap the cheesecloth around the curds and press down to squeeze out any extra water. A gently, slow, but firm squeeze should get out any last bits of whey. For added flavor, salt the paneer after you're done with a 1/2 teaspoon of salt. Gather the paneer curds in the cheese cloth and press into a rough square on a cutting board. Pull the cheese cloth out of the strainer and use it to mold the paneer inside it into a block. It should only take some gentle pressing and shaping to get a rough cube. Place a flat plate on your paneer cube and weight it down, pressing it for 20-60 minutes. A couple of large books, a mixing bowl filled with water, or a cast-iron pan should be heavy enough to press the cheese out. This will remove any last liquid and form the dense, delicious cheese cubes that will make your Palak Paneer really stand out on the table. Once it is done pressing, cut and serve. You can keep paneer in the refrigerator for up to four days after making it.",
  "tyn_model":[
    "water",
    "paneer",
    "milk",
    "spinach",
    "salt",
    "ghee",
    "onions",
    "lemon",
    "strainer",
    "tomatoes",
    "garam masala",
    "lemon juice",
    "cheesecloth",
    "cheese cloth",
    "palak paneer",
    "green curry",
    "large saucepan",
    "onion",
    "stove",
    "oil",
    "garlic",
    "green chilis",
    "ginger",
    "spices",
    "crushed tomatoes",
    "crushed red tomatoes",
    "cherry tomatoes",
    "fenugreek leaves",
    "crushed red pepper",
    "cayenne",
    "turmeric",
    "cumin",
    "cardamon",
    "spinach puree",
    "heavy cream",
    "cream",
    "coconut milk",
    "chicken stock",
    "pepper",
    "seasonings",
    "olive oil",
    "cheese",
    "whole milk",
    "saucepan",
    "white vinegar",
    "vinegar",
    "uht pasteurized milk",
    "colander",
    "cutting board",
    "flat plate",
    "mixing bowl",
    "cast-iron pan",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}