{
  "title":"How to Make Deviled Egg \"Chicks\"",
  "url":"https://www.wikihow.com/Make-Deviled-Egg-%22Chicks%22",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy"
  ],
  "steps":[
    {
      "headline":"Decide if you want white chicks(easy, and no food coloring is involved) or colored chicks.",
      "description":""
    },
    {
      "headline":"Boil your eggs.",
      "description":""
    },
    {
      "headline":"If you want colored eggs, set up your food coloring baths while the eggs are boiling.",
      "description":"Follow the manufacturer's instructions. Most food colorings available will call for a ratio of 1 tsp of vinegar to 20 or so drops of liquid food coloring mixed into half a cup or so of hot water."
    },
    {
      "headline":"Cool the cooked eggs and peel them.",
      "description":""
    },
    {
      "headline":"Dye the eggs by dipping them into the food coloring bath.",
      "description":"(skip this step if you are after white \"chicks\"."
    },
    {
      "headline":"Cut the wide end of the egg flat.",
      "description":""
    },
    {
      "headline":"Set the egg up on end.",
      "description":""
    },
    {
      "headline":"Cut the \"crack\" in the shell.",
      "description":"You can be as creative here as you like... straight? jagged? Cut with a garnish knife? Up to you."
    },
    {
      "headline":"Remove the yolk(s) and set them aside to make the filling.",
      "description":""
    },
    {
      "headline":"Set the (now hollow) eggs aside and make your egg filling.",
      "description":"The simplest deviled egg recipes call for mashing up the yolks with some mayonnaise and mustard. You may use any recipe you like so long as the result is a smooth, easily Pip able, paste the consistency of cake icing."
    },
    {
      "headline":"Pipe the filling into each of the hollow eggs, taking care to mound it up over the egg to simulate a small chick hatching.",
      "description":""
    },
    {
      "headline":"Add shredded carrot \"beaks\".",
      "description":""
    },
    {
      "headline":"Add peppercorn or round pieces of olive cut out with a drinking straw for \"eyes\".",
      "description":""
    },
    {
      "headline":"Place the top of the egg back on the egg, making it appear as if it is a cap of shell the \"chick\" is pushing up.",
      "description":""
    },
    {
      "headline":"Show off your handiwork to your friends!",
      "description":""
    }
  ],
  "text":" Decide if you want white chicks(easy, and no food coloring is involved) or colored chicks.  Boil your eggs.  If you want colored eggs, set up your food coloring baths while the eggs are boiling. Follow the manufacturer's instructions. Most food colorings available will call for a ratio of 1 tsp of vinegar to 20 or so drops of liquid food coloring mixed into half a cup or so of hot water. Cool the cooked eggs and peel them.  Dye the eggs by dipping them into the food coloring bath. (skip this step if you are after white \"chicks\". Cut the wide end of the egg flat.  Set the egg up on end.  Cut the \"crack\" in the shell. You can be as creative here as you like... straight? jagged? Cut with a garnish knife? Up to you. Remove the yolk(s) and set them aside to make the filling.  Set the (now hollow) eggs aside and make your egg filling. The simplest deviled egg recipes call for mashing up the yolks with some mayonnaise and mustard. You may use any recipe you like so long as the result is a smooth, easily Pip able, paste the consistency of cake icing. Pipe the filling into each of the hollow eggs, taking care to mound it up over the egg to simulate a small chick hatching.  Add shredded carrot \"beaks\".  Add peppercorn or round pieces of olive cut out with a drinking straw for \"eyes\".  Place the top of the egg back on the egg, making it appear as if it is a cap of shell the \"chick\" is pushing up.  Show off your handiwork to your friends! ",
  "tyn_model":[
    "food coloring",
    "eggs",
    "food colorings",
    "vinegar",
    "hot water",
    "garnish knife",
    "deviled egg",
    "mayonnaise",
    "mustard",
    "cake icing",
    "egg"
  ],
  "tyn_section":[

  ]
}