{
  "title":"How to Make Ink from Walnut Shells",
  "url":"https://www.wikihow.com/Make-Ink-from-Walnut-Shells",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts"
  ],
  "steps":[
    {
      "headline":"Collect walnuts that are black, old, and wrinkled.",
      "description":"If you can't find old walnuts, then put young ones in a pot outside (with a lid) for a couple months, or until they start to age."
    },
    {
      "headline":"Place about a dozen walnuts in a boiling pot; this depends upon how much ink you want and how thick you want it to be.",
      "description":""
    },
    {
      "headline":"Put some water in the pot along with the walnuts.",
      "description":""
    },
    {
      "headline":"Simmer all the ingredients well (about 8 hours), and soak for another 16.",
      "description":"The water should turn dark brown and the husks should become soft."
    },
    {
      "headline":"Scrape the husks from the shells until you have a mixture with a soil-like texture.",
      "description":""
    },
    {
      "headline":"Add more water and simmer until the mixture is a rich brown color, and is nice and thick like ink.",
      "description":""
    },
    {
      "headline":"Once you have the color you like, strain out all the thick or large chunks of the shells.",
      "description":""
    },
    {
      "headline":"The ink should be a golden brown.",
      "description":"Add to an ink pot or another holding container."
    },
    {
      "headline":"Ink is ready to use.",
      "description":""
    }
  ],
  "text":" Collect walnuts that are black, old, and wrinkled. If you can't find old walnuts, then put young ones in a pot outside (with a lid) for a couple months, or until they start to age. Place about a dozen walnuts in a boiling pot; this depends upon how much ink you want and how thick you want it to be.  Put some water in the pot along with the walnuts.  Simmer all the ingredients well (about 8 hours), and soak for another 16. The water should turn dark brown and the husks should become soft. Scrape the husks from the shells until you have a mixture with a soil-like texture.  Add more water and simmer until the mixture is a rich brown color, and is nice and thick like ink.  Once you have the color you like, strain out all the thick or large chunks of the shells.  The ink should be a golden brown. Add to an ink pot or another holding container. Ink is ready to use. ",
  "tyn_model":[
    "walnuts",
    "water",
    "pot",
    "boiling pot",
    "ink pot",
    "ink"
  ],
  "tyn_section":[

  ]
}