{
  "title":"How to Cross Pollinate Different Vegetables to Create Hybrids",
  "url":"https://www.wikihow.com/Cross-Pollinate-Different-Vegetables-to-Create-Hybrids",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Plant Propagation Techniques"
  ],
  "parts":[
    {
      "name":"Choosing Vegetables to Hybridize",
      "steps":[
        {
          "headline":"Choose a single botanical species.",
          "description":"Generally, you can only cross-pollinate vegetables that are part of the same botanical species. Pick a single botanical species to focus on. Otherwise, your cross-pollination won't work. You can get lists of botanical species online, from gardening and botany books, and from your local gardening store. For example, you can cross-pollinate an acorn squash and a spaghetti squash because they belong to the same botanical species, “C. pepo.” But a butternut squash belongs to the botanical species “C. moschata,” so you can't cross-pollinate it with an acorn squash."
        },
        {
          "headline":"Decide what qualities you want your hybrid to have.",
          "description":"Hybrid vegetables can be unpredictable, but if you know what general qualities you want your hybrid to have, it will be easier to choose your subspecies. If you love very hot peppers but you'd like them to be bigger, start thinking about which peppers in your botanical species are the hottest and which are the biggest."
        },
        {
          "headline":"Pick two subspecies to hybridize.",
          "description":"Choose two subspecies that combine the qualities you want. Think about the disadvantages of each subspecies too--your hybrid vegetable might have them! For example, you can try crossing bell peppers with cayenne peppers for a larger, milder pepper that still has some heat."
        }
      ]
    },
    {
      "name":"Cross-Pollinating",
      "steps":[
        {
          "headline":"Identify male and female flowers.",
          "description":"You'll need a male flower from one subspecies and a female flower from another. Male flowers have a stamen, which looks like a long stalk growing out of the center of the flower. Female flowers have a pistil, which looks like a small bulb in the center. Some flowers have both male and female organs. If your subspecies has these, you can just use any flower from them."
        },
        {
          "headline":"Wait until both subspecies are flowering.",
          "description":"You can only cross-pollinate when both of your chosen subspecies have flowers. Otherwise, you'll be missing vital reproductive parts and you won't be able to cross-pollinate. If your subspecies don't flower at the same time, you can save male pollen in small, airtight containers. Simply shake or rub the stamen of the flower over the container. However, if they flower at very different times of the year, you may not be able to grow viable seeds from your hybrids."
        },
        {
          "headline":"Cut a male flower from one subspecies.",
          "description":"Cut about 1 inch (25 mm) from the base of the flower. Be sure you are cutting the male flower--you won't be able to cross-pollinate if the female is removed and the male stays on the plant. It's okay if you accidentally cut off a female flower. As long as there's another flower on the same plant, cross-pollination will still work. If you already have two subspecies growing close together, you can cross-pollinate without cutting the male flower off. Cross-pollination might even happen naturally!"
        },
        {
          "headline":"Rub the male flower's pollen on a female flower from another subspecies.",
          "description":"The pollen in a male flower is at the top of the stamen. Rub the stamen into the other flower's pistil until you are sure some of the pollen is inside the other flower. It's okay if the stamen breaks."
        },
        {
          "headline":"Repeat until all your plants are cross-pollinated.",
          "description":"Hybrids can be unpredictable, so it's best to cross-pollinate a few plants to make sure you have a wide variety of vegetables to choose from. Depending on what you're growing and the amount of space you have, you may want to cross-pollinate two or three plants, or more than a hundred!"
        },
        {
          "headline":"Wait for the vegetables to ripen.",
          "description":"The female plant will start to grow vegetables that have half the genetic material of the male subspecies. Wait until the vegetables are fully ripe to pick them--you won't get the full effect otherwise. Growing and ripening time will depend on the subspecies you choose. If none of your plants grow vegetables after cross-pollination, you may have chosen two different species, or your hybrid may not be viable. Try again with a different set of subspecies."
        },
        {
          "headline":"Taste your hybrid vegetables.",
          "description":"When your vegetables are ripe, taste them to see if they turned out the way you hoped. If they did, it's time to prepare to save the seeds for next year. It's very common for hybrids to have unpredictable results, so don't be discouraged if you didn't like them. Just try again next year!"
        }
      ]
    },
    {
      "name":"Planting Your Hybrid Seeds",
      "steps":[
        {
          "headline":"Pick the best vegetables for seed-saving.",
          "description":"Don't save the seeds from every single vegetable you grew. Otherwise, weaker or undesirable genes can be passed on. Pick a few standout examples and save only their seeds. This can be the ones that tasted the best, resisted bugs the best, or simply looked the prettiest."
        },
        {
          "headline":"Cut open your ripe vegetables.",
          "description":"Cut your vegetables open to get to the seeds. If you don't know where the seeds are, check online or in a gardening book before cutting so you don't damage the seeds."
        },
        {
          "headline":"Remove the seeds from the vegetables.",
          "description":"Gently pull or cut the seeds out from your vegetable. For some plants, like beans, the seeds will be very easy to spot. Others, like carrots, may be more difficult, because their seeds are extremely small and are located on the tops of the plants. Be sure you've removed all the seeds before eating or throwing away the rest of the vegetable."
        },
        {
          "headline":"Spread the seeds out to dry for about one week.",
          "description":"Spread the seeds out on a paper towel or cloth surface and let them dry for about a week. Dry them indoors, in a warm part of the house. If you dry them outside, birds and animals might eat them."
        },
        {
          "headline":"Store the seeds in a dry place.",
          "description":"Once your seeds are dry, put them in a container and store them somewhere dry until it's time to plant them. You can use any material as long as the seeds are kept safe from moisture."
        },
        {
          "headline":"Plant the seeds at the right time of year.",
          "description":"When it's planting time for your botanical species, plant the hybrid seeds in the environment that suits your species best. If your two subspecies have very different planting times or conditions, talk to a gardening specialist or research online before planting. Save about a quarter of your seeds in case the crop fails!"
        }
      ]
    }
  ],
  "text":" Choosing Vegetables to Hybridize Choose a single botanical species. Generally, you can only cross-pollinate vegetables that are part of the same botanical species. Pick a single botanical species to focus on. Otherwise, your cross-pollination won't work. You can get lists of botanical species online, from gardening and botany books, and from your local gardening store. For example, you can cross-pollinate an acorn squash and a spaghetti squash because they belong to the same botanical species, “C. pepo.” But a butternut squash belongs to the botanical species “C. moschata,” so you can't cross-pollinate it with an acorn squash. Decide what qualities you want your hybrid to have. Hybrid vegetables can be unpredictable, but if you know what general qualities you want your hybrid to have, it will be easier to choose your subspecies. If you love very hot peppers but you'd like them to be bigger, start thinking about which peppers in your botanical species are the hottest and which are the biggest. Pick two subspecies to hybridize. Choose two subspecies that combine the qualities you want. Think about the disadvantages of each subspecies too--your hybrid vegetable might have them! For example, you can try crossing bell peppers with cayenne peppers for a larger, milder pepper that still has some heat. Cross-Pollinating Identify male and female flowers. You'll need a male flower from one subspecies and a female flower from another. Male flowers have a stamen, which looks like a long stalk growing out of the center of the flower. Female flowers have a pistil, which looks like a small bulb in the center. Some flowers have both male and female organs. If your subspecies has these, you can just use any flower from them. Wait until both subspecies are flowering. You can only cross-pollinate when both of your chosen subspecies have flowers. Otherwise, you'll be missing vital reproductive parts and you won't be able to cross-pollinate. If your subspecies don't flower at the same time, you can save male pollen in small, airtight containers. Simply shake or rub the stamen of the flower over the container. However, if they flower at very different times of the year, you may not be able to grow viable seeds from your hybrids. Cut a male flower from one subspecies. Cut about 1 inch (25 mm) from the base of the flower. Be sure you are cutting the male flower--you won't be able to cross-pollinate if the female is removed and the male stays on the plant. It's okay if you accidentally cut off a female flower. As long as there's another flower on the same plant, cross-pollination will still work. If you already have two subspecies growing close together, you can cross-pollinate without cutting the male flower off. Cross-pollination might even happen naturally! Rub the male flower's pollen on a female flower from another subspecies. The pollen in a male flower is at the top of the stamen. Rub the stamen into the other flower's pistil until you are sure some of the pollen is inside the other flower. It's okay if the stamen breaks. Repeat until all your plants are cross-pollinated. Hybrids can be unpredictable, so it's best to cross-pollinate a few plants to make sure you have a wide variety of vegetables to choose from. Depending on what you're growing and the amount of space you have, you may want to cross-pollinate two or three plants, or more than a hundred! Wait for the vegetables to ripen. The female plant will start to grow vegetables that have half the genetic material of the male subspecies. Wait until the vegetables are fully ripe to pick them--you won't get the full effect otherwise. Growing and ripening time will depend on the subspecies you choose. If none of your plants grow vegetables after cross-pollination, you may have chosen two different species, or your hybrid may not be viable. Try again with a different set of subspecies. Taste your hybrid vegetables. When your vegetables are ripe, taste them to see if they turned out the way you hoped. If they did, it's time to prepare to save the seeds for next year. It's very common for hybrids to have unpredictable results, so don't be discouraged if you didn't like them. Just try again next year! Planting Your Hybrid Seeds Pick the best vegetables for seed-saving. Don't save the seeds from every single vegetable you grew. Otherwise, weaker or undesirable genes can be passed on. Pick a few standout examples and save only their seeds. This can be the ones that tasted the best, resisted bugs the best, or simply looked the prettiest. Cut open your ripe vegetables. Cut your vegetables open to get to the seeds. If you don't know where the seeds are, check online or in a gardening book before cutting so you don't damage the seeds. Remove the seeds from the vegetables. Gently pull or cut the seeds out from your vegetable. For some plants, like beans, the seeds will be very easy to spot. Others, like carrots, may be more difficult, because their seeds are extremely small and are located on the tops of the plants. Be sure you've removed all the seeds before eating or throwing away the rest of the vegetable. Spread the seeds out to dry for about one week. Spread the seeds out on a paper towel or cloth surface and let them dry for about a week. Dry them indoors, in a warm part of the house. If you dry them outside, birds and animals might eat them. Store the seeds in a dry place. Once your seeds are dry, put them in a container and store them somewhere dry until it's time to plant them. You can use any material as long as the seeds are kept safe from moisture. Plant the seeds at the right time of year. When it's planting time for your botanical species, plant the hybrid seeds in the environment that suits your species best. If your two subspecies have very different planting times or conditions, talk to a gardening specialist or research online before planting. Save about a quarter of your seeds in case the crop fails!",
  "tyn_model":[
    "vegetables",
    "“c.",
    "peppers",
    "pollen",
    "vegetable",
    "gardening and botany books",
    "spaghetti squash",
    "” but",
    "butternut squash",
    "” so",
    "acorn squash",
    "bell peppers",
    "cayenne peppers",
    "airtight containers",
    "gardening book",
    "carrots",
    "container",
    "seeds"
  ],
  "tyn_section":[

  ]
}