{
  "title":"How to Make Vegetable LEGO Bricks",
  "url":"https://www.wikihow.com/Make-Vegetable-LEGO-Bricks",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids",
    "Food Crafts"
  ],
  "steps":[
    {
      "headline":"Pick the right vegetables.",
      "description":"Many vegetables are suitable, including carrots, potatoes, squash, and rutabagas. You could also use firm tofu and add a food color to the water, which the tofu will soak up. You can do this with the vegetables, too. Be bold!"
    },
    {
      "headline":"Prepare your vegetables.",
      "description":"Boil or steam the vegetables so they are soft but not mushy. Soak them for a couple minutes in salt water. This will make them a little firmer by drawing out some of the moisture."
    },
    {
      "headline":"Cut the vegetables into cube shapes.",
      "description":"As with real LEGO pieces, you will need to decide what bricks you would like to make: a single stud square brick, the four stud square, or the six stud rectangle. (\"Stud\" refers to the little bumps on top of real LEGO bricks)."
    },
    {
      "headline":"Poke a straw all the way through the vegetable.",
      "description":"This will create a round hole and will push out the inside the vegetable brick. Be sure to match holes with the LEGO stud arrangement you're creating."
    },
    {
      "headline":"Using a toothpick, push the stud from the bottom of the vegetable brick until it sticks out of the top.",
      "description":"This ensures that it looks like a LEGO brick, complete with studs!"
    },
    {
      "headline":"Check the studs are evenly positioned across the top by looking at the brick sideways.",
      "description":"If it's not, carefully press a stud back in, or poke one farther out."
    },
    {
      "headline":"Serve with a smile on a colorful plate.",
      "description":"Your kids will be delighted!"
    }
  ],
  "text":" Pick the right vegetables. Many vegetables are suitable, including carrots, potatoes, squash, and rutabagas. You could also use firm tofu and add a food color to the water, which the tofu will soak up. You can do this with the vegetables, too. Be bold! Prepare your vegetables. Boil or steam the vegetables so they are soft but not mushy. Soak them for a couple minutes in salt water. This will make them a little firmer by drawing out some of the moisture. Cut the vegetables into cube shapes. As with real LEGO pieces, you will need to decide what bricks you would like to make: a single stud square brick, the four stud square, or the six stud rectangle. (\"Stud\" refers to the little bumps on top of real LEGO bricks). Poke a straw all the way through the vegetable. This will create a round hole and will push out the inside the vegetable brick. Be sure to match holes with the LEGO stud arrangement you're creating. Using a toothpick, push the stud from the bottom of the vegetable brick until it sticks out of the top. This ensures that it looks like a LEGO brick, complete with studs! Check the studs are evenly positioned across the top by looking at the brick sideways. If it's not, carefully press a stud back in, or poke one farther out. Serve with a smile on a colorful plate. Your kids will be delighted!",
  "tyn_model":[
    "vegetables",
    "tofu",
    "carrots",
    "potatoes",
    "squash",
    "water",
    "salt water",
    "straw",
    "vegetable",
    "toothpick",
    "vegetable brick",
    "colorful plate"
  ],
  "tyn_section":[

  ]
}