{
  "title":"How to Make Peanut Blossom Cookies",
  "url":"https://www.wikihow.com/Make-Peanut-Blossom-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Nut Cookies and Biscuits"
  ],
  "methods":[
    {
      "name":"Prepare the Cookie Dough",
      "steps":[
        {
          "headline":"Position a sifter or mesh sieve over a clean mixing bowl.",
          "description":""
        },
        {
          "headline":"Place the flour, baking soda and kosher salt into the sifter or sieve.",
          "description":"Turn the handle of the sifter or tap the sieve until all of the ingredients are sifted together into the bowl. Set the bowl aside."
        },
        {
          "headline":"Place the butter and sugars into a mixing bowl.",
          "description":""
        },
        {
          "headline":"Beat the butter and sugars on medium speed, using either a handheld mixer or a stand mixer with a paddle attachment, for about 2 minutes or until the mixture is smooth.",
          "description":""
        },
        {
          "headline":"Add the egg, milk and vanilla to the creamed butter and sugars.",
          "description":""
        },
        {
          "headline":"Continue beating until the mixture is well blended.",
          "description":""
        },
        {
          "headline":"Scoop 1 cup of the dry ingredients and add them to the wet ingredients, beating until the dry ingredients are just incorporated.",
          "description":""
        },
        {
          "headline":"Continue adding dry ingredients by the cupful until you have mixed in all of the dry ingredients.",
          "description":""
        },
        {
          "headline":"Fold in the peanut butter.",
          "description":""
        },
        {
          "headline":"Cover the mixing bowl with plastic wrap and chill the dough in the refrigerator for about 1 hour.",
          "description":""
        }
      ]
    },
    {
      "name":"Bake the Cookies",
      "steps":[
        {
          "headline":"Preheat the oven to 375°F (190°C).",
          "description":"Line 2 baking sheets with parchment paper."
        },
        {
          "headline":"Fill a shallow bowl with a thin layer of granulated sugar.",
          "description":""
        },
        {
          "headline":"Roll the dough into 1\" (2.5 centimeter) balls.",
          "description":"You will be able to fit 12 cookies on a standard baking sheet."
        },
        {
          "headline":"Roll each dough ball in sugar, making sure that each dough ball is well covered in sugar.",
          "description":""
        },
        {
          "headline":"Place each dough ball onto a baking sheet, leaving about 1-1/2\" of room around each ball.",
          "description":""
        },
        {
          "headline":"Refrigerate the remaining dough for later use.",
          "description":""
        },
        {
          "headline":"Bake the cookies for 6 to 8 minutes until the cookies are light brown and puffed.",
          "description":""
        },
        {
          "headline":"Remove the pan from the oven.",
          "description":""
        },
        {
          "headline":"Press 1 candy kiss into the center of each cookie, allowing the top of the dough to crack just a bit.",
          "description":""
        },
        {
          "headline":"Return the cookies to the oven and bake them for an additional 2 to 3 minutes or until they are golden brown.",
          "description":""
        },
        {
          "headline":"Remove the baking sheet from the oven and allow the cookies to cool on the stovetop for 2 minutes.",
          "description":""
        },
        {
          "headline":"Loosen the cookies from the parchment paper with a spatula and place them on wire racks to cool.",
          "description":""
        }
      ]
    }
  ],
  "text":" Prepare the Cookie Dough Position a sifter or mesh sieve over a clean mixing bowl.  Place the flour, baking soda and kosher salt into the sifter or sieve. Turn the handle of the sifter or tap the sieve until all of the ingredients are sifted together into the bowl. Set the bowl aside. Place the butter and sugars into a mixing bowl.  Beat the butter and sugars on medium speed, using either a handheld mixer or a stand mixer with a paddle attachment, for about 2 minutes or until the mixture is smooth.  Add the egg, milk and vanilla to the creamed butter and sugars.  Continue beating until the mixture is well blended.  Scoop 1 cup of the dry ingredients and add them to the wet ingredients, beating until the dry ingredients are just incorporated.  Continue adding dry ingredients by the cupful until you have mixed in all of the dry ingredients.  Fold in the peanut butter.  Cover the mixing bowl with plastic wrap and chill the dough in the refrigerator for about 1 hour.  Bake the Cookies Preheat the oven to 375°F (190°C). Line 2 baking sheets with parchment paper. Fill a shallow bowl with a thin layer of granulated sugar.  Roll the dough into 1\" (2.5 centimeter) balls. You will be able to fit 12 cookies on a standard baking sheet. Roll each dough ball in sugar, making sure that each dough ball is well covered in sugar.  Place each dough ball onto a baking sheet, leaving about 1-1/2\" of room around each ball.  Refrigerate the remaining dough for later use.  Bake the cookies for 6 to 8 minutes until the cookies are light brown and puffed.  Remove the pan from the oven.  Press 1 candy kiss into the center of each cookie, allowing the top of the dough to crack just a bit.  Return the cookies to the oven and bake them for an additional 2 to 3 minutes or until they are golden brown.  Remove the baking sheet from the oven and allow the cookies to cool on the stovetop for 2 minutes.  Loosen the cookies from the parchment paper with a spatula and place them on wire racks to cool. ",
  "tyn_model":[
    "oven",
    "mixing bowl",
    "butter",
    "sugars",
    "baking sheet",
    "sifter",
    "sieve",
    "bowl",
    "parchment paper",
    "sugar",
    "cookie dough",
    "sifter or mesh sieve",
    "flour",
    "baking soda",
    "kosher salt",
    "handheld mixer",
    "stand mixer",
    "egg",
    "milk",
    "vanilla",
    "peanut butter",
    "plastic wrap",
    "refrigerator",
    "baking sheets",
    "granulated sugar",
    "pan",
    "spatula"
  ],
  "tyn_section":[

  ]
}