{
  "title":"How to Get Nail Polish off Just About Any Surface",
  "url":"https://www.wikihow.com/Get-Nail-Polish-off-Just-About-Any-Surface",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Stain Removal",
    "Cosmetics Stains"
  ],
  "methods":[
    {
      "name":"Removing Polish from Walls",
      "steps":[
        {
          "headline":"Start with rubbing alcohol.",
          "description":"Pour a little rubbing alcohol on to the coarse side of a sponge. Then, begin scrubbing directly on the nail polish while trying to avoid the paint around the stain. Use small, circular motions to scrub."
        },
        {
          "headline":"Keep scrubbing.",
          "description":"It may take a few minutes of gentle scrubbing before you completely remove the nail polish. During this time, add more alcohol to the sponge as necessary."
        },
        {
          "headline":"Finish with soapy water.",
          "description":"When you feel that you have lifted as much of the stain as possible, clean off the area and any residue with dish detergent and warm water. Dampen a soft cloth in the solution and gently rub the area clean."
        },
        {
          "headline":"Dry off the wall.",
          "description":"After you have finished cleaning, be sure to use a soft cloth to completely dry off the wall."
        }
      ]
    },
    {
      "name":"Removing Polish from Fabric and Clothing",
      "steps":[
        {
          "headline":"Scrape off the nail polish.",
          "description":"If you can, scrape off any excess nail polish from your clothes with a plastic putty knife or knife edge. You don't want to use a cloth to wipe if off because that will only worsen the stain."
        },
        {
          "headline":"Use nail polish remover.",
          "description":"Perform a spot test before you use it, as nail polish remover can interact with some dyes and fabrics (it will actually melt acetate). Choose a spot on the inside of the fabric as a test area."
        },
        {
          "headline":"Try rubbing alcohol.",
          "description":"Pour a small amount of rubbing alcohol directly to the spill and blot it off with a clean cloth. Use firm, quick blots and be sure not to wipe the stain because it will spread the polish and push it deeper into the fabric."
        },
        {
          "headline":"Scrub your clothes with baking soda.",
          "description":"Baking soda is a great way to clean off nail polish and not damage your clothes. Dampen a clean cloth and dip it into baking soda. Then, gently blot away at the nail polish stain. Use firm and quick presses to blot."
        },
        {
          "headline":"Wash the article with water directly afterward.",
          "description":"After using a cleaning agent to wash away a polish stain, clean the area with water to remove residue. Put the clothes into the washing machine if you are able to do so, but you should always hand wash items that cannot be put into the washing machine by blotting the affected area with a clean cloth and warm water."
        }
      ]
    },
    {
      "name":"Removing Polish from Carpet",
      "steps":[
        {
          "headline":"Never rub the spill.",
          "description":"Grabbing a towel and rubbing the excess nail polish up may be your first instinct, but don't do it. This will only push the nail polish deeper into the carpet fibers and spread it around. Instead, you want to scrap it up with a plastic putty knife, spatula or knife edge, and blot the area with a clean cloth."
        },
        {
          "headline":"Try glass cleaner.",
          "description":"This works best with medium to dark colored carpets. Saturate the area with glass cleaner and then blot the nail polish with a clean cloth until the stain lifts."
        },
        {
          "headline":"Blot the polish with a polish remover.",
          "description":"This is the best method for light or white carpet and should not be used on dark colors because it could remove the dye from the carpet. Pour a little non-acetone clear polish remover on a clean cloth and blot the area until the stain lifts. Be sure the polish remover doesn't contain any dye as that could further stain the area."
        },
        {
          "headline":"Try rubbing alcohol on darker carpets.",
          "description":"Pour rubbing alcohol on to a clean cloth, and then blot the polish up. Don't give up if the polish just seems to keep coming, you want to get every last bit out."
        },
        {
          "headline":"Use vinegar for a natural cleaning agent.",
          "description":"Vinegar works great to remove nail polish from carpet. Simply pour some vinegar into a spray bottle and spray the affected area. Then, blot the area clean with a clean wash cloth and warm water."
        }
      ]
    },
    {
      "name":"Removing Polish from Wood and Laminate",
      "steps":[
        {
          "headline":"Scrape the spill up gently.",
          "description":"Use a plastic putty knife to remove any excess nail polish from the wood or laminate surface. It should come off easily but if it is resistant, dampen a cloth with warm water, and let it sit on the spill for thirty seconds. This should loosen the polish."
        },
        {
          "headline":"Use denatured alcohol on the polish stain.",
          "description":"Pour the denatured alcohol on a cloth, and lightly rub it against the stain. Do not rub too hard for too long because it could take off the paint or wood finish. Always scrub with the wood grain, and not against it."
        },
        {
          "headline":"Try steel wool for stubborn stains.",
          "description":"If you use 0000-grade fine stainless-steel wool, it should be gentle enough to take up nail polish but not harm the wood. Just be sure to scrub gently and in the same direction as the grain in the wood."
        }
      ]
    },
    {
      "name":"Removing Polish from Flooring and Tiles",
      "steps":[
        {
          "headline":"Get nail polish off of your floor surface.",
          "description":"For granite, grout, concrete, brick, sandstone, tile, or a similar surface, you will need a gentle scrub brush and a few cleaning agents to remove spilled nail polish."
        },
        {
          "headline":"Remove the excess nail polish right away.",
          "description":"Take a plastic putty knife, or some other hard edge to scrape away any polish you can. Scrape slow and gentle so you don't further damage your floor."
        },
        {
          "headline":"Use acetone.",
          "description":"Take a clean cloth and dip it in acetone. Then, dab the polish stain with firm pressure until you lift the stain."
        },
        {
          "headline":"Wash the stain with a soft scrub.",
          "description":"Make a cleaning solution of baking soda and water, and use either a soft-bristled scrub, or a soft sponge, to clean the remainder of the stain. When you are satisfied, clean the area again with warm water."
        }
      ]
    }
  ],
  "text":" Removing Polish from Walls Start with rubbing alcohol. Pour a little rubbing alcohol on to the coarse side of a sponge. Then, begin scrubbing directly on the nail polish while trying to avoid the paint around the stain. Use small, circular motions to scrub. Keep scrubbing. It may take a few minutes of gentle scrubbing before you completely remove the nail polish. During this time, add more alcohol to the sponge as necessary. Finish with soapy water. When you feel that you have lifted as much of the stain as possible, clean off the area and any residue with dish detergent and warm water. Dampen a soft cloth in the solution and gently rub the area clean. Dry off the wall. After you have finished cleaning, be sure to use a soft cloth to completely dry off the wall. Removing Polish from Fabric and Clothing Scrape off the nail polish. If you can, scrape off any excess nail polish from your clothes with a plastic putty knife or knife edge. You don't want to use a cloth to wipe if off because that will only worsen the stain. Use nail polish remover. Perform a spot test before you use it, as nail polish remover can interact with some dyes and fabrics (it will actually melt acetate). Choose a spot on the inside of the fabric as a test area. Try rubbing alcohol. Pour a small amount of rubbing alcohol directly to the spill and blot it off with a clean cloth. Use firm, quick blots and be sure not to wipe the stain because it will spread the polish and push it deeper into the fabric. Scrub your clothes with baking soda. Baking soda is a great way to clean off nail polish and not damage your clothes. Dampen a clean cloth and dip it into baking soda. Then, gently blot away at the nail polish stain. Use firm and quick presses to blot. Wash the article with water directly afterward. After using a cleaning agent to wash away a polish stain, clean the area with water to remove residue. Put the clothes into the washing machine if you are able to do so, but you should always hand wash items that cannot be put into the washing machine by blotting the affected area with a clean cloth and warm water. Removing Polish from Carpet Never rub the spill. Grabbing a towel and rubbing the excess nail polish up may be your first instinct, but don't do it. This will only push the nail polish deeper into the carpet fibers and spread it around. Instead, you want to scrap it up with a plastic putty knife, spatula or knife edge, and blot the area with a clean cloth. Try glass cleaner. This works best with medium to dark colored carpets. Saturate the area with glass cleaner and then blot the nail polish with a clean cloth until the stain lifts. Blot the polish with a polish remover. This is the best method for light or white carpet and should not be used on dark colors because it could remove the dye from the carpet. Pour a little non-acetone clear polish remover on a clean cloth and blot the area until the stain lifts. Be sure the polish remover doesn't contain any dye as that could further stain the area. Try rubbing alcohol on darker carpets. Pour rubbing alcohol on to a clean cloth, and then blot the polish up. Don't give up if the polish just seems to keep coming, you want to get every last bit out. Use vinegar for a natural cleaning agent. Vinegar works great to remove nail polish from carpet. Simply pour some vinegar into a spray bottle and spray the affected area. Then, blot the area clean with a clean wash cloth and warm water. Removing Polish from Wood and Laminate Scrape the spill up gently. Use a plastic putty knife to remove any excess nail polish from the wood or laminate surface. It should come off easily but if it is resistant, dampen a cloth with warm water, and let it sit on the spill for thirty seconds. This should loosen the polish. Use denatured alcohol on the polish stain. Pour the denatured alcohol on a cloth, and lightly rub it against the stain. Do not rub too hard for too long because it could take off the paint or wood finish. Always scrub with the wood grain, and not against it. Try steel wool for stubborn stains. If you use 0000-grade fine stainless-steel wool, it should be gentle enough to take up nail polish but not harm the wood. Just be sure to scrub gently and in the same direction as the grain in the wood. Removing Polish from Flooring and Tiles Get nail polish off of your floor surface. For granite, grout, concrete, brick, sandstone, tile, or a similar surface, you will need a gentle scrub brush and a few cleaning agents to remove spilled nail polish. Remove the excess nail polish right away. Take a plastic putty knife, or some other hard edge to scrape away any polish you can. Scrape slow and gentle so you don't further damage your floor. Use acetone. Take a clean cloth and dip it in acetone. Then, dab the polish stain with firm pressure until you lift the stain. Wash the stain with a soft scrub. Make a cleaning solution of baking soda and water, and use either a soft-bristled scrub, or a soft sponge, to clean the remainder of the stain. When you are satisfied, clean the area again with warm water.",
  "tyn_model":[
    "nail polish",
    "water",
    "rubbing alcohol",
    "plastic putty knife",
    "baking soda",
    "sponge",
    "vinegar",
    "nail polish remover",
    "glass cleaner",
    "polish remover",
    "acetone",
    "alcohol",
    "soapy water",
    "dish detergent",
    "towel",
    "spatula",
    "non-acetone clear polish remover",
    "spray bottle",
    "denatured alcohol",
    "steel wool",
    "stainless-steel wool",
    "scrub brush"
  ],
  "tyn_section":[

  ]
}