{
  "title":"How to Make a Hydroponic Bog Garden (Water Recycling)",
  "url":"https://www.wikihow.com/Make-a-Hydroponic-Bog-Garden-(Water-Recycling)",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Theme and Feature Gardens",
    "Water Gardens"
  ],
  "steps":[
    {
      "headline":"Dig a hole.The bog garden starts life as a square hole with a level base and square sides.",
      "description":""
    },
    {
      "headline":"Line the bottom.",
      "description":"Once the base is leveled out, it is time to line the bottom of the bog garden with a cushion to stop stones rising up and making holes in the liner."
    },
    {
      "headline":"Level the bottom with sand.Add sharp sand coating  to level the bottom completely.",
      "description":""
    },
    {
      "headline":"Cushion the bog.",
      "description":"The lining cushion is laid out in sheets and comes right up the side of the bog garden. It has to protect the liner,  This is the same liner as would be used in a garden pond."
    },
    {
      "headline":"Line the bog.",
      "description":"The liner is laid out and pushed all the way to the side of the hole."
    },
    {
      "headline":"Add second cushion.",
      "description":"Once the liner is in place it too is lined with cushion in order to protect it from the alfagrog that we will be putting on the top. The solid oak sleepers are put in the tank to separate off the aeration pond and the final settlement pond from the actual bog garden itself."
    },
    {
      "headline":"Allow the water to flow out.",
      "description":"Realize that since the  Oak sleepers and the  green untreated oak, have small holes routed in the bottom it  allows the water to flow through and into the bog garden from the aeration chamber."
    },
    {
      "headline":"Add the alfagrog.",
      "description":"Having completed the basic design , fill the actual bog garden part with alfagrog. This is a ceramic filter media used in Koi fish ponds to filter the water. It contains a huge amount of surface area in which our bacteria will live and clean up the water."
    },
    {
      "headline":"Add water.",
      "description":"Completely filled, the centre section of the hydroponic bog garden starts filling it with water and adding the rest of the sleepers around the outside of the system. This size of tank takes around 6 cubic metres of water to fill it to a level just above the Alfagrog. Filling it with water allows it to level the Alfagrog and ensure that when  gravel is added to it that it is all immersed in water."
    },
    {
      "headline":"Support the center section.The finished wood work looks like this.",
      "description":"Full of water and Alfagrog and awaiting the gravel to fill the middle. The cross section wood is to stop the centre section moving when the gravel is added."
    },
    {
      "headline":"Add gravel.",
      "description":"Once filled with gravel the finished bog garden looks like this. The water level is raised so that at least an inch of the gravel is under water to provide the plants with moisture."
    },
    {
      "headline":"Get ready to aerate.",
      "description":"The section of the tank that will receive the water from the Biotank needs to be aerated. A small compressor provides this aeration via a rubber aerator. The dissolved oxygen level needs to be as high as possible if the bacteria in the Alfagrog are going to survive."
    },
    {
      "headline":"Put in some plants.",
      "description":"Once finished the final touch is to add plants. All of these are moisture loving plants provided by our local nursery."
    },
    {
      "headline":"Enjoy the bog garden.",
      "description":"The water from the Bog Garden is used to feed  ponds and to water the lawns."
    }
  ],
  "text":" Dig a hole.The bog garden starts life as a square hole with a level base and square sides.  Line the bottom. Once the base is leveled out, it is time to line the bottom of the bog garden with a cushion to stop stones rising up and making holes in the liner. Level the bottom with sand.Add sharp sand coating  to level the bottom completely.  Cushion the bog. The lining cushion is laid out in sheets and comes right up the side of the bog garden. It has to protect the liner,  This is the same liner as would be used in a garden pond. Line the bog. The liner is laid out and pushed all the way to the side of the hole. Add second cushion. Once the liner is in place it too is lined with cushion in order to protect it from the alfagrog that we will be putting on the top. The solid oak sleepers are put in the tank to separate off the aeration pond and the final settlement pond from the actual bog garden itself. Allow the water to flow out. Realize that since the  Oak sleepers and the  green untreated oak, have small holes routed in the bottom it  allows the water to flow through and into the bog garden from the aeration chamber. Add the alfagrog. Having completed the basic design , fill the actual bog garden part with alfagrog. This is a ceramic filter media used in Koi fish ponds to filter the water. It contains a huge amount of surface area in which our bacteria will live and clean up the water. Add water. Completely filled, the centre section of the hydroponic bog garden starts filling it with water and adding the rest of the sleepers around the outside of the system. This size of tank takes around 6 cubic metres of water to fill it to a level just above the Alfagrog. Filling it with water allows it to level the Alfagrog and ensure that when  gravel is added to it that it is all immersed in water. Support the center section.The finished wood work looks like this. Full of water and Alfagrog and awaiting the gravel to fill the middle. The cross section wood is to stop the centre section moving when the gravel is added. Add gravel. Once filled with gravel the finished bog garden looks like this. The water level is raised so that at least an inch of the gravel is under water to provide the plants with moisture. Get ready to aerate. The section of the tank that will receive the water from the Biotank needs to be aerated. A small compressor provides this aeration via a rubber aerator. The dissolved oxygen level needs to be as high as possible if the bacteria in the Alfagrog are going to survive. Put in some plants. Once finished the final touch is to add plants. All of these are moisture loving plants provided by our local nursery. Enjoy the bog garden. The water from the Bog Garden is used to feed  ponds and to water the lawns.",
  "tyn_model":[
    "water",
    "gravel",
    "liner",
    "cushion",
    "sand",
    "alfagrog",
    "plants",
    "stones",
    "garden pond",
    "solid oak",
    "hydroponic bog garden"
  ],
  "tyn_section":[

  ]
}