{
  "title":"How to Make Fried Ravioli Cookie",
  "url":"https://www.wikihow.com/Make-Fried-Ravioli-Cookie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets"
  ],
  "parts":[
    {
      "name":"Prepare the Dough",
      "steps":[
        {
          "headline":"Place the eggs in a mixing bowl and beat them on medium speed until they are light and fluffy.",
          "description":"Use either a stand mixer with a paddle attachment or a handheld mixer."
        },
        {
          "headline":"Add the shortening and beat the mixture until the shortening and eggs are well blended.",
          "description":""
        },
        {
          "headline":"Whisk the flour, sugar and salt together in a separate mixing bowl.",
          "description":""
        },
        {
          "headline":"Set a third mixing bowl on the counter next to the bowl containing the dry ingredients.",
          "description":""
        },
        {
          "headline":"Position the sieve or sifter over the third bowl and pour the dry ingredients through it and into the bowl.",
          "description":""
        },
        {
          "headline":"Create a well in the center of the dry ingredients by pushing the dry ingredients against the sides of the bowl with a flat plastic spatula.",
          "description":""
        },
        {
          "headline":"Pour the wet ingredients into the well that you created.",
          "description":""
        },
        {
          "headline":"Fold the dry ingredients and the wet ingredients together using the spatula, being careful not to over mix.",
          "description":""
        },
        {
          "headline":"Evaluate the dough.",
          "description":"The dough should be easy to handle. However, if the dough is too soft or sticky, fold in an additional tablespoon of flour."
        }
      ]
    },
    {
      "name":"Shape the Ravioli",
      "steps":[
        {
          "headline":"Sprinkle flour on a work surface.",
          "description":""
        },
        {
          "headline":"Roll out the ravioli dough until the dough is about 1/8\" (3 millimeters) thick, using a rolling pin.",
          "description":""
        },
        {
          "headline":"Place a thin layer of flour in a shallow bowl or plate.",
          "description":""
        },
        {
          "headline":"Dip either a cookie cutter or the opening of a large glass into the flour.",
          "description":"You want the opening of the cookie cutter or glass to be about 3\" (8 centimeters) in diameter."
        },
        {
          "headline":"Press the glass or cookie cutter into the dough and cut circles out of the dough.",
          "description":""
        },
        {
          "headline":"Form the scrap dough into a ball and roll it out again to a 1/8\"(3 mm) thickness.",
          "description":""
        },
        {
          "headline":"Cut additional cookies from the scrap dough and then discard the remainder.",
          "description":""
        },
        {
          "headline":"Place a dollop of chocolate-hazelnut spread in the center of each circle using a teaspoon.",
          "description":""
        },
        {
          "headline":"Fold the ravioli in half to form semicircles.",
          "description":""
        },
        {
          "headline":"Press a fork into the edges of the ravioli dough to seal the filling inside of the ravioli.",
          "description":""
        },
        {
          "headline":"Place the ravioli on a baking sheet and cover the baking sheet with plastic wrap.",
          "description":""
        },
        {
          "headline":"Chill the ravioli in the refrigerator for 1 hour.",
          "description":""
        }
      ]
    },
    {
      "name":"Fry the Ravioli",
      "steps":[
        {
          "headline":"Heat 2 cups of shortening in a Dutch oven until the shortening is 375°F (190°C).",
          "description":""
        },
        {
          "headline":"Remove the ravioli from the refrigerator and place the baking sheet on the countertop next to the stovetop.",
          "description":""
        },
        {
          "headline":"Place a second baking sheet on the countertop and cover it with paper towels.",
          "description":"The paper towels will absorb the excess oil from the fried ravioli so that they don’t become soggy while they are cooling."
        },
        {
          "headline":"Dip the ravioli into the hot shortening using either tongs or a mesh sieve.",
          "description":"Fry the ravioli for 2 minutes, making sure that you don’t overcrowd the pan."
        },
        {
          "headline":"Turn the ravioli with tongs and fry them for an additional 1 to 2 minutes, until the ravioli are golden brown.",
          "description":""
        },
        {
          "headline":"Transfer the fried ravioli to the baking sheet that has been covered in paper towels.",
          "description":"Allow them to cool slightly while you fry another batch."
        },
        {
          "headline":"Transfer the fried ravioli to wire racks.",
          "description":"Dust the ravioli with confectioner’s sugar and serve them while they are still warm."
        }
      ]
    }
  ],
  "text":" Prepare the Dough Place the eggs in a mixing bowl and beat them on medium speed until they are light and fluffy. Use either a stand mixer with a paddle attachment or a handheld mixer. Add the shortening and beat the mixture until the shortening and eggs are well blended.  Whisk the flour, sugar and salt together in a separate mixing bowl.  Set a third mixing bowl on the counter next to the bowl containing the dry ingredients.  Position the sieve or sifter over the third bowl and pour the dry ingredients through it and into the bowl.  Create a well in the center of the dry ingredients by pushing the dry ingredients against the sides of the bowl with a flat plastic spatula.  Pour the wet ingredients into the well that you created.  Fold the dry ingredients and the wet ingredients together using the spatula, being careful not to over mix.  Evaluate the dough. The dough should be easy to handle. However, if the dough is too soft or sticky, fold in an additional tablespoon of flour. Shape the Ravioli Sprinkle flour on a work surface.  Roll out the ravioli dough until the dough is about 1/8\" (3 millimeters) thick, using a rolling pin.  Place a thin layer of flour in a shallow bowl or plate.  Dip either a cookie cutter or the opening of a large glass into the flour. You want the opening of the cookie cutter or glass to be about 3\" (8 centimeters) in diameter. Press the glass or cookie cutter into the dough and cut circles out of the dough.  Form the scrap dough into a ball and roll it out again to a 1/8\"(3 mm) thickness.  Cut additional cookies from the scrap dough and then discard the remainder.  Place a dollop of chocolate-hazelnut spread in the center of each circle using a teaspoon.  Fold the ravioli in half to form semicircles.  Press a fork into the edges of the ravioli dough to seal the filling inside of the ravioli.  Place the ravioli on a baking sheet and cover the baking sheet with plastic wrap.  Chill the ravioli in the refrigerator for 1 hour.  Fry the Ravioli Heat 2 cups of shortening in a Dutch oven until the shortening is 375°F (190°C).  Remove the ravioli from the refrigerator and place the baking sheet on the countertop next to the stovetop.  Place a second baking sheet on the countertop and cover it with paper towels. The paper towels will absorb the excess oil from the fried ravioli so that they don’t become soggy while they are cooling. Dip the ravioli into the hot shortening using either tongs or a mesh sieve. Fry the ravioli for 2 minutes, making sure that you don’t overcrowd the pan. Turn the ravioli with tongs and fry them for an additional 1 to 2 minutes, until the ravioli are golden brown.  Transfer the fried ravioli to the baking sheet that has been covered in paper towels. Allow them to cool slightly while you fry another batch. Transfer the fried ravioli to wire racks. Dust the ravioli with confectioner’s sugar and serve them while they are still warm.",
  "tyn_model":[
    "flour",
    "baking sheet",
    "bowl",
    "mixing bowl",
    "paper towels",
    "eggs",
    "cookie cutter",
    "refrigerator",
    "stand mixer",
    "handheld mixer",
    "sugar",
    "salt",
    "sieve",
    "sifter",
    "flat plastic spatula",
    "spatula",
    "rolling pin",
    "plate",
    "glass or cookie cutter",
    "cookies",
    "chocolate-hazelnut spread",
    "teaspoon",
    "fork",
    "plastic wrap",
    "dutch oven",
    "mesh sieve",
    "wire racks",
    "confectioner’s sugar"
  ],
  "tyn_section":[

  ]
}