{
  "title":"How to Make Cream Cheese Chocolate Chip Cookies",
  "url":"https://www.wikihow.com/Make-Cream-Cheese-Chocolate-Chip-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Chocolate Cookies and Biscuits"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 325°F (170°C).",
      "description":"Line a baking sheet with parchment paper."
    },
    {
      "headline":"Beat the cream cheese, butter, brown sugar and granulated sugar in a mixing bowl.",
      "description":"Use a handheld mixer or a stand mixer with a paddle attachment and set the mixer at medium speed. When you are finished, the ingredients should be creamy and fluffy."
    },
    {
      "headline":"Add the vanilla extract and beat for an additional 30 seconds.",
      "description":""
    },
    {
      "headline":"Combine the baking soda, kosher salt and flour in a separate mixing bowl, stirring the dry ingredients with a whisk.",
      "description":""
    },
    {
      "headline":"Add 1 egg.",
      "description":""
    },
    {
      "headline":"Add 1/3 of the dry ingredients to the wet ingredients and mix them on low speed until the dry ingredients are just incorporated.",
      "description":""
    },
    {
      "headline":"Continue to add the dry ingredients gradually until the dry ingredients are well combined with the wet ingredients.",
      "description":""
    },
    {
      "headline":"Fold in the chocolate chips using a flat plastic spatula.",
      "description":""
    },
    {
      "headline":"Scoop some cookie dough using a cookie scoop and drop it onto the baking sheet.",
      "description":"Flatten the cookie slightly with your clean hand. Alternatively, you can place a 2-tablespoon scoop of cookie dough onto the baking sheet."
    },
    {
      "headline":"Bake the cookies for 12 to 14 minutes or until the edges are slightly brown.",
      "description":""
    },
    {
      "headline":"Remove the baking sheet from the oven and cool the cookies on the stovetop for 2 minutes.",
      "description":""
    },
    {
      "headline":"Use a spatula to loosen the cookies from the parchment paper and transfer the cookies to wire racks to cool.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 325°F (170°C). Line a baking sheet with parchment paper. Beat the cream cheese, butter, brown sugar and granulated sugar in a mixing bowl. Use a handheld mixer or a stand mixer with a paddle attachment and set the mixer at medium speed. When you are finished, the ingredients should be creamy and fluffy. Add the vanilla extract and beat for an additional 30 seconds.  Combine the baking soda, kosher salt and flour in a separate mixing bowl, stirring the dry ingredients with a whisk.  Add 1 egg.  Add 1/3 of the dry ingredients to the wet ingredients and mix them on low speed until the dry ingredients are just incorporated.  Continue to add the dry ingredients gradually until the dry ingredients are well combined with the wet ingredients.  Fold in the chocolate chips using a flat plastic spatula.  Scoop some cookie dough using a cookie scoop and drop it onto the baking sheet. Flatten the cookie slightly with your clean hand. Alternatively, you can place a 2-tablespoon scoop of cookie dough onto the baking sheet. Bake the cookies for 12 to 14 minutes or until the edges are slightly brown.  Remove the baking sheet from the oven and cool the cookies on the stovetop for 2 minutes.  Use a spatula to loosen the cookies from the parchment paper and transfer the cookies to wire racks to cool. ",
  "tyn_model":[
    "baking sheet",
    "oven",
    "parchment paper",
    "mixing bowl",
    "cookie dough",
    "cream cheese",
    "butter",
    "brown sugar",
    "granulated sugar",
    "handheld mixer",
    "stand mixer",
    "mixer",
    "vanilla extract",
    "baking soda",
    "kosher salt",
    "flour",
    "whisk",
    "egg",
    "chocolate chips",
    "flat plastic spatula",
    "cookie scoop",
    "spatula",
    "wire racks"
  ],
  "tyn_section":[

  ]
}