{
  "title":"How to Make Swedish Rye Cookies",
  "url":"https://www.wikihow.com/Make-Swedish-Rye-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Prepare the Dough",
      "steps":[
        {
          "headline":"Mix the cream cheese, butter and sugar together in a mixing bowl at medium speed until the ingredients are light and fluffy.",
          "description":"You can use either a handheld mixer or a stand mixer with a paddle attachment."
        },
        {
          "headline":"Whisk together the rye flour, all-purpose flour, baking powder and kosher salt in a separate mixing bowl.",
          "description":""
        },
        {
          "headline":"Add 1/3 of the dry ingredients to the wet ingredients.",
          "description":""
        },
        {
          "headline":"Mix on low until the dry ingredients that you added are just incorporated.",
          "description":""
        },
        {
          "headline":"Continue adding the dry ingredients gradually, mixing between each addition.",
          "description":""
        },
        {
          "headline":"Examine the dough.",
          "description":"If the dough is too dry to hold together when it is rolled out, then add water 1 tablespoon at a time until the dough is moist but not sticky."
        }
      ]
    },
    {
      "name":"Cut Out the Cookies",
      "steps":[
        {
          "headline":"Preheat the oven to 375°F (190°C) and line 2 baking sheets with parchment paper.",
          "description":""
        },
        {
          "headline":"Sprinkle some flour onto a work surface.",
          "description":""
        },
        {
          "headline":"Coat a small plate with a thin layer of flour.",
          "description":""
        },
        {
          "headline":"Roll out the cookie dough on the floured surface, using a rolling pin, until the dough forms a 1/4” thick rectangle.",
          "description":""
        },
        {
          "headline":"Dip a 2-1/2” (6 centimeter) cookie cutter into the flour that you spread onto the plate.",
          "description":""
        },
        {
          "headline":"Starting at the top left corner of the dough, push the cookie cutter into the dough to cut out a cookie and continue cutting.",
          "description":""
        },
        {
          "headline":"Dip the cookie cutter in flour to prevent the cookies from sticking to the cutter after each cut.",
          "description":""
        },
        {
          "headline":"Dip a thimble in flour and push the thimble through each cookie near the top edge.",
          "description":"These cookies will be hung from the Christmas tree, so leave about 1/2” (13 mm) of space between the top of the hole and the edge of the cookie. This will help avoid having the cookie break when you hang it on the tree."
        },
        {
          "headline":"Lay each cookie on the baking sheets, leaving about 1” (2-1/2 cm) of space between the cookies.",
          "description":""
        },
        {
          "headline":"Sprinkle the cookies with caraway or anise seeds.",
          "description":""
        },
        {
          "headline":"Use the bottom of smooth glass to lightly press the seeds into the surface of the cookies.",
          "description":""
        }
      ]
    },
    {
      "name":"Bake the Cookies and Trim the Tree",
      "steps":[
        {
          "headline":"Bake 1 sheet of cookies for 8 to 10 minutes, or until the edges are lightly browned.",
          "description":""
        },
        {
          "headline":"Remove the first sheet from the oven and place it on the stovetop for 2 minutes to cool.",
          "description":""
        },
        {
          "headline":"Place the second baking sheet in the oven and bake the second batch of cookies.",
          "description":""
        },
        {
          "headline":"Loosen the cookies from the first sheet using a spatula and place them on wire racks to cool.",
          "description":""
        },
        {
          "headline":"When the other cookies come out of the oven, allow them to rest on the stovetop for 2 minutes before transferring them to wire racks to cool completely.",
          "description":""
        },
        {
          "headline":"Thread a 6” (15 cm) piece of ribbon or yarn through the holes of each cookie.",
          "description":""
        },
        {
          "headline":"Tie the two ends of the ribbon together to form a knot in the ribbon.",
          "description":"The knot should be about 1/2” (6 mm) from the ends of the ribbon so that the ribbon can be hung from a Christmas tree branch."
        },
        {
          "headline":"Hang the cookies on your Christmas tree.",
          "description":""
        },
        {
          "headline":"Allow guests to take a cookie from the tree and serve the cookies with a mug of glogg, which is a Swedish mulled mix of port and red wine.",
          "description":""
        }
      ]
    }
  ],
  "text":" Prepare the Dough Mix the cream cheese, butter and sugar together in a mixing bowl at medium speed until the ingredients are light and fluffy. You can use either a handheld mixer or a stand mixer with a paddle attachment. Whisk together the rye flour, all-purpose flour, baking powder and kosher salt in a separate mixing bowl.  Add 1/3 of the dry ingredients to the wet ingredients.  Mix on low until the dry ingredients that you added are just incorporated.  Continue adding the dry ingredients gradually, mixing between each addition.  Examine the dough. If the dough is too dry to hold together when it is rolled out, then add water 1 tablespoon at a time until the dough is moist but not sticky. Cut Out the Cookies Preheat the oven to 375°F (190°C) and line 2 baking sheets with parchment paper.  Sprinkle some flour onto a work surface.  Coat a small plate with a thin layer of flour.  Roll out the cookie dough on the floured surface, using a rolling pin, until the dough forms a 1/4” thick rectangle.  Dip a 2-1/2” (6 centimeter) cookie cutter into the flour that you spread onto the plate.  Starting at the top left corner of the dough, push the cookie cutter into the dough to cut out a cookie and continue cutting.  Dip the cookie cutter in flour to prevent the cookies from sticking to the cutter after each cut.  Dip a thimble in flour and push the thimble through each cookie near the top edge. These cookies will be hung from the Christmas tree, so leave about 1/2” (13 mm) of space between the top of the hole and the edge of the cookie. This will help avoid having the cookie break when you hang it on the tree. Lay each cookie on the baking sheets, leaving about 1” (2-1/2 cm) of space between the cookies.  Sprinkle the cookies with caraway or anise seeds.  Use the bottom of smooth glass to lightly press the seeds into the surface of the cookies.  Bake the Cookies and Trim the Tree Bake 1 sheet of cookies for 8 to 10 minutes, or until the edges are lightly browned.  Remove the first sheet from the oven and place it on the stovetop for 2 minutes to cool.  Place the second baking sheet in the oven and bake the second batch of cookies.  Loosen the cookies from the first sheet using a spatula and place them on wire racks to cool.  When the other cookies come out of the oven, allow them to rest on the stovetop for 2 minutes before transferring them to wire racks to cool completely.  Thread a 6” (15 cm) piece of ribbon or yarn through the holes of each cookie.  Tie the two ends of the ribbon together to form a knot in the ribbon. The knot should be about 1/2” (6 mm) from the ends of the ribbon so that the ribbon can be hung from a Christmas tree branch. Hang the cookies on your Christmas tree.  Allow guests to take a cookie from the tree and serve the cookies with a mug of glogg, which is a Swedish mulled mix of port and red wine. ",
  "tyn_model":[
    "flour",
    "” (",
    "oven",
    "cookie cutter",
    "ribbon",
    "mixing bowl",
    "baking sheets",
    "cream cheese",
    "butter",
    "sugar",
    "stand mixer",
    "rye flour",
    "all-purpose flour",
    "baking powder",
    "kosher salt",
    "water",
    "parchment paper",
    "small plate",
    "cookie dough",
    "rolling pin",
    "” thick",
    "plate",
    "thimble",
    "caraway or",
    "anise seeds",
    "glass",
    "baking sheet",
    "spatula",
    "wire racks",
    "yarn",
    "glogg",
    "port",
    "red wine"
  ],
  "tyn_section":[

  ]
}