{
  "title":"How to Make Vegan Soup",
  "url":"https://www.wikihow.com/Make-Vegan-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Basic Vegan Soups",
      "steps":[
        {
          "headline":"Make vegan soup broth.",
          "description":"A good vegetable broth will give you the means to create a host of vegan soups. This broth recipe calls for a large variety of vegetables for a complex flavor, but the recipe is flexible enough that you can make substitutions based on what’s in season."
        },
        {
          "headline":"Make vegan split pea soup.",
          "description":"Split peas are actually the dried and split seeds of the traditional pea plant. This soup packs plenty of flavor; you won’t miss the traditional ham hocks."
        },
        {
          "headline":"Make vegan vegetable soup.",
          "description":"This spicy vegetable soup delivers a delicious twist on the classic recipe. You can vary the vegetables in this recipe as needed to accommodate what’s in your refrigerator."
        },
        {
          "headline":"Make vegan chicken noodle soup.",
          "description":"This soup is the perfect recipe for people of all ages. You can make this soup at any time of the year for a quick lunch or a simple dinner."
        },
        {
          "headline":"Make vegan French onion soup.",
          "description":"This soup packs big caramelized onion flavor without the traditional beef broth. Croutons and vegan Gruyere cheese create the traditional broiled topping."
        }
      ]
    },
    {
      "name":"Pureed Vegan Soups",
      "steps":[
        {
          "headline":"Make vegan black bean soup.",
          "description":"Pureeing some of the black beans while leaving others whole gives this soup a creamy yet hearty texture. You can use either dried beans or canned beans, depending on your preference."
        },
        {
          "headline":"Make vegan carrot and fennel soup.",
          "description":"Roasted carrots and then fennel, with its licorice-like taste, are pureed to make this smooth and flavorful soup. Fennel is a perennial plant that grows year-round, making it one of the few vegetables actually in season during wintertime."
        },
        {
          "headline":"Make vegan broccoli cheese soup.",
          "description":"Pureed shallots, potatoes, red onion and jalapeno are combined with a mix of both pureed and chopped broccoli. Vegan cheese, soy creamer and soy milk give the soup a thick and creamy base without the addition of dairy."
        }
      ]
    },
    {
      "name":"Creamy Vegan Soups",
      "steps":[
        {
          "headline":"Make vegan chowder.",
          "description":"Corn chowder filled with poblano peppers, jalapenos, potatoes and calabaza squash is made thick and creamy with the addition of cashew cheese."
        },
        {
          "headline":"Make vegan cream of tomato soup.",
          "description":"Classic tomato soup gets a flavor injection—and a touch of creaminess—from Coconut Dream and coconut milk creamer. Pureed canned tomatoes make this recipe simple and quick to prepare."
        },
        {
          "headline":"Make vegan cream of nettle soup.",
          "description":"Soy milk and vegetable broth form the base for this creamy soup. If you’re looking for a new ingredient to add to your repertoire, give nettles a try. The herb is a great source of both potassium and iron."
        },
        {
          "headline":"Make vegan cream of mushroom soup.",
          "description":"This soup gets its creaminess from blending silken tofu with vegetable broth. If you don’t have cremini mushroom, then use any variety of fresh mushrooms."
        },
        {
          "headline":"Make vegan yogurt soup.",
          "description":"Soy yogurt and cornstarch serve as the basis for thickening vegan yogurt soup. Barley adds heartiness, and cilantro and lemon juice add bold and complex flavor."
        }
      ]
    },
    {
      "name":"Vegan Soups from Around the World",
      "steps":[
        {
          "headline":"Make vegan tortilla soup.",
          "description":"The tofu in this recipe, which absorbs the flavor of the other ingredients, makes a delicious substitute for chicken. Ancho chiles, fire-roasted tomatoes and avocado round out the flavorful broth in this staple of Latin American cuisine."
        },
        {
          "headline":"Make vegan coconut soup.",
          "description":"Coconut soup is one of the most beloved dishes in any Thai restaurant. Grated creamed coconut, spices and red lentils capture the flavors of Southeast Asia."
        },
        {
          "headline":"Make vegan bouillabaisse.",
          "description":"Fennel, orange peel and saffron bring the flavors of Provence to this hearty soup. Instead of showcasing seafood, this recipe showcases artichoke hearts, fennel bulb, potatoes, white beans and carrots."
        },
        {
          "headline":"Make vegan hot and sour soup.",
          "description":"Steer clear of meat-based broth and pork in traditional Asian hot and sour soup and enjoy this recipe that employs vegetable broth, soy sauce and tamarind puree for unbeatable flavor."
        },
        {
          "headline":"Make vegan Italian wedding soup.",
          "description":"Ditalini pasta, miniature vegan meatballs and fresh spinach form the signature trio of ingredients for Italian wedding soup. Vegetable broth and spices create a delectable soup base."
        },
        {
          "headline":"Make vegan wonton soup.",
          "description":"A simple broth of water, fresh ginger and mushrooms showcases the delicious wontons in this traditional Chinese soup. Make some extra wontons to steam or pan-fry."
        },
        {
          "headline":"Make vegan egg drop soup.",
          "description":"Take on the challenge of making tofu curds to replace the eggs in this staple of Chinese cooking. You’ll enjoy the complex broth flavored with tamari and toasted sesame oil."
        }
      ]
    }
  ],
  "text":" Basic Vegan Soups Make vegan soup broth. A good vegetable broth will give you the means to create a host of vegan soups. This broth recipe calls for a large variety of vegetables for a complex flavor, but the recipe is flexible enough that you can make substitutions based on what’s in season. Make vegan split pea soup. Split peas are actually the dried and split seeds of the traditional pea plant. This soup packs plenty of flavor; you won’t miss the traditional ham hocks. Make vegan vegetable soup. This spicy vegetable soup delivers a delicious twist on the classic recipe. You can vary the vegetables in this recipe as needed to accommodate what’s in your refrigerator. Make vegan chicken noodle soup. This soup is the perfect recipe for people of all ages. You can make this soup at any time of the year for a quick lunch or a simple dinner. Make vegan French onion soup. This soup packs big caramelized onion flavor without the traditional beef broth. Croutons and vegan Gruyere cheese create the traditional broiled topping. Pureed Vegan Soups Make vegan black bean soup. Pureeing some of the black beans while leaving others whole gives this soup a creamy yet hearty texture. You can use either dried beans or canned beans, depending on your preference. Make vegan carrot and fennel soup. Roasted carrots and then fennel, with its licorice-like taste, are pureed to make this smooth and flavorful soup. Fennel is a perennial plant that grows year-round, making it one of the few vegetables actually in season during wintertime. Make vegan broccoli cheese soup. Pureed shallots, potatoes, red onion and jalapeno are combined with a mix of both pureed and chopped broccoli. Vegan cheese, soy creamer and soy milk give the soup a thick and creamy base without the addition of dairy. Creamy Vegan Soups Make vegan chowder. Corn chowder filled with poblano peppers, jalapenos, potatoes and calabaza squash is made thick and creamy with the addition of cashew cheese. Make vegan cream of tomato soup. Classic tomato soup gets a flavor injection—and a touch of creaminess—from Coconut Dream and coconut milk creamer. Pureed canned tomatoes make this recipe simple and quick to prepare. Make vegan cream of nettle soup. Soy milk and vegetable broth form the base for this creamy soup. If you’re looking for a new ingredient to add to your repertoire, give nettles a try. The herb is a great source of both potassium and iron. Make vegan cream of mushroom soup. This soup gets its creaminess from blending silken tofu with vegetable broth. If you don’t have cremini mushroom, then use any variety of fresh mushrooms. Make vegan yogurt soup. Soy yogurt and cornstarch serve as the basis for thickening vegan yogurt soup. Barley adds heartiness, and cilantro and lemon juice add bold and complex flavor. Vegan Soups from Around the World Make vegan tortilla soup. The tofu in this recipe, which absorbs the flavor of the other ingredients, makes a delicious substitute for chicken. Ancho chiles, fire-roasted tomatoes and avocado round out the flavorful broth in this staple of Latin American cuisine. Make vegan coconut soup. Coconut soup is one of the most beloved dishes in any Thai restaurant. Grated creamed coconut, spices and red lentils capture the flavors of Southeast Asia. Make vegan bouillabaisse. Fennel, orange peel and saffron bring the flavors of Provence to this hearty soup. Instead of showcasing seafood, this recipe showcases artichoke hearts, fennel bulb, potatoes, white beans and carrots. Make vegan hot and sour soup. Steer clear of meat-based broth and pork in traditional Asian hot and sour soup and enjoy this recipe that employs vegetable broth, soy sauce and tamarind puree for unbeatable flavor. Make vegan Italian wedding soup. Ditalini pasta, miniature vegan meatballs and fresh spinach form the signature trio of ingredients for Italian wedding soup. Vegetable broth and spices create a delectable soup base. Make vegan wonton soup. A simple broth of water, fresh ginger and mushrooms showcases the delicious wontons in this traditional Chinese soup. Make some extra wontons to steam or pan-fry. Make vegan egg drop soup. Take on the challenge of making tofu curds to replace the eggs in this staple of Chinese cooking. You’ll enjoy the complex broth flavored with tamari and toasted sesame oil.",
  "tyn_model":[
    "vegetable broth",
    "fennel",
    "potatoes",
    "vegetables",
    "carrots",
    "soy milk",
    "tomatoes",
    "tofu",
    "coconut soup",
    "wontons",
    "soup broth",
    "broth",
    "split pea soup",
    "split peas",
    "vegetable soup",
    "chicken noodle soup",
    "french onion soup",
    "beef broth",
    "croutons",
    "gruyere cheese",
    "black bean soup",
    "black beans",
    "carrot",
    "broccoli cheese soup",
    "shallots",
    "red onion",
    "jalapeno",
    "broccoli",
    "vegan cheese",
    "soy creamer",
    "corn chowder",
    "jalapenos",
    "cashew cheese",
    "cream of tomato soup",
    "—and",
    "—from",
    "coconut dream and coconut milk",
    "cream of nettle",
    "nettles",
    "iron",
    "cream of mushroom soup",
    "yogurt",
    "vegan yogurt soup",
    "barley",
    "cilantro",
    "lemon juice",
    "tortilla soup",
    "chicken",
    "avocado",
    "coconut",
    "spices",
    "red lentils",
    "orange peel",
    "saffron",
    "seafood",
    "artichoke",
    "white beans",
    "soy sauce",
    "tamarind puree",
    "fresh spinach",
    "wonton",
    "water",
    "fresh ginger",
    "mushrooms",
    "eggs",
    "tamari",
    "toasted sesame oil"
  ],
  "tyn_section":[

  ]
}