{
  "title":"How to Make Rosy Lemonade Concentrate",
  "url":"https://www.wikihow.com/Make-Rosy-Lemonade-Concentrate",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Citrus Based Drinks",
    "Lemonade Drinks"
  ],
  "steps":[
    {
      "headline":"Add sugar, water, and raspberries to a 4-cup microwave-safe measuring cup.",
      "description":""
    },
    {
      "headline":"Peel a large strip of lemon peel from 2 lemons.",
      "description":"Make sure to use only the lemon zest as the pith is bitter."
    },
    {
      "headline":"Add water to the mixture.",
      "description":""
    },
    {
      "headline":"Microwave on high for 3 to 4 minutes or until the mixture boils, stirring once during cooking.",
      "description":""
    },
    {
      "headline":"Allow the mixture to cool.",
      "description":""
    },
    {
      "headline":"Strain the mixture to remove the seeds and peel.",
      "description":""
    },
    {
      "headline":"Squeeze fresh lemon juice and add to the strained raspberry mixture.",
      "description":"Store the concentrate in a 1-quart covered jar. Use within 1 month of preparing the lemonade concentrate."
    },
    {
      "headline":"Add 1/4 cup concentrate to an ice-filled glass.",
      "description":"Add water to fill the glass. Serve."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Add sugar, water, and raspberries to a 4-cup microwave-safe measuring cup.  Peel a large strip of lemon peel from 2 lemons. Make sure to use only the lemon zest as the pith is bitter. Add water to the mixture.  Microwave on high for 3 to 4 minutes or until the mixture boils, stirring once during cooking.  Allow the mixture to cool.  Strain the mixture to remove the seeds and peel.  Squeeze fresh lemon juice and add to the strained raspberry mixture. Store the concentrate in a 1-quart covered jar. Use within 1 month of preparing the lemonade concentrate. Add 1/4 cup concentrate to an ice-filled glass. Add water to fill the glass. Serve. Finished. ",
  "tyn_model":[
    "water",
    "sugar",
    "raspberries",
    "4-cup microwave-safe measuring cup",
    "lemon peel",
    "microwave",
    "lemon",
    "raspberry",
    "1-quart covered jar",
    "lemonade concentrate",
    "ice-filled glass"
  ],
  "tyn_section":[

  ]
}