{
  "title":"How to Make a Cake Stand",
  "url":"https://www.wikihow.com/Make-a-Cake-Stand",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes"
  ],
  "methods":[
    {
      "name":"Using Candlesticks As A Base for a Cake Stand",
      "steps":[
        {
          "headline":"Gather your materials.",
          "description":"To make a cake stand using a large decorative candlestick as a base you will need several different supplies. Get a 10-12 inch microwave plate to serve as the plate on your cake stand. If you have an old microwave you aren't using you can use the plate from that, or you can buy one at a local discount or second-hand store. Buy a large decorative candlestick. This will serve as the base for your cake stand. You will need sandpaper and gorilla glue to secure the base and plate together. You will need a colored spray paint as well as a glossy clear coat to paint the cake stand."
        },
        {
          "headline":"Clean your candlestick and microwave plate.",
          "description":"You want your items to be as clean as possible before you make the cake stand. Wash the candlestick and microwave plate in warm, soapy water. Wipe them dry with a dish towel. Let them air dry the rest of the way. They must be completely dry before you start putting the cake stand together."
        },
        {
          "headline":"Sand the bottom of the microwave plate and the top of the candlestick.",
          "description":"This will provide a roughened area for gluing these pieces together. Glue the sanded microwave plate and candlestick together. Apply a generous amount of glue to the sanded top part of the candlestick. Attach the candlestick to the microwave plate, making sure it is centered. Wipe any excess glue away from the seam where the plate meets the candlestick with a paper towel\nLet the glue dry entirely."
        },
        {
          "headline":"Paint the cake stand.",
          "description":"You will do this with spray paint in your desired color. Most generic cake stands are white or black, but if you are having a themed party you might want your cake stand to match the décor. Apply the first coat of paint, making sure the color is even. Allow this to dry completely. Apply a second coat of colored spray paint and allow the item to dry. Lastly, apply a clear coat to seal in the color and provide shine. Let these dry completely before using the cake stand. Add other decorations to your cake stand, such as ribbons or stickers after the paint has dried."
        }
      ]
    },
    {
      "name":"Making A Cake Stand from a Flower Pot",
      "steps":[
        {
          "headline":"Gather your supplies.",
          "description":"In order to do this project you will need the following:\nA terra cotta flower pot and saucer. The saucer should be 10–12 inches (25.4–30.5 cm) in diameter. White acrylic paint\nPatterned scrapbook or contact paper\nRibbon\nA hot glue gun and glue sticks\nScissors."
        },
        {
          "headline":"Paint the flower pot and saucer with the white acrylic paint.",
          "description":"This is not required if you want to keep the natural terra cotta color. Use a sponge paintbrush for fast painting. Paint only the outside of the terra cotta pot. This will be the base of your cake stand. Paint the entire saucer. This will be the plate of your cake stand. Let the paint dry completely before moving on to the next step."
        },
        {
          "headline":"Glue the bottom of the terra cotta pot to the back of the saucer.",
          "description":"Make sure it is centered. Use a generous amount of hot glue. Be careful when using hot glue. It is easy to burn yourself. Wipe away any excess glue from the seam where the items are glued for a more polished look. Let the glue harden and dry before moving the cake stand."
        },
        {
          "headline":"Line the bottom of the saucer with paper.",
          "description":"You can use contact paper or scrapbook paper. Cut out the shape of the bottom of the saucer with paper. You can use the rim of the saucer to trace the shape. Glue or use the sticky side of contact paper to attach the paper to line the saucer."
        },
        {
          "headline":"Use hot glue to attach ribbon.",
          "description":"You will place this along the rim of the saucer. You can also attach ribbon along the bottom edge of the flower pot base. Use a ribbon that complements the color of your paper lining. Let the glue dry before using your cake stand."
        }
      ]
    }
  ],
  "text":" Using Candlesticks As A Base for a Cake Stand Gather your materials. To make a cake stand using a large decorative candlestick as a base you will need several different supplies. Get a 10-12 inch microwave plate to serve as the plate on your cake stand. If you have an old microwave you aren't using you can use the plate from that, or you can buy one at a local discount or second-hand store. Buy a large decorative candlestick. This will serve as the base for your cake stand. You will need sandpaper and gorilla glue to secure the base and plate together. You will need a colored spray paint as well as a glossy clear coat to paint the cake stand. Clean your candlestick and microwave plate. You want your items to be as clean as possible before you make the cake stand. Wash the candlestick and microwave plate in warm, soapy water. Wipe them dry with a dish towel. Let them air dry the rest of the way. They must be completely dry before you start putting the cake stand together. Sand the bottom of the microwave plate and the top of the candlestick. This will provide a roughened area for gluing these pieces together. Glue the sanded microwave plate and candlestick together. Apply a generous amount of glue to the sanded top part of the candlestick. Attach the candlestick to the microwave plate, making sure it is centered. Wipe any excess glue away from the seam where the plate meets the candlestick with a paper towel\nLet the glue dry entirely. Paint the cake stand. You will do this with spray paint in your desired color. Most generic cake stands are white or black, but if you are having a themed party you might want your cake stand to match the décor. Apply the first coat of paint, making sure the color is even. Allow this to dry completely. Apply a second coat of colored spray paint and allow the item to dry. Lastly, apply a clear coat to seal in the color and provide shine. Let these dry completely before using the cake stand. Add other decorations to your cake stand, such as ribbons or stickers after the paint has dried. Making A Cake Stand from a Flower Pot Gather your supplies. In order to do this project you will need the following:\nA terra cotta flower pot and saucer. The saucer should be 10–12 inches (25.4–30.5 cm) in diameter. White acrylic paint\nPatterned scrapbook or contact paper\nRibbon\nA hot glue gun and glue sticks\nScissors. Paint the flower pot and saucer with the white acrylic paint. This is not required if you want to keep the natural terra cotta color. Use a sponge paintbrush for fast painting. Paint only the outside of the terra cotta pot. This will be the base of your cake stand. Paint the entire saucer. This will be the plate of your cake stand. Let the paint dry completely before moving on to the next step. Glue the bottom of the terra cotta pot to the back of the saucer. Make sure it is centered. Use a generous amount of hot glue. Be careful when using hot glue. It is easy to burn yourself. Wipe away any excess glue from the seam where the items are glued for a more polished look. Let the glue harden and dry before moving the cake stand. Line the bottom of the saucer with paper. You can use contact paper or scrapbook paper. Cut out the shape of the bottom of the saucer with paper. You can use the rim of the saucer to trace the shape. Glue or use the sticky side of contact paper to attach the paper to line the saucer. Use hot glue to attach ribbon. You will place this along the rim of the saucer. You can also attach ribbon along the bottom edge of the flower pot base. Use a ribbon that complements the color of your paper lining. Let the glue dry before using your cake stand.",
  "tyn_model":[
    "cake stand",
    "candlestick",
    "glue",
    "microwave plate",
    "ribbon",
    "paper",
    "flower pot",
    "hot glue",
    "plate",
    "spray paint",
    "paint",
    "white acrylic paint",
    "terra cotta pot",
    "contact paper",
    "candlesticks",
    "microwave",
    "gorilla glue",
    "water",
    "dish towel",
    "paper towel",
    "colored spray paint",
    "stickers",
    "terra cotta flower pot",
    "saucer",
    "scrapbook or contact paper",
    "hot glue gun",
    "glue sticks",
    "scissors",
    "sponge paintbrush",
    "scrapbook paper"
  ],
  "tyn_section":[

  ]
}