{
  "title":"How to Find Games You Used to Play Online",
  "url":"https://www.wikihow.com/Find-Games-You-Used-to-Play-Online",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "methods":[
    {
      "name":"Using Abandonware Sites",
      "steps":[
        {
          "headline":"Perform an online search for \"abandonware\" or \"abandonware games.\"",
          "description":"Abandonware simply refers to software that's no longer supported or that has unenforced copyright protection, often because the original developer is no longer in business or was sold. You'll see several sites listed that allow you to download old games. By checking the page description (or \"snippet\") under each search result, you should be able to determine which sites offer free downloads. Several of the results will mention the availability of game downloads. It's not a bad idea to also perform a search like \"best sites for abandonware\" to help make an informed decision. You'll find some sites and forums that recommend specific abandonware sites and/or assess the safety of their downloads."
        },
        {
          "headline":"Pick a site and explore.",
          "description":"Depending on the sites, games may be organized differently. But you should be able to browse through categories or search for a specific game if you already have one in mind."
        },
        {
          "headline":"Click on the game of your choice.",
          "description":"What shows up next will depend on the site you're using. You're generally likely to find some information about the game and potentially other user reviews. Sometimes the download button can be difficult to locate amid the clutter, but you should be able to find it amid the clutter."
        },
        {
          "headline":"Click to download.",
          "description":"Some sites will also give you the option to skip downloading and simply play the game in your browser. Downloading the game, however, will allow you to play it when you're offline. Beware of ads. Some advertisements are designed to look like download buttons. The design of the button will likely look different from the site, and there should be a button on the ad that allows you to close it. There may be different versions of the game available for download, but you should be able to play either one."
        },
        {
          "headline":"Open the game and enjoy.",
          "description":"You should be able to find it in your Downloads folder. Games often come zipped, so you may have to unzip them manually if your system doesn't do so automatically. Programs like WinRAR may be helpful for this. You may have to adjust your system's preferences to allow installation of applications from unidentified developers. You should also review this article's warning section to better understand the legality associated with abandonware and"
        }
      ]
    },
    {
      "name":"Using an Emulator",
      "steps":[
        {
          "headline":"Find emulators online.",
          "description":"An emulator is software or hardware that enables a host computer to mimic the operation of a \"guest\" computer system. In this case, game emulators allow PCs, notebooks or mobile devices to operate games that were designed for other systems (such as consoles). Performing a search for \"game emulator\" should take you in the right direction, but you can also visit a comprehensive site like [1]. While emulators themselves are legal, you should consult this article's warning section regarding the legality of downloading games themselves (for use with an emulator or otherwise)."
        },
        {
          "headline":"Choose an emulator.",
          "description":"This decision will likely come down to which system you're looking to emulate. Make sure to read, review and compare emulators before making a final decision. Better yet, download several emulators for the same console. Some emulators may be better at mimicking certain mappers, graphic engines and sounds than others. While an emulator usually emulates one system, some multi-system emulators also exist. By example, some of the more popular console emulators include Zsnes, Nesticle, Visual Boy Advance, MAME, Gameboid, SNESoid, N64oid and many more. Be sure to check the emulator's compatibility with your operating system. If you're planning to play games on a mobile device, you should consider its processing power (or lack thereof) and select an emulator accordingly."
        },
        {
          "headline":"Download and install the emulator.",
          "description":"Initially, this is generally as simple as locating and clicking the \"download\" or \"start download\" but that appears once you've selected and clicked on your emulator of choice. The file should appear in your Downloads folder. Note that you may have to unzip the file manually if it doesn't happen automatically. You may also find an .exe file that extracts and installs itself once it's been double-clicked."
        },
        {
          "headline":"Find games for your emulator.",
          "description":"Perform a search for \"ROM games for emulator.\" ROM game files are generally based on read-only memory chips from video game cartridges, firmware or an arcade game's main board. Several sites will appear with snippets indicating that ROMs are available for download. Pick one, perhaps after conducting some additional research into the best sites for ROMs. The ROM games may be organized by their original gaming system, making it easier to find one for the emulator you selected."
        },
        {
          "headline":"Download the game(s) of your choice.",
          "description":"This process is much like downloading the abandonware games and pretty straightforward."
        },
        {
          "headline":"Open the emulator and play your selected game.",
          "description":"To open the emulator, expand its menu, click File and then click Open. Once the emulator has started, select the game from the file folder in which it's been stored. Double-click the game, and it should begin loading within the emulator."
        }
      ]
    }
  ],
  "text":" Using Abandonware Sites Perform an online search for \"abandonware\" or \"abandonware games.\" Abandonware simply refers to software that's no longer supported or that has unenforced copyright protection, often because the original developer is no longer in business or was sold. You'll see several sites listed that allow you to download old games. By checking the page description (or \"snippet\") under each search result, you should be able to determine which sites offer free downloads. Several of the results will mention the availability of game downloads. It's not a bad idea to also perform a search like \"best sites for abandonware\" to help make an informed decision. You'll find some sites and forums that recommend specific abandonware sites and/or assess the safety of their downloads. Pick a site and explore. Depending on the sites, games may be organized differently. But you should be able to browse through categories or search for a specific game if you already have one in mind. Click on the game of your choice. What shows up next will depend on the site you're using. You're generally likely to find some information about the game and potentially other user reviews. Sometimes the download button can be difficult to locate amid the clutter, but you should be able to find it amid the clutter. Click to download. Some sites will also give you the option to skip downloading and simply play the game in your browser. Downloading the game, however, will allow you to play it when you're offline. Beware of ads. Some advertisements are designed to look like download buttons. The design of the button will likely look different from the site, and there should be a button on the ad that allows you to close it. There may be different versions of the game available for download, but you should be able to play either one. Open the game and enjoy. You should be able to find it in your Downloads folder. Games often come zipped, so you may have to unzip them manually if your system doesn't do so automatically. Programs like WinRAR may be helpful for this. You may have to adjust your system's preferences to allow installation of applications from unidentified developers. You should also review this article's warning section to better understand the legality associated with abandonware and Using an Emulator Find emulators online. An emulator is software or hardware that enables a host computer to mimic the operation of a \"guest\" computer system. In this case, game emulators allow PCs, notebooks or mobile devices to operate games that were designed for other systems (such as consoles). Performing a search for \"game emulator\" should take you in the right direction, but you can also visit a comprehensive site like [1]. While emulators themselves are legal, you should consult this article's warning section regarding the legality of downloading games themselves (for use with an emulator or otherwise). Choose an emulator. This decision will likely come down to which system you're looking to emulate. Make sure to read, review and compare emulators before making a final decision. Better yet, download several emulators for the same console. Some emulators may be better at mimicking certain mappers, graphic engines and sounds than others. While an emulator usually emulates one system, some multi-system emulators also exist. By example, some of the more popular console emulators include Zsnes, Nesticle, Visual Boy Advance, MAME, Gameboid, SNESoid, N64oid and many more. Be sure to check the emulator's compatibility with your operating system. If you're planning to play games on a mobile device, you should consider its processing power (or lack thereof) and select an emulator accordingly. Download and install the emulator. Initially, this is generally as simple as locating and clicking the \"download\" or \"start download\" but that appears once you've selected and clicked on your emulator of choice. The file should appear in your Downloads folder. Note that you may have to unzip the file manually if it doesn't happen automatically. You may also find an .exe file that extracts and installs itself once it's been double-clicked. Find games for your emulator. Perform a search for \"ROM games for emulator.\" ROM game files are generally based on read-only memory chips from video game cartridges, firmware or an arcade game's main board. Several sites will appear with snippets indicating that ROMs are available for download. Pick one, perhaps after conducting some additional research into the best sites for ROMs. The ROM games may be organized by their original gaming system, making it easier to find one for the emulator you selected. Download the game(s) of your choice. This process is much like downloading the abandonware games and pretty straightforward. Open the emulator and play your selected game. To open the emulator, expand its menu, click File and then click Open. Once the emulator has started, select the game from the file folder in which it's been stored. Double-click the game, and it should begin loading within the emulator.",
  "tyn_model":[
    "emulator",
    "emulators",
    "games",
    "game emulators",
    "game emulator",
    "visual boy advance"
  ],
  "tyn_section":[

  ]
}