{
  "title":"How to Eat Healthily at a Chinese Restaurant",
  "url":"https://www.wikihow.com/Eat-Healthily-at-a-Chinese-Restaurant",
  "category_hierarchy":[
    "Food and Entertaining",
    "Dining Out"
  ],
  "methods":[
    {
      "name":"Making Good Choices",
      "steps":[
        {
          "headline":"Choose a broth-based soup such as won-ton or egg-drop to start your meal.",
          "description":"Soups are a great choice for helping to fill up without a ton of calories and can be full of extra protein and vegetables without adding calories. Avoid starters like Chinese noodles or fried wontons. While they may stave off hunger pangs while you wait to be served, it is an easy way to add hundreds of extra calories and unnecessary carbohydrates to your meal."
        },
        {
          "headline":"Order brown rice over white or fried rice.",
          "description":"The difference in calories isn't significant, but it provides additional fiber and is a much healthier choice. Brown rice also significantly lowers the chance of developing Type 2 diabetes. It has a lower glycemic index and contains more vitamins, minerals, and antioxidants."
        },
        {
          "headline":"Ask for your dish to be prepared in the manner of traditional Chinese cuisine.",
          "description":"Chinese cooking incorporates mostly fresh vegetables, fruits, fish, and rice, with very little red meat. Traditional cooking methods include steaming or roasting, rather than frying. Tell the wait staff at the restaurant if you have special dietary needs. They can steer you toward the best and healthiest choices for you on the menu. Make sure you inform restaurant staff if you follow a kosher, vegan, or other special diet, or if you have food allergies."
        },
        {
          "headline":"Request sauce to be served on the side.",
          "description":"Hoisin, sweet and sour, and other traditional Chinese sauces are highly caloric. By serving it on the side, you can moderate the amount of sauce on your dish. As for low-sodium soy sauce instead of regular. One tablespoon of regular soy sauce as 1,000 milligrams of sodium, which is about half of your daily recommended sodium intake. Choose mustard-based and chili-based sauces to boost flavor without the calories."
        },
        {
          "headline":"Ask the chef to prepare your dish without monosodium glutamate (MSG).",
          "description":"If you are concerned about possible allergies, then ask that your meal be prepared without MSG. MSG is a flavor enhancer commonly added to Chinese foods, but it also occurs naturally in many foods including tomatoes and cheese. Sometimes called “Chinese restaurant syndrome,” some people report symptoms such as facial swelling or chest pain after consuming MSG. See a physician if you experience these symptoms after eating Chinese food. The FDA has classified MSG as a food ingredient “generally recognized as safe.” However, the FDA requires MSG to be listed on the ingredients list."
        },
        {
          "headline":"Drink hot tea with your meal.",
          "description":"Many traditional Chinese restaurants serve tea as a beverage option or at the end of your meal. This helps signal your brain to stop eating and cleanses the palate."
        }
      ]
    },
    {
      "name":"Choosing the Most Healthful Chinese Dishes",
      "steps":[
        {
          "headline":"Avoid breaded, deep-fried dishes, noodle-based dishes, or dishes doused in thick sauces.",
          "description":"Items like pork-lo mein, sweet-and-sour chicken, fried rice, and General Tso’s chicken each contain well over a thousand calories. Instead, ask for dishes to be steamed, baked, or sautéed in less oil."
        },
        {
          "headline":"Choose spring rolls rather than egg rolls for an appetizer or side dish.",
          "description":"Egg rolls are deep fried, while spring rolls contain a light, rice-paper wrapper and more fresh vegetables and meats or fish. Ordering fresh spring rolls will cut about half the calories and fat."
        },
        {
          "headline":"Try a vegetarian option.",
          "description":"Select one of the restaurant's vegetarian items on the menu, or order other menu choices served with tofu rather than meat. Dishes like Ma Po Tofu or tofu with garlic sauce are flavorful and contain healthy, low-fat proteins. Buddha’s delight is a great choice, boasting a healthful medley of vegetables and tofu cooked with ginger and soy sauce. Shrimp can be a healthy option to add to any vegetarian dish. It is low in fat and high in protein."
        },
        {
          "headline":"Order lean meats such as chicken and pork rather than beef.",
          "description":"Lean meats are a great source of complete protein, are rich in iron and other vitamins, and have less saturated fat. One cup of chicken and broccoli has about 250-200 calories, and the broccoli provides important nutrients and antioxidants."
        },
        {
          "headline":"Eat fruit or a fortune cookie for dessert.",
          "description":"Traditional Chinese cuisine emphasizes only fruit for dessert, rather than cakes or cookies. Fortune cookies are also a great choice to end your meal, containing only about 30 calories."
        }
      ]
    },
    {
      "name":"Practicing Portion Control",
      "steps":[
        {
          "headline":"Stick to a healthy diet the day you plan to eat Chinese food.",
          "description":"This can help you keep your daily calories, fat, and sodium in check, and maintain portion control. Choose foods with less sodium and fat for your other meals and snacks. Before you head to the restaurant, try eating a piece of fruit or another small, healthy snack to prevent overeating during the meal. Fit in some exercise that day or the next to help burn extra calories."
        },
        {
          "headline":"Drink a glass of water before you head to the restaurant, and when you arrive.",
          "description":"Staying hydrated can help prevent overeating. Sipping water with your meal will also help your stomach feel fuller and help overall digestion. Drinking water will also reduce the amount of sodium that your body absorbs."
        },
        {
          "headline":"Choose chopsticks instead of a fork and knife.",
          "description":"Ask your waiter for a set of them if they aren't already on the table. Because it takes most people longer to eat with chopsticks, it will help you feel fuller sooner and prevent you from overeating."
        },
        {
          "headline":"Avoid dishes with words like \"house\" or \"combo\" in the name.",
          "description":"This often means the dish is larger and more caloric than one with a single main ingredient in the title."
        },
        {
          "headline":"Order from the menu rather than choosing to eat from the buffet.",
          "description":"Buffets can encourage overeating. Additionally, you can ask the waitstaff to pace bringing dishes to the table. Eating just one or two dishes at a time will encourage you to savor the food and eat less overall."
        },
        {
          "headline":"Split dishes with friends or family, or take leftovers home.",
          "description":"Not only will this help save money, but it will also help you eat proper portions."
        },
        {
          "headline":"Fill half your plate with steamed vegetables.",
          "description":"By making these the focal point of the meal rather than meat or rice, you’ll save fat, calories, and salt, while still feeling satisfied."
        },
        {
          "headline":"Watch your rice portions.",
          "description":"Each cup of brown or steamed rice adds about 200 calories to the meal."
        }
      ]
    }
  ],
  "text":" Making Good Choices Choose a broth-based soup such as won-ton or egg-drop to start your meal. Soups are a great choice for helping to fill up without a ton of calories and can be full of extra protein and vegetables without adding calories. Avoid starters like Chinese noodles or fried wontons. While they may stave off hunger pangs while you wait to be served, it is an easy way to add hundreds of extra calories and unnecessary carbohydrates to your meal. Order brown rice over white or fried rice. The difference in calories isn't significant, but it provides additional fiber and is a much healthier choice. Brown rice also significantly lowers the chance of developing Type 2 diabetes. It has a lower glycemic index and contains more vitamins, minerals, and antioxidants. Ask for your dish to be prepared in the manner of traditional Chinese cuisine. Chinese cooking incorporates mostly fresh vegetables, fruits, fish, and rice, with very little red meat. Traditional cooking methods include steaming or roasting, rather than frying. Tell the wait staff at the restaurant if you have special dietary needs. They can steer you toward the best and healthiest choices for you on the menu. Make sure you inform restaurant staff if you follow a kosher, vegan, or other special diet, or if you have food allergies. Request sauce to be served on the side. Hoisin, sweet and sour, and other traditional Chinese sauces are highly caloric. By serving it on the side, you can moderate the amount of sauce on your dish. As for low-sodium soy sauce instead of regular. One tablespoon of regular soy sauce as 1,000 milligrams of sodium, which is about half of your daily recommended sodium intake. Choose mustard-based and chili-based sauces to boost flavor without the calories. Ask the chef to prepare your dish without monosodium glutamate (MSG). If you are concerned about possible allergies, then ask that your meal be prepared without MSG. MSG is a flavor enhancer commonly added to Chinese foods, but it also occurs naturally in many foods including tomatoes and cheese. Sometimes called “Chinese restaurant syndrome,” some people report symptoms such as facial swelling or chest pain after consuming MSG. See a physician if you experience these symptoms after eating Chinese food. The FDA has classified MSG as a food ingredient “generally recognized as safe.” However, the FDA requires MSG to be listed on the ingredients list. Drink hot tea with your meal. Many traditional Chinese restaurants serve tea as a beverage option or at the end of your meal. This helps signal your brain to stop eating and cleanses the palate. Choosing the Most Healthful Chinese Dishes Avoid breaded, deep-fried dishes, noodle-based dishes, or dishes doused in thick sauces. Items like pork-lo mein, sweet-and-sour chicken, fried rice, and General Tso’s chicken each contain well over a thousand calories. Instead, ask for dishes to be steamed, baked, or sautéed in less oil. Choose spring rolls rather than egg rolls for an appetizer or side dish. Egg rolls are deep fried, while spring rolls contain a light, rice-paper wrapper and more fresh vegetables and meats or fish. Ordering fresh spring rolls will cut about half the calories and fat. Try a vegetarian option. Select one of the restaurant's vegetarian items on the menu, or order other menu choices served with tofu rather than meat. Dishes like Ma Po Tofu or tofu with garlic sauce are flavorful and contain healthy, low-fat proteins. Buddha’s delight is a great choice, boasting a healthful medley of vegetables and tofu cooked with ginger and soy sauce. Shrimp can be a healthy option to add to any vegetarian dish. It is low in fat and high in protein. Order lean meats such as chicken and pork rather than beef. Lean meats are a great source of complete protein, are rich in iron and other vitamins, and have less saturated fat. One cup of chicken and broccoli has about 250-200 calories, and the broccoli provides important nutrients and antioxidants. Eat fruit or a fortune cookie for dessert. Traditional Chinese cuisine emphasizes only fruit for dessert, rather than cakes or cookies. Fortune cookies are also a great choice to end your meal, containing only about 30 calories. Practicing Portion Control Stick to a healthy diet the day you plan to eat Chinese food. This can help you keep your daily calories, fat, and sodium in check, and maintain portion control. Choose foods with less sodium and fat for your other meals and snacks. Before you head to the restaurant, try eating a piece of fruit or another small, healthy snack to prevent overeating during the meal. Fit in some exercise that day or the next to help burn extra calories. Drink a glass of water before you head to the restaurant, and when you arrive. Staying hydrated can help prevent overeating. Sipping water with your meal will also help your stomach feel fuller and help overall digestion. Drinking water will also reduce the amount of sodium that your body absorbs. Choose chopsticks instead of a fork and knife. Ask your waiter for a set of them if they aren't already on the table. Because it takes most people longer to eat with chopsticks, it will help you feel fuller sooner and prevent you from overeating. Avoid dishes with words like \"house\" or \"combo\" in the name. This often means the dish is larger and more caloric than one with a single main ingredient in the title. Order from the menu rather than choosing to eat from the buffet. Buffets can encourage overeating. Additionally, you can ask the waitstaff to pace bringing dishes to the table. Eating just one or two dishes at a time will encourage you to savor the food and eat less overall. Split dishes with friends or family, or take leftovers home. Not only will this help save money, but it will also help you eat proper portions. Fill half your plate with steamed vegetables. By making these the focal point of the meal rather than meat or rice, you’ll save fat, calories, and salt, while still feeling satisfied. Watch your rice portions. Each cup of brown or steamed rice adds about 200 calories to the meal.",
  "tyn_model":[
    "rice",
    "soy sauce",
    "msg",
    "chicken",
    "tofu",
    "water",
    "brown rice",
    "tea",
    "vegetables",
    "broccoli",
    "fruit",
    "chopsticks",
    "soups",
    "chinese noodles",
    "fried wontons",
    "fruits",
    "fish",
    "sauces",
    "monosodium glutamate",
    "“chinese",
    "” some",
    "“generally",
    "” however",
    "fried rice",
    "rolls",
    "garlic sauce",
    "ginger",
    "shrimp",
    "pork",
    "beef",
    "meats",
    "cookies",
    "fortune cookies",
    "portion control",
    "fork",
    "knife",
    "plate"
  ],
  "tyn_section":[

  ]
}