{
  "title":"How to Incorporate Vegetables Into a Healthy Breakfast",
  "url":"https://www.wikihow.com/Incorporate-Vegetables-Into-a-Healthy-Breakfast",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast"
  ],
  "methods":[
    {
      "name":"Adding Veggies to Classics",
      "steps":[
        {
          "headline":"Scramble veggies into your eggs.",
          "description":"Start by heating a little olive oil or butter in a frying pan. Add in sliced yellow squash, sliced bell pepper, diced broccoli, shredded cabbage, sliced onion, and/or diced tomatoes. You only need 1-2 handfuls, along with a dash of salt and pepper. Heat the vegetables until they're mostly cooked through, then pour in scrambled eggs. Cook until the eggs are set. You can also heat up leftover veggies to scramble with eggs using the same technique. If you don’t have fresh vegetables or leftovers on hand, you can add canned vegetables to your eggs. If you want to add spinach, put it in when the eggs are almost done, and stir it up to wilt the spinach. You can add a sprinkling of cheese at the end, too. Serve it up with salsa, and you've got even more vegetables. Add a side of whole grain toast for a more filling breakfast."
        },
        {
          "headline":"Incorporate extra vegetables into a potato hash.",
          "description":"Fry up some diced potatoes, but mix in some veggies, such as bell peppers, onions, or even sliced cabbage. You can also use sweet potatoes, radishes, squash, or cauliflower in place of the potato. If your veggies aren't cooked, add them in the same time as the potatoes. Use up your leftovers by adding them to your breakfast hash. Wait until near the end to add precooked veggies. For a little more protein, crack an egg into the mixture at the end or serve it with a side of beans."
        },
        {
          "headline":"Mix shredded veggies into your pancakes.",
          "description":"Try adding shredded carrots (nuke them in the microwave for a minute or 2), raisins, and cinnamon to your pancake batter for carrot cake pancakes. For more interesting options, try shredded beets or zucchini, also with a little cinnamon. If you're not afraid to forgo sweet pancakes, try adding cooked spinach, onions, or mushrooms to your pancakes, then sprinkle a little cheese on them at the end or add a pat of butter instead of syrup. Canned sweet potatoes and pumpkin also make delicious, nutritious additions to pancake batter."
        },
        {
          "headline":"Eat a large side of salsa with your breakfast burrito.",
          "description":"Most salsas are chock full of tomatoes, onions, and peppers. If you're generous with your use of salsa, you can get in a decent amount of vegetables just by eating it as a condiment."
        },
        {
          "headline":"Top oatmeal with roasted veggies for a savory breakfast.",
          "description":"Instead of making your oatmeal sweet, lightly salt your oatmeal and top it with roasted veggies from the night before. Alternatively, add some freshly sautéed spinach with a touch of butter. If you want more protein, add some warmed-up canned beans or a poached egg."
        },
        {
          "headline":"Opt for a savory breakfast yogurt.",
          "description":"Spoon plain yogurt or Greek yogurt into a bowl. Top it with avocado and roasted beets, or roasted sweet potato and sauerkraut or kimchi. Alternatively, pick a variety of fresh, sliced veggies. Add a dash of salt and pepper and a swirl of olive oil to finish it off."
        }
      ]
    },
    {
      "name":"Creating On-the-Go Options",
      "steps":[
        {
          "headline":"Wrap your breakfast in a tortilla.",
          "description":"Quickly scramble a few eggs in a little olive oil or butter. Put the warm eggs in a tortilla, and add a sprinkling of cheese. Pile on some spinach and tomatoes and wrap it up to take with you. You can also add your spinach at the end of cooking your eggs so you have wilted spinach instead of raw. You can also use kale, onion, thinly sliced cabbage, or even quickly cooked strips of bell pepper. You can make this up the night before and heat it in the microwave in the morning, if you don't mind your veggies warm. Another option is to freeze a bunch of these ahead of time and pop them in your microwave before you head out."
        },
        {
          "headline":"Bake eggs in tomatoes or mushrooms while you're getting ready.",
          "description":"Hollow out the center of half a tomato, or grab a large portabella mushroom cap. Crack an egg in each half or 1 in the center of the mushroom, and sprinkle with salt and pepper. Broil the eggs for 4-6 minutes until they are set. Add a sprinkling of Parmesan cheese at the end, and take it in a container to go."
        },
        {
          "headline":"Reach for veggie sticks instead of an apple or banana.",
          "description":"Cut up celery, cucumber, or yellow squash into sticks or grab a bag of baby carrots. Prepare baggies of cut-up veggies to grab in the morning. Eat them on their own or with a side of hummus."
        },
        {
          "headline":"Add veggies to your morning smoothie.",
          "description":"You can add veggies to almost any smoothie, and often, the taste of the fruit will mask the taste of the vegetables. For instance, add leafy greens like kale and spinach to smoothies with fruits like oranges, grapefruit, or mango. Try adding mashed sweet potatoes to smoothies with cinnamon and apple, or add any kind of canned beans (drained and rinsed) to a berry smoothie. Try cooked, cooled beets in a smoothie with berries or even pomegranate."
        },
        {
          "headline":"Bake a batch of sweet veggie muffins at the beginning of the week.",
          "description":"Try pumpkin muffins, carrot muffins, or zucchini muffins, all of which hide the vegetable flavor. Grab one as you head out the door for an easy option. Store these muffins in an airtight container on the counter until they go stale or grow mold."
        },
        {
          "headline":"Make a batch of savory veggie muffins on the weekend.",
          "description":"Dice 1 large tomato, 1 bell pepper, and 1 packed cup of spinach, and mix them together. Divide the mixture into a greased 12-cup muffin tin. Mix together 8 eggs, a dash of salt and pepper, and a couple of dashes of Italian seasoning. Pour the eggs over the vegetables, and cook them at 400 °F (204 °C) for 24 to 28 minutes, until the eggs are set. Let the muffins cool a few minutes, and then use a knife to turn the muffins out of the pan onto a cooling rack. Once they're completely cool, store them in an airtight container in the fridge for 4-5 days. You can also put them in the freezer for up to 3 months. Try topping the muffins with feta or cheddar cheese before baking."
        }
      ]
    },
    {
      "name":"Going beyond Traditional Breakfast Foods",
      "steps":[
        {
          "headline":"Make hummus toast with veggies.",
          "description":"Toast some whole-grain bread until it's to your liking. Let it cool slightly, then spread hummus on top of it. Add veggies of your choice on top for a wholesome, filling breakfast. Try adding slices of cucumber, tomatoes, or even a layer of spinach. You could also try slices of yellow squash or bell pepper. For a different option, replace the hummus with mashed avocado or an unsweetened nut butter."
        },
        {
          "headline":"Use up last night's leftovers.",
          "description":"If you don't mind getting away from \"typical\" breakfast food, try just heating up some of last night's leftovers. It's quick and easy, and you won't even have to think about how to add in your vegetables, as long as you ate some last night. For instance, if you had pasta with veggies last night, just heat it up and go. If you ate a veggie pizza, try eating it cold. Alternatively, if you had chicken with a side of broccoli, heat it up for breakfast."
        },
        {
          "headline":"Eat a baked sweet potato for breakfast.",
          "description":"Swap a sweet potato for your morning oatmeal. You can cook some at the beginning of the week and heat them up in the mornings. Top them with beans and greens for a savory meal. For something a little sweeter, top it with yogurt and nuts. If you forget to bake your sweet potato, stick it in the microwave to cook it. Pierce it several times with a fork, then heat it 5-8 minutes until it's soft. You may need to turn it over partway through. If you need to cook more than one, add 2 minutes for each one."
        },
        {
          "headline":"Try a salad for breakfast.",
          "description":"While salads normally aren't breakfast fare, they can make a hearty, filling breakfast. Try a salad with greens like kale or spinach, a few fruits like strawberries or mangoes, a handful of beans, and a handful of nuts. Top it with a light vinaigrette or even a yogurt-based dressing. If you can't live without bacon or eggs for breakfast, top spinach or kale with chopped boiled eggs, chopped bacon, a sprinkling of green onions, tomato slices, avocado, and whatever dressing you prefer."
        }
      ]
    }
  ],
  "text":" Adding Veggies to Classics Scramble veggies into your eggs. Start by heating a little olive oil or butter in a frying pan. Add in sliced yellow squash, sliced bell pepper, diced broccoli, shredded cabbage, sliced onion, and/or diced tomatoes. You only need 1-2 handfuls, along with a dash of salt and pepper. Heat the vegetables until they're mostly cooked through, then pour in scrambled eggs. Cook until the eggs are set. You can also heat up leftover veggies to scramble with eggs using the same technique. If you don’t have fresh vegetables or leftovers on hand, you can add canned vegetables to your eggs. If you want to add spinach, put it in when the eggs are almost done, and stir it up to wilt the spinach. You can add a sprinkling of cheese at the end, too. Serve it up with salsa, and you've got even more vegetables. Add a side of whole grain toast for a more filling breakfast. Incorporate extra vegetables into a potato hash. Fry up some diced potatoes, but mix in some veggies, such as bell peppers, onions, or even sliced cabbage. You can also use sweet potatoes, radishes, squash, or cauliflower in place of the potato. If your veggies aren't cooked, add them in the same time as the potatoes. Use up your leftovers by adding them to your breakfast hash. Wait until near the end to add precooked veggies. For a little more protein, crack an egg into the mixture at the end or serve it with a side of beans. Mix shredded veggies into your pancakes. Try adding shredded carrots (nuke them in the microwave for a minute or 2), raisins, and cinnamon to your pancake batter for carrot cake pancakes. For more interesting options, try shredded beets or zucchini, also with a little cinnamon. If you're not afraid to forgo sweet pancakes, try adding cooked spinach, onions, or mushrooms to your pancakes, then sprinkle a little cheese on them at the end or add a pat of butter instead of syrup. Canned sweet potatoes and pumpkin also make delicious, nutritious additions to pancake batter. Eat a large side of salsa with your breakfast burrito. Most salsas are chock full of tomatoes, onions, and peppers. If you're generous with your use of salsa, you can get in a decent amount of vegetables just by eating it as a condiment. Top oatmeal with roasted veggies for a savory breakfast. Instead of making your oatmeal sweet, lightly salt your oatmeal and top it with roasted veggies from the night before. Alternatively, add some freshly sautéed spinach with a touch of butter. If you want more protein, add some warmed-up canned beans or a poached egg. Opt for a savory breakfast yogurt. Spoon plain yogurt or Greek yogurt into a bowl. Top it with avocado and roasted beets, or roasted sweet potato and sauerkraut or kimchi. Alternatively, pick a variety of fresh, sliced veggies. Add a dash of salt and pepper and a swirl of olive oil to finish it off. Creating On-the-Go Options Wrap your breakfast in a tortilla. Quickly scramble a few eggs in a little olive oil or butter. Put the warm eggs in a tortilla, and add a sprinkling of cheese. Pile on some spinach and tomatoes and wrap it up to take with you. You can also add your spinach at the end of cooking your eggs so you have wilted spinach instead of raw. You can also use kale, onion, thinly sliced cabbage, or even quickly cooked strips of bell pepper. You can make this up the night before and heat it in the microwave in the morning, if you don't mind your veggies warm. Another option is to freeze a bunch of these ahead of time and pop them in your microwave before you head out. Bake eggs in tomatoes or mushrooms while you're getting ready. Hollow out the center of half a tomato, or grab a large portabella mushroom cap. Crack an egg in each half or 1 in the center of the mushroom, and sprinkle with salt and pepper. Broil the eggs for 4-6 minutes until they are set. Add a sprinkling of Parmesan cheese at the end, and take it in a container to go. Reach for veggie sticks instead of an apple or banana. Cut up celery, cucumber, or yellow squash into sticks or grab a bag of baby carrots. Prepare baggies of cut-up veggies to grab in the morning. Eat them on their own or with a side of hummus. Add veggies to your morning smoothie. You can add veggies to almost any smoothie, and often, the taste of the fruit will mask the taste of the vegetables. For instance, add leafy greens like kale and spinach to smoothies with fruits like oranges, grapefruit, or mango. Try adding mashed sweet potatoes to smoothies with cinnamon and apple, or add any kind of canned beans (drained and rinsed) to a berry smoothie. Try cooked, cooled beets in a smoothie with berries or even pomegranate. Bake a batch of sweet veggie muffins at the beginning of the week. Try pumpkin muffins, carrot muffins, or zucchini muffins, all of which hide the vegetable flavor. Grab one as you head out the door for an easy option. Store these muffins in an airtight container on the counter until they go stale or grow mold. Make a batch of savory veggie muffins on the weekend. Dice 1 large tomato, 1 bell pepper, and 1 packed cup of spinach, and mix them together. Divide the mixture into a greased 12-cup muffin tin. Mix together 8 eggs, a dash of salt and pepper, and a couple of dashes of Italian seasoning. Pour the eggs over the vegetables, and cook them at 400 °F (204 °C) for 24 to 28 minutes, until the eggs are set. Let the muffins cool a few minutes, and then use a knife to turn the muffins out of the pan onto a cooling rack. Once they're completely cool, store them in an airtight container in the fridge for 4-5 days. You can also put them in the freezer for up to 3 months. Try topping the muffins with feta or cheddar cheese before baking. Going beyond Traditional Breakfast Foods Make hummus toast with veggies. Toast some whole-grain bread until it's to your liking. Let it cool slightly, then spread hummus on top of it. Add veggies of your choice on top for a wholesome, filling breakfast. Try adding slices of cucumber, tomatoes, or even a layer of spinach. You could also try slices of yellow squash or bell pepper. For a different option, replace the hummus with mashed avocado or an unsweetened nut butter. Use up last night's leftovers. If you don't mind getting away from \"typical\" breakfast food, try just heating up some of last night's leftovers. It's quick and easy, and you won't even have to think about how to add in your vegetables, as long as you ate some last night. For instance, if you had pasta with veggies last night, just heat it up and go. If you ate a veggie pizza, try eating it cold. Alternatively, if you had chicken with a side of broccoli, heat it up for breakfast. Eat a baked sweet potato for breakfast. Swap a sweet potato for your morning oatmeal. You can cook some at the beginning of the week and heat them up in the mornings. Top them with beans and greens for a savory meal. For something a little sweeter, top it with yogurt and nuts. If you forget to bake your sweet potato, stick it in the microwave to cook it. Pierce it several times with a fork, then heat it 5-8 minutes until it's soft. You may need to turn it over partway through. If you need to cook more than one, add 2 minutes for each one. Try a salad for breakfast. While salads normally aren't breakfast fare, they can make a hearty, filling breakfast. Try a salad with greens like kale or spinach, a few fruits like strawberries or mangoes, a handful of beans, and a handful of nuts. Top it with a light vinaigrette or even a yogurt-based dressing. If you can't live without bacon or eggs for breakfast, top spinach or kale with chopped boiled eggs, chopped bacon, a sprinkling of green onions, tomato slices, avocado, and whatever dressing you prefer.",
  "tyn_model":[
    "eggs",
    "spinach",
    "vegetables",
    "veggies",
    "butter",
    "bell pepper",
    "tomatoes",
    "salt and pepper",
    "sweet potato",
    "hummus",
    "olive oil",
    "yellow squash",
    "cabbage",
    "salsa",
    "sweet potatoes",
    "cinnamon",
    "avocado",
    "microwave",
    "tomato",
    "broccoli",
    "onion",
    "cheese",
    "potatoes",
    "onions",
    "beans",
    "mushrooms",
    "oatmeal",
    "yogurt",
    "tortilla",
    "cucumber",
    "airtight container",
    "nuts",
    "salad",
    "frying pan",
    "scrambled eggs",
    "whole grain toast",
    "potato hash",
    "bell peppers",
    "radishes",
    "squash",
    "cauliflower",
    "egg",
    "carrots",
    "raisins",
    "pancake batter",
    "carrot cake pancakes",
    "zucchini",
    "pumpkin",
    "peppers",
    "canned beans",
    "poached egg",
    "plain yogurt",
    "greek yogurt",
    "bowl",
    "kale",
    "portabella mushroom cap",
    "parmesan cheese",
    "container",
    "veggie sticks",
    "banana",
    "celery",
    "baby carrots",
    "oranges",
    "apple",
    "beets",
    "berries",
    "pomegranate",
    "pumpkin muffins",
    "carrot muffins",
    "12-cup muffin tin",
    "italian seasoning",
    "knife",
    "feta or cheddar cheese",
    "whole-grain bread",
    "unsweetened nut butter",
    "greens",
    "fork",
    "salads",
    "yogurt-based dressing",
    "bacon",
    "green onions"
  ],
  "tyn_section":[

  ]
}