{
  "title":"How to Make Hanukkah Jello Shots",
  "url":"https://www.wikihow.com/Make-Hanukkah-Jello-Shots",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Mixed Drink Shooters and Shots",
    "Jello and Jelly Shots"
  ],
  "steps":[
    {
      "headline":"Spray a loaf pan lightly with nonstick cooking spray.",
      "description":""
    },
    {
      "headline":"Combine the vodka and the Curaçao in a saucepan.",
      "description":""
    },
    {
      "headline":"Add the simple syrup and stir the ingredients with a whisk.",
      "description":"If you want a bluer Jello shot, add food coloring at this time until the liquid is the shade that you desire."
    },
    {
      "headline":"Sprinkle the liquid with the gelatin, allowing the mixture to bloom for 1 to 2 minutes.",
      "description":""
    },
    {
      "headline":"Place the saucepan on a stovetop.",
      "description":"Over low heat, whisk the ingredients together for 5 minutes, or until the gelatin has completely dissolved."
    },
    {
      "headline":"Pour the gelatin mixture into the loaf pan.",
      "description":"Refrigerate the gelatin for 4 hours or overnight."
    },
    {
      "headline":"Loosen the gelatin from the sides of the loaf pan using an offset spatula or a whisk.",
      "description":""
    },
    {
      "headline":"Support the gelatin with your palm as you invert the loaf pan over a cutting board.",
      "description":""
    },
    {
      "headline":"Gently lower the gelatin down onto the board to prevent breakage.",
      "description":""
    },
    {
      "headline":"Slice the gelatin into squares using a sharp chef’s knife.",
      "description":""
    },
    {
      "headline":"Place the shots on a tray and sprinkle them with edible gold leaf.",
      "description":""
    }
  ],
  "text":" Spray a loaf pan lightly with nonstick cooking spray.  Combine the vodka and the Curaçao in a saucepan.  Add the simple syrup and stir the ingredients with a whisk. If you want a bluer Jello shot, add food coloring at this time until the liquid is the shade that you desire. Sprinkle the liquid with the gelatin, allowing the mixture to bloom for 1 to 2 minutes.  Place the saucepan on a stovetop. Over low heat, whisk the ingredients together for 5 minutes, or until the gelatin has completely dissolved. Pour the gelatin mixture into the loaf pan. Refrigerate the gelatin for 4 hours or overnight. Loosen the gelatin from the sides of the loaf pan using an offset spatula or a whisk.  Support the gelatin with your palm as you invert the loaf pan over a cutting board.  Gently lower the gelatin down onto the board to prevent breakage.  Slice the gelatin into squares using a sharp chef’s knife.  Place the shots on a tray and sprinkle them with edible gold leaf. ",
  "tyn_model":[
    "gelatin",
    "loaf pan",
    "saucepan",
    "whisk",
    "nonstick cooking spray",
    "vodka",
    "curaçao",
    "simple syrup",
    "food coloring",
    "stovetop.",
    "spatula",
    "cutting board",
    "chef’s knife",
    "tray",
    "edible gold leaf"
  ],
  "tyn_section":[

  ]
}