{
  "title":"How to Make Granola Bars",
  "url":"https://www.wikihow.com/Make-Granola-Bars",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Bars and Slices"
  ],
  "methods":[
    {
      "name":"Simple Granola Bar",
      "steps":[
        {
          "headline":"Preheat your oven to 350°F (180°C).",
          "description":""
        },
        {
          "headline":"Place the oats and sesame seeds on a cookie sheet.",
          "description":"Place 1 cup of oats and 1 cup of sesame seeds on the cooking sheet."
        },
        {
          "headline":"Lightly toast the oats and sesame seeds.",
          "description":"Place the cookie sheet in the oven for 4-6 minutes. Then, remove them from the oven and let them cool."
        },
        {
          "headline":"Mix the sugar, honey, and tahini together in a bowl.",
          "description":"Mix ¼  cup of brown sugar, ¼  cup of honey, and ¼  cup of concentrated tahini together in a bowl."
        },
        {
          "headline":"Place them in a small saucepan and cook them on low for 1 minute.",
          "description":"This will heat up and combine the ingredients."
        },
        {
          "headline":"Add the toasted ingredients and the remaining ingredients to a pot.",
          "description":"Place the toasted oats and sesame seeds, the sugar, honey, and tahini mix, and ¼  cup of chocolate chips, ¼  cup of almonds, ½ cup of shredded coconut, and ½ cup of raisins together in a bowl."
        },
        {
          "headline":"Mix well.",
          "description":"Mix the ingredients until you’ve thoroughly combined the flavors."
        },
        {
          "headline":"Put the mixture in a 9 x 12 inch baking pan.",
          "description":""
        },
        {
          "headline":"Cover the pan with a sheet of baking paper and press down firmly.",
          "description":"This will make it so that the mixture is tightly packed in the pan."
        },
        {
          "headline":"Put the pan in the fridge for 10 minutes.",
          "description":"This will make the granola harden."
        },
        {
          "headline":"Cut the granola into bars or squares.",
          "description":""
        },
        {
          "headline":"Return it to the fridge for 30 minutes.",
          "description":""
        },
        {
          "headline":"Separate the pieces and store in the fridge or freezer in an airtight container.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"When you’re ready to eat this tasty treat, serve it at room temperature."
        }
      ]
    },
    {
      "name":"Fruity Granola Bar",
      "steps":[
        {
          "headline":"Preheat your oven to 350°F (180°C).",
          "description":""
        },
        {
          "headline":"Butter an 8 x 12-inch backing dish.",
          "description":"Line the dish with parchment paper. This will ensure that the granola won’t burn or stick to the dish."
        },
        {
          "headline":"Toss 2 cups of old-fashioned oatmeal, 1 cup of sliced almonds, and 1 cup of shredded coconut together on a sheet pan.",
          "description":""
        },
        {
          "headline":"Bake them for 10-12 minutes.",
          "description":"Stir the mix occasionally, until it’s lightly browned."
        },
        {
          "headline":"Transfer these ingredients to a large mixing bowl.",
          "description":""
        },
        {
          "headline":"Stir in ½ cup toasted of wheat germ.",
          "description":""
        },
        {
          "headline":"Reduce the oven temperature to 300°F (149°C).",
          "description":""
        },
        {
          "headline":"Place 3 tbsp.",
          "description":"of unsalted butter, 2/3 cups of honey, ¼  cups of light brown sugar, 1 ½ tsp. of pure vanilla extract, and ¼ tsp. of Kosher salt into a small saucepan."
        },
        {
          "headline":"Bring these ingredients to a boil over medium heat.",
          "description":""
        },
        {
          "headline":"Cook and stir these ingredients for one minute.",
          "description":""
        },
        {
          "headline":"Pour them over the toasted oatmeal mixture.",
          "description":"This creamy mixture will add a sweet and delicious flavor to the toasted oatmeal."
        },
        {
          "headline":"Add the dried fruit to the mixture.",
          "description":"Add ½ cup of chopped pitted dates, ½ cup of chopped dried apricots, and ½ cup of dried cranberries to the mixture. Stir all of the ingredients together."
        },
        {
          "headline":"Pour the mixture into the pan.",
          "description":""
        },
        {
          "headline":"Lightly press the mixture evenly into the pan.",
          "description":"You can do this with a spoon or with your fingers – just wet them lightly."
        },
        {
          "headline":"Bake the granola for 25-30 minutes.",
          "description":"Bake it until it’s light golden brown."
        },
        {
          "headline":"Cool the granola for 2-3 hours.",
          "description":"The granola will develop a firmer shape during this time."
        },
        {
          "headline":"Serve.",
          "description":"Serve this tasty granola at room temperature."
        }
      ]
    },
    {
      "name":"Peanut Butter Granola Bar",
      "steps":[
        {
          "headline":"Preheat your oven to 350°F (180°C).",
          "description":"Place an oven rack in the middle of the oven."
        },
        {
          "headline":"Make the flour mixture.",
          "description":"Combine 3/4 cup of all-purpose flour, ½ cup of whole-wheat flour, 3/4 cup of quick oats, ¼  cup of ground flax seeds, ¼  cup of wheat germ,1 tsp. of baking soda, 1 tsp. of ground cinnamon, 1 tsp. of salt, and ½ tsp. of baking powder together. Stir the ingredients to blend the flavors."
        },
        {
          "headline":"Make the dough.",
          "description":"Use a stand mixer to cream together 1 stick of unsalted butter at room temperature,½ cup of coconut oil,½ cup of brown sugar, 1/3 cup of honey, and 1/3 cup of peanut butter. Continue to cream them until the mixture is smooth and creamy – this should take about 4 minutes. To thoroughly mix the ingredients, scrape down the bowl halfway through."
        },
        {
          "headline":"Add one egg to the creamed ingredients.",
          "description":"Stir the egg into the rest of the ingredients until it’s thoroughly combined with them."
        },
        {
          "headline":"Add the flour mixture to the dough mixture.",
          "description":"Mix them together until you’ve created one incorporated mixture."
        },
        {
          "headline":"Fold the granola and fruit into the mixture.",
          "description":"Fold in 1 3/4 cup of granola, 1 cup of dried cherries, and ½ cup of unsweetened shredded coconut into the mixture."
        },
        {
          "headline":"Place a piece of parchment across the bottom of a 9 x 13-inch baking pan.",
          "description":""
        },
        {
          "headline":"Spray the pan with nonstick spray.",
          "description":""
        },
        {
          "headline":"Place the dough on the pan.",
          "description":"Cover it with plastic wrap."
        },
        {
          "headline":"Gently press the dough into the pan until it’s spread out.",
          "description":"You can do this with your hands or a spatula or another flat cooking utensil."
        },
        {
          "headline":"Bake the dough for 35-40 minutes.",
          "description":"Bake it until the edges start to brown and an inserted toothpick comes out clean."
        },
        {
          "headline":"Remove from the oven.",
          "description":"Let it cool in the pan for 15-20 minutes. This will make the granola harden a bit."
        },
        {
          "headline":"Lift the parchment onto a cooling rack and let it cool completely.",
          "description":"Let it cool for 2-3 more hours. If you move the granola too soon, it will crumble."
        },
        {
          "headline":"Move the granola to a cutting board and cut it into bars.",
          "description":"Use a large knife or a bench scraper to cut the granola. The bars should be about 3 x 1 inches each."
        },
        {
          "headline":"Serve.",
          "description":"Enjoy this delicious tasty treat any time."
        }
      ]
    },
    {
      "name":"Chocolate Banana Granola Bar",
      "steps":[
        {
          "headline":"Preheat your oven to 325°F (162°C).",
          "description":""
        },
        {
          "headline":"Spread the almonds and cashews on a cookie sheet.",
          "description":"Spread ½ cup of slivered almonds and 1 ½ cups of chopped cashews on a cookie sheet."
        },
        {
          "headline":"Toast them in the oven for 6-8 minutes.",
          "description":"This could take a bit more or less time – just toast them until they turn a little bit brown."
        },
        {
          "headline":"Remove them from the oven.",
          "description":""
        },
        {
          "headline":"Grease a 9 x 13-inch baking dish with butter.",
          "description":"Set it aside when you’re done."
        },
        {
          "headline":"Mix the oats, rice cereal, banana chips, and chocolate chips in a big bowl.",
          "description":"Mix 1 ½ cups of rolled oats, 1 ½ cups of brown rice crisp cereal, 1 cup of banana chips, and ¼ cup of dark chocolate chips in a big bowl."
        },
        {
          "headline":"Add the cooled nuts to the mixture.",
          "description":"Once the nuts have cooled, add them to the other ingredients and stir them to combine the flavors."
        },
        {
          "headline":"Heat the remaining ingredients in a small saucepan over medium-high heat.",
          "description":"Heat 1 cup of brown rice syrup, ¼  cup of Grade B maple syrup, ½ tsp. of salt, and 1 tsp. of vanilla extract together. Stir the ingredients to prevent them from burning."
        },
        {
          "headline":"Cook for an additional 3-5 minutes after the syrups come to a light boil.",
          "description":"This will make the syrup thicken."
        },
        {
          "headline":"Pour the syrup over the oats and nuts.",
          "description":"Mix the ingredients together so the syrup covers everything in the bowl."
        },
        {
          "headline":"Pour the contents of the bowl into the baking dish.",
          "description":"Use a spatula or your hands to pat the granola ingredients down so they’re flatly adhered to the pan."
        },
        {
          "headline":"Let the ingredients  stand for 2-3 hours to thicken.",
          "description":""
        },
        {
          "headline":"Cut them into squares or rectangles.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Enjoy this tasty treat at room temperature."
        }
      ]
    }
  ],
  "text":" Simple Granola Bar Preheat your oven to 350°F (180°C).  Place the oats and sesame seeds on a cookie sheet. Place 1 cup of oats and 1 cup of sesame seeds on the cooking sheet. Lightly toast the oats and sesame seeds. Place the cookie sheet in the oven for 4-6 minutes. Then, remove them from the oven and let them cool. Mix the sugar, honey, and tahini together in a bowl. Mix ¼  cup of brown sugar, ¼  cup of honey, and ¼  cup of concentrated tahini together in a bowl. Place them in a small saucepan and cook them on low for 1 minute. This will heat up and combine the ingredients. Add the toasted ingredients and the remaining ingredients to a pot. Place the toasted oats and sesame seeds, the sugar, honey, and tahini mix, and ¼  cup of chocolate chips, ¼  cup of almonds, ½ cup of shredded coconut, and ½ cup of raisins together in a bowl. Mix well. Mix the ingredients until you’ve thoroughly combined the flavors. Put the mixture in a 9 x 12 inch baking pan.  Cover the pan with a sheet of baking paper and press down firmly. This will make it so that the mixture is tightly packed in the pan. Put the pan in the fridge for 10 minutes. This will make the granola harden. Cut the granola into bars or squares.  Return it to the fridge for 30 minutes.  Separate the pieces and store in the fridge or freezer in an airtight container.  Serve. When you’re ready to eat this tasty treat, serve it at room temperature. Fruity Granola Bar Preheat your oven to 350°F (180°C).  Butter an 8 x 12-inch backing dish. Line the dish with parchment paper. This will ensure that the granola won’t burn or stick to the dish. Toss 2 cups of old-fashioned oatmeal, 1 cup of sliced almonds, and 1 cup of shredded coconut together on a sheet pan.  Bake them for 10-12 minutes. Stir the mix occasionally, until it’s lightly browned. Transfer these ingredients to a large mixing bowl.  Stir in ½ cup toasted of wheat germ.  Reduce the oven temperature to 300°F (149°C).  Place 3 tbsp. of unsalted butter, 2/3 cups of honey, ¼  cups of light brown sugar, 1 ½ tsp. of pure vanilla extract, and ¼ tsp. of Kosher salt into a small saucepan. Bring these ingredients to a boil over medium heat.  Cook and stir these ingredients for one minute.  Pour them over the toasted oatmeal mixture. This creamy mixture will add a sweet and delicious flavor to the toasted oatmeal. Add the dried fruit to the mixture. Add ½ cup of chopped pitted dates, ½ cup of chopped dried apricots, and ½ cup of dried cranberries to the mixture. Stir all of the ingredients together. Pour the mixture into the pan.  Lightly press the mixture evenly into the pan. You can do this with a spoon or with your fingers – just wet them lightly. Bake the granola for 25-30 minutes. Bake it until it’s light golden brown. Cool the granola for 2-3 hours. The granola will develop a firmer shape during this time. Serve. Serve this tasty granola at room temperature. Peanut Butter Granola Bar Preheat your oven to 350°F (180°C). Place an oven rack in the middle of the oven. Make the flour mixture. Combine 3/4 cup of all-purpose flour, ½ cup of whole-wheat flour, 3/4 cup of quick oats, ¼  cup of ground flax seeds, ¼  cup of wheat germ,1 tsp. of baking soda, 1 tsp. of ground cinnamon, 1 tsp. of salt, and ½ tsp. of baking powder together. Stir the ingredients to blend the flavors. Make the dough. Use a stand mixer to cream together 1 stick of unsalted butter at room temperature,½ cup of coconut oil,½ cup of brown sugar, 1/3 cup of honey, and 1/3 cup of peanut butter. Continue to cream them until the mixture is smooth and creamy – this should take about 4 minutes. To thoroughly mix the ingredients, scrape down the bowl halfway through. Add one egg to the creamed ingredients. Stir the egg into the rest of the ingredients until it’s thoroughly combined with them. Add the flour mixture to the dough mixture. Mix them together until you’ve created one incorporated mixture. Fold the granola and fruit into the mixture. Fold in 1 3/4 cup of granola, 1 cup of dried cherries, and ½ cup of unsweetened shredded coconut into the mixture. Place a piece of parchment across the bottom of a 9 x 13-inch baking pan.  Spray the pan with nonstick spray.  Place the dough on the pan. Cover it with plastic wrap. Gently press the dough into the pan until it’s spread out. You can do this with your hands or a spatula or another flat cooking utensil. Bake the dough for 35-40 minutes. Bake it until the edges start to brown and an inserted toothpick comes out clean. Remove from the oven. Let it cool in the pan for 15-20 minutes. This will make the granola harden a bit. Lift the parchment onto a cooling rack and let it cool completely. Let it cool for 2-3 more hours. If you move the granola too soon, it will crumble. Move the granola to a cutting board and cut it into bars. Use a large knife or a bench scraper to cut the granola. The bars should be about 3 x 1 inches each. Serve. Enjoy this delicious tasty treat any time. Chocolate Banana Granola Bar Preheat your oven to 325°F (162°C).  Spread the almonds and cashews on a cookie sheet. Spread ½ cup of slivered almonds and 1 ½ cups of chopped cashews on a cookie sheet. Toast them in the oven for 6-8 minutes. This could take a bit more or less time – just toast them until they turn a little bit brown. Remove them from the oven.  Grease a 9 x 13-inch baking dish with butter. Set it aside when you’re done. Mix the oats, rice cereal, banana chips, and chocolate chips in a big bowl. Mix 1 ½ cups of rolled oats, 1 ½ cups of brown rice crisp cereal, 1 cup of banana chips, and ¼ cup of dark chocolate chips in a big bowl. Add the cooled nuts to the mixture. Once the nuts have cooled, add them to the other ingredients and stir them to combine the flavors. Heat the remaining ingredients in a small saucepan over medium-high heat. Heat 1 cup of brown rice syrup, ¼  cup of Grade B maple syrup, ½ tsp. of salt, and 1 tsp. of vanilla extract together. Stir the ingredients to prevent them from burning. Cook for an additional 3-5 minutes after the syrups come to a light boil. This will make the syrup thicken. Pour the syrup over the oats and nuts. Mix the ingredients together so the syrup covers everything in the bowl. Pour the contents of the bowl into the baking dish. Use a spatula or your hands to pat the granola ingredients down so they’re flatly adhered to the pan. Let the ingredients  stand for 2-3 hours to thicken.  Cut them into squares or rectangles.  Serve. Enjoy this tasty treat at room temperature.",
  "tyn_model":[
    "oven",
    "granola",
    "bowl",
    "oats",
    "honey",
    "cookie sheet",
    "almonds",
    "sesame seeds",
    "small saucepan",
    "granola bar",
    "sugar",
    "tahini",
    "brown sugar",
    "chocolate chips",
    "baking pan",
    "fridge",
    "unsalted butter",
    "pan",
    "– just",
    "flour",
    "salt",
    "parchment",
    "spatula",
    "cashews",
    "baking dish",
    "banana chips",
    "cooking sheet",
    "pot",
    "coconut",
    "raisins",
    "baking paper",
    "airtight container",
    "parchment paper",
    "old-fashioned oatmeal",
    "shredded coconut",
    "sheet pan",
    "large mixing bowl",
    "wheat germ",
    "light brown sugar",
    "pure vanilla",
    "kosher salt",
    "toasted oatmeal",
    "dates",
    "apricots",
    "cranberries",
    "spoon",
    "peanut butter granola",
    "oven rack",
    "all-purpose flour",
    "whole-wheat flour",
    "quick oats",
    "ground flax seeds",
    "wheat germ,1",
    "baking soda",
    "ground cinnamon",
    "baking powder",
    "stand mixer",
    "coconut oil,½",
    "peanut butter",
    "cream",
    "– this",
    "fruit",
    "unsweetened shredded coconut",
    "nonstick spray",
    "plastic wrap",
    "cutting board",
    "large knife",
    "bench scraper",
    "chocolate banana granola bar",
    "butter",
    "rice cereal",
    "rolled oats",
    "brown rice crisp cereal",
    "dark chocolate chips",
    "brown rice syrup",
    "grade b maple syrup",
    "vanilla extract",
    "nuts"
  ],
  "tyn_section":[

  ]
}