{
  "title":"How to Make Clafoutis",
  "url":"https://www.wikihow.com/Make-Clafoutis",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Pastries",
    "French Pastries"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350°F (180°C) while you prepare a ceramic or glass tart pan by very lightly oiling the bottom and sides.",
      "description":""
    },
    {
      "headline":"Add the flour, sugar and cinnamon to a medium bowl",
      "description":""
    },
    {
      "headline":"Whisk the dry ingredients together and then set them aside.",
      "description":""
    },
    {
      "headline":"In another medium bowl, lightly beat the eggs with the whisk until they become foamy.",
      "description":""
    },
    {
      "headline":"Beat the milk and vanilla into the eggs until they’re well combined.",
      "description":""
    },
    {
      "headline":"Whisk the egg mixture into the flour mixture gradually, whisking until the batter is smooth and lump-free.",
      "description":""
    },
    {
      "headline":"Pour 1/3 of the batter into the cake pan.",
      "description":""
    },
    {
      "headline":"Bake at dish (?)",
      "description":"for 5 to 7 minutes, or just until the batter begins to have a thin film on top."
    },
    {
      "headline":"Remove the pan from the oven and gently arrange the cherries evenly throughout the setting batter.",
      "description":""
    },
    {
      "headline":"Pour the remaining batter over the fruit.",
      "description":""
    },
    {
      "headline":"Return the pan to the oven and continue baking it for 40 minutes, or until the clafoutis is firm when jiggled gently.",
      "description":"It should be puffed and golden brown."
    },
    {
      "headline":"Remove the pan from the oven and cool the clafoutis (while still in the pan) on a wire rack for 10 to 15 minutes.",
      "description":""
    },
    {
      "headline":"Use a fine-mesh sieve to dust the top of the clafoutis with confectioners’ sugar before serving.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 350°F (180°C) while you prepare a ceramic or glass tart pan by very lightly oiling the bottom and sides.  Add the flour, sugar and cinnamon to a medium bowl  Whisk the dry ingredients together and then set them aside.  In another medium bowl, lightly beat the eggs with the whisk until they become foamy.  Beat the milk and vanilla into the eggs until they’re well combined.  Whisk the egg mixture into the flour mixture gradually, whisking until the batter is smooth and lump-free.  Pour 1/3 of the batter into the cake pan.  Bake at dish (?) for 5 to 7 minutes, or just until the batter begins to have a thin film on top. Remove the pan from the oven and gently arrange the cherries evenly throughout the setting batter.  Pour the remaining batter over the fruit.  Return the pan to the oven and continue baking it for 40 minutes, or until the clafoutis is firm when jiggled gently. It should be puffed and golden brown. Remove the pan from the oven and cool the clafoutis (while still in the pan) on a wire rack for 10 to 15 minutes.  Use a fine-mesh sieve to dust the top of the clafoutis with confectioners’ sugar before serving. ",
  "tyn_model":[
    "oven",
    "flour",
    "medium bowl",
    "eggs",
    "pan",
    "sugar",
    "cinnamon",
    "whisk",
    "milk",
    "vanilla",
    "cake pan",
    "cherries",
    "fruit",
    "fine-mesh sieve",
    "confectioners’ sugar"
  ],
  "tyn_section":[

  ]
}