{
  "title":"How to Have an Egg Race",
  "url":"https://www.wikihow.com/Have-an-Egg-Race",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games"
  ],
  "methods":[
    {
      "name":"Following Simple Rules",
      "steps":[
        {
          "headline":"Give each player a tablespoon and egg.",
          "description":"The egg can be plastic, hard-boiled, or even raw—though hard-boiled eggs tend to work the best. Make sure everyone who is playing has both an egg and a spoon big enough to hold the egg before they start the race."
        },
        {
          "headline":"Stand at the start line with the egg and spoons ready.",
          "description":"To create the start line, you can put down a piece of rope or tape, or even just line everyone up evenly along the grass or floor. Have everyone place the egg carefully on their spoon so they’re ready to go! It’s common for people to hold one arm behind their back as they do the egg race while the other arm balances the egg, though this isn’t required. Make sure everyone knows where they’re trying to go, and that the finish line is clear and visible."
        },
        {
          "headline":"Begin the race with a specific word or sound.",
          "description":"You can blow a whistle, wave a flag, or say the word “go!” Make sure everyone is clear about the signal for starting the race so that each player starts at the same time."
        },
        {
          "headline":"Go quickly to the finish line while preventing the egg from falling.",
          "description":"Each player should walk or run to the finish line, focusing on keeping the egg on their spoon so it doesn’t fall. If an egg falls off of a spoon, that player needs to return to the start line and start over again. It’s best to start out walking instead of running to ensure you keep your egg balanced. If you’re playing with super young children, you can alter the rules so each player doesn’t have to go all the way back to the start line if their egg falls."
        },
        {
          "headline":"Win the race by crossing the finish line with your balanced egg first.",
          "description":"Once you’ve made it to the finish line without dropping your egg, you win! Consider having a first, second, and third place winner, or giving each player a time and seeing if they can beat their own personal record. If you started the game with one arm behind your back, it’s important that you cross the finish line with that arm still behind your back."
        }
      ]
    },
    {
      "name":"Altering the Race",
      "steps":[
        {
          "headline":"Make the egg race into a relay for added suspense.",
          "description":"Form teams of at least two players and have one player walk the egg to a designated spot before handing off the egg and spoon to their teammate. The team who gets their egg to the finish line first wins! Have one relay team share one spoon and egg, or give each player their own spoon and egg to avoid the hand-off. The designated spot to switch players could be a tree, fence, cone, or any other recognizable item."
        },
        {
          "headline":"Add obstacles to make the egg race more challenging.",
          "description":"These could be obstacles like weaving in between cones, stepping over ropes, or navigating around trees. Set the obstacles up beforehand and make sure the course is doable before having everyone start. Line up cones for everyone to walk in and out of, or set up an elaborate obstacle course with many different activities to make the race more entertaining."
        },
        {
          "headline":"Use different kinds of eggs depending on the age group.",
          "description":"If you’re doing the egg race with young kids, plastic eggs are a good option as they won’t make a mess, and you can even fill them with things. Hard-boiled eggs are good for older kids and adults, and if you’re feeling adventurous, you could even use raw eggs. If you don’t have eggs or you run out of them, you can also use ping pong balls or other small balls that will fit in a tablespoon."
        },
        {
          "headline":"Carry the spoon in your mouth for a fun alternative to using your hands.",
          "description":"Instead of having all the players carry the egg and spoon in their hand, have each player put the handle of the spoon in their mouth, balancing the egg as they walk. This will take extra balancing skills and more focus! Use plastic spoons for easy cleanup, or regular metal kitchen spoons to make balancing the egg easier."
        },
        {
          "headline":"Switch up your movements to make the walking more fun.",
          "description":"Ask everyone to waddle like a duck, hop like a rabbit, or even crawl like a crab. These new movements will make the race more difficult while also making it even more entertaining. Have each player walk backwards for an even trickier egg race. If your movements require moving on the ground or walking without being able to see where you’re going, it’s important to make sure the path is clear so there aren’t any injuries."
        }
      ]
    }
  ],
  "text":" Following Simple Rules Give each player a tablespoon and egg. The egg can be plastic, hard-boiled, or even raw—though hard-boiled eggs tend to work the best. Make sure everyone who is playing has both an egg and a spoon big enough to hold the egg before they start the race. Stand at the start line with the egg and spoons ready. To create the start line, you can put down a piece of rope or tape, or even just line everyone up evenly along the grass or floor. Have everyone place the egg carefully on their spoon so they’re ready to go! It’s common for people to hold one arm behind their back as they do the egg race while the other arm balances the egg, though this isn’t required. Make sure everyone knows where they’re trying to go, and that the finish line is clear and visible. Begin the race with a specific word or sound. You can blow a whistle, wave a flag, or say the word “go!” Make sure everyone is clear about the signal for starting the race so that each player starts at the same time. Go quickly to the finish line while preventing the egg from falling. Each player should walk or run to the finish line, focusing on keeping the egg on their spoon so it doesn’t fall. If an egg falls off of a spoon, that player needs to return to the start line and start over again. It’s best to start out walking instead of running to ensure you keep your egg balanced. If you’re playing with super young children, you can alter the rules so each player doesn’t have to go all the way back to the start line if their egg falls. Win the race by crossing the finish line with your balanced egg first. Once you’ve made it to the finish line without dropping your egg, you win! Consider having a first, second, and third place winner, or giving each player a time and seeing if they can beat their own personal record. If you started the game with one arm behind your back, it’s important that you cross the finish line with that arm still behind your back. Altering the Race Make the egg race into a relay for added suspense. Form teams of at least two players and have one player walk the egg to a designated spot before handing off the egg and spoon to their teammate. The team who gets their egg to the finish line first wins! Have one relay team share one spoon and egg, or give each player their own spoon and egg to avoid the hand-off. The designated spot to switch players could be a tree, fence, cone, or any other recognizable item. Add obstacles to make the egg race more challenging. These could be obstacles like weaving in between cones, stepping over ropes, or navigating around trees. Set the obstacles up beforehand and make sure the course is doable before having everyone start. Line up cones for everyone to walk in and out of, or set up an elaborate obstacle course with many different activities to make the race more entertaining. Use different kinds of eggs depending on the age group. If you’re doing the egg race with young kids, plastic eggs are a good option as they won’t make a mess, and you can even fill them with things. Hard-boiled eggs are good for older kids and adults, and if you’re feeling adventurous, you could even use raw eggs. If you don’t have eggs or you run out of them, you can also use ping pong balls or other small balls that will fit in a tablespoon. Carry the spoon in your mouth for a fun alternative to using your hands. Instead of having all the players carry the egg and spoon in their hand, have each player put the handle of the spoon in their mouth, balancing the egg as they walk. This will take extra balancing skills and more focus! Use plastic spoons for easy cleanup, or regular metal kitchen spoons to make balancing the egg easier. Switch up your movements to make the walking more fun. Ask everyone to waddle like a duck, hop like a rabbit, or even crawl like a crab. These new movements will make the race more difficult while also making it even more entertaining. Have each player walk backwards for an even trickier egg race. If your movements require moving on the ground or walking without being able to see where you’re going, it’s important to make sure the path is clear so there aren’t any injuries.",
  "tyn_model":[
    "spoon",
    "eggs",
    "spoons",
    "egg",
    "cones",
    "—though",
    "rope",
    "tape",
    "“go",
    "” make",
    "cone",
    "ping pong balls"
  ],
  "tyn_section":[

  ]
}