{
  "title":"How to Make Cioppino",
  "url":"https://www.wikihow.com/Make-Cioppino",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Soups",
    "Seafood and Fish Soups"
  ],
  "methods":[
    {
      "name":"Roast the Tomatoes",
      "steps":[
        {
          "headline":"Preheat the oven to 425°F (220°C) and spray a baking sheet with nonstick cooking spray.",
          "description":""
        },
        {
          "headline":"Lay the tomato slices on the sheet and drizzle the tops with 2 tablespoons of the olive oil.",
          "description":""
        },
        {
          "headline":"Sprinkle the tops of the tomatoes with salt and pepper.",
          "description":""
        },
        {
          "headline":"Roast the tomatoes for 30 to 40 minutes or until the tomatoes are caramelized.",
          "description":"Allow the tomatoes to cool until you can easily handle them."
        },
        {
          "headline":"Roughly chop the tomatoes and place them into a large bowl.",
          "description":""
        }
      ]
    },
    {
      "name":"Prepare the Vegetables",
      "steps":[
        {
          "headline":"Heat the remaining tablespoon of olive oil in a large stockpot or Dutch oven.",
          "description":""
        },
        {
          "headline":"Cook the onions, celery, fennel and carrots for about 10 minutes, stirring occasionally so that they do not brown and dry out.",
          "description":""
        },
        {
          "headline":"Add the garlic and cook the vegetables for an additional 10 to 15 minutes, or until the onions are translucent and all of the vegetables have softened.",
          "description":""
        },
        {
          "headline":"Add the 1 teaspoon of salt, the red wine, fish stock, saffron and orange zest to the vegetables.",
          "description":""
        },
        {
          "headline":"Add the reserved tomatoes to the pot.",
          "description":""
        },
        {
          "headline":"Bring the soup to a simmer and simmer the vegetables and stock for 5 minutes, stirring occasionally.",
          "description":""
        }
      ]
    },
    {
      "name":"Add the Seafood",
      "steps":[
        {
          "headline":"Place the mussels and clams in the stock.",
          "description":"Cover the pot with a lid and cook the shellfish for 2 minutes."
        },
        {
          "headline":"Stir in the shrimp and the monkfish and then cover and cook the soup for 2 additional minutes.",
          "description":""
        },
        {
          "headline":"Stir in the squid and cook the soup for 1 more minute.",
          "description":""
        },
        {
          "headline":"Remove the lid and check to see that the seafood is done but not overcooked.",
          "description":"The mussels and clams should be open, the shrimp should be pink, and the monkfish and squid should be tender when pierced with a fork."
        },
        {
          "headline":"Taste the soup and add additional salt and pepper to taste.",
          "description":""
        },
        {
          "headline":"Add the parsley and basil.",
          "description":""
        },
        {
          "headline":"Serve the soup with a piece of sourdough bread and with Tabasco sauce for those who prefer a little extra spiciness in their soup.",
          "description":""
        }
      ]
    }
  ],
  "text":" Roast the Tomatoes Preheat the oven to 425°F (220°C) and spray a baking sheet with nonstick cooking spray.  Lay the tomato slices on the sheet and drizzle the tops with 2 tablespoons of the olive oil.  Sprinkle the tops of the tomatoes with salt and pepper.  Roast the tomatoes for 30 to 40 minutes or until the tomatoes are caramelized. Allow the tomatoes to cool until you can easily handle them. Roughly chop the tomatoes and place them into a large bowl.  Prepare the Vegetables Heat the remaining tablespoon of olive oil in a large stockpot or Dutch oven.  Cook the onions, celery, fennel and carrots for about 10 minutes, stirring occasionally so that they do not brown and dry out.  Add the garlic and cook the vegetables for an additional 10 to 15 minutes, or until the onions are translucent and all of the vegetables have softened.  Add the 1 teaspoon of salt, the red wine, fish stock, saffron and orange zest to the vegetables.  Add the reserved tomatoes to the pot.  Bring the soup to a simmer and simmer the vegetables and stock for 5 minutes, stirring occasionally.  Add the Seafood Place the mussels and clams in the stock. Cover the pot with a lid and cook the shellfish for 2 minutes. Stir in the shrimp and the monkfish and then cover and cook the soup for 2 additional minutes.  Stir in the squid and cook the soup for 1 more minute.  Remove the lid and check to see that the seafood is done but not overcooked. The mussels and clams should be open, the shrimp should be pink, and the monkfish and squid should be tender when pierced with a fork. Taste the soup and add additional salt and pepper to taste.  Add the parsley and basil.  Serve the soup with a piece of sourdough bread and with Tabasco sauce for those who prefer a little extra spiciness in their soup. ",
  "tyn_model":[
    "tomatoes",
    "olive oil",
    "salt and pepper",
    "onions",
    "vegetables",
    "pot",
    "stock",
    "seafood",
    "mussels",
    "shrimp",
    "monkfish",
    "squid",
    "oven",
    "baking sheet",
    "nonstick cooking spray",
    "tomato",
    "large stockpot or dutch oven",
    "celery",
    "fennel",
    "carrots",
    "garlic",
    "salt",
    "red wine",
    "fish stock",
    "saffron",
    "orange zest",
    "clams",
    "shellfish",
    "fork",
    "parsley",
    "basil",
    "sourdough bread",
    "tabasco sauce"
  ],
  "tyn_section":[

  ]
}