{
  "title":"How to Make an American Girl Doll Fridge",
  "url":"https://www.wikihow.com/Make-an-American-Girl-Doll-Fridge",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Dolls and Doll Houses",
    "Fashion Dolls",
    "American Girl Dolls"
  ],
  "methods":[
    {
      "name":"Fridge from a small box",
      "steps":[
        {
          "headline":"Find a small box.",
          "description":"For example, use a box from American Girl that had clothing or any other items enclosed."
        },
        {
          "headline":"Make the shelves from cardstock or cardboard.",
          "description":"Measure the width and depth of the box and cut several pieces of car to that width and depth."
        },
        {
          "headline":"Hot glue each shelf in place.",
          "description":"Keep the shelves as straight as possible, and don't overcrowd them."
        },
        {
          "headline":"Fill the shelves with food.",
          "description":"The food can be made by cutting out magazine images and gluing them to a card, or using lightweight doll house food or (if you have any) you can use Shopkins."
        },
        {
          "headline":"Use chapstick lids and toothpaste caps as cups.",
          "description":""
        }
      ]
    },
    {
      "name":"Fridge from a shoe box",
      "steps":[
        {
          "headline":"Get hold of an unwanted shoe box.",
          "description":"It should be of the type that opens and closes."
        },
        {
          "headline":"Cut the top part in half.",
          "description":"Do not cut all the way."
        },
        {
          "headline":"Take a piece of cardboard that fits nicely in one half of the inside of the box.",
          "description":"This is the shelf. You can add more but you can leave it this simple if you like––it leaves more space for storage when not in play."
        },
        {
          "headline":"Add food and other supplies.",
          "description":"See the previous method for food ideas."
        }
      ]
    }
  ],
  "text":" Fridge from a small box Find a small box. For example, use a box from American Girl that had clothing or any other items enclosed. Make the shelves from cardstock or cardboard. Measure the width and depth of the box and cut several pieces of car to that width and depth. Hot glue each shelf in place. Keep the shelves as straight as possible, and don't overcrowd them. Fill the shelves with food. The food can be made by cutting out magazine images and gluing them to a card, or using lightweight doll house food or (if you have any) you can use Shopkins. Use chapstick lids and toothpaste caps as cups.  Fridge from a shoe box Get hold of an unwanted shoe box. It should be of the type that opens and closes. Cut the top part in half. Do not cut all the way. Take a piece of cardboard that fits nicely in one half of the inside of the box. This is the shelf. You can add more but you can leave it this simple if you like––it leaves more space for storage when not in play. Add food and other supplies. See the previous method for food ideas.",
  "tyn_model":[
    "cardboard",
    "food",
    "american girl that",
    "hot glue",
    "chapstick lids",
    "toothpaste caps",
    "cups",
    "fridge",
    "shoe box"
  ],
  "tyn_section":[

  ]
}