{
  "title":"How to Set Up a Wacom Tablet",
  "url":"https://www.wikihow.com/Set-Up-a-Wacom-Tablet",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Styles",
    "Digital Drawing"
  ],
  "steps":[
    {
      "headline":"Decide which model of Wacom tablet you would wish to buy.",
      "description":"Each tablet has their own pros and cons, and are made for different activities. Depending on what you're using it for (ex. drawing, photo editing), you be the judge yourself. The Bamboo model is the most inexpensive tablet and is made for the home and office. However, any input given will show on the computer screen instead of the tablet. Bamboo Connect is the most basic model, as it's made to draw, sketch, communicate, and connect. It also comes with a copy of Autodesk Sketchbook Express. The Bamboo Splash is similar, except it also comes with ArtRage 3. Bamboo Capture is one of the most popular models, and it includes Autodesk Sketchbook Express and Photoshop Elements. While it's made for editing photos, people who chose to buy this also uses Photoshop to draw and paint. Bamboo Create is the most expensive Bamboo model, but it comes with larger tablet space, everything listed above (except for ArtRage), and Corel Painter is also included. The Intuos was made for professionals and serious hobbyists. It comes in 4 sizes. They all come with Autodesk Sketchbook Express, Photoshop Elements, Anime Studio, and a 90 day trial of Corel Painter. While the Wacom Cintiq is the most expensive model, you can draw and see your computer screen right on the tablet. Included are the same software packed in with the Wacom Intuos."
    },
    {
      "headline":"Order your tablet.",
      "description":"You can buy it retail or on the Internet."
    },
    {
      "headline":"Download the driver.",
      "description":"This is the software that allows your computer to work with your tablet. After the tablet is received, insert the included installation disc (the driver) into your computer. This should come with your tablet. Follow the installation instructions. You can also download the driver off the Wacom site."
    },
    {
      "headline":"Using the included USB cable, connect your new tablet to your computer.",
      "description":""
    },
    {
      "headline":"Look over your accessories.",
      "description":"These include a pen and any other possible accessories you might have bought with the tablet."
    },
    {
      "headline":"Try out the accessories.",
      "description":"The accessories will be automatically programmed to work with your tablet and some may not require any batteries. Simply place them over your tablet, and they will begin working."
    },
    {
      "headline":"Know how to use the pen.",
      "description":"When using the pen, you can hover about an inch above the tablet's surface to move your cursor. To click, or draw, touch the tablet's surface. You can also customize the buttons that may be on the side of your pen and tablet. Your pen will come with extra \"nibs\", or tips that you can use for your pen. Each has a different texture to even further take your drawing experience. Some are rougher like you are drawing on paper, and others are smooth and slick. On programs that are Wacom compatible, your tablet can use sensitivity. The harder you press, the darker and thicker your lines will be. Some tablets enable touch as well. If your pen is within an inch of the screen, touch input will not register. So you can draw with your hand on the tablet!"
    },
    {
      "headline":"Do not press too hard with your pen.",
      "description":"The sensitivity springs inside might break from this. Pressing too hard can also wear away at the surface of your tablet, which is not covered by your warranty."
    },
    {
      "headline":"Draw, surf the web, or play a game with your new tablet!",
      "description":"It can completely replace your mouse. Your tablet does not have to be unplugged when you are done."
    },
    {
      "headline":"Check out the other accessories Wacom has to offer.",
      "description":"They even have ones that resemble real paintbrushes!"
    }
  ],
  "text":" Decide which model of Wacom tablet you would wish to buy. Each tablet has their own pros and cons, and are made for different activities. Depending on what you're using it for (ex. drawing, photo editing), you be the judge yourself. The Bamboo model is the most inexpensive tablet and is made for the home and office. However, any input given will show on the computer screen instead of the tablet. Bamboo Connect is the most basic model, as it's made to draw, sketch, communicate, and connect. It also comes with a copy of Autodesk Sketchbook Express. The Bamboo Splash is similar, except it also comes with ArtRage 3. Bamboo Capture is one of the most popular models, and it includes Autodesk Sketchbook Express and Photoshop Elements. While it's made for editing photos, people who chose to buy this also uses Photoshop to draw and paint. Bamboo Create is the most expensive Bamboo model, but it comes with larger tablet space, everything listed above (except for ArtRage), and Corel Painter is also included. The Intuos was made for professionals and serious hobbyists. It comes in 4 sizes. They all come with Autodesk Sketchbook Express, Photoshop Elements, Anime Studio, and a 90 day trial of Corel Painter. While the Wacom Cintiq is the most expensive model, you can draw and see your computer screen right on the tablet. Included are the same software packed in with the Wacom Intuos. Order your tablet. You can buy it retail or on the Internet. Download the driver. This is the software that allows your computer to work with your tablet. After the tablet is received, insert the included installation disc (the driver) into your computer. This should come with your tablet. Follow the installation instructions. You can also download the driver off the Wacom site. Using the included USB cable, connect your new tablet to your computer.  Look over your accessories. These include a pen and any other possible accessories you might have bought with the tablet. Try out the accessories. The accessories will be automatically programmed to work with your tablet and some may not require any batteries. Simply place them over your tablet, and they will begin working. Know how to use the pen. When using the pen, you can hover about an inch above the tablet's surface to move your cursor. To click, or draw, touch the tablet's surface. You can also customize the buttons that may be on the side of your pen and tablet. Your pen will come with extra \"nibs\", or tips that you can use for your pen. Each has a different texture to even further take your drawing experience. Some are rougher like you are drawing on paper, and others are smooth and slick. On programs that are Wacom compatible, your tablet can use sensitivity. The harder you press, the darker and thicker your lines will be. Some tablets enable touch as well. If your pen is within an inch of the screen, touch input will not register. So you can draw with your hand on the tablet! Do not press too hard with your pen. The sensitivity springs inside might break from this. Pressing too hard can also wear away at the surface of your tablet, which is not covered by your warranty. Draw, surf the web, or play a game with your new tablet! It can completely replace your mouse. Your tablet does not have to be unplugged when you are done. Check out the other accessories Wacom has to offer. They even have ones that resemble real paintbrushes!",
  "tyn_model":[
    "tablet",
    "pen",
    "autodesk sketchbook express",
    "corel painter",
    "wacom tablet",
    "wacom cintiq",
    "wacom intuos",
    "wacom site",
    "usb cable",
    "computer",
    "tablets",
    "wacom"
  ],
  "tyn_section":[

  ]
}