{
  "title":"How to Make Lavender and Cinnamon Potpourri",
  "url":"https://www.wikihow.com/Make-Lavender-and-Cinnamon-Potpourri",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts",
    "Potpourri"
  ],
  "steps":[
    {
      "headline":"Assemble the ingredients listed above.",
      "description":""
    },
    {
      "headline":"In a large glass or ceramic bowl, mix the bark and spices together.",
      "description":""
    },
    {
      "headline":"In a smaller glass or ceramic bowl, mix together the oakmoss and lavender oil.",
      "description":"When mixed, pour into the larger bowl."
    },
    {
      "headline":"Mix all ingredients together to combine.",
      "description":""
    },
    {
      "headline":"Tip the mixture into an airtight container to mature.",
      "description":"Place in a dark, warm and dry place to diffuse for two weeks or more. It's recommended that you shake the container every two days or so."
    },
    {
      "headline":"After a few weeks, check the scent.",
      "description":"If you like it, use as potpourri. If you don't think it's strong enough yet, allow it to mature some more before using."
    }
  ],
  "text":" Assemble the ingredients listed above.  In a large glass or ceramic bowl, mix the bark and spices together.  In a smaller glass or ceramic bowl, mix together the oakmoss and lavender oil. When mixed, pour into the larger bowl. Mix all ingredients together to combine.  Tip the mixture into an airtight container to mature. Place in a dark, warm and dry place to diffuse for two weeks or more. It's recommended that you shake the container every two days or so. After a few weeks, check the scent. If you like it, use as potpourri. If you don't think it's strong enough yet, allow it to mature some more before using.",
  "tyn_model":[
    "spices",
    "glass or ceramic bowl",
    "lavender oil",
    "airtight container",
    "potpourri"
  ],
  "tyn_section":[

  ]
}