{
  "title":"How to Own in Soldier of Fortune 2 Multiplayer",
  "url":"https://www.wikihow.com/Own-in-Soldier-of-Fortune-2-Multiplayer",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "PC First Person Shooter"
  ],
  "steps":[
    {
      "headline":"Practice, practice, practice.",
      "description":""
    },
    {
      "headline":"Set your graphic settings so that you can maintain 60fps (smooth gameplay) at all times.",
      "description":""
    },
    {
      "headline":"Make sure your crosshair (aimer) is small.",
      "description":"If its too big it will clog up your screen, cover the enemy and give you a harder time aiming."
    },
    {
      "headline":"Know the map.",
      "description":"By doing so you know where to expect enemies, snipe, take cover and get powerups/weapons."
    },
    {
      "headline":"Always carry a shotgun in your inventory.",
      "description":"Use it when turning tight corners."
    },
    {
      "headline":"Don't spray unless you've been taken by surprise.",
      "description":""
    },
    {
      "headline":"Fire your AK47 or M4 in quick and small bursts.",
      "description":""
    },
    {
      "headline":"Learn to aim around the head area if you can with the AK47 or M4.",
      "description":""
    },
    {
      "headline":"Jump around!",
      "description":"Your a harder to hit target like this!"
    },
    {
      "headline":"In DM servers run for the super weapons (RPG, Grenade Launcher) when they are available.",
      "description":""
    },
    {
      "headline":"If your a sniper use your Q & E buttons (peak buttons) to get a nice advantage over enemies.",
      "description":""
    },
    {
      "headline":"Use the grenades!",
      "description":"Throw flash bang grenades after holding them for 5 seconds around corners or near enemies. If your running away from an enemy, block a hall, gate or area you got passed with an incendiary grenade. Use smoke grenades  if your pinned down by a sniper or in a small area to get a slight advantage over your enemy when he is near you."
    },
    {
      "headline":"Take your chances and throw a grenade in an area where you think there can be an enemy.",
      "description":"You never know!"
    },
    {
      "headline":"Surprise enemies!",
      "description":"This is one of the best tactics I know. Do whatever you know that the enemy won't be prepared for that is effective against them. (ex. camping in a different area, being known for running away but surprising enemies by being right around a corner with a shotgun, being where they don't expect you, etc)"
    }
  ],
  "text":" Practice, practice, practice.  Set your graphic settings so that you can maintain 60fps (smooth gameplay) at all times.  Make sure your crosshair (aimer) is small. If its too big it will clog up your screen, cover the enemy and give you a harder time aiming. Know the map. By doing so you know where to expect enemies, snipe, take cover and get powerups/weapons. Always carry a shotgun in your inventory. Use it when turning tight corners. Don't spray unless you've been taken by surprise.  Fire your AK47 or M4 in quick and small bursts.  Learn to aim around the head area if you can with the AK47 or M4.  Jump around! Your a harder to hit target like this! In DM servers run for the super weapons (RPG, Grenade Launcher) when they are available.  If your a sniper use your Q & E buttons (peak buttons) to get a nice advantage over enemies.  Use the grenades! Throw flash bang grenades after holding them for 5 seconds around corners or near enemies. If your running away from an enemy, block a hall, gate or area you got passed with an incendiary grenade. Use smoke grenades  if your pinned down by a sniper or in a small area to get a slight advantage over your enemy when he is near you. Take your chances and throw a grenade in an area where you think there can be an enemy. You never know! Surprise enemies! This is one of the best tactics I know. Do whatever you know that the enemy won't be prepared for that is effective against them. (ex. camping in a different area, being known for running away but surprising enemies by being right around a corner with a shotgun, being where they don't expect you, etc)",
  "tyn_model":[
    "shotgun",
    "ak47",
    "rpg",
    "grenade launcher",
    "grenades",
    "flash bang",
    "incendiary grenade",
    "smoke grenades",
    "grenade"
  ],
  "tyn_section":[

  ]
}