{
  "title":"How to Win a Coin Toss",
  "url":"https://www.wikihow.com/Win-a-Coin-Toss",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Games of Chance"
  ],
  "methods":[
    {
      "name":"Feeling the Coin with Your Finger",
      "steps":[
        {
          "headline":"Examine the look and feel of the coin.",
          "description":"Before you host a coin toss, feel each side of the coin with your fingers. The smoother side of the coin is commonly the heads side, and the rough side with more detailing is usually the tails side. This is a great way to distinguish between both sides of the coin so you can ensure your victory."
        },
        {
          "headline":"Flip the coin upward by gently flicking your thumb.",
          "description":"To practice the coin toss, position the coin on top of your thumb. Then, move your thumb with light force to flip the coin into the air. If you use too much force, the coin will fly across the room. You may have to practice with varying forces until you get the hang of this. For best results, flip with your dominant hand."
        },
        {
          "headline":"Catch the coin in your hand so you can feel the surface of the coin.. You can catch the coin in the same hand you flipped it with, or you can catch the coin in between both of your palms.",
          "description":"After you catch the coin, slide your thumb under your fingers to feel coin. This way, you can determine which side is flipped upwards and make adjustments so your side is on top. Practice with both methods if you’d like, and choose which option helps you feel the coin the best."
        },
        {
          "headline":"Practice flipping and feeling your coin so you can do it effortlessly.",
          "description":"Continue trying the flick and feel technique until you are comfortable doing this without hesitation. You want your moves to be seamless and precise so your opponent doesn’t notice your trick. You can practice every day for a week, for instance. If your opponent catches you feeling the coin, they may call you out for cheating, and you will not win the coin toss."
        },
        {
          "headline":"Challenge an opponent after you’ve mastered the technique.",
          "description":"When you feel like you can seamlessly perform the trick, it’s time to find an opponent. Have your opponent call their side of the coin, flip it into the air, and catch it in your hands. As you do this, feel the coin, and reveal your side of the coin to your opponent. Then, declare yourself the winner! For instance, challenge your friends or family members."
        }
      ]
    },
    {
      "name":"Spinning the Coin like a Frisbee",
      "steps":[
        {
          "headline":"Hold the coin near the end of your index and middle fingers.",
          "description":"Position the coin so it is in between your index and middle finger. Leave 2/3 or so of the coin sticking out, so you can easily flip it. Ensure the side of the coin that you want to win is facing upwards as you do this."
        },
        {
          "headline":"Flick your wrist upward and lift your index finger.",
          "description":"To toss the coin, gently move your wrist up and release the coin. As you do this, move your index finger out of the way so the coin gets tossed without much movement. If your index finger is in the way, you can bump the coin and cause it to flip over."
        },
        {
          "headline":"Catch the coin in the same direction you threw it in.",
          "description":"In one consecutive motion, open your palm so you can easily catch the coin after you toss it. Throwing the coin with this technique ensures the coin lands in the same direction as it started. Meaning, if you started with heads, the coin will land on heads. You must catch and throw the coin correctly in order to use this trick. Practice repeatedly until you master the technique."
        }
      ]
    },
    {
      "name":"Fooling Your Opponent",
      "steps":[
        {
          "headline":"Flip the coin with your thumb and catch it in your hand.",
          "description":"To start out, complete the coin toss as normal. Clench your fist, place the coin on top of your thumb, and flick the coin with your thumb to flip it. Then, catch the coin in 1 hand or in between both of your palms."
        },
        {
          "headline":"Say your side of the coin even if it’s not correct.",
          "description":"When you catch the coin in your hand, call out your side of the coin. Do this even if your side is not facing outward. As you do this, ensure your opponent cannot see the coin."
        },
        {
          "headline":"Move your hand quickly so your opponent doesn’t notice.",
          "description":"When doing this trick, you want to be extra sneaky so your opponent doesn’t see. As you do this, you can flip the coin to your side and show your opponent the “correct” outcome. To help conceal the coin, you can position your hand in their line of sight."
        }
      ]
    },
    {
      "name":"Trying Other Coin Tricks",
      "steps":[
        {
          "headline":"Spin the coin and call tails for an 80% solution.",
          "description":"Instead of flipping the coin in the air, propose to spin the coin on the table instead. Be sure to call tails to increase your chances of winning the game. Hold the coin in between both of your fingers on top of a flat surface, and quickly spin the coin with a flick of your wrist. While this is not guaranteed, 80% of the time tails is the result if you spin the coin. Spinning the coin may seem to be fairer since you both can view the coin. This works 80% of the time because the heads side is heavier than the tails side."
        },
        {
          "headline":"Use a trick coin to fool your opponent.",
          "description":"Trick coins have both sides with the same face, so you cannot lose. Flip the coin and effortlessly dup your opponent. You can purchase trick coins at most party stores or online. While this is technically cheating, your opponent will never know if you are sneaky and deceptive. Be sure they do not see or handle the coin before or after the coin toss."
        },
        {
          "headline":"Call the side the coin starts on to win 51% of the time.",
          "description":"Whether the coin starts on heads or tails, there is a 51% probability that the coin lands on the same side it started on. These odds may not seem great, but this trick can give you a slight advantage over your opponent."
        }
      ]
    }
  ],
  "text":" Feeling the Coin with Your Finger Examine the look and feel of the coin. Before you host a coin toss, feel each side of the coin with your fingers. The smoother side of the coin is commonly the heads side, and the rough side with more detailing is usually the tails side. This is a great way to distinguish between both sides of the coin so you can ensure your victory. Flip the coin upward by gently flicking your thumb. To practice the coin toss, position the coin on top of your thumb. Then, move your thumb with light force to flip the coin into the air. If you use too much force, the coin will fly across the room. You may have to practice with varying forces until you get the hang of this. For best results, flip with your dominant hand. Catch the coin in your hand so you can feel the surface of the coin.. You can catch the coin in the same hand you flipped it with, or you can catch the coin in between both of your palms. After you catch the coin, slide your thumb under your fingers to feel coin. This way, you can determine which side is flipped upwards and make adjustments so your side is on top. Practice with both methods if you’d like, and choose which option helps you feel the coin the best. Practice flipping and feeling your coin so you can do it effortlessly. Continue trying the flick and feel technique until you are comfortable doing this without hesitation. You want your moves to be seamless and precise so your opponent doesn’t notice your trick. You can practice every day for a week, for instance. If your opponent catches you feeling the coin, they may call you out for cheating, and you will not win the coin toss. Challenge an opponent after you’ve mastered the technique. When you feel like you can seamlessly perform the trick, it’s time to find an opponent. Have your opponent call their side of the coin, flip it into the air, and catch it in your hands. As you do this, feel the coin, and reveal your side of the coin to your opponent. Then, declare yourself the winner! For instance, challenge your friends or family members. Spinning the Coin like a Frisbee Hold the coin near the end of your index and middle fingers. Position the coin so it is in between your index and middle finger. Leave 2/3 or so of the coin sticking out, so you can easily flip it. Ensure the side of the coin that you want to win is facing upwards as you do this. Flick your wrist upward and lift your index finger. To toss the coin, gently move your wrist up and release the coin. As you do this, move your index finger out of the way so the coin gets tossed without much movement. If your index finger is in the way, you can bump the coin and cause it to flip over. Catch the coin in the same direction you threw it in. In one consecutive motion, open your palm so you can easily catch the coin after you toss it. Throwing the coin with this technique ensures the coin lands in the same direction as it started. Meaning, if you started with heads, the coin will land on heads. You must catch and throw the coin correctly in order to use this trick. Practice repeatedly until you master the technique. Fooling Your Opponent Flip the coin with your thumb and catch it in your hand. To start out, complete the coin toss as normal. Clench your fist, place the coin on top of your thumb, and flick the coin with your thumb to flip it. Then, catch the coin in 1 hand or in between both of your palms. Say your side of the coin even if it’s not correct. When you catch the coin in your hand, call out your side of the coin. Do this even if your side is not facing outward. As you do this, ensure your opponent cannot see the coin. Move your hand quickly so your opponent doesn’t notice. When doing this trick, you want to be extra sneaky so your opponent doesn’t see. As you do this, you can flip the coin to your side and show your opponent the “correct” outcome. To help conceal the coin, you can position your hand in their line of sight. Trying Other Coin Tricks Spin the coin and call tails for an 80% solution. Instead of flipping the coin in the air, propose to spin the coin on the table instead. Be sure to call tails to increase your chances of winning the game. Hold the coin in between both of your fingers on top of a flat surface, and quickly spin the coin with a flick of your wrist. While this is not guaranteed, 80% of the time tails is the result if you spin the coin. Spinning the coin may seem to be fairer since you both can view the coin. This works 80% of the time because the heads side is heavier than the tails side. Use a trick coin to fool your opponent. Trick coins have both sides with the same face, so you cannot lose. Flip the coin and effortlessly dup your opponent. You can purchase trick coins at most party stores or online. While this is technically cheating, your opponent will never know if you are sneaky and deceptive. Be sure they do not see or handle the coin before or after the coin toss. Call the side the coin starts on to win 51% of the time. Whether the coin starts on heads or tails, there is a 51% probability that the coin lands on the same side it started on. These odds may not seem great, but this trick can give you a slight advantage over your opponent.",
  "tyn_model":[
    "coin",
    "thumb",
    "“correct",
    "” outcome",
    "coins"
  ],
  "tyn_section":[

  ]
}