{
  "title":"How to Make Apple Charlotte",
  "url":"https://www.wikihow.com/Make-Apple-Charlotte",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Fruit Desserts"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 450ºF/230ºC.",
      "description":""
    },
    {
      "headline":"Cut the crusts from the bread slices.",
      "description":"You'll need enough slices to line the bottom of the baking dish and to cover the top of it too."
    },
    {
      "headline":"Melt the butter in the pan over low heat.",
      "description":""
    },
    {
      "headline":"Dip each piece of bread in the melted butter to coat.",
      "description":"Both sides need coating. If you find the bread soaks up the butter, melt more."
    },
    {
      "headline":"Arrange the butter-soaked bread across the base of the baking dish and up the sides.",
      "description":"Interlock or overlap the bread to prevent any gaps."
    },
    {
      "headline":"Pour the applesauce into the baking dish over the bread layer.",
      "description":""
    },
    {
      "headline":"Dip more bread in the butter.",
      "description":"Place these dipped breads over the top of the applesauce layer."
    },
    {
      "headline":"Drizzle a little melted butter over the top if there is any left over.",
      "description":""
    },
    {
      "headline":"Place into the oven.",
      "description":"Bake for 20 minutes or until the top turns a lovely golden brown color."
    },
    {
      "headline":"Serve warm.",
      "description":"Whipped cream or ice cream is a traditional accompaniment."
    }
  ],
  "text":" Preheat the oven to 450ºF/230ºC.  Cut the crusts from the bread slices. You'll need enough slices to line the bottom of the baking dish and to cover the top of it too. Melt the butter in the pan over low heat.  Dip each piece of bread in the melted butter to coat. Both sides need coating. If you find the bread soaks up the butter, melt more. Arrange the butter-soaked bread across the base of the baking dish and up the sides. Interlock or overlap the bread to prevent any gaps. Pour the applesauce into the baking dish over the bread layer.  Dip more bread in the butter. Place these dipped breads over the top of the applesauce layer. Drizzle a little melted butter over the top if there is any left over.  Place into the oven. Bake for 20 minutes or until the top turns a lovely golden brown color. Serve warm. Whipped cream or ice cream is a traditional accompaniment.",
  "tyn_model":[
    "butter",
    "baking dish",
    "oven",
    "applesauce",
    "whipped cream",
    "ice cream"
  ],
  "tyn_section":[

  ]
}