{
  "title":"How to Grow Henna",
  "url":"https://www.wikihow.com/Grow-Henna",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "parts":[
    {
      "name":"Collecting Your Supplies",
      "steps":[
        {
          "headline":"Obtain seeds from a nursery or reputable supplier.",
          "description":"Don’t expect to find henna seeds at your local big-box garden center. Henna seeds are specialty items. You may have the best luck finding them online."
        },
        {
          "headline":"Find a suitable storage container for your seeds.",
          "description":"Store seeds in an airtight, opaque container until you’re ready to sow them. Keep the container in a cool, dark place. If seeds are exposed to moisture or sunlight, they might sprout prematurely and rot."
        },
        {
          "headline":"Gather several paper towels and a plastic Ziploc bag.",
          "description":"Use high-quality paper towels so they don’t disintegrate when they become wet."
        },
        {
          "headline":"Purchase small seedling pots.",
          "description":"Start new plants in small pots even if you plan to eventually plant them outside. Make sure pots have drain holes in the bottom."
        }
      ]
    },
    {
      "name":"Germinating Henna Seeds",
      "steps":[
        {
          "headline":"Prepare the growing surface.",
          "description":"Layer several flat paper towels on top of each other. The goal is to create a thick, sturdy cushion that will serve as the seeds’ incubator."
        },
        {
          "headline":"Add water.",
          "description":"Sprinkle cold water onto the paper towels without saturating them. Paper towels should be moist, but solid enough that you can pick them up."
        },
        {
          "headline":"Add seeds.",
          "description":"Sprinkle a pinch of seeds down the middle of the moist paper towels. Add a generous number of seeds, but don’t overdo it! You should be able to see plenty of white space between the seeds and the paper towels. Fold the paper towels in half down the middle with the seeds inside."
        },
        {
          "headline":"Chill seeds.",
          "description":"Place the folded paper towels into the Ziploc bag. If you need to fold the paper towels additional times to make them fit, that is fine. Seal the bag and place it in a refrigerator. The refrigerator replicates winter temperatures and prepares the seeds for “spring” and germination."
        },
        {
          "headline":"Transfer seeds to a warm, sunny spot.",
          "description":"After three or four days, remove the Ziploc from the refrigerator and place it in a warm spot like a sunny windowsill or porch. The heat and light should create condensation that triggers germination. Leave the Ziploc bag slightly open once you remove it from the refrigerator. This allows air circulation and reduces the odds that the seeds will become moldy. The goal is to encourage a warm, slightly moist environment inside the bag."
        },
        {
          "headline":"Wait for seeds to become seedlings.",
          "description":"After about a week, check on the seeds. Continue checking on the seeds until you discover they’ve become seedlings. If you see them turning white, you'll know you're making progress! The warmer the environment, the more quickly seeds will sprout. When seedlings reach about half an inch long, it’s time to plant them!"
        }
      ]
    },
    {
      "name":"Planting Your Plants",
      "steps":[
        {
          "headline":"Plant henna plants in a commercially available soil mixtures suitable for cacti and succulents.",
          "description":"Henna thrives in soils with pH ranging from 4.3 to 8. Add organic matter, such as garden manure, to the soil to promote growth."
        },
        {
          "headline":"Plant seedlings in small pots.",
          "description":"You can plant multiple seedlings in one pot (the exact number will depend on the size of your pots.) Make sure to leave plenty of space between the seedlings so you’ll be able to dig them up and transfer them later. Even if you plan to plant your henna seedlings in the ground eventually, start them in pots. You can safely transfer plants into the ground, if desired, after about 5 months. Keeping immature seedlings in a pot allows you to safeguard them from the elements. You'll be able to bring the pots inside as needed until they’re strong enough to withstand strong wind, rain, etc."
        },
        {
          "headline":"Plan to grow your henna as a houseplant if you live in a cooler climate.",
          "description":"Henna plants won’t survive outdoors if temperatures drop below 50ºF (11ºC). When your henna plant is inside, keep it in a sunny, warm spot such as a windowsill. Even if your plant is a potted houseplant, you can leave it outside in the sun in warm temperatures. To protect your plant against an unexpected early-season cold front, bring it indoors in early fall. Keep your plant indoors until spring, after the threat of cold fronts has subsided."
        },
        {
          "headline":"Consider planting your henna plant in the ground if you live in gardening zones 9b-11.",
          "description":"In these zones, henna plants thrive outdoors. If you take care of them, expect outdoor plants to reach about 8 feet (2.4 m) tall within 5 years. Find out what garden zone you’re in by consulting the U.S. Department of Agriculture Plant Hardiness Zone Map."
        },
        {
          "headline":"Keep in mind that henna’s growth habit is shrub- or tree-like.",
          "description":"If you plant henna outside, make sure it has plenty of room to grow tall and wide as it matures."
        },
        {
          "headline":"Remember that mature henna is spiny.",
          "description":"Don’t plant a henna plant in the ground in a spot that has heavy foot traffic. Passersby could be pricked by the spines. A mature henna plant can serve as a natural security barrier to discourage intruders."
        }
      ]
    },
    {
      "name":"Watering Properly",
      "steps":[
        {
          "headline":"Water henna plants when soil becomes dry.",
          "description":"Henna plants thrive in the heat and are very drought-tolerant once established. Allow your henna plant’s soil to dry completely, then saturate it with water all at once."
        },
        {
          "headline":"Avoid watering henna plants a little at a time daily or every other day.",
          "description":"Henna plants prefer dry conditions. When the plant’s soil is constantly moist, root rot or scale can develop."
        },
        {
          "headline":"Make sure your indoor henna plant’s pot is draining properly.",
          "description":"After watering, excess water should drain from the pot. Place a saucer under the plant to collect extra water, and empty the saucer when after watering."
        }
      ]
    },
    {
      "name":"Nurturing Henna Plants",
      "steps":[
        {
          "headline":"Transfer your potted henna plant indoors in winter if you don’t live in garden zones 9b-11.",
          "description":"Exposure to cold can damage or kill your plant."
        },
        {
          "headline":"Treat pests.",
          "description":"If your henna plant develops aphids, spray it with a water-soap solution to kill the insects. If your plant develops scale, visit a reputable garden center that can recommend a suitable insecticide that will kill the scale without damaging your henna plant. If your plant develops aphids or scale, trim the affected stems and leaves and discard them in right away."
        },
        {
          "headline":"Fertilize your plant.",
          "description":"To maximize flower and leaf growth, fertilize your plant. Always use fertilizers at the recommended dilution strength or less. Never apply more fertilizer than is recommended, especially to seedlings and young plants. Look for a fertilizer with a 1-2-1 nitrogen-phosphorous-potassium (NPK) rating to encouraged balanced growth. Ideally, fertilize established perennials once, in spring, when you notice new growth beginning to emerge. Overfertilizing can burn or kill plants."
        }
      ]
    }
  ],
  "text":" Collecting Your Supplies Obtain seeds from a nursery or reputable supplier. Don’t expect to find henna seeds at your local big-box garden center. Henna seeds are specialty items. You may have the best luck finding them online. Find a suitable storage container for your seeds. Store seeds in an airtight, opaque container until you’re ready to sow them. Keep the container in a cool, dark place. If seeds are exposed to moisture or sunlight, they might sprout prematurely and rot. Gather several paper towels and a plastic Ziploc bag. Use high-quality paper towels so they don’t disintegrate when they become wet. Purchase small seedling pots. Start new plants in small pots even if you plan to eventually plant them outside. Make sure pots have drain holes in the bottom. Germinating Henna Seeds Prepare the growing surface. Layer several flat paper towels on top of each other. The goal is to create a thick, sturdy cushion that will serve as the seeds’ incubator. Add water. Sprinkle cold water onto the paper towels without saturating them. Paper towels should be moist, but solid enough that you can pick them up. Add seeds. Sprinkle a pinch of seeds down the middle of the moist paper towels. Add a generous number of seeds, but don’t overdo it! You should be able to see plenty of white space between the seeds and the paper towels. Fold the paper towels in half down the middle with the seeds inside. Chill seeds. Place the folded paper towels into the Ziploc bag. If you need to fold the paper towels additional times to make them fit, that is fine. Seal the bag and place it in a refrigerator. The refrigerator replicates winter temperatures and prepares the seeds for “spring” and germination. Transfer seeds to a warm, sunny spot. After three or four days, remove the Ziploc from the refrigerator and place it in a warm spot like a sunny windowsill or porch. The heat and light should create condensation that triggers germination. Leave the Ziploc bag slightly open once you remove it from the refrigerator. This allows air circulation and reduces the odds that the seeds will become moldy. The goal is to encourage a warm, slightly moist environment inside the bag. Wait for seeds to become seedlings. After about a week, check on the seeds. Continue checking on the seeds until you discover they’ve become seedlings. If you see them turning white, you'll know you're making progress! The warmer the environment, the more quickly seeds will sprout. When seedlings reach about half an inch long, it’s time to plant them! Planting Your Plants Plant henna plants in a commercially available soil mixtures suitable for cacti and succulents. Henna thrives in soils with pH ranging from 4.3 to 8. Add organic matter, such as garden manure, to the soil to promote growth. Plant seedlings in small pots. You can plant multiple seedlings in one pot (the exact number will depend on the size of your pots.) Make sure to leave plenty of space between the seedlings so you’ll be able to dig them up and transfer them later. Even if you plan to plant your henna seedlings in the ground eventually, start them in pots. You can safely transfer plants into the ground, if desired, after about 5 months. Keeping immature seedlings in a pot allows you to safeguard them from the elements. You'll be able to bring the pots inside as needed until they’re strong enough to withstand strong wind, rain, etc. Plan to grow your henna as a houseplant if you live in a cooler climate. Henna plants won’t survive outdoors if temperatures drop below 50ºF (11ºC). When your henna plant is inside, keep it in a sunny, warm spot such as a windowsill. Even if your plant is a potted houseplant, you can leave it outside in the sun in warm temperatures. To protect your plant against an unexpected early-season cold front, bring it indoors in early fall. Keep your plant indoors until spring, after the threat of cold fronts has subsided. Consider planting your henna plant in the ground if you live in gardening zones 9b-11. In these zones, henna plants thrive outdoors. If you take care of them, expect outdoor plants to reach about 8 feet (2.4 m) tall within 5 years. Find out what garden zone you’re in by consulting the U.S. Department of Agriculture Plant Hardiness Zone Map. Keep in mind that henna’s growth habit is shrub- or tree-like. If you plant henna outside, make sure it has plenty of room to grow tall and wide as it matures. Remember that mature henna is spiny. Don’t plant a henna plant in the ground in a spot that has heavy foot traffic. Passersby could be pricked by the spines. A mature henna plant can serve as a natural security barrier to discourage intruders. Watering Properly Water henna plants when soil becomes dry. Henna plants thrive in the heat and are very drought-tolerant once established. Allow your henna plant’s soil to dry completely, then saturate it with water all at once. Avoid watering henna plants a little at a time daily or every other day. Henna plants prefer dry conditions. When the plant’s soil is constantly moist, root rot or scale can develop. Make sure your indoor henna plant’s pot is draining properly. After watering, excess water should drain from the pot. Place a saucer under the plant to collect extra water, and empty the saucer when after watering. Nurturing Henna Plants Transfer your potted henna plant indoors in winter if you don’t live in garden zones 9b-11. Exposure to cold can damage or kill your plant. Treat pests. If your henna plant develops aphids, spray it with a water-soap solution to kill the insects. If your plant develops scale, visit a reputable garden center that can recommend a suitable insecticide that will kill the scale without damaging your henna plant. If your plant develops aphids or scale, trim the affected stems and leaves and discard them in right away. Fertilize your plant. To maximize flower and leaf growth, fertilize your plant. Always use fertilizers at the recommended dilution strength or less. Never apply more fertilizer than is recommended, especially to seedlings and young plants. Look for a fertilizer with a 1-2-1 nitrogen-phosphorous-potassium (NPK) rating to encouraged balanced growth. Ideally, fertilize established perennials once, in spring, when you notice new growth beginning to emerge. Overfertilizing can burn or kill plants.",
  "tyn_model":[
    "paper towels",
    "water",
    "henna",
    "refrigerator",
    "henna plant",
    "ziploc bag",
    "henna plants",
    "seeds",
    "saucer",
    "fertilizer",
    "henna seeds",
    "’ incubator",
    "“spring",
    "” and",
    "ziploc",
    "organic matter",
    "garden manure",
    "plants",
    "pot",
    "pots",
    "water-soap",
    "garden center",
    "fertilizers"
  ],
  "tyn_section":[

  ]
}