{
  "title":"How to Draw Still Life",
  "url":"https://www.wikihow.com/Draw-Still-Life",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Styles",
    "Drawing Still Life"
  ],
  "steps":[
    {
      "headline":"Start by picking an easy object to draw such as a ball, a book, a box, etc.",
      "description":"If you are a beginner, then any object without too much detail or has an interesting shape will do. It's very important not to rush yourself into trying something that may be too difficult."
    },
    {
      "headline":"When you have chosen your object, place it on a counter, table, floor, etc.",
      "description":"Make sure the location you've chosen doesn't have a complicated background to it."
    },
    {
      "headline":"Try to have one source of light (a lamp is recommended).",
      "description":"It defines the shadows more."
    },
    {
      "headline":"After choosing the location, look at your object for about 2-7 min.",
      "description":"Try to realize the position/shading/texture/patterns and other things that may help you draw it."
    },
    {
      "headline":"When you have realized every single part of the object, start with any place that makes you feel comfortable.",
      "description":"Try using the pencil softly so if you mess up it's easier to erase."
    },
    {
      "headline":"When starting, try using shapes that you see in the object, such as circles or rectangles, or draw light lines that divide the object equally.",
      "description":"But do not work on any one part of the object until you have the entire object drawn lightly."
    },
    {
      "headline":"Once you have the entire object drawn lightly, start darkening the outlines, but not so dark that it makes it look 2 dimensional.",
      "description":""
    },
    {
      "headline":"After that, start adding details.",
      "description":"Shading is very important and it must be done properly. Use your pencil lightly when shading and continue overlapping that one part. Don't get impatient and start pressing harder, because after that a dent will appear in the paper and it will be harder to erase."
    },
    {
      "headline":"The process of shading may take a long time, depending on the object, so take a few breaks when you feel it's necessary.",
      "description":"You may get some swelling in your arms and hands if you did this process correctly."
    },
    {
      "headline":"When you have finished the shading take a step back and look at your picture, compared to the still object.",
      "description":"You may notice some differences so you can go back and fix it. Not everything will be perfect so don't work up a sweat trying to figure it out."
    },
    {
      "headline":"Keep practicing and you will become a better artist!",
      "description":""
    }
  ],
  "text":" Start by picking an easy object to draw such as a ball, a book, a box, etc. If you are a beginner, then any object without too much detail or has an interesting shape will do. It's very important not to rush yourself into trying something that may be too difficult. When you have chosen your object, place it on a counter, table, floor, etc. Make sure the location you've chosen doesn't have a complicated background to it. Try to have one source of light (a lamp is recommended). It defines the shadows more. After choosing the location, look at your object for about 2-7 min. Try to realize the position/shading/texture/patterns and other things that may help you draw it. When you have realized every single part of the object, start with any place that makes you feel comfortable. Try using the pencil softly so if you mess up it's easier to erase. When starting, try using shapes that you see in the object, such as circles or rectangles, or draw light lines that divide the object equally. But do not work on any one part of the object until you have the entire object drawn lightly. Once you have the entire object drawn lightly, start darkening the outlines, but not so dark that it makes it look 2 dimensional.  After that, start adding details. Shading is very important and it must be done properly. Use your pencil lightly when shading and continue overlapping that one part. Don't get impatient and start pressing harder, because after that a dent will appear in the paper and it will be harder to erase. The process of shading may take a long time, depending on the object, so take a few breaks when you feel it's necessary. You may get some swelling in your arms and hands if you did this process correctly. When you have finished the shading take a step back and look at your picture, compared to the still object. You may notice some differences so you can go back and fix it. Not everything will be perfect so don't work up a sweat trying to figure it out. Keep practicing and you will become a better artist! ",
  "tyn_model":[
    "pencil",
    "lamp",
    "paper"
  ],
  "tyn_section":[

  ]
}