{
  "title":"How to Make Vichyssoise (Potato Leek Soup)",
  "url":"https://www.wikihow.com/Make-Vichyssoise-(Potato-Leek-Soup)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "steps":[
    {
      "headline":"Gently sweat the chopped leeks and the chopped onion in butter or margarine in a medium saucepan over medium heat until soft, about 8 minutes.",
      "description":"Do not let them brown."
    },
    {
      "headline":"Add potatoes and stock to the saucepan.",
      "description":"Salt and pepper to taste; do not overdo them! Bring to a boil, reduce heat and simmer very gently for 30 minutes."
    },
    {
      "headline":"Puree in a blender or food processor until very smooth.",
      "description":"Cool. Gently stir in the cream before serving."
    },
    {
      "headline":"If serving hot, heat gently over medium heat stirring constantly just before serving.",
      "description":""
    },
    {
      "headline":"Ladle into individual serving bowls.",
      "description":""
    },
    {
      "headline":"Garnish with fresh snipped chives.",
      "description":"(optional)"
    }
  ],
  "text":" Gently sweat the chopped leeks and the chopped onion in butter or margarine in a medium saucepan over medium heat until soft, about 8 minutes. Do not let them brown. Add potatoes and stock to the saucepan. Salt and pepper to taste; do not overdo them! Bring to a boil, reduce heat and simmer very gently for 30 minutes. Puree in a blender or food processor until very smooth. Cool. Gently stir in the cream before serving. If serving hot, heat gently over medium heat stirring constantly just before serving.  Ladle into individual serving bowls.  Garnish with fresh snipped chives. (optional)",
  "tyn_model":[
    "leeks",
    "onion",
    "butter",
    "margarine",
    "medium saucepan",
    "potatoes",
    "stock",
    "saucepan",
    "salt",
    "pepper",
    "blender",
    "food processor",
    "cream",
    "chives"
  ],
  "tyn_section":[

  ]
}