{
  "title":"How to Make Cat Warriors out of Clay",
  "url":"https://www.wikihow.com/Make-Cat-Warriors-out-of-Clay",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "steps":[
    {
      "headline":"You will need to gather up: White or different colored clay and Paint.",
      "description":""
    },
    {
      "headline":"After you have got what you need, start making a medium sized ball for the head.Then make a body for the cat.",
      "description":"The body should be a bit smaller and should be rounded and then made a bit more skinny"
    },
    {
      "headline":"Make legs for your cat.",
      "description":"This is easy. All you have to do is make a stubby little clay cylinder 4 times. Then stick the legs tight to your cat's body."
    },
    {
      "headline":"Bake them in the oven or let them dry overnight, depending on what clay you used.",
      "description":"If you have made it here your halfway done! Good job."
    },
    {
      "headline":"Name your cats.",
      "description":"Names like Rusty and Firepaw are great coming from the book. Other than that, names like Wolfpaw and Tigerstripe work."
    },
    {
      "headline":"Start your clan.",
      "description":"Make more cats, and give them names. Also, for bonus make mice maybe, or food."
    },
    {
      "headline":"Make a clay forest as a bonus.",
      "description":"If you have already made this or do not want to make this, go to the next step. You will need large amounts of clay and paint. Construct trees, lakes, fish, berry bushes, foxes, wolves, caves, rocks and more out of the clay and paint."
    },
    {
      "headline":"Make stars, clouds, a blue sky, raining sky, etc.",
      "description":""
    },
    {
      "headline":"When all of this is completed and dried, you are ready to play!",
      "description":""
    }
  ],
  "text":" You will need to gather up: White or different colored clay and Paint.  After you have got what you need, start making a medium sized ball for the head.Then make a body for the cat. The body should be a bit smaller and should be rounded and then made a bit more skinny Make legs for your cat. This is easy. All you have to do is make a stubby little clay cylinder 4 times. Then stick the legs tight to your cat's body. Bake them in the oven or let them dry overnight, depending on what clay you used. If you have made it here your halfway done! Good job. Name your cats. Names like Rusty and Firepaw are great coming from the book. Other than that, names like Wolfpaw and Tigerstripe work. Start your clan. Make more cats, and give them names. Also, for bonus make mice maybe, or food. Make a clay forest as a bonus. If you have already made this or do not want to make this, go to the next step. You will need large amounts of clay and paint. Construct trees, lakes, fish, berry bushes, foxes, wolves, caves, rocks and more out of the clay and paint. Make stars, clouds, a blue sky, raining sky, etc.  When all of this is completed and dried, you are ready to play! ",
  "tyn_model":[
    "clay",
    "paint",
    "oven",
    "cats",
    "mice",
    "food",
    "rocks"
  ],
  "tyn_section":[

  ]
}