{
  "title":"How to Make Tex Mex Gazpacho",
  "url":"https://www.wikihow.com/Make-Tex-Mex-Gazpacho",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Prepare your vegetables.",
          "description":"Peel, remove the seeds, and finely chop the cucumber, tomatoes, green pepper, and green onion. Keep them aside."
        },
        {
          "headline":"Combine the rest of your ingredients in a water-filled saucepan.",
          "description":"Bring it to a boil and simmer."
        },
        {
          "headline":"Add the chopped veggies in the saucepan and cook for 5 minutes on low heat.",
          "description":""
        },
        {
          "headline":"Remove it from the heat and let cool.",
          "description":""
        },
        {
          "headline":"Place the saucepan in the refrigerator and chill for a few hours.",
          "description":""
        },
        {
          "headline":"Remove it from the fridge.",
          "description":"Stir the mixture and check the seasoning and consistency."
        },
        {
          "headline":"Serve in pre-chilled soup bowls.",
          "description":""
        }
      ]
    },
    {
      "name":"Preparing the vegetable stock",
      "steps":[
        {
          "headline":"Fill a saucepan with 1 and 1/2 liters of water.",
          "description":""
        },
        {
          "headline":"Add carrots, 50g onions and bouquet garni ( 25g leeks, 12g celery, 6g parsley stalk, 1 bay leaf, a sprig of thyme and 1 tsp peppercorns).",
          "description":""
        },
        {
          "headline":"Allow this to simmer on low heat for 2 hours while you keep removing the scum on top.",
          "description":""
        },
        {
          "headline":"Strain it through a muslin cloth, and your stock-thick and strong-is ready.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Steps Prepare your vegetables. Peel, remove the seeds, and finely chop the cucumber, tomatoes, green pepper, and green onion. Keep them aside. Combine the rest of your ingredients in a water-filled saucepan. Bring it to a boil and simmer. Add the chopped veggies in the saucepan and cook for 5 minutes on low heat.  Remove it from the heat and let cool.  Place the saucepan in the refrigerator and chill for a few hours.  Remove it from the fridge. Stir the mixture and check the seasoning and consistency. Serve in pre-chilled soup bowls.  Preparing the vegetable stock Fill a saucepan with 1 and 1/2 liters of water.  Add carrots, 50g onions and bouquet garni ( 25g leeks, 12g celery, 6g parsley stalk, 1 bay leaf, a sprig of thyme and 1 tsp peppercorns).  Allow this to simmer on low heat for 2 hours while you keep removing the scum on top.  Strain it through a muslin cloth, and your stock-thick and strong-is ready.  Finished. ",
  "tyn_model":[
    "saucepan",
    "g",
    "cucumber",
    "tomatoes",
    "green pepper",
    "green onion",
    "water-filled saucepan",
    "refrigerator",
    "vegetable stock",
    "water",
    "carrots",
    "onions",
    "leeks",
    "celery",
    "parsley",
    "thyme",
    "muslin cloth",
    "stock"
  ],
  "tyn_section":[

  ]
}