{
  "title":"How to Get Lots of Streetpass Miis",
  "url":"https://www.wikihow.com/Get-Lots-of-Streetpass-Miis",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo Miis"
  ],
  "steps":[
    {
      "headline":"Close your 3DS but do not turn it off.",
      "description":"Do not have any software open."
    },
    {
      "headline":"Make sure that the battery will not die during it being in sleep mode, because even if you aren't actively using it, it still drains battery.",
      "description":""
    },
    {
      "headline":"Try heading to a game store nearby, if you have one.",
      "description":"Wait around for a while, look at the new hardware, just do anything to stay there for as long as possible without it getting awkward."
    },
    {
      "headline":"See if you have any luck.",
      "description":"If not, try walking around a main street or a shopping mall, there's bound to be someone with a 3DS there!"
    },
    {
      "headline":"Try arranging to meet someone through a forum who lives nearby if you still don't have any Miis.",
      "description":"Be careful with this though, because you don't know who is on the other side of the computer screen."
    },
    {
      "headline":"Wait for a convention or a big meeting where you know a lot of people that play video games will be, such as comic con or a busy city.",
      "description":""
    },
    {
      "headline":"Hopefully now you have a full plaza and all the puzzle pieces your heart desires!",
      "description":"You can finally use a fantastic 3DS feature!"
    }
  ],
  "text":" Close your 3DS but do not turn it off. Do not have any software open. Make sure that the battery will not die during it being in sleep mode, because even if you aren't actively using it, it still drains battery.  Try heading to a game store nearby, if you have one. Wait around for a while, look at the new hardware, just do anything to stay there for as long as possible without it getting awkward. See if you have any luck. If not, try walking around a main street or a shopping mall, there's bound to be someone with a 3DS there! Try arranging to meet someone through a forum who lives nearby if you still don't have any Miis. Be careful with this though, because you don't know who is on the other side of the computer screen. Wait for a convention or a big meeting where you know a lot of people that play video games will be, such as comic con or a busy city.  Hopefully now you have a full plaza and all the puzzle pieces your heart desires! You can finally use a fantastic 3DS feature!",
  "tyn_model":[
    "3ds",
    "3ds feature"
  ],
  "tyn_section":[

  ]
}