{
  "title":"How to Cook Lasagna in Your Dishwasher",
  "url":"https://www.wikihow.com/Cook-Lasagna-in-Your-Dishwasher",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles",
    "Lasagna"
  ],
  "parts":[
    {
      "name":"Preparing the Lasagna",
      "steps":[
        {
          "headline":"Cut three sheets of aluminum foil to cover your lasagna.",
          "description":"Pull out a length of aluminum and cut it to a rectangle, about 24 in × 12 in (61 cm × 30 cm). Cut 2 more sheets of the same length and stack them on top of each other."
        },
        {
          "headline":"Place a fresh lasagna sheet on the foil and spread on sauce.",
          "description":"Put your first lasagna sheet on top of the stack of foil. Use a spoon to spread a thick layer of tomato sauce, either store-bought or homemade. You can use fresh lasagna sheets or oven-ready."
        },
        {
          "headline":"Mix the ricotta cheese and spinach, then spread it on the sauce.",
          "description":"Pour your spinach into a bowl and mix in the ricotta cheese with a spoon, stirring until the spinach is evenly dispersed. Spoon about half of it onto your tomato sauce and spread it evenly. You’ll be using the other half of the cheese-spinach mix on the second layer of lasagna.Tip: You can add meat to your lasagna, but saute it first. Sauteing meat is standard for any lasagna recipe, but is especially important if you’re cooking in a dishwasher, since the heat won’t be as high as an oven."
        },
        {
          "headline":"Sprinkle mozzarella cheese and spices on top.",
          "description":"Use your hands to spread about half of your mozzarella cheese on top of the ricotta and spinach in a thick layer. Top it with Italian seasoning, dried garlic, and onion flakes, to taste. Using dried onion flakes instead of fresh onion will help you avoid adding any extra moisture to the dish."
        },
        {
          "headline":"Place a new pasta sheet on top and repeat the layers.",
          "description":"Press a new pasta sheet on top and layer on the tomato sauce, the rest of your ricotta-spinach mix, mozzarella cheese, and spices."
        },
        {
          "headline":"Set your last pasta sheet on top to finish.",
          "description":"For a traditional lasagna look, simply press the last pasta sheet onto your second layer of toppings. For a nicer presentation, you can also cut the third pasta sheet into thin strips, about ⁄2 inch (1.3 cm) wide, and weave them together to create a criss-cross pattern on top. You can sprinkle more herbs and cheese on top for some extra flavor."
        }
      ]
    },
    {
      "name":"Wrapping and Baking in the Dishwasher",
      "steps":[
        {
          "headline":"Pull the short ends of the foil over the lasagna.",
          "description":"Grab the ends of all three sheets of foil and bend them over the lasagna. Fold and roll the ends together, as though you’re folding a paper bag, folding the foil as tightly and securely as possible. Pat it down until it’s flush over the lasagna. You want to fold the foil as tightly as you can so that no air or moisture can get inside."
        },
        {
          "headline":"Fold in the corners of the loose ends to seal the lasagna.",
          "description":"Close the open ends of the foil as though you’re wrapping a present, folding in the corners and rolling up from the edge. Seal the ends of the foil as tightly as you can. If you want, you can seal the edges with electrical tape. Don’t use any other kinds of tape, like Scotch tape or duct tape. They’re less heat-resistant and will melt in the dishwasher.Tip: Be careful not to tear the foil as you’re wrapping. Check it over before you put it in the dishwasher to make sure there are no holes or openings."
        },
        {
          "headline":"Place the lasagna upside in a flat part of your dishwasher.",
          "description":"Set your lasagna in the flattest part of your dishwasher, keeping it away from any tines that could puncture the wrapping. Place it upside down as well, so that the flattest side is facing up. This will prevent water from gathering on top and making your lasagna too moist. You can place dirty dishes around the lasagna to wash at the same time, as long as your lasagna is tightly wrapped. It’s best to place your lasagna in the lower part of your dishwasher, but if there are no flat areas there, you can place it in the top."
        },
        {
          "headline":"Set the dishwasher to “heated dry” and “sanitize” to add extra heat.",
          "description":"Put detergent into your dishwasher as usual, then set it to the hottest possible cycle. On most dishwashers, this will be the “heated dry” and “sanitize” levels. It’s important to put in detergent so that the dishwasher runs as normal. Your lasagna is sealed, so the water and soap won’t affect the taste or texture. Don’t use any heat-conserving options, like “cool dry” or “economy.”"
        },
        {
          "headline":"Let the dishwasher cycle for 2-2.5 hours, then remove and serve.",
          "description":"You’ll need the dishwasher to get all the way through its cycle before your lasagna is ready to eat. When it’s finished, which may take up to 2.5 hours, remove the lasagna with an oven mitt. Unroll or cut off the aluminum foil and serve. Your lasagna won’t be crispy, but it should be melted and fully cooked. If it’s not, try putting it back in the dishwasher for another half cycle."
        }
      ]
    }
  ],
  "text":" Preparing the Lasagna Cut three sheets of aluminum foil to cover your lasagna. Pull out a length of aluminum and cut it to a rectangle, about 24 in × 12 in (61 cm × 30 cm). Cut 2 more sheets of the same length and stack them on top of each other. Place a fresh lasagna sheet on the foil and spread on sauce. Put your first lasagna sheet on top of the stack of foil. Use a spoon to spread a thick layer of tomato sauce, either store-bought or homemade. You can use fresh lasagna sheets or oven-ready. Mix the ricotta cheese and spinach, then spread it on the sauce. Pour your spinach into a bowl and mix in the ricotta cheese with a spoon, stirring until the spinach is evenly dispersed. Spoon about half of it onto your tomato sauce and spread it evenly. You’ll be using the other half of the cheese-spinach mix on the second layer of lasagna.Tip: You can add meat to your lasagna, but saute it first. Sauteing meat is standard for any lasagna recipe, but is especially important if you’re cooking in a dishwasher, since the heat won’t be as high as an oven. Sprinkle mozzarella cheese and spices on top. Use your hands to spread about half of your mozzarella cheese on top of the ricotta and spinach in a thick layer. Top it with Italian seasoning, dried garlic, and onion flakes, to taste. Using dried onion flakes instead of fresh onion will help you avoid adding any extra moisture to the dish. Place a new pasta sheet on top and repeat the layers. Press a new pasta sheet on top and layer on the tomato sauce, the rest of your ricotta-spinach mix, mozzarella cheese, and spices. Set your last pasta sheet on top to finish. For a traditional lasagna look, simply press the last pasta sheet onto your second layer of toppings. For a nicer presentation, you can also cut the third pasta sheet into thin strips, about ⁄2 inch (1.3 cm) wide, and weave them together to create a criss-cross pattern on top. You can sprinkle more herbs and cheese on top for some extra flavor. Wrapping and Baking in the Dishwasher Pull the short ends of the foil over the lasagna. Grab the ends of all three sheets of foil and bend them over the lasagna. Fold and roll the ends together, as though you’re folding a paper bag, folding the foil as tightly and securely as possible. Pat it down until it’s flush over the lasagna. You want to fold the foil as tightly as you can so that no air or moisture can get inside. Fold in the corners of the loose ends to seal the lasagna. Close the open ends of the foil as though you’re wrapping a present, folding in the corners and rolling up from the edge. Seal the ends of the foil as tightly as you can. If you want, you can seal the edges with electrical tape. Don’t use any other kinds of tape, like Scotch tape or duct tape. They’re less heat-resistant and will melt in the dishwasher.Tip: Be careful not to tear the foil as you’re wrapping. Check it over before you put it in the dishwasher to make sure there are no holes or openings. Place the lasagna upside in a flat part of your dishwasher. Set your lasagna in the flattest part of your dishwasher, keeping it away from any tines that could puncture the wrapping. Place it upside down as well, so that the flattest side is facing up. This will prevent water from gathering on top and making your lasagna too moist. You can place dirty dishes around the lasagna to wash at the same time, as long as your lasagna is tightly wrapped. It’s best to place your lasagna in the lower part of your dishwasher, but if there are no flat areas there, you can place it in the top. Set the dishwasher to “heated dry” and “sanitize” to add extra heat. Put detergent into your dishwasher as usual, then set it to the hottest possible cycle. On most dishwashers, this will be the “heated dry” and “sanitize” levels. It’s important to put in detergent so that the dishwasher runs as normal. Your lasagna is sealed, so the water and soap won’t affect the taste or texture. Don’t use any heat-conserving options, like “cool dry” or “economy.” Let the dishwasher cycle for 2-2.5 hours, then remove and serve. You’ll need the dishwasher to get all the way through its cycle before your lasagna is ready to eat. When it’s finished, which may take up to 2.5 hours, remove the lasagna with an oven mitt. Unroll or cut off the aluminum foil and serve. Your lasagna won’t be crispy, but it should be melted and fully cooked. If it’s not, try putting it back in the dishwasher for another half cycle.",
  "tyn_model":[
    "foil",
    "spinach",
    "dishwasher",
    "tomato sauce",
    "aluminum foil",
    "spoon",
    "ricotta cheese",
    "mozzarella cheese",
    "spices",
    "lasagna",
    "water",
    "“heated",
    "” and",
    "“sanitize",
    "detergent",
    "aluminum",
    "× 12",
    "× 30",
    "bowl",
    "meat",
    "oven",
    "ricotta",
    "italian seasoning",
    "garlic",
    "onion flakes",
    "onion",
    "pasta sheet",
    "ricotta-spinach",
    "herbs",
    "electrical tape",
    "tape",
    "scotch tape",
    "duct tape",
    "dishes",
    "” to",
    "dishwashers",
    "” levels",
    "soap",
    "“cool",
    "” or",
    "“economy",
    "” let",
    "oven mitt"
  ],
  "tyn_section":[

  ]
}