{
  "title":"How to Bury a Treasure",
  "url":"https://www.wikihow.com/Bury-a-Treasure",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games"
  ],
  "steps":[
    {
      "headline":"Find a treasure.",
      "description":"Often, they can be found buried."
    },
    {
      "headline":"Choose a secret location you can remember how to find again (Note: Treasure maps are frequently lost or stolen.",
      "description":"It is best to keep the treasure's location stored in your brain only)."
    },
    {
      "headline":"Dig a very deep hole using your shovel.",
      "description":"Stop just before you reach the water table. Remember, usually throughout the summer, the water table is lower than winter or times of regular precipitation; so if you bury your treasure too low, it could be susceptible to water damage as the water table rises."
    },
    {
      "headline":"Enclose your treasure in a protective case or covering.",
      "description":"Most people use a chest, but burlap sacks and tarps have been used with minimal success."
    },
    {
      "headline":"Carefully place your treasure into the hole you dug.",
      "description":"Make sure the hole is big enough to fit your chest."
    },
    {
      "headline":"Refill the hole with the treasure inside using the dirt you dug up.",
      "description":"Make sure to pack the dirt or soil as you are filling the hole. Any loose soil is a dead giveaway to treasure hunters."
    },
    {
      "headline":"Plant a tree or shrub on top of the hole as to disguise the area's true purpose.",
      "description":"Also, the tree can be a helpful landmark."
    }
  ],
  "text":" Find a treasure. Often, they can be found buried. Choose a secret location you can remember how to find again (Note: Treasure maps are frequently lost or stolen. It is best to keep the treasure's location stored in your brain only). Dig a very deep hole using your shovel. Stop just before you reach the water table. Remember, usually throughout the summer, the water table is lower than winter or times of regular precipitation; so if you bury your treasure too low, it could be susceptible to water damage as the water table rises. Enclose your treasure in a protective case or covering. Most people use a chest, but burlap sacks and tarps have been used with minimal success. Carefully place your treasure into the hole you dug. Make sure the hole is big enough to fit your chest. Refill the hole with the treasure inside using the dirt you dug up. Make sure to pack the dirt or soil as you are filling the hole. Any loose soil is a dead giveaway to treasure hunters. Plant a tree or shrub on top of the hole as to disguise the area's true purpose. Also, the tree can be a helpful landmark.",
  "tyn_model":[
    "soil",
    "shovel",
    "chest",
    "burlap sacks",
    "tree"
  ],
  "tyn_section":[

  ]
}