{
  "title":"How to Make Cinnamon Glazed Baked Doughnuts",
  "url":"https://www.wikihow.com/Make-Cinnamon-Glazed-Baked-Doughnuts",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Donuts and Doughnuts"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 450ºF/230ºC.",
      "description":""
    },
    {
      "headline":"Combine the dry ingredients together in a medium bowl.",
      "description":""
    },
    {
      "headline":"Whisk the milk, egg, and vanilla into the dry ingredients for a minute.",
      "description":""
    },
    {
      "headline":"Continue whisking while slowly pouring in the canola oil until everything is thoroughly combined.",
      "description":""
    },
    {
      "headline":"Add the mixture to a pre-greased doughnut pan.",
      "description":""
    },
    {
      "headline":"Bake for about 7 to 9 minutes.",
      "description":""
    },
    {
      "headline":"Cool the doughnuts on a cooling rack.",
      "description":""
    },
    {
      "headline":"Make the icing.",
      "description":"Use a wire whisk to combine the corn syrup, vanilla, and powdered sugar together. Add a tablespoon of water, at a time, until you reach the right consistency you want."
    },
    {
      "headline":"Dip the top of the doughnuts in the icing.",
      "description":"Make circle and swirl movements to get the icing evenly while taking it out of the bowl."
    },
    {
      "headline":"Place the doughnuts on a rack to allow the icing to set.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 450ºF/230ºC.  Combine the dry ingredients together in a medium bowl.  Whisk the milk, egg, and vanilla into the dry ingredients for a minute.  Continue whisking while slowly pouring in the canola oil until everything is thoroughly combined.  Add the mixture to a pre-greased doughnut pan.  Bake for about 7 to 9 minutes.  Cool the doughnuts on a cooling rack.  Make the icing. Use a wire whisk to combine the corn syrup, vanilla, and powdered sugar together. Add a tablespoon of water, at a time, until you reach the right consistency you want. Dip the top of the doughnuts in the icing. Make circle and swirl movements to get the icing evenly while taking it out of the bowl. Place the doughnuts on a rack to allow the icing to set. ",
  "tyn_model":[
    "vanilla",
    "oven",
    "medium bowl",
    "milk",
    "egg",
    "canola oil",
    "doughnut pan",
    "cooling rack",
    "wire whisk",
    "corn syrup",
    "powdered sugar",
    "water",
    "icing",
    "bowl"
  ],
  "tyn_section":[

  ]
}