{
  "title":"How to Defeat the Archdemon in Dragon Age Origins",
  "url":"https://www.wikihow.com/Defeat-the-Archdemon-in-Dragon-Age-Origins",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games"
  ],
  "steps":[
    {
      "headline":"Construct your party.",
      "description":"Leliana, Sten, Wynne and the PC are good."
    },
    {
      "headline":"Make sure you use Wynne's healing to its full effect, when you get to battle.",
      "description":""
    },
    {
      "headline":"Position yourself at the side of the Archdemon and attack its back leg, if you're a warrior or a rogue.",
      "description":"Do the same with Sten because from here it can't hit you."
    },
    {
      "headline":"Repeat this step, whenever it moves.",
      "description":""
    },
    {
      "headline":"Get back with Wynne if you are a mage.",
      "description":"and attack the Archdemon from there."
    },
    {
      "headline":"Position Leliana at the Archdemon's side but not as close as the warrior / rogue PC or Sten and take advantage of her archery skills.",
      "description":""
    },
    {
      "headline":"Make sure you equip the PC and Sten with a bow or crossbow more as to why in the next step.",
      "description":""
    },
    {
      "headline":"Find out what to do at half-health.",
      "description":"At half health the Archdemon will move to a little ledge where you can't hit it unless you use ranged weapons."
    },
    {
      "headline":"Have those characters still on close range weapons switch to ranged.",
      "description":""
    },
    {
      "headline":"Make sure you use Wynne's healing to its full effect and use the spell revive to get back any characters that have fallen in battle.",
      "description":""
    },
    {
      "headline":"Find out what to do when the characters health is at 25 percent.",
      "description":"At 25 percent health the Archdemon will to return to where it was before it moved to the ledge, repeat the steps for that section of the fight, i.e move Sten and the PC, switch them to close range weapons etc."
    },
    {
      "headline":"Figure out what your choices are, when the fight finishes.",
      "description":"When the fight is finished, depending on your party choices: you die, Alistair dies, Loghain (yes the one who left the battle at Ostegar) dies, or you do Morrigan's ritual, and any of the above can kill the Archdemon and no-one dies."
    }
  ],
  "text":" Construct your party. Leliana, Sten, Wynne and the PC are good. Make sure you use Wynne's healing to its full effect, when you get to battle.  Position yourself at the side of the Archdemon and attack its back leg, if you're a warrior or a rogue. Do the same with Sten because from here it can't hit you. Repeat this step, whenever it moves.  Get back with Wynne if you are a mage. and attack the Archdemon from there. Position Leliana at the Archdemon's side but not as close as the warrior / rogue PC or Sten and take advantage of her archery skills.  Make sure you equip the PC and Sten with a bow or crossbow more as to why in the next step.  Find out what to do at half-health. At half health the Archdemon will move to a little ledge where you can't hit it unless you use ranged weapons. Have those characters still on close range weapons switch to ranged.  Make sure you use Wynne's healing to its full effect and use the spell revive to get back any characters that have fallen in battle.  Find out what to do when the characters health is at 25 percent. At 25 percent health the Archdemon will to return to where it was before it moved to the ledge, repeat the steps for that section of the fight, i.e move Sten and the PC, switch them to close range weapons etc. Figure out what your choices are, when the fight finishes. When the fight is finished, depending on your party choices: you die, Alistair dies, Loghain (yes the one who left the battle at Ostegar) dies, or you do Morrigan's ritual, and any of the above can kill the Archdemon and no-one dies.",
  "tyn_model":[
    "wynne",
    "sten",
    "mage",
    "archdemon",
    "bow",
    "crossbow",
    "pc",
    "morrigan"
  ],
  "tyn_section":[

  ]
}