{
  "title":"How to Make Festive Jello Shots",
  "url":"https://www.wikihow.com/Make-Festive-Jello-Shots",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Mixed Drink Shooters and Shots",
    "Jello and Jelly Shots"
  ],
  "steps":[
    {
      "headline":"Make Sweet Heart Jello Shots.",
      "description":"Choose between a single-layer pomegranate Jello shot or a layered cherry and cream Jello shot. Cut the shots into heart shapes to create the perfect Valentine’s Day aperitif."
    },
    {
      "headline":"Make St. Patrick's Day Jello Shots.",
      "description":"Show your Irish pride by making these layered jello shots that pull in the colors of the Irish flag. Irish whiskey and Irish cream liqueur put the flavors of the Emerald Isle into these green, white and orange shots."
    },
    {
      "headline":"Make Easter Egg Jello Shots.",
      "description":"This article will teach you to make 2 different Easter Jello shots. You can make a layered shot consisting of multiple Easter pastel colors, or you can make shots inside of plastic eggs and top them with marshmallow peeps."
    },
    {
      "headline":"Make Fourth of July Jello Shots.",
      "description":"Combine red, white and blue gelatin with a variety of liquors to make patriotic layered shots for your 4th of July picnic."
    },
    {
      "headline":"Make Zombie Brains Jello Shots.",
      "description":"These brain-shaped, pinkish-gray Jello shots filled with raspberry pie filling will give your Halloween party a creepy boost. Place these shots on a tray mounted on a severed hand to make your Halloween table even more macabre."
    },
    {
      "headline":"Make Candy Corn Jello Shots.",
      "description":"Candy corn is the signature candy of Halloween. These shots incorporate orange and cream gelatin layered inside of an orange section."
    },
    {
      "headline":"Make Candy Cane Jello Shots.",
      "description":"Choose from either a layered candy cane Jello shot in a cup or a candy-cane shaped Jello shot. The combination of peppermint and cinnamon liqueurs in these shots will invoke the flavors of the holiday season."
    },
    {
      "headline":"Make Mistletoe Jello Shots.",
      "description":"This Jello shot is a take on the classic Mistletoe cocktail. The festive red shot is topped with a curl of orange or tangerine peel."
    },
    {
      "headline":"Make Eggnog Jello Shots.",
      "description":"You can serve eggnog Jello shots in plastic shot glasses, or you can shape them in Bordelaise molds. Choose rum or brandy to complement your eggnog shots."
    },
    {
      "headline":"Make Hanukkah Jello Shots.",
      "description":"Blue liquors and edible gold flakes will make these Jello shots a fitting addition to your Hanukkah celebration. Serve them before the latkes or after with the sufganiyot."
    }
  ],
  "text":" Make Sweet Heart Jello Shots. Choose between a single-layer pomegranate Jello shot or a layered cherry and cream Jello shot. Cut the shots into heart shapes to create the perfect Valentine’s Day aperitif. Make St. Patrick's Day Jello Shots. Show your Irish pride by making these layered jello shots that pull in the colors of the Irish flag. Irish whiskey and Irish cream liqueur put the flavors of the Emerald Isle into these green, white and orange shots. Make Easter Egg Jello Shots. This article will teach you to make 2 different Easter Jello shots. You can make a layered shot consisting of multiple Easter pastel colors, or you can make shots inside of plastic eggs and top them with marshmallow peeps. Make Fourth of July Jello Shots. Combine red, white and blue gelatin with a variety of liquors to make patriotic layered shots for your 4th of July picnic. Make Zombie Brains Jello Shots. These brain-shaped, pinkish-gray Jello shots filled with raspberry pie filling will give your Halloween party a creepy boost. Place these shots on a tray mounted on a severed hand to make your Halloween table even more macabre. Make Candy Corn Jello Shots. Candy corn is the signature candy of Halloween. These shots incorporate orange and cream gelatin layered inside of an orange section. Make Candy Cane Jello Shots. Choose from either a layered candy cane Jello shot in a cup or a candy-cane shaped Jello shot. The combination of peppermint and cinnamon liqueurs in these shots will invoke the flavors of the holiday season. Make Mistletoe Jello Shots. This Jello shot is a take on the classic Mistletoe cocktail. The festive red shot is topped with a curl of orange or tangerine peel. Make Eggnog Jello Shots. You can serve eggnog Jello shots in plastic shot glasses, or you can shape them in Bordelaise molds. Choose rum or brandy to complement your eggnog shots. Make Hanukkah Jello Shots. Blue liquors and edible gold flakes will make these Jello shots a fitting addition to your Hanukkah celebration. Serve them before the latkes or after with the sufganiyot.",
  "tyn_model":[
    "candy cane jello",
    "sweet heart jello",
    "irish whiskey",
    "irish cream liqueur",
    "gelatin",
    "liquors",
    "jello",
    "raspberry pie",
    "tray",
    "candy corn jello",
    "candy corn",
    "candy-cane shaped",
    "eggnog jello",
    "rum",
    "brandy",
    "blue liquors",
    "edible gold flakes"
  ],
  "tyn_section":[

  ]
}