{
  "title":"How to Make Strawberry Bavarian",
  "url":"https://www.wikihow.com/Make-Strawberry-Bavarian",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Gelatin Desserts"
  ],
  "steps":[
    {
      "headline":"Drain the thawed frozen strawberries into a mixing bowl.",
      "description":"Reserve the syrup."
    },
    {
      "headline":"Add the strawberry gelatin powder to a mixing bowl.",
      "description":"Pour boiling water over the gelatin powder and stir until dissolved."
    },
    {
      "headline":"Add enough cold water to the reserved strawberry syrup to make 1 cup of liquid.",
      "description":""
    },
    {
      "headline":"Add the the strawberry and water mixture to the dissolved gelatin mixture.",
      "description":""
    },
    {
      "headline":"Chill until the mixture is just set.",
      "description":""
    },
    {
      "headline":"Whip the cream until stiff.",
      "description":""
    },
    {
      "headline":"Fold the whipped cream into the strawberry mixture.",
      "description":""
    },
    {
      "headline":"Spoon the mixture into dessert dishes.",
      "description":""
    },
    {
      "headline":"Chill until firm.",
      "description":""
    },
    {
      "headline":"Serve topped with additional sweetened whipped cream.",
      "description":""
    }
  ],
  "text":" Drain the thawed frozen strawberries into a mixing bowl. Reserve the syrup. Add the strawberry gelatin powder to a mixing bowl. Pour boiling water over the gelatin powder and stir until dissolved. Add enough cold water to the reserved strawberry syrup to make 1 cup of liquid.  Add the the strawberry and water mixture to the dissolved gelatin mixture.  Chill until the mixture is just set.  Whip the cream until stiff.  Fold the whipped cream into the strawberry mixture.  Spoon the mixture into dessert dishes.  Chill until firm.  Serve topped with additional sweetened whipped cream. ",
  "tyn_model":[
    "mixing bowl",
    "water",
    "strawberry gelatin",
    "gelatin powder",
    "cold water",
    "strawberry syrup",
    "strawberry",
    "cream",
    "whipped cream",
    "dessert dishes",
    "sweetened whipped cream"
  ],
  "tyn_section":[

  ]
}