{
  "title":"How to Make Strawberry Buttermilk Baked Doughnuts",
  "url":"https://www.wikihow.com/Make-Strawberry-Buttermilk-Baked-Doughnuts",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Donuts and Doughnuts"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 375ºF/190ºC.",
      "description":""
    },
    {
      "headline":"Make the batter.",
      "description":"Mix the dry ingredients in a large bowl and thoroughly combine the wet ingredients in a separate bowl. Add the wet ingredients into the dry bowl."
    },
    {
      "headline":"Fold in the chopped strawberries.",
      "description":""
    },
    {
      "headline":"Pour the mixture into a pre-greased doughnut pan, about 2/3 full in each hole.",
      "description":""
    },
    {
      "headline":"Bake for 12 minutes, or until golden brown.",
      "description":"Allow them to cool on a cooling rack."
    },
    {
      "headline":"Make the icing.",
      "description":"Whisk the strawberries and sugar together. Add a tablespoon of water at a time until you achieve the right consistency. You can also substitute milk for a watered-down glaze appearance."
    },
    {
      "headline":"Spoon the icing on top on the doughnuts.",
      "description":"Leave them to rest on the cooling rack to allow the icing to set."
    }
  ],
  "text":" Preheat the oven to 375ºF/190ºC.  Make the batter. Mix the dry ingredients in a large bowl and thoroughly combine the wet ingredients in a separate bowl. Add the wet ingredients into the dry bowl. Fold in the chopped strawberries.  Pour the mixture into a pre-greased doughnut pan, about 2/3 full in each hole.  Bake for 12 minutes, or until golden brown. Allow them to cool on a cooling rack. Make the icing. Whisk the strawberries and sugar together. Add a tablespoon of water at a time until you achieve the right consistency. You can also substitute milk for a watered-down glaze appearance. Spoon the icing on top on the doughnuts. Leave them to rest on the cooling rack to allow the icing to set.",
  "tyn_model":[
    "strawberries",
    "oven",
    "large bowl",
    "doughnut pan",
    "icing",
    "sugar",
    "water",
    "milk"
  ],
  "tyn_section":[

  ]
}