{
  "title":"How to Make Lilac Sugar",
  "url":"https://www.wikihow.com/Make-Lilac-Sugar",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Sugar Treats"
  ],
  "steps":[
    {
      "headline":"Fill the jar three quarters of the way with the sugar.",
      "description":"Leave room for the addition of the lilac flower petals and sugar."
    },
    {
      "headline":"Separate the lilac petals from the stalk and each other.",
      "description":"Sprinkle the separated petals onto the sugar in the jar."
    },
    {
      "headline":"Sprinkle sugar on top of the lilac petals to press them down.",
      "description":""
    },
    {
      "headline":"Put the lid on the jar.",
      "description":"Shake vigorously to move the petals through the sugar in the jar."
    },
    {
      "headline":"Put the sugar jar aside to infuse.",
      "description":"Choose a dry, dark and cool spot to store it. Shake it every now and then over the next two to three days."
    },
    {
      "headline":"After two to three days have passed, sift the sugar through a sieve with large holes.",
      "description":"Pull out the large petals as these should not be kept in the sugar for serving. Add some of the violet food coloring at this stage if using. If you do so, leave the sugar on a parchment covered tray to dry out. This may take several days."
    },
    {
      "headline":"Store in an airtight container.",
      "description":"Keep the lilac sugar in the pantry away from light and humidity. Use when making or baking foods that require a lilac flavour or add to your tea and coffee. It is also lovely sprinkled over cereal, fresh fruit and added to tisanes. Why not try making cinnamon toast using lilac sugar instead of plain sugar?"
    }
  ],
  "text":" Fill the jar three quarters of the way with the sugar. Leave room for the addition of the lilac flower petals and sugar. Separate the lilac petals from the stalk and each other. Sprinkle the separated petals onto the sugar in the jar. Sprinkle sugar on top of the lilac petals to press them down.  Put the lid on the jar. Shake vigorously to move the petals through the sugar in the jar. Put the sugar jar aside to infuse. Choose a dry, dark and cool spot to store it. Shake it every now and then over the next two to three days. After two to three days have passed, sift the sugar through a sieve with large holes. Pull out the large petals as these should not be kept in the sugar for serving. Add some of the violet food coloring at this stage if using. If you do so, leave the sugar on a parchment covered tray to dry out. This may take several days. Store in an airtight container. Keep the lilac sugar in the pantry away from light and humidity. Use when making or baking foods that require a lilac flavour or add to your tea and coffee. It is also lovely sprinkled over cereal, fresh fruit and added to tisanes. Why not try making cinnamon toast using lilac sugar instead of plain sugar?",
  "tyn_model":[
    "sugar",
    "lilac sugar",
    "sieve",
    "violet food coloring",
    "parchment covered tray",
    "cinnamon toast"
  ],
  "tyn_section":[

  ]
}