{
  "title":"How to Make Scented Geranium Sugar",
  "url":"https://www.wikihow.com/Make-Scented-Geranium-Sugar",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments"
  ],
  "steps":[
    {
      "headline":"Pour a layer of sugar at the base of the jar.",
      "description":""
    },
    {
      "headline":"Add a few leaves as the next layer.",
      "description":""
    },
    {
      "headline":"Pour the next layer of sugar over the leaves to cover them.",
      "description":"Then add another layer of leaves."
    },
    {
      "headline":"Repeat this layering process until you reach the top of the jar.",
      "description":""
    },
    {
      "headline":"Close the jar.",
      "description":"Place it somewhere sunny, such as a kitchen windowsill and leave it there for two weeks. The heat of the sun will help infuse the flavours through the sugar."
    },
    {
      "headline":"Shake the jar at the end of the two weeks.",
      "description":"Store in the usual sugar storage place."
    },
    {
      "headline":"Use as needed.",
      "description":"It will make a sweetly scented addition to cakes, biscuits and other baked goods. It also goes well in hot drinks such as coffee."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Pour a layer of sugar at the base of the jar.  Add a few leaves as the next layer.  Pour the next layer of sugar over the leaves to cover them. Then add another layer of leaves. Repeat this layering process until you reach the top of the jar.  Close the jar. Place it somewhere sunny, such as a kitchen windowsill and leave it there for two weeks. The heat of the sun will help infuse the flavours through the sugar. Shake the jar at the end of the two weeks. Store in the usual sugar storage place. Use as needed. It will make a sweetly scented addition to cakes, biscuits and other baked goods. It also goes well in hot drinks such as coffee. Finished. ",
  "tyn_model":[
    "sugar",
    "jar"
  ],
  "tyn_section":[

  ]
}