{
  "title":"How to Make a Violet Crumble Cocktail",
  "url":"https://www.wikihow.com/Make-a-Violet-Crumble-Cocktail",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Cocktails",
    "Liqueur Based Cocktails"
  ],
  "methods":[
    {
      "name":"Layered violet crumble cocktail",
      "steps":[
        {
          "headline":"Shot layer the chocolate liqueur on top of the schnapps.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Share with  pieces of chocolate coated honeycomb to add to the flavor enjoyment."
        }
      ]
    },
    {
      "name":"Violet crumble crème cocktail",
      "steps":[
        {
          "headline":"Make the honey syrup.",
          "description":"Heat the honey and water in a saucepan. Stir constantly while it simmers. Remove from the heat and allow to cool, then chill before using."
        },
        {
          "headline":"Fill four low ball glasses with ice.",
          "description":""
        },
        {
          "headline":"Add a lemon wedge to each glass and a few cherries.",
          "description":""
        },
        {
          "headline":"Pour lemon soda into each glass.",
          "description":"Fill halfway."
        },
        {
          "headline":"Pour the crème de violette, chilled honey syrup and a few spoons of maraschino syrup into the cocktail shaker.",
          "description":"Add a handful of ice."
        },
        {
          "headline":"Shake well.",
          "description":"Pour the mixture into the glasses."
        },
        {
          "headline":"Pour in a shot of either whiskey or gin.",
          "description":"Choose whichever you prefer or ask your guests for their preference. This step is optional but adds more depth to the drink."
        },
        {
          "headline":"Serve.",
          "description":""
        }
      ]
    },
    {
      "name":"Violet crumble cocktail with parfait amour",
      "steps":[
        {
          "headline":"Add the ingredients to a mixing glass.",
          "description":""
        },
        {
          "headline":"Stir together to combine.",
          "description":""
        },
        {
          "headline":"Pour into a shot glass.",
          "description":"It's now ready to serve."
        }
      ]
    },
    {
      "name":"Violet crumble cocktail with kahlua",
      "steps":[
        {
          "headline":"Pour the liquid into a cocktail shaker.",
          "description":"Add a handful of ice."
        },
        {
          "headline":"Shake well.",
          "description":""
        },
        {
          "headline":"Pour into cocktail glasses.",
          "description":""
        }
      ]
    }
  ],
  "text":" Layered violet crumble cocktail Shot layer the chocolate liqueur on top of the schnapps.  Serve. Share with  pieces of chocolate coated honeycomb to add to the flavor enjoyment. Violet crumble crème cocktail Make the honey syrup. Heat the honey and water in a saucepan. Stir constantly while it simmers. Remove from the heat and allow to cool, then chill before using. Fill four low ball glasses with ice.  Add a lemon wedge to each glass and a few cherries.  Pour lemon soda into each glass. Fill halfway. Pour the crème de violette, chilled honey syrup and a few spoons of maraschino syrup into the cocktail shaker. Add a handful of ice. Shake well. Pour the mixture into the glasses. Pour in a shot of either whiskey or gin. Choose whichever you prefer or ask your guests for their preference. This step is optional but adds more depth to the drink. Serve.  Violet crumble cocktail with parfait amour Add the ingredients to a mixing glass.  Stir together to combine.  Pour into a shot glass. It's now ready to serve. Violet crumble cocktail with kahlua Pour the liquid into a cocktail shaker. Add a handful of ice. Shake well.  Pour into cocktail glasses. ",
  "tyn_model":[
    "ice",
    "honey syrup",
    "cocktail shaker",
    "chocolate liqueur",
    "chocolate coated honeycomb",
    "violet crumble",
    "honey",
    "water",
    "saucepan",
    "low ball glasses",
    "lemon",
    "cherries",
    "lemon soda",
    "maraschino syrup",
    "violet crumble cocktail",
    "parfait amour",
    "mixing glass",
    "shot glass",
    "cocktail glasses"
  ],
  "tyn_section":[

  ]
}