{
  "title":"How to Make Butter Chicken",
  "url":"https://www.wikihow.com/Make-Butter-Chicken",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Indian Chicken Dishes"
  ],
  "methods":[
    {
      "name":"Butter chicken",
      "steps":[
        {
          "headline":"Season the chicken.",
          "description":"Begin by seasoning the chicken with a generous sprinkling of salt and pepper."
        },
        {
          "headline":"Heat the oil and begin to fry the chicken.",
          "description":"Using a large frying pan, heat the vegetable oil and add the chicken."
        },
        {
          "headline":"Fry for 3-4 minutes.",
          "description":"Fry the chicken for 3-4 minutes until it turns a golden-brown colour."
        },
        {
          "headline":"Remove the chicken.",
          "description":"Take the chicken out of the frying pan and put it aside."
        },
        {
          "headline":"Melt the butter.",
          "description":"Use the same frying pan to melt the butter."
        },
        {
          "headline":"Fry the onion with the cinnamon.",
          "description":"Now add the onion and cinnamon and fry together in the pan."
        },
        {
          "headline":"Add the remaining ingredients.",
          "description":"At this point add the crushed garlic, crushed ginger, turmeric, chilli powder, almonds, peeled tomatoes, tomato paste and the natural yoghurt. Stir all of the ingredients together and mix thoroughly."
        },
        {
          "headline":"Bring to the boil and cook.",
          "description":"Bring the ingredients to a boil and stir for 4-5 minutes. Season with salt and pepper to taste."
        },
        {
          "headline":"Add the chicken.",
          "description":"Put the chicken back into the pan and combine with the other ingredients."
        },
        {
          "headline":"Add the fresh coriander.",
          "description":"To complement the flavors in the dish, add the coriander (or fresh spinach if you prefer) and mix with the sauce."
        },
        {
          "headline":"Serve while streaming and eat up!",
          "description":"Spoon the chicken and the sauce onto a large serving dish and serve with rice and Naan bread. A perfect curry dish that goes down well with an icy Asian beer."
        }
      ]
    },
    {
      "name":"Olive oil and butter chicken",
      "steps":[
        {
          "headline":"Add the olive oil to the pan.",
          "description":"Add pepper and salt to taste."
        },
        {
          "headline":"Add the chicken pieces.",
          "description":"Gently cook over low heat, allowing the flavors to infuse. Remove and set aside."
        },
        {
          "headline":"Add the butter to a separate pan.",
          "description":""
        },
        {
          "headline":"Add the chopped onion.",
          "description":"Cook until browned."
        },
        {
          "headline":"Add the tomatoes and garlic.",
          "description":""
        },
        {
          "headline":"Cook until the garlic softens.",
          "description":"Remove from the heat."
        },
        {
          "headline":"Blend the butter and tomato mixture.",
          "description":"Blend until it forms a puree."
        },
        {
          "headline":"Pour the puree over the chicken pieces.",
          "description":""
        },
        {
          "headline":"Add a little more oil, and the cardamom and cinnamon.",
          "description":""
        },
        {
          "headline":"Add the fresh cream.",
          "description":"Cook over a low to medium heat for 30 minutes. Stir occasionally."
        },
        {
          "headline":"Serve hot.",
          "description":""
        }
      ]
    },
    {
      "name":"Spicy Butter Chicken",
      "steps":[
        {
          "headline":"Marinate the chicken with all of the spices besides the clarified butter.",
          "description":""
        },
        {
          "headline":"Cook the chicken in the ghee(butter) until it is done.",
          "description":"After the chicken is ready it is now time to make the sauce."
        },
        {
          "headline":"Braise the onion in the butter (just for a while not until gold).",
          "description":""
        },
        {
          "headline":"Add all of the sauce spices (besides fresh cream) and cook it until the water evaporates",
          "description":""
        },
        {
          "headline":"Add the fresh cream and cook the sauce for 2 minutes on low.",
          "description":""
        },
        {
          "headline":"Add the chicken in the sauce and cook it for 5 minutes.",
          "description":""
        },
        {
          "headline":"Garnish the Butter Chicken with chopped coriander.",
          "description":""
        }
      ]
    }
  ],
  "text":" Butter chicken Season the chicken. Begin by seasoning the chicken with a generous sprinkling of salt and pepper. Heat the oil and begin to fry the chicken. Using a large frying pan, heat the vegetable oil and add the chicken. Fry for 3-4 minutes. Fry the chicken for 3-4 minutes until it turns a golden-brown colour. Remove the chicken. Take the chicken out of the frying pan and put it aside. Melt the butter. Use the same frying pan to melt the butter. Fry the onion with the cinnamon. Now add the onion and cinnamon and fry together in the pan. Add the remaining ingredients. At this point add the crushed garlic, crushed ginger, turmeric, chilli powder, almonds, peeled tomatoes, tomato paste and the natural yoghurt. Stir all of the ingredients together and mix thoroughly. Bring to the boil and cook. Bring the ingredients to a boil and stir for 4-5 minutes. Season with salt and pepper to taste. Add the chicken. Put the chicken back into the pan and combine with the other ingredients. Add the fresh coriander. To complement the flavors in the dish, add the coriander (or fresh spinach if you prefer) and mix with the sauce. Serve while streaming and eat up! Spoon the chicken and the sauce onto a large serving dish and serve with rice and Naan bread. A perfect curry dish that goes down well with an icy Asian beer. Olive oil and butter chicken Add the olive oil to the pan. Add pepper and salt to taste. Add the chicken pieces. Gently cook over low heat, allowing the flavors to infuse. Remove and set aside. Add the butter to a separate pan.  Add the chopped onion. Cook until browned. Add the tomatoes and garlic.  Cook until the garlic softens. Remove from the heat. Blend the butter and tomato mixture. Blend until it forms a puree. Pour the puree over the chicken pieces.  Add a little more oil, and the cardamom and cinnamon.  Add the fresh cream. Cook over a low to medium heat for 30 minutes. Stir occasionally. Serve hot.  Spicy Butter Chicken Marinate the chicken with all of the spices besides the clarified butter.  Cook the chicken in the ghee(butter) until it is done. After the chicken is ready it is now time to make the sauce. Braise the onion in the butter (just for a while not until gold).  Add all of the sauce spices (besides fresh cream) and cook it until the water evaporates  Add the fresh cream and cook the sauce for 2 minutes on low.  Add the chicken in the sauce and cook it for 5 minutes.  Garnish the Butter Chicken with chopped coriander. ",
  "tyn_model":[
    "chicken",
    "butter",
    "onion",
    "cinnamon",
    "fresh cream",
    "salt and pepper",
    "oil",
    "frying pan",
    "tomatoes",
    "coriander",
    "olive oil",
    "butter chicken",
    "garlic",
    "large frying pan",
    "vegetable oil",
    "crushed garlic",
    "crushed ginger",
    "turmeric",
    "chilli powder",
    "almonds",
    "tomato paste",
    "natural yoghurt",
    "fresh coriander",
    "spinach",
    "large serving dish",
    "rice",
    "naan bread",
    "pepper",
    "salt",
    "tomato",
    "cardamom",
    "spicy butter",
    "clarified butter",
    "ghee(butter",
    "water"
  ],
  "tyn_section":[

  ]
}