{
  "title":"How to Recycle a Coffee Can",
  "url":"https://www.wikihow.com/Recycle-a-Coffee-Can",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Make a Decorative Candle Holder from a Coffee Can",
      "steps":[
        {
          "headline":"Peel the label away from your coffee can.",
          "description":"Unless you want the finished candle holder to have its label displayed, peel the label away with your fingers. You can use dish soap and a scouring pad to remove any remaining adhesive from the coffee can."
        },
        {
          "headline":"Punch holes around the sides of the can.",
          "description":"For the candle's light to escape in decorative patterns, you will need to punch holes in a random pattern all around the coffee can. You can do this using an electric drill or by hammering a nail into the can to create each hole."
        },
        {
          "headline":"Place a small candle into the coffee can lamp.",
          "description":"After punching the holes in the can, you can place a candle into the lamp and light it. The coffee can's size will allow it to hold tea lights, votives, and small pillar candles comfortably. In low light, your coffee can lamp will project flickering star-like patterns onto your walls through the holes."
        }
      ]
    },
    {
      "name":"Make Storage Cubbies from a Coffee Can",
      "steps":[
        {
          "headline":"Remove the label and paint your coffee can.",
          "description":"Coffee cans can also make inexpensive and elegant cubbies for holding pencils, office supplies, knitting supplies, and anything else you can think of. To tailor the aesthetic impact of your coffee can cubby, remove the label and paint the can your desired color."
        },
        {
          "headline":"Attach multiple coffee cans together if desired.",
          "description":"If you want to build an entire storage rack from the coffee cans (for example, for storing many skeins of yarn), you can attach them together. You can glue the sides of each coffee can to the next using a hot glue gun. Coffee can cubbies assembled in this way can even be mounted on the wall."
        },
        {
          "headline":"Fill the coffee can cubbies with your favorite items.",
          "description":"These cubbies are great for storing pencils, pens, and scissors on a desktop. They are also excellent for storing knitting needles or yarn and for organizing paperclips, staples, and other small office supplies. They can even be used in the kitchen to organize different kinds of teabags or individual packs of sweeteners."
        }
      ]
    },
    {
      "name":"Make a Toy Drum from a Coffee Can",
      "steps":[
        {
          "headline":"Decorate the sides of the coffee can.",
          "description":"To recycle a coffee can in a kid-friendly project, you can make a small (and relatively quiet) toy drum. Begin by decorating the exterior of the can with your child in any way you want. Paint, construction paper, and stickers are all excellent options for decorating the drum."
        },
        {
          "headline":"Affix the drum head to the coffee can drum.",
          "description":"Cut a circle out of felt that is a bit larger than the opening of the coffee can. Secure this felt over the opening of the can using a rubber band. The felt forms the drum head of the drum - the surface that is struck when the drum is played."
        },
        {
          "headline":"Fashion sticks for your coffee can drum.",
          "description":"To play the drum, you'll need to improvise some drum sticks. Pencils or pens make adequate impromptu drum sticks, but you can make more sophisticated mallets by gluing foam balls to the ends of thin wooden dowels."
        }
      ]
    }
  ],
  "text":" Make a Decorative Candle Holder from a Coffee Can Peel the label away from your coffee can. Unless you want the finished candle holder to have its label displayed, peel the label away with your fingers. You can use dish soap and a scouring pad to remove any remaining adhesive from the coffee can. Punch holes around the sides of the can. For the candle's light to escape in decorative patterns, you will need to punch holes in a random pattern all around the coffee can. You can do this using an electric drill or by hammering a nail into the can to create each hole. Place a small candle into the coffee can lamp. After punching the holes in the can, you can place a candle into the lamp and light it. The coffee can's size will allow it to hold tea lights, votives, and small pillar candles comfortably. In low light, your coffee can lamp will project flickering star-like patterns onto your walls through the holes. Make Storage Cubbies from a Coffee Can Remove the label and paint your coffee can. Coffee cans can also make inexpensive and elegant cubbies for holding pencils, office supplies, knitting supplies, and anything else you can think of. To tailor the aesthetic impact of your coffee can cubby, remove the label and paint the can your desired color. Attach multiple coffee cans together if desired. If you want to build an entire storage rack from the coffee cans (for example, for storing many skeins of yarn), you can attach them together. You can glue the sides of each coffee can to the next using a hot glue gun. Coffee can cubbies assembled in this way can even be mounted on the wall. Fill the coffee can cubbies with your favorite items. These cubbies are great for storing pencils, pens, and scissors on a desktop. They are also excellent for storing knitting needles or yarn and for organizing paperclips, staples, and other small office supplies. They can even be used in the kitchen to organize different kinds of teabags or individual packs of sweeteners. Make a Toy Drum from a Coffee Can Decorate the sides of the coffee can. To recycle a coffee can in a kid-friendly project, you can make a small (and relatively quiet) toy drum. Begin by decorating the exterior of the can with your child in any way you want. Paint, construction paper, and stickers are all excellent options for decorating the drum. Affix the drum head to the coffee can drum. Cut a circle out of felt that is a bit larger than the opening of the coffee can. Secure this felt over the opening of the can using a rubber band. The felt forms the drum head of the drum - the surface that is struck when the drum is played. Fashion sticks for your coffee can drum. To play the drum, you'll need to improvise some drum sticks. Pencils or pens make adequate impromptu drum sticks, but you can make more sophisticated mallets by gluing foam balls to the ends of thin wooden dowels.",
  "tyn_model":[
    "coffee can",
    "coffee cans",
    "candle",
    "dish soap",
    "scouring pad",
    "electric drill",
    "hot glue gun",
    "scissors",
    "paint",
    "construction paper",
    "stickers",
    "rubber band",
    "drum sticks",
    "pencils",
    "pens"
  ],
  "tyn_section":[

  ]
}