{
  "title":"How to Bake Bread Machine Crescent Rolls",
  "url":"https://www.wikihow.com/Bake-Bread-Machine-Crescent-Rolls",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Bread Rolls"
  ],
  "steps":[
    {
      "headline":"Add all the ingredients using your bread machine manufacturer's directions.",
      "description":""
    },
    {
      "headline":"Select the dough cycle.",
      "description":""
    },
    {
      "headline":"Remove the dough from the bread machine.",
      "description":""
    },
    {
      "headline":"Divide the dough into 3 pieces using a bench scraper or kitchen knife.",
      "description":""
    },
    {
      "headline":"Roll out 1 piece of dough into a circle.",
      "description":""
    },
    {
      "headline":"Brush the dough circle with some of the melted butter.",
      "description":""
    },
    {
      "headline":"Cut the dough into quarters.",
      "description":""
    },
    {
      "headline":"Cut each quarter into 2 equal wedge shaped pieces of dough.",
      "description":""
    },
    {
      "headline":"Start the wide end of the dough and roll towards the small pointed end.",
      "description":"While rolling the dough you can stretch the dough to make more of a wedge shape."
    },
    {
      "headline":"Place the rolled up wedge onto the prepared baking sheet making sure to keep the pointed end tucked under the wedge.",
      "description":"Shape the roll into a crescent shape by turning the ends towards each other."
    },
    {
      "headline":"Repeat this procedure with the remaining pieces of dough you should have 24 crescent rolls placed on the baking sheets.",
      "description":""
    },
    {
      "headline":"Allow the rolls to rise for another 30 to 40 minutes or until nearly doubled.",
      "description":""
    },
    {
      "headline":"Preheat the oven to 375 °F (191 °C).",
      "description":""
    },
    {
      "headline":"Bake the rolls for 8 to 10 minutes or until the rolls are a golden brown.",
      "description":""
    },
    {
      "headline":"Remove rolls to a cooling rack.",
      "description":""
    }
  ],
  "text":" Add all the ingredients using your bread machine manufacturer's directions.  Select the dough cycle.  Remove the dough from the bread machine.  Divide the dough into 3 pieces using a bench scraper or kitchen knife.  Roll out 1 piece of dough into a circle.  Brush the dough circle with some of the melted butter.  Cut the dough into quarters.  Cut each quarter into 2 equal wedge shaped pieces of dough.  Start the wide end of the dough and roll towards the small pointed end. While rolling the dough you can stretch the dough to make more of a wedge shape. Place the rolled up wedge onto the prepared baking sheet making sure to keep the pointed end tucked under the wedge. Shape the roll into a crescent shape by turning the ends towards each other. Repeat this procedure with the remaining pieces of dough you should have 24 crescent rolls placed on the baking sheets.  Allow the rolls to rise for another 30 to 40 minutes or until nearly doubled.  Preheat the oven to 375 °F (191 °C).  Bake the rolls for 8 to 10 minutes or until the rolls are a golden brown.  Remove rolls to a cooling rack. ",
  "tyn_model":[
    "bread machine",
    "bench scraper",
    "kitchen knife",
    "butter",
    "baking sheet",
    "baking sheets",
    "oven"
  ],
  "tyn_section":[

  ]
}