{
  "title":"How to Make a Flash Reflector for Macro Photography",
  "url":"https://www.wikihow.com/Make-a-Flash-Reflector-for-Macro-Photography",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photographic Techniques"
  ],
  "steps":[
    {
      "headline":"Re-appropriate a ⁄2 gallon (1.9 L) jug from the recycle bin.",
      "description":"Be sure that it has been rinsed out pretty well."
    },
    {
      "headline":"Cut a side from the jug.",
      "description":"You want it to be bigger than its final shape so that you can trim it down. Be sure that the corners are included in the cut."
    },
    {
      "headline":"Trim it down to the size that you want it.",
      "description":"You want it to be able to be fastened to your flash and extend well past it. The actual length of a milk jug is about right."
    },
    {
      "headline":"Apply some type of glue or double-sided tape to the inside of the jug.",
      "description":"(What would be the inside of the container.)"
    },
    {
      "headline":"Apply your reflective surface.",
      "description":"This can be:\nMylar from wrapping paper\nMylar gift balloons\nInside of a dry food bag\nAluminum foil"
    },
    {
      "headline":"Smooth the edges with tape.",
      "description":"You can use pretty much whatever type of tape you have that you believe is sturdy enough. Chrome tape is recommended. Any kind of colored tape can reflect in shiny objects that are photographed."
    },
    {
      "headline":"Fasten it to your flash.",
      "description":"A rubber band would probably work best, but use what you have."
    },
    {
      "headline":"Fasten the flash to your camera and have it bent to 90 degrees.",
      "description":"This can be adapted for your purposes."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Re-appropriate a ⁄2 gallon (1.9 L) jug from the recycle bin. Be sure that it has been rinsed out pretty well. Cut a side from the jug. You want it to be bigger than its final shape so that you can trim it down. Be sure that the corners are included in the cut. Trim it down to the size that you want it. You want it to be able to be fastened to your flash and extend well past it. The actual length of a milk jug is about right. Apply some type of glue or double-sided tape to the inside of the jug. (What would be the inside of the container.) Apply your reflective surface. This can be:\nMylar from wrapping paper\nMylar gift balloons\nInside of a dry food bag\nAluminum foil Smooth the edges with tape. You can use pretty much whatever type of tape you have that you believe is sturdy enough. Chrome tape is recommended. Any kind of colored tape can reflect in shiny objects that are photographed. Fasten it to your flash. A rubber band would probably work best, but use what you have. Fasten the flash to your camera and have it bent to 90 degrees. This can be adapted for your purposes. Finished. ",
  "tyn_model":[
    "tape",
    "jug",
    "milk jug",
    "glue",
    "mylar",
    "mylar gift balloons",
    "dry food bag",
    "aluminum foil",
    "camera"
  ],
  "tyn_section":[

  ]
}