{
  "title":"How to Make Sweet Pasta Cake",
  "url":"https://www.wikihow.com/Make-Sweet-Pasta-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes"
  ],
  "steps":[
    {
      "headline":"Put the raisins or sultanas into a small bowl.",
      "description":"Cover with the warm apple juice and let soak for 10 minutes."
    },
    {
      "headline":"Preheat the oven to 180ºC/350ºF.",
      "description":"Line the cake pan with baking/parchment paper."
    },
    {
      "headline":"Peel and core the apples.",
      "description":"Grate coarsely. Place in a separate bowl and cover in the lemon juice. The juice will stop the grated apple from going brown."
    },
    {
      "headline":"Cook the pasta in boiling water until al dente.",
      "description":"Remove when cooked, drain and rinse under cold water."
    },
    {
      "headline":"In the large mixing bowl, add the eggs and sugar.",
      "description":"Beat lightly."
    },
    {
      "headline":"Add the chopped almonds, orange zest and soaked raisins or sultanas.",
      "description":"Fold in the cooled pasta and grated apples."
    },
    {
      "headline":"Pour the batter into the prepared cake pan.",
      "description":"Cover with foil before placing in the oven to bake. Bake for 40 minutes."
    },
    {
      "headline":"After 40 minutes, remove the foil.",
      "description":"Sprinkle with the demerara sugar. Let the cake bake another 10 minutes uncovered until the sugar turns lightly brown."
    },
    {
      "headline":"Remove from the oven.",
      "description":"Leave in the pan for 15 minutes to cool and set."
    },
    {
      "headline":"Serve.",
      "description":"Add a blob of whipped cream or a dash of plain yogurt. The cake should be served at room temperature and eaten on the day of baking."
    }
  ],
  "text":" Put the raisins or sultanas into a small bowl. Cover with the warm apple juice and let soak for 10 minutes. Preheat the oven to 180ºC/350ºF. Line the cake pan with baking/parchment paper. Peel and core the apples. Grate coarsely. Place in a separate bowl and cover in the lemon juice. The juice will stop the grated apple from going brown. Cook the pasta in boiling water until al dente. Remove when cooked, drain and rinse under cold water. In the large mixing bowl, add the eggs and sugar. Beat lightly. Add the chopped almonds, orange zest and soaked raisins or sultanas. Fold in the cooled pasta and grated apples. Pour the batter into the prepared cake pan. Cover with foil before placing in the oven to bake. Bake for 40 minutes. After 40 minutes, remove the foil. Sprinkle with the demerara sugar. Let the cake bake another 10 minutes uncovered until the sugar turns lightly brown. Remove from the oven. Leave in the pan for 15 minutes to cool and set. Serve. Add a blob of whipped cream or a dash of plain yogurt. The cake should be served at room temperature and eaten on the day of baking.",
  "tyn_model":[
    "oven",
    "cake pan",
    "water",
    "sugar",
    "foil",
    "small bowl",
    "apple juice",
    "baking/parchment paper",
    "apples",
    "bowl",
    "lemon",
    "large mixing bowl",
    "eggs",
    "almonds",
    "orange",
    "demerara sugar",
    "whipped cream",
    "plain yogurt"
  ],
  "tyn_section":[

  ]
}