{
  "title":"How to Keep Your House Clean with a New Baby",
  "url":"https://www.wikihow.com/Keep-Your-House-Clean-with-a-New-Baby",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "Cleaning Motivation"
  ],
  "steps":[
    {
      "headline":"Be organized.",
      "description":"(Ideally, work on this before delivery or adopting the baby! )You don't have lots of time to pick up additional clutter or rummage for misplaced items. Have a place for everything. Have any members of your family pick up after themselves."
    },
    {
      "headline":"Prioritize.",
      "description":"Baby's health and safety is first, your sanity and well-being is second, vital household tasks like food preparation and having toilet paper third, and everything else much less important."
    },
    {
      "headline":"Do tasks in a chunk.",
      "description":"It may be more effective to spend one whole Saturday evening doing laundry rather than two loads every day. Or go to a laundromat and get all the laundry done at once."
    },
    {
      "headline":"Put away one thing every time you get up.",
      "description":"Although this seems like a paltry amount, making sure things go back in place on a regular basis can make a big difference."
    },
    {
      "headline":"Multi-task.",
      "description":"While talking on the phone, unload the dishwasher or wipe a counter top. While watching TV, you can fold laundry, chop broccoli, or vacuum during a commercial break. When cooking or washing dishes for a prolonged period of time, place the baby in a playpen in an area out of danger, for example a corner. This enables them to see you (and vice versa) and relaxes them because they know you're still close to them. Using car seats as chairs or sleeping devices is not recommended by the American Academy of Pediatrics."
    },
    {
      "headline":"Take advantage of time-savers.",
      "description":"Get take-out. Buy baby food rather than trying to make everything yourself. Use paper plates when entertaining."
    },
    {
      "headline":"Simplify when possible.",
      "description":"Don't buy clothes that require ironing, for instance."
    },
    {
      "headline":"Get help.",
      "description":"Ask a friend or relative to babysit so you can clean. Even an hour can help."
    },
    {
      "headline":"Use a baby carrier to bring Baby along.",
      "description":"Wearing your baby frees your hands and may actually enable you to not only start, but actually--gasp!--complete a task. Your baby might just want company, and be fine with you folding laundry, washing dishes or using automatic mop on the floor as long as he or she is near you."
    },
    {
      "headline":"Involve baby in chores.",
      "description":"Cover Baby with warm clean clothes, play peek-a-boo while you fold towels, dance with him while dusting, have her watch the microwave turntable as you defrost peas. As you unload the dishwasher, hand him a plastic dish to wave around."
    },
    {
      "headline":"Vacuum just before baby's bed or naptime--the droning of the vacuum may lull your little one to sleep.",
      "description":"It solves two problems at once!"
    },
    {
      "headline":"Be realistic.",
      "description":"Erma Bombeck said, \"Cleaning the house while the children are growing is like shovelling the sidewalk before it stops snowing.\" You won't have a pristine house, but you can have a good-enough house. Visitors are coming to see the baby and won't care a bit about a bit of clutter. Relax into a sensible standard of cleanliness for a while to save your sanity, and don't be ashamed of the mess--you have one of the worthiest excuses going!"
    }
  ],
  "text":" Be organized. (Ideally, work on this before delivery or adopting the baby! )You don't have lots of time to pick up additional clutter or rummage for misplaced items. Have a place for everything. Have any members of your family pick up after themselves. Prioritize. Baby's health and safety is first, your sanity and well-being is second, vital household tasks like food preparation and having toilet paper third, and everything else much less important. Do tasks in a chunk. It may be more effective to spend one whole Saturday evening doing laundry rather than two loads every day. Or go to a laundromat and get all the laundry done at once. Put away one thing every time you get up. Although this seems like a paltry amount, making sure things go back in place on a regular basis can make a big difference. Multi-task. While talking on the phone, unload the dishwasher or wipe a counter top. While watching TV, you can fold laundry, chop broccoli, or vacuum during a commercial break. When cooking or washing dishes for a prolonged period of time, place the baby in a playpen in an area out of danger, for example a corner. This enables them to see you (and vice versa) and relaxes them because they know you're still close to them. Using car seats as chairs or sleeping devices is not recommended by the American Academy of Pediatrics. Take advantage of time-savers. Get take-out. Buy baby food rather than trying to make everything yourself. Use paper plates when entertaining. Simplify when possible. Don't buy clothes that require ironing, for instance. Get help. Ask a friend or relative to babysit so you can clean. Even an hour can help. Use a baby carrier to bring Baby along. Wearing your baby frees your hands and may actually enable you to not only start, but actually--gasp!--complete a task. Your baby might just want company, and be fine with you folding laundry, washing dishes or using automatic mop on the floor as long as he or she is near you. Involve baby in chores. Cover Baby with warm clean clothes, play peek-a-boo while you fold towels, dance with him while dusting, have her watch the microwave turntable as you defrost peas. As you unload the dishwasher, hand him a plastic dish to wave around. Vacuum just before baby's bed or naptime--the droning of the vacuum may lull your little one to sleep. It solves two problems at once! Be realistic. Erma Bombeck said, \"Cleaning the house while the children are growing is like shovelling the sidewalk before it stops snowing.\" You won't have a pristine house, but you can have a good-enough house. Visitors are coming to see the baby and won't care a bit about a bit of clutter. Relax into a sensible standard of cleanliness for a while to save your sanity, and don't be ashamed of the mess--you have one of the worthiest excuses going!",
  "tyn_model":[
    "vacuum",
    "laundry",
    "toilet paper",
    "plates",
    "baby carrier",
    "microwave turntable",
    "dishwasher"
  ],
  "tyn_section":[

  ]
}