{
  "title":"How to Make a Bed Neatly",
  "url":"https://www.wikihow.com/Make-a-Bed-Neatly",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "methods":[
    {
      "name":"Putting on the Bed Linens",
      "steps":[
        {
          "headline":"Place a bed skirt between the box spring and mattress to hide the frame.",
          "description":"Center the bed skirt on the box spring so that the edges of the skirt lay flat. The bed skirt should be long enough to just lightly touch the floor. Bed skirts come in different lengths. Measure from the floor to the top of the box spring to determine what length you need. Choose a bed skirt that matches the color of your sheets or complements the color scheme in your bedroom. For a classic, feminine look, use a ruffled or gathered bed skirt. For a sleek, modern feel, opt for a tailored bed skirt. A bed skirt is also sometimes called a bed ruffle or a valance."
        },
        {
          "headline":"Cover the mattress with a mattress pad if you want to protect it.",
          "description":"Most mattress pads are waterproof, so they keep any spills or stains from seeping through onto the mattress itself. Pull the pad tight across the 4 corners of the bed. Mattress pads are sold according to the size of your bed. If you have a Queen Size bed, you'll need a queen size mattress pad\nSome mattress pads also provide extra cushioning. Look for one that’s labeled as “pillow-top,” “memory foam,” or “extra plush.”\nIf your mattress pad gets stained, simply peel it off the bed and toss it in the laundry."
        },
        {
          "headline":"Stretch the fitted sheet over the 4 corners of the mattress.",
          "description":"Pull the fitted sheet taut, so it lies smooth against the mattress. Make sure the elastic edges are tucked all the way under the mattress so that they don’t ride up or come undone. If you have a tall mattress, like one with a pillow-top, a deep fitted sheet will cover the mattress better. Most sheet sets come with a fitted sheet. However, you can also use a flat sheet. Simply tuck it tightly around the mattress. Linen FAQs\nWhat’s the best thread count?Higher isn’t always better, contrary to popular. Stick to a 300 thread count. A lower count won’t be very soft, and a higher count could rip. Do I need to iron my linens?It’s not necessary, but ironing your sheets gives your bed a super crisp, polished look. The only material that shouldn’t be ironed is flannel. How do I make my sheets last longer?Keep at least 2 sets of linens. That way you don’t wear out 1 set by washing it every single week. Is a fitted sheet necessary?No. In fact, many hotels use a flat sheet to wrap around the mattress."
        },
        {
          "headline":"Center the flat sheet on the bed, lining up the top edge with the mattress.",
          "description":"There should be an equal amount of sheets hanging off each side of the bed. If one side is longer, gently pull the sheet on the shorter side to even them out. Check that the top edge of the sheet is still aligned with the top edge of the mattress after you make any adjustments. If the sheet is crumpled or has creases from being folded, iron the sheet before setting it on the bed. Put sheets that have a pattern on the bed with the pattern facing down. That way, when you fold it back over the blanket, the pattern will be showing. What Kind of Sheets Are the Best? The softest: Go with 100% Egyptian cotton for a super luxurious bed. You can also look for sheets with a sateen weave, which makes them silkier. The warmest: Cozy up to flannel or jersey sheets during the cooler months. The most kid-friendly: Sheets made with a cotton-polyester blend are durable and can handle a lot of washing. The crispest: Sheets with a percale weave will fold more cleanly."
        },
        {
          "headline":"Place the blanket so that the bottom and sides are aligned with the sheet.",
          "description":"Ideally, the blanket will cover the entire sheet. However, the most important sections to line up are the bottom and sides, so it’s okay if there’s a gap at the head of the bed. You need enough overhang to be able to tuck the blanket securely under the mattress."
        },
        {
          "headline":"Make hospital corners with the blanket and the sheet on all 4 corners.",
          "description":"Taut corners are the key to a beautifully-made bed. Pull the sheet on 1 of the corners up, and tuck the hanging triangle-shaped piece under the mattress. Then fold the loose top section that you’re holding at a 45-degree angle and tuck it tightly under, too. Repeat the same folds in all of the corners. If it’s too bulky to try to tuck the sheet and the blanket together, fold each layer separately. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRobert Rybarski\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOrganizational Specialist\t\t\t\t\t\t\t\tRobert Rybarski is an Organizational Specialist and Co-Owner of Conquering Clutter, a business that customizes closets, garages, and plantation shutters to ensure organized homes and lifestyles. Robert has over 23 years of consulting and sales experience in the organization industry. His business is based in Southern California. Robert Rybarski\t\t\tOrganizational Specialist\t\t\t\tMake sure you have access to both sides of your mattress. It's harder to put linens and blankets on a bed if one of the long sides of the mattress is against the wall."
        },
        {
          "headline":"Fold the sheet and blanket down about 18 in (46 cm) at the top of the bed.",
          "description":"This provides space for the pillows to sit. Hold the 2 layers together as you pull them back to lie flat. If you have smaller pillows, you may only need to fold the sheet and blanket down 12 inches (30 cm). Do this before placing the pillows on the bed."
        }
      ]
    },
    {
      "name":"Adding Decorative Accents",
      "steps":[
        {
          "headline":"Place a bedspread on top of the blanket for a luxurious feel.",
          "description":"Adding a downy duvet, plush comforter, or soft quilt makes your bed look more polished. A nice top layer not only brings the whole bed together, but it’s also practical, as it adds warmth. A duvet cover is a cheaper way to upgrade an old comforter instead of buying a new one. Simply stuff the comforter inside the cover. How to Choose a Bedspread\nIf you live somewhere warm or if you like lighter layers, pick a quilt or coverlet. These are both thinner blankets. If you don’t like sleeping with a sheet, go with a duvet. Most duvet covers can be used without a sheet. If you want to be able to snuggle up, a down comforter is a good choice. It’s thick, plush, and super warm. If you can’t decide, choose multiple bedspreads! You can easily layer a thin coverlet over a duvet for a stylish statement."
        },
        {
          "headline":"Opt for all-white bedding and pillows if you like the upscale hotel look.",
          "description":"Most hotels use crisp, whites on the bed for a clean, minimalist effect. Incorporate different textures and embroidery to prevent your bed from looking too boring or sterile. Amidst bright pillows and a thick comforter, you’ll feel like you’re sleeping on a cloud! White is harder to keep clean so it’s not practical if you have pets or young kids. You can also keep the linens and bedspread white, and then add pops of color with the pillows or a throw blanket."
        },
        {
          "headline":"Set multiple pillows on the bed if you want it to look more inviting.",
          "description":"Start with the pillows you sleep on. There should be 2 per side, for a total of 4, if your bed is larger than a twin. Then add pretty throw pillows in front of the sleeping pillows. A twin bed only needs 2 sleeping pillows. Cover your sleeping pillows with a decorative sham that matches the bedspread for an elegant vibe. Choose throw pillows in a variety of shapes, sizes, and textures for a playful, bohemian effect."
        },
        {
          "headline":"Lay a throw blanket across the foot of the bed to add visual interest.",
          "description":"Fold the blanket lengthwise so it’s about 18 to 24 inches (46 to 61 cm) wide and drape it over the bed. Or roll it up into a tidy bundle and set it at the base. For a subtle touch, pick a throw that’s a similar hue to the bedspread. For example, you might lay a pale gray blanket on top of a slightly deeper gray comforter. Look for a blanket in a bold accent color or funky texture if you want it to stand out or create a contemporary feel."
        }
      ]
    }
  ],
  "text":" Putting on the Bed Linens Place a bed skirt between the box spring and mattress to hide the frame. Center the bed skirt on the box spring so that the edges of the skirt lay flat. The bed skirt should be long enough to just lightly touch the floor. Bed skirts come in different lengths. Measure from the floor to the top of the box spring to determine what length you need. Choose a bed skirt that matches the color of your sheets or complements the color scheme in your bedroom. For a classic, feminine look, use a ruffled or gathered bed skirt. For a sleek, modern feel, opt for a tailored bed skirt. A bed skirt is also sometimes called a bed ruffle or a valance. Cover the mattress with a mattress pad if you want to protect it. Most mattress pads are waterproof, so they keep any spills or stains from seeping through onto the mattress itself. Pull the pad tight across the 4 corners of the bed. Mattress pads are sold according to the size of your bed. If you have a Queen Size bed, you'll need a queen size mattress pad\nSome mattress pads also provide extra cushioning. Look for one that’s labeled as “pillow-top,” “memory foam,” or “extra plush.”\nIf your mattress pad gets stained, simply peel it off the bed and toss it in the laundry. Stretch the fitted sheet over the 4 corners of the mattress. Pull the fitted sheet taut, so it lies smooth against the mattress. Make sure the elastic edges are tucked all the way under the mattress so that they don’t ride up or come undone. If you have a tall mattress, like one with a pillow-top, a deep fitted sheet will cover the mattress better. Most sheet sets come with a fitted sheet. However, you can also use a flat sheet. Simply tuck it tightly around the mattress. Linen FAQs\nWhat’s the best thread count?Higher isn’t always better, contrary to popular. Stick to a 300 thread count. A lower count won’t be very soft, and a higher count could rip. Do I need to iron my linens?It’s not necessary, but ironing your sheets gives your bed a super crisp, polished look. The only material that shouldn’t be ironed is flannel. How do I make my sheets last longer?Keep at least 2 sets of linens. That way you don’t wear out 1 set by washing it every single week. Is a fitted sheet necessary?No. In fact, many hotels use a flat sheet to wrap around the mattress. Center the flat sheet on the bed, lining up the top edge with the mattress. There should be an equal amount of sheets hanging off each side of the bed. If one side is longer, gently pull the sheet on the shorter side to even them out. Check that the top edge of the sheet is still aligned with the top edge of the mattress after you make any adjustments. If the sheet is crumpled or has creases from being folded, iron the sheet before setting it on the bed. Put sheets that have a pattern on the bed with the pattern facing down. That way, when you fold it back over the blanket, the pattern will be showing. What Kind of Sheets Are the Best? The softest: Go with 100% Egyptian cotton for a super luxurious bed. You can also look for sheets with a sateen weave, which makes them silkier. The warmest: Cozy up to flannel or jersey sheets during the cooler months. The most kid-friendly: Sheets made with a cotton-polyester blend are durable and can handle a lot of washing. The crispest: Sheets with a percale weave will fold more cleanly. Place the blanket so that the bottom and sides are aligned with the sheet. Ideally, the blanket will cover the entire sheet. However, the most important sections to line up are the bottom and sides, so it’s okay if there’s a gap at the head of the bed. You need enough overhang to be able to tuck the blanket securely under the mattress. Make hospital corners with the blanket and the sheet on all 4 corners. Taut corners are the key to a beautifully-made bed. Pull the sheet on 1 of the corners up, and tuck the hanging triangle-shaped piece under the mattress. Then fold the loose top section that you’re holding at a 45-degree angle and tuck it tightly under, too. Repeat the same folds in all of the corners. If it’s too bulky to try to tuck the sheet and the blanket together, fold each layer separately. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tRobert Rybarski\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOrganizational Specialist\t\t\t\t\t\t\t\tRobert Rybarski is an Organizational Specialist and Co-Owner of Conquering Clutter, a business that customizes closets, garages, and plantation shutters to ensure organized homes and lifestyles. Robert has over 23 years of consulting and sales experience in the organization industry. His business is based in Southern California. Robert Rybarski\t\t\tOrganizational Specialist\t\t\t\tMake sure you have access to both sides of your mattress. It's harder to put linens and blankets on a bed if one of the long sides of the mattress is against the wall. Fold the sheet and blanket down about 18 in (46 cm) at the top of the bed. This provides space for the pillows to sit. Hold the 2 layers together as you pull them back to lie flat. If you have smaller pillows, you may only need to fold the sheet and blanket down 12 inches (30 cm). Do this before placing the pillows on the bed. Adding Decorative Accents Place a bedspread on top of the blanket for a luxurious feel. Adding a downy duvet, plush comforter, or soft quilt makes your bed look more polished. A nice top layer not only brings the whole bed together, but it’s also practical, as it adds warmth. A duvet cover is a cheaper way to upgrade an old comforter instead of buying a new one. Simply stuff the comforter inside the cover. How to Choose a Bedspread\nIf you live somewhere warm or if you like lighter layers, pick a quilt or coverlet. These are both thinner blankets. If you don’t like sleeping with a sheet, go with a duvet. Most duvet covers can be used without a sheet. If you want to be able to snuggle up, a down comforter is a good choice. It’s thick, plush, and super warm. If you can’t decide, choose multiple bedspreads! You can easily layer a thin coverlet over a duvet for a stylish statement. Opt for all-white bedding and pillows if you like the upscale hotel look. Most hotels use crisp, whites on the bed for a clean, minimalist effect. Incorporate different textures and embroidery to prevent your bed from looking too boring or sterile. Amidst bright pillows and a thick comforter, you’ll feel like you’re sleeping on a cloud! White is harder to keep clean so it’s not practical if you have pets or young kids. You can also keep the linens and bedspread white, and then add pops of color with the pillows or a throw blanket. Set multiple pillows on the bed if you want it to look more inviting. Start with the pillows you sleep on. There should be 2 per side, for a total of 4, if your bed is larger than a twin. Then add pretty throw pillows in front of the sleeping pillows. A twin bed only needs 2 sleeping pillows. Cover your sleeping pillows with a decorative sham that matches the bedspread for an elegant vibe. Choose throw pillows in a variety of shapes, sizes, and textures for a playful, bohemian effect. Lay a throw blanket across the foot of the bed to add visual interest. Fold the blanket lengthwise so it’s about 18 to 24 inches (46 to 61 cm) wide and drape it over the bed. Or roll it up into a tidy bundle and set it at the base. For a subtle touch, pick a throw that’s a similar hue to the bedspread. For example, you might lay a pale gray blanket on top of a slightly deeper gray comforter. Look for a blanket in a bold accent color or funky texture if you want it to stand out or create a contemporary feel.",
  "tyn_model":[
    "sheet",
    "blanket",
    "sheets",
    "pillows",
    "bed skirt",
    "fitted sheet",
    "comforter",
    "duvet",
    "mattress pad",
    "mattress pads",
    "linens",
    "blankets",
    "bedspread",
    "quilt",
    "throw blanket",
    "mattress",
    "bed skirts",
    "“pillow",
    "” “",
    "memory foam",
    "” or",
    "“extra",
    "”\n",
    "elastic",
    "sheet sets",
    "linen",
    "flannel",
    "flat sheet",
    "iron",
    "organizational specialist\t\t\t\t\t\t\t\trobert",
    "organizational specialist",
    "conquering clutter",
    "duvet covers",
    "down comforter",
    "throw pillows"
  ],
  "tyn_section":[

  ]
}