{
  "title":"How to Hogtie Someone",
  "url":"https://www.wikihow.com/Hogtie-Someone",
  "category_hierarchy":[
    "Hobbies and Crafts"
  ],
  "methods":[
    {
      "name":"Tying Their Hands Together",
      "steps":[
        {
          "headline":"Ask your partner to lie down on their front.",
          "description":"Choose a comfortable surface, like the bed or a carpeted floor. Then, get them to lie down with their legs straight and their arms at their sides. Let them turn their head to the left or the right, whichever is more comfortable.Variation: If you and your partner are beginners, try reversing the position and having your partner start on their back. Then, tie their hands and feet in front of their body to make it easier on them."
        },
        {
          "headline":"Lift your partner’s arms up behind their back.",
          "description":"Bring your partner’s hands behind their back like they’re being arrested. Place your partner’s hands over their waist or bum so that they can comfortably hold the position. Their elbows should have a slight bend in them to avoid strain."
        },
        {
          "headline":"Fold a rope in half and thread the ends through the loop to make a cuff.",
          "description":"Create a loop by folding your rope in half, then hold the rope behind your partner’s hands. Wrap the ends of the rope around your partner’s wrist and insert them into the loop. Pull the ends to tighten the rope around your partner’s hands. This helps you tie your partner’s hands together safely. Once the cuff is secure, it shouldn’t tighten up on them."
        },
        {
          "headline":"Wrap the ends of the rope around their hands in the opposite direction.",
          "description":"After you cinch the rope around their wrists, reverse the direction of the ends of the rope. Then, wrap the rope around the outside of their right wrist. Bring the rope around and wrap it along the outside of the left wrist to complete a second loop. Be careful that you aren’t pulling the rope too tightly."
        },
        {
          "headline":"Loop the ends around the center of the rope and knot it.",
          "description":"Bring the end of the rope up and over the center of the loop you made around your partner’s wrists. Then, wrap the ends of the rope several times to create a binding cuff. Finally, knot the ends of your rope to secure the binding. You can use any knot that you prefer. If you don't have a preferred knot, try a square knot or an overhand knot. To tie an overhand knot, hold the 2 rope ends together to make 1 strand. Then, make a loop at the base of the rope near the cuffs and thread the ends through the loop. Tighten until you have a knot."
        }
      ]
    },
    {
      "name":"Binding Their Feet",
      "steps":[
        {
          "headline":"Ask your partner to bend at their knees to lift their feet in the air.",
          "description":"Get them to bend their knees into a 90-degree angle with the bottom of their feet facing the floor. Bring their legs close together so that the insides of their ankles easily touch. Depending on what kind of access you want after you finish tying them up, you may want to spread their knees a little bit if they’re comfortable. This can make it easier to have sexual contact while they’re tied up."
        },
        {
          "headline":"Bend the rope in half and loop it around their ankles.",
          "description":"Fold the rope to create a loop, then hold it behind your partner’s ankles. Insert the ends of the rope into the loop and pull it to secure the rope around their ankles. This is the same thing you did when you wrapped their wrists."
        },
        {
          "headline":"Wrap the ankles a second time, then reverse directions.",
          "description":"Loop the rope around their ankles a second time going in the direction the rope is already facing. Then, tuck the end of the rope between the loops on their left ankle. Reverse the direction of the rope and wrap it around their ankles again a 3rd time. Once you're finished with this, you'll have 3 loops around their ankles, which will secure them together. Check in with your partner to make sure you're not tying their feet together too tightly."
        },
        {
          "headline":"Wrap the rope around the loop and knot it.",
          "description":"Bring the ends of the rope to the center of the cuff around your partner's ankles. Then, wrap the ends of the rope around the center of the cuff 1 or 2 times. Finally, knot the ends of the rope to secure the cuff. Use the knot that’s easiest for you. The most common type of knot is a square knot, which is when you put the right strand over the left, then put the left strand over the right and tighten it. As another option, make an overhand knot by holding the 2 rope ends together, making a loop at the base of the rope, and threading the ends through the loop. Tighten until you have a knot."
        }
      ]
    },
    {
      "name":"Connecting Their Hands and Feet",
      "steps":[
        {
          "headline":"Fold the binding rope in half and position the loop under the wrist cuff.",
          "description":"Bend the rope in half to create a loop, then place the rope under the wrist cuff with the loop pointing toward their head. Bring the ends of the rope up and thread them through the loop. Then, pull the ends of the rope down to tighten the loop around the wrist cuff. This will help you safely bind your partner because the loop won’t tighten their wrist cuff if they move around or while you tie the rest of the bindings."
        },
        {
          "headline":"Loop the ends of the binding rope around the foot cuff.",
          "description":"Bring the ends of the rope down toward your partner’s feet. Then, loop the binding rope around the center of the foot cuff. Adjust the length of the binding rope to fit your partner’s flexibility and comfort levels. Tightening the binding rope will bring their hands and feet closer together. A loose binding rope will allow them to keep their hands and feet further apart."
        },
        {
          "headline":"Bring the ends of the rope back up to the wrist cuff.",
          "description":"Pull the ends of the binding rope up to the wrist cuff, then loop them around the center of the cuff. Finish the loop with the ends of the rope down below their hands. Ask your partner if they feel like they can stay in this position for some time. Once you finish off the binding, it will take a while to unwrap them."
        },
        {
          "headline":"Wrap the ends of the rope around the length of the binding.",
          "description":"Bring the ends of the binding rope together. Starting just below their hands, wrap the ends of the binding rope around the taut length of rope going from their wrists to their ankles. If you have enough rope, go all the way down to their feet. If you run out of rope, knot the ends of the rope in place over the length of the binding rope."
        },
        {
          "headline":"Knot the ends of the binding rope together at the center of the foot cuff.",
          "description":"Once you reach their feet, separate the ends of the rope. Bring 1 end over the top of the foot cuff and 1 end under the bottom of the foot cuff. Then, tie the ends of the rope into a knot around the foot cuff. Use the same type of knot that you used to tie their hands and feet."
        }
      ]
    }
  ],
  "text":" Tying Their Hands Together Ask your partner to lie down on their front. Choose a comfortable surface, like the bed or a carpeted floor. Then, get them to lie down with their legs straight and their arms at their sides. Let them turn their head to the left or the right, whichever is more comfortable.Variation: If you and your partner are beginners, try reversing the position and having your partner start on their back. Then, tie their hands and feet in front of their body to make it easier on them. Lift your partner’s arms up behind their back. Bring your partner’s hands behind their back like they’re being arrested. Place your partner’s hands over their waist or bum so that they can comfortably hold the position. Their elbows should have a slight bend in them to avoid strain. Fold a rope in half and thread the ends through the loop to make a cuff. Create a loop by folding your rope in half, then hold the rope behind your partner’s hands. Wrap the ends of the rope around your partner’s wrist and insert them into the loop. Pull the ends to tighten the rope around your partner’s hands. This helps you tie your partner’s hands together safely. Once the cuff is secure, it shouldn’t tighten up on them. Wrap the ends of the rope around their hands in the opposite direction. After you cinch the rope around their wrists, reverse the direction of the ends of the rope. Then, wrap the rope around the outside of their right wrist. Bring the rope around and wrap it along the outside of the left wrist to complete a second loop. Be careful that you aren’t pulling the rope too tightly. Loop the ends around the center of the rope and knot it. Bring the end of the rope up and over the center of the loop you made around your partner’s wrists. Then, wrap the ends of the rope several times to create a binding cuff. Finally, knot the ends of your rope to secure the binding. You can use any knot that you prefer. If you don't have a preferred knot, try a square knot or an overhand knot. To tie an overhand knot, hold the 2 rope ends together to make 1 strand. Then, make a loop at the base of the rope near the cuffs and thread the ends through the loop. Tighten until you have a knot. Binding Their Feet Ask your partner to bend at their knees to lift their feet in the air. Get them to bend their knees into a 90-degree angle with the bottom of their feet facing the floor. Bring their legs close together so that the insides of their ankles easily touch. Depending on what kind of access you want after you finish tying them up, you may want to spread their knees a little bit if they’re comfortable. This can make it easier to have sexual contact while they’re tied up. Bend the rope in half and loop it around their ankles. Fold the rope to create a loop, then hold it behind your partner’s ankles. Insert the ends of the rope into the loop and pull it to secure the rope around their ankles. This is the same thing you did when you wrapped their wrists. Wrap the ankles a second time, then reverse directions. Loop the rope around their ankles a second time going in the direction the rope is already facing. Then, tuck the end of the rope between the loops on their left ankle. Reverse the direction of the rope and wrap it around their ankles again a 3rd time. Once you're finished with this, you'll have 3 loops around their ankles, which will secure them together. Check in with your partner to make sure you're not tying their feet together too tightly. Wrap the rope around the loop and knot it. Bring the ends of the rope to the center of the cuff around your partner's ankles. Then, wrap the ends of the rope around the center of the cuff 1 or 2 times. Finally, knot the ends of the rope to secure the cuff. Use the knot that’s easiest for you. The most common type of knot is a square knot, which is when you put the right strand over the left, then put the left strand over the right and tighten it. As another option, make an overhand knot by holding the 2 rope ends together, making a loop at the base of the rope, and threading the ends through the loop. Tighten until you have a knot. Connecting Their Hands and Feet Fold the binding rope in half and position the loop under the wrist cuff. Bend the rope in half to create a loop, then place the rope under the wrist cuff with the loop pointing toward their head. Bring the ends of the rope up and thread them through the loop. Then, pull the ends of the rope down to tighten the loop around the wrist cuff. This will help you safely bind your partner because the loop won’t tighten their wrist cuff if they move around or while you tie the rest of the bindings. Loop the ends of the binding rope around the foot cuff. Bring the ends of the rope down toward your partner’s feet. Then, loop the binding rope around the center of the foot cuff. Adjust the length of the binding rope to fit your partner’s flexibility and comfort levels. Tightening the binding rope will bring their hands and feet closer together. A loose binding rope will allow them to keep their hands and feet further apart. Bring the ends of the rope back up to the wrist cuff. Pull the ends of the binding rope up to the wrist cuff, then loop them around the center of the cuff. Finish the loop with the ends of the rope down below their hands. Ask your partner if they feel like they can stay in this position for some time. Once you finish off the binding, it will take a while to unwrap them. Wrap the ends of the rope around the length of the binding. Bring the ends of the binding rope together. Starting just below their hands, wrap the ends of the binding rope around the taut length of rope going from their wrists to their ankles. If you have enough rope, go all the way down to their feet. If you run out of rope, knot the ends of the rope in place over the length of the binding rope. Knot the ends of the binding rope together at the center of the foot cuff. Once you reach their feet, separate the ends of the rope. Bring 1 end over the top of the foot cuff and 1 end under the bottom of the foot cuff. Then, tie the ends of the rope into a knot around the foot cuff. Use the same type of knot that you used to tie their hands and feet.",
  "tyn_model":[
    "rope",
    "binding rope",
    "thread",
    "binding"
  ],
  "tyn_section":[

  ]
}