{
  "title":"How to Make Barm Brack",
  "url":"https://www.wikihow.com/Make-Barm-Brack",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Fruit Breads"
  ],
  "steps":[
    {
      "headline":"Put the yeast, sugar and milk together in a bowl; beat until the milk becomes frothy.",
      "description":""
    },
    {
      "headline":"Put the flour, sugar and spice in a separate bowl, and then incorporate the butter with your fingers.",
      "description":""
    },
    {
      "headline":"Pour the milk mixture into the bowl with the flour, and beat the ingredients together for 5 minutes, or until dough forms.",
      "description":""
    },
    {
      "headline":"Knead the dough for two minutes, then work in the fruit and salt.",
      "description":""
    },
    {
      "headline":"Place the dough in a warm bowl, cover with a towel, and allow it to rise for an hour or until it has doubled in size.",
      "description":""
    },
    {
      "headline":"Knead the dough again and place in a floured/greased 8 inch (20.3 cm) diameter cake pan; allow an extra 25 minutes of rising time.",
      "description":""
    },
    {
      "headline":"Bake at 400 °F (204 °C) on the top rack of the oven, for 30-45 minutes or until toothpick inserted into the cake's center comes out clean.",
      "description":""
    },
    {
      "headline":"Glaze the finished cake with a simple sugar syrup made from 2 teaspoons of sugar dissolved in 3 teaspoons of boiling water, if you like.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Put the yeast, sugar and milk together in a bowl; beat until the milk becomes frothy.  Put the flour, sugar and spice in a separate bowl, and then incorporate the butter with your fingers.  Pour the milk mixture into the bowl with the flour, and beat the ingredients together for 5 minutes, or until dough forms.  Knead the dough for two minutes, then work in the fruit and salt.  Place the dough in a warm bowl, cover with a towel, and allow it to rise for an hour or until it has doubled in size.  Knead the dough again and place in a floured/greased 8 inch (20.3 cm) diameter cake pan; allow an extra 25 minutes of rising time.  Bake at 400 °F (204 °C) on the top rack of the oven, for 30-45 minutes or until toothpick inserted into the cake's center comes out clean.  Glaze the finished cake with a simple sugar syrup made from 2 teaspoons of sugar dissolved in 3 teaspoons of boiling water, if you like.  Finished. ",
  "tyn_model":[
    "bowl",
    "sugar",
    "milk",
    "flour",
    "yeast",
    "spice",
    "butter",
    "fruit",
    "salt",
    "towel",
    "cake pan",
    "oven",
    "simple sugar syrup",
    "water"
  ],
  "tyn_section":[

  ]
}