{
  "title":"How to Go on a Rampage in Grand Theft Auto",
  "url":"https://www.wikihow.com/Go-on-a-Rampage-in-Grand-Theft-Auto",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Grand Theft Auto"
  ],
  "steps":[
    {
      "headline":"Make sure you have full health and full body armor before you start!",
      "description":"There are lots of places which spawn body armor, but you can also buy it in AmmuNation. Visit a fast food outlet for health or try a street vendor/drinks machine."
    },
    {
      "headline":"Find the weapons you need, any way you want.",
      "description":"Buy them, use a cheat, or cruise around finding weapon spawns. Make sure you have one of all the weapons types such as a hand weapon, sniper, thrown weapons etc. This way you have many ways of attacking and killing the cops!"
    },
    {
      "headline":"Choose the spot you will start your rampage!",
      "description":"An easy way to start is grab a car you like the look of and drive around for a bit running people over, this will get you one or two stars and cause the cops to chase you. Then knock over cops on bikes for another star after a while. Now you should get out of your car at a good place and get ready to start the real fun!"
    },
    {
      "headline":"A good place to set up is somewhere undercover!",
      "description":"This way you will not be shot by the police helicopter. Try in a tunnel or under a bridge. It's also good to get up off the ground so the cops find it harder to hit you. To get on a high building, find a helicopter or plane and drop onto a roof."
    },
    {
      "headline":"Start shooting the cops that arrive!",
      "description":"Don't concentrate on one area unless all the police come from that place. Look all around you, especially behind you, and don't forget to listen to where the sirens and shot sounds are coming from if you can't find who's shooting at you!"
    },
    {
      "headline":"Smash up a car until it's smoking and block up a tunnel.",
      "description":"Do this with a few cars, and just wait for the other speeding cars to smash straight into the block, causing mass fire! Make sure you are far away though, or you will be blown up. This also kills the cops that come along because their cars just blow up. Hours of fun!"
    },
    {
      "headline":"If you die or get arrested just don't save!",
      "description":"Otherwise you'll lose all your weapons."
    }
  ],
  "text":" Make sure you have full health and full body armor before you start! There are lots of places which spawn body armor, but you can also buy it in AmmuNation. Visit a fast food outlet for health or try a street vendor/drinks machine. Find the weapons you need, any way you want. Buy them, use a cheat, or cruise around finding weapon spawns. Make sure you have one of all the weapons types such as a hand weapon, sniper, thrown weapons etc. This way you have many ways of attacking and killing the cops! Choose the spot you will start your rampage! An easy way to start is grab a car you like the look of and drive around for a bit running people over, this will get you one or two stars and cause the cops to chase you. Then knock over cops on bikes for another star after a while. Now you should get out of your car at a good place and get ready to start the real fun! A good place to set up is somewhere undercover! This way you will not be shot by the police helicopter. Try in a tunnel or under a bridge. It's also good to get up off the ground so the cops find it harder to hit you. To get on a high building, find a helicopter or plane and drop onto a roof. Start shooting the cops that arrive! Don't concentrate on one area unless all the police come from that place. Look all around you, especially behind you, and don't forget to listen to where the sirens and shot sounds are coming from if you can't find who's shooting at you! Smash up a car until it's smoking and block up a tunnel. Do this with a few cars, and just wait for the other speeding cars to smash straight into the block, causing mass fire! Make sure you are far away though, or you will be blown up. This also kills the cops that come along because their cars just blow up. Hours of fun! If you die or get arrested just don't save! Otherwise you'll lose all your weapons.",
  "tyn_model":[
    "weapons",
    "sniper",
    "helicopter",
    "plane"
  ],
  "tyn_section":[

  ]
}