{
  "title":"How to Make Oven Roasted Potatoes",
  "url":"https://www.wikihow.com/Make-Oven-Roasted-Potatoes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Potato Dishes"
  ],
  "methods":[
    {
      "name":"Oven-Roasting Potatoes",
      "steps":[
        {
          "headline":"Pre-heat your oven to 400℉.",
          "description":"Depending on your taste, you can adjust this up or down 25 degrees. Cook softer potatoes at 375℉, or go for crispy potatoes at 425℉."
        },
        {
          "headline":"Halve or quarter the potatoes and put them in a large mixing bowl.",
          "description":"The smaller you chop up the potatoes the faster they will cook. However, larger chunks retain more moisture and have a texture similar to the inside of a baked potato with a crispy outside."
        },
        {
          "headline":"Chop the garlic into small pieces and add to the potatoes.",
          "description":"You want finely minced garlic that is only a few millimeters thick. You may substitute 1/2 tablespoon garlic powder if you don't have fresh garlic"
        },
        {
          "headline":"Add oil, salt, pepper, to the bowl and mix well.",
          "description":"You want all of the potatoes to be well coated in the oil. As the oil heats up in the over it will fry the outside of the potato, getting it perfectly crispy."
        },
        {
          "headline":"Evenly distribute the potatoes on a baking sheet.",
          "description":"You don't want the potatoes to be stacked on one another or clumped together. Some overlap is fine, but use two sheets if you end up with 2-3 layers of potatoes overlapping."
        },
        {
          "headline":"Cook the potatoes for 10 minutes before turning them.",
          "description":"After 10-15 minutes, use a spatula to flip the potatoes, turning as many as you can onto a different side so that they cook evenly."
        },
        {
          "headline":"Flip the potatoes after another 10 minutes.",
          "description":"The timing doesn't have to be exact, but you should try to flip the potatoes at least twice as they cook."
        },
        {
          "headline":"Remove the potatoes when you can cleanly stick a fork through them.",
          "description":"The outside will be an inviting shade of golden brown. Using a fork, knife, or skewer, gently poke the side of a large potato. The fork should pass through the potato without much effort like it was a firm piece of butter. This is usually after 25-30 minutes."
        },
        {
          "headline":"Garnish with parmesan cheese, chopped parsley, or salt and pepper and serve.",
          "description":"Because they are so dense the potatoes will hold heat for a 5-10 minutes after coming out of the oven, so be sure to let them cool."
        }
      ]
    },
    {
      "name":"Variations",
      "steps":[
        {
          "headline":"Change the temperature of your oven for different textures.",
          "description":"The hotter your oven (450℉), the faster the outsides of the potatoes will cook. Similarly, lower temperature ovens (375℉) will cook the outside slowly, allowing the inside of the potato to soften over a longer period of time without burning the edges. If you cut your potatoes very small you may have to take them out of the oven 5-10 minutes earlier. If you want large chunks of potato, turn down the temperature and cook them for an extra 10 minutes."
        },
        {
          "headline":"Mix in rosemary, thyme, basil, and herbs for an Italian potato dish.",
          "description":"When you add the salt and oil, throw in 1-2 teaspoons of fresh or dried herbs for potatoes that go fantastically with chicken or pork,"
        },
        {
          "headline":"Use paprika and cracked red pepper for spicy potatoes.",
          "description":"Paprika will give your roasted potatoes a delicious smoky flavor with a little bit of spice, and crushed red pepper and cayenne will give them a kick."
        },
        {
          "headline":"Roast potatoes directly with turkey or chicken.",
          "description":"You can the pan of a roast chicken with small, whole potatoes to cook them together. Simply coat the potatoes in oil like normal and line the pan with potatoes after preparing your bird."
        },
        {
          "headline":"Roast other root vegetables along with your potatoes.",
          "description":"Using the same method, you can roast a variety of vegetables for a colorful, flavorful vegetable medley. Simply add an extra tablespoon or so of oil to coat the additional veggies and season to taste -- they can all cook on the same pan! Try oven-roasting:\nCarrots\nTurnips\nParsnips\nRed or Yellow Onions\nBeets\nBrussel Sprouts"
        }
      ]
    }
  ],
  "text":" Oven-Roasting Potatoes Pre-heat your oven to 400℉. Depending on your taste, you can adjust this up or down 25 degrees. Cook softer potatoes at 375℉, or go for crispy potatoes at 425℉. Halve or quarter the potatoes and put them in a large mixing bowl. The smaller you chop up the potatoes the faster they will cook. However, larger chunks retain more moisture and have a texture similar to the inside of a baked potato with a crispy outside. Chop the garlic into small pieces and add to the potatoes. You want finely minced garlic that is only a few millimeters thick. You may substitute 1/2 tablespoon garlic powder if you don't have fresh garlic Add oil, salt, pepper, to the bowl and mix well. You want all of the potatoes to be well coated in the oil. As the oil heats up in the over it will fry the outside of the potato, getting it perfectly crispy. Evenly distribute the potatoes on a baking sheet. You don't want the potatoes to be stacked on one another or clumped together. Some overlap is fine, but use two sheets if you end up with 2-3 layers of potatoes overlapping. Cook the potatoes for 10 minutes before turning them. After 10-15 minutes, use a spatula to flip the potatoes, turning as many as you can onto a different side so that they cook evenly. Flip the potatoes after another 10 minutes. The timing doesn't have to be exact, but you should try to flip the potatoes at least twice as they cook. Remove the potatoes when you can cleanly stick a fork through them. The outside will be an inviting shade of golden brown. Using a fork, knife, or skewer, gently poke the side of a large potato. The fork should pass through the potato without much effort like it was a firm piece of butter. This is usually after 25-30 minutes. Garnish with parmesan cheese, chopped parsley, or salt and pepper and serve. Because they are so dense the potatoes will hold heat for a 5-10 minutes after coming out of the oven, so be sure to let them cool. Variations Change the temperature of your oven for different textures. The hotter your oven (450℉), the faster the outsides of the potatoes will cook. Similarly, lower temperature ovens (375℉) will cook the outside slowly, allowing the inside of the potato to soften over a longer period of time without burning the edges. If you cut your potatoes very small you may have to take them out of the oven 5-10 minutes earlier. If you want large chunks of potato, turn down the temperature and cook them for an extra 10 minutes. Mix in rosemary, thyme, basil, and herbs for an Italian potato dish. When you add the salt and oil, throw in 1-2 teaspoons of fresh or dried herbs for potatoes that go fantastically with chicken or pork, Use paprika and cracked red pepper for spicy potatoes. Paprika will give your roasted potatoes a delicious smoky flavor with a little bit of spice, and crushed red pepper and cayenne will give them a kick. Roast potatoes directly with turkey or chicken. You can the pan of a roast chicken with small, whole potatoes to cook them together. Simply coat the potatoes in oil like normal and line the pan with potatoes after preparing your bird. Roast other root vegetables along with your potatoes. Using the same method, you can roast a variety of vegetables for a colorful, flavorful vegetable medley. Simply add an extra tablespoon or so of oil to coat the additional veggies and season to taste -- they can all cook on the same pan! Try oven-roasting:\nCarrots\nTurnips\nParsnips\nRed or Yellow Onions\nBeets\nBrussel Sprouts",
  "tyn_model":[
    "potatoes",
    "oil",
    "oven",
    "potato",
    "garlic",
    "fork",
    "℉.",
    "salt",
    "℉)",
    "herbs",
    "paprika",
    "red pepper",
    "oven-roasting potatoes",
    "℉,",
    "large mixing bowl",
    "baked potato",
    "garlic powder",
    "pepper",
    "bowl",
    "baking sheet",
    "spatula",
    "knife",
    "butter",
    "parmesan cheese",
    "parsley",
    "salt and pepper",
    "rosemary",
    "thyme",
    "basil",
    "cayenne",
    "vegetables",
    "oven-",
    "carrots",
    "turnips",
    "parsnips",
    "beets"
  ],
  "tyn_section":[

  ]
}