{
  "title":"How to Make a Mad Eye Martini",
  "url":"https://www.wikihow.com/Make-a-Mad-Eye-Martini",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Cocktails",
    "Martinis"
  ],
  "methods":[
    {
      "name":"Making the Eyeball",
      "steps":[
        {
          "headline":"Pat dry the lychee with paper towels.",
          "description":""
        },
        {
          "headline":"Use a small teaspoon to fill each lychee with preserves.",
          "description":""
        },
        {
          "headline":"Insert the blueberry inside the lychee.",
          "description":"You'll want the blossom facing out so it resembles the pupil of an eye."
        },
        {
          "headline":"Pierce the lychee with a cocktail pick.",
          "description":""
        }
      ]
    },
    {
      "name":"Making the Drink",
      "steps":[
        {
          "headline":"Fill a cocktail shaker halfway with ice cubes.",
          "description":""
        },
        {
          "headline":"Measure and add the vodka, lychee juice, and Hpnotiq liqueur into the cocktail shaker.",
          "description":""
        },
        {
          "headline":"Shake the contents until well mixed.",
          "description":"You'll know when it's thoroughly combined when condensation forms on the outside of the shaker."
        },
        {
          "headline":"Strain the drink into a chilled cocktail glass.",
          "description":""
        },
        {
          "headline":"Garnish the drink with an eyeball by balancing the cocktail pick on the rim.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Eyeball Pat dry the lychee with paper towels.  Use a small teaspoon to fill each lychee with preserves.  Insert the blueberry inside the lychee. You'll want the blossom facing out so it resembles the pupil of an eye. Pierce the lychee with a cocktail pick.  Making the Drink Fill a cocktail shaker halfway with ice cubes.  Measure and add the vodka, lychee juice, and Hpnotiq liqueur into the cocktail shaker.  Shake the contents until well mixed. You'll know when it's thoroughly combined when condensation forms on the outside of the shaker. Strain the drink into a chilled cocktail glass.  Garnish the drink with an eyeball by balancing the cocktail pick on the rim. ",
  "tyn_model":[
    "cocktail pick",
    "cocktail shaker",
    "paper towels",
    "blueberry",
    "ice cubes",
    "vodka",
    "lychee juice",
    "hpnotiq liqueur",
    "shaker",
    "chilled cocktail glass"
  ],
  "tyn_section":[

  ]
}