{
  "title":"How to Finance Home Repairs",
  "url":"https://www.wikihow.com/Finance-Home-Repairs",
  "category_hierarchy":[
    "Home and Garden",
    "Home Improvements",
    "Renovation Advice and Tips"
  ],
  "steps":[
    {
      "headline":"Refinance your mortgage to obtain cash for home repairs.",
      "description":"A popular way to pay for home repairs and renovations is through a \"cash-out refi,\" which is simply a way of swapping your existing mortgage for a new one and converting some of your home equity to cash in the process. Your current mortgage lender can help you understand your options for refinancing. Note that liquidating your equity in this way will generally cause your monthly payments or mortgage term to increase."
    },
    {
      "headline":"Obtain a home equity line of credit.",
      "description":"A home equity line of credit functions like a credit card, with an open-ended term, a credit limit, and a minimum monthly payment based on your outstanding balance. This type credit makes sense for financing home repairs or remodeling projects because these projects tend to increase your home equity anyway."
    },
    {
      "headline":"Seek out a second mortgage.",
      "description":"A second mortgage can be an unattractive option as it can tend to overburden you with debt, but for home repairs with an end in sight they are helpful. A second mortgage is a loan secured on your accumulated equity. The interest rate will be higher because your primary mortgage lender is given preference over your new lender in case of insolvency; for this reason, try to keep the size of your second mortgage as small as possible."
    },
    {
      "headline":"Determine if you qualify for a government loan.",
      "description":"In the United States, the Federal Housing Administration runs a loan program called Title 1 for homeowners with very little equity. These loans are made by banks and backed by the federal government, and can be used to finance essential repairs such as structural and electrical problems."
    },
    {
      "headline":"Use a credit card for small, emergency repairs.",
      "description":"While credit cards typically carry higher interest rates than loans secured on your home equity, they make sense for funding small home repairs. A credit card is available for use immediately and requires no paperwork, unlike other financing options."
    },
    {
      "headline":"Borrow from your 401(k).",
      "description":"Many employers allow borrowing from your 401(k) to fund home repairs and renovations. This option is low-hassle because the money is already yours, so there is no paperwork or credit check. However, you are required to pay the borrowed money back into your 401(k) before leaving the company."
    }
  ],
  "text":" Refinance your mortgage to obtain cash for home repairs. A popular way to pay for home repairs and renovations is through a \"cash-out refi,\" which is simply a way of swapping your existing mortgage for a new one and converting some of your home equity to cash in the process. Your current mortgage lender can help you understand your options for refinancing. Note that liquidating your equity in this way will generally cause your monthly payments or mortgage term to increase. Obtain a home equity line of credit. A home equity line of credit functions like a credit card, with an open-ended term, a credit limit, and a minimum monthly payment based on your outstanding balance. This type credit makes sense for financing home repairs or remodeling projects because these projects tend to increase your home equity anyway. Seek out a second mortgage. A second mortgage can be an unattractive option as it can tend to overburden you with debt, but for home repairs with an end in sight they are helpful. A second mortgage is a loan secured on your accumulated equity. The interest rate will be higher because your primary mortgage lender is given preference over your new lender in case of insolvency; for this reason, try to keep the size of your second mortgage as small as possible. Determine if you qualify for a government loan. In the United States, the Federal Housing Administration runs a loan program called Title 1 for homeowners with very little equity. These loans are made by banks and backed by the federal government, and can be used to finance essential repairs such as structural and electrical problems. Use a credit card for small, emergency repairs. While credit cards typically carry higher interest rates than loans secured on your home equity, they make sense for funding small home repairs. A credit card is available for use immediately and requires no paperwork, unlike other financing options. Borrow from your 401(k). Many employers allow borrowing from your 401(k) to fund home repairs and renovations. This option is low-hassle because the money is already yours, so there is no paperwork or credit check. However, you are required to pay the borrowed money back into your 401(k) before leaving the company.",
  "tyn_model":[
    "credit card",
    "home equity line of credit",
    "mortgage",
    "credit cards"
  ],
  "tyn_section":[

  ]
}