{
  "title":"How to Book Restaurant Reservations",
  "url":"https://www.wikihow.com/Book-Restaurant-Reservations",
  "category_hierarchy":[
    "Food and Entertaining",
    "Dining Out"
  ],
  "methods":[
    {
      "name":"Planning Ahead",
      "steps":[
        {
          "headline":"Pick the restaurant.",
          "description":"Before you make reservations it's best to decide on what restaurant you'd like to go to. Not every restaurant is willing to take reservations, even if they are consistently busy. For example, some smaller or newer restaurants may not have enough clientele yet to set up a system for reservations. So it's important to know a restaurant's policy before you try to book a table."
        },
        {
          "headline":"Decide how many people are in your party.",
          "description":"Once you've chosen a restaurant, figure out how many people are going to go to dinner with you. Depending on the size of your party, your wait time may vary. For example, if there are only two of you, you are more likely to have an easier time getting a table. On the other hand, if you are trying to book a table for a party of 10, it's going to be much more difficult. The number of people in your party may also affect how far ahead you need to book your reservation. If you are unsure whether or not a person will be able to make it, book a table including them anyways. It's easier to have an empty seat rather than trying to add a chair to a table in a crowded restaurant."
        },
        {
          "headline":"Set a date and time.",
          "description":"Depending on the day of the week, there may be more openings than others. For example, reserving a table on a weekday is easier than trying to book a table over the weekend. Similarly, setting a reservation for “off-hours” rather than the regular “prime time” hours for breakfast, lunch, or dinner will make getting a reservation easier. You should always have a backup date and time in case there is no availability at the original time you chose."
        }
      ]
    },
    {
      "name":"Calling For Reservations",
      "steps":[
        {
          "headline":"Call as far ahead of time as possible.",
          "description":"In many cases, you will be able to make a dinner reservation early in the same day. However, if you are planning the dinner ahead of time, call earlier. Most restaurants will accept reservations a few days in advance, and exclusive fine dining venues will often accept (or even require) reservations weeks or months in advance."
        },
        {
          "headline":"Be as courteous as possible when booking a reservation.",
          "description":"If you are attempting to book a tough reservation, remember that your attitude on the phone will go a long way. Be confident but polite; avoid giving the impression that you feel entitled to a reservation. However, remember that even Michelin-starred restaurants are not in the business of turning away customers. If the host replies that the restaurant has no availability, explain your situation and ask politely if there is any way you can be accommodated in the future. When calling say, \"Hi, I'd like to place a reservation for this coming Saturday at 5.\" The host will then likely ask how many people are in your party and tell you if that time and date is available. If it's not available, try asking \"Is there a table available for an earlier/later time?\" If the answer is still no, ask if they can give you their earliest availability and go from there."
        },
        {
          "headline":"Call to confirm your reservation.",
          "description":"If you book your table a week or more in advance, it's sometimes good to call the day of your reservation just to double-check that you still have it. You should do this as early in the day as you can in case there is a problem. This will allow you to make other plans if you need to, or give you time to work out the problem with the restaurant."
        },
        {
          "headline":"Call ahead or cancel if you are running late.",
          "description":"Once you've secured your reservation, call ahead and apologize if it looks like you'll be up to 20 minutes late. If you are running much later than that, consider canceling and rescheduling your dinner. Remember that reservations are made for a reason - to make sure as many guests as possible are served on each night. If you are late it affects other guests' reservations."
        },
        {
          "headline":"Try to arrive 10-15 minutes before your reservation time.",
          "description":"This way you can let the hostess know you've arrived and ensure that your table won't be given to someone else. Many restaurants will have a bar or waiting area that you can sit in and get drinks. However, remember to re-approach the hostess when the time for your reservation comes up so you aren't passed over."
        }
      ]
    },
    {
      "name":"Booking Reservations Online",
      "steps":[
        {
          "headline":"Try the restaurant's website.",
          "description":"Many restaurants allow you to book a reservation directly on their website. When doing this, you may also be able to see a list of all available dates and times for either the upcoming week or month. The restaurant is likely to require you to create a login or provide an email address or phone number so they can confirm your reservations. However, they should not text or email you anything else outside of updates on your reservation."
        },
        {
          "headline":"Use an online booking site or mobile application.",
          "description":"If you are unable to book a reservation directly on the restaurant's website, you can try an online booking site like OpenTable or Reservation Genie. These sites will allow you to search restaurants based on your preference of time, date, cuisine, and price range. There are also applications you can put on your phone like NoWait, which allows you to put your name in before heading to the restaurant. An app like this is great for last minute reservations."
        },
        {
          "headline":"Check your email and phone regularly.",
          "description":"Once you've made your reservations online, you should receive a confirmation either by email or via text. Some of these sites or restaurants may require you to click a link or a button to confirm your reservation. You may also be sent a link to cancel or change your reservation if you need to. Many of these online booking sites also offer coupons or have membership rewards programs through which you can accumulate perks. If you can't cancel online, you may have to call the restaurant directly."
        }
      ]
    }
  ],
  "text":" Planning Ahead Pick the restaurant. Before you make reservations it's best to decide on what restaurant you'd like to go to. Not every restaurant is willing to take reservations, even if they are consistently busy. For example, some smaller or newer restaurants may not have enough clientele yet to set up a system for reservations. So it's important to know a restaurant's policy before you try to book a table. Decide how many people are in your party. Once you've chosen a restaurant, figure out how many people are going to go to dinner with you. Depending on the size of your party, your wait time may vary. For example, if there are only two of you, you are more likely to have an easier time getting a table. On the other hand, if you are trying to book a table for a party of 10, it's going to be much more difficult. The number of people in your party may also affect how far ahead you need to book your reservation. If you are unsure whether or not a person will be able to make it, book a table including them anyways. It's easier to have an empty seat rather than trying to add a chair to a table in a crowded restaurant. Set a date and time. Depending on the day of the week, there may be more openings than others. For example, reserving a table on a weekday is easier than trying to book a table over the weekend. Similarly, setting a reservation for “off-hours” rather than the regular “prime time” hours for breakfast, lunch, or dinner will make getting a reservation easier. You should always have a backup date and time in case there is no availability at the original time you chose. Calling For Reservations Call as far ahead of time as possible. In many cases, you will be able to make a dinner reservation early in the same day. However, if you are planning the dinner ahead of time, call earlier. Most restaurants will accept reservations a few days in advance, and exclusive fine dining venues will often accept (or even require) reservations weeks or months in advance. Be as courteous as possible when booking a reservation. If you are attempting to book a tough reservation, remember that your attitude on the phone will go a long way. Be confident but polite; avoid giving the impression that you feel entitled to a reservation. However, remember that even Michelin-starred restaurants are not in the business of turning away customers. If the host replies that the restaurant has no availability, explain your situation and ask politely if there is any way you can be accommodated in the future. When calling say, \"Hi, I'd like to place a reservation for this coming Saturday at 5.\" The host will then likely ask how many people are in your party and tell you if that time and date is available. If it's not available, try asking \"Is there a table available for an earlier/later time?\" If the answer is still no, ask if they can give you their earliest availability and go from there. Call to confirm your reservation. If you book your table a week or more in advance, it's sometimes good to call the day of your reservation just to double-check that you still have it. You should do this as early in the day as you can in case there is a problem. This will allow you to make other plans if you need to, or give you time to work out the problem with the restaurant. Call ahead or cancel if you are running late. Once you've secured your reservation, call ahead and apologize if it looks like you'll be up to 20 minutes late. If you are running much later than that, consider canceling and rescheduling your dinner. Remember that reservations are made for a reason - to make sure as many guests as possible are served on each night. If you are late it affects other guests' reservations. Try to arrive 10-15 minutes before your reservation time. This way you can let the hostess know you've arrived and ensure that your table won't be given to someone else. Many restaurants will have a bar or waiting area that you can sit in and get drinks. However, remember to re-approach the hostess when the time for your reservation comes up so you aren't passed over. Booking Reservations Online Try the restaurant's website. Many restaurants allow you to book a reservation directly on their website. When doing this, you may also be able to see a list of all available dates and times for either the upcoming week or month. The restaurant is likely to require you to create a login or provide an email address or phone number so they can confirm your reservations. However, they should not text or email you anything else outside of updates on your reservation. Use an online booking site or mobile application. If you are unable to book a reservation directly on the restaurant's website, you can try an online booking site like OpenTable or Reservation Genie. These sites will allow you to search restaurants based on your preference of time, date, cuisine, and price range. There are also applications you can put on your phone like NoWait, which allows you to put your name in before heading to the restaurant. An app like this is great for last minute reservations. Check your email and phone regularly. Once you've made your reservations online, you should receive a confirmation either by email or via text. Some of these sites or restaurants may require you to click a link or a button to confirm your reservation. You may also be sent a link to cancel or change your reservation if you need to. Many of these online booking sites also offer coupons or have membership rewards programs through which you can accumulate perks. If you can't cancel online, you may have to call the restaurant directly.",
  "tyn_model":[
    "table",
    "restaurant",
    "“off",
    "” rather",
    "“prime",
    "” hours",
    "fine dining venues",
    "dinner",
    "reservation genie"
  ],
  "tyn_section":[

  ]
}