{
  "title":"How to Make Littlest Pet Shop Effects",
  "url":"https://www.wikihow.com/Make-Littlest-Pet-Shop-Effects",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids"
  ],
  "methods":[
    {
      "name":"Blood",
      "steps":[
        {
          "headline":"Have red Crayola washable paint.",
          "description":""
        },
        {
          "headline":"Have a skinny brush.",
          "description":""
        },
        {
          "headline":"Make it scattered.",
          "description":"It won't look real if it's in a gob!"
        }
      ]
    },
    {
      "name":"Tears",
      "steps":[
        {
          "headline":"To make tears, have a medicine dropper ready, filled with water!",
          "description":""
        },
        {
          "headline":"Push the tab on top, onto the Littlest Pet shop's head.",
          "description":""
        }
      ]
    },
    {
      "name":"Earthquake",
      "steps":[
        {
          "headline":"Have your camera at the LPSs.",
          "description":""
        },
        {
          "headline":"Shake the camera side to side or up and down then while you're doing that, have a volunteer mess the scene up.",
          "description":""
        },
        {
          "headline":"Make them injured.",
          "description":""
        },
        {
          "headline":"Use the blood trick to use for their injuries, make scratches!",
          "description":""
        }
      ]
    },
    {
      "name":"Ocean, Pool, or Bath",
      "steps":[
        {
          "headline":"If you want your scene to have an Ocean, use a tub.",
          "description":""
        },
        {
          "headline":"Use the tub for the Ocean.",
          "description":"The tub is bigger then a sink."
        },
        {
          "headline":"Have a blue mat or something to see like the Ocean.",
          "description":""
        },
        {
          "headline":"Fill the tub with water as high as it can go!",
          "description":""
        },
        {
          "headline":"Use the sink for the pool!",
          "description":"Just cover the plug and you're good, and fill the sink with water!"
        },
        {
          "headline":"For the bath, use a medium sized bowl.",
          "description":"Fill the bowl with water and you're good to go!"
        }
      ]
    },
    {
      "name":"Trap",
      "steps":[
        {
          "headline":"If you want your Littlest Pet Shop to trap another, have a laundry basket for the best.",
          "description":""
        },
        {
          "headline":"Have it POP out of nowhere.",
          "description":"(best if it comes out of the roof)"
        }
      ]
    },
    {
      "name":"Jungle",
      "steps":[
        {
          "headline":"If you want them in a jungle, You need to have an outside setting.",
          "description":"(it must be summer or spring)"
        },
        {
          "headline":"Have them act outside like if they were ACTUALLY in a jungle.",
          "description":""
        },
        {
          "headline":"Have a special name of the jungle.",
          "description":"Something that rhymes with paws or teeth."
        }
      ]
    },
    {
      "name":"Mountain",
      "steps":[
        {
          "headline":"For a mountain just have a high place.",
          "description":""
        },
        {
          "headline":"Make sure the pets can stand on it!",
          "description":""
        }
      ]
    },
    {
      "name":"Fall",
      "steps":[
        {
          "headline":"If you want them to fall from a high place, put them in a high spot.",
          "description":""
        },
        {
          "headline":"Drop them.",
          "description":""
        },
        {
          "headline":"Keep recording the same fall.",
          "description":""
        },
        {
          "headline":"Don't record them just falling like so.",
          "description":""
        },
        {
          "headline":"Have them fall once, then twice, then three times at least.",
          "description":"It depends on how high your spot is."
        }
      ]
    },
    {
      "name":"Locked Up",
      "steps":[
        {
          "headline":"Want them locked up in the stony lone some (jail) Have a net, bars, sticks, 5 tight strings and more.",
          "description":""
        },
        {
          "headline":"For the net, have it in a spot where you can tie one end to the top and one end to the bottom.",
          "description":""
        },
        {
          "headline":"For the bars just have a space where they (bars) can fit just right in a top space and a bottom.",
          "description":""
        },
        {
          "headline":"For the sticks, do the same things with the bars!",
          "description":""
        },
        {
          "headline":"Use the tight strings like you did with the net, it's similar to the net.",
          "description":""
        }
      ]
    },
    {
      "name":"Sounds",
      "steps":[
        {
          "headline":"Use sounds from the computer.",
          "description":""
        },
        {
          "headline":"Go to special effects or sound effects.",
          "description":"Search. If there's a download, you got to do it for your cool movie!"
        }
      ]
    }
  ],
  "text":" Blood Have red Crayola washable paint.  Have a skinny brush.  Make it scattered. It won't look real if it's in a gob! Tears To make tears, have a medicine dropper ready, filled with water!  Push the tab on top, onto the Littlest Pet shop's head.  Earthquake Have your camera at the LPSs.  Shake the camera side to side or up and down then while you're doing that, have a volunteer mess the scene up.  Make them injured.  Use the blood trick to use for their injuries, make scratches!  Ocean, Pool, or Bath If you want your scene to have an Ocean, use a tub.  Use the tub for the Ocean. The tub is bigger then a sink. Have a blue mat or something to see like the Ocean.  Fill the tub with water as high as it can go!  Use the sink for the pool! Just cover the plug and you're good, and fill the sink with water! For the bath, use a medium sized bowl. Fill the bowl with water and you're good to go! Trap If you want your Littlest Pet Shop to trap another, have a laundry basket for the best.  Have it POP out of nowhere. (best if it comes out of the roof) Jungle If you want them in a jungle, You need to have an outside setting. (it must be summer or spring) Have them act outside like if they were ACTUALLY in a jungle.  Have a special name of the jungle. Something that rhymes with paws or teeth. Mountain For a mountain just have a high place.  Make sure the pets can stand on it!  Fall If you want them to fall from a high place, put them in a high spot.  Drop them.  Keep recording the same fall.  Don't record them just falling like so.  Have them fall once, then twice, then three times at least. It depends on how high your spot is. Locked Up Want them locked up in the stony lone some (jail) Have a net, bars, sticks, 5 tight strings and more.  For the net, have it in a spot where you can tie one end to the top and one end to the bottom.  For the bars just have a space where they (bars) can fit just right in a top space and a bottom.  For the sticks, do the same things with the bars!  Use the tight strings like you did with the net, it's similar to the net.  Sounds Use sounds from the computer.  Go to special effects or sound effects. Search. If there's a download, you got to do it for your cool movie!",
  "tyn_model":[
    "water",
    "tub",
    "sink",
    "net",
    "bowl",
    "bars",
    "sticks",
    "crayola washable paint",
    "medicine dropper",
    "camera",
    "pool",
    "laundry basket"
  ],
  "tyn_section":[

  ]
}