{
  "title":"How to Make a Duct Tape and Foam Board Diffuser",
  "url":"https://www.wikihow.com/Make-a-Duct-Tape-and-Foam-Board-Diffuser",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photographic DIY"
  ],
  "steps":[
    {
      "headline":"Find out the size of your flash where the diffuser will fitted to.",
      "description":"For this Sunpak 4000AF, it is the following:\n6 cm /2 3/8 inches\n3 1/2 cm/1 3/8 inches\n3 cm/1 1/4 inches"
    },
    {
      "headline":"Create a basic rectangle shape of 24 cm X 17 cm.",
      "description":""
    },
    {
      "headline":"On the long side, (24cm), draw a line down the center of the rectangle.",
      "description":"You will see two 12 X 17cm rectangles. This divides your larger rectangle into two halves."
    },
    {
      "headline":"Using your measurements, create a rectangle at the bottom of the rectangle being sure to use the center line.",
      "description":"Draw a line an inch from the bottom centered around the center line. Draw another line parallel to the center line 3cm away from it on each side. Your shape should resemble the image above."
    },
    {
      "headline":"Determine the size of your sides of your diffuser.",
      "description":"To do this, use the measurements you have above. 24 cm (1x)\n6 cm (2x)\n3 1/2 cm (2y)"
    },
    {
      "headline":"Use this formula to determine the size.",
      "description":"(1x X 2y)/2x\n(24 X 3.5)/6 = 84/6 = 14"
    },
    {
      "headline":"Draw out the shape using the same process as before.",
      "description":"Create a rectangle shape of 14 cm x 17 cm. However, instead of 7 cm, use 4 1/2 cm on the rectangular base of the diffuser. It shouldn't be snug, hence, 1 cm has been added to the actual measurement."
    },
    {
      "headline":"'Baste' the pieces together using scotch tape.",
      "description":"Make any required adjustments. If they fit together properly, use them as templates. If they don't, make any necessary adjustments."
    },
    {
      "headline":"Use the templates to create the shapes on the foam board.",
      "description":""
    },
    {
      "headline":"Cut the shapes out of the foam board.",
      "description":""
    },
    {
      "headline":"At the line that marks out the top part of the rectangle, score a line.",
      "description":"Be sure that it doesn't go all the way through the foam board."
    },
    {
      "headline":"Baste them together to make sure that they fit.",
      "description":"Once you are sure they fit, take them back apart."
    },
    {
      "headline":"Be sure that the inside is reflective material.",
      "description":"Either white or something like shiny duct tape so that it will help with the light. If it isn't white or 'silver', you can make it that way."
    },
    {
      "headline":"Use some type of tape to start fastening the pieces together.",
      "description":"Here, the silver duct tape is used because it was used on the inside of the diffuser."
    },
    {
      "headline":"At this point, put the diffuser on your flash to make sure it fits.",
      "description":"While it is on, put duct tape around it so that it will hold its shape."
    },
    {
      "headline":"Continue taping around it, but try not to make it too thick.",
      "description":"That will make it difficult to fit on the flash. When putting tape on the corners, split the tape at the corner, and then tape it down to each side."
    },
    {
      "headline":"Continue taping around the diffuser until it is covered.",
      "description":"The silver duct tape was used here to allow it to double as a reflector if needed. If you wanted it to look 'more professional', you could use black, or if you wanted it 'more hip', try tie dye duct tape."
    },
    {
      "headline":"After the frame of the diffuser is complete, use it to determine the size of the diffuser material that you will need.",
      "description":"Cut it out with a little extra of about 1/2 to 1 inch."
    },
    {
      "headline":"Attach it to the diffuser.",
      "description":"You can do this with transparent tape, duct tape (carefully), or Velcro."
    },
    {
      "headline":"Done.",
      "description":"Use the foam board diffuser to make great shots."
    }
  ],
  "text":" Find out the size of your flash where the diffuser will fitted to. For this Sunpak 4000AF, it is the following:\n6 cm /2 3/8 inches\n3 1/2 cm/1 3/8 inches\n3 cm/1 1/4 inches Create a basic rectangle shape of 24 cm X 17 cm.  On the long side, (24cm), draw a line down the center of the rectangle. You will see two 12 X 17cm rectangles. This divides your larger rectangle into two halves. Using your measurements, create a rectangle at the bottom of the rectangle being sure to use the center line. Draw a line an inch from the bottom centered around the center line. Draw another line parallel to the center line 3cm away from it on each side. Your shape should resemble the image above. Determine the size of your sides of your diffuser. To do this, use the measurements you have above. 24 cm (1x)\n6 cm (2x)\n3 1/2 cm (2y) Use this formula to determine the size. (1x X 2y)/2x\n(24 X 3.5)/6 = 84/6 = 14 Draw out the shape using the same process as before. Create a rectangle shape of 14 cm x 17 cm. However, instead of 7 cm, use 4 1/2 cm on the rectangular base of the diffuser. It shouldn't be snug, hence, 1 cm has been added to the actual measurement. 'Baste' the pieces together using scotch tape. Make any required adjustments. If they fit together properly, use them as templates. If they don't, make any necessary adjustments. Use the templates to create the shapes on the foam board.  Cut the shapes out of the foam board.  At the line that marks out the top part of the rectangle, score a line. Be sure that it doesn't go all the way through the foam board. Baste them together to make sure that they fit. Once you are sure they fit, take them back apart. Be sure that the inside is reflective material. Either white or something like shiny duct tape so that it will help with the light. If it isn't white or 'silver', you can make it that way. Use some type of tape to start fastening the pieces together. Here, the silver duct tape is used because it was used on the inside of the diffuser. At this point, put the diffuser on your flash to make sure it fits. While it is on, put duct tape around it so that it will hold its shape. Continue taping around it, but try not to make it too thick. That will make it difficult to fit on the flash. When putting tape on the corners, split the tape at the corner, and then tape it down to each side. Continue taping around the diffuser until it is covered. The silver duct tape was used here to allow it to double as a reflector if needed. If you wanted it to look 'more professional', you could use black, or if you wanted it 'more hip', try tie dye duct tape. After the frame of the diffuser is complete, use it to determine the size of the diffuser material that you will need. Cut it out with a little extra of about 1/2 to 1 inch. Attach it to the diffuser. You can do this with transparent tape, duct tape (carefully), or Velcro. Done. Use the foam board diffuser to make great shots.",
  "tyn_model":[
    "duct tape",
    "foam board",
    "tape",
    "diffuser",
    "sunpak 4000af",
    "scotch tape",
    "tie dye duct tape",
    "transparent tape"
  ],
  "tyn_section":[

  ]
}