{
  "title":"How to Care for Daisies",
  "url":"https://www.wikihow.com/Care-for-Daisies",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Flowers"
  ],
  "methods":[
    {
      "name":"Planting Daisies",
      "steps":[
        {
          "headline":"Decide whether you will start seeds indoors, outdoors, or buy transplants.",
          "description":"Start the seeds indoors or purchase transplants if you want blooms the same year. If you choose to plant the seeds directly in the ground, expect the plants to bloom in their second year."
        },
        {
          "headline":"Plan when you will plant.",
          "description":"Plant transplants or direct sow seeds in early spring when there is no more risk of frost. To start daisies indoors, plant the seeds 6-8 weeks before the last frost. You can look up the last frost dates in your area online by searching for a frost chart for your country or region."
        },
        {
          "headline":"Plant seeds in containers if you’re starting your daisies indoors.",
          "description":"Pour a lightweight seed-starting mix into trays or pots. You can purchase a seed-starting mix or make your own with equal parts peat moss, vermiculite and perlite. Poke a small hole in the medium with a toothpick. Plant the seeds pointing down. Brush soil over the tops to cover the seeds. Keep the mixture moist and above 70° F (21° C) with at least 8 hours of bright light every day, using a grow light or window."
        },
        {
          "headline":"Choose a spot if planting outside, and clear the area.",
          "description":"Daisies love full sun, but partial sun will also work. Pick a planting area with moist, well-drained soil. Remove any existing growth from the ground so that your daisies won’t be crowded. Daisies can survive in poor soil. But if you want them to thrive, the soil should be moderate: not too rich and not too poor."
        },
        {
          "headline":"Prepare the soil.",
          "description":"Work a moderate amount of organic compost and/or aged manure into the soil for better blooms. Level the soil with a hoe and tamp it down lightly."
        },
        {
          "headline":"Plant your daisies outside if desired.",
          "description":"For direct sow, cover the seeds lightly with ⅛ in (0.32 cm) of soil. When seedlings grow 2-3 in (5.1-7.6 cm) tall, thin them to one plant every 12 in (30.5 cm). To plant existing seedlings, space the plants 12 to 24 in (30.5 to 60.9 cm) apart on all sides."
        },
        {
          "headline":"Water the seeds or seedlings right away.",
          "description":"For seeds that have not yet germinated, water the area regularly to keep it moist. Seedlings will need to be watered again only when the soil looks dry."
        }
      ]
    },
    {
      "name":"Caring for Daisies Outdoors",
      "steps":[
        {
          "headline":"Fertilize two weeks after planting and once a month thereafter.",
          "description":"Use all-purpose fertilizer like 10-10-10 in the amount listed on the label. For the best results, switch to a fertilizer high in phosphorous (such as 10-16-10) just before the plant blooms. To apply fertilizer: granular fertilizer can be sprinkled on the soil with or without a spreader. Water-soluble fertilizer should be applied using a sprayer or watering can. For either method, always measure your application based on the fertilizer's instruction label."
        },
        {
          "headline":"Water daisies as needed.",
          "description":"Daisies don’t require a set watering schedule; in fact, they prefer the soil to dry out somewhat between waterings. Check the top 4-5 in (10.2-12.7 cm) of soil – if it’s dry, water the daisies deeply from underneath so that their leaves don’t get wet. The best time to do this is in the morning. Daisies don’t need watering in the winter unless the weather is unseasonably dry. If that is the case, water them 1-2 in (2.5-5.1 cm) every other month."
        },
        {
          "headline":"Mulch around the daisies and/or hand weed as needed.",
          "description":"Weeds can attract parasites and starve daisies of nutrients. Make sure to wear gardening gloves and remove weeds by hand or with a short-handled weeding tool regularly. This is especially important when your daisies are still young. For less necessary maintenance of weeds, apply 2-3 in (5.1-7.6 cm) of mulch in mid-to-late spring when the ground warms and dries from winter. Keep a 2-3 in (5.1-7.6 cm) circumference around the plant base free from mulch."
        },
        {
          "headline":"Deadhead and prune the daisies as needed.",
          "description":"Throughout the growing season, prune away any dead leaves and snip the flower heads off whenever their appearance begins to fade. This encourages regrowth. Stop deadheading the daisies near the end of the growing season if you plan to collect the seeds. The end of the growing season will vary based on your location."
        },
        {
          "headline":"Cut down your daisies at the end of the growing season.",
          "description":"Trim down your daisies where the stem meets the foliage, approximately 3 in (7.6 cm) above soil level. Wait until the last killing frost. You can find the date range of freezes by looking up your gardening zone online. After trimming down, protect the perennials’ root balls with a layer of mulch. You can use straw, hay or leaves."
        },
        {
          "headline":"Divide your daisies when they lack space.",
          "description":"Dig deeply into the ground about 6-8 in (15.2-20.3 cm) away from the plants’ centers. Loosen the roots by rocking the shovel, and lift the plants gently out of the ground by the root balls. Carefully pull the clump apart and discard the woody centers. Replant wherever desired, each group of daisies 12 in (30.5 cm) away from other plants. Autumn is the preferable time to divide your daisies, however you can divide them in springtime if necessary. When dividing your daisies, place them gently in a temporary container to move them, and replant them right away."
        },
        {
          "headline":"Maintain your existing perennials.",
          "description":"Use a single application of fertilizer just before the new spring growth appears, or as soon as it pushes up through the ground. Side dress with compost or apply no more than 1 pound (0.45 kg) of nitrogen per 1,000 square feet (305 square meters)."
        }
      ]
    },
    {
      "name":"Caring for Daisies Indoors",
      "steps":[
        {
          "headline":"Put your daisies in an appropriate container.",
          "description":"Make sure the container is at least 12 in (30.5 cm) with two or more drainage holes. Glazed ceramic or plastic pots prevent wilting and help the soil stay moist. The container should be sterilized. Soak it for 10 minutes in a solution of 1 part household bleach to 9 parts water. Afterwards, scrub it with dish detergent and water and let it fully dry before using it."
        },
        {
          "headline":"Set up a light source.",
          "description":"Daisies should have sunlight or a grow light all day in the spring, summer and fall seasons. Indirect sunlight for at least 3-5 hours is sufficient for the wintertime. House plants need light from all sides. If your light source only hits one side of the plant, make sure to rotate the plant a quarter turn about every week."
        },
        {
          "headline":"Water the daisies and maintain a proper temperature.",
          "description":"Check the top 1 in (2.54 cm) of soil – if it feels dry to the touch, water your daisies deeply. Allow the pot to drain completely. If the saucer or drip tray is still waterlogged, pour out the excess water so that the plant doesn’t sit in soggy soil. Daisies growing indoors prefer a temperature between 40 and 70 degrees Fahrenheit (4 and 21 degrees Celsius). Water plants from underneath and avoid getting the leaves wet."
        },
        {
          "headline":"Fertilize your plants.",
          "description":"During the spring and summer, feed your daisies monthly with an all-purpose fertilizer. Don’t fertilize during the fall or winter. Mix water with a soluble fertilizer such as 15-5-15 once a month when they are actively growing in the spring and summer."
        },
        {
          "headline":"Deadhead the daisies and prune their leaves as needed.",
          "description":"Use sharp, clean shears and trim close to the stem. Whenever the blooms begins to wilt, snip off the flowerheads. When the leaves look wilted or damaged, prune them to improve the plant’s health."
        },
        {
          "headline":"Move your daisies as they grow.",
          "description":"If the plant gets crowded in its container, move it to a larger pot."
        }
      ]
    },
    {
      "name":"Saving Daisy Seeds",
      "steps":[
        {
          "headline":"Harvest the daisy seeds.",
          "description":"The seed head should be completely ripe before you collect any seeds – it should look brown and possibly cracked. Cut daisy stems at the base of each plant. Place them in a paper bag tied closed with string."
        },
        {
          "headline":"Dry the seeds.",
          "description":"Hang the bag(s) upside-down in a dark, dry area. The seed heads should be pointing downwards. Choose a spot that isn’t cold and has decent air circulation (but no strong drafts)."
        },
        {
          "headline":"Collect the seeds.",
          "description":"Check the bag to make sure the seed heads are brittle. Squeeze flower heads so that the seeds fall into the bottom of the bag. Dump the bag’s contents onto a plate. Separate the golden-brown seeds from any debris. Pour the seeds into a paper envelope and store them in a cool, dry place away from strong light."
        }
      ]
    },
    {
      "name":"Dealing with Growing Problems",
      "steps":[
        {
          "headline":"Check the pH level of the soil.",
          "description":"If you’ve followed proper planting and maintaining methods and your daisies still aren’t thriving, try testing the soil. Daisies prefer slightly acidic soil. Soil test kits should reflect a pH range of 6.0 to 7.0. Add limestone if your soil is too acidic. Add sulfur or peat moss if the soil is too alkaline."
        },
        {
          "headline":"Treat daisies for pests as needed.",
          "description":"Daisies can be affected by the following pests: aphids, mites, leafminers, nematodes, thrips and whiteflies. Most often, you will have to remove the affected leaves, isolate infested plants from healthy ones, apply a narrow-range oil or insecticidal soap, or use a water spray. Visit a garden center or shop online to find available products for addressing specific pest problems."
        },
        {
          "headline":"Secure a cleaner, drier environment.",
          "description":"You can do this if the daisies show signs of disease. Daisies stricken with fungal or bacterial diseases are likely too moist and/or crowded. Signs of disease problems include leaf spotting, yellowing or death, stunted shoots, and wilting. Remove any spent or damaged blooms and leaves, then clear plant debris from the area to keep the plant bases dry."
        },
        {
          "headline":"Deal with mold.",
          "description":"Mold may develop on the soil of indoor plants. If you see white mold on the soil's surface, scrape it off using gloves and move the plant to a well-ventilated area to let it dry out. If the mold returns, replant the daisies in a clean container with fresh, sterile indoor potting soil."
        }
      ]
    }
  ],
  "text":" Planting Daisies Decide whether you will start seeds indoors, outdoors, or buy transplants. Start the seeds indoors or purchase transplants if you want blooms the same year. If you choose to plant the seeds directly in the ground, expect the plants to bloom in their second year. Plan when you will plant. Plant transplants or direct sow seeds in early spring when there is no more risk of frost. To start daisies indoors, plant the seeds 6-8 weeks before the last frost. You can look up the last frost dates in your area online by searching for a frost chart for your country or region. Plant seeds in containers if you’re starting your daisies indoors. Pour a lightweight seed-starting mix into trays or pots. You can purchase a seed-starting mix or make your own with equal parts peat moss, vermiculite and perlite. Poke a small hole in the medium with a toothpick. Plant the seeds pointing down. Brush soil over the tops to cover the seeds. Keep the mixture moist and above 70° F (21° C) with at least 8 hours of bright light every day, using a grow light or window. Choose a spot if planting outside, and clear the area. Daisies love full sun, but partial sun will also work. Pick a planting area with moist, well-drained soil. Remove any existing growth from the ground so that your daisies won’t be crowded. Daisies can survive in poor soil. But if you want them to thrive, the soil should be moderate: not too rich and not too poor. Prepare the soil. Work a moderate amount of organic compost and/or aged manure into the soil for better blooms. Level the soil with a hoe and tamp it down lightly. Plant your daisies outside if desired. For direct sow, cover the seeds lightly with ⅛ in (0.32 cm) of soil. When seedlings grow 2-3 in (5.1-7.6 cm) tall, thin them to one plant every 12 in (30.5 cm). To plant existing seedlings, space the plants 12 to 24 in (30.5 to 60.9 cm) apart on all sides. Water the seeds or seedlings right away. For seeds that have not yet germinated, water the area regularly to keep it moist. Seedlings will need to be watered again only when the soil looks dry. Caring for Daisies Outdoors Fertilize two weeks after planting and once a month thereafter. Use all-purpose fertilizer like 10-10-10 in the amount listed on the label. For the best results, switch to a fertilizer high in phosphorous (such as 10-16-10) just before the plant blooms. To apply fertilizer: granular fertilizer can be sprinkled on the soil with or without a spreader. Water-soluble fertilizer should be applied using a sprayer or watering can. For either method, always measure your application based on the fertilizer's instruction label. Water daisies as needed. Daisies don’t require a set watering schedule; in fact, they prefer the soil to dry out somewhat between waterings. Check the top 4-5 in (10.2-12.7 cm) of soil – if it’s dry, water the daisies deeply from underneath so that their leaves don’t get wet. The best time to do this is in the morning. Daisies don’t need watering in the winter unless the weather is unseasonably dry. If that is the case, water them 1-2 in (2.5-5.1 cm) every other month. Mulch around the daisies and/or hand weed as needed. Weeds can attract parasites and starve daisies of nutrients. Make sure to wear gardening gloves and remove weeds by hand or with a short-handled weeding tool regularly. This is especially important when your daisies are still young. For less necessary maintenance of weeds, apply 2-3 in (5.1-7.6 cm) of mulch in mid-to-late spring when the ground warms and dries from winter. Keep a 2-3 in (5.1-7.6 cm) circumference around the plant base free from mulch. Deadhead and prune the daisies as needed. Throughout the growing season, prune away any dead leaves and snip the flower heads off whenever their appearance begins to fade. This encourages regrowth. Stop deadheading the daisies near the end of the growing season if you plan to collect the seeds. The end of the growing season will vary based on your location. Cut down your daisies at the end of the growing season. Trim down your daisies where the stem meets the foliage, approximately 3 in (7.6 cm) above soil level. Wait until the last killing frost. You can find the date range of freezes by looking up your gardening zone online. After trimming down, protect the perennials’ root balls with a layer of mulch. You can use straw, hay or leaves. Divide your daisies when they lack space. Dig deeply into the ground about 6-8 in (15.2-20.3 cm) away from the plants’ centers. Loosen the roots by rocking the shovel, and lift the plants gently out of the ground by the root balls. Carefully pull the clump apart and discard the woody centers. Replant wherever desired, each group of daisies 12 in (30.5 cm) away from other plants. Autumn is the preferable time to divide your daisies, however you can divide them in springtime if necessary. When dividing your daisies, place them gently in a temporary container to move them, and replant them right away. Maintain your existing perennials. Use a single application of fertilizer just before the new spring growth appears, or as soon as it pushes up through the ground. Side dress with compost or apply no more than 1 pound (0.45 kg) of nitrogen per 1,000 square feet (305 square meters). Caring for Daisies Indoors Put your daisies in an appropriate container. Make sure the container is at least 12 in (30.5 cm) with two or more drainage holes. Glazed ceramic or plastic pots prevent wilting and help the soil stay moist. The container should be sterilized. Soak it for 10 minutes in a solution of 1 part household bleach to 9 parts water. Afterwards, scrub it with dish detergent and water and let it fully dry before using it. Set up a light source. Daisies should have sunlight or a grow light all day in the spring, summer and fall seasons. Indirect sunlight for at least 3-5 hours is sufficient for the wintertime. House plants need light from all sides. If your light source only hits one side of the plant, make sure to rotate the plant a quarter turn about every week. Water the daisies and maintain a proper temperature. Check the top 1 in (2.54 cm) of soil – if it feels dry to the touch, water your daisies deeply. Allow the pot to drain completely. If the saucer or drip tray is still waterlogged, pour out the excess water so that the plant doesn’t sit in soggy soil. Daisies growing indoors prefer a temperature between 40 and 70 degrees Fahrenheit (4 and 21 degrees Celsius). Water plants from underneath and avoid getting the leaves wet. Fertilize your plants. During the spring and summer, feed your daisies monthly with an all-purpose fertilizer. Don’t fertilize during the fall or winter. Mix water with a soluble fertilizer such as 15-5-15 once a month when they are actively growing in the spring and summer. Deadhead the daisies and prune their leaves as needed. Use sharp, clean shears and trim close to the stem. Whenever the blooms begins to wilt, snip off the flowerheads. When the leaves look wilted or damaged, prune them to improve the plant’s health. Move your daisies as they grow. If the plant gets crowded in its container, move it to a larger pot. Saving Daisy Seeds Harvest the daisy seeds. The seed head should be completely ripe before you collect any seeds – it should look brown and possibly cracked. Cut daisy stems at the base of each plant. Place them in a paper bag tied closed with string. Dry the seeds. Hang the bag(s) upside-down in a dark, dry area. The seed heads should be pointing downwards. Choose a spot that isn’t cold and has decent air circulation (but no strong drafts). Collect the seeds. Check the bag to make sure the seed heads are brittle. Squeeze flower heads so that the seeds fall into the bottom of the bag. Dump the bag’s contents onto a plate. Separate the golden-brown seeds from any debris. Pour the seeds into a paper envelope and store them in a cool, dry place away from strong light. Dealing with Growing Problems Check the pH level of the soil. If you’ve followed proper planting and maintaining methods and your daisies still aren’t thriving, try testing the soil. Daisies prefer slightly acidic soil. Soil test kits should reflect a pH range of 6.0 to 7.0. Add limestone if your soil is too acidic. Add sulfur or peat moss if the soil is too alkaline. Treat daisies for pests as needed. Daisies can be affected by the following pests: aphids, mites, leafminers, nematodes, thrips and whiteflies. Most often, you will have to remove the affected leaves, isolate infested plants from healthy ones, apply a narrow-range oil or insecticidal soap, or use a water spray. Visit a garden center or shop online to find available products for addressing specific pest problems. Secure a cleaner, drier environment. You can do this if the daisies show signs of disease. Daisies stricken with fungal or bacterial diseases are likely too moist and/or crowded. Signs of disease problems include leaf spotting, yellowing or death, stunted shoots, and wilting. Remove any spent or damaged blooms and leaves, then clear plant debris from the area to keep the plant bases dry. Deal with mold. Mold may develop on the soil of indoor plants. If you see white mold on the soil's surface, scrape it off using gloves and move the plant to a well-ventilated area to let it dry out. If the mold returns, replant the daisies in a clean container with fresh, sterile indoor potting soil.",
  "tyn_model":[
    "water",
    "daisies",
    "fertilizer",
    "mulch",
    "seed-starting mix",
    "peat moss",
    "soil",
    "all-purpose fertilizer",
    "– if",
    "pot",
    "vermiculite",
    "perlite",
    "grow light",
    "organic compost",
    "aged manure",
    "hoe",
    "⅛ in",
    "watering can",
    "’ root",
    "straw",
    "’ centers",
    "shovel",
    "compost",
    "nitrogen",
    "container",
    "pots",
    "household bleach",
    "dish detergent",
    "saucer",
    "drip tray",
    "shears",
    "– it",
    "plate",
    "limestone",
    "sulfur",
    "narrow-range oil or insecticidal soap",
    "garden center",
    "mold",
    "indoor potting soil"
  ],
  "tyn_section":[

  ]
}