{
  "title":"How to Make Baby Sock Roses",
  "url":"https://www.wikihow.com/Make-Baby-Sock-Roses",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "parts":[
    {
      "name":"Creating the Blossoms",
      "steps":[
        {
          "headline":"Lay a sock on top of a work surface.",
          "description":""
        },
        {
          "headline":"Starting at the bottom, roll the sock by rolling the bottom of the sock up and over.",
          "description":"Continue rolling until you have rolled the entire sock."
        },
        {
          "headline":"Place double-sided tape along the interior of the sock’s remaining edge.",
          "description":"Press the taped edge of the sock down against the fabric of the sock to seal the edge."
        },
        {
          "headline":"Create as many blossom as you need following these steps.",
          "description":""
        }
      ]
    },
    {
      "name":"Adding the Wire Stem",
      "steps":[
        {
          "headline":"Unroll some florist’s wire to the length that you want your baby sock rose to be.",
          "description":"Cut the wire with needle-nosed pliers."
        },
        {
          "headline":"Push the wire through the bottom of the rolled sock into the center of the roll.",
          "description":"Turn the sock as you push in the wire to help the wire to go in without damaging the sock."
        },
        {
          "headline":"Place florist’s tape around the base of your baby sock rose.",
          "description":"Pull the tape around the sock and the top of the exposed wire multiple times to ensure that the base is secure."
        },
        {
          "headline":"Twist the taped base tightly until the rose is snug.",
          "description":""
        }
      ]
    },
    {
      "name":"Adding the Greenery and Wrapping the Stem",
      "steps":[
        {
          "headline":"Cut off a leaf from a piece of greenery using needle-nosed pliers.",
          "description":""
        },
        {
          "headline":"Lay the leaf 1-1/2” below the base of the flower.",
          "description":"Twist the wire of the leaf around the stem. The base of the leaf should be against the stem so that the wire doesn’t show."
        },
        {
          "headline":"Cut off a second leaf.",
          "description":""
        },
        {
          "headline":"Attach the second leaf slightly below the first leaf.",
          "description":"The second leaf should mirror the other leaf; if the first leaf points to the right, then the second leaf should point to the left."
        },
        {
          "headline":"Take a piece of floral tape and wrap the tape around the top of the exposed stem.",
          "description":""
        },
        {
          "headline":"Continue wrapping the stem, stretching the tape tightly as you wrap down the length of the stem.",
          "description":""
        }
      ]
    }
  ],
  "text":" Creating the Blossoms Lay a sock on top of a work surface.  Starting at the bottom, roll the sock by rolling the bottom of the sock up and over. Continue rolling until you have rolled the entire sock. Place double-sided tape along the interior of the sock’s remaining edge. Press the taped edge of the sock down against the fabric of the sock to seal the edge. Create as many blossom as you need following these steps.  Adding the Wire Stem Unroll some florist’s wire to the length that you want your baby sock rose to be. Cut the wire with needle-nosed pliers. Push the wire through the bottom of the rolled sock into the center of the roll. Turn the sock as you push in the wire to help the wire to go in without damaging the sock. Place florist’s tape around the base of your baby sock rose. Pull the tape around the sock and the top of the exposed wire multiple times to ensure that the base is secure. Twist the taped base tightly until the rose is snug.  Adding the Greenery and Wrapping the Stem Cut off a leaf from a piece of greenery using needle-nosed pliers.  Lay the leaf 1-1/2” below the base of the flower. Twist the wire of the leaf around the stem. The base of the leaf should be against the stem so that the wire doesn’t show. Cut off a second leaf.  Attach the second leaf slightly below the first leaf. The second leaf should mirror the other leaf; if the first leaf points to the right, then the second leaf should point to the left. Take a piece of floral tape and wrap the tape around the top of the exposed stem.  Continue wrapping the stem, stretching the tape tightly as you wrap down the length of the stem. ",
  "tyn_model":[
    "wire",
    "tape",
    "greenery",
    "double-sided tape",
    "florist’s wire",
    "pliers",
    "florist’s tape",
    "needle-nosed pliers",
    "” below",
    "floral tape"
  ],
  "tyn_section":[

  ]
}