{
  "title":"How to Make a Hair Stick from a Knitting Needle",
  "url":"https://www.wikihow.com/Make-a-Hair-Stick-from-a-Knitting-Needle",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "steps":[
    {
      "headline":"Decide how long you need your hair stick to be.",
      "description":"Hair sticks can vary in length quite significantly and the length of your hair stick will depend on the length and thickness of your hair, and the style you will use it for. As a rough guide, measure the width of your bun and add an inch, or two if you plan to use the stick for buns, or add three to four inches if you plan on using it for styles where your hair is wrapped around the stick. This is easier if you have someone to measure it for you!"
    },
    {
      "headline":"Measure and mark on the knitting needle the point where you need to cut.",
      "description":""
    },
    {
      "headline":"Cut the knitting needle to length with a hacksaw.",
      "description":"If you have a vice this can be used to hold the knitting needle in place while you cut, however, it isn't necessary. You can hold the needle by hand, or with a pair of pliers. If you use something to hold the knitting needle while you cut it, wrap the needle in a cloth or paper towel to avoid damaging the coating."
    },
    {
      "headline":"File the cut edge of the knitting needle so it is smooth and flat.",
      "description":"If your knitting needle is made from wood, then sandpaper will work best; if it is made from metal, then a metal file is the best tool for the job."
    },
    {
      "headline":"Bend the bead cap with a pair of needle-nose pliers so it will fit snugly over the top of the cut edge, if it is not already shaped in a way that will fit.",
      "description":"If the bead cap comes down around the top of the needle it will help to prevent the decorative top being knocked off during everyday use."
    },
    {
      "headline":"Cut the pin with wire cutters so it is long enough to go through the bead cap and bead without the sharp point sticking out from the bead.",
      "description":""
    },
    {
      "headline":"Push the needle through the bead cap so the sharp end sticks out of the top of the bead cap and put a small amount of superglue inside the bead cap.",
      "description":""
    },
    {
      "headline":"Put the bead cap over the cut edge of the knitting needle and hold it in place until dry.",
      "description":""
    },
    {
      "headline":"Put a small amount of superglue on the part of the pin sticking out of the top of the bead cap.",
      "description":"This can be done most easily by putting the pin inside the nozzle of the tube of glue."
    },
    {
      "headline":"Push the bead onto the pin and remove any excess glue.",
      "description":""
    },
    {
      "headline":"Allow the glue to dry before using the hair stick in your hair.",
      "description":""
    }
  ],
  "text":" Decide how long you need your hair stick to be. Hair sticks can vary in length quite significantly and the length of your hair stick will depend on the length and thickness of your hair, and the style you will use it for. As a rough guide, measure the width of your bun and add an inch, or two if you plan to use the stick for buns, or add three to four inches if you plan on using it for styles where your hair is wrapped around the stick. This is easier if you have someone to measure it for you! Measure and mark on the knitting needle the point where you need to cut.  Cut the knitting needle to length with a hacksaw. If you have a vice this can be used to hold the knitting needle in place while you cut, however, it isn't necessary. You can hold the needle by hand, or with a pair of pliers. If you use something to hold the knitting needle while you cut it, wrap the needle in a cloth or paper towel to avoid damaging the coating. File the cut edge of the knitting needle so it is smooth and flat. If your knitting needle is made from wood, then sandpaper will work best; if it is made from metal, then a metal file is the best tool for the job. Bend the bead cap with a pair of needle-nose pliers so it will fit snugly over the top of the cut edge, if it is not already shaped in a way that will fit. If the bead cap comes down around the top of the needle it will help to prevent the decorative top being knocked off during everyday use. Cut the pin with wire cutters so it is long enough to go through the bead cap and bead without the sharp point sticking out from the bead.  Push the needle through the bead cap so the sharp end sticks out of the top of the bead cap and put a small amount of superglue inside the bead cap.  Put the bead cap over the cut edge of the knitting needle and hold it in place until dry.  Put a small amount of superglue on the part of the pin sticking out of the top of the bead cap. This can be done most easily by putting the pin inside the nozzle of the tube of glue. Push the bead onto the pin and remove any excess glue.  Allow the glue to dry before using the hair stick in your hair. ",
  "tyn_model":[
    "hair stick",
    "knitting needle",
    "glue",
    "superglue",
    "hair sticks",
    "hacksaw",
    "pliers",
    "sandpaper",
    "needle-nose pliers",
    "wire cutters"
  ],
  "tyn_section":[

  ]
}