{
  "title":"How to Install a Caroma Toilet",
  "url":"https://www.wikihow.com/Install-a-Caroma-Toilet",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bathrooms"
  ],
  "steps":[
    {
      "headline":"Disconnect and remove the supply line to the toilet.",
      "description":"The old toilet has been removed and supply line has been disconnected at this point. Be sure to remove all pieces of the old wax ring using your putty knife."
    },
    {
      "headline":"Add a Flexible Supply line for the new toilet.",
      "description":"Plumber's tape (Teflon) has been added to the shut off valve to ensure a watertight seal. Standard wax ring will be used."
    },
    {
      "headline":"Place a wax ring into the Caroma Universal Offset Collar/Adapter.",
      "description":""
    },
    {
      "headline":"Make sure to place the same Offset collar over the flange.",
      "description":"Apply pressure to flange to ensure a solid setting.Rotate Offset collar to achieve a 10 to 12 inch (25.4 to 30.5 cm) rough in"
    },
    {
      "headline":"Secure the flange bolts to offset collar.",
      "description":"Tighten until firmly seated."
    },
    {
      "headline":"Lift the toilet bowl onto the flange.",
      "description":""
    },
    {
      "headline":"Drill the screw holes, when the toilet bowl is placed onto the flange.",
      "description":"The securing screw holes are to be drilled at this point, once drilled, finishing bolts and covers are inserted."
    },
    {
      "headline":"Apply Bathroom approved caulking around the base of the bowl to ensure a proper seal has been obtained.",
      "description":""
    },
    {
      "headline":"Ensure that the water line is fastened securely.",
      "description":""
    },
    {
      "headline":"Turn water supply back on.",
      "description":""
    },
    {
      "headline":"Wait for the toilet tank to fill, and for the caulk needing time to cure.",
      "description":"It should then be ready to use in 12-24 hours as the caulking needs time to cure."
    }
  ],
  "text":" Disconnect and remove the supply line to the toilet. The old toilet has been removed and supply line has been disconnected at this point. Be sure to remove all pieces of the old wax ring using your putty knife. Add a Flexible Supply line for the new toilet. Plumber's tape (Teflon) has been added to the shut off valve to ensure a watertight seal. Standard wax ring will be used. Place a wax ring into the Caroma Universal Offset Collar/Adapter.  Make sure to place the same Offset collar over the flange. Apply pressure to flange to ensure a solid setting.Rotate Offset collar to achieve a 10 to 12 inch (25.4 to 30.5 cm) rough in Secure the flange bolts to offset collar. Tighten until firmly seated. Lift the toilet bowl onto the flange.  Drill the screw holes, when the toilet bowl is placed onto the flange. The securing screw holes are to be drilled at this point, once drilled, finishing bolts and covers are inserted. Apply Bathroom approved caulking around the base of the bowl to ensure a proper seal has been obtained.  Ensure that the water line is fastened securely.  Turn water supply back on.  Wait for the toilet tank to fill, and for the caulk needing time to cure. It should then be ready to use in 12-24 hours as the caulking needs time to cure.",
  "tyn_model":[
    "toilet bowl",
    "water",
    "putty knife",
    "plumber's tape",
    "wax ring",
    "caroma universal",
    "adapter",
    "bathroom approved caulking",
    "toilet tank",
    "caulking"
  ],
  "tyn_section":[

  ]
}