{
  "title":"How to Can Baby Food",
  "url":"https://www.wikihow.com/Can-Baby-Food",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Preservation Techniques"
  ],
  "methods":[
    {
      "name":"Preparing the Food",
      "steps":[
        {
          "headline":"Choose foods that are highly acidic.",
          "description":"Think tomatoes, apples, peaches, and other fruits. High levels of acid create an unfriendly environment for bacteria to grow."
        },
        {
          "headline":"Wash all food before preparing it.",
          "description":"A thorough scrub under running water can remove much of the dirt and bacteria that might be contaminating the food. You must remove as much as possible in order to create food safe for your baby to consume."
        },
        {
          "headline":"Steam cook the fruit to preserve more vitamins and minerals.",
          "description":"Boiling can reduce the nutritional content of many foods."
        },
        {
          "headline":"Puree the food.",
          "description":"Blend the cooked fruit with a little liquid in a blender or food processor."
        },
        {
          "headline":"Alternatively, mash the food.",
          "description":"If your baby is a little older, he or she may be able to handle chunky foods, so a pureed recipe is no longer necessary. Use a fork to mash pre-cooked, softened foods into the desired consistency."
        },
        {
          "headline":"Add lemon juice.",
          "description":"A touch of lemon juice acts as an added preservative, raising the acidic content of the food enough to ward off harmful bacteria. It also acts as a flavor enhancer."
        }
      ]
    },
    {
      "name":"Freezable Canning",
      "steps":[
        {
          "headline":"Look for freezer-safe jars.",
          "description":"Most glass jars are not safe for freezer use. Glass expands, which may cause chips or cracks to form and contaminate your baby's food. Some canning companies do produce freezer-safe glass and plastic jars, however."
        },
        {
          "headline":"Ladle the pureed or mashed food into the jars.",
          "description":""
        },
        {
          "headline":"Leave ⁄2 inch (1.3 cm) of space between the food and the rim of the jar.",
          "description":"Cold temperatures cause food to expand. Leaving extra room inside the jar allows the food to expand without the risk of breaking the jar."
        },
        {
          "headline":"Seal the jar with the right lid.",
          "description":"If using a glass jar, consider using plastic caps instead of two-piece metal canning lids. Plastic lids are more flexible, which means that the glass is less likely to chip or break."
        },
        {
          "headline":"Store in the freezer for up to two months.",
          "description":"The temperature should be at or below 0 degrees Fahrenheit (-17 degrees Celsius)."
        }
      ]
    },
    {
      "name":"Pressure Canning",
      "steps":[
        {
          "headline":"Select the right jar.",
          "description":"Stick with glass jars in pint or half-pint sizes when preparing baby food."
        },
        {
          "headline":"Ladle the prepared food into each jar.",
          "description":""
        },
        {
          "headline":"Fill your canner with 2 or 3 inches (5.1 or 7.6 cm) of hot water.",
          "description":""
        },
        {
          "headline":"Place filled jars onto the pressure canner's rack using a jar lifter.",
          "description":""
        },
        {
          "headline":"Fasten the lid of the pressure canner securely.",
          "description":"The lid must be snug and tightly sealed to maintain pressure during the canning process."
        },
        {
          "headline":"Set the canner to a high heat setting and steam for 10 minutes.",
          "description":"Close any vents to allow the canner to pressurize. This process should take an additional 3 to 5 minutes."
        },
        {
          "headline":"Time the process once the dial or weighted gauge indicates that an appropriate level of pressure has been reached.",
          "description":"If you live at an altitude between 0 and 1000 feet, pressure can the food for 20 minutes. If you live at an altitude between 1001 and 6000 feet, give the process 25 minutes."
        },
        {
          "headline":"Turn off the heat and allow the canner to depressurize.",
          "description":"Do not force cool the pressure canner by running it under cold water or refrigerating it. Allow the pressure gauge to return to zero at a natural pace."
        },
        {
          "headline":"Unfasten the cover and tilt the far side up.",
          "description":"Doing this allows the steam to escape away from you."
        },
        {
          "headline":"Remove the jars from the canner.",
          "description":"Place on a rack lined with dry towels or newspaper and allow them to air dry and cool naturally."
        },
        {
          "headline":"Allow the jars to cool for 12 to 24 hours before storing in a cool, dark, and dry cupboard.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preparing the Food Choose foods that are highly acidic. Think tomatoes, apples, peaches, and other fruits. High levels of acid create an unfriendly environment for bacteria to grow. Wash all food before preparing it. A thorough scrub under running water can remove much of the dirt and bacteria that might be contaminating the food. You must remove as much as possible in order to create food safe for your baby to consume. Steam cook the fruit to preserve more vitamins and minerals. Boiling can reduce the nutritional content of many foods. Puree the food. Blend the cooked fruit with a little liquid in a blender or food processor. Alternatively, mash the food. If your baby is a little older, he or she may be able to handle chunky foods, so a pureed recipe is no longer necessary. Use a fork to mash pre-cooked, softened foods into the desired consistency. Add lemon juice. A touch of lemon juice acts as an added preservative, raising the acidic content of the food enough to ward off harmful bacteria. It also acts as a flavor enhancer. Freezable Canning Look for freezer-safe jars. Most glass jars are not safe for freezer use. Glass expands, which may cause chips or cracks to form and contaminate your baby's food. Some canning companies do produce freezer-safe glass and plastic jars, however. Ladle the pureed or mashed food into the jars.  Leave ⁄2 inch (1.3 cm) of space between the food and the rim of the jar. Cold temperatures cause food to expand. Leaving extra room inside the jar allows the food to expand without the risk of breaking the jar. Seal the jar with the right lid. If using a glass jar, consider using plastic caps instead of two-piece metal canning lids. Plastic lids are more flexible, which means that the glass is less likely to chip or break. Store in the freezer for up to two months. The temperature should be at or below 0 degrees Fahrenheit (-17 degrees Celsius). Pressure Canning Select the right jar. Stick with glass jars in pint or half-pint sizes when preparing baby food. Ladle the prepared food into each jar.  Fill your canner with 2 or 3 inches (5.1 or 7.6 cm) of hot water.  Place filled jars onto the pressure canner's rack using a jar lifter.  Fasten the lid of the pressure canner securely. The lid must be snug and tightly sealed to maintain pressure during the canning process. Set the canner to a high heat setting and steam for 10 minutes. Close any vents to allow the canner to pressurize. This process should take an additional 3 to 5 minutes. Time the process once the dial or weighted gauge indicates that an appropriate level of pressure has been reached. If you live at an altitude between 0 and 1000 feet, pressure can the food for 20 minutes. If you live at an altitude between 1001 and 6000 feet, give the process 25 minutes. Turn off the heat and allow the canner to depressurize. Do not force cool the pressure canner by running it under cold water or refrigerating it. Allow the pressure gauge to return to zero at a natural pace. Unfasten the cover and tilt the far side up. Doing this allows the steam to escape away from you. Remove the jars from the canner. Place on a rack lined with dry towels or newspaper and allow them to air dry and cool naturally. Allow the jars to cool for 12 to 24 hours before storing in a cool, dark, and dry cupboard. ",
  "tyn_model":[
    "canner",
    "pressure canner",
    "water",
    "jars",
    "tomatoes",
    "apples",
    "blender",
    "food processor",
    "fork",
    "lemon juice",
    "lemon",
    "glass jar",
    "freezer",
    "hot water",
    "jar lifter",
    "food",
    "newspaper"
  ],
  "tyn_section":[

  ]
}