{
  "title":"How to Make Gingered Spiced Quinoa",
  "url":"https://www.wikihow.com/Make-Gingered-Spiced-Quinoa",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Cereal Grains"
  ],
  "steps":[
    {
      "headline":"Put a 1/2 cup of quinoa in a thin metal strainer and run cool water over well.",
      "description":""
    },
    {
      "headline":"Boil one cup of water and reduce to a simmer, then place quinoa in pot and cover with a lid and let cook for 15 minutes.",
      "description":""
    },
    {
      "headline":"After 15 minutes place quinoa back in metal strainer, run cool water over it to stop the cooking process, then place it back in the pot to drain.",
      "description":""
    },
    {
      "headline":"Chop up by hand or in a food processor: a green or red bell pepper, celery, red onions, carrots, grated ginger,chopped garlic, and add some salt, then chop to get fine pieces.",
      "description":""
    },
    {
      "headline":"Simmer the chopped vegetables in 2 tablespoons of extra virgin olive oil for 3 minutes while stirring.",
      "description":""
    },
    {
      "headline":"After 3 minutes add 1/4 cup of chicken or vegetable stock, 1 tablespoon of soy sauce, 2 dashes of turmeric, 2 dashes of curry, 2 dashes of cayenne pepper, 2 teaspoons of cilantro, then let cook for 2 more minutes.",
      "description":""
    },
    {
      "headline":"Place quinoa in skillet with vegetables/sauces, and let cook for an additional minute while stirring to get all the ingredients evenly distributed.",
      "description":""
    },
    {
      "headline":"Place in a serving bowl, stir well and serve.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Put a 1/2 cup of quinoa in a thin metal strainer and run cool water over well.  Boil one cup of water and reduce to a simmer, then place quinoa in pot and cover with a lid and let cook for 15 minutes.  After 15 minutes place quinoa back in metal strainer, run cool water over it to stop the cooking process, then place it back in the pot to drain.  Chop up by hand or in a food processor: a green or red bell pepper, celery, red onions, carrots, grated ginger,chopped garlic, and add some salt, then chop to get fine pieces.  Simmer the chopped vegetables in 2 tablespoons of extra virgin olive oil for 3 minutes while stirring.  After 3 minutes add 1/4 cup of chicken or vegetable stock, 1 tablespoon of soy sauce, 2 dashes of turmeric, 2 dashes of curry, 2 dashes of cayenne pepper, 2 teaspoons of cilantro, then let cook for 2 more minutes.  Place quinoa in skillet with vegetables/sauces, and let cook for an additional minute while stirring to get all the ingredients evenly distributed.  Place in a serving bowl, stir well and serve.  Finished. ",
  "tyn_model":[
    "water",
    "quinoa",
    "pot",
    "thin metal strainer",
    "strainer",
    "food processor",
    "pepper",
    "celery",
    "red onions",
    "carrots",
    "ginger",
    "garlic",
    "salt",
    "extra virgin olive oil",
    "chicken or vegetable stock",
    "soy sauce",
    "turmeric",
    "curry",
    "cayenne pepper",
    "cilantro",
    "skillet",
    "vegetables",
    "sauces",
    "serving bowl"
  ],
  "tyn_section":[

  ]
}