{
  "title":"How to Create an Extreme Macro Lens Using Extension Tubes",
  "url":"https://www.wikihow.com/Create-an-Extreme-Macro-Lens-Using-Extension-Tubes",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photographic DIY"
  ],
  "steps":[
    {
      "headline":"Determine if you want your lens setup to be 'permanent'.",
      "description":"If so, you can use stronger tape (or glue) to attach everything together."
    },
    {
      "headline":"Assemble the extension tube.",
      "description":"On one 'half', you want the '3' tube, and on the other one, you want the '1' and '2' tubes. This gives your tube that you will be using something to be fastened to."
    },
    {
      "headline":"If your tube isn't a tube already, then make it one.",
      "description":"This can usually be done by cutting off the ends of it."
    },
    {
      "headline":"Pare off the ends so that it is somewhat even.",
      "description":"If you have a rasp, you can probably get it to be pretty even."
    },
    {
      "headline":"Clean it out and dry it thoroughly.",
      "description":""
    },
    {
      "headline":"Darken the inside of it.",
      "description":"This can be done with matte black spray paint, black construction paper, or anything else you have that will darken it. It needs to be a non-reflective black."
    },
    {
      "headline":"Fasten the tube to both sides of the extension tubes.",
      "description":""
    },
    {
      "headline":"Determine a way to fasten them together.",
      "description":"Shipping tape is a little less permanent than duct tape and might be a better non-permanent solution."
    },
    {
      "headline":"Determine your magnification (optional).",
      "description":""
    }
  ],
  "text":" Determine if you want your lens setup to be 'permanent'. If so, you can use stronger tape (or glue) to attach everything together. Assemble the extension tube. On one 'half', you want the '3' tube, and on the other one, you want the '1' and '2' tubes. This gives your tube that you will be using something to be fastened to. If your tube isn't a tube already, then make it one. This can usually be done by cutting off the ends of it. Pare off the ends so that it is somewhat even. If you have a rasp, you can probably get it to be pretty even. Clean it out and dry it thoroughly.  Darken the inside of it. This can be done with matte black spray paint, black construction paper, or anything else you have that will darken it. It needs to be a non-reflective black. Fasten the tube to both sides of the extension tubes.  Determine a way to fasten them together. Shipping tape is a little less permanent than duct tape and might be a better non-permanent solution. Determine your magnification (optional). ",
  "tyn_model":[
    "tape",
    "glue",
    "extension tube",
    "spray paint",
    "construction paper",
    "extension tubes",
    "shipping tape",
    "duct tape"
  ],
  "tyn_section":[

  ]
}