{
  "title":"How to Make Egg Salad With Avocado Instead of Mayo",
  "url":"https://www.wikihow.com/Make-Egg-Salad-With-Avocado-Instead-of-Mayo",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Salads"
  ],
  "methods":[
    {
      "name":"Prepare the Hard-boiled Eggs",
      "steps":[
        {
          "headline":"Put the eggs in a saucepan in a single layer.",
          "description":""
        },
        {
          "headline":"Fill the pan with enough water to cover the eggs by at least 1”.",
          "description":""
        },
        {
          "headline":"Cover the pan and bring the water to a rolling boil over high heat.",
          "description":""
        },
        {
          "headline":"Remove the pan from the burner immediately after the water begins to boil.",
          "description":""
        },
        {
          "headline":"Let the eggs stand in the hot water for 15 to 20 minutes.",
          "description":""
        },
        {
          "headline":"Remove one egg from the hot water after 15 minutes and test for doneness.",
          "description":"Peel the egg and slice it in half to see if the yolk is cooked through. Allow the eggs to sit in the hot water for another 5 minutes if the yolk of your test egg was not thoroughly cooked through."
        },
        {
          "headline":"Pour out the hot water from the pan.",
          "description":""
        },
        {
          "headline":"Fill the pan with cold water and let the eggs cool off.",
          "description":""
        },
        {
          "headline":"Peel the eggs.",
          "description":""
        },
        {
          "headline":"Rinse the eggs under cold running water after you peel them.",
          "description":""
        },
        {
          "headline":"Put the peeled eggs on a cutting board and chop them coarsely..",
          "description":""
        }
      ]
    },
    {
      "name":"Mix Together the Ingredients",
      "steps":[
        {
          "headline":"Mash the avocado in a medium bowl using a fork or a potato masher.",
          "description":""
        },
        {
          "headline":"Add the chopped eggs and continue to mash until the ingredients are blended.",
          "description":"It’s alright if the mixture is somewhat lumpy."
        },
        {
          "headline":"Add in the mustard, vinegar, garlic powder, dill weed and salt.",
          "description":""
        },
        {
          "headline":"Stir in the seasonings just until all of the ingredients are blended.",
          "description":""
        },
        {
          "headline":"Spread the mixture on bread slices or in a wrap.",
          "description":""
        },
        {
          "headline":"Serve it with lettuce and tomato or a dill pickle garnish if desired.",
          "description":""
        }
      ]
    }
  ],
  "text":" Prepare the Hard-boiled Eggs Put the eggs in a saucepan in a single layer.  Fill the pan with enough water to cover the eggs by at least 1”.  Cover the pan and bring the water to a rolling boil over high heat.  Remove the pan from the burner immediately after the water begins to boil.  Let the eggs stand in the hot water for 15 to 20 minutes.  Remove one egg from the hot water after 15 minutes and test for doneness. Peel the egg and slice it in half to see if the yolk is cooked through. Allow the eggs to sit in the hot water for another 5 minutes if the yolk of your test egg was not thoroughly cooked through. Pour out the hot water from the pan.  Fill the pan with cold water and let the eggs cool off.  Peel the eggs.  Rinse the eggs under cold running water after you peel them.  Put the peeled eggs on a cutting board and chop them coarsely..  Mix Together the Ingredients Mash the avocado in a medium bowl using a fork or a potato masher.  Add the chopped eggs and continue to mash until the ingredients are blended. It’s alright if the mixture is somewhat lumpy. Add in the mustard, vinegar, garlic powder, dill weed and salt.  Stir in the seasonings just until all of the ingredients are blended.  Spread the mixture on bread slices or in a wrap.  Serve it with lettuce and tomato or a dill pickle garnish if desired. ",
  "tyn_model":[
    "water",
    "eggs",
    "saucepan",
    "”.",
    "hot water",
    "cold water",
    "cutting board",
    "avocado",
    "medium bowl",
    "fork",
    "potato masher",
    "mustard",
    "vinegar",
    "garlic powder",
    "dill weed",
    "salt",
    "seasonings",
    "lettuce",
    "tomato",
    "dill pickle"
  ],
  "tyn_section":[

  ]
}