{
  "title":"How to Set Spider Traps",
  "url":"https://www.wikihow.com/Set-Spider-Traps",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control",
    "Spider Control"
  ],
  "methods":[
    {
      "name":"Using Sticky Traps",
      "steps":[
        {
          "headline":"Create your own sticky trap to be frugal.",
          "description":"A sticky trap is basically a flat object with something sticky on top of it. For instance, you can use a flat piece of cardboard with two-sided tape on top of it. You can also make a triangle tube with two-sided tape on the inside. Another option is using an insect coating specifically designed to trap insects, which is sold at garden stores."
        },
        {
          "headline":"Buy sticky traps for convenience.",
          "description":"If you don't want to take the time to create your own, you can find sticky traps to buy at hardware stores, grocery stores, and big box stores. The main difference is the convenience."
        },
        {
          "headline":"Place them near water.",
          "description":"Spiders need water just like any other animal or insect. Therefore, they must visit a water source in your house or business at some point. Try setting them in out-of-the-way places in your bathroom, such as behind the toilet, as spiders may hole up back there when people are in the room. Try using a bottle cap to hold water. Since spiders are attracted to water, setting traps with water can be effective. Simply fill a small bottle cap with water, and place your trap around it. When a spider goes towards the water, it will need to go through your trap."
        },
        {
          "headline":"Stick them in other hiding places.",
          "description":"Spiders like dark spaces where they can hide. For instance, you can try sticking a glue trap under a utility sink. You might also stick one near the water heater, since it's usually kept in a dark closet. You can also try cabinets and pantries."
        },
        {
          "headline":"Place the traps along baseboards.",
          "description":"Another good place to hide a trap is along the baseboards of your house, right up next to the wall. Spiders and insects like to walk along these edges, so you're more likely to catch spiders when you place traps there."
        },
        {
          "headline":"Try pesticide to kill the spider later.",
          "description":"Once you've set your trap, try adding some pesticide around the area. You can use a dust, for instance, so the spider picks up some of it as it runs towards the water. The spider may somehow escape the sticky part, but it will still carry some pesticide with it, which will likely kill it later."
        },
        {
          "headline":"Check and dispose of your traps.",
          "description":"Of course, you'll need to check your traps from time to time. Generally, you just pick your old traps up once they have several spiders on them and put down new ones. Be careful around any live spiders, as you don't want to be injected with venom. Use rubber gloves if possible."
        }
      ]
    },
    {
      "name":"Catching Spiders with Outdoor Traps",
      "steps":[
        {
          "headline":"Set a dry pitfall trap.",
          "description":"A pitfall trap is a jar or other container with a smooth interior surface that is set into the ground. The spider walks over it and falls in, and then it can't get out. To set one, dig a hole large enough for a jar or container, and place the jar or container in the ground. The top should be flush with the ground. Catching spiders outside is a great way to study the spiders in your area."
        },
        {
          "headline":"Add a cover.",
          "description":"You also need a cover somewhere above it to help keep birds and other predators out of it. The lid should be just far enough up to let spiders into the trap. It can be anything that provides cover and is waterproof."
        },
        {
          "headline":"Try a wet pitfall trap.",
          "description":"This trap is the same as a dry one, except you use a liquid in the trap that will kill the spider. The liquid should also preserve the spider for you to study. For instance, alcohol (rubbing or any high proof alcohol) or 10% formaldehyde are common solutions. You can purchase formaldehyde online or from laboratory supply stores."
        },
        {
          "headline":"Place the trap in areas where you know spiders roam.",
          "description":"Pitfall traps are going to catch more than just spiders, so you need to place them in an area where you know spiders frequent. You should be able to see signs of spiders, such as webs, so you know they are in the area. If you catch other bugs, you can study them or let them go."
        },
        {
          "headline":"Return to the traps.",
          "description":"Once you've set the traps, you'll need to check on them again later to see what you've caught. Try checking after a day. If you don't know the species of spider you've caught, make sure to look it up before you try moving it. You don't want to get bitten by a venomous spider. Some common venomous spiders include brown recluses, black widow spiders, Brazilian wandering spiders, and mouse spiders. If you do get bitten, make sure you get the spider bite treated."
        },
        {
          "headline":"Transfer the spider.",
          "description":"Once you've found a spider, you'll likely need to transfer it to another container. Carefully pull the trap out of the ground, using the lid to keep the spider in place. Cover the top of the container with another container, and turn it over to dump the spider into the new container. From there, you can study the spider alive or even add it to a preserved insect collection."
        }
      ]
    }
  ],
  "text":" Using Sticky Traps Create your own sticky trap to be frugal. A sticky trap is basically a flat object with something sticky on top of it. For instance, you can use a flat piece of cardboard with two-sided tape on top of it. You can also make a triangle tube with two-sided tape on the inside. Another option is using an insect coating specifically designed to trap insects, which is sold at garden stores. Buy sticky traps for convenience. If you don't want to take the time to create your own, you can find sticky traps to buy at hardware stores, grocery stores, and big box stores. The main difference is the convenience. Place them near water. Spiders need water just like any other animal or insect. Therefore, they must visit a water source in your house or business at some point. Try setting them in out-of-the-way places in your bathroom, such as behind the toilet, as spiders may hole up back there when people are in the room. Try using a bottle cap to hold water. Since spiders are attracted to water, setting traps with water can be effective. Simply fill a small bottle cap with water, and place your trap around it. When a spider goes towards the water, it will need to go through your trap. Stick them in other hiding places. Spiders like dark spaces where they can hide. For instance, you can try sticking a glue trap under a utility sink. You might also stick one near the water heater, since it's usually kept in a dark closet. You can also try cabinets and pantries. Place the traps along baseboards. Another good place to hide a trap is along the baseboards of your house, right up next to the wall. Spiders and insects like to walk along these edges, so you're more likely to catch spiders when you place traps there. Try pesticide to kill the spider later. Once you've set your trap, try adding some pesticide around the area. You can use a dust, for instance, so the spider picks up some of it as it runs towards the water. The spider may somehow escape the sticky part, but it will still carry some pesticide with it, which will likely kill it later. Check and dispose of your traps. Of course, you'll need to check your traps from time to time. Generally, you just pick your old traps up once they have several spiders on them and put down new ones. Be careful around any live spiders, as you don't want to be injected with venom. Use rubber gloves if possible. Catching Spiders with Outdoor Traps Set a dry pitfall trap. A pitfall trap is a jar or other container with a smooth interior surface that is set into the ground. The spider walks over it and falls in, and then it can't get out. To set one, dig a hole large enough for a jar or container, and place the jar or container in the ground. The top should be flush with the ground. Catching spiders outside is a great way to study the spiders in your area. Add a cover. You also need a cover somewhere above it to help keep birds and other predators out of it. The lid should be just far enough up to let spiders into the trap. It can be anything that provides cover and is waterproof. Try a wet pitfall trap. This trap is the same as a dry one, except you use a liquid in the trap that will kill the spider. The liquid should also preserve the spider for you to study. For instance, alcohol (rubbing or any high proof alcohol) or 10% formaldehyde are common solutions. You can purchase formaldehyde online or from laboratory supply stores. Place the trap in areas where you know spiders roam. Pitfall traps are going to catch more than just spiders, so you need to place them in an area where you know spiders frequent. You should be able to see signs of spiders, such as webs, so you know they are in the area. If you catch other bugs, you can study them or let them go. Return to the traps. Once you've set the traps, you'll need to check on them again later to see what you've caught. Try checking after a day. If you don't know the species of spider you've caught, make sure to look it up before you try moving it. You don't want to get bitten by a venomous spider. Some common venomous spiders include brown recluses, black widow spiders, Brazilian wandering spiders, and mouse spiders. If you do get bitten, make sure you get the spider bite treated. Transfer the spider. Once you've found a spider, you'll likely need to transfer it to another container. Carefully pull the trap out of the ground, using the lid to keep the spider in place. Cover the top of the container with another container, and turn it over to dump the spider into the new container. From there, you can study the spider alive or even add it to a preserved insect collection.",
  "tyn_model":[
    "water",
    "spiders",
    "container",
    "sticky traps",
    "pesticide",
    "jar",
    "sticky trap",
    "bottle cap",
    "formaldehyde",
    "spider",
    "two-sided tape",
    "glue trap",
    "water heater",
    "rubber gloves",
    "alcohol",
    "pitfall traps",
    "black widow spiders",
    "mouse spiders"
  ],
  "tyn_section":[

  ]
}