{
  "title":"How to Cook Cheap Meals",
  "url":"https://www.wikihow.com/Cook-Cheap-Meals",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Meal Planning"
  ],
  "methods":[
    {
      "name":"Make a Plan",
      "steps":[
        {
          "headline":"Choose meals with fewer ingredients.",
          "description":"In most cases, a dinner that involves five ingredients will cost less than one that requires ten. Search for recipes that only use a few ingredients and do not require anything too exotic."
        },
        {
          "headline":"Invest in a budget cookbook.",
          "description":"Plenty of people are interested in learning how to cook inexpensive meals, and cookbook publishers know it. Budget cookbooks can provide you with a plethora of low-cost meal ideas."
        },
        {
          "headline":"Take inventory of your stock at home.",
          "description":"Before you plan out your meals, look at the ingredients you already have at home. Comb through your spice cabinet and your pantry. If you have any product nearing its expiration date, plan a meal that will allow you to use it. Likewise, if you have an excess amount of any given product, plan a meal using that, as well."
        },
        {
          "headline":"Start a garden.",
          "description":"You can grow a number of herbs, vegetables, and fruits even with limited space. If you plan on cooking budget meals for a long time, starting a garden now is a good way to save on produce costs later on."
        },
        {
          "headline":"Make a detailed list.",
          "description":"Once you decide on your meals for the week, make a detailed list of everything you need. Mark down every ingredient you do not already have in your pantry, and jot down sizes and quantities as applicable. Do not go shopping without a list, since you may forget some items or walk away with something you do not need."
        },
        {
          "headline":"Clip coupons.",
          "description":"Look through junk mail, magazines, and online for coupons that offer you savings on the products you need. Be careful about what coupons you use, though. Some brands may cost more than others even with a coupon. Always compare prices instead of assuming that the product with a coupon offers the best bargain."
        },
        {
          "headline":"Shop sales.",
          "description":"Most chain grocery stores have weekly sales. Many stores have pamphlets that they send out via mail or keep inside the store. Flip through these sale pamphlets to learn what products are on sale this week and plan meals that could use those products."
        },
        {
          "headline":"Buy in bulk.",
          "description":"If there is a certain product you cook with frequently, such as vegetable oil or salt, consider buying large quantities of it to save on the cost per serving. Compare prices of the bulk amount with the smaller amount to ensure that you receive a bargain. Also make sure to only buy bulk products you can actually use before the expiration date."
        }
      ]
    },
    {
      "name":"Use the Right Ingredients",
      "steps":[
        {
          "headline":"Buy store brands.",
          "description":"More often than not, the generic store brand of any given product costs less than the name brand, even though the two products are virtually identical."
        },
        {
          "headline":"Purchase produce in season.",
          "description":"Fruits and vegetables that are in season are priced to sell, so they cost less than produce not in season. For instance, corn-on-the-cob can cost up to ten times more out of season than it does during the summer months, when it is in season."
        },
        {
          "headline":"Go with frozen or canned produce.",
          "description":"Frozen and canned products cost less than their fresh counterparts and are usually just as nutritious. In fact, since these products are picked at the peak of ripeness, they may even contain more nutrients than partially ripe fresh produce. Go with frozen produce for the healthiest option, since it usually contains fewer preservatives than canned foods."
        },
        {
          "headline":"Use canned fish instead of fresh.",
          "description":"Fresh seafood can be very expensive. By comparison, canned tuna and salmon are quite cheap, and they also contain high amounts of protein and helpful omega-3 fatty acids."
        },
        {
          "headline":"Buy whole chicken or bone-in chicken instead of boneless.",
          "description":"Boneless, skinless chicken breasts are convenient to prepare, but this convenience will cost you extra. Bone-in pieces and whole chickens will save you on cost per serving. You can even remove the bones before you cook the chicken and save them to make stock later on."
        },
        {
          "headline":"Opt for tougher cuts of meat.",
          "description":"Tougher cuts of meat, like beef chuck roasts and pork shoulders, cost less than tender cuts. Slow cooking these meats using low heat can make them just as delectable, though. Try preparing a stew or slow-cooker meal using these cuts."
        },
        {
          "headline":"Cook with cheaper forms of protein, like eggs and beans.",
          "description":"In general, meat can be rather expensive. Eggs and beans are both healthy alternatives that offer high levels of protein at significantly cheaper prices."
        },
        {
          "headline":"Get more out of your meal by using rice or pasta.",
          "description":"Both products are already fairly cheap. Moreover, they can usually be bought cheaper in bulk and have extended expiration dates. Enhance stews and stir-fries with pasta or rice, or prepare them for a simple side dish."
        }
      ]
    }
  ],
  "text":" Make a Plan Choose meals with fewer ingredients. In most cases, a dinner that involves five ingredients will cost less than one that requires ten. Search for recipes that only use a few ingredients and do not require anything too exotic. Invest in a budget cookbook. Plenty of people are interested in learning how to cook inexpensive meals, and cookbook publishers know it. Budget cookbooks can provide you with a plethora of low-cost meal ideas. Take inventory of your stock at home. Before you plan out your meals, look at the ingredients you already have at home. Comb through your spice cabinet and your pantry. If you have any product nearing its expiration date, plan a meal that will allow you to use it. Likewise, if you have an excess amount of any given product, plan a meal using that, as well. Start a garden. You can grow a number of herbs, vegetables, and fruits even with limited space. If you plan on cooking budget meals for a long time, starting a garden now is a good way to save on produce costs later on. Make a detailed list. Once you decide on your meals for the week, make a detailed list of everything you need. Mark down every ingredient you do not already have in your pantry, and jot down sizes and quantities as applicable. Do not go shopping without a list, since you may forget some items or walk away with something you do not need. Clip coupons. Look through junk mail, magazines, and online for coupons that offer you savings on the products you need. Be careful about what coupons you use, though. Some brands may cost more than others even with a coupon. Always compare prices instead of assuming that the product with a coupon offers the best bargain. Shop sales. Most chain grocery stores have weekly sales. Many stores have pamphlets that they send out via mail or keep inside the store. Flip through these sale pamphlets to learn what products are on sale this week and plan meals that could use those products. Buy in bulk. If there is a certain product you cook with frequently, such as vegetable oil or salt, consider buying large quantities of it to save on the cost per serving. Compare prices of the bulk amount with the smaller amount to ensure that you receive a bargain. Also make sure to only buy bulk products you can actually use before the expiration date. Use the Right Ingredients Buy store brands. More often than not, the generic store brand of any given product costs less than the name brand, even though the two products are virtually identical. Purchase produce in season. Fruits and vegetables that are in season are priced to sell, so they cost less than produce not in season. For instance, corn-on-the-cob can cost up to ten times more out of season than it does during the summer months, when it is in season. Go with frozen or canned produce. Frozen and canned products cost less than their fresh counterparts and are usually just as nutritious. In fact, since these products are picked at the peak of ripeness, they may even contain more nutrients than partially ripe fresh produce. Go with frozen produce for the healthiest option, since it usually contains fewer preservatives than canned foods. Use canned fish instead of fresh. Fresh seafood can be very expensive. By comparison, canned tuna and salmon are quite cheap, and they also contain high amounts of protein and helpful omega-3 fatty acids. Buy whole chicken or bone-in chicken instead of boneless. Boneless, skinless chicken breasts are convenient to prepare, but this convenience will cost you extra. Bone-in pieces and whole chickens will save you on cost per serving. You can even remove the bones before you cook the chicken and save them to make stock later on. Opt for tougher cuts of meat. Tougher cuts of meat, like beef chuck roasts and pork shoulders, cost less than tender cuts. Slow cooking these meats using low heat can make them just as delectable, though. Try preparing a stew or slow-cooker meal using these cuts. Cook with cheaper forms of protein, like eggs and beans. In general, meat can be rather expensive. Eggs and beans are both healthy alternatives that offer high levels of protein at significantly cheaper prices. Get more out of your meal by using rice or pasta. Both products are already fairly cheap. Moreover, they can usually be bought cheaper in bulk and have extended expiration dates. Enhance stews and stir-fries with pasta or rice, or prepare them for a simple side dish.",
  "tyn_model":[
    "produce",
    "chicken",
    "garden",
    "vegetables",
    "eggs",
    "beans",
    "rice",
    "pasta",
    "cookbook publishers",
    "spice cabinet",
    "herbs",
    "coupons",
    "vegetable oil",
    "salt",
    "corn",
    "fish",
    "seafood",
    "tuna",
    "salmon",
    "chickens",
    "beef chuck roasts",
    "meat"
  ],
  "tyn_section":[

  ]
}