{
  "title":"How to Design a Photography Studio",
  "url":"https://www.wikihow.com/Design-a-Photography-Studio",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography"
  ],
  "steps":[
    {
      "headline":"Survey the space you are going to create your studio in.",
      "description":"Know what your dimensions are and plan accordingly. You will want the maximum usefulness out of the space you are working with. This may mean more storage overhead or in other areas."
    },
    {
      "headline":"Know what you will be using it for, and take into consideration, future changes to it.",
      "description":"For example, are you going to be needing just one room and a door...or do you need a studio, an office, a computer area, etc. Some photographic options are still life, macro photography, portraits, etc."
    },
    {
      "headline":"Add that to your 'sketch'.",
      "description":"You have exterior walls (about 10 inches thick), interior walls (if required), and doors."
    },
    {
      "headline":"Take into consideration any access (ADA) laws.",
      "description":"This will affect any commercial photography operation, more than a private at-home photographer."
    },
    {
      "headline":"Decide what will go where within the space so that you have room to shoot your subject and yet still space for storage, moving around and comfort..",
      "description":"Take into consideration the ambient sunlight that comes in any particular window. This may be of great concern for natural light photographers. Windows facing north are the best for this as they will gather vast amounts of light but no direct sun to cast harsh shadows. Plan in very strong electrical systems as you will be drawing more power from your electrical panel that you think. Hire a trained electrician for all work to ensure it is done up to local building codes."
    },
    {
      "headline":"Design in, and for, any work platforms that you need.",
      "description":""
    },
    {
      "headline":"Put some thought as to any decor that you will want.",
      "description":"This may affect window coverings, hung artwork, refreshment area and seating for your guests. All these areas will have an affect on your client's emotional state as they take photos with you. Happier clients equal higher sales."
    }
  ],
  "text":" Survey the space you are going to create your studio in. Know what your dimensions are and plan accordingly. You will want the maximum usefulness out of the space you are working with. This may mean more storage overhead or in other areas. Know what you will be using it for, and take into consideration, future changes to it. For example, are you going to be needing just one room and a door...or do you need a studio, an office, a computer area, etc. Some photographic options are still life, macro photography, portraits, etc. Add that to your 'sketch'. You have exterior walls (about 10 inches thick), interior walls (if required), and doors. Take into consideration any access (ADA) laws. This will affect any commercial photography operation, more than a private at-home photographer. Decide what will go where within the space so that you have room to shoot your subject and yet still space for storage, moving around and comfort.. Take into consideration the ambient sunlight that comes in any particular window. This may be of great concern for natural light photographers. Windows facing north are the best for this as they will gather vast amounts of light but no direct sun to cast harsh shadows. Plan in very strong electrical systems as you will be drawing more power from your electrical panel that you think. Hire a trained electrician for all work to ensure it is done up to local building codes. Design in, and for, any work platforms that you need.  Put some thought as to any decor that you will want. This may affect window coverings, hung artwork, refreshment area and seating for your guests. All these areas will have an affect on your client's emotional state as they take photos with you. Happier clients equal higher sales.",
  "tyn_model":[
    "natural light photographers"
  ],
  "tyn_section":[

  ]
}