{
  "title":"How to Make Chicken Tortilla Soup With Avocado",
  "url":"https://www.wikihow.com/Make-Chicken-Tortilla-Soup-With-Avocado",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "steps":[
    {
      "headline":"Heat 1-2 Tbs olive oil and sauté the onion and red pepper (unless you have roasted red bell pepper) until the onion is translucent and soft.",
      "description":"This should take around five minutes."
    },
    {
      "headline":"Add the tomatoes (and chopped frozen, roasted red bell pepper, if you're using that) and continue sauteing for another five minutes.",
      "description":""
    },
    {
      "headline":"Add the chicken or turkey broth, the wine or vermouth and the lime (if you're using that).",
      "description":""
    },
    {
      "headline":"Bring the soup to the boil, then reduce the heat and simmer for around 20 minutes.",
      "description":""
    },
    {
      "headline":"While the soup is simmering, cut the tortillas into 1/8ths, (as triangles) and fry these in hot oil until they're crispy and light tan in colour.",
      "description":"Drain on paper towels once cooked."
    },
    {
      "headline":"Shred or grate the cheeses or cheese you have chosen.",
      "description":""
    },
    {
      "headline":"Slice the avocado and then rinse the slices in cold water, to prevent them from blackening.",
      "description":"This method works for several hours."
    },
    {
      "headline":"After the simmering period, add the chunks of cooked chicken or turkey meat to the soup along with the green chiles and then season with salt and pepper to taste.",
      "description":""
    },
    {
      "headline":"Bring the soup back to the boil and then simmer another 3-5 minutes.",
      "description":""
    },
    {
      "headline":"Serve the soup.",
      "description":"For each bowl of soup pile some tortilla chips, shredded cheese & avocado slices in the bottom of a soup bowl add soup."
    },
    {
      "headline":"Serve with sour cream and salsa.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Heat 1-2 Tbs olive oil and sauté the onion and red pepper (unless you have roasted red bell pepper) until the onion is translucent and soft. This should take around five minutes. Add the tomatoes (and chopped frozen, roasted red bell pepper, if you're using that) and continue sauteing for another five minutes.  Add the chicken or turkey broth, the wine or vermouth and the lime (if you're using that).  Bring the soup to the boil, then reduce the heat and simmer for around 20 minutes.  While the soup is simmering, cut the tortillas into 1/8ths, (as triangles) and fry these in hot oil until they're crispy and light tan in colour. Drain on paper towels once cooked. Shred or grate the cheeses or cheese you have chosen.  Slice the avocado and then rinse the slices in cold water, to prevent them from blackening. This method works for several hours. After the simmering period, add the chunks of cooked chicken or turkey meat to the soup along with the green chiles and then season with salt and pepper to taste.  Bring the soup back to the boil and then simmer another 3-5 minutes.  Serve the soup. For each bowl of soup pile some tortilla chips, shredded cheese & avocado slices in the bottom of a soup bowl add soup. Serve with sour cream and salsa.  Finished. ",
  "tyn_model":[
    "red bell pepper",
    "avocado",
    "olive oil",
    "onion",
    "red pepper",
    "tomatoes",
    "chicken or turkey broth",
    "wine",
    "vermouth",
    "lime",
    "tortillas",
    "hot oil",
    "paper towels",
    "water",
    "green chiles",
    "salt and pepper",
    "tortilla chips",
    "soup bowl",
    "sour cream",
    "salsa"
  ],
  "tyn_section":[

  ]
}