{
  "title":"How to Cook With Tarragon",
  "url":"https://www.wikihow.com/Cook-With-Tarragon",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices",
    "Spice Mixes"
  ],
  "methods":[
    {
      "name":"Use Fresh Tarragon",
      "steps":[
        {
          "headline":"Cut the tarragon.",
          "description":"Cut young, tender stems with small leaves from the tarragon plant with a pair of garden scissors."
        },
        {
          "headline":"Clean the tarragon.",
          "description":"Rinse the tarragon stems under cool, clean running water."
        },
        {
          "headline":"Prepare the tarragon.",
          "description":"Use whole or chopped tarragon as called for in your recipe. Leaves and tender stems can be chopped together."
        },
        {
          "headline":"Store excess tarragon.",
          "description":"Store whole sprigs of tarragon in a glass of water (like cut flowers) in the refrigerator for up to 3 days."
        }
      ]
    },
    {
      "name":"Dried Tarragon",
      "steps":[
        {
          "headline":"Purchase fresh tarragon.",
          "description":"Just because it's dry doesn't mean it can't go bad! Be sure to check the expiration date on dried tarragon you purchase."
        },
        {
          "headline":"Dry your own tarragon.",
          "description":"If you have excess fresh tarragon or don't want to buy already dry tarragon, consider drying your own:\nCut young but mature stems off a tarragon plant with garden snips. Cut in the morning after the dew has dried. Band several stems of tarragon together with rubber bands. Hang bundles in a dry, warm place to dry. Carefully remove dried tarragon stems when they are crispy to the touch. Crumble the leaves and stems to fine pieces."
        },
        {
          "headline":"Store excess.",
          "description":"Store dried tarragon in a cool, dark place in a tightly closed container."
        }
      ]
    },
    {
      "name":"Recipe Ideas for Tarragon",
      "steps":[
        {
          "headline":"Make bouquet garni.",
          "description":"Combine 1 tablespoon of chopped leaves from these herbs, sage, rosemary, thyme, tarragon and marjoram. Use in a spice ball or tie in cheesecloth to season soups, sauces and stews."
        },
        {
          "headline":"Make tarragon vinegar.",
          "description":"Add a few stems of fresh tarragon to a container of good vinegar and tightly close the container. Make sure the stems are completely under the vinegar at all times. After a month, remove the stems by pouring the vinegar through a strainer. Save the flavored vinegar in a tightly closed bottle in the refrigerator. Use in salad dressings."
        },
        {
          "headline":"Make tarragon sauce.",
          "description":"Tarragon sauce is great on cooked chicken and/or chicken salad. Mix together 1 tablespoon chopped fresh tarragon with 4 tablespoons butter, 1/4 teaspoon white pepper and 1/4 teaspoon salt and 2 cups of chicken broth. Simmer the mixture on low heat for 30 minutes. Remove 1 cup of the fluid from the pot and pour it through a strainer into a small pan. Keep warm. Beat 2 egg yolks with 1 cup of cream and 1 tablespoon chopped fresh tarragon in a bowl. Add 2 tablespoons of the warm fluid to the egg mixture and blend well. Pour the cream mixture into the warm fluid in the pan and cook on low heat, stirring constantly until thickened."
        },
        {
          "headline":"Season baked chicken.",
          "description":"Lightly coat a whole chicken or chicken pieces with oil or melted butter. Then, sprinkle on chopped fresh tarragon, rosemary and marjoram with salt and pepper to suit your taste before baking the chicken."
        },
        {
          "headline":"Season sweet corn.",
          "description":"Add 1 tablespoon of chopped fresh tarragon to the water used to boil sweet corn."
        },
        {
          "headline":"Make tarragon spread.",
          "description":"Combine 12 oz. crumbled feta cheese with 2 tablespoons chopped fresh tarragon, 2 tablespoons chopped chives 1/4 teaspoon salt, 1/4 teaspoon red pepper and 1/4 cup olive oil in a food processor and blend until smooth. Let sit at room temperature for 1 hour to blend flavors. Serve on pita pieces or crackers."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Use Fresh Tarragon Cut the tarragon. Cut young, tender stems with small leaves from the tarragon plant with a pair of garden scissors. Clean the tarragon. Rinse the tarragon stems under cool, clean running water. Prepare the tarragon. Use whole or chopped tarragon as called for in your recipe. Leaves and tender stems can be chopped together. Store excess tarragon. Store whole sprigs of tarragon in a glass of water (like cut flowers) in the refrigerator for up to 3 days. Dried Tarragon Purchase fresh tarragon. Just because it's dry doesn't mean it can't go bad! Be sure to check the expiration date on dried tarragon you purchase. Dry your own tarragon. If you have excess fresh tarragon or don't want to buy already dry tarragon, consider drying your own:\nCut young but mature stems off a tarragon plant with garden snips. Cut in the morning after the dew has dried. Band several stems of tarragon together with rubber bands. Hang bundles in a dry, warm place to dry. Carefully remove dried tarragon stems when they are crispy to the touch. Crumble the leaves and stems to fine pieces. Store excess. Store dried tarragon in a cool, dark place in a tightly closed container. Recipe Ideas for Tarragon Make bouquet garni. Combine 1 tablespoon of chopped leaves from these herbs, sage, rosemary, thyme, tarragon and marjoram. Use in a spice ball or tie in cheesecloth to season soups, sauces and stews. Make tarragon vinegar. Add a few stems of fresh tarragon to a container of good vinegar and tightly close the container. Make sure the stems are completely under the vinegar at all times. After a month, remove the stems by pouring the vinegar through a strainer. Save the flavored vinegar in a tightly closed bottle in the refrigerator. Use in salad dressings. Make tarragon sauce. Tarragon sauce is great on cooked chicken and/or chicken salad. Mix together 1 tablespoon chopped fresh tarragon with 4 tablespoons butter, 1/4 teaspoon white pepper and 1/4 teaspoon salt and 2 cups of chicken broth. Simmer the mixture on low heat for 30 minutes. Remove 1 cup of the fluid from the pot and pour it through a strainer into a small pan. Keep warm. Beat 2 egg yolks with 1 cup of cream and 1 tablespoon chopped fresh tarragon in a bowl. Add 2 tablespoons of the warm fluid to the egg mixture and blend well. Pour the cream mixture into the warm fluid in the pan and cook on low heat, stirring constantly until thickened. Season baked chicken. Lightly coat a whole chicken or chicken pieces with oil or melted butter. Then, sprinkle on chopped fresh tarragon, rosemary and marjoram with salt and pepper to suit your taste before baking the chicken. Season sweet corn. Add 1 tablespoon of chopped fresh tarragon to the water used to boil sweet corn. Make tarragon spread. Combine 12 oz. crumbled feta cheese with 2 tablespoons chopped fresh tarragon, 2 tablespoons chopped chives 1/4 teaspoon salt, 1/4 teaspoon red pepper and 1/4 cup olive oil in a food processor and blend until smooth. Let sit at room temperature for 1 hour to blend flavors. Serve on pita pieces or crackers. Finished. ",
  "tyn_model":[
    "tarragon",
    "vinegar",
    "water",
    "rosemary",
    "marjoram",
    "strainer",
    "tarragon sauce",
    "butter",
    "salt",
    "cream",
    "sweet corn",
    "garden scissors",
    "refrigerator",
    "tarragon plant",
    "garden snips",
    "rubber bands",
    "herbs",
    "sage",
    "thyme",
    "cheesecloth",
    "tarragon vinegar",
    "salad dressings",
    "chicken salad",
    "white pepper",
    "chicken broth",
    "pot",
    "small pan",
    "egg yolks",
    "bowl",
    "egg",
    "oil",
    "salt and pepper",
    "feta cheese",
    "chives",
    "red pepper",
    "olive oil",
    "food processor",
    "pita pieces"
  ],
  "tyn_section":[

  ]
}