{
  "title":"How to Use Marjoram",
  "url":"https://www.wikihow.com/Use-Marjoram",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices",
    "Preserving Herbs"
  ],
  "methods":[
    {
      "name":"Use Fresh Marjoram",
      "steps":[
        {
          "headline":"Choose your Marjoram.",
          "description":"For best results, choose young, tender, growing stems of marjoram with small leaves."
        },
        {
          "headline":"Snip off the stems with scissors.",
          "description":""
        },
        {
          "headline":"Clean the marjoram.",
          "description":"Wash the marjoram under cold, clean, running water."
        },
        {
          "headline":"Separate the leaves and stems.",
          "description":"Remove the leaves from the stems with your fingers. Discard the stems."
        },
        {
          "headline":"Chop the leaves.",
          "description":"Chop the leaves with a sharp knife."
        },
        {
          "headline":"Add marjoram to your cooking.",
          "description":"For best taste, you should add fresh marjoram to your dish near the end of cooking."
        },
        {
          "headline":"Store any excess Marjoram.",
          "description":"Store fresh marjoram in a glass of water in the refrigerator for up to 3 days. Change the water each day."
        }
      ]
    },
    {
      "name":"Use Dried Marjoram",
      "steps":[
        {
          "headline":"Purchase fresh marjoram.",
          "description":"Just because it's dry doesn't mean it can't go bad! Be sure to check the expiration date on dried marjoram you purchase."
        },
        {
          "headline":"Add dried marjoram to your cooking.",
          "description":"Unlike fresh, you should add dried marjoram at the beginning of the recipe unless explicitly directed otherwise. Use less dried marjoram than fresh, as the flavor is stronger."
        },
        {
          "headline":"Store any excess Marjoram.",
          "description":"Store dried marjoram in a tightly closed container in a cool, dark place. Use home dried marjoram within one year."
        }
      ]
    },
    {
      "name":"Ideas for Using Marjoram",
      "steps":[
        {
          "headline":"Make a rub for your roast chicken.",
          "description":"Use 1/4 teaspoon each of dried marjoram, sage, rosemary, thyme and pepper combined with 1/2 cup coarse sea salt."
        },
        {
          "headline":"Season beef stew.",
          "description":"Add 2 tablespoons of chopped fresh marjoram near the end of the cooking time."
        },
        {
          "headline":"Add flavor to cooked and sautéed vegetables.",
          "description":"Combine 1 teaspoon of diced fresh marjoram with 3 tablespoons of melted butter. This is also delicious when used to baste steak."
        },
        {
          "headline":"Make a marinade for beef/pork strips or stir fry.",
          "description":"Combine 1/4 teaspoon dried marjoram, 1 tablespoon grated ginger, 2 cloves of minced garlic, 3 tablespoons teriyaki sauce and 1 cup of beef broth."
        },
        {
          "headline":"Spice up bean salad.",
          "description":"Add 1 teaspoon diced fresh marjoram."
        },
        {
          "headline":"Add flavor to sausage.",
          "description":"Add 1/4 to 1/2 teaspoon dried marjoram to any sausage recipe."
        }
      ]
    }
  ],
  "text":" Use Fresh Marjoram Choose your Marjoram. For best results, choose young, tender, growing stems of marjoram with small leaves. Snip off the stems with scissors.  Clean the marjoram. Wash the marjoram under cold, clean, running water. Separate the leaves and stems. Remove the leaves from the stems with your fingers. Discard the stems. Chop the leaves. Chop the leaves with a sharp knife. Add marjoram to your cooking. For best taste, you should add fresh marjoram to your dish near the end of cooking. Store any excess Marjoram. Store fresh marjoram in a glass of water in the refrigerator for up to 3 days. Change the water each day. Use Dried Marjoram Purchase fresh marjoram. Just because it's dry doesn't mean it can't go bad! Be sure to check the expiration date on dried marjoram you purchase. Add dried marjoram to your cooking. Unlike fresh, you should add dried marjoram at the beginning of the recipe unless explicitly directed otherwise. Use less dried marjoram than fresh, as the flavor is stronger. Store any excess Marjoram. Store dried marjoram in a tightly closed container in a cool, dark place. Use home dried marjoram within one year. Ideas for Using Marjoram Make a rub for your roast chicken. Use 1/4 teaspoon each of dried marjoram, sage, rosemary, thyme and pepper combined with 1/2 cup coarse sea salt. Season beef stew. Add 2 tablespoons of chopped fresh marjoram near the end of the cooking time. Add flavor to cooked and sautéed vegetables. Combine 1 teaspoon of diced fresh marjoram with 3 tablespoons of melted butter. This is also delicious when used to baste steak. Make a marinade for beef/pork strips or stir fry. Combine 1/4 teaspoon dried marjoram, 1 tablespoon grated ginger, 2 cloves of minced garlic, 3 tablespoons teriyaki sauce and 1 cup of beef broth. Spice up bean salad. Add 1 teaspoon diced fresh marjoram. Add flavor to sausage. Add 1/4 to 1/2 teaspoon dried marjoram to any sausage recipe.",
  "tyn_model":[
    "marjoram",
    "water",
    "fresh marjoram",
    "scissors",
    "knife",
    "refrigerator",
    "sage",
    "rosemary",
    "thyme",
    "pepper",
    "coarse sea salt",
    "melted butter",
    "dried marjoram",
    "ginger",
    "garlic",
    "teriyaki sauce",
    "beef broth"
  ],
  "tyn_section":[

  ]
}