{
  "title":"How to Control Aphids",
  "url":"https://www.wikihow.com/Control-Aphids",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Pests and Weeds"
  ],
  "methods":[
    {
      "name":"Finding a Fix Using Household Items",
      "steps":[
        {
          "headline":"Spray the plants with a strong stream of water.",
          "description":"Use a hose to spray the plants affected by aphids with cold water—this should knock the aphids right off. A hard rainstorm can also wash the aphids off of the plant. While you want there to be water pressure, make sure you don’t damage the plants by setting the pressure too high. Repeat as needed to remove aphids when they crop up."
        },
        {
          "headline":"Remove the aphids using your hands.",
          "description":"If you see a cluster of aphids on a plant, you can swipe them off using your fingers. When you brush the aphids off, drop them into a soapy bucket of water to kill them. If the aphids have infested an entire leaf or stem, snip off the section using scissors or pruning shears and drop it in the soapy bucket of water. Wear gloves to protect your hands."
        },
        {
          "headline":"Dust the plants with flour to help deal with an aphid invasion.",
          "description":"Take a cupful of flour from your pantry or kitchen and bring it out to your garden. Use your hands to evenly sprinkle the plants affected by aphids, giving them a fine layer of flour. You don't have to coat the entire plant in flour, just the spot where the aphids are gathering. Ingesting the flour will constipate the aphids."
        },
        {
          "headline":"Wipe the plants down with a mild soap and water.",
          "description":"Mix together a few drops of a mild dish detergent with a cup of water. Dip a rag or paper towel into the mixture, using it to gently wipe down the stem and leaves of the plant affected by the aphids. Make sure you wipe both sides of the leaves."
        }
      ]
    },
    {
      "name":"Enlisting Predators and Traps",
      "steps":[
        {
          "headline":"Attract beneficial insects that will eat the aphids.",
          "description":"By growing herbs such as mint, dill, or clover, you’ll attract ladybugs and lacewings. Both of these insects are known for eating aphids, which will help decrease the number you have eating your plants. You can also purchase ladybugs or lacewings from a farming supplier to release in your yard, if desired."
        },
        {
          "headline":"Draw in bug-eating birds to help fix the problem.",
          "description":"Wrens, titmice, and chickadees are all helpful when it comes to eating aphids. To encourage these birds to live near your yard, plant shrubs with dense foliage or small trees perfect for nesting. You can also set up a bird feeder to help attract the birds. Install small birdhouses for the birds to live in as an alternative to planting shrubs or trees."
        },
        {
          "headline":"Stop ants from helping out aphids.",
          "description":"Ants and aphids are mutually beneficial to each other, as aphids help provide food for ants. If you see an ant colony or lots of ants near your aphid-infested plants, try to get rid of the ants by using a sticky band wrapped around a tree or other type of ant trap. Ants and aphids have a symbiotic relationship. The ants protect the aphids from predators and the aphids produce a sugary fluid the ants eat. You can also use vinegar, lemon juice, or cinnamon to help keep ants from creeping too close to your plants."
        },
        {
          "headline":"Buy a sticky trap to catch the aphids.",
          "description":"These yellow traps catch aphids using their sticky surface—just hang them on a branch or position them next to your plants. You can buy sticky traps from a home and garden store, as well as online."
        },
        {
          "headline":"Use plants that aphids love to lure them away from other plants.",
          "description":"Grow plants that attract aphids, like asters or cosmos, planting them away from the plants you want to protect. The aphids will be drawn to these plants and will stay away from less appetizing plants as a result. Aphids also like dahlias, larkspur, and zinnias. These decoy plants are a bit like a sacrifice to the aphids in your garden. The aphids will concentrate on them, so avoid becoming too attached. Not controlling aphids will only lead to an increase in their numbers, eventually leading to their spread to other plants. You will still need to police their numbers on your decoy plants. How far away you plant the trap plants will depend on the specific type of plant and how much room it needs to grow. Start with at least a distance of 2 feet (24 in)."
        }
      ]
    },
    {
      "name":"Using Sprays",
      "steps":[
        {
          "headline":"Mix together essential oils to use on the plants.",
          "description":"Combine peppermint, rosemary, thyme, and clove oils in a bowl or cup, using 4-5 drops of each one. Pour the mixture into a spray bottle with water in it before shaking it all together. Spray the water and oil mixture onto plants that aphids have been eating. Designate 1 spray bottle as your essential oil sprayer. The oils tend to perfume and permeate the plastic, making them less than ideal for other uses going forward."
        },
        {
          "headline":"Create a homemade garlic spray to use on the aphids.",
          "description":"Do this by chopping up 3-4 cloves of garlic before mixing them with 2 teaspoons (9.9 ml) of mineral oil. Leave the mixture alone for 24 hours before straining out the garlic chunks. Pour the mixture into a spray bottle with 16 ounces (450 g) of regular water and 1 teaspoon (4.9 ml) of dish soap before spraying the garlic concoction onto the plants. You can also make a tomato leaf spray to use on the plants."
        },
        {
          "headline":"Spray neem oil onto plants affected by aphids.",
          "description":"By mixing neem oil with a little bit of water, you’ll create an organic concoction that helps repel aphids. Pour the water and neem oil into a spray bottle and apply it to sections of the plant that are affected by aphids. Find neem oil at a home and garden store, some big box stores, or online. Note that neem oil will perfume any sprayers for a long time. It’s best to designate a particular bottle for this use. You can also use horticultural oil to spray onto the plants."
        },
        {
          "headline":"Enlist an insecticidal soap to help control aphids.",
          "description":"These soaps can be bought from a gardening supplier or online. Read the instructions to find out how much of the soap to mix with water before spraying it on the plants to help fend off aphids. These soaps are designed to kill the aphids. Insecticidal soaps are less toxic to mammals (humans and pets) than chemical insecticides. That said, follow the manufacturer’s directions about any safety precautions or gear you should wear when using them."
        }
      ]
    }
  ],
  "text":" Finding a Fix Using Household Items Spray the plants with a strong stream of water. Use a hose to spray the plants affected by aphids with cold water—this should knock the aphids right off. A hard rainstorm can also wash the aphids off of the plant. While you want there to be water pressure, make sure you don’t damage the plants by setting the pressure too high. Repeat as needed to remove aphids when they crop up. Remove the aphids using your hands. If you see a cluster of aphids on a plant, you can swipe them off using your fingers. When you brush the aphids off, drop them into a soapy bucket of water to kill them. If the aphids have infested an entire leaf or stem, snip off the section using scissors or pruning shears and drop it in the soapy bucket of water. Wear gloves to protect your hands. Dust the plants with flour to help deal with an aphid invasion. Take a cupful of flour from your pantry or kitchen and bring it out to your garden. Use your hands to evenly sprinkle the plants affected by aphids, giving them a fine layer of flour. You don't have to coat the entire plant in flour, just the spot where the aphids are gathering. Ingesting the flour will constipate the aphids. Wipe the plants down with a mild soap and water. Mix together a few drops of a mild dish detergent with a cup of water. Dip a rag or paper towel into the mixture, using it to gently wipe down the stem and leaves of the plant affected by the aphids. Make sure you wipe both sides of the leaves. Enlisting Predators and Traps Attract beneficial insects that will eat the aphids. By growing herbs such as mint, dill, or clover, you’ll attract ladybugs and lacewings. Both of these insects are known for eating aphids, which will help decrease the number you have eating your plants. You can also purchase ladybugs or lacewings from a farming supplier to release in your yard, if desired. Draw in bug-eating birds to help fix the problem. Wrens, titmice, and chickadees are all helpful when it comes to eating aphids. To encourage these birds to live near your yard, plant shrubs with dense foliage or small trees perfect for nesting. You can also set up a bird feeder to help attract the birds. Install small birdhouses for the birds to live in as an alternative to planting shrubs or trees. Stop ants from helping out aphids. Ants and aphids are mutually beneficial to each other, as aphids help provide food for ants. If you see an ant colony or lots of ants near your aphid-infested plants, try to get rid of the ants by using a sticky band wrapped around a tree or other type of ant trap. Ants and aphids have a symbiotic relationship. The ants protect the aphids from predators and the aphids produce a sugary fluid the ants eat. You can also use vinegar, lemon juice, or cinnamon to help keep ants from creeping too close to your plants. Buy a sticky trap to catch the aphids. These yellow traps catch aphids using their sticky surface—just hang them on a branch or position them next to your plants. You can buy sticky traps from a home and garden store, as well as online. Use plants that aphids love to lure them away from other plants. Grow plants that attract aphids, like asters or cosmos, planting them away from the plants you want to protect. The aphids will be drawn to these plants and will stay away from less appetizing plants as a result. Aphids also like dahlias, larkspur, and zinnias. These decoy plants are a bit like a sacrifice to the aphids in your garden. The aphids will concentrate on them, so avoid becoming too attached. Not controlling aphids will only lead to an increase in their numbers, eventually leading to their spread to other plants. You will still need to police their numbers on your decoy plants. How far away you plant the trap plants will depend on the specific type of plant and how much room it needs to grow. Start with at least a distance of 2 feet (24 in). Using Sprays Mix together essential oils to use on the plants. Combine peppermint, rosemary, thyme, and clove oils in a bowl or cup, using 4-5 drops of each one. Pour the mixture into a spray bottle with water in it before shaking it all together. Spray the water and oil mixture onto plants that aphids have been eating. Designate 1 spray bottle as your essential oil sprayer. The oils tend to perfume and permeate the plastic, making them less than ideal for other uses going forward. Create a homemade garlic spray to use on the aphids. Do this by chopping up 3-4 cloves of garlic before mixing them with 2 teaspoons (9.9 ml) of mineral oil. Leave the mixture alone for 24 hours before straining out the garlic chunks. Pour the mixture into a spray bottle with 16 ounces (450 g) of regular water and 1 teaspoon (4.9 ml) of dish soap before spraying the garlic concoction onto the plants. You can also make a tomato leaf spray to use on the plants. Spray neem oil onto plants affected by aphids. By mixing neem oil with a little bit of water, you’ll create an organic concoction that helps repel aphids. Pour the water and neem oil into a spray bottle and apply it to sections of the plant that are affected by aphids. Find neem oil at a home and garden store, some big box stores, or online. Note that neem oil will perfume any sprayers for a long time. It’s best to designate a particular bottle for this use. You can also use horticultural oil to spray onto the plants. Enlist an insecticidal soap to help control aphids. These soaps can be bought from a gardening supplier or online. Read the instructions to find out how much of the soap to mix with water before spraying it on the plants to help fend off aphids. These soaps are designed to kill the aphids. Insecticidal soaps are less toxic to mammals (humans and pets) than chemical insecticides. That said, follow the manufacturer’s directions about any safety precautions or gear you should wear when using them.",
  "tyn_model":[
    "water",
    "aphids",
    "flour",
    "neem oil",
    "ants",
    "spray bottle",
    "garlic",
    "ladybugs",
    "soaps",
    "hose",
    "—this",
    "pruning shears",
    "mild soap",
    "mild dish detergent",
    "rag",
    "paper towel",
    "herbs",
    "bird feeder",
    "sticky band",
    "ant trap",
    "vinegar",
    "lemon juice",
    "cinnamon",
    "sticky trap",
    "—just",
    "sticky traps",
    "cosmos",
    "dahlias",
    "zinnias",
    "essential oils",
    "clove oils",
    "bowl",
    "essential oil sprayer",
    "garlic spray",
    "mineral oil",
    "regular water",
    "dish soap",
    "horticultural oil",
    "insecticidal soap",
    "soap",
    "insecticidal soaps"
  ],
  "tyn_section":[

  ]
}