{
  "title":"How to Unscrew a Screw Without a Screwdriver",
  "url":"https://www.wikihow.com/Unscrew-a-Screw-Without-a-Screwdriver",
  "category_hierarchy":[
    "Home and Garden",
    "Tools",
    "Fastening Tools",
    "Screws and Screwdrivers"
  ],
  "methods":[
    {
      "name":"Removing a Phillips Head Screw",
      "steps":[
        {
          "headline":"Use this method when trying to remove a Phillips head screw without the proper screwdriver.",
          "description":"Phillips head screws are those that have two grooves forming a cross. In some cases one of the grooves will be longer than the other; if one groove is longer, this is the groove you should use when trying to unscrew your screw because it is easier to use with a variety of improvised tools. Phillips head screws are particularly prone to being stripped, when the corners formed by the grooves are worn. This makes it very difficult to unscrew your screw because there are no longer solid grooves in which to insert your tool. Be very careful when using these methods so as not to strip your screw."
        },
        {
          "headline":"Find a kitchen butter knife.",
          "description":"Kitchen butter knives can be used in a very similar way to coins. Insert the end of the butter knife into the longer groove and turn counterclockwise to unscrew the screw. If your butter knife is of low quality and strength or the screw is very tight, then you may bend your butter knife rather than unscrewing the screw. Be aware of this potential damage."
        },
        {
          "headline":"Try a coin.",
          "description":"Try inserting a small coin into the longer groove and seeing if it will turn the screw. Dimes and pennies are particularly useful for this method. This will usually only work for larger sized screws rather than very small ones. Insert the coin into the larger groove and turn counterclockwise."
        },
        {
          "headline":"Try pliers or vice grips.",
          "description":"This will only work if the head of the screw is somewhat raised above the surrounding surface. Use the pliers or vice grips to grab the sides of the screw head and turn the screw counterclockwise to twist it out. Needle nose pliers may work better than regular pliers."
        },
        {
          "headline":"Use your thumbnail.",
          "description":"Your thumbnail will only work if the screw is quite loose in the surface. Insert your nail into the longer groove and turn counterclockwise. If the screw is relatively loose then the screw should come out easily but if it is tight then this method likely will not work."
        },
        {
          "headline":"Use an old CD.",
          "description":"Insert the edge of an old CD into the longer groove and turn counterclockwise. This can damage and/or break the CD so make sure to use an old one that you don’t mind damaging. If the screw is very tight then this method might not work very well."
        },
        {
          "headline":"Use a hacksaw to create a long groove in the screw, similar to a flat head screw.",
          "description":"If your screw head is raised above the surface, you can use a hacksaw to create a groove similar to that of a flat head screw. Hold the hacksaw vertically and slowly cut the end of the screw to create a groove. Make sure you do not cut the surface of the wood or whatever the screw is fastened to. Remove the screw as you would a flat head screw, such as with a flat head screwdriver or another flat object such as a credit card."
        },
        {
          "headline":"Use a flat head screwdriver.",
          "description":"If you can't find your Phillips head screwdriver but can find a flat head screwdriver, try using a flat head that is about the same length as the longer groove in the Phillips head screw. Insert the flat head into the longer groove and turn counterclockwise to unscrew. This will not work with smaller screws, but it should be fine for normal size and larger screws. Be careful not to damage your screw because there will now be less surface area in contact with the screw head."
        },
        {
          "headline":"Try a plastic toothbrush.",
          "description":"Take a plastic toothbrush and lightly melt the end using a lighter or other source of heat. Once the plastic is soft you can insert it in the head of the screw and allow the plastic to harden once more. Once it is hard try to turn the screw counterclockwise to unscrew it. This will usually only work with screws that are not too tight and relatively easy to turn. Be very careful when using the lighter to avoid accidents and make sure to melt the toothbrush slowly so you can monitor the melting and prevent a mess from the melting plastic."
        }
      ]
    },
    {
      "name":"Removing a Flat Head Screw",
      "steps":[
        {
          "headline":"Use this method to remove a flat head screw without a screwdriver.",
          "description":"A flat head screw has one groove across the head of the screw only. If you do not have a flat head screwdriver then you can usually use any kind of flat surface to unscrew the screw."
        },
        {
          "headline":"Use a card.",
          "description":"Try using a card such as a plastic credit card to turn the screw. Insert the edge of the card into the long groove and turn counterclockwise to unscrew the screw. Make sure the card is strong and old as it could be damaged in the process."
        },
        {
          "headline":"Try the tab from a can of soda.",
          "description":"Remove the tab from a can of soda and insert into the groove on the head of the flat head screw. Turn the head counterclockwise to unscrew the screw."
        },
        {
          "headline":"Try a coin.",
          "description":"Try inserting a small coin into the groove and turning counterclockwise to unscrew. Dimes and pennies are particularly useful for this method but larger coins will be easier to turn if they fit in the groove."
        },
        {
          "headline":"Find a kitchen butter knife.",
          "description":"Kitchen butter knives can be used in a very similar way to coins. Insert the end of the butter knife into the groove and turn counterclockwise to unscrew the screw. If your butter knife is of low quality and strength or the screw is very tight, then you may bend your butter knife rather than unscrewing the screw. Be aware of this potential damage."
        },
        {
          "headline":"Try pliers or vice grips.",
          "description":"This will only work if the head of the screw is raised above the surrounding surface somewhat. Use the pliers or vice grips to grab the sides of the screw head and turn the screw counterclockwise to twist it out. Needle nose pliers may work better than regular pliers."
        },
        {
          "headline":"Use your thumbnail.",
          "description":"Your thumbnail will only work if the screw is quite loose in the surface. Insert your nail into the groove and turn counterclockwise. If the screw is relatively loose then the screw should come out easily but if it is tight then this method likely will not work."
        }
      ]
    },
    {
      "name":"Removing a Torx Screw",
      "steps":[
        {
          "headline":"Use this method if you have a torx screw.",
          "description":"Torx screws have a star-shaped pattern on the head and are very popular screws for all purposes. Security torx screws will have a nub in the middle of the screw head that needs to be accounted for. Torx screws can be easy to damage so be very careful when using an alternative tool to unscrew these screws."
        },
        {
          "headline":"Use a small flat head screwdriver.",
          "description":"Insert the flat head screwdriver between two opposite edges of the screw head. Turn counterclockwise to remove the screw. Make sure you turn slowly so as not to damage the head. For security torx screws you will need to insert the flat head in against one of the outer grooves and the center nub of the head. This works much the same as non-security torx screws. Security torx screws will usually turn the opposite direction, so you should turn clockwise to remove them."
        },
        {
          "headline":"Break out the pin on security torx screws.",
          "description":"If you have a normal torx screwdriver but not a security version then you can simply remove the center pin out of the screw head. Take a hammer and a punch or other chisel-like tool and line up the chisel at the bottom of the pin. Gently tap on the top of the chisel to remove the center pin."
        },
        {
          "headline":"Drill a small hole in the tip of your torx driver.",
          "description":"If you have a security torx screw and wish to remove using a non-security torx driver or drill bit then you can drill a small hole in the drill bit. This way it has a small hole to accommodate the center pin on your security torx screw."
        },
        {
          "headline":"Try a plastic toothbrush.",
          "description":"Take a plastic toothbrush and lightly melt the end using a lighter or other source of heat. Once the plastic is soft you can insert it in the head of the screw and allow the plastic to harden once more. Once it is hard try to turn the screw counterclockwise to unscrew it."
        }
      ]
    },
    {
      "name":"Removing Very Tiny Screws",
      "steps":[
        {
          "headline":"Use this method for removing very tiny screws without a screwdriver.",
          "description":"Very tiny screws are particularly difficult to remove without the proper tools. They are often found on electronics devices. If you can, use an eyeglass repair kit to remove your screws, which will have the necessary tiny screwdrivers. If you cannot find or use an eyeglass repair kit then you can try one of these methods. Eyeglass repair kits are very cheap and easy to find."
        },
        {
          "headline":"Try the tip of a knife.",
          "description":"Use the pointed tip of a knife to turn tiny screws counterclockwise. Insert the knife tip into the groove; if you can, try inserting the knife tip at a slight angle to provide more contact surface area between the knife and the screw."
        },
        {
          "headline":"Use a metal nail file.",
          "description":"Use the tip of a metal nail file to insert into the groove on the top of the screw head. Turn the screw counterclockwise, being careful not to damage the head."
        },
        {
          "headline":"Use the tip of pointy little scissors.",
          "description":"Insert the tip of very pointy scissors into one of the grooves on the screw head. Turn the screw counterclockwise. Blunt scissors will not work well for opening very small screws."
        },
        {
          "headline":"Try the tip of tweezers.",
          "description":"Insert the pointy tip of tweezers into the groove on the screw head and turn counterclockwise. The tip of tweezers must be pointy to be inserted into the groove properly."
        }
      ]
    }
  ],
  "text":" Removing a Phillips Head Screw Use this method when trying to remove a Phillips head screw without the proper screwdriver. Phillips head screws are those that have two grooves forming a cross. In some cases one of the grooves will be longer than the other; if one groove is longer, this is the groove you should use when trying to unscrew your screw because it is easier to use with a variety of improvised tools. Phillips head screws are particularly prone to being stripped, when the corners formed by the grooves are worn. This makes it very difficult to unscrew your screw because there are no longer solid grooves in which to insert your tool. Be very careful when using these methods so as not to strip your screw. Find a kitchen butter knife. Kitchen butter knives can be used in a very similar way to coins. Insert the end of the butter knife into the longer groove and turn counterclockwise to unscrew the screw. If your butter knife is of low quality and strength or the screw is very tight, then you may bend your butter knife rather than unscrewing the screw. Be aware of this potential damage. Try a coin. Try inserting a small coin into the longer groove and seeing if it will turn the screw. Dimes and pennies are particularly useful for this method. This will usually only work for larger sized screws rather than very small ones. Insert the coin into the larger groove and turn counterclockwise. Try pliers or vice grips. This will only work if the head of the screw is somewhat raised above the surrounding surface. Use the pliers or vice grips to grab the sides of the screw head and turn the screw counterclockwise to twist it out. Needle nose pliers may work better than regular pliers. Use your thumbnail. Your thumbnail will only work if the screw is quite loose in the surface. Insert your nail into the longer groove and turn counterclockwise. If the screw is relatively loose then the screw should come out easily but if it is tight then this method likely will not work. Use an old CD. Insert the edge of an old CD into the longer groove and turn counterclockwise. This can damage and/or break the CD so make sure to use an old one that you don’t mind damaging. If the screw is very tight then this method might not work very well. Use a hacksaw to create a long groove in the screw, similar to a flat head screw. If your screw head is raised above the surface, you can use a hacksaw to create a groove similar to that of a flat head screw. Hold the hacksaw vertically and slowly cut the end of the screw to create a groove. Make sure you do not cut the surface of the wood or whatever the screw is fastened to. Remove the screw as you would a flat head screw, such as with a flat head screwdriver or another flat object such as a credit card. Use a flat head screwdriver. If you can't find your Phillips head screwdriver but can find a flat head screwdriver, try using a flat head that is about the same length as the longer groove in the Phillips head screw. Insert the flat head into the longer groove and turn counterclockwise to unscrew. This will not work with smaller screws, but it should be fine for normal size and larger screws. Be careful not to damage your screw because there will now be less surface area in contact with the screw head. Try a plastic toothbrush. Take a plastic toothbrush and lightly melt the end using a lighter or other source of heat. Once the plastic is soft you can insert it in the head of the screw and allow the plastic to harden once more. Once it is hard try to turn the screw counterclockwise to unscrew it. This will usually only work with screws that are not too tight and relatively easy to turn. Be very careful when using the lighter to avoid accidents and make sure to melt the toothbrush slowly so you can monitor the melting and prevent a mess from the melting plastic. Removing a Flat Head Screw Use this method to remove a flat head screw without a screwdriver. A flat head screw has one groove across the head of the screw only. If you do not have a flat head screwdriver then you can usually use any kind of flat surface to unscrew the screw. Use a card. Try using a card such as a plastic credit card to turn the screw. Insert the edge of the card into the long groove and turn counterclockwise to unscrew the screw. Make sure the card is strong and old as it could be damaged in the process. Try the tab from a can of soda. Remove the tab from a can of soda and insert into the groove on the head of the flat head screw. Turn the head counterclockwise to unscrew the screw. Try a coin. Try inserting a small coin into the groove and turning counterclockwise to unscrew. Dimes and pennies are particularly useful for this method but larger coins will be easier to turn if they fit in the groove. Find a kitchen butter knife. Kitchen butter knives can be used in a very similar way to coins. Insert the end of the butter knife into the groove and turn counterclockwise to unscrew the screw. If your butter knife is of low quality and strength or the screw is very tight, then you may bend your butter knife rather than unscrewing the screw. Be aware of this potential damage. Try pliers or vice grips. This will only work if the head of the screw is raised above the surrounding surface somewhat. Use the pliers or vice grips to grab the sides of the screw head and turn the screw counterclockwise to twist it out. Needle nose pliers may work better than regular pliers. Use your thumbnail. Your thumbnail will only work if the screw is quite loose in the surface. Insert your nail into the groove and turn counterclockwise. If the screw is relatively loose then the screw should come out easily but if it is tight then this method likely will not work. Removing a Torx Screw Use this method if you have a torx screw. Torx screws have a star-shaped pattern on the head and are very popular screws for all purposes. Security torx screws will have a nub in the middle of the screw head that needs to be accounted for. Torx screws can be easy to damage so be very careful when using an alternative tool to unscrew these screws. Use a small flat head screwdriver. Insert the flat head screwdriver between two opposite edges of the screw head. Turn counterclockwise to remove the screw. Make sure you turn slowly so as not to damage the head. For security torx screws you will need to insert the flat head in against one of the outer grooves and the center nub of the head. This works much the same as non-security torx screws. Security torx screws will usually turn the opposite direction, so you should turn clockwise to remove them. Break out the pin on security torx screws. If you have a normal torx screwdriver but not a security version then you can simply remove the center pin out of the screw head. Take a hammer and a punch or other chisel-like tool and line up the chisel at the bottom of the pin. Gently tap on the top of the chisel to remove the center pin. Drill a small hole in the tip of your torx driver. If you have a security torx screw and wish to remove using a non-security torx driver or drill bit then you can drill a small hole in the drill bit. This way it has a small hole to accommodate the center pin on your security torx screw. Try a plastic toothbrush. Take a plastic toothbrush and lightly melt the end using a lighter or other source of heat. Once the plastic is soft you can insert it in the head of the screw and allow the plastic to harden once more. Once it is hard try to turn the screw counterclockwise to unscrew it. Removing Very Tiny Screws Use this method for removing very tiny screws without a screwdriver. Very tiny screws are particularly difficult to remove without the proper tools. They are often found on electronics devices. If you can, use an eyeglass repair kit to remove your screws, which will have the necessary tiny screwdrivers. If you cannot find or use an eyeglass repair kit then you can try one of these methods. Eyeglass repair kits are very cheap and easy to find. Try the tip of a knife. Use the pointed tip of a knife to turn tiny screws counterclockwise. Insert the knife tip into the groove; if you can, try inserting the knife tip at a slight angle to provide more contact surface area between the knife and the screw. Use a metal nail file. Use the tip of a metal nail file to insert into the groove on the top of the screw head. Turn the screw counterclockwise, being careful not to damage the head. Use the tip of pointy little scissors. Insert the tip of very pointy scissors into one of the grooves on the screw head. Turn the screw counterclockwise. Blunt scissors will not work well for opening very small screws. Try the tip of tweezers. Insert the pointy tip of tweezers into the groove on the screw head and turn counterclockwise. The tip of tweezers must be pointy to be inserted into the groove properly.",
  "tyn_model":[
    "screwdriver",
    "butter knife",
    "pliers",
    "knife",
    "flat head screwdriver",
    "plastic toothbrush",
    "phillips head screw",
    "hacksaw",
    "scissors",
    "tweezers",
    "phillips head screws",
    "kitchen butter knife",
    "kitchen butter knives",
    "dimes",
    "needle nose pliers",
    "flat head screw",
    "soda",
    "security torx screws",
    "chisel",
    "torx driver",
    "drill bit",
    "eyeglass repair kit",
    "nail",
    "phillips head screwdriver",
    "lighter",
    "toothbrush",
    "coin",
    "screws",
    "torx screws",
    "hammer",
    "security torx screw",
    "eyeglass repair kits"
  ],
  "tyn_section":[

  ]
}