{
  "title":"How to Make Spicy Chicken Enchiladas",
  "url":"https://www.wikihow.com/Make-Spicy-Chicken-Enchiladas",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine",
    "Enchiladas"
  ],
  "methods":[
    {
      "name":"Baking Simple Spicy Chicken Enchiladas",
      "steps":[
        {
          "headline":"Gather the ingredients.",
          "description":"This quick and easy enchilada recipe calls for only 6 ingredients and can be on the table in less than an hour. It makes use of pre-cooked, store-bought rotisserie chicken, which you can purchase at most delis and grocery stores. The prep time is 20 minutes. The cook time is 30 minutes. The recipe will yield 6 servings."
        },
        {
          "headline":"Preheat your oven to 350°F (176°C) and prepare the baking dish.",
          "description":"After preheating the oven, coat a 13x9 inch (33x22 centimeters) glass baking dish with cooking spray. Open one of the cans of enchilada sauce and spread ¾ cup (90 grams) of it evenly on the bottom of the dish. Set the baking dish aside while you prepare the other elements."
        },
        {
          "headline":"Combine the filling ingredients and build the enchiladas.",
          "description":"Use a medium bowl to combine 2 cups (240 grams) of shredded rotisserie chicken, ¾ cup (90 milliliters) enchilada sauce, the can of drained tomatoes, ¾ cup (90 grams) Monterey Jack cheese and ¼ cup (30 grams) of yellow onion. Mix the ingredients well. Lay the tortillas out flat. Spoon ¼ cup (30 grams) of the filling mixture onto each one."
        },
        {
          "headline":"Roll up the enchiladas.",
          "description":"Carefully roll up the tortillas into cylinders with the filling inside. Set the enchiladas into the baking dish, side by side, with their seam-sides down. Use a spoon to drizzle the rest of the enchilada sauce all over the top of the enchiladas. Scatter the remaining ¾ cup (90 grams) cheese over the top."
        },
        {
          "headline":"Bake the enchiladas for 25 minutes.",
          "description":"Cover the baking dish tightly with aluminum foil. Carefully place into the preheated oven for 25 minutes. After 25 minutes, the enchiladas will be heated through and the cheese will be melted. Take the foil off the dish and bake the enchiladas for 5 minutes more so that the cheese will be become gooey and lightly browned. Remove the enchiladas from the oven and plate them. Garnish with cilantro, chopped tomato and avocado slices (optional). Top with a spoonful of sour cream (optional). Serve them immediately with sour cream, chopped cilantro, picante sauce, and tortilla chips (optional)."
        }
      ]
    },
    {
      "name":"Making Spicy Chicken Enchiladas with Roasted Tomatillo Chile Salsa",
      "steps":[
        {
          "headline":"Gather your ingredients.",
          "description":"This delicious recipe sounds and tastes gourmet, but it’s very easy to put together. The prep time is only 15 minutes. The cook time is 45 minutes. The recipe will yield 4 servings."
        },
        {
          "headline":"Preheat oven to 400°F (204°C) and make the salsa.",
          "description":"Husk the tomatillos. Slice them up, along with the onion, garlic and jalapeno. Spread the chopped vegetables on a baking tray and roast them in the oven for 12 to 15 minutes. Carefully remove the tray from the oven. Dump the roasted vegetables into a food processor, along with any juices that collected at the bottom of the tray. Add the cumin, salt, cilantro and lime juice directly to the processor. Pulse the processor several times, making sure the contents combine well but remain chunky. Don’t liquefy the salsa. Set the salsa aside and prepare the enchiladas."
        },
        {
          "headline":"Caramelize the onions and the sauce.",
          "description":"Heat ½ ounce (15 milliliters) of olive oil in a medium-sized saucepan over medium heat. Dice the onion and add it to the saucepan. Cook the onion for 5 to 7 minutes, until it’s tender and caramelized. Add the chopped garlic and cumin to the pan. Cook for an additional minute. Sprinkle a small amount of flour into the pan, stirring continuously. Add the rest of the flour gradually, stirring constantly so that it doesn’t burn. Pour the chicken stock into the pan and simmer until the liquid has thickened."
        },
        {
          "headline":"Create the enchilada filling.",
          "description":"Once the liquid in the pan has thickened, remove it from the heat. Pour in half of the roasted tomatillo chile salsa and stir well. Chop up fresh cilantro and add that to the pan. Add the shredded rotisserie chicken and combine gently, folding it and the cilantro into the mixture. Season with salt and pepper (to taste)."
        },
        {
          "headline":"Change the oven temperature to 350°F (176°C) and build the enchiladas.",
          "description":"Warm up the tortillas by either flash heating them over a stove-top flame or, if you’re using an electric stove, place them momentarily under the broiler. Use some of the reserved salsa to lightly coat each tortilla and then lay them out flat. Spoon the filling mixture on top of each tortilla. Scatter shredded cheddar cheese on top, reserving half of it for topping. Roll the tortillas over the filling tightly to create the enchiladas."
        },
        {
          "headline":"Prepare the baking dish and place the enchiladas inside.",
          "description":"Spread a large spoonful of the tomatillo salsa over the bottom of a large glass baking dish. Transfer the folded enchiladas to the baking dish, one at a time, using a spatula. Lay them side by side, seam-side down. Drizzle more of the tomatillo salsa over the top of the enchiladas. Lastly, sprinkle the rest of the shredded cheddar on top."
        },
        {
          "headline":"Bake for 30 minutes.",
          "description":"Place the dish, uncovered, in the oven and bake it until the cheese is bubbly and lightly browned on top. Remove the enchiladas from the oven and plate them. Garnish with cilantro, chopped tomato and avocado slices (optional). Serve immediately with the remaining tomatillo salsa. Serve with tortilla chips (if desired). Consider serving with additional toppings like sour cream, fresh guacamole, and chopped tomato. Authentic and delicious side dishes for this meal would be yellow rice and black beans, spiced to taste."
        }
      ]
    },
    {
      "name":"Creating Creamy Salsa Verde Chicken Enchiladas",
      "steps":[
        {
          "headline":"Gather the ingredients.",
          "description":"This is another easy-to-assemble enchilada dish that can be ready and on the table in less than an hour. Prep time is only 10 minutes. Cook time is 30 minutes. The recipe makes use of store-bought salsa verde, which speeds up the assembly quite a bit. Look for jarred salsa verde with medium heat (or hotter). The yield is 3 to 4 servings."
        },
        {
          "headline":"Make the creamy salsa verde sauce.",
          "description":"Heat the canola oil in a medium-sized skillet over medium heat. Add the minced garlic and cook for approximately one minute. Spoon in the store-bought salsa verde, stir them together and cook for another minute. Remove the skillet from the heat. Add the sour cream and chopped cilantro and mix well. Season the sauce with salt and pepper (to taste). If, upon tasting, the creamy sauce is too spicy for you, mix in a little more sour cream to temper it. Divide the sauce, setting aside 1 cup (120 grams)."
        },
        {
          "headline":"Preheat the oven to 350°F (176°C) and create the enchilada filling.",
          "description":"Place the shredded rotisserie chicken and half of the shredded cheese into the main sauce mixture (not the reserved cup) and stir the ingredients together until mixed well. Coat a large baking dish with non-stick cooking spray. Spoon a small amount of the reserved creamy sauce all over the bottom of the dish."
        },
        {
          "headline":"Build the enchiladas.",
          "description":"Lay the tortillas out flat. Spoon about 1/3 cup (75 grams) of the chicken filling onto the middle of each one. Roll them up tightly, like cigars, to create the enchiladas. Transfer the folded enchiladas to the baking dish, one at a time, using a spatula. Lay them side by side, seam-side down. Drizzle the remaining reserved sauce over the top of the enchiladas. Scatter the remaining shredded cheese over the entire dish."
        },
        {
          "headline":"Bake the enchiladas for 15 minutes.",
          "description":"Tightly cover the baking dish with aluminum foil and carefully place it into the oven. Bake for 15 minutes. Check to make sure the enchiladas are heated through, and then take off the foil. Bake for 10 more minutes, so that the cheese gets bubbly and lightly browned on top. Plate the enchiladas and serve immediately. Garnish with cilantro, chopped tomato and avocado slices (optional). Serve with tortilla chips (if desired)."
        }
      ]
    }
  ],
  "text":" Baking Simple Spicy Chicken Enchiladas Gather the ingredients. This quick and easy enchilada recipe calls for only 6 ingredients and can be on the table in less than an hour. It makes use of pre-cooked, store-bought rotisserie chicken, which you can purchase at most delis and grocery stores. The prep time is 20 minutes. The cook time is 30 minutes. The recipe will yield 6 servings. Preheat your oven to 350°F (176°C) and prepare the baking dish. After preheating the oven, coat a 13x9 inch (33x22 centimeters) glass baking dish with cooking spray. Open one of the cans of enchilada sauce and spread ¾ cup (90 grams) of it evenly on the bottom of the dish. Set the baking dish aside while you prepare the other elements. Combine the filling ingredients and build the enchiladas. Use a medium bowl to combine 2 cups (240 grams) of shredded rotisserie chicken, ¾ cup (90 milliliters) enchilada sauce, the can of drained tomatoes, ¾ cup (90 grams) Monterey Jack cheese and ¼ cup (30 grams) of yellow onion. Mix the ingredients well. Lay the tortillas out flat. Spoon ¼ cup (30 grams) of the filling mixture onto each one. Roll up the enchiladas. Carefully roll up the tortillas into cylinders with the filling inside. Set the enchiladas into the baking dish, side by side, with their seam-sides down. Use a spoon to drizzle the rest of the enchilada sauce all over the top of the enchiladas. Scatter the remaining ¾ cup (90 grams) cheese over the top. Bake the enchiladas for 25 minutes. Cover the baking dish tightly with aluminum foil. Carefully place into the preheated oven for 25 minutes. After 25 minutes, the enchiladas will be heated through and the cheese will be melted. Take the foil off the dish and bake the enchiladas for 5 minutes more so that the cheese will be become gooey and lightly browned. Remove the enchiladas from the oven and plate them. Garnish with cilantro, chopped tomato and avocado slices (optional). Top with a spoonful of sour cream (optional). Serve them immediately with sour cream, chopped cilantro, picante sauce, and tortilla chips (optional). Making Spicy Chicken Enchiladas with Roasted Tomatillo Chile Salsa Gather your ingredients. This delicious recipe sounds and tastes gourmet, but it’s very easy to put together. The prep time is only 15 minutes. The cook time is 45 minutes. The recipe will yield 4 servings. Preheat oven to 400°F (204°C) and make the salsa. Husk the tomatillos. Slice them up, along with the onion, garlic and jalapeno. Spread the chopped vegetables on a baking tray and roast them in the oven for 12 to 15 minutes. Carefully remove the tray from the oven. Dump the roasted vegetables into a food processor, along with any juices that collected at the bottom of the tray. Add the cumin, salt, cilantro and lime juice directly to the processor. Pulse the processor several times, making sure the contents combine well but remain chunky. Don’t liquefy the salsa. Set the salsa aside and prepare the enchiladas. Caramelize the onions and the sauce. Heat ½ ounce (15 milliliters) of olive oil in a medium-sized saucepan over medium heat. Dice the onion and add it to the saucepan. Cook the onion for 5 to 7 minutes, until it’s tender and caramelized. Add the chopped garlic and cumin to the pan. Cook for an additional minute. Sprinkle a small amount of flour into the pan, stirring continuously. Add the rest of the flour gradually, stirring constantly so that it doesn’t burn. Pour the chicken stock into the pan and simmer until the liquid has thickened. Create the enchilada filling. Once the liquid in the pan has thickened, remove it from the heat. Pour in half of the roasted tomatillo chile salsa and stir well. Chop up fresh cilantro and add that to the pan. Add the shredded rotisserie chicken and combine gently, folding it and the cilantro into the mixture. Season with salt and pepper (to taste). Change the oven temperature to 350°F (176°C) and build the enchiladas. Warm up the tortillas by either flash heating them over a stove-top flame or, if you’re using an electric stove, place them momentarily under the broiler. Use some of the reserved salsa to lightly coat each tortilla and then lay them out flat. Spoon the filling mixture on top of each tortilla. Scatter shredded cheddar cheese on top, reserving half of it for topping. Roll the tortillas over the filling tightly to create the enchiladas. Prepare the baking dish and place the enchiladas inside. Spread a large spoonful of the tomatillo salsa over the bottom of a large glass baking dish. Transfer the folded enchiladas to the baking dish, one at a time, using a spatula. Lay them side by side, seam-side down. Drizzle more of the tomatillo salsa over the top of the enchiladas. Lastly, sprinkle the rest of the shredded cheddar on top. Bake for 30 minutes. Place the dish, uncovered, in the oven and bake it until the cheese is bubbly and lightly browned on top. Remove the enchiladas from the oven and plate them. Garnish with cilantro, chopped tomato and avocado slices (optional). Serve immediately with the remaining tomatillo salsa. Serve with tortilla chips (if desired). Consider serving with additional toppings like sour cream, fresh guacamole, and chopped tomato. Authentic and delicious side dishes for this meal would be yellow rice and black beans, spiced to taste. Creating Creamy Salsa Verde Chicken Enchiladas Gather the ingredients. This is another easy-to-assemble enchilada dish that can be ready and on the table in less than an hour. Prep time is only 10 minutes. Cook time is 30 minutes. The recipe makes use of store-bought salsa verde, which speeds up the assembly quite a bit. Look for jarred salsa verde with medium heat (or hotter). The yield is 3 to 4 servings. Make the creamy salsa verde sauce. Heat the canola oil in a medium-sized skillet over medium heat. Add the minced garlic and cook for approximately one minute. Spoon in the store-bought salsa verde, stir them together and cook for another minute. Remove the skillet from the heat. Add the sour cream and chopped cilantro and mix well. Season the sauce with salt and pepper (to taste). If, upon tasting, the creamy sauce is too spicy for you, mix in a little more sour cream to temper it. Divide the sauce, setting aside 1 cup (120 grams). Preheat the oven to 350°F (176°C) and create the enchilada filling. Place the shredded rotisserie chicken and half of the shredded cheese into the main sauce mixture (not the reserved cup) and stir the ingredients together until mixed well. Coat a large baking dish with non-stick cooking spray. Spoon a small amount of the reserved creamy sauce all over the bottom of the dish. Build the enchiladas. Lay the tortillas out flat. Spoon about 1/3 cup (75 grams) of the chicken filling onto the middle of each one. Roll them up tightly, like cigars, to create the enchiladas. Transfer the folded enchiladas to the baking dish, one at a time, using a spatula. Lay them side by side, seam-side down. Drizzle the remaining reserved sauce over the top of the enchiladas. Scatter the remaining shredded cheese over the entire dish. Bake the enchiladas for 15 minutes. Tightly cover the baking dish with aluminum foil and carefully place it into the oven. Bake for 15 minutes. Check to make sure the enchiladas are heated through, and then take off the foil. Bake for 10 more minutes, so that the cheese gets bubbly and lightly browned on top. Plate the enchiladas and serve immediately. Garnish with cilantro, chopped tomato and avocado slices (optional). Serve with tortilla chips (if desired).",
  "tyn_model":[
    "oven",
    "baking dish",
    "cilantro",
    "sour cream",
    "rotisserie chicken",
    "tortillas",
    "salsa verde",
    "enchilada sauce",
    "avocado",
    "tortilla chips",
    "onion",
    "garlic",
    "tomatillo salsa",
    "aluminum foil",
    "foil",
    "cumin",
    "processor",
    "flour",
    "salt and pepper",
    "spatula",
    "cooking spray",
    "medium bowl",
    "tomatoes",
    "monterey jack cheese",
    "yellow onion",
    "spoon",
    "picante sauce",
    "tomatillos",
    "jalapeno",
    "baking tray",
    "food processor",
    "salt",
    "lime juice",
    "onions",
    "olive oil",
    "medium-sized saucepan",
    "saucepan",
    "chicken stock",
    "roasted tomatillo chile salsa",
    "stove-top flame",
    "broiler",
    "salsa",
    "cheddar cheese",
    "large glass baking dish",
    "fresh guacamole",
    "tomato",
    "yellow rice",
    "black beans",
    "salsa verde chicken",
    "canola oil",
    "medium-sized skillet",
    "skillet",
    "large baking dish",
    "non-stick cooking spray",
    "chicken filling",
    "reserved sauce",
    "shredded cheese",
    "chopped tomato"
  ],
  "tyn_section":[

  ]
}