{
  "title":"How to Make Island Style Red Rice",
  "url":"https://www.wikihow.com/Make-Island-Style-Red-Rice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Rice and Beans"
  ],
  "steps":[
    {
      "headline":"Buy a tube of the Mahatma brand Spanish rice.",
      "description":""
    },
    {
      "headline":"Follow package directions for the amount of water required to cook it.",
      "description":""
    },
    {
      "headline":"Fry two strips of bacon and save the oil in the skillet.",
      "description":""
    },
    {
      "headline":"Cut the two bacon strips into small pieces and add to the boiling rice water.",
      "description":""
    },
    {
      "headline":"Cut 3 slices of a white onion and chop them up fine.",
      "description":"Place them into the bacon oil and fry them until they are glossy. Also place them into the boiling rice water."
    },
    {
      "headline":"Add the rice and seasoning and turn the heat to low.",
      "description":"Cover and cook from 15 to 20 minutes."
    },
    {
      "headline":"Three (3) minutes before the rice is done, add a half cup of petite frozen green peas and stir into the rice.",
      "description":""
    },
    {
      "headline":"After a few minutes to let the peas thaw, serve the hot Island Style Spanish rice with Chicken Kealguen.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Buy a tube of the Mahatma brand Spanish rice.  Follow package directions for the amount of water required to cook it.  Fry two strips of bacon and save the oil in the skillet.  Cut the two bacon strips into small pieces and add to the boiling rice water.  Cut 3 slices of a white onion and chop them up fine. Place them into the bacon oil and fry them until they are glossy. Also place them into the boiling rice water. Add the rice and seasoning and turn the heat to low. Cover and cook from 15 to 20 minutes. Three (3) minutes before the rice is done, add a half cup of petite frozen green peas and stir into the rice.  After a few minutes to let the peas thaw, serve the hot Island Style Spanish rice with Chicken Kealguen.  Finished. ",
  "tyn_model":[
    "rice",
    "rice water",
    "mahatma brand spanish rice",
    "bacon",
    "oil",
    "skillet",
    "white onion",
    "bacon oil",
    "seasoning",
    "petite frozen green peas",
    "island style spanish rice",
    "chicken kealguen."
  ],
  "tyn_section":[

  ]
}