{
  "title":"How to Make a Fish Pinata",
  "url":"https://www.wikihow.com/Make-a-Fish-Pinata",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft"
  ],
  "steps":[
    {
      "headline":"Remove one of the long flaps from the cardboard box.",
      "description":"Bend the edges of the flap until it forms a three-dimensional half circle."
    },
    {
      "headline":"Pour the glue into the container.",
      "description":"You'll be dipping the paintbrush into this container."
    },
    {
      "headline":"Cover the surface of the cardboard semi-circle with glue.",
      "description":"Stick the newspaper strips or bits over the glue and onto the cardboard. It's okay to glue over the edges."
    },
    {
      "headline":"Flip the cardboard semi-circle over.",
      "description":"Add newspaper to this side too. Keep the cardboard bent in shape."
    },
    {
      "headline":"Remove a second flap from the box.",
      "description":"Use the flap which has the exact same length as the first flap removed. Again, bend it until it forms a three dimensional semi-circle shape."
    },
    {
      "headline":"Cover it with glue and newspaper as with the first flap.",
      "description":"Keep the cardboard bent in shape."
    },
    {
      "headline":"Now fix the the shorter flaps.",
      "description":"Remove these from the box. Then, cover the other two shorter flaps in glue and newspaper on, both sides."
    },
    {
      "headline":"Make three more cardboard pieces that are covered in newspaper.",
      "description":"Use the flaps on the other side of the box this time. Cover in newspaper and glue as before."
    },
    {
      "headline":"Cut each covered long piece of cardboard into an oval shape.",
      "description":""
    },
    {
      "headline":"Take one piece of cardboard.",
      "description":"Pick one side on the front or back of the oval. Bend it wither left or right, but do not break it off. Do this to both sides on each piece of cardboard."
    },
    {
      "headline":"Glue each bent piece to the other bent piece of the other piece of cardboard.",
      "description":"Push together until they dry and stick together. You might want to push the flaps closer to each other to make the fish fatter or wider."
    },
    {
      "headline":"Cut the shorter flaps to fit the bottom and top of the body of the fish.",
      "description":"Glue the edges to the body of the fish's edges. Do the same with the other side too."
    },
    {
      "headline":"Bend over a thin rectangle on one side of each of two of the remaining flaps covered earlier.",
      "description":"Glue a rectangular flap to the center of the fish on the outside. Do this with both pieces. (The third remaining flap is yet to be utilized.)"
    },
    {
      "headline":"Open one end of the fish with care.",
      "description":"Fill with candy and sweets, perhaps some confetti or sparkly cut-outs."
    },
    {
      "headline":"Take the third and final cardboard piece covered in newspaper.",
      "description":"Glue the center of this to one side (front or back) of the fish."
    },
    {
      "headline":"Paint as you want.",
      "description":"The fish can be all one color, multi-colored or two-toned. Use your imagination and whatever paint you have to hand."
    },
    {
      "headline":"Attach the string to the finished fish piñata.",
      "description":"Put about half an inch of string on the top of the fish. Tape it in place firmly. Hang the opposite end to the ceiling or from a bungee cord."
    },
    {
      "headline":"It's ready for play!",
      "description":""
    },
    {
      "headline":"Inflate the balloon.",
      "description":"Inflate it as large as it will go without popping."
    },
    {
      "headline":"Tear or cut the newspaper.",
      "description":"Either make squares or strips, whichever you feel most comfortable working with."
    },
    {
      "headline":"Dip the newspaper pieces into the craft glue or flour paste to cover.",
      "description":"Then smooth onto the balloon, pressing out any wrinkles before they set."
    },
    {
      "headline":"Continue adding all the pieces.",
      "description":"Completely cover the balloon. Let dry for 4 to 5 hours, or overnight."
    },
    {
      "headline":"Add another layer in the same way.",
      "description":"Allow to dry. Then add another layer, dry and one more layer, dry. This makes for three extra layers in total on top of the original layer."
    },
    {
      "headline":"Draw designs for the fish features.",
      "description":"Draw onto thin colored card (the card should complement the colors to be used in the crepe paper.) These must be large enough to fit the balloon size. You'll need to draw:\nA top fin\n2 side fins\nA fulsome tail\nFishy lips\nTwo large round eyes (or you can use large googly eyes)."
    },
    {
      "headline":"Cut out each piece neatly.",
      "description":"Trim as needed."
    },
    {
      "headline":"Cover each cardboard piece with papier mâché.",
      "description":"Leave to dry."
    },
    {
      "headline":"Stick a pin into the balloon.",
      "description":"Push through the papier mâché layer and pop the balloon."
    },
    {
      "headline":"Add the fish features to the balloon.",
      "description":"Use papier mâché to attach each feature in it anatomically correct position. Use three layers to be sure the pieces are properly attached, allowing for full drying time between each layer."
    },
    {
      "headline":"Paint the dried fish.",
      "description":"Paint it completely white, then let it dry."
    },
    {
      "headline":"Glue crepe paper around the fish in stripes that form the scales.",
      "description":"You can use one color, although two-toned colored rows (one row one color, the next row another) will ensure the best effect. Bunch up the rows as you glue them down the body space, so that they appear wavy and stand up a little way (not flat against the body). Do not take the scale rows over any of the fish features or face. Use PVA glue to attach the crepe paper."
    },
    {
      "headline":"Cover the fish features and facial area with flat pieces of crepe paper.",
      "description":"Use a different color again for these areas and simply cover them flat with crepe paper, using squares or pieces until fully covered."
    },
    {
      "headline":"Finish the facial details.",
      "description":"Add the eyes. Either glue on large cardboard circles (you can use a marker to fill in pupils) or glue on large googly eyes. Add the lips. Paint them any color you like."
    },
    {
      "headline":"Fill with candies.",
      "description":"Cut a small slit alongside the top fin. Fill with sweets and candies, and maybe some confetti or sparkly cut-outs too."
    },
    {
      "headline":"Cut a hole through the top of the fish, right behind the fin.",
      "description":"Attach a length of string."
    },
    {
      "headline":"Hang the fish piñata.",
      "description":"Loop the string over something solid, or hang from a bungee cord. It's now ready for play!"
    }
  ],
  "text":" Remove one of the long flaps from the cardboard box. Bend the edges of the flap until it forms a three-dimensional half circle. Pour the glue into the container. You'll be dipping the paintbrush into this container. Cover the surface of the cardboard semi-circle with glue. Stick the newspaper strips or bits over the glue and onto the cardboard. It's okay to glue over the edges. Flip the cardboard semi-circle over. Add newspaper to this side too. Keep the cardboard bent in shape. Remove a second flap from the box. Use the flap which has the exact same length as the first flap removed. Again, bend it until it forms a three dimensional semi-circle shape. Cover it with glue and newspaper as with the first flap. Keep the cardboard bent in shape. Now fix the the shorter flaps. Remove these from the box. Then, cover the other two shorter flaps in glue and newspaper on, both sides. Make three more cardboard pieces that are covered in newspaper. Use the flaps on the other side of the box this time. Cover in newspaper and glue as before. Cut each covered long piece of cardboard into an oval shape.  Take one piece of cardboard. Pick one side on the front or back of the oval. Bend it wither left or right, but do not break it off. Do this to both sides on each piece of cardboard. Glue each bent piece to the other bent piece of the other piece of cardboard. Push together until they dry and stick together. You might want to push the flaps closer to each other to make the fish fatter or wider. Cut the shorter flaps to fit the bottom and top of the body of the fish. Glue the edges to the body of the fish's edges. Do the same with the other side too. Bend over a thin rectangle on one side of each of two of the remaining flaps covered earlier. Glue a rectangular flap to the center of the fish on the outside. Do this with both pieces. (The third remaining flap is yet to be utilized.) Open one end of the fish with care. Fill with candy and sweets, perhaps some confetti or sparkly cut-outs. Take the third and final cardboard piece covered in newspaper. Glue the center of this to one side (front or back) of the fish. Paint as you want. The fish can be all one color, multi-colored or two-toned. Use your imagination and whatever paint you have to hand. Attach the string to the finished fish piñata. Put about half an inch of string on the top of the fish. Tape it in place firmly. Hang the opposite end to the ceiling or from a bungee cord. It's ready for play!  Inflate the balloon. Inflate it as large as it will go without popping. Tear or cut the newspaper. Either make squares or strips, whichever you feel most comfortable working with. Dip the newspaper pieces into the craft glue or flour paste to cover. Then smooth onto the balloon, pressing out any wrinkles before they set. Continue adding all the pieces. Completely cover the balloon. Let dry for 4 to 5 hours, or overnight. Add another layer in the same way. Allow to dry. Then add another layer, dry and one more layer, dry. This makes for three extra layers in total on top of the original layer. Draw designs for the fish features. Draw onto thin colored card (the card should complement the colors to be used in the crepe paper.) These must be large enough to fit the balloon size. You'll need to draw:\nA top fin\n2 side fins\nA fulsome tail\nFishy lips\nTwo large round eyes (or you can use large googly eyes). Cut out each piece neatly. Trim as needed. Cover each cardboard piece with papier mâché. Leave to dry. Stick a pin into the balloon. Push through the papier mâché layer and pop the balloon. Add the fish features to the balloon. Use papier mâché to attach each feature in it anatomically correct position. Use three layers to be sure the pieces are properly attached, allowing for full drying time between each layer. Paint the dried fish. Paint it completely white, then let it dry. Glue crepe paper around the fish in stripes that form the scales. You can use one color, although two-toned colored rows (one row one color, the next row another) will ensure the best effect. Bunch up the rows as you glue them down the body space, so that they appear wavy and stand up a little way (not flat against the body). Do not take the scale rows over any of the fish features or face. Use PVA glue to attach the crepe paper. Cover the fish features and facial area with flat pieces of crepe paper. Use a different color again for these areas and simply cover them flat with crepe paper, using squares or pieces until fully covered. Finish the facial details. Add the eyes. Either glue on large cardboard circles (you can use a marker to fill in pupils) or glue on large googly eyes. Add the lips. Paint them any color you like. Fill with candies. Cut a small slit alongside the top fin. Fill with sweets and candies, and maybe some confetti or sparkly cut-outs too. Cut a hole through the top of the fish, right behind the fin. Attach a length of string. Hang the fish piñata. Loop the string over something solid, or hang from a bungee cord. It's now ready for play!",
  "tyn_model":[
    "glue",
    "cardboard",
    "newspaper",
    "crepe paper",
    "balloon",
    "papier mâché",
    "sweets",
    "bungee cord",
    "candy",
    "paint",
    "craft glue",
    "flour",
    "pin",
    "pva glue",
    "string"
  ],
  "tyn_section":[

  ]
}