{
  "title":"How to Crochet a Dress Without a Pattern",
  "url":"https://www.wikihow.com/Crochet-a-Dress-Without-a-Pattern",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Knitting and Crochet",
    "Crochet"
  ],
  "steps":[
    {
      "headline":"Gather the things you'll need.",
      "description":"They are listed below."
    },
    {
      "headline":"Make a chain long enough to fit around wherever you want the seam between the skirt and the bodice to be.",
      "description":"If you'd rather work it all in one piece, make the chain to fit just above the bust. Join with slip stitch to make a circle."
    },
    {
      "headline":"Decide what stitch to use for the bodice.",
      "description":"Double crochet or half double is probably your best choice, because single crochet is stiff and treble crochet is too long and will get caught on knobs and other things, making the wearing of the dress more of a hassle than it needs to be."
    },
    {
      "headline":"Work the bodice.",
      "description":"If you want to make it fitted, you'll need to increase and decrease some to make it work. This will take some experimentation, just keep working at it until you find something that works."
    },
    {
      "headline":"Figure out and work your neckline and sleeves.",
      "description":"If you want a curved neckline, you'll need to adapt the way you were working. This dress will be much easier without sleeves, but if you want sleeves, you can make them by just working rounds until they reach a good size."
    },
    {
      "headline":"Pick a pattern stitch for the skirt.",
      "description":"You don't have to make the skirt with a pattern stitch, but a dress made entirely from double crochet isn't very interesting or fun to make."
    },
    {
      "headline":"Work the skirt.",
      "description":"Keep working until you've made it the desired length."
    },
    {
      "headline":"Finish, work in yarn ends, and add finishing touches.",
      "description":""
    }
  ],
  "text":" Gather the things you'll need. They are listed below. Make a chain long enough to fit around wherever you want the seam between the skirt and the bodice to be. If you'd rather work it all in one piece, make the chain to fit just above the bust. Join with slip stitch to make a circle. Decide what stitch to use for the bodice. Double crochet or half double is probably your best choice, because single crochet is stiff and treble crochet is too long and will get caught on knobs and other things, making the wearing of the dress more of a hassle than it needs to be. Work the bodice. If you want to make it fitted, you'll need to increase and decrease some to make it work. This will take some experimentation, just keep working at it until you find something that works. Figure out and work your neckline and sleeves. If you want a curved neckline, you'll need to adapt the way you were working. This dress will be much easier without sleeves, but if you want sleeves, you can make them by just working rounds until they reach a good size. Pick a pattern stitch for the skirt. You don't have to make the skirt with a pattern stitch, but a dress made entirely from double crochet isn't very interesting or fun to make. Work the skirt. Keep working until you've made it the desired length. Finish, work in yarn ends, and add finishing touches. ",
  "tyn_model":[
    "crochet",
    "slip stitch",
    "double crochet",
    "yarn"
  ],
  "tyn_section":[

  ]
}