{
  "title":"How to Wash Wicker Furniture",
  "url":"https://www.wikihow.com/Wash-Wicker-Furniture",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Washing Wicker Furniture",
      "steps":[
        {
          "headline":"Wipe with a damp cloth or sponge.",
          "description":"Use a soft cloth and water to gently wipe down all surfaces of wicker to remove dirt and retain shine. Try using a mild soap on your cloth or sponge for more stubborn dirt and stains on your wicker, but follow by wiping with just water afterwards. You can also add salt to water as a non-abrasive way to gently scrub away dirt and stains. Add a mixture of one part white vinegar to three parts water on your cloth if you need to eliminate mold or mildew built up on the wicker."
        },
        {
          "headline":"Wash cushions separately.",
          "description":"Remove any cushions or other material that is not made of wicker and clean separately. Check to see if cushions have a tag with care instructions. You may be able to put the entire cushion, or a removable cover, into a washing machine. When in doubt, opt for gently dabbing at cushion fabric with a damp cloth and a small amount of gentle soap or stain remover."
        },
        {
          "headline":"Hose down outdoor wicker furniture.",
          "description":"Wipe outdoor furniture with a wet cloth or sponge and soap, then rinse with a hose. Never hose down paper fiber wicker, as it will easily be destroyed by a large amount of water. Washing should mainly be done with care on natural reed or synthetic wicker. If possible, tilt your piece of furniture so that any area with a tighter weave of the wicker is on top. This way, water will run down from it to the looser weave, where it can be wiped away or dried more easily without keeping moisture trapped inside the weave. Steam-clean outdoor wicker furniture with a hand steam-cleaner if it is very dirty. Make sure that you dry the wicker right away with a hair dryer or full sun and wind to avoid the wicker warping or bending."
        },
        {
          "headline":"Let the wicker dry.",
          "description":"Ensure that the wicker is fully dry after washing and before replacing cushions or using the furniture again. Keep the furniture in a dry place indoors, outside in the sun in dry conditions, or use a fan or hairdryer at some distance away from the wicker to accelerate drying. Keep the shape of the wicker as best as possible. Avoid sitting or placing any objects on the furniture before it is completely dry, as the wicker may form a new shape when wet. Expect to wait several days for the wicker to dry entirely."
        }
      ]
    },
    {
      "name":"Dusting and Brushing Wicker Furniture",
      "steps":[
        {
          "headline":"Dust with a feather duster or dry cloth.",
          "description":"Use a microfiber duster, soft cloth, or feather duster to remove any dust or dirt that has accumulated on the surface. Try a duster with small nubs, feathers, or texture that will help get into the small cracks of the wicker weave."
        },
        {
          "headline":"Vacuum with a brush attachment.",
          "description":"Use a vacuum with a brush attachment on the hose to gently remove dust from on and inside the weave of your wicker. Make sure the vacuum is at a low suction setting to avoid damage, and brush it gently across the surface of the wicker. For larger dirt, dust, or other objects stuck in the wicker, try using a pair of tweezers or needle-nose pliers to remove it."
        },
        {
          "headline":"Use a soft brush.",
          "description":"Remove dust and dirt from between the weave of your wicker by sweeping a cleaning brush gently across the surface. Try a paintbrush or even a toothbrush for smaller, hard-to-reach areas. Make sure to use any brush lightly, so as not to disrupt or dislodge any of the wicker. Avoid steel wool or any brush with stiff bristles, as these can damage natural wicker or remove lacquer, paint, or weatherproofing from treated wicker."
        }
      ]
    },
    {
      "name":"Continuing Care for Wicker Furniture",
      "steps":[
        {
          "headline":"Wash as little as possible.",
          "description":"Apply water to your furniture only when strictly necessary, sticking to dusting and vacuuming regularly when dust and dirt appear. A more thorough hose-down cleaning should only be needed about once a year, if that. Do wash away spills and stains as soon as possible with a damp cloth and mild soap, as wicker will absorb any spilled moisture. Use as little water as possible when you do need to use it, as more moisture will only damage the wicker further over time."
        },
        {
          "headline":"Apply a lacquer to the wicker.",
          "description":"Protect your furniture from damage by using a varnish, lacquer, or wax meant for use on wicker. Apply it in a thin layer with a brush or cloth, or in a spray form if possible. Try linseed oil or lemon oil as a natural method to help protect the wicker and boost its shine. Use a lacquer specifically meant for weatherproofing if you intend to start or continue using the wicker furniture outside."
        },
        {
          "headline":"Repair wicker with wood glue.",
          "description":"Apply a small amount of wood glue to any slats of the wicker that appear broken or fraying. You can also trim pieces of wicker that are frayed or broken and sticking out by using a pair of scissors to cut them away as cleanly as possible. Avoid pulling at any errant pieces. If damage is more extensive, you may need to take the furniture in to a professional, or replace it completely."
        },
        {
          "headline":"Keep outdoor furniture out of the elements.",
          "description":"Avoid direct sunlight, rain, snow, or heavy wind on your outdoor wicker furniture whenever possible. Cover or place your wicker furniture under a roof, deck, or canopy while not in use. You can also bring wicker furniture inside, if possible, to help preserve its life. Care for indoor furniture should also be taken by controlling humidity as best as possible. Use a humidifier in dry climates to avoid drying and cracking wicker, and use a dehumidifier or place wicker furniture in a room with good air circulation if in a very humid environment."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Washing Wicker Furniture Wipe with a damp cloth or sponge. Use a soft cloth and water to gently wipe down all surfaces of wicker to remove dirt and retain shine. Try using a mild soap on your cloth or sponge for more stubborn dirt and stains on your wicker, but follow by wiping with just water afterwards. You can also add salt to water as a non-abrasive way to gently scrub away dirt and stains. Add a mixture of one part white vinegar to three parts water on your cloth if you need to eliminate mold or mildew built up on the wicker. Wash cushions separately. Remove any cushions or other material that is not made of wicker and clean separately. Check to see if cushions have a tag with care instructions. You may be able to put the entire cushion, or a removable cover, into a washing machine. When in doubt, opt for gently dabbing at cushion fabric with a damp cloth and a small amount of gentle soap or stain remover. Hose down outdoor wicker furniture. Wipe outdoor furniture with a wet cloth or sponge and soap, then rinse with a hose. Never hose down paper fiber wicker, as it will easily be destroyed by a large amount of water. Washing should mainly be done with care on natural reed or synthetic wicker. If possible, tilt your piece of furniture so that any area with a tighter weave of the wicker is on top. This way, water will run down from it to the looser weave, where it can be wiped away or dried more easily without keeping moisture trapped inside the weave. Steam-clean outdoor wicker furniture with a hand steam-cleaner if it is very dirty. Make sure that you dry the wicker right away with a hair dryer or full sun and wind to avoid the wicker warping or bending. Let the wicker dry. Ensure that the wicker is fully dry after washing and before replacing cushions or using the furniture again. Keep the furniture in a dry place indoors, outside in the sun in dry conditions, or use a fan or hairdryer at some distance away from the wicker to accelerate drying. Keep the shape of the wicker as best as possible. Avoid sitting or placing any objects on the furniture before it is completely dry, as the wicker may form a new shape when wet. Expect to wait several days for the wicker to dry entirely. Dusting and Brushing Wicker Furniture Dust with a feather duster or dry cloth. Use a microfiber duster, soft cloth, or feather duster to remove any dust or dirt that has accumulated on the surface. Try a duster with small nubs, feathers, or texture that will help get into the small cracks of the wicker weave. Vacuum with a brush attachment. Use a vacuum with a brush attachment on the hose to gently remove dust from on and inside the weave of your wicker. Make sure the vacuum is at a low suction setting to avoid damage, and brush it gently across the surface of the wicker. For larger dirt, dust, or other objects stuck in the wicker, try using a pair of tweezers or needle-nose pliers to remove it. Use a soft brush. Remove dust and dirt from between the weave of your wicker by sweeping a cleaning brush gently across the surface. Try a paintbrush or even a toothbrush for smaller, hard-to-reach areas. Make sure to use any brush lightly, so as not to disrupt or dislodge any of the wicker. Avoid steel wool or any brush with stiff bristles, as these can damage natural wicker or remove lacquer, paint, or weatherproofing from treated wicker. Continuing Care for Wicker Furniture Wash as little as possible. Apply water to your furniture only when strictly necessary, sticking to dusting and vacuuming regularly when dust and dirt appear. A more thorough hose-down cleaning should only be needed about once a year, if that. Do wash away spills and stains as soon as possible with a damp cloth and mild soap, as wicker will absorb any spilled moisture. Use as little water as possible when you do need to use it, as more moisture will only damage the wicker further over time. Apply a lacquer to the wicker. Protect your furniture from damage by using a varnish, lacquer, or wax meant for use on wicker. Apply it in a thin layer with a brush or cloth, or in a spray form if possible. Try linseed oil or lemon oil as a natural method to help protect the wicker and boost its shine. Use a lacquer specifically meant for weatherproofing if you intend to start or continue using the wicker furniture outside. Repair wicker with wood glue. Apply a small amount of wood glue to any slats of the wicker that appear broken or fraying. You can also trim pieces of wicker that are frayed or broken and sticking out by using a pair of scissors to cut them away as cleanly as possible. Avoid pulling at any errant pieces. If damage is more extensive, you may need to take the furniture in to a professional, or replace it completely. Keep outdoor furniture out of the elements. Avoid direct sunlight, rain, snow, or heavy wind on your outdoor wicker furniture whenever possible. Cover or place your wicker furniture under a roof, deck, or canopy while not in use. You can also bring wicker furniture inside, if possible, to help preserve its life. Care for indoor furniture should also be taken by controlling humidity as best as possible. Use a humidifier in dry climates to avoid drying and cracking wicker, and use a dehumidifier or place wicker furniture in a room with good air circulation if in a very humid environment. Finished. ",
  "tyn_model":[
    "wicker",
    "water",
    "vacuum",
    "lacquer",
    "outdoor wicker furniture",
    "feather duster",
    "wood glue",
    "wicker furniture",
    "salt",
    "white vinegar",
    "washing machine",
    "damp cloth",
    "gentle soap",
    "stain remover",
    "wet cloth",
    "sponge",
    "soap",
    "hose",
    "steam-cleaner",
    "hair dryer",
    "fan",
    "hairdryer",
    "microfiber duster",
    "duster",
    "tweezers",
    "mild soap",
    "varnish",
    "linseed oil",
    "lemon oil",
    "scissors",
    "outdoor wicker",
    "humidifier",
    "dehumidifier"
  ],
  "tyn_section":[

  ]
}