{
  "title":"How to Catch Groudon in Pokémon Ruby",
  "url":"https://www.wikihow.com/Catch-Groudon-in-Pok%C3%A9mon-Ruby",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Pokemon Video Games",
    "Pokemon Ruby Sapphire and Emerald"
  ],
  "methods":[
    {
      "name":"Preparations",
      "steps":[
        {
          "headline":"Collect the items needed.",
          "description":"Groudon may be hard to catch. This battle may be long also. Obtain some Pokémon Balls and healing items. Some useful items are:\nUltra Balls. Ultra Balls are recommended for catching Groudon. If you have a Master Ball, definitely bring that along. Revives. Revives a fainted Pokémon that may be knocked out. Groudon's attacks are very powerful. In some causes, you may want to use your Max Revive. It restores a Pokémon's health completely, instead of halfway. Hyper Potions, Max Potions, and Full Restores. These three items are healing. Use these when your Pokémon is injured and needs to be healed."
        },
        {
          "headline":"Train your Pokémon no more than six levels above Groudon.",
          "description":"Groudon is Level 45 when you first battle with it. If you train your Pokémon Level 60 or higher, you could accidentally knock out Groudon. If you knock it out, you will never be able to catch it again, unless you restart your progress."
        },
        {
          "headline":"Teach your Pokémon some high quality moves.",
          "description":"Teach your Pokémon moves like:\nFalse Swipe. False Swipe is a move where, when used, leaves at least 1 HP remaining. This will be useful at the end of the battle. Defence Raising Attacks. Groudon has powerful attack moves and stats. Raise the defense so it won't do as much damage."
        }
      ]
    },
    {
      "name":"Battling Groudon",
      "steps":[
        {
          "headline":"Save while your character is beside Groudon, not in front of it.",
          "description":"If you lose, you can restart. This is because Groudon awakes when you stand it front of it automatically."
        },
        {
          "headline":"Weaken Groudon by applying Status Effects to Groudon.",
          "description":"Sleep, Paralysis, etc."
        },
        {
          "headline":"Use an advantage type move on Groudon.",
          "description":"Groudon is Ground-type. Use Water or Grass-type moves first."
        },
        {
          "headline":"Start throwing some Ultra Balls at Groudon.",
          "description":""
        },
        {
          "headline":"Heal your Pokémon if Groudon injured it.",
          "description":""
        },
        {
          "headline":"Keep throwing Ultra Balls until Groudon is caught.",
          "description":""
        },
        {
          "headline":"Congratulations!",
          "description":"You have received Groudon."
        }
      ]
    }
  ],
  "text":" Preparations Collect the items needed. Groudon may be hard to catch. This battle may be long also. Obtain some Pokémon Balls and healing items. Some useful items are:\nUltra Balls. Ultra Balls are recommended for catching Groudon. If you have a Master Ball, definitely bring that along. Revives. Revives a fainted Pokémon that may be knocked out. Groudon's attacks are very powerful. In some causes, you may want to use your Max Revive. It restores a Pokémon's health completely, instead of halfway. Hyper Potions, Max Potions, and Full Restores. These three items are healing. Use these when your Pokémon is injured and needs to be healed. Train your Pokémon no more than six levels above Groudon. Groudon is Level 45 when you first battle with it. If you train your Pokémon Level 60 or higher, you could accidentally knock out Groudon. If you knock it out, you will never be able to catch it again, unless you restart your progress. Teach your Pokémon some high quality moves. Teach your Pokémon moves like:\nFalse Swipe. False Swipe is a move where, when used, leaves at least 1 HP remaining. This will be useful at the end of the battle. Defence Raising Attacks. Groudon has powerful attack moves and stats. Raise the defense so it won't do as much damage. Battling Groudon Save while your character is beside Groudon, not in front of it. If you lose, you can restart. This is because Groudon awakes when you stand it front of it automatically. Weaken Groudon by applying Status Effects to Groudon. Sleep, Paralysis, etc. Use an advantage type move on Groudon. Groudon is Ground-type. Use Water or Grass-type moves first. Start throwing some Ultra Balls at Groudon.  Heal your Pokémon if Groudon injured it.  Keep throwing Ultra Balls until Groudon is caught.  Congratulations! You have received Groudon.",
  "tyn_model":[
    "groudon",
    "pokémon",
    "ultra balls",
    "pokémon balls"
  ],
  "tyn_section":[

  ]
}