{
  "title":"How to Play Team Fortress 2",
  "url":"https://www.wikihow.com/Play-Team-Fortress-2",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Team Fortress 2"
  ],
  "steps":[
    {
      "headline":"Play the tutorial mode first!",
      "description":"To find it, look at the bottom of the main home page and look for a spiked ball with a graduation hat on it. You will be granted with four classes that sum up an online team during a game. The Tutorial is split into 2 sections: Basic tutorial and practicing with bots. The basic tutorial shows you how to play Solider, Demoman, Engineer, and Spy. It is strongly recommended to complete all these tutorials to get a good grasp of the types of classes. Practicing with bots is mainly used if you need to brush up on skills, or practice 1 specific class without the pressure of pvp. With Practicing with bots, often referred to as \"Offline Practice\" since you aren't play with others across the world, is recommended to grasp the mechanics of the game, but isn't required. Sometimes putting in 20 minutes of practice with bots can make a difference between a good and bad spy."
    },
    {
      "headline":"Have a computer with sufficient specs for smooth gameplay.",
      "description":"You'll have to have a constant frame rate of about 30-40 FPS to make gameplay tolerable. To add to this, play on a server with a maximum of 24 players. Team Fortress 2 was designed for this type of lag. But if you do play on a sufficiently powerful computer, it should withstand the 34 player cap. Most servers set up by Valve, under the \"Casual\" tab, are set at 24 players max. Only player-created servers will have the 34 player cap."
    },
    {
      "headline":"Be conservative with video settings.",
      "description":"Unless you're running a top-of-the-line gaming system, you'll probably benefit more from performance in an online multiplayer shooter than from visual appeal. The follow tips guarantee a nominal boost in frame rate. Put all of your settings on low if your recommended settings are medium. You may think setting sound quality to low would help, but sound is very important in TF2! Disable anti-aliasing."
    },
    {
      "headline":"Learn the levels.",
      "description":"Know which team might have the starting advantage. RED has a huge advantage over BLU team in Payload maps. With payload maps, BLU needs to push a cart with a bomb strapped to it to the end of the map. Red spawns halfway through the map at the start, and are given a minute to build up their defenses. In this time, Medics can get their charges ready and Engineers can build up some turrets. After a minute is up, BLU's doors open, and the battle begins. In most maps, RED is defending an objective from BLU. Some maps have both teams fight for 1 control point, these maps are know as King Of The Hill. Other maps require a team to steal the other's \"intelligence\" 3 times to win. The intelligence is a color briefcase full of classified documents. This mode is known as CTF."
    },
    {
      "headline":"Learn the strengths and weaknesses of each class.",
      "description":"Work out which classes are suited to which maps. In maps with an objective, Scouts are a good pick. One of Scout's strong points is he captures points and pushes payloads as fast as 2 people. Scout also runs at about 130% speed, making him the fastest class in the game. This makes scout incredibly good at capturing points and running \"circles around the enemy.\" Sniper will also be a good pick for control point maps. He must stay out of the fight, and train his rifle on the control point. To capture a control point, a player must stand on the control point for a bit of time depending on how many people are on the point. Because of this, players tend to stand still on the control points, leaving Snipers to pick away."
    },
    {
      "headline":"Team Fortress 2 is a team-based game, therefore kamikaze gung-ho tactics won't work.",
      "description":"This is not like Call of Duty, work together as one. Depending on the objective, you are either holding down an area or pushing forward."
    },
    {
      "headline":"Communicate.",
      "description":"TF2 offers a wide variety of ways to communicate with your team. You can either use the chat, both team chat and all chat (both teams see it), use pre-set voice commands, such as \"Go Right\" or \"Incoming!\". Each class has the same commands, but different ways of saying them. For the most specific, use voice chat. If you have a microphone, you can use it to say anything you want! For this reason, many parents would rather not their children use voice chat, and there are some settings in the menu to disable voice chat if you are hearing bad words. Communicating with the rest of your team is essential to winning the round, whether you're  typing in team chat. Work out a plan for maps and classes so that you know where everyone is and going to."
    },
    {
      "headline":"Configure your keys.",
      "description":"There are many functions in Team Fortress 2 bound to keys, all configurable. Put the keys where they make the most sense for you. With features like fast weapon switching turned on, you will be more effective in the heat of battle if you don't have to look at the keyboard."
    },
    {
      "headline":"Survive!",
      "description":"It's easy to keep suicidally running at the enemy shooting wildly - but don't forget that you're far more valuable to your team alive than a corpse on the frontline. Every team has a Medic to keep them alive. Call for him to heal you up. Medics can also temporarily over heal you to 150% health!"
    },
    {
      "headline":"If your team lacks a Medic, then become one.",
      "description":"Every team is instantly weaker without them! Playing Medic is also a great way to learn a map, since you run around a lot while healing your teammates. (Do the same for each class. If your team lacks a lot or has none of a certain class, fill that spot! That way you will have a balance of speed, power, damage, and healing on your team.)"
    },
    {
      "headline":"Complete the achievements.",
      "description":"Every achievement that you complete with a certain class counts to a special weapon that's in your taste. After you reach a milestone, you may earn a weapon. Practice with the weapon and find out your best tactic. The game also has a \"Drop System\", in which you may get hats and other weapons after playing for sometime."
    },
    {
      "headline":"Know the balance of power.",
      "description":"Only professional Scouts can kill Heavies, due to the Heavy having more damage and health than the Scout. A Pyro can reflect projectiles, meaning death to Soldiers and Demomen. Snipers are easy targets for Spies as Snipers tend to stand still while aiming and don't pay attention to their surroundings that much. Since the Sniper's vision is greatly reduced while in scope, and he will be very focused on the battlefield, Spies can speak up behind him easily. (These are the classes that balance each other out, but are not necessarily the only way to kill each class)"
    },
    {
      "headline":"Understand the game's mechanics.",
      "description":"The chance of random critical hits is higher if you dealt more damage in the past 5 seconds. Most weapons deal less damage over longer ranges. Some are not affected by range, and some actually deal more damage over longer ranges. Critical hits aren't affected by damage falloff (for example, a single critical pellet from the Scout's Scattergun will deal 18 damage at any range, with 10 pellets fired per shot)."
    }
  ],
  "text":" Play the tutorial mode first! To find it, look at the bottom of the main home page and look for a spiked ball with a graduation hat on it. You will be granted with four classes that sum up an online team during a game. The Tutorial is split into 2 sections: Basic tutorial and practicing with bots. The basic tutorial shows you how to play Solider, Demoman, Engineer, and Spy. It is strongly recommended to complete all these tutorials to get a good grasp of the types of classes. Practicing with bots is mainly used if you need to brush up on skills, or practice 1 specific class without the pressure of pvp. With Practicing with bots, often referred to as \"Offline Practice\" since you aren't play with others across the world, is recommended to grasp the mechanics of the game, but isn't required. Sometimes putting in 20 minutes of practice with bots can make a difference between a good and bad spy. Have a computer with sufficient specs for smooth gameplay. You'll have to have a constant frame rate of about 30-40 FPS to make gameplay tolerable. To add to this, play on a server with a maximum of 24 players. Team Fortress 2 was designed for this type of lag. But if you do play on a sufficiently powerful computer, it should withstand the 34 player cap. Most servers set up by Valve, under the \"Casual\" tab, are set at 24 players max. Only player-created servers will have the 34 player cap. Be conservative with video settings. Unless you're running a top-of-the-line gaming system, you'll probably benefit more from performance in an online multiplayer shooter than from visual appeal. The follow tips guarantee a nominal boost in frame rate. Put all of your settings on low if your recommended settings are medium. You may think setting sound quality to low would help, but sound is very important in TF2! Disable anti-aliasing. Learn the levels. Know which team might have the starting advantage. RED has a huge advantage over BLU team in Payload maps. With payload maps, BLU needs to push a cart with a bomb strapped to it to the end of the map. Red spawns halfway through the map at the start, and are given a minute to build up their defenses. In this time, Medics can get their charges ready and Engineers can build up some turrets. After a minute is up, BLU's doors open, and the battle begins. In most maps, RED is defending an objective from BLU. Some maps have both teams fight for 1 control point, these maps are know as King Of The Hill. Other maps require a team to steal the other's \"intelligence\" 3 times to win. The intelligence is a color briefcase full of classified documents. This mode is known as CTF. Learn the strengths and weaknesses of each class. Work out which classes are suited to which maps. In maps with an objective, Scouts are a good pick. One of Scout's strong points is he captures points and pushes payloads as fast as 2 people. Scout also runs at about 130% speed, making him the fastest class in the game. This makes scout incredibly good at capturing points and running \"circles around the enemy.\" Sniper will also be a good pick for control point maps. He must stay out of the fight, and train his rifle on the control point. To capture a control point, a player must stand on the control point for a bit of time depending on how many people are on the point. Because of this, players tend to stand still on the control points, leaving Snipers to pick away. Team Fortress 2 is a team-based game, therefore kamikaze gung-ho tactics won't work. This is not like Call of Duty, work together as one. Depending on the objective, you are either holding down an area or pushing forward. Communicate. TF2 offers a wide variety of ways to communicate with your team. You can either use the chat, both team chat and all chat (both teams see it), use pre-set voice commands, such as \"Go Right\" or \"Incoming!\". Each class has the same commands, but different ways of saying them. For the most specific, use voice chat. If you have a microphone, you can use it to say anything you want! For this reason, many parents would rather not their children use voice chat, and there are some settings in the menu to disable voice chat if you are hearing bad words. Communicating with the rest of your team is essential to winning the round, whether you're  typing in team chat. Work out a plan for maps and classes so that you know where everyone is and going to. Configure your keys. There are many functions in Team Fortress 2 bound to keys, all configurable. Put the keys where they make the most sense for you. With features like fast weapon switching turned on, you will be more effective in the heat of battle if you don't have to look at the keyboard. Survive! It's easy to keep suicidally running at the enemy shooting wildly - but don't forget that you're far more valuable to your team alive than a corpse on the frontline. Every team has a Medic to keep them alive. Call for him to heal you up. Medics can also temporarily over heal you to 150% health! If your team lacks a Medic, then become one. Every team is instantly weaker without them! Playing Medic is also a great way to learn a map, since you run around a lot while healing your teammates. (Do the same for each class. If your team lacks a lot or has none of a certain class, fill that spot! That way you will have a balance of speed, power, damage, and healing on your team.) Complete the achievements. Every achievement that you complete with a certain class counts to a special weapon that's in your taste. After you reach a milestone, you may earn a weapon. Practice with the weapon and find out your best tactic. The game also has a \"Drop System\", in which you may get hats and other weapons after playing for sometime. Know the balance of power. Only professional Scouts can kill Heavies, due to the Heavy having more damage and health than the Scout. A Pyro can reflect projectiles, meaning death to Soldiers and Demomen. Snipers are easy targets for Spies as Snipers tend to stand still while aiming and don't pay attention to their surroundings that much. Since the Sniper's vision is greatly reduced while in scope, and he will be very focused on the battlefield, Spies can speak up behind him easily. (These are the classes that balance each other out, but are not necessarily the only way to kill each class) Understand the game's mechanics. The chance of random critical hits is higher if you dealt more damage in the past 5 seconds. Most weapons deal less damage over longer ranges. Some are not affected by range, and some actually deal more damage over longer ranges. Critical hits aren't affected by damage falloff (for example, a single critical pellet from the Scout's Scattergun will deal 18 damage at any range, with 10 pellets fired per shot).",
  "tyn_model":[
    "bots",
    "scout",
    "medic",
    "computer",
    "medics",
    "sniper",
    "team fortress 2",
    "snipers",
    "spiked ball",
    "solider",
    "demoman",
    "engineer",
    "spy",
    "engineers",
    "scouts",
    "rifle",
    "voice chat",
    "microphone",
    "pyro",
    "weapons"
  ],
  "tyn_section":[

  ]
}