{
  "title":"How to Start a Local Freecycle Group",
  "url":"https://www.wikihow.com/Start-a-Local-Freecycle-Group",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Household Waste Disposal",
    "Waste Reduction"
  ],
  "steps":[
    {
      "headline":"First find out if there is already a local group in your area.",
      "description":"Visit the Freecycle.org(R) group directory and the Trash Nothing Freecycling Group Finder to search for groups near you. Note: the Trash Nothing and the Overcycle sites often return incorrect information about Freecycle.org(R) groups."
    },
    {
      "headline":"If there is already a group in your area, you can still start a new group but you should make its focus on serving a smaller (or larger) area than the existing local groups so that you aren't directly competing with the existing groups.",
      "description":""
    },
    {
      "headline":"Once you've decided to start a group in your area, you'll need to choose which website you want to run your group from.",
      "description":"The leading sites for running freecycling groups are Freecycle.org(R), trash nothing!, and Freegle (UK only). Each site has it's own advantages that you should research before choosing."
    },
    {
      "headline":"And creating a new freecycling group is only the first step!",
      "description":"To really make your group succeed, you'll need to promote your group to gain members and foster and nurture the group to help it grow."
    }
  ],
  "text":" First find out if there is already a local group in your area. Visit the Freecycle.org(R) group directory and the Trash Nothing Freecycling Group Finder to search for groups near you. Note: the Trash Nothing and the Overcycle sites often return incorrect information about Freecycle.org(R) groups. If there is already a group in your area, you can still start a new group but you should make its focus on serving a smaller (or larger) area than the existing local groups so that you aren't directly competing with the existing groups.  Once you've decided to start a group in your area, you'll need to choose which website you want to run your group from. The leading sites for running freecycling groups are Freecycle.org(R), trash nothing!, and Freegle (UK only). Each site has it's own advantages that you should research before choosing. And creating a new freecycling group is only the first step! To really make your group succeed, you'll need to promote your group to gain members and foster and nurture the group to help it grow.",
  "tyn_model":[
    "freecycling group",
    "freecycling groups"
  ],
  "tyn_section":[

  ]
}