{
  "title":"How to Recycle Plastic",
  "url":"https://www.wikihow.com/Recycle-Plastic",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Household Waste Disposal",
    "Recycling"
  ],
  "methods":[
    {
      "name":"Disposing of Plastic Properly",
      "steps":[
        {
          "headline":"Sort and prepare plastics according to instructions provided by your recycling service provider, which maybe by size, shape or type.Check the bottom of your container for type code, if required by your service provider.",
          "description":"Plastic is divided into 7 “types,” conveniently numbered 1-7. You can find this number on the bottom of whatever plastic container you’re using. Follow the instructions provided by your recycling service provider."
        },
        {
          "headline":"Clean and prepare containers according to your recycling providers instructions.",
          "description":"Some service providers ask the lids to be removed. Recycling centers can technically clean and sterilize the plastic you bring them, but because this is an intensive process, they’ll sometimes just throw out old food containers instead of recycling them. Rinse out the insides of old food containers and get rid of all the food waste to make it easier for the center to actually recycle your plastic.Use hot water and a scrubber to get as much of the food waste off of your plastic as you can. For plastic bottles, fill them with slightly soap water, then swish the water around to clean out the interior. Do be mindful of water usage and energy use associated with heating the water. For recyclable materials that can’t be easily rinsed, such as takeout containers, your best bet is to separate the dirty parts from the clean ones and throw the dirty parts in the trash."
        },
        {
          "headline":"Find out about the specifics of your community’s recycling program.",
          "description":"Many cities and towns now have recycling drop-off points or even curbside municipal recycling collection. However, every community is different, so visit your local government’s website to find out what facilities and options are available in your area. Most communities will at least have 1 or more recycling facilities, although these facilities may only accept certain types of plastic. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tIf your community offers curbside recycling, you can almost always recycle plastic labeled with a 1 or 2. However, for other types of plastic, you'll need to check with your local waste management company, because it varies from place to place."
        },
        {
          "headline":"Leave your recycling at a drop-off point to have someone pick it up.",
          "description":"If your community offers curbside pickup, you can leave your plastics in a recycling bin alongside your garbage bin on garbage day. In areas that don't have curbside pickup, there are often large recycling dumpsters around town, usually at public places like schools, churches, or municipal buildings. Make sure you’re adhering to your local government’s guidelines when dropping off your recyclables. Otherwise, this may constitute littering."
        },
        {
          "headline":"Take your plastics to a local recycling center if there’s no pickup option.",
          "description":"Search online or call your local officials to find recycling centers in your area. Be sure to ask if there are any limits on what types of plastic you can bring to the center to be recycled. For example, some recycling centers may not be able to accept plastic bags. However, you can often take these to the grocery store to be recycled. Some recycling facilities will pay a couple of cents per item that you drop off. You can make a few extra bucks by collecting recycling from your friends and neighbors and bringing it in."
        },
        {
          "headline":"Contact the recycling facility and ask if you need to sort your plastic.",
          "description":"Some recycling centers will do the sorting and cleaning for you, so you can just dump cans, plastics and papers all together. With others, you will need to separate different materials beforehand and drop them off into select containers when you take them to the facility. If your facility requires it, separate paper and cardboard, plastics, glass, and cans. This can be annoying, but like any household chore, it gets easier if you make a weekly habit of it. Note that you may be required to clean out your plastic and remove the labels as well."
        }
      ]
    },
    {
      "name":"Encouraging Recycling in Your Home or Office",
      "steps":[
        {
          "headline":"Put recycling baskets in every room that also has a trash can.",
          "description":"For best results, get blue baskets that are clearly distinguishable from trash cans. Place them near the regular trash cans so people won’t be tempted to just throw plastic in the trash out of laziness. Make sure you put these baskets in every room where plastic is used, including the kitchen or break room, bathrooms, and rooms where people tend to congregate. If you have to sort your recyclables, you can save time by getting multiple or sectioned bins so you can sort as you throw each item away."
        },
        {
          "headline":"Order a recyclables bin for curbside pickup for your home.",
          "description":"In some communities you can set your recycling out in a bin just like your trash. If your community offers this type of program, be sure to sign up for it and order the right kind of bin for your plastics. If you’re not sure if your community has this type of program, visit your city government’s website and look for residential recycling among other residential services. Sometimes, like garbage collection, this will require a one-time or annual fee, but it makes recycling so easy the expense is usually worth it. If you live in an apartment, you may have building recycling bins already."
        },
        {
          "headline":"Take out your recycling once a week to keep them from piling up.",
          "description":"Staying on top of your recyclables this way will help prevent the task of actually recycling them from becoming too intimidating. If your nearest recycling center is a little far away, take out your recycling once or twice every month instead and just store your old plastic in the meantime."
        }
      ]
    },
    {
      "name":"Reusing Old Plastic",
      "steps":[
        {
          "headline":"Refill fluid containers once they run out to avoid throwing them out.",
          "description":"If the bottle was used to hold soap, detergent, or some other cleaning liquid, it can easily be refilled from a larger bulk-sized container of that liquid. However, bacteria can easily build up in a reused bottle, so you should only use old bottles to store non-consumables. For example, be careful about drinking repeatedly from the same plastic bottle. Only reuse drinking bottles once or twice before tossing them out."
        },
        {
          "headline":"Organize your knick-knacks in your empty pill bottles.",
          "description":"From coins to loose screws to craft supplies, these small, hard plastic bottles are perfect for keeping track of all kinds of tiny objects. Just make sure you remove the labels if they have personal information on them!"
        },
        {
          "headline":"Use your old plastic bottles to make craft projects.",
          "description":"From candy dishes to elegant vases, there are lots of artsy ways you can re-purpose your empty soda bottles and thereby reduce plastic waste. Make sure you rinse out the bottles with soap and warm water first!"
        }
      ]
    }
  ],
  "text":" Disposing of Plastic Properly Sort and prepare plastics according to instructions provided by your recycling service provider, which maybe by size, shape or type.Check the bottom of your container for type code, if required by your service provider. Plastic is divided into 7 “types,” conveniently numbered 1-7. You can find this number on the bottom of whatever plastic container you’re using. Follow the instructions provided by your recycling service provider. Clean and prepare containers according to your recycling providers instructions. Some service providers ask the lids to be removed. Recycling centers can technically clean and sterilize the plastic you bring them, but because this is an intensive process, they’ll sometimes just throw out old food containers instead of recycling them. Rinse out the insides of old food containers and get rid of all the food waste to make it easier for the center to actually recycle your plastic.Use hot water and a scrubber to get as much of the food waste off of your plastic as you can. For plastic bottles, fill them with slightly soap water, then swish the water around to clean out the interior. Do be mindful of water usage and energy use associated with heating the water. For recyclable materials that can’t be easily rinsed, such as takeout containers, your best bet is to separate the dirty parts from the clean ones and throw the dirty parts in the trash. Find out about the specifics of your community’s recycling program. Many cities and towns now have recycling drop-off points or even curbside municipal recycling collection. However, every community is different, so visit your local government’s website to find out what facilities and options are available in your area. Most communities will at least have 1 or more recycling facilities, although these facilities may only accept certain types of plastic. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tIf your community offers curbside recycling, you can almost always recycle plastic labeled with a 1 or 2. However, for other types of plastic, you'll need to check with your local waste management company, because it varies from place to place. Leave your recycling at a drop-off point to have someone pick it up. If your community offers curbside pickup, you can leave your plastics in a recycling bin alongside your garbage bin on garbage day. In areas that don't have curbside pickup, there are often large recycling dumpsters around town, usually at public places like schools, churches, or municipal buildings. Make sure you’re adhering to your local government’s guidelines when dropping off your recyclables. Otherwise, this may constitute littering. Take your plastics to a local recycling center if there’s no pickup option. Search online or call your local officials to find recycling centers in your area. Be sure to ask if there are any limits on what types of plastic you can bring to the center to be recycled. For example, some recycling centers may not be able to accept plastic bags. However, you can often take these to the grocery store to be recycled. Some recycling facilities will pay a couple of cents per item that you drop off. You can make a few extra bucks by collecting recycling from your friends and neighbors and bringing it in. Contact the recycling facility and ask if you need to sort your plastic. Some recycling centers will do the sorting and cleaning for you, so you can just dump cans, plastics and papers all together. With others, you will need to separate different materials beforehand and drop them off into select containers when you take them to the facility. If your facility requires it, separate paper and cardboard, plastics, glass, and cans. This can be annoying, but like any household chore, it gets easier if you make a weekly habit of it. Note that you may be required to clean out your plastic and remove the labels as well. Encouraging Recycling in Your Home or Office Put recycling baskets in every room that also has a trash can. For best results, get blue baskets that are clearly distinguishable from trash cans. Place them near the regular trash cans so people won’t be tempted to just throw plastic in the trash out of laziness. Make sure you put these baskets in every room where plastic is used, including the kitchen or break room, bathrooms, and rooms where people tend to congregate. If you have to sort your recyclables, you can save time by getting multiple or sectioned bins so you can sort as you throw each item away. Order a recyclables bin for curbside pickup for your home. In some communities you can set your recycling out in a bin just like your trash. If your community offers this type of program, be sure to sign up for it and order the right kind of bin for your plastics. If you’re not sure if your community has this type of program, visit your city government’s website and look for residential recycling among other residential services. Sometimes, like garbage collection, this will require a one-time or annual fee, but it makes recycling so easy the expense is usually worth it. If you live in an apartment, you may have building recycling bins already. Take out your recycling once a week to keep them from piling up. Staying on top of your recyclables this way will help prevent the task of actually recycling them from becoming too intimidating. If your nearest recycling center is a little far away, take out your recycling once or twice every month instead and just store your old plastic in the meantime. Reusing Old Plastic Refill fluid containers once they run out to avoid throwing them out. If the bottle was used to hold soap, detergent, or some other cleaning liquid, it can easily be refilled from a larger bulk-sized container of that liquid. However, bacteria can easily build up in a reused bottle, so you should only use old bottles to store non-consumables. For example, be careful about drinking repeatedly from the same plastic bottle. Only reuse drinking bottles once or twice before tossing them out. Organize your knick-knacks in your empty pill bottles. From coins to loose screws to craft supplies, these small, hard plastic bottles are perfect for keeping track of all kinds of tiny objects. Just make sure you remove the labels if they have personal information on them! Use your old plastic bottles to make craft projects. From candy dishes to elegant vases, there are lots of artsy ways you can re-purpose your empty soda bottles and thereby reduce plastic waste. Make sure you rinse out the bottles with soap and warm water first!",
  "tyn_model":[
    "plastic",
    "water",
    "plastics",
    "recycling",
    "baskets",
    "bottle",
    "“types",
    "” conveniently",
    "plastic container",
    "containers",
    "hot water",
    "scrubber",
    "eco-friendly living",
    "recycling dumpsters",
    "recycling facilities",
    "cardboard",
    "glass",
    "recycling baskets",
    "trash can",
    "trash cans",
    "recyclables bin",
    "garbage",
    "bottles",
    "drinking bottles",
    "soda bottles",
    "soap"
  ],
  "tyn_section":[

  ]
}