{
  "title":"How to Make Garlic Mashed Potatoes",
  "url":"https://www.wikihow.com/Make-Garlic-Mashed-Potatoes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Potato Dishes"
  ],
  "methods":[
    {
      "name":"Simple Garlic Mashed Potatoes",
      "steps":[
        {
          "headline":"Peel and chop 1 ½ lb.",
          "description":"of baking potatoes."
        },
        {
          "headline":"Cut the potatoes.",
          "description":"Cut them crosswise in ¼-inch pieces."
        },
        {
          "headline":"Add the cubes to a deep pot.",
          "description":""
        },
        {
          "headline":"Place 6 whole peeled cloves of garlic to the pot.",
          "description":""
        },
        {
          "headline":"Add enough water to cover the potatoes.",
          "description":""
        },
        {
          "headline":"Heat the pot on high and bring the water to a boil.",
          "description":""
        },
        {
          "headline":"Let the potatoes simmer for 15 minutes.",
          "description":"The garlic flavor will start to seep in to the potatoes as they cook."
        },
        {
          "headline":"Drain the potatoes and the garlic.",
          "description":"Once you’ve drained them, return them to the pot."
        },
        {
          "headline":"Mash the potatoes with the garlic.",
          "description":"Mash them thoroughly with a masher or a large spoon or fork until the potatoes and garlic are mixed and the potatoes are fully mashed."
        },
        {
          "headline":"Add 1 1/3 cups of warmed milk to the mixture.",
          "description":"Blend the milk and the potatoes until the result is creamy and light."
        },
        {
          "headline":"Add salt and pepper to taste.",
          "description":""
        },
        {
          "headline":"Add garnish.",
          "description":"Add ½ cup of parsley to the mixture."
        },
        {
          "headline":"Serve.",
          "description":"Enjoy these simple garlic mashed potatoes as a side to a delicious piece of chicken, beef, or salmon."
        }
      ]
    },
    {
      "name":"Creamy Garlic Mashed Potatoes",
      "steps":[
        {
          "headline":"Peel and dice 3 ½ lbs.",
          "description":"of russet potatoes. Dice them into cubes that are relatively the same size."
        },
        {
          "headline":"Place them in a large saucepan.",
          "description":"Add 2 tbsp. of salt and cover the potatoes with water."
        },
        {
          "headline":"Bring the potatoes to a boil over medium-high heat.",
          "description":""
        },
        {
          "headline":"Reduce the heat to medium-low to maintain a rolling boil.",
          "description":""
        },
        {
          "headline":"Cook the potatoes until they fall apart when you poke them with a fork.",
          "description":"This should take about 10-15 minutes."
        },
        {
          "headline":"Heat 16 fluid ounces (2 cups) of half-and-half and 6 cloves of crushed garlic in a medium saucepan.",
          "description":"Heat this combination until it’s simmering. Then, remove it from the heat."
        },
        {
          "headline":"Remove the cooked potatoes from the heat.",
          "description":"Drain the water and return the potatoes to the pot."
        },
        {
          "headline":"Mash the potatoes with the garlic-cream mixture and Parmesan.",
          "description":"Add the garlic-cream mixture and 6 oz. grated Parmesan to the potatoes and mash them with a masher or large fork or spoon until the ingredients are fully combined."
        },
        {
          "headline":"Let the potatoes stand for 5 minutes.",
          "description":"This will thicken the mixture."
        },
        {
          "headline":"Serve.",
          "description":"Serve these tasty potatoes as a side to any meal."
        }
      ]
    },
    {
      "name":"Texas Style Garlic Mashed Potatoes",
      "steps":[
        {
          "headline":"Remove the papery outer skin from 1 garlic bulb.",
          "description":"Don’t peel the garlic or separate the cloves."
        },
        {
          "headline":"Cut off the top of the garlic bulb.",
          "description":""
        },
        {
          "headline":"Brush the bulb with 1 tsp.",
          "description":"of oil."
        },
        {
          "headline":"Wrap it in heavy-duty foil.",
          "description":""
        },
        {
          "headline":"Bake the bulb at 425° (218°C) for 30-35 minutes or until it’s softened.",
          "description":""
        },
        {
          "headline":"Cook 1 medium chopped white onion over 1 tsp.",
          "description":"of olive oil. Cook it for 15-20 minutes or until it’s golden brown, stirring occasionally."
        },
        {
          "headline":"Place the onion in a food processor.",
          "description":"Cover the processor and process the onion until it’s blended. Then, set it aside."
        },
        {
          "headline":"Place the potatoes in a large saucepan.",
          "description":"Cover the saucepan in water."
        },
        {
          "headline":"Bring them to a boil.",
          "description":""
        },
        {
          "headline":"Reduce the heat.",
          "description":"Continue to heat the potatoes on a medium to low setting, letting them simmer for about 15-20 minutes or when they’re soft enough to fall off of a fork."
        },
        {
          "headline":"Drain the potatoes and place them in a large bowl.",
          "description":""
        },
        {
          "headline":"Squeeze the softened garlic into the potatoes.",
          "description":""
        },
        {
          "headline":"Add the rest of the ingredients to the potatoes.",
          "description":"Mix ¼  cup of softened butter, ¼  cup of sour cream, ¼  cup of grated Parmesan cheese, ¼  cup of 2% milk, ½ tsp. of salt, and ¼  tsp. of pepper together with the potatoes."
        },
        {
          "headline":"Beat the mixture until the potatoes are mashed.",
          "description":"Use a masher or a large spoon or fork to stir and mash the ingredients until the potatoes are smooth and creamy."
        },
        {
          "headline":"Let the potatoes stand for 5 minutes.",
          "description":"This will thicken the mashed potatoes a bit."
        },
        {
          "headline":"Serve.",
          "description":"This delicious potato dish is a great side to almost any main course."
        }
      ]
    }
  ],
  "text":" Simple Garlic Mashed Potatoes Peel and chop 1 ½ lb. of baking potatoes. Cut the potatoes. Cut them crosswise in ¼-inch pieces. Add the cubes to a deep pot.  Place 6 whole peeled cloves of garlic to the pot.  Add enough water to cover the potatoes.  Heat the pot on high and bring the water to a boil.  Let the potatoes simmer for 15 minutes. The garlic flavor will start to seep in to the potatoes as they cook. Drain the potatoes and the garlic. Once you’ve drained them, return them to the pot. Mash the potatoes with the garlic. Mash them thoroughly with a masher or a large spoon or fork until the potatoes and garlic are mixed and the potatoes are fully mashed. Add 1 1/3 cups of warmed milk to the mixture. Blend the milk and the potatoes until the result is creamy and light. Add salt and pepper to taste.  Add garnish. Add ½ cup of parsley to the mixture. Serve. Enjoy these simple garlic mashed potatoes as a side to a delicious piece of chicken, beef, or salmon. Creamy Garlic Mashed Potatoes Peel and dice 3 ½ lbs. of russet potatoes. Dice them into cubes that are relatively the same size. Place them in a large saucepan. Add 2 tbsp. of salt and cover the potatoes with water. Bring the potatoes to a boil over medium-high heat.  Reduce the heat to medium-low to maintain a rolling boil.  Cook the potatoes until they fall apart when you poke them with a fork. This should take about 10-15 minutes. Heat 16 fluid ounces (2 cups) of half-and-half and 6 cloves of crushed garlic in a medium saucepan. Heat this combination until it’s simmering. Then, remove it from the heat. Remove the cooked potatoes from the heat. Drain the water and return the potatoes to the pot. Mash the potatoes with the garlic-cream mixture and Parmesan. Add the garlic-cream mixture and 6 oz. grated Parmesan to the potatoes and mash them with a masher or large fork or spoon until the ingredients are fully combined. Let the potatoes stand for 5 minutes. This will thicken the mixture. Serve. Serve these tasty potatoes as a side to any meal. Texas Style Garlic Mashed Potatoes Remove the papery outer skin from 1 garlic bulb. Don’t peel the garlic or separate the cloves. Cut off the top of the garlic bulb.  Brush the bulb with 1 tsp. of oil. Wrap it in heavy-duty foil.  Bake the bulb at 425° (218°C) for 30-35 minutes or until it’s softened.  Cook 1 medium chopped white onion over 1 tsp. of olive oil. Cook it for 15-20 minutes or until it’s golden brown, stirring occasionally. Place the onion in a food processor. Cover the processor and process the onion until it’s blended. Then, set it aside. Place the potatoes in a large saucepan. Cover the saucepan in water. Bring them to a boil.  Reduce the heat. Continue to heat the potatoes on a medium to low setting, letting them simmer for about 15-20 minutes or when they’re soft enough to fall off of a fork. Drain the potatoes and place them in a large bowl.  Squeeze the softened garlic into the potatoes.  Add the rest of the ingredients to the potatoes. Mix ¼  cup of softened butter, ¼  cup of sour cream, ¼  cup of grated Parmesan cheese, ¼  cup of 2% milk, ½ tsp. of salt, and ¼  tsp. of pepper together with the potatoes. Beat the mixture until the potatoes are mashed. Use a masher or a large spoon or fork to stir and mash the ingredients until the potatoes are smooth and creamy. Let the potatoes stand for 5 minutes. This will thicken the mashed potatoes a bit. Serve. This delicious potato dish is a great side to almost any main course.",
  "tyn_model":[
    "potatoes",
    "garlic",
    "water",
    "pot",
    "salt",
    "masher",
    "large spoon",
    "milk",
    "pepper",
    "large saucepan",
    "fork",
    "garlic-cream",
    "parmesan",
    "garlic mashed potatoes",
    "baking potatoes",
    "deep pot",
    "parsley",
    "russet potatoes",
    "half-and-half",
    "crushed garlic",
    "medium saucepan",
    "masher or large fork",
    "oil",
    "heavy-duty foil",
    "white onion",
    "olive oil",
    "food processor",
    "processor",
    "saucepan",
    "large bowl",
    "butter",
    "sour cream",
    "parmesan cheese",
    "2% milk"
  ],
  "tyn_section":[

  ]
}