{
  "title":"How to Make a Father's Day Scrapbook",
  "url":"https://www.wikihow.com/Make-a-Father%27s-Day-Scrapbook",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Scrapbooks"
  ],
  "methods":[
    {
      "name":"Father's Day Scrapbook Planning",
      "steps":[
        {
          "headline":"Gather photographs that express your relationship with your dad.",
          "description":"Choose photos that were taken over the course of many years or recent photos, depending upon what you think your father would like best. Try to gather many photographs. You do not have to use all of the photographs, but it is better to have more rather than less because you will have many creative options."
        },
        {
          "headline":"Separate the photos into themes.",
          "description":"For example, you can separate them by years, people, sports, vacations and more. Once you have all the photographs arranged into piles, you can decide if you want to concentrate on 1 area or do a scrapbook that includes the whole set."
        },
        {
          "headline":"Decide if you want to do a digital or physical scrapbook.",
          "description":"If you like to do arts and crafts, then choose the traditional scrapbooking method of finding the elements, gluing them on paper and putting them inside a binder. If you are skilled on the computer, or your dad is very tech savvy, then go with the more modern digital option. If you want to craft the scrapbook by hand, you may want to go to an arts and crafts or dedicated scrapbooking store. Find a scrapbook with a metal binder, so that you can add pages. Find base pages in the right size. You can plan out your pages 1 by 1. If you want to do a digital scrapbook, then you will want to ensure that all your photos and memorabilia are scanned into the computer. Use clip art, cutting and pasting and more to create a proof of your scrapbook and then print it. You can go to SmileBox.com or Shutterfly.com to make your scrapbook using online programs and templates. You can also use the Apple program iCollage to make a printed, email, Facebook or Flickr scrapbook."
        },
        {
          "headline":"Choose your theme.",
          "description":"After you have decided the set or sets of photographs you want to use, you can begin looking for complimentary themed items. The following are things that you can find online and in scrapbooking stores:\nLook for paper products in your theme. Many scrapbooking stores carry decorative paper, stickers and lettering in sports, vacation, hobby and patterned themes. If your theme is more general, use paper in your dad's favorite color or pattern, such as plaid, stripes or paisley. Find poems or quotes about fathers. If you can't find the words you want to use, then choose quotes from famous authors. This is similar to choosing a greeting card that says what you want to say. Look for ticket stubs, programs, pennants, children's artwork and other memorabilia that you have gathered in recent years. An advantage of scrapbooking is that you can take many seemingly unrelated elements to form an artful collage. Look for clip art, magazine images or other images that remind you of your dad. These may be used in the background to express the scrapbook's themes more clearly."
        }
      ]
    },
    {
      "name":"Father's Day Scrapbook Crafting",
      "steps":[
        {
          "headline":"Make duplicates of your photographs.",
          "description":"This is an important step if you are using old photographs, but it may not be applicable if you are using digital copies. Scan in old photographs to your computer, then print new versions before gluing pictures to a page, then save the old photographs for traditional photo albums."
        },
        {
          "headline":"Choose a title for each page of your scrapbook.",
          "description":"This will help to express your themes. Write/type on the top of the page or use scrapbook stickers to spell out the title, such as \"Vacation 2012\" or \"Daddy's Little Girl.\""
        },
        {
          "headline":"Create your scrapbook pages 1 by 1, following your chosen themes.",
          "description":"Glue the elements to the page and allow them to dry very well before placing it in your book. A scrapbook page can be simple, featuring 1 or 2 photos, or it can be filled with photos, poems and decorations. If your young child wants to make a Father's Day scrapbook, create glueless pages out of contact paper. Buy a 3 ring binder and measure pages that will fit in the binder. Cut pieces of contact paper in that size and gather elements, such as photos, stickers and children's art. Your child can lay the elements on the sticky side of the contact paper after the protective sheet has been removed. Place another piece of contact paper over the top when they are finished. Use a 3 hole punch on the page and stick it in a binder."
        },
        {
          "headline":"Consider leaving blank space in the back of your scrapbook, in order to update it in the future.",
          "description":"Whether you are printing from a digital layout or crafting a physical copy by hand, leave blank pages at the end of the scrapbook. You can update the scrapbook every year or occasionally as an extra present to your dad."
        },
        {
          "headline":"Decorate the cover of your binder or your digital page, with your father's name, the date and your name.",
          "description":"Include a good picture of the family or the 2 of you together. Print out the final copy or place all the dried pages inside the binder."
        }
      ]
    }
  ],
  "text":" Father's Day Scrapbook Planning Gather photographs that express your relationship with your dad. Choose photos that were taken over the course of many years or recent photos, depending upon what you think your father would like best. Try to gather many photographs. You do not have to use all of the photographs, but it is better to have more rather than less because you will have many creative options. Separate the photos into themes. For example, you can separate them by years, people, sports, vacations and more. Once you have all the photographs arranged into piles, you can decide if you want to concentrate on 1 area or do a scrapbook that includes the whole set. Decide if you want to do a digital or physical scrapbook. If you like to do arts and crafts, then choose the traditional scrapbooking method of finding the elements, gluing them on paper and putting them inside a binder. If you are skilled on the computer, or your dad is very tech savvy, then go with the more modern digital option. If you want to craft the scrapbook by hand, you may want to go to an arts and crafts or dedicated scrapbooking store. Find a scrapbook with a metal binder, so that you can add pages. Find base pages in the right size. You can plan out your pages 1 by 1. If you want to do a digital scrapbook, then you will want to ensure that all your photos and memorabilia are scanned into the computer. Use clip art, cutting and pasting and more to create a proof of your scrapbook and then print it. You can go to SmileBox.com or Shutterfly.com to make your scrapbook using online programs and templates. You can also use the Apple program iCollage to make a printed, email, Facebook or Flickr scrapbook. Choose your theme. After you have decided the set or sets of photographs you want to use, you can begin looking for complimentary themed items. The following are things that you can find online and in scrapbooking stores:\nLook for paper products in your theme. Many scrapbooking stores carry decorative paper, stickers and lettering in sports, vacation, hobby and patterned themes. If your theme is more general, use paper in your dad's favorite color or pattern, such as plaid, stripes or paisley. Find poems or quotes about fathers. If you can't find the words you want to use, then choose quotes from famous authors. This is similar to choosing a greeting card that says what you want to say. Look for ticket stubs, programs, pennants, children's artwork and other memorabilia that you have gathered in recent years. An advantage of scrapbooking is that you can take many seemingly unrelated elements to form an artful collage. Look for clip art, magazine images or other images that remind you of your dad. These may be used in the background to express the scrapbook's themes more clearly. Father's Day Scrapbook Crafting Make duplicates of your photographs. This is an important step if you are using old photographs, but it may not be applicable if you are using digital copies. Scan in old photographs to your computer, then print new versions before gluing pictures to a page, then save the old photographs for traditional photo albums. Choose a title for each page of your scrapbook. This will help to express your themes. Write/type on the top of the page or use scrapbook stickers to spell out the title, such as \"Vacation 2012\" or \"Daddy's Little Girl.\" Create your scrapbook pages 1 by 1, following your chosen themes. Glue the elements to the page and allow them to dry very well before placing it in your book. A scrapbook page can be simple, featuring 1 or 2 photos, or it can be filled with photos, poems and decorations. If your young child wants to make a Father's Day scrapbook, create glueless pages out of contact paper. Buy a 3 ring binder and measure pages that will fit in the binder. Cut pieces of contact paper in that size and gather elements, such as photos, stickers and children's art. Your child can lay the elements on the sticky side of the contact paper after the protective sheet has been removed. Place another piece of contact paper over the top when they are finished. Use a 3 hole punch on the page and stick it in a binder. Consider leaving blank space in the back of your scrapbook, in order to update it in the future. Whether you are printing from a digital layout or crafting a physical copy by hand, leave blank pages at the end of the scrapbook. You can update the scrapbook every year or occasionally as an extra present to your dad. Decorate the cover of your binder or your digital page, with your father's name, the date and your name. Include a good picture of the family or the 2 of you together. Print out the final copy or place all the dried pages inside the binder.",
  "tyn_model":[
    "photographs",
    "paper",
    "binder",
    "contact paper",
    "clip art",
    "scrapbooking",
    "photo albums",
    "scrapbook stickers",
    "glue",
    "3 ring binder",
    "3 hole punch"
  ],
  "tyn_section":[

  ]
}