{
  "title":"How to Get Plastic Out of Your Kitchen",
  "url":"https://www.wikihow.com/Get-Plastic-Out-of-Your-Kitchen",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Kitchens"
  ],
  "steps":[
    {
      "headline":"Replace all plastic dishware and utensils with glass, porcelain, or stainless steel dishware.",
      "description":"If you are hesitant to replace your children's plastic dishware with glass for fear it'll become broken, purchase plastic labeled as BPA-free."
    },
    {
      "headline":"Replace plastic cooking utensils with those made from wood, silicone, or stainless steel.",
      "description":"Cooking utensils made from plastic have the potential to melt, or break down slightly into your food when cooking."
    },
    {
      "headline":"Replace all plastic storage products with glass, ceramic, or BPA-free alternatives.",
      "description":"Examples of common storage containers you should replace are clear plastic wrap, plastic sandwich bags, and plastic leftover containers."
    },
    {
      "headline":"Replace your plastic or nylon cutting boards with wood or glass cutting boards.",
      "description":"When you slice into items on the cutting board, plastic remnants from the cutting board have the potential to enter and contaminate your food. Glass cutting boards are also a safe alternative to plastic, but can cause your knives to dull at a faster pace. Wood cutting boards are great as well but must be properly sterilized after use."
    },
    {
      "headline":"Install a water filter on your kitchen tap to eliminate the need for plastic water bottles.",
      "description":"Water filters can turn your tap water into healthier water that is free of pollutants and other chemicals, and can help you save the money you normally spend on bottled water."
    },
    {
      "headline":"Replace plastic on-the-go water bottles with those made from glass or stainless steel.",
      "description":"A variety of manufacturers also develop BPA-free plastic water bottles for on-the-go convenience."
    },
    {
      "headline":"Buy produce and foods from the grocery store that are not already stored in plastic wrappers and containers.",
      "description":"The plastic that resides in containers and wrappers may already have contaminated your food before you purchased it. Bring your own reusable grocery bags if your supermarket does not contain BPA-free plastic bags or containers for produce items. Reusable grocery bags are a green alternative that can lower the risk of your food becoming contaminated by plastic bags."
    },
    {
      "headline":"Replace your non-stick cookware with stainless steel or cast iron cookware.",
      "description":"Although non-stick coating can make your cooking experience relatively easier, the chemicals present in non-stick coating have been found to cause adverse health effects. Well seasoned cast iron is a great replacement for non-stick skillets."
    }
  ],
  "text":" Replace all plastic dishware and utensils with glass, porcelain, or stainless steel dishware. If you are hesitant to replace your children's plastic dishware with glass for fear it'll become broken, purchase plastic labeled as BPA-free. Replace plastic cooking utensils with those made from wood, silicone, or stainless steel. Cooking utensils made from plastic have the potential to melt, or break down slightly into your food when cooking. Replace all plastic storage products with glass, ceramic, or BPA-free alternatives. Examples of common storage containers you should replace are clear plastic wrap, plastic sandwich bags, and plastic leftover containers. Replace your plastic or nylon cutting boards with wood or glass cutting boards. When you slice into items on the cutting board, plastic remnants from the cutting board have the potential to enter and contaminate your food. Glass cutting boards are also a safe alternative to plastic, but can cause your knives to dull at a faster pace. Wood cutting boards are great as well but must be properly sterilized after use. Install a water filter on your kitchen tap to eliminate the need for plastic water bottles. Water filters can turn your tap water into healthier water that is free of pollutants and other chemicals, and can help you save the money you normally spend on bottled water. Replace plastic on-the-go water bottles with those made from glass or stainless steel. A variety of manufacturers also develop BPA-free plastic water bottles for on-the-go convenience. Buy produce and foods from the grocery store that are not already stored in plastic wrappers and containers. The plastic that resides in containers and wrappers may already have contaminated your food before you purchased it. Bring your own reusable grocery bags if your supermarket does not contain BPA-free plastic bags or containers for produce items. Reusable grocery bags are a green alternative that can lower the risk of your food becoming contaminated by plastic bags. Replace your non-stick cookware with stainless steel or cast iron cookware. Although non-stick coating can make your cooking experience relatively easier, the chemicals present in non-stick coating have been found to cause adverse health effects. Well seasoned cast iron is a great replacement for non-stick skillets.",
  "tyn_model":[
    "water",
    "cooking utensils",
    "knives",
    "water filter",
    "water filters",
    "stainless steel or cast iron cookware",
    "non-stick coating",
    "cast iron",
    "non-stick skillets"
  ],
  "tyn_section":[

  ]
}