{
  "title":"How to Crochet a Potato Chip Scarf",
  "url":"https://www.wikihow.com/Crochet-a-Potato-Chip-Scarf",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Knitting and Crochet",
    "Crochet"
  ],
  "steps":[
    {
      "headline":"Choose your yarn.",
      "description":"You want it to be the right shape and thickness, and you don't want it to fall apart, so feel a couple between your fingers  before you choose one."
    },
    {
      "headline":"Get your crochet hook.",
      "description":"The paper around your yarn says what kind you need, so this should be easy."
    },
    {
      "headline":"Chain 224 stitches.",
      "description":"This is how long your scarf will be."
    },
    {
      "headline":"Chain 1 more then turn around.",
      "description":""
    },
    {
      "headline":"Do 4 double crochets in the second stitch.",
      "description":"Do them all in the same stitch."
    },
    {
      "headline":"Now do 3 single crochets in the third, fourth, and fifth stitch.",
      "description":""
    },
    {
      "headline":"Repeat steps 3 and 4 until you get to the end of the row.",
      "description":""
    },
    {
      "headline":"If you want you can just tie it off then and there.",
      "description":"If you want it to be thicker, continue doing the pattern on rows 3 and 4."
    },
    {
      "headline":"Tie it off, and enjoy your beautiful  potato chip scarf!",
      "description":""
    }
  ],
  "text":" Choose your yarn. You want it to be the right shape and thickness, and you don't want it to fall apart, so feel a couple between your fingers  before you choose one. Get your crochet hook. The paper around your yarn says what kind you need, so this should be easy. Chain 224 stitches. This is how long your scarf will be. Chain 1 more then turn around.  Do 4 double crochets in the second stitch. Do them all in the same stitch. Now do 3 single crochets in the third, fourth, and fifth stitch.  Repeat steps 3 and 4 until you get to the end of the row.  If you want you can just tie it off then and there. If you want it to be thicker, continue doing the pattern on rows 3 and 4. Tie it off, and enjoy your beautiful  potato chip scarf! ",
  "tyn_model":[
    "yarn",
    "crochet hook",
    "potato chip scarf"
  ],
  "tyn_section":[

  ]
}