{
  "title":"How to Complete Career Mode in Need for Speed: Carbon",
  "url":"https://www.wikihow.com/Complete-Career-Mode-in-Need-for-Speed:-Carbon",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Need for Speed"
  ],
  "steps":[
    {
      "headline":"Create an alias and start your Career.",
      "description":"After creating an alias and selecting the Start Career option in the Career menu, you will be presented with a cutscene showing a flashback of what happened in the game's story five years ago. After the flashback, you will be chased by Cross in his Chevrolet Corvette Z06. You must drive down the Lookout Point canyon in your BMW M3 GTR in an attempt to escape from Cross. (This game is actually a sequel of Need For Speed: Most Wanted, where the same BMW was the main car of that game.) After a minute, the screen blacks out and a cutscene appears where you bump into the side of a truck that drops its haul on your car, totalling it. You will be presented with another cutscene afterwards, but the rest of the game's story will not be spoiled here."
    },
    {
      "headline":"Choose your car.",
      "description":"After the cutscene, you will get to choose between three cars: the Mazda RX-8 (which is a Tuner), the Chevrolet Camaro SS (which is a Muscle), and the Alfa Romeo Brera (which is an Exotic). Tuners have the greatest handling and they're also the cheapest to buy an upgrade, but they lack in top speed. Muscles have the most powerful acceleration, but they lack in handling. Exotics have the fastest top speed and they also have powerful acceleration and great handling, but they're the most expensive to buy an upgrade. Not only does choosing your car solely depend on your racing preferences, but it will also determine the cars that you're going to unlock during the Career mode, as well as determining the cars that your first two crew members (Neville and Sal) are going to drive. It's a good idea to test each car before choosing."
    },
    {
      "headline":"Complete the tutorial, complete the police chase, and create a crew.",
      "description":"After selecting your car, you, Neville, and Nikki will head to the Salazaar Street circuit where Nikki will tell you how to use your wingman (which is your active crew member). After the tutorial, you will be presented with a cutscene showing you Neville heading to Palmont City when the cops start chasing the both of you. After a minute, the two of you split up and you'll be in a pursuit with three cops chasing you. After escaping the police chase, Neville will send you a message telling you to meet him at a safe house. An arrow will appear above your car, telling you where to go. After arriving at the safe house, you will go to the Crew Management screen where you will set Neville as your wingman. Then you will choose your crew logo and its colors. (You can always change this later.) Afterwards, you will also choose the name of your crew. (Unlike your crew logo, this can never be changed later on, so make sure you're satisfied with the name before confirming it.) After confirming your crew's name, a cutscene appears where Nikki tells you about how Palmont City is split up into territories controlled by crews, the major crews being Kenji and his Bushido, Angie and her 21st Street crew, and Wolf and his TFK."
    },
    {
      "headline":"Win races.",
      "description":"Most of the game is self-explanatory if you read the on-screen directions. Every time you win a race, you will get a decent amount of cash. Depending on the race, you will also unlock one or two performance upgrades, a few visual upgrades, or a car."
    },
    {
      "headline":"Own territory by winning two out of three races in that territory.",
      "description":"Afterwards, you'll unlock one or two performance upgrades or a car."
    },
    {
      "headline":"Once you own every piece of territory in an area, you will be challenged by that area's boss.",
      "description":"You might have noticed that one of the five territories in each area has only two races instead of three. That's because the third race is the boss race, which remains hidden until the boss challenges you. After accepting the boss's challenge, you will have to race them twice. The first race is a normal Circuit race. If you manage to win, you'll have to win against them in a Canyon Duel. In this type of race, two racers will take turns following each other down a narrow, curvy, and dangerous canyon road. On the first run, you will be following the boss to collect as many points as possible. On the second run, the boss will be following you to take away as many of your points as possible. If your points decrease to 0, you lose. If you fall off one of the cliffs, fall behind the boss for ten seconds on the first run, or get passed by the boss for ten seconds on the second run, you automatically lose. Colliding with the boss's car will cause you to lose 5,000 points on the first run, but colliding with their car on the second run. will cause you gain 5,000 points. This could be used as an advantage to prevent your points from decreasing to 0. Once you win the Canyon Duel, you officially own that area. After you defeat the boss, you have the opportunity to select between six markers. The first four are random while the last two are visual upgrades for your car. You only get two choices, so if you want the boss's car, pick two out of the first four markers. It is highly recommended that you disable Autosave before racing the boss just in case. When you have picked your two markers, your car will spawn where the first boss race started and you will receive a message from one of the boss's crew members, telling you to meet them somewhere. An arrow will appear above your head telling you where to go. Once you get to your destination, the crew member reveals another small part of the story, as well as switching over to your side. After defeating the first boss, you will receive a message from Nikki explaining Race Wars, which are circuit races with 19 opponents (only 11 in the PC version) instead of the usual 6 (not including your wingman). These are unlocked after you officially own an area. While they are optional, it is recommended that you do them. (Note: Race Wars do not appear in the Wii, GameCube, or PS2 versions.)"
    },
    {
      "headline":"After you own every piece of territory in Silverton, you will be challenged by the combined effort of Kenji, Angie, and Wolf.",
      "description":"First, you'll race Kenji, Angie and Wolf in a Canyon Sprint race, then you'll race them in a regular Sprint race. After you win, you'll race Darius in a Circuit race, then in a Canyon Duel. Once you win, you will have completed the Career mode."
    },
    {
      "headline":"Now that you have completed Career mode, celebrate by taking a break, reviewing what you did, and planning what to do next.",
      "description":""
    },
    {
      "headline":"There are things still left over to do.",
      "description":"Customize cars in My Cars, try the Challenge Series, race in Quick Race, complete the Reward Cards, and maybe play Career mode again using a different car."
    }
  ],
  "text":" Create an alias and start your Career. After creating an alias and selecting the Start Career option in the Career menu, you will be presented with a cutscene showing a flashback of what happened in the game's story five years ago. After the flashback, you will be chased by Cross in his Chevrolet Corvette Z06. You must drive down the Lookout Point canyon in your BMW M3 GTR in an attempt to escape from Cross. (This game is actually a sequel of Need For Speed: Most Wanted, where the same BMW was the main car of that game.) After a minute, the screen blacks out and a cutscene appears where you bump into the side of a truck that drops its haul on your car, totalling it. You will be presented with another cutscene afterwards, but the rest of the game's story will not be spoiled here. Choose your car. After the cutscene, you will get to choose between three cars: the Mazda RX-8 (which is a Tuner), the Chevrolet Camaro SS (which is a Muscle), and the Alfa Romeo Brera (which is an Exotic). Tuners have the greatest handling and they're also the cheapest to buy an upgrade, but they lack in top speed. Muscles have the most powerful acceleration, but they lack in handling. Exotics have the fastest top speed and they also have powerful acceleration and great handling, but they're the most expensive to buy an upgrade. Not only does choosing your car solely depend on your racing preferences, but it will also determine the cars that you're going to unlock during the Career mode, as well as determining the cars that your first two crew members (Neville and Sal) are going to drive. It's a good idea to test each car before choosing. Complete the tutorial, complete the police chase, and create a crew. After selecting your car, you, Neville, and Nikki will head to the Salazaar Street circuit where Nikki will tell you how to use your wingman (which is your active crew member). After the tutorial, you will be presented with a cutscene showing you Neville heading to Palmont City when the cops start chasing the both of you. After a minute, the two of you split up and you'll be in a pursuit with three cops chasing you. After escaping the police chase, Neville will send you a message telling you to meet him at a safe house. An arrow will appear above your car, telling you where to go. After arriving at the safe house, you will go to the Crew Management screen where you will set Neville as your wingman. Then you will choose your crew logo and its colors. (You can always change this later.) Afterwards, you will also choose the name of your crew. (Unlike your crew logo, this can never be changed later on, so make sure you're satisfied with the name before confirming it.) After confirming your crew's name, a cutscene appears where Nikki tells you about how Palmont City is split up into territories controlled by crews, the major crews being Kenji and his Bushido, Angie and her 21st Street crew, and Wolf and his TFK. Win races. Most of the game is self-explanatory if you read the on-screen directions. Every time you win a race, you will get a decent amount of cash. Depending on the race, you will also unlock one or two performance upgrades, a few visual upgrades, or a car. Own territory by winning two out of three races in that territory. Afterwards, you'll unlock one or two performance upgrades or a car. Once you own every piece of territory in an area, you will be challenged by that area's boss. You might have noticed that one of the five territories in each area has only two races instead of three. That's because the third race is the boss race, which remains hidden until the boss challenges you. After accepting the boss's challenge, you will have to race them twice. The first race is a normal Circuit race. If you manage to win, you'll have to win against them in a Canyon Duel. In this type of race, two racers will take turns following each other down a narrow, curvy, and dangerous canyon road. On the first run, you will be following the boss to collect as many points as possible. On the second run, the boss will be following you to take away as many of your points as possible. If your points decrease to 0, you lose. If you fall off one of the cliffs, fall behind the boss for ten seconds on the first run, or get passed by the boss for ten seconds on the second run, you automatically lose. Colliding with the boss's car will cause you to lose 5,000 points on the first run, but colliding with their car on the second run. will cause you gain 5,000 points. This could be used as an advantage to prevent your points from decreasing to 0. Once you win the Canyon Duel, you officially own that area. After you defeat the boss, you have the opportunity to select between six markers. The first four are random while the last two are visual upgrades for your car. You only get two choices, so if you want the boss's car, pick two out of the first four markers. It is highly recommended that you disable Autosave before racing the boss just in case. When you have picked your two markers, your car will spawn where the first boss race started and you will receive a message from one of the boss's crew members, telling you to meet them somewhere. An arrow will appear above your head telling you where to go. Once you get to your destination, the crew member reveals another small part of the story, as well as switching over to your side. After defeating the first boss, you will receive a message from Nikki explaining Race Wars, which are circuit races with 19 opponents (only 11 in the PC version) instead of the usual 6 (not including your wingman). These are unlocked after you officially own an area. While they are optional, it is recommended that you do them. (Note: Race Wars do not appear in the Wii, GameCube, or PS2 versions.) After you own every piece of territory in Silverton, you will be challenged by the combined effort of Kenji, Angie, and Wolf. First, you'll race Kenji, Angie and Wolf in a Canyon Sprint race, then you'll race them in a regular Sprint race. After you win, you'll race Darius in a Circuit race, then in a Canyon Duel. Once you win, you will have completed the Career mode. Now that you have completed Career mode, celebrate by taking a break, reviewing what you did, and planning what to do next.  There are things still left over to do. Customize cars in My Cars, try the Challenge Series, race in Quick Race, complete the Reward Cards, and maybe play Career mode again using a different car.",
  "tyn_model":[
    "neville",
    "car",
    "wolf",
    "truck",
    "tuners",
    "cliffs",
    "autosave",
    "race wars"
  ],
  "tyn_section":[

  ]
}