{
  "title":"How to Download and Use Zelda Classic",
  "url":"https://www.wikihow.com/Download-and-Use-Zelda-Classic",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "The Legend of Zelda Series"
  ],
  "steps":[
    {
      "headline":"Download ZC.",
      "description":"Once it is downloaded, double left click on ZQuest-W."
    },
    {
      "headline":"Experiment with all + - page down (Page Down) [pg dn] {Pg Dn} Page Up [pg up] {Pg Up} (Page Up) etc.",
      "description":"buttons."
    },
    {
      "headline":"Left click on the tiles and make some tiles.",
      "description":""
    },
    {
      "headline":"Be sure to add a stairs tile.",
      "description":"Go to Edit Strings and make some strings."
    },
    {
      "headline":"G Ama guy/girl/etc.",
      "description":"desired and also S to be able to choose string and choose string."
    },
    {
      "headline":"Save Quest as experiment quest.qst and then open up zelda-w, but be sure ZQuest-W is closed though.",
      "description":""
    },
    {
      "headline":"Load experiment quest.qst.",
      "description":""
    },
    {
      "headline":"Play, and when done, press F8 and then Enter or Return or both twice.",
      "description":""
    },
    {
      "headline":"Experiment with the tiles.",
      "description":""
    },
    {
      "headline":"Have fun making quests and do a search engine (Google or Yahoo or Bing or Ask or blekko as some examples) of quests such as A Hero Without A Name Zelda Classic Quest so you can download and play other quests.",
      "description":""
    }
  ],
  "text":" Download ZC. Once it is downloaded, double left click on ZQuest-W. Experiment with all + - page down (Page Down) [pg dn] {Pg Dn} Page Up [pg up] {Pg Up} (Page Up) etc. buttons. Left click on the tiles and make some tiles.  Be sure to add a stairs tile. Go to Edit Strings and make some strings. G Ama guy/girl/etc. desired and also S to be able to choose string and choose string. Save Quest as experiment quest.qst and then open up zelda-w, but be sure ZQuest-W is closed though.  Load experiment quest.qst.  Play, and when done, press F8 and then Enter or Return or both twice.  Experiment with the tiles.  Have fun making quests and do a search engine (Google or Yahoo or Bing or Ask or blekko as some examples) of quests such as A Hero Without A Name Zelda Classic Quest so you can download and play other quests. ",
  "tyn_model":[
    "tiles"
  ],
  "tyn_section":[

  ]
}