{
  "title":"How to Make Hardened Yogurt Raisins",
  "url":"https://www.wikihow.com/Make-Hardened-Yogurt-Raisins",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "parts":[
    {
      "name":"Preparation of Yogurt Cream Cheese",
      "steps":[
        {
          "headline":"Gather your equipment and ingredients.",
          "description":"You will need a large bowl, sieve or colander and a clean, fine-weave, linen or fine cotton dishcloth or cheesecloth and 1 quart (approx 950mls) of yogurt."
        },
        {
          "headline":"Line the sieve with the dishcloth or cheesecloth and place over the bowl.",
          "description":"Fill the sieve with the yogurt and cover with cling film. Place in the refrigerator for at least 6 hours, preferably overnight. The whey will drain out of the yogurt into the bowl, leaving a thick, rich yoghurt cheese."
        }
      ]
    },
    {
      "name":"Preparation of Raisins",
      "steps":[
        {
          "headline":"Fill the bottom of a double boiler with boiling water.",
          "description":""
        },
        {
          "headline":"Place steamer basket atop the boiling water on the stove.",
          "description":""
        },
        {
          "headline":"Allow raisins to steam in the steamer for 5 minutes.",
          "description":"Be sure to cover the steamer with the lid, while steaming."
        },
        {
          "headline":"Mix the yogurt and butter in a saucepan and cook over low heat until combined.",
          "description":""
        },
        {
          "headline":"Remove from burner.",
          "description":"Add the powdered sugar and beat until the mixture is thick and creamy. You may use an electric mixer to make this easier."
        },
        {
          "headline":"Add the vanilla extract to the mixture, if using.",
          "description":""
        },
        {
          "headline":"Drop the raisins into the sugar, cream cheese and butter mixture.",
          "description":"Coat well."
        },
        {
          "headline":"Use a teaspoon to drop the yogurt raisins onto waxed paper.",
          "description":""
        },
        {
          "headline":"Let raisins cool and dry for several hours.",
          "description":""
        },
        {
          "headline":"Repeat dropping the raisins into the mixture to double-coat them—if you want a thicker coat of yogurt on your raisins or for deeper, sweeter taste.",
          "description":""
        },
        {
          "headline":"Finish up the recipe.",
          "description":"Place the yogurt raisins on your favorite platter dish and serve."
        }
      ]
    }
  ],
  "text":" Preparation of Yogurt Cream Cheese Gather your equipment and ingredients. You will need a large bowl, sieve or colander and a clean, fine-weave, linen or fine cotton dishcloth or cheesecloth and 1 quart (approx 950mls) of yogurt. Line the sieve with the dishcloth or cheesecloth and place over the bowl. Fill the sieve with the yogurt and cover with cling film. Place in the refrigerator for at least 6 hours, preferably overnight. The whey will drain out of the yogurt into the bowl, leaving a thick, rich yoghurt cheese. Preparation of Raisins Fill the bottom of a double boiler with boiling water.  Place steamer basket atop the boiling water on the stove.  Allow raisins to steam in the steamer for 5 minutes. Be sure to cover the steamer with the lid, while steaming. Mix the yogurt and butter in a saucepan and cook over low heat until combined.  Remove from burner. Add the powdered sugar and beat until the mixture is thick and creamy. You may use an electric mixer to make this easier. Add the vanilla extract to the mixture, if using.  Drop the raisins into the sugar, cream cheese and butter mixture. Coat well. Use a teaspoon to drop the yogurt raisins onto waxed paper.  Let raisins cool and dry for several hours.  Repeat dropping the raisins into the mixture to double-coat them—if you want a thicker coat of yogurt on your raisins or for deeper, sweeter taste.  Finish up the recipe. Place the yogurt raisins on your favorite platter dish and serve.",
  "tyn_model":[
    "yogurt",
    "sieve",
    "bowl",
    "water",
    "steamer",
    "butter",
    "yogurt raisins",
    "yogurt cream cheese",
    "colander",
    "fine-weave, linen or fine cotton dishcloth or cheesecloth",
    "refrigerator",
    "double boiler",
    "steamer basket",
    "stove",
    "saucepan",
    "powdered sugar",
    "electric mixer",
    "vanilla extract",
    "sugar",
    "cream cheese",
    "waxed paper",
    "—if"
  ],
  "tyn_section":[

  ]
}