{
  "title":"How to Remove Gum from Clothes",
  "url":"https://www.wikihow.com/Remove-Gum-from-Clothes",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Stain Removal",
    "Food Stains",
    "Gum Removal"
  ],
  "methods":[
    {
      "name":"Liquid Laundry Soap",
      "steps":[
        {
          "headline":"Cover the area affected by gum in liquid laundry soap.",
          "description":""
        },
        {
          "headline":"Use a toothbrush to work the laundry soap into the gum.",
          "description":"This will break it up."
        },
        {
          "headline":"Use a blunt knife and gently scrape away at the gum.",
          "description":""
        },
        {
          "headline":"Lastly, use your fingernail to scrape the remaining gum off the fabric.",
          "description":""
        },
        {
          "headline":"Throw the garment in the washing machine.",
          "description":"Launder as usual."
        }
      ]
    },
    {
      "name":"Ironing",
      "steps":[
        {
          "headline":"Place the garment or fabric on top of some cardboard so that the gum is between the fabric and the cardboard.",
          "description":""
        },
        {
          "headline":"Iron the affected areas on medium setting.",
          "description":"The gum should transfer onto the cardboard from the garment or fabric."
        },
        {
          "headline":"Repeat until nearly all the gum has transferred from the clothing to the cardboard.",
          "description":""
        },
        {
          "headline":"Wash the garment or fabric.",
          "description":"The gum should be completely removed."
        }
      ]
    },
    {
      "name":"Rubbing Alcohol",
      "steps":[
        {
          "headline":"Use rubbing alcohol for delicate fabrics.",
          "description":"Rubbing alcohol will not stain or remove colors from fabrics."
        },
        {
          "headline":"Take a rag or sponge and pour on only a little rubbing alcohol.",
          "description":""
        },
        {
          "headline":"Rub the gum with the sponge.",
          "description":"Wait a couple minutes for alcohol to take effect."
        },
        {
          "headline":"With a spatula or wooden sponge, gently attack the gum.",
          "description":"You should be able to remove it easier than normal."
        },
        {
          "headline":"Soak the area with scented fabric softener, if desired, and wash with soap and water.",
          "description":"Rinse and dry."
        }
      ]
    },
    {
      "name":"Freezing",
      "steps":[
        {
          "headline":"Fold the garment or fabric so that the gum faces outwards.",
          "description":"You should be able to see the gum."
        },
        {
          "headline":"Place the garment or fabric into plastic bag.",
          "description":"Make sure the gum does not stick to the bag. If you can't figure out a way to keep the gum from sticking to the bag, place it on top of the bag."
        },
        {
          "headline":"Seal the bag and place into the freezer for several hours.",
          "description":"You want the gum to freeze. Depending on the size of the gum and the garment, it should take about two or three hours. If you put the fabric on top of the bag rather than in it, make sure there's enough room in the freezer so that the clothing isn't touching anything in there except the plastic bag it's sitting on. Try to limit cross-contamination."
        },
        {
          "headline":"Remove garment or fabric from the freezer.",
          "description":"Open the bag and take out the contents."
        },
        {
          "headline":"Peel the gum off the clothing as quickly as possible.",
          "description":"Use an old, dull knife or a butter knife (to avoid cutting the fabric). Do not allow the gum to thaw out, as the freezing solidifies it and makes it easier to scrape off. If the gum does thaw out before you get it all off, freeze the garment again or use an ice cube (see Tips below)."
        }
      ]
    },
    {
      "name":"Boiling",
      "steps":[
        {
          "headline":"Submerge the area affected by gum in very hot water.",
          "description":""
        },
        {
          "headline":"While submerged, scrape off the gum with a toothbrush, knife or putty knife.",
          "description":""
        },
        {
          "headline":"Scrub the fabric while still immersed in boiling water.",
          "description":""
        },
        {
          "headline":"Let the garment dry and repeat as necessary.",
          "description":""
        },
        {
          "headline":"Alternately, use the kettle method to boil away the gum.",
          "description":"Boil some hot water in a kettle. Place the area affected by the gum directly over (not into) the mouth of the kettle, so the steam hits it directly. Leave for one minute or so while steam softens the gum. Scrub in one direction with a toothbrush to remove gum."
        }
      ]
    },
    {
      "name":"Label Remover",
      "steps":[
        {
          "headline":"Use a label remover spray, such as Servisol Label Remover 130, to spray the area.",
          "description":""
        },
        {
          "headline":"Leave for 1 minute.",
          "description":"The adhesive remover spray will take time to work."
        },
        {
          "headline":"Using a fine brass wire brush, brush out the gum.",
          "description":"The gum should come out without much effort."
        },
        {
          "headline":"Add some soap to the area and rinse out the label remover.",
          "description":"The label remover should clean easily from clothes or fabric, but if you're unsure you'll be able to get it out, test it on a rag first."
        }
      ]
    },
    {
      "name":"Vinegar",
      "steps":[
        {
          "headline":"Heat a cup of vinegar in the microwave or on the stove.",
          "description":"Bring to just below a boil."
        },
        {
          "headline":"Dip a toothbrush in the hot vinegar and rub the gum with the toothbrush.",
          "description":"Do this quickly, since the vinegar works best when it's hot."
        },
        {
          "headline":"Continue dipping and rubbing until the gum is gone.",
          "description":"Reheat the vinegar as needed."
        },
        {
          "headline":"Wash the garment to remove the vinegar smell.",
          "description":""
        }
      ]
    },
    {
      "name":"Goof Off",
      "steps":[
        {
          "headline":"Acquire some Goof Off.",
          "description":"Goof off is a heavy-duty stain and spot remover that works well on gum. It's available at most hardware stores. There is a product called Goo Gone that also works very well and washes easily out of clothing. You can get it at most grocery, drug, or department stores, or online."
        },
        {
          "headline":"Squirt a little Goof Off on a hidden area to make sure it won't remove color.",
          "description":"Alternately, use a similar, but unwanted, fabric to check whether Goof Off removes color."
        },
        {
          "headline":"Squirt some Goof Off on the gum.",
          "description":"Immediately scrape with a butter knife."
        },
        {
          "headline":"Rub remaining gum with paper towel to remove residue.",
          "description":"You may have to squirt a little more Goof Off onto the gum residue in order to remove completely."
        },
        {
          "headline":"Leave garment outside until Goof Off completely evaporates.",
          "description":""
        }
      ]
    },
    {
      "name":"Hair Spray",
      "steps":[
        {
          "headline":"Spray a small amount of hair spray directly on to the gum.",
          "description":"It should harden because of the hair spray."
        },
        {
          "headline":"Immediately scrape or pick gum off.",
          "description":"The hardened gum should break off fairly easily."
        },
        {
          "headline":"Continue until all gum is removed.",
          "description":"Wash as normal."
        }
      ]
    },
    {
      "name":"Duct Tape",
      "steps":[
        {
          "headline":"Cut a strip of duct tape off its roll.",
          "description":""
        },
        {
          "headline":"Take the duct tape and press it firmly on the gum.",
          "description":"Cover all of the gum's surface area, if possible. Be careful not to tape the entire strip of duct tape to the garment or fabric or getting it off will be doubly difficult."
        },
        {
          "headline":"Peel off taped area.",
          "description":"Remove gum from duct tape manually or cut off a new strip to repeat."
        },
        {
          "headline":"Repeat until all the gum is removed.",
          "description":""
        }
      ]
    },
    {
      "name":"Lanacane Method",
      "steps":[
        {
          "headline":"Remove as much of the gum as possible.",
          "description":"Less surface area on the gum means less gum to remove."
        },
        {
          "headline":"Apply some Lanacane to the gum, waiting 30 seconds or less.",
          "description":"Lanacane is available at drug stores or grocery stores. Lanacane contains Ethanol, Isobutane, Glycol, and Acetate. This group of chemicals speeds up the release of the gum."
        },
        {
          "headline":"Scrape gum with a blunt knife.",
          "description":"A knife with a good edge might work better, but it has a higher chance of cutting through your fabric."
        },
        {
          "headline":"Wash as usual.",
          "description":""
        }
      ]
    },
    {
      "name":"Gasoline (Petrol) or Lighter Fluid",
      "steps":[
        {
          "headline":"Put some gas on the cloth where you have gum.",
          "description":"Gas dissolves the gum. Be careful handling the gasoline, since it is flammable and hazardous. Use as little as will work."
        },
        {
          "headline":"With a knife, toothbrush, or putty knife, wife away any excess gum still left over.",
          "description":""
        },
        {
          "headline":"Soak the clothing, by itself, and then wash, according to its normal laundering instructions.",
          "description":"This should remove any odor or color left over from the gas dissolution."
        },
        {
          "headline":"If you don't have any gas, use lighter fluid.",
          "description":"Soak the back of the area where gum is stuck in old fashioned lighter fluid — the kind that comes in a can used to fill old style cigarette lighters. Turn the item back over, and you should be able to easily scrape away the gum. Use a little more to finish the job, then rinse thoroughly before you launder it or clean as usual. Neither home nor commercial washers and (especially) dryers are intended to dispose of flammable liquids."
        }
      ]
    },
    {
      "name":"Orange Oil",
      "steps":[
        {
          "headline":"Use commercially available orange oil extract, derived from orange peel.",
          "description":""
        },
        {
          "headline":"Apply a small amount of oil to a clean rag or sponge.",
          "description":""
        },
        {
          "headline":"Brush with the grain of the cloth to remove gum.",
          "description":"Use a dull knife or spatula if necessary."
        },
        {
          "headline":"Wash clothes as per normal instructions.",
          "description":""
        }
      ]
    },
    {
      "name":"WD40",
      "steps":[
        {
          "headline":"Spray some WD40 on the area affected by gum.",
          "description":""
        },
        {
          "headline":"Rub off gum with a cloth or brush.",
          "description":""
        },
        {
          "headline":"Wash as usual.",
          "description":""
        },
        {
          "headline":"All clean!",
          "description":""
        }
      ]
    }
  ],
  "text":" Liquid Laundry Soap Cover the area affected by gum in liquid laundry soap.  Use a toothbrush to work the laundry soap into the gum. This will break it up. Use a blunt knife and gently scrape away at the gum.  Lastly, use your fingernail to scrape the remaining gum off the fabric.  Throw the garment in the washing machine. Launder as usual. Ironing Place the garment or fabric on top of some cardboard so that the gum is between the fabric and the cardboard.  Iron the affected areas on medium setting. The gum should transfer onto the cardboard from the garment or fabric. Repeat until nearly all the gum has transferred from the clothing to the cardboard.  Wash the garment or fabric. The gum should be completely removed. Rubbing Alcohol Use rubbing alcohol for delicate fabrics. Rubbing alcohol will not stain or remove colors from fabrics. Take a rag or sponge and pour on only a little rubbing alcohol.  Rub the gum with the sponge. Wait a couple minutes for alcohol to take effect. With a spatula or wooden sponge, gently attack the gum. You should be able to remove it easier than normal. Soak the area with scented fabric softener, if desired, and wash with soap and water. Rinse and dry. Freezing Fold the garment or fabric so that the gum faces outwards. You should be able to see the gum. Place the garment or fabric into plastic bag. Make sure the gum does not stick to the bag. If you can't figure out a way to keep the gum from sticking to the bag, place it on top of the bag. Seal the bag and place into the freezer for several hours. You want the gum to freeze. Depending on the size of the gum and the garment, it should take about two or three hours. If you put the fabric on top of the bag rather than in it, make sure there's enough room in the freezer so that the clothing isn't touching anything in there except the plastic bag it's sitting on. Try to limit cross-contamination. Remove garment or fabric from the freezer. Open the bag and take out the contents. Peel the gum off the clothing as quickly as possible. Use an old, dull knife or a butter knife (to avoid cutting the fabric). Do not allow the gum to thaw out, as the freezing solidifies it and makes it easier to scrape off. If the gum does thaw out before you get it all off, freeze the garment again or use an ice cube (see Tips below). Boiling Submerge the area affected by gum in very hot water.  While submerged, scrape off the gum with a toothbrush, knife or putty knife.  Scrub the fabric while still immersed in boiling water.  Let the garment dry and repeat as necessary.  Alternately, use the kettle method to boil away the gum. Boil some hot water in a kettle. Place the area affected by the gum directly over (not into) the mouth of the kettle, so the steam hits it directly. Leave for one minute or so while steam softens the gum. Scrub in one direction with a toothbrush to remove gum. Label Remover Use a label remover spray, such as Servisol Label Remover 130, to spray the area.  Leave for 1 minute. The adhesive remover spray will take time to work. Using a fine brass wire brush, brush out the gum. The gum should come out without much effort. Add some soap to the area and rinse out the label remover. The label remover should clean easily from clothes or fabric, but if you're unsure you'll be able to get it out, test it on a rag first. Vinegar Heat a cup of vinegar in the microwave or on the stove. Bring to just below a boil. Dip a toothbrush in the hot vinegar and rub the gum with the toothbrush. Do this quickly, since the vinegar works best when it's hot. Continue dipping and rubbing until the gum is gone. Reheat the vinegar as needed. Wash the garment to remove the vinegar smell.  Goof Off Acquire some Goof Off. Goof off is a heavy-duty stain and spot remover that works well on gum. It's available at most hardware stores. There is a product called Goo Gone that also works very well and washes easily out of clothing. You can get it at most grocery, drug, or department stores, or online. Squirt a little Goof Off on a hidden area to make sure it won't remove color. Alternately, use a similar, but unwanted, fabric to check whether Goof Off removes color. Squirt some Goof Off on the gum. Immediately scrape with a butter knife. Rub remaining gum with paper towel to remove residue. You may have to squirt a little more Goof Off onto the gum residue in order to remove completely. Leave garment outside until Goof Off completely evaporates.  Hair Spray Spray a small amount of hair spray directly on to the gum. It should harden because of the hair spray. Immediately scrape or pick gum off. The hardened gum should break off fairly easily. Continue until all gum is removed. Wash as normal. Duct Tape Cut a strip of duct tape off its roll.  Take the duct tape and press it firmly on the gum. Cover all of the gum's surface area, if possible. Be careful not to tape the entire strip of duct tape to the garment or fabric or getting it off will be doubly difficult. Peel off taped area. Remove gum from duct tape manually or cut off a new strip to repeat. Repeat until all the gum is removed.  Lanacane Method Remove as much of the gum as possible. Less surface area on the gum means less gum to remove. Apply some Lanacane to the gum, waiting 30 seconds or less. Lanacane is available at drug stores or grocery stores. Lanacane contains Ethanol, Isobutane, Glycol, and Acetate. This group of chemicals speeds up the release of the gum. Scrape gum with a blunt knife. A knife with a good edge might work better, but it has a higher chance of cutting through your fabric. Wash as usual.  Gasoline (Petrol) or Lighter Fluid Put some gas on the cloth where you have gum. Gas dissolves the gum. Be careful handling the gasoline, since it is flammable and hazardous. Use as little as will work. With a knife, toothbrush, or putty knife, wife away any excess gum still left over.  Soak the clothing, by itself, and then wash, according to its normal laundering instructions. This should remove any odor or color left over from the gas dissolution. If you don't have any gas, use lighter fluid. Soak the back of the area where gum is stuck in old fashioned lighter fluid — the kind that comes in a can used to fill old style cigarette lighters. Turn the item back over, and you should be able to easily scrape away the gum. Use a little more to finish the job, then rinse thoroughly before you launder it or clean as usual. Neither home nor commercial washers and (especially) dryers are intended to dispose of flammable liquids. Orange Oil Use commercially available orange oil extract, derived from orange peel.  Apply a small amount of oil to a clean rag or sponge.  Brush with the grain of the cloth to remove gum. Use a dull knife or spatula if necessary. Wash clothes as per normal instructions.  WD40 Spray some WD40 on the area affected by gum.  Rub off gum with a cloth or brush.  Wash as usual.  All clean! ",
  "tyn_model":[
    "fabric",
    "vinegar",
    "duct tape",
    "cardboard",
    "rubbing alcohol",
    "lanacane",
    "laundry soap",
    "sponge",
    "water",
    "freezer",
    "kettle",
    "label remover",
    "hair spray",
    "spatula",
    "soap",
    "butter knife",
    "putty knife",
    "knife",
    "lighter fluid",
    "orange oil",
    "ironing",
    "iron",
    "wooden sponge",
    "scented fabric softener",
    "plastic bag",
    "ice cube",
    "hot water",
    "label remover spray",
    "servisol label remover",
    "adhesive remover",
    "microwave",
    "goof off",
    "goo gone",
    "paper towel",
    "goof",
    "acetate",
    "gasoline",
    "— the",
    "orange peel",
    "oil",
    "wd40"
  ],
  "tyn_section":[

  ]
}