{
  "title":"How to Chip Your Own Wood",
  "url":"https://www.wikihow.com/Chip-Your-Own-Wood",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Woodworking",
    "Wood"
  ],
  "steps":[
    {
      "headline":"Purchase a small wood chipper.",
      "description":"A small chipper designed for backyard use can be a good investment, especially if you regularly prune trees and shrubs on your property. If you don’t chip the wood, you’ll have to haul it away or pay someone else to haul it away."
    },
    {
      "headline":"Read the operating instructions thoroughly before you begin chipping.",
      "description":""
    },
    {
      "headline":"Take all suggested safety precautions.",
      "description":""
    },
    {
      "headline":"Inspect the material you plan to chip.",
      "description":"Make sure it is free of stones, gravel or metal."
    },
    {
      "headline":"Snap large branches in half and tear off small shoots from the branches before you turn on the chipper.",
      "description":"Small bits of wood will feed into the chipper easier."
    },
    {
      "headline":"Make sure the wood chip bag is tightly secured to the hopper.",
      "description":""
    },
    {
      "headline":"Stand well to the side of the chipper when you are feeding wood into it.",
      "description":"The machine can kick out larger pieces of wood; standing to the side will ensure the wood pieces don’t strike you."
    },
    {
      "headline":"Use a long stick or pole to help you feed wood directly into the chipper.",
      "description":"Never put your hands into the hopper while the chipper is running, either to feed the wood, or to remove a wood jam."
    },
    {
      "headline":"Wear protective equipment.",
      "description":"Protect your eyes with OSHA approved safety glasses or goggles. Protect your hearing with ear plugs or ear protectors. Protect your head by wearing an hard hat. Protect your feet by wearing steel-toed safety shoes or boots. Don’t wear baggy clothes, jewelry or loose belts or scarves."
    },
    {
      "headline":"Never operate your wood chipper around children or allow a child to help you.",
      "description":""
    },
    {
      "headline":"Never attempt to clear a wood jam while the chipper is running.",
      "description":""
    },
    {
      "headline":"Get training on safe work procedures based on chipper manufacturer recommendations if you are not comfortable operating your wood chipper.",
      "description":""
    }
  ],
  "text":" Purchase a small wood chipper. A small chipper designed for backyard use can be a good investment, especially if you regularly prune trees and shrubs on your property. If you don’t chip the wood, you’ll have to haul it away or pay someone else to haul it away. Read the operating instructions thoroughly before you begin chipping.  Take all suggested safety precautions.  Inspect the material you plan to chip. Make sure it is free of stones, gravel or metal. Snap large branches in half and tear off small shoots from the branches before you turn on the chipper. Small bits of wood will feed into the chipper easier. Make sure the wood chip bag is tightly secured to the hopper.  Stand well to the side of the chipper when you are feeding wood into it. The machine can kick out larger pieces of wood; standing to the side will ensure the wood pieces don’t strike you. Use a long stick or pole to help you feed wood directly into the chipper. Never put your hands into the hopper while the chipper is running, either to feed the wood, or to remove a wood jam. Wear protective equipment. Protect your eyes with OSHA approved safety glasses or goggles. Protect your hearing with ear plugs or ear protectors. Protect your head by wearing an hard hat. Protect your feet by wearing steel-toed safety shoes or boots. Don’t wear baggy clothes, jewelry or loose belts or scarves. Never operate your wood chipper around children or allow a child to help you.  Never attempt to clear a wood jam while the chipper is running.  Get training on safe work procedures based on chipper manufacturer recommendations if you are not comfortable operating your wood chipper. ",
  "tyn_model":[
    "chipper",
    "wood chipper",
    "small wood chipper",
    "gravel",
    "wood chip bag",
    "hopper"
  ],
  "tyn_section":[

  ]
}