{
  "title":"How to Make Mango Bread",
  "url":"https://www.wikihow.com/Make-Mango-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Fruit Breads"
  ],
  "steps":[
    {
      "headline":"Preheat your oven to 325 °F (163 °C).",
      "description":""
    },
    {
      "headline":"Cream the butter and sugar together.",
      "description":"Set out an electric mixer or hand blender. Place the butter and sugar together in a bowl. Cream until light and fluffy,"
    },
    {
      "headline":"Add the eggs, vanilla, and cinnamon.",
      "description":"Add the vanilla extract and cinnamon. Crack the three eggs gently and add them into your creamed mixture. Blend."
    },
    {
      "headline":"Whisk the dry ingredients.",
      "description":"In a separate bowl, whisk the dry ingredients; The flour, salt, baking powder. Mix until fully combined"
    },
    {
      "headline":"Add the rest of the ingredients.",
      "description":"Add creamed mixture into flour mixture. Stir in raisins, mango pieces, and vegetable oil, Use a wooden spoon to fully combine bread batter."
    },
    {
      "headline":"Grease a loaf pan.",
      "description":"Use melted butter or margarine to grease the loaf pan well. Using grease will help the bread not to stick on the pan."
    },
    {
      "headline":"Pour the batter into the loaf pan.",
      "description":"Use a rubber spatula to scrape off any excess batter. Place loaf pan in the oven to bake."
    },
    {
      "headline":"Bake for one hour.",
      "description":"Bake your bread for one hour. The bread takes awhile to bake, only to get all the batter fully cooked without burning the edges or bottom. To test if bread is ready, poke a toothpick in the middle. If it comes out dry, it's done. If it doesn't and comes out wet, have it cool for an additional 5 minutes."
    },
    {
      "headline":"Have your bread cool.",
      "description":"Carefully remove bread from pan and place it on a wire rack so it can cool. It should take about twenty minutes for it to fully cool."
    },
    {
      "headline":"Enjoy!",
      "description":"You bread is now ready to be eaten. Top with honey, nuts, ice cream, jelly, or whipped cream. Serve."
    }
  ],
  "text":" Preheat your oven to 325 °F (163 °C).  Cream the butter and sugar together. Set out an electric mixer or hand blender. Place the butter and sugar together in a bowl. Cream until light and fluffy, Add the eggs, vanilla, and cinnamon. Add the vanilla extract and cinnamon. Crack the three eggs gently and add them into your creamed mixture. Blend. Whisk the dry ingredients. In a separate bowl, whisk the dry ingredients; The flour, salt, baking powder. Mix until fully combined Add the rest of the ingredients. Add creamed mixture into flour mixture. Stir in raisins, mango pieces, and vegetable oil, Use a wooden spoon to fully combine bread batter. Grease a loaf pan. Use melted butter or margarine to grease the loaf pan well. Using grease will help the bread not to stick on the pan. Pour the batter into the loaf pan. Use a rubber spatula to scrape off any excess batter. Place loaf pan in the oven to bake. Bake for one hour. Bake your bread for one hour. The bread takes awhile to bake, only to get all the batter fully cooked without burning the edges or bottom. To test if bread is ready, poke a toothpick in the middle. If it comes out dry, it's done. If it doesn't and comes out wet, have it cool for an additional 5 minutes. Have your bread cool. Carefully remove bread from pan and place it on a wire rack so it can cool. It should take about twenty minutes for it to fully cool. Enjoy! You bread is now ready to be eaten. Top with honey, nuts, ice cream, jelly, or whipped cream. Serve.",
  "tyn_model":[
    "loaf pan",
    "butter",
    "oven",
    "sugar",
    "eggs",
    "cinnamon",
    "flour",
    "bread",
    "electric mixer",
    "hand blender",
    "bowl",
    "vanilla",
    "vanilla extract",
    "creamed",
    "whisk",
    "salt",
    "baking powder",
    "raisins",
    "mango",
    "vegetable oil",
    "wooden spoon",
    "bread batter",
    "margarine",
    "rubber spatula",
    "toothpick",
    "wire rack",
    "honey",
    "nuts",
    "ice cream",
    "jelly",
    "whipped cream"
  ],
  "tyn_section":[

  ]
}