{
  "title":"How to Use a Swiffer Sweeper Multiple Ways",
  "url":"https://www.wikihow.com/Use-a-Swiffer-Sweeper-Multiple-Ways",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Cleaning Floors",
    "Sweeping Floors"
  ],
  "methods":[
    {
      "name":"Using a Swiffer on Different Surfaces",
      "steps":[
        {
          "headline":"Dust walls and hard-to-reach areas.",
          "description":"Use your Swiffer on more than just your floors. Take advantage of the easy handle and cleaning cloth to reach high-up or vertical surfaces of your home. Try dusting dirty walls, baseboards, ceiling fans, cabinets, and more with a dry cloth on the Swiffer. Check to see how a given surface will respond to cleaner before using a wet cloth for this. Remember that you can use the edge of the Swiffer head to gently scrub at more stubborn spots or dust. Just rotate the head until the edge rests against the surface you want to clean."
        },
        {
          "headline":"Use the Swiffer along with a vacuum.",
          "description":"Dust with a Swiffer to pull out larger debris for a vacuum to pick up. Do this to access dirt and crumbs that a vacuum can’t reach but a Swiffer can’t necessarily pick up. Try using the Swiffer first in corners of a room and under and between fridges, stoves, and other immovable furniture. Vacuum up the debris removed by the Swiffer. Clean off other surfaces with the Swiffer before you vacuum so the vacuum can catch any fallen dirt and dust."
        },
        {
          "headline":"Use Swiffer cloths as handheld dusters.",
          "description":"Take a dry mopping cloth for a Swiffer and use it as a handheld cloth to remove dust from surfaces around your home. Then attach it to the Swiffer to clean the floor, completing all your dusting with just one product. Swiffer the floors after you dust surfaces so you can catch any dust that may have been brushed to the floor in the process. Try using the cloth on tabletops, TV screens and other electronics, lamps, baseboards, shelves, etc."
        }
      ]
    },
    {
      "name":"Buying and Reusing Swiffer Cloths",
      "steps":[
        {
          "headline":"Use the other side of Swiffer cloths.",
          "description":"Get more use out of the same dry Swiffer cloth by using the second side once the first has become dirty. While the sides are slightly different textures, they work equally well for picking up dust and dirt. Simply shake out or gently wipe away any loose debris from the dirty side of the cloth when you notice it is no longer picking up dirt, then flip it over and reattach it to your Swiffer to continue cleaning. Note that you can do this with wet Swiffer cloths, as well as your own reusable cloths."
        },
        {
          "headline":"Throw Swiffer cloths in the washing machine.",
          "description":"Reuse the standard dry Swiffer cloths as long as possible by washing them between uses. Put them in a gentle cycle or wash by hand to keep them clean. Stick cloths in a mesh laundry bag meant for delicates before you put them in the washing machine. Set your washer to a gentle cycle setting to wash, then hang the cloth to dry before use. Cloths won’t come out perfectly clean from the washer, but they can be effective for several washes. Discard them once they are torn or no longer clean well."
        },
        {
          "headline":"Buy generic brand cloths.",
          "description":"Purchase refills of dry or wet cloths from a generic store brand rather than Swiffer brand itself. This can save money while being just as effective. Look in the cleaning supply sections of major chain grocery, discount, and big-box stores. You’ll find the store brand version of many items next to or near the name brand, typically at very reduced prices. You should also be able to wash and use both sides of generic brand cloths to make them last longer."
        }
      ]
    },
    {
      "name":"Making Your Own Swiffer Materials",
      "steps":[
        {
          "headline":"Use microfiber cloth or socks.",
          "description":"Buy a small microfiber cloth, use an old rag, or cover your Swiffer with an old sock or other clothing. Use these materials to replace the standard Swiffer dry mopping cloths, and reuse them over and over by putting them in the washing machine to clean. Try a fuzzy chenille sock for a great dusting material that you can simply pull on over the cleaning surface of the Swiffer. Buy or cut cloth to fit the Swiffer. You can use a standard Swiffer cloth to measure to the right size, though you may want your reusable cloth to be slightly larger to better attach the thicker material to the Swiffer. Push a microfiber cloth or a rag into the four openings on the corners of your Swiffer head to attach it. If you have trouble doing this with thicker material, you can also use binder clips to fasten the cloth at the back of the Swiffer head."
        },
        {
          "headline":"Sew or knit your own cover.",
          "description":"Make a custom reusable cloth for your Swiffer by knitting or sewing a pad that will fit perfectly over the head of your Swiffer. This can make it easier to attach and remove the cloth each time you use it. If you like to knit or crochet, try creating your own textured “cozy” with a wool or cotton yarn. Attach it by pushing it into the holes on the Swiffer head, or create side pockets, baubles, or button closures to easily fasten it on. Sew fabric with a sewing machine to create a custom-fit cloth. You can create “pockets” on either end of a rectangle to fit onto the ends of your Swiffer head. Use a fleece fabric to catch dust best, or quilt regular cotton to create more texture for trapping dust."
        },
        {
          "headline":"Use your own cleaner for a wet pad.",
          "description":"Use your own reusable microfiber or rag cloth with your favorite cleaner to recreate Swiffer’s standard wet mopping cloths. You can either spray or soak cloths in a watered down cleaning solution for use on your floors. Try putting washcloths in a sturdy gallon Ziplock bag with 6 cups water, 4 cups white vinegar, and ½ tablespoon dish soap. Allow the washcloths to soak up the cleaning solution, then attach to the Swiffer head to use. You can also spray your floor directly with warm water or a watered-down cleaning solution before you use your Swiffer. This will help keep the wet cloth on the Swiffer damp to clean for longer. You can also use your own cleaning solution in another Swiffer product, the Swiffer WetJet, by cutting a small hole into a standard refill pack and filling it with a water and vinegar solution, or another cleaner of your choice."
        }
      ]
    }
  ],
  "text":" Using a Swiffer on Different Surfaces Dust walls and hard-to-reach areas. Use your Swiffer on more than just your floors. Take advantage of the easy handle and cleaning cloth to reach high-up or vertical surfaces of your home. Try dusting dirty walls, baseboards, ceiling fans, cabinets, and more with a dry cloth on the Swiffer. Check to see how a given surface will respond to cleaner before using a wet cloth for this. Remember that you can use the edge of the Swiffer head to gently scrub at more stubborn spots or dust. Just rotate the head until the edge rests against the surface you want to clean. Use the Swiffer along with a vacuum. Dust with a Swiffer to pull out larger debris for a vacuum to pick up. Do this to access dirt and crumbs that a vacuum can’t reach but a Swiffer can’t necessarily pick up. Try using the Swiffer first in corners of a room and under and between fridges, stoves, and other immovable furniture. Vacuum up the debris removed by the Swiffer. Clean off other surfaces with the Swiffer before you vacuum so the vacuum can catch any fallen dirt and dust. Use Swiffer cloths as handheld dusters. Take a dry mopping cloth for a Swiffer and use it as a handheld cloth to remove dust from surfaces around your home. Then attach it to the Swiffer to clean the floor, completing all your dusting with just one product. Swiffer the floors after you dust surfaces so you can catch any dust that may have been brushed to the floor in the process. Try using the cloth on tabletops, TV screens and other electronics, lamps, baseboards, shelves, etc. Buying and Reusing Swiffer Cloths Use the other side of Swiffer cloths. Get more use out of the same dry Swiffer cloth by using the second side once the first has become dirty. While the sides are slightly different textures, they work equally well for picking up dust and dirt. Simply shake out or gently wipe away any loose debris from the dirty side of the cloth when you notice it is no longer picking up dirt, then flip it over and reattach it to your Swiffer to continue cleaning. Note that you can do this with wet Swiffer cloths, as well as your own reusable cloths. Throw Swiffer cloths in the washing machine. Reuse the standard dry Swiffer cloths as long as possible by washing them between uses. Put them in a gentle cycle or wash by hand to keep them clean. Stick cloths in a mesh laundry bag meant for delicates before you put them in the washing machine. Set your washer to a gentle cycle setting to wash, then hang the cloth to dry before use. Cloths won’t come out perfectly clean from the washer, but they can be effective for several washes. Discard them once they are torn or no longer clean well. Buy generic brand cloths. Purchase refills of dry or wet cloths from a generic store brand rather than Swiffer brand itself. This can save money while being just as effective. Look in the cleaning supply sections of major chain grocery, discount, and big-box stores. You’ll find the store brand version of many items next to or near the name brand, typically at very reduced prices. You should also be able to wash and use both sides of generic brand cloths to make them last longer. Making Your Own Swiffer Materials Use microfiber cloth or socks. Buy a small microfiber cloth, use an old rag, or cover your Swiffer with an old sock or other clothing. Use these materials to replace the standard Swiffer dry mopping cloths, and reuse them over and over by putting them in the washing machine to clean. Try a fuzzy chenille sock for a great dusting material that you can simply pull on over the cleaning surface of the Swiffer. Buy or cut cloth to fit the Swiffer. You can use a standard Swiffer cloth to measure to the right size, though you may want your reusable cloth to be slightly larger to better attach the thicker material to the Swiffer. Push a microfiber cloth or a rag into the four openings on the corners of your Swiffer head to attach it. If you have trouble doing this with thicker material, you can also use binder clips to fasten the cloth at the back of the Swiffer head. Sew or knit your own cover. Make a custom reusable cloth for your Swiffer by knitting or sewing a pad that will fit perfectly over the head of your Swiffer. This can make it easier to attach and remove the cloth each time you use it. If you like to knit or crochet, try creating your own textured “cozy” with a wool or cotton yarn. Attach it by pushing it into the holes on the Swiffer head, or create side pockets, baubles, or button closures to easily fasten it on. Sew fabric with a sewing machine to create a custom-fit cloth. You can create “pockets” on either end of a rectangle to fit onto the ends of your Swiffer head. Use a fleece fabric to catch dust best, or quilt regular cotton to create more texture for trapping dust. Use your own cleaner for a wet pad. Use your own reusable microfiber or rag cloth with your favorite cleaner to recreate Swiffer’s standard wet mopping cloths. You can either spray or soak cloths in a watered down cleaning solution for use on your floors. Try putting washcloths in a sturdy gallon Ziplock bag with 6 cups water, 4 cups white vinegar, and ½ tablespoon dish soap. Allow the washcloths to soak up the cleaning solution, then attach to the Swiffer head to use. You can also spray your floor directly with warm water or a watered-down cleaning solution before you use your Swiffer. This will help keep the wet cloth on the Swiffer damp to clean for longer. You can also use your own cleaning solution in another Swiffer product, the Swiffer WetJet, by cutting a small hole into a standard refill pack and filling it with a water and vinegar solution, or another cleaner of your choice.",
  "tyn_model":[
    "swiffer",
    "swiffer cloths",
    "vacuum",
    "cleaner",
    "microfiber cloth",
    "swiffer cloth",
    "washer",
    "rag",
    "washing machine",
    "swiffer brand",
    "swiffer dry mopping cloths",
    "cloth",
    "binder clips",
    "“cozy",
    "” with",
    "yarn",
    "fabric",
    "“pockets",
    "” on",
    "swiffer’s",
    "water",
    "white vinegar",
    "dish soap",
    "swiffer product",
    "swiffer wetjet",
    "water and vinegar"
  ],
  "tyn_section":[

  ]
}