{
  "title":"How to Sell High End Used Furniture",
  "url":"https://www.wikihow.com/Sell-High-End-Used-Furniture",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture"
  ],
  "methods":[
    {
      "name":"Determining the Furniture’s Value",
      "steps":[
        {
          "headline":"Find a manufacturer’s mark for proof of authenticity.",
          "description":"Many high-end furniture manufacturers tag their furniture. This stamp could be anywhere, so look all over for it. Inspect the back end and look inside of it if you don’t see the mark right away. Take advantage of marks to both confirm the quality of a piece of furniture and to help track down its estimated retail price. For example, a manufacturer might place a mark on the back of a chair. It might be on a drawer inside of a dresser or wardrobe. When you find a manufacturer’s mark, take a picture of it. You can use it to determine who made the furniture and what it is worth by looking through catalogues. Then, show off the mark when you’re advertising. You may have received a certificate of authenticity or something similar when buying the furniture. Save it, especially if the furniture doesn’t have a mark to distinguish it."
        },
        {
          "headline":"Inspect the furniture for scratches and other signs of damage.",
          "description":"The furniture’s condition has a big impact on the sale price. If the furniture is dinged, damaged, and worn out, you can’t expect to get a lot of money for it. On the other hand, if it looks like it belongs in a catalogue, you can put a higher price on it. If your furniture is in pretty bad shape, consider having it fixed first. For example, refinish or reupholster it to potentially increase its value."
        },
        {
          "headline":"Test the furniture’s quality by touching and using it.",
          "description":"Truly high-end furniture feels sturdy because it is made with quality material and crafting techniques. Check that the furniture is made from solid material cut to fit together without staples, nails, or a ton of glue. Lift and pull various parts to see if they squeak or twist. For upholstery, squeeze the fabric to see if you can feel the furniture’s frame through it. Furniture made from solid wood is worth more than anything made from thin plywood or other materials. Premium options like mahogany and maple are typically a sign of high-end quality. Natural fabrics like European linen, cotton, leather, and down stuffing are often signs of a piece of furniture that is worth more than usual. By contrast, synthetics are often used in more inexpensive furniture."
        },
        {
          "headline":"Look up sales to find the approximate value of the furniture.",
          "description":"If you bought the furniture yourself, remember how much you got it for. If you’re uncertain, try searching for similar pieces of furniture. Uncover what they go for both new and used. Search for the manufacturer’s website, if they have one, to get started. Many manufacturers have online catalogues. If you’re selling an older piece of furniture, check out antique databases and marketplaces online. If you don’t know the manufacturer or are dealing with an antique, browse marketplace listing and completed sales on auction websites."
        },
        {
          "headline":"Contact a professional appraiser for a price estimate if you need one.",
          "description":"The best way to do this is by seeking out an appraisal service in your area. For a decent fee, often $200 to $400 USD, they will give you some background on the furniture and tell you how much it is worth. You also get a certificate of appraisal you can show off when negotiating a sale. Since high-end furniture can be pretty expensive, appraisals are usually worth doing despite the fee. If you don’t think your item is worth much, then the appraisal won’t be worth doing. Search for online services that can perform appraisals at a reduced cost. You could also try visiting an auction house or furniture seller for a free verbal appraisal."
        },
        {
          "headline":"Price your furniture according to its condition and value.",
          "description":"Make sure the asking price is a prominent part of your advertisement. To start, determine the original value of the furniture. Then, take into account its age and overall condition to reach a fair price. If you had any professional appraisals done, use them for a baseline estimate. For a basic price estimate, start with the retail price and subtract 20% to 30% from it. Take off extra for wear and tear or damage. Factor in the demand. Selling high-end furniture often involves waiting for a buyer to come along. You may need to drop the price lower than you anticipate to attract more buyers. Pick a realistic price, but have an idea of what you will settle for. For example, you might decide that your Heywood Wakefield armoire is worth $3,500 but is more likely to sell for $2,000."
        }
      ]
    },
    {
      "name":"Choosing Where to Sell Furniture",
      "steps":[
        {
          "headline":"List your furniture online if you intend on reaching a large audience.",
          "description":"Craigslist and eBay are a few of the most common places to list high-end furniture, although there are other sites you can use as well. Chairish is a site specifically for listing high-end furniture, but you could also try sites like OfferUp, Bonanza, Facebook Marketplace, ArtDeco, 1dibs, or Oodle. These sites all allow you to include an advertisement and accompanying photos. They are accessible to buyers outside of your community. Shipping costs can be an issue when selling outside of your community. Be aware of the costs and make sure the buyer is willing to pay to come retrieve the furniture. Many listing sites ask you to pay a small fee, such as $1, to advertise. Depending on the service, you may also have to offer a commission, which is usually a percentage of the final sales price."
        },
        {
          "headline":"Download an app for more options for advertising at a low cost.",
          "description":"Some apps to check out include LetGo, Chairish, Apartment Therapy Bazar, 5Miles, and Everything But The House. These apps are convenient and often very easy to use. Many of them don’t ask for a listing fee when you first post your advertisement. Be sure to read the fine print. Some apps take a percentage commission of the final sales price. It can often be a high amount, like 25%."
        },
        {
          "headline":"Offer furniture to a consignment shop if you’re selling within your community.",
          "description":"Look for a consignment shop that carries high-end and vintage furniture. You will have to transport the furniture to the shop, but you can then leave it on display there. Then, you wait until someone buys the furniture. It’s a great way to advertise high-end pieces in your community without having to do a lot of extra legwork. Consignment shops take a commission once your item sells. The fee can be anywhere from 25% to over 50%, so discuss the arrangement with the shop before doing business with them. Some shops force you to discount or take back items if they don’t sell within a certain time period. Consignment shops are often small and have limited space, which means your furniture is more visible. However, the shop may not get a lot of foot traffic or customers interested in costly furniture."
        },
        {
          "headline":"Place a newspaper advertisement to get more direct community interest.",
          "description":"If you’re interested in selling the furniture on your own, ask your local newspaper publisher about posting a classified ad. The ad gives you some room to post a brief description of the furniture and possibly a picture as well. Include your phone number or email address so buyers know how to reach you. If your ad is clear and an interested buyer happens to see it, then you can sell the furniture without having to travel very far. One downside of newspapers is that not everyone reads them. The only people that see your ad will be readers inside your community, and they may not be interested in what you’re selling. Discuss the cost you have to pay to run the ad. It can get expensive. Newspapers often charge a fixed cost, such as $5 to $100 per line. Many newspaper outlets also post classified ads on their websites, although you may need to pay a separate fee for it."
        },
        {
          "headline":"Meet with a dealer if you’re looking to make a quick sale.",
          "description":"Search online for stores and traveling dealers in your area. Send them a description and photos of your furniture. If they like what they see, they may buy it from you right away. Most dealers also handle shipping on their own, too. Dealers are resellers, so don’t expect to get the best deal. Since they are in business, they are often trustworthy, reliable buyers, however. Completing a sale depends on what the dealer is looking for and the quality of the furniture. If it all works out, then you can make a quick sale with a professional. If a dealer isn’t interested in your furniture, they may be able to give you a free estimate on what they think it is actually worth."
        },
        {
          "headline":"Consult an antique dealer if you’re selling older furniture.",
          "description":"If you have something too precious to sell through the traditional ways. Such as a family heirloom, let a professional handle it. Take it to a shop or auction house that has a history of  selling antique furniture. These places often have their own evaluators you can rely on to come up with a sales price. Many of them will buy the furniture from you or  at least link you to potential customers. Get information on how to sell antiques by getting in touch with antique associations. Search for national antique organizations online to find their websites. Antiques can still be sold through online listings and other routes, but they are more difficult to price and advertise accurately. You may need a professional opinion to figure out where the furniture came from, for example."
        }
      ]
    },
    {
      "name":"Making a Good Advertisement",
      "steps":[
        {
          "headline":"Take a few quality, well-lit photos of the furniture.",
          "description":"Select a quality camera or phone so you can get some clear snapshots. Take a picture of the overall piece, but also take some close-ups of the smaller details. For instance, document markings, unusual features, and damaged spots. Display the furniture as accurately as possible so that potential buyers know what they are getting. Clean off the furniture and clear out nearby clutter. Make the pictures as good-looking as you can! If you’re selling multiple pieces of furniture, separate them unless you’re selling them as a set. For example, if you’re selling a dining set, take a picture of the table and chairs together. Expect potential buyers to require a photo no matter how you advertise. High-end furniture is a pricey investment, so honesty and accuracy go a long way toward completing a sale."
        },
        {
          "headline":"List the price and payment info clearly in the ad.",
          "description":"Make the price very apparent, such as by listing it first or last in the advertisement and by putting it in big, bold text. Then, include what kind of payment info you take. If you’re selling directly to a buyer, you may want to ask for cash only. That way, you can be sure you get paid before handing over the furniture. Checks and debit card numbers are difficult to verify before you complete the exchange. The check could bounce, for instance, because the person doesn’t have enough money to cover the cost. Many businesses, including consignment shops and dealers, pay via a check. Check the business’ reputation online before deciding to accept payment this way."
        },
        {
          "headline":"Write a short but accurate description of the furniture’s history.",
          "description":"List the manufacturer responsible for the furniture and when it was produced, if you have that information available. Also, explain how long you have had the furniture and how you have used it. You may also wish to describe how you first got the furniture, whether it was from a store or a secondhand seller. Write at least 2 to 3 sentences giving as much background info on the furniture as possible. For instance, your ad could say, “$2,000 queen-sized Bernhardt bed for sale. Purchased in late 2007 and used daily in main bedroom.”\nThe furniture’s brand is important. If it is part of a collection, make sure your description says so. Keep the description simple. Most people browse quickly through advertisements. If it’s too long and complicated, they may lose interest."
        },
        {
          "headline":"Describe marks and other damaged spots on the furniture.",
          "description":"Be honest about what the furniture looks like. Chips, scratches, and holes are a few issues that can make or break a sale. Include a picture with each separate description, if possible. By doing this, you are more likely to complete a sale because buyers know exactly what they are getting. You might describe a wood chair as having, “light scratches around the legs and a slight chip on the right arm.”\nThe worst outcome is having a buyer show up and realize that they don’t want the furniture after all. An accurate description helps to avoid this."
        }
      ]
    }
  ],
  "text":" Determining the Furniture’s Value Find a manufacturer’s mark for proof of authenticity. Many high-end furniture manufacturers tag their furniture. This stamp could be anywhere, so look all over for it. Inspect the back end and look inside of it if you don’t see the mark right away. Take advantage of marks to both confirm the quality of a piece of furniture and to help track down its estimated retail price. For example, a manufacturer might place a mark on the back of a chair. It might be on a drawer inside of a dresser or wardrobe. When you find a manufacturer’s mark, take a picture of it. You can use it to determine who made the furniture and what it is worth by looking through catalogues. Then, show off the mark when you’re advertising. You may have received a certificate of authenticity or something similar when buying the furniture. Save it, especially if the furniture doesn’t have a mark to distinguish it. Inspect the furniture for scratches and other signs of damage. The furniture’s condition has a big impact on the sale price. If the furniture is dinged, damaged, and worn out, you can’t expect to get a lot of money for it. On the other hand, if it looks like it belongs in a catalogue, you can put a higher price on it. If your furniture is in pretty bad shape, consider having it fixed first. For example, refinish or reupholster it to potentially increase its value. Test the furniture’s quality by touching and using it. Truly high-end furniture feels sturdy because it is made with quality material and crafting techniques. Check that the furniture is made from solid material cut to fit together without staples, nails, or a ton of glue. Lift and pull various parts to see if they squeak or twist. For upholstery, squeeze the fabric to see if you can feel the furniture’s frame through it. Furniture made from solid wood is worth more than anything made from thin plywood or other materials. Premium options like mahogany and maple are typically a sign of high-end quality. Natural fabrics like European linen, cotton, leather, and down stuffing are often signs of a piece of furniture that is worth more than usual. By contrast, synthetics are often used in more inexpensive furniture. Look up sales to find the approximate value of the furniture. If you bought the furniture yourself, remember how much you got it for. If you’re uncertain, try searching for similar pieces of furniture. Uncover what they go for both new and used. Search for the manufacturer’s website, if they have one, to get started. Many manufacturers have online catalogues. If you’re selling an older piece of furniture, check out antique databases and marketplaces online. If you don’t know the manufacturer or are dealing with an antique, browse marketplace listing and completed sales on auction websites. Contact a professional appraiser for a price estimate if you need one. The best way to do this is by seeking out an appraisal service in your area. For a decent fee, often $200 to $400 USD, they will give you some background on the furniture and tell you how much it is worth. You also get a certificate of appraisal you can show off when negotiating a sale. Since high-end furniture can be pretty expensive, appraisals are usually worth doing despite the fee. If you don’t think your item is worth much, then the appraisal won’t be worth doing. Search for online services that can perform appraisals at a reduced cost. You could also try visiting an auction house or furniture seller for a free verbal appraisal. Price your furniture according to its condition and value. Make sure the asking price is a prominent part of your advertisement. To start, determine the original value of the furniture. Then, take into account its age and overall condition to reach a fair price. If you had any professional appraisals done, use them for a baseline estimate. For a basic price estimate, start with the retail price and subtract 20% to 30% from it. Take off extra for wear and tear or damage. Factor in the demand. Selling high-end furniture often involves waiting for a buyer to come along. You may need to drop the price lower than you anticipate to attract more buyers. Pick a realistic price, but have an idea of what you will settle for. For example, you might decide that your Heywood Wakefield armoire is worth $3,500 but is more likely to sell for $2,000. Choosing Where to Sell Furniture List your furniture online if you intend on reaching a large audience. Craigslist and eBay are a few of the most common places to list high-end furniture, although there are other sites you can use as well. Chairish is a site specifically for listing high-end furniture, but you could also try sites like OfferUp, Bonanza, Facebook Marketplace, ArtDeco, 1dibs, or Oodle. These sites all allow you to include an advertisement and accompanying photos. They are accessible to buyers outside of your community. Shipping costs can be an issue when selling outside of your community. Be aware of the costs and make sure the buyer is willing to pay to come retrieve the furniture. Many listing sites ask you to pay a small fee, such as $1, to advertise. Depending on the service, you may also have to offer a commission, which is usually a percentage of the final sales price. Download an app for more options for advertising at a low cost. Some apps to check out include LetGo, Chairish, Apartment Therapy Bazar, 5Miles, and Everything But The House. These apps are convenient and often very easy to use. Many of them don’t ask for a listing fee when you first post your advertisement. Be sure to read the fine print. Some apps take a percentage commission of the final sales price. It can often be a high amount, like 25%. Offer furniture to a consignment shop if you’re selling within your community. Look for a consignment shop that carries high-end and vintage furniture. You will have to transport the furniture to the shop, but you can then leave it on display there. Then, you wait until someone buys the furniture. It’s a great way to advertise high-end pieces in your community without having to do a lot of extra legwork. Consignment shops take a commission once your item sells. The fee can be anywhere from 25% to over 50%, so discuss the arrangement with the shop before doing business with them. Some shops force you to discount or take back items if they don’t sell within a certain time period. Consignment shops are often small and have limited space, which means your furniture is more visible. However, the shop may not get a lot of foot traffic or customers interested in costly furniture. Place a newspaper advertisement to get more direct community interest. If you’re interested in selling the furniture on your own, ask your local newspaper publisher about posting a classified ad. The ad gives you some room to post a brief description of the furniture and possibly a picture as well. Include your phone number or email address so buyers know how to reach you. If your ad is clear and an interested buyer happens to see it, then you can sell the furniture without having to travel very far. One downside of newspapers is that not everyone reads them. The only people that see your ad will be readers inside your community, and they may not be interested in what you’re selling. Discuss the cost you have to pay to run the ad. It can get expensive. Newspapers often charge a fixed cost, such as $5 to $100 per line. Many newspaper outlets also post classified ads on their websites, although you may need to pay a separate fee for it. Meet with a dealer if you’re looking to make a quick sale. Search online for stores and traveling dealers in your area. Send them a description and photos of your furniture. If they like what they see, they may buy it from you right away. Most dealers also handle shipping on their own, too. Dealers are resellers, so don’t expect to get the best deal. Since they are in business, they are often trustworthy, reliable buyers, however. Completing a sale depends on what the dealer is looking for and the quality of the furniture. If it all works out, then you can make a quick sale with a professional. If a dealer isn’t interested in your furniture, they may be able to give you a free estimate on what they think it is actually worth. Consult an antique dealer if you’re selling older furniture. If you have something too precious to sell through the traditional ways. Such as a family heirloom, let a professional handle it. Take it to a shop or auction house that has a history of  selling antique furniture. These places often have their own evaluators you can rely on to come up with a sales price. Many of them will buy the furniture from you or  at least link you to potential customers. Get information on how to sell antiques by getting in touch with antique associations. Search for national antique organizations online to find their websites. Antiques can still be sold through online listings and other routes, but they are more difficult to price and advertise accurately. You may need a professional opinion to figure out where the furniture came from, for example. Making a Good Advertisement Take a few quality, well-lit photos of the furniture. Select a quality camera or phone so you can get some clear snapshots. Take a picture of the overall piece, but also take some close-ups of the smaller details. For instance, document markings, unusual features, and damaged spots. Display the furniture as accurately as possible so that potential buyers know what they are getting. Clean off the furniture and clear out nearby clutter. Make the pictures as good-looking as you can! If you’re selling multiple pieces of furniture, separate them unless you’re selling them as a set. For example, if you’re selling a dining set, take a picture of the table and chairs together. Expect potential buyers to require a photo no matter how you advertise. High-end furniture is a pricey investment, so honesty and accuracy go a long way toward completing a sale. List the price and payment info clearly in the ad. Make the price very apparent, such as by listing it first or last in the advertisement and by putting it in big, bold text. Then, include what kind of payment info you take. If you’re selling directly to a buyer, you may want to ask for cash only. That way, you can be sure you get paid before handing over the furniture. Checks and debit card numbers are difficult to verify before you complete the exchange. The check could bounce, for instance, because the person doesn’t have enough money to cover the cost. Many businesses, including consignment shops and dealers, pay via a check. Check the business’ reputation online before deciding to accept payment this way. Write a short but accurate description of the furniture’s history. List the manufacturer responsible for the furniture and when it was produced, if you have that information available. Also, explain how long you have had the furniture and how you have used it. You may also wish to describe how you first got the furniture, whether it was from a store or a secondhand seller. Write at least 2 to 3 sentences giving as much background info on the furniture as possible. For instance, your ad could say, “$2,000 queen-sized Bernhardt bed for sale. Purchased in late 2007 and used daily in main bedroom.”\nThe furniture’s brand is important. If it is part of a collection, make sure your description says so. Keep the description simple. Most people browse quickly through advertisements. If it’s too long and complicated, they may lose interest. Describe marks and other damaged spots on the furniture. Be honest about what the furniture looks like. Chips, scratches, and holes are a few issues that can make or break a sale. Include a picture with each separate description, if possible. By doing this, you are more likely to complete a sale because buyers know exactly what they are getting. You might describe a wood chair as having, “light scratches around the legs and a slight chip on the right arm.”\nThe worst outcome is having a buyer show up and realize that they don’t want the furniture after all. An accurate description helps to avoid this.",
  "tyn_model":[
    "furniture",
    "”\n",
    "chair",
    "glue",
    "upholstery",
    "fabric",
    "down stuffing",
    "appraisal",
    "apartment therapy bazar",
    "consignment shops",
    "newspapers",
    "antique dealer",
    "camera",
    "phone",
    "table",
    "’ reputation",
    "“$",
    "bernhardt bed",
    "wood chair",
    "“light"
  ],
  "tyn_section":[

  ]
}