{
  "title":"How to Make Door County Fish Boils",
  "url":"https://www.wikihow.com/Make-Door-County-Fish-Boils",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "steps":[
    {
      "headline":"Add the eight (8) quarts of water to the pot/kettle.",
      "description":""
    },
    {
      "headline":"Bring the water to a rolling boil and try to keep it boiling through the entire cooking process.",
      "description":""
    },
    {
      "headline":"Cut the potatoes in half-length wise.",
      "description":"If the water is not boiling yet place the cut potatoes in a large bowl, cover with cold water and add 2 tablespoons of lemon juice to keep them from turning brown."
    },
    {
      "headline":"Add the potatoes to the  water once it reaches a rolling boil.",
      "description":""
    },
    {
      "headline":"Add one (1) cup of the salt to the potatoes and cook them for about 20 minutes.",
      "description":"Add quartered onion and cook for 10 minutes. The potatoes are nearly done when you can easily poke a fork into them."
    },
    {
      "headline":"Add the whitefish and the reserved cup of salt.",
      "description":""
    },
    {
      "headline":"Cook for 7 to 10 minutes, the fish should be firm but will slightly separate from the bone when pulled with a fork.",
      "description":""
    },
    {
      "headline":"While cooking, skim off any fish oil that may rise to the surface with a spoon or small skimmer.",
      "description":""
    },
    {
      "headline":"Lift the fish and potatoes out of the water, use hot pads gloves to avoid steam burns.",
      "description":"Let excess water drip off."
    },
    {
      "headline":"Serve hot with melted butter and lemon wedges.",
      "description":""
    }
  ],
  "text":" Add the eight (8) quarts of water to the pot/kettle.  Bring the water to a rolling boil and try to keep it boiling through the entire cooking process.  Cut the potatoes in half-length wise. If the water is not boiling yet place the cut potatoes in a large bowl, cover with cold water and add 2 tablespoons of lemon juice to keep them from turning brown. Add the potatoes to the  water once it reaches a rolling boil.  Add one (1) cup of the salt to the potatoes and cook them for about 20 minutes. Add quartered onion and cook for 10 minutes. The potatoes are nearly done when you can easily poke a fork into them. Add the whitefish and the reserved cup of salt.  Cook for 7 to 10 minutes, the fish should be firm but will slightly separate from the bone when pulled with a fork.  While cooking, skim off any fish oil that may rise to the surface with a spoon or small skimmer.  Lift the fish and potatoes out of the water, use hot pads gloves to avoid steam burns. Let excess water drip off. Serve hot with melted butter and lemon wedges. ",
  "tyn_model":[
    "water",
    "potatoes",
    "salt",
    "pot",
    "kettle",
    "large bowl",
    "cold water",
    "lemon juice",
    "onion",
    "whitefish",
    "fork",
    "fish oil",
    "spoon",
    "small skimmer",
    "fish",
    "hot pads gloves",
    "butter",
    "lemon wedges"
  ],
  "tyn_section":[

  ]
}