{
  "title":"How to Determine if the Motor Coupler is Broken in your Washing Machine",
  "url":"https://www.wikihow.com/Determine-if-the-Motor-Coupler-is-Broken-in-your-Washing-Machine",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Home Repairs"
  ],
  "steps":[
    {
      "headline":"Set the timer dial in the regular wash cycle.",
      "description":"If the washer fills to the selected level and starts agitating properly, then the problem is not a broken motor coupler."
    },
    {
      "headline":"If the washer fills to the selected level and you hear the motor running but the washer is not agitating, set the dial on the spin cycle.",
      "description":"If the washer drains the water and you hear the motor running (making noise but not spinning), it is likely you have a broken motor coupler."
    },
    {
      "headline":"If you replace the motor coupler yourself it probably will cost you about $20.",
      "description":""
    },
    {
      "headline":"If you have to have a repairman come to your house and do the repair for you, it could cost you about US$120.",
      "description":""
    },
    {
      "headline":"Remove bolt from agitator from inside washing machine tub.",
      "description":""
    },
    {
      "headline":"Remove the 3 silver bolts from under the washing machine tub underneath the washer.",
      "description":"Make sure you unplug the wiring assembly from the drive."
    },
    {
      "headline":"After you remove the 3 bolts , the motor will fall out.",
      "description":""
    },
    {
      "headline":"Remove the 2 metal screw from the clips holding assembly together.",
      "description":""
    },
    {
      "headline":"When you remove screws the coupler will be the 2 plastic pieces with 3 prongs and a rubber coupling.",
      "description":""
    },
    {
      "headline":"Replace and reverse instructions to put all back together.",
      "description":""
    }
  ],
  "text":" Set the timer dial in the regular wash cycle. If the washer fills to the selected level and starts agitating properly, then the problem is not a broken motor coupler. If the washer fills to the selected level and you hear the motor running but the washer is not agitating, set the dial on the spin cycle. If the washer drains the water and you hear the motor running (making noise but not spinning), it is likely you have a broken motor coupler. If you replace the motor coupler yourself it probably will cost you about $20.  If you have to have a repairman come to your house and do the repair for you, it could cost you about US$120.  Remove bolt from agitator from inside washing machine tub.  Remove the 3 silver bolts from under the washing machine tub underneath the washer. Make sure you unplug the wiring assembly from the drive. After you remove the 3 bolts , the motor will fall out.  Remove the 2 metal screw from the clips holding assembly together.  When you remove screws the coupler will be the 2 plastic pieces with 3 prongs and a rubber coupling.  Replace and reverse instructions to put all back together. ",
  "tyn_model":[
    "washer",
    "washing machine",
    "timer",
    "water",
    "agitator",
    "screws"
  ],
  "tyn_section":[

  ]
}