{
  "title":"How to Make an Online Littlest Pet Shop Series",
  "url":"https://www.wikihow.com/Make-an-Online-Littlest-Pet-Shop-Series",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids"
  ],
  "steps":[
    {
      "headline":"Have Littlest Pet Shops?",
      "description":"If you have a chance to buy some LPS buy them with a house or any other sets!"
    },
    {
      "headline":"Make a plot come up with a story.",
      "description":"The pets are toys for kids so think of that! You have to make it good for kids. If it is going to have some fighting parts, or you want it to be something other than Kid-Like, make sure, at the beginning of the video, try to put in, \"Even though this is made with toys, some parts may not be suitable for children. Viewer Discretion is advised.\""
    },
    {
      "headline":"Choose actors.",
      "description":"After you have the story choose pets to play each characters."
    },
    {
      "headline":"Choose a room.",
      "description":"Choose a room where to film it and decorate it!"
    },
    {
      "headline":"Bring a few LPS houses in the room you are filming in.",
      "description":"Make the character house and the places you will need. Like school, character houses, beach. If you need a school build the school rooms, English room, P.E. room, etc."
    },
    {
      "headline":"Get other people.",
      "description":"Get other people because you can't film everything by yourself. Choose other people for the pets. If you have boys characters ask some guys you know to play them. Choose  somebody to film them. But this is optional. If you want, if someone is talking at the same time as another person, edit it with a copy of your voices. Make all the LPS's voices different. If there is a guy, make a low pitch voice."
    },
    {
      "headline":"Crowd!",
      "description":"Like live filming! In the room you will film it. Away from the décor put some chairs and ask your family and friends to come or edit in crowds. Like the live filming your crowd will say \"Wooo\" if they kiss. Laugh at the jokes.Boo-at some moments. Say \"Awww\" at the sad moments like in the movies. Clap when it's ending. This is also optional. If you want to make it realistic, edit the sounds in."
    },
    {
      "headline":"Choose a theme song.",
      "description":"The theme song for 'Popular' (a series) is \"Popular\". If the name of your show has a song named the same way use it! Again, the theme song can just be your favorite song. Make a short video with the theme song that shows first time viewers a little in your series. Just be aware of copyright if you want to put your series online."
    }
  ],
  "text":" Have Littlest Pet Shops? If you have a chance to buy some LPS buy them with a house or any other sets! Make a plot come up with a story. The pets are toys for kids so think of that! You have to make it good for kids. If it is going to have some fighting parts, or you want it to be something other than Kid-Like, make sure, at the beginning of the video, try to put in, \"Even though this is made with toys, some parts may not be suitable for children. Viewer Discretion is advised.\" Choose actors. After you have the story choose pets to play each characters. Choose a room. Choose a room where to film it and decorate it! Bring a few LPS houses in the room you are filming in. Make the character house and the places you will need. Like school, character houses, beach. If you need a school build the school rooms, English room, P.E. room, etc. Get other people. Get other people because you can't film everything by yourself. Choose other people for the pets. If you have boys characters ask some guys you know to play them. Choose  somebody to film them. But this is optional. If you want, if someone is talking at the same time as another person, edit it with a copy of your voices. Make all the LPS's voices different. If there is a guy, make a low pitch voice. Crowd! Like live filming! In the room you will film it. Away from the décor put some chairs and ask your family and friends to come or edit in crowds. Like the live filming your crowd will say \"Wooo\" if they kiss. Laugh at the jokes.Boo-at some moments. Say \"Awww\" at the sad moments like in the movies. Clap when it's ending. This is also optional. If you want to make it realistic, edit the sounds in. Choose a theme song. The theme song for 'Popular' (a series) is \"Popular\". If the name of your show has a song named the same way use it! Again, the theme song can just be your favorite song. Make a short video with the theme song that shows first time viewers a little in your series. Just be aware of copyright if you want to put your series online.",
  "tyn_model":[
    "pets",
    "toys",
    "chairs"
  ],
  "tyn_section":[

  ]
}