{
  "title":"How to Make a Beer Bottle Bud Vase",
  "url":"https://www.wikihow.com/Make-a-Beer-Bottle-Bud-Vase",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects",
    "Vase Projects"
  ],
  "steps":[
    {
      "headline":"Wash out the beer bottle and remove its label.",
      "description":"Fill the bottle with hot soapy water to remove all residue, then rinse thoroughly to remove all traces of soap. Let air dry before proceeding. If the bottle has a label, it's usually easiest to soak the bottle in hot water for a short time to soften the glue and lift the label. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/33\\/Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet1.jpg\\/v4-459px-Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/33\\/Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet1.jpg\\/v4-759px-Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nCarefully scrape any remaining glue from the bottle to ensure a clean, smooth surface. Using an oil like tea tree oil or rubbing alcohol will remove any last residue of glue. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3b\\/Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet2.jpg\\/v4-459px-Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3b\\/Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet2.jpg\\/v4-759px-Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
    },
    {
      "headline":"Choose your preferred spray paint colors.",
      "description":"This is where you get to complement the vase with your personal decor. Select spray paint that can be applied evenly and is washable. Your local hardware or craft store should be able to provide you with a sizable selection of paints. If not, check online. If you're planning to create a design on your bottle, you’ll need a complementary color, and if you're painting multiple bottles, you may want to use different colors to display throughout your home. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c5\\/Make-a-Beer-Bottle-Bud-Vase-Step-2Bullet2.jpg\\/v4-459px-Make-a-Beer-Bottle-Bud-Vase-Step-2Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c5\\/Make-a-Beer-Bottle-Bud-Vase-Step-2Bullet2.jpg\\/v4-759px-Make-a-Beer-Bottle-Bud-Vase-Step-2Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
    },
    {
      "headline":"Create your workspace.",
      "description":"Since you’ll be using spray paint set up in a well ventilated area (an outdoor area is ideal if it's practical and humidity is low). Use plenty of newspaper around and underneath your bottle to protect furniture, soft furnishings and anything else in the area. Find a flat surface for your workspace. Since you’ll be spraying your bottle while it’s standing up, the bottle should stand firm. Clear the area of pets and small children to avoid mishaps. Dust the area too––errant pet hair could get stuck to the paintwork. (It also helps to tie back your hair if it's long.)"
    },
    {
      "headline":"Apply spray paint to the bottle.",
      "description":"For even coverage, spray a layer of base coat over the entire bottle. Don't worry about perfection––aim to cover as much as possible and keep it as even as you can."
    },
    {
      "headline":"Let the first coat dry.",
      "description":"Next, apply a second coat to ensure complete coverage. You should really see the color pop during the second application."
    },
    {
      "headline":"Add fun designs using painter’s tape.",
      "description":"Once the paint has dried, you can add designs by marking off areas using painter’s (or masking) tape. You can take two different approaches to this craft––either by using the tape as part of the bottle's actual design (as shown in this image) or marking off areas on the bottle itself and painting over the tape, using it as a stencil. As the actual design: Cut strips of quality tape (in a complementary color) from the roll and apply to the bottle. For shapelier designs, use your scissors to round out the tape. As a paint stencil: If you plan to paint over the tape, you will have needed to select one paint color for your design and another color for the base. The design color will be the first coat you’ve applied before adding the painter's tape. Be sure the tape is fully adhered to the bottle before painting; any slip will spoil the design. Then paint over the entire bottle, including over the tape (the tape protects the painted color underneath, producing the design from that layer). Once that paint has fully dried, decide whether another layer would improve the finish. Once satisfied, carefully remove the tape, pulling slowly so as to avoid compromising the design."
    },
    {
      "headline":"Paint freely.",
      "description":"Freeform design painting is also a great way to improve the look of the vase, such as the hearts shown in this image. If you don't want to paint designs, consider gluing items on the vase, such as rhinestones or costume gems. This will \"bejewel\" your vase."
    },
    {
      "headline":"Finished.",
      "description":"Place your fully dried beer bottle bud vases on display anywhere they'll catch the eye."
    }
  ],
  "text":" Wash out the beer bottle and remove its label. Fill the bottle with hot soapy water to remove all residue, then rinse thoroughly to remove all traces of soap. Let air dry before proceeding. If the bottle has a label, it's usually easiest to soak the bottle in hot water for a short time to soften the glue and lift the label. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/33\\/Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet1.jpg\\/v4-459px-Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/33\\/Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet1.jpg\\/v4-759px-Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nCarefully scrape any remaining glue from the bottle to ensure a clean, smooth surface. Using an oil like tea tree oil or rubbing alcohol will remove any last residue of glue. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3b\\/Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet2.jpg\\/v4-459px-Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/3b\\/Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet2.jpg\\/v4-759px-Make-a-Beer-Bottle-Bud-Vase-Step-1Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Choose your preferred spray paint colors. This is where you get to complement the vase with your personal decor. Select spray paint that can be applied evenly and is washable. Your local hardware or craft store should be able to provide you with a sizable selection of paints. If not, check online. If you're planning to create a design on your bottle, you’ll need a complementary color, and if you're painting multiple bottles, you may want to use different colors to display throughout your home. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c5\\/Make-a-Beer-Bottle-Bud-Vase-Step-2Bullet2.jpg\\/v4-459px-Make-a-Beer-Bottle-Bud-Vase-Step-2Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/c\\/c5\\/Make-a-Beer-Bottle-Bud-Vase-Step-2Bullet2.jpg\\/v4-759px-Make-a-Beer-Bottle-Bud-Vase-Step-2Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Create your workspace. Since you’ll be using spray paint set up in a well ventilated area (an outdoor area is ideal if it's practical and humidity is low). Use plenty of newspaper around and underneath your bottle to protect furniture, soft furnishings and anything else in the area. Find a flat surface for your workspace. Since you’ll be spraying your bottle while it’s standing up, the bottle should stand firm. Clear the area of pets and small children to avoid mishaps. Dust the area too––errant pet hair could get stuck to the paintwork. (It also helps to tie back your hair if it's long.) Apply spray paint to the bottle. For even coverage, spray a layer of base coat over the entire bottle. Don't worry about perfection––aim to cover as much as possible and keep it as even as you can. Let the first coat dry. Next, apply a second coat to ensure complete coverage. You should really see the color pop during the second application. Add fun designs using painter’s tape. Once the paint has dried, you can add designs by marking off areas using painter’s (or masking) tape. You can take two different approaches to this craft––either by using the tape as part of the bottle's actual design (as shown in this image) or marking off areas on the bottle itself and painting over the tape, using it as a stencil. As the actual design: Cut strips of quality tape (in a complementary color) from the roll and apply to the bottle. For shapelier designs, use your scissors to round out the tape. As a paint stencil: If you plan to paint over the tape, you will have needed to select one paint color for your design and another color for the base. The design color will be the first coat you’ve applied before adding the painter's tape. Be sure the tape is fully adhered to the bottle before painting; any slip will spoil the design. Then paint over the entire bottle, including over the tape (the tape protects the painted color underneath, producing the design from that layer). Once that paint has fully dried, decide whether another layer would improve the finish. Once satisfied, carefully remove the tape, pulling slowly so as to avoid compromising the design. Paint freely. Freeform design painting is also a great way to improve the look of the vase, such as the hearts shown in this image. If you don't want to paint designs, consider gluing items on the vase, such as rhinestones or costume gems. This will \"bejewel\" your vase. Finished. Place your fully dried beer bottle bud vases on display anywhere they'll catch the eye.",
  "tyn_model":[
    "tape",
    "paint",
    "spray paint",
    "beer-",
    "glue",
    "beer bottle",
    "soapy water",
    "soap",
    "hot water",
    "tea tree oil",
    "rubbing alcohol",
    "paints",
    "beer-bottle",
    "newspaper",
    "base coat",
    "painter’s tape",
    "painter’s (",
    "masking) tape",
    "scissors",
    "paint stencil",
    "painter's tape",
    "beer bottle bud"
  ],
  "tyn_section":[

  ]
}