{
  "title":"How to Get Minecraft for Free",
  "url":"https://www.wikihow.com/Get-Minecraft-for-Free",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games",
    "Minecraft"
  ],
  "methods":[
    {
      "name":"Using the Demo",
      "steps":[
        {
          "headline":"Open the Minecraft website.",
          "description":"Go to https://www.minecraft.net/ in your browser."
        },
        {
          "headline":"Click ☰ MENU.",
          "description":"It's in the top-right corner of the page. A menu will appear."
        },
        {
          "headline":"Click TRIAL & DOWNLOAD.",
          "description":"You'll find this option near the bottom-right corner of the menu. Minecraft only works on Macbooks and PCs."
        },
        {
          "headline":"Click DOWNLOAD.",
          "description":"This green button is on the right side of the page."
        },
        {
          "headline":"Install Minecraft.",
          "description":"Double-click the Minecraft setup file, then follow the on-screen instructions. On a Mac, you'll first need to verify the download before you can proceed with the setup."
        },
        {
          "headline":"Open Minecraft.",
          "description":"Its app icon resembles a block of dirt with grass on top of it. Once you open Minecraft, you'll be prompted to enter your Minecraft account information, after which point you'll be able to play the demo for 100 minutes. If you don't have a Minecraft account, create one first."
        }
      ]
    },
    {
      "name":"Using the Bedrock Edition on Windows",
      "steps":[
        {
          "headline":"Make sure that you own a copy of Minecraft.",
          "description":"If you already have a copy of classic Minecraft (purchased before October 19th, 2018 ), you can download the Bedrock Edition (formerly known as the \"Windows 10\" edition) of Minecraft for free. If you own a copy of Minecraft on Mac, you can download the Bedrock Edition of Minecraft for free on a PC."
        },
        {
          "headline":"Open the Mojang website.",
          "description":"Go to https://account.mojang.com/login in your browser."
        },
        {
          "headline":"Log into your Mojang account.",
          "description":"Enter your Minecraft email address and password, then click Log in. This will log you into the Mojang account that you used to buy Minecraft. Make sure that you're using the account with which you bought your initial version of Minecraft."
        },
        {
          "headline":"Find the \"Minecraft for Windows 10\" section.",
          "description":"This heading should be near the middle of the page."
        },
        {
          "headline":"Click Claim your free copy.",
          "description":"You'll find this button to the right of the \"Minecraft for Windows 10\" heading. You should be redirected to the Microsoft Store."
        },
        {
          "headline":"Click Redeem.",
          "description":"It's to the right of the Minecraft logo. You may first be prompted to log into your Microsoft account. If so, enter your email address and password before continuing."
        },
        {
          "headline":"Wait for Minecraft to download.",
          "description":"Once Minecraft's Bedrock Edition finishes downloading, you should be able to find it in the Start {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/07\\/Windowsstart.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/07\\/Windowsstart.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":760,\"bigHeight\":760,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of a Windows icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Public_domain\\\">Public Domain<\\/a><br>\\n<\\/p><\\/div>\"} menu."
        }
      ]
    },
    {
      "name":"Using the Bedrock Edition on Xbox One",
      "steps":[
        {
          "headline":"Make sure that you own a copy of Minecraft.",
          "description":"If you already have a copy of classic Minecraft on your Xbox One, you can download the Bedrock Edition of Minecraft for free."
        },
        {
          "headline":"Select the Store tab.",
          "description":"Scroll right to the Store tab at the top of the screen, then press A on your controller."
        },
        {
          "headline":"Select Search and press A.",
          "description":"It's in the middle of the Store screen."
        },
        {
          "headline":"Type in minecraft.",
          "description":"Use the on-screen keyboard to do so."
        },
        {
          "headline":"Press ☰.",
          "description":"It's below and to the right of the \"Guide\" button on your Xbox One controller. This will search for the Minecraft game. You can no longer purchase the Xbox One edition of Minecraft from the Store."
        },
        {
          "headline":"Select Minecraft and press A.",
          "description":"It should be one of the top results in the Store. Doing so will open the Minecraft page."
        },
        {
          "headline":"Select Get and press A.",
          "description":"This button is to the right of the Minecraft image."
        },
        {
          "headline":"Wait for Minecraft to finish installing.",
          "description":"Once it does, you'll be able to find it in the My games and apps menu."
        }
      ]
    }
  ],
  "text":" Using the Demo Open the Minecraft website. Go to https://www.minecraft.net/ in your browser. Click ☰ MENU. It's in the top-right corner of the page. A menu will appear. Click TRIAL & DOWNLOAD. You'll find this option near the bottom-right corner of the menu. Minecraft only works on Macbooks and PCs. Click DOWNLOAD. This green button is on the right side of the page. Install Minecraft. Double-click the Minecraft setup file, then follow the on-screen instructions. On a Mac, you'll first need to verify the download before you can proceed with the setup. Open Minecraft. Its app icon resembles a block of dirt with grass on top of it. Once you open Minecraft, you'll be prompted to enter your Minecraft account information, after which point you'll be able to play the demo for 100 minutes. If you don't have a Minecraft account, create one first. Using the Bedrock Edition on Windows Make sure that you own a copy of Minecraft. If you already have a copy of classic Minecraft (purchased before October 19th, 2018 ), you can download the Bedrock Edition (formerly known as the \"Windows 10\" edition) of Minecraft for free. If you own a copy of Minecraft on Mac, you can download the Bedrock Edition of Minecraft for free on a PC. Open the Mojang website. Go to https://account.mojang.com/login in your browser. Log into your Mojang account. Enter your Minecraft email address and password, then click Log in. This will log you into the Mojang account that you used to buy Minecraft. Make sure that you're using the account with which you bought your initial version of Minecraft. Find the \"Minecraft for Windows 10\" section. This heading should be near the middle of the page. Click Claim your free copy. You'll find this button to the right of the \"Minecraft for Windows 10\" heading. You should be redirected to the Microsoft Store. Click Redeem. It's to the right of the Minecraft logo. You may first be prompted to log into your Microsoft account. If so, enter your email address and password before continuing. Wait for Minecraft to download. Once Minecraft's Bedrock Edition finishes downloading, you should be able to find it in the Start {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/07\\/Windowsstart.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/07\\/Windowsstart.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":760,\"bigHeight\":760,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of a Windows icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Public_domain\\\">Public Domain<\\/a><br>\\n<\\/p><\\/div>\"} menu. Using the Bedrock Edition on Xbox One Make sure that you own a copy of Minecraft. If you already have a copy of classic Minecraft on your Xbox One, you can download the Bedrock Edition of Minecraft for free. Select the Store tab. Scroll right to the Store tab at the top of the screen, then press A on your controller. Select Search and press A. It's in the middle of the Store screen. Type in minecraft. Use the on-screen keyboard to do so. Press ☰. It's below and to the right of the \"Guide\" button on your Xbox One controller. This will search for the Minecraft game. You can no longer purchase the Xbox One edition of Minecraft from the Store. Select Minecraft and press A. It should be one of the top results in the Store. Doing so will open the Minecraft page. Select Get and press A. This button is to the right of the Minecraft image. Wait for Minecraft to finish installing. Once it does, you'll be able to find it in the My games and apps menu.",
  "tyn_model":[
    "minecraft",
    "minecraft account",
    "xbox one",
    "minecraft website",
    "☰ menu",
    "mac",
    "☰.",
    "xbox one controller"
  ],
  "tyn_section":[

  ]
}