{
  "title":"How to Play Baseball in Halo 3",
  "url":"https://www.wikihow.com/Play-Baseball-in-Halo-3",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Halo 3"
  ],
  "methods":[
    {
      "name":"Original Version",
      "steps":[
        {
          "headline":"Play on Team Slayer, so that you can tell which team everyone is on.",
          "description":"The scores will act as a scoreboard."
        },
        {
          "headline":"Go to a map and select your four bases.",
          "description":"By far, the best map is Valhalla; however, The Pit or Sandtrap may also make good choices."
        },
        {
          "headline":"Find Gravity Hammers and Rocket Launchers.",
          "description":"Alternatively, press X and set everybody to have a Gravity Hammer and a Rocket Launcher."
        },
        {
          "headline":"The rules of the game are as follows:",
          "description":"The pitcher shoots the rocket at the batter. The batter tries to hit the rocket. If the batter is killed, the other team gains a point. If the batter hits the rocket, he/she has the right to kill the pitcher, which gains his/her team a point. If you die 3 times, the next batter is up. When all batters have gone up to bat, it is the other team's turn to bat."
        }
      ]
    },
    {
      "name":"Variant 1",
      "steps":[
        {
          "headline":"If you don't die when you are the batter, you run to a base.",
          "description":""
        },
        {
          "headline":"There is a person there, guarding the base (you should have a secondary weapon for this).",
          "description":""
        },
        {
          "headline":"To step onto that base and continue, first, you must kill the person guarding the base.",
          "description":"Whether other teammates can help or not is up to you."
        },
        {
          "headline":"Also, here are some miscellaneous rules to follow for the game:",
          "description":"If you destroy the rocket without dying, you get 1 point. If you make it around all of the bases that's 1 point. If your team gets 4 batters in a row that don't die, that's 4 points and the \"runners\" leave the bases they are at. (It's like getting a home run with the bases loaded-every runner leaves, and your team gets 4 points.)"
        }
      ]
    }
  ],
  "text":" Original Version Play on Team Slayer, so that you can tell which team everyone is on. The scores will act as a scoreboard. Go to a map and select your four bases. By far, the best map is Valhalla; however, The Pit or Sandtrap may also make good choices. Find Gravity Hammers and Rocket Launchers. Alternatively, press X and set everybody to have a Gravity Hammer and a Rocket Launcher. The rules of the game are as follows: The pitcher shoots the rocket at the batter. The batter tries to hit the rocket. If the batter is killed, the other team gains a point. If the batter hits the rocket, he/she has the right to kill the pitcher, which gains his/her team a point. If you die 3 times, the next batter is up. When all batters have gone up to bat, it is the other team's turn to bat. Variant 1 If you don't die when you are the batter, you run to a base.  There is a person there, guarding the base (you should have a secondary weapon for this).  To step onto that base and continue, first, you must kill the person guarding the base. Whether other teammates can help or not is up to you. Also, here are some miscellaneous rules to follow for the game: If you destroy the rocket without dying, you get 1 point. If you make it around all of the bases that's 1 point. If your team gets 4 batters in a row that don't die, that's 4 points and the \"runners\" leave the bases they are at. (It's like getting a home run with the bases loaded-every runner leaves, and your team gets 4 points.)",
  "tyn_model":[
    "rocket",
    "gravity hammers",
    "rocket launchers",
    "gravity hammer",
    "rocket launcher",
    "pitcher"
  ],
  "tyn_section":[

  ]
}