{
  "title":"How to Cook Fried Rib Eye Steak With White Stew Beans",
  "url":"https://www.wikihow.com/Cook-Fried-Rib-Eye-Steak-With-White-Stew-Beans",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Beef and Lamb",
    "Steak Dishes"
  ],
  "steps":[
    {
      "headline":"Prepare your ingredients and gather your equipment.",
      "description":""
    },
    {
      "headline":"Add some of the oil to a large pan heavy pan and heat until very hot.",
      "description":"You should see the oil shimmer. Carefully add your steak and add salt and pepper to taste. Cook your steaks on the point that you like them rare, medium or well done."
    },
    {
      "headline":"Cook them on both of sides and when your steaks are done remove them from the pan.",
      "description":"Add the sweet wine to deglaze and let it boil for 7 to 10 minutes. Remove it from the fire and add the sauce on top of your steaks."
    },
    {
      "headline":"Heat another pan with approx.",
      "description":"1 teaspoon of oil and sauté the fresh green beans with salt and pepper. Add the drained white beans from the can. Check the taste and season with salt and pepper if required. Let it simmer gently for a few minutes."
    },
    {
      "headline":"Heat your third pan with the remaining oil.",
      "description":"Dip your onion rings in the flour and fry them until they turn a golden colour. Remove them from the oil and put them on top of kitchen paper so they will drain any surplus oil."
    },
    {
      "headline":"Serve the steaks with the beans and garnish with the onions.",
      "description":""
    }
  ],
  "text":" Prepare your ingredients and gather your equipment.  Add some of the oil to a large pan heavy pan and heat until very hot. You should see the oil shimmer. Carefully add your steak and add salt and pepper to taste. Cook your steaks on the point that you like them rare, medium or well done. Cook them on both of sides and when your steaks are done remove them from the pan. Add the sweet wine to deglaze and let it boil for 7 to 10 minutes. Remove it from the fire and add the sauce on top of your steaks. Heat another pan with approx. 1 teaspoon of oil and sauté the fresh green beans with salt and pepper. Add the drained white beans from the can. Check the taste and season with salt and pepper if required. Let it simmer gently for a few minutes. Heat your third pan with the remaining oil. Dip your onion rings in the flour and fry them until they turn a golden colour. Remove them from the oil and put them on top of kitchen paper so they will drain any surplus oil. Serve the steaks with the beans and garnish with the onions. ",
  "tyn_model":[
    "oil",
    "salt and pepper",
    "large pan heavy pan",
    "pan",
    "sweet wine",
    "fresh green beans",
    "onion rings",
    "flour",
    "kitchen paper",
    "onions"
  ],
  "tyn_section":[

  ]
}