{
  "title":"How to Design and Build a Laser Cut Computer Case With Plywood",
  "url":"https://www.wikihow.com/Design-and-Build-a-Laser-Cut-Computer-Case-With-Plywood",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Woodworking"
  ],
  "steps":[
    {
      "headline":"Get your design tools.",
      "description":"Something like AutoCAD 2013 to make a template which will be cut out of plywood using a laser-cutting machine."
    },
    {
      "headline":"Have a basic idea of what you are going to do.",
      "description":"Something like a very rough draft, which I would follow when designing the case."
    },
    {
      "headline":"Use Joints.",
      "description":"These joints adjust for the kerf created by the laser. This joint is 0.2\" long and .125\" wide. The holes on the corners have a radius of 0.02\" and the spacers in the middle are offset 0.01\" along the length and 1/16\" from the corners. This ensures the joints will fit tightly when put together."
    },
    {
      "headline":"Design a mounting plate.",
      "description":"This piece of plywood is where you will mount your motherboard, power supply, and wood stubs for mounting hard drives."
    },
    {
      "headline":"Design parts to mount your hard drives.",
      "description":"In this instance, you want the hard drives to be accessed from the back, so build sleds to screw the hard drives onto. Those sleds would be mounted onto wood stubs that connected to the mounting plate."
    },
    {
      "headline":"Design cooling and front panel connectors.",
      "description":"I built this plate to be mounted in front of the hard drives with spacing for 92mm fan mounts which would blow air across the hard drives, Make sure there is an inch of space between the mount and the hard drive sleds! I also made a hole for a 22mm power switch, which would be pushed through both the plate and the front panel. A mount for front panel connectors such as USB 3.0 ports can be cut into this as well."
    },
    {
      "headline":"Design your top and bottom panels.",
      "description":"On mine, these need to fit over the mounts on the top and bottom of the component plate. I added spaces for 120mm fan mounts on both panels."
    },
    {
      "headline":"Design your front and bottom panels.",
      "description":"The ones I designed are to be pushed into the top and bottom much like the wood stubs for the hard drives. Make sure to correctly measure where the IO shield and front panel connectors (switches, USB ports) would fit on the front and back panels."
    },
    {
      "headline":"Design your side panels.",
      "description":"These need to fit in the spacing on the front and back panels. Also add air intakes to give the components adequate cooling and to keep the wood from becoming less fatigued."
    },
    {
      "headline":"Make sure your parts fit together.",
      "description":"If you're happy with your design, you can send it to company that does laser cutting to get your plywood parts. Assembling your computer should take under an hour."
    }
  ],
  "text":" Get your design tools. Something like AutoCAD 2013 to make a template which will be cut out of plywood using a laser-cutting machine. Have a basic idea of what you are going to do. Something like a very rough draft, which I would follow when designing the case. Use Joints. These joints adjust for the kerf created by the laser. This joint is 0.2\" long and .125\" wide. The holes on the corners have a radius of 0.02\" and the spacers in the middle are offset 0.01\" along the length and 1/16\" from the corners. This ensures the joints will fit tightly when put together. Design a mounting plate. This piece of plywood is where you will mount your motherboard, power supply, and wood stubs for mounting hard drives. Design parts to mount your hard drives. In this instance, you want the hard drives to be accessed from the back, so build sleds to screw the hard drives onto. Those sleds would be mounted onto wood stubs that connected to the mounting plate. Design cooling and front panel connectors. I built this plate to be mounted in front of the hard drives with spacing for 92mm fan mounts which would blow air across the hard drives, Make sure there is an inch of space between the mount and the hard drive sleds! I also made a hole for a 22mm power switch, which would be pushed through both the plate and the front panel. A mount for front panel connectors such as USB 3.0 ports can be cut into this as well. Design your top and bottom panels. On mine, these need to fit over the mounts on the top and bottom of the component plate. I added spaces for 120mm fan mounts on both panels. Design your front and bottom panels. The ones I designed are to be pushed into the top and bottom much like the wood stubs for the hard drives. Make sure to correctly measure where the IO shield and front panel connectors (switches, USB ports) would fit on the front and back panels. Design your side panels. These need to fit in the spacing on the front and back panels. Also add air intakes to give the components adequate cooling and to keep the wood from becoming less fatigued. Make sure your parts fit together. If you're happy with your design, you can send it to company that does laser cutting to get your plywood parts. Assembling your computer should take under an hour.",
  "tyn_model":[
    "laser-cutting",
    "laser",
    "plywood",
    "hard drive sleds",
    "component plate",
    "laser cutting",
    "computer"
  ],
  "tyn_section":[

  ]
}