{
  "title":"How to Eat Balut",
  "url":"https://www.wikihow.com/Eat-Balut",
  "category_hierarchy":[
    "Food and Entertaining",
    "Appreciation of Food",
    "Eating Techniques"
  ],
  "parts":[
    {
      "name":"Making Balut",
      "steps":[
        {
          "headline":"Find a vendor who sells raw balut eggs.",
          "description":"Balut eggs may be difficult to find, but check with Filipino restaurants, Asian grocery stores, specialty delis, and even local duck farmers to find a supplier of raw, fertilized duck eggs. Balut eggs are usually incubated for about 16 to 18 days before they're boiled and eaten. Look for eggs with thick shells and no cracks."
        },
        {
          "headline":"Boil a pot of water.",
          "description":"Fill a saucepan with water and bring it to a boil over high heat. When the water is boiling, use tongs or a slotted spoon to gently place the egg in the water. Cover the pot, reduce the heat to medium, and boil the egg for 30 minutes."
        },
        {
          "headline":"Remove the egg from the water.",
          "description":"When the 30 minutes is up, use tongs or a slotted spoon to remove the egg and immerse it in a bowl filled with ice water. This will stop the cooking process and help cool the egg faster."
        },
        {
          "headline":"Serve with beer.",
          "description":"If you're serving balut at a party or to a group of people, it is traditionally served as a snack that’s paired with beer. Simply place the eggs in a basket or bowl and serve them with your desired seasonings. Make sure each person has an egg cup, shallow bowl, and spoon."
        }
      ]
    },
    {
      "name":"Eating Balut",
      "steps":[
        {
          "headline":"Locate the rounded end.",
          "description":"Some balut eggs will come with a stamp on one end, and that is the end you're supposed to open. If your egg isn't stamped, find the fatter, rounded end of the egg (as opposed to the more pointed end). Place the egg in an egg cup or ramekin with the pointed side down. If you don't have these items, use a small cup or plate. The pointed end of the egg contains the egg white, while the rounded end contains the yolk and broth."
        },
        {
          "headline":"Break the shell with a spoon.",
          "description":"Use the bottom of a spoon and tap the rounded side of the egg three times to break the shell. Pick away the cracked bits of shell to form a small opening in the top of the egg, being careful not to let pieces of egg shell fall into the broth. Create an opening in the egg about the size of a bottle cap. Use your fingers to pick away at the layer of skin protecting the egg just beneath the shell. This will release the broth."
        },
        {
          "headline":"Prepare your seasoning.",
          "description":"Balut is often eaten with salt, pepper, vinegar, chili pepper, or diced green onion. Take your desired seasonings and mix them together in a small, shallow bowl."
        },
        {
          "headline":"Season and drink the broth.",
          "description":"Take a small spoonful of seasoning and drop it into the hole you made in the egg shell. Use the spoon to gently stir the seasoning into the broth. When the broth has been seasoned to your liking, put the egg up to your mouth and suck the broth out from the hole in the shell."
        },
        {
          "headline":"Break apart the remaining shell.",
          "description":"Once you’ve slurped the broth out of the egg, use your fingers to pick at the shell and peel it away to expose the rest of the egg."
        },
        {
          "headline":"Eat the egg.",
          "description":"There are two basic ways you can eat the egg from this point on. For the first way, season the egg by sprinkling it with seasoning or rolling it around in your seasoning bowl. Then, eat the egg yolk and embryo together in one or two bites. To savor the egg a little more, use a spoon to break away bites of the yolk, and dip each bite in your seasoning bowl. When you’ve eaten the yolk, move on to the embryo and eat small bites in the same fashion. The balut egg white is edible, but some people choose not to eat it because it’s tough and rubbery."
        }
      ]
    }
  ],
  "text":" Making Balut Find a vendor who sells raw balut eggs. Balut eggs may be difficult to find, but check with Filipino restaurants, Asian grocery stores, specialty delis, and even local duck farmers to find a supplier of raw, fertilized duck eggs. Balut eggs are usually incubated for about 16 to 18 days before they're boiled and eaten. Look for eggs with thick shells and no cracks. Boil a pot of water. Fill a saucepan with water and bring it to a boil over high heat. When the water is boiling, use tongs or a slotted spoon to gently place the egg in the water. Cover the pot, reduce the heat to medium, and boil the egg for 30 minutes. Remove the egg from the water. When the 30 minutes is up, use tongs or a slotted spoon to remove the egg and immerse it in a bowl filled with ice water. This will stop the cooking process and help cool the egg faster. Serve with beer. If you're serving balut at a party or to a group of people, it is traditionally served as a snack that’s paired with beer. Simply place the eggs in a basket or bowl and serve them with your desired seasonings. Make sure each person has an egg cup, shallow bowl, and spoon. Eating Balut Locate the rounded end. Some balut eggs will come with a stamp on one end, and that is the end you're supposed to open. If your egg isn't stamped, find the fatter, rounded end of the egg (as opposed to the more pointed end). Place the egg in an egg cup or ramekin with the pointed side down. If you don't have these items, use a small cup or plate. The pointed end of the egg contains the egg white, while the rounded end contains the yolk and broth. Break the shell with a spoon. Use the bottom of a spoon and tap the rounded side of the egg three times to break the shell. Pick away the cracked bits of shell to form a small opening in the top of the egg, being careful not to let pieces of egg shell fall into the broth. Create an opening in the egg about the size of a bottle cap. Use your fingers to pick away at the layer of skin protecting the egg just beneath the shell. This will release the broth. Prepare your seasoning. Balut is often eaten with salt, pepper, vinegar, chili pepper, or diced green onion. Take your desired seasonings and mix them together in a small, shallow bowl. Season and drink the broth. Take a small spoonful of seasoning and drop it into the hole you made in the egg shell. Use the spoon to gently stir the seasoning into the broth. When the broth has been seasoned to your liking, put the egg up to your mouth and suck the broth out from the hole in the shell. Break apart the remaining shell. Once you’ve slurped the broth out of the egg, use your fingers to pick at the shell and peel it away to expose the rest of the egg. Eat the egg. There are two basic ways you can eat the egg from this point on. For the first way, season the egg by sprinkling it with seasoning or rolling it around in your seasoning bowl. Then, eat the egg yolk and embryo together in one or two bites. To savor the egg a little more, use a spoon to break away bites of the yolk, and dip each bite in your seasoning bowl. When you’ve eaten the yolk, move on to the embryo and eat small bites in the same fashion. The balut egg white is edible, but some people choose not to eat it because it’s tough and rubbery.",
  "tyn_model":[
    "broth",
    "water",
    "balut",
    "spoon",
    "balut eggs",
    "pot",
    "slotted spoon",
    "bowl",
    "beer",
    "egg",
    "seasoning bowl",
    "duck farmers",
    "duck eggs",
    "eggs",
    "saucepan",
    "ice water",
    "egg cup",
    "ramekin",
    "plate",
    "seasoning",
    "salt, pepper",
    "vinegar",
    "chili pepper",
    "green onion",
    "seasonings"
  ],
  "tyn_section":[

  ]
}