{
  "title":"How to Delete an Album on Facebook",
  "url":"https://www.wikihow.com/Delete-an-Album-on-Facebook",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photographs",
    "Photo Albums"
  ],
  "steps":[
    {
      "headline":"Log in to your Facebook account.",
      "description":"Type in your username and password."
    },
    {
      "headline":"Click on \"Photos\" under \"Favorites\" on the top left of your home page.",
      "description":"You can find \"Favorites\" under the thumbnail of your Facebook photo. \"Photos\" will be the last option on the drop-down menu."
    },
    {
      "headline":"Click on \"Albums\" on the top right of the screen.",
      "description":"Don't be distracted by the number of albums you have, which will appear about the word \"Albums.\""
    },
    {
      "headline":"Click on the album you want to delete.",
      "description":"Scroll down to find it."
    },
    {
      "headline":"Click on the gear on the right hand corner of the album.",
      "description":""
    },
    {
      "headline":"Select \"Delete Album.\"",
      "description":"It'll be the only option. Confirm that you want to delete the album. After it asks if you're sure you want to delete the album, click \"Delete Album\" again."
    }
  ],
  "text":" Log in to your Facebook account. Type in your username and password. Click on \"Photos\" under \"Favorites\" on the top left of your home page. You can find \"Favorites\" under the thumbnail of your Facebook photo. \"Photos\" will be the last option on the drop-down menu. Click on \"Albums\" on the top right of the screen. Don't be distracted by the number of albums you have, which will appear about the word \"Albums.\" Click on the album you want to delete. Scroll down to find it. Click on the gear on the right hand corner of the album.  Select \"Delete Album.\" It'll be the only option. Confirm that you want to delete the album. After it asks if you're sure you want to delete the album, click \"Delete Album\" again.",
  "tyn_model":[
    "album",
    "albums"
  ],
  "tyn_section":[

  ]
}