{
  "title":"How to Make a One Pot Spaghetti Dinner",
  "url":"https://www.wikihow.com/Make-a-One-Pot-Spaghetti-Dinner",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles",
    "Spaghetti"
  ],
  "steps":[
    {
      "headline":"Fill the pot 2/3 full with cold water to cook the spaghetti, approximately 10 cups for a pound.",
      "description":"Add one tsp salt and 1 tbs oil, cover until boiling."
    },
    {
      "headline":"Add the desired amount of spaghetti, gently stir continuously to keep it from sticking, until the water is again boiling.",
      "description":"When the spaghetti is flexible but still hard in the middle (a little bit less well done than al-dente), drain it in a colander, or using the lid of the pot, or scoop it out with a spaghetti scoop."
    },
    {
      "headline":"Put  the spaghetti in a bowl or colander, drizzle 2tbs of olive oil over it and stir.#  Cover with foil and a dish towel to help keep it warm",
      "description":""
    },
    {
      "headline":"Add 1tbs oil,to the empty pot and turn it on medium heat.",
      "description":""
    },
    {
      "headline":"Add 1 diced onion*, 1 diced pepper*, 1 diced stalk celery*, 1lb hamburger or Italian sausage (chunks).",
      "description":"(*optional)"
    },
    {
      "headline":"Stir until meat and onion are browned.",
      "description":"Add 3 cloves garlic*, crushed, stir 30 seconds more until lightly sauteed."
    },
    {
      "headline":"Lower the heat, and add 1 drained can mushrooms* and/or one can sliced black olives*, 1 28 oz.",
      "description":"can tomato puree, 1 15 oz. can whole or stewed tomatoes, 1tsp. dried oregano 1tsp. dried basil, 1tbs. dried parsley, 1/2tsp. Worcestershire sauce*. Stir and simmer 10 minutes."
    },
    {
      "headline":"Put the spaghetti back into the pot and stir gently.",
      "description":"Let it sit 3 minutes, stir gently again and let it sit 2 minutes."
    },
    {
      "headline":"Test the pasta to make sure it is cooked through (al dente is usually considered ideal) and fully warmed by the sauce.",
      "description":""
    },
    {
      "headline":"Serve (preferably with a little Parmesan cheese) and enjoy.",
      "description":""
    }
  ],
  "text":" Fill the pot 2/3 full with cold water to cook the spaghetti, approximately 10 cups for a pound. Add one tsp salt and 1 tbs oil, cover until boiling. Add the desired amount of spaghetti, gently stir continuously to keep it from sticking, until the water is again boiling. When the spaghetti is flexible but still hard in the middle (a little bit less well done than al-dente), drain it in a colander, or using the lid of the pot, or scoop it out with a spaghetti scoop. Put  the spaghetti in a bowl or colander, drizzle 2tbs of olive oil over it and stir.#  Cover with foil and a dish towel to help keep it warm  Add 1tbs oil,to the empty pot and turn it on medium heat.  Add 1 diced onion*, 1 diced pepper*, 1 diced stalk celery*, 1lb hamburger or Italian sausage (chunks). (*optional) Stir until meat and onion are browned. Add 3 cloves garlic*, crushed, stir 30 seconds more until lightly sauteed. Lower the heat, and add 1 drained can mushrooms* and/or one can sliced black olives*, 1 28 oz. can tomato puree, 1 15 oz. can whole or stewed tomatoes, 1tsp. dried oregano 1tsp. dried basil, 1tbs. dried parsley, 1/2tsp. Worcestershire sauce*. Stir and simmer 10 minutes. Put the spaghetti back into the pot and stir gently. Let it sit 3 minutes, stir gently again and let it sit 2 minutes. Test the pasta to make sure it is cooked through (al dente is usually considered ideal) and fully warmed by the sauce.  Serve (preferably with a little Parmesan cheese) and enjoy. ",
  "tyn_model":[
    "pot",
    "oil",
    "colander",
    "onion",
    "cold water",
    "salt",
    "water",
    "spaghetti scoop",
    "bowl",
    "olive oil",
    "foil",
    "dish towel",
    "pepper",
    "celery",
    "italian sausage",
    "garlic",
    "mushrooms",
    "black olives",
    "tomato puree",
    "tomatoes",
    "oregano",
    "basil",
    "parsley",
    "worcestershire sauce",
    "spaghetti",
    "pasta",
    "parmesan cheese"
  ],
  "tyn_section":[

  ]
}