{
  "title":"How to Save a Web Page to a PSP",
  "url":"https://www.wikihow.com/Save-a-Web-Page-to-a-PSP",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PSP"
  ],
  "steps":[
    {
      "headline":"Download Mozilla Firefox or use Internet Explorer.",
      "description":""
    },
    {
      "headline":"Find the page you wish to save, for example, the page you are currently reading.",
      "description":""
    },
    {
      "headline":"Go to Settings, then USB mode on your PSP.",
      "description":""
    },
    {
      "headline":"Connect it to your PC via a USB cable.",
      "description":""
    },
    {
      "headline":"Whilst viewing the page you wish to save, click \"File,\" and then \"Save Page As.\"",
      "description":""
    },
    {
      "headline":"Click on \"My Computer\"",
      "description":""
    },
    {
      "headline":"Double-click on the removable disk that represents your connected PSP.",
      "description":""
    },
    {
      "headline":"Open the folder called \"PSP.\"",
      "description":""
    },
    {
      "headline":"Open the folder called \"COMMON.\"",
      "description":""
    },
    {
      "headline":"Save the page as a file in here.",
      "description":""
    },
    {
      "headline":"Remember the files name an extension.",
      "description":"This page would be called \"Save-a-Web-Page-to-a-PSP.htm\""
    },
    {
      "headline":"Disconnect your PSP from the computer.",
      "description":""
    },
    {
      "headline":"Go to internet browser on your PSP.",
      "description":""
    },
    {
      "headline":"It is not necessary to connect to the Internet now.",
      "description":""
    },
    {
      "headline":"Press, \"Triangle,\" to open the menu in the browser.",
      "description":""
    },
    {
      "headline":"Use the D-pad to highlight, \"File,\" and press, \"X.\"",
      "description":""
    },
    {
      "headline":"Highlight Address entry and press \"X\" again.",
      "description":""
    },
    {
      "headline":"Type in the following: file:/psp/common/Save-a-Web-Page-to-a-PSP.htm and the press start.",
      "description":""
    },
    {
      "headline":"When accessing other files replace \"Save-a-Web-Page-to-a-PSP.htm\" with whatever file name and extension you are trying to access.",
      "description":""
    }
  ],
  "text":" Download Mozilla Firefox or use Internet Explorer.  Find the page you wish to save, for example, the page you are currently reading.  Go to Settings, then USB mode on your PSP.  Connect it to your PC via a USB cable.  Whilst viewing the page you wish to save, click \"File,\" and then \"Save Page As.\"  Click on \"My Computer\"  Double-click on the removable disk that represents your connected PSP.  Open the folder called \"PSP.\"  Open the folder called \"COMMON.\"  Save the page as a file in here.  Remember the files name an extension. This page would be called \"Save-a-Web-Page-to-a-PSP.htm\" Disconnect your PSP from the computer.  Go to internet browser on your PSP.  It is not necessary to connect to the Internet now.  Press, \"Triangle,\" to open the menu in the browser.  Use the D-pad to highlight, \"File,\" and press, \"X.\"  Highlight Address entry and press \"X\" again.  Type in the following: file:/psp/common/Save-a-Web-Page-to-a-PSP.htm and the press start.  When accessing other files replace \"Save-a-Web-Page-to-a-PSP.htm\" with whatever file name and extension you are trying to access. ",
  "tyn_model":[
    "psp",
    "internet explorer",
    "usb cable",
    "removable disk",
    "internet browser"
  ],
  "tyn_section":[

  ]
}