{
  "title":"How to Change a Franke Triflow Water Filter Cartridge",
  "url":"https://www.wikihow.com/Change-a-Franke-Triflow-Water-Filter-Cartridge",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "steps":[
    {
      "headline":"Buy the replacement cartridge from the manufacturer or any of the retailers you can find on the internet.",
      "description":"Use the serial number on your current cartridge to order the correct part."
    },
    {
      "headline":"Look under the sink and locate the white cylinder shaped casing which contains the water filter cartridge.",
      "description":"Shut off the water valve which leads to this filter."
    },
    {
      "headline":"Remove the remaining water in the filter hoses by turning your filtered water on as you normally do above the sink.",
      "description":"If you completed step 2 correctly , the water should stop flowing within a few seconds."
    },
    {
      "headline":"Place a bowl or bucket under the water filter to catch the water which will spill out when you remove the cartridge casing.",
      "description":""
    },
    {
      "headline":"Unscrew the white plastic cartridge casing located under the sink.",
      "description":"Pour the dirty water out of the plastic casing (See image 1) and wash the casing in warm soapy water. Remove any mold or dirt buildup which might have developed."
    },
    {
      "headline":"Remove the new cartridge from the box it was shipped (See image 2) in and gently wet the two rubber \"O\" rings on its top.",
      "description":""
    },
    {
      "headline":"Screw the new cartridge and the plastic casing into the receptor under the sink.",
      "description":"Do not overtighten, as this may break the cartridge."
    },
    {
      "headline":"Turn on the filtered water tap and let it run for at least 10 minutes to remove any impurities.",
      "description":"Check under the sink for any leaks that might have developed. Let the unit stand, unused for 24 hours. Then run for another 10 minutes prior to using for drinking."
    }
  ],
  "text":" Buy the replacement cartridge from the manufacturer or any of the retailers you can find on the internet. Use the serial number on your current cartridge to order the correct part. Look under the sink and locate the white cylinder shaped casing which contains the water filter cartridge. Shut off the water valve which leads to this filter. Remove the remaining water in the filter hoses by turning your filtered water on as you normally do above the sink. If you completed step 2 correctly , the water should stop flowing within a few seconds. Place a bowl or bucket under the water filter to catch the water which will spill out when you remove the cartridge casing.  Unscrew the white plastic cartridge casing located under the sink. Pour the dirty water out of the plastic casing (See image 1) and wash the casing in warm soapy water. Remove any mold or dirt buildup which might have developed. Remove the new cartridge from the box it was shipped (See image 2) in and gently wet the two rubber \"O\" rings on its top.  Screw the new cartridge and the plastic casing into the receptor under the sink. Do not overtighten, as this may break the cartridge. Turn on the filtered water tap and let it run for at least 10 minutes to remove any impurities. Check under the sink for any leaks that might have developed. Let the unit stand, unused for 24 hours. Then run for another 10 minutes prior to using for drinking.",
  "tyn_model":[
    "water",
    "water filter",
    "sink",
    "bowl",
    "bucket",
    "soapy water",
    "filtered water",
    "tap"
  ],
  "tyn_section":[

  ]
}