{
  "title":"How to Play Whirly Ball",
  "url":"https://www.wikihow.com/Play-Whirly-Ball",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games",
    "Backyard Ball Games"
  ],
  "steps":[
    {
      "headline":"You and nine other of your colleagues, friends, family, or complete strangers arrive at a Whirly Ball court.",
      "description":"Whirly Ball courts are located throughout the Midwest."
    },
    {
      "headline":"Spend a moment to stretch out your arms and back, by pulling one arm across your body for ten seconds and then repeat with the other arm.",
      "description":""
    },
    {
      "headline":"Step onto the Whirly Ball court and select either a red or yellow “whirly bug”.",
      "description":""
    },
    {
      "headline":"Once sitting inside the “whirly bug”, buckle your seat-belt and take hold of your trac-ball racquet.",
      "description":""
    },
    {
      "headline":"There will be 15 minutes on the scoreboard, so you and four others use that time to compete against five other players.",
      "description":"Once the clock begins a countdown, the whirly bugs will be powered electronically and will be movable."
    },
    {
      "headline":"To move the “whirly bug”, place one hand on the crankshaft located in the middle of the whirly bug and move it left or right.",
      "description":"Similar to a steering wheel in a car, the crankshaft will direct where the whirly bug moves."
    },
    {
      "headline":"To put the “whirly bug” into reverse, complete one circular revolution with the crankshaft; to return to forward direction, complete a circular revolution once again.",
      "description":""
    },
    {
      "headline":"After conquering the crankshaft operations and “whirly bug” steering, identify which backboard and net relates to your team, and direct your whirly bug towards the wiffle ball.",
      "description":""
    },
    {
      "headline":"The goal of the game is to carry the wiffle ball in your track-ball racquet until you are in a position to launch the wiffle ball towards the net.",
      "description":""
    },
    {
      "headline":"Upon hitting the net with the wiffle ball, a sensor will trip, a horn will sound, and your team will be awarded two points.",
      "description":""
    },
    {
      "headline":"If you are being defended by one of the five opposing players, you should pass the wiffle ball to one of your teammates, who are driving a matching colored “whirly bug” as yourself, so that they can attempt to score.",
      "description":""
    },
    {
      "headline":"Upon scoring a point, the wiffle ball will then be awarded to the opposing team so that they may pursue scoring a point.",
      "description":""
    },
    {
      "headline":"The intent of the game is to have your team score the most points.",
      "description":""
    }
  ],
  "text":" You and nine other of your colleagues, friends, family, or complete strangers arrive at a Whirly Ball court. Whirly Ball courts are located throughout the Midwest. Spend a moment to stretch out your arms and back, by pulling one arm across your body for ten seconds and then repeat with the other arm.  Step onto the Whirly Ball court and select either a red or yellow “whirly bug”.  Once sitting inside the “whirly bug”, buckle your seat-belt and take hold of your trac-ball racquet.  There will be 15 minutes on the scoreboard, so you and four others use that time to compete against five other players. Once the clock begins a countdown, the whirly bugs will be powered electronically and will be movable. To move the “whirly bug”, place one hand on the crankshaft located in the middle of the whirly bug and move it left or right. Similar to a steering wheel in a car, the crankshaft will direct where the whirly bug moves. To put the “whirly bug” into reverse, complete one circular revolution with the crankshaft; to return to forward direction, complete a circular revolution once again.  After conquering the crankshaft operations and “whirly bug” steering, identify which backboard and net relates to your team, and direct your whirly bug towards the wiffle ball.  The goal of the game is to carry the wiffle ball in your track-ball racquet until you are in a position to launch the wiffle ball towards the net.  Upon hitting the net with the wiffle ball, a sensor will trip, a horn will sound, and your team will be awarded two points.  If you are being defended by one of the five opposing players, you should pass the wiffle ball to one of your teammates, who are driving a matching colored “whirly bug” as yourself, so that they can attempt to score.  Upon scoring a point, the wiffle ball will then be awarded to the opposing team so that they may pursue scoring a point.  The intent of the game is to have your team score the most points. ",
  "tyn_model":[
    "“whirly",
    "wiffle ball",
    "whirly ball court",
    "”,",
    "whirly ball courts",
    "”.",
    "trac-ball",
    "racquet",
    "” into",
    "” steering",
    "whirly bug",
    "track-ball racquet",
    "” as"
  ],
  "tyn_section":[

  ]
}