{
  "title":"How to Make Boston Brown Bread",
  "url":"https://www.wikihow.com/Make-Boston-Brown-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads"
  ],
  "steps":[
    {
      "headline":"Mix together the first 6 ingredients in a medium-sized bowl.",
      "description":""
    },
    {
      "headline":"Mix together the next 4 ingredients in a separate bowl.",
      "description":""
    },
    {
      "headline":"Stir the two mixtures together thoroughly.",
      "description":""
    },
    {
      "headline":"Pour into a buttered one-pound coffee can and cover top tightly with aluminum foil.",
      "description":""
    },
    {
      "headline":"Place on oven rack in a deep pan with a tight fitting lid.",
      "description":""
    },
    {
      "headline":"Pour boiling water in the pan so that it comes halfway up the side of the can.",
      "description":""
    },
    {
      "headline":"Cover the pan and set the heat so that the water barely bubbles.",
      "description":""
    },
    {
      "headline":"Cook for two hours, or until a wooden skewer inserted into the middle of the loaf comes out clean.",
      "description":""
    },
    {
      "headline":"Remove the coffee can from the water and allow to rest for 5 minutes.",
      "description":""
    },
    {
      "headline":"Unmold and cool on rack before slicing.",
      "description":""
    }
  ],
  "text":" Mix together the first 6 ingredients in a medium-sized bowl.  Mix together the next 4 ingredients in a separate bowl.  Stir the two mixtures together thoroughly.  Pour into a buttered one-pound coffee can and cover top tightly with aluminum foil.  Place on oven rack in a deep pan with a tight fitting lid.  Pour boiling water in the pan so that it comes halfway up the side of the can.  Cover the pan and set the heat so that the water barely bubbles.  Cook for two hours, or until a wooden skewer inserted into the middle of the loaf comes out clean.  Remove the coffee can from the water and allow to rest for 5 minutes.  Unmold and cool on rack before slicing. ",
  "tyn_model":[
    "water",
    "coffee can",
    "medium-sized bowl",
    "bowl",
    "aluminum foil",
    "oven"
  ],
  "tyn_section":[

  ]
}