{
  "title":"How to Be a Party Animal",
  "url":"https://www.wikihow.com/Be-a-Party-Animal",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties"
  ],
  "methods":[
    {
      "name":"Preparing for the Party",
      "steps":[
        {
          "headline":"Dress up in a costume or extravagant \"going-outfit.\"",
          "description":"Party animals announce their presence the minute the enter the room, and there is no better way to do this than a costume, prop, or killer outfit. Obviously, the outfit will change depending on the party, but the important thing to remember is that you want to wear it with confidence. A party animal wears something because they want to, not because they're worried about what other people think. For themed parties, you want to commit as completely to the theme as possible. Go big or go home. If it is a casual party, throw on a silly hat, shirt, or grab a weird prop to bring with you. Anything that calls attention to you will do."
        },
        {
          "headline":"Have a few casual drinks before leaving.",
          "description":"You don't want to be drunk when you arrive, but you also don't want to feel like you need to \"catch-up\" when you get there. If you're going to drink, ensure that you have a driver before leaving."
        },
        {
          "headline":"Have something to eat an hour before the party.",
          "description":"Unless you're going to a dinner party (where party animals are generally less welcome), chances are good you're not going to get a whole lot of food at the party. Eat a good meal before the party so that you energy and food in your stomach. Going into a party without eating beforehand isn't just a drag, it can be dangerous if there's drinking involved. Always have a good meal 1-2 hours before going so that you don't have to worry about feeling sick or foraging for food when you're in party animal mode."
        },
        {
          "headline":"Arrive late.",
          "description":"A party animal needs a habitat to party in. It will be difficult to get momentum going if you're the first one in the door, so play it cool and arrive fashionably late. If it is a smaller gathering or party, 15-20 minutes should be fine, but if you're going to a huge party you should try to arrive at least an hour after things have kicked off. If you do arrive before things really kick off, never fear. Just have fun, be energetic, and the party will soon follow your vibe."
        },
        {
          "headline":"Make plans for the end of the party before you start partying.",
          "description":"No one wants to deal with rides home or places to sleep once they've transformed into a party animal. It is smartest and safest to deal with these things in advance. Make sure you have a designated driver if the party has alcohol, and check with the host that you have a place to sleep if you will not be driving home. Check in with your friends to make sure you have a buddy at the party to watch out for you if things go poorly -- the two of you can make sure that you both make it home safely."
        }
      ]
    },
    {
      "name":"Turning a Mild Party into a Blast",
      "steps":[
        {
          "headline":"Pull shy people into the party one at a time with friendly conversation.",
          "description":"If you see someone by themselves or off in the corner, introduce yourself. Make them feel at home, then ask them to join you for a drink, a dance, or a game. The more people you pull into the party, the more rocking it becomes. You, the party animal, should be pulling as many other animals into your pack as possible. More importantly, the party animal needs to know everyone at the party, because everyone needs to know them. Listen to people as they talk and ask questions to get them comfortable speaking. Introduce people as you find common interests."
        },
        {
          "headline":"Pour out drinks slowly if the party has alcohol.",
          "description":"Forcing someone to do 5 shots in an hour is dangerous and can lead to a sloppy, sickening feeling. Instead, start drinking slowly, letting people get to their own comfortable level of drunkenness. A good party is one where everyone feels comfortable enough to let their inhibitions fly and have fun, not one where half the group is in the bathroom the whole time."
        },
        {
          "headline":"Turn up the music.",
          "description":"Find songs that everyone can enjoy but have a quick beat and a lot of energy. As the party gets going, slowly turn up the volume to get people moving. While people should still be able to have a conversation, you also want people to feel free to stop talking and start dancing. Each group has different musical tastes, but there are some go-to party genres that get most people moving:\nMotown\nHouse/Dance/Rave\nBeatles-era rock. 90's Hip-Hop."
        },
        {
          "headline":"Play some games that get people moving, laughing, or sharing.",
          "description":"Games are one of the most sure-fire ways to get the crowd together and start having fun. A little competition, some humor, and common thread of conversation will help the party bond and bring up the energy of the group naturally. Just make sure that lots of people can play, being as inclusive as possible. While there are hundreds of games to start with, from drinking games to big, humorous group board games like Cards Against Humanity, you can't go wrong with some of the classics:\nTruth or Dare\nNever Have I Ever\nKings\nWho am I?"
        },
        {
          "headline":"Bring a pack of party animals with you.",
          "description":"Show up with people who are just as fun and willing to be a bit silly. Having a good group around you makes the infectious energy easier to spread. However, this doesn't mean your \"wolfpack\" comes in and ruins the party for everyone else. If they are annoying or sloppy, then you may also be considered annoying or sloppy as well. Mingle with other people, not just those in your group. Check with the host beforehand if it is okay to bring guests. Bring a party gift, like some food or extra drinks, if you show up with multiple people."
        },
        {
          "headline":"Know that a rocking party takes time to get started.",
          "description":"Think of the energy of a party as a volume dial -- you want to raise it slowly, but surely, so that you don't blast anyone's ears or shock people who are still having a quiet, relaxed time. Don't expect your presence to suddenly kick the party into overdrive. Instead, be a little stealthy, slowly turning up the volume (both literally and figuratively), until the party is really bumping. Be a strategic party animal, and suddenly you'll have the whole pack following you."
        }
      ]
    },
    {
      "name":"Unleashing Your Inner Animal",
      "steps":[
        {
          "headline":"Be yourself and stick to your guns.",
          "description":"A party animal is not at the whims of every person who comes up and asks to do a shot or play a game. The party animal knows that he knows how to party and that he makes the party. Be confident. Even if you're just faking it, confidence attracts attention, so \"fake it 'til you make it.\" Inject your own personality into the party by:\nRounding up groups for games that you want to play\nIntroducing yourself to new people\nDancing\nMixing up new \"cocktails.\""
        },
        {
          "headline":"Remain in control of yourself.",
          "description":"Party animals are not sloppy or too drunk to function, they are in control and having fun at all times. Know your limits and accept them, otherwise you'll tip over from party animal to annoying nuisance in no time. Being a party animal is not about being the drunkest person at the party, or showing off how cool you are to others. It is about being a blast in every situation, helping others loosen up and fun and driving the party energy up."
        },
        {
          "headline":"Loosen up and let go of your inhibitions.",
          "description":"Let go of your fears, even if it takes a few drinks to get you to play air guitar on the dance floor, so accept that fact. A party animal isn't the one who stands quietly in the corner; he is the one dancing on the tables, making everyone have more fun. You are in control of how much fun you have at a party, so stop wishing things were more lively and make them lively. Being a party animal is not about thinking and planning, it is about acting. So go dance, ask that girl if you can buy her a drink, play a game, and get a little rowdy."
        },
        {
          "headline":"Lead the party from the front with group activities and games.",
          "description":"Get the whole party on the same level, you party animal. You could be the first one to cut up the dance floor, DJ a \"party playlist,\" or lead a group sing-along to a favorite like \"Don't Stop Believing\" or \"Twist and Shout.\" Whatever you do, try and get other people involved in your shenanigans."
        },
        {
          "headline":"Throw yourself completely into the party atmosphere.",
          "description":"Own up to the theme, hit the dance floor with everything you've got, and stay involved with the games you play. You should be willing to step outside of your comfort zone, too, and let yourself live in the moment. As long as you stop from time to time to make sure you're not hurting or endangering anyone, a party animal knows how to spice things up and is willing to be a bit goofy to do it."
        },
        {
          "headline":"Have a sense of humor, but don't make a fool of yourself.",
          "description":"You don't want to take yourself so seriously that you're not having a fun, but you also don't want to be an annoying, overly idiotic party-goer begging for attention. Remember the old expression and make sure people are laughing \"with you, not at you.\" This should be easy if you just act like yourself and have fun, but never do something at a party just because you think it'll make you look cool -- it will almost always backfire."
        }
      ]
    }
  ],
  "text":" Preparing for the Party Dress up in a costume or extravagant \"going-outfit.\" Party animals announce their presence the minute the enter the room, and there is no better way to do this than a costume, prop, or killer outfit. Obviously, the outfit will change depending on the party, but the important thing to remember is that you want to wear it with confidence. A party animal wears something because they want to, not because they're worried about what other people think. For themed parties, you want to commit as completely to the theme as possible. Go big or go home. If it is a casual party, throw on a silly hat, shirt, or grab a weird prop to bring with you. Anything that calls attention to you will do. Have a few casual drinks before leaving. You don't want to be drunk when you arrive, but you also don't want to feel like you need to \"catch-up\" when you get there. If you're going to drink, ensure that you have a driver before leaving. Have something to eat an hour before the party. Unless you're going to a dinner party (where party animals are generally less welcome), chances are good you're not going to get a whole lot of food at the party. Eat a good meal before the party so that you energy and food in your stomach. Going into a party without eating beforehand isn't just a drag, it can be dangerous if there's drinking involved. Always have a good meal 1-2 hours before going so that you don't have to worry about feeling sick or foraging for food when you're in party animal mode. Arrive late. A party animal needs a habitat to party in. It will be difficult to get momentum going if you're the first one in the door, so play it cool and arrive fashionably late. If it is a smaller gathering or party, 15-20 minutes should be fine, but if you're going to a huge party you should try to arrive at least an hour after things have kicked off. If you do arrive before things really kick off, never fear. Just have fun, be energetic, and the party will soon follow your vibe. Make plans for the end of the party before you start partying. No one wants to deal with rides home or places to sleep once they've transformed into a party animal. It is smartest and safest to deal with these things in advance. Make sure you have a designated driver if the party has alcohol, and check with the host that you have a place to sleep if you will not be driving home. Check in with your friends to make sure you have a buddy at the party to watch out for you if things go poorly -- the two of you can make sure that you both make it home safely. Turning a Mild Party into a Blast Pull shy people into the party one at a time with friendly conversation. If you see someone by themselves or off in the corner, introduce yourself. Make them feel at home, then ask them to join you for a drink, a dance, or a game. The more people you pull into the party, the more rocking it becomes. You, the party animal, should be pulling as many other animals into your pack as possible. More importantly, the party animal needs to know everyone at the party, because everyone needs to know them. Listen to people as they talk and ask questions to get them comfortable speaking. Introduce people as you find common interests. Pour out drinks slowly if the party has alcohol. Forcing someone to do 5 shots in an hour is dangerous and can lead to a sloppy, sickening feeling. Instead, start drinking slowly, letting people get to their own comfortable level of drunkenness. A good party is one where everyone feels comfortable enough to let their inhibitions fly and have fun, not one where half the group is in the bathroom the whole time. Turn up the music. Find songs that everyone can enjoy but have a quick beat and a lot of energy. As the party gets going, slowly turn up the volume to get people moving. While people should still be able to have a conversation, you also want people to feel free to stop talking and start dancing. Each group has different musical tastes, but there are some go-to party genres that get most people moving:\nMotown\nHouse/Dance/Rave\nBeatles-era rock. 90's Hip-Hop. Play some games that get people moving, laughing, or sharing. Games are one of the most sure-fire ways to get the crowd together and start having fun. A little competition, some humor, and common thread of conversation will help the party bond and bring up the energy of the group naturally. Just make sure that lots of people can play, being as inclusive as possible. While there are hundreds of games to start with, from drinking games to big, humorous group board games like Cards Against Humanity, you can't go wrong with some of the classics:\nTruth or Dare\nNever Have I Ever\nKings\nWho am I? Bring a pack of party animals with you. Show up with people who are just as fun and willing to be a bit silly. Having a good group around you makes the infectious energy easier to spread. However, this doesn't mean your \"wolfpack\" comes in and ruins the party for everyone else. If they are annoying or sloppy, then you may also be considered annoying or sloppy as well. Mingle with other people, not just those in your group. Check with the host beforehand if it is okay to bring guests. Bring a party gift, like some food or extra drinks, if you show up with multiple people. Know that a rocking party takes time to get started. Think of the energy of a party as a volume dial -- you want to raise it slowly, but surely, so that you don't blast anyone's ears or shock people who are still having a quiet, relaxed time. Don't expect your presence to suddenly kick the party into overdrive. Instead, be a little stealthy, slowly turning up the volume (both literally and figuratively), until the party is really bumping. Be a strategic party animal, and suddenly you'll have the whole pack following you. Unleashing Your Inner Animal Be yourself and stick to your guns. A party animal is not at the whims of every person who comes up and asks to do a shot or play a game. The party animal knows that he knows how to party and that he makes the party. Be confident. Even if you're just faking it, confidence attracts attention, so \"fake it 'til you make it.\" Inject your own personality into the party by:\nRounding up groups for games that you want to play\nIntroducing yourself to new people\nDancing\nMixing up new \"cocktails.\" Remain in control of yourself. Party animals are not sloppy or too drunk to function, they are in control and having fun at all times. Know your limits and accept them, otherwise you'll tip over from party animal to annoying nuisance in no time. Being a party animal is not about being the drunkest person at the party, or showing off how cool you are to others. It is about being a blast in every situation, helping others loosen up and fun and driving the party energy up. Loosen up and let go of your inhibitions. Let go of your fears, even if it takes a few drinks to get you to play air guitar on the dance floor, so accept that fact. A party animal isn't the one who stands quietly in the corner; he is the one dancing on the tables, making everyone have more fun. You are in control of how much fun you have at a party, so stop wishing things were more lively and make them lively. Being a party animal is not about thinking and planning, it is about acting. So go dance, ask that girl if you can buy her a drink, play a game, and get a little rowdy. Lead the party from the front with group activities and games. Get the whole party on the same level, you party animal. You could be the first one to cut up the dance floor, DJ a \"party playlist,\" or lead a group sing-along to a favorite like \"Don't Stop Believing\" or \"Twist and Shout.\" Whatever you do, try and get other people involved in your shenanigans. Throw yourself completely into the party atmosphere. Own up to the theme, hit the dance floor with everything you've got, and stay involved with the games you play. You should be willing to step outside of your comfort zone, too, and let yourself live in the moment. As long as you stop from time to time to make sure you're not hurting or endangering anyone, a party animal knows how to spice things up and is willing to be a bit goofy to do it. Have a sense of humor, but don't make a fool of yourself. You don't want to take yourself so seriously that you're not having a fun, but you also don't want to be an annoying, overly idiotic party-goer begging for attention. Remember the old expression and make sure people are laughing \"with you, not at you.\" This should be easy if you just act like yourself and have fun, but never do something at a party just because you think it'll make you look cool -- it will almost always backfire.",
  "tyn_model":[
    "party animal",
    "games",
    "party animals",
    "meal",
    "food",
    "drinks",
    "alcohol",
    "music",
    "cocktails",
    "air guitar"
  ],
  "tyn_section":[

  ]
}