{
  "title":"How to Make a Rice Krispie and Caramel Treat",
  "url":"https://www.wikihow.com/Make-a-Rice-Krispie-and-Caramel-Treat",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Marshmallow Treats"
  ],
  "steps":[
    {
      "headline":"Gather your supplies.",
      "description":"Make sure you have everything before you start cooking! !"
    },
    {
      "headline":"Gather the caramel squares into the mixing bowl.",
      "description":"Unwrap the caramels into the mixing bowl. Make sure there is a lot! !"
    },
    {
      "headline":"Pour the Condensed Milk into the mixing bowl with the caramels.",
      "description":"Make sure it is all out of the can."
    },
    {
      "headline":"Get a stick of butter and put it into the same mixing bowl.",
      "description":"Don't melt the butter."
    },
    {
      "headline":"Take the Rice Krispies and pour them into a separate mixing bowl.",
      "description":"We will be dipping the Marshmallows into them later."
    },
    {
      "headline":"Once the caramels, condensed milk, and stick of butter is in the bowl, put it in the microwave for 6 minutes.",
      "description":"Every 30 seconds though, take out the batter and make sure to use your spoon and mix up your bowl."
    },
    {
      "headline":"While it's in the microwave, start putting Marshmallows on the sticks.",
      "description":"Make as many as you want! !"
    },
    {
      "headline":"Once the 6 minutes are up, let it cool and then dip your marshmallows into the batter.",
      "description":"Make sure to get most of the marshmallow while doing this, but don't let the marshmallow sit in there to long, or it will melt! !"
    },
    {
      "headline":"After dipping the marshmallow in the caramel, dip it into the Rice Krispies.",
      "description":"Twirl the marshmallow stick so the Marshmallow is covered with it. Sometimes you have to pour the Krispies on too, but only occasionally."
    },
    {
      "headline":"Depending on how many you made, wrap them into clear, plastic paper.",
      "description":"Make sure its held together with tape, and that it won't break."
    },
    {
      "headline":"Eat your treat!",
      "description":"Here is the best step! Time to eat your new snack!"
    }
  ],
  "text":" Gather your supplies. Make sure you have everything before you start cooking! ! Gather the caramel squares into the mixing bowl. Unwrap the caramels into the mixing bowl. Make sure there is a lot! ! Pour the Condensed Milk into the mixing bowl with the caramels. Make sure it is all out of the can. Get a stick of butter and put it into the same mixing bowl. Don't melt the butter. Take the Rice Krispies and pour them into a separate mixing bowl. We will be dipping the Marshmallows into them later. Once the caramels, condensed milk, and stick of butter is in the bowl, put it in the microwave for 6 minutes. Every 30 seconds though, take out the batter and make sure to use your spoon and mix up your bowl. While it's in the microwave, start putting Marshmallows on the sticks. Make as many as you want! ! Once the 6 minutes are up, let it cool and then dip your marshmallows into the batter. Make sure to get most of the marshmallow while doing this, but don't let the marshmallow sit in there to long, or it will melt! ! After dipping the marshmallow in the caramel, dip it into the Rice Krispies. Twirl the marshmallow stick so the Marshmallow is covered with it. Sometimes you have to pour the Krispies on too, but only occasionally. Depending on how many you made, wrap them into clear, plastic paper. Make sure its held together with tape, and that it won't break. Eat your treat! Here is the best step! Time to eat your new snack!",
  "tyn_model":[
    "mixing bowl",
    "butter",
    "condensed milk",
    "rice krispies",
    "bowl",
    "microwave",
    "spoon",
    "marshmallows",
    "caramel",
    "krispies",
    "tape"
  ],
  "tyn_section":[

  ]
}