{
  "title":"How to Make a Festive Christmas Season Cake",
  "url":"https://www.wikihow.com/Make-a-Festive-Christmas-Season-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Cake",
      "steps":[
        {
          "headline":"Buy a plain sponge cake from a local supermarket.",
          "description":""
        },
        {
          "headline":"Cover it with white icing.",
          "description":""
        },
        {
          "headline":"Sprinkle with icing sugar.",
          "description":""
        },
        {
          "headline":"Sprinkle with grated coconut(ignore if you can't find any).",
          "description":""
        }
      ]
    },
    {
      "name":"Tree",
      "steps":[
        {
          "headline":"Roll some white icing into a cone shape.",
          "description":""
        },
        {
          "headline":"Add four to five drops of green food dye to it.",
          "description":""
        },
        {
          "headline":"Roll a cylinder of white icing.",
          "description":""
        },
        {
          "headline":"Add three drops of orange food colouring.",
          "description":""
        },
        {
          "headline":"Attach the cylinder to the bottom of the cone.",
          "description":""
        },
        {
          "headline":"Coat with icing sugar.",
          "description":""
        },
        {
          "headline":"Attach the bottom of the tree to the top of the cake.",
          "description":""
        }
      ]
    },
    {
      "name":"House",
      "steps":[
        {
          "headline":"Roll a cube of white icing out.",
          "description":""
        },
        {
          "headline":"Add four to five drops of orange food dye to it.",
          "description":""
        },
        {
          "headline":"Roll two rectangles of white icing out.",
          "description":""
        },
        {
          "headline":"Add three to four drops of red icing to them.",
          "description":""
        },
        {
          "headline":"Attach the rectangles together so there is a triangular gap in the middle.",
          "description":""
        },
        {
          "headline":"Roll out two triangles of white icing (they should be slightly larger than the triangular gap in between the rectangles).",
          "description":""
        },
        {
          "headline":"Add three to four drops of red icing to them.",
          "description":""
        },
        {
          "headline":"Attach them to the rectangles so you make a prism shape.",
          "description":""
        },
        {
          "headline":"Attach the prism to the top of the cube (the prism should be slightly larger than the cube).",
          "description":""
        },
        {
          "headline":"Coat with icing sugar.",
          "description":""
        },
        {
          "headline":"Attach the bottom of the house to the top of the cake.",
          "description":""
        }
      ]
    },
    {
      "name":"Snowman",
      "steps":[
        {
          "headline":"Roll one large ball of white icing and roll one smaller ball of white icing.",
          "description":""
        },
        {
          "headline":"Attach the smaller ball to the top of the larger ball.",
          "description":""
        },
        {
          "headline":"Roll two tiny balls of white icing.",
          "description":""
        },
        {
          "headline":"Add two drops of black food colouring to them.",
          "description":""
        },
        {
          "headline":"Attach the black icing balls to the side of the smaller ball (like a snowman's face!",
          "description":")."
        },
        {
          "headline":"Roll up a tiny cone of white icing.",
          "description":""
        },
        {
          "headline":"Add one to two drops of orange food colouring to it.",
          "description":""
        },
        {
          "headline":"Attach it to the side of the smaller ball (like a snowman's face!)",
          "description":""
        },
        {
          "headline":"Roll up a tiny piece of white icing in the shape of a smile.",
          "description":""
        },
        {
          "headline":"Add one to two drops of black food colouring to it.",
          "description":""
        },
        {
          "headline":"Attach it to the smaller ball, just below the carrot.",
          "description":""
        },
        {
          "headline":"Coat with icing sugar.",
          "description":""
        },
        {
          "headline":"Attach the bottom of the snowman to the top of the cake.",
          "description":""
        }
      ]
    }
  ],
  "text":" Cake Buy a plain sponge cake from a local supermarket.  Cover it with white icing.  Sprinkle with icing sugar.  Sprinkle with grated coconut(ignore if you can't find any).  Tree Roll some white icing into a cone shape.  Add four to five drops of green food dye to it.  Roll a cylinder of white icing.  Add three drops of orange food colouring.  Attach the cylinder to the bottom of the cone.  Coat with icing sugar.  Attach the bottom of the tree to the top of the cake.  House Roll a cube of white icing out.  Add four to five drops of orange food dye to it.  Roll two rectangles of white icing out.  Add three to four drops of red icing to them.  Attach the rectangles together so there is a triangular gap in the middle.  Roll out two triangles of white icing (they should be slightly larger than the triangular gap in between the rectangles).  Add three to four drops of red icing to them.  Attach them to the rectangles so you make a prism shape.  Attach the prism to the top of the cube (the prism should be slightly larger than the cube).  Coat with icing sugar.  Attach the bottom of the house to the top of the cake.  Snowman Roll one large ball of white icing and roll one smaller ball of white icing.  Attach the smaller ball to the top of the larger ball.  Roll two tiny balls of white icing.  Add two drops of black food colouring to them.  Attach the black icing balls to the side of the smaller ball (like a snowman's face! ). Roll up a tiny cone of white icing.  Add one to two drops of orange food colouring to it.  Attach it to the side of the smaller ball (like a snowman's face!)  Roll up a tiny piece of white icing in the shape of a smile.  Add one to two drops of black food colouring to it.  Attach it to the smaller ball, just below the carrot.  Coat with icing sugar.  Attach the bottom of the snowman to the top of the cake. ",
  "tyn_model":[
    "white icing",
    "icing sugar",
    "orange food colouring",
    "red icing",
    "cake",
    "black food colouring",
    "sponge cake",
    "grated coconut(ignore",
    "green food dye",
    "orange food dye",
    "prism",
    "black icing",
    "carrot"
  ],
  "tyn_section":[

  ]
}