{
  "title":"How to Make Iced Tea Using a Microwave",
  "url":"https://www.wikihow.com/Make-Iced-Tea-Using-a-Microwave",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Tea",
    "Iced Tea"
  ],
  "steps":[
    {
      "headline":"Get the right tea bags.",
      "description":"Depending on the desired strength of your tea, use four family sized bags or 8 to 12 regular-sized bags of Lipton or Luzianne."
    },
    {
      "headline":"Take the teabags out of their paper wrappings and set it on the side.",
      "description":""
    },
    {
      "headline":"Fill a four cup sized microwaveable bowl or container with water.",
      "description":"Take the tea bags and put them into the water. Cover with a lid or small plate and place it in the microwave."
    },
    {
      "headline":"Place the heat on high for about 4 minutes, depending on the microwave watts.",
      "description":"It should let your tea bubble and steam to freshness."
    },
    {
      "headline":"Let the tea stand in the microwave for about 3 minutes.",
      "description":"This allows it to steep."
    },
    {
      "headline":"Take the tea out of the microwave and hold back the tea bags while pouring the tea liquid into a gallon container.",
      "description":"Repeat this process by filling the 4 cup container with the teabags up with water, holding the tea bags back, and pouring the water into the gallon pitcher, until the pitcher is full."
    },
    {
      "headline":"Add sweetener (1 1/2 tablespoons of \"Sweet N Low\" will sweeten a gallon of tea) or sugar (about 2 cups) and pour over ice.",
      "description":"Enjoy!"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Get the right tea bags. Depending on the desired strength of your tea, use four family sized bags or 8 to 12 regular-sized bags of Lipton or Luzianne. Take the teabags out of their paper wrappings and set it on the side.  Fill a four cup sized microwaveable bowl or container with water. Take the tea bags and put them into the water. Cover with a lid or small plate and place it in the microwave. Place the heat on high for about 4 minutes, depending on the microwave watts. It should let your tea bubble and steam to freshness. Let the tea stand in the microwave for about 3 minutes. This allows it to steep. Take the tea out of the microwave and hold back the tea bags while pouring the tea liquid into a gallon container. Repeat this process by filling the 4 cup container with the teabags up with water, holding the tea bags back, and pouring the water into the gallon pitcher, until the pitcher is full. Add sweetener (1 1/2 tablespoons of \"Sweet N Low\" will sweeten a gallon of tea) or sugar (about 2 cups) and pour over ice. Enjoy! Finished. ",
  "tyn_model":[
    "tea bags",
    "water",
    "microwave",
    "tea",
    "microwaveable bowl",
    "small plate",
    "gallon container",
    "gallon pitcher",
    "pitcher",
    "sweetener",
    "sweet n low\"",
    "sugar",
    "ice"
  ],
  "tyn_section":[

  ]
}