{
  "title":"How to Make a Small Space Divider",
  "url":"https://www.wikihow.com/Make-a-Small-Space-Divider",
  "category_hierarchy":[
    "Home and Garden",
    "Home Decorating"
  ],
  "methods":[
    {
      "name":"Trellis divider",
      "steps":[
        {
          "headline":"Purchase a section of wooden trellis.",
          "description":"It should be of a decent height (tall enough for it to make a break in vision, and if possible, higher than the average person)."
        },
        {
          "headline":"Cut the wooden wall trellis into three equal pieces, vertically.",
          "description":"These pieces will be joined together again in a way that allows them to be bent or folded."
        },
        {
          "headline":"Reattach the pieces to form the divider.",
          "description":"Tie the first piece with the second piece, then tie the second piece with the third, using wire or rope."
        },
        {
          "headline":"Weave dried plant parts, one beside other, through the frame squares.",
          "description":"Add more of this material until the plants completely cover the trellis. The dried plant parts are best when they are of the same height (or longer) as the divider you are going to make. Live plant vines could also be used but they're trickier and you will need to place the container growing the plant down in its final place before weaving. Moreover, moving the divider is much harder when you do this, so it's best for a more \"permanent\" divider, such as for an office. Instead of dried plant parts, you can use artificial floral items, such as long leaves, etc."
        },
        {
          "headline":"Put the divider up where you need it.",
          "description":"Angle the three partitions so that the divider stands in place unaided. Plant containers or similar weighted objects can be used to prevent the divider from falling over if accidentally knocked."
        }
      ]
    },
    {
      "name":"Shower curtain divider",
      "steps":[
        {
          "headline":"Choose a shower curtain with a design you think is perfect for the space to be divided.",
          "description":"If the area to be divided is longer than one curtain, choose another one or two in the same design. If the design is stripes, spots or some other pattern, you might consider varying the colors, as long as they match nicely."
        },
        {
          "headline":"Hang up a line of strong wire across the area to be divided.",
          "description":"Hang this either at ceiling height or above the area of a tall person walking through. You may also like to attach a curtain tieback hook on a wall or area for ease of pulling the curtain back to one side if needed. This step is optional."
        },
        {
          "headline":"Slip shower curtain rings into the shower curtain(s).",
          "description":""
        },
        {
          "headline":"Hang the shower curtain across the wire.",
          "description":"Pull the hung curtain across to create the divider."
        }
      ]
    },
    {
      "name":"Vinyl records divider",
      "steps":[
        {
          "headline":"Find a bundle of old, unwanted vinyl records.",
          "description":"The \"unwanted\" is an important part! Each record should be the same size, unless you're planning on deliberately using a big-small-big, etc. pattern. That's up to you. The amount of records you'll need depends on how much space you are trying to cover. If you are hanging them from the ceiling to say, sofa level, count on about eight records of large size for the vertical drop, then as many of these rows of eight as you need to cover the space to be divided. This could be a lot of records, so visit the local thrift store if you haven't got that many stashed away."
        },
        {
          "headline":"Select a color of contact paper that suits your room or area.",
          "description":"Contact paper is the best way to cover the records and make them all the same color. Prints are also possible but bear in mind that your room decor must be matched nicely."
        },
        {
          "headline":"Measure a round section of contact paper over a record.",
          "description":"This forms your template piece for records of that size. Use this to make as many circles as needed for the amount of records (one piece each side)."
        },
        {
          "headline":"Carefully peel off the backing of the contact paper and apply to each side of the first record.",
          "description":"Smooth out all bubbles and wrinkles so that the contact paper sits perfectly flat. Meet the edges of each side of each circle with care. Repeat for all records."
        },
        {
          "headline":"Use a long piece of thick wire, such as from a wire coat hanger, to make holes.",
          "description":"Mark four holes at even quarter spaces around the edges of the record circle. Heat the wire at one end over a stovetop and use the hot end to piece holes through the marked spots. Hold the wire with strong gloves, such as gardening gloves, in case it heats too much.Repeat for each record. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/81\\/Make-a-Small-Space-Divider-Step-15.jpg\\/v4-460px-Make-a-Small-Space-Divider-Step-15.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/81\\/Make-a-Small-Space-Divider-Step-15.jpg\\/v4-760px-Make-a-Small-Space-Divider-Step-15.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        },
        {
          "headline":"Join the divider together.",
          "description":"Use medium gauge wire to make ring joins between the holes, closing the wire with pliers. Cut the same lengths of wire for the entire project, although you may wish to make large rings for the top level rings, depending on the hook requirements from the hanging points. Make rows first, according to the measurement needed for your space. Then join the rows to form the entire hanging divider. Ensure that the top row has rings too, so that it can be hung from the ceiling, beam or other area, with ease."
        },
        {
          "headline":"Hang the divider.",
          "description":"Use planter hooks from the ceiling over the area in need of the divider, either with a piece of chain to add length or directly hang the divider straight from the hooks. It is important to have at least one helper to do this part, as hanging can be tricky."
        },
        {
          "headline":"Done.",
          "description":"You now have an amazing, funky divider for your room or area."
        }
      ]
    }
  ],
  "text":" Trellis divider Purchase a section of wooden trellis. It should be of a decent height (tall enough for it to make a break in vision, and if possible, higher than the average person). Cut the wooden wall trellis into three equal pieces, vertically. These pieces will be joined together again in a way that allows them to be bent or folded. Reattach the pieces to form the divider. Tie the first piece with the second piece, then tie the second piece with the third, using wire or rope. Weave dried plant parts, one beside other, through the frame squares. Add more of this material until the plants completely cover the trellis. The dried plant parts are best when they are of the same height (or longer) as the divider you are going to make. Live plant vines could also be used but they're trickier and you will need to place the container growing the plant down in its final place before weaving. Moreover, moving the divider is much harder when you do this, so it's best for a more \"permanent\" divider, such as for an office. Instead of dried plant parts, you can use artificial floral items, such as long leaves, etc. Put the divider up where you need it. Angle the three partitions so that the divider stands in place unaided. Plant containers or similar weighted objects can be used to prevent the divider from falling over if accidentally knocked. Shower curtain divider Choose a shower curtain with a design you think is perfect for the space to be divided. If the area to be divided is longer than one curtain, choose another one or two in the same design. If the design is stripes, spots or some other pattern, you might consider varying the colors, as long as they match nicely. Hang up a line of strong wire across the area to be divided. Hang this either at ceiling height or above the area of a tall person walking through. You may also like to attach a curtain tieback hook on a wall or area for ease of pulling the curtain back to one side if needed. This step is optional. Slip shower curtain rings into the shower curtain(s).  Hang the shower curtain across the wire. Pull the hung curtain across to create the divider. Vinyl records divider Find a bundle of old, unwanted vinyl records. The \"unwanted\" is an important part! Each record should be the same size, unless you're planning on deliberately using a big-small-big, etc. pattern. That's up to you. The amount of records you'll need depends on how much space you are trying to cover. If you are hanging them from the ceiling to say, sofa level, count on about eight records of large size for the vertical drop, then as many of these rows of eight as you need to cover the space to be divided. This could be a lot of records, so visit the local thrift store if you haven't got that many stashed away. Select a color of contact paper that suits your room or area. Contact paper is the best way to cover the records and make them all the same color. Prints are also possible but bear in mind that your room decor must be matched nicely. Measure a round section of contact paper over a record. This forms your template piece for records of that size. Use this to make as many circles as needed for the amount of records (one piece each side). Carefully peel off the backing of the contact paper and apply to each side of the first record. Smooth out all bubbles and wrinkles so that the contact paper sits perfectly flat. Meet the edges of each side of each circle with care. Repeat for all records. Use a long piece of thick wire, such as from a wire coat hanger, to make holes. Mark four holes at even quarter spaces around the edges of the record circle. Heat the wire at one end over a stovetop and use the hot end to piece holes through the marked spots. Hold the wire with strong gloves, such as gardening gloves, in case it heats too much.Repeat for each record. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/81\\/Make-a-Small-Space-Divider-Step-15.jpg\\/v4-460px-Make-a-Small-Space-Divider-Step-15.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/8\\/81\\/Make-a-Small-Space-Divider-Step-15.jpg\\/v4-760px-Make-a-Small-Space-Divider-Step-15.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Join the divider together. Use medium gauge wire to make ring joins between the holes, closing the wire with pliers. Cut the same lengths of wire for the entire project, although you may wish to make large rings for the top level rings, depending on the hook requirements from the hanging points. Make rows first, according to the measurement needed for your space. Then join the rows to form the entire hanging divider. Ensure that the top row has rings too, so that it can be hung from the ceiling, beam or other area, with ease. Hang the divider. Use planter hooks from the ceiling over the area in need of the divider, either with a piece of chain to add length or directly hang the divider straight from the hooks. It is important to have at least one helper to do this part, as hanging can be tricky. Done. You now have an amazing, funky divider for your room or area.",
  "tyn_model":[
    "wire",
    "contact paper",
    "shower curtain",
    "trellis divider",
    "trellis",
    "wooden wall trellis",
    "rope",
    "plants",
    "container",
    "plant containers",
    "shower curtain(s",
    "vinyl records",
    "records",
    "thick wire",
    "wire coat hanger",
    "stovetop",
    "gardening gloves",
    "parser",
    "medium gauge wire",
    "pliers",
    "planter hooks"
  ],
  "tyn_section":[

  ]
}