{
  "title":"How to Do a Tile Mural on a Bar Top",
  "url":"https://www.wikihow.com/Do-a-Tile-Mural-on-a-Bar-Top",
  "category_hierarchy":[
    "Home and Garden",
    "DIY",
    "Tiles and Tiling"
  ],
  "steps":[
    {
      "headline":"Choose the type of tile you would like to use.",
      "description":"Usually you will want to choose a type of tile that reflects your decorating colors, sports team or theme. Go to a hardware store to look through the various choices of glass, ceramic or stone. Another option is to create a tile mural with pennies. By placing pennies in a design, you can lay down a copper surface on your bar top."
    },
    {
      "headline":"Pick up thinset mortar, tile grout and a clear silicone sealer while you are at the hardware or home improvement store.",
      "description":"Go to the store with the measurements of your bar top, so that the staff can advise you on the quantity of tile and other supplies you will need."
    },
    {
      "headline":"Plan your tile mural surface ahead of time.",
      "description":"Remove your tile colors from the container and plan your design. Although you do not to use all the tiles at once, it is a good idea to set up the main images and take pictures or draw sketches, so that you stay on track once you begin to set your tile."
    },
    {
      "headline":"Clean your bar top with tri-sodium phosphate (TSP).",
      "description":"Open the windows and apply the diluted product according to package directions. This strong cleaner will ensure you don't have any dirt or products that will corrode your mortar. Rinse the TSP thoroughly off the bar counter surface. Wear gloves and long sleeves while cleaning the bar top."
    },
    {
      "headline":"Mix up your thinset mortar in a bucket.",
      "description":"Most thinset water is mixed with cool water. It will need to set for a while, so ensure you follow package directions well before you start to make your tile mural."
    },
    {
      "headline":"Spread a thin layer of thinset mortar across the bar top with a trowel.",
      "description":"Use the un-notched edge of the trowel to spread the first layer. Smooth it well to maintain an even surface."
    },
    {
      "headline":"Spread a second layer of mortar over the first layer.",
      "description":"This time, use the notched edge of the trowel to spread the mortar. Create uniform grooves in the mortar across the entire surface."
    },
    {
      "headline":"Begin to place your tiles onto the surface of the mortar, according to your pre-made mural plan.",
      "description":"Press the tile in only slightly. You do not need to push it to the bottom of the mortar. Be sure to set the tiles carefully to avoid getting mortar on the front of the tile. If this happens, remove the tile and clean it, then replace it onto your mural."
    },
    {
      "headline":"Continue placing your tile onto the mortar until you have completed your design.",
      "description":"Near the edge of the bar top, use tile snips to cut ceramic or glass tiles into diagonal or smaller shapes that fit within your borders."
    },
    {
      "headline":"Use a trowel and sponge to remove any mortar that has gone over the edge of the bar top.",
      "description":"You will want to ensure there isn't any errant mortar before you let it dry."
    },
    {
      "headline":"Allow it to dry according to the mortar's package directions.",
      "description":"It will need to set at least overnight."
    },
    {
      "headline":"Mix up a bucket of unsanded tile grout with cool water.",
      "description":"Follow the package directions to ensure the right ratios and timing."
    },
    {
      "headline":"Apply the tile grout over the tiles with a grout float.",
      "description":"Make sure you get a good layer of grout between your tiles."
    },
    {
      "headline":"Remove excess grout with the edge of your grout float.",
      "description":"Drag it across the top of the tiles. Allow the rest of the tile to set for 10 minutes."
    },
    {
      "headline":"Wet a sponge and squeeze it until it is damp, but not soaked.",
      "description":"Wipe the surface of the tiles thoroughly. Rinse and squeeze the sponge if it no longer cleans the tile."
    },
    {
      "headline":"Wipe the surface again with a dry towel.",
      "description":"You should remove any chalky film on the tiles with the dry towel."
    },
    {
      "headline":"Allow the caulk to dry as directed.",
      "description":"It may need to dry for up to 24 hours."
    },
    {
      "headline":"Apply clear silicone sealant over all of the grout.",
      "description":"This will help to avoid mold and mildew in your bar counter. Apply 2 coats, if your product suggests that it will create a better seal."
    },
    {
      "headline":"Allow the sealant to dry as directed before using.",
      "description":"Add trim to the counter top if desired."
    }
  ],
  "text":" Choose the type of tile you would like to use. Usually you will want to choose a type of tile that reflects your decorating colors, sports team or theme. Go to a hardware store to look through the various choices of glass, ceramic or stone. Another option is to create a tile mural with pennies. By placing pennies in a design, you can lay down a copper surface on your bar top. Pick up thinset mortar, tile grout and a clear silicone sealer while you are at the hardware or home improvement store. Go to the store with the measurements of your bar top, so that the staff can advise you on the quantity of tile and other supplies you will need. Plan your tile mural surface ahead of time. Remove your tile colors from the container and plan your design. Although you do not to use all the tiles at once, it is a good idea to set up the main images and take pictures or draw sketches, so that you stay on track once you begin to set your tile. Clean your bar top with tri-sodium phosphate (TSP). Open the windows and apply the diluted product according to package directions. This strong cleaner will ensure you don't have any dirt or products that will corrode your mortar. Rinse the TSP thoroughly off the bar counter surface. Wear gloves and long sleeves while cleaning the bar top. Mix up your thinset mortar in a bucket. Most thinset water is mixed with cool water. It will need to set for a while, so ensure you follow package directions well before you start to make your tile mural. Spread a thin layer of thinset mortar across the bar top with a trowel. Use the un-notched edge of the trowel to spread the first layer. Smooth it well to maintain an even surface. Spread a second layer of mortar over the first layer. This time, use the notched edge of the trowel to spread the mortar. Create uniform grooves in the mortar across the entire surface. Begin to place your tiles onto the surface of the mortar, according to your pre-made mural plan. Press the tile in only slightly. You do not need to push it to the bottom of the mortar. Be sure to set the tiles carefully to avoid getting mortar on the front of the tile. If this happens, remove the tile and clean it, then replace it onto your mural. Continue placing your tile onto the mortar until you have completed your design. Near the edge of the bar top, use tile snips to cut ceramic or glass tiles into diagonal or smaller shapes that fit within your borders. Use a trowel and sponge to remove any mortar that has gone over the edge of the bar top. You will want to ensure there isn't any errant mortar before you let it dry. Allow it to dry according to the mortar's package directions. It will need to set at least overnight. Mix up a bucket of unsanded tile grout with cool water. Follow the package directions to ensure the right ratios and timing. Apply the tile grout over the tiles with a grout float. Make sure you get a good layer of grout between your tiles. Remove excess grout with the edge of your grout float. Drag it across the top of the tiles. Allow the rest of the tile to set for 10 minutes. Wet a sponge and squeeze it until it is damp, but not soaked. Wipe the surface of the tiles thoroughly. Rinse and squeeze the sponge if it no longer cleans the tile. Wipe the surface again with a dry towel. You should remove any chalky film on the tiles with the dry towel. Allow the caulk to dry as directed. It may need to dry for up to 24 hours. Apply clear silicone sealant over all of the grout. This will help to avoid mold and mildew in your bar counter. Apply 2 coats, if your product suggests that it will create a better seal. Allow the sealant to dry as directed before using. Add trim to the counter top if desired.",
  "tyn_model":[
    "mortar",
    "trowel",
    "thinset mortar",
    "tile grout",
    "sponge",
    "grout float",
    "grout",
    "clear silicone sealer",
    "home improvement store",
    "tile",
    "container",
    "tiles",
    "tri-sodium phosphate",
    "bucket",
    "thinset water",
    "tile snips",
    "water",
    "dry towel",
    "clear silicone"
  ],
  "tyn_section":[

  ]
}