{
  "title":"How to Save Money Gardening",
  "url":"https://www.wikihow.com/Save-Money-Gardening",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "methods":[
    {
      "name":"Choose the Right Produce",
      "steps":[
        {
          "headline":"Plant produce that you and your family enjoy.",
          "description":"To save the most money gardening, select vegetables that you like to eat and would normally buy at the grocery store. Do not plant vegetables that you would not purchase on a regular basis."
        },
        {
          "headline":"Choose vegetables that can be preserved, stored or frozen.",
          "description":"By selecting vegetables that can be easily canned or frozen, you stretch your garden investment and may consume produce from your garden throughout the year. Plant cool-weather vegetables like onions, potatoes, carrots, sweet potatoes and winter squash that can be easily stored. Plant tomatoes, cucumbers, beans, corn, peas and beets that can be canned or frozen."
        },
        {
          "headline":"Grow vegetables that provide a high return on investment.",
          "description":"Plant vegetables that are expensive to buy in the store, or that you consume in large quantities. Consider options like tomatoes, green beans, onions, peppers, squash, potatoes, peas, lettuce, beets, spinach, carrots, broccoli, cucumbers and Swiss chard."
        }
      ]
    },
    {
      "name":"Grow Your Own Herbs",
      "steps":[
        {
          "headline":"Plant herbs for a high return on investment.",
          "description":"In most areas, you can purchase a packet of seeds or a small herb pot for about $1.50, which will produce leaves for an entire growing season. In contrast, fresh herbs at the grocery story typically cost about $3 for a single-use packet."
        },
        {
          "headline":"Select herbs that you use for culinary or household purposes.",
          "description":"Plant herbs that you frequently use in the kitchen, such as basil, rosemary, oregano or parsley. You can use the fresh herbs throughout the growing season, and you can dry the herbs for future use. Plant herbs that you use for household purposes. Herbs like lavender or lemon verbena can be used as air fresheners, added to soaps or infused in oils."
        }
      ]
    },
    {
      "name":"Grow Plants from Seed",
      "steps":[
        {
          "headline":"Plant seeds for a higher return on investment.",
          "description":"A packet of seeds is less expensive than a plant, and the yield is much greater. A seed packet can produce dozens of plants for less than a single established plant or a cell pack of seedlings."
        },
        {
          "headline":"Exchange seeds with friends.",
          "description":"Because seed packets typically provide more seeds than you need for a single growing season, exchange seeds with gardening friends. By exchanging seeds, you get more varieties of produce and lower your seed costs."
        }
      ]
    },
    {
      "name":"Use Recycled Materials in Your Garden",
      "steps":[
        {
          "headline":"Recycle newspapers for use in your garden.",
          "description":"Newspapers can be placed directly on gardens for use as weed barriers, or can be shredded and placed in containers to promote moisture."
        },
        {
          "headline":"Use yogurt containers or egg cartons as seed starting containers.",
          "description":"Recycle used (and clean) yogurt containers or egg cartons to grow seedlings. Poke a hole in the bottom of the containers prior to planting the seeds to allow air circulation."
        }
      ]
    }
  ],
  "text":" Choose the Right Produce Plant produce that you and your family enjoy. To save the most money gardening, select vegetables that you like to eat and would normally buy at the grocery store. Do not plant vegetables that you would not purchase on a regular basis. Choose vegetables that can be preserved, stored or frozen. By selecting vegetables that can be easily canned or frozen, you stretch your garden investment and may consume produce from your garden throughout the year. Plant cool-weather vegetables like onions, potatoes, carrots, sweet potatoes and winter squash that can be easily stored. Plant tomatoes, cucumbers, beans, corn, peas and beets that can be canned or frozen. Grow vegetables that provide a high return on investment. Plant vegetables that are expensive to buy in the store, or that you consume in large quantities. Consider options like tomatoes, green beans, onions, peppers, squash, potatoes, peas, lettuce, beets, spinach, carrots, broccoli, cucumbers and Swiss chard. Grow Your Own Herbs Plant herbs for a high return on investment. In most areas, you can purchase a packet of seeds or a small herb pot for about $1.50, which will produce leaves for an entire growing season. In contrast, fresh herbs at the grocery story typically cost about $3 for a single-use packet. Select herbs that you use for culinary or household purposes. Plant herbs that you frequently use in the kitchen, such as basil, rosemary, oregano or parsley. You can use the fresh herbs throughout the growing season, and you can dry the herbs for future use. Plant herbs that you use for household purposes. Herbs like lavender or lemon verbena can be used as air fresheners, added to soaps or infused in oils. Grow Plants from Seed Plant seeds for a higher return on investment. A packet of seeds is less expensive than a plant, and the yield is much greater. A seed packet can produce dozens of plants for less than a single established plant or a cell pack of seedlings. Exchange seeds with friends. Because seed packets typically provide more seeds than you need for a single growing season, exchange seeds with gardening friends. By exchanging seeds, you get more varieties of produce and lower your seed costs. Use Recycled Materials in Your Garden Recycle newspapers for use in your garden. Newspapers can be placed directly on gardens for use as weed barriers, or can be shredded and placed in containers to promote moisture. Use yogurt containers or egg cartons as seed starting containers. Recycle used (and clean) yogurt containers or egg cartons to grow seedlings. Poke a hole in the bottom of the containers prior to planting the seeds to allow air circulation.",
  "tyn_model":[
    "vegetables",
    "herbs",
    "seeds",
    "onions",
    "potatoes",
    "carrots",
    "tomatoes",
    "cucumbers",
    "peas",
    "newspapers",
    "produce",
    "sweet potatoes",
    "winter squash",
    "corn",
    "green beans",
    "peppers",
    "squash",
    "lettuce",
    "spinach",
    "broccoli",
    "swiss chard",
    "small herb pot",
    "basil",
    "rosemary",
    "oregano",
    "parsley",
    "plant",
    "containers",
    "yogurt",
    "yogurt containers"
  ],
  "tyn_section":[

  ]
}