{
  "title":"How to Draw a Dress",
  "url":"https://www.wikihow.com/Draw-a-Dress",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Objects",
    "Drawing Clothes",
    "Drawing Dresses"
  ],
  "methods":[
    {
      "name":"Basic Dress",
      "steps":[
        {
          "headline":"Look carefully at your girl.",
          "description":"Make sure you are satisfied with her appearance before going in for the clothes."
        },
        {
          "headline":"Draw a small loop at the base of her neck like you were going to draw a shirt.",
          "description":""
        },
        {
          "headline":"Continue to draw a shirt.",
          "description":""
        },
        {
          "headline":"WAIT!",
          "description":"When you get to the bottom of the shirt deign, keep going."
        },
        {
          "headline":"Make your lines swoop out.",
          "description":"Close them at the bottom."
        },
        {
          "headline":"Add some slightly curved lines going down the dress to create folds or ripples in the cloth.",
          "description":""
        }
      ]
    },
    {
      "name":"Other Dresses",
      "steps":[
        {
          "headline":"Draw a simple dress.",
          "description":"Learning to draw a simple dress will serve as a good basis when moving to more complicated drawings."
        },
        {
          "headline":"Draw a couture dress.",
          "description":"A couture dress is slightly more unique than a simple dress, but still easy to draw. They are often worn at more formal occasions, such as weddings, balls, and proms."
        },
        {
          "headline":"Draw a gown.",
          "description":"Drawing a gown requires many of the same techniques as drawing a couture dress, except that a gown is generally longer."
        },
        {
          "headline":"Draw an outfit.",
          "description":"Once you are able to comfortably draw a dress, challenge yourself by combining it with other accessories."
        }
      ]
    }
  ],
  "text":" Basic Dress Look carefully at your girl. Make sure you are satisfied with her appearance before going in for the clothes. Draw a small loop at the base of her neck like you were going to draw a shirt.  Continue to draw a shirt.  WAIT! When you get to the bottom of the shirt deign, keep going. Make your lines swoop out. Close them at the bottom. Add some slightly curved lines going down the dress to create folds or ripples in the cloth.  Other Dresses Draw a simple dress. Learning to draw a simple dress will serve as a good basis when moving to more complicated drawings. Draw a couture dress. A couture dress is slightly more unique than a simple dress, but still easy to draw. They are often worn at more formal occasions, such as weddings, balls, and proms. Draw a gown. Drawing a gown requires many of the same techniques as drawing a couture dress, except that a gown is generally longer. Draw an outfit. Once you are able to comfortably draw a dress, challenge yourself by combining it with other accessories.",
  "tyn_model":[
    "gown",
    "shirt"
  ],
  "tyn_section":[

  ]
}