{
  "title":"How to Recycle",
  "url":"https://www.wikihow.com/Recycle",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Household Waste Disposal",
    "Recycling"
  ],
  "methods":[
    {
      "name":"Recycling Common Items",
      "steps":[
        {
          "headline":"Call your local collection center to begin a recycling pick-up service.",
          "description":"To find recycling in your city or town, you can check RecyclingCenters.org. Know, however, that most cities offer free recycling, including the can to hold it, which means all you have to do is start sorting. Ask a neighbor or call your city's waste department to find out what days collection occur. If you don't have a recycling can, be sure to call your municipal waste department to talk over your options. If you live far from town, you may have to bring your own recycling into a center for processing. Find one at RecyclingCenters.org."
        },
        {
          "headline":"Check if your city requires pre-sorted recycling.",
          "description":"Single-stream recycling is when all recyclables go into the same can and the city deals with sorting paper from plastic, glass, etc. However, many cities require that you separate your paper, plastic, and glass into separate containers before you give it to them. It is much easier to sort the recycling ahead of time instead of on trash day, so ask a neighbor or check online for your city's specific policy. If your city allows single-stream, you likely have only one can for trash. If your city requires sorting, you will likely need to have three separate cans for paper, plastic, glass, and metal."
        },
        {
          "headline":"Research any specific laws or regulations regarding recycling in your area.",
          "description":"95% of recycling laws are the same across each city, but there are sometimes small particulars. To make it easier, the site RecycleByCity.com has a breakdown of major rules and regulations for a variety of cities. Be sure to check in if you're unsure. If your city isn't here, search for your city's recycling laws online. Note that most recycling cans have all the pertinent guidelines written on them. You can also find your city's waste department website for specific information."
        },
        {
          "headline":"Know the types of paper and cardboard that you can recycle.",
          "description":"Almost all paper, as long as it isn't food soiled, can be recycled. This includes mail, newspapers, magazines, old books, egg cartons, cereal boxes, and gift wrap. When recycling paper, make sure any other materials, like strings or metal (such as found on high-end gift cards), is removed."
        },
        {
          "headline":"Know the types of plastic that can be recycled.",
          "description":"If the plastic has the famous recycling triangle on it it can be recycled. This means empty bottles (caps removed), containers, cups, bags, plastic utensils, and more can all hit the recycling can. Furthermore, all-plastic toys, coat hangers, waste baskets, and takeout trays can all be recycled too as long as they are clean. Styrofoam, a type of plastic, can also be recycled. However, packing peanuts must generally be recycled in a closed plastic bag to prevent a mess. Many cities request that loose plastic bags be bundled, making them less likely to fly out of the truck and create litter."
        },
        {
          "headline":"Know the types of metal that can be recycled.",
          "description":"Metal can be a bit trickier to recycle, but all of the most common waste is easily recycled. Aluminum and steel cans, foil trays, old pots and pans, and completely empty aerosol cans are all game for recycling. Be sure to check about bigger things, like shower curtains or all-metal furniture."
        },
        {
          "headline":"Keep objects intact when recycling them.",
          "description":"While everyone loves the shredder, shredded paper actually is less useful when recycled, as more of it becomes waste. With aluminum cans, crushing them flat can sometimes prevent them from being recycled at all. The safest choice is to just leave everything whole as it goes in the can. In some cities, like Los Angeles, shredded paper can only be recycled if it is collected in a paper or plastic bag and labeled, \"Shredded Paper.\" This is why looking into your city's regulations is so important. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tOur Expert Agrees: If you're putting aluminum cans in your curbside recycling bin, leave them whole. If they're crushed, they can get missorted because they're flat, so they'll wind up with paper recycling, rather than the aluminum recycling where they belong."
        },
        {
          "headline":"Collect and bring your recycling can to the curb the night before pick up.",
          "description":"If your recycling pick-up is on Monday, bring the recycling to the curb on Sunday night. Pick-ups are frequently early in the morning, and it's best practice to just get it out there to avoid missing collection."
        },
        {
          "headline":"Save returnable cans and bottles to make some money back.",
          "description":"In 10 US states you can return aluminum cans and glass bottles for a few cents a pop at your local recycling center. If not, these bottles and cans can be recycled with your normal collection service. Keep the bottles and cans in separate containers while collecting them. Most places require you to weigh out or turn in aluminum and glass separately. The ten US locations that allow returns are California, Connecticut, Hawaii, Iowa, Maine, Massachusetts, Michigan, New York, Oregon, Vermont, and Guam."
        },
        {
          "headline":"Know the things that you can't recycle.",
          "description":"Obviously, you can't recycle food. But did you know that many places don't accept napkins or paper towels at all, especially if they are dirty or greasy? While most things are obviously trash or recyclables, there are a few tricky objects that seem recyclable but are not. The following can not be recycled curbside (some of these items must be dropped off at specific centres as instructed by your municipality because they are considered hazardous, even for the garbage):\nPyrex glass\nDrinking glasses\nFoil-lined bags (such as chip, candy, and coffee packages)\nDiapers\nGreasy or food covered cardboard (you can tear off the clean parts, however)\nLight bulbs\nBatteries and electronics\nPaint\nCleaners, oils, solvents, etc."
        }
      ]
    },
    {
      "name":"Recycling Specific Items (Electronics, Oils, Etc.)",
      "steps":[
        {
          "headline":"Bring all electronics to specific e-waste programs or donation centers.",
          "description":"Don't throw electronics out, and don't try to recycle them with everything else. Electronics often have toxic byproducts as they decay that don't belong in a landfill. If they still work but the manufacturer won't buy them back, bring them to a Goodwill, a thrift store, or pawnshop to keep them in use. If not, look up an e-waste program near you. e-Stewards has a worldwide database for finding an e-recylcer near you. Keep in mind that electronic waste covers more than just cell phones and computers. For example, stereo equipment and microwaves are also classified as e-waste."
        },
        {
          "headline":"Check if your electronics manufacture offers a recycle-back program.",
          "description":"Apple will take old iPhones off your hands, HP takes a variety of its computers, and stores like Verizon often have phone collection bins. Furthermore, Staples and Best Buy will both take almost any electronics for free, though TVs must be less than 32 inches. Batteries of all kinds should be recycled along with e-waste. The site Capstone Wireless will pay you for old phones, and let you print a free shipping label right from home."
        },
        {
          "headline":"Find your city's household chemicals center for paints, stains, and cleaning chemicals.",
          "description":"You cannot dump these toxic chemicals in either recycling or trash. Most cities and towns have a designated collection center for these chemicals, which should be treated with extra caution due to their toxicity. Some home improvement stores will also take them, but be sure to call ahead of time to be sure."
        },
        {
          "headline":"Return motor oil to participating mechanics instead of dumping it.",
          "description":"It will either be recycled or responsibly disposed. Never pour it down drains or throw it out. Many auto shops and parts stores, from Jiffy Lube to O'Reilly, have programs to handle auto waste."
        },
        {
          "headline":"Find out what recycling programs or centers exist nearby for further regulations.",
          "description":"If you're not already a part of an organized recycling collection service, you may need to look for the opportunities exist in your area, or perhaps you're looking for somewhere that can take those recyclables that your local collector cannot. The internet is the best place to start when looking for recycling programs:\n\nCanada – see the Wikipedia entry on recycling in Canada for various provincial schemes, http://en.wikipedia.org/wiki/Recycling_in_Canada\n\n\nU.K. – see Recycling Guide.org.uk, http://www.recycling-guide.org.uk/\n\n\nGermany - general guide in English, http://www.howtogermany.com/pages/recycling.html\n\n\nAustralia – see Recycle Australia.org, http://www.recycleaustralia.org/, relevant council websites, Environment Australia\n\nNew Zealand – see council website, http://www.plastics.org.nz/environmental/recycling/\n\n\nSouth Africa – see Guide to Recycling in South Africa, http://treevolution.co.za/guide-to-recycling-in-sa/, The National Recycling Forum, http://www.recycling.co.za/\n\n\nIreland – Recycling in Ireland and Directory of Irish Recycling, http://www.irishrecycling.com/"
        }
      ]
    },
    {
      "name":"Reducing and Reusing",
      "steps":[
        {
          "headline":"Know that lowering your total waste output is even better than recycling.",
          "description":"Whenever you can get multiple uses out of an object, you're greatly diminishing the wasteful manufacture of new products. While recycling is better for the planet than trash, the best thing to do is not to throw things out at all. Instead, try to find ways to reuse things around the house. Wikihow has a large list of ideas to get you started:\nHow to reuse Styrofoam\nHow to reuse balloons\nHow to reuse paint rollers\nHow to reuse old DVDs and CDs\n\nHow to reuse old newspapers and How to reuse paper\n\nHow to reuse old school supplies\nHow to reuse old candles\nHow to reuse junk materials\nHow to compost"
        },
        {
          "headline":"Donate or reuse old clothing instead of sending it to a landfill.",
          "description":"Clothes should only be thrown out as a last resort, when they can no longer be used or worn by anyone. Turn old shirts into cleaning rags, cut up nice sweaters and pillowcases for a quilt, and hand down clothes that don't fit you to younger relatives. Clothing is one of the most frequently, and unnecessarily, wasted products on the planet. Clothes you have no use for should be donated to the Salvation Army, Goodwill, and local charity drives. Unsure where to bring your clothes? Check out the non-profit Wear Don't Recycle for ideas on reuse and donation centers near you."
        },
        {
          "headline":"Rinse and reuse lightly-soiled plastic bags and containers.",
          "description":"Don't just toss the takeout package into the recycling when done -- use it to pack up lunch for the next day at work. If a snack bag had nothing but some pretzels in it, give it a quick rinse and use it the next day as well. These tips not only save the planet, they help you to save money."
        },
        {
          "headline":"Prioritize reusable products over one-time containers.",
          "description":"Instead of buying a water bottle every day, bring your own and fill it up. Bring your own travel mug to the coffee shop instead of taking a new Styrofoam cup each day. Use washable dish towels, cloth napkins, and rags instead of paper products. Whenever possible, make an effort to not even create the trash in the first place."
        },
        {
          "headline":"Buy recycled products over non-recycled versions whenever possible.",
          "description":"Help the recycling industry to flourish by preferring the products that come out of it. Some commonly recycled products you can purchase include:\nRecycled paper. Select the brands with the highest post-consumer waste (PCW) content, which refers to how much reused pulp has been used to make the paper. Insulation. There are various types of recycled insulation on the market. Clothing. Some brands specialize in turning PET bottles into new outdoor jackets, and second-hand stores have great clothes for great prices. Pens and pencils. Countertops. Look for great designs that include broken glass pieces––these can look absolutely stunning!"
        }
      ]
    }
  ],
  "text":" Recycling Common Items Call your local collection center to begin a recycling pick-up service. To find recycling in your city or town, you can check RecyclingCenters.org. Know, however, that most cities offer free recycling, including the can to hold it, which means all you have to do is start sorting. Ask a neighbor or call your city's waste department to find out what days collection occur. If you don't have a recycling can, be sure to call your municipal waste department to talk over your options. If you live far from town, you may have to bring your own recycling into a center for processing. Find one at RecyclingCenters.org. Check if your city requires pre-sorted recycling. Single-stream recycling is when all recyclables go into the same can and the city deals with sorting paper from plastic, glass, etc. However, many cities require that you separate your paper, plastic, and glass into separate containers before you give it to them. It is much easier to sort the recycling ahead of time instead of on trash day, so ask a neighbor or check online for your city's specific policy. If your city allows single-stream, you likely have only one can for trash. If your city requires sorting, you will likely need to have three separate cans for paper, plastic, glass, and metal. Research any specific laws or regulations regarding recycling in your area. 95% of recycling laws are the same across each city, but there are sometimes small particulars. To make it easier, the site RecycleByCity.com has a breakdown of major rules and regulations for a variety of cities. Be sure to check in if you're unsure. If your city isn't here, search for your city's recycling laws online. Note that most recycling cans have all the pertinent guidelines written on them. You can also find your city's waste department website for specific information. Know the types of paper and cardboard that you can recycle. Almost all paper, as long as it isn't food soiled, can be recycled. This includes mail, newspapers, magazines, old books, egg cartons, cereal boxes, and gift wrap. When recycling paper, make sure any other materials, like strings or metal (such as found on high-end gift cards), is removed. Know the types of plastic that can be recycled. If the plastic has the famous recycling triangle on it it can be recycled. This means empty bottles (caps removed), containers, cups, bags, plastic utensils, and more can all hit the recycling can. Furthermore, all-plastic toys, coat hangers, waste baskets, and takeout trays can all be recycled too as long as they are clean. Styrofoam, a type of plastic, can also be recycled. However, packing peanuts must generally be recycled in a closed plastic bag to prevent a mess. Many cities request that loose plastic bags be bundled, making them less likely to fly out of the truck and create litter. Know the types of metal that can be recycled. Metal can be a bit trickier to recycle, but all of the most common waste is easily recycled. Aluminum and steel cans, foil trays, old pots and pans, and completely empty aerosol cans are all game for recycling. Be sure to check about bigger things, like shower curtains or all-metal furniture. Keep objects intact when recycling them. While everyone loves the shredder, shredded paper actually is less useful when recycled, as more of it becomes waste. With aluminum cans, crushing them flat can sometimes prevent them from being recycled at all. The safest choice is to just leave everything whole as it goes in the can. In some cities, like Los Angeles, shredded paper can only be recycled if it is collected in a paper or plastic bag and labeled, \"Shredded Paper.\" This is why looking into your city's regulations is so important. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tOur Expert Agrees: If you're putting aluminum cans in your curbside recycling bin, leave them whole. If they're crushed, they can get missorted because they're flat, so they'll wind up with paper recycling, rather than the aluminum recycling where they belong. Collect and bring your recycling can to the curb the night before pick up. If your recycling pick-up is on Monday, bring the recycling to the curb on Sunday night. Pick-ups are frequently early in the morning, and it's best practice to just get it out there to avoid missing collection. Save returnable cans and bottles to make some money back. In 10 US states you can return aluminum cans and glass bottles for a few cents a pop at your local recycling center. If not, these bottles and cans can be recycled with your normal collection service. Keep the bottles and cans in separate containers while collecting them. Most places require you to weigh out or turn in aluminum and glass separately. The ten US locations that allow returns are California, Connecticut, Hawaii, Iowa, Maine, Massachusetts, Michigan, New York, Oregon, Vermont, and Guam. Know the things that you can't recycle. Obviously, you can't recycle food. But did you know that many places don't accept napkins or paper towels at all, especially if they are dirty or greasy? While most things are obviously trash or recyclables, there are a few tricky objects that seem recyclable but are not. The following can not be recycled curbside (some of these items must be dropped off at specific centres as instructed by your municipality because they are considered hazardous, even for the garbage):\nPyrex glass\nDrinking glasses\nFoil-lined bags (such as chip, candy, and coffee packages)\nDiapers\nGreasy or food covered cardboard (you can tear off the clean parts, however)\nLight bulbs\nBatteries and electronics\nPaint\nCleaners, oils, solvents, etc. Recycling Specific Items (Electronics, Oils, Etc.) Bring all electronics to specific e-waste programs or donation centers. Don't throw electronics out, and don't try to recycle them with everything else. Electronics often have toxic byproducts as they decay that don't belong in a landfill. If they still work but the manufacturer won't buy them back, bring them to a Goodwill, a thrift store, or pawnshop to keep them in use. If not, look up an e-waste program near you. e-Stewards has a worldwide database for finding an e-recylcer near you. Keep in mind that electronic waste covers more than just cell phones and computers. For example, stereo equipment and microwaves are also classified as e-waste. Check if your electronics manufacture offers a recycle-back program. Apple will take old iPhones off your hands, HP takes a variety of its computers, and stores like Verizon often have phone collection bins. Furthermore, Staples and Best Buy will both take almost any electronics for free, though TVs must be less than 32 inches. Batteries of all kinds should be recycled along with e-waste. The site Capstone Wireless will pay you for old phones, and let you print a free shipping label right from home. Find your city's household chemicals center for paints, stains, and cleaning chemicals. You cannot dump these toxic chemicals in either recycling or trash. Most cities and towns have a designated collection center for these chemicals, which should be treated with extra caution due to their toxicity. Some home improvement stores will also take them, but be sure to call ahead of time to be sure. Return motor oil to participating mechanics instead of dumping it. It will either be recycled or responsibly disposed. Never pour it down drains or throw it out. Many auto shops and parts stores, from Jiffy Lube to O'Reilly, have programs to handle auto waste. Find out what recycling programs or centers exist nearby for further regulations. If you're not already a part of an organized recycling collection service, you may need to look for the opportunities exist in your area, or perhaps you're looking for somewhere that can take those recyclables that your local collector cannot. The internet is the best place to start when looking for recycling programs:\n\nCanada – see the Wikipedia entry on recycling in Canada for various provincial schemes, http://en.wikipedia.org/wiki/Recycling_in_Canada\n\n\nU.K. – see Recycling Guide.org.uk, http://www.recycling-guide.org.uk/\n\n\nGermany - general guide in English, http://www.howtogermany.com/pages/recycling.html\n\n\nAustralia – see Recycle Australia.org, http://www.recycleaustralia.org/, relevant council websites, Environment Australia\n\nNew Zealand – see council website, http://www.plastics.org.nz/environmental/recycling/\n\n\nSouth Africa – see Guide to Recycling in South Africa, http://treevolution.co.za/guide-to-recycling-in-sa/, The National Recycling Forum, http://www.recycling.co.za/\n\n\nIreland – Recycling in Ireland and Directory of Irish Recycling, http://www.irishrecycling.com/ Reducing and Reusing Know that lowering your total waste output is even better than recycling. Whenever you can get multiple uses out of an object, you're greatly diminishing the wasteful manufacture of new products. While recycling is better for the planet than trash, the best thing to do is not to throw things out at all. Instead, try to find ways to reuse things around the house. Wikihow has a large list of ideas to get you started:\nHow to reuse Styrofoam\nHow to reuse balloons\nHow to reuse paint rollers\nHow to reuse old DVDs and CDs\n\nHow to reuse old newspapers and How to reuse paper\n\nHow to reuse old school supplies\nHow to reuse old candles\nHow to reuse junk materials\nHow to compost Donate or reuse old clothing instead of sending it to a landfill. Clothes should only be thrown out as a last resort, when they can no longer be used or worn by anyone. Turn old shirts into cleaning rags, cut up nice sweaters and pillowcases for a quilt, and hand down clothes that don't fit you to younger relatives. Clothing is one of the most frequently, and unnecessarily, wasted products on the planet. Clothes you have no use for should be donated to the Salvation Army, Goodwill, and local charity drives. Unsure where to bring your clothes? Check out the non-profit Wear Don't Recycle for ideas on reuse and donation centers near you. Rinse and reuse lightly-soiled plastic bags and containers. Don't just toss the takeout package into the recycling when done -- use it to pack up lunch for the next day at work. If a snack bag had nothing but some pretzels in it, give it a quick rinse and use it the next day as well. These tips not only save the planet, they help you to save money. Prioritize reusable products over one-time containers. Instead of buying a water bottle every day, bring your own and fill it up. Bring your own travel mug to the coffee shop instead of taking a new Styrofoam cup each day. Use washable dish towels, cloth napkins, and rags instead of paper products. Whenever possible, make an effort to not even create the trash in the first place. Buy recycled products over non-recycled versions whenever possible. Help the recycling industry to flourish by preferring the products that come out of it. Some commonly recycled products you can purchase include:\nRecycled paper. Select the brands with the highest post-consumer waste (PCW) content, which refers to how much reused pulp has been used to make the paper. Insulation. There are various types of recycled insulation on the market. Clothing. Some brands specialize in turning PET bottles into new outdoor jackets, and second-hand stores have great clothes for great prices. Pens and pencils. Countertops. Look for great designs that include broken glass pieces––these can look absolutely stunning!",
  "tyn_model":[
    "recycling",
    "paper",
    "– see",
    "electronics",
    "cardboard",
    "newspapers",
    "plastic",
    "containers",
    "styrofoam",
    "aluminum",
    "cans",
    "insulation",
    "recycling can",
    "sorting",
    "egg cartons",
    "cereal boxes",
    "cups",
    "plastic utensils",
    "packing peanuts",
    "aerosol cans",
    "shredder",
    "aluminum cans",
    "eco-friendly living",
    "aluminum recycling",
    "recycling pick",
    "bottles",
    "napkins",
    "towels",
    "pyrex glass",
    "diapers",
    "paint",
    "cleaners",
    "e-waste programs",
    "e-waste program",
    "e-stewards",
    "e-recylcer",
    "electronic waste",
    "computers",
    "household chemicals center",
    "paints",
    "motor oil",
    "auto shops",
    "recycling guide.org.uk",
    "– recycling",
    "trash",
    "balloons",
    "candles",
    "compost",
    "clothing",
    "pretzels",
    "water bottle",
    "travel mug",
    "styrofoam cup",
    "dish towels",
    "rags",
    "pet bottles",
    "pens"
  ],
  "tyn_section":[

  ]
}