{
  "title":"How to Play Rummy with More than Two People",
  "url":"https://www.wikihow.com/Play-Rummy-with-More-than-Two-People",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "methods":[
    {
      "name":"Set up",
      "steps":[
        {
          "headline":"Shuffle cards.",
          "description":""
        },
        {
          "headline":"Deal out seven cards to each player.",
          "description":"You should deal the cards out clockwise."
        },
        {
          "headline":"Place the remaining cards with the back side up.",
          "description":"This is called the stack."
        },
        {
          "headline":"Flip over the top card of the stack and place it face side up next to the stack.",
          "description":"This is called the discard pile. You should be able to see what the cards are in the discard pile."
        }
      ]
    },
    {
      "name":"Playing of actual game",
      "steps":[
        {
          "headline":"Player clockwise to dealer looks at his/her cards and can take a card from either the stack or can take one or multiple cards from the discard pile.",
          "description":""
        },
        {
          "headline":"Look at cards and try to find a sequence of 3 or more cards in one suit (Ex: 5, 6, 7 of hearts or three of one type of card (Ex: three 2s or three Kings).",
          "description":"Player may lay these cards down if he/she has a set."
        },
        {
          "headline":"To end your turn, you must drop a card in the discard pile.",
          "description":"No matter whether you use your turn to lay something down or not, to finish your turn, lay one card down in the discard pile which is not useful to you. You can look ahead and try to figure out a sequence to make with your cards or a set of like cards. The player next clockwise player gets a turn now."
        },
        {
          "headline":"This player now has their turn to pick up.",
          "description":"He/she can take the top card on the stack, the top card on the discard pile, or take more than one card form the discard pile. If the player chooses to take more than one card from the discard pile, then the player must be able to play the bottom card, the furthest down card of the picked up cards. If this is not possible, the player may not take these cards."
        },
        {
          "headline":"Lay down the cards.",
          "description":"This player now has to lay something down; a set of three in a sequence, like cards, or declare they are finished with their turn and give up one of their cards to the discard pile."
        },
        {
          "headline":"Continue to follow this pattern through all players.",
          "description":"Pick up to try to lay down cards and have one left over to say their turn is over."
        }
      ]
    },
    {
      "name":"Determine a winner",
      "steps":[
        {
          "headline":"The winner must pick up a card at the start of their turn as does everybody else.",
          "description":""
        },
        {
          "headline":"Player must empty their hand by the end of their turn.",
          "description":"This does not include the card they must have to say their turn is complete because all players must end by dropping a card in the drop pile. The card dropped may play, but that is OK the player does not have to play it."
        },
        {
          "headline":"Calculate the scores of all players.",
          "description":"Cards on table in a set are added to a score and cards in your hand are subtracted. Number cards from 2 to 9 are each worth 5 points, 10's, Jacks, Queens, and Kings are 10 points, and Aces and Jokers are 15 points."
        },
        {
          "headline":"Players can either end the game after this round and base the winner on the score of this round or write down their score on paper and play until someone reaches 300 or 500 points.",
          "description":"#*This may seem like it would take a while, but it is surprising how fast it can go."
        }
      ]
    }
  ],
  "text":" Set up Shuffle cards.  Deal out seven cards to each player. You should deal the cards out clockwise. Place the remaining cards with the back side up. This is called the stack. Flip over the top card of the stack and place it face side up next to the stack. This is called the discard pile. You should be able to see what the cards are in the discard pile. Playing of actual game Player clockwise to dealer looks at his/her cards and can take a card from either the stack or can take one or multiple cards from the discard pile.  Look at cards and try to find a sequence of 3 or more cards in one suit (Ex: 5, 6, 7 of hearts or three of one type of card (Ex: three 2s or three Kings). Player may lay these cards down if he/she has a set. To end your turn, you must drop a card in the discard pile. No matter whether you use your turn to lay something down or not, to finish your turn, lay one card down in the discard pile which is not useful to you. You can look ahead and try to figure out a sequence to make with your cards or a set of like cards. The player next clockwise player gets a turn now. This player now has their turn to pick up. He/she can take the top card on the stack, the top card on the discard pile, or take more than one card form the discard pile. If the player chooses to take more than one card from the discard pile, then the player must be able to play the bottom card, the furthest down card of the picked up cards. If this is not possible, the player may not take these cards. Lay down the cards. This player now has to lay something down; a set of three in a sequence, like cards, or declare they are finished with their turn and give up one of their cards to the discard pile. Continue to follow this pattern through all players. Pick up to try to lay down cards and have one left over to say their turn is over. Determine a winner The winner must pick up a card at the start of their turn as does everybody else.  Player must empty their hand by the end of their turn. This does not include the card they must have to say their turn is complete because all players must end by dropping a card in the drop pile. The card dropped may play, but that is OK the player does not have to play it. Calculate the scores of all players. Cards on table in a set are added to a score and cards in your hand are subtracted. Number cards from 2 to 9 are each worth 5 points, 10's, Jacks, Queens, and Kings are 10 points, and Aces and Jokers are 15 points. Players can either end the game after this round and base the winner on the score of this round or write down their score on paper and play until someone reaches 300 or 500 points. #*This may seem like it would take a while, but it is surprising how fast it can go.",
  "tyn_model":[
    "cards",
    "card",
    "queens",
    "kings"
  ],
  "tyn_section":[

  ]
}