{
  "title":"How to Store Organic Vegetables",
  "url":"https://www.wikihow.com/Store-Organic-Vegetables",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "methods":[
    {
      "name":"Preparing the Vegetables for Storage",
      "steps":[
        {
          "headline":"Remove plastic, wire or rubber bands.",
          "description":"This will allow the produce to breathe and prevent damage to the produce itself. Unwrap the wire or rubber band carefully so that you don’t bruise the produce."
        },
        {
          "headline":"Handle your organic produce as little as possible.",
          "description":"The more you handle produce and pull it apart, the faster the cells start to break down, causing micro-organisms to flourish."
        },
        {
          "headline":"Pay attention to the temperature.",
          "description":"Not all produce must be refrigerated, and much of it shouldn’t be refrigerated because the cold storage will affect flavor and moisture loss. If you must store organic produce in the refrigerator, be sure to let it warm to room temperature before eating it to get the best flavor. Never store the following organic vegetables in the refrigerator:\nPotatoes\nGarlic\nOnions\nWinter squash"
        }
      ]
    },
    {
      "name":"Storing the Vegetables",
      "steps":[
        {
          "headline":"Separate vegetables.",
          "description":"Flavors can intermingle and hardier vegetables can bruise the delicate leaves of other vegetables. Use these tips for storage:"
        },
        {
          "headline":"Store basil properly.",
          "description":"There are several ways to do this:\nWrap fresh basil in a paper towel and place it in a sealable plastic bag before you refrigerate it. Put fresh basil into an airtight glass jar along with a dampened paper towel and keep the jar on your countertop out of direct sunlight."
        },
        {
          "headline":"Keep celery refrigerated in a plastic bag.",
          "description":"Celery is porous and especially vulnerable to absorbing odors from other produce."
        },
        {
          "headline":"Put onions in a paper bag and store them in a cool, dry place.",
          "description":""
        },
        {
          "headline":"Store corn in its husk in the refrigerator.",
          "description":"Corn is best eaten as soon as possible after it is picked, so try to cook it immediately after you buy it."
        },
        {
          "headline":"Rinse artichokes and place them in an air-tight glass container before you put them in the refrigerator.",
          "description":""
        },
        {
          "headline":"Wrap a damp (not soggy) paper towel around broccoli before putting it into the refrigerator.",
          "description":""
        },
        {
          "headline":"Safely store asparagus at room temperature for up to 5 days.",
          "description":"Make sure it is out of direct sunlight."
        },
        {
          "headline":"Store green beans in a tightly closed plastic bag in the refrigerator.",
          "description":"Like corn, green beans are best if they are cooked and eaten immediately after purchase."
        },
        {
          "headline":"Store eggplant on the counter or in the refrigerator, but don’t wash it until you are ready to prepare it; eggplant does not like moisture.",
          "description":""
        },
        {
          "headline":"Place unwashed zucchini in a plastic bag or a vegetable crisper.",
          "description":""
        },
        {
          "headline":"Keep unwashed arugula in the refrigerator.",
          "description":"Wash it and pat it dry just before you use it."
        },
        {
          "headline":"Store fresh herbs in an airtight glass container in the refrigerator.",
          "description":"Most fresh herbs should be eaten with a week of purchase."
        },
        {
          "headline":"Wrap lettuce and other greens in a wet towel and refrigerate.",
          "description":""
        },
        {
          "headline":"Remove the tops from carrots, turnips, and beets because the tops will drain moisture from the roots.",
          "description":"If you want to cook beet or turnip greens, simply store them separately from the roots. Wash carrots, turnips, and beets just before you use them."
        },
        {
          "headline":"Store cabbages, radishes, and cauliflower in the refrigerator for up to 5 days.",
          "description":"Don’t remove the outer leaves or stems until you are ready to eat them raw or prepare them for cooking."
        },
        {
          "headline":"Always store spinach in a cold crisper; spinach will wilt fast at room temperature.",
          "description":""
        },
        {
          "headline":"Keep sweet potatoes and winter squash in a cool, dark, well-ventilated area.",
          "description":"They do not store well in the refrigerator."
        }
      ]
    }
  ],
  "text":" Preparing the Vegetables for Storage Remove plastic, wire or rubber bands. This will allow the produce to breathe and prevent damage to the produce itself. Unwrap the wire or rubber band carefully so that you don’t bruise the produce. Handle your organic produce as little as possible. The more you handle produce and pull it apart, the faster the cells start to break down, causing micro-organisms to flourish. Pay attention to the temperature. Not all produce must be refrigerated, and much of it shouldn’t be refrigerated because the cold storage will affect flavor and moisture loss. If you must store organic produce in the refrigerator, be sure to let it warm to room temperature before eating it to get the best flavor. Never store the following organic vegetables in the refrigerator:\nPotatoes\nGarlic\nOnions\nWinter squash Storing the Vegetables Separate vegetables. Flavors can intermingle and hardier vegetables can bruise the delicate leaves of other vegetables. Use these tips for storage: Store basil properly. There are several ways to do this:\nWrap fresh basil in a paper towel and place it in a sealable plastic bag before you refrigerate it. Put fresh basil into an airtight glass jar along with a dampened paper towel and keep the jar on your countertop out of direct sunlight. Keep celery refrigerated in a plastic bag. Celery is porous and especially vulnerable to absorbing odors from other produce. Put onions in a paper bag and store them in a cool, dry place.  Store corn in its husk in the refrigerator. Corn is best eaten as soon as possible after it is picked, so try to cook it immediately after you buy it. Rinse artichokes and place them in an air-tight glass container before you put them in the refrigerator.  Wrap a damp (not soggy) paper towel around broccoli before putting it into the refrigerator.  Safely store asparagus at room temperature for up to 5 days. Make sure it is out of direct sunlight. Store green beans in a tightly closed plastic bag in the refrigerator. Like corn, green beans are best if they are cooked and eaten immediately after purchase. Store eggplant on the counter or in the refrigerator, but don’t wash it until you are ready to prepare it; eggplant does not like moisture.  Place unwashed zucchini in a plastic bag or a vegetable crisper.  Keep unwashed arugula in the refrigerator. Wash it and pat it dry just before you use it. Store fresh herbs in an airtight glass container in the refrigerator. Most fresh herbs should be eaten with a week of purchase. Wrap lettuce and other greens in a wet towel and refrigerate.  Remove the tops from carrots, turnips, and beets because the tops will drain moisture from the roots. If you want to cook beet or turnip greens, simply store them separately from the roots. Wash carrots, turnips, and beets just before you use them. Store cabbages, radishes, and cauliflower in the refrigerator for up to 5 days. Don’t remove the outer leaves or stems until you are ready to eat them raw or prepare them for cooking. Always store spinach in a cold crisper; spinach will wilt fast at room temperature.  Keep sweet potatoes and winter squash in a cool, dark, well-ventilated area. They do not store well in the refrigerator.",
  "tyn_model":[
    "refrigerator",
    "vegetables",
    "basil",
    "onions",
    "winter squash",
    "celery",
    "plastic bag",
    "corn",
    "green beans",
    "herbs",
    "carrots",
    "beets",
    "spinach",
    "organic produce",
    "organic vegetables",
    "potatoes",
    "garlic",
    "airtight glass jar",
    "paper towel",
    "artichokes",
    "air-tight glass container",
    "broccoli",
    "asparagus",
    "eggplant",
    "zucchini",
    "vegetable crisper",
    "arugula",
    "airtight glass container",
    "lettuce",
    "wet towel",
    "beet",
    "turnips",
    "cabbages",
    "radishes",
    "cauliflower",
    "cold crisper",
    "sweet potatoes"
  ],
  "tyn_section":[

  ]
}