{
  "title":"How to Disassemble an Xbox",
  "url":"https://www.wikihow.com/Disassemble-an-Xbox",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Video Game Console Maintenance and Repair"
  ],
  "methods":[
    {
      "name":"Remove Faceplate and Grills",
      "steps":[
        {
          "headline":"Remove the faceplate.",
          "description":"Turn the Xbox upside down, place your finger in the hole, and pull forward. A good tug will be necessary."
        },
        {
          "headline":"Remove the lower grill.",
          "description":"There are six tabs, hidden behind the venting holes on the white side, which hold this piece on. Using your case opening tool or small screwdriver, pop these tabs one at a time and slowly remove the lower grill. Start at the front end, where the faceplate is located, as this will have a good place to grasp the grill to lift it as you go."
        },
        {
          "headline":"Remove the upper grill.",
          "description":"First, pull off the hard drive if you haven’t already. You will notice that the grill on this side is not flat. You will need to pop the two tabs which are located along the ledge first. Then pop the two tabs which are visible on the sides, much like the lower grill. The final tab is hidden under one of the rubber feet. This tab has a seal, which will indicate to Microsoft that you have broken your warranty."
        }
      ]
    },
    {
      "name":"Open the Casing",
      "steps":[
        {
          "headline":"Open the two hole tab section.",
          "description":"These two tabs, located next to the power plug, will probably need to be popped at the same time (they can be done one at a time but this is more difficult). This is when you will want to take advantage of the second small screwdriver. Using both of these or the case opening tool, pop the tabs and start to pry the shell open."
        },
        {
          "headline":"Open the five hole tab section.",
          "description":"At the other end of that side, you will see five more of these tabs. Pop them one at a time, keeping constant pressure as you open the shell, or use the case tool to open them all at once."
        },
        {
          "headline":"Ease open the shell.",
          "description":"Flip the 360 around to look at the front end, find the clip at the end near the DVD drive. This can be easily opened with your fingernail or a flathead screwdriver and a good deal of prying. There should be four tabs on this side, which you can take one at a time."
        },
        {
          "headline":"Unscrew the inner casing.",
          "description":"With the shell removed, you should be able to see the inner casing now. Open this by unscrewing the cover panel. Flip the Xbox onto the opposite side and pull off the remaining shell to reveal the inner components."
        }
      ]
    },
    {
      "name":"Adjust Inner Components",
      "steps":[
        {
          "headline":"Gently remove the DVD drive.",
          "description":"The cables which are attached to the DVD drive are very delicate so carefully remove this component first. Lift it up just enough to get to the cables and then gently pull out both of them. The DVD drive can be flashed, through a complex modding process, if certain malfunctions occur or firm or software modding is desired. However, if Microsoft discovers this type of modding, it will earn you a lifetime ban from Xbox Live."
        },
        {
          "headline":"Pop out the fan.",
          "description":"First, lift the white section of plastic. The fan below can be popped out, but there are also cables attached, so carefully remove those before pulling the fan out all of the way."
        },
        {
          "headline":"Access or remove the ring light.",
          "description":"The ring controls are easily accessed for modding or repair once the case is open like this."
        },
        {
          "headline":"Access or remove the motherboard.",
          "description":"The motherboard will also now be easily visible and accessible. You can carefully pull it up by the silver box at the center or fix it in place. Access to the motherboard can allow you to fix the heatsink (the usual cause of the Red Ring Of Death) by re-soldering or installing new screws. It will also allow you access for software or firmware mods, like reset glitch hacks. Just remember that these are very complex processes, even for those who are very skilled, and can get you banned by Microsoft."
        },
        {
          "headline":"Mod the hard disk drive.",
          "description":"Though it is not located in the main case, you can also open the hard disk drive in order to install a drive with more storage space. This is done by unscrewing all of the pieces, unplugging the HDD and sliding it out of the bay. At this point it is easily replaced with another hard drive, as the cables used are standard."
        }
      ]
    }
  ],
  "text":" Remove Faceplate and Grills Remove the faceplate. Turn the Xbox upside down, place your finger in the hole, and pull forward. A good tug will be necessary. Remove the lower grill. There are six tabs, hidden behind the venting holes on the white side, which hold this piece on. Using your case opening tool or small screwdriver, pop these tabs one at a time and slowly remove the lower grill. Start at the front end, where the faceplate is located, as this will have a good place to grasp the grill to lift it as you go. Remove the upper grill. First, pull off the hard drive if you haven’t already. You will notice that the grill on this side is not flat. You will need to pop the two tabs which are located along the ledge first. Then pop the two tabs which are visible on the sides, much like the lower grill. The final tab is hidden under one of the rubber feet. This tab has a seal, which will indicate to Microsoft that you have broken your warranty. Open the Casing Open the two hole tab section. These two tabs, located next to the power plug, will probably need to be popped at the same time (they can be done one at a time but this is more difficult). This is when you will want to take advantage of the second small screwdriver. Using both of these or the case opening tool, pop the tabs and start to pry the shell open. Open the five hole tab section. At the other end of that side, you will see five more of these tabs. Pop them one at a time, keeping constant pressure as you open the shell, or use the case tool to open them all at once. Ease open the shell. Flip the 360 around to look at the front end, find the clip at the end near the DVD drive. This can be easily opened with your fingernail or a flathead screwdriver and a good deal of prying. There should be four tabs on this side, which you can take one at a time. Unscrew the inner casing. With the shell removed, you should be able to see the inner casing now. Open this by unscrewing the cover panel. Flip the Xbox onto the opposite side and pull off the remaining shell to reveal the inner components. Adjust Inner Components Gently remove the DVD drive. The cables which are attached to the DVD drive are very delicate so carefully remove this component first. Lift it up just enough to get to the cables and then gently pull out both of them. The DVD drive can be flashed, through a complex modding process, if certain malfunctions occur or firm or software modding is desired. However, if Microsoft discovers this type of modding, it will earn you a lifetime ban from Xbox Live. Pop out the fan. First, lift the white section of plastic. The fan below can be popped out, but there are also cables attached, so carefully remove those before pulling the fan out all of the way. Access or remove the ring light. The ring controls are easily accessed for modding or repair once the case is open like this. Access or remove the motherboard. The motherboard will also now be easily visible and accessible. You can carefully pull it up by the silver box at the center or fix it in place. Access to the motherboard can allow you to fix the heatsink (the usual cause of the Red Ring Of Death) by re-soldering or installing new screws. It will also allow you access for software or firmware mods, like reset glitch hacks. Just remember that these are very complex processes, even for those who are very skilled, and can get you banned by Microsoft. Mod the hard disk drive. Though it is not located in the main case, you can also open the hard disk drive in order to install a drive with more storage space. This is done by unscrewing all of the pieces, unplugging the HDD and sliding it out of the bay. At this point it is easily replaced with another hard drive, as the cables used are standard.",
  "tyn_model":[
    "grill",
    "dvd drive",
    "fan",
    "motherboard",
    "hard drive",
    "hard disk drive",
    "grills",
    "case opening tool",
    "screwdriver",
    "small screwdriver",
    "case tool",
    "flathead screwdriver",
    "xbox",
    "xbox live",
    "plastic",
    "screws",
    "hdd",
    "cables"
  ],
  "tyn_section":[

  ]
}