{
  "title":"How to Make Invisible Ink Christmas Cards",
  "url":"https://www.wikihow.com/Make-Invisible-Ink-Christmas-Cards",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Puzzles and Memory Games"
  ],
  "methods":[
    {
      "name":"Writing on the Card",
      "steps":[
        {
          "headline":"Dip a toothpick in the lemon juice.",
          "description":""
        },
        {
          "headline":"Write a cute message on the front.",
          "description":"Perhaps something like \"Merry Christmas! \"."
        },
        {
          "headline":"Draw a picture on the front.",
          "description":"This is optional. To help you achieve this, draw lightly in pencil first. Follow the drawing lines with the lemon juice, then rub off the pencil marking."
        },
        {
          "headline":"Write a message inside.",
          "description":"Write something such as \"I Hope You Have A Very Merry Christmas!\". Or anything else you want to say secretly."
        },
        {
          "headline":"Sign your name invisibly too.",
          "description":""
        }
      ]
    },
    {
      "name":"Preparing the Envelope",
      "steps":[
        {
          "headline":"Write the other person's name on the back of the envelope.",
          "description":"Do this in visible ink."
        },
        {
          "headline":"Cut out a square of paper.",
          "description":"Write on it with the visible ink marker \"Put this Card Near a Light to Read. \"."
        },
        {
          "headline":"Place the card in the envelope.",
          "description":"Seal it. Perhaps slap on a bow. Then send it to your recipient."
        }
      ]
    }
  ],
  "text":" Writing on the Card Dip a toothpick in the lemon juice.  Write a cute message on the front. Perhaps something like \"Merry Christmas! \". Draw a picture on the front. This is optional. To help you achieve this, draw lightly in pencil first. Follow the drawing lines with the lemon juice, then rub off the pencil marking. Write a message inside. Write something such as \"I Hope You Have A Very Merry Christmas!\". Or anything else you want to say secretly. Sign your name invisibly too.  Preparing the Envelope Write the other person's name on the back of the envelope. Do this in visible ink. Cut out a square of paper. Write on it with the visible ink marker \"Put this Card Near a Light to Read. \". Place the card in the envelope. Seal it. Perhaps slap on a bow. Then send it to your recipient.",
  "tyn_model":[
    "pencil",
    "envelope",
    "toothpick",
    "lemon",
    "lemon juice",
    "paper",
    "visible ink marker",
    "card"
  ],
  "tyn_section":[

  ]
}