{
  "title":"How to Kill at Age of Mythology",
  "url":"https://www.wikihow.com/Kill-at-Age-of-Mythology",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games"
  ],
  "steps":[
    {
      "headline":"Get a lot of villagers.",
      "description":"Put 10 on food, 3 on gold and wood. (This is for supremacy or conquest.)"
    },
    {
      "headline":"Build a few houses when your population needs it.",
      "description":""
    },
    {
      "headline":"Advance to the next age anywhere between 4 to 6 minutes.",
      "description":""
    },
    {
      "headline":"Max out your houses when you can to get the most population.",
      "description":""
    },
    {
      "headline":"Make a few military buildings for fast production.",
      "description":"(e.g. longhouses if you're Norse)."
    },
    {
      "headline":"Always try to keep at your maximum population by training units.",
      "description":""
    },
    {
      "headline":"Increase you total number of villagers, around 15-20 on each resource (about 6-8 on each for Atlantean), and if Greek, about 5 or so on favor.",
      "description":""
    },
    {
      "headline":"Advance to the heroic age as soon as possible, to unlock better units, upgrades, and buildings.",
      "description":""
    },
    {
      "headline":"When attacking, be sure to micromanage them so that siege weapons take out buildings, and to make sure that the enemy isn't picking off your wandering troops.",
      "description":""
    },
    {
      "headline":"Advance to the Mythic Age if you can and have a solid trade route, and continue to pump out upgraded units and strong myth units.",
      "description":"Strategy is key."
    },
    {
      "headline":"Defeat your enemies by thinking and micromanaging better than them.",
      "description":"(Kill their economy)"
    }
  ],
  "text":" Get a lot of villagers. Put 10 on food, 3 on gold and wood. (This is for supremacy or conquest.) Build a few houses when your population needs it.  Advance to the next age anywhere between 4 to 6 minutes.  Max out your houses when you can to get the most population.  Make a few military buildings for fast production. (e.g. longhouses if you're Norse). Always try to keep at your maximum population by training units.  Increase you total number of villagers, around 15-20 on each resource (about 6-8 on each for Atlantean), and if Greek, about 5 or so on favor.  Advance to the heroic age as soon as possible, to unlock better units, upgrades, and buildings.  When attacking, be sure to micromanage them so that siege weapons take out buildings, and to make sure that the enemy isn't picking off your wandering troops.  Advance to the Mythic Age if you can and have a solid trade route, and continue to pump out upgraded units and strong myth units. Strategy is key. Defeat your enemies by thinking and micromanaging better than them. (Kill their economy)",
  "tyn_model":[
    "wood",
    "siege weapons"
  ],
  "tyn_section":[

  ]
}