{
  "title":"How to Create an Origami Frog Family and Lily Pads to Live On",
  "url":"https://www.wikihow.com/Create-an-Origami-Frog-Family-and-Lily-Pads-to-Live-On",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "steps":[
    {
      "headline":"Start with a sheet of paper.",
      "description":"You can use ordinary printer paper, colored paper, or origami paper."
    },
    {
      "headline":"Fold one corner diagonally down to the opposite edge, then open it back up and fold the paper on the other diagonal.",
      "description":""
    },
    {
      "headline":"Trim any extra paper outside of the square you just made, as shown.",
      "description":"Skip this step if you are already using square (origami) paper. Pure origami only uses folding to create shapes--that means no cutting or tearing."
    },
    {
      "headline":"Open the square back up and fold it backwards, across the intersection of the two diagonal lines.",
      "description":""
    },
    {
      "headline":"Open the paper again and push in the sides.",
      "description":""
    },
    {
      "headline":"Fold the outside corner up to the top point.",
      "description":"Then, fold the other corner up."
    },
    {
      "headline":"Fold the new corner in, towards the center line.",
      "description":"Then, fold the other corner in towards the center."
    },
    {
      "headline":"Now fold the top corners back out, until the edge is even with the edge underneath.",
      "description":"Repeat folding the top corners, as shown above, except on the other side."
    },
    {
      "headline":"Turn the paper over.",
      "description":""
    },
    {
      "headline":"Fold the outer corners towards you, into the center.",
      "description":""
    },
    {
      "headline":"Fold the outer corners back out, so that they're even with the outside edges.",
      "description":"You're almost done."
    },
    {
      "headline":"Fold the frog in half.",
      "description":""
    },
    {
      "headline":"Turn the frog over so the legs are facing away from you.",
      "description":"Now fold those in half so it looks like the picture. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e4\\/Create-an-Origami-Frog-Family-and-Lily-Pads-to-Live-On-Step-13Bullet1.jpg\\/v4-459px-Create-an-Origami-Frog-Family-and-Lily-Pads-to-Live-On-Step-13Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e4\\/Create-an-Origami-Frog-Family-and-Lily-Pads-to-Live-On-Step-13Bullet1.jpg\\/v4-759px-Create-an-Origami-Frog-Family-and-Lily-Pads-to-Live-On-Step-13Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
    },
    {
      "headline":"Draw an outline of a lily pad.",
      "description":""
    },
    {
      "headline":"Cut it out, and now you have a home for your frogs.",
      "description":""
    },
    {
      "headline":"Get a shoe box or tissue box.",
      "description":""
    },
    {
      "headline":"If you have a tissue box, cut out a side.",
      "description":""
    },
    {
      "headline":"Put your lily pad in the shoe box.",
      "description":""
    },
    {
      "headline":"Make a background.",
      "description":"One good idea is to draw more frogs."
    },
    {
      "headline":"Stand back and admire your frog diorama.",
      "description":""
    }
  ],
  "text":" Start with a sheet of paper. You can use ordinary printer paper, colored paper, or origami paper. Fold one corner diagonally down to the opposite edge, then open it back up and fold the paper on the other diagonal.  Trim any extra paper outside of the square you just made, as shown. Skip this step if you are already using square (origami) paper. Pure origami only uses folding to create shapes--that means no cutting or tearing. Open the square back up and fold it backwards, across the intersection of the two diagonal lines.  Open the paper again and push in the sides.  Fold the outside corner up to the top point. Then, fold the other corner up. Fold the new corner in, towards the center line. Then, fold the other corner in towards the center. Now fold the top corners back out, until the edge is even with the edge underneath. Repeat folding the top corners, as shown above, except on the other side. Turn the paper over.  Fold the outer corners towards you, into the center.  Fold the outer corners back out, so that they're even with the outside edges. You're almost done. Fold the frog in half.  Turn the frog over so the legs are facing away from you. Now fold those in half so it looks like the picture. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e4\\/Create-an-Origami-Frog-Family-and-Lily-Pads-to-Live-On-Step-13Bullet1.jpg\\/v4-459px-Create-an-Origami-Frog-Family-and-Lily-Pads-to-Live-On-Step-13Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/e\\/e4\\/Create-an-Origami-Frog-Family-and-Lily-Pads-to-Live-On-Step-13Bullet1.jpg\\/v4-759px-Create-an-Origami-Frog-Family-and-Lily-Pads-to-Live-On-Step-13Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Draw an outline of a lily pad.  Cut it out, and now you have a home for your frogs.  Get a shoe box or tissue box.  If you have a tissue box, cut out a side.  Put your lily pad in the shoe box.  Make a background. One good idea is to draw more frogs. Stand back and admire your frog diorama. ",
  "tyn_model":[
    "paper",
    "lily pad",
    "shoe box",
    "tissue box",
    "printer paper",
    "colored paper",
    "origami paper"
  ],
  "tyn_section":[

  ]
}