{
  "title":"How to Clean the Exterior of Your Garage",
  "url":"https://www.wikihow.com/Clean-the-Exterior-of-Your-Garage",
  "category_hierarchy":[
    "Home and Garden",
    "Garages"
  ],
  "steps":[
    {
      "headline":"Use a jet wash machine to clean the walls of the garage.",
      "description":"This will get rid of the build-up of dirt and make the brickwork look fresher. However, don’t use the jet wash machine on the garage door or the windows as this may cause damage to these more fragile surfaces. Remember that these machines can be extremely powerful, so you might take some of the cement away when cleaning the brickwork."
    },
    {
      "headline":"Once the walls have been treated, use a cloth and a bucket of warm soapy water to clean the windows.",
      "description":"Make sure you tackle the built up of dirt in the corners and along the window fixings too, so that the both the windows and the surroundings look clean."
    },
    {
      "headline":"Clean the garage door in the same way by using a clean cloth and a bucket of warm water.",
      "description":"Again, you don’t want to use the pressurised jet wash on this part of the structure as it may cause paintwork to peel away, or leave small dents on the surface."
    },
    {
      "headline":"If you’ve worked your way around the walls of the building, the last area you will need to address is the roof.",
      "description":"This is where moss, twigs and leaves can gather, so you may need to use a ladder to get on to the roof and sweep away any debris. Make sure you have assistance during this stage and take care as you obviously won’t want to fall off the roof."
    },
    {
      "headline":"After completing these stages, make your way around the garage and see if all areas have been treated.",
      "description":"If you notice any sections that you have missed then simply clean them and then stand back and admire your newly cleaned garage."
    }
  ],
  "text":" Use a jet wash machine to clean the walls of the garage. This will get rid of the build-up of dirt and make the brickwork look fresher. However, don’t use the jet wash machine on the garage door or the windows as this may cause damage to these more fragile surfaces. Remember that these machines can be extremely powerful, so you might take some of the cement away when cleaning the brickwork. Once the walls have been treated, use a cloth and a bucket of warm soapy water to clean the windows. Make sure you tackle the built up of dirt in the corners and along the window fixings too, so that the both the windows and the surroundings look clean. Clean the garage door in the same way by using a clean cloth and a bucket of warm water. Again, you don’t want to use the pressurised jet wash on this part of the structure as it may cause paintwork to peel away, or leave small dents on the surface. If you’ve worked your way around the walls of the building, the last area you will need to address is the roof. This is where moss, twigs and leaves can gather, so you may need to use a ladder to get on to the roof and sweep away any debris. Make sure you have assistance during this stage and take care as you obviously won’t want to fall off the roof. After completing these stages, make your way around the garage and see if all areas have been treated. If you notice any sections that you have missed then simply clean them and then stand back and admire your newly cleaned garage.",
  "tyn_model":[
    "jet wash",
    "bucket",
    "cement",
    "cloth",
    "soapy water",
    "warm water",
    "ladder"
  ],
  "tyn_section":[

  ]
}