{
  "title":"How to Make Goldfish Paper Lanterns",
  "url":"https://www.wikihow.com/Make-Goldfish-Paper-Lanterns",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Lanterns"
  ],
  "parts":[
    {
      "name":"Making a Simple Goldfish Lantern",
      "steps":[
        {
          "headline":"Get a solid-colored paper lantern and open it up.",
          "description":"Most goldfish are orange, but yours can be any color you want."
        },
        {
          "headline":"Draw a tail fin shape onto a sheet of construction paper, then cut it out with a pair of scissors.",
          "description":"Make the base of the tail straight so that you can attach it to the lantern. Be sure to draw the tail ½ to 1 inch (1.27 to 2.54 centimeters) longer than you want it to be. Choose a color that closely matches the color of your lantern."
        },
        {
          "headline":"Make the base of the tail.",
          "description":"Fold the base of the tail down by ½ to 1 inch (1.25 to 2.54 centimeters) to make a flap. Cut a slit into the middle of the flap, all the way down to the folded edge to create two flaps. Leave one of the flaps the way it is, and fold the other one to the back of the fin. You will now have two flaps, with each one pointing in a different direction. This will not only allow the tail to flap about, but also make it easier to glue on."
        },
        {
          "headline":"Attach the fin to the lantern.",
          "description":"Turn the lantern so that one of the holes is facing up. Use a hot glue gun or double-sided tape to attach the tail to the side of the lantern."
        },
        {
          "headline":"Draw two side fin shapes, then cut them out.",
          "description":"To make the fins even, stack two sheets of construction paper one on top of the other first, draw your fin shape, then cut it out. You don't need to make the base of the fins flat or straight."
        },
        {
          "headline":"Attach the fins to the side of the lantern.",
          "description":"Find the middle of the lantern, then attach the bottom tip of the fin with a drop of glue or a small piece of double-sided tape. Repeat this step for the other side of the fish with the other fin. Don't glue the entire fin down. You want it to stick out."
        },
        {
          "headline":"Cut two circles out of white construction paper, and two circles out of black construction paper to make the eyes.",
          "description":"Make sure that the black circles are smaller. You can also use printer paper and cardstock for this. Another alternative would be to use large googly eyes; make sure that they are proportionate to your fish!"
        },
        {
          "headline":"Attach the eyes to the fish.",
          "description":"Position them in front of the side fins and just above them. You can attach them using double-sided tape or a hot glue gun. If you are using googly eyes, however, a hot glue might be the better option."
        },
        {
          "headline":"Thread some string through the top of the fish so that you can hang it.",
          "description":"Thread a piece of string through the bar in the top hole of your lantern, then tie it into a loop. If your lantern doesn't have a bar, poke two small holes in the top of the lantern, just below the ring opening."
        },
        {
          "headline":"Hang the loop from a hook wherever you want.",
          "description":"These lanterns make great decorations for underwater themed parties and rooms. Be careful not to get them wet, however!"
        }
      ]
    },
    {
      "name":"Making a Fancy Goldfish Lantern",
      "steps":[
        {
          "headline":"Get a solid-colored paper lantern and open it up.",
          "description":"The smaller your lantern is, the easier it will be to work with. Look for something that is about 12 inches (30.48 centimeters) in diameter. Most goldfish are orange, but you can make your goldfish any color you want."
        },
        {
          "headline":"Trace a circle that is the same size as the smaller opening on your lantern onto a sheet of tissue paper.",
          "description":"Choose a different color than your lantern. It can be lighter, darker, or even a contrasting color. Make the circle as even as you can. If possible, use a pencil to trace around to smaller opening of the lantern. If both of the openings are the same size, simply choose one of them."
        },
        {
          "headline":"Trace a larger circle around the first circle.",
          "description":"How much space you leave between the two circles depends on the size of you lantern. The bigger your lantern is, the more space you will need. Start with ½ inch (1.27 centimeters) and go from there."
        },
        {
          "headline":"Cut the circles out, then save the ring.",
          "description":"Discard the inner circle, or save it for another project."
        },
        {
          "headline":"Use a glue stick to glue the ring onto the smaller opening.",
          "description":"This will create an open mouth for the goldfish. If you have any excess tissue paper hanging over the opening, you can trim it off with a pair of scissors, or fold it into the lantern and secure it with more glue."
        },
        {
          "headline":"Cut two circles out of white tissue paper, and two smaller circles out of black cardstock or construction paper.",
          "description":"If you don't have any white tissue paper, you can use white printer paper instead."
        },
        {
          "headline":"Glue the black circles onto the white circles, then the white circles onto the lantern.",
          "description":"Glue the white circles above the \"mouth\" and slightly to the side."
        },
        {
          "headline":"Cut out two top fin shapes out of tissue paper.",
          "description":"Stack two sheets of tissue paper, then cut a fin shape out; this way, you will end up with two matching fins. Use a color that matches your lantern. Most top fins will be long and somewhat skinny. Make sure that yours is at least 2 inches (5.08 centimeters) tall."
        },
        {
          "headline":"Glue them together, except for the bottom ½ to 1 inch (1.27 to 2.54 centimeters).",
          "description":"Use a pair of scissors to trim of any overhanging tissue paper. The double tissue paper layer will help the top fin stand up."
        },
        {
          "headline":"Fold the loose ends of the fin down to create two flaps, then attach it to the fish.",
          "description":"Place a strip of double-sided tape to each flap, then place the fin on top of the fish. Run your finger across the top of each flap to seal the tape."
        },
        {
          "headline":"Cut out two side fins out of matching tissue paper, then attach them to the sides of the fish.",
          "description":"You can use a glue stick or double-sides tape for this. Make sure that you are only gluing the bottom edge so that the fins can flap around. You don't have to create double layers for these or fold any flaps. The side fins can be as long and flowing as you'd like."
        },
        {
          "headline":"Cut out two tail shapes out of matching tissue paper.",
          "description":"Stack two sheets of tissue paper, then cut a tail fin out; you will end up with two identical shapes. You will be fitting the tail over the back hole on your lantern, so be sure to add ½ of the hole's width, plus an additional ½ to 1 inch (1.27 to 2.54 centimeters)."
        },
        {
          "headline":"Glue them together, except for the bottom few inches.",
          "description":"How much you leave unglued depends on the excess amount you added. Once again, use a pair of scissors to trim off any overhanging pieces of tissue paper."
        },
        {
          "headline":"Fold the loose ends out to create flaps, then attach them to the back of the fish.",
          "description":"Position the tail over the back opening. Fold the excess tissue paper over the edges of the opening, then glue or tape them down onto the body of the fish."
        },
        {
          "headline":"Use a needle to thread clear string through the top of the fish.",
          "description":"Be sure to go under one of the metal ribs to prevent the tissue paper from tearing."
        },
        {
          "headline":"Tie the string into a loop, then hang your fish.",
          "description":"This fish makes a great decoration for parties or underwater themed rooms. Be careful not to get it wet, however!"
        }
      ]
    }
  ],
  "text":" Making a Simple Goldfish Lantern Get a solid-colored paper lantern and open it up. Most goldfish are orange, but yours can be any color you want. Draw a tail fin shape onto a sheet of construction paper, then cut it out with a pair of scissors. Make the base of the tail straight so that you can attach it to the lantern. Be sure to draw the tail ½ to 1 inch (1.27 to 2.54 centimeters) longer than you want it to be. Choose a color that closely matches the color of your lantern. Make the base of the tail. Fold the base of the tail down by ½ to 1 inch (1.25 to 2.54 centimeters) to make a flap. Cut a slit into the middle of the flap, all the way down to the folded edge to create two flaps. Leave one of the flaps the way it is, and fold the other one to the back of the fin. You will now have two flaps, with each one pointing in a different direction. This will not only allow the tail to flap about, but also make it easier to glue on. Attach the fin to the lantern. Turn the lantern so that one of the holes is facing up. Use a hot glue gun or double-sided tape to attach the tail to the side of the lantern. Draw two side fin shapes, then cut them out. To make the fins even, stack two sheets of construction paper one on top of the other first, draw your fin shape, then cut it out. You don't need to make the base of the fins flat or straight. Attach the fins to the side of the lantern. Find the middle of the lantern, then attach the bottom tip of the fin with a drop of glue or a small piece of double-sided tape. Repeat this step for the other side of the fish with the other fin. Don't glue the entire fin down. You want it to stick out. Cut two circles out of white construction paper, and two circles out of black construction paper to make the eyes. Make sure that the black circles are smaller. You can also use printer paper and cardstock for this. Another alternative would be to use large googly eyes; make sure that they are proportionate to your fish! Attach the eyes to the fish. Position them in front of the side fins and just above them. You can attach them using double-sided tape or a hot glue gun. If you are using googly eyes, however, a hot glue might be the better option. Thread some string through the top of the fish so that you can hang it. Thread a piece of string through the bar in the top hole of your lantern, then tie it into a loop. If your lantern doesn't have a bar, poke two small holes in the top of the lantern, just below the ring opening. Hang the loop from a hook wherever you want. These lanterns make great decorations for underwater themed parties and rooms. Be careful not to get them wet, however! Making a Fancy Goldfish Lantern Get a solid-colored paper lantern and open it up. The smaller your lantern is, the easier it will be to work with. Look for something that is about 12 inches (30.48 centimeters) in diameter. Most goldfish are orange, but you can make your goldfish any color you want. Trace a circle that is the same size as the smaller opening on your lantern onto a sheet of tissue paper. Choose a different color than your lantern. It can be lighter, darker, or even a contrasting color. Make the circle as even as you can. If possible, use a pencil to trace around to smaller opening of the lantern. If both of the openings are the same size, simply choose one of them. Trace a larger circle around the first circle. How much space you leave between the two circles depends on the size of you lantern. The bigger your lantern is, the more space you will need. Start with ½ inch (1.27 centimeters) and go from there. Cut the circles out, then save the ring. Discard the inner circle, or save it for another project. Use a glue stick to glue the ring onto the smaller opening. This will create an open mouth for the goldfish. If you have any excess tissue paper hanging over the opening, you can trim it off with a pair of scissors, or fold it into the lantern and secure it with more glue. Cut two circles out of white tissue paper, and two smaller circles out of black cardstock or construction paper. If you don't have any white tissue paper, you can use white printer paper instead. Glue the black circles onto the white circles, then the white circles onto the lantern. Glue the white circles above the \"mouth\" and slightly to the side. Cut out two top fin shapes out of tissue paper. Stack two sheets of tissue paper, then cut a fin shape out; this way, you will end up with two matching fins. Use a color that matches your lantern. Most top fins will be long and somewhat skinny. Make sure that yours is at least 2 inches (5.08 centimeters) tall. Glue them together, except for the bottom ½ to 1 inch (1.27 to 2.54 centimeters). Use a pair of scissors to trim of any overhanging tissue paper. The double tissue paper layer will help the top fin stand up. Fold the loose ends of the fin down to create two flaps, then attach it to the fish. Place a strip of double-sided tape to each flap, then place the fin on top of the fish. Run your finger across the top of each flap to seal the tape. Cut out two side fins out of matching tissue paper, then attach them to the sides of the fish. You can use a glue stick or double-sides tape for this. Make sure that you are only gluing the bottom edge so that the fins can flap around. You don't have to create double layers for these or fold any flaps. The side fins can be as long and flowing as you'd like. Cut out two tail shapes out of matching tissue paper. Stack two sheets of tissue paper, then cut a tail fin out; you will end up with two identical shapes. You will be fitting the tail over the back hole on your lantern, so be sure to add ½ of the hole's width, plus an additional ½ to 1 inch (1.27 to 2.54 centimeters). Glue them together, except for the bottom few inches. How much you leave unglued depends on the excess amount you added. Once again, use a pair of scissors to trim off any overhanging pieces of tissue paper. Fold the loose ends out to create flaps, then attach them to the back of the fish. Position the tail over the back opening. Fold the excess tissue paper over the edges of the opening, then glue or tape them down onto the body of the fish. Use a needle to thread clear string through the top of the fish. Be sure to go under one of the metal ribs to prevent the tissue paper from tearing. Tie the string into a loop, then hang your fish. This fish makes a great decoration for parties or underwater themed rooms. Be careful not to get it wet, however!",
  "tyn_model":[
    "lantern",
    "tissue paper",
    "glue",
    "construction paper",
    "scissors",
    "fish",
    "tape",
    "double-sided tape",
    "printer paper",
    "hot glue",
    "glue stick",
    "hot glue gun",
    "pencil"
  ],
  "tyn_section":[

  ]
}