{
  "title":"How to Be Neater",
  "url":"https://www.wikihow.com/Be-Neater",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Home Organization",
    "Clutter Busting"
  ],
  "steps":[
    {
      "headline":"Become organized.",
      "description":"You should start off with your home organization. Keep your room clean all the time and people will think of you as 'always being neat'. No one likes a slob, or to see a messy house. If you are a lazy type don't try shoving everything under your bed or closet and covering it, you will never learn to be neat by doing that."
    },
    {
      "headline":"Organize your school, office, and desk.",
      "description":"You should start off with your locker or binders. If you have a lot of papers you should keep them in a neat pile. Don't try to hold on to everything. Ask yourself if you are truly going to need this in the future. If not, then start a pile with things you don't need. Stay after if you are embarrassed about other people watching you discover moldy oranges at the back of your desk or papers that you have been looking for a long time for."
    },
    {
      "headline":"Carry around a few mini bottles of hand sanitizers and baby wipes.",
      "description":"This will make you neat in no time. Keep them in your purse, bag, desk, or locker. Also keep yourself neat by combing your hair and ironing your clothes. Keep your face clear and your fingernails clean. You may find it helpful to have a lot of portable cleansing products. Don't forget to bathe and try to smell good."
    },
    {
      "headline":"Ask around.",
      "description":"How do other people get neater? You can learn a lot of valuable things from other people."
    },
    {
      "headline":"Rearrange your furniture.",
      "description":"Many people's homes look cluttered because of a sofa right in the middle of a small room apparently. Rearranging your furniture will also make your house look bigger and brighter, so then that will help."
    },
    {
      "headline":"Take care of yourself to be neat.",
      "description":"Eat well and exercise daily. Drink plenty of water. Maintain a healthy weight and wear well fitting clothing."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Become organized. You should start off with your home organization. Keep your room clean all the time and people will think of you as 'always being neat'. No one likes a slob, or to see a messy house. If you are a lazy type don't try shoving everything under your bed or closet and covering it, you will never learn to be neat by doing that. Organize your school, office, and desk. You should start off with your locker or binders. If you have a lot of papers you should keep them in a neat pile. Don't try to hold on to everything. Ask yourself if you are truly going to need this in the future. If not, then start a pile with things you don't need. Stay after if you are embarrassed about other people watching you discover moldy oranges at the back of your desk or papers that you have been looking for a long time for. Carry around a few mini bottles of hand sanitizers and baby wipes. This will make you neat in no time. Keep them in your purse, bag, desk, or locker. Also keep yourself neat by combing your hair and ironing your clothes. Keep your face clear and your fingernails clean. You may find it helpful to have a lot of portable cleansing products. Don't forget to bathe and try to smell good. Ask around. How do other people get neater? You can learn a lot of valuable things from other people. Rearrange your furniture. Many people's homes look cluttered because of a sofa right in the middle of a small room apparently. Rearranging your furniture will also make your house look bigger and brighter, so then that will help. Take care of yourself to be neat. Eat well and exercise daily. Drink plenty of water. Maintain a healthy weight and wear well fitting clothing. Finished. ",
  "tyn_model":[
    "papers",
    "oranges",
    "hand sanitizers",
    "baby wipes",
    "sofa",
    "furniture",
    "water"
  ],
  "tyn_section":[

  ]
}