{
  "title":"How to Make the Perfect Supernatural Family on Sims 3 Supernatural",
  "url":"https://www.wikihow.com/Make-the-Perfect-Supernatural-Family-on-Sims-3-Supernatural",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "PC Simulation",
    "Sims",
    "Sims 3"
  ],
  "steps":[
    {
      "headline":"First, go into create a sim.",
      "description":"Fairly easy."
    },
    {
      "headline":"Click Werewolf.",
      "description":"You can change what it looks like while it's transformed or normal."
    },
    {
      "headline":"Create a vampire.",
      "description":"Remember, these are prone to sunlight unless you make the Vampiric Sunscreen Elixir. They have pale skin and bright eyes that can not be change be brightness."
    },
    {
      "headline":"Create a witch.",
      "description":"Give her a witch hat found in the 'hair with accessories'."
    },
    {
      "headline":"Create a fairy.",
      "description":"When you make a house, be sure to give them a fairy home in the supernatural section that they can sleep in."
    },
    {
      "headline":"Possibly make a ghost.",
      "description":"The tombstone selector is the best for this as you can pick what type of death."
    },
    {
      "headline":"Make a Genie.",
      "description":""
    },
    {
      "headline":"Pick their traits, star sign and Favorite food, music and change their voice.",
      "description":"Make them perfect."
    },
    {
      "headline":"Play!",
      "description":""
    }
  ],
  "text":" First, go into create a sim. Fairly easy. Click Werewolf. You can change what it looks like while it's transformed or normal. Create a vampire. Remember, these are prone to sunlight unless you make the Vampiric Sunscreen Elixir. They have pale skin and bright eyes that can not be change be brightness. Create a witch. Give her a witch hat found in the 'hair with accessories'. Create a fairy. When you make a house, be sure to give them a fairy home in the supernatural section that they can sleep in. Possibly make a ghost. The tombstone selector is the best for this as you can pick what type of death. Make a Genie.  Pick their traits, star sign and Favorite food, music and change their voice. Make them perfect. Play! ",
  "tyn_model":[
    "fairy",
    "genie",
    "food"
  ],
  "tyn_section":[

  ]
}