{
  "title":"How to Make Cool Whip Chocolate Pudding Pie",
  "url":"https://www.wikihow.com/Make-Cool-Whip-Chocolate-Pudding-Pie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies"
  ],
  "parts":[
    {
      "name":"Creating the Pie Crust",
      "steps":[
        {
          "headline":"Place the Oreo baking crumbs in a large mixing bowl.",
          "description":"Leave enough room to combine the crumbs with the butter (so it doesn’t spill out during the mixing process)."
        },
        {
          "headline":"Melt the butter on the stovetop or in the microwave.",
          "description":"When melting the butter, keep an eye on it so it doesn’t come to a boil, otherwise it could scorch. Continue re-heating for 10 seconds until it has melted. If melting the butter in the microwave, put the timer on for 10 seconds and check it before attempting to microwave it again."
        },
        {
          "headline":"Add butter to the Oreo baking crumbs and combine.",
          "description":"Mix the butter into every crumb until it thickens."
        },
        {
          "headline":"Pour into an ungreased pie plate and press down along the bottom and the sides.",
          "description":"Using clean fingertips, form the crust by placing gentle pressure on the crust. Pinch the ends at the top."
        }
      ]
    },
    {
      "name":"Making the Pie Filling",
      "steps":[
        {
          "headline":"Combine the pudding mix and milk in large bowl.",
          "description":"For best results, combine the pudding mix and milk using a Kitchen Aid or similar strong mixer."
        },
        {
          "headline":"Mix until fully integrated and no powder from the pudding mix is visible.",
          "description":""
        },
        {
          "headline":"Add 1 cup of the Cool Whip.",
          "description":"Mix well. Continue mixing until the pudding mixture is light and fluffy."
        },
        {
          "headline":"Spoon on top of the crust.",
          "description":"Smooth the top over with the spoon to ensure even distribution."
        }
      ]
    },
    {
      "name":"Chilling and Serving the Pie",
      "steps":[
        {
          "headline":"Place the pie in the refrigerator.",
          "description":"Allow it to set for up to 30 minutes. To protect the flavor, you may want to cover it with plastic wrap."
        },
        {
          "headline":"Top with the remaining Cool Whip immediately before serving.",
          "description":"For an added touch, grate chocolate flecks across the top of the whipped topping."
        },
        {
          "headline":"Finished.",
          "description":"Enjoy!"
        }
      ]
    }
  ],
  "text":" Creating the Pie Crust Place the Oreo baking crumbs in a large mixing bowl. Leave enough room to combine the crumbs with the butter (so it doesn’t spill out during the mixing process). Melt the butter on the stovetop or in the microwave. When melting the butter, keep an eye on it so it doesn’t come to a boil, otherwise it could scorch. Continue re-heating for 10 seconds until it has melted. If melting the butter in the microwave, put the timer on for 10 seconds and check it before attempting to microwave it again. Add butter to the Oreo baking crumbs and combine. Mix the butter into every crumb until it thickens. Pour into an ungreased pie plate and press down along the bottom and the sides. Using clean fingertips, form the crust by placing gentle pressure on the crust. Pinch the ends at the top. Making the Pie Filling Combine the pudding mix and milk in large bowl. For best results, combine the pudding mix and milk using a Kitchen Aid or similar strong mixer. Mix until fully integrated and no powder from the pudding mix is visible.  Add 1 cup of the Cool Whip. Mix well. Continue mixing until the pudding mixture is light and fluffy. Spoon on top of the crust. Smooth the top over with the spoon to ensure even distribution. Chilling and Serving the Pie Place the pie in the refrigerator. Allow it to set for up to 30 minutes. To protect the flavor, you may want to cover it with plastic wrap. Top with the remaining Cool Whip immediately before serving. For an added touch, grate chocolate flecks across the top of the whipped topping. Finished. Enjoy!",
  "tyn_model":[
    "butter",
    "microwave",
    "oreo baking crumbs",
    "milk",
    "cool whip",
    "large mixing bowl",
    "pie plate",
    "large bowl",
    "pudding mix",
    "kitchen aid or similar strong",
    "pudding",
    "spoon",
    "refrigerator",
    "plastic wrap",
    "whipped topping"
  ],
  "tyn_section":[

  ]
}