{
  "title":"How to Choose Kid Friendly Cinco De Mayo Recipes",
  "url":"https://www.wikihow.com/Choose-Kid-Friendly-Cinco-De-Mayo-Recipes",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "steps":[
    {
      "headline":"Avoid the spices.",
      "description":"Use mild salsa for any casseroles or dips that they might have. If need to be, double the amount of cheese to lessen any spice taste or whip in cream cheese to equalize the flavors. You don't need to make an entire separate dish just for them; scoop a good amount of your original recipe in another bowl to reserve on the side for them and add the \"adult\" spices or hot peppers in the main bowl afterwards."
    },
    {
      "headline":"Plan a \"taco bar\" and prepare their food ahead of time.",
      "description":"Cook any ground beef, ground turkey, or chicken strips, dice tomatoes, avocados, lettuce, and shred cheese. Place in individual bowls, cover tightly with plastic wrap, and leave in the refrigerator overnight. Reheat the meat in the microwave for about a minute. Allow them to create their own taco, either with hard shells or soft tortilla wraps."
    },
    {
      "headline":"Think of additional and creative ways to allow them to enjoy the holiday.",
      "description":"Mexican food can be well enjoyed, even without the spices. Taco bowls by using biscuits or tortilla wraps\nTaco salad using Doritos chips\nTacos with spaghetti"
    },
    {
      "headline":"Avoid leaving the kids out with drinks.",
      "description":"There are a lot of mocktail recipes that one can change an alcoholic ingredient with a juice substitution. If you want them to have very healthy and colorful drinks, try layered smoothies created purely out of fruits and vegetables."
    },
    {
      "headline":"Allow them to indulge into desserts.",
      "description":"Goodies such as tres leche or rice pudding are excellent choices suitable for children. Lime sherbert or deep fried ice cream are some things to try for this Mexican holiday."
    }
  ],
  "text":" Avoid the spices. Use mild salsa for any casseroles or dips that they might have. If need to be, double the amount of cheese to lessen any spice taste or whip in cream cheese to equalize the flavors. You don't need to make an entire separate dish just for them; scoop a good amount of your original recipe in another bowl to reserve on the side for them and add the \"adult\" spices or hot peppers in the main bowl afterwards. Plan a \"taco bar\" and prepare their food ahead of time. Cook any ground beef, ground turkey, or chicken strips, dice tomatoes, avocados, lettuce, and shred cheese. Place in individual bowls, cover tightly with plastic wrap, and leave in the refrigerator overnight. Reheat the meat in the microwave for about a minute. Allow them to create their own taco, either with hard shells or soft tortilla wraps. Think of additional and creative ways to allow them to enjoy the holiday. Mexican food can be well enjoyed, even without the spices. Taco bowls by using biscuits or tortilla wraps\nTaco salad using Doritos chips\nTacos with spaghetti Avoid leaving the kids out with drinks. There are a lot of mocktail recipes that one can change an alcoholic ingredient with a juice substitution. If you want them to have very healthy and colorful drinks, try layered smoothies created purely out of fruits and vegetables. Allow them to indulge into desserts. Goodies such as tres leche or rice pudding are excellent choices suitable for children. Lime sherbert or deep fried ice cream are some things to try for this Mexican holiday.",
  "tyn_model":[
    "tortilla wraps",
    "salsa",
    "cream cheese",
    "bowl",
    "hot peppers",
    "ground beef",
    "ground turkey",
    "tomatoes",
    "avocados",
    "lettuce",
    "cheese",
    "bowls",
    "plastic wrap",
    "refrigerator",
    "microwave",
    "taco bowls",
    "biscuits",
    "doritos chips",
    "spaghetti",
    "rice pudding",
    "lime sherbert",
    "ice cream"
  ],
  "tyn_section":[

  ]
}