{
  "title":"How to Make Roly Poly Santa Cookies",
  "url":"https://www.wikihow.com/Make-Roly-Poly-Santa-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"Baked Santa Cookies",
      "steps":[
        {
          "headline":"Make the dough.",
          "description":"Take butter in a medium size bowl. Beat the butter with a mixer on high speed until fluffy. Now gradually add 1/2 cup powdered sugar to the beaten butter and continue the beating process until combined. Similarly add 1 tablespoon (14.8 ml). milk and 1 tbsp. vanilla to the bowl and beat until combined. Finally add flour to the beating mixture in a gradual manner to avoid mixing problem and continue beating with the mixer until you get desired dough."
        },
        {
          "headline":"After finishing dough, remove 1 cup of dough and keep it aside to use later.",
          "description":"Mix 3-4 drops of red food coloring (3-4 drops of strong food coloring or 5-6 drops of normal food coloring) to the remaining dough and mix it at medium speed until you get dark red dough. You can also add food coloring according to your need to get desired color for your Santa."
        },
        {
          "headline":"Using red dough to make 1 inch (2.5 cm) ball and five ⁄2 inch (1.3 cm) balls.",
          "description":"Using  plain dough to make ⁄4 inch (1.9 cm) ball and five ⁄4 inch (0.6 cm) balls. Shape one of the ⁄2 inch (1.3 cm) red balls into a shape of a cone. Gently press the cone to reduce the width and slightly tilt the pointy end to form the Santa's cap."
        },
        {
          "headline":"Place an non-greased cookie sheet to use it as a working surface.",
          "description":"Place the 1 inch (2.5 cm) red dough ball on the cookie sheet and gently press the ball to flatten it. Now  Attach the remaining four ⁄2 inch (1.3 cm) red dough balls at the corners of flattened 1 inch (2.5 cm) red dough ball by just pushing the dough together and not pushing hat hard to avoid deformed shapes. Place the four red dough balls such a way that two opposite sides are free and remaining opposite sides have two-two red dough balls attached to it with a slight gap to form the Santa's body with hands and legs. Gently press the four attached balls to flatten them to the width of the flattened 1 inch (2.5 cm) ball."
        },
        {
          "headline":"Now attach the ⁄4 inch (1.9 cm) ball of plain dough to one of the free opposite side of the flattened 1 inch (2.5 cm) red dough ball to form the head.",
          "description":"Gently press the ⁄4 inch (1.9 cm) plain dough ball to flatten them to the width of the flattened 1 inch (2.5 cm) red dough ball. Now attach the cone shaped Santa cap previously made to the Santa's head. Now attach the five ⁄4 inch (0.6 cm) plain dough balls to the end of Santa's hands, legs and the cap by gently pressing the dough together. Place two mini chocolate chips on the Santa's head to form Santa's eyes and place three mini chocolate chip on the Santa's body to form the buttons."
        },
        {
          "headline":"Now place all your Santa's in an oven to bake them at 325 °F (163 °C) for 12-15 minutes until set but not browned.",
          "description":"After baking is over remove the Santa's and keep them for complete cooling."
        },
        {
          "headline":"Meanwhile Cookies are cooling, prepare the frosting.",
          "description":"For frosting beat the 1/2 cup shortening and 1/2 teaspoon vanilla together in a mixer until combined. Gradually add 1/2 cup powdered sugar and 1 tbsp. milk to make a proper frosting."
        },
        {
          "headline":"Scoop the mixture into a frosting or plastic bag fitted with a small star tip.",
          "description":"Use a tip such as #4 or #3."
        },
        {
          "headline":"Decorate your Santa with frosting.",
          "description":"Pipe the frosting around the base of the ball on the top of Santa's hat to form the fur around the ball. Pipe the frosting around the rim of Santa's hat to form the fur around the hat. Pipe the beard and downside of the front face of Santa to form the beard. Make sure to join the frosting of the rim of the Santa's hat to the beard of Santa. Place a red hot chocolate chip or red Jimmie in the middle of the face of Santa using the already piped frosting as the resting base. Pipe the cloth strips for the Santa's shirt and pants along the buttons and end of the clothing’s. Use a tip of size #2 to pipe the strips."
        },
        {
          "headline":"Garnish the Santa's with Red and white sprinkling sugar.",
          "description":"Decorate the serving dish with candy canes, candy bars and jelly beans with Santa cookies lying over the top, at the center of the serving dish."
        },
        {
          "headline":"Serve the Santa's with hot chocolate and milk in a small cups along with the serving dish as dipping appetizer.",
          "description":""
        }
      ]
    },
    {
      "name":"Unbaked Santa Cookies",
      "steps":[
        {
          "headline":"Dip one side of the cookie in the melted candy and sprinkle the dipped surface with red sugar crystals.",
          "description":"This will form the hat of Santa."
        },
        {
          "headline":"Apply a strip of white cotton candy at the base of the hat to form the fur for the hat.",
          "description":"Attach a white Cadbury Gem at the top of the dipped part to form the cotton ball for the hat. Make a small white candy ball strip and attach it around the white Cadbury Gem to form the fur of the ball of the Santa's hat."
        },
        {
          "headline":"Chill the cookies in the freezer until the dipped part becomes solid to form the hat of the Santa.",
          "description":""
        },
        {
          "headline":"Dip the bottom half of the cookie in the melted candy.",
          "description":"Add texture to the beard by using any pointy kitchen devices to make the beard wavy."
        },
        {
          "headline":"Attach two chocolate chips below the hat by using a little melted candy as adhesive to form Santa's eyes.",
          "description":"For Santa's nose attach a red Cadbury Gem on top of the Santa's beard. Attach strips of white cotton candy along the beard to complete the roly-poly Santa cookie."
        },
        {
          "headline":"Chill the cookies in the freezer until the dipped part becomes solid to complete the roly-poly Santa.",
          "description":""
        },
        {
          "headline":"Decorate the serving dish with candy canes, candy bars and jelly beans with Santa cookies lying over the top, at the center of the serving dish.",
          "description":""
        },
        {
          "headline":"Serve the Santa's with hot chocolate and milk in a small cups along with the serving dish as dipping appetizer.",
          "description":""
        }
      ]
    }
  ],
  "text":" Baked Santa Cookies Make the dough. Take butter in a medium size bowl. Beat the butter with a mixer on high speed until fluffy. Now gradually add 1/2 cup powdered sugar to the beaten butter and continue the beating process until combined. Similarly add 1 tablespoon (14.8 ml). milk and 1 tbsp. vanilla to the bowl and beat until combined. Finally add flour to the beating mixture in a gradual manner to avoid mixing problem and continue beating with the mixer until you get desired dough. After finishing dough, remove 1 cup of dough and keep it aside to use later. Mix 3-4 drops of red food coloring (3-4 drops of strong food coloring or 5-6 drops of normal food coloring) to the remaining dough and mix it at medium speed until you get dark red dough. You can also add food coloring according to your need to get desired color for your Santa. Using red dough to make 1 inch (2.5 cm) ball and five ⁄2 inch (1.3 cm) balls. Using  plain dough to make ⁄4 inch (1.9 cm) ball and five ⁄4 inch (0.6 cm) balls. Shape one of the ⁄2 inch (1.3 cm) red balls into a shape of a cone. Gently press the cone to reduce the width and slightly tilt the pointy end to form the Santa's cap. Place an non-greased cookie sheet to use it as a working surface. Place the 1 inch (2.5 cm) red dough ball on the cookie sheet and gently press the ball to flatten it. Now  Attach the remaining four ⁄2 inch (1.3 cm) red dough balls at the corners of flattened 1 inch (2.5 cm) red dough ball by just pushing the dough together and not pushing hat hard to avoid deformed shapes. Place the four red dough balls such a way that two opposite sides are free and remaining opposite sides have two-two red dough balls attached to it with a slight gap to form the Santa's body with hands and legs. Gently press the four attached balls to flatten them to the width of the flattened 1 inch (2.5 cm) ball. Now attach the ⁄4 inch (1.9 cm) ball of plain dough to one of the free opposite side of the flattened 1 inch (2.5 cm) red dough ball to form the head. Gently press the ⁄4 inch (1.9 cm) plain dough ball to flatten them to the width of the flattened 1 inch (2.5 cm) red dough ball. Now attach the cone shaped Santa cap previously made to the Santa's head. Now attach the five ⁄4 inch (0.6 cm) plain dough balls to the end of Santa's hands, legs and the cap by gently pressing the dough together. Place two mini chocolate chips on the Santa's head to form Santa's eyes and place three mini chocolate chip on the Santa's body to form the buttons. Now place all your Santa's in an oven to bake them at 325 °F (163 °C) for 12-15 minutes until set but not browned. After baking is over remove the Santa's and keep them for complete cooling. Meanwhile Cookies are cooling, prepare the frosting. For frosting beat the 1/2 cup shortening and 1/2 teaspoon vanilla together in a mixer until combined. Gradually add 1/2 cup powdered sugar and 1 tbsp. milk to make a proper frosting. Scoop the mixture into a frosting or plastic bag fitted with a small star tip. Use a tip such as #4 or #3. Decorate your Santa with frosting. Pipe the frosting around the base of the ball on the top of Santa's hat to form the fur around the ball. Pipe the frosting around the rim of Santa's hat to form the fur around the hat. Pipe the beard and downside of the front face of Santa to form the beard. Make sure to join the frosting of the rim of the Santa's hat to the beard of Santa. Place a red hot chocolate chip or red Jimmie in the middle of the face of Santa using the already piped frosting as the resting base. Pipe the cloth strips for the Santa's shirt and pants along the buttons and end of the clothing’s. Use a tip of size #2 to pipe the strips. Garnish the Santa's with Red and white sprinkling sugar. Decorate the serving dish with candy canes, candy bars and jelly beans with Santa cookies lying over the top, at the center of the serving dish. Serve the Santa's with hot chocolate and milk in a small cups along with the serving dish as dipping appetizer.  Unbaked Santa Cookies Dip one side of the cookie in the melted candy and sprinkle the dipped surface with red sugar crystals. This will form the hat of Santa. Apply a strip of white cotton candy at the base of the hat to form the fur for the hat. Attach a white Cadbury Gem at the top of the dipped part to form the cotton ball for the hat. Make a small white candy ball strip and attach it around the white Cadbury Gem to form the fur of the ball of the Santa's hat. Chill the cookies in the freezer until the dipped part becomes solid to form the hat of the Santa.  Dip the bottom half of the cookie in the melted candy. Add texture to the beard by using any pointy kitchen devices to make the beard wavy. Attach two chocolate chips below the hat by using a little melted candy as adhesive to form Santa's eyes. For Santa's nose attach a red Cadbury Gem on top of the Santa's beard. Attach strips of white cotton candy along the beard to complete the roly-poly Santa cookie. Chill the cookies in the freezer until the dipped part becomes solid to complete the roly-poly Santa.  Decorate the serving dish with candy canes, candy bars and jelly beans with Santa cookies lying over the top, at the center of the serving dish.  Serve the Santa's with hot chocolate and milk in a small cups along with the serving dish as dipping appetizer. ",
  "tyn_model":[
    "red dough",
    "milk",
    "plain dough",
    "butter",
    "mixer",
    "frosting",
    "candy",
    "cadbury gem",
    "powdered sugar",
    "vanilla",
    "food coloring",
    "cookie sheet",
    "red dough balls",
    "chocolate chips",
    "candy canes",
    "candy bars",
    "jelly beans",
    "serving dish",
    "hot chocolate",
    "cotton candy",
    "cookies",
    "freezer",
    "baked santa cookies",
    "bowl",
    "flour",
    "red food coloring",
    "strong food coloring",
    "red dough ball",
    "dough",
    "chocolate chip",
    "oven",
    "frosting or plastic bag",
    "cloth",
    "red and white sprinkling sugar",
    "red sugar"
  ],
  "tyn_section":[

  ]
}