{
  "title":"How to Troubleshoot a PS2",
  "url":"https://www.wikihow.com/Troubleshoot-a-PS2",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation 2"
  ],
  "methods":[
    {
      "name":"If the console is not turning on",
      "steps":[
        {
          "headline":"Make sure the wires are properly connected.",
          "description":"Make sure that all the correct wires are hooked up to the correct slots. Also, make sure that the wires are pushed in all the way. Sometimes, if a wire isn't in properly, the console will not work. Check all of the wires by pushing them in to the slot. If one turns out to be loose, that might just solve the problem."
        },
        {
          "headline":"Make sure the wires aren't broken.",
          "description":"If the wires look bent or used, they might be broken inside. While you won't be able to check the inside of the wires, you can still look for evidence on the outside of the cover. Evidence of a broken wire includes broken, chewed up or cracked casing. The actual metal plug part might also show these signs."
        },
        {
          "headline":"Make sure the main power button is on.",
          "description":"The main power button can be found at the back of your console. Without the main power, the console will not work. Make sure that the button is flicked to the on position. If it was off, that might have been the problem. Still try everything else though, just in case it wasn't."
        },
        {
          "headline":"Try turning on the console now.",
          "description":"Chances are, the wires were loose or the main power switch was turned off. If the console still isn't turning on, try disconnecting it all and starting all over again. If re-connecting the whole console still doesn't do the trick, the PS2 is probably useless now. Either get rid of it or buy a new one. You can also sell it for spare parts."
        }
      ]
    },
    {
      "name":"If the controllers are not working",
      "steps":[
        {
          "headline":"Make sure the wires are properly connected.",
          "description":"Like the actual console, the wires need to properly connected. Make sure that your controller is plugged into slot number 1. Also, push it in all the way. It might not be working because the wires are not pushed in fully. Make sure they are before continuing to the next steps."
        },
        {
          "headline":"Make sure the wires aren't broken.",
          "description":"If the wires look bent or used, they might be broken inside. While you won't be able to check the inside of the wires, you can still look for evidence on the outside of the cover. Evidence of a broken wire includes broken, chewed up or cracked casing. The part where the wire goes into the control is most vulnerable to breaking."
        },
        {
          "headline":"Make sure the slots aren't clogged.",
          "description":"It's very easy for dust and grime to clog up your console's controller slots. This might stop the wires from sending the correct signals to the PlayStation. To fix this, gently clean out the controller slots with a cloth wrapped around your index finger. Also clean the wires connected to the controller. These too might be clogged up with dirt and dust."
        }
      ]
    },
    {
      "name":"If a game is not working",
      "steps":[
        {
          "headline":"Clean the disk.",
          "description":"The disk might have specs of dust on it that is stopping the console from reading it correctly. It might also have fingerprints and general dirt on it. By cleaning the disk, you might be saving it from being thrown away into the dustbin. Try to keep the disk in its case at all time to avoid this happening. Oh, and don't touch the bottom of it!"
        },
        {
          "headline":"Try another game.",
          "description":"This can help determine what exactly is the problem. If the other game is working but the one that you want to play is not, you know that the disk is the problem. If both the games are not functioning as they should be, the console might be permanently damaged. This is more unlikely than the disk being the issue but it means that the console is now useless."
        },
        {
          "headline":"Use a cleaner disk.",
          "description":"These types of disks are very easy to find. They are designed to clean the small eye that reads your game disks. Simply put them into your Ps2 and let it run. They shouldn't run for more than half an hour but if that's how long the disk is, let it finish running. After you've used this cleaner disk, try playing your game. If it's still not working, something might be wrong with the actual console, not just the eye."
        }
      ]
    },
    {
      "name":"If the game tray is not opening",
      "steps":[
        {
          "headline":"Restart the system.",
          "description":"It might just be that the game tray got stuck that one time. Before you go prying it open, turn the console off. Wait for about ten seconds for the console to cool down. When you're happy that it's completely turned off, start it up again. Wait for it to fully load before clicking the open button. When it has loaded, open the tray again. If it opens, great! If it's still stuck, move on to the steps below."
        },
        {
          "headline":"Gently move it with your finger.",
          "description":"If the game tray is stuck on one side and cannot open, gently pull it to the opposite side with your finger. You may have to use two fingers or your thumb if the tray is stiff. Hopefully, this will get it open so that you can get your game out. If you can't move it with your finger, try to pry it open using some sort of tool. This will, however, void the warranty. When you do get the game tray open, remove your game but don't use it again. You might not get it open next time."
        },
        {
          "headline":"Open the console.",
          "description":"If you can hear something blocking it from the inside, open up the PS2 and remove your game that way. If there's no game in there but you're good with the console, feel free to try to repair it yourself. This may include removing and replacing certain parts, like the game tray itself. Keep in mind that even opening the console will void the warranty."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" If the console is not turning on Make sure the wires are properly connected. Make sure that all the correct wires are hooked up to the correct slots. Also, make sure that the wires are pushed in all the way. Sometimes, if a wire isn't in properly, the console will not work. Check all of the wires by pushing them in to the slot. If one turns out to be loose, that might just solve the problem. Make sure the wires aren't broken. If the wires look bent or used, they might be broken inside. While you won't be able to check the inside of the wires, you can still look for evidence on the outside of the cover. Evidence of a broken wire includes broken, chewed up or cracked casing. The actual metal plug part might also show these signs. Make sure the main power button is on. The main power button can be found at the back of your console. Without the main power, the console will not work. Make sure that the button is flicked to the on position. If it was off, that might have been the problem. Still try everything else though, just in case it wasn't. Try turning on the console now. Chances are, the wires were loose or the main power switch was turned off. If the console still isn't turning on, try disconnecting it all and starting all over again. If re-connecting the whole console still doesn't do the trick, the PS2 is probably useless now. Either get rid of it or buy a new one. You can also sell it for spare parts. If the controllers are not working Make sure the wires are properly connected. Like the actual console, the wires need to properly connected. Make sure that your controller is plugged into slot number 1. Also, push it in all the way. It might not be working because the wires are not pushed in fully. Make sure they are before continuing to the next steps. Make sure the wires aren't broken. If the wires look bent or used, they might be broken inside. While you won't be able to check the inside of the wires, you can still look for evidence on the outside of the cover. Evidence of a broken wire includes broken, chewed up or cracked casing. The part where the wire goes into the control is most vulnerable to breaking. Make sure the slots aren't clogged. It's very easy for dust and grime to clog up your console's controller slots. This might stop the wires from sending the correct signals to the PlayStation. To fix this, gently clean out the controller slots with a cloth wrapped around your index finger. Also clean the wires connected to the controller. These too might be clogged up with dirt and dust. If a game is not working Clean the disk. The disk might have specs of dust on it that is stopping the console from reading it correctly. It might also have fingerprints and general dirt on it. By cleaning the disk, you might be saving it from being thrown away into the dustbin. Try to keep the disk in its case at all time to avoid this happening. Oh, and don't touch the bottom of it! Try another game. This can help determine what exactly is the problem. If the other game is working but the one that you want to play is not, you know that the disk is the problem. If both the games are not functioning as they should be, the console might be permanently damaged. This is more unlikely than the disk being the issue but it means that the console is now useless. Use a cleaner disk. These types of disks are very easy to find. They are designed to clean the small eye that reads your game disks. Simply put them into your Ps2 and let it run. They shouldn't run for more than half an hour but if that's how long the disk is, let it finish running. After you've used this cleaner disk, try playing your game. If it's still not working, something might be wrong with the actual console, not just the eye. If the game tray is not opening Restart the system. It might just be that the game tray got stuck that one time. Before you go prying it open, turn the console off. Wait for about ten seconds for the console to cool down. When you're happy that it's completely turned off, start it up again. Wait for it to fully load before clicking the open button. When it has loaded, open the tray again. If it opens, great! If it's still stuck, move on to the steps below. Gently move it with your finger. If the game tray is stuck on one side and cannot open, gently pull it to the opposite side with your finger. You may have to use two fingers or your thumb if the tray is stiff. Hopefully, this will get it open so that you can get your game out. If you can't move it with your finger, try to pry it open using some sort of tool. This will, however, void the warranty. When you do get the game tray open, remove your game but don't use it again. You might not get it open next time. Open the console. If you can hear something blocking it from the inside, open up the PS2 and remove your game that way. If there's no game in there but you're good with the console, feel free to try to repair it yourself. This may include removing and replacing certain parts, like the game tray itself. Keep in mind that even opening the console will void the warranty. Finished. ",
  "tyn_model":[
    "console",
    "game tray",
    "ps2",
    "tray",
    "wires",
    "controllers",
    "controller",
    "playstation",
    "cloth",
    "dust",
    "disk",
    "cleaner disk",
    "disks"
  ],
  "tyn_section":[

  ]
}