{
  "title":"How to Decline an Unwanted Invitation to Someone's House",
  "url":"https://www.wikihow.com/Decline-an-Unwanted-Invitation-to-Someone%27s-House",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Planning",
    "Invitations"
  ],
  "methods":[
    {
      "name":"Excuses You Should Never Make",
      "steps":[
        {
          "headline":"Avoid ever blaming your inability to come on your own or someone else's poor health.",
          "description":"Saying \"Johnny had a cold last week\" or \"My gout has really been bothering me lately\" or \"Sorry! Can't do lunch. Kassie is allergic to gluten!\" or \"Hard pregnancy! I have random morning sickness\" won't impress anyone. In some cases, it'll cause the person to try hard to accommodate your sickness. Blaming your inability to turn up on sickness usually backfires, for example:\nAllergies: These can be catered for simply. Current illness: A simple date shift will mean you still have to turn up. Blaming it on aches and pains is silly! They will suggest a non-active activity! Blaming it on sickness is unwise! They might say that they aren't overly freaked out about germs."
        },
        {
          "headline":"Never lie.",
          "description":"It's wrong and it'll unravel just when you least expect it."
        },
        {
          "headline":"Avoid coming up with a string of excuses.",
          "description":"Anything involving your busy life, your children, your spouse, your work and so forth can all be explained away some way or other. Some people can be very accommodating or persistent and you can really hurt them by carrying on with excuses before finally putting down your foot and saying no."
        }
      ]
    },
    {
      "name":"Refusing Over Text",
      "steps":[
        {
          "headline":"Say \"no\".",
          "description":"Keep it short and perhaps use humor or abbreviations. Use the acronym SICMI. This means \"sorry i can't make it\". If they ask, you simply reply with what it means."
        },
        {
          "headline":"Never elaborate.",
          "description":"The point of texting is to be short and sweet/ You simply say, \"Thanks but I can't come. Thanks though! Appreciate it!\" It's simple!"
        }
      ]
    },
    {
      "name":"Refusing Over the Phone",
      "steps":[
        {
          "headline":"Observe the manner used in this phone conversation (keep in mind that Tracey and Jenny have been talking about other things):",
          "description":"JENNY: \"Oh yes! Janice is really excited about the recital! TRACEY: \"Lilly is, too! J-Oh speaking of the girls, I was wondering about a playdate for Lilly and Janice. I can do Saturday or the 8th. T: Sorry, Jenny. I can't get together. I appreciate it though.\" J: \"Way to go, Tracey!"
        },
        {
          "headline":"Keep it short and sweet.",
          "description":"You see, over the phone is not awkward for you only, but also for the other person. So when you answer, they cannot say anything about your answer. That is, if the person has manners!"
        }
      ]
    },
    {
      "name":"Refusing in Person",
      "steps":[
        {
          "headline":"Be careful of your facial expression.",
          "description":""
        },
        {
          "headline":"Simply say you will have to check your calendar when you get home.",
          "description":"Then, the next day, shoot a short and sweet email, or call them up. Calling is the best. You can sound more grateful! But only if you can't talk, shoot an email."
        },
        {
          "headline":"Never explain why you're declining.",
          "description":"You might not have anything on your calendar. Whether or not you do is none of their business! You just tell the other person that you are sorry and cannot make it."
        },
        {
          "headline":"Thank them for their offer.",
          "description":""
        }
      ]
    }
  ],
  "text":" Excuses You Should Never Make Avoid ever blaming your inability to come on your own or someone else's poor health. Saying \"Johnny had a cold last week\" or \"My gout has really been bothering me lately\" or \"Sorry! Can't do lunch. Kassie is allergic to gluten!\" or \"Hard pregnancy! I have random morning sickness\" won't impress anyone. In some cases, it'll cause the person to try hard to accommodate your sickness. Blaming your inability to turn up on sickness usually backfires, for example:\nAllergies: These can be catered for simply. Current illness: A simple date shift will mean you still have to turn up. Blaming it on aches and pains is silly! They will suggest a non-active activity! Blaming it on sickness is unwise! They might say that they aren't overly freaked out about germs. Never lie. It's wrong and it'll unravel just when you least expect it. Avoid coming up with a string of excuses. Anything involving your busy life, your children, your spouse, your work and so forth can all be explained away some way or other. Some people can be very accommodating or persistent and you can really hurt them by carrying on with excuses before finally putting down your foot and saying no. Refusing Over Text Say \"no\". Keep it short and perhaps use humor or abbreviations. Use the acronym SICMI. This means \"sorry i can't make it\". If they ask, you simply reply with what it means. Never elaborate. The point of texting is to be short and sweet/ You simply say, \"Thanks but I can't come. Thanks though! Appreciate it!\" It's simple! Refusing Over the Phone Observe the manner used in this phone conversation (keep in mind that Tracey and Jenny have been talking about other things): JENNY: \"Oh yes! Janice is really excited about the recital! TRACEY: \"Lilly is, too! J-Oh speaking of the girls, I was wondering about a playdate for Lilly and Janice. I can do Saturday or the 8th. T: Sorry, Jenny. I can't get together. I appreciate it though.\" J: \"Way to go, Tracey! Keep it short and sweet. You see, over the phone is not awkward for you only, but also for the other person. So when you answer, they cannot say anything about your answer. That is, if the person has manners! Refusing in Person Be careful of your facial expression.  Simply say you will have to check your calendar when you get home. Then, the next day, shoot a short and sweet email, or call them up. Calling is the best. You can sound more grateful! But only if you can't talk, shoot an email. Never explain why you're declining. You might not have anything on your calendar. Whether or not you do is none of their business! You just tell the other person that you are sorry and cannot make it. Thank them for their offer. ",
  "tyn_model":[
    "email"
  ],
  "tyn_section":[

  ]
}