{
  "title":"How to Make Your Apartment Bathroom Look and Feel Larger",
  "url":"https://www.wikihow.com/Make-Your-Apartment-Bathroom-Look-and-Feel-Larger",
  "category_hierarchy":[
    "Home and Garden",
    "Home Decorating"
  ],
  "methods":[
    {
      "name":"Color",
      "steps":[
        {
          "headline":"If your landlord approves, you may be able to paint.",
          "description":""
        },
        {
          "headline":"Colors of the same tone create an illusion of greater space.",
          "description":""
        },
        {
          "headline":"Choose soft, pale, neutral pastels for both the walls and the flooring.",
          "description":""
        },
        {
          "headline":"Use a large rug to cover dark or unflattering floor tiles.",
          "description":""
        },
        {
          "headline":"Bright, strong and exciting colors (such as red) should be saved for accessories and towels.",
          "description":""
        }
      ]
    },
    {
      "name":"Mirrors",
      "steps":[
        {
          "headline":"Consider a few small mirrors arranged artistically throughout the room.",
          "description":""
        },
        {
          "headline":"Replace a bulky medicine chest with a wall mirror.",
          "description":"Store a first-aid kit in a kitchen cupboard."
        },
        {
          "headline":"Try one full-length mirror on the back of the bathroom door.",
          "description":""
        }
      ]
    },
    {
      "name":"Declutter",
      "steps":[
        {
          "headline":"Cut down on the number of towels, rugs, pieces of art and decorative accessories.",
          "description":""
        },
        {
          "headline":"Use one large rug or runner instead of several small rugs.",
          "description":""
        },
        {
          "headline":"Items that are infrequently used should be stored out of sight.",
          "description":"This doesn’t mean you have to hide everything out of sight, though. There are plenty of attractive smaller storage options that allow you to put your items in place and on display at the same time."
        },
        {
          "headline":"Tall and thin cabinets always come in handy when space is at a premium.",
          "description":""
        },
        {
          "headline":"Vertical displays also create an illusion of greater space in height.",
          "description":"Narrow shelving over the toilet will not impinge upon floor space. Fold towels in thirds to stack neatly on the shelves. Store cosmetics in a basket on the shelf. Include a toothbrush case, toothpaste and a small glass in a separate basket. Place the more cluttered basket on a higher shelf so that the contents will not be within view. Provide space for a tissue box. Keep these shelves limited to a few items that require quick access on a daily basis."
        },
        {
          "headline":"Avoid multiple dispensers and holders around the sink.",
          "description":"#Replace a wide soap dish with a thin liquid soap dispenser."
        },
        {
          "headline":"Place a towel hook near shower and sink.",
          "description":""
        },
        {
          "headline":"Place a garment hook on the back of the bathroom door.",
          "description":""
        },
        {
          "headline":"Try to avoid using a rack with multiple hooks in an already crowded space.",
          "description":"One hook and one item on the hook provides for a neat appearance."
        },
        {
          "headline":"Once dressed, remove all garments from the bathroom.",
          "description":""
        },
        {
          "headline":"Decide what items can be kept elsewhere - other than in the bathroom.",
          "description":""
        },
        {
          "headline":"Store your bathrobe on a hook in your bedroom closet instead of on the back of the bathroom door.",
          "description":""
        },
        {
          "headline":"Store your laundry in a pillowcase hung on a hook in your  bedroom closet.",
          "description":""
        },
        {
          "headline":"Store your scale beneath your bed or a bedroom chair.",
          "description":""
        }
      ]
    },
    {
      "name":"Visual Pathway",
      "steps":[
        {
          "headline":"With a single swoop of the arm – push back the shower curtain to one side when it’s not in use.",
          "description":"If you can see all the way to the back wall (instead of just to the curtain), your eye will think the room is larger."
        },
        {
          "headline":"One sheer curtain covering the entire window will provide privacy and abundant light during the day.",
          "description":"A shade behind the curtain can be pulled down at night."
        },
        {
          "headline":"If fixtures are being replaced, consider a small corner sink.",
          "description":""
        }
      ]
    }
  ],
  "text":" Color If your landlord approves, you may be able to paint.  Colors of the same tone create an illusion of greater space.  Choose soft, pale, neutral pastels for both the walls and the flooring.  Use a large rug to cover dark or unflattering floor tiles.  Bright, strong and exciting colors (such as red) should be saved for accessories and towels.  Mirrors Consider a few small mirrors arranged artistically throughout the room.  Replace a bulky medicine chest with a wall mirror. Store a first-aid kit in a kitchen cupboard. Try one full-length mirror on the back of the bathroom door.  Declutter Cut down on the number of towels, rugs, pieces of art and decorative accessories.  Use one large rug or runner instead of several small rugs.  Items that are infrequently used should be stored out of sight. This doesn’t mean you have to hide everything out of sight, though. There are plenty of attractive smaller storage options that allow you to put your items in place and on display at the same time. Tall and thin cabinets always come in handy when space is at a premium.  Vertical displays also create an illusion of greater space in height. Narrow shelving over the toilet will not impinge upon floor space. Fold towels in thirds to stack neatly on the shelves. Store cosmetics in a basket on the shelf. Include a toothbrush case, toothpaste and a small glass in a separate basket. Place the more cluttered basket on a higher shelf so that the contents will not be within view. Provide space for a tissue box. Keep these shelves limited to a few items that require quick access on a daily basis. Avoid multiple dispensers and holders around the sink. #Replace a wide soap dish with a thin liquid soap dispenser. Place a towel hook near shower and sink.  Place a garment hook on the back of the bathroom door.  Try to avoid using a rack with multiple hooks in an already crowded space. One hook and one item on the hook provides for a neat appearance. Once dressed, remove all garments from the bathroom.  Decide what items can be kept elsewhere - other than in the bathroom.  Store your bathrobe on a hook in your bedroom closet instead of on the back of the bathroom door.  Store your laundry in a pillowcase hung on a hook in your  bedroom closet.  Store your scale beneath your bed or a bedroom chair.  Visual Pathway With a single swoop of the arm – push back the shower curtain to one side when it’s not in use. If you can see all the way to the back wall (instead of just to the curtain), your eye will think the room is larger. One sheer curtain covering the entire window will provide privacy and abundant light during the day. A shade behind the curtain can be pulled down at night. If fixtures are being replaced, consider a small corner sink. ",
  "tyn_model":[
    "mirrors",
    "mirror",
    "towels",
    "paint",
    "rug",
    "first-aid kit",
    "runner",
    "cabinets",
    "toilet",
    "cosmetics",
    "toothpaste",
    "tissue box",
    "soap dish",
    "towel hook",
    "garment hook",
    "laundry",
    "scale",
    "– push",
    "shower curtain"
  ],
  "tyn_section":[

  ]
}