{
  "title":"How to Make a Thanksgiving Themed Bingo Game",
  "url":"https://www.wikihow.com/Make-a-Thanksgiving-Themed-Bingo-Game",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "steps":[
    {
      "headline":"Create your bingo cards.",
      "description":"Instead of having \"BINGO\" at the top of the cards, substitute it with \"THANKS\". Make it creative."
    },
    {
      "headline":"Think of keywords that are associated with Thanksgiving.",
      "description":"You might think of things like the dinner, history, decorations, etc. Turkey\nCranberries\nPilgrims\nThanksgiving Day Parade\nGreen beans"
    },
    {
      "headline":"Write the keywords around the cards.",
      "description":"It's up to you to use the same keywords on every card or have different cards say other terms. This is useful when lots of terms are built up or allow people to have the opportunity to find different things from others. If you are using all character images, be sure to write down all of them so that you can call them out."
    },
    {
      "headline":"Distribute the cards out before the game starts.",
      "description":"Make sure that everyone has enough time so that they know what they're looking for beforehand."
    },
    {
      "headline":"Call out the terms or questions.",
      "description":"Have the participants eliminate the terms found on their card. If the cards won't be used in the future, you can have them cross them out with a marker. You can always preserve them for future games and use tokens or coins to cover them."
    },
    {
      "headline":"Declare a winner.",
      "description":"Once a person's card is completely blacked out first, then a winner can be declared. Depending on the complexity of the keywords, people can complete a standard Bingo row or column (up, down, or diagonal)."
    }
  ],
  "text":" Create your bingo cards. Instead of having \"BINGO\" at the top of the cards, substitute it with \"THANKS\". Make it creative. Think of keywords that are associated with Thanksgiving. You might think of things like the dinner, history, decorations, etc. Turkey\nCranberries\nPilgrims\nThanksgiving Day Parade\nGreen beans Write the keywords around the cards. It's up to you to use the same keywords on every card or have different cards say other terms. This is useful when lots of terms are built up or allow people to have the opportunity to find different things from others. If you are using all character images, be sure to write down all of them so that you can call them out. Distribute the cards out before the game starts. Make sure that everyone has enough time so that they know what they're looking for beforehand. Call out the terms or questions. Have the participants eliminate the terms found on their card. If the cards won't be used in the future, you can have them cross them out with a marker. You can always preserve them for future games and use tokens or coins to cover them. Declare a winner. Once a person's card is completely blacked out first, then a winner can be declared. Depending on the complexity of the keywords, people can complete a standard Bingo row or column (up, down, or diagonal).",
  "tyn_model":[
    "bingo cards",
    "turkey",
    "cranberries",
    "green beans",
    "cards",
    "marker"
  ],
  "tyn_section":[

  ]
}