{
  "title":"How to Create a Cabinet Message Board",
  "url":"https://www.wikihow.com/Create-a-Cabinet-Message-Board",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Home Organization"
  ],
  "methods":[
    {
      "name":"Determine Board Type and Placement",
      "steps":[
        {
          "headline":"Choose a cabinet that everyone uses on a regular basis.",
          "description":"From the pantry cabinet to the dinner plate or drink glass shelf, identify a cabinet door that is often used. Consider the amount of space you will need. Do you simply want an area to write down phone messages or do you need more room so you can post everyone’s schedule or calendar?"
        },
        {
          "headline":"Take specific measurements of the cabinet door.",
          "description":"If you’d like to include a pouch or box area to hold paperwork or pens, take into consideration the depth you have between the door and the inner shelving. If a pocket is must and space is tight you may need to consider another area. Plan how much material you’ll need for the entire board, especially if you plan to create something with two (or three) different types of material. For example, if you are doing a dry erase and cork board, measure the amount of space you’ll need for the dry erase portion as compared to the cork portion. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/62\\/Create-a-Cabinet-Message-Board-Step-2Bullet1.jpg\\/v4-459px-Create-a-Cabinet-Message-Board-Step-2Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/62\\/Create-a-Cabinet-Message-Board-Step-2Bullet1.jpg\\/v4-759px-Create-a-Cabinet-Message-Board-Step-2Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nPencil sketch the board on the back of the cabinet so you can see how it will look. This will give you a better idea if you should make one area of the board bigger than the other (perhaps you’ll need more room for the dry erase as compared to the cork). {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2f\\/Create-a-Cabinet-Message-Board-Step-2Bullet2.jpg\\/v4-459px-Create-a-Cabinet-Message-Board-Step-2Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2f\\/Create-a-Cabinet-Message-Board-Step-2Bullet2.jpg\\/v4-759px-Create-a-Cabinet-Message-Board-Step-2Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        },
        {
          "headline":"Determine the type of material you’ll need.",
          "description":"The way you plan to use the message board will dictate the type of material you’ll need. For simple message posting, cork or metal might work (for magnets and or thumbtacks) or if you think you may need to create pockets to hold piece of information you may want to consider creating a board that has wooden or canvas pouches to hold items."
        }
      ]
    },
    {
      "name":"Pick Up Supplies and Create Board",
      "steps":[
        {
          "headline":"Hit both the home improvement and craft store to find the right supplies.",
          "description":"Have measurements on hand to ensure you obtain the right amount of material, plus the right tools to create the board. If you are creating a board containing two or three different types of materials you’ll want to purchase one large board to act as the base. You’ll mount your other materials to this board and then mount the large board to the cabinet. Look for material that is lightweight but durable to act as your base board. Don’t forget to include the mounting material. Often spray adhesive will do the trick or even heavy duty double sided tape. Take into consideration that mounting a board on the back of your cabinet may damage the wood or material should you ever want to remove it. Pick up ancillary items such as thumb tacks, dry erase pens, magnets etc. to complete the board."
        },
        {
          "headline":"Cut out materials to fit the space.",
          "description":"Using a jigsaw or electric handsaw, cut materials according to your measurements and specifications. If possible, ask an employee at the home improvement store to cut out material before you get home."
        },
        {
          "headline":"Create your board on the baseboard if you are working with different materials.",
          "description":"Lay out the cork, metal or dry erase on the base board first and then use the spray adhesive to attach it to the base. Allow the materials to dry for an hour (or less) before mounting it to the cabinet."
        },
        {
          "headline":"Clean the back of the baseboard or message board using clean water and a towel.",
          "description":"Allow it to dry before mounting it to the cabinet."
        },
        {
          "headline":"Spray the back of the board with spray adhesive or apply double sided tape.",
          "description":"Line board up with previous measurements and the pencil drawing to ensure it is placed exactly as desired. Press and hold for a few minutes to ensure it adheres."
        },
        {
          "headline":"Assemble the cabinet to the hinges.",
          "description":""
        },
        {
          "headline":"You can now leave a message!",
          "description":""
        }
      ]
    }
  ],
  "text":" Determine Board Type and Placement Choose a cabinet that everyone uses on a regular basis. From the pantry cabinet to the dinner plate or drink glass shelf, identify a cabinet door that is often used. Consider the amount of space you will need. Do you simply want an area to write down phone messages or do you need more room so you can post everyone’s schedule or calendar? Take specific measurements of the cabinet door. If you’d like to include a pouch or box area to hold paperwork or pens, take into consideration the depth you have between the door and the inner shelving. If a pocket is must and space is tight you may need to consider another area. Plan how much material you’ll need for the entire board, especially if you plan to create something with two (or three) different types of material. For example, if you are doing a dry erase and cork board, measure the amount of space you’ll need for the dry erase portion as compared to the cork portion. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/62\\/Create-a-Cabinet-Message-Board-Step-2Bullet1.jpg\\/v4-459px-Create-a-Cabinet-Message-Board-Step-2Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/6\\/62\\/Create-a-Cabinet-Message-Board-Step-2Bullet1.jpg\\/v4-759px-Create-a-Cabinet-Message-Board-Step-2Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}\n\nPencil sketch the board on the back of the cabinet so you can see how it will look. This will give you a better idea if you should make one area of the board bigger than the other (perhaps you’ll need more room for the dry erase as compared to the cork). {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2f\\/Create-a-Cabinet-Message-Board-Step-2Bullet2.jpg\\/v4-459px-Create-a-Cabinet-Message-Board-Step-2Bullet2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2f\\/Create-a-Cabinet-Message-Board-Step-2Bullet2.jpg\\/v4-759px-Create-a-Cabinet-Message-Board-Step-2Bullet2.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Determine the type of material you’ll need. The way you plan to use the message board will dictate the type of material you’ll need. For simple message posting, cork or metal might work (for magnets and or thumbtacks) or if you think you may need to create pockets to hold piece of information you may want to consider creating a board that has wooden or canvas pouches to hold items. Pick Up Supplies and Create Board Hit both the home improvement and craft store to find the right supplies. Have measurements on hand to ensure you obtain the right amount of material, plus the right tools to create the board. If you are creating a board containing two or three different types of materials you’ll want to purchase one large board to act as the base. You’ll mount your other materials to this board and then mount the large board to the cabinet. Look for material that is lightweight but durable to act as your base board. Don’t forget to include the mounting material. Often spray adhesive will do the trick or even heavy duty double sided tape. Take into consideration that mounting a board on the back of your cabinet may damage the wood or material should you ever want to remove it. Pick up ancillary items such as thumb tacks, dry erase pens, magnets etc. to complete the board. Cut out materials to fit the space. Using a jigsaw or electric handsaw, cut materials according to your measurements and specifications. If possible, ask an employee at the home improvement store to cut out material before you get home. Create your board on the baseboard if you are working with different materials. Lay out the cork, metal or dry erase on the base board first and then use the spray adhesive to attach it to the base. Allow the materials to dry for an hour (or less) before mounting it to the cabinet. Clean the back of the baseboard or message board using clean water and a towel. Allow it to dry before mounting it to the cabinet. Spray the back of the board with spray adhesive or apply double sided tape. Line board up with previous measurements and the pencil drawing to ensure it is placed exactly as desired. Press and hold for a few minutes to ensure it adheres. Assemble the cabinet to the hinges.  You can now leave a message! ",
  "tyn_model":[
    "cabinet",
    "dry erase",
    "spray adhesive",
    "pens",
    "dry erase and",
    "parser",
    "pencil",
    "message board",
    "home improvement and",
    "thumb tacks",
    "dry erase pens",
    "jigsaw",
    "electric handsaw",
    "home improvement store",
    "water",
    "towel",
    "double sided tape"
  ],
  "tyn_section":[

  ]
}