{
  "title":"How to Make a Slushie",
  "url":"https://www.wikihow.com/Make-a-Slushie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Sodas and Fizzy Drinks"
  ],
  "methods":[
    {
      "name":"Using the Freezer",
      "steps":[
        {
          "headline":"Dissolve 1 cup sugar in 4 cups water.",
          "description":"Pour the sugar and water into a bowl and stir the mixture until the sugar is no longer visible. This way your slushie won't taste grainy after it freezes. In place of the sugar and water combination, you can use 4 cups of your favorite drink. Try making a slushie out of any type of soda, fruit juice, chocolate milk, and even coffee!"
        },
        {
          "headline":"Mix in flavored extract and food coloring.",
          "description":"You need 1 1/2 teaspoons extract and 5 to 10 drops of food coloring. Taste the mixture and add more or less according to your preference. If you want a creamy slushie, stir in a tablespoon or two of cream. This pairs especially well with orange or vanilla extract. To make it a little fancier, try adding a tablespoon of fresh lemon juice and a teaspoon of lemon zest."
        },
        {
          "headline":"Pour the mixture into a shallow baking dish.",
          "description":"The sides should be a few inches high so the liquid won't spill out."
        },
        {
          "headline":"Cover the dish with plastic wrap.",
          "description":"You could also use a lid if your dish comes with one."
        },
        {
          "headline":"Freeze the mixture for 2 hours, stirring every 30 minutes.",
          "description":"Each time you stir, you'll break up the frozen ice that has formed. Over time this creates the classic slushie texture. After doing this for about 3 hours, your slushie should be just right."
        },
        {
          "headline":"Scoop the slushie mixture into glasses.",
          "description":"You'll have enough for two large or four small slushies. Enjoy your delicious concoction."
        }
      ]
    },
    {
      "name":"Using a Blender",
      "steps":[
        {
          "headline":"Dissolve 1 cup of sugar in 2 cups of water.",
          "description":"Dissolving the sugar before you begin will help you avoid a grainy texture. Pour the sugar and water into a bowl and stir until you no longer see individual grains of sugar."
        },
        {
          "headline":"Add flavor and color.",
          "description":"To imitate the classic slushie, add 1 1/2 teaspoons of your favorite flavored extract (like raspberry, strawberry, lemon, lime, coconut or vanilla) and 5 or more drops of food coloring. Use a long-handled spoon to stir it all together. You can add a little more flavored extract or coloring to taste. Do you love soda-flavored slushies? Make one by freezing you favorite soda to make ice cubes. Replace the water and ice with cold soda and soda ice cubes, and leave out the sugar. Don't have time to buy flavored extract? You can use a packet of Kool-Aid powder in place of flavor and food coloring."
        },
        {
          "headline":"Blend the sugar water with 2 cups of ice.",
          "description":"Just pour the sugar water into your blender and add 2 cups of whole ice cubes. This method works best if your blender is powerful enough to grind ice finely, creating the classic slushie texture. You might want to test-grind some ice cubes to make sure your blender can handle it; if not, just try another method. If you like your slushies thinner, add another 1/2 cup of water. If you like a thicker, icier texture, reduce the water by 1/2 cup."
        },
        {
          "headline":"Blend the mixture on high speed.",
          "description":"Depending on the strength of your blender, it can take just a few pulses or several minutes to get the texture of a slushie. Keep going until the ice has been crushed and the mixture takes on the right consistency. It can help to periodically stir the mixture with a long-handled spoon to help the ice circulate. If your blender isn't quite powerful enough, transfer the mixture to a food processor and process it in batches."
        },
        {
          "headline":"Taste the slushie.",
          "description":"If you're happy with the flavor and level and sweetness, the slushie is ready. Add more sugar, flavoring, or food coloring to make the slushie just right. If you add extra ingredients, be sure to blend the slushie thoroughly."
        },
        {
          "headline":"Enjoy the slushie.",
          "description":"Divide the mixture into glasses and drink it through a straw for an authentic slushie experience. You'll have enough for two large or four small slushies."
        }
      ]
    },
    {
      "name":"Using an Ice Cream Maker",
      "steps":[
        {
          "headline":"Dissolve 1 cup sugar in 4 cups water.",
          "description":"Pour the sugar and water into a bowl and stir until you no longer see individual grains of sugar. This will improve the texture of your slushie."
        },
        {
          "headline":"Mix in flavored extract and food coloring.",
          "description":"Use 1 1/2 teaspoons of your favorite flavored extract and 5 to 10 drops of food coloring to match. The following color and flavor combinations result in deliciously appealing slushies:\nRaspberry extract and blue food coloring\nA combination of cherry and vanilla extract and red food coloring\nA combination of lemon and lime extract with yellow and green food coloring\nOrange extract with orange food coloring"
        },
        {
          "headline":"Process the mixture in your ice cream maker for 20 minutes.",
          "description":"Since you don't want the slushie mixture to freeze as solid as ice cream, just pour it into your ice cream maker and process it for about 20 minutes. After 20 minutes, check the slushie mixture to see if it's the right consistency, and keep processing if necessary."
        },
        {
          "headline":"Ladle your slushie mixture into glasses.",
          "description":"You'll have enough for two large or four small slushies. Enjoy them with a straw for the classic experience."
        }
      ]
    }
  ],
  "text":" Using the Freezer Dissolve 1 cup sugar in 4 cups water. Pour the sugar and water into a bowl and stir the mixture until the sugar is no longer visible. This way your slushie won't taste grainy after it freezes. In place of the sugar and water combination, you can use 4 cups of your favorite drink. Try making a slushie out of any type of soda, fruit juice, chocolate milk, and even coffee! Mix in flavored extract and food coloring. You need 1 1/2 teaspoons extract and 5 to 10 drops of food coloring. Taste the mixture and add more or less according to your preference. If you want a creamy slushie, stir in a tablespoon or two of cream. This pairs especially well with orange or vanilla extract. To make it a little fancier, try adding a tablespoon of fresh lemon juice and a teaspoon of lemon zest. Pour the mixture into a shallow baking dish. The sides should be a few inches high so the liquid won't spill out. Cover the dish with plastic wrap. You could also use a lid if your dish comes with one. Freeze the mixture for 2 hours, stirring every 30 minutes. Each time you stir, you'll break up the frozen ice that has formed. Over time this creates the classic slushie texture. After doing this for about 3 hours, your slushie should be just right. Scoop the slushie mixture into glasses. You'll have enough for two large or four small slushies. Enjoy your delicious concoction. Using a Blender Dissolve 1 cup of sugar in 2 cups of water. Dissolving the sugar before you begin will help you avoid a grainy texture. Pour the sugar and water into a bowl and stir until you no longer see individual grains of sugar. Add flavor and color. To imitate the classic slushie, add 1 1/2 teaspoons of your favorite flavored extract (like raspberry, strawberry, lemon, lime, coconut or vanilla) and 5 or more drops of food coloring. Use a long-handled spoon to stir it all together. You can add a little more flavored extract or coloring to taste. Do you love soda-flavored slushies? Make one by freezing you favorite soda to make ice cubes. Replace the water and ice with cold soda and soda ice cubes, and leave out the sugar. Don't have time to buy flavored extract? You can use a packet of Kool-Aid powder in place of flavor and food coloring. Blend the sugar water with 2 cups of ice. Just pour the sugar water into your blender and add 2 cups of whole ice cubes. This method works best if your blender is powerful enough to grind ice finely, creating the classic slushie texture. You might want to test-grind some ice cubes to make sure your blender can handle it; if not, just try another method. If you like your slushies thinner, add another 1/2 cup of water. If you like a thicker, icier texture, reduce the water by 1/2 cup. Blend the mixture on high speed. Depending on the strength of your blender, it can take just a few pulses or several minutes to get the texture of a slushie. Keep going until the ice has been crushed and the mixture takes on the right consistency. It can help to periodically stir the mixture with a long-handled spoon to help the ice circulate. If your blender isn't quite powerful enough, transfer the mixture to a food processor and process it in batches. Taste the slushie. If you're happy with the flavor and level and sweetness, the slushie is ready. Add more sugar, flavoring, or food coloring to make the slushie just right. If you add extra ingredients, be sure to blend the slushie thoroughly. Enjoy the slushie. Divide the mixture into glasses and drink it through a straw for an authentic slushie experience. You'll have enough for two large or four small slushies. Using an Ice Cream Maker Dissolve 1 cup sugar in 4 cups water. Pour the sugar and water into a bowl and stir until you no longer see individual grains of sugar. This will improve the texture of your slushie. Mix in flavored extract and food coloring. Use 1 1/2 teaspoons of your favorite flavored extract and 5 to 10 drops of food coloring to match. The following color and flavor combinations result in deliciously appealing slushies:\nRaspberry extract and blue food coloring\nA combination of cherry and vanilla extract and red food coloring\nA combination of lemon and lime extract with yellow and green food coloring\nOrange extract with orange food coloring Process the mixture in your ice cream maker for 20 minutes. Since you don't want the slushie mixture to freeze as solid as ice cream, just pour it into your ice cream maker and process it for about 20 minutes. After 20 minutes, check the slushie mixture to see if it's the right consistency, and keep processing if necessary. Ladle your slushie mixture into glasses. You'll have enough for two large or four small slushies. Enjoy them with a straw for the classic experience.",
  "tyn_model":[
    "sugar",
    "water",
    "food coloring",
    "blender",
    "flavored extract",
    "ice",
    "bowl",
    "ice cubes",
    "ice cream maker",
    "sugar water",
    "straw",
    "freezer",
    "soda",
    "fruit juice",
    "chocolate milk",
    "coffee",
    "cream",
    "orange or vanilla",
    "lemon juice",
    "lemon zest",
    "baking dish",
    "plastic wrap",
    "lemon",
    "vanilla",
    "spoon",
    "cold soda",
    "soda ice cubes",
    "kool-aid powder",
    "long-handled spoon",
    "food processor",
    "raspberry extract",
    "vanilla extract",
    "orange extract",
    "orange food coloring",
    "ice cream"
  ],
  "tyn_section":[

  ]
}