{
  "title":"How to Make a Shell Covered Matchbox",
  "url":"https://www.wikihow.com/Make-a-Shell-Covered-Matchbox",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts",
    "Shell Art and Craft"
  ],
  "steps":[
    {
      "headline":"Search for lovely tiny seashells.",
      "description":"If you live near a beach, take a walk and collect some pretty small shells. If you don't have a beach close by, look in craft stores or online for small shell collections. You'll also need a matchbox or two."
    },
    {
      "headline":"Peel the striking edges off the sides of the matchbox.",
      "description":""
    },
    {
      "headline":"Cover the matchbox with plain paper or cloth.",
      "description":"The color can match the shells or be in contrast with them. Don't glue the paper or cloth over the matchbox drawer. You need to be able to access this still. Instead, cut out small pieces of paper or cloth the exact size of the drawer ends and glue at each end separately."
    },
    {
      "headline":"Design a pattern for adding the shells to the box.",
      "description":"You can add shells to just one surface, or to the top and sides, or all over. You can create a pattern, or simply add the shells randomly."
    },
    {
      "headline":"Use a glue brush to paint glue over the paper or fabric.",
      "description":"Glue each shell to the top (and any other part of the box). Leave to dry before gluing shells to additional sides or the base of the box."
    },
    {
      "headline":"If adding other decorative elements, add now.",
      "description":"These could be beads, costume gems, glitter, lace, ribbon, bows, etc. Decide whether these will form part of the pattern or will be additional decorative elements on top."
    },
    {
      "headline":"Use the box.",
      "description":"It's useful for keeping pins and needles in a sewing basket, paperclips on a desk, earrings/rings, etc. on a dressing table and tacks in the kitchen, etc."
    }
  ],
  "text":" Search for lovely tiny seashells. If you live near a beach, take a walk and collect some pretty small shells. If you don't have a beach close by, look in craft stores or online for small shell collections. You'll also need a matchbox or two. Peel the striking edges off the sides of the matchbox.  Cover the matchbox with plain paper or cloth. The color can match the shells or be in contrast with them. Don't glue the paper or cloth over the matchbox drawer. You need to be able to access this still. Instead, cut out small pieces of paper or cloth the exact size of the drawer ends and glue at each end separately. Design a pattern for adding the shells to the box. You can add shells to just one surface, or to the top and sides, or all over. You can create a pattern, or simply add the shells randomly. Use a glue brush to paint glue over the paper or fabric. Glue each shell to the top (and any other part of the box). Leave to dry before gluing shells to additional sides or the base of the box. If adding other decorative elements, add now. These could be beads, costume gems, glitter, lace, ribbon, bows, etc. Decide whether these will form part of the pattern or will be additional decorative elements on top. Use the box. It's useful for keeping pins and needles in a sewing basket, paperclips on a desk, earrings/rings, etc. on a dressing table and tacks in the kitchen, etc.",
  "tyn_model":[
    "paper",
    "glue",
    "shells",
    "matchbox",
    "cloth",
    "glue brush",
    "fabric",
    "beads",
    "glitter",
    "lace",
    "ribbon",
    "pins and needles",
    "paperclips",
    "tacks"
  ],
  "tyn_section":[

  ]
}