{
  "title":"How to Use Toys for Practical Purposes",
  "url":"https://www.wikihow.com/Use-Toys-for-Practical-Purposes",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys"
  ],
  "methods":[
    {
      "name":"Organize Toys",
      "steps":[
        {
          "headline":"Keep game pieces inside a toy cash register or child’s jewelry box.",
          "description":"If the original game box is missing or damaged, consider using an old toy cash register to hold game pieces and even the game board if its large enough."
        },
        {
          "headline":"Hold paint inside a half of a plastic toy egg.",
          "description":"Is your child interested in painting but nowhere to hold all the different colors? Dig into your child’s Easter basket or toy kitchen supplies and use half of a plastic hollow egg to fill with paint."
        },
        {
          "headline":"Contain office supplies inside a Slinky toy.",
          "description":"Errant office supplies flooding your desk can be annoying. Contain pens, rulers and even notepads inside a Slinky toy. Simply wrap the Slinky into a circle on your desk, clip with a binder or paper clip and you have an automatic desk coral."
        },
        {
          "headline":"Use old books as placemats.",
          "description":"Dig out an old paperback picture book (or even coloring book) to use as a quick option for a placemat. Be sure you are truly finished with the book as using it as a placement means it will most likely be trashed by the end of the meal."
        },
        {
          "headline":"Create bookends using small, plastic action figures.",
          "description":"Mount 10” to 12” hard, plastic action figures on the wall to hold caps and jackets in your child’s room. Drill holes in the figure’s feet and mount on the wall using screws."
        },
        {
          "headline":"Prop large, hearty stuffed animals to become bookends.",
          "description":"If books keep falling off the shelf, find the most bottom heavy stuffed animal that will fit on the shelf and make the toy do the job of a book end."
        },
        {
          "headline":"Use puzzle pieces as magnets.",
          "description":"Purchase self-adhesive magnetic strips and attach to the back of puzzle pieces."
        },
        {
          "headline":"Use an old skateboard as a shelf.",
          "description":"For the ultimate skater, mounting an old board on the wall not only acts as a handy shelf but will also be a proud way to show shred-worthy credibility. Boards can be mounted either by the trucks or through the board itself depending on how you plan to use the board (as a hook or a shelf)."
        }
      ]
    },
    {
      "name":"Stay Safe with Toys",
      "steps":[
        {
          "headline":"Create a “boo boo” bunny with a stuffed animal.",
          "description":"Remove half of the stuffing inside the stuffed animal and replace the opening with double stick Velcro tape. When your child has a “boo boo” fill with a plastic bag of ice and then close the back with Velcro."
        },
        {
          "headline":"Keep lit sparklers out of reach by planting the stick inside an open can of Play Dough.",
          "description":"Whether its sparklers or tapered candles, a quick and easy way to keep them out of reach from small hands is to stuff the stick or candle inside an open can of Play Dough to hold in place."
        },
        {
          "headline":"Decorate the bottom of your child’s socks with puff paint to prevent him/her from slipping on wood or tile floors.",
          "description":"Make designs on the bottom of your child’s socks and allow the paint to dry before allowing the child to wear them."
        },
        {
          "headline":"Wrap rubber bands around cups and glasses to provide more gripping power.",
          "description":"Wet glasses or cups with condensation can create a slip (and cleaning) hazard. Reduce the likelihood that cups can slip from small hands by wrapping a few rubber bands around the glass for an easier grip."
        }
      ]
    },
    {
      "name":"Entertain\\/Gift Giving with Toys",
      "steps":[
        {
          "headline":"Use old book pages as gift wrap.",
          "description":"Wrap small gifts with the double truck pages from an old book or coloring book."
        },
        {
          "headline":"Wrap Silly Bandz around wine glasses to substitute as wine charms.",
          "description":"In a pinch for wine charms? Use your child’s Silly Bandz (or elastic bracelet) collection at the next gathering. Each band comes in a different shape and color to provide your guests with an easy way to spot their drink."
        },
        {
          "headline":"Fill small plastic eggs with tiny toy beads and create a musical instrument.",
          "description":"Make some noise with a few small tiny toy beads and a plastic egg. Fill the egg a quarter of the way with the beads, close the egg and shake. You will have an instant maraca."
        },
        {
          "headline":"Use a jump rope as a substitute for a ribbon around a gift.",
          "description":"Need a quick idea for a gift wrap ribbon but are out of supplies? Use a new jump rope to complete a package for a child (or an adult). The rope will add an extra flourish to the gift plus provide the recipient with a bonus (the jump rope)."
        },
        {
          "headline":"Make bubbles using soapy water and a kazoo.",
          "description":"Create your own “at home” bubble maker by dipping a toy kazoo into soapy water. Blow and you’ll have a bubble trail."
        },
        {
          "headline":"Use Valentine’s Day conversation hearts as chalk.",
          "description":"Express yourself by using Valentine’s Day conversation hearts as chalk. These hearts may also write on butcher paper if un-waxed."
        }
      ]
    }
  ],
  "text":" Organize Toys Keep game pieces inside a toy cash register or child’s jewelry box. If the original game box is missing or damaged, consider using an old toy cash register to hold game pieces and even the game board if its large enough. Hold paint inside a half of a plastic toy egg. Is your child interested in painting but nowhere to hold all the different colors? Dig into your child’s Easter basket or toy kitchen supplies and use half of a plastic hollow egg to fill with paint. Contain office supplies inside a Slinky toy. Errant office supplies flooding your desk can be annoying. Contain pens, rulers and even notepads inside a Slinky toy. Simply wrap the Slinky into a circle on your desk, clip with a binder or paper clip and you have an automatic desk coral. Use old books as placemats. Dig out an old paperback picture book (or even coloring book) to use as a quick option for a placemat. Be sure you are truly finished with the book as using it as a placement means it will most likely be trashed by the end of the meal. Create bookends using small, plastic action figures. Mount 10” to 12” hard, plastic action figures on the wall to hold caps and jackets in your child’s room. Drill holes in the figure’s feet and mount on the wall using screws. Prop large, hearty stuffed animals to become bookends. If books keep falling off the shelf, find the most bottom heavy stuffed animal that will fit on the shelf and make the toy do the job of a book end. Use puzzle pieces as magnets. Purchase self-adhesive magnetic strips and attach to the back of puzzle pieces. Use an old skateboard as a shelf. For the ultimate skater, mounting an old board on the wall not only acts as a handy shelf but will also be a proud way to show shred-worthy credibility. Boards can be mounted either by the trucks or through the board itself depending on how you plan to use the board (as a hook or a shelf). Stay Safe with Toys Create a “boo boo” bunny with a stuffed animal. Remove half of the stuffing inside the stuffed animal and replace the opening with double stick Velcro tape. When your child has a “boo boo” fill with a plastic bag of ice and then close the back with Velcro. Keep lit sparklers out of reach by planting the stick inside an open can of Play Dough. Whether its sparklers or tapered candles, a quick and easy way to keep them out of reach from small hands is to stuff the stick or candle inside an open can of Play Dough to hold in place. Decorate the bottom of your child’s socks with puff paint to prevent him/her from slipping on wood or tile floors. Make designs on the bottom of your child’s socks and allow the paint to dry before allowing the child to wear them. Wrap rubber bands around cups and glasses to provide more gripping power. Wet glasses or cups with condensation can create a slip (and cleaning) hazard. Reduce the likelihood that cups can slip from small hands by wrapping a few rubber bands around the glass for an easier grip. Entertain\\/Gift Giving with Toys Use old book pages as gift wrap. Wrap small gifts with the double truck pages from an old book or coloring book. Wrap Silly Bandz around wine glasses to substitute as wine charms. In a pinch for wine charms? Use your child’s Silly Bandz (or elastic bracelet) collection at the next gathering. Each band comes in a different shape and color to provide your guests with an easy way to spot their drink. Fill small plastic eggs with tiny toy beads and create a musical instrument. Make some noise with a few small tiny toy beads and a plastic egg. Fill the egg a quarter of the way with the beads, close the egg and shake. You will have an instant maraca. Use a jump rope as a substitute for a ribbon around a gift. Need a quick idea for a gift wrap ribbon but are out of supplies? Use a new jump rope to complete a package for a child (or an adult). The rope will add an extra flourish to the gift plus provide the recipient with a bonus (the jump rope). Make bubbles using soapy water and a kazoo. Create your own “at home” bubble maker by dipping a toy kazoo into soapy water. Blow and you’ll have a bubble trail. Use Valentine’s Day conversation hearts as chalk. Express yourself by using Valentine’s Day conversation hearts as chalk. These hearts may also write on butcher paper if un-waxed.",
  "tyn_model":[
    "paint",
    "cups",
    "jump rope",
    "“boo",
    "play dough",
    "rubber bands",
    "soapy water",
    "chalk",
    "toy kitchen supplies",
    "pens",
    "rulers",
    "notepads",
    "binder",
    "bookends",
    "” to",
    "” hard",
    "screws",
    "magnets",
    "magnetic strips",
    "skateboard",
    "board",
    "boards",
    "” bunny",
    "double stick velcro tape",
    "” fill",
    "plastic bag",
    "ice",
    "sparklers",
    "puff paint",
    "glasses",
    "coloring book",
    "wine glasses",
    "elastic bracelet",
    "musical instrument",
    "plastic egg",
    "beads",
    "ribbon",
    "bubbles",
    "kazoo",
    "“at",
    "” bubble",
    "butcher paper"
  ],
  "tyn_section":[

  ]
}