{
  "title":"How to Make Chocolate Peppermints",
  "url":"https://www.wikihow.com/Make-Chocolate-Peppermints",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Filled Chocolates"
  ],
  "steps":[
    {
      "headline":"Make the peppermints.",
      "description":"Melt a little fondant and flavor it to taste with peppermint essence (extract). Leave the mixture white or tint very delicately with green or pink color-paste."
    },
    {
      "headline":"Take a teaspoon, drop the mixture onto waxed or baking paper to make rounds of the same size — about one inch and a quarter / 3 centimeter (1.2 in) in diameter.",
      "description":"Let these stand in a cool place about one hour."
    },
    {
      "headline":"Put about a cup of fondant in a double boiler (bain marie).",
      "description":""
    },
    {
      "headline":"Add two ounces of chocolate and a teaspoonful of fondant.",
      "description":"Stir (over hot water) until the fondant and chocolate are melted and evenly mixed together."
    },
    {
      "headline":"Drop the peppermints, one by one, into the chocolate mixture.",
      "description":""
    },
    {
      "headline":"Remove them with the fork to a piece of baking paper.",
      "description":""
    },
    {
      "headline":"Let stand until the chocolate is set.",
      "description":"Once set, they are ready to serve. You can add some chocolate chips to garnish the chocolate peppermints too!"
    }
  ],
  "text":" Make the peppermints. Melt a little fondant and flavor it to taste with peppermint essence (extract). Leave the mixture white or tint very delicately with green or pink color-paste. Take a teaspoon, drop the mixture onto waxed or baking paper to make rounds of the same size — about one inch and a quarter / 3 centimeter (1.2 in) in diameter. Let these stand in a cool place about one hour. Put about a cup of fondant in a double boiler (bain marie).  Add two ounces of chocolate and a teaspoonful of fondant. Stir (over hot water) until the fondant and chocolate are melted and evenly mixed together. Drop the peppermints, one by one, into the chocolate mixture.  Remove them with the fork to a piece of baking paper.  Let stand until the chocolate is set. Once set, they are ready to serve. You can add some chocolate chips to garnish the chocolate peppermints too!",
  "tyn_model":[
    "fondant",
    "chocolate",
    "baking paper",
    "— about",
    "double boiler",
    "hot water",
    "fork",
    "chocolate chips"
  ],
  "tyn_section":[

  ]
}