{
  "title":"How to Make Chocolate Nut Caramels",
  "url":"https://www.wikihow.com/Make-Chocolate-Nut-Caramels",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Caramel"
  ],
  "methods":[
    {
      "name":"Walnut or almond chocolate caramels",
      "steps":[
        {
          "headline":"Put the sugar, glucose, one cup of the cream and the butter in a saucepan.",
          "description":""
        },
        {
          "headline":"Add to heat.",
          "description":""
        },
        {
          "headline":"Stir and cook until the mixture boils vigorously, then gradually add the other cup of cream.",
          "description":"Do not allow the mixture to stop boiling while the cream is being added."
        },
        {
          "headline":"Cook until the thermometer registers 250° F., stirring gently.",
          "description":"Move the thermometer, to stir beneath it every four or five minutes. Without a thermometer boil until, when tested by dropping a little in cold water, a hard ball may be formed in the water."
        },
        {
          "headline":"Remove from the fire, add the chocolate and nuts and beat until the chocolate is melted.",
          "description":""
        },
        {
          "headline":"Mix in the vanilla and turn into a cookie sheet / biscuit tray, well buttered or lined with baking paper, to make a sheet three-fourths an inch thick.",
          "description":""
        },
        {
          "headline":"Prepare for serving.",
          "description":"When nearly cold, turn from the pan and cut into cubes. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/e\\/e1\\/Chocalmondcaramel.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/e\\/e1\\/Chocalmondcaramel.png\",\"smallWidth\":460,\"smallHeight\":282,\"bigWidth\":760,\"bigHeight\":465.12,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p><a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/www.gutenberg.org\\/files\\/13177\\/13177-h\\/13177-h.htm\\\">Chocolate and Cocoa Recipes By Miss Parloa and Home Made Candy Recipes By Mrs. Janet McKenzie Hill<\\/a>, public domain resource.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Public_domain\\\">Public Domain<\\/a><br>\\n<\\/p><\\/div>\"}"
        }
      ]
    },
    {
      "name":"Cashew chocolate caramels",
      "steps":[
        {
          "headline":"Prepare the chocolate.",
          "description":"Break apart and chop roughly."
        },
        {
          "headline":"Prepare the baking sheets.",
          "description":"Line with waxed paper. Spread butter thinly across the top of the wax paper on each sheet."
        },
        {
          "headline":"Melt 1 pound/ 450g of the candy coating.",
          "description":"Either use a microwave or a double boiler to melt the coating."
        },
        {
          "headline":"Drop a tablespoon of candy coating onto the lined baking sheet.",
          "description":"Repeat in even rows until all of the coating has been dropped onto the sheet in this way. Use a level tablespoon of coating for each candy."
        },
        {
          "headline":"Allow the candy coating to set partially.",
          "description":"This will be about 3 minutes. At this point, push in a few cashews, up to 7. Leave so that they continue to set, embedding the cashews within the candy coating."
        },
        {
          "headline":"Pour the cream into the saucepan.",
          "description":"Add the caramels."
        },
        {
          "headline":"Cook using a low heat.",
          "description":"Stir continuously until the caramels melt. Stir until the whole mixture is smooth."
        },
        {
          "headline":"Use a small spoon to add the caramel and cream mixture to the candies.",
          "description":"Gently ladle over the cashews. If the caramel hardens too much while doing this, simply gently reheat to melt."
        },
        {
          "headline":"Melt the remaining 1 pound/450g of candy coating.",
          "description":"Use the same method as before."
        },
        {
          "headline":"Spoon this mixture over the candies.",
          "description":"This will sandwich the cashews and caramels in between two layers of chocolate candy coating."
        },
        {
          "headline":"Allow to stand to set firmly.",
          "description":"When fully set, the cashew chocolate caramels are ready to eat."
        }
      ]
    },
    {
      "name":"Maple pecan caramels",
      "steps":[
        {
          "headline":"Prepare the loaf pan.",
          "description":"Line with foil, then butter the foil to prevent sticking."
        },
        {
          "headline":"Pour the cream, milk and maple syrup into the heavy-based saucepan.",
          "description":"Add the brown sugar, butter and salt. Stir to combine."
        },
        {
          "headline":"Put the saucepan on medium heat.",
          "description":"Bring to the boil, stirring constantly. When it reaches boiling point, cover and keep boiling for 3 minutes, stirring frequently."
        },
        {
          "headline":"Remove the cover from the mixture.",
          "description":"Stop stirring and boil on medium heat. Use a temperature thermometer to see when the mixture reaches 246ºF/119ºC. When it reaches this, remove from the heat."
        },
        {
          "headline":"Add the vanilla extract and the chopped pecans.",
          "description":"Stir through."
        },
        {
          "headline":"Pour the caramel mixture into the lined loaf pan.",
          "description":"Use a spatula or the back of a spoon to spread the mixture evenly across the base of the loaf pan."
        },
        {
          "headline":"Set aside to cool.",
          "description":"It will take about 1-2 hours to cool enough for the caramel to firm up."
        },
        {
          "headline":"Remove the caramel.",
          "description":"Lift out by picking up the foil at both sides, then placing on a cutting board. Peel the foil off before cutting."
        },
        {
          "headline":"Oil the cutting knife with vegetable oil.",
          "description":"Cut the caramel into squares or diamonds."
        }
      ]
    }
  ],
  "text":" Walnut or almond chocolate caramels Put the sugar, glucose, one cup of the cream and the butter in a saucepan.  Add to heat.  Stir and cook until the mixture boils vigorously, then gradually add the other cup of cream. Do not allow the mixture to stop boiling while the cream is being added. Cook until the thermometer registers 250° F., stirring gently. Move the thermometer, to stir beneath it every four or five minutes. Without a thermometer boil until, when tested by dropping a little in cold water, a hard ball may be formed in the water. Remove from the fire, add the chocolate and nuts and beat until the chocolate is melted.  Mix in the vanilla and turn into a cookie sheet / biscuit tray, well buttered or lined with baking paper, to make a sheet three-fourths an inch thick.  Prepare for serving. When nearly cold, turn from the pan and cut into cubes. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/e\\/e1\\/Chocalmondcaramel.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/e\\/e1\\/Chocalmondcaramel.png\",\"smallWidth\":460,\"smallHeight\":282,\"bigWidth\":760,\"bigHeight\":465.12,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p><a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/www.gutenberg.org\\/files\\/13177\\/13177-h\\/13177-h.htm\\\">Chocolate and Cocoa Recipes By Miss Parloa and Home Made Candy Recipes By Mrs. Janet McKenzie Hill<\\/a>, public domain resource.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Public_domain\\\">Public Domain<\\/a><br>\\n<\\/p><\\/div>\"} Cashew chocolate caramels Prepare the chocolate. Break apart and chop roughly. Prepare the baking sheets. Line with waxed paper. Spread butter thinly across the top of the wax paper on each sheet. Melt 1 pound/ 450g of the candy coating. Either use a microwave or a double boiler to melt the coating. Drop a tablespoon of candy coating onto the lined baking sheet. Repeat in even rows until all of the coating has been dropped onto the sheet in this way. Use a level tablespoon of coating for each candy. Allow the candy coating to set partially. This will be about 3 minutes. At this point, push in a few cashews, up to 7. Leave so that they continue to set, embedding the cashews within the candy coating. Pour the cream into the saucepan. Add the caramels. Cook using a low heat. Stir continuously until the caramels melt. Stir until the whole mixture is smooth. Use a small spoon to add the caramel and cream mixture to the candies. Gently ladle over the cashews. If the caramel hardens too much while doing this, simply gently reheat to melt. Melt the remaining 1 pound/450g of candy coating. Use the same method as before. Spoon this mixture over the candies. This will sandwich the cashews and caramels in between two layers of chocolate candy coating. Allow to stand to set firmly. When fully set, the cashew chocolate caramels are ready to eat. Maple pecan caramels Prepare the loaf pan. Line with foil, then butter the foil to prevent sticking. Pour the cream, milk and maple syrup into the heavy-based saucepan. Add the brown sugar, butter and salt. Stir to combine. Put the saucepan on medium heat. Bring to the boil, stirring constantly. When it reaches boiling point, cover and keep boiling for 3 minutes, stirring frequently. Remove the cover from the mixture. Stop stirring and boil on medium heat. Use a temperature thermometer to see when the mixture reaches 246ºF/119ºC. When it reaches this, remove from the heat. Add the vanilla extract and the chopped pecans. Stir through. Pour the caramel mixture into the lined loaf pan. Use a spatula or the back of a spoon to spread the mixture evenly across the base of the loaf pan. Set aside to cool. It will take about 1-2 hours to cool enough for the caramel to firm up. Remove the caramel. Lift out by picking up the foil at both sides, then placing on a cutting board. Peel the foil off before cutting. Oil the cutting knife with vegetable oil. Cut the caramel into squares or diamonds.",
  "tyn_model":[
    "cream",
    "butter",
    "foil",
    "saucepan",
    "chocolate",
    "candy coating",
    "loaf pan",
    "thermometer",
    "water",
    "cashew chocolate caramels",
    "caramel",
    "cashews",
    "sugar",
    "glucose",
    "nuts",
    "vanilla",
    "cookie sheet / biscuit tray",
    "baking sheets",
    "waxed paper",
    "wax paper",
    "microwave",
    "double boiler",
    "baking sheet",
    "small spoon",
    "chocolate candy coating",
    "maple pecan caramels",
    "milk",
    "maple syrup",
    "heavy-based saucepan",
    "brown sugar",
    "salt",
    "temperature thermometer",
    "vanilla extract",
    "pecans",
    "spatula",
    "spoon",
    "cutting board",
    "cutting knife",
    "vegetable oil"
  ],
  "tyn_section":[

  ]
}