{
  "title":"How to Make a Valentine Candy Box Pop up Card (Robert Sabuda Method)",
  "url":"https://www.wikihow.com/Make-a-Valentine-Candy-Box-Pop-up-Card-(Robert-Sabuda-Method)",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Homemade Cards",
    "Pop Up Cards"
  ],
  "steps":[
    {
      "headline":"Click on the images shown in this step to get the images for the card.",
      "description":"This will enlarge the images. Then print out the candy box's card on a heavy paper, like cardstock or construction paper. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/38\\/Box1_673.gif\\/460px-Box1_673.gif\",\"bigUrl\":\"\\/images\\/thumb\\/3\\/38\\/Box1_673.gif\\/425px-Box1_673.gif\",\"smallWidth\":460,\"smallHeight\":606,\"bigWidth\":\"425\",\"bigHeight\":\"560\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p><a rel=\\\"nofollow\\\" class=\\\"external free\\\" href=\\\"http:\\/\\/robertsabuda.com\\/popmake\\/popmake_vcandy-step1.asp\\\">http:\\/\\/robertsabuda.com\\/popmake\\/popmake_vcandy-step1.asp<\\/a>\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><\\/div>\"}\n\nPrint out the pop-up pieces of the candy box on the same card. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/3\\/37\\/Box_pieces2_694.gif\",\"bigUrl\":\"\\/images\\/thumb\\/3\\/37\\/Box_pieces2_694.gif\\/433px-Box_pieces2_694.gif\",\"smallWidth\":460,\"smallHeight\":493,\"bigWidth\":\"433\",\"bigHeight\":\"464\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p><a rel=\\\"nofollow\\\" class=\\\"external free\\\" href=\\\"http:\\/\\/robertsabuda.com\\/popmake\\/popmake_vcandy-step2.asp\\\">http:\\/\\/robertsabuda.com\\/popmake\\/popmake_vcandy-step2.asp<\\/a>\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><\\/div>\"}"
    },
    {
      "headline":"Using a ruler as a guide, take the rounded end of a paperclip (or a ballpoint pen that has run out of ink) and press along the dotted line on the center of the card.",
      "description":"Go all the way from the top to the bottom of the card."
    },
    {
      "headline":"Using a ruler as a guide, take the rounded end of a paper clip (or a ballpoint pen that has run out of ink) and press along the dotted lines of all the pop-up pieces.",
      "description":"There are lots of dotted lines on this pop-up so take your time and make sure to press along all of them."
    },
    {
      "headline":"Color in the candies with crayons, markers or colored pencils.",
      "description":"You might also like to add some glitter or sparkles. Then carefully cut out the card following the solid, black lines. Do not cut out any of the lines of the candy box."
    },
    {
      "headline":"Color in the candy box pieces.",
      "description":"Do not color on any areas with a big letter. Carefully cut out the candy box pieces following the solid, black lines."
    },
    {
      "headline":"Using a small pair of pointed scissors (kids, get an adult to help you with this part), carefully cut out the slot in the top of the candy box lid.",
      "description":""
    },
    {
      "headline":"Place a small amount of glue on the area marked \"Glue A.\"",
      "description":"Take the other pop-up piece that also has an \"A\" on the tab and press it onto the area marked \"Glue A.\""
    },
    {
      "headline":"Make a \"mountain\" fold on the dotted lines of the one, long piece that will be the actual candy box as shown.",
      "description":""
    },
    {
      "headline":"Take the far right side of the candy box and fold it all the way over as shown.",
      "description":"Fold so that you can see the tab with the big \"B\" on it."
    },
    {
      "headline":"Put a small amount of glue on the area marked \"Glue B.\"",
      "description":"Fold the \"B\" tab backward so it is aligned \"Glue B\" area."
    },
    {
      "headline":"Press the \"B\" tab firmly and let dry.",
      "description":""
    },
    {
      "headline":"The candy box should now look like this.",
      "description":""
    },
    {
      "headline":"Fold tabs \"C\" and \"D\" up against the sides of the candy box.",
      "description":""
    },
    {
      "headline":"Look to see that your candy box now looks like this.",
      "description":"Set it aside."
    },
    {
      "headline":"Fold the card in half along the center.",
      "description":""
    },
    {
      "headline":"Apply a small amount of glue to the areas marked \"Glue C\" and \"Glue D\".",
      "description":"Carefully line up the matching tabs on the candy box and press into the glue areas. Let dry."
    },
    {
      "headline":"Notice that at the top left side of the candy box there are two small tabs that look like little dog's ears.",
      "description":"Fold each tab all the way in towards the center."
    },
    {
      "headline":"With the tabs still folded in towards the center, thread the slot on the candy box's lid through.",
      "description":"When the lid is threaded all the way through and is lying flat against the candy box, fold the little dog's ear tabs back out into their original position."
    },
    {
      "headline":"Carefully close the card.",
      "description":"Your Valentine candy pop-up box is ready to send to a loved one."
    }
  ],
  "text":" Click on the images shown in this step to get the images for the card. This will enlarge the images. Then print out the candy box's card on a heavy paper, like cardstock or construction paper. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/3\\/38\\/Box1_673.gif\\/460px-Box1_673.gif\",\"bigUrl\":\"\\/images\\/thumb\\/3\\/38\\/Box1_673.gif\\/425px-Box1_673.gif\",\"smallWidth\":460,\"smallHeight\":606,\"bigWidth\":\"425\",\"bigHeight\":\"560\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p><a rel=\\\"nofollow\\\" class=\\\"external free\\\" href=\\\"http:\\/\\/robertsabuda.com\\/popmake\\/popmake_vcandy-step1.asp\\\">http:\\/\\/robertsabuda.com\\/popmake\\/popmake_vcandy-step1.asp<\\/a>\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><\\/div>\"}\n\nPrint out the pop-up pieces of the candy box on the same card. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/3\\/37\\/Box_pieces2_694.gif\",\"bigUrl\":\"\\/images\\/thumb\\/3\\/37\\/Box_pieces2_694.gif\\/433px-Box_pieces2_694.gif\",\"smallWidth\":460,\"smallHeight\":493,\"bigWidth\":\"433\",\"bigHeight\":\"464\",\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p><a rel=\\\"nofollow\\\" class=\\\"external free\\\" href=\\\"http:\\/\\/robertsabuda.com\\/popmake\\/popmake_vcandy-step2.asp\\\">http:\\/\\/robertsabuda.com\\/popmake\\/popmake_vcandy-step2.asp<\\/a>\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/2.5\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><\\/div>\"} Using a ruler as a guide, take the rounded end of a paperclip (or a ballpoint pen that has run out of ink) and press along the dotted line on the center of the card. Go all the way from the top to the bottom of the card. Using a ruler as a guide, take the rounded end of a paper clip (or a ballpoint pen that has run out of ink) and press along the dotted lines of all the pop-up pieces. There are lots of dotted lines on this pop-up so take your time and make sure to press along all of them. Color in the candies with crayons, markers or colored pencils. You might also like to add some glitter or sparkles. Then carefully cut out the card following the solid, black lines. Do not cut out any of the lines of the candy box. Color in the candy box pieces. Do not color on any areas with a big letter. Carefully cut out the candy box pieces following the solid, black lines. Using a small pair of pointed scissors (kids, get an adult to help you with this part), carefully cut out the slot in the top of the candy box lid.  Place a small amount of glue on the area marked \"Glue A.\" Take the other pop-up piece that also has an \"A\" on the tab and press it onto the area marked \"Glue A.\" Make a \"mountain\" fold on the dotted lines of the one, long piece that will be the actual candy box as shown.  Take the far right side of the candy box and fold it all the way over as shown. Fold so that you can see the tab with the big \"B\" on it. Put a small amount of glue on the area marked \"Glue B.\" Fold the \"B\" tab backward so it is aligned \"Glue B\" area. Press the \"B\" tab firmly and let dry.  The candy box should now look like this.  Fold tabs \"C\" and \"D\" up against the sides of the candy box.  Look to see that your candy box now looks like this. Set it aside. Fold the card in half along the center.  Apply a small amount of glue to the areas marked \"Glue C\" and \"Glue D\". Carefully line up the matching tabs on the candy box and press into the glue areas. Let dry. Notice that at the top left side of the candy box there are two small tabs that look like little dog's ears. Fold each tab all the way in towards the center. With the tabs still folded in towards the center, thread the slot on the candy box's lid through. When the lid is threaded all the way through and is lying flat against the candy box, fold the little dog's ear tabs back out into their original position. Carefully close the card. Your Valentine candy pop-up box is ready to send to a loved one.",
  "tyn_model":[
    "glue",
    "candy box",
    "ruler",
    "ballpoint pen",
    "card",
    "construction paper",
    "crayons",
    "markers",
    "colored pencils",
    "pointed scissors"
  ],
  "tyn_section":[

  ]
}