{
  "title":"How to Make Ginger Cherry Apricot and Nut Chocolates",
  "url":"https://www.wikihow.com/Make-Ginger-Cherry-Apricot-and-Nut-Chocolates",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Fruit Chocolates"
  ],
  "parts":[
    {
      "name":"Making the Fondant",
      "steps":[
        {
          "headline":"Make the syrup.",
          "description":"Stir the powdered sugar and water in a saucepan. Heat on a very low heat, stirring constantly until combined."
        },
        {
          "headline":"Turn up the heat to boil the mixture.",
          "description":"Stir until the boiling point is reached. This will be quick, so don't leave it!"
        },
        {
          "headline":"Remove from the heat and allow to cool.",
          "description":"Add the extract of choice and egg white to the cooled mixture. Stir through thoroughly. The fondant should now thicken."
        }
      ]
    },
    {
      "name":"Making the Fondant Shapes",
      "steps":[
        {
          "headline":"Knead the fondant for some time.",
          "description":"It should feel smooth and pliable before using to shape."
        },
        {
          "headline":"Shape the fondant candy.",
          "description":"Work fast, as the fondant will harden quickly during shaping. Break off little bits of the fondant. Roll in the hollow of the hand to form balls or oblong shape. Wrap these balls or oblong shapes around the fruit pieces. If using nuts, flatten a fondant ball with the fingers to create a shape long enough to cover the nuts."
        },
        {
          "headline":"Set each shape on a plate as it is finished, awaiting dipping.",
          "description":""
        }
      ]
    },
    {
      "name":"Transforming into Chocolates",
      "steps":[
        {
          "headline":"Melt the chocolate in a double boiler or in a microwave-proof dish.",
          "description":""
        },
        {
          "headline":"Dip each molded fondant shape into the melted chocolate.",
          "description":"Coat completely."
        },
        {
          "headline":"Transfer to a baking sheet lined with wax or parchment paper.",
          "description":"Allow to harden."
        },
        {
          "headline":"Serve.",
          "description":"Arrange on a candy dish for serving."
        }
      ]
    }
  ],
  "text":" Making the Fondant Make the syrup. Stir the powdered sugar and water in a saucepan. Heat on a very low heat, stirring constantly until combined. Turn up the heat to boil the mixture. Stir until the boiling point is reached. This will be quick, so don't leave it! Remove from the heat and allow to cool. Add the extract of choice and egg white to the cooled mixture. Stir through thoroughly. The fondant should now thicken. Making the Fondant Shapes Knead the fondant for some time. It should feel smooth and pliable before using to shape. Shape the fondant candy. Work fast, as the fondant will harden quickly during shaping. Break off little bits of the fondant. Roll in the hollow of the hand to form balls or oblong shape. Wrap these balls or oblong shapes around the fruit pieces. If using nuts, flatten a fondant ball with the fingers to create a shape long enough to cover the nuts. Set each shape on a plate as it is finished, awaiting dipping.  Transforming into Chocolates Melt the chocolate in a double boiler or in a microwave-proof dish.  Dip each molded fondant shape into the melted chocolate. Coat completely. Transfer to a baking sheet lined with wax or parchment paper. Allow to harden. Serve. Arrange on a candy dish for serving.",
  "tyn_model":[
    "chocolate",
    "powdered sugar",
    "water",
    "saucepan",
    "egg white",
    "fondant candy",
    "fondant",
    "nuts",
    "fondant ball",
    "plate",
    "double boiler",
    "microwave-proof dish",
    "baking sheet",
    "wax or parchment paper",
    "candy dish"
  ],
  "tyn_section":[

  ]
}