{
  "title":"How to Make Vassar Fudge",
  "url":"https://www.wikihow.com/Make-Vassar-Fudge",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Fudge"
  ],
  "parts":[
    {
      "name":"Cooking the ingredients",
      "steps":[
        {
          "headline":"Put the sugar and cream into a heavy-based saucepan.",
          "description":"Place on medium heat."
        },
        {
          "headline":"Put the chocolate morsels into the saucepan.",
          "description":"When the sugar and cream heat up, add the pieces of chocolate."
        },
        {
          "headline":"Stir well and constantly until the sugar dissolves.",
          "description":"Once the sugar dissolves and the chocolate melts, stop stirring."
        },
        {
          "headline":"Bring to boil.",
          "description":"The mixture should reach 238ºF using a candy thermometer. Alternatively, test by dropping a few drops into cold water; if they form a soft ball, the mixture is ready. Add the butter and remove from the heat."
        }
      ]
    },
    {
      "name":"Stirring the fudge",
      "steps":[
        {
          "headline":"Allow to cool slightly.",
          "description":"Beat until the mixture begins to harden."
        },
        {
          "headline":"Pour into buttered tins/pans (or line with baking/parchment paper).",
          "description":""
        }
      ]
    },
    {
      "name":"Cutting the fudge",
      "steps":[
        {
          "headline":"When cool but not yet completely firm, cut the fudge.",
          "description":"The old recipes suggests diamond-shaped pieces but squares or rectangles are just as tasty. Arrange on a pretty plate or candy dish to serve. If giving as a gift, line a box with grease-proof paper, and place the fudge inside. Top with another piece of greaseproof paper, then add the lid."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Cooking the ingredients Put the sugar and cream into a heavy-based saucepan. Place on medium heat. Put the chocolate morsels into the saucepan. When the sugar and cream heat up, add the pieces of chocolate. Stir well and constantly until the sugar dissolves. Once the sugar dissolves and the chocolate melts, stop stirring. Bring to boil. The mixture should reach 238ºF using a candy thermometer. Alternatively, test by dropping a few drops into cold water; if they form a soft ball, the mixture is ready. Add the butter and remove from the heat. Stirring the fudge Allow to cool slightly. Beat until the mixture begins to harden. Pour into buttered tins/pans (or line with baking/parchment paper).  Cutting the fudge When cool but not yet completely firm, cut the fudge. The old recipes suggests diamond-shaped pieces but squares or rectangles are just as tasty. Arrange on a pretty plate or candy dish to serve. If giving as a gift, line a box with grease-proof paper, and place the fudge inside. Top with another piece of greaseproof paper, then add the lid. Finished. ",
  "tyn_model":[
    "sugar",
    "chocolate",
    "cream",
    "heavy-based saucepan",
    "saucepan",
    "candy thermometer",
    "water",
    "butter",
    "buttered tins",
    "baking/parchment paper",
    "candy dish",
    "greaseproof paper"
  ],
  "tyn_section":[

  ]
}