{
  "title":"How to Get Space Back on Memory Stick Duo for PSP",
  "url":"https://www.wikihow.com/Get-Space-Back-on-Memory-Stick-Duo-for-PSP",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PSP"
  ],
  "steps":[
    {
      "headline":"Open \"My Computer.\"",
      "description":""
    },
    {
      "headline":"Connect PSP to Computer Via USB.",
      "description":""
    },
    {
      "headline":"Go to Settings>USB Connections(PSP)",
      "description":""
    },
    {
      "headline":"Press X and watch the Computer screen and open the newly popped up icon.",
      "description":"(that's your PSP)"
    },
    {
      "headline":"Find your movies,SavedData,Photos,and music,then take it all and copy it onto your desktop!",
      "description":"Next go back to the My Computer and reopen the icon mentioned in"
    },
    {
      "headline":"Go back on your PSP and go to Settings>System Settings>Format Memory Stick",
      "description":""
    },
    {
      "headline":"Press X and ignore the warning unless you have not made a back up folder.",
      "description":""
    },
    {
      "headline":"After you have selected to format your memory stick take your movies,SavedData,Photos,and music and put it back on your PSP in the folders you found them in.",
      "description":""
    },
    {
      "headline":"Grab your PSP and call it a day.",
      "description":""
    }
  ],
  "text":" Open \"My Computer.\"  Connect PSP to Computer Via USB.  Go to Settings>USB Connections(PSP)  Press X and watch the Computer screen and open the newly popped up icon. (that's your PSP) Find your movies,SavedData,Photos,and music,then take it all and copy it onto your desktop! Next go back to the My Computer and reopen the icon mentioned in Go back on your PSP and go to Settings>System Settings>Format Memory Stick  Press X and ignore the warning unless you have not made a back up folder.  After you have selected to format your memory stick take your movies,SavedData,Photos,and music and put it back on your PSP in the folders you found them in.  Grab your PSP and call it a day. ",
  "tyn_model":[
    "psp",
    "music",
    "photos",
    "computer",
    "memory stick"
  ],
  "tyn_section":[

  ]
}