{
  "title":"How to Build a Telephone Remote Control Thermostat",
  "url":"https://www.wikihow.com/Build-a-Telephone-Remote-Control-Thermostat",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling"
  ],
  "steps":[
    {
      "headline":"Connect the appliance pigtail to the coil of the relay.",
      "description":"Plug it into a wall outlet to test the moving points of the relay."
    },
    {
      "headline":"Find a good place for the relay near the furnace and adjacent to a 110 volt outlet",
      "description":""
    },
    {
      "headline":"Plug in the appliance module into the 110-volt outlet.",
      "description":""
    },
    {
      "headline":"Install the simple thermostat next to the existing thermostat and pull red/white wire to relay location.",
      "description":""
    },
    {
      "headline":"Cut the existing thermostat wire to the furnace, hook the end of the wire going to the furnace to the moving points of the DPDT Relay.",
      "description":""
    },
    {
      "headline":"Connect the other end of the wire you cut (this is the wire that goes to the existing thermostat) to the points of the DPDT relay that connect to the moving points when the relay has no power applied to the coil.",
      "description":""
    },
    {
      "headline":"Connect the new thermostat to the points on the DPDT relay that will connect to the moving points when power is applied to the coil of the relay.",
      "description":""
    },
    {
      "headline":"Plug in the pigtail to the appliance module.",
      "description":""
    },
    {
      "headline":"Install the X-10 Touchtone controller by plugging it into a 110-volt outlet, adjacent to an existing RJ-11 phone jack.",
      "description":""
    },
    {
      "headline":"Test the system by calling on cell phone.",
      "description":""
    }
  ],
  "text":" Connect the appliance pigtail to the coil of the relay. Plug it into a wall outlet to test the moving points of the relay. Find a good place for the relay near the furnace and adjacent to a 110 volt outlet  Plug in the appliance module into the 110-volt outlet.  Install the simple thermostat next to the existing thermostat and pull red/white wire to relay location.  Cut the existing thermostat wire to the furnace, hook the end of the wire going to the furnace to the moving points of the DPDT Relay.  Connect the other end of the wire you cut (this is the wire that goes to the existing thermostat) to the points of the DPDT relay that connect to the moving points when the relay has no power applied to the coil.  Connect the new thermostat to the points on the DPDT relay that will connect to the moving points when power is applied to the coil of the relay.  Plug in the pigtail to the appliance module.  Install the X-10 Touchtone controller by plugging it into a 110-volt outlet, adjacent to an existing RJ-11 phone jack.  Test the system by calling on cell phone. ",
  "tyn_model":[
    "furnace",
    "110-volt outlet",
    "110 volt outlet",
    "appliance module",
    "thermostat"
  ],
  "tyn_section":[

  ]
}