{
  "title":"How to Succeed in First‐Person Shooter Games",
  "url":"https://www.wikihow.com/Succeed-in-First%E2%80%90Person-Shooter-Games",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "PC First Person Shooter"
  ],
  "parts":[
    {
      "name":"Having the Right Gaming Gear",
      "steps":[
        {
          "headline":"Have a good computer.",
          "description":"It's hard to play games with a slow and outdated computer. Upgrade to a good one, or build your own for the best customized results."
        },
        {
          "headline":"Buy a mouse that's \"easy to use\".",
          "description":"It should be sensitive and fit in your hand with ease. If you lag often, lower the quality."
        },
        {
          "headline":"Have decent broadband, with a fast connection.",
          "description":"You'll also be best with unlimited."
        }
      ]
    },
    {
      "name":"Being Game Ready",
      "steps":[
        {
          "headline":"Know your weapons.",
          "description":"You are not going to survive long in any FPS game if you don't know what a Magnum is. Know how much ammo they come with, how fast they shoot (rate of fire), and if they are close, medium, long or very long range. For help you can ask other players of the game who know the weapons."
        },
        {
          "headline":"Choose weapons according to need:",
          "description":"Sniper Rifle: Range: Far to very far. Damage: Medium to high. Main use: For long range headshots for when a rubber chicken won't do. Weakness: People with automatic weapons. Shotgun:\nRange: Close to medium. Damage:High\nMain use: as a secondary weapon or for when camping, or just when you want to see a dead body. Weakness: Sniper rifle. Pistol:\nRange: Close to far. Damage Low to medium. Main use: As a popular secondary weapon for in-your-face combat. Weakness: Everyone\n\nBazooka, RPG or rocket launcher. Damage: Extremely high. Main use: Anti vehicle and crowd weapon, very inaccurate."
        },
        {
          "headline":"Have the basic shooting tactics down pat.",
          "description":"This is the cheese. every player should know these. After you know your weapons you need to know your basic shooting tactics. When your crosshair is in the middle of enemy body, move it up to just below head level (Enemies shoulders). This does more damage than chest level but less damage than head level. When you get more experienced aim higher (Head level). Another one is to crouch and crawl when necessary. This helps you aim better and make enemies shoot dirt."
        },
        {
          "headline":"Have your sniping skills well honed.",
          "description":"Sniping is an important skill in most FPS games. It is straightforward: look through the scope, aim and fire."
        },
        {
          "headline":"Be vehicle savvy.",
          "description":"Vehicles can transport you faster than running can, provide a weapon and be used as cover. If you think  about this, in the next 5 minutes you will not be kissing someone's bumper."
        },
        {
          "headline":"Know how to do camping.",
          "description":"Camping is the best way to make enemies in almost any FPS game. There are a few exceptions where camping will not work, such as games like Blacklight: Retribution, as you have an x-ray visor so you can see through walls."
        }
      ]
    },
    {
      "name":"Playing the Game",
      "steps":[
        {
          "headline":"Start off at an easy campaign.",
          "description":"Then move on to a harder difficulty. Starting at a hard difficulty won't make you better quickly. If you think you're ready, try playing online."
        },
        {
          "headline":"Choose the smallest map and keep playing in it.",
          "description":"You will know where things are and where enemies spawn."
        },
        {
          "headline":"Choose the weapon that you are good at using.",
          "description":"If you fight up-close, use a shotgun. If you fight from far, use a sniper, make sure you can scope good. If you're not accurate at your shooting, use explosives and support. Assault rifles are highly reliable and standard, if you don't know what gun to use, use the assault rifle. Don't use hand-guns, their weak and have semi-auto fire."
        },
        {
          "headline":"Do not reload if you use a few rounds, only when you're covered.",
          "description":"It will be ideal to reload if you used half of your rounds. You can get killed in the middle of a reload. In some games, Heavy Machine guns have a large clip since the bullets come in a belt. Reloading machine guns can take a while."
        },
        {
          "headline":"Detect enemy positions.",
          "description":"Look at your radar or mini-map if you have them. Listen to any shooting and footsteps. Look for tracer bullets and muzzle flashes. Muzzle flashes are very relevant, even from a distance."
        },
        {
          "headline":"Avoid giving out your position.",
          "description":"Sniper shooting can be very loud. To be very careful, look around for enemies after you kill an enemy or fired your gun. Walk in a crowded area or indoors if you can. Do not go out in the open."
        }
      ]
    }
  ],
  "text":" Having the Right Gaming Gear Have a good computer. It's hard to play games with a slow and outdated computer. Upgrade to a good one, or build your own for the best customized results. Buy a mouse that's \"easy to use\". It should be sensitive and fit in your hand with ease. If you lag often, lower the quality. Have decent broadband, with a fast connection. You'll also be best with unlimited. Being Game Ready Know your weapons. You are not going to survive long in any FPS game if you don't know what a Magnum is. Know how much ammo they come with, how fast they shoot (rate of fire), and if they are close, medium, long or very long range. For help you can ask other players of the game who know the weapons. Choose weapons according to need: Sniper Rifle: Range: Far to very far. Damage: Medium to high. Main use: For long range headshots for when a rubber chicken won't do. Weakness: People with automatic weapons. Shotgun:\nRange: Close to medium. Damage:High\nMain use: as a secondary weapon or for when camping, or just when you want to see a dead body. Weakness: Sniper rifle. Pistol:\nRange: Close to far. Damage Low to medium. Main use: As a popular secondary weapon for in-your-face combat. Weakness: Everyone\n\nBazooka, RPG or rocket launcher. Damage: Extremely high. Main use: Anti vehicle and crowd weapon, very inaccurate. Have the basic shooting tactics down pat. This is the cheese. every player should know these. After you know your weapons you need to know your basic shooting tactics. When your crosshair is in the middle of enemy body, move it up to just below head level (Enemies shoulders). This does more damage than chest level but less damage than head level. When you get more experienced aim higher (Head level). Another one is to crouch and crawl when necessary. This helps you aim better and make enemies shoot dirt. Have your sniping skills well honed. Sniping is an important skill in most FPS games. It is straightforward: look through the scope, aim and fire. Be vehicle savvy. Vehicles can transport you faster than running can, provide a weapon and be used as cover. If you think  about this, in the next 5 minutes you will not be kissing someone's bumper. Know how to do camping. Camping is the best way to make enemies in almost any FPS game. There are a few exceptions where camping will not work, such as games like Blacklight: Retribution, as you have an x-ray visor so you can see through walls. Playing the Game Start off at an easy campaign. Then move on to a harder difficulty. Starting at a hard difficulty won't make you better quickly. If you think you're ready, try playing online. Choose the smallest map and keep playing in it. You will know where things are and where enemies spawn. Choose the weapon that you are good at using. If you fight up-close, use a shotgun. If you fight from far, use a sniper, make sure you can scope good. If you're not accurate at your shooting, use explosives and support. Assault rifles are highly reliable and standard, if you don't know what gun to use, use the assault rifle. Don't use hand-guns, their weak and have semi-auto fire. Do not reload if you use a few rounds, only when you're covered. It will be ideal to reload if you used half of your rounds. You can get killed in the middle of a reload. In some games, Heavy Machine guns have a large clip since the bullets come in a belt. Reloading machine guns can take a while. Detect enemy positions. Look at your radar or mini-map if you have them. Listen to any shooting and footsteps. Look for tracer bullets and muzzle flashes. Muzzle flashes are very relevant, even from a distance. Avoid giving out your position. Sniper shooting can be very loud. To be very careful, look around for enemies after you kill an enemy or fired your gun. Walk in a crowded area or indoors if you can. Do not go out in the open.",
  "tyn_model":[
    "computer",
    "weapons",
    "sniper rifle",
    "shotgun",
    "mouse",
    "magnum",
    "rubber chicken",
    "pistol",
    "bazooka",
    "rocket launcher",
    "scope",
    "vehicles",
    "x-ray visor",
    "sniper",
    "explosives",
    "assault rifles",
    "assault rifle",
    "guns",
    "machine guns"
  ],
  "tyn_section":[

  ]
}