{
  "title":"How to Make Roze Koek",
  "url":"https://www.wikihow.com/Make-Roze-Koek",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Pastries"
  ],
  "steps":[
    {
      "headline":"Make the fondant first.",
      "description":""
    },
    {
      "headline":"In a small bowl, add a quarter cup of your water to the gelatine.",
      "description":"Agitate the mixture using a chopstick until it is semisolid and can be picked up without falling apart."
    },
    {
      "headline":"Add the gelatine and water mixture to a small saucepan over medium heat.",
      "description":""
    },
    {
      "headline":"Once the gelatine and water turns back into a liquid mixture, add the corn syrup or glucose.",
      "description":"Stir the mixture and add the vegetable shortening."
    },
    {
      "headline":"Still over medium heat, stir mixture until the shortening is almost completely dissolved.",
      "description":"At this point, there should still be a few white spots of semisolid shortening."
    },
    {
      "headline":"Remove from the heat and add the vegetable oil.",
      "description":"Stir well and set aside."
    },
    {
      "headline":"In a large mixing bowl, add eight cups of powdered sugar and make a well by flattening the top layer of sugar our using an offset spatula or your hands and then making a hole in the middle.",
      "description":""
    },
    {
      "headline":"Add the gelatine mixture to the well.",
      "description":""
    },
    {
      "headline":"Using a large spoon, mix until the gelatine mixture has lost most of its stickiness, incorporating as much of the powdered sugar as possible.",
      "description":""
    },
    {
      "headline":"Add the red food coloring gradually until a rosy pink color is achieved.",
      "description":""
    },
    {
      "headline":"Add one teaspoon of vanilla extract and all of the raspberry extract and mix well.",
      "description":""
    },
    {
      "headline":"Set aside and begin to make the sponge cake.",
      "description":""
    },
    {
      "headline":"SPONGE CAKE: Mix the egg yolks and 2/3 cups of the granulated sugar and mix on high speed until the egg mixture is a creamy, light-banana color.",
      "description":""
    },
    {
      "headline":"Lower the speed of the mixer.",
      "description":""
    },
    {
      "headline":"Add the remaining vanilla extract and all of the lemon juice.",
      "description":""
    },
    {
      "headline":"Set aside.",
      "description":""
    },
    {
      "headline":"In another bowl, mix the egg whites on medium-high speed until soft peaks form.",
      "description":"Add the cream of tartar and remaining granulated sugar."
    },
    {
      "headline":"Mix on high speed until shiny, stiff peaks form.",
      "description":"Add the water and beat at medium speed for ninety seconds."
    },
    {
      "headline":"Set aside.",
      "description":""
    },
    {
      "headline":"In a separate bowl, mix the salt, flour, and baking powder using a sifter or whisk.",
      "description":""
    },
    {
      "headline":"Gradually sift this dry mixture over the egg yolks, stirring at intervals to incorporate the dry ingredients.",
      "description":"Ensure not to be too aggressive in this step, as precautions must be taken to ensure that the yolks do not deflate."
    },
    {
      "headline":"Using a tempering technique, add the egg yolk mixture to the whites, stirring in the same manner as you did with the flower mixture.",
      "description":""
    },
    {
      "headline":"Pour into an ungreased pan and bake for about a half hour at 350 °F (177 °C)",
      "description":""
    },
    {
      "headline":"After the cake has baked, roll out the fondant (the fondant will be very tough- you may want to utilize your electric mixer's dough hook attachment to tenderize it) until it is long and wide enough to cover the cake.",
      "description":"This will most likely result in a very thick fondant layer. If you do not wish to have such a layer, roll to desired thickness and store the rest at room temperature in an airtight Ziploc bag."
    },
    {
      "headline":"Drape the fondant over the cake.",
      "description":""
    },
    {
      "headline":"You are finished!",
      "description":"Enjoy your Roze Koek!"
    }
  ],
  "text":" Make the fondant first.  In a small bowl, add a quarter cup of your water to the gelatine. Agitate the mixture using a chopstick until it is semisolid and can be picked up without falling apart. Add the gelatine and water mixture to a small saucepan over medium heat.  Once the gelatine and water turns back into a liquid mixture, add the corn syrup or glucose. Stir the mixture and add the vegetable shortening. Still over medium heat, stir mixture until the shortening is almost completely dissolved. At this point, there should still be a few white spots of semisolid shortening. Remove from the heat and add the vegetable oil. Stir well and set aside. In a large mixing bowl, add eight cups of powdered sugar and make a well by flattening the top layer of sugar our using an offset spatula or your hands and then making a hole in the middle.  Add the gelatine mixture to the well.  Using a large spoon, mix until the gelatine mixture has lost most of its stickiness, incorporating as much of the powdered sugar as possible.  Add the red food coloring gradually until a rosy pink color is achieved.  Add one teaspoon of vanilla extract and all of the raspberry extract and mix well.  Set aside and begin to make the sponge cake.  SPONGE CAKE: Mix the egg yolks and 2/3 cups of the granulated sugar and mix on high speed until the egg mixture is a creamy, light-banana color.  Lower the speed of the mixer.  Add the remaining vanilla extract and all of the lemon juice.  Set aside.  In another bowl, mix the egg whites on medium-high speed until soft peaks form. Add the cream of tartar and remaining granulated sugar. Mix on high speed until shiny, stiff peaks form. Add the water and beat at medium speed for ninety seconds. Set aside.  In a separate bowl, mix the salt, flour, and baking powder using a sifter or whisk.  Gradually sift this dry mixture over the egg yolks, stirring at intervals to incorporate the dry ingredients. Ensure not to be too aggressive in this step, as precautions must be taken to ensure that the yolks do not deflate. Using a tempering technique, add the egg yolk mixture to the whites, stirring in the same manner as you did with the flower mixture.  Pour into an ungreased pan and bake for about a half hour at 350 °F (177 °C)  After the cake has baked, roll out the fondant (the fondant will be very tough- you may want to utilize your electric mixer's dough hook attachment to tenderize it) until it is long and wide enough to cover the cake. This will most likely result in a very thick fondant layer. If you do not wish to have such a layer, roll to desired thickness and store the rest at room temperature in an airtight Ziploc bag. Drape the fondant over the cake.  You are finished! Enjoy your Roze Koek!",
  "tyn_model":[
    "fondant",
    "water",
    "gelatine",
    "powdered sugar",
    "vanilla extract",
    "granulated sugar",
    "small bowl",
    "small saucepan",
    "corn syrup",
    "glucose",
    "vegetable shortening",
    "vegetable oil",
    "large mixing bowl",
    "sugar",
    "spatula",
    "large spoon",
    "red food coloring",
    "raspberry extract",
    "sponge cake",
    "mixer",
    "lemon juice",
    "bowl",
    "cream of tartar",
    "salt",
    "flour",
    "baking powder",
    "sifter or whisk",
    "egg yolk",
    "electric mixer",
    "ziploc bag",
    "roze koek"
  ],
  "tyn_section":[

  ]
}