{
  "title":"How to Make a Fire Starter",
  "url":"https://www.wikihow.com/Make-a-Fire-Starter",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling",
    "Fire",
    "Fire Making"
  ],
  "methods":[
    {
      "name":"Using a Paper Egg Carton and Dryer Lint",
      "steps":[
        {
          "headline":"Stuff your egg carton with dryer lint.",
          "description":"Remove some lint from your dryer's lint trap and stuff a ball into each depression of the egg carton. Make sure you don't stuff the holes too tight—the wax must be able to penetrate the lint to burn properly. Use an egg carton made from pressed paper as opposed to Styrofoam or other materials. If you don't want to use your hands, scrape the dryer lint from the side of the lint trap with the edge of a butter knife."
        },
        {
          "headline":"Melt old candle wax or broken crayons using a double boiler.",
          "description":"Start by filling the bottom pot with water. Afterward, place the second pot over the first, put your wax into the top pot, and place your double boiler onto your stove. Turn the heat to high and wait for your wax to melt. Leave the top pot with the wax uncovered. Purchase paraffin wax or beeswax for a more expensive alternative. You can also|make a double boiler by placing your wax in a soup can or mason jar and then putting the jar into a pot of boiling water. Just make sure that water doesn't pass the top edge of the wax container."
        },
        {
          "headline":"Pour the melted wax on top of the pieces of dryer lint.",
          "description":"Place your egg carton onto a piece of wax paper, foil, or cardboard to catch excess wax. Now, gently pour the wax into your egg carton, taking care to cover each piece of dryer lint. Always start by adding a small amount of wax over the top of each piece of lint to ensure that you have enough to cover all of them. Use a towel or hot pad to hold the pot or container of wax."
        },
        {
          "headline":"Let your lint fire starters cool for 45 minutes.",
          "description":"Give your wax time to cool—about 45 minutes or until your lint balls are hardened. To check if they've hardened, touch them gently with your finger. Don't skip this step or you won't be able to cut your fire starters!"
        },
        {
          "headline":"Remove the lint balls from the egg carton.",
          "description":"After the lint balls have cooled, remove gently pull them from the carton. Take care not to break any of the wax covering them. If you notice any lint balls with less wax than the others, put them back in the carton and add some more."
        },
        {
          "headline":"Store your lint balls as is or cut them into smaller pieces.",
          "description":"Once your lint fire starters have cooled and removed from the carton you're ready to store them. If you'd like, cut them into smaller sizes with a pair of scissors. Possible storage areas include a car kit, camping kit, and emergency kit—anything with matches! Place a lint ball underneath some kindling and light it with a match or lighter to get your fire going."
        }
      ]
    },
    {
      "name":"Dipping Pinecones in Wax",
      "steps":[
        {
          "headline":"Find a collection 8 to 10 dried pinecones.",
          "description":"Head to the local park or forest and start collecting! Try to get a mix of both large and small pinecones to give yourself a variety of firestarters. Never select wet pinecones or any covered in dirt or wax."
        },
        {
          "headline":"Attach a rope wick or twine to the bottom of each pinecone with hot glue.",
          "description":"Start by applying a dot of hot glue to the bottom of the pinecone with a glue gun. Now, place the tip of the rope wick into the glue and hold it in place until the glue dries. Repeat on each pinecone you want to turn into a fire starter. Make sure the glue gun's nozzle is free of residue before using it. Squeeze the trigger of the glue gun lightly when applying your glue."
        },
        {
          "headline":"Wrap the rope wick around each pinecone.",
          "description":"Start wrapping the wick around the pinecone from the bottom to the top. Take care to weave it between each layer of the cone. Afterward, attach the end of the wick to the top of the pinecone with a dab of glue, but leave 3 to 4 inches (7.6 to 10.2 cm) of the wick between the free end to the point where it attaches to the pinecone. The free end of the wick is where you'll light your fire starter. Repeat the process as many times as desired."
        },
        {
          "headline":"Melt wax and scent cubes or essential oils in a double boiler.",
          "description":"Start by filling the bottom pot with water. Afterward, place your wax into the top pot, cover the bottom pot with the top one, and place your double boiler onto your stove. Turn the heat to high. Now, stir the wax every minute or so until it melts. If you'd like, add some scent cubes or essential oils for a nice smell. Leave the lid off the top pot that holds the wax. You can also make a double boiler by putting your wax in a soup can or mason jar and then placing this jar into a pot of boiling water. Just make sure the water isn't high enough to get into the can or jar."
        },
        {
          "headline":"Dip your pinecones into the wax.",
          "description":"Pour the wax into a deep, heat-safe bowl or leave it in the pot. Now, hold each pinecone by the wick and dip them into the wax. Continue dipping each one 5 to 6 times until the coating is thick. Be careful not to burn yourself on the pot if you don’t use a heat-safe bowl."
        },
        {
          "headline":"Dry your pinecones for 2 hours, then store them.",
          "description":"Let your pinecones dry on a plate in a room temperature area for about 2 hours. Afterward, store them in a container or basket until you need them! Repeat this process for as many pinecones as you'd like. Place a pinecone fire starter underneath some kindling and light it with a match or lighter."
        }
      ]
    },
    {
      "name":"Soaking Wine Corks in Rubbing Alcohol",
      "steps":[
        {
          "headline":"Fill a glass jar with wine corks.",
          "description":"Place as many corks as you can into the jar. Just make sure to drop them in—don't stuff them—to make it easy to remove them when you need to. Use a glass jar of any size. Just make sure it has enough room for your wine corks!"
        },
        {
          "headline":"Pour rubbing alcohol to the top of the jar and seal it.",
          "description":"Gently and slowly pour the alcohol into the jar. Continue until there's about ⁄2 inch (1.3 cm) between the top of the alcohol and the rim. Afterward, place the lid on the jar and tighten it. Use 99% rubbing alcohol for best results."
        },
        {
          "headline":"Let the jar sit for 24 hours before using the fire starters.",
          "description":"This will give the corks time to soak up the alcohol. After waiting 24 hours you're free to use them whenever you want! Remove a cork with a spoon and throw it into a small fire to keep it burning."
        }
      ]
    },
    {
      "name":"Kneading Cotton Balls in Petroleum Jelly",
      "steps":[
        {
          "headline":"Add 12 ounces (340 g) of petroleum jelly into a resealable bag.",
          "description":"Head to a big-box store or online supplier and purchase 100% petroleum jelly. Afterward, scoop 12 ounces (340 g) into a resealable bag. Get as much petroleum jelly as you can so you don't run out. If you have extra, you can use it for the next batch! Purchase a 12 ounce (340 g) metal scoop for your jelly."
        },
        {
          "headline":"Put some cotton balls into the bag and seal it.",
          "description":"Drop your cotton balls into the resealable bag with the petroleum jelly. Afterward, seal it tightly with as little air as possible. Push out any air bubbles before sealing the bag."
        },
        {
          "headline":"Knead your petroleum jelly and cotton balls together.",
          "description":"Kneading is the process of working squeezing, crushing, and pulling your ingredients together. Keep kneading them until they turn into a jelly. Use jumbo-sized 100% cotton balls, as artificial fibers won't light on fire. Try to soak the cotton balls without completely saturating them by leaving some dry fibers in the middle to catch the flame."
        },
        {
          "headline":"Expose the dry fibers and light them to use your fire starters.",
          "description":"When you're ready to use your fire starters, pull your cotton ball apart to reveal the dry fibers. Now, light them with a firesteel, match, or lighter. Use toothpicks to open your cotton balls if you don't want to get your hands messy."
        }
      ]
    }
  ],
  "text":" Using a Paper Egg Carton and Dryer Lint Stuff your egg carton with dryer lint. Remove some lint from your dryer's lint trap and stuff a ball into each depression of the egg carton. Make sure you don't stuff the holes too tight—the wax must be able to penetrate the lint to burn properly. Use an egg carton made from pressed paper as opposed to Styrofoam or other materials. If you don't want to use your hands, scrape the dryer lint from the side of the lint trap with the edge of a butter knife. Melt old candle wax or broken crayons using a double boiler. Start by filling the bottom pot with water. Afterward, place the second pot over the first, put your wax into the top pot, and place your double boiler onto your stove. Turn the heat to high and wait for your wax to melt. Leave the top pot with the wax uncovered. Purchase paraffin wax or beeswax for a more expensive alternative. You can also|make a double boiler by placing your wax in a soup can or mason jar and then putting the jar into a pot of boiling water. Just make sure that water doesn't pass the top edge of the wax container. Pour the melted wax on top of the pieces of dryer lint. Place your egg carton onto a piece of wax paper, foil, or cardboard to catch excess wax. Now, gently pour the wax into your egg carton, taking care to cover each piece of dryer lint. Always start by adding a small amount of wax over the top of each piece of lint to ensure that you have enough to cover all of them. Use a towel or hot pad to hold the pot or container of wax. Let your lint fire starters cool for 45 minutes. Give your wax time to cool—about 45 minutes or until your lint balls are hardened. To check if they've hardened, touch them gently with your finger. Don't skip this step or you won't be able to cut your fire starters! Remove the lint balls from the egg carton. After the lint balls have cooled, remove gently pull them from the carton. Take care not to break any of the wax covering them. If you notice any lint balls with less wax than the others, put them back in the carton and add some more. Store your lint balls as is or cut them into smaller pieces. Once your lint fire starters have cooled and removed from the carton you're ready to store them. If you'd like, cut them into smaller sizes with a pair of scissors. Possible storage areas include a car kit, camping kit, and emergency kit—anything with matches! Place a lint ball underneath some kindling and light it with a match or lighter to get your fire going. Dipping Pinecones in Wax Find a collection 8 to 10 dried pinecones. Head to the local park or forest and start collecting! Try to get a mix of both large and small pinecones to give yourself a variety of firestarters. Never select wet pinecones or any covered in dirt or wax. Attach a rope wick or twine to the bottom of each pinecone with hot glue. Start by applying a dot of hot glue to the bottom of the pinecone with a glue gun. Now, place the tip of the rope wick into the glue and hold it in place until the glue dries. Repeat on each pinecone you want to turn into a fire starter. Make sure the glue gun's nozzle is free of residue before using it. Squeeze the trigger of the glue gun lightly when applying your glue. Wrap the rope wick around each pinecone. Start wrapping the wick around the pinecone from the bottom to the top. Take care to weave it between each layer of the cone. Afterward, attach the end of the wick to the top of the pinecone with a dab of glue, but leave 3 to 4 inches (7.6 to 10.2 cm) of the wick between the free end to the point where it attaches to the pinecone. The free end of the wick is where you'll light your fire starter. Repeat the process as many times as desired. Melt wax and scent cubes or essential oils in a double boiler. Start by filling the bottom pot with water. Afterward, place your wax into the top pot, cover the bottom pot with the top one, and place your double boiler onto your stove. Turn the heat to high. Now, stir the wax every minute or so until it melts. If you'd like, add some scent cubes or essential oils for a nice smell. Leave the lid off the top pot that holds the wax. You can also make a double boiler by putting your wax in a soup can or mason jar and then placing this jar into a pot of boiling water. Just make sure the water isn't high enough to get into the can or jar. Dip your pinecones into the wax. Pour the wax into a deep, heat-safe bowl or leave it in the pot. Now, hold each pinecone by the wick and dip them into the wax. Continue dipping each one 5 to 6 times until the coating is thick. Be careful not to burn yourself on the pot if you don’t use a heat-safe bowl. Dry your pinecones for 2 hours, then store them. Let your pinecones dry on a plate in a room temperature area for about 2 hours. Afterward, store them in a container or basket until you need them! Repeat this process for as many pinecones as you'd like. Place a pinecone fire starter underneath some kindling and light it with a match or lighter. Soaking Wine Corks in Rubbing Alcohol Fill a glass jar with wine corks. Place as many corks as you can into the jar. Just make sure to drop them in—don't stuff them—to make it easy to remove them when you need to. Use a glass jar of any size. Just make sure it has enough room for your wine corks! Pour rubbing alcohol to the top of the jar and seal it. Gently and slowly pour the alcohol into the jar. Continue until there's about ⁄2 inch (1.3 cm) between the top of the alcohol and the rim. Afterward, place the lid on the jar and tighten it. Use 99% rubbing alcohol for best results. Let the jar sit for 24 hours before using the fire starters. This will give the corks time to soak up the alcohol. After waiting 24 hours you're free to use them whenever you want! Remove a cork with a spoon and throw it into a small fire to keep it burning. Kneading Cotton Balls in Petroleum Jelly Add 12 ounces (340 g) of petroleum jelly into a resealable bag. Head to a big-box store or online supplier and purchase 100% petroleum jelly. Afterward, scoop 12 ounces (340 g) into a resealable bag. Get as much petroleum jelly as you can so you don't run out. If you have extra, you can use it for the next batch! Purchase a 12 ounce (340 g) metal scoop for your jelly. Put some cotton balls into the bag and seal it. Drop your cotton balls into the resealable bag with the petroleum jelly. Afterward, seal it tightly with as little air as possible. Push out any air bubbles before sealing the bag. Knead your petroleum jelly and cotton balls together. Kneading is the process of working squeezing, crushing, and pulling your ingredients together. Keep kneading them until they turn into a jelly. Use jumbo-sized 100% cotton balls, as artificial fibers won't light on fire. Try to soak the cotton balls without completely saturating them by leaving some dry fibers in the middle to catch the flame. Expose the dry fibers and light them to use your fire starters. When you're ready to use your fire starters, pull your cotton ball apart to reveal the dry fibers. Now, light them with a firesteel, match, or lighter. Use toothpicks to open your cotton balls if you don't want to get your hands messy.",
  "tyn_model":[
    "wax",
    "double boiler",
    "water",
    "petroleum jelly",
    "egg carton",
    "glue",
    "cotton balls",
    "match",
    "pinecones",
    "rope wick",
    "glue gun",
    "wine corks",
    "rubbing alcohol",
    "fire starters",
    "resealable bag",
    "dryer lint",
    "stove",
    "hot glue",
    "fire starter",
    "scent cubes",
    "essential oils",
    "bowl",
    "pot",
    "glass jar",
    "alcohol",
    "dryer's",
    "—the",
    "butter knife",
    "crayons",
    "paraffin wax",
    "soup can or mason jar",
    "wax paper",
    "foil",
    "cardboard",
    "hot pad",
    "—about",
    "scissors",
    "—anything",
    "lint ball",
    "twine",
    "soup can",
    "mason jar",
    "plate",
    "pinecone fire starter",
    "kindling",
    "—don't",
    "—to",
    "spoon",
    "kneading",
    "cotton ball",
    "firesteel,",
    "lighter"
  ],
  "tyn_section":[

  ]
}