{
  "title":"How to Make Butterbeer",
  "url":"https://www.wikihow.com/Make-Butterbeer",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Sodas and Fizzy Drinks"
  ],
  "methods":[
    {
      "name":"Making Frozen Butterbeer",
      "steps":[
        {
          "headline":"Mix the cream, butter, sugar and spices together.",
          "description":""
        },
        {
          "headline":"Beat in the vanilla ice cream until the combination is thoroughly mixed.",
          "description":""
        },
        {
          "headline":"Re-freeze the mixture.",
          "description":"Place it in the freezer until it's firm."
        },
        {
          "headline":"Scoop out the frozen mixture into a glass.",
          "description":""
        },
        {
          "headline":"Pour hot Apple cider over the ice cream mixture.",
          "description":""
        }
      ]
    },
    {
      "name":"Making Hot Butterbeer",
      "steps":[
        {
          "headline":"Melt the butter in a saucepan.",
          "description":""
        },
        {
          "headline":"Mix in the butterscotch.",
          "description":""
        },
        {
          "headline":"Pour the mixture into a large bowl.",
          "description":""
        },
        {
          "headline":"Carefully add the club soda.",
          "description":""
        },
        {
          "headline":"Ladle the butterbeer into serving glasses.",
          "description":""
        }
      ]
    },
    {
      "name":"Making Fancy Butterbeer",
      "steps":[
        {
          "headline":"Boil the sugar and water.",
          "description":"Place a saucepan over medium heat. Add the sugar and water and bring them to a boil. Stir the mixture until the temperature reaches 240 degrees. Check the temperature frequently with a candy thermometer."
        },
        {
          "headline":"Stir in the butter, salt, and 1/4 cup of cream.",
          "description":""
        },
        {
          "headline":"Set the mixture aside to cool.",
          "description":""
        },
        {
          "headline":"Stir in the rum once the mixture has cooled.",
          "description":""
        },
        {
          "headline":"Beat 2 tablespoons of the cooled mixture with the remaining cream.",
          "description":"Transfer the remaining cream to a mixing bowl. Measure out 2 tablespoons of the cooled mixture, and add it to the cream. Beat together until the cream is fluffy and whipped."
        },
        {
          "headline":"Pour equal parts of the caramel butter mixture into four glasses.",
          "description":""
        },
        {
          "headline":"Top the glasses off with cream soda and stir.",
          "description":""
        },
        {
          "headline":"Add whipped cream.",
          "description":""
        }
      ]
    },
    {
      "name":"Making Cold Butter Beer For Children",
      "steps":[
        {
          "headline":"Stir butter with cinnamon, white sugar, and vanilla extract in a mixing bowl.",
          "description":""
        },
        {
          "headline":"Blend that mixture with vanilla ice cream, apple cider, and cream soda in a blender.",
          "description":""
        },
        {
          "headline":"Pour into glasses and top with whipped cream and caramel.",
          "description":"This will make a tasty treat of 6 servings."
        }
      ]
    }
  ],
  "text":" Making Frozen Butterbeer Mix the cream, butter, sugar and spices together.  Beat in the vanilla ice cream until the combination is thoroughly mixed.  Re-freeze the mixture. Place it in the freezer until it's firm. Scoop out the frozen mixture into a glass.  Pour hot Apple cider over the ice cream mixture.  Making Hot Butterbeer Melt the butter in a saucepan.  Mix in the butterscotch.  Pour the mixture into a large bowl.  Carefully add the club soda.  Ladle the butterbeer into serving glasses.  Making Fancy Butterbeer Boil the sugar and water. Place a saucepan over medium heat. Add the sugar and water and bring them to a boil. Stir the mixture until the temperature reaches 240 degrees. Check the temperature frequently with a candy thermometer. Stir in the butter, salt, and 1/4 cup of cream.  Set the mixture aside to cool.  Stir in the rum once the mixture has cooled.  Beat 2 tablespoons of the cooled mixture with the remaining cream. Transfer the remaining cream to a mixing bowl. Measure out 2 tablespoons of the cooled mixture, and add it to the cream. Beat together until the cream is fluffy and whipped. Pour equal parts of the caramel butter mixture into four glasses.  Top the glasses off with cream soda and stir.  Add whipped cream.  Making Cold Butter Beer For Children Stir butter with cinnamon, white sugar, and vanilla extract in a mixing bowl.  Blend that mixture with vanilla ice cream, apple cider, and cream soda in a blender.  Pour into glasses and top with whipped cream and caramel. This will make a tasty treat of 6 servings.",
  "tyn_model":[
    "cream",
    "butter",
    "sugar",
    "vanilla ice cream",
    "apple cider",
    "saucepan",
    "water",
    "mixing bowl",
    "cream soda",
    "whipped cream",
    "spices",
    "freezer",
    "glass",
    "ice cream",
    "butterscotch",
    "large bowl",
    "club soda",
    "butterbeer",
    "candy thermometer",
    "salt",
    "rum",
    "caramel butter",
    "cold butter beer",
    "cinnamon",
    "white sugar",
    "vanilla extract",
    "blender",
    "caramel"
  ],
  "tyn_section":[

  ]
}