{
  "title":"How to Make an Impossible Bottle",
  "url":"https://www.wikihow.com/Make-an-Impossible-Bottle",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Glass and Stained Glass Projects",
    "Glass Bottle Projects"
  ],
  "methods":[
    {
      "name":"Impossible Bottle One: Deck of cards in a bottle",
      "steps":[
        {
          "headline":"Remove the plastic wrapper and toss.",
          "description":""
        },
        {
          "headline":"Remove the cards.",
          "description":""
        },
        {
          "headline":"Heat the sticker with a blow dryer.",
          "description":"It will come off easily without tearing."
        },
        {
          "headline":"Using a blow dryer again, or using a sharp hobby knife, slice open the bottom seam of the box so that it can be flattened.",
          "description":""
        },
        {
          "headline":"Insert flattened and rolled up box into the bottle and unflatten.",
          "description":"Using a bent piece of wire or other appropriate tool, reseal the bottom seam with glue. Strong glue dries too fast to allow you to get it in the right place, so use some craft glue and be patient."
        },
        {
          "headline":"Insert one card at a time.",
          "description":""
        },
        {
          "headline":"Close the box and heat the sticker to make it sticky so it can reattach.",
          "description":"Use some more glue if it doesn't get sticky enough."
        }
      ]
    },
    {
      "name":"Impossible Bottle Two: Tennis ball in a bottle",
      "steps":[
        {
          "headline":"Puncture the ball in the fuzzy area (part the fuzz so that the hole doesn't rip out too much of the fuzz, you will comb it back over the hole later).",
          "description":""
        },
        {
          "headline":"Put the ball in a vice and squeeze all the air out of it.",
          "description":""
        },
        {
          "headline":"Seal the hole with a bike pump needle.",
          "description":""
        },
        {
          "headline":"Fold the ball up (or roll it) and poke it into the bottle.",
          "description":""
        },
        {
          "headline":"Turn the bottle upside down so the needle pokes out the neck.",
          "description":"Screw a flexible hose on the end (for pumping up bike tires) and screw the hose onto a bike pump."
        },
        {
          "headline":"Re-inflate the ball and then pull the needle out.",
          "description":""
        },
        {
          "headline":"Disguise the hole by combing over the fuzz and/or putting a drop or two of paint over the hole.",
          "description":"Note that you can seal the hole in the ball with strong glue if it tends to automatically re-inflate itself, then just re-pierce the hole with a skewer once the ball is in the bottle."
        }
      ]
    },
    {
      "name":"Impossible Bottle Three: Rubik's cube in a bottle",
      "steps":[
        {
          "headline":"Disassemble the Rubik's Cube into all 27 parts.",
          "description":""
        },
        {
          "headline":"Reassemble the cube inside bottle.",
          "description":"Note that you'll need a 3 and a quarter inch inner diameter in order to fit the Rubik's Cube together. You'll need to prod and poke each cube into place and it will help to have long-handled tweezers and similar long-handled tools to help apply force."
        }
      ]
    }
  ],
  "text":" Impossible Bottle One: Deck of cards in a bottle Remove the plastic wrapper and toss.  Remove the cards.  Heat the sticker with a blow dryer. It will come off easily without tearing. Using a blow dryer again, or using a sharp hobby knife, slice open the bottom seam of the box so that it can be flattened.  Insert flattened and rolled up box into the bottle and unflatten. Using a bent piece of wire or other appropriate tool, reseal the bottom seam with glue. Strong glue dries too fast to allow you to get it in the right place, so use some craft glue and be patient. Insert one card at a time.  Close the box and heat the sticker to make it sticky so it can reattach. Use some more glue if it doesn't get sticky enough. Impossible Bottle Two: Tennis ball in a bottle Puncture the ball in the fuzzy area (part the fuzz so that the hole doesn't rip out too much of the fuzz, you will comb it back over the hole later).  Put the ball in a vice and squeeze all the air out of it.  Seal the hole with a bike pump needle.  Fold the ball up (or roll it) and poke it into the bottle.  Turn the bottle upside down so the needle pokes out the neck. Screw a flexible hose on the end (for pumping up bike tires) and screw the hose onto a bike pump. Re-inflate the ball and then pull the needle out.  Disguise the hole by combing over the fuzz and/or putting a drop or two of paint over the hole. Note that you can seal the hole in the ball with strong glue if it tends to automatically re-inflate itself, then just re-pierce the hole with a skewer once the ball is in the bottle. Impossible Bottle Three: Rubik's cube in a bottle Disassemble the Rubik's Cube into all 27 parts.  Reassemble the cube inside bottle. Note that you'll need a 3 and a quarter inch inner diameter in order to fit the Rubik's Cube together. You'll need to prod and poke each cube into place and it will help to have long-handled tweezers and similar long-handled tools to help apply force.",
  "tyn_model":[
    "bottle",
    "glue",
    "rubik's cube",
    "blow dryer",
    "craft glue",
    "tennis ball",
    "bike pump needle",
    "flexible hose",
    "bike tires",
    "hose",
    "bike pump",
    "needle",
    "paint",
    "skewer",
    "tweezers"
  ],
  "tyn_section":[

  ]
}