{
  "title":"How to Make Andhra Lemon Rice",
  "url":"https://www.wikihow.com/Make-Andhra-Lemon-Rice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Rice and Beans"
  ],
  "steps":[
    {
      "headline":"Boil the rice in a pot and drain the water.",
      "description":""
    },
    {
      "headline":"Place the rice on a place and add the salt over the rice.",
      "description":""
    },
    {
      "headline":"Chop green chilies into small and round pieces.",
      "description":"Add to the rice."
    },
    {
      "headline":"Sprinkle asafoetida over the rice.",
      "description":""
    },
    {
      "headline":"Take a frying pan and add oil into it.",
      "description":""
    },
    {
      "headline":"Add groundnuts and cashew nuts into it and stir for some time until they have acquired a brown color.",
      "description":""
    },
    {
      "headline":"Split the whole dried red chilies into two pieces.",
      "description":""
    },
    {
      "headline":"Add split red chilies, cumin seeds, curry leaves and mustard seeds into it.",
      "description":""
    },
    {
      "headline":"Add turmeric powder into it.",
      "description":""
    },
    {
      "headline":"Switch off the gas burner and pour the contents over the rice.",
      "description":""
    },
    {
      "headline":"Extract the juice from the lemon.",
      "description":""
    },
    {
      "headline":"Add to the rice.",
      "description":""
    },
    {
      "headline":"Mix thoroughly and set aside for few hours.",
      "description":""
    }
  ],
  "text":" Boil the rice in a pot and drain the water.  Place the rice on a place and add the salt over the rice.  Chop green chilies into small and round pieces. Add to the rice. Sprinkle asafoetida over the rice.  Take a frying pan and add oil into it.  Add groundnuts and cashew nuts into it and stir for some time until they have acquired a brown color.  Split the whole dried red chilies into two pieces.  Add split red chilies, cumin seeds, curry leaves and mustard seeds into it.  Add turmeric powder into it.  Switch off the gas burner and pour the contents over the rice.  Extract the juice from the lemon.  Add to the rice.  Mix thoroughly and set aside for few hours. ",
  "tyn_model":[
    "rice",
    "pot",
    "water",
    "salt",
    "frying pan",
    "oil",
    "groundnuts",
    "cashew nuts",
    "red chilies",
    "cumin seeds",
    "curry leaves",
    "mustard seeds",
    "turmeric",
    "gas burner",
    "lemon"
  ],
  "tyn_section":[

  ]
}