{
  "title":"How to Make Nice Crispy Meats",
  "url":"https://www.wikihow.com/Make-Nice-Crispy-Meats",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat"
  ],
  "steps":[
    {
      "headline":"In a large saucepan, melt butter over low-medium heat.",
      "description":""
    },
    {
      "headline":"Add marshmallows and stir until completely melted.",
      "description":""
    },
    {
      "headline":"Pour Rice Krispies into a large mixing bowl.",
      "description":""
    },
    {
      "headline":"Add marshmallow mixture, stirring until the Rice Krispies are consistently mixed in.",
      "description":""
    },
    {
      "headline":"Press mixture into a greased 13x9x2-inch pan using a spatula, large spoon, or even just your hands.",
      "description":""
    },
    {
      "headline":"While the Rice Krispie Treats are cooling in a refrigerator, find a frying pan and place it on a non-heated surface, such as a countertop or cool stove eye.",
      "description":""
    },
    {
      "headline":"Place as much bacon as will fit into the pan, and place the pan on heat, using a spatula to cook the bacon",
      "description":"You may have to cook two frying pans of bacon to get enough to use most of your Rice Krispie Treats."
    },
    {
      "headline":"Remove the Rice Krispie Treats from the refrigerator, and place them near your work station.",
      "description":""
    },
    {
      "headline":"Once the bacon is fully cooked, take the pan(s) off heat.",
      "description":""
    },
    {
      "headline":"Use a knife to cut the Rice Krispie treats into squares.",
      "description":"Try to cut them as evenly as possible, as this will make the next few steps easier."
    },
    {
      "headline":"Begin removing the squares from the pan, and rolling them into balls with your hands.",
      "description":""
    },
    {
      "headline":"Wait for the bacon to cool.",
      "description":"Once it's cooled completely, remove a single strip of bacon from the pan."
    },
    {
      "headline":"Wrap the bacon around a Rice Krispie ball, and secure it with a toothpick.",
      "description":""
    },
    {
      "headline":"Repeat this until all of the bacon is gone.",
      "description":""
    },
    {
      "headline":"Congratulations!",
      "description":"You have now made nice crispy meats. Enjoy!"
    }
  ],
  "text":" In a large saucepan, melt butter over low-medium heat.  Add marshmallows and stir until completely melted.  Pour Rice Krispies into a large mixing bowl.  Add marshmallow mixture, stirring until the Rice Krispies are consistently mixed in.  Press mixture into a greased 13x9x2-inch pan using a spatula, large spoon, or even just your hands.  While the Rice Krispie Treats are cooling in a refrigerator, find a frying pan and place it on a non-heated surface, such as a countertop or cool stove eye.  Place as much bacon as will fit into the pan, and place the pan on heat, using a spatula to cook the bacon You may have to cook two frying pans of bacon to get enough to use most of your Rice Krispie Treats. Remove the Rice Krispie Treats from the refrigerator, and place them near your work station.  Once the bacon is fully cooked, take the pan(s) off heat.  Use a knife to cut the Rice Krispie treats into squares. Try to cut them as evenly as possible, as this will make the next few steps easier. Begin removing the squares from the pan, and rolling them into balls with your hands.  Wait for the bacon to cool. Once it's cooled completely, remove a single strip of bacon from the pan. Wrap the bacon around a Rice Krispie ball, and secure it with a toothpick.  Repeat this until all of the bacon is gone.  Congratulations! You have now made nice crispy meats. Enjoy!",
  "tyn_model":[
    "bacon",
    "rice krispie treats",
    "rice krispies",
    "spatula",
    "large saucepan",
    "butter",
    "marshmallows",
    "large mixing bowl",
    "large spoon",
    "frying pan",
    "frying pans",
    "refrigerator",
    "knife",
    "rice krispie"
  ],
  "tyn_section":[

  ]
}