{
  "title":"How to Draw Cartoon Animals",
  "url":"https://www.wikihow.com/Draw-Cartoon-Animals",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "methods":[
    {
      "name":"A Cartoon Lion",
      "steps":[
        {
          "headline":"Create a large vertical oval for the mane.",
          "description":""
        },
        {
          "headline":"Join three connected lines to the left edge of the oval.",
          "description":""
        },
        {
          "headline":"Add another such irregular box attached at the bottom of the above one for the jaw.",
          "description":""
        },
        {
          "headline":"Draw another small circle at the far right for the back.",
          "description":""
        },
        {
          "headline":"Create four small-sized horizontal ovals at the bottom for the paws.",
          "description":""
        },
        {
          "headline":"Extend lines upwards from the edge of the ovals for the forelegs.",
          "description":""
        },
        {
          "headline":"Join two lines from the legs to the oval at the back for the body.",
          "description":""
        },
        {
          "headline":"Join further lines to the ovals for the hind legs.",
          "description":""
        },
        {
          "headline":"Draw a small curve for the tail.",
          "description":""
        },
        {
          "headline":"Create a small angular oval for the ear and an angular straight line for the nose",
          "description":""
        },
        {
          "headline":"Add another rotated ‘L’ joining the nose to the ear.",
          "description":""
        },
        {
          "headline":"Draw all the details along the guides.",
          "description":""
        },
        {
          "headline":"Erase all the guide strokes.",
          "description":""
        },
        {
          "headline":"Color and shade the king of the jungle.",
          "description":""
        }
      ]
    },
    {
      "name":"A Cartoon Rhino",
      "steps":[
        {
          "headline":"Draw an oval.",
          "description":""
        },
        {
          "headline":"Repeat another oval of a slightly smaller size on the right of the earlier one at a bit of distance.",
          "description":""
        },
        {
          "headline":"Overlap the two ovals with an oval between them.",
          "description":""
        },
        {
          "headline":"Attach a tapered box to the edge of the oval on the extreme left.",
          "description":""
        },
        {
          "headline":"Create another smaller tapered box on the right edge of the same oval.",
          "description":""
        },
        {
          "headline":"Create further similar box adjacent to the earlier one.",
          "description":""
        },
        {
          "headline":"Add another one at the bottom of the oval on the extreme right.",
          "description":""
        },
        {
          "headline":"Join another one adjacent to it to complete the guides of the four legs.",
          "description":""
        },
        {
          "headline":"Join small irregular boxes at the bottom of the four legs for the feet.",
          "description":""
        },
        {
          "headline":"Draw guides in the form of curves and lines for the horns and ears.",
          "description":""
        },
        {
          "headline":"Based on the above lines draw all the details.",
          "description":""
        },
        {
          "headline":"Erase all guides.",
          "description":""
        },
        {
          "headline":"Color and shade the rhino appropriately.",
          "description":""
        }
      ]
    }
  ],
  "text":" A Cartoon Lion Create a large vertical oval for the mane.  Join three connected lines to the left edge of the oval.  Add another such irregular box attached at the bottom of the above one for the jaw.  Draw another small circle at the far right for the back.  Create four small-sized horizontal ovals at the bottom for the paws.  Extend lines upwards from the edge of the ovals for the forelegs.  Join two lines from the legs to the oval at the back for the body.  Join further lines to the ovals for the hind legs.  Draw a small curve for the tail.  Create a small angular oval for the ear and an angular straight line for the nose  Add another rotated ‘L’ joining the nose to the ear.  Draw all the details along the guides.  Erase all the guide strokes.  Color and shade the king of the jungle.  A Cartoon Rhino Draw an oval.  Repeat another oval of a slightly smaller size on the right of the earlier one at a bit of distance.  Overlap the two ovals with an oval between them.  Attach a tapered box to the edge of the oval on the extreme left.  Create another smaller tapered box on the right edge of the same oval.  Create further similar box adjacent to the earlier one.  Add another one at the bottom of the oval on the extreme right.  Join another one adjacent to it to complete the guides of the four legs.  Join small irregular boxes at the bottom of the four legs for the feet.  Draw guides in the form of curves and lines for the horns and ears.  Based on the above lines draw all the details.  Erase all guides.  Color and shade the rhino appropriately. ",
  "tyn_model":[
    "guides",
    "cartoon lion",
    "‘l",
    "’ joining",
    "rhino"
  ],
  "tyn_section":[

  ]
}