{
  "title":"How to Make Potato Kugel",
  "url":"https://www.wikihow.com/Make-Potato-Kugel",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Potato Dishes"
  ],
  "steps":[
    {
      "headline":"Heat the oven to 375 degrees",
      "description":""
    },
    {
      "headline":"Chop 2 medium yellow onions or one large Vidalia onion.",
      "description":"Place in a very large mixing bowl"
    },
    {
      "headline":"Add 8 eggs",
      "description":""
    },
    {
      "headline":"Add 2 teaspoons of salt and one teaspoon of freshly ground pepper.",
      "description":""
    },
    {
      "headline":"Mix briskly with a whisk so that the eggs are nice and frothy",
      "description":""
    },
    {
      "headline":"Add 1/2 cup of vegetable oil and mix again",
      "description":""
    },
    {
      "headline":"Wash and peel 10 medium potatoes.",
      "description":"Either grind them by hand with a potato grinder, or process them in small batches in a food processor until they are small pieces."
    },
    {
      "headline":"Add the ground potatoes to the egg mixture in the bowl and stir.",
      "description":""
    },
    {
      "headline":"Add one cup of water and stir",
      "description":""
    },
    {
      "headline":"Add one cup of matzah meal and stir",
      "description":""
    },
    {
      "headline":"The mixture should be dense and not watery, if it is thin, add a 1/4 cup more of matzah meal.",
      "description":""
    },
    {
      "headline":"Coat a 10 by 14 by 2 1/2 roasting pan with vegetable oil spray or rub the pan lightly with vegetable oil.",
      "description":""
    },
    {
      "headline":"Pour the potato kugel mixture into the prepared pan.",
      "description":""
    },
    {
      "headline":"Place the filled baking pan in the heated oven and bake until the top is lightly browned and the kugel is set, for about 1 hour, to 1 1/4 hour.",
      "description":""
    },
    {
      "headline":"Serve warm",
      "description":""
    }
  ],
  "text":" Heat the oven to 375 degrees  Chop 2 medium yellow onions or one large Vidalia onion. Place in a very large mixing bowl Add 8 eggs  Add 2 teaspoons of salt and one teaspoon of freshly ground pepper.  Mix briskly with a whisk so that the eggs are nice and frothy  Add 1/2 cup of vegetable oil and mix again  Wash and peel 10 medium potatoes. Either grind them by hand with a potato grinder, or process them in small batches in a food processor until they are small pieces. Add the ground potatoes to the egg mixture in the bowl and stir.  Add one cup of water and stir  Add one cup of matzah meal and stir  The mixture should be dense and not watery, if it is thin, add a 1/4 cup more of matzah meal.  Coat a 10 by 14 by 2 1/2 roasting pan with vegetable oil spray or rub the pan lightly with vegetable oil.  Pour the potato kugel mixture into the prepared pan.  Place the filled baking pan in the heated oven and bake until the top is lightly browned and the kugel is set, for about 1 hour, to 1 1/4 hour.  Serve warm ",
  "tyn_model":[
    "vegetable oil",
    "eggs",
    "potatoes",
    "matzah meal",
    "oven",
    "yellow onions",
    "vidalia onion",
    "mixing bowl",
    "salt",
    "freshly ground pepper",
    "whisk",
    "potato grinder",
    "food processor",
    "egg",
    "bowl",
    "water",
    "roasting pan",
    "potato kugel",
    "baking pan",
    "heated oven"
  ],
  "tyn_section":[

  ]
}