{
  "title":"How to Make Eggs in Bell Pepper Rings",
  "url":"https://www.wikihow.com/Make-Eggs-in-Bell-Pepper-Rings",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "parts":[
    {
      "name":"Preparing the Ingredients",
      "steps":[
        {
          "headline":"Wash and dry the bell peppers.",
          "description":"Even though you will be cooking the peppers, it's always a good idea to thoroughly wash all vegetables before eating."
        },
        {
          "headline":"Cut the bell peppers into ½ inch/10mm rings on the cutting board.",
          "description":"Use a sharp knife to make clean cuts (to better hold the egg in place). Cut away the white inner flesh and seeds."
        },
        {
          "headline":"Crack one egg into each bowl.",
          "description":"By cracking the egg into the bowl first, you can remove any shells or avoid having a bad egg drop into the pepper rings."
        }
      ]
    },
    {
      "name":"Cooking the Bell Pepper Rings",
      "steps":[
        {
          "headline":"Heat the skillet on medium heat and coat with non-stick cooking spray.",
          "description":"Give the pan a few minutes to heat up before adding food."
        },
        {
          "headline":"Place the pepper rings in the middle of the pan.",
          "description":"Allow the rings to cook and brown lightly before adding the egg. If possible, you may want to turn the rings over a few times so both sides cook evenly."
        },
        {
          "headline":"Add one egg to the middle of each bell pepper ring.",
          "description":"Gently allow the egg to slide from the bowl into the ring middle."
        },
        {
          "headline":"Continue cooking over low heat until yolks firm and egg whites harden (and are no long translucent).",
          "description":""
        },
        {
          "headline":"Spray the bottom of the spatula with non-stick spray.",
          "description":"Slide it underneath one egg and pepper ring. Lift carefully from the skillet and onto your plate."
        },
        {
          "headline":"Season to your taste with salt and pepper.",
          "description":""
        },
        {
          "headline":"Bon Appetit.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preparing the Ingredients Wash and dry the bell peppers. Even though you will be cooking the peppers, it's always a good idea to thoroughly wash all vegetables before eating. Cut the bell peppers into ½ inch/10mm rings on the cutting board. Use a sharp knife to make clean cuts (to better hold the egg in place). Cut away the white inner flesh and seeds. Crack one egg into each bowl. By cracking the egg into the bowl first, you can remove any shells or avoid having a bad egg drop into the pepper rings. Cooking the Bell Pepper Rings Heat the skillet on medium heat and coat with non-stick cooking spray. Give the pan a few minutes to heat up before adding food. Place the pepper rings in the middle of the pan. Allow the rings to cook and brown lightly before adding the egg. If possible, you may want to turn the rings over a few times so both sides cook evenly. Add one egg to the middle of each bell pepper ring. Gently allow the egg to slide from the bowl into the ring middle. Continue cooking over low heat until yolks firm and egg whites harden (and are no long translucent).  Spray the bottom of the spatula with non-stick spray. Slide it underneath one egg and pepper ring. Lift carefully from the skillet and onto your plate. Season to your taste with salt and pepper.  Bon Appetit. ",
  "tyn_model":[
    "bowl",
    "bell peppers",
    "skillet",
    "egg",
    "non-stick cooking spray",
    "bell pepper",
    "spatula",
    "non-stick spray",
    "plate",
    "salt and pepper"
  ],
  "tyn_section":[

  ]
}