{
  "title":"How to Fold a One Dollar Bill Into Exact Thirds",
  "url":"https://www.wikihow.com/Fold-a-One-Dollar-Bill-Into-Exact-Thirds",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Origami",
    "Dollar Bill Origami"
  ],
  "methods":[
    {
      "name":"Hand fold",
      "steps":[
        {
          "headline":"Start with a relatively new, crisp one dollar bill.",
          "description":""
        },
        {
          "headline":"Place the bill portrait side up on a hard surface.",
          "description":""
        },
        {
          "headline":"Fold the left edge over until all you can see are the letters O-T-E in the word \"NOTE\".",
          "description":"Make sure that the edges of the paper align perfectly, then crease the fold sharply with your fingernail."
        },
        {
          "headline":"Lift the folded edge a bit, then fold the right edge of the bill under the folded end until it firmly meets the inside of the first crease.",
          "description":""
        },
        {
          "headline":"Again, make sure that the edges of the paper align perfectly, then crease the fold sharply with your fingernail.",
          "description":""
        },
        {
          "headline":"Your bill is now folded into exact thirds.",
          "description":""
        }
      ]
    },
    {
      "name":"Ruler fold",
      "steps":[
        {
          "headline":"Find a ruler.",
          "description":""
        },
        {
          "headline":"Measure the dollar bill.",
          "description":""
        },
        {
          "headline":"Divide the length by three.",
          "description":""
        },
        {
          "headline":"Fold at each third.",
          "description":"Keep the ruler in place to assist with a perfect fold. Done."
        }
      ]
    }
  ],
  "text":" Hand fold Start with a relatively new, crisp one dollar bill.  Place the bill portrait side up on a hard surface.  Fold the left edge over until all you can see are the letters O-T-E in the word \"NOTE\". Make sure that the edges of the paper align perfectly, then crease the fold sharply with your fingernail. Lift the folded edge a bit, then fold the right edge of the bill under the folded end until it firmly meets the inside of the first crease.  Again, make sure that the edges of the paper align perfectly, then crease the fold sharply with your fingernail.  Your bill is now folded into exact thirds.  Ruler fold Find a ruler.  Measure the dollar bill.  Divide the length by three.  Fold at each third. Keep the ruler in place to assist with a perfect fold. Done.",
  "tyn_model":[
    "ruler",
    "paper",
    "one dollar bill",
    "dollar bill"
  ],
  "tyn_section":[

  ]
}