{
  "title":"How to Make Kashmiri Dhoodhi Thool",
  "url":"https://www.wikihow.com/Make-Kashmiri-Dhoodhi-Thool",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine"
  ],
  "steps":[
    {
      "headline":"Chop onions into fine pieces.",
      "description":""
    },
    {
      "headline":"Slice green chilies into two pieces.",
      "description":""
    },
    {
      "headline":"Chop coriander leaves also.",
      "description":""
    },
    {
      "headline":"Take a steel utensil and boil the milk.",
      "description":""
    },
    {
      "headline":"Take a large frying pan and add oil into it.",
      "description":""
    },
    {
      "headline":"Add cumin seeds and let them splutter in the oil.",
      "description":""
    },
    {
      "headline":"Add chopped onions and stir fry them for some time till they acquire a translucent pink color.",
      "description":""
    },
    {
      "headline":"Add salt into it and mix thoroughly.",
      "description":""
    },
    {
      "headline":"Add turmeric powder and mix it well.",
      "description":""
    },
    {
      "headline":"Add milk and mix it well.",
      "description":""
    },
    {
      "headline":"Reduce the gas flame to low and allow the milk to blend well with other ingredients.",
      "description":""
    },
    {
      "headline":"Take a small frying pan and add oil into it.",
      "description":""
    },
    {
      "headline":"Take an egg and break it  and pour the contents into the pan.",
      "description":""
    },
    {
      "headline":"Sprinkle salt over it.",
      "description":""
    },
    {
      "headline":"Sprinkle Kashmiri red chili powder over it now.",
      "description":""
    },
    {
      "headline":"Turn it to the other side so that a nice omelette is made.",
      "description":""
    },
    {
      "headline":"Place it in the milk gravy.",
      "description":""
    },
    {
      "headline":"Repeat the above steps to make one more omelette.",
      "description":"Add it to the milk gravy."
    },
    {
      "headline":"Garnish it with chopped fresh coriander leaves and sliced green chilies.",
      "description":""
    },
    {
      "headline":"Serve it with rice or rotis.",
      "description":""
    }
  ],
  "text":" Chop onions into fine pieces.  Slice green chilies into two pieces.  Chop coriander leaves also.  Take a steel utensil and boil the milk.  Take a large frying pan and add oil into it.  Add cumin seeds and let them splutter in the oil.  Add chopped onions and stir fry them for some time till they acquire a translucent pink color.  Add salt into it and mix thoroughly.  Add turmeric powder and mix it well.  Add milk and mix it well.  Reduce the gas flame to low and allow the milk to blend well with other ingredients.  Take a small frying pan and add oil into it.  Take an egg and break it  and pour the contents into the pan.  Sprinkle salt over it.  Sprinkle Kashmiri red chili powder over it now.  Turn it to the other side so that a nice omelette is made.  Place it in the milk gravy.  Repeat the above steps to make one more omelette. Add it to the milk gravy. Garnish it with chopped fresh coriander leaves and sliced green chilies.  Serve it with rice or rotis. ",
  "tyn_model":[
    "milk",
    "oil",
    "onions",
    "coriander",
    "salt",
    "milk gravy",
    "green chilies",
    "large frying pan",
    "cumin seeds",
    "turmeric",
    "gas flame",
    "small frying",
    "rice or rotis"
  ],
  "tyn_section":[

  ]
}