{
  "title":"How to Sew a Single Fold Hem",
  "url":"https://www.wikihow.com/Sew-a-Single-Fold-Hem",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Sewing",
    "Sewing Skills",
    "Hemming"
  ],
  "steps":[
    {
      "headline":"Determine the inseams and mark it with a wax pencil - this will be the Fold Line on the drawing.",
      "description":""
    },
    {
      "headline":"Choose a stitch width, of at least an inch for pants, and mark it with a wax pencil -this will be the Stitch Line.",
      "description":""
    },
    {
      "headline":"Mark the Cut Line with a wax pencil with a width wider than the Stitch Line to Fold Line.",
      "description":""
    },
    {
      "headline":"Zig zag above the cut line.",
      "description":""
    },
    {
      "headline":"Fold at the Fold Line and iron it.",
      "description":"Rip the side and inside seams below the fold line. Fold at the fold line, adjust the two layers so they are together and like one material and not two materials stacked. Sew the side and inside seams. The pants legs whether they are tapered, straight or bell bottoms will not fit perfectly after folding, do this to avoid stress marks and to make sewing easier. Iron at the fold line."
    },
    {
      "headline":"Redraw the Stitch Line with a wax pencil and baste both sides of it.",
      "description":"If appearance or exactness is important to you, you must baste twice."
    },
    {
      "headline":"Machine sew exactly over the stitch line.",
      "description":"This step is an article in itself. The keys points are:\nThe thread tension and stitch length - match it the rest of the pants by practicing on some scrap material. Follow the steps of sewing exactly on the wax pencil line and double basting. You will be sewing two layers, the feed dog will be moving the bottom layer and the tension of the presser foot keeps the upper layer still, bind the two layers together by basting on both sides of the stitch line. Sew smoothly and evenly by feeding the material exactly the same throughout the sewing process."
    },
    {
      "headline":"If not satisfied, rip and resew.",
      "description":""
    },
    {
      "headline":"Cut at the Cut Line.",
      "description":"Save this material for making carriers and small mending tasks. There are so many colors and weaves, it is difficult at best to match two fabrics perfectly. Save the excess fabric, that you cut, from hemming."
    },
    {
      "headline":"Optionally, dab a little fabric glue on the covered edges.",
      "description":"If you did not use a zig zag and used the regular stitch instead, cover the cut edges with fabric glue."
    }
  ],
  "text":" Determine the inseams and mark it with a wax pencil - this will be the Fold Line on the drawing.  Choose a stitch width, of at least an inch for pants, and mark it with a wax pencil -this will be the Stitch Line.  Mark the Cut Line with a wax pencil with a width wider than the Stitch Line to Fold Line.  Zig zag above the cut line.  Fold at the Fold Line and iron it. Rip the side and inside seams below the fold line. Fold at the fold line, adjust the two layers so they are together and like one material and not two materials stacked. Sew the side and inside seams. The pants legs whether they are tapered, straight or bell bottoms will not fit perfectly after folding, do this to avoid stress marks and to make sewing easier. Iron at the fold line. Redraw the Stitch Line with a wax pencil and baste both sides of it. If appearance or exactness is important to you, you must baste twice. Machine sew exactly over the stitch line. This step is an article in itself. The keys points are:\nThe thread tension and stitch length - match it the rest of the pants by practicing on some scrap material. Follow the steps of sewing exactly on the wax pencil line and double basting. You will be sewing two layers, the feed dog will be moving the bottom layer and the tension of the presser foot keeps the upper layer still, bind the two layers together by basting on both sides of the stitch line. Sew smoothly and evenly by feeding the material exactly the same throughout the sewing process. If not satisfied, rip and resew.  Cut at the Cut Line. Save this material for making carriers and small mending tasks. There are so many colors and weaves, it is difficult at best to match two fabrics perfectly. Save the excess fabric, that you cut, from hemming. Optionally, dab a little fabric glue on the covered edges. If you did not use a zig zag and used the regular stitch instead, cover the cut edges with fabric glue.",
  "tyn_model":[
    "wax pencil",
    "iron",
    "fabric glue",
    "thread",
    "feed dog",
    "fabrics",
    "fabric"
  ],
  "tyn_section":[

  ]
}