{
  "title":"How to Make Blueberry Greek Yogurt Cookies",
  "url":"https://www.wikihow.com/Make-Blueberry-Greek-Yogurt-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Fruit Cookies and Biscuits"
  ],
  "parts":[
    {
      "name":"Make the Cookies",
      "steps":[
        {
          "headline":"Preheat oven to 375 degrees and spray two or three (depending on your oven’s size) baking sheets with cooking spray.",
          "description":""
        },
        {
          "headline":"Combine the yogurt and both sugars in a large mixing bowl or in an electric mixer.",
          "description":"Mix well until yogurt and sugars are fully integrated."
        },
        {
          "headline":"Add egg and vanilla to combined yogurt and sugar mixture.",
          "description":"Combine well but don’t over mix."
        },
        {
          "headline":"Whisk the flour, baking powder and salt together in a separate bowl.",
          "description":"Consider sifting the flour before combining it with the other ingredients."
        },
        {
          "headline":"Add to wet yogurt/sugar mixture and then combine.",
          "description":"If you are using an electric mixture, use the lowest setting to fully integrate dry ingredients."
        },
        {
          "headline":"Fold in blueberries using a rubber spatula.",
          "description":"Be gentle so you don't crush or break the blueberries--you want to have whole blueberries in each cookie."
        }
      ]
    },
    {
      "name":"Bake the Cookies",
      "steps":[
        {
          "headline":"Use a teaspoon to scoop cookie batter.",
          "description":"You want each cookie to be a uniform size so choose a spoon that will allow you to accomplish this."
        },
        {
          "headline":"Drop cookie dough onto pre-sprayed baking sheets, leaving approximately 2 inches (5.1 cm) between cookies.",
          "description":""
        },
        {
          "headline":"Bake for 10 minutes or until the tops of the cookies are a light brown.",
          "description":"You may want to play with this time as some ovens bake hotter than others (so you may want to set your timer for 8 minutes and then check the cookies)."
        },
        {
          "headline":"Remove hot cookies from the oven and allow them to stand for two minutes before moving them to a wire rack to cool completely.",
          "description":"Some blueberries may have burst during the cooking process, which is to be expected."
        }
      ]
    },
    {
      "name":"Create the Frosting",
      "steps":[
        {
          "headline":"Whip cream cheese in the electric mixture until light and fluffy.",
          "description":"Set mixture at medium speed and then into high toward the last few seconds of mixing."
        },
        {
          "headline":"Add confectioners’ sugar and lemon juice to cream cheese.",
          "description":"Add sugar and lemon juice while the mixer is in motion, set to the lowest setting. Use a rubber spatula to push cream cheese toward the middle as it mixes so it fully combines."
        },
        {
          "headline":"Mix in lemon zest.",
          "description":"Stop the electric mixture and stir the lemon zest in by hand. You want small pieces of the lemon zest to be apparent in the cookie so you don’t want it to dissolve by being mixed with the electric mixer."
        },
        {
          "headline":"Frost cookies once the cookies have fully cooled.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Make the Cookies Preheat oven to 375 degrees and spray two or three (depending on your oven’s size) baking sheets with cooking spray.  Combine the yogurt and both sugars in a large mixing bowl or in an electric mixer. Mix well until yogurt and sugars are fully integrated. Add egg and vanilla to combined yogurt and sugar mixture. Combine well but don’t over mix. Whisk the flour, baking powder and salt together in a separate bowl. Consider sifting the flour before combining it with the other ingredients. Add to wet yogurt/sugar mixture and then combine. If you are using an electric mixture, use the lowest setting to fully integrate dry ingredients. Fold in blueberries using a rubber spatula. Be gentle so you don't crush or break the blueberries--you want to have whole blueberries in each cookie. Bake the Cookies Use a teaspoon to scoop cookie batter. You want each cookie to be a uniform size so choose a spoon that will allow you to accomplish this. Drop cookie dough onto pre-sprayed baking sheets, leaving approximately 2 inches (5.1 cm) between cookies.  Bake for 10 minutes or until the tops of the cookies are a light brown. You may want to play with this time as some ovens bake hotter than others (so you may want to set your timer for 8 minutes and then check the cookies). Remove hot cookies from the oven and allow them to stand for two minutes before moving them to a wire rack to cool completely. Some blueberries may have burst during the cooking process, which is to be expected. Create the Frosting Whip cream cheese in the electric mixture until light and fluffy. Set mixture at medium speed and then into high toward the last few seconds of mixing. Add confectioners’ sugar and lemon juice to cream cheese. Add sugar and lemon juice while the mixer is in motion, set to the lowest setting. Use a rubber spatula to push cream cheese toward the middle as it mixes so it fully combines. Mix in lemon zest. Stop the electric mixture and stir the lemon zest in by hand. You want small pieces of the lemon zest to be apparent in the cookie so you don’t want it to dissolve by being mixed with the electric mixer. Frost cookies once the cookies have fully cooled.  Finished. ",
  "tyn_model":[
    "yogurt",
    "blueberries",
    "sugar",
    "cream cheese",
    "baking sheets",
    "sugars",
    "electric mixer",
    "flour",
    "rubber spatula",
    "lemon juice",
    "lemon zest",
    "cooking spray",
    "large mixing bowl",
    "vanilla",
    "baking powder",
    "salt",
    "teaspoon",
    "spoon",
    "cookie dough",
    "oven",
    "frosting whip",
    "confectioners’ sugar",
    "mixer",
    "lemon"
  ],
  "tyn_section":[

  ]
}