{
  "title":"How to Make Mutton and Lotus Stem Curry",
  "url":"https://www.wikihow.com/Make-Mutton-and-Lotus-Stem-Curry",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine"
  ],
  "methods":[
    {
      "name":"Cooking the Mutton Pieces",
      "steps":[
        {
          "headline":"Clean and wash the mutton under running water.",
          "description":""
        },
        {
          "headline":"Place the mutton pieces in a large frying pan.",
          "description":"Add the half teaspoon of salt and water. Bring the water to boiling stage on a gas stove."
        },
        {
          "headline":"Add turmeric powder to the mixture.",
          "description":""
        }
      ]
    },
    {
      "name":"Preparing the Curry",
      "steps":[
        {
          "headline":"Add oil to the base of the pressure cooker.",
          "description":"Once the oil is hot, add cumin seeds and black cardamoms. After a few minutes, add chopped pieces of onions. Sauté the onions."
        },
        {
          "headline":"Add the chopped tomato pieces and garlic.",
          "description":""
        },
        {
          "headline":"Add salt, Kashmiri red chili powder, Kashmiri veri masala and garam masala powder.",
          "description":"Mix well."
        },
        {
          "headline":"Chop the lotus stems into large pieces.",
          "description":"Add the lotus stem pieces into the pressure cooker and mix."
        },
        {
          "headline":"Add the mutton stock to the meat pieces.",
          "description":"Mix together."
        }
      ]
    },
    {
      "name":"Cooking the Curry",
      "steps":[
        {
          "headline":"Cover the pressure cooker with the lid.",
          "description":"Cook the curry under pressure. Before reopening, wait for three whistles (or follow the instructions provided with your pressure cooker; three whistles on an Indian style pressure cooker is approximately 9 minutes, see Tips below)."
        },
        {
          "headline":"Remove the lid.",
          "description":"Cook for some more time until the gravy thickens. Serve this dish with rice or your favorite roti bread."
        }
      ]
    }
  ],
  "text":" Cooking the Mutton Pieces Clean and wash the mutton under running water.  Place the mutton pieces in a large frying pan. Add the half teaspoon of salt and water. Bring the water to boiling stage on a gas stove. Add turmeric powder to the mixture.  Preparing the Curry Add oil to the base of the pressure cooker. Once the oil is hot, add cumin seeds and black cardamoms. After a few minutes, add chopped pieces of onions. Sauté the onions. Add the chopped tomato pieces and garlic.  Add salt, Kashmiri red chili powder, Kashmiri veri masala and garam masala powder. Mix well. Chop the lotus stems into large pieces. Add the lotus stem pieces into the pressure cooker and mix. Add the mutton stock to the meat pieces. Mix together. Cooking the Curry Cover the pressure cooker with the lid. Cook the curry under pressure. Before reopening, wait for three whistles (or follow the instructions provided with your pressure cooker; three whistles on an Indian style pressure cooker is approximately 9 minutes, see Tips below). Remove the lid. Cook for some more time until the gravy thickens. Serve this dish with rice or your favorite roti bread.",
  "tyn_model":[
    "pressure cooker",
    "water",
    "salt",
    "oil",
    "onions",
    "large frying pan",
    "gas stove",
    "turmeric powder",
    "cumin seeds",
    "black cardamoms",
    "tomato",
    "garlic",
    "garam masala powder",
    "lotus",
    "lotus stem",
    "mutton stock",
    "rice",
    "roti bread"
  ],
  "tyn_section":[

  ]
}