{
  "title":"How to Make Chocolate Buttercream Icing (Frosting)",
  "url":"https://www.wikihow.com/Make-Chocolate-Buttercream-Icing-(Frosting)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "methods":[
    {
      "name":"With Cream\\/Milk",
      "steps":[
        {
          "headline":"Pour the powdered (icing) sugar into a large mixing bowl.",
          "description":""
        },
        {
          "headline":"Add cream or milk, vanilla and butter.",
          "description":""
        },
        {
          "headline":"Add the unsweetened cocoa.",
          "description":"Beat until fluffy, scraping the bowl often, approximately 2 minutes."
        },
        {
          "headline":"Add more milk to add consistency, and beat 1 more minute.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    },
    {
      "name":"Without Cream\\/Milk",
      "steps":[
        {
          "headline":"Put everything into one bowl.",
          "description":"A flatter bowl/dish works best as it is then easier to crush the butter."
        },
        {
          "headline":"Using the back of a spoon, crush the butter into the powder (cocoa and icing sugar).",
          "description":"At first it will seem like there is way too much power for the amount of butter but as you carry on, the texture will change to become perfect. Don't be tempted to add more butter or any sort of liquid (such as milk or water) as if you do so, by the end, the overall consistency will be wrong. Alternatively, you can use an electric whisk."
        },
        {
          "headline":"Finished!",
          "description":""
        }
      ]
    }
  ],
  "text":" With Cream\\/Milk Pour the powdered (icing) sugar into a large mixing bowl.  Add cream or milk, vanilla and butter.  Add the unsweetened cocoa. Beat until fluffy, scraping the bowl often, approximately 2 minutes. Add more milk to add consistency, and beat 1 more minute.  Finished.  Without Cream\\/Milk Put everything into one bowl. A flatter bowl/dish works best as it is then easier to crush the butter. Using the back of a spoon, crush the butter into the powder (cocoa and icing sugar). At first it will seem like there is way too much power for the amount of butter but as you carry on, the texture will change to become perfect. Don't be tempted to add more butter or any sort of liquid (such as milk or water) as if you do so, by the end, the overall consistency will be wrong. Alternatively, you can use an electric whisk. Finished! ",
  "tyn_model":[
    "butter",
    "bowl",
    "milk",
    "icing) sugar",
    "large mixing bowl",
    "cream or milk",
    "vanilla",
    "unsweetened cocoa",
    "spoon",
    "cocoa",
    "icing sugar",
    "electric whisk"
  ],
  "tyn_section":[

  ]
}