{
  "title":"How to Cross a Setting of Nine Rectangularly Placed Dots Without Lifting Your Pencil",
  "url":"https://www.wikihow.com/Cross-a-Setting-of-Nine-Rectangularly-Placed-Dots-Without-Lifting-Your-Pencil",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "methods":[
    {
      "name":"Outside the box",
      "steps":[
        {
          "headline":"Take a piece of paper.",
          "description":"To the bottom right quarter, draw nine dots, as shown on the setting image. The dots need to be evenly spaced on a piece of paper that has empty margins. You may want to draw your dots in a different color than the one used for your connecting lines."
        },
        {
          "headline":"Draw the four lines as shown on the instruction image.",
          "description":"Start at the dot in the bottom right-hand corner. See how there are four dots on the bottom left and top right? In order to complete this puzzle, you must literally think outside the box! Starting at the bottom right-hand corner, go left and stop where the fourth dot would be. Go diagonally up and to the right connecting two original dots and stop where the fourth dot would be, on the top right. Go down to your original starting point. Go up diagonally to the left, using all nine dots (and two extra points)."
        },
        {
          "headline":"Finished.",
          "description":"A true masterpiece. Now, can your friends do it?"
        }
      ]
    },
    {
      "name":"Inside the box",
      "steps":[
        {
          "headline":"Draw the diagram as stated in the \"Outside the box\" method above.",
          "description":""
        },
        {
          "headline":"Start on the top right dot.",
          "description":"Move your pen to the far top right dot."
        },
        {
          "headline":"Move your pen back to center dot on same line.",
          "description":"Notice that there was no restriction to moving pen back to retrace."
        },
        {
          "headline":"Move pen to center dot and then left and right to make third line ,return to center dot.",
          "description":""
        },
        {
          "headline":"Extend the second line down to the middle dot on the bottom.",
          "description":""
        },
        {
          "headline":"Move the pen left and right to complete the fourth line on the bottom.",
          "description":"Done!"
        }
      ]
    }
  ],
  "text":" Outside the box Take a piece of paper. To the bottom right quarter, draw nine dots, as shown on the setting image. The dots need to be evenly spaced on a piece of paper that has empty margins. You may want to draw your dots in a different color than the one used for your connecting lines. Draw the four lines as shown on the instruction image. Start at the dot in the bottom right-hand corner. See how there are four dots on the bottom left and top right? In order to complete this puzzle, you must literally think outside the box! Starting at the bottom right-hand corner, go left and stop where the fourth dot would be. Go diagonally up and to the right connecting two original dots and stop where the fourth dot would be, on the top right. Go down to your original starting point. Go up diagonally to the left, using all nine dots (and two extra points). Finished. A true masterpiece. Now, can your friends do it? Inside the box Draw the diagram as stated in the \"Outside the box\" method above.  Start on the top right dot. Move your pen to the far top right dot. Move your pen back to center dot on same line. Notice that there was no restriction to moving pen back to retrace. Move pen to center dot and then left and right to make third line ,return to center dot.  Extend the second line down to the middle dot on the bottom.  Move the pen left and right to complete the fourth line on the bottom. Done!",
  "tyn_model":[
    "pen",
    "paper"
  ],
  "tyn_section":[

  ]
}