{
  "title":"How to Remove Shellac",
  "url":"https://www.wikihow.com/Remove-Shellac",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "methods":[
    {
      "name":"Checking if the Wood Finish is Shellac",
      "steps":[
        {
          "headline":"Try to find out how old the wood piece or furniture is.",
          "description":"Shellac was a common wood finish before the 1920s; this may be enough to indicate to you that you have a shellac finish. Shellac is also the principal way to make French polish and has been used for this purpose on quality furniture over the past century."
        },
        {
          "headline":"Test for a shellac finish.",
          "description":"Old or new, here is the way to check the finish on the furniture or woodwork:\nDab a little denatured alcohol on one section of the wood finish. Try to find an inconspicuous spot. If it is shellac finish, it will liquefy and dissolve. A result of softening without dissolving suggests there is shellac present but that it has been mixed with lacquer as well. Any other response and you're probably looking at a different wood finish. If in doubt, talk to someone familiar with furniture restoration."
        }
      ]
    },
    {
      "name":"Deciding Whether the Shellac Needs Removing",
      "steps":[
        {
          "headline":"Work to avoid jobs rather than create them when restoring furniture and woodwork!",
          "description":"Where the shellac finish appears stained or has dirt embedded in it, try the following first:\nSprinkle a mild abrasive compound over the surface. For example, pumice or rotten-stone. Work this in. Rub off with a cloth."
        },
        {
          "headline":"Buff with a clean rag.",
          "description":"If the surface looks good again, you're spared having to remove the shellac."
        }
      ]
    },
    {
      "name":"Applying Denatured Alcohol",
      "steps":[
        {
          "headline":"Use denatured alcohol to remove shellac.",
          "description":"Also find a piece of 4/0 steel wool."
        },
        {
          "headline":"Using a small brush, brush the shellac with the denatured alcohol.",
          "description":""
        },
        {
          "headline":"Allow the denatured alcohol to sit for a few minutes.",
          "description":"This will help it to begin naturally stripping off the shellac."
        }
      ]
    },
    {
      "name":"Removing the Shellac",
      "steps":[
        {
          "headline":"Put on some rubber gloves to protect your hands.",
          "description":""
        },
        {
          "headline":"Rub the shellac with the steel wool.",
          "description":"Remove as much as you can with the steel wool. This part does require some effort and hard rubbing. You may need to take breaks and come back to it, depending on the size of the job. Getting others to help is always a good solution!"
        },
        {
          "headline":"Use a carpet knife for curved, grooved or harder areas.",
          "description":"This will be able to reach into narrow spots where the steel wool is just not able to reach."
        },
        {
          "headline":"Remove the remaining shellac by wiping with a rag.",
          "description":"Change the rag frequently, to avoid reapplying the shellac on stripped parts of the surface."
        },
        {
          "headline":"Remove all soft pieces and any debris before proceeding with adding a new finish.",
          "description":"It's also important to sand the surface before applying a new finish."
        }
      ]
    }
  ],
  "text":" Checking if the Wood Finish is Shellac Try to find out how old the wood piece or furniture is. Shellac was a common wood finish before the 1920s; this may be enough to indicate to you that you have a shellac finish. Shellac is also the principal way to make French polish and has been used for this purpose on quality furniture over the past century. Test for a shellac finish. Old or new, here is the way to check the finish on the furniture or woodwork:\nDab a little denatured alcohol on one section of the wood finish. Try to find an inconspicuous spot. If it is shellac finish, it will liquefy and dissolve. A result of softening without dissolving suggests there is shellac present but that it has been mixed with lacquer as well. Any other response and you're probably looking at a different wood finish. If in doubt, talk to someone familiar with furniture restoration. Deciding Whether the Shellac Needs Removing Work to avoid jobs rather than create them when restoring furniture and woodwork! Where the shellac finish appears stained or has dirt embedded in it, try the following first:\nSprinkle a mild abrasive compound over the surface. For example, pumice or rotten-stone. Work this in. Rub off with a cloth. Buff with a clean rag. If the surface looks good again, you're spared having to remove the shellac. Applying Denatured Alcohol Use denatured alcohol to remove shellac. Also find a piece of 4/0 steel wool. Using a small brush, brush the shellac with the denatured alcohol.  Allow the denatured alcohol to sit for a few minutes. This will help it to begin naturally stripping off the shellac. Removing the Shellac Put on some rubber gloves to protect your hands.  Rub the shellac with the steel wool. Remove as much as you can with the steel wool. This part does require some effort and hard rubbing. You may need to take breaks and come back to it, depending on the size of the job. Getting others to help is always a good solution! Use a carpet knife for curved, grooved or harder areas. This will be able to reach into narrow spots where the steel wool is just not able to reach. Remove the remaining shellac by wiping with a rag. Change the rag frequently, to avoid reapplying the shellac on stripped parts of the surface. Remove all soft pieces and any debris before proceeding with adding a new finish. It's also important to sand the surface before applying a new finish.",
  "tyn_model":[
    "alcohol",
    "steel wool",
    "shellac",
    "rag",
    "french polish",
    "lacquer",
    "mild abrasive compound",
    "rotten-stone",
    "cloth",
    "denatured alcohol",
    "rubber gloves",
    "carpet knife"
  ],
  "tyn_section":[

  ]
}