{
  "title":"How to Make Cantaloupe Puree",
  "url":"https://www.wikihow.com/Make-Cantaloupe-Puree",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking for Children",
    "Baby Recipes"
  ],
  "parts":[
    {
      "name":"Preparing the Cantaloupe",
      "steps":[
        {
          "headline":"Wash the cantaloupe.",
          "description":"Rinse 1 medium sized cantaloupe under lukewarm  water to get any dirt or chemicals off."
        },
        {
          "headline":"Cut the cantaloupe in half.",
          "description":"Use a spoon to scoop out and remove all the seeds."
        },
        {
          "headline":"Peel the cantaloupe.",
          "description":"Use a serrated vegetable peeler or a sharp knife to remove all of the skin."
        },
        {
          "headline":"Cut the cantaloupe.",
          "description":"Cut the cantaloupe into small slices or 1 inch (2.54 cm) pieces. Ensuring that the fruit is in small pieces will be very helpful in the cooking and pureeing."
        }
      ]
    },
    {
      "name":"Steaming and Pureeing",
      "steps":[
        {
          "headline":"Prepare the saucepan.",
          "description":"Measure and add about a cup of water into a large saucepan. Add a steamer basket in the saucepan so that it fits perfectly."
        },
        {
          "headline":"Add the cantaloupe onto the basket.",
          "description":"Ensure that the fruit is spread out through the basket instead of clumped in the middle. Cover the saucepan with a lid."
        },
        {
          "headline":"Steam the cantaloupe.",
          "description":"Allow the water to bring to a boil. Reduce the heat to a simmer and allow the fruit to cook for 5 minutes. Reserve the liquid for pureeing."
        },
        {
          "headline":"Allow the cantaloupe to cool down.",
          "description":"Remove the pan from the heat and let it sit for about an additional 5 minutes. You will know when the fruit is properly steamed when you can easily mash it with a fork."
        },
        {
          "headline":"Add the cantaloupe and juice into a food processor.",
          "description":"To make it easier for the fruit to puree, add about 2 to 4 tablespoons of liquid from the saucepan."
        },
        {
          "headline":"Puree the cantaloupe.",
          "description":"Allow the mixture to come to a smooth texture. About halfway through, completely stop the processor and scrap the sides down."
        }
      ]
    },
    {
      "name":"Freezing and Storing",
      "steps":[
        {
          "headline":"Add the mixture to ice cube trays.",
          "description":"Using a tablespoon, fill in each ice cube slot just below the rim of the tray."
        },
        {
          "headline":"Freeze the puree.",
          "description":"Place the ice cube tray(s) in the freezer and allow the mixture to freeze overnight."
        },
        {
          "headline":"Prepare freezer bags.",
          "description":"Use a permanent marker to jot down what food you made and the current date."
        },
        {
          "headline":"Add the fruit cubes to the bags.",
          "description":"Remove the cubes from the trays by placing the backs of it under running hot water or gently bending the trays back and forth."
        },
        {
          "headline":"Store the bags in the freezer.",
          "description":"Frozen baby food will keep for about two months. Any defrosted food will keep in the refrigerator for two days, so only take out as much as you need for the time being."
        }
      ]
    }
  ],
  "text":" Preparing the Cantaloupe Wash the cantaloupe. Rinse 1 medium sized cantaloupe under lukewarm  water to get any dirt or chemicals off. Cut the cantaloupe in half. Use a spoon to scoop out and remove all the seeds. Peel the cantaloupe. Use a serrated vegetable peeler or a sharp knife to remove all of the skin. Cut the cantaloupe. Cut the cantaloupe into small slices or 1 inch (2.54 cm) pieces. Ensuring that the fruit is in small pieces will be very helpful in the cooking and pureeing. Steaming and Pureeing Prepare the saucepan. Measure and add about a cup of water into a large saucepan. Add a steamer basket in the saucepan so that it fits perfectly. Add the cantaloupe onto the basket. Ensure that the fruit is spread out through the basket instead of clumped in the middle. Cover the saucepan with a lid. Steam the cantaloupe. Allow the water to bring to a boil. Reduce the heat to a simmer and allow the fruit to cook for 5 minutes. Reserve the liquid for pureeing. Allow the cantaloupe to cool down. Remove the pan from the heat and let it sit for about an additional 5 minutes. You will know when the fruit is properly steamed when you can easily mash it with a fork. Add the cantaloupe and juice into a food processor. To make it easier for the fruit to puree, add about 2 to 4 tablespoons of liquid from the saucepan. Puree the cantaloupe. Allow the mixture to come to a smooth texture. About halfway through, completely stop the processor and scrap the sides down. Freezing and Storing Add the mixture to ice cube trays. Using a tablespoon, fill in each ice cube slot just below the rim of the tray. Freeze the puree. Place the ice cube tray(s) in the freezer and allow the mixture to freeze overnight. Prepare freezer bags. Use a permanent marker to jot down what food you made and the current date. Add the fruit cubes to the bags. Remove the cubes from the trays by placing the backs of it under running hot water or gently bending the trays back and forth. Store the bags in the freezer. Frozen baby food will keep for about two months. Any defrosted food will keep in the refrigerator for two days, so only take out as much as you need for the time being.",
  "tyn_model":[
    "cantaloupe",
    "water",
    "saucepan",
    "ice cube",
    "freezer",
    "spoon",
    "vegetable peeler",
    "large saucepan",
    "steamer basket",
    "pan",
    "fork",
    "food processor",
    "processor",
    "ice cube tray(s",
    "freezer bags",
    "permanent marker",
    "baby food",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}