{
  "title":"How to Make Pizza Pops",
  "url":"https://www.wikihow.com/Make-Pizza-Pops",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals",
    "Pizza"
  ],
  "steps":[
    {
      "headline":"Take a mixing bowl.",
      "description":""
    },
    {
      "headline":"Mix together the pepperoni, pizza sauce, black olives, pepper, ham, and the cheese.",
      "description":""
    },
    {
      "headline":"Roll the package of pizza dough into a 10X20 inch rectangle.",
      "description":""
    },
    {
      "headline":"Cut in half lengthwise, leaving thinner strips.",
      "description":""
    },
    {
      "headline":"Cut each piece into 4, equaling 8 pieces.",
      "description":""
    },
    {
      "headline":"Take out the filling and divide it amongst the pieces.",
      "description":""
    },
    {
      "headline":"Brush the adjacent edges of each piece with water.",
      "description":""
    },
    {
      "headline":"Then fold the pieces of dough into a triangle shape, making sure the edges are sealed tightly.",
      "description":""
    },
    {
      "headline":"Using your hands, maneuver the filling throughout the dough pocket.",
      "description":""
    },
    {
      "headline":"Place the pizza pops on a baking tray.",
      "description":""
    },
    {
      "headline":"Poke 2-3 holes in the top of the pop, making sure it doesn't spill over, which will keep it from spilling while baking.",
      "description":"This acts as a ventilation for air."
    },
    {
      "headline":"Bake these pizza pops for 15 minutes on 400 °F (204 °C).",
      "description":""
    },
    {
      "headline":"Or until golden brownish.",
      "description":""
    },
    {
      "headline":"Cool at room temperature.",
      "description":""
    },
    {
      "headline":"Serves 8",
      "description":""
    }
  ],
  "text":" Take a mixing bowl.  Mix together the pepperoni, pizza sauce, black olives, pepper, ham, and the cheese.  Roll the package of pizza dough into a 10X20 inch rectangle.  Cut in half lengthwise, leaving thinner strips.  Cut each piece into 4, equaling 8 pieces.  Take out the filling and divide it amongst the pieces.  Brush the adjacent edges of each piece with water.  Then fold the pieces of dough into a triangle shape, making sure the edges are sealed tightly.  Using your hands, maneuver the filling throughout the dough pocket.  Place the pizza pops on a baking tray.  Poke 2-3 holes in the top of the pop, making sure it doesn't spill over, which will keep it from spilling while baking. This acts as a ventilation for air. Bake these pizza pops for 15 minutes on 400 °F (204 °C).  Or until golden brownish.  Cool at room temperature.  Serves 8 ",
  "tyn_model":[
    "mixing bowl",
    "pepperoni",
    "pizza sauce",
    "black olives",
    "pepper",
    "ham",
    "cheese",
    "pizza dough",
    "water",
    "baking tray"
  ],
  "tyn_section":[

  ]
}