{
  "title":"How to Shrink Polyester",
  "url":"https://www.wikihow.com/Shrink-Polyester",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry"
  ],
  "methods":[
    {
      "name":"Washing and Drying",
      "steps":[
        {
          "headline":"Turn the garment inside-out.",
          "description":"Heat high enough to shrink polyester is also high enough to cause colors to fade. Turning your garment inside out before washing will help protect it..\nAvoid washing multiple garments together. Turning the garment inside-out will reduce fading but won’t prevent the colors from bleeding."
        },
        {
          "headline":"Wash the garment in extremely hot water.",
          "description":"Set the washing machine to the hottest water setting and the longest wash cycle. Make sure to use both a hot wash and a hot rinse, since hot water is much more effective for shrinking polyester than cold water. You don’t need to add detergent to the washing machine, but it won’t interfere with the shrinking process. Only add detergent if you’re looking to wash the garment as you shrink it."
        },
        {
          "headline":"Transfer the garment to the dryer immediately.",
          "description":"Dry the polyester garment using the hottest heat setting and the longest drying cycle. The extreme heat is what will do the most work in shrinking the garment."
        },
        {
          "headline":"Check the garment for shrinkage.",
          "description":"Pull it out of the dryer and let it cool to room temperature. If additional shrinkage is necessary, repeat the washing and drying steps to further reduce the size. Note that the more often you wash and dry the garment, the more color fading you may notice. Only attempt this a few more times. If you still cannot achieve significant shrinkage, consider using an iron."
        }
      ]
    },
    {
      "name":"Using an Iron",
      "steps":[
        {
          "headline":"Wash the garment with hot water.",
          "description":"Set the washing machine to the hottest water setting and the longest wash cycle. Use a hot wash and a hot rinse setting."
        },
        {
          "headline":"Transfer the wet garment to an ironing board.",
          "description":"Immediately after the washing cycle finishes, pull the polyester garment from the washing machine and transfer it to an ironing board. Make sure that the garment is still inside-out to reduce the risk of fading."
        },
        {
          "headline":"Lay a pressing cloth over the garment.",
          "description":"Make sure the cloth completely covers your garment. This will prevent the iron from damaging your clothing."
        },
        {
          "headline":"Iron on a low to medium heat setting.",
          "description":"Using a lower setting will prevent the polyester from becoming too stiff. Pass the iron over your article of clothing. Continue ironing the garment until it is completely dried. Do not use a steam setting on the iron. A dry iron will dry out the polyester as you pass over it, which is the effect you’re looking for."
        },
        {
          "headline":"Examine the finished garment for shrinkage.",
          "description":"Make sure not to repeat the ironing process, as this could damage the polyester and cause colors to fade. If you’ve already put the garment through more than one washing and drying cycles, as well as ironing it, you’ve likely shrunk it much as you can."
        }
      ]
    }
  ],
  "text":" Washing and Drying Turn the garment inside-out. Heat high enough to shrink polyester is also high enough to cause colors to fade. Turning your garment inside out before washing will help protect it..\nAvoid washing multiple garments together. Turning the garment inside-out will reduce fading but won’t prevent the colors from bleeding. Wash the garment in extremely hot water. Set the washing machine to the hottest water setting and the longest wash cycle. Make sure to use both a hot wash and a hot rinse, since hot water is much more effective for shrinking polyester than cold water. You don’t need to add detergent to the washing machine, but it won’t interfere with the shrinking process. Only add detergent if you’re looking to wash the garment as you shrink it. Transfer the garment to the dryer immediately. Dry the polyester garment using the hottest heat setting and the longest drying cycle. The extreme heat is what will do the most work in shrinking the garment. Check the garment for shrinkage. Pull it out of the dryer and let it cool to room temperature. If additional shrinkage is necessary, repeat the washing and drying steps to further reduce the size. Note that the more often you wash and dry the garment, the more color fading you may notice. Only attempt this a few more times. If you still cannot achieve significant shrinkage, consider using an iron. Using an Iron Wash the garment with hot water. Set the washing machine to the hottest water setting and the longest wash cycle. Use a hot wash and a hot rinse setting. Transfer the wet garment to an ironing board. Immediately after the washing cycle finishes, pull the polyester garment from the washing machine and transfer it to an ironing board. Make sure that the garment is still inside-out to reduce the risk of fading. Lay a pressing cloth over the garment. Make sure the cloth completely covers your garment. This will prevent the iron from damaging your clothing. Iron on a low to medium heat setting. Using a lower setting will prevent the polyester from becoming too stiff. Pass the iron over your article of clothing. Continue ironing the garment until it is completely dried. Do not use a steam setting on the iron. A dry iron will dry out the polyester as you pass over it, which is the effect you’re looking for. Examine the finished garment for shrinkage. Make sure not to repeat the ironing process, as this could damage the polyester and cause colors to fade. If you’ve already put the garment through more than one washing and drying cycles, as well as ironing it, you’ve likely shrunk it much as you can.",
  "tyn_model":[
    "iron",
    "water",
    "washing machine",
    "dryer",
    "ironing board",
    "polyester",
    "detergent",
    "polyester garment"
  ],
  "tyn_section":[

  ]
}