{
  "title":"How to Bake Chocolate Peanut Butter Cheesecake",
  "url":"https://www.wikihow.com/Bake-Chocolate-Peanut-Butter-Cheesecake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies",
    "Cheesecake"
  ],
  "parts":[
    {
      "name":"Making the Crust",
      "steps":[
        {
          "headline":"Preheat oven to 350 F.",
          "description":""
        },
        {
          "headline":"Combine the crushed cookies and melted butter in a suitably sized bowl .",
          "description":""
        },
        {
          "headline":"Press mix on the inside base of a 9\" springform pan with sides and a removable base.",
          "description":"Pack the mixture up the sides of a springform pan too"
        },
        {
          "headline":"Bake for 8 minutes if you feel that this improves the finished product.",
          "description":"Remember the cookies have already been baked, and the butter was already melted. The base of this is supposed to be set, not melted."
        },
        {
          "headline":"Let cool and start to set.",
          "description":""
        }
      ]
    },
    {
      "name":"Making the Chocolate Filling Mixture",
      "steps":[
        {
          "headline":"Combine chocolate and whipping cream in a small pan over a medium heat.",
          "description":"Keep on the heat until mixture is melted and creamy."
        },
        {
          "headline":"Stir occasionally.",
          "description":""
        },
        {
          "headline":"Pour 1 1/2 cups of that into the crust pan, spreading it out evenly.",
          "description":""
        },
        {
          "headline":"Chill in the freezer for 10 minutes.",
          "description":""
        }
      ]
    },
    {
      "name":"Making the Cream Cheese Mixture",
      "steps":[
        {
          "headline":"Mix the cream cheese and the peanut butter in a mixing bowl.",
          "description":""
        },
        {
          "headline":"Use an electric mixer on low or high speed.",
          "description":""
        },
        {
          "headline":"Beat in brown sugar.",
          "description":""
        },
        {
          "headline":"Beat in the eggs.",
          "description":""
        },
        {
          "headline":"Stir in the vanilla extract into the whole mixture.",
          "description":""
        },
        {
          "headline":"Blend well.",
          "description":""
        },
        {
          "headline":"Pour this mixture into the pan, spreading evenly.",
          "description":""
        }
      ]
    },
    {
      "name":"Baking the Cheesecake",
      "steps":[
        {
          "headline":"Bake for 45 minutes, until a 2 1/2 \" set area appears set around edges when gently shaken.",
          "description":""
        },
        {
          "headline":"Cool the pan for 15 minutes, then using a small knife, a sharp one, loosen edges around crust.",
          "description":""
        },
        {
          "headline":"Cool for 30 more minutes.",
          "description":""
        },
        {
          "headline":"Remove sides of pan, cool cheesecake completely in the pan.",
          "description":""
        },
        {
          "headline":"Spread the remaining chocolate sauce mixture on top of the now finished cheesecake.",
          "description":""
        },
        {
          "headline":"Top with peanut butter cups (optional).",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Crust Preheat oven to 350 F.  Combine the crushed cookies and melted butter in a suitably sized bowl .  Press mix on the inside base of a 9\" springform pan with sides and a removable base. Pack the mixture up the sides of a springform pan too Bake for 8 minutes if you feel that this improves the finished product. Remember the cookies have already been baked, and the butter was already melted. The base of this is supposed to be set, not melted. Let cool and start to set.  Making the Chocolate Filling Mixture Combine chocolate and whipping cream in a small pan over a medium heat. Keep on the heat until mixture is melted and creamy. Stir occasionally.  Pour 1 1/2 cups of that into the crust pan, spreading it out evenly.  Chill in the freezer for 10 minutes.  Making the Cream Cheese Mixture Mix the cream cheese and the peanut butter in a mixing bowl.  Use an electric mixer on low or high speed.  Beat in brown sugar.  Beat in the eggs.  Stir in the vanilla extract into the whole mixture.  Blend well.  Pour this mixture into the pan, spreading evenly.  Baking the Cheesecake Bake for 45 minutes, until a 2 1/2 \" set area appears set around edges when gently shaken.  Cool the pan for 15 minutes, then using a small knife, a sharp one, loosen edges around crust.  Cool for 30 more minutes.  Remove sides of pan, cool cheesecake completely in the pan.  Spread the remaining chocolate sauce mixture on top of the now finished cheesecake.  Top with peanut butter cups (optional).  Finished. ",
  "tyn_model":[
    "butter",
    "springform pan",
    "cream cheese",
    "peanut butter",
    "oven",
    "bowl",
    "chocolate filling",
    "chocolate",
    "whipping cream",
    "small pan",
    "crust pan",
    "freezer",
    "mixing bowl",
    "electric mixer",
    "brown sugar",
    "eggs",
    "vanilla extract",
    "small knife",
    "chocolate sauce"
  ],
  "tyn_section":[

  ]
}