{
  "title":"How to Eat in a Yakiniku Restaurant",
  "url":"https://www.wikihow.com/Eat-in-a-Yakiniku-Restaurant",
  "category_hierarchy":[
    "Food and Entertaining",
    "Dining Etiquette"
  ],
  "steps":[
    {
      "headline":"Check their food menu.",
      "description":"Different restaurants offers different specialties but they often have beef,vegetables,seafood and offal."
    },
    {
      "headline":"Order their best sellers and try to do extreme.",
      "description":"Ask their best sellers and caught your interest. Most Yakiniku restaurant have Rōsu which are beef loin and chuck slices, Misuji a tender beef meat or you can go extreme by trying pork or beef offal (meat organs) which are really delicious when grilled."
    },
    {
      "headline":"Cleanse your hands.",
      "description":"While waiting for the food, find a way to cleanse your hands and try to ask for wet-wipes."
    },
    {
      "headline":"Don't panic.",
      "description":"They will serve your orders uncooked. Yes you heard in right, It's raw meat and veggies."
    },
    {
      "headline":"Ask for assistance to turn-on the grill.",
      "description":"A restaurant staff will usually turn-on the grill placed on top of the table or embedded but if not, ask for assistance because they know the right temperature."
    },
    {
      "headline":"Grill your food.",
      "description":"Using a long chopstick or a metal thong, grill your food and its up to you if you want it well-done or medium rare."
    },
    {
      "headline":"Place it all in a plate.",
      "description":"Once cooked, place your food in a plate. Don't leave it on the grill while you are eating because it might burn and be uneatable"
    },
    {
      "headline":"Say \"Itadakimasu\" before eating.",
      "description":"It means, \"Let's eat!\" and a form of saying \"thank you \" in Japanese etiquette, a similar phrase as 'bon appétit. You're in a Japanese restaurant, might as well try their etiquette."
    },
    {
      "headline":"Try different sauces.",
      "description":"Different Yakiniku restaurant have different sauce options and often serve as their trademark."
    },
    {
      "headline":"Pay your bill.",
      "description":"Don't leave your meal unpaid. You might be in a big trouble if you do so."
    }
  ],
  "text":" Check their food menu. Different restaurants offers different specialties but they often have beef,vegetables,seafood and offal. Order their best sellers and try to do extreme. Ask their best sellers and caught your interest. Most Yakiniku restaurant have Rōsu which are beef loin and chuck slices, Misuji a tender beef meat or you can go extreme by trying pork or beef offal (meat organs) which are really delicious when grilled. Cleanse your hands. While waiting for the food, find a way to cleanse your hands and try to ask for wet-wipes. Don't panic. They will serve your orders uncooked. Yes you heard in right, It's raw meat and veggies. Ask for assistance to turn-on the grill. A restaurant staff will usually turn-on the grill placed on top of the table or embedded but if not, ask for assistance because they know the right temperature. Grill your food. Using a long chopstick or a metal thong, grill your food and its up to you if you want it well-done or medium rare. Place it all in a plate. Once cooked, place your food in a plate. Don't leave it on the grill while you are eating because it might burn and be uneatable Say \"Itadakimasu\" before eating. It means, \"Let's eat!\" and a form of saying \"thank you \" in Japanese etiquette, a similar phrase as 'bon appétit. You're in a Japanese restaurant, might as well try their etiquette. Try different sauces. Different Yakiniku restaurant have different sauce options and often serve as their trademark. Pay your bill. Don't leave your meal unpaid. You might be in a big trouble if you do so.",
  "tyn_model":[
    "grill",
    "plate",
    "seafood",
    "beef loin",
    "pork",
    "beef offal",
    "sauces"
  ],
  "tyn_section":[

  ]
}