{
  "title":"How to Serve Papaya",
  "url":"https://www.wikihow.com/Serve-Papaya",
  "category_hierarchy":[
    "Food and Entertaining",
    "Appreciation of Food",
    "Eating Techniques"
  ],
  "methods":[
    {
      "name":"Vertical strips of cooling effect",
      "steps":[
        {
          "headline":"wash the papaya and remove dirt.",
          "description":""
        },
        {
          "headline":"Peel the papaya.",
          "description":""
        },
        {
          "headline":"Cut the papaya vertically in half.",
          "description":"."
        },
        {
          "headline":"Now cut thin strips of papaya vertically.",
          "description":""
        }
      ]
    },
    {
      "name":"Small pieces method",
      "steps":[
        {
          "headline":"Peel the papaya and cut it vertically.Remove all the seeds without making a mess.",
          "description":""
        },
        {
          "headline":"Now cut and divide each strip of papaya into equal square pieces..",
          "description":""
        },
        {
          "headline":"Shift all the pieces from the cutting board to a clear glass bowl or plate or dish.",
          "description":""
        },
        {
          "headline":"Mark each Piece with a toothpick on top, so that you can hole it with the help of the toothpick and eat it elegantly and without any mess.",
          "description":""
        }
      ]
    },
    {
      "name":"Long Vertical Way",
      "steps":[
        {
          "headline":"Peel papaya and cut it vertically.clean the seeds.",
          "description":""
        },
        {
          "headline":"Cut in long vertical pieces.",
          "description":""
        },
        {
          "headline":"Sprinkle some sugar on it if you like it sweet.",
          "description":""
        },
        {
          "headline":"Serve chilled.",
          "description":""
        }
      ]
    },
    {
      "name":"Cool Papaya Method",
      "steps":[
        {
          "headline":"Peel the papaya.",
          "description":""
        },
        {
          "headline":"Cut the papaya vertically into strips.",
          "description":""
        },
        {
          "headline":"Cut the strips into equal square pieces.",
          "description":""
        },
        {
          "headline":"Take A glass half filled with ice cubes and pour half of them into the glass.",
          "description":"Make sure that the layer of ice is above the layer of papaya so that they cool to some limit."
        }
      ]
    },
    {
      "name":"Papaya Chaat Method",
      "steps":[
        {
          "headline":"Want to linger your taste buds a little?",
          "description":"Try this on."
        },
        {
          "headline":"Peel papaya and cut into pieces.",
          "description":""
        },
        {
          "headline":"Move all The paces to mixing bowl.",
          "description":""
        },
        {
          "headline":"Add 3 tablespoons of sugar to half of the papaya.",
          "description":""
        },
        {
          "headline":"Add 1/2 spoon of salt.",
          "description":""
        },
        {
          "headline":"Mix a little and then add a speck of chaat masala to it.",
          "description":""
        },
        {
          "headline":"Mix and then pour into a tray and mark each with a toothpick on top.",
          "description":""
        }
      ]
    },
    {
      "name":"Fruit Salad Method",
      "steps":[
        {
          "headline":"Take 2 Bananas, 10-12 cherries, a mango, half papaya (finely cut in pieces), an orange, an apple, an avocado and a kiwi.",
          "description":""
        },
        {
          "headline":"Crush the bananas.",
          "description":""
        },
        {
          "headline":"Cut mango, apple avocado and kiwi in fine pieces.",
          "description":""
        },
        {
          "headline":"Peel orange.",
          "description":""
        },
        {
          "headline":"Now shift all the fruits to a bowl or your tiffin and you have a healthy fruit salad ready!",
          "description":""
        }
      ]
    },
    {
      "name":"Papaya shake",
      "steps":[
        {
          "headline":"Peel papaya",
          "description":""
        },
        {
          "headline":"Cut papaya into rough large pieces.",
          "description":""
        },
        {
          "headline":"Shift into grinder with a half glass of milk and sugar according to your taste.",
          "description":""
        },
        {
          "headline":"And Grind till thick.",
          "description":""
        },
        {
          "headline":"Pour into glass and sip through it.",
          "description":""
        }
      ]
    },
    {
      "name":"Mix fruit shake",
      "steps":[
        {
          "headline":"Get all the ingredients mentioned in the fruit salad method.",
          "description":""
        },
        {
          "headline":"Now cut all of them in half and shift to the grinder.",
          "description":""
        },
        {
          "headline":"Add a glass of milk and sugar according to taste.",
          "description":""
        },
        {
          "headline":"Pour into glass And enjoy.",
          "description":""
        }
      ]
    },
    {
      "name":"Papaya crush",
      "steps":[
        {
          "headline":"Take thin pieces of papaya and crush with the help of a spoon.",
          "description":""
        },
        {
          "headline":"When crushed completely, Add a spoon of sugar, half spoon of salt, and ice.",
          "description":""
        },
        {
          "headline":"Eat with the help of a spoon.",
          "description":""
        }
      ]
    },
    {
      "name":"Papaya Freeze",
      "steps":[
        {
          "headline":"grind papaya with a complete tray of ice and sugar.",
          "description":""
        },
        {
          "headline":"Pour into glass.",
          "description":""
        },
        {
          "headline":"Try to eat as soon as prepared.",
          "description":""
        }
      ]
    }
  ],
  "text":" Vertical strips of cooling effect wash the papaya and remove dirt.  Peel the papaya.  Cut the papaya vertically in half. . Now cut thin strips of papaya vertically.  Small pieces method Peel the papaya and cut it vertically.Remove all the seeds without making a mess.  Now cut and divide each strip of papaya into equal square pieces..  Shift all the pieces from the cutting board to a clear glass bowl or plate or dish.  Mark each Piece with a toothpick on top, so that you can hole it with the help of the toothpick and eat it elegantly and without any mess.  Long Vertical Way Peel papaya and cut it vertically.clean the seeds.  Cut in long vertical pieces.  Sprinkle some sugar on it if you like it sweet.  Serve chilled.  Cool Papaya Method Peel the papaya.  Cut the papaya vertically into strips.  Cut the strips into equal square pieces.  Take A glass half filled with ice cubes and pour half of them into the glass. Make sure that the layer of ice is above the layer of papaya so that they cool to some limit. Papaya Chaat Method Want to linger your taste buds a little? Try this on. Peel papaya and cut into pieces.  Move all The paces to mixing bowl.  Add 3 tablespoons of sugar to half of the papaya.  Add 1/2 spoon of salt.  Mix a little and then add a speck of chaat masala to it.  Mix and then pour into a tray and mark each with a toothpick on top.  Fruit Salad Method Take 2 Bananas, 10-12 cherries, a mango, half papaya (finely cut in pieces), an orange, an apple, an avocado and a kiwi.  Crush the bananas.  Cut mango, apple avocado and kiwi in fine pieces.  Peel orange.  Now shift all the fruits to a bowl or your tiffin and you have a healthy fruit salad ready!  Papaya shake Peel papaya  Cut papaya into rough large pieces.  Shift into grinder with a half glass of milk and sugar according to your taste.  And Grind till thick.  Pour into glass and sip through it.  Mix fruit shake Get all the ingredients mentioned in the fruit salad method.  Now cut all of them in half and shift to the grinder.  Add a glass of milk and sugar according to taste.  Pour into glass And enjoy.  Papaya crush Take thin pieces of papaya and crush with the help of a spoon.  When crushed completely, Add a spoon of sugar, half spoon of salt, and ice.  Eat with the help of a spoon.  Papaya Freeze grind papaya with a complete tray of ice and sugar.  Pour into glass.  Try to eat as soon as prepared. ",
  "tyn_model":[
    "papaya",
    "sugar",
    "glass",
    "ice",
    "fruit salad",
    "toothpick",
    "salt",
    "bananas",
    "mango",
    "orange",
    "avocado",
    "grinder",
    "milk",
    "spoon",
    "clear glass bowl",
    "ice cubes",
    "mixing bowl",
    "chaat masala",
    "tray",
    "cherries",
    "apple",
    "bowl",
    "tiffin",
    "fruit shake"
  ],
  "tyn_section":[

  ]
}