{
  "title":"How to Fix Caramel Corn with Peanuts",
  "url":"https://www.wikihow.com/Fix-Caramel-Corn-with-Peanuts",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Nut Candies"
  ],
  "steps":[
    {
      "headline":"Take your cooking spray.",
      "description":""
    },
    {
      "headline":"Grease your pan.",
      "description":""
    },
    {
      "headline":"Combine the peanuts and popcorn into that pan.",
      "description":"Cook at 250 °F (121 °C) in your oven"
    },
    {
      "headline":"Making the Caramel Sauce",
      "description":""
    },
    {
      "headline":"Combine the corn syrup, butter, brown sugar and salt in that saucepan.",
      "description":""
    },
    {
      "headline":"Bring the combination to a boil",
      "description":""
    },
    {
      "headline":"Boil 5 minutes without stirring.",
      "description":"Take off of heat and let cool, then eventually you can stir in the vanilla and the baking soda"
    },
    {
      "headline":"Pour your warm good smelling caramel mixture over the now finished popcorn, and let bake the popcorn in oven for 1 hour at the old temperature, 250 °F (121 °C)",
      "description":""
    },
    {
      "headline":"Let cool and break apart with hands and store in that airtight container as needed in Things you Need",
      "description":""
    }
  ],
  "text":" Take your cooking spray.  Grease your pan.  Combine the peanuts and popcorn into that pan. Cook at 250 °F (121 °C) in your oven Making the Caramel Sauce  Combine the corn syrup, butter, brown sugar and salt in that saucepan.  Bring the combination to a boil  Boil 5 minutes without stirring. Take off of heat and let cool, then eventually you can stir in the vanilla and the baking soda Pour your warm good smelling caramel mixture over the now finished popcorn, and let bake the popcorn in oven for 1 hour at the old temperature, 250 °F (121 °C)  Let cool and break apart with hands and store in that airtight container as needed in Things you Need ",
  "tyn_model":[
    "popcorn",
    "cooking spray",
    "peanuts",
    "corn syrup",
    "butter",
    "brown sugar",
    "salt",
    "saucepan",
    "vanilla",
    "baking soda",
    "oven",
    "airtight container"
  ],
  "tyn_section":[

  ]
}