{
  "title":"How to Make Fish in the River",
  "url":"https://www.wikihow.com/Make-Fish-in-the-River",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking for Children",
    "Snacks for Kids"
  ],
  "parts":[
    {
      "name":"Preparing the Celery",
      "steps":[
        {
          "headline":"Break the celery.",
          "description":"Rip the celery into individual stalks from the root. It's very easy if you use one hand holding the celery and the other tearing a stalk away from the root."
        },
        {
          "headline":"Wash the celery stalks.",
          "description":"Under running water, rinse the celery stalk, making sure that no dirt is present along it."
        },
        {
          "headline":"Cut off the tops and bottoms.",
          "description":"Chop off about an inch (2.54 cm) from the bottom (so that no white is shown)."
        },
        {
          "headline":"Cut each stalk into pieces.",
          "description":"The size of the pieces is up to you."
        }
      ]
    },
    {
      "name":"Preparing the Cream Cheese",
      "steps":[
        {
          "headline":"Add the cream cheese to a medium sized bowl.",
          "description":""
        },
        {
          "headline":"Color the cream cheese.",
          "description":"Drop only one or two drops of food coloring onto the cream cheese."
        },
        {
          "headline":"Beat well.",
          "description":"Use a wooden spoon to incorporate the food coloring into the cream cheese until well blended."
        }
      ]
    },
    {
      "name":"Making the Snacks",
      "steps":[
        {
          "headline":"Spread the cream cheese onto the celery stalks.",
          "description":"Use a butter knife to carefully add the cream cheese into the \"log\" part of the stalks."
        },
        {
          "headline":"Add the Goldfish crackers.",
          "description":"Insert the crackers, standing upright, into the cream cheese. Keep each one of them slightly apart from another."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preparing the Celery Break the celery. Rip the celery into individual stalks from the root. It's very easy if you use one hand holding the celery and the other tearing a stalk away from the root. Wash the celery stalks. Under running water, rinse the celery stalk, making sure that no dirt is present along it. Cut off the tops and bottoms. Chop off about an inch (2.54 cm) from the bottom (so that no white is shown). Cut each stalk into pieces. The size of the pieces is up to you. Preparing the Cream Cheese Add the cream cheese to a medium sized bowl.  Color the cream cheese. Drop only one or two drops of food coloring onto the cream cheese. Beat well. Use a wooden spoon to incorporate the food coloring into the cream cheese until well blended. Making the Snacks Spread the cream cheese onto the celery stalks. Use a butter knife to carefully add the cream cheese into the \"log\" part of the stalks. Add the Goldfish crackers. Insert the crackers, standing upright, into the cream cheese. Keep each one of them slightly apart from another. Finished. ",
  "tyn_model":[
    "cream cheese",
    "celery",
    "food coloring",
    "water",
    "medium sized bowl",
    "wooden spoon",
    "butter knife",
    "goldfish crackers"
  ],
  "tyn_section":[

  ]
}