{
  "title":"How to Make Jalebis with Jalebi Maker",
  "url":"https://www.wikihow.com/Make-Jalebis-with-Jalebi-Maker",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Indian Desserts"
  ],
  "steps":[
    {
      "headline":"Add oil in a large frying pan.",
      "description":""
    },
    {
      "headline":"Add maida, wheat flour, Besan and baking soda in a utensil.",
      "description":""
    },
    {
      "headline":"Add water and mix them properly to form a smooth and lump free batter.",
      "description":""
    },
    {
      "headline":"Add water in a utensil and turn on the gas stove.",
      "description":""
    },
    {
      "headline":"Add batter into the jalebi maker.Observe the different jalebi makers-one with small and thin nozzle and big nozzle.",
      "description":""
    },
    {
      "headline":"Add sugar to the boiling water.",
      "description":""
    },
    {
      "headline":"Mix well with the help of a spoon till the sugar dissolves in the boiling water.",
      "description":""
    },
    {
      "headline":"Add saffron strands and cardamom powder into it.",
      "description":""
    },
    {
      "headline":"Remove the cap of the nozzle and add the batter into the oil to form small florets or net.",
      "description":""
    },
    {
      "headline":"Fry the jalebi florets in the oil.",
      "description":"Turn them and fry on the other side also. It is up to us whether the jalebis should be thin and crispy(they are more tasty) or thick and succulent(so that the sugar syrup is soaked into them)."
    },
    {
      "headline":"Check to see whether the sugar syrup is prepared or not.",
      "description":"This is done by placing the spoon in the syrup and lift it up. There should be one string of the syrup present formed."
    },
    {
      "headline":"Add fried jalebis into the sugar syrup.",
      "description":""
    },
    {
      "headline":"Press the jalebis lightly into the syrup so that they are soaked in it.",
      "description":""
    },
    {
      "headline":"Turn the jalebis on other side and repeat the above step.",
      "description":""
    },
    {
      "headline":"Place them in a plate to be served.",
      "description":""
    }
  ],
  "text":" Add oil in a large frying pan.  Add maida, wheat flour, Besan and baking soda in a utensil.  Add water and mix them properly to form a smooth and lump free batter.  Add water in a utensil and turn on the gas stove.  Add batter into the jalebi maker.Observe the different jalebi makers-one with small and thin nozzle and big nozzle.  Add sugar to the boiling water.  Mix well with the help of a spoon till the sugar dissolves in the boiling water.  Add saffron strands and cardamom powder into it.  Remove the cap of the nozzle and add the batter into the oil to form small florets or net.  Fry the jalebi florets in the oil. Turn them and fry on the other side also. It is up to us whether the jalebis should be thin and crispy(they are more tasty) or thick and succulent(so that the sugar syrup is soaked into them). Check to see whether the sugar syrup is prepared or not. This is done by placing the spoon in the syrup and lift it up. There should be one string of the syrup present formed. Add fried jalebis into the sugar syrup.  Press the jalebis lightly into the syrup so that they are soaked in it.  Turn the jalebis on other side and repeat the above step.  Place them in a plate to be served. ",
  "tyn_model":[
    "water",
    "oil",
    "sugar syrup",
    "spoon",
    "large frying",
    "wheat flour",
    "baking soda",
    "gas stove",
    "jalebi maker",
    "jalebi makers",
    "sugar",
    "saffron",
    "cardamom",
    "syrup",
    "plate"
  ],
  "tyn_section":[

  ]
}