{
  "title":"How to Make Swedish Meatballs",
  "url":"https://www.wikihow.com/Make-Swedish-Meatballs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat"
  ],
  "methods":[
    {
      "name":"Traditional Swedish Meatballs",
      "steps":[
        {
          "headline":"Preheat the oven to 200 degrees F (93 degrees C).",
          "description":"Tear the white bread into small pieces and soak them in a small bowl with the milk."
        },
        {
          "headline":"Melt 1 tablespoon of butter on a pan over medium heat.",
          "description":"Add the onion and cook until the onions are soft and lightly browned. Remove the pan from heat."
        },
        {
          "headline":"Combine the bread and milk mixture with the ground chuck, ground pork, egg yolks, and spices.",
          "description":"Beat the mixture for 1 to 2 minutes on medium speed in a stand mixer. Alternatively, you can mix the ingredients using your hands. Be sure to wear a pair of clean latex gloves."
        },
        {
          "headline":"Roll the meatballs into rounds and place them on a baking sheet.",
          "description":"They should be 2–3 inches (5.1–7.6 cm) in diameter and weigh about 1 ounce."
        },
        {
          "headline":"Place a sautée pan over medium-low heat and add the butter.",
          "description":"Once it has melted, add the meatballs and sauté them for about 8 to 10 minutes, or until golden brown."
        },
        {
          "headline":"Transfer the meatballs to two baking sheets and place them in the oven.",
          "description":""
        },
        {
          "headline":"Reduce the flame to low and add the flour to the pan.",
          "description":"Mix and cook the flour for 1 to 2 minutes, or until it has browned slightly. Slowly pour in the beef stock and continue to whisk until a thickened sauce is formed. Add the cream and continue to cook until the sauce is finished."
        },
        {
          "headline":"Remove the meatballs from the oven.",
          "description":"Drizzle the gravy over the meatballs and serve. Meatballs can be eaten on their own as a side dish or appetizer, or can be served over fettuccine for a main course."
        }
      ]
    },
    {
      "name":"Quick and Easy Swedish Meatballs",
      "steps":[
        {
          "headline":"Preheat the oven to 475 degrees F (246 degrees C).",
          "description":"Combine the beef, pork, breadcrumbs, ½ cup milk, eggs, garlic, and allspice in a large bowl. Sprinkle with salt and pepper, and then mix everything together."
        },
        {
          "headline":"Roll the mixture into meatballs and place them on two rimmed baking sheets.",
          "description":"The meatballs should be about 2 inches (5.1 cm) in diameter."
        },
        {
          "headline":"Place them in the oven and bake for 10-12 minutes.",
          "description":"Rotate the sheets halfway through so that the meat cooks evenly. The meatballs should be lightly browned and cooked through."
        },
        {
          "headline":"Melt the butter in a medium-sized saucepan over medium-high heat.",
          "description":"Add the flour, whisking for one minute. Slowly whisk in the beef broth and the remaining cup of milk."
        },
        {
          "headline":"Bring the mixture to a boil and then reduce it to a simmer.",
          "description":"Allow the sauce to continue cooking for another 2 to 3 minutes until it thickens. Remove from heat."
        },
        {
          "headline":"Place the meatballs in a serving dish.",
          "description":"Pour the sauce evenly over the meatballs and serve immediately. The meatballs can be eaten on their own as appetizers or served over pasta as a main dish."
        }
      ]
    }
  ],
  "text":" Traditional Swedish Meatballs Preheat the oven to 200 degrees F (93 degrees C). Tear the white bread into small pieces and soak them in a small bowl with the milk. Melt 1 tablespoon of butter on a pan over medium heat. Add the onion and cook until the onions are soft and lightly browned. Remove the pan from heat. Combine the bread and milk mixture with the ground chuck, ground pork, egg yolks, and spices. Beat the mixture for 1 to 2 minutes on medium speed in a stand mixer. Alternatively, you can mix the ingredients using your hands. Be sure to wear a pair of clean latex gloves. Roll the meatballs into rounds and place them on a baking sheet. They should be 2–3 inches (5.1–7.6 cm) in diameter and weigh about 1 ounce. Place a sautée pan over medium-low heat and add the butter. Once it has melted, add the meatballs and sauté them for about 8 to 10 minutes, or until golden brown. Transfer the meatballs to two baking sheets and place them in the oven.  Reduce the flame to low and add the flour to the pan. Mix and cook the flour for 1 to 2 minutes, or until it has browned slightly. Slowly pour in the beef stock and continue to whisk until a thickened sauce is formed. Add the cream and continue to cook until the sauce is finished. Remove the meatballs from the oven. Drizzle the gravy over the meatballs and serve. Meatballs can be eaten on their own as a side dish or appetizer, or can be served over fettuccine for a main course. Quick and Easy Swedish Meatballs Preheat the oven to 475 degrees F (246 degrees C). Combine the beef, pork, breadcrumbs, ½ cup milk, eggs, garlic, and allspice in a large bowl. Sprinkle with salt and pepper, and then mix everything together. Roll the mixture into meatballs and place them on two rimmed baking sheets. The meatballs should be about 2 inches (5.1 cm) in diameter. Place them in the oven and bake for 10-12 minutes. Rotate the sheets halfway through so that the meat cooks evenly. The meatballs should be lightly browned and cooked through. Melt the butter in a medium-sized saucepan over medium-high heat. Add the flour, whisking for one minute. Slowly whisk in the beef broth and the remaining cup of milk. Bring the mixture to a boil and then reduce it to a simmer. Allow the sauce to continue cooking for another 2 to 3 minutes until it thickens. Remove from heat. Place the meatballs in a serving dish. Pour the sauce evenly over the meatballs and serve immediately. The meatballs can be eaten on their own as appetizers or served over pasta as a main dish.",
  "tyn_model":[
    "oven",
    "milk",
    "butter",
    "flour",
    "baking sheets",
    "swedish meatballs",
    "white bread",
    "onion",
    "bread",
    "ground chuck",
    "ground pork",
    "egg yolks",
    "spices",
    "stand mixer",
    "baking sheet",
    "sautée pan",
    "beef stock",
    "cream",
    "fettuccine",
    "beef",
    "pork",
    "eggs",
    "garlic",
    "allspice",
    "large bowl",
    "salt and pepper",
    "medium-sized saucepan",
    "beef broth",
    "serving dish",
    "pasta"
  ],
  "tyn_section":[

  ]
}