{
  "title":"How to Thicken Stew",
  "url":"https://www.wikihow.com/Thicken-Stew",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "methods":[
    {
      "name":"Adding Starch",
      "steps":[
        {
          "headline":"Use cornflour or cornstarch.",
          "description":"Mix a tablespoon (5 grams) of cornflour or cornstarch into 1 tablespoon (15 mL) of water. Stir them together to make a paste, then add the paste to the stew. Stir the stew until the paste is fully mixed. Cook for 2 minutes over medium heat to allow the cornstarch to mix into the soup. Check the consistency of the stew and add more paste if necessary. Remember to cook the soup for 2 more minutes after adding the paste. Arrowroot can be substituted for cornflour or cornstarch. It has a more neutral flavor than cornstarch and can be used at varying temperatures without losing its ability to thicken foods."
        },
        {
          "headline":"Sprinkle in breadcrumbs or pieces of bread for a handy fix.",
          "description":"Stir the bread into the stew, then give it time to soak in the liquid. Check the consistency after a few minutes. Bread has a mild flavor, so it shouldn't alter the taste of your stew. If your stew is still too watery, add more breadcrumbs or pieces of bread. However, too much can alter the flavor. You can use fresh, dried, or frozen bread crumbs. If you’re using fresh bread, it’s best to choose white bread."
        },
        {
          "headline":"Add mashed potatoes for a creamier broth.",
          "description":"For an easy option, remove potatoes from the stew and mash them. If you like a lot of potatoes in your stew, make a separate pot of mashed potatoes by boiling peeled potatoes, then mashing them. Add a dollop of mashed potatoes back to the stew. Stir the mashed potatoes into the stew, mixing it into the broth. Continue to add potatoes until the broth reaches your desired consistency. Another easy option is to sprinkle dried mashed potato flakes into the stew. Add the flakes in small amounts, stirring and checking the consistency until it reaches the thickness you prefer. Potatoes have a neutral taste and will not significantly alter the flavor of your stew."
        },
        {
          "headline":"Stir in a tablespoon (5 grams) of oats into the broth.",
          "description":"Wait a few minutes to see how much liquid is soaked up, stirring often. Add more oats if the stew still isn’t thick enough. However, don’t add too much, as it may alter the flavor. Ground quick oats are your best option. How much you can add without altering the flavor will depend on how much stew you are making."
        },
        {
          "headline":"Make a roux using flour and butter.",
          "description":"Add equal parts butter and flour to a clean saucepan. Heat them over medium or medium-low heat, stirring constantly to prevent burning. Cook the roux for 10 minutes, after which it should have a brownish-red color. Add small amounts of roux to the stew, stirring to combine. Continue to add roux to the stew until you reach your desired consistency. It’s importantly to add the roux gradually to avoid having lumps in your stew. The roux should enhance the flavor of the stew. Vegetable oil can be substituted for the butter, if you prefer."
        },
        {
          "headline":"Create a flour paste for an easy option.",
          "description":"Mix equal parts flour and water to create a paste. Then, add small dollops of the paste to your stew, stirring until it’s completely mixed. Bring the stew back to a boil so that the flour taste will dissipate. If necessary, add more paste until the stew reaches the thickness you desire. Flour can alter the taste of your stew, so use it sparingly. You may find the taste of the uncooked flour unpleasant. Don’t add too much of the paste to your soup, as the flour could cause lumps. Similarly, you should add it slowly."
        }
      ]
    },
    {
      "name":"Pureeing Part of the Stew",
      "steps":[
        {
          "headline":"Scoop out a portion of the stew.",
          "description":"Use a large mixing spoon or ladle to limit the risk that you’ll burn yourself. Start with 1 to 2 cups (0.24 to 0.47 L). You can always puree more if necessary. Although you can puree any part of your stew, root vegetables like carrots and potatoes are easiest. Pureeing is a great option for when you want to maintain the flavor of the soup and aren’t worried about cutting down on solid ingredients. Be careful when handling the stew, as it will be very hot. You could get burned, especially while blending it. Move slowly, and use towels to handle the blender or food processor and its lid."
        },
        {
          "headline":"Place the removed portion into a blender or food processor.",
          "description":"Carefully pour the stew into the canister, only filling it halfway. Remember that it will quickly heat the canister, so use a towel when handling it. If you want to blend more stew than fits into half of the blender or food processor container, do them in separate batches. Overfilling the canister will make it harder to chop up the solid pieces."
        },
        {
          "headline":"Blend the stew until it’s smooth.",
          "description":"You may need to turn off the blender or food processor intermittently, stirring to redistribute the solids. Continue blending until the stew is a thick liquid. If your blender has settings, use the puree setting."
        },
        {
          "headline":"Add the blended stew back to the pot.",
          "description":"Slowly pour it back in to minimize the risk of splashing. Then, stir the stew to properly mix the pureed stew into the broth. If it isn’t thick enough, you can scoop out more solids and repeat the process."
        }
      ]
    },
    {
      "name":"Boiling Off Excess Liquid",
      "steps":[
        {
          "headline":"Remove the lid from the stew.",
          "description":"You’ll continue cooking the stew without the lid. This allows the steam to escape from the pot, rather than trapping it, which keeps the stew thin and watery. Keep in mind that this will make the flavor of your stew more concentrated, which may make it too strong. For example, it could taste very salty."
        },
        {
          "headline":"Bring the stew to a gentle boil on medium-high heat.",
          "description":"You want to create a slow boil, so use the lowest setting that allows you to maintain a boil. Watch the stew to make sure that it doesn’t start to burn. Turn down the heat if it starts to boil too much."
        },
        {
          "headline":"Stir the soup until it reaches your desired thickness.",
          "description":"Use a large plastic or wooden spoon. Constantly stirring will help avoid burning the soup. Additionally, you’ll be able to better monitor the thickness. Stand back from the pot, as the evaporating steam could burn your skin."
        },
        {
          "headline":"Remove the stew from the heat once the liquid has boiled down.",
          "description":"Turn off your burner and move the pot to a cool part of the stove or a cooling pad. Allow the soup to cool for a few minutes, stirring occasionally."
        }
      ]
    }
  ],
  "text":" Adding Starch Use cornflour or cornstarch. Mix a tablespoon (5 grams) of cornflour or cornstarch into 1 tablespoon (15 mL) of water. Stir them together to make a paste, then add the paste to the stew. Stir the stew until the paste is fully mixed. Cook for 2 minutes over medium heat to allow the cornstarch to mix into the soup. Check the consistency of the stew and add more paste if necessary. Remember to cook the soup for 2 more minutes after adding the paste. Arrowroot can be substituted for cornflour or cornstarch. It has a more neutral flavor than cornstarch and can be used at varying temperatures without losing its ability to thicken foods. Sprinkle in breadcrumbs or pieces of bread for a handy fix. Stir the bread into the stew, then give it time to soak in the liquid. Check the consistency after a few minutes. Bread has a mild flavor, so it shouldn't alter the taste of your stew. If your stew is still too watery, add more breadcrumbs or pieces of bread. However, too much can alter the flavor. You can use fresh, dried, or frozen bread crumbs. If you’re using fresh bread, it’s best to choose white bread. Add mashed potatoes for a creamier broth. For an easy option, remove potatoes from the stew and mash them. If you like a lot of potatoes in your stew, make a separate pot of mashed potatoes by boiling peeled potatoes, then mashing them. Add a dollop of mashed potatoes back to the stew. Stir the mashed potatoes into the stew, mixing it into the broth. Continue to add potatoes until the broth reaches your desired consistency. Another easy option is to sprinkle dried mashed potato flakes into the stew. Add the flakes in small amounts, stirring and checking the consistency until it reaches the thickness you prefer. Potatoes have a neutral taste and will not significantly alter the flavor of your stew. Stir in a tablespoon (5 grams) of oats into the broth. Wait a few minutes to see how much liquid is soaked up, stirring often. Add more oats if the stew still isn’t thick enough. However, don’t add too much, as it may alter the flavor. Ground quick oats are your best option. How much you can add without altering the flavor will depend on how much stew you are making. Make a roux using flour and butter. Add equal parts butter and flour to a clean saucepan. Heat them over medium or medium-low heat, stirring constantly to prevent burning. Cook the roux for 10 minutes, after which it should have a brownish-red color. Add small amounts of roux to the stew, stirring to combine. Continue to add roux to the stew until you reach your desired consistency. It’s importantly to add the roux gradually to avoid having lumps in your stew. The roux should enhance the flavor of the stew. Vegetable oil can be substituted for the butter, if you prefer. Create a flour paste for an easy option. Mix equal parts flour and water to create a paste. Then, add small dollops of the paste to your stew, stirring until it’s completely mixed. Bring the stew back to a boil so that the flour taste will dissipate. If necessary, add more paste until the stew reaches the thickness you desire. Flour can alter the taste of your stew, so use it sparingly. You may find the taste of the uncooked flour unpleasant. Don’t add too much of the paste to your soup, as the flour could cause lumps. Similarly, you should add it slowly. Pureeing Part of the Stew Scoop out a portion of the stew. Use a large mixing spoon or ladle to limit the risk that you’ll burn yourself. Start with 1 to 2 cups (0.24 to 0.47 L). You can always puree more if necessary. Although you can puree any part of your stew, root vegetables like carrots and potatoes are easiest. Pureeing is a great option for when you want to maintain the flavor of the soup and aren’t worried about cutting down on solid ingredients. Be careful when handling the stew, as it will be very hot. You could get burned, especially while blending it. Move slowly, and use towels to handle the blender or food processor and its lid. Place the removed portion into a blender or food processor. Carefully pour the stew into the canister, only filling it halfway. Remember that it will quickly heat the canister, so use a towel when handling it. If you want to blend more stew than fits into half of the blender or food processor container, do them in separate batches. Overfilling the canister will make it harder to chop up the solid pieces. Blend the stew until it’s smooth. You may need to turn off the blender or food processor intermittently, stirring to redistribute the solids. Continue blending until the stew is a thick liquid. If your blender has settings, use the puree setting. Add the blended stew back to the pot. Slowly pour it back in to minimize the risk of splashing. Then, stir the stew to properly mix the pureed stew into the broth. If it isn’t thick enough, you can scoop out more solids and repeat the process. Boiling Off Excess Liquid Remove the lid from the stew. You’ll continue cooking the stew without the lid. This allows the steam to escape from the pot, rather than trapping it, which keeps the stew thin and watery. Keep in mind that this will make the flavor of your stew more concentrated, which may make it too strong. For example, it could taste very salty. Bring the stew to a gentle boil on medium-high heat. You want to create a slow boil, so use the lowest setting that allows you to maintain a boil. Watch the stew to make sure that it doesn’t start to burn. Turn down the heat if it starts to boil too much. Stir the soup until it reaches your desired thickness. Use a large plastic or wooden spoon. Constantly stirring will help avoid burning the soup. Additionally, you’ll be able to better monitor the thickness. Stand back from the pot, as the evaporating steam could burn your skin. Remove the stew from the heat once the liquid has boiled down. Turn off your burner and move the pot to a cool part of the stove or a cooling pad. Allow the soup to cool for a few minutes, stirring occasionally.",
  "tyn_model":[
    "potatoes",
    "flour",
    "cornstarch",
    "blender",
    "bread",
    "food processor",
    "pot",
    "cornflour",
    "broth",
    "oats",
    "butter",
    "roux",
    "water",
    "mashed potatoes",
    "canister",
    "arrowroot",
    "mashed potato",
    "saucepan",
    "vegetable oil",
    "mixing spoon",
    "ladle",
    "carrots",
    "towels",
    "puree",
    "soup",
    "spoon",
    "burner",
    "stove"
  ],
  "tyn_section":[

  ]
}