{
  "title":"How to Pack a Healthy Lunch",
  "url":"https://www.wikihow.com/Pack-a-Healthy-Lunch",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Meal Planning"
  ],
  "methods":[
    {
      "name":"Packing Healthy Main Dishes",
      "steps":[
        {
          "headline":"Include mostly fruits, veggies, proteins, and whole grains.",
          "description":"When trying to eat healthier, the main thing you want to focus on is increasing the number of fruits and veggies you eat. Add a serving of protein and a serving of whole grains to a fruit-and-veggie-based lunch, and you’ve got yourself a healthy lunch that will keep you full for hours. Salads, soups, and sandwiches on whole-grain bread are perfect ideas for healthy lunch-packing recipes, which is probably why they are so often on lunch menus!"
        },
        {
          "headline":"Prepare some lunch dishes on Sunday to save time in the mornings.",
          "description":"Prepare some large batches of salad, soup, or another healthy recipe on Sundays to pack into containers for your week. Refrigerate the containers, and in the mornings you can just grab a container on your way out the door. This time-saving technique is quite popular; all you need are 2-5 lunch containers and groceries for your recipes."
        },
        {
          "headline":"Bring leftovers if you cook dinner throughout the week.",
          "description":"If you make a large healthy dinner, like whole grain pasta with veggies, pack some away in a container and refrigerate it for the next day. Then you already have a lunch that’s ready to go when you’re leaving in the morning. You can also get creative with your leftovers by transforming them into something new for lunch. For instance, if you made burritos for dinner you can put some burrito filling into a container of lettuce and chopped tomatoes, toss some shredded cheddar and sliced avocado on top, and you have yourself a taco salad for lunch."
        },
        {
          "headline":"Try slow-cooker pulled-chicken sandwiches for a week’s worth of lunch.",
          "description":"Cook 3 boneless, skinless chicken thighs with 4  fl oz (120 mL) pineapple juice, 1/4 tsp (0.57 g) paprika, and salt and pepper to taste in a slow cooker set to high for 2 hours. When it’s finished, shred the cooked chicken with a fork and drain the excess liquid from it. Combine the chicken in a large bowl with 8 oz (230 g) corn and 2 oz (57 g) fresh torn basil.Assemble 4 sandwiches using ¼ of the chicken mixture with ¼ sliced avocado and ¼ sliced red onion between 2 slices of whole grain bread. To make this recipe last 4 days, make 1 sandwich and refrigerate the rest of the chicken mixture, avocado, and onion. Use the ingredients to make a new sandwich the night before or the morning of your workday."
        },
        {
          "headline":"Make a grain salad with smoked turkey to last a couple days.",
          "description":"Place 1 cup of farro, barley, or quinoa in a medium saucepan, cover it with water by 2 in (5.1 cm), and cook it uncovered until tender for 15-25 minutes. Rinse it with cold water in a colander, and toss it in a bowl with 3 US tbsp (44 mL) red wine vinegar, 6 oz (170 g) cubed smoked turkey, 4 oz (110 g) cubed smoked cheddar, 1 chopped yellow bell pepper, 1 chopped celery stalk, 1 diced avocado, and 6 oz (170 g) sun-dried tomatoes.Transfer half of the salad to your lunch container and the rest of it to another container to use the next day. Keep the salad refrigerated until you eat it."
        }
      ]
    },
    {
      "name":"Trying Healthy Side Dishes",
      "steps":[
        {
          "headline":"Use a quality insulated lunch bag that keeps items cold.",
          "description":"It’s so important to have your salads tasting fresh and crisp when you eat them; otherwise, you won’t be motivated to pack. Shop around online or in department stores that sell food-packing gear to find a bag that fits your containers, and maybe an ice pack if you don’t have access to a refrigerator at work or the weather is especially hot when you travel."
        },
        {
          "headline":"Try cobb salad with shrimp as a no-cook option.",
          "description":"Chop 3 hearts of romaine lettuce and 5 slices of cucumber and add them to your favorite reusable lunch container. Slice 1 hard-boiled egg, and add it to the container along with 5 cherry tomatoes and 5 cooked, peeled shrimp. Drizzle the salad with 2 US tbsp (30 mL) of your favorite light salad dressing. Prepare this easy salad the night before work and leave it in the refrigerator overnight. Pack it in an insulated bag to bring with you in the morning."
        },
        {
          "headline":"Try a peanut-kale-chicken salad with sweet potatoes for something different.",
          "description":"Chop 1 small cooked chicken breast and combine it in a bowl with 2 chopped, cooked, medium sweet potatoes. In a separate small bowl, whisk 1.5 tbsp (22 g) of peanut butter with juice from 1 lemon and 2 US tbsp (30 mL) olive oil. Massage the dressing into 32 oz (910 g) chopped kale leaves in a large bowl. Combine the kale leaves, chicken, and sweet potatoes with 1 sliced apple in your large bowl. Put half the salad into your lunch container and the rest into another container for the next day. Keep the salad cold until you eat it."
        },
        {
          "headline":"Make a quinoa, spinach, pear and goat cheese salad as a vegetarian option.",
          "description":"Whisk 2  tsp (9.9 mL) balsamic vinegar with 1.5  tsp (7.4 mL) olive oil and some salt and pepper to taste in a small bowl. Core and cut a medium pear into thin slices; combine the pear and dressing with 16 oz (450 g) spinach and 4 oz (110 g) cooked quinoa. Top your salad with 2 oz (57 g) goat cheese and pack it in your lunch container. Keep it refrigerated until you eat it."
        },
        {
          "headline":"Make chickpea quinoa tabbouleh as a vegan option.",
          "description":"Cook 4 oz (110 g) uncooked quinoa by covering it with water in a saucepan and letting the water boil; turn the heat down, cover the pot, and let the quinoa cook for 13 minutes. Combine 16 oz (450 g) sliced cherry tomatoes, 8 oz (230 g) chopped parsley, 2 oz (57 g) chopped fresh mint, 8 oz (230 g) chopped spinach, ½ a chopped red onion, 12 oz (340 g) chopped cucumber, 1 15 oz (430 g) can of rinsed chickpeas, 2 US tbsp (30 mL) olive oil, and juice from 3 lemons in a large bowl. Add the cooked quinoa, stir the salad, and season it with garlic powder, salt, and pepper to taste. Spoon ¼ of the salad into a lunch container and save the rest for lunches throughout the week. Keep the salad refrigerated until you eat it."
        }
      ]
    },
    {
      "name":"Choosing Healthy Snacks and Drinks",
      "steps":[
        {
          "headline":"Reduce high-fat foods and processed grains and snacks.",
          "description":"White flours and processed snacks have a high sugar content that adds tons of empty calories to your meals. The same goes for the oils in fried foods, dressings, and butter. You want to keep these items to a minimum or remove them completely from your diet if you’re trying to eat healthily. When adding snacks to your lunches, consider fresh fruit, raw veggies, nuts, or whole grain crackers in place of chips or candy."
        },
        {
          "headline":"Invest in some lunch containers with separate sections.",
          "description":"One trick to eating more raw fruits and veggies is by having containers that allow space for them. You can put a main dish item in one section, then easily fill the others with carrot sticks, bell pepper slices, berries, peeled orange sections, or any other snackable raw fruit or veggie. The sectional meal method is especially popular with kids, but people of any age can eat healthier by using it."
        },
        {
          "headline":"Pack a reusable water bottle.",
          "description":"Invest in a quality reusable water bottle that you like. Drink water at lunch time, as well as throughout the day, to stay hydrated. Avoid buying sugary vending-machine sodas, teas, or juices. These items pack on the calories and add no nutritional value to your meal. If you want something other than water at your lunch time, consider packing fat-free milk, a milk alternative such as soy or almond milk, or unsweetened sparkling water. Be sure that you have access to a refrigerator for your lunch if you pack milk."
        }
      ]
    },
    {
      "name":"Trying Healthy Kid-Friendly Meals",
      "steps":[
        {
          "headline":"Go for a fish-theme.",
          "description":"Make a tuna sandwich by combining 1 can of tuna with 1.5 tbsp (21 g) of light mayonnaise and spreading it and some lettuce between 2 slices of whole grain bread. In a lunch container with 4 sections, place the sandwich in 1 section, 10 baby carrots with 2 US tbsp (30 mL) light ranch dip in another section, a plum or other piece of raw fruit in the third section, and 2 oz (57 g) goldfish crackers in the last section.Try cutting the sandwich into a fish shape as an extra cute option. Simply cut 2 small wedges in from the top and bottom on the left side to make the tail, then cut 2 slivers off the top and bottom of the right side to make the fish nose."
        },
        {
          "headline":"Try a breakfast-for-lunch-theme.",
          "description":"Cook a hard-boiled egg by placing an egg in a pot of boiling water, turning the heat off, and covering the pot for 13 minutes. Take the egg out of the water and let it cool completely, then peel and slice it. In a 4-section lunch container, add the sliced egg and 2 mini waffles into 1 section, a sliced kiwi and some blackberries in the second section, a bell pepper cored and cut into strips in the third section, and a mini corn muffin in the last section. Choose your child’s favorite color – red, orange, yellow, or green, when buying a bell pepper for their lunch."
        },
        {
          "headline":"Create a finger-food theme.",
          "description":"In a 4-section lunch container, place 8 oz (230 g) broccoli and cauliflower florets with 2 US tbsp (30 mL) light raspberry dressing in 1 section, 4 oz (110 g) blueberries in the second section, a piece of unwrapped string cheese and handful of whole grain crackers in the third section, and a slice of banana bread in the last section. Substitute strawberries or raspberries if your child prefers."
        },
        {
          "headline":"Try a gluten-free Mexican-theme.",
          "description":"It’s so easy to make Mexican recipes gluten-free! Make a bean salad by combining 1 can black beans, 1 can kidney, and 1 can pinto beans and 8 oz (230 g) corn into a colander and rinsing them. Transfer the beans and corn into a bowl and mix them with 2 US tbsp (30 mL) olive oil, 2 US tbsp (30 mL) red wine vinegar, juice from 2 limes, 1 tbsp (12.5 g) of sugar, and salt and pepper to taste. Add 8 oz (230 g) bean salad to a section of a 4-section lunch container. For the remaining 3 sections of the container, add a handful of corn tortilla chips and 2 US tbsp (30 mL) salsa to 1 section, 8 small cubes of cheddar cheese to another section, and 4 oz (110 g) melon wedges to the last section."
        }
      ]
    }
  ],
  "text":" Packing Healthy Main Dishes Include mostly fruits, veggies, proteins, and whole grains. When trying to eat healthier, the main thing you want to focus on is increasing the number of fruits and veggies you eat. Add a serving of protein and a serving of whole grains to a fruit-and-veggie-based lunch, and you’ve got yourself a healthy lunch that will keep you full for hours. Salads, soups, and sandwiches on whole-grain bread are perfect ideas for healthy lunch-packing recipes, which is probably why they are so often on lunch menus! Prepare some lunch dishes on Sunday to save time in the mornings. Prepare some large batches of salad, soup, or another healthy recipe on Sundays to pack into containers for your week. Refrigerate the containers, and in the mornings you can just grab a container on your way out the door. This time-saving technique is quite popular; all you need are 2-5 lunch containers and groceries for your recipes. Bring leftovers if you cook dinner throughout the week. If you make a large healthy dinner, like whole grain pasta with veggies, pack some away in a container and refrigerate it for the next day. Then you already have a lunch that’s ready to go when you’re leaving in the morning. You can also get creative with your leftovers by transforming them into something new for lunch. For instance, if you made burritos for dinner you can put some burrito filling into a container of lettuce and chopped tomatoes, toss some shredded cheddar and sliced avocado on top, and you have yourself a taco salad for lunch. Try slow-cooker pulled-chicken sandwiches for a week’s worth of lunch. Cook 3 boneless, skinless chicken thighs with 4  fl oz (120 mL) pineapple juice, 1/4 tsp (0.57 g) paprika, and salt and pepper to taste in a slow cooker set to high for 2 hours. When it’s finished, shred the cooked chicken with a fork and drain the excess liquid from it. Combine the chicken in a large bowl with 8 oz (230 g) corn and 2 oz (57 g) fresh torn basil.Assemble 4 sandwiches using ¼ of the chicken mixture with ¼ sliced avocado and ¼ sliced red onion between 2 slices of whole grain bread. To make this recipe last 4 days, make 1 sandwich and refrigerate the rest of the chicken mixture, avocado, and onion. Use the ingredients to make a new sandwich the night before or the morning of your workday. Make a grain salad with smoked turkey to last a couple days. Place 1 cup of farro, barley, or quinoa in a medium saucepan, cover it with water by 2 in (5.1 cm), and cook it uncovered until tender for 15-25 minutes. Rinse it with cold water in a colander, and toss it in a bowl with 3 US tbsp (44 mL) red wine vinegar, 6 oz (170 g) cubed smoked turkey, 4 oz (110 g) cubed smoked cheddar, 1 chopped yellow bell pepper, 1 chopped celery stalk, 1 diced avocado, and 6 oz (170 g) sun-dried tomatoes.Transfer half of the salad to your lunch container and the rest of it to another container to use the next day. Keep the salad refrigerated until you eat it. Trying Healthy Side Dishes Use a quality insulated lunch bag that keeps items cold. It’s so important to have your salads tasting fresh and crisp when you eat them; otherwise, you won’t be motivated to pack. Shop around online or in department stores that sell food-packing gear to find a bag that fits your containers, and maybe an ice pack if you don’t have access to a refrigerator at work or the weather is especially hot when you travel. Try cobb salad with shrimp as a no-cook option. Chop 3 hearts of romaine lettuce and 5 slices of cucumber and add them to your favorite reusable lunch container. Slice 1 hard-boiled egg, and add it to the container along with 5 cherry tomatoes and 5 cooked, peeled shrimp. Drizzle the salad with 2 US tbsp (30 mL) of your favorite light salad dressing. Prepare this easy salad the night before work and leave it in the refrigerator overnight. Pack it in an insulated bag to bring with you in the morning. Try a peanut-kale-chicken salad with sweet potatoes for something different. Chop 1 small cooked chicken breast and combine it in a bowl with 2 chopped, cooked, medium sweet potatoes. In a separate small bowl, whisk 1.5 tbsp (22 g) of peanut butter with juice from 1 lemon and 2 US tbsp (30 mL) olive oil. Massage the dressing into 32 oz (910 g) chopped kale leaves in a large bowl. Combine the kale leaves, chicken, and sweet potatoes with 1 sliced apple in your large bowl. Put half the salad into your lunch container and the rest into another container for the next day. Keep the salad cold until you eat it. Make a quinoa, spinach, pear and goat cheese salad as a vegetarian option. Whisk 2  tsp (9.9 mL) balsamic vinegar with 1.5  tsp (7.4 mL) olive oil and some salt and pepper to taste in a small bowl. Core and cut a medium pear into thin slices; combine the pear and dressing with 16 oz (450 g) spinach and 4 oz (110 g) cooked quinoa. Top your salad with 2 oz (57 g) goat cheese and pack it in your lunch container. Keep it refrigerated until you eat it. Make chickpea quinoa tabbouleh as a vegan option. Cook 4 oz (110 g) uncooked quinoa by covering it with water in a saucepan and letting the water boil; turn the heat down, cover the pot, and let the quinoa cook for 13 minutes. Combine 16 oz (450 g) sliced cherry tomatoes, 8 oz (230 g) chopped parsley, 2 oz (57 g) chopped fresh mint, 8 oz (230 g) chopped spinach, ½ a chopped red onion, 12 oz (340 g) chopped cucumber, 1 15 oz (430 g) can of rinsed chickpeas, 2 US tbsp (30 mL) olive oil, and juice from 3 lemons in a large bowl. Add the cooked quinoa, stir the salad, and season it with garlic powder, salt, and pepper to taste. Spoon ¼ of the salad into a lunch container and save the rest for lunches throughout the week. Keep the salad refrigerated until you eat it. Choosing Healthy Snacks and Drinks Reduce high-fat foods and processed grains and snacks. White flours and processed snacks have a high sugar content that adds tons of empty calories to your meals. The same goes for the oils in fried foods, dressings, and butter. You want to keep these items to a minimum or remove them completely from your diet if you’re trying to eat healthily. When adding snacks to your lunches, consider fresh fruit, raw veggies, nuts, or whole grain crackers in place of chips or candy. Invest in some lunch containers with separate sections. One trick to eating more raw fruits and veggies is by having containers that allow space for them. You can put a main dish item in one section, then easily fill the others with carrot sticks, bell pepper slices, berries, peeled orange sections, or any other snackable raw fruit or veggie. The sectional meal method is especially popular with kids, but people of any age can eat healthier by using it. Pack a reusable water bottle. Invest in a quality reusable water bottle that you like. Drink water at lunch time, as well as throughout the day, to stay hydrated. Avoid buying sugary vending-machine sodas, teas, or juices. These items pack on the calories and add no nutritional value to your meal. If you want something other than water at your lunch time, consider packing fat-free milk, a milk alternative such as soy or almond milk, or unsweetened sparkling water. Be sure that you have access to a refrigerator for your lunch if you pack milk. Trying Healthy Kid-Friendly Meals Go for a fish-theme. Make a tuna sandwich by combining 1 can of tuna with 1.5 tbsp (21 g) of light mayonnaise and spreading it and some lettuce between 2 slices of whole grain bread. In a lunch container with 4 sections, place the sandwich in 1 section, 10 baby carrots with 2 US tbsp (30 mL) light ranch dip in another section, a plum or other piece of raw fruit in the third section, and 2 oz (57 g) goldfish crackers in the last section.Try cutting the sandwich into a fish shape as an extra cute option. Simply cut 2 small wedges in from the top and bottom on the left side to make the tail, then cut 2 slivers off the top and bottom of the right side to make the fish nose. Try a breakfast-for-lunch-theme. Cook a hard-boiled egg by placing an egg in a pot of boiling water, turning the heat off, and covering the pot for 13 minutes. Take the egg out of the water and let it cool completely, then peel and slice it. In a 4-section lunch container, add the sliced egg and 2 mini waffles into 1 section, a sliced kiwi and some blackberries in the second section, a bell pepper cored and cut into strips in the third section, and a mini corn muffin in the last section. Choose your child’s favorite color – red, orange, yellow, or green, when buying a bell pepper for their lunch. Create a finger-food theme. In a 4-section lunch container, place 8 oz (230 g) broccoli and cauliflower florets with 2 US tbsp (30 mL) light raspberry dressing in 1 section, 4 oz (110 g) blueberries in the second section, a piece of unwrapped string cheese and handful of whole grain crackers in the third section, and a slice of banana bread in the last section. Substitute strawberries or raspberries if your child prefers. Try a gluten-free Mexican-theme. It’s so easy to make Mexican recipes gluten-free! Make a bean salad by combining 1 can black beans, 1 can kidney, and 1 can pinto beans and 8 oz (230 g) corn into a colander and rinsing them. Transfer the beans and corn into a bowl and mix them with 2 US tbsp (30 mL) olive oil, 2 US tbsp (30 mL) red wine vinegar, juice from 2 limes, 1 tbsp (12.5 g) of sugar, and salt and pepper to taste. Add 8 oz (230 g) bean salad to a section of a 4-section lunch container. For the remaining 3 sections of the container, add a handful of corn tortilla chips and 2 US tbsp (30 mL) salsa to 1 section, 8 small cubes of cheddar cheese to another section, and 4 oz (110 g) melon wedges to the last section.",
  "tyn_model":[
    "water",
    "chicken",
    "lunch container",
    "avocado",
    "large bowl",
    "olive oil",
    "salt and pepper",
    "corn",
    "quinoa",
    "bowl",
    "refrigerator",
    "sweet potatoes",
    "spinach",
    "bell pepper",
    "containers",
    "container",
    "lettuce",
    "red onion",
    "whole grain bread",
    "smoked turkey",
    "colander",
    "red wine vinegar",
    "shrimp",
    "cucumber",
    "cherry tomatoes",
    "small bowl",
    "kale",
    "goat cheese",
    "pot",
    "whole grain crackers",
    "water bottle",
    "milk",
    "veggies",
    "proteins",
    "grains",
    "protein",
    "whole grains",
    "sandwiches",
    "whole-grain bread",
    "lunch containers",
    "tomatoes",
    "taco salad",
    "slow-cooker pulled-chicken",
    "pineapple juice",
    "paprika",
    "slow cooker",
    "fork",
    "basil",
    "onion",
    "farro, barley",
    "medium saucepan",
    "cold water",
    "smoked cheddar",
    "yellow bell pepper",
    "celery",
    "sun-dried tomatoes",
    "salads",
    "ice pack",
    "cobb salad",
    "romaine lettuce",
    "hard-boiled egg",
    "salad dressing",
    "insulated bag",
    "peanut butter",
    "apple",
    "balsamic vinegar",
    "pear",
    "chickpea quinoa",
    "saucepan",
    "parsley",
    "fresh mint",
    "chickpeas",
    "garlic powder",
    "salt",
    "pepper",
    "white flours",
    "butter",
    "nuts",
    "candy",
    "carrot sticks",
    "berries",
    "teas",
    "juices",
    "sparkling water",
    "tuna",
    "light mayonnaise",
    "baby carrots",
    "goldfish crackers",
    "boiling water",
    "egg",
    "blackberries",
    "corn muffin",
    "– red",
    "finger-food",
    "light raspberry dressing",
    "blueberries",
    "banana bread",
    "strawberries",
    "raspberries",
    "black beans",
    "pinto beans",
    "sugar",
    "bean salad",
    "4-section lunch container",
    "corn tortilla chips",
    "salsa",
    "cheddar cheese",
    "melon"
  ],
  "tyn_section":[

  ]
}