{
  "title":"How to Play Ghost Recon 2",
  "url":"https://www.wikihow.com/Play-Ghost-Recon-2",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "PC First Person Shooter"
  ],
  "steps":[
    {
      "headline":"Be Alert.",
      "description":"Glance around the screen or at your radar every once in a while. You do not want to be surprised."
    },
    {
      "headline":"Pick a good gun.",
      "description":"If you are good at the sniper you should pick it. Gunner is a great class for big groups of enemies as well as grenadier."
    },
    {
      "headline":"Know where you are.",
      "description":"If you get lost on a particular map or do not know where that sniper is you should go back again by your self and get familiar."
    },
    {
      "headline":"Take Cover.",
      "description":"Remember, this is not halo, you can be killed in 1 hit. Hide behind walls and trees or anything that bullets can't fly through."
    },
    {
      "headline":"Teamwork.",
      "description":"When playing on campaign you should know how to give your team commands. On Xbox Live you should have good communication with your partners."
    },
    {
      "headline":"Conserve ammo.",
      "description":"Unless you are a Gunner and especially if you are a Sniper you must use ammo only when you think it is wise to shoot."
    }
  ],
  "text":" Be Alert. Glance around the screen or at your radar every once in a while. You do not want to be surprised. Pick a good gun. If you are good at the sniper you should pick it. Gunner is a great class for big groups of enemies as well as grenadier. Know where you are. If you get lost on a particular map or do not know where that sniper is you should go back again by your self and get familiar. Take Cover. Remember, this is not halo, you can be killed in 1 hit. Hide behind walls and trees or anything that bullets can't fly through. Teamwork. When playing on campaign you should know how to give your team commands. On Xbox Live you should have good communication with your partners. Conserve ammo. Unless you are a Gunner and especially if you are a Sniper you must use ammo only when you think it is wise to shoot.",
  "tyn_model":[
    "ammo",
    "gun",
    "gunner",
    "grenadier"
  ],
  "tyn_section":[

  ]
}