{
  "title":"How to Cut Down Your Electricity Bill",
  "url":"https://www.wikihow.com/Cut-Down-Your-Electricity-Bill",
  "category_hierarchy":[
    "Home and Garden",
    "Heating and Cooling"
  ],
  "methods":[
    {
      "name":"Saving Energy While Cooling Your Home",
      "steps":[
        {
          "headline":"Paint your house light colors.",
          "description":"Dark colors attract heat. Painting your house (particularly your roof) white can naturally reduce how hot your house gets and how much you need to spend on air conditioning. A study by the Lawrence Berkeley National Laboratory’s heat Island group found that in warm weather houses with white roofs required 40% less energy for cooling than those with black roofs."
        },
        {
          "headline":"Use appliances that produce heat during the night.",
          "description":"Some appliances, like your oven, dishwasher, and dryer, will create heat that permeates throughout the house. Try to use these at night to reduce the need for air conditioning during the warmest part of the day. Alternatively, use a crockpot or microwave oven, which don’t produce as much as heat as an oven. Grilling outside is also a good way to cook without heating up your home."
        },
        {
          "headline":"Check your air conditioning system.",
          "description":"Your air conditioning can be extremely inefficient if it is not working properly. You can call a repair company for a consultation or do a bit of due diligence on your own. Your AC can use too much power if it isn’t appropriately sized for your home. Window units, for example, are only intended to cool a single room. Consider purchasing a new AC system. A new, high-efficiency system uses roughly half as much energy as 15-year-old system. You can personally check to see if an outside unit or heat pump is being blocked by anything. This can significantly increase your energy costs."
        },
        {
          "headline":"Change your filter monthly.",
          "description":"A dirty AC filter can make it harder for your AC to pump air, increasing energy costs. Dirty filters can also cause your AC to break down prematurely, further increasing your expenses. You should try to change the filter once a month. Consider purchasing a permanent filter. These only need to be washed periodically. At a price of $20 to $40, you will recoup the cost of a permanent filter in about a year."
        },
        {
          "headline":"Distribute your cooling consistently.",
          "description":"If airflow is blocked in your home, your air conditioning system will work overtime to cool down the hard to reach places. Use a fan and verify that nothing is blocking the flow of air through your house. A fan doesn’t exactly cool your home, but by pushing air around, it will distribute the heat better. Keep vents open. You might have forgotten that you closed a vent in your house. If so, your AC will keep on running to little or no effect. Keep doors open. If you do not, the air will not circulate properly."
        },
        {
          "headline":"Insulate your home from the heat.",
          "description":"One good way to keep your home warm is to prevent the heat from coming in to begin with. This can involve some small home repairs, but often it just requires simple lifestyle changes. Check for leaks in your weather stripping around your doors and windows, as well as holes around pipes and the circumference of your garage floor. Use caulk to close up any holes. Your home can get especially hot if you allow the sun in. Close your blinds during the middle of the day to keep your home cool. Insulation in your attic floor should be approximately 12 inches thick. Do not put boxes on it or walk over it frequently, because this will compress the insulation and make it less effective."
        },
        {
          "headline":"Love the heat.",
          "description":"Raising the temperature in your home by 2°C can reduce cooling costs by 5%. Wear lighter clothes (or none) to acclimate to a slightly higher temperature. Turn the AC down when you leave the house. Purchase an automatic thermostat that will turn off when your house cools down. The EPA estimates that a programmable thermostat can save you as much as $180 per year; such thermostats cost as little as $25. Keep heat-producing appliances like lights away from the thermostat; these can throw off its readings. Refrain from mopping, washing dishes, and washing clothes during the height of the day’s heat. These tasks produce moisture, which will make the house feel humid and uncomfortable."
        }
      ]
    },
    {
      "name":"Saving Energy While Heating Your Home",
      "steps":[
        {
          "headline":"Check your furnace.",
          "description":"You should have a professional check to see that your furnace is working properly. Replace the furnace filter monthly and verify that nothing is obstructing an outdoor heat pump. Verify that your furnace is not on “emergency heat”. This will turn off energy-efficient settings and could double heating costs."
        },
        {
          "headline":"Close the fireplace.",
          "description":"Fireplaces can be a good way to heat your home, but an open chimney also exposes you to the elements. Be sure to have a fireplace door that you can close. In extreme cold weather, starting a fire can be counterproductive, because it will also allow this cold air in."
        },
        {
          "headline":"Insulate your home.",
          "description":"If possible, you should have a professional visit your house to see if you have any insulation problems. Check for leaks in your weather stripping around your doors, windows, holes around pipes and the circumference of your garage floor. Use caulk to close up any holes. On sunny days open your drapes to allow heat in. Be sure that heating outlets are free from obstructions. Move furniture and drapery away from the vent. Clean the vent regularly to establish proper airflow. Know what to leave alone. An insulated garage, porch, and attic are usually not worth the money that it would take to heat them. Close heat registers to save the expense of warming these spaces."
        },
        {
          "headline":"Learn to love the cold.",
          "description":"Every degree that you lower your thermostat you are likely to see a 3% decrease in your energy bill. There are many things you can do do embrace cooler temperatures. Among them are:\nTurning the thermostat down to 5 to 10 °C (41 to 50 °F) when you leave the house to see substantial savings. Wearing warm clothes when home. Eating hot, spicy food and drinking hot beverages. Exercising. Engaging in stressful activities. Note that stress isn't always bad, such as an exciting video game. Better yet, combine exercise with stress, by playing active indoor games, like air hockey or Dance Dance Revolution (home version). [1]"
        },
        {
          "headline":"Hose down the house on sunny days.",
          "description":"Evaporating water can cool the house dramatically. The walls and roof can hold heat from sunlight, then release it, inside the house, many hours later. Don't forget the roof! Avoid this practice during a drought."
        }
      ]
    },
    {
      "name":"Implementing Zone Heating and Cooling",
      "steps":[
        {
          "headline":"Isolate the temperature in rooms that you use less.",
          "description":"Unused rooms, storage rooms, etc., do not need to be maintained at a comfortable level. Close doors to these rooms. Close vents, as much as possible. (Note that many HVAC vents are designed not to be able to be closed 100%, because if too many are closed the back-pressure overtaxes the fan and shuts down the system.) Windows can be opened in these rooms when they get too hot, on days when it's cooler and dry outside."
        },
        {
          "headline":"Allow temperature variance in rooms that are currently unoccupied.",
          "description":"Bedrooms may need to be kept at a controlled temperature while sleeping, but not during the day. Bathrooms may need to be kept at a controlled temperature while bathing, but not at other times. The living areas only need be kept at a controlled temperature while in use (when people are home and awake)."
        },
        {
          "headline":"Sleep on the ground floor during the summer.",
          "description":"Since heat rises, top floor bedrooms may get hot in summer. Consider sleeping on a lower floor at those times. Conversely, basement bedrooms may be too cold in winter, so sleep on a higher floor then."
        },
        {
          "headline":"Use space heaters to warm a single room.",
          "description":"This way, you can control the temperature in the room you're using without wasting energy on the unoccupied parts of the house. However, beware that heating with electricity is often more expensive than heating with natural gas (generally around 3 times as much), so don't heat multiple rooms with space heaters (only use space heaters in one or two rooms). This way, the savings from not heating the rest of the house are more than the additional cost of heating those two rooms with space heaters. If your regular home heating method is electric, such as electrical resistance baseboard heaters, then electrical space heaters don't cost any more, so feel free to use as many as you want. Forced air electrical resistance heaters are loud, make a burnt smell when turned on, and can cause fires. Radiant electrical heaters can be aimed at one person, and heat only them, but tend to only heat one side of the person, and can still make a burning smell and cause fires. Oil-filled electrical heaters (which look like radiators) are almost silent, and pose less of a fire risk, especially on the lowest setting, but do take quite a while to heat the room and tend to heat the ceiling and room above, as well. Ceramic heaters have similar attributes, but make more noise, as they do use a fan. Kerosene and propane heaters are highly dangerous, and should only be used by professionals."
        },
        {
          "headline":"Consider using a fireplace or wood-stove for zone heating.",
          "description":"An efficient fireplace or wood-stove will have an intake outside the house, so they don't suck warm house air in and out the chimney. Beware \"decorative\" fireplaces, not designed to be used for heating. If you use the decorative fireplaces, it will warm that room, but may cool the rest of the house."
        },
        {
          "headline":"Use an electric fan for zone cooling.",
          "description":"Operate them only in occupied rooms, as they generate both heat and a breeze, and when there's nobody in the room to be cooled by the breeze, there's no benefit."
        },
        {
          "headline":"Follow the sunlight.",
          "description":"In winter, try to arrange activities for rooms currently in the sunlight, so they will be warmer, and close the shades or drapes in other rooms, to keep the heat in. In summer, try to avoid these rooms, and close the shades or drapes in all rooms."
        },
        {
          "headline":"Time heat-producing activities appropriately.",
          "description":"For example, use the oven (especially the self-cleaning setting) or stove when heat is desired in the kitchen, and avoid doing so at other times (then eat cold food, like sandwiches, or eat out)."
        }
      ]
    },
    {
      "name":"Use Plants for Insulation",
      "steps":[
        {
          "headline":"Trees provide shade in summer, and protect from cold winds in winter.",
          "description":""
        },
        {
          "headline":"Climbing ivy adds a layer of insulation to any house, and layers of leaves with air gaps between them are particularly effective.",
          "description":""
        }
      ]
    },
    {
      "name":"Saving Money on Other Appliances",
      "steps":[
        {
          "headline":"Switch off power when you aren’t using it.",
          "description":"Switch off the light bulbs and fans when not required. Since appliances also use power when they are plugged in, consider what you might be able to unplug altogether. It can be good to get into the habit of walking around your home before going to bed. Check to see if you have accidentally left anything on or if there are any appliances that you can unplug. Turning off lights you don’t use can save $274 per year. In places where you spend little time, like the garage, consider installing timers that will automatically turn off your lights after a certain period of time. To save time when unplugging appliances, consider purchasing a power strip. Turning off the power strip will immediately disconnect all of the appliances. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tOur Expert Agrees: Switching to LED light bulbs is a great way to save electricity. Also, always turn the lights off when you leave the room, and unplug your things when they're not in use. On average, 20% of an electric bill comes from items that are plugged in but turned off. However, if you want to save even more, open your curtains during the day to use natural light instead of electric lights whenever possible."
        },
        {
          "headline":"Buy Energy Star-certified products.",
          "description":"Energy Star is a federal program that certifies products as energy efficient. An Energy Star product should save you money on your utility bills. Everything from light bulbs, refrigerators, TVs, washing machines, and furnaces can be Energy Star certified, though certain of these products will save more energy than others. Immediately replace your light bulbs. Replacing a single light bulb with a Compact Florescent Light (CFL) or, even better, a Light Emitting Diode (LED) bulb can save as much as $123 per year. They also last longer, saving you money on replacement costs, and generate less heat, reducing A/C bills."
        },
        {
          "headline":"Wash with cold water.",
          "description":"Washing clothes in cold water can save $152 per year. Washing clothes in warm water does nothing to make them whiter, brighter, or cleaner than they otherwise would be."
        },
        {
          "headline":"Air-dry clothing.",
          "description":"Driers use considerable energy. You can save that by placing your attire on a clothes’ line. If you don’t have that sort of outside space, many department stores sell racks that make it easy dry several articles of clothing in a small space."
        },
        {
          "headline":"Set your water heater at 120°F (49°C).",
          "description":"Anything higher than this puts you at risk of scalding yourself with hot water. Even in lieu of that eventuality, setting your water heater higher than 120°F (49°C) will definitely hurt your bank account. The EPA estimates that setting your water heater 20°C higher could cost you nearly $500 a year."
        }
      ]
    },
    {
      "name":"Handling your Power Finances",
      "steps":[
        {
          "headline":"Pick a provider.",
          "description":"Some states, including Texas and Pennsylvania, allow you to pick your own power provider. When doing so, go to the official state power website for a comprehensive list of providers and rates. Beware, there will be imitations that provide biased information. When reviewing plans you should watch out for hidden fees. Typically you will need to wait for your contract to expire before signing up for a new provider. Contact your power provider to see how long your contract lasts. Beware of the difference between fixed and variable rate plans. Variable rate plans allow for hikes in your power price over the term of your contract. They often advertise low introductory rates that will only go up over time. Your state website might have a record of the company’s historic rates that will give you a sense of their average price. Read the contract closely to see if the company charges if you, for example, talk to a service professional. It is also common to charge minimum usage fees. These can stick you with additional fees if you reduce your energy usage."
        },
        {
          "headline":"Check your meter.",
          "description":"Sometimes your utility company might make mistakes when reading your meter. Check the meter readings at the end of the month and compare it to what you see on your energy bill. Call if you believe there is a discrepancy. When reading a meter you will see several dials. Read these dials from right to left to get a full measure of your kWh usage. When the dial is between two numbers, you should always estimate down to the lower number. Even if the dial is directly on a number, you should estimate down one. Even if you find that your energy bill is correct, reading your meter can be a useful way to keep track of whether you have been able to manage your electricity usage."
        },
        {
          "headline":"Save electricity with the off-peak reduced rates.",
          "description":"Some power companies charge more for power used during specific times. Contact your service provider to see if this applies. If so, you will typically be charged less for power used during the evening. Try to perform energy intensive chores during this period."
        }
      ]
    }
  ],
  "text":" Saving Energy While Cooling Your Home Paint your house light colors. Dark colors attract heat. Painting your house (particularly your roof) white can naturally reduce how hot your house gets and how much you need to spend on air conditioning. A study by the Lawrence Berkeley National Laboratory’s heat Island group found that in warm weather houses with white roofs required 40% less energy for cooling than those with black roofs. Use appliances that produce heat during the night. Some appliances, like your oven, dishwasher, and dryer, will create heat that permeates throughout the house. Try to use these at night to reduce the need for air conditioning during the warmest part of the day. Alternatively, use a crockpot or microwave oven, which don’t produce as much as heat as an oven. Grilling outside is also a good way to cook without heating up your home. Check your air conditioning system. Your air conditioning can be extremely inefficient if it is not working properly. You can call a repair company for a consultation or do a bit of due diligence on your own. Your AC can use too much power if it isn’t appropriately sized for your home. Window units, for example, are only intended to cool a single room. Consider purchasing a new AC system. A new, high-efficiency system uses roughly half as much energy as 15-year-old system. You can personally check to see if an outside unit or heat pump is being blocked by anything. This can significantly increase your energy costs. Change your filter monthly. A dirty AC filter can make it harder for your AC to pump air, increasing energy costs. Dirty filters can also cause your AC to break down prematurely, further increasing your expenses. You should try to change the filter once a month. Consider purchasing a permanent filter. These only need to be washed periodically. At a price of $20 to $40, you will recoup the cost of a permanent filter in about a year. Distribute your cooling consistently. If airflow is blocked in your home, your air conditioning system will work overtime to cool down the hard to reach places. Use a fan and verify that nothing is blocking the flow of air through your house. A fan doesn’t exactly cool your home, but by pushing air around, it will distribute the heat better. Keep vents open. You might have forgotten that you closed a vent in your house. If so, your AC will keep on running to little or no effect. Keep doors open. If you do not, the air will not circulate properly. Insulate your home from the heat. One good way to keep your home warm is to prevent the heat from coming in to begin with. This can involve some small home repairs, but often it just requires simple lifestyle changes. Check for leaks in your weather stripping around your doors and windows, as well as holes around pipes and the circumference of your garage floor. Use caulk to close up any holes. Your home can get especially hot if you allow the sun in. Close your blinds during the middle of the day to keep your home cool. Insulation in your attic floor should be approximately 12 inches thick. Do not put boxes on it or walk over it frequently, because this will compress the insulation and make it less effective. Love the heat. Raising the temperature in your home by 2°C can reduce cooling costs by 5%. Wear lighter clothes (or none) to acclimate to a slightly higher temperature. Turn the AC down when you leave the house. Purchase an automatic thermostat that will turn off when your house cools down. The EPA estimates that a programmable thermostat can save you as much as $180 per year; such thermostats cost as little as $25. Keep heat-producing appliances like lights away from the thermostat; these can throw off its readings. Refrain from mopping, washing dishes, and washing clothes during the height of the day’s heat. These tasks produce moisture, which will make the house feel humid and uncomfortable. Saving Energy While Heating Your Home Check your furnace. You should have a professional check to see that your furnace is working properly. Replace the furnace filter monthly and verify that nothing is obstructing an outdoor heat pump. Verify that your furnace is not on “emergency heat”. This will turn off energy-efficient settings and could double heating costs. Close the fireplace. Fireplaces can be a good way to heat your home, but an open chimney also exposes you to the elements. Be sure to have a fireplace door that you can close. In extreme cold weather, starting a fire can be counterproductive, because it will also allow this cold air in. Insulate your home. If possible, you should have a professional visit your house to see if you have any insulation problems. Check for leaks in your weather stripping around your doors, windows, holes around pipes and the circumference of your garage floor. Use caulk to close up any holes. On sunny days open your drapes to allow heat in. Be sure that heating outlets are free from obstructions. Move furniture and drapery away from the vent. Clean the vent regularly to establish proper airflow. Know what to leave alone. An insulated garage, porch, and attic are usually not worth the money that it would take to heat them. Close heat registers to save the expense of warming these spaces. Learn to love the cold. Every degree that you lower your thermostat you are likely to see a 3% decrease in your energy bill. There are many things you can do do embrace cooler temperatures. Among them are:\nTurning the thermostat down to 5 to 10 °C (41 to 50 °F) when you leave the house to see substantial savings. Wearing warm clothes when home. Eating hot, spicy food and drinking hot beverages. Exercising. Engaging in stressful activities. Note that stress isn't always bad, such as an exciting video game. Better yet, combine exercise with stress, by playing active indoor games, like air hockey or Dance Dance Revolution (home version). [1] Hose down the house on sunny days. Evaporating water can cool the house dramatically. The walls and roof can hold heat from sunlight, then release it, inside the house, many hours later. Don't forget the roof! Avoid this practice during a drought. Implementing Zone Heating and Cooling Isolate the temperature in rooms that you use less. Unused rooms, storage rooms, etc., do not need to be maintained at a comfortable level. Close doors to these rooms. Close vents, as much as possible. (Note that many HVAC vents are designed not to be able to be closed 100%, because if too many are closed the back-pressure overtaxes the fan and shuts down the system.) Windows can be opened in these rooms when they get too hot, on days when it's cooler and dry outside. Allow temperature variance in rooms that are currently unoccupied. Bedrooms may need to be kept at a controlled temperature while sleeping, but not during the day. Bathrooms may need to be kept at a controlled temperature while bathing, but not at other times. The living areas only need be kept at a controlled temperature while in use (when people are home and awake). Sleep on the ground floor during the summer. Since heat rises, top floor bedrooms may get hot in summer. Consider sleeping on a lower floor at those times. Conversely, basement bedrooms may be too cold in winter, so sleep on a higher floor then. Use space heaters to warm a single room. This way, you can control the temperature in the room you're using without wasting energy on the unoccupied parts of the house. However, beware that heating with electricity is often more expensive than heating with natural gas (generally around 3 times as much), so don't heat multiple rooms with space heaters (only use space heaters in one or two rooms). This way, the savings from not heating the rest of the house are more than the additional cost of heating those two rooms with space heaters. If your regular home heating method is electric, such as electrical resistance baseboard heaters, then electrical space heaters don't cost any more, so feel free to use as many as you want. Forced air electrical resistance heaters are loud, make a burnt smell when turned on, and can cause fires. Radiant electrical heaters can be aimed at one person, and heat only them, but tend to only heat one side of the person, and can still make a burning smell and cause fires. Oil-filled electrical heaters (which look like radiators) are almost silent, and pose less of a fire risk, especially on the lowest setting, but do take quite a while to heat the room and tend to heat the ceiling and room above, as well. Ceramic heaters have similar attributes, but make more noise, as they do use a fan. Kerosene and propane heaters are highly dangerous, and should only be used by professionals. Consider using a fireplace or wood-stove for zone heating. An efficient fireplace or wood-stove will have an intake outside the house, so they don't suck warm house air in and out the chimney. Beware \"decorative\" fireplaces, not designed to be used for heating. If you use the decorative fireplaces, it will warm that room, but may cool the rest of the house. Use an electric fan for zone cooling. Operate them only in occupied rooms, as they generate both heat and a breeze, and when there's nobody in the room to be cooled by the breeze, there's no benefit. Follow the sunlight. In winter, try to arrange activities for rooms currently in the sunlight, so they will be warmer, and close the shades or drapes in other rooms, to keep the heat in. In summer, try to avoid these rooms, and close the shades or drapes in all rooms. Time heat-producing activities appropriately. For example, use the oven (especially the self-cleaning setting) or stove when heat is desired in the kitchen, and avoid doing so at other times (then eat cold food, like sandwiches, or eat out). Use Plants for Insulation Trees provide shade in summer, and protect from cold winds in winter.  Climbing ivy adds a layer of insulation to any house, and layers of leaves with air gaps between them are particularly effective.  Saving Money on Other Appliances Switch off power when you aren’t using it. Switch off the light bulbs and fans when not required. Since appliances also use power when they are plugged in, consider what you might be able to unplug altogether. It can be good to get into the habit of walking around your home before going to bed. Check to see if you have accidentally left anything on or if there are any appliances that you can unplug. Turning off lights you don’t use can save $274 per year. In places where you spend little time, like the garage, consider installing timers that will automatically turn off your lights after a certain period of time. To save time when unplugging appliances, consider purchasing a power strip. Turning off the power strip will immediately disconnect all of the appliances. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKathryn Kellogg\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\t\t\t\t\tKathryn Kellogg is the founder of goingzerowaste.com, a lifestyle website dedicated to breaking eco-friendly living down into a simple step-by-step process with lots of positivity and love. She's the author of 101 Ways to Go Zero Waste and spokesperson for plastic-free living for National Geographic. Kathryn Kellogg\t\t\tAuthor, 101 Ways to Go Zero Waste\t\t\t\tOur Expert Agrees: Switching to LED light bulbs is a great way to save electricity. Also, always turn the lights off when you leave the room, and unplug your things when they're not in use. On average, 20% of an electric bill comes from items that are plugged in but turned off. However, if you want to save even more, open your curtains during the day to use natural light instead of electric lights whenever possible. Buy Energy Star-certified products. Energy Star is a federal program that certifies products as energy efficient. An Energy Star product should save you money on your utility bills. Everything from light bulbs, refrigerators, TVs, washing machines, and furnaces can be Energy Star certified, though certain of these products will save more energy than others. Immediately replace your light bulbs. Replacing a single light bulb with a Compact Florescent Light (CFL) or, even better, a Light Emitting Diode (LED) bulb can save as much as $123 per year. They also last longer, saving you money on replacement costs, and generate less heat, reducing A/C bills. Wash with cold water. Washing clothes in cold water can save $152 per year. Washing clothes in warm water does nothing to make them whiter, brighter, or cleaner than they otherwise would be. Air-dry clothing. Driers use considerable energy. You can save that by placing your attire on a clothes’ line. If you don’t have that sort of outside space, many department stores sell racks that make it easy dry several articles of clothing in a small space. Set your water heater at 120°F (49°C). Anything higher than this puts you at risk of scalding yourself with hot water. Even in lieu of that eventuality, setting your water heater higher than 120°F (49°C) will definitely hurt your bank account. The EPA estimates that setting your water heater 20°C higher could cost you nearly $500 a year. Handling your Power Finances Pick a provider. Some states, including Texas and Pennsylvania, allow you to pick your own power provider. When doing so, go to the official state power website for a comprehensive list of providers and rates. Beware, there will be imitations that provide biased information. When reviewing plans you should watch out for hidden fees. Typically you will need to wait for your contract to expire before signing up for a new provider. Contact your power provider to see how long your contract lasts. Beware of the difference between fixed and variable rate plans. Variable rate plans allow for hikes in your power price over the term of your contract. They often advertise low introductory rates that will only go up over time. Your state website might have a record of the company’s historic rates that will give you a sense of their average price. Read the contract closely to see if the company charges if you, for example, talk to a service professional. It is also common to charge minimum usage fees. These can stick you with additional fees if you reduce your energy usage. Check your meter. Sometimes your utility company might make mistakes when reading your meter. Check the meter readings at the end of the month and compare it to what you see on your energy bill. Call if you believe there is a discrepancy. When reading a meter you will see several dials. Read these dials from right to left to get a full measure of your kWh usage. When the dial is between two numbers, you should always estimate down to the lower number. Even if the dial is directly on a number, you should estimate down one. Even if you find that your energy bill is correct, reading your meter can be a useful way to keep track of whether you have been able to manage your electricity usage. Save electricity with the off-peak reduced rates. Some power companies charge more for power used during specific times. Contact your service provider to see if this applies. If so, you will typically be charged less for power used during the evening. Try to perform energy intensive chores during this period.",
  "tyn_model":[
    "air conditioning",
    "water",
    "furnace",
    "fireplace",
    "space heaters",
    "oven",
    "fan",
    "thermostat",
    "fireplaces",
    "energy star",
    "water heater",
    "weather stripping",
    "caulk",
    "insulation",
    "power strip",
    "energy bill",
    "heat island group",
    "dryer",
    "crockpot or",
    "microwave oven",
    "ac",
    "ac system",
    "ac filter",
    "filter",
    "thermostats",
    "“emergency",
    "”.",
    "air hockey",
    "dance dance revolution",
    "hvac vents",
    "electricity",
    "natural gas",
    "electrical resistance baseboard heaters",
    "electrical space heaters",
    "forced air electrical resistance heaters",
    "radiant electrical heaters",
    "electrical heaters",
    "radiators",
    "kerosene",
    "propane",
    "electric fan",
    "stove",
    "plants",
    "timers",
    "zero waste",
    "refrigerators",
    "energy star certified",
    "compact florescent light (",
    "light emitting diode (led) bulb",
    "’ line",
    "power provider",
    "utility company",
    "meter"
  ],
  "tyn_section":[

  ]
}