{
  "title":"How to Boil Corn on the Cob",
  "url":"https://www.wikihow.com/Boil-Corn-on-the-Cob",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Maize"
  ],
  "methods":[
    {
      "name":"Choosing Corn",
      "steps":[
        {
          "headline":"Select fresh corn whenever you can.",
          "description":"When corn is not in season, you can buy it frozen at the grocery store, but for best results, boil corn when it is fresh."
        },
        {
          "headline":"Look for bright green husks.",
          "description":"Husks are the papery outer covering. They should fit the ear of corn and not be falling off or pulling away."
        },
        {
          "headline":"Check the corn kernels.",
          "description":"They should be in tight, symmetric rows. Ripe corn will have plump kernels that are yellow and white."
        },
        {
          "headline":"Try to buy corn from a local grower.",
          "description":"If you do not have a farmer's market or access to freshly picked corn, check the selection at your grocery store."
        }
      ]
    },
    {
      "name":"Husking the Corn",
      "steps":[
        {
          "headline":"Husk the corn just before you boil it to ensure freshness.",
          "description":"Try not to husk the corn at the grocery store. Most retailers set up large trash bins for you to husk the corn and take it away with its kernels exposed. Unless you are going to boil it as soon as you get home, keep the corn in its husk."
        },
        {
          "headline":"Peel the green husks away from the corn.",
          "description":"There might be several layers to take off. You can discard these or add them to your compost pile if you have a garden."
        },
        {
          "headline":"Take off the silk, which is the thin, silvery hairs that are attached to the corn.",
          "description":"Wipe down the corn with a damp paper towel. This will help you remove the silk, which can be time consuming and frustrating because they are so thin and determined to cling to the corn."
        }
      ]
    },
    {
      "name":"Boiling the Corn",
      "steps":[
        {
          "headline":"Fill a pot with cold tap water.",
          "description":"Make sure you use a pot that can accommodate the amount of corn you plan to boil. Add a little sugar to the water if you want to sweeten your corn while it cooks. Never add salt to the water you use to boil corn on the cob. Salt will make the corn tough."
        },
        {
          "headline":"Cover the pot and bring the water to a boil.",
          "description":""
        },
        {
          "headline":"Place the corn in the pot and wait for the water to return to a boil.",
          "description":"Cover the pot while you wait for the water and corn to boil. This will help the water heat faster and it will also contain the corn, which tends to float to the top of the pot."
        },
        {
          "headline":"Remove the corn from the water with tongs as soon as it begins to boil again.",
          "description":"This usually takes from 3 to 4 minutes, depending on the size of your pot. Resist the temptation to let the corn sit in the boiling water for a while. This will result in overcooked corn. You want your corn on the cob to be crisp and tender, not soft and mushy. Allow the corn to boil for up to 10 minutes if you prefer a soft corn. People with dental issues might prefer corn that is more pliable and easy to chew."
        }
      ]
    }
  ],
  "text":" Choosing Corn Select fresh corn whenever you can. When corn is not in season, you can buy it frozen at the grocery store, but for best results, boil corn when it is fresh. Look for bright green husks. Husks are the papery outer covering. They should fit the ear of corn and not be falling off or pulling away. Check the corn kernels. They should be in tight, symmetric rows. Ripe corn will have plump kernels that are yellow and white. Try to buy corn from a local grower. If you do not have a farmer's market or access to freshly picked corn, check the selection at your grocery store. Husking the Corn Husk the corn just before you boil it to ensure freshness. Try not to husk the corn at the grocery store. Most retailers set up large trash bins for you to husk the corn and take it away with its kernels exposed. Unless you are going to boil it as soon as you get home, keep the corn in its husk. Peel the green husks away from the corn. There might be several layers to take off. You can discard these or add them to your compost pile if you have a garden. Take off the silk, which is the thin, silvery hairs that are attached to the corn. Wipe down the corn with a damp paper towel. This will help you remove the silk, which can be time consuming and frustrating because they are so thin and determined to cling to the corn. Boiling the Corn Fill a pot with cold tap water. Make sure you use a pot that can accommodate the amount of corn you plan to boil. Add a little sugar to the water if you want to sweeten your corn while it cooks. Never add salt to the water you use to boil corn on the cob. Salt will make the corn tough. Cover the pot and bring the water to a boil.  Place the corn in the pot and wait for the water to return to a boil. Cover the pot while you wait for the water and corn to boil. This will help the water heat faster and it will also contain the corn, which tends to float to the top of the pot. Remove the corn from the water with tongs as soon as it begins to boil again. This usually takes from 3 to 4 minutes, depending on the size of your pot. Resist the temptation to let the corn sit in the boiling water for a while. This will result in overcooked corn. You want your corn on the cob to be crisp and tender, not soft and mushy. Allow the corn to boil for up to 10 minutes if you prefer a soft corn. People with dental issues might prefer corn that is more pliable and easy to chew.",
  "tyn_model":[
    "corn",
    "water",
    "pot",
    "salt",
    "compost",
    "sugar"
  ],
  "tyn_section":[

  ]
}