{
  "title":"How to Make Simple and Quick Egg Bhurji",
  "url":"https://www.wikihow.com/Make-Simple-and-Quick-Egg-Bhurji",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine"
  ],
  "steps":[
    {
      "headline":"Add oil in a frying pan.",
      "description":""
    },
    {
      "headline":"Add cumin seeds and sauté them for a few minutes.",
      "description":""
    },
    {
      "headline":"Add onions and sauté them till they are pink and transparent.",
      "description":""
    },
    {
      "headline":"Add green chilies and mix them.",
      "description":""
    },
    {
      "headline":"Add salt and mix.",
      "description":""
    },
    {
      "headline":"Take an egg and hit it lightly with the spoon so that the shell breaks.",
      "description":""
    },
    {
      "headline":"Break open the shell with the fingers.",
      "description":""
    },
    {
      "headline":"Drop the contents of the egg into the frying pan.",
      "description":""
    },
    {
      "headline":"Repeat the above steps for the next two eggs also.",
      "description":""
    },
    {
      "headline":"Mix them with the spatula.",
      "description":""
    },
    {
      "headline":"Stir fry the mixture on a very low flame till the contents are cooked properly.",
      "description":""
    },
    {
      "headline":"Serve with rice or roti or bread.",
      "description":""
    }
  ],
  "text":" Add oil in a frying pan.  Add cumin seeds and sauté them for a few minutes.  Add onions and sauté them till they are pink and transparent.  Add green chilies and mix them.  Add salt and mix.  Take an egg and hit it lightly with the spoon so that the shell breaks.  Break open the shell with the fingers.  Drop the contents of the egg into the frying pan.  Repeat the above steps for the next two eggs also.  Mix them with the spatula.  Stir fry the mixture on a very low flame till the contents are cooked properly.  Serve with rice or roti or bread. ",
  "tyn_model":[
    "frying pan",
    "oil",
    "cumin",
    "onions",
    "green chilies",
    "salt",
    "egg",
    "spoon",
    "eggs",
    "spatula",
    "rice"
  ],
  "tyn_section":[

  ]
}