{
  "title":"How to Make a Chocolate Candle",
  "url":"https://www.wikihow.com/Make-a-Chocolate-Candle",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Candles"
  ],
  "steps":[
    {
      "headline":"Get the old candles and place them on a table that is not used for eating.",
      "description":"Crush them using your hands and remove. Chop them up using a knife."
    },
    {
      "headline":"Add water to your saucepan about a quarter way up and turn on the hob.",
      "description":""
    },
    {
      "headline":"While it is heating, add your chopped-up candle pieces into the the bowl not intended for eating purposes.",
      "description":"Add some food coloring if desired."
    },
    {
      "headline":"Add a spoon full or more of chocolate spread in the bowl.",
      "description":"Make sure the chocolate touches the wax."
    },
    {
      "headline":"Place the bowl in the saucepan most likely when it is not boiling.",
      "description":""
    },
    {
      "headline":"While the wax and the chocolate spread is melting, prepare the container for the candle.",
      "description":"Make sure the wick is tall enough for it. Usually, the longer the wick, the easier the project is. Use a stick and place it over the container. Attach the wick to it using sticky tape."
    },
    {
      "headline":"Quickly check to see if the wax had melted.",
      "description":"If it has melted, pour the mixture quickly in the candle container and let it set to dry. The chocolate would dry with the wax mixture. There might be some leftovers. Quickly pour the left-overs in another candle-container. You can use this for next time. If there is food coloring in it, it should spread it colors around the wax mixture. Mix it if you don't want this 'marble' effect."
    },
    {
      "headline":"Just wait until it sets.",
      "description":"Don't touch it or do anything do it."
    },
    {
      "headline":"Enjoy your lovely chocolate candle!",
      "description":""
    }
  ],
  "text":" Get the old candles and place them on a table that is not used for eating. Crush them using your hands and remove. Chop them up using a knife. Add water to your saucepan about a quarter way up and turn on the hob.  While it is heating, add your chopped-up candle pieces into the the bowl not intended for eating purposes. Add some food coloring if desired. Add a spoon full or more of chocolate spread in the bowl. Make sure the chocolate touches the wax. Place the bowl in the saucepan most likely when it is not boiling.  While the wax and the chocolate spread is melting, prepare the container for the candle. Make sure the wick is tall enough for it. Usually, the longer the wick, the easier the project is. Use a stick and place it over the container. Attach the wick to it using sticky tape. Quickly check to see if the wax had melted. If it has melted, pour the mixture quickly in the candle container and let it set to dry. The chocolate would dry with the wax mixture. There might be some leftovers. Quickly pour the left-overs in another candle-container. You can use this for next time. If there is food coloring in it, it should spread it colors around the wax mixture. Mix it if you don't want this 'marble' effect. Just wait until it sets. Don't touch it or do anything do it. Enjoy your lovely chocolate candle! ",
  "tyn_model":[
    "chocolate",
    "bowl",
    "saucepan",
    "food coloring",
    "container",
    "knife",
    "water",
    "sticky tape",
    "wax",
    "candle container",
    "candle-"
  ],
  "tyn_section":[

  ]
}