{
  "title":"How to Make a Lemon Cheesecake",
  "url":"https://www.wikihow.com/Make-a-Lemon-Cheesecake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies",
    "Cheesecake"
  ],
  "steps":[
    {
      "headline":"Prepare the lemon curd.",
      "description":"Using a heavy 2 quart saucepan, stir the lemon zest, juice, sugar and eggs with a whisk."
    },
    {
      "headline":"Cook the butter over heat that's moderately low.",
      "description":"Frequently whisk it, until the lemon curd is thick enough for marks to appear and the first bubbles come up on the surface (an estimate of about 6 min.)"
    },
    {
      "headline":"Pour the curd through a fine-mesh sieve into a wide shallow dish..  Scrape the bottom of the sieve, Use wax paper to cover the surface of the lemon curd",
      "description":""
    },
    {
      "headline":"Cool completely, stirring occasionally, about 30 min.",
      "description":""
    },
    {
      "headline":"Prepare and bake the crust.",
      "description":"Start by preheating your oven to 350 °F (177 °C)."
    },
    {
      "headline":"Reverse the bottom of the springform pan (making it easier to slide the cake off the bottom), then lock in place.",
      "description":""
    },
    {
      "headline":"in a medium sized mixing bowl, incorporate the crust ingredients.",
      "description":"Stir to blend."
    },
    {
      "headline":"Insert the springform pan into a baking pan.",
      "description":"Bake the crust for 10 min, then allow it to cool completely on a rack (in the springform pan)."
    },
    {
      "headline":"Decrease the temperature of your oven to 300 °F (149 °C).",
      "description":""
    },
    {
      "headline":"Prepare the cheesecake filling.",
      "description":"Incorporate the cream cheese and sugar in a bowl and use an electric mixer to beat them. Beat the mixture at medium speed until it's smooth and fully combined, about 1-2 min."
    },
    {
      "headline":"Decrease to low speed, then drop in the eggs one at a time and beat until fully combined.",
      "description":"Then add the sour cream and vanilla and beat until incorporated."
    },
    {
      "headline":"Pour 2/3 of the filling into the crust, then spoon 1/2 of the lemon curd over the cheesecake filling.",
      "description":"Then, using a small knife, make the curd swirl into this filling. Repeat this step with the remainder of the filling and curd."
    },
    {
      "headline":"Place the cheesecake in the oven and bake for 45 minutes, or until set and center shudders when pan is shaken gently.",
      "description":"Then put the springform pan on a rack and allow to cool completely, about 2 hours."
    },
    {
      "headline":"Refrigerate the cheesecake for a minimum of 4 hours.",
      "description":"Prior to serving, remove the springform pan."
    }
  ],
  "text":" Prepare the lemon curd. Using a heavy 2 quart saucepan, stir the lemon zest, juice, sugar and eggs with a whisk. Cook the butter over heat that's moderately low. Frequently whisk it, until the lemon curd is thick enough for marks to appear and the first bubbles come up on the surface (an estimate of about 6 min.) Pour the curd through a fine-mesh sieve into a wide shallow dish..  Scrape the bottom of the sieve, Use wax paper to cover the surface of the lemon curd  Cool completely, stirring occasionally, about 30 min.  Prepare and bake the crust. Start by preheating your oven to 350 °F (177 °C). Reverse the bottom of the springform pan (making it easier to slide the cake off the bottom), then lock in place.  in a medium sized mixing bowl, incorporate the crust ingredients. Stir to blend. Insert the springform pan into a baking pan. Bake the crust for 10 min, then allow it to cool completely on a rack (in the springform pan). Decrease the temperature of your oven to 300 °F (149 °C).  Prepare the cheesecake filling. Incorporate the cream cheese and sugar in a bowl and use an electric mixer to beat them. Beat the mixture at medium speed until it's smooth and fully combined, about 1-2 min. Decrease to low speed, then drop in the eggs one at a time and beat until fully combined. Then add the sour cream and vanilla and beat until incorporated. Pour 2/3 of the filling into the crust, then spoon 1/2 of the lemon curd over the cheesecake filling. Then, using a small knife, make the curd swirl into this filling. Repeat this step with the remainder of the filling and curd. Place the cheesecake in the oven and bake for 45 minutes, or until set and center shudders when pan is shaken gently. Then put the springform pan on a rack and allow to cool completely, about 2 hours. Refrigerate the cheesecake for a minimum of 4 hours. Prior to serving, remove the springform pan.",
  "tyn_model":[
    "springform pan",
    "lemon curd",
    "oven",
    "sugar",
    "eggs",
    "2 quart saucepan",
    "lemon",
    "whisk",
    "butter",
    "fine-mesh sieve",
    "wax paper",
    "medium sized mixing bowl",
    "baking pan",
    "cream cheese",
    "bowl",
    "electric mixer",
    "sour cream",
    "vanilla",
    "small knife"
  ],
  "tyn_section":[

  ]
}