{
  "title":"How to Collect Unicorns",
  "url":"https://www.wikihow.com/Collect-Unicorns",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Games of Imagination"
  ],
  "steps":[
    {
      "headline":"Decide the limitations of your unicorn collection.",
      "description":"If you live in a small apartment, garden sized unicorns are out for you. Consider the living arrangements available for your collection. You may be able to spare a cabinet, a shelf, a wall space or a back yard. Just be sure you keep this in mind when you start collecting and buying unicorn items. If you have a lot of space, you're not limited and can roam far and wide but you should still be aware of care, maintenance and security issues, especially if you choose to purchase unicorn outdoor sculptures."
    },
    {
      "headline":"Collect small unicorn items.",
      "description":"Small items would be suitable for such areas as a shelf, a cabinet or the top of items such as window sills, older style TV sets and over doorways. The types of things you might consider include:\nFigurines\nStatues\nSmall portrait sized pictures\nCarvings\nPlates, bowls, pin dishes"
    },
    {
      "headline":"Collect wall unicorn items.",
      "description":"The types of items that can go on a wall are tremendously varied and include banners, pennants, flags, blankets, illustrations, posters, paintings, calendar cut outs that you can frame etc."
    },
    {
      "headline":"Collect toy unicorns.",
      "description":"Toy unicorns are everywhere, from Japan to the USA. They can make for a fantastic unicorn collection provided you have the space - or the patience to remove them off your bed every night and put them back again."
    },
    {
      "headline":"Collect items of clothing with unicorn designs.",
      "description":"This is a \"wearable\" collection, to let people know that you really dig the unicorn."
    },
    {
      "headline":"Collect unicorn jewellery.",
      "description":"There is a vast array of unicorn jewellery out there, including rings, necklaces, bracelets, toe rings, anklets and more."
    },
    {
      "headline":"Collect outdoor unicorns.",
      "description":"Outdoor unicorns include sculptures, garden features such as this willow unicorn, fountains, mobiles, wind chimes. You might also consider feature pieces, such as a metallic gate with a unicorn design or a stained glass window featuring a unicorn."
    },
    {
      "headline":"Collect books and comics about unicorns.",
      "description":"This might be the easiest and most satisfying if you don't have a lot of room and you'd like to learn more about unicorns."
    },
    {
      "headline":"Collect unicorn cards, stationery and prints.",
      "description":"There are many birthday and other cards that feature unicorns, as well as small prints of unicorns. Some stationery also features unicorns on notebooks, pencils, erasers etc."
    },
    {
      "headline":"Collect unicorn novelty items.",
      "description":"Fairs, shows and theme parks are the best bets for these items. Pinata unicorns are also a great collectible item."
    },
    {
      "headline":"Collect unicorn craft patterns.",
      "description":"There are many patterns for unicorns in such crafts as cross-stitch, filet crochet, paint-by-number, knitting, felt toy making, tapestry, leadlighting etc."
    },
    {
      "headline":"Collect unicorn branding.",
      "description":"Brand names that feature unicorns range from chocolate, cigarette packages, general food items, toy boxes, right up to large items such as cars. If you choose to collect unicorns, it will help to do some online research first. Keep an eye out for such items on your travels. And don't forget to look for official government documentation in countries such as Britain, where the unicorn is an official symbol. Look for pamphlets, forms, badges etc."
    },
    {
      "headline":"Collect online unicorn videos.",
      "description":"Choose an online video site and begin collecting your favourite unicorn videos. Be careful though - some videos feature violent unicorns. Whilst funny or scary, these are not exactly in keeping with the traditional idea of the unicorn and may not fit with your idea of unicorns."
    }
  ],
  "text":" Decide the limitations of your unicorn collection. If you live in a small apartment, garden sized unicorns are out for you. Consider the living arrangements available for your collection. You may be able to spare a cabinet, a shelf, a wall space or a back yard. Just be sure you keep this in mind when you start collecting and buying unicorn items. If you have a lot of space, you're not limited and can roam far and wide but you should still be aware of care, maintenance and security issues, especially if you choose to purchase unicorn outdoor sculptures. Collect small unicorn items. Small items would be suitable for such areas as a shelf, a cabinet or the top of items such as window sills, older style TV sets and over doorways. The types of things you might consider include:\nFigurines\nStatues\nSmall portrait sized pictures\nCarvings\nPlates, bowls, pin dishes Collect wall unicorn items. The types of items that can go on a wall are tremendously varied and include banners, pennants, flags, blankets, illustrations, posters, paintings, calendar cut outs that you can frame etc. Collect toy unicorns. Toy unicorns are everywhere, from Japan to the USA. They can make for a fantastic unicorn collection provided you have the space - or the patience to remove them off your bed every night and put them back again. Collect items of clothing with unicorn designs. This is a \"wearable\" collection, to let people know that you really dig the unicorn. Collect unicorn jewellery. There is a vast array of unicorn jewellery out there, including rings, necklaces, bracelets, toe rings, anklets and more. Collect outdoor unicorns. Outdoor unicorns include sculptures, garden features such as this willow unicorn, fountains, mobiles, wind chimes. You might also consider feature pieces, such as a metallic gate with a unicorn design or a stained glass window featuring a unicorn. Collect books and comics about unicorns. This might be the easiest and most satisfying if you don't have a lot of room and you'd like to learn more about unicorns. Collect unicorn cards, stationery and prints. There are many birthday and other cards that feature unicorns, as well as small prints of unicorns. Some stationery also features unicorns on notebooks, pencils, erasers etc. Collect unicorn novelty items. Fairs, shows and theme parks are the best bets for these items. Pinata unicorns are also a great collectible item. Collect unicorn craft patterns. There are many patterns for unicorns in such crafts as cross-stitch, filet crochet, paint-by-number, knitting, felt toy making, tapestry, leadlighting etc. Collect unicorn branding. Brand names that feature unicorns range from chocolate, cigarette packages, general food items, toy boxes, right up to large items such as cars. If you choose to collect unicorns, it will help to do some online research first. Keep an eye out for such items on your travels. And don't forget to look for official government documentation in countries such as Britain, where the unicorn is an official symbol. Look for pamphlets, forms, badges etc. Collect online unicorn videos. Choose an online video site and begin collecting your favourite unicorn videos. Be careful though - some videos feature violent unicorns. Whilst funny or scary, these are not exactly in keeping with the traditional idea of the unicorn and may not fit with your idea of unicorns.",
  "tyn_model":[
    "unicorn",
    "unicorn items",
    "plates",
    "bowls",
    "banners",
    "blankets",
    "unicorn jewellery",
    "mobiles",
    "wind chimes",
    "stained glass window",
    "comics",
    "unicorn cards",
    "erasers",
    "knitting",
    "tapestry",
    "chocolate",
    "unicorns"
  ],
  "tyn_section":[

  ]
}