{
  "title":"How to Drift in Need for Speed Underground 2",
  "url":"https://www.wikihow.com/Drift-in-Need-for-Speed-Underground-2",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Need for Speed"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Approach the corner/turn at speed.",
          "description":""
        },
        {
          "headline":"Hold the handbrake (R1 is the default button for Playstation 2) briefly.",
          "description":""
        },
        {
          "headline":"Turn towards the corner or turn with the brake, the car will slide around sort of sideways.",
          "description":""
        },
        {
          "headline":"Sling yourself back in the opposite to turning direction.",
          "description":""
        },
        {
          "headline":"Just drive away.",
          "description":"Read tips if you are having problems."
        }
      ]
    },
    {
      "name":"Drifting (manual) NFSU2",
      "steps":[
        {
          "headline":"Before you approach the corner of turn you must know the angle of the turn and the field depth in order to minimize the decrease in RPM(rounds per minute).",
          "description":"You must also know how wide is the corner you are going to enter."
        },
        {
          "headline":"Keep a significant distance from the guard rail before attempting to drift.",
          "description":""
        },
        {
          "headline":"For manual drivers with stability control off, you can shift to lower gear then after a slight break turn toward the corner and release the directional button(left of right) then shift to higher gear and slam the accelerator (up arrow) and the car will slide smoothly if properly executed.",
          "description":""
        },
        {
          "headline":"This may vary depending on the tuning setup",
          "description":""
        }
      ]
    }
  ],
  "text":" Steps Approach the corner/turn at speed.  Hold the handbrake (R1 is the default button for Playstation 2) briefly.  Turn towards the corner or turn with the brake, the car will slide around sort of sideways.  Sling yourself back in the opposite to turning direction.  Just drive away. Read tips if you are having problems. Drifting (manual) NFSU2 Before you approach the corner of turn you must know the angle of the turn and the field depth in order to minimize the decrease in RPM(rounds per minute). You must also know how wide is the corner you are going to enter. Keep a significant distance from the guard rail before attempting to drift.  For manual drivers with stability control off, you can shift to lower gear then after a slight break turn toward the corner and release the directional button(left of right) then shift to higher gear and slam the accelerator (up arrow) and the car will slide smoothly if properly executed.  This may vary depending on the tuning setup ",
  "tyn_model":[
    "stability control"
  ],
  "tyn_section":[

  ]
}