{
  "title":"How to Become Good at Laser Quest",
  "url":"https://www.wikihow.com/Become-Good-at-Laser-Quest",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "steps":[
    {
      "headline":"Play Laser Quest on a regular basis.",
      "description":"Remember that practice makes perfect. Get used to the pack that you have to wear and know how to play and know the rules, there's nothing more embarrassing than you being chucked out of a friend's party or tournament."
    },
    {
      "headline":"Know your equipment.",
      "description":"Call the different parts by their correct name, don't call the sensors 'flashing lights'. If you are going to play in a tournament, research some of the Laser Quest champs and know their tactics."
    },
    {
      "headline":"Know the arena.",
      "description":"If you spend all of the game at Laser Quest trying to figure out how to get around the arena, then you're not going to get many points. Ask the marshal beforehand if you can look around the arena in a tournament."
    },
    {
      "headline":"Know the packs/vests.",
      "description":"If you play regularly, you'll soon know which packs work better than others. To know if your pack has a low battery, look at the screen on the back of your gun where your name comes up. If it's got a dim screen, it could mean it's low on battery."
    },
    {
      "headline":"Know the opponent's tactics.",
      "description":"If they are camping in one spot, try to tag them until they leave so you can claim the best spot."
    },
    {
      "headline":"If you notice someone with a 'God Pack' then it's sometimes best just to totally avoid them because chances are you will get tagged if you try to attack.",
      "description":""
    },
    {
      "headline":"Stand sideways.",
      "description":"It is a lot harder for your opponents to tag your front, back or one of your shoulder sensors if you are standing sideways."
    },
    {
      "headline":"Never stop tagging.",
      "description":"If you are constantly tagging someone and they are only getting a few tags on you then it's more likely that you will hit them first."
    },
    {
      "headline":"Watch your back and make sure no one is tagging you from behind.",
      "description":""
    },
    {
      "headline":"Find your opponent's weak sensors.",
      "description":"For example, some packs may have weak shoulders. If this is the case try to tag their shoulders instead of their other sensors."
    },
    {
      "headline":"Be accurate, at most arenas you get accuracy bonuses and you could get up to 100 more points.",
      "description":"Make sure you don't tag walls or anything for no reason."
    },
    {
      "headline":"Don't abuse the equipment, don't throw your laser on the floor, hit it against the wall, or take your pack off for no reason.",
      "description":""
    },
    {
      "headline":"If your pack is broken go and inform the marshal.",
      "description":"You won't be in trouble because you haven't broken it. Most packs are prone to breaking."
    },
    {
      "headline":"Follow the rules.People respect people who play by the rules plus they won't have a reason to discredit you if you do win the game.",
      "description":""
    },
    {
      "headline":"Become a member if you are not one yet.",
      "description":"It allows you to get a few bonuses and discounts."
    }
  ],
  "text":" Play Laser Quest on a regular basis. Remember that practice makes perfect. Get used to the pack that you have to wear and know how to play and know the rules, there's nothing more embarrassing than you being chucked out of a friend's party or tournament. Know your equipment. Call the different parts by their correct name, don't call the sensors 'flashing lights'. If you are going to play in a tournament, research some of the Laser Quest champs and know their tactics. Know the arena. If you spend all of the game at Laser Quest trying to figure out how to get around the arena, then you're not going to get many points. Ask the marshal beforehand if you can look around the arena in a tournament. Know the packs/vests. If you play regularly, you'll soon know which packs work better than others. To know if your pack has a low battery, look at the screen on the back of your gun where your name comes up. If it's got a dim screen, it could mean it's low on battery. Know the opponent's tactics. If they are camping in one spot, try to tag them until they leave so you can claim the best spot. If you notice someone with a 'God Pack' then it's sometimes best just to totally avoid them because chances are you will get tagged if you try to attack.  Stand sideways. It is a lot harder for your opponents to tag your front, back or one of your shoulder sensors if you are standing sideways. Never stop tagging. If you are constantly tagging someone and they are only getting a few tags on you then it's more likely that you will hit them first. Watch your back and make sure no one is tagging you from behind.  Find your opponent's weak sensors. For example, some packs may have weak shoulders. If this is the case try to tag their shoulders instead of their other sensors. Be accurate, at most arenas you get accuracy bonuses and you could get up to 100 more points. Make sure you don't tag walls or anything for no reason. Don't abuse the equipment, don't throw your laser on the floor, hit it against the wall, or take your pack off for no reason.  If your pack is broken go and inform the marshal. You won't be in trouble because you haven't broken it. Most packs are prone to breaking. Follow the rules.People respect people who play by the rules plus they won't have a reason to discredit you if you do win the game.  Become a member if you are not one yet. It allows you to get a few bonuses and discounts.",
  "tyn_model":[
    "laser quest",
    "pack",
    "laser",
    "marshal",
    "packs"
  ],
  "tyn_section":[

  ]
}