{
  "title":"How to Create Rembrandt Lighting",
  "url":"https://www.wikihow.com/Create-Rembrandt-Lighting",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting"
  ],
  "steps":[
    {
      "headline":"Know the history of Rembrandt Lighting.",
      "description":"It will help you understand how it's used when taking portraits. It is named after the Dutch painter, Rembrandt and it is \"characterized by an illuminated triangle under the eye of the subject, on the less illuminated side of the face\". What you are trying to do is \"create a small inverted triangle of light on the subject’s cheek which is opposite the light source\". The lights that create the inverted triangle will also create catch lights in your subject's eyes. This is very important. Without catch lights, your subject will look flat and lifeless."
    },
    {
      "headline":"Position your subject so that their body is facing the main light.",
      "description":""
    },
    {
      "headline":"Have the second light at about a 45 degree angle (3 o'clock position) to your subject.",
      "description":""
    },
    {
      "headline":"Position your camera between the two lights.",
      "description":""
    },
    {
      "headline":"With your main light focused on your subject, take your second light (or reflector) and put it at about a 45 degree angle.",
      "description":"This second light will be at about 'half power' to the main light. Basically, your subject will be 'facing' in between your two lights, towards the camera."
    }
  ],
  "text":" Know the history of Rembrandt Lighting. It will help you understand how it's used when taking portraits. It is named after the Dutch painter, Rembrandt and it is \"characterized by an illuminated triangle under the eye of the subject, on the less illuminated side of the face\". What you are trying to do is \"create a small inverted triangle of light on the subject’s cheek which is opposite the light source\". The lights that create the inverted triangle will also create catch lights in your subject's eyes. This is very important. Without catch lights, your subject will look flat and lifeless. Position your subject so that their body is facing the main light.  Have the second light at about a 45 degree angle (3 o'clock position) to your subject.  Position your camera between the two lights.  With your main light focused on your subject, take your second light (or reflector) and put it at about a 45 degree angle. This second light will be at about 'half power' to the main light. Basically, your subject will be 'facing' in between your two lights, towards the camera.",
  "tyn_model":[
    "camera",
    "lighting",
    "lights",
    "reflector"
  ],
  "tyn_section":[

  ]
}