{
  "title":"How to Make Pepperoni and Italian Sausage Pizza",
  "url":"https://www.wikihow.com/Make-Pepperoni-and-Italian-Sausage-Pizza",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals",
    "Pizza"
  ],
  "steps":[
    {
      "headline":"Preheat your oven to 400-450 degrees Fahrenheit (or 205-230 degrees Celsius).",
      "description":""
    },
    {
      "headline":"Get a non-stick skillet (a small frying pan), and heat it until it is on medium heat.",
      "description":"Cut the Italian sausage into bite-sized pieces, then cook the pieces in the skillet until browned. Set aside."
    },
    {
      "headline":"Gather the pizza dough and tomato sauce.",
      "description":"Spread tomato sauce on the pizza dough, leaving around ⁄2 inch (1.3 cm) off the edge. Add the thyme, oregano, basil, salt and pepper."
    },
    {
      "headline":"Sprinkle the mozzarella cheese over the tomato sauce.",
      "description":"Then add the Italian sausage (which was prepared and cooked earlier) and pepperoni slices, and cover over the mozzarella."
    },
    {
      "headline":"Put the pizza into oven and bake for eight to ten minutes, or until the edges of crust are golden brown and cheese is thoroughly melted.",
      "description":"When done, remove pizza from the oven and let it cool for a few minutes."
    },
    {
      "headline":"Enjoy!",
      "description":""
    }
  ],
  "text":" Preheat your oven to 400-450 degrees Fahrenheit (or 205-230 degrees Celsius).  Get a non-stick skillet (a small frying pan), and heat it until it is on medium heat. Cut the Italian sausage into bite-sized pieces, then cook the pieces in the skillet until browned. Set aside. Gather the pizza dough and tomato sauce. Spread tomato sauce on the pizza dough, leaving around ⁄2 inch (1.3 cm) off the edge. Add the thyme, oregano, basil, salt and pepper. Sprinkle the mozzarella cheese over the tomato sauce. Then add the Italian sausage (which was prepared and cooked earlier) and pepperoni slices, and cover over the mozzarella. Put the pizza into oven and bake for eight to ten minutes, or until the edges of crust are golden brown and cheese is thoroughly melted. When done, remove pizza from the oven and let it cool for a few minutes. Enjoy! ",
  "tyn_model":[
    "oven",
    "tomato sauce",
    "italian sausage",
    "pizza dough",
    "non-stick skillet",
    "small frying pan",
    "skillet",
    "thyme",
    "oregano",
    "basil",
    "salt",
    "pepper",
    "pepperoni"
  ],
  "tyn_section":[

  ]
}