{
  "title":"How to Make Gluten Free No Bake Peanut Butter Bars",
  "url":"https://www.wikihow.com/Make-Gluten-Free-No-Bake-Peanut-Butter-Bars",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Specialty Diet Recipes",
    "Gluten Free Dishes"
  ],
  "steps":[
    {
      "headline":"Melt the butter in a small saucepan.",
      "description":""
    },
    {
      "headline":"Put the graham cracker crumbs and the confectioner's sugar in a medium sized bowl.",
      "description":""
    },
    {
      "headline":"Stir in the 1 cup of peanut butter in with the butter.",
      "description":""
    },
    {
      "headline":"Mix together all of the above ingredients and stir them well.",
      "description":""
    },
    {
      "headline":"Melt the chocolate and the 4 tablespoons of peanut butter.",
      "description":"To do that:\nPut the chips and peanut butter in a microwave safe bowl\nHeat for thirty seconds at a time. Remove from the microwave and stir thoroughly. Continue until it is full melted and mixed together."
    },
    {
      "headline":"Pour the chocolate (white in this case) over the other mixture.",
      "description":""
    },
    {
      "headline":"Refrigerate for at least one hour.",
      "description":"After setting, the bars/rounds are ready to serve."
    }
  ],
  "text":" Melt the butter in a small saucepan.  Put the graham cracker crumbs and the confectioner's sugar in a medium sized bowl.  Stir in the 1 cup of peanut butter in with the butter.  Mix together all of the above ingredients and stir them well.  Melt the chocolate and the 4 tablespoons of peanut butter. To do that:\nPut the chips and peanut butter in a microwave safe bowl\nHeat for thirty seconds at a time. Remove from the microwave and stir thoroughly. Continue until it is full melted and mixed together. Pour the chocolate (white in this case) over the other mixture.  Refrigerate for at least one hour. After setting, the bars/rounds are ready to serve.",
  "tyn_model":[
    "peanut butter",
    "butter",
    "chocolate",
    "small saucepan",
    "graham cracker crumbs",
    "confectioner's sugar",
    "medium sized bowl",
    "microwave safe bowl",
    "microwave"
  ],
  "tyn_section":[

  ]
}