{
  "title":"How to Make Disney Dishwasher Magnets",
  "url":"https://www.wikihow.com/Make-Disney-Dishwasher-Magnets",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Plastic and Adhesive Projects",
    "Making Magnets"
  ],
  "steps":[
    {
      "headline":"Begin by wiping the magnets clean using a wet warm cloth and dish soap.",
      "description":""
    },
    {
      "headline":"Cover both magnet strips on one side with scrapbook paper using the sponge brush and glue.",
      "description":""
    },
    {
      "headline":"Print out the images of the Disney character you want to use, and cut them out.",
      "description":""
    },
    {
      "headline":"Using the glue and sponge brush, apply the pictures onto the magnetic strips wherever desired.",
      "description":"Make sure there is enough space left for the letters."
    },
    {
      "headline":"Coat the strip in modge podge to ensure that the printed images stays firmly planted onto the scrapbook paper.",
      "description":""
    },
    {
      "headline":"Let dry for 30 minutes.",
      "description":""
    },
    {
      "headline":"Apply the stick letters to spell out “Clean” and “Dirty.”",
      "description":""
    },
    {
      "headline":"Let dry overnight.",
      "description":"For best results, place the strips under a heavy book or objects once they are dry enough to prevent warping and air bubbles."
    },
    {
      "headline":"Stick onto your dishwasher and enjoy!",
      "description":""
    }
  ],
  "text":" Begin by wiping the magnets clean using a wet warm cloth and dish soap.  Cover both magnet strips on one side with scrapbook paper using the sponge brush and glue.  Print out the images of the Disney character you want to use, and cut them out.  Using the glue and sponge brush, apply the pictures onto the magnetic strips wherever desired. Make sure there is enough space left for the letters. Coat the strip in modge podge to ensure that the printed images stays firmly planted onto the scrapbook paper.  Let dry for 30 minutes.  Apply the stick letters to spell out “Clean” and “Dirty.”  Let dry overnight. For best results, place the strips under a heavy book or objects once they are dry enough to prevent warping and air bubbles. Stick onto your dishwasher and enjoy! ",
  "tyn_model":[
    "scrapbook paper",
    "sponge brush",
    "glue",
    "warm cloth",
    "dish soap",
    "magnetic strips",
    "modge podge",
    "“clean",
    "” and",
    "“dirty",
    "”  ",
    "dishwasher and"
  ],
  "tyn_section":[

  ]
}