{
  "title":"How to Personalize Your Desk",
  "url":"https://www.wikihow.com/Personalize-Your-Desk",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture"
  ],
  "methods":[
    {
      "name":"Organizing the Space",
      "steps":[
        {
          "headline":"Use a desk caddy, bins, or stylish trays for small items.",
          "description":"Wall space can also be used for storage with options like open shelving, cubes, or pegboard to organize loose paperwork and hang tools like scissors. Be creative with storage: use decorative glasses to hold pens, repurposed and repainted food jars to keep paper clips, or even spray-painted muffin tins to keep a drawer organized."
        },
        {
          "headline":"Try bookends to keep folders, books, and binders in place.",
          "description":"Unique sets are often found in thrift stores but you can also repurpose pieces of wood, marble or other heavy materials to make your own."
        },
        {
          "headline":"Manage your schedule with a calendar.",
          "description":"A large, markable version is easy to use and can be personalized with pictures and drawings. DIY a perpetual calendar: attach 3 mug hooks to an inexpensive wood plaque, write the twelve months of the year as well as two sets of numbers (0-9) on blank gift tags. The tags hang on the hooks to display the date. Paint and customize the wood and tags to suit your taste."
        },
        {
          "headline":"Choose daily use supplies in colors and designs you like.",
          "description":"Unique magnets and push pins can be playful and useful. Customize pens and pencils, tape dispensers, staplers and other items you already own with patterned washi tape. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJulie Naylon\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organizer\t\t\t\t\t\t\t\tJulie Naylon is the Founder of No Wire Hangers, a professional organizing service based out of Los Angeles, California. No Wire Hangers provides residential and office organizing and consulting services. Julie's work has been featured in Daily Candy, Marie Claire, and Architectural Digest, and she has appeared on The Conan O’Brien Show. In 2009 at The Los Angeles Organizing Awards she was honored with “The Most Eco-Friendly Organizer”. Julie Naylon\t\t\tProfessional Organizer\t\t\t\tWhen you're organizing your desk, only keep what's essential. Group together all of your office supplies, then determine what you actually need on your desk and what you can keep in a drawer or a bag. Also, gather all the paperwork on your desk and sort through it. Also, it helps to get rid of anything you can easily access online or to scan any paperwork so you don't have to keep a hard copy of them."
        }
      ]
    },
    {
      "name":"Decorating with Style",
      "steps":[
        {
          "headline":"Display personal photos.",
          "description":"Use a bulletin board or a wire with clips to eliminate bulky frames. If you're in an office environment, limit the number of images and make sure that they're appropriate."
        },
        {
          "headline":"Incorporate color.",
          "description":"Calming, natural tones like soft blues and greens can reduce stress and anxiety. Pops of energizing colors like orange and red can stimulate creativity."
        },
        {
          "headline":"Add plants to your workspace.",
          "description":"Indoor plants like the Peace Lily, English ivy, Golden pothos and Sansevieria improve air quality. They can also thrive in the low light of an office. Lower care options also include moss terrariums, a vase of fresh flowers or a sand zen garden."
        },
        {
          "headline":"Bring your own chair and lamp.",
          "description":"When possible, this is a great way to express your individual style. Chairs should be compact and made for use with a desk; add a small decorative pillow or cushion for added comfort. A desktop lamp will provide soft lighting if you're in a windowless environment and also counter harsh fluorescent lights."
        },
        {
          "headline":"Hang “wallpaper”.",
          "description":"Attach printed material like wrapping paper, fabric, art prints or posters to walls or cubicle dividers to brighten up a dull space - just make sure it's removable to avoid a mess later."
        },
        {
          "headline":"Use a one-of-a-kind mug or water bottle.",
          "description":"Simple personal items bring joy to daily routines, especially if they feature quotes and images, or have a special memory attached to them."
        }
      ]
    },
    {
      "name":"Working Efficiently",
      "steps":[
        {
          "headline":"Employ necessary tools that combine form and function.",
          "description":"A desk blotter and mouse pad can be customized with photos, reminders and encouraging quotes that keep you focused. A computer screen wallpaper image can calm and inspire you."
        },
        {
          "headline":"Get a timer or clock.",
          "description":"Timepieces can be attractive  - but more importantly they keep you on task and help you avoid the distraction of picking up your phone. DIY your own desk clock easily: purchase an inexpensive clock kit and follow the instructions, using virtually any material you can drill a hole into for the clock face."
        },
        {
          "headline":"Keep books at your desk for reference.",
          "description":"Choose titles that are related to your studies, your company mission, or even inspirational texts."
        },
        {
          "headline":"Invest in a simple desk toy or puzzle.",
          "description":"Although it may seem like a way to end up off-task, quick but challenging puzzles and games can actually spark creativity and wake up sluggish brains."
        }
      ]
    }
  ],
  "text":" Organizing the Space Use a desk caddy, bins, or stylish trays for small items. Wall space can also be used for storage with options like open shelving, cubes, or pegboard to organize loose paperwork and hang tools like scissors. Be creative with storage: use decorative glasses to hold pens, repurposed and repainted food jars to keep paper clips, or even spray-painted muffin tins to keep a drawer organized. Try bookends to keep folders, books, and binders in place. Unique sets are often found in thrift stores but you can also repurpose pieces of wood, marble or other heavy materials to make your own. Manage your schedule with a calendar. A large, markable version is easy to use and can be personalized with pictures and drawings. DIY a perpetual calendar: attach 3 mug hooks to an inexpensive wood plaque, write the twelve months of the year as well as two sets of numbers (0-9) on blank gift tags. The tags hang on the hooks to display the date. Paint and customize the wood and tags to suit your taste. Choose daily use supplies in colors and designs you like. Unique magnets and push pins can be playful and useful. Customize pens and pencils, tape dispensers, staplers and other items you already own with patterned washi tape. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tJulie Naylon\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organizer\t\t\t\t\t\t\t\tJulie Naylon is the Founder of No Wire Hangers, a professional organizing service based out of Los Angeles, California. No Wire Hangers provides residential and office organizing and consulting services. Julie's work has been featured in Daily Candy, Marie Claire, and Architectural Digest, and she has appeared on The Conan O’Brien Show. In 2009 at The Los Angeles Organizing Awards she was honored with “The Most Eco-Friendly Organizer”. Julie Naylon\t\t\tProfessional Organizer\t\t\t\tWhen you're organizing your desk, only keep what's essential. Group together all of your office supplies, then determine what you actually need on your desk and what you can keep in a drawer or a bag. Also, gather all the paperwork on your desk and sort through it. Also, it helps to get rid of anything you can easily access online or to scan any paperwork so you don't have to keep a hard copy of them. Decorating with Style Display personal photos. Use a bulletin board or a wire with clips to eliminate bulky frames. If you're in an office environment, limit the number of images and make sure that they're appropriate. Incorporate color. Calming, natural tones like soft blues and greens can reduce stress and anxiety. Pops of energizing colors like orange and red can stimulate creativity. Add plants to your workspace. Indoor plants like the Peace Lily, English ivy, Golden pothos and Sansevieria improve air quality. They can also thrive in the low light of an office. Lower care options also include moss terrariums, a vase of fresh flowers or a sand zen garden. Bring your own chair and lamp. When possible, this is a great way to express your individual style. Chairs should be compact and made for use with a desk; add a small decorative pillow or cushion for added comfort. A desktop lamp will provide soft lighting if you're in a windowless environment and also counter harsh fluorescent lights. Hang “wallpaper”. Attach printed material like wrapping paper, fabric, art prints or posters to walls or cubicle dividers to brighten up a dull space - just make sure it's removable to avoid a mess later. Use a one-of-a-kind mug or water bottle. Simple personal items bring joy to daily routines, especially if they feature quotes and images, or have a special memory attached to them. Working Efficiently Employ necessary tools that combine form and function. A desk blotter and mouse pad can be customized with photos, reminders and encouraging quotes that keep you focused. A computer screen wallpaper image can calm and inspire you. Get a timer or clock. Timepieces can be attractive  - but more importantly they keep you on task and help you avoid the distraction of picking up your phone. DIY your own desk clock easily: purchase an inexpensive clock kit and follow the instructions, using virtually any material you can drill a hole into for the clock face. Keep books at your desk for reference. Choose titles that are related to your studies, your company mission, or even inspirational texts. Invest in a simple desk toy or puzzle. Although it may seem like a way to end up off-task, quick but challenging puzzles and games can actually spark creativity and wake up sluggish brains.",
  "tyn_model":[
    "no wire hangers",
    "”.",
    "plants",
    "scissors",
    "glasses",
    "bookends",
    "calendar",
    "perpetual calendar",
    "paint",
    "magnets",
    "push pins",
    "pens",
    "tape dispensers",
    "washi tape",
    "naylon",
    "professional organizing",
    "architectural digest",
    "“the",
    "organizer",
    "bulletin board",
    "color",
    "peace lily",
    "english ivy",
    "golden pothos and",
    "chair",
    "lamp",
    "chairs",
    "“wallpaper",
    "water bottle",
    "desk blotter",
    "timer",
    "clock",
    "timepieces",
    "books",
    "desk toy",
    "puzzles"
  ],
  "tyn_section":[

  ]
}