{
  "title":"How to Make Treasure Balls",
  "url":"https://www.wikihow.com/Make-Treasure-Balls",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids"
  ],
  "methods":[
    {
      "name":"Paper Mache' Method",
      "steps":[
        {
          "headline":"Blow up a small balloon to a diameter of 4–5 inches (10.2–12.7 cm).",
          "description":"Tie it closed."
        },
        {
          "headline":"Cover the balloon in paper mache'.",
          "description":"You can use any method you choose, but cover the balloon entirely. See Create Papier Mâché for wikiHow instructions."
        },
        {
          "headline":"Allow the paper mache to dry completely.",
          "description":""
        },
        {
          "headline":"Pop the balloon.",
          "description":""
        },
        {
          "headline":"Cut a \"door\" in one side.",
          "description":""
        },
        {
          "headline":"Place trinkets inside.",
          "description":""
        },
        {
          "headline":"Re-seal the opening.",
          "description":""
        },
        {
          "headline":"Decorate as desired.",
          "description":""
        },
        {
          "headline":"Give your gift... and encourage the recipient to play with the ball until it falls apart, spilling the trinkets.",
          "description":""
        }
      ]
    },
    {
      "name":"Cloth Method",
      "steps":[
        {
          "headline":"Cut two strips of cloth 4 inches (10.2 cm) wide by 45 inches (114.3 cm) long.",
          "description":""
        },
        {
          "headline":"Cut one strip of cloth one inch wide by 45 inches (114.3 cm) long.",
          "description":""
        },
        {
          "headline":"Wrap the small gifts in the cloth, adding them in layers and covering them with successive wrapped layers of cloth to form a ball shape.",
          "description":""
        },
        {
          "headline":"Finish wrapping with the one inch strip, tucking the ends under a previous layer to prevent accidental unwrapping.",
          "description":""
        },
        {
          "headline":"Add a cloth bow or ribbon as decoration.",
          "description":""
        },
        {
          "headline":"Give your gift... and encourage the recipient to unwrap it.",
          "description":""
        }
      ]
    },
    {
      "name":"Coffee Grounds and Sand Method",
      "steps":[
        {
          "headline":"Mix",
          "description":"1 cup of old coffee grinds A Cup of flour 1/2 a Cup of salt 1/4 cup sand 3/4 cup water"
        },
        {
          "headline":"Knead into a dough, adding extra flour if the mixture is runny or sticky.",
          "description":""
        },
        {
          "headline":"Form the dough into a ball.",
          "description":""
        },
        {
          "headline":"Make a hole in the dough ball with your finger.",
          "description":""
        },
        {
          "headline":"Place the small gift or surprise inside the hole.",
          "description":""
        },
        {
          "headline":"Seal the hole by rolling the ball and pinching the opening closed.",
          "description":""
        },
        {
          "headline":"Allow the ball to dry.",
          "description":""
        },
        {
          "headline":"Give your gift to the recipient and encourage them to smash the ball to find the treasure.",
          "description":""
        }
      ]
    }
  ],
  "text":" Paper Mache' Method Blow up a small balloon to a diameter of 4–5 inches (10.2–12.7 cm). Tie it closed. Cover the balloon in paper mache'. You can use any method you choose, but cover the balloon entirely. See Create Papier Mâché for wikiHow instructions. Allow the paper mache to dry completely.  Pop the balloon.  Cut a \"door\" in one side.  Place trinkets inside.  Re-seal the opening.  Decorate as desired.  Give your gift... and encourage the recipient to play with the ball until it falls apart, spilling the trinkets.  Cloth Method Cut two strips of cloth 4 inches (10.2 cm) wide by 45 inches (114.3 cm) long.  Cut one strip of cloth one inch wide by 45 inches (114.3 cm) long.  Wrap the small gifts in the cloth, adding them in layers and covering them with successive wrapped layers of cloth to form a ball shape.  Finish wrapping with the one inch strip, tucking the ends under a previous layer to prevent accidental unwrapping.  Add a cloth bow or ribbon as decoration.  Give your gift... and encourage the recipient to unwrap it.  Coffee Grounds and Sand Method Mix 1 cup of old coffee grinds A Cup of flour 1/2 a Cup of salt 1/4 cup sand 3/4 cup water Knead into a dough, adding extra flour if the mixture is runny or sticky.  Form the dough into a ball.  Make a hole in the dough ball with your finger.  Place the small gift or surprise inside the hole.  Seal the hole by rolling the ball and pinching the opening closed.  Allow the ball to dry.  Give your gift to the recipient and encourage them to smash the ball to find the treasure. ",
  "tyn_model":[
    "cloth",
    "balloon",
    "paper mache",
    "flour",
    "papier mâché",
    "ribbon",
    "coffee grounds",
    "coffee grinds",
    "salt",
    "sand",
    "water"
  ],
  "tyn_section":[

  ]
}