{
  "title":"How to Knit a Sweet Dreams Travel Pillow",
  "url":"https://www.wikihow.com/Knit-a-Sweet-Dreams-Travel-Pillow",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Knitting and Crochet",
    "Knitting"
  ],
  "steps":[
    {
      "headline":"Make the right front",
      "description":""
    },
    {
      "headline":"With A, cast on 7 sts.",
      "description":""
    },
    {
      "headline":"Rows 1, 3, 5 (RS) Inc, k to last st, inc.",
      "description":""
    },
    {
      "headline":"Rows 2 and 4 Inc, p to last st, inc.",
      "description":""
    },
    {
      "headline":"Row 6 Purl.",
      "description":"Rep rows 5–6 three times more-23 sts. Work 12 rows even in St st."
    },
    {
      "headline":"Row 25 (RS) Inc, k across.",
      "description":"Work 3 rows even in St st."
    },
    {
      "headline":"Row 29 (RS) Rep row 25.",
      "description":""
    },
    {
      "headline":"Row 30 Purl.",
      "description":""
    },
    {
      "headline":"Row 31 Rep row 25.",
      "description":""
    },
    {
      "headline":"Row 32 Purl across to last st, inc-27 sts.",
      "description":"Place all sts on holder."
    },
    {
      "headline":"Make the left front and complete front",
      "description":""
    },
    {
      "headline":"Work as for rows 1–32 of right front, reversing all shaping, do not put sts on holder.",
      "description":""
    },
    {
      "headline":"Row 33 (RS) Knit to end, cast on 4 sts, k across 27 sts on holder-58 sts.",
      "description":"Work 19 rows even in St st."
    },
    {
      "headline":"Row 53 (RS) Ssk, k to last 2 sts, k2tog-56 sts.",
      "description":"Work 3 rows even in St st."
    },
    {
      "headline":"Row 57 (RS) Rep row 53-54 sts.",
      "description":"Work 1 row even in St st. Rep last 2 rows 4 times more-46 sts. Row 67 Rep row 53-44 sts."
    },
    {
      "headline":"Row 68 P2tog, p across, ssp-42 sts.",
      "description":"Rep last 2 rows once more-38 sts. Bind off 4 sts at beg of next 2 rows, 6 sts at beg of next 2 rows. Bind off rem 18 sts."
    },
    {
      "headline":"Make the bottom back",
      "description":""
    },
    {
      "headline":"Note Back is made in 2 pieces.",
      "description":""
    },
    {
      "headline":"With B, work as for front through row 52.",
      "description":"Rows 53–56 Work in k1, p1 rib. Bind off."
    },
    {
      "headline":"Make the top back",
      "description":""
    },
    {
      "headline":"With B, cast on 58 sts.",
      "description":""
    },
    {
      "headline":"Rows 1–4 Work in k1, p1 rib.",
      "description":""
    },
    {
      "headline":"Row 5 (buttonhole row) [K13, k2tog, yo] 3 times, k13.",
      "description":""
    },
    {
      "headline":"Row 6 Purl.",
      "description":"Complete to match front, starting with row 53."
    },
    {
      "headline":"Finish the pillow cover",
      "description":""
    },
    {
      "headline":"Steam all pieces.",
      "description":"Using B and yarn needle, follow chart to embroider clouds in duplicate stitch, spacing them randomly over front (our sample has 7 clouds, 3 of which are reversed image of chart). Trace around front to make a liner pattern. Cut out 2 identical liner pieces from fleece fabric and sew tog leaving a gap for stuffing. Clip seams and turn right side out, stuffing with buckwheat hulls or fiberfill. Sew gap. Pin knitted back pieces to front, overlapping ribbed edge of top back over ribbed edge of lower back. With A, crochet hook and front facing, work a rnd of sc around entire edge, followed by 2 rnds of sl st. Fasten off. Sew buttons on ribbed edge of bottom back. Place stuffed pillow inside cover"
    }
  ],
  "text":" Make the right front  With A, cast on 7 sts.  Rows 1, 3, 5 (RS) Inc, k to last st, inc.  Rows 2 and 4 Inc, p to last st, inc.  Row 6 Purl. Rep rows 5–6 three times more-23 sts. Work 12 rows even in St st. Row 25 (RS) Inc, k across. Work 3 rows even in St st. Row 29 (RS) Rep row 25.  Row 30 Purl.  Row 31 Rep row 25.  Row 32 Purl across to last st, inc-27 sts. Place all sts on holder. Make the left front and complete front  Work as for rows 1–32 of right front, reversing all shaping, do not put sts on holder.  Row 33 (RS) Knit to end, cast on 4 sts, k across 27 sts on holder-58 sts. Work 19 rows even in St st. Row 53 (RS) Ssk, k to last 2 sts, k2tog-56 sts. Work 3 rows even in St st. Row 57 (RS) Rep row 53-54 sts. Work 1 row even in St st. Rep last 2 rows 4 times more-46 sts. Row 67 Rep row 53-44 sts. Row 68 P2tog, p across, ssp-42 sts. Rep last 2 rows once more-38 sts. Bind off 4 sts at beg of next 2 rows, 6 sts at beg of next 2 rows. Bind off rem 18 sts. Make the bottom back  Note Back is made in 2 pieces.  With B, work as for front through row 52. Rows 53–56 Work in k1, p1 rib. Bind off. Make the top back  With B, cast on 58 sts.  Rows 1–4 Work in k1, p1 rib.  Row 5 (buttonhole row) [K13, k2tog, yo] 3 times, k13.  Row 6 Purl. Complete to match front, starting with row 53. Finish the pillow cover  Steam all pieces. Using B and yarn needle, follow chart to embroider clouds in duplicate stitch, spacing them randomly over front (our sample has 7 clouds, 3 of which are reversed image of chart). Trace around front to make a liner pattern. Cut out 2 identical liner pieces from fleece fabric and sew tog leaving a gap for stuffing. Clip seams and turn right side out, stuffing with buckwheat hulls or fiberfill. Sew gap. Pin knitted back pieces to front, overlapping ribbed edge of top back over ribbed edge of lower back. With A, crochet hook and front facing, work a rnd of sc around entire edge, followed by 2 rnds of sl st. Fasten off. Sew buttons on ribbed edge of bottom back. Place stuffed pillow inside cover",
  "tyn_model":[
    "pillow cover",
    "yarn",
    "fleece fabric",
    "buckwheat hulls",
    "fiberfill",
    "crochet hook",
    "buttons",
    "pillow"
  ],
  "tyn_section":[

  ]
}