{
  "title":"How to Remove Fold Marks from Vinyl Shower Curtains",
  "url":"https://www.wikihow.com/Remove-Fold-Marks-from-Vinyl-Shower-Curtains",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Doors and Windows",
    "Window Treatments",
    "Curtains"
  ],
  "methods":[
    {
      "name":"Putting the Curtain in the Washing Machine",
      "steps":[
        {
          "headline":"Place the curtain in the washing machine with a load of towels.",
          "description":"Another easy way to get out fold from a vinyl shower curtain is to place it in your washing machine with a load of towels. The heat and water in the machine will help to massage out the folds in the vinyl, with little manpower or work on your end."
        },
        {
          "headline":"Choose a warm water setting.",
          "description":"Select the gentle cycle and turn on the washing machine. You will then need to watch the machine until it hits the rinse cycle. Once the machine hits the rinse cycle, remove the curtain from the washing machine. It will be dripping wet at this point, but that’s okay as you are going to let it dry over your bathtub."
        },
        {
          "headline":"Hang the shower curtain over your bathtub.",
          "description":"Take the dripping shower curtain and gently hang it up over your bathtub using the shower curtain rings. Make sure the bottom of the shower curtain is inside the bathtub, not on the outside, so the dripping water will go into the tub."
        },
        {
          "headline":"Allow the curtain to dry.",
          "description":"Once you have hung up the shower curtain, let it dry overnight. The weight of the dripping water as well as the exposure to air should flatten out any folds in the curtain."
        }
      ]
    },
    {
      "name":"Using a Hair Dryer or an Iron",
      "steps":[
        {
          "headline":"Lay the curtain on a flat surface.",
          "description":"Start by spreading out the curtain on a flat surface, such as a wood table, a clean floor, or a clean counter. If you are trying to remove folds from a large curtain, you may need to work in sections, moving the section on to the flat surface to remove the folds. You may lay down a piece of cardboard or a clean towel underneath the curtain to protect the surface from heat if you are concerned about damaging the surface. You could then move the piece of cardboard underneath each section as you apply heat to it."
        },
        {
          "headline":"Set the hair dryer to the low heat setting.",
          "description":"Use a low heat setting so you do not risk melting or damaging the vinyl shower curtain. If you are using an iron, select the low heat setting so you do not risk scorching the curtain."
        },
        {
          "headline":"Hold the hair dryer or iron ½ - 1 inch from the curtain.",
          "description":"Make sure you keep the hair dryer or iron hovering over the curtain and do not place it directly on the curtain. Holding it ½ - 1 inch from the curtain should be close enough for the heat to straighten out the folds. Run the hair dryer or iron over the folds slowly in small circular motions. Let the dryer hover over the fold for a few seconds, shaking the hair dryer or iron slightly. This will let the hot air disperse over the vinyl without burning it."
        },
        {
          "headline":"Remove the folds in sections.",
          "description":"Focus on one section of the curtain at a time, hovering the dryer or iron over the folds. Once one section is flattened, move on to the next section. It may take a few minutes for the fold to straighten out so be patient and work slowly. You may place your hand on the fold lightly to check that the curtain is not too hot or sticky as you remove the folds. You may need to let the curtain sit out flat and cool once you have removed all the folds. You can then hang it up and use it."
        }
      ]
    },
    {
      "name":"Removing the Folds with a Squeegee",
      "steps":[
        {
          "headline":"Spread out the curtain on a flat surface.",
          "description":"To use this method, you will first need to spread out the curtain on a flat, even surface, like a clean floor or a clean table top. You can work in sections if the shower curtain is very large and has many folds. You may use the squeegee on a section and once the folds are removed, shift the curtain so the new section lays on the flat surface."
        },
        {
          "headline":"Use a squeegee or a flattening tool over the curtain.",
          "description":"You can use a commercial squeegee made to clean windows from a hardware supply store or online. You can also use a flat piece of cardboard or a curved flattening tool, often used to crease and fold paper. Make sure the tool does not have any sharp edges or sections, as they could cut or damage the curtain."
        },
        {
          "headline":"Press and pull lightly on the curtain to remove the folds.",
          "description":"Use the squeegee or the flattening tool to remove the folds by pressing and pulling lightly over the folds. Hold the top section of the curtain or tape it to the surface so it stays in place as you press and pull the folds out of the curtain. Work through each fold carefully. You may need to press and pull with the squeegee over the fold several times to flatten it out. Once you have removed a fold from a section, move on to a new section until all the folds in the curtain have been removed."
        }
      ]
    }
  ],
  "text":" Putting the Curtain in the Washing Machine Place the curtain in the washing machine with a load of towels. Another easy way to get out fold from a vinyl shower curtain is to place it in your washing machine with a load of towels. The heat and water in the machine will help to massage out the folds in the vinyl, with little manpower or work on your end. Choose a warm water setting. Select the gentle cycle and turn on the washing machine. You will then need to watch the machine until it hits the rinse cycle. Once the machine hits the rinse cycle, remove the curtain from the washing machine. It will be dripping wet at this point, but that’s okay as you are going to let it dry over your bathtub. Hang the shower curtain over your bathtub. Take the dripping shower curtain and gently hang it up over your bathtub using the shower curtain rings. Make sure the bottom of the shower curtain is inside the bathtub, not on the outside, so the dripping water will go into the tub. Allow the curtain to dry. Once you have hung up the shower curtain, let it dry overnight. The weight of the dripping water as well as the exposure to air should flatten out any folds in the curtain. Using a Hair Dryer or an Iron Lay the curtain on a flat surface. Start by spreading out the curtain on a flat surface, such as a wood table, a clean floor, or a clean counter. If you are trying to remove folds from a large curtain, you may need to work in sections, moving the section on to the flat surface to remove the folds. You may lay down a piece of cardboard or a clean towel underneath the curtain to protect the surface from heat if you are concerned about damaging the surface. You could then move the piece of cardboard underneath each section as you apply heat to it. Set the hair dryer to the low heat setting. Use a low heat setting so you do not risk melting or damaging the vinyl shower curtain. If you are using an iron, select the low heat setting so you do not risk scorching the curtain. Hold the hair dryer or iron ½ - 1 inch from the curtain. Make sure you keep the hair dryer or iron hovering over the curtain and do not place it directly on the curtain. Holding it ½ - 1 inch from the curtain should be close enough for the heat to straighten out the folds. Run the hair dryer or iron over the folds slowly in small circular motions. Let the dryer hover over the fold for a few seconds, shaking the hair dryer or iron slightly. This will let the hot air disperse over the vinyl without burning it. Remove the folds in sections. Focus on one section of the curtain at a time, hovering the dryer or iron over the folds. Once one section is flattened, move on to the next section. It may take a few minutes for the fold to straighten out so be patient and work slowly. You may place your hand on the fold lightly to check that the curtain is not too hot or sticky as you remove the folds. You may need to let the curtain sit out flat and cool once you have removed all the folds. You can then hang it up and use it. Removing the Folds with a Squeegee Spread out the curtain on a flat surface. To use this method, you will first need to spread out the curtain on a flat, even surface, like a clean floor or a clean table top. You can work in sections if the shower curtain is very large and has many folds. You may use the squeegee on a section and once the folds are removed, shift the curtain so the new section lays on the flat surface. Use a squeegee or a flattening tool over the curtain. You can use a commercial squeegee made to clean windows from a hardware supply store or online. You can also use a flat piece of cardboard or a curved flattening tool, often used to crease and fold paper. Make sure the tool does not have any sharp edges or sections, as they could cut or damage the curtain. Press and pull lightly on the curtain to remove the folds. Use the squeegee or the flattening tool to remove the folds by pressing and pulling lightly over the folds. Hold the top section of the curtain or tape it to the surface so it stays in place as you press and pull the folds out of the curtain. Work through each fold carefully. You may need to press and pull with the squeegee over the fold several times to flatten it out. Once you have removed a fold from a section, move on to a new section until all the folds in the curtain have been removed.",
  "tyn_model":[
    "shower curtain",
    "iron",
    "hair dryer",
    "squeegee",
    "washing machine",
    "water",
    "cardboard",
    "towels",
    "dryer",
    "flattening tool",
    "curtain",
    "paper"
  ],
  "tyn_section":[

  ]
}