{
  "title":"How to Make a Glass Bottle Centerpiece",
  "url":"https://www.wikihow.com/Make-a-Glass-Bottle-Centerpiece",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Glass and Stained Glass Projects",
    "Glass Bottle Projects"
  ],
  "methods":[
    {
      "name":"Choosing a Suitable Bottle",
      "steps":[
        {
          "headline":"Decide on a bottle that will enhance your centerpiece.",
          "description":"You don't want the bottle to be the showstopper, but instead the delivery vehicle that holds the pizazz."
        },
        {
          "headline":"Choose a bottle that complements your overall theme.",
          "description":"If sleek and modern is what you hope to achieve, a simple, clear glass bottle without ornate designs will fit the bill."
        },
        {
          "headline":"Use a bottle that carries some meaning.",
          "description":"You could always repurpose your grandmother's vase or a bottle that has meaning to your family for your centerpiece."
        }
      ]
    },
    {
      "name":"Filling the Bottle With Trinkets",
      "steps":[
        {
          "headline":"Add sparkly marbles, rocks or jewels.",
          "description":"Line the bottom or entire bottle with sparkle by choosing something clear or glistening. Make sure the items can easily fit through the mouth of the bottle."
        },
        {
          "headline":"Line the bottle with rustic looking stones or rocks.",
          "description":"For a more rugged appearance, rocks, stones or pebbles provide an authentic country house or farmhouse theme. Choose ones with interesting shapes, textures and colors."
        },
        {
          "headline":"Drop greenery or flower petals inside the vase.",
          "description":"Before you add your flowering flourish, consider enhancing the bottle with separate petals or greenery. Consider using silk or artificial flowers/petals/stems instead of real plants if you plan to use the bottle centerpiece for more than one evening."
        },
        {
          "headline":"Fill with slices of fruit or vegetables.",
          "description":"Another way to add interest is to drop chunks of lemon, mango or even small pieces of broccoli inside the bottle."
        },
        {
          "headline":"Place candy inside the bottle.",
          "description":"Red Hots or any other small hard candies would suffice. To match a holiday theme, one example would be to drop broken candy canes inside the bottle for a festive touch."
        },
        {
          "headline":"Line the bottle with sand for a beach focused centerpiece.",
          "description":"Don't forget to add small shell pieces as well."
        }
      ]
    },
    {
      "name":"Adding Liquid",
      "steps":[
        {
          "headline":"Color the water inside your clear bottle centerpiece for added interest.",
          "description":"Especially if you need a burst of color, add a few drops of food coloring to the water until you've reached the desired color."
        },
        {
          "headline":"Pop some bubbly instead of regular water.",
          "description":"Try putting sparkling water inside the bottle. Add immediately before guests arrive so the bubbles are sparkling."
        },
        {
          "headline":"Use bottled water to fill the centerpiece.",
          "description":"While tap water may be fine, sometimes treated tap water may be somewhat discolored, especially if the water coming from your tap is from a well. Bottled water will ensure that your centerpiece is clear and clean."
        }
      ]
    },
    {
      "name":"Considerations when Working with Flowers or Greenery",
      "steps":[
        {
          "headline":"Use silk flowers for centerpieces that contain base items such as sand or candy.",
          "description":"They won't need watering to survive."
        },
        {
          "headline":"Select flowers or greenery that will enhance the bottle centerpiece but not overwhelm it.",
          "description":"Height and girth of the flowers should be taken into consideration in terms of how it influences the width and size of the bottle."
        },
        {
          "headline":"Don't overwhelm the bottle with too much greenery or flowers.",
          "description":"he bottle can only handle so many flowers or greenery, so don't try to stuff it too heavily."
        }
      ]
    }
  ],
  "text":" Choosing a Suitable Bottle Decide on a bottle that will enhance your centerpiece. You don't want the bottle to be the showstopper, but instead the delivery vehicle that holds the pizazz. Choose a bottle that complements your overall theme. If sleek and modern is what you hope to achieve, a simple, clear glass bottle without ornate designs will fit the bill. Use a bottle that carries some meaning. You could always repurpose your grandmother's vase or a bottle that has meaning to your family for your centerpiece. Filling the Bottle With Trinkets Add sparkly marbles, rocks or jewels. Line the bottom or entire bottle with sparkle by choosing something clear or glistening. Make sure the items can easily fit through the mouth of the bottle. Line the bottle with rustic looking stones or rocks. For a more rugged appearance, rocks, stones or pebbles provide an authentic country house or farmhouse theme. Choose ones with interesting shapes, textures and colors. Drop greenery or flower petals inside the vase. Before you add your flowering flourish, consider enhancing the bottle with separate petals or greenery. Consider using silk or artificial flowers/petals/stems instead of real plants if you plan to use the bottle centerpiece for more than one evening. Fill with slices of fruit or vegetables. Another way to add interest is to drop chunks of lemon, mango or even small pieces of broccoli inside the bottle. Place candy inside the bottle. Red Hots or any other small hard candies would suffice. To match a holiday theme, one example would be to drop broken candy canes inside the bottle for a festive touch. Line the bottle with sand for a beach focused centerpiece. Don't forget to add small shell pieces as well. Adding Liquid Color the water inside your clear bottle centerpiece for added interest. Especially if you need a burst of color, add a few drops of food coloring to the water until you've reached the desired color. Pop some bubbly instead of regular water. Try putting sparkling water inside the bottle. Add immediately before guests arrive so the bubbles are sparkling. Use bottled water to fill the centerpiece. While tap water may be fine, sometimes treated tap water may be somewhat discolored, especially if the water coming from your tap is from a well. Bottled water will ensure that your centerpiece is clear and clean. Considerations when Working with Flowers or Greenery Use silk flowers for centerpieces that contain base items such as sand or candy. They won't need watering to survive. Select flowers or greenery that will enhance the bottle centerpiece but not overwhelm it. Height and girth of the flowers should be taken into consideration in terms of how it influences the width and size of the bottle. Don't overwhelm the bottle with too much greenery or flowers. he bottle can only handle so many flowers or greenery, so don't try to stuff it too heavily.",
  "tyn_model":[
    "bottle",
    "water",
    "flowers",
    "rocks",
    "vase",
    "stones",
    "bottle centerpiece",
    "bottled water",
    "jewels",
    "pebbles",
    "plants",
    "broccoli",
    "candy",
    "red hots",
    "sand",
    "food coloring",
    "sparkling water"
  ],
  "tyn_section":[

  ]
}