{
  "title":"How to Clean with Vodka",
  "url":"https://www.wikihow.com/Clean-with-Vodka",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "methods":[
    {
      "name":"Arm Yourself with Supplies",
      "steps":[
        {
          "headline":"Purchase a standard bottle of vodka.",
          "description":"Skip the expensive brand or the flavor infused vodka--you want this powerful spirit to remove the grime and dirt so go for the cheap stuff."
        },
        {
          "headline":"Pick up a large (clean) spray bottle and funnel.",
          "description":"You’ll get more vodka in the bottle if you use the funnel to transfer it from gallon jug to spray bottle."
        },
        {
          "headline":"Purchase a permanent magic marker or Sharpie pen.",
          "description":"You will need to clearly mark what is in the spray bottle or plan to empty it after each use."
        },
        {
          "headline":"Locate scrub brushes, dust rags and any other device/tool you use to clean the house.",
          "description":"Also, a nice pair of rubber gloves will protect your hands from the harshness in the alcohol."
        }
      ]
    },
    {
      "name":"Freshen Laundry",
      "steps":[
        {
          "headline":"Locate clothing that you’ve worn and could be freshened but don’t need to be washed.",
          "description":"That means no stains or foul odor on the clothing--those items should be cleaned."
        },
        {
          "headline":"Fill a spray bottle with vodka and turn the nozzle to “mist.” You don't want any direct “hits” on the clothing, but a simple misting.",
          "description":""
        },
        {
          "headline":"Test each garment before spraying the entire thing by spraying a small amount of vodka on a hidden area of the clothing.",
          "description":"Be wary of delicates such as silk or suede."
        },
        {
          "headline":"Hang clothing on a rack and then mist lightly with the vodka.",
          "description":"Allow to air dry in a well-ventilated area so the vodka can do its job--killing odor causing bacteria. Don’t worry--you won’t smell like the bar as vodka is odorless when dry."
        }
      ]
    },
    {
      "name":"Clean and Shine Fixtures",
      "steps":[
        {
          "headline":"Grab a clean, soft rag that will allow you to polish and shine fixtures in your home.",
          "description":""
        },
        {
          "headline":"Remove the nozzle to the vodka filled spray bottle, exposing the top.",
          "description":""
        },
        {
          "headline":"Turn the bottle over onto the clean rag so that the vodka permeates the rag.",
          "description":"You don't want to saturate it but make sure you have enough vodka on the rag to clean."
        },
        {
          "headline":"Rub the vodka infused rag over fixtures or glass until shiny.",
          "description":"You may need to put a little muscle into making the fixtures really shine."
        },
        {
          "headline":"Go over the job with a clean, dry rag to remove any residue vodka and polish the fixtures.",
          "description":""
        }
      ]
    },
    {
      "name":"Remove Mold and Mildew",
      "steps":[
        {
          "headline":"Fill spray bottle with vodka and apply directly to mold or mildew stains.",
          "description":"Turn nozzle to the “spray” setting as you will want to blast that fungus out of your life."
        },
        {
          "headline":"Allow vodka to sit on the stain for a few minutes and then follow up with a good scrubbing.",
          "description":"Use a scrub brush and some muscle to remove and polish surfaces. For difficult or tight spots, use an old toothbrush to get into small cracks. Discard the toothbrush after using (so you don’t brush your teeth with it by accident)."
        }
      ]
    }
  ],
  "text":" Arm Yourself with Supplies Purchase a standard bottle of vodka. Skip the expensive brand or the flavor infused vodka--you want this powerful spirit to remove the grime and dirt so go for the cheap stuff. Pick up a large (clean) spray bottle and funnel. You’ll get more vodka in the bottle if you use the funnel to transfer it from gallon jug to spray bottle. Purchase a permanent magic marker or Sharpie pen. You will need to clearly mark what is in the spray bottle or plan to empty it after each use. Locate scrub brushes, dust rags and any other device/tool you use to clean the house. Also, a nice pair of rubber gloves will protect your hands from the harshness in the alcohol. Freshen Laundry Locate clothing that you’ve worn and could be freshened but don’t need to be washed. That means no stains or foul odor on the clothing--those items should be cleaned. Fill a spray bottle with vodka and turn the nozzle to “mist.” You don't want any direct “hits” on the clothing, but a simple misting.  Test each garment before spraying the entire thing by spraying a small amount of vodka on a hidden area of the clothing. Be wary of delicates such as silk or suede. Hang clothing on a rack and then mist lightly with the vodka. Allow to air dry in a well-ventilated area so the vodka can do its job--killing odor causing bacteria. Don’t worry--you won’t smell like the bar as vodka is odorless when dry. Clean and Shine Fixtures Grab a clean, soft rag that will allow you to polish and shine fixtures in your home.  Remove the nozzle to the vodka filled spray bottle, exposing the top.  Turn the bottle over onto the clean rag so that the vodka permeates the rag. You don't want to saturate it but make sure you have enough vodka on the rag to clean. Rub the vodka infused rag over fixtures or glass until shiny. You may need to put a little muscle into making the fixtures really shine. Go over the job with a clean, dry rag to remove any residue vodka and polish the fixtures.  Remove Mold and Mildew Fill spray bottle with vodka and apply directly to mold or mildew stains. Turn nozzle to the “spray” setting as you will want to blast that fungus out of your life. Allow vodka to sit on the stain for a few minutes and then follow up with a good scrubbing. Use a scrub brush and some muscle to remove and polish surfaces. For difficult or tight spots, use an old toothbrush to get into small cracks. Discard the toothbrush after using (so you don’t brush your teeth with it by accident).",
  "tyn_model":[
    "vodka",
    "spray bottle",
    "funnel",
    "toothbrush",
    "permanent magic marker",
    "sharpie pen",
    "scrub brushes",
    "rubber gloves",
    "alcohol",
    "“mist",
    "” you",
    "“hits",
    "” on",
    "vodka filled spray bottle",
    "vodka infused rag",
    "“spray",
    "” setting",
    "scrub brush"
  ],
  "tyn_section":[

  ]
}