{
  "title":"How to Make Cream Cheese Brownies",
  "url":"https://www.wikihow.com/Make-Cream-Cheese-Brownies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Brownies"
  ],
  "steps":[
    {
      "headline":"Melt 6 ounces of unsalted butter with 2 packages of German sweet chocolate bars, over medium heat.",
      "description":"If you are in a hurry or want to go easy on the butter, skip this stage and use 2 cups of Nestle semi-sweet chocolate chips instead."
    },
    {
      "headline":"Preheat your oven to 350 degrees and spray a 9 inch (22.9 cm) by 13 inch (33.0 cm) Pyrex glass casserole with cooking spray.",
      "description":"Set aside."
    },
    {
      "headline":"Stir the chocolate and butter while they are melting, until they're totally blended.",
      "description":"Once done, turn off the burner and put aside."
    },
    {
      "headline":"Soften 4 ounces of unsalted butter and 6 ounces of light Neufchatel cream cheese in a large bowl.",
      "description":"(Soften it in the oven for a few minutes or put them out hours before making, at room temperature.)"
    },
    {
      "headline":"Add 2 cups of granulated white sugar",
      "description":""
    },
    {
      "headline":"Mix well together until it is creamy and soft",
      "description":""
    },
    {
      "headline":"Add one tablespoon real vanilla and mix well",
      "description":""
    },
    {
      "headline":"Add 6 medium or large (only 5 if you are using extra-large) eggs.",
      "description":""
    },
    {
      "headline":"Mix well.",
      "description":""
    },
    {
      "headline":"Put in one cup plus 2 level tablespoons of unbleached white flour in a small, separate bowl.",
      "description":""
    },
    {
      "headline":"Add 1 teaspoon salt and 1 teaspoon of baking powder to the flour mixture.",
      "description":"Stir well."
    },
    {
      "headline":"Add the flour mixture -- by hand and with a fork -- to the butter/sugar/egg/vanilla mixture.",
      "description":"Don't over beat. If you are using a Cuisinart or Kitchen Aid mixer, do this for only a few seconds, until it is just mixed. Over beating can detract from the lightness of finished brownie."
    },
    {
      "headline":"Pour the entire batter into the glass Pyrex casserole/baking pan, scraping the sides of the bowl with a rubber spatula.",
      "description":""
    },
    {
      "headline":"Either pour the chocolate and butter mixture into three columns, then with a knife, swirl them very, very carefully.",
      "description":"OR, if you decided to use chocolate chips, sprinkle the two cups (or more) of chips on top of the mixture."
    },
    {
      "headline":"Bake in a 350 degree oven until lightly browned on top and until a toothpick or knife goes in and comes out clean.",
      "description":""
    },
    {
      "headline":"Cool.",
      "description":"The chocolate has to harden."
    },
    {
      "headline":"Eat -- or cut up into two inch squares and freeze when it has cooled enough to put into freezer.",
      "description":""
    }
  ],
  "text":" Melt 6 ounces of unsalted butter with 2 packages of German sweet chocolate bars, over medium heat. If you are in a hurry or want to go easy on the butter, skip this stage and use 2 cups of Nestle semi-sweet chocolate chips instead. Preheat your oven to 350 degrees and spray a 9 inch (22.9 cm) by 13 inch (33.0 cm) Pyrex glass casserole with cooking spray. Set aside. Stir the chocolate and butter while they are melting, until they're totally blended. Once done, turn off the burner and put aside. Soften 4 ounces of unsalted butter and 6 ounces of light Neufchatel cream cheese in a large bowl. (Soften it in the oven for a few minutes or put them out hours before making, at room temperature.) Add 2 cups of granulated white sugar  Mix well together until it is creamy and soft  Add one tablespoon real vanilla and mix well  Add 6 medium or large (only 5 if you are using extra-large) eggs.  Mix well.  Put in one cup plus 2 level tablespoons of unbleached white flour in a small, separate bowl.  Add 1 teaspoon salt and 1 teaspoon of baking powder to the flour mixture. Stir well. Add the flour mixture -- by hand and with a fork -- to the butter/sugar/egg/vanilla mixture. Don't over beat. If you are using a Cuisinart or Kitchen Aid mixer, do this for only a few seconds, until it is just mixed. Over beating can detract from the lightness of finished brownie. Pour the entire batter into the glass Pyrex casserole/baking pan, scraping the sides of the bowl with a rubber spatula.  Either pour the chocolate and butter mixture into three columns, then with a knife, swirl them very, very carefully. OR, if you decided to use chocolate chips, sprinkle the two cups (or more) of chips on top of the mixture. Bake in a 350 degree oven until lightly browned on top and until a toothpick or knife goes in and comes out clean.  Cool. The chocolate has to harden. Eat -- or cut up into two inch squares and freeze when it has cooled enough to put into freezer. ",
  "tyn_model":[
    "butter",
    "chocolate",
    "unsalted butter",
    "bowl",
    "flour",
    "german sweet chocolate bars",
    "nestle semi-sweet chocolate chips",
    "oven",
    "pyrex glass casserole",
    "cooking spray",
    "neufchatel cream cheese",
    "large bowl",
    "granulated white sugar",
    "vanilla",
    "eggs",
    "white flour",
    "salt",
    "baking powder",
    "egg",
    "cuisinart or kitchen aid mixer",
    "pyrex casserole/baking pan",
    "rubber spatula",
    "knife",
    "chocolate chips"
  ],
  "tyn_section":[

  ]
}