{
  "title":"How to Make Baked Apples with Vanilla Sauce",
  "url":"https://www.wikihow.com/Make-Baked-Apples-with-Vanilla-Sauce",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Apples"
  ],
  "steps":[
    {
      "headline":"Preheat your oven to 325 to 350 degrees Fahrenheit (depending on your stove).",
      "description":""
    },
    {
      "headline":"Mix together walnuts and brown and white sugar.",
      "description":""
    },
    {
      "headline":"Stuff cored apples with the sugar-walnut mixture.",
      "description":""
    },
    {
      "headline":"Place the applies in the center of the puff pastry squares.",
      "description":""
    },
    {
      "headline":"Fold the pastry around the apple, completely encasing it.",
      "description":""
    },
    {
      "headline":"Sprinkle with the remaining sugar (2 teaspoons) and insert the cinnamon sticks ⁄4 inch (0.6 cm) down into the core.",
      "description":""
    },
    {
      "headline":"Bake until the pastry turns a light brown and puffs (10 - 20 minutes, depending on your oven).",
      "description":""
    },
    {
      "headline":"Make the vanilla sauce.",
      "description":"Bring the cream, sugar, and vanilla to a slow boil over medium heat. Be sure not to burn. Add the cornstarch/water mixture and cook for 2 minutes on simmer, stirring constantly, until it has thickened."
    },
    {
      "headline":"Remove the apples from the oven.",
      "description":""
    },
    {
      "headline":"Place on dessert plates and serve the warm sauce over the top.",
      "description":""
    }
  ],
  "text":" Preheat your oven to 325 to 350 degrees Fahrenheit (depending on your stove).  Mix together walnuts and brown and white sugar.  Stuff cored apples with the sugar-walnut mixture.  Place the applies in the center of the puff pastry squares.  Fold the pastry around the apple, completely encasing it.  Sprinkle with the remaining sugar (2 teaspoons) and insert the cinnamon sticks ⁄4 inch (0.6 cm) down into the core.  Bake until the pastry turns a light brown and puffs (10 - 20 minutes, depending on your oven).  Make the vanilla sauce. Bring the cream, sugar, and vanilla to a slow boil over medium heat. Be sure not to burn. Add the cornstarch/water mixture and cook for 2 minutes on simmer, stirring constantly, until it has thickened. Remove the apples from the oven.  Place on dessert plates and serve the warm sauce over the top. ",
  "tyn_model":[
    "sugar",
    "oven",
    "pastry",
    "walnuts",
    "white sugar",
    "walnut",
    "puff pastry",
    "cinnamon sticks",
    "vanilla sauce",
    "cream",
    "vanilla",
    "cornstarch",
    "water",
    "apples",
    "dessert plates"
  ],
  "tyn_section":[

  ]
}