{
  "title":"How to Make Natural Tea",
  "url":"https://www.wikihow.com/Make-Natural-Tea",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Tea",
    "Herbal Tea",
    "Mint Tea"
  ],
  "steps":[
    {
      "headline":"Go to a garden, and smell all the types of leaves there.",
      "description":"If any leaf smells good, pick it up. Also, pluck up some marigolds and mint as well, then come home. Now, just keep the garden pickings on a plate and leave it in the sun for a day or longer until the leaves dry and are able to be crumbled. If you're not sure whether the plant is edible, check online or follow these steps: How to Test if a Plant Is Edible\n\nDon't choose plants that may have been sprayed by pesticides. That's not very natural at all!"
    },
    {
      "headline":"Crumble these leaves into small pieces, using your hand.",
      "description":"The marigolds won't, though, so instead just pluck the petals and keep it with the leaves."
    },
    {
      "headline":"Pour about a cup of water in the tea maker.",
      "description":"If there are more people, then add more water."
    },
    {
      "headline":"Add some honey into the maker according to the number of people in the place.",
      "description":"Let it be warm."
    },
    {
      "headline":"Add all the smashed up leaves, mints and marigolds in the maker (not much, just a teaspoon per cup), and then let it boil.",
      "description":""
    },
    {
      "headline":"After it boils, pour the tea into the cup.",
      "description":"There you have it, your natural tea, fresh made by nature. Just smell it, smells great, doesn't it? This tea will appear green, so now say \"Goodbye!\" to those expensive green teas."
    }
  ],
  "text":" Go to a garden, and smell all the types of leaves there. If any leaf smells good, pick it up. Also, pluck up some marigolds and mint as well, then come home. Now, just keep the garden pickings on a plate and leave it in the sun for a day or longer until the leaves dry and are able to be crumbled. If you're not sure whether the plant is edible, check online or follow these steps: How to Test if a Plant Is Edible\n\nDon't choose plants that may have been sprayed by pesticides. That's not very natural at all! Crumble these leaves into small pieces, using your hand. The marigolds won't, though, so instead just pluck the petals and keep it with the leaves. Pour about a cup of water in the tea maker. If there are more people, then add more water. Add some honey into the maker according to the number of people in the place. Let it be warm. Add all the smashed up leaves, mints and marigolds in the maker (not much, just a teaspoon per cup), and then let it boil.  After it boils, pour the tea into the cup. There you have it, your natural tea, fresh made by nature. Just smell it, smells great, doesn't it? This tea will appear green, so now say \"Goodbye!\" to those expensive green teas.",
  "tyn_model":[
    "tea",
    "marigolds",
    "water",
    "mint",
    "garden pickings",
    "plate",
    "tea maker",
    "honey",
    "teas"
  ],
  "tyn_section":[

  ]
}