{
  "title":"How to Eat Healthily at a Japanese Restaurant",
  "url":"https://www.wikihow.com/Eat-Healthily-at-a-Japanese-Restaurant",
  "category_hierarchy":[
    "Food and Entertaining",
    "Dining Out"
  ],
  "methods":[
    {
      "name":"Choosing Healthy Options",
      "steps":[
        {
          "headline":"Start with edamame.",
          "description":"Steamed edamame is a perfect vegetable appetizer to enjoy before any Japanese meal. The edamame will help fill your stomach a bit so that you don’t overeat your main course. Additionally, edamame, or soybeans, are an excellent source of protein and virtually fat-free. You can ask your server for pickled vegetables if you don’t want the edamame."
        },
        {
          "headline":"Try the miso soup or a seaweed salad.",
          "description":"Miso soup is prepared with a stock to which a variety of vegetables (and occasionally tofu) are added. Which vegetables are added depends on which region your chef’s recipe is from and which recipe they’re using. No two miso soups are alike. What is consistent, though, is that this is a virtually fat-free soup full of vitamins and antioxidants. Seaweed salad is also chock-full of minerals and vitamins, and like miso soup, takes the edge off your hunger in a healthy way. Seaweed is used throughout Japanese cuisine, from tofu to salad. Most Japanese restaurants will have other salad options as well, such as a traditional dinner salad or cucumber salad. If you’re watching your sodium consumption, skip the miso soup, which can contain half the sodium that you need in one day."
        },
        {
          "headline":"Choose which method of healthy eating you prefer.",
          "description":"What constitutes a healthy meal to you may vary from what someone else views as healthy. You might feel that a low-carbohydrate diet equates to a healthy way of eating, whereas your friend might believe that low-fat diets or paleo diets are the way to go. Knowing how you define healthy eating is helpful when eating out, as this will inform your food selections. If you’re on a low-carbohydrate diet or concerned about a low Glycemic Index number, skip rice with your meal and ask for extra vegetables instead. Japanese food is beautiful and delicious, but many of the sauces are prepared with sugar or large quantities of salt. Ask for sauce on the side so that you can regulate how much you consume. If you want to stick with low-fat options, avoid tempura foods and opt for grilled meats instead. If you’d like a paleo or Whole30 meal, look to the sushi menu. Ask the sushi chef to prepare your meal without rice, or consider ordering sashimi instead. Also, make sure to bring your own bottle of coconut aminos with you to use instead of soy sauce."
        },
        {
          "headline":"Have a cup of tea.",
          "description":"Finish off your delicious meal with a cup of green tea. This tea is loaded with antioxidants, even more than fruits and vegetables, and boasts a variety of other health benefits. A cup of green tea is also known to boost your metabolism, helping you digest your meal more efficiently and quicker."
        },
        {
          "headline":"Eat mindfully.",
          "description":"No matter what sort of cuisine you’re eating, it’s important to practice portion control. Japanese cuisine can be very healthy, but portion sizes are still a necessary consideration. The best way to practice portion control is to be mindful of every bite that you take. Chew it, savor it, experience it, consider it, and wait before taking that next bite. Eating this way will not only increase your enjoyment of your meal, it will help you hear your body when it signals that it’s no longer hungry. Try to order so that half of your plate is made up of vegetables, a quarter of your plate is protein, and a quarter of your plate is of starch (starchy vegetables, rice, etc. )."
        }
      ]
    },
    {
      "name":"Being Aware of Less Healthy Options",
      "steps":[
        {
          "headline":"Stay away from salad dressing.",
          "description":"Salad dressing in any restaurant is typically a less healthy choice, and Japanese restaurants are no exception. Your food may come with a dinner salad, or you might order salad as an appetizer. Either way, inquire about the dressing. If it’s described as creamy or oily, ask for an alternative, such as vinegar, or skip the dressing altogether."
        },
        {
          "headline":"Avoid tempura.",
          "description":"Tempura is a method of cooking that is largely similar to deep-fried food. Tempura means that a meat, vegetable, or even cake is battered and then lightly fried. Tempura batter tends to be much lighter than other types of batters, like beer batter or traditional flour batter, but is still not the healthiest option. Instead of choosing anything prepared tempura, look for grilled or steamed options."
        },
        {
          "headline":"Don’t eat katsu foods.",
          "description":"Katsu describes a food that is pan fried. Pan fried foods are cooked with added oils, fats, or butters. If you are opting for a low-fat diet, you’ll want to stay away from katsu-style foods. Just like with tempura, ask your server if they have any grilled, broiled, or steamed versions of the food that you’re interested in."
        },
        {
          "headline":"Limit your sodium.",
          "description":"You might be watching your sodium intake, and as you know, any restaurant is going to have an elevated sodium content. Because salt enhances the flavors in foods, you’re likely to find it in just about everything that you order. Ask for your food to be steamed and for any sauce to be put on the side. This will ensure that you get the least amount of sodium possible in your meal. Also, use soy sauce sparingly or ask for a reduced sodium version of soy sauce."
        },
        {
          "headline":"Swap out white rice for brown rice.",
          "description":"White rice is a staple in most Japanese restaurants and an excellent accompaniment to your meal. If you’re trying to watch your carbohydrate intake, though, white rice isn’t a healthy option for you. Ask your server if they can swap your white rice for steamed brown rice, which is full of more nutrients compared to white rice — like fiber, B vitamins, and vitamins E and K.\nIf the restaurant doesn’t offer brown rice, ask them to skip the rice altogether or ask if they’ll substitute steamed vegetables in place of the white rice. You can also ask if the restaurant will swap brown for white rice in your sushi."
        },
        {
          "headline":"Choose your fish wisely.",
          "description":"Fish is typically rich in vitamins, omega-3 fatty acids, and minerals —  all nutrients that the body needs. Fish that is prepared healthily, such as steamed or broiled, can be an excellent, healthy choice when eating out. If you’re watching your fat intake, though, you’ll do well to stay away from fattier fish. Examples of fattier fish are mackerel, eel, whitefish, salmon, and sardines. Examples of leaner fish are bass, cod, flounder, mahi mahi, and tuna. Some fatty fish, like salmon, are high in Omega-3 acids, which promote heart health."
        }
      ]
    },
    {
      "name":"Knowing Your Sushi",
      "steps":[
        {
          "headline":"Order vegetable rolls.",
          "description":"Vegetable rolls are exactly what the name suggests — rolls made entirely of vegetables. Some sushi restaurants will even skip the rice and wrap the rolls in paper-thin slices of cucumber or zucchini. Vegetable rolls are low-fat, low-carb, low-sodium, and absolutely brimming with vitamins, minerals, and good nutrients. Make sure that your vegetable rolls don’t have any added oils or cream cheese."
        },
        {
          "headline":"Watch out for the term “crunchy.” Crunch or crunchy are two signal words that indicate some or all of your sushi roll is fried.",
          "description":"Frying your sushi instantly makes your meal unhealthy. If you’re looking for crunch in your sushi roll, opt for those with naturally crunchy vegetables like cucumbers and bamboo shoots."
        },
        {
          "headline":"Opt for sashimi.",
          "description":"Sushi is prepared over vinegared, white rice, whereas sashimi is bare slices of raw fish. Sashimi is a no-carbohydrate, protein-packed way of enjoying Japanese cuisine. You’ll see the term rolls also, which isn’t another name for sushi or sashimi. Instead, rolls are a combination of sashimi and sushi wrapped in dried seaweed. Of the three, sashimi is the lowest in carbohydrates, but all are good options."
        },
        {
          "headline":"Eat your wasabi.",
          "description":"Wasabi is the green, spicy paste that accompanies your sushi. Wasabi is actually a type of radish and it’s loaded with antioxidants. Be careful, though, and eat your wasabi sparingly. A small amount packs a big punch. You might also be offered pickled ginger with your sushi, which is another excellent flavor enhancer that is chock-full of vitamins and minerals such as Manganese, Niacin, Potassium, Zinc, Pyridoxine, and Iron. Ginger is also a natural tummy soother."
        },
        {
          "headline":"Limit your avocado intake.",
          "description":"Avocado is a perfect filler in many types of sushi. It’s creamy, mild, and packs a heart-healthy bunch of fats. Unfortunately, too much avocado does mean too much fat and the calories add up quickly. If you’re watching your fat or caloric intake, limit the avocado in your sushi."
        },
        {
          "headline":"Steer clear of fancy sushi rolls.",
          "description":"Classic sushi is almost always the healthiest sushi, as it contains rice, fish, and vegetables. Fancier, more modern sushi, on the other hand, might have high-fat or high-calorie ingredients, such as duck, cream cheese, and even sugar. Classic sushi is usually rolled on the inside and typically contains one ingredient. Fancy, modern, or fusion sushi usually has multiple ingredients and the rice typically faces outward. Some classic sushi examples are tuna rolls, cucumber rolls, eel and cucumber rolls, and pickle rolls. Some fusion or fancy sushi examples are California rolls, spicy scallop rolls, tempura rolls, or crunchy tuna avocado rolls. If everyone at the table orders a different type of roll, you can all share and sample one of each kind. This is a great way to try a variety of rolls without over-indulging in any one type."
        }
      ]
    }
  ],
  "text":" Choosing Healthy Options Start with edamame. Steamed edamame is a perfect vegetable appetizer to enjoy before any Japanese meal. The edamame will help fill your stomach a bit so that you don’t overeat your main course. Additionally, edamame, or soybeans, are an excellent source of protein and virtually fat-free. You can ask your server for pickled vegetables if you don’t want the edamame. Try the miso soup or a seaweed salad. Miso soup is prepared with a stock to which a variety of vegetables (and occasionally tofu) are added. Which vegetables are added depends on which region your chef’s recipe is from and which recipe they’re using. No two miso soups are alike. What is consistent, though, is that this is a virtually fat-free soup full of vitamins and antioxidants. Seaweed salad is also chock-full of minerals and vitamins, and like miso soup, takes the edge off your hunger in a healthy way. Seaweed is used throughout Japanese cuisine, from tofu to salad. Most Japanese restaurants will have other salad options as well, such as a traditional dinner salad or cucumber salad. If you’re watching your sodium consumption, skip the miso soup, which can contain half the sodium that you need in one day. Choose which method of healthy eating you prefer. What constitutes a healthy meal to you may vary from what someone else views as healthy. You might feel that a low-carbohydrate diet equates to a healthy way of eating, whereas your friend might believe that low-fat diets or paleo diets are the way to go. Knowing how you define healthy eating is helpful when eating out, as this will inform your food selections. If you’re on a low-carbohydrate diet or concerned about a low Glycemic Index number, skip rice with your meal and ask for extra vegetables instead. Japanese food is beautiful and delicious, but many of the sauces are prepared with sugar or large quantities of salt. Ask for sauce on the side so that you can regulate how much you consume. If you want to stick with low-fat options, avoid tempura foods and opt for grilled meats instead. If you’d like a paleo or Whole30 meal, look to the sushi menu. Ask the sushi chef to prepare your meal without rice, or consider ordering sashimi instead. Also, make sure to bring your own bottle of coconut aminos with you to use instead of soy sauce. Have a cup of tea. Finish off your delicious meal with a cup of green tea. This tea is loaded with antioxidants, even more than fruits and vegetables, and boasts a variety of other health benefits. A cup of green tea is also known to boost your metabolism, helping you digest your meal more efficiently and quicker. Eat mindfully. No matter what sort of cuisine you’re eating, it’s important to practice portion control. Japanese cuisine can be very healthy, but portion sizes are still a necessary consideration. The best way to practice portion control is to be mindful of every bite that you take. Chew it, savor it, experience it, consider it, and wait before taking that next bite. Eating this way will not only increase your enjoyment of your meal, it will help you hear your body when it signals that it’s no longer hungry. Try to order so that half of your plate is made up of vegetables, a quarter of your plate is protein, and a quarter of your plate is of starch (starchy vegetables, rice, etc. ). Being Aware of Less Healthy Options Stay away from salad dressing. Salad dressing in any restaurant is typically a less healthy choice, and Japanese restaurants are no exception. Your food may come with a dinner salad, or you might order salad as an appetizer. Either way, inquire about the dressing. If it’s described as creamy or oily, ask for an alternative, such as vinegar, or skip the dressing altogether. Avoid tempura. Tempura is a method of cooking that is largely similar to deep-fried food. Tempura means that a meat, vegetable, or even cake is battered and then lightly fried. Tempura batter tends to be much lighter than other types of batters, like beer batter or traditional flour batter, but is still not the healthiest option. Instead of choosing anything prepared tempura, look for grilled or steamed options. Don’t eat katsu foods. Katsu describes a food that is pan fried. Pan fried foods are cooked with added oils, fats, or butters. If you are opting for a low-fat diet, you’ll want to stay away from katsu-style foods. Just like with tempura, ask your server if they have any grilled, broiled, or steamed versions of the food that you’re interested in. Limit your sodium. You might be watching your sodium intake, and as you know, any restaurant is going to have an elevated sodium content. Because salt enhances the flavors in foods, you’re likely to find it in just about everything that you order. Ask for your food to be steamed and for any sauce to be put on the side. This will ensure that you get the least amount of sodium possible in your meal. Also, use soy sauce sparingly or ask for a reduced sodium version of soy sauce. Swap out white rice for brown rice. White rice is a staple in most Japanese restaurants and an excellent accompaniment to your meal. If you’re trying to watch your carbohydrate intake, though, white rice isn’t a healthy option for you. Ask your server if they can swap your white rice for steamed brown rice, which is full of more nutrients compared to white rice — like fiber, B vitamins, and vitamins E and K.\nIf the restaurant doesn’t offer brown rice, ask them to skip the rice altogether or ask if they’ll substitute steamed vegetables in place of the white rice. You can also ask if the restaurant will swap brown for white rice in your sushi. Choose your fish wisely. Fish is typically rich in vitamins, omega-3 fatty acids, and minerals —  all nutrients that the body needs. Fish that is prepared healthily, such as steamed or broiled, can be an excellent, healthy choice when eating out. If you’re watching your fat intake, though, you’ll do well to stay away from fattier fish. Examples of fattier fish are mackerel, eel, whitefish, salmon, and sardines. Examples of leaner fish are bass, cod, flounder, mahi mahi, and tuna. Some fatty fish, like salmon, are high in Omega-3 acids, which promote heart health. Knowing Your Sushi Order vegetable rolls. Vegetable rolls are exactly what the name suggests — rolls made entirely of vegetables. Some sushi restaurants will even skip the rice and wrap the rolls in paper-thin slices of cucumber or zucchini. Vegetable rolls are low-fat, low-carb, low-sodium, and absolutely brimming with vitamins, minerals, and good nutrients. Make sure that your vegetable rolls don’t have any added oils or cream cheese. Watch out for the term “crunchy.” Crunch or crunchy are two signal words that indicate some or all of your sushi roll is fried. Frying your sushi instantly makes your meal unhealthy. If you’re looking for crunch in your sushi roll, opt for those with naturally crunchy vegetables like cucumbers and bamboo shoots. Opt for sashimi. Sushi is prepared over vinegared, white rice, whereas sashimi is bare slices of raw fish. Sashimi is a no-carbohydrate, protein-packed way of enjoying Japanese cuisine. You’ll see the term rolls also, which isn’t another name for sushi or sashimi. Instead, rolls are a combination of sashimi and sushi wrapped in dried seaweed. Of the three, sashimi is the lowest in carbohydrates, but all are good options. Eat your wasabi. Wasabi is the green, spicy paste that accompanies your sushi. Wasabi is actually a type of radish and it’s loaded with antioxidants. Be careful, though, and eat your wasabi sparingly. A small amount packs a big punch. You might also be offered pickled ginger with your sushi, which is another excellent flavor enhancer that is chock-full of vitamins and minerals such as Manganese, Niacin, Potassium, Zinc, Pyridoxine, and Iron. Ginger is also a natural tummy soother. Limit your avocado intake. Avocado is a perfect filler in many types of sushi. It’s creamy, mild, and packs a heart-healthy bunch of fats. Unfortunately, too much avocado does mean too much fat and the calories add up quickly. If you’re watching your fat or caloric intake, limit the avocado in your sushi. Steer clear of fancy sushi rolls. Classic sushi is almost always the healthiest sushi, as it contains rice, fish, and vegetables. Fancier, more modern sushi, on the other hand, might have high-fat or high-calorie ingredients, such as duck, cream cheese, and even sugar. Classic sushi is usually rolled on the inside and typically contains one ingredient. Fancy, modern, or fusion sushi usually has multiple ingredients and the rice typically faces outward. Some classic sushi examples are tuna rolls, cucumber rolls, eel and cucumber rolls, and pickle rolls. Some fusion or fancy sushi examples are California rolls, spicy scallop rolls, tempura rolls, or crunchy tuna avocado rolls. If everyone at the table orders a different type of roll, you can all share and sample one of each kind. This is a great way to try a variety of rolls without over-indulging in any one type.",
  "tyn_model":[
    "sushi",
    "rice",
    "fish",
    "vegetables",
    "edamame",
    "sashimi",
    "vegetable rolls",
    "wasabi",
    "avocado",
    "miso soup",
    "soy sauce",
    "tempura",
    "white rice",
    "brown rice",
    "seaweed salad",
    "cucumber",
    "green tea",
    "salad dressing",
    "salmon",
    "cream cheese",
    "sushi roll",
    "rolls",
    "soybeans",
    "tofu",
    "miso soups",
    "seaweed",
    "sauces",
    "coconut aminos",
    "tea",
    "salad",
    "vinegar",
    "deep-fried food",
    "tempura batter",
    "butters",
    "salt",
    "— like",
    "b vitamins",
    "steamed vegetables",
    "minerals",
    "—  ",
    "mackerel",
    "eel",
    "whitefish",
    "sardines",
    "bass",
    "cod",
    "flounder",
    "tuna",
    "— rolls",
    "zucchini",
    "“crunchy",
    "” crunch",
    "cucumbers",
    "radish",
    "pickled ginger",
    "iron",
    "ginger",
    "sugar",
    "tuna rolls",
    "eel and cucumber rolls",
    "pickle rolls",
    "scallop rolls",
    "tempura rolls"
  ],
  "tyn_section":[

  ]
}