{
  "title":"How to Make a Poster of the Solar System",
  "url":"https://www.wikihow.com/Make-a-Poster-of-the-Solar-System",
  "category_hierarchy":[
    "Hobbies and Crafts"
  ],
  "methods":[
    {
      "name":"Making a 3D Poster",
      "steps":[
        {
          "headline":"Gather the necessary materials.",
          "description":"To make your poster three-dimensional you will need to use Styrofoam balls to give it depth. Other materials you will need are a 5”x5”x1/2” foam sheet, glue, string, markers, tape, craft paint, a serrated knife, a silver marker/sharpie, brown construction paper, nine wooden skewers, a ruler, and a black 20” x 30” poster board. Use the following Styrofoam balls for the planets: 1 each of 5”, 4”, 3”, 2.5” and 2” balls, and 2 1.5” balls\nAdult supervision is recommended when using the knife. You’ll need the following paint colors: yellow, orange, red, green, light blue, and dark blue. These materials can be purchased at any craft store or the craft department of a superstore."
        },
        {
          "headline":"Slice all of the foam balls in half.",
          "description":"Ask an adult for help with this step. Use the knife to cut all of the balls except one of the 1.5” balls in half. It doesn’t have to be exactly in half, close to half is fine. Rub the two halves together over a trash can to brush the crumbs away after cutting. Rubbing the knife with beeswax or candle wax before cutting will make it easier to slice. Squash the second 1.5” ball on the table to compress it to about 1.25” thick, then cut it in half."
        },
        {
          "headline":"Cut a ring for the 3” ball.",
          "description":"This ring will represent Saturn’s rings. Place the 3” ball in the middle of the foam sheet and trace around it with a sharp pencil. Draw a second circle around the outside of the first circle about 1” away. Use the tip of the knife to cut out the ring. Again, have an adult help with this step. Make a uniform second circle by tracing around the exterior of your 4” ball."
        },
        {
          "headline":"Paint the balls according to planet.",
          "description":"Stick a wooden skewer into the flat part of ball. This will make it easier to paint and let stand to dry. Paint each ball the following colors:\nSun: 5” ball, yellow\nMercury: 1¼” ball, orange\nVenus: 1.5” ball, blue-green\nEarth: 1.5” ball, dark-blue\nMars: 1¼” ball, red\nJupiter: 4” ball, orange\nSaturn: 3” ball, yellow; foam ring, orange\nUranus: 2.5” ball, light-blue\nNeptune: 2” ball, dark blue"
        },
        {
          "headline":"Use the sun to map planet locations.",
          "description":"Mark the location for the center of the sun by measuring 10” down from the top of the board and 3” in from the right side of the poster. Make a small “x” to mark the center of the sun. Place the end of the ruler at the center of the sun and make a mark along the center of the poster at the distances below for each planet. These distances mark the orbits of the planets. Mercury: 3 ½” from the sun\nVenus: 4 ¾” from the sun\nEarth: 5 ¾” from the sun\nMars: 7” from the sun\nJupiter: 15 ¼” from the sun\nSaturn: 18 ½” from the sun\nUranus: 21” from the sun\nNeptune: 25 ¾” from the sun"
        },
        {
          "headline":"Create the orbit for each planet.",
          "description":"Use the string as a compass to make a circular orbit with the mark for each planet. Place one end of the string in the center mark for the sun and tape it down. Put the pencil down on the mark for Mercury and wrap the string around the pencil until it is taut. With the string extended, draw a circle around the poster board with the pencil to make the orbit. Repeat this process with each planet’s orbit, moving the pencil to each mark. Trace a dashed line on top of the pencil with the silver marker. Glue each planet somewhere on its orbit. Stagger the placement of each planet so they don’t overlap."
        },
        {
          "headline":"Add an asteroid belt between Mars and Jupiter.",
          "description":"Cut out asteroid shapes from the brown construction paper. Space out the asteroids to make a belt all along the gap between Mars and Jupiter. Glue them down and label the area “Asteroid Belt”. Asteroids are giant rocks floating through space and can easily be drawn freehand. Any rock shape you draw can be used as an asteroid."
        }
      ]
    },
    {
      "name":"Making a Flat Poster",
      "steps":[
        {
          "headline":"Gather the necessary materials.",
          "description":"To make a flat poster, you can either draw the planets or cut them out of construction paper and glue them down on the poster board. You will need a large poster board (white or black), colored construction paper (optional), scissors, markers, and white craft glue or a glue stick. Metallic markers will show up really well on a black poster board. Use these for labels."
        },
        {
          "headline":"Know the order of the planets.",
          "description":"The first step in making a solar system poster is to know how the solar system looks. Start with the sun and then add the planets in the correct order: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune. You can also include dwarf planets like Pluto, Haumea, Makemake and Eris outside of Neptune."
        },
        {
          "headline":"Cut the construction paper into planet shapes.",
          "description":"Make one for every planet in the solar system: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune. Try to cut your planets to scale: Mercury and Mars will be the smallest; Venus and Earth are slightly larger; Uranus and Neptune are about 5 times larger than Venus/Earth; Saturn is about 12 times larger; and Jupiter is the largest, about 14 times larger. Alternatively, you can print pictures of each planet and cut those out. Glue the planets onto the poster in their proper order."
        },
        {
          "headline":"Draw planets on the poster.",
          "description":"Instead of making cutouts of the planets, you can draw them directly onto the poster board. In order to draw the planets, it would be better to use a white poster board instead of a black poster board. Use markers of different colors to draw each planet. Use a geometry compass or trace circular objects of different sizes to make perfectly sized planets."
        },
        {
          "headline":"Add the asteroid belt between Mars and Jupiter.",
          "description":"Either draw asteroids with a brown marker or cut them out of construction paper and glue them down. The asteroid belt separates the inner and outer planets. Add other embellishments like comets, shooting stars, or rockets."
        },
        {
          "headline":"Research and add facts about the planets.",
          "description":"Find out specific information about the planets like their size, distance from the sun, number of moons, origin of the name, and any other interesting facts there may be. Type up a small blurb about each planet and paste it next to the planet. Make your poster really interesting by having flaps for people to lift up or different textures (tin foil is good for a space theme). Facts about the planets and solar system can be found online, at the library, or in your school textbook. Ask your parents to help you search online for information."
        }
      ]
    }
  ],
  "text":" Making a 3D Poster Gather the necessary materials. To make your poster three-dimensional you will need to use Styrofoam balls to give it depth. Other materials you will need are a 5”x5”x1/2” foam sheet, glue, string, markers, tape, craft paint, a serrated knife, a silver marker/sharpie, brown construction paper, nine wooden skewers, a ruler, and a black 20” x 30” poster board. Use the following Styrofoam balls for the planets: 1 each of 5”, 4”, 3”, 2.5” and 2” balls, and 2 1.5” balls\nAdult supervision is recommended when using the knife. You’ll need the following paint colors: yellow, orange, red, green, light blue, and dark blue. These materials can be purchased at any craft store or the craft department of a superstore. Slice all of the foam balls in half. Ask an adult for help with this step. Use the knife to cut all of the balls except one of the 1.5” balls in half. It doesn’t have to be exactly in half, close to half is fine. Rub the two halves together over a trash can to brush the crumbs away after cutting. Rubbing the knife with beeswax or candle wax before cutting will make it easier to slice. Squash the second 1.5” ball on the table to compress it to about 1.25” thick, then cut it in half. Cut a ring for the 3” ball. This ring will represent Saturn’s rings. Place the 3” ball in the middle of the foam sheet and trace around it with a sharp pencil. Draw a second circle around the outside of the first circle about 1” away. Use the tip of the knife to cut out the ring. Again, have an adult help with this step. Make a uniform second circle by tracing around the exterior of your 4” ball. Paint the balls according to planet. Stick a wooden skewer into the flat part of ball. This will make it easier to paint and let stand to dry. Paint each ball the following colors:\nSun: 5” ball, yellow\nMercury: 1¼” ball, orange\nVenus: 1.5” ball, blue-green\nEarth: 1.5” ball, dark-blue\nMars: 1¼” ball, red\nJupiter: 4” ball, orange\nSaturn: 3” ball, yellow; foam ring, orange\nUranus: 2.5” ball, light-blue\nNeptune: 2” ball, dark blue Use the sun to map planet locations. Mark the location for the center of the sun by measuring 10” down from the top of the board and 3” in from the right side of the poster. Make a small “x” to mark the center of the sun. Place the end of the ruler at the center of the sun and make a mark along the center of the poster at the distances below for each planet. These distances mark the orbits of the planets. Mercury: 3 ½” from the sun\nVenus: 4 ¾” from the sun\nEarth: 5 ¾” from the sun\nMars: 7” from the sun\nJupiter: 15 ¼” from the sun\nSaturn: 18 ½” from the sun\nUranus: 21” from the sun\nNeptune: 25 ¾” from the sun Create the orbit for each planet. Use the string as a compass to make a circular orbit with the mark for each planet. Place one end of the string in the center mark for the sun and tape it down. Put the pencil down on the mark for Mercury and wrap the string around the pencil until it is taut. With the string extended, draw a circle around the poster board with the pencil to make the orbit. Repeat this process with each planet’s orbit, moving the pencil to each mark. Trace a dashed line on top of the pencil with the silver marker. Glue each planet somewhere on its orbit. Stagger the placement of each planet so they don’t overlap. Add an asteroid belt between Mars and Jupiter. Cut out asteroid shapes from the brown construction paper. Space out the asteroids to make a belt all along the gap between Mars and Jupiter. Glue them down and label the area “Asteroid Belt”. Asteroids are giant rocks floating through space and can easily be drawn freehand. Any rock shape you draw can be used as an asteroid. Making a Flat Poster Gather the necessary materials. To make a flat poster, you can either draw the planets or cut them out of construction paper and glue them down on the poster board. You will need a large poster board (white or black), colored construction paper (optional), scissors, markers, and white craft glue or a glue stick. Metallic markers will show up really well on a black poster board. Use these for labels. Know the order of the planets. The first step in making a solar system poster is to know how the solar system looks. Start with the sun and then add the planets in the correct order: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune. You can also include dwarf planets like Pluto, Haumea, Makemake and Eris outside of Neptune. Cut the construction paper into planet shapes. Make one for every planet in the solar system: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune. Try to cut your planets to scale: Mercury and Mars will be the smallest; Venus and Earth are slightly larger; Uranus and Neptune are about 5 times larger than Venus/Earth; Saturn is about 12 times larger; and Jupiter is the largest, about 14 times larger. Alternatively, you can print pictures of each planet and cut those out. Glue the planets onto the poster in their proper order. Draw planets on the poster. Instead of making cutouts of the planets, you can draw them directly onto the poster board. In order to draw the planets, it would be better to use a white poster board instead of a black poster board. Use markers of different colors to draw each planet. Use a geometry compass or trace circular objects of different sizes to make perfectly sized planets. Add the asteroid belt between Mars and Jupiter. Either draw asteroids with a brown marker or cut them out of construction paper and glue them down. The asteroid belt separates the inner and outer planets. Add other embellishments like comets, shooting stars, or rockets. Research and add facts about the planets. Find out specific information about the planets like their size, distance from the sun, number of moons, origin of the name, and any other interesting facts there may be. Type up a small blurb about each planet and paste it next to the planet. Make your poster really interesting by having flaps for people to lift up or different textures (tin foil is good for a space theme). Facts about the planets and solar system can be found online, at the library, or in your school textbook. Ask your parents to help you search online for information.",
  "tyn_model":[
    "” ball",
    "” from",
    "construction paper",
    "glue",
    "pencil",
    "poster board",
    "markers",
    "knife",
    "neptune",
    "sun",
    "string",
    "”,",
    "” balls",
    "asteroids",
    "styrofoam balls",
    "ruler",
    "mercury",
    "earth",
    "mars",
    "saturn",
    "uranus",
    "” foam",
    "tape",
    "craft paint",
    "serrated knife",
    "wooden skewers",
    "” x",
    "” poster",
    "” and",
    "foam balls",
    "trash can",
    "beeswax or",
    "candle wax",
    "” thick",
    "foam sheet",
    "sharp pencil",
    "” away",
    "wooden skewer",
    "venus",
    "jupiter",
    "” down",
    "” in",
    "“x",
    "” to",
    "compass",
    "silver marker",
    "“asteroid",
    "”.",
    "scissors",
    "white craft glue",
    "glue stick",
    "solar system poster",
    "pluto",
    "poster",
    "geometry compass",
    "brown marker",
    "asteroid belt",
    "shooting stars",
    "rockets",
    "tin foil"
  ],
  "tyn_section":[

  ]
}