{
  "title":"How to Clean a Mattress",
  "url":"https://www.wikihow.com/Clean-a-Mattress",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "parts":[
    {
      "name":"Stripping the Bed",
      "steps":[
        {
          "headline":"Remove pillows and decorations from the bed.",
          "description":"Before you can clean the mattress, you must remove everything that’s covering it. Start by removing the top layer of items, including pillows, decorative pillows, blankets, toys, and other objects. When you remove your pillows for sleeping, take the pillow cases off and throw them in the laundry basket. Fold up blankets and move items from the bed to a different part of the room so they're out of the way when you clean."
        },
        {
          "headline":"Strip the linens.",
          "description":"Once all the decorative items, pillows, and covers are off the bed, remove any sheets that are covering the mattress. This includes top sheets, fitted sheets, and any mattress protector you may have installed. Throw fabric sheets into the laundry basket along with the pillow cases."
        },
        {
          "headline":"Wash your bedding and linens.",
          "description":"When everything is off the bed and the mattress is bare, you can begin the cleaning process. Wash the sheets, linens, and pillow cases in the washing machine while the mattress is being cleaned. That way, you'll start with a completely fresh bed. Read and follow care labels when washing any fabrics. Use the hottest water and dryer settings possible to kill any bacteria or dust mites that may be hiding in your linens. If you use a duvet, remove the cover and wash it with the linens as well."
        }
      ]
    },
    {
      "name":"Cleaning and Deodorizing the Mattress",
      "steps":[
        {
          "headline":"Vacuum.",
          "description":"The first step to cleaning your mattress is vacuuming. This will remove mites, dust, dead skin, hair, and other debris from the mattress. Use a wide brush attachment to vacuum the top of the mattress. Use the long upholstery nozzle to get into cracks, to vacuum edges and piping, and to clean the sides and corners. Before vacuuming, make sure the nozzle and brush attachments are completely clean."
        },
        {
          "headline":"Address fresh spills.",
          "description":"Any recent spills that are still wet should be cleaned immediately. Get a clean cloth damp with cold water. Blot the spill with the damp cloth. Do not rub or scrub the spill, as this can push it farther into the mattress. Keep blotting until you’ve absorbed all the excess liquid."
        },
        {
          "headline":"Spot clean stains.",
          "description":"Combine 2 tablespoons (30 ml) of hydrogen peroxide and 1 tablespoon (15 ml) of liquid dish soap in a small bowl. Use a spoon to stir them together and creates suds. Dip an old toothbrush into the suds. Gently scrub the suds into affected areas of the mattress. Wipe away excess cleaner with a clean, damp cloth. For a memory foam mattress, use only the smallest amount of cleaner possible, because memory foam should never get wet. This solution will be effective to treat stains from dirt, food, drinks. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChris Willatt\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tChris Willatt is the owner and founder of Alpine Maids, a cleaning agency in Denver, Colorado started in 2015. Alpine Maids has received Angie's List Super Service Award for three years in a row since 2016 and has been awarded Colorado's \"Top Rated Local House Cleaning\" Award in 2018. Chris Willatt\t\t\tCleaning Guru\t\t\t\tExpert Trick: You can also spot clean by pouring a small amount, enough to cover the stain, with oxidizing bleach. Let it soak into the mattress for about 15 minutes and then scrub it away with water."
        },
        {
          "headline":"Clean biological stains with enzyme cleaner.",
          "description":"Spray some enzyme cleaner onto a clean cloth. Blot the stain with the cloth to saturate it. Let the enzyme cleaner sit for about 15 minutes. Blot the area with the same cloth to remove the stain. Blot the area with a clean cloth that’s damp with cold water. Don’t spray liquid cleaners directly onto the mattress. Mattresses aren't designed to get wet, especially memory foam, so use as little cleaner as necessary to treat the stains. An enzyme cleaner will break down the proteins in blood, urine, sweat, vomit, and other biological stains. It will also be effective at treating grease and oil stains."
        },
        {
          "headline":"Sprinkle baking soda over the mattress.",
          "description":"Once you’ve dealt with stains, you can clean and deodorize the entire mattress. To do this, sprinkle a generous dusting of baking soda over the entire surface of the mattress. To give your mattress a fresh smell, stir five drops of your favorite essential oil into the baking soda before sprinkling it onto the mattress. To apply the baking soda more evenly, pour it into a sifter first, and distribute it over the mattress using the sifter."
        },
        {
          "headline":"Give the baking soda time to absorb odors.",
          "description":"Let the baking soda sit on the mattress for at least 30 minutes. This will give it time to break down acids, absorb smells, and absorb any liquid left over from your spot cleaning. You can leave the baking soda on for several hours if you have the time. The longer it’s on the mattress, the more it will absorb and clean."
        },
        {
          "headline":"Vacuum the mattress again.",
          "description":"When the baking soda has had time to sit, vacuum the mattress to remove the baking soda. You'll take acids, odors, and liquid that the baking soda has absorbed along with it. Use the brush to cover the top of the mattress, and the long nozzle to get into corners, cracks, seams, and piping."
        },
        {
          "headline":"Let the mattress air out.",
          "description":"Once the mattress is clean, it’s a good idea to let it air out for a while so any liquid left in the mattress can dry out. Moisture that’s trapped inside the mattress can lead to mold, and this will be very difficult to remove. During the warmer seasons, open a window in the room to let in fresh air and dry out the mattress faster. You can also open drapes and curtains to let in the sunshine, as the UV rays in the sun will help kill bacteria and mold on the mattress, eliminate odors even more, and dry it out faster."
        }
      ]
    },
    {
      "name":"Protecting the Mattress",
      "steps":[
        {
          "headline":"Flip or rotate the mattress.",
          "description":"For conventional mattresses that don’t have a designated top and bottom, turn the mattress over so you're sleeping on the other side. For mattresses that do have a designated top and bottom, rotate the mattress 180 degrees. This will ensure even wear over the surface of the mattress. You should flip or rotate your mattress every three to six months to ensure even wear."
        },
        {
          "headline":"Apply a mattress protector.",
          "description":"A mattress protector is a plastic case that you can use to keep your mattress safe. You slip the case over the mattress like you would with a duvet and duvet cover. Then close the zipper to seal the mattress and protect it from spills, dust, dirt, stains, and even bed bugs. There are also mattress pads and covers you can buy to protect just the top of the mattress from spills and dirt."
        },
        {
          "headline":"Make the bed.",
          "description":"When the mattress is clean, dry, flipped, and protected, you can make the bed with your clean linens. Start with the fitted sheet, followed by the top sheet. Put the pillows back in their cases, and return all pillows, blankets, and decorations to the bed as well. Feel the mattress all over before making the bed to check for moisture. If you encase a damp mattress in linens and blankets, it won’t dry out and you'll have mold growth."
        }
      ]
    }
  ],
  "text":" Stripping the Bed Remove pillows and decorations from the bed. Before you can clean the mattress, you must remove everything that’s covering it. Start by removing the top layer of items, including pillows, decorative pillows, blankets, toys, and other objects. When you remove your pillows for sleeping, take the pillow cases off and throw them in the laundry basket. Fold up blankets and move items from the bed to a different part of the room so they're out of the way when you clean. Strip the linens. Once all the decorative items, pillows, and covers are off the bed, remove any sheets that are covering the mattress. This includes top sheets, fitted sheets, and any mattress protector you may have installed. Throw fabric sheets into the laundry basket along with the pillow cases. Wash your bedding and linens. When everything is off the bed and the mattress is bare, you can begin the cleaning process. Wash the sheets, linens, and pillow cases in the washing machine while the mattress is being cleaned. That way, you'll start with a completely fresh bed. Read and follow care labels when washing any fabrics. Use the hottest water and dryer settings possible to kill any bacteria or dust mites that may be hiding in your linens. If you use a duvet, remove the cover and wash it with the linens as well. Cleaning and Deodorizing the Mattress Vacuum. The first step to cleaning your mattress is vacuuming. This will remove mites, dust, dead skin, hair, and other debris from the mattress. Use a wide brush attachment to vacuum the top of the mattress. Use the long upholstery nozzle to get into cracks, to vacuum edges and piping, and to clean the sides and corners. Before vacuuming, make sure the nozzle and brush attachments are completely clean. Address fresh spills. Any recent spills that are still wet should be cleaned immediately. Get a clean cloth damp with cold water. Blot the spill with the damp cloth. Do not rub or scrub the spill, as this can push it farther into the mattress. Keep blotting until you’ve absorbed all the excess liquid. Spot clean stains. Combine 2 tablespoons (30 ml) of hydrogen peroxide and 1 tablespoon (15 ml) of liquid dish soap in a small bowl. Use a spoon to stir them together and creates suds. Dip an old toothbrush into the suds. Gently scrub the suds into affected areas of the mattress. Wipe away excess cleaner with a clean, damp cloth. For a memory foam mattress, use only the smallest amount of cleaner possible, because memory foam should never get wet. This solution will be effective to treat stains from dirt, food, drinks. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChris Willatt\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru\t\t\t\t\t\t\t\tChris Willatt is the owner and founder of Alpine Maids, a cleaning agency in Denver, Colorado started in 2015. Alpine Maids has received Angie's List Super Service Award for three years in a row since 2016 and has been awarded Colorado's \"Top Rated Local House Cleaning\" Award in 2018. Chris Willatt\t\t\tCleaning Guru\t\t\t\tExpert Trick: You can also spot clean by pouring a small amount, enough to cover the stain, with oxidizing bleach. Let it soak into the mattress for about 15 minutes and then scrub it away with water. Clean biological stains with enzyme cleaner. Spray some enzyme cleaner onto a clean cloth. Blot the stain with the cloth to saturate it. Let the enzyme cleaner sit for about 15 minutes. Blot the area with the same cloth to remove the stain. Blot the area with a clean cloth that’s damp with cold water. Don’t spray liquid cleaners directly onto the mattress. Mattresses aren't designed to get wet, especially memory foam, so use as little cleaner as necessary to treat the stains. An enzyme cleaner will break down the proteins in blood, urine, sweat, vomit, and other biological stains. It will also be effective at treating grease and oil stains. Sprinkle baking soda over the mattress. Once you’ve dealt with stains, you can clean and deodorize the entire mattress. To do this, sprinkle a generous dusting of baking soda over the entire surface of the mattress. To give your mattress a fresh smell, stir five drops of your favorite essential oil into the baking soda before sprinkling it onto the mattress. To apply the baking soda more evenly, pour it into a sifter first, and distribute it over the mattress using the sifter. Give the baking soda time to absorb odors. Let the baking soda sit on the mattress for at least 30 minutes. This will give it time to break down acids, absorb smells, and absorb any liquid left over from your spot cleaning. You can leave the baking soda on for several hours if you have the time. The longer it’s on the mattress, the more it will absorb and clean. Vacuum the mattress again. When the baking soda has had time to sit, vacuum the mattress to remove the baking soda. You'll take acids, odors, and liquid that the baking soda has absorbed along with it. Use the brush to cover the top of the mattress, and the long nozzle to get into corners, cracks, seams, and piping. Let the mattress air out. Once the mattress is clean, it’s a good idea to let it air out for a while so any liquid left in the mattress can dry out. Moisture that’s trapped inside the mattress can lead to mold, and this will be very difficult to remove. During the warmer seasons, open a window in the room to let in fresh air and dry out the mattress faster. You can also open drapes and curtains to let in the sunshine, as the UV rays in the sun will help kill bacteria and mold on the mattress, eliminate odors even more, and dry it out faster. Protecting the Mattress Flip or rotate the mattress. For conventional mattresses that don’t have a designated top and bottom, turn the mattress over so you're sleeping on the other side. For mattresses that do have a designated top and bottom, rotate the mattress 180 degrees. This will ensure even wear over the surface of the mattress. You should flip or rotate your mattress every three to six months to ensure even wear. Apply a mattress protector. A mattress protector is a plastic case that you can use to keep your mattress safe. You slip the case over the mattress like you would with a duvet and duvet cover. Then close the zipper to seal the mattress and protect it from spills, dust, dirt, stains, and even bed bugs. There are also mattress pads and covers you can buy to protect just the top of the mattress from spills and dirt. Make the bed. When the mattress is clean, dry, flipped, and protected, you can make the bed with your clean linens. Start with the fitted sheet, followed by the top sheet. Put the pillows back in their cases, and return all pillows, blankets, and decorations to the bed as well. Feel the mattress all over before making the bed to check for moisture. If you encase a damp mattress in linens and blankets, it won’t dry out and you'll have mold growth.",
  "tyn_model":[
    "baking soda",
    "linens",
    "blankets",
    "water",
    "enzyme cleaner",
    "pillows",
    "mattress protector",
    "vacuum",
    "brush",
    "cleaner",
    "mattress",
    "decorations",
    "sheets",
    "pillow cases",
    "sifter",
    "pillow",
    "fabric sheets",
    "laundry basket",
    "washing machine",
    "duvet",
    "vacuuming",
    "upholstery nozzle",
    "hydrogen peroxide",
    "liquid dish soap",
    "spoon",
    "memory foam mattress",
    "memory foam",
    "alpine maids,",
    "cleaning agency",
    "alpine maids has",
    "oxidizing bleach",
    "liquid cleaners",
    "essential oil",
    "mold",
    "bed bugs",
    "mattress pads",
    "fitted sheet"
  ],
  "tyn_section":[

  ]
}