{
  "title":"How to Photograph Wild Birds",
  "url":"https://www.wikihow.com/Photograph-Wild-Birds",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Selecting the Birds",
      "steps":[
        {
          "headline":"Know what types of birds you want to photograph.",
          "description":"Do you want to photograph birds of prey, water birds, nesting birds or flying birds? Both the type and positioning of the bird can have a major impact on your photography success. Some birds are much easier to find and shoot than others. For instance, a wren or robin will be much easier to photograph than any type of raptor. Bird environments vary widely. Some of your decision will be determined by where you live or your ability to get somewhere by traveling in the time you have available. Seabirds, for example, require you to be near the ocean, while forest birds will require you to be near the forest. What is your own level of willingness to go where the birds are? If you're keen on the outdoors and love a good hike, you'll be more likely to head back country, climb, swim or whatever to get those rarer bird shots. On the other hand, if you're more of a park stroller, you may need to settle for the local, more common types of bird. Both are equally fine choices––it is simply that you need to match your expectations to your preparedness to expend effort. Consider starting with a bird sanctuary. If there is a bird sanctuary or bird nature reserve near you, you're fairly much guaranteed to find birds as that's the focus of the place. As well as good amenities such as boardwalks, hides and seating, you'll also get lots of information on the birds and their habits too. Such a place is great for a beginner to practice bird photography."
        },
        {
          "headline":"Know your feathered subjects well.",
          "description":"This means doing a lot of research unless you're already knowledgeable about the bird's habits and quirks. Consider doing some birdwatching first––if you don't already have experience with that species, make a concerted effort to locate and watch them. Learn their habits and what they do before attempting to photograph them. It will put you at a distinct advantage to be personally aware of expected bird behaviors. Information that will make your photography more interesting and better directed includes: feeding habits, breeding, nesting, and migratory behaviors. Also consider season. Some birds look during some seasons than others, due to molting, over-wintering, etc. This knowledge will only be gleaned by doing your research first. Birdwatching beforehand also teaches you more than any guide can about the approachability of different species of birds. This will vary on the type of bird, the experience the birds have had with human interaction and where you are in the world. There is no one hard and fast rule for approaching birds, other than that being noisy and running at the birds will cause most birds to fly away (even pigeons), at least temporarily."
        },
        {
          "headline":"Purchase a reputable bird guide if you're a beginner birdwatcher or you're new to the area.",
          "description":"Most, if not all, states, provinces and countries have bird guides of the birds that are native to the area. This is a good way to become familiar with a variety of bird species that may be in the area too."
        }
      ]
    },
    {
      "name":"Locating the Birds",
      "steps":[
        {
          "headline":"Determine where the birds that interest you will most likely be located.",
          "description":"Once you know the type of area, get a map and make a sketch. This will help you to know more precisely where the birds will be. What is the area like? Is it flat, hilly or rough terrain? Can you access it with ease or do you need to hike in and out? Do birds use a cliff or other spot to take off over the ocean or land? Are there paths leading to this are that you can use? Can you ask the locals for information? If there is a bird colony in the area or it's a feeding/nesting/take-off area, the locals will know a lot more than any static guidebook. Ask at the local store, recreation center or information center to begin with, and call any local birdwatching clubs too."
        },
        {
          "headline":"Use your sketch to plot the types of birds you expect to see.",
          "description":"Note both where and when you're likely to see particular birds (if you're looking for various birds, this may vary considerably). Are there any hides? These are camouflaged hideaway shelters that permit birdwatching without disturbing the birds. They can be very useful for taking candid shots of birds that are happily unaware of your presence. Plotting the places on a sketch map will come in handy for future photographic expeditions too. You can make notations on the map while on your first expedition to update or confirm data already input. Slip the sketch map into a plastic cover to protect it from the elements and mud."
        }
      ]
    },
    {
      "name":"Using Bird Behavior to Improve Your Photo Chances",
      "steps":[
        {
          "headline":"Know what to watch for.",
          "description":"Some things that are helpful to know are:\nMost birds take off and land into the wind. Anticipating that, be aware of the direction of the wind. Watch for the birds to 'tense' their feathers. When they are relaxed, they are relaxed and won't be taking off. Most of them will tense before taking off."
        },
        {
          "headline":"Expect the unexpected.",
          "description":"Birds move swiftly and without warning. Be ready for fast movement and antics. When getting ready to shoot your subject, anticipate the bird's actions and be ready to pan."
        },
        {
          "headline":"Look for nesting birds.",
          "description":"Captive to caring for their nest, you can get some fantastic shots if you know of a nest of birds somewhere. Be careful not to disturb the nest in any way."
        }
      ]
    },
    {
      "name":"Preparing Yourself and the Camera",
      "steps":[
        {
          "headline":"Be comfortable and keep warm.",
          "description":"Outdoor photography requires that you keep aware of your own comfort levels foremost. If you are likely to be taking photographs in the rain, under the searing sun, in bodies of water, etc., you need to be wearing the right gear. For pond, stream, swamp, etc., photography, get some decent boots, waders, gaiters, etc. For searing heat environments, wear a good hat with a wide brim, neck cover and an elastic band to keep it in place. If the brim can be turned to one side or folded back, this might be useful to prevent shading your photos on occasion. For cold weather shooting, rug up appropriately and get gloves that are warm but still allow you to move the camera apparatus. Pack adequate food, drink and snacks. Take along anything that can make the experience more comfortable, such as a blanket, mat or umbrella."
        },
        {
          "headline":"Be sure you have your camera set ahead of time.",
          "description":"You should have a solid idea of the aperture and speed that you will need. You don't necessarily need the best camera gear out there but you do need to know how to use what you have well, and be patient to get those good shots. Digital or film? Digital cameras tend to be faster and cheaper, so for most amateurs, they are the ideal choice. And it needs to be a DSLR––bird photography requires a good quality camera with a fast shutter speed. What sort of lenses do you have? Ken Rockwell recommends cheap, ordinary lenses for pet birds, and then a skip up to practical long lenses in the US$1000-1600 range for wild bird photography for amateurs. For the more serious, you can dabble in very expensive lenses but wait until you know that this is going to really be your hobby before investing at the high end. Do you want to stop the motion of the bird in flight, or allow some blurring to convey action? If so, know how to do this in advance; many good cameras have a continuous movement tracking mode. Read up on how to set your camera to use all of its focus sensors. Birds won't stop flying for your fiddling! (Note that many cameras are good at tracking birds against a bland sky, not so good when a complex background comes into play; see How to photograph sports or How to photograph motor racing for tips on dealing with movement.) Do you want to convey the colors of brilliantly colored birds? Will you require filters or other gear to improve the colors?"
        }
      ]
    },
    {
      "name":"Taking the Bird Photographs",
      "steps":[
        {
          "headline":"Check your exposure constantly.",
          "description":"Things can change quickly. If shooting up into the sky a lot, you will be in danger of the colors in the sky being blown out as the day moves on and weather or lighting changes occur. Know how to use the manual exposure on your camera; this may be useful if the camera's automatic mode loses the bird against an endless sky."
        },
        {
          "headline":"Be aware of the lighting.",
          "description":"Early morning and late evening light is good for bird photography; aim to reduce the glare of taking images of birds into the noonday sun. Lighting can add elements to the photos that make the birds more interesting; even a sparrow can look amazing in the right light. Have you thought about background lighting? This can add mystery, elegance or sparkling features to the photos."
        },
        {
          "headline":"Put some thought into what you are doing.",
          "description":"Don't just 'spray and pray'. You might get a shot, but most of the time, its quality won't be what you want. Patience is what pays off with bird photography, and the more patient you are, the more likely it is that you'll capture some amazing bird moments. Aim to get a good shot of the bird's eye. If this can be achieved, blurring effects around it can often be forgiven. Sit still and simply be. Some birds are content to go about their business when the beings around them are thudding through the forest or talking loudly."
        },
        {
          "headline":"Consider including action in your shots.",
          "description":"Unless the background is amazing, a sitting or standing bird often won't be as interesting as a bird doing something. Action includes preening, fishing, flight, fighting, feeding and waddling. That said, if the background is of interest or the lighting is amazing, or if the bird's own colors or markings are the feature of the shot, a still bird can make a great shot. Think of a duck floating mid-lake on a dull day with nothing to break up the endlessness of the lake, as opposed to two ducks fighting mid-lake––which one is likely to hold more interest? However, that floating duck might be amazing if it's floating in front of old ruins on the shore and a snow-peaked mountain in the distance."
        },
        {
          "headline":"If at all possible, shoot from the bird's eye height.",
          "description":"For most birds, it's really important to get as close as you can––markings, facial features, beak outlines and eyes are all of interest to the bird lover who will be looking closely to see the bird's individuality; this needs to be captured as best you can. For ground birds, get on your stomach. Bring along a cloth or map to protect clothing if the dirt or bird poop bothers you. For flying or high roosting/landing birds, get as high as you can and/or catch them at takeoff or landing. For water birds, put on your waders and get into the water, among those reeds if it's safe to do so."
        },
        {
          "headline":"Aim to take shots that are good enough to identify the bird.",
          "description":"This is especially important if you want to sell the photographs or make a book of birds. But most of all, it's about having a sense of achievement that you're captured the birds in the best way possible."
        }
      ]
    }
  ],
  "text":" Selecting the Birds Know what types of birds you want to photograph. Do you want to photograph birds of prey, water birds, nesting birds or flying birds? Both the type and positioning of the bird can have a major impact on your photography success. Some birds are much easier to find and shoot than others. For instance, a wren or robin will be much easier to photograph than any type of raptor. Bird environments vary widely. Some of your decision will be determined by where you live or your ability to get somewhere by traveling in the time you have available. Seabirds, for example, require you to be near the ocean, while forest birds will require you to be near the forest. What is your own level of willingness to go where the birds are? If you're keen on the outdoors and love a good hike, you'll be more likely to head back country, climb, swim or whatever to get those rarer bird shots. On the other hand, if you're more of a park stroller, you may need to settle for the local, more common types of bird. Both are equally fine choices––it is simply that you need to match your expectations to your preparedness to expend effort. Consider starting with a bird sanctuary. If there is a bird sanctuary or bird nature reserve near you, you're fairly much guaranteed to find birds as that's the focus of the place. As well as good amenities such as boardwalks, hides and seating, you'll also get lots of information on the birds and their habits too. Such a place is great for a beginner to practice bird photography. Know your feathered subjects well. This means doing a lot of research unless you're already knowledgeable about the bird's habits and quirks. Consider doing some birdwatching first––if you don't already have experience with that species, make a concerted effort to locate and watch them. Learn their habits and what they do before attempting to photograph them. It will put you at a distinct advantage to be personally aware of expected bird behaviors. Information that will make your photography more interesting and better directed includes: feeding habits, breeding, nesting, and migratory behaviors. Also consider season. Some birds look during some seasons than others, due to molting, over-wintering, etc. This knowledge will only be gleaned by doing your research first. Birdwatching beforehand also teaches you more than any guide can about the approachability of different species of birds. This will vary on the type of bird, the experience the birds have had with human interaction and where you are in the world. There is no one hard and fast rule for approaching birds, other than that being noisy and running at the birds will cause most birds to fly away (even pigeons), at least temporarily. Purchase a reputable bird guide if you're a beginner birdwatcher or you're new to the area. Most, if not all, states, provinces and countries have bird guides of the birds that are native to the area. This is a good way to become familiar with a variety of bird species that may be in the area too. Locating the Birds Determine where the birds that interest you will most likely be located. Once you know the type of area, get a map and make a sketch. This will help you to know more precisely where the birds will be. What is the area like? Is it flat, hilly or rough terrain? Can you access it with ease or do you need to hike in and out? Do birds use a cliff or other spot to take off over the ocean or land? Are there paths leading to this are that you can use? Can you ask the locals for information? If there is a bird colony in the area or it's a feeding/nesting/take-off area, the locals will know a lot more than any static guidebook. Ask at the local store, recreation center or information center to begin with, and call any local birdwatching clubs too. Use your sketch to plot the types of birds you expect to see. Note both where and when you're likely to see particular birds (if you're looking for various birds, this may vary considerably). Are there any hides? These are camouflaged hideaway shelters that permit birdwatching without disturbing the birds. They can be very useful for taking candid shots of birds that are happily unaware of your presence. Plotting the places on a sketch map will come in handy for future photographic expeditions too. You can make notations on the map while on your first expedition to update or confirm data already input. Slip the sketch map into a plastic cover to protect it from the elements and mud. Using Bird Behavior to Improve Your Photo Chances Know what to watch for. Some things that are helpful to know are:\nMost birds take off and land into the wind. Anticipating that, be aware of the direction of the wind. Watch for the birds to 'tense' their feathers. When they are relaxed, they are relaxed and won't be taking off. Most of them will tense before taking off. Expect the unexpected. Birds move swiftly and without warning. Be ready for fast movement and antics. When getting ready to shoot your subject, anticipate the bird's actions and be ready to pan. Look for nesting birds. Captive to caring for their nest, you can get some fantastic shots if you know of a nest of birds somewhere. Be careful not to disturb the nest in any way. Preparing Yourself and the Camera Be comfortable and keep warm. Outdoor photography requires that you keep aware of your own comfort levels foremost. If you are likely to be taking photographs in the rain, under the searing sun, in bodies of water, etc., you need to be wearing the right gear. For pond, stream, swamp, etc., photography, get some decent boots, waders, gaiters, etc. For searing heat environments, wear a good hat with a wide brim, neck cover and an elastic band to keep it in place. If the brim can be turned to one side or folded back, this might be useful to prevent shading your photos on occasion. For cold weather shooting, rug up appropriately and get gloves that are warm but still allow you to move the camera apparatus. Pack adequate food, drink and snacks. Take along anything that can make the experience more comfortable, such as a blanket, mat or umbrella. Be sure you have your camera set ahead of time. You should have a solid idea of the aperture and speed that you will need. You don't necessarily need the best camera gear out there but you do need to know how to use what you have well, and be patient to get those good shots. Digital or film? Digital cameras tend to be faster and cheaper, so for most amateurs, they are the ideal choice. And it needs to be a DSLR––bird photography requires a good quality camera with a fast shutter speed. What sort of lenses do you have? Ken Rockwell recommends cheap, ordinary lenses for pet birds, and then a skip up to practical long lenses in the US$1000-1600 range for wild bird photography for amateurs. For the more serious, you can dabble in very expensive lenses but wait until you know that this is going to really be your hobby before investing at the high end. Do you want to stop the motion of the bird in flight, or allow some blurring to convey action? If so, know how to do this in advance; many good cameras have a continuous movement tracking mode. Read up on how to set your camera to use all of its focus sensors. Birds won't stop flying for your fiddling! (Note that many cameras are good at tracking birds against a bland sky, not so good when a complex background comes into play; see How to photograph sports or How to photograph motor racing for tips on dealing with movement.) Do you want to convey the colors of brilliantly colored birds? Will you require filters or other gear to improve the colors? Taking the Bird Photographs Check your exposure constantly. Things can change quickly. If shooting up into the sky a lot, you will be in danger of the colors in the sky being blown out as the day moves on and weather or lighting changes occur. Know how to use the manual exposure on your camera; this may be useful if the camera's automatic mode loses the bird against an endless sky. Be aware of the lighting. Early morning and late evening light is good for bird photography; aim to reduce the glare of taking images of birds into the noonday sun. Lighting can add elements to the photos that make the birds more interesting; even a sparrow can look amazing in the right light. Have you thought about background lighting? This can add mystery, elegance or sparkling features to the photos. Put some thought into what you are doing. Don't just 'spray and pray'. You might get a shot, but most of the time, its quality won't be what you want. Patience is what pays off with bird photography, and the more patient you are, the more likely it is that you'll capture some amazing bird moments. Aim to get a good shot of the bird's eye. If this can be achieved, blurring effects around it can often be forgiven. Sit still and simply be. Some birds are content to go about their business when the beings around them are thudding through the forest or talking loudly. Consider including action in your shots. Unless the background is amazing, a sitting or standing bird often won't be as interesting as a bird doing something. Action includes preening, fishing, flight, fighting, feeding and waddling. That said, if the background is of interest or the lighting is amazing, or if the bird's own colors or markings are the feature of the shot, a still bird can make a great shot. Think of a duck floating mid-lake on a dull day with nothing to break up the endlessness of the lake, as opposed to two ducks fighting mid-lake––which one is likely to hold more interest? However, that floating duck might be amazing if it's floating in front of old ruins on the shore and a snow-peaked mountain in the distance. If at all possible, shoot from the bird's eye height. For most birds, it's really important to get as close as you can––markings, facial features, beak outlines and eyes are all of interest to the bird lover who will be looking closely to see the bird's individuality; this needs to be captured as best you can. For ground birds, get on your stomach. Bring along a cloth or map to protect clothing if the dirt or bird poop bothers you. For flying or high roosting/landing birds, get as high as you can and/or catch them at takeoff or landing. For water birds, put on your waders and get into the water, among those reeds if it's safe to do so. Aim to take shots that are good enough to identify the bird. This is especially important if you want to sell the photographs or make a book of birds. But most of all, it's about having a sense of achievement that you're captured the birds in the best way possible.",
  "tyn_model":[
    "birds",
    "bird",
    "camera",
    "bird photography",
    "cameras",
    "lenses",
    "bird sanctuary",
    "sketch map",
    "waders",
    "duck",
    "wren",
    "robin",
    "bird nature reserve",
    "bird guide",
    "bird guides",
    "map",
    "birdwatching clubs",
    "sketch",
    "outdoor photography",
    "boots",
    "hat",
    "elastic band",
    "gloves",
    "blanket",
    "umbrella",
    "sparrow",
    "ducks",
    "water"
  ],
  "tyn_section":[

  ]
}