{
  "title":"How to Make Jolly Rancher Cookies",
  "url":"https://www.wikihow.com/Make-Jolly-Rancher-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits"
  ],
  "steps":[
    {
      "headline":"Prepare the Jolly Ranchers.",
      "description":"Place the candies in a Ziploc bag and seal. Put this bag in another plastic bag and seal. Wrap bags in a dish towel and place on hard surface. Smash candies to bits using a potato masher or rolling pin. Set aside"
    },
    {
      "headline":"Prepare the cookies for baking.",
      "description":"Cover a baking sheet with foil. Spray this with nonstick cooking spray."
    },
    {
      "headline":"Preheat the oven to 350 degrees F or 176 degrees C.",
      "description":""
    },
    {
      "headline":"Prepare the cookie dough.",
      "description":"Sprinkle flour on a work surface and roll dough till it is 1/4 inch in thickness."
    },
    {
      "headline":"Cut the cookies.",
      "description":"Cut out cookies using the larger cookie cutter. Place these on the cookie sheet"
    },
    {
      "headline":"Dip the smaller cookie cutter in flour and cut a hole in the middle of big cookies.",
      "description":"Pull out the dough in the center and add it to other dough to re-use."
    },
    {
      "headline":"Bake cookies for 4 minutes.",
      "description":""
    },
    {
      "headline":"Remove from oven and sprinkle candy bits inside each cookie.",
      "description":"Make sure to fill in any corners."
    },
    {
      "headline":"Bake for 5-7 more minutes.",
      "description":""
    },
    {
      "headline":"Remove from oven and let sit for 30 minutes.",
      "description":""
    },
    {
      "headline":"Peel foil off of backs of cookies, now you can eat the cookies and savor the hard candy centers!",
      "description":""
    }
  ],
  "text":" Prepare the Jolly Ranchers. Place the candies in a Ziploc bag and seal. Put this bag in another plastic bag and seal. Wrap bags in a dish towel and place on hard surface. Smash candies to bits using a potato masher or rolling pin. Set aside Prepare the cookies for baking. Cover a baking sheet with foil. Spray this with nonstick cooking spray. Preheat the oven to 350 degrees F or 176 degrees C.  Prepare the cookie dough. Sprinkle flour on a work surface and roll dough till it is 1/4 inch in thickness. Cut the cookies. Cut out cookies using the larger cookie cutter. Place these on the cookie sheet Dip the smaller cookie cutter in flour and cut a hole in the middle of big cookies. Pull out the dough in the center and add it to other dough to re-use. Bake cookies for 4 minutes.  Remove from oven and sprinkle candy bits inside each cookie. Make sure to fill in any corners. Bake for 5-7 more minutes.  Remove from oven and let sit for 30 minutes.  Peel foil off of backs of cookies, now you can eat the cookies and savor the hard candy centers! ",
  "tyn_model":[
    "oven",
    "foil",
    "flour",
    "cookie cutter",
    "ziploc bag",
    "plastic bag",
    "dish towel",
    "potato masher",
    "rolling pin",
    "baking sheet",
    "nonstick cooking spray",
    "cookie dough",
    "cookie sheet"
  ],
  "tyn_section":[

  ]
}