{
  "title":"How to Make Gluten Free Buttermilk Pancakes",
  "url":"https://www.wikihow.com/Make-Gluten-Free-Buttermilk-Pancakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Pancakes"
  ],
  "steps":[
    {
      "headline":"Place the dry ingredients in a mixing bowl and mix completely with a whisk.",
      "description":""
    },
    {
      "headline":"Place the egg, oil, vanilla, and the regular milk (or the buttermilk and vinegar) in another mixing bowl.",
      "description":"Stir the mixture until smooth."
    },
    {
      "headline":"Pour the wet mixture into the bowl with the dry ingredients, and whisk the mixture together.",
      "description":"Continue to whisk until the ingredients are fully combined. Pour a little more milk into the batter if it's very thick."
    },
    {
      "headline":"Heat up a skillet on medium-high heat.",
      "description":"Lightly spread canola or olive oil on the skillet."
    },
    {
      "headline":"Make your pancakes.",
      "description":"Get a measuring cup, scoop some batter, and pour it into the skillet. If you want your pancakes to be a medium size, use a measuring cup that is ¼ cup. If you want your pancakes to be big, use a measuring cup that is ⅓ cup."
    },
    {
      "headline":"Flip the pancakes and repeat the cooking process until they have fully browned.",
      "description":""
    },
    {
      "headline":"Remove the finished pancakes from the skillet and transfer to plates.",
      "description":"Allow them to cool before serving. That should take about 5 minutes."
    }
  ],
  "text":" Place the dry ingredients in a mixing bowl and mix completely with a whisk.  Place the egg, oil, vanilla, and the regular milk (or the buttermilk and vinegar) in another mixing bowl. Stir the mixture until smooth. Pour the wet mixture into the bowl with the dry ingredients, and whisk the mixture together. Continue to whisk until the ingredients are fully combined. Pour a little more milk into the batter if it's very thick. Heat up a skillet on medium-high heat. Lightly spread canola or olive oil on the skillet. Make your pancakes. Get a measuring cup, scoop some batter, and pour it into the skillet. If you want your pancakes to be a medium size, use a measuring cup that is ¼ cup. If you want your pancakes to be big, use a measuring cup that is ⅓ cup. Flip the pancakes and repeat the cooking process until they have fully browned.  Remove the finished pancakes from the skillet and transfer to plates. Allow them to cool before serving. That should take about 5 minutes.",
  "tyn_model":[
    "skillet",
    "mixing bowl",
    "whisk",
    "measuring cup",
    "egg",
    "oil",
    "vanilla",
    "regular milk",
    "buttermilk and",
    "vinegar",
    "bowl",
    "milk",
    "canola or",
    "olive oil",
    "⅓ cup",
    "plates"
  ],
  "tyn_section":[

  ]
}