{
  "title":"How to Play Hay Day",
  "url":"https://www.wikihow.com/Play-Hay-Day",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games"
  ],
  "methods":[
    {
      "name":"Setting Up Your Farm",
      "steps":[
        {
          "headline":"Install the game.",
          "description":"Determine whether you have an Android OS or Mac OS for your phone. If you have an Android phone you can download the game on the Google Play Store. If you have an iPhone or another Apple device you can download the game on iTunes."
        },
        {
          "headline":"Play through the tutorial.",
          "description":"When you first begin the game, you'll be introduced to a scarecrow that will work you through the basics of the game. Make sure to read his text bubbles carefully so that you know exactly what to do. During the tutorial you will learn how to paint your house, harvest crops, plant new crops, and name your farm."
        },
        {
          "headline":"Plant your initial crops.",
          "description":"Once you're done with the tutorial, you'll start off with three plots of land that you can use to grow crops. Click on the plots of land and select wheat. Now click and drag over the empty plots to fill them in with plants. You now have a working farm. Make sure to use these as crops will help you earn gold and will level you up."
        },
        {
          "headline":"Populate your farm with livestock.",
          "description":"Click on the animal pens with the red houses in them to select which kind of livestock you'd like to put on your farm. You can drag the animals over into your animal pen to purchase them. As you level up, different animals will become available to you and will generate more coins. Remember that you must feed livestock with food that you create on your farm. If a fox comes to eat your chickens, click on it repeatedly to make it go away."
        }
      ]
    },
    {
      "name":"Earning Free Diamonds",
      "steps":[
        {
          "headline":"Use your diamonds sparingly.",
          "description":"You can use diamonds to automatically research and build things instead of having to wait an allotted amount of time. This can level you up much faster and increase your progress through the game. Limit the amount that you do this so that you can stock up on diamonds as you play through the game. The longer that you play the game, the longer things take to build and the more useful diamonds become, so it's good to have a supply of them. Do not waste diamonds during the early stages of the game. You can also purchase diamonds with real money."
        },
        {
          "headline":"Keep leveling up.",
          "description":"Your character starts with 30 diamonds initially. After that, you'll gain one or two diamonds per level. This will be used as your main source of diamonds, so spend them sparingly. You can also get diamonds by purchasing them with real money."
        },
        {
          "headline":"Login using your Facebook account.",
          "description":"If you login to Hay Day using your Facebook account, you'll get an automatic five more diamonds to start off with. Connecting your account to Facebook will also let you see your Facebook friend's farms."
        },
        {
          "headline":"Click the purple ticket and watch a game trailer.",
          "description":"Purple tickets will occasionally show up next to the newspaper icon. Clicking these tickets will allow you to watch a 30-second game trailer. If you complete the trailer, you'll earn diamonds."
        },
        {
          "headline":"Complete an achievement to earn a diamond.",
          "description":"As you play through the game there are different landmarks that you can achieve in order to gain more free diamonds. Achievements include completing 2,000 truck deliveries, helping visitors who come to your farm, and placing ads in newspapers."
        },
        {
          "headline":"Earn diamonds through mining.",
          "description":"Your character can start mining at level 24. Unlocking the mine costs 26,000 coins. You can use shovels, dynamite, or TNT to reveal different ore and diamonds from the mine. Click on the mine, then click on the tool that you want to use to extract the diamonds. Getting diamonds through mines is relatively rare, so you may have to use your mine multiple times before you get any diamonds. You can ask Tom to look for mining materials, or you can purchase them at roadside shops. Tom is the farmhand that you unlock at level 14. You can make him search for any items in the game that you need. After an initial 3 days, you'll be forced to use diamonds if you want to hire Tom again."
        },
        {
          "headline":"Open a mystery box to gain diamonds.",
          "description":"When a stream of stars comes up on your screen, you'll get a chance to open a mystery box. While these boxes cost diamonds to open, there is a chance that you'll also receive diamonds in the box. Also, there are things inside of mystery boxes that can help you increase your storage and expand your farm."
        }
      ]
    },
    {
      "name":"Getting More Coins",
      "steps":[
        {
          "headline":"Harvest and sell crops for a profit.",
          "description":"You'll need coins in order to purchase different crops, animals, and equipment throughout the game. Constantly planting and harvesting crops will allow you to get a steady stream of coins. Click on the roadside shop to sell items to other users of the game. The game will automatically set a price for the goods, but you can change the values with the up and down arrows. Grow crops that take a long time while you're working or going to class and grow faster-growing crops when you are actually playing the game."
        },
        {
          "headline":"Only fill orders that will make you money.",
          "description":"Often the missions in Hay Day's bulletin board will have orders that take too long or aren't worth their investment in coins. Do not take these quests. Don't be afraid to say no to an order if it doesn't make you money."
        },
        {
          "headline":"Take advantage of special events.",
          "description":"Special events will occur throughout the game, and you'll have an opportunity to play them. These events include things like the Visitor Bonus Event, which will give you twice the amount of coins than usual. Other events like The Special Halloween event will also give you more coins and the chance to get diamonds."
        },
        {
          "headline":"Buy in bulk from the newspaper.",
          "description":"Every once and a while your newspaper will have a deal for more than one item, like a stack of 5 pickaxes. In this case, you can buy in bulk then resell each of the tools individually. Doing this can make you more coins over time."
        }
      ]
    }
  ],
  "text":" Setting Up Your Farm Install the game. Determine whether you have an Android OS or Mac OS for your phone. If you have an Android phone you can download the game on the Google Play Store. If you have an iPhone or another Apple device you can download the game on iTunes. Play through the tutorial. When you first begin the game, you'll be introduced to a scarecrow that will work you through the basics of the game. Make sure to read his text bubbles carefully so that you know exactly what to do. During the tutorial you will learn how to paint your house, harvest crops, plant new crops, and name your farm. Plant your initial crops. Once you're done with the tutorial, you'll start off with three plots of land that you can use to grow crops. Click on the plots of land and select wheat. Now click and drag over the empty plots to fill them in with plants. You now have a working farm. Make sure to use these as crops will help you earn gold and will level you up. Populate your farm with livestock. Click on the animal pens with the red houses in them to select which kind of livestock you'd like to put on your farm. You can drag the animals over into your animal pen to purchase them. As you level up, different animals will become available to you and will generate more coins. Remember that you must feed livestock with food that you create on your farm. If a fox comes to eat your chickens, click on it repeatedly to make it go away. Earning Free Diamonds Use your diamonds sparingly. You can use diamonds to automatically research and build things instead of having to wait an allotted amount of time. This can level you up much faster and increase your progress through the game. Limit the amount that you do this so that you can stock up on diamonds as you play through the game. The longer that you play the game, the longer things take to build and the more useful diamonds become, so it's good to have a supply of them. Do not waste diamonds during the early stages of the game. You can also purchase diamonds with real money. Keep leveling up. Your character starts with 30 diamonds initially. After that, you'll gain one or two diamonds per level. This will be used as your main source of diamonds, so spend them sparingly. You can also get diamonds by purchasing them with real money. Login using your Facebook account. If you login to Hay Day using your Facebook account, you'll get an automatic five more diamonds to start off with. Connecting your account to Facebook will also let you see your Facebook friend's farms. Click the purple ticket and watch a game trailer. Purple tickets will occasionally show up next to the newspaper icon. Clicking these tickets will allow you to watch a 30-second game trailer. If you complete the trailer, you'll earn diamonds. Complete an achievement to earn a diamond. As you play through the game there are different landmarks that you can achieve in order to gain more free diamonds. Achievements include completing 2,000 truck deliveries, helping visitors who come to your farm, and placing ads in newspapers. Earn diamonds through mining. Your character can start mining at level 24. Unlocking the mine costs 26,000 coins. You can use shovels, dynamite, or TNT to reveal different ore and diamonds from the mine. Click on the mine, then click on the tool that you want to use to extract the diamonds. Getting diamonds through mines is relatively rare, so you may have to use your mine multiple times before you get any diamonds. You can ask Tom to look for mining materials, or you can purchase them at roadside shops. Tom is the farmhand that you unlock at level 14. You can make him search for any items in the game that you need. After an initial 3 days, you'll be forced to use diamonds if you want to hire Tom again. Open a mystery box to gain diamonds. When a stream of stars comes up on your screen, you'll get a chance to open a mystery box. While these boxes cost diamonds to open, there is a chance that you'll also receive diamonds in the box. Also, there are things inside of mystery boxes that can help you increase your storage and expand your farm. Getting More Coins Harvest and sell crops for a profit. You'll need coins in order to purchase different crops, animals, and equipment throughout the game. Constantly planting and harvesting crops will allow you to get a steady stream of coins. Click on the roadside shop to sell items to other users of the game. The game will automatically set a price for the goods, but you can change the values with the up and down arrows. Grow crops that take a long time while you're working or going to class and grow faster-growing crops when you are actually playing the game. Only fill orders that will make you money. Often the missions in Hay Day's bulletin board will have orders that take too long or aren't worth their investment in coins. Do not take these quests. Don't be afraid to say no to an order if it doesn't make you money. Take advantage of special events. Special events will occur throughout the game, and you'll have an opportunity to play them. These events include things like the Visitor Bonus Event, which will give you twice the amount of coins than usual. Other events like The Special Halloween event will also give you more coins and the chance to get diamonds. Buy in bulk from the newspaper. Every once and a while your newspaper will have a deal for more than one item, like a stack of 5 pickaxes. In this case, you can buy in bulk then resell each of the tools individually. Doing this can make you more coins over time.",
  "tyn_model":[
    "diamonds",
    "livestock",
    "newspaper",
    "scarecrow",
    "wheat",
    "plants",
    "animal pen",
    "chickens",
    "diamond",
    "shovels",
    "dynamite",
    "tnt",
    "coins",
    "crops"
  ],
  "tyn_section":[

  ]
}