{
  "title":"How to Make Ranch Dressing",
  "url":"https://www.wikihow.com/Make-Ranch-Dressing",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Salads",
    "Salad Dressings"
  ],
  "methods":[
    {
      "name":"Making Classic Ranch Dressing",
      "steps":[
        {
          "headline":"Whisk together two cups mayonnaise and one cup buttermilk until smooth.",
          "description":"This is the creamy base of your dressing. If you don't feel like using mayonnaise, you can also use 2 cups plain, whole-fat yogurt instead, leading to a slightly healthier ranch dressing. For a \"best of both worlds,\" use half sour cream and half plain yogurt. Make sure you shake the buttermilk well before adding it. If you don't have any buttermilk, whole milk will work as well. You can add the juice from 1/2 a lemon to get the sour, buttermilk taste without the buttermilk."
        },
        {
          "headline":"Toss in your spices, adjusting to your personal taste.",
          "description":"The blend of flavors and spices you add are up to you, but the basics are usually pretty standard across the board. You can't go wrong with:\n3/4 Teaspoon each of salt, onion salt, and dried parsley\n1/4 Teaspoon garlic salt\n1/8 Teaspoon each of pepper, dill weed, and thyme"
        },
        {
          "headline":"Whisk the entire mixture well.",
          "description":"Whip up the mixture to your desired consistency, making sure that the spices are well distributed throughout the dressing. You can also mix the whole dressing in a seal-able jar, then shake to evenly mix up the dressing."
        },
        {
          "headline":"Refrigerate for 2-3 hours before serving for the best flavor.",
          "description":"You can serve the ranch immediately if you want, but it will always be better if you give the flavors time to mix and blend. This dressing will last about a week in the fridge. It should be kept cold whenever it is not being eaten."
        }
      ]
    },
    {
      "name":"Playing with Ranch Variations",
      "steps":[
        {
          "headline":"Make your own mayonnaise with an immersion blender for the freshest, tastiest ranch.",
          "description":"Feeling like the best ranch around? Grab a tall glass jar and your immersion blender and get to work. To make you own mayo:\nCrack 1 room-temperature egg into the bottom of the jar\nAdd 1 cup flavorful oil, usually avocado oil (olive will work also, but may have a stronger taste)\nWork your immersion blender into the mixture until you have a whipped, creamy texture. Continue making ranch like normal."
        },
        {
          "headline":"Use a mixture of sour cream and mayonnaise instead of straight mayo.",
          "description":"There are a lot of different ways to create that creamy base, and you should play around with the options you like best. Chefs all have their favorite ratios, and you should try out:\n6 tablespoons sour cream, 4-5 tablespoons mayo, 1 cup buttermilk\n1/2 cup sour cream, 1 cup mayo, 1/2 - 1 cup buttermilk\n1 cup whole milk, 1-1/2 cup sour cream, 1 tablespoon freshly squeezed lemon juice"
        },
        {
          "headline":"Expand across your spice rack to develop new ranch flavors.",
          "description":"While the basics of garlic, salt, pepper, and herbs will do, many chefs want a bit more variety when cooking. Some other spices to consider include:\nSmoked paprika\nCayenne (for a little spicy kick)\nOregano\nMustard powder\nMSG, also sold as \"powdered Umami\"\nFinely grated Parmesan cheese"
        },
        {
          "headline":"Top the final dressing with freshly chopped parsley and chives.",
          "description":"You can add them with the dry ingredients for a stronger flavor, or just top the dressing with these aromatic herbs. Finally chopped fresh greens will give a refreshing burst of flavor to the dressing."
        },
        {
          "headline":"Vary the amount of buttermilk, or other liquids, to thin the dressing out.",
          "description":"If you like a lighter, thinner ranch dressing, add a little more liquid in. This can be buttermilk, plain milk, or even a touch of water. For the adventurous chef, you could even try out a few more flavorful additions:\nWhite Vinegar, giving a bitter, tangy edge to the dressing\nWorcestershire Sauce, with a bit of bite\nTabasco Sauce, to add some heat to the mix."
        }
      ]
    },
    {
      "name":"Crafting Delicious Dairy-Free Ranch",
      "steps":[
        {
          "headline":"Start with a dairy-free mayonnaise or make your own.",
          "description":"As illustrated above, a simple homemade mayo is easy if you have an immersion blender. Simply blend a room-temperature egg with 1 cup of oil (usually avocado) in a tall, thin jar. That said, you can also buy dairy-free mayo in most stores since most mayo is usually dairy-free!"
        },
        {
          "headline":"Add in your medley of herbs and spices.",
          "description":"This is going to be similar to a traditional ranch dressing, but you should still feel free to adjust and play with the ratios however you see fit. 1 Tsp Dill and/or Thyme\n1/4 tsp each mustard powder and ground garlic\n2 tsp dried parsley\nSalt and pepper, to taste (1/4-1/2 teaspoon each)"
        },
        {
          "headline":"Add 2-4 teaspoons of freshly squeezed lemon.",
          "description":"This will account for the light, tangy sourness of the buttermilk. Start with just 2 teaspoons, then add more to taste as you keep mixing."
        },
        {
          "headline":"Thin to your desired consistency with coconut milk.",
          "description":"You can't use milk or buttermilk, and water will dilute the taste too much. Coconut milk has a light sweetness to it that will mix will with the sour lemon and any spices you added, creating a delicious and well-balanced dressing. For a thicker dressing, use coconut cream instead of coconut milk."
        },
        {
          "headline":"Mix and chill for 2-3 hours to blend the flavors.",
          "description":"Again, you don't have to chill it before eating, but it will be much better if you do. Remember, as well, that there is a raw egg in this dressing. While it will not be dangerous to eat, the dressing will go bad within a week and should be kept refrigerated whenever you're not eating it."
        }
      ]
    }
  ],
  "text":" Making Classic Ranch Dressing Whisk together two cups mayonnaise and one cup buttermilk until smooth. This is the creamy base of your dressing. If you don't feel like using mayonnaise, you can also use 2 cups plain, whole-fat yogurt instead, leading to a slightly healthier ranch dressing. For a \"best of both worlds,\" use half sour cream and half plain yogurt. Make sure you shake the buttermilk well before adding it. If you don't have any buttermilk, whole milk will work as well. You can add the juice from 1/2 a lemon to get the sour, buttermilk taste without the buttermilk. Toss in your spices, adjusting to your personal taste. The blend of flavors and spices you add are up to you, but the basics are usually pretty standard across the board. You can't go wrong with:\n3/4 Teaspoon each of salt, onion salt, and dried parsley\n1/4 Teaspoon garlic salt\n1/8 Teaspoon each of pepper, dill weed, and thyme Whisk the entire mixture well. Whip up the mixture to your desired consistency, making sure that the spices are well distributed throughout the dressing. You can also mix the whole dressing in a seal-able jar, then shake to evenly mix up the dressing. Refrigerate for 2-3 hours before serving for the best flavor. You can serve the ranch immediately if you want, but it will always be better if you give the flavors time to mix and blend. This dressing will last about a week in the fridge. It should be kept cold whenever it is not being eaten. Playing with Ranch Variations Make your own mayonnaise with an immersion blender for the freshest, tastiest ranch. Feeling like the best ranch around? Grab a tall glass jar and your immersion blender and get to work. To make you own mayo:\nCrack 1 room-temperature egg into the bottom of the jar\nAdd 1 cup flavorful oil, usually avocado oil (olive will work also, but may have a stronger taste)\nWork your immersion blender into the mixture until you have a whipped, creamy texture. Continue making ranch like normal. Use a mixture of sour cream and mayonnaise instead of straight mayo. There are a lot of different ways to create that creamy base, and you should play around with the options you like best. Chefs all have their favorite ratios, and you should try out:\n6 tablespoons sour cream, 4-5 tablespoons mayo, 1 cup buttermilk\n1/2 cup sour cream, 1 cup mayo, 1/2 - 1 cup buttermilk\n1 cup whole milk, 1-1/2 cup sour cream, 1 tablespoon freshly squeezed lemon juice Expand across your spice rack to develop new ranch flavors. While the basics of garlic, salt, pepper, and herbs will do, many chefs want a bit more variety when cooking. Some other spices to consider include:\nSmoked paprika\nCayenne (for a little spicy kick)\nOregano\nMustard powder\nMSG, also sold as \"powdered Umami\"\nFinely grated Parmesan cheese Top the final dressing with freshly chopped parsley and chives. You can add them with the dry ingredients for a stronger flavor, or just top the dressing with these aromatic herbs. Finally chopped fresh greens will give a refreshing burst of flavor to the dressing. Vary the amount of buttermilk, or other liquids, to thin the dressing out. If you like a lighter, thinner ranch dressing, add a little more liquid in. This can be buttermilk, plain milk, or even a touch of water. For the adventurous chef, you could even try out a few more flavorful additions:\nWhite Vinegar, giving a bitter, tangy edge to the dressing\nWorcestershire Sauce, with a bit of bite\nTabasco Sauce, to add some heat to the mix. Crafting Delicious Dairy-Free Ranch Start with a dairy-free mayonnaise or make your own. As illustrated above, a simple homemade mayo is easy if you have an immersion blender. Simply blend a room-temperature egg with 1 cup of oil (usually avocado) in a tall, thin jar. That said, you can also buy dairy-free mayo in most stores since most mayo is usually dairy-free! Add in your medley of herbs and spices. This is going to be similar to a traditional ranch dressing, but you should still feel free to adjust and play with the ratios however you see fit. 1 Tsp Dill and/or Thyme\n1/4 tsp each mustard powder and ground garlic\n2 tsp dried parsley\nSalt and pepper, to taste (1/4-1/2 teaspoon each) Add 2-4 teaspoons of freshly squeezed lemon. This will account for the light, tangy sourness of the buttermilk. Start with just 2 teaspoons, then add more to taste as you keep mixing. Thin to your desired consistency with coconut milk. You can't use milk or buttermilk, and water will dilute the taste too much. Coconut milk has a light sweetness to it that will mix will with the sour lemon and any spices you added, creating a delicious and well-balanced dressing. For a thicker dressing, use coconut cream instead of coconut milk. Mix and chill for 2-3 hours to blend the flavors. Again, you don't have to chill it before eating, but it will be much better if you do. Remember, as well, that there is a raw egg in this dressing. While it will not be dangerous to eat, the dressing will go bad within a week and should be kept refrigerated whenever you're not eating it.",
  "tyn_model":[
    "buttermilk",
    "mayonnaise",
    "spices",
    "sour cream",
    "immersion blender",
    "mayo",
    "milk",
    "salt",
    "pepper",
    "coconut milk",
    "thyme",
    "egg",
    "garlic",
    "herbs",
    "parsley",
    "water",
    "whole-fat yogurt",
    "ranch dressing",
    "plain yogurt",
    "lemon",
    "onion salt",
    "dried parsley",
    "garlic salt",
    "dill weed",
    "ranch",
    "tall glass jar",
    "flavorful oil",
    "avocado oil",
    "olive",
    "cream",
    "whole milk",
    "lemon juice",
    "spice rack",
    "smoked paprika",
    "cayenne",
    "oregano",
    "mustard powder",
    "parmesan cheese",
    "chives",
    "white vinegar",
    "worcestershire sauce",
    "tabasco sauce",
    "oil",
    "avocado",
    "mustard",
    "freshly squeezed lemon",
    "sour lemon",
    "coconut cream"
  ],
  "tyn_section":[

  ]
}