{
  "title":"How to Prepare Pasta Alla San Giuseppe",
  "url":"https://www.wikihow.com/Prepare-Pasta-Alla-San-Giuseppe",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles"
  ],
  "steps":[
    {
      "headline":"Put the oil in a skillet, start heating it up and add breadcrumbs.",
      "description":"Stir until you have moistened all the breadcrumbs. Add more oil if too dry or add more breadcrumbs if it seems too wet. Medium heat and keep stirring until golden."
    },
    {
      "headline":"After you have toasted the breadcrumbs, take them out of the skillet and put them in a dish or else they will keep toasting and you'll get burnt crumbs.",
      "description":""
    },
    {
      "headline":"In the meantime get your salted water boiling to toss in your pasta.",
      "description":""
    },
    {
      "headline":"While the water boils, get about 1/2 cup oil and in a skillet add your cut up anchovies and sauté on low heat until it all breaks up.",
      "description":""
    },
    {
      "headline":"Add in your slivered dried tomatoes and sauté.",
      "description":""
    },
    {
      "headline":"Add the minced garlic and sauté.",
      "description":"A few minutes at best. Remove from heat or pour it into a bowl, because the heat from the pan will continue to cook and eventually burn the garlic."
    },
    {
      "headline":"Add salt and pepper to taste but careful with salt, anchovies can be very salty.",
      "description":""
    },
    {
      "headline":"Once the pasta is cooked before draining, set aside about a cup of the pasta water, you may need it later.",
      "description":"(We do this with many of our dishes, because if at times a sauce is far too thick you can water it down with that already hot salted pasta water.)"
    },
    {
      "headline":"Then toss pasta in the skillet with the anchovy mix and stir well.",
      "description":"Add the toasted breadcrumbs a little at a time. You want it medium dry. If you see that it's too dry, add a bit of that pasta water."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Put the oil in a skillet, start heating it up and add breadcrumbs. Stir until you have moistened all the breadcrumbs. Add more oil if too dry or add more breadcrumbs if it seems too wet. Medium heat and keep stirring until golden. After you have toasted the breadcrumbs, take them out of the skillet and put them in a dish or else they will keep toasting and you'll get burnt crumbs.  In the meantime get your salted water boiling to toss in your pasta.  While the water boils, get about 1/2 cup oil and in a skillet add your cut up anchovies and sauté on low heat until it all breaks up.  Add in your slivered dried tomatoes and sauté.  Add the minced garlic and sauté. A few minutes at best. Remove from heat or pour it into a bowl, because the heat from the pan will continue to cook and eventually burn the garlic. Add salt and pepper to taste but careful with salt, anchovies can be very salty.  Once the pasta is cooked before draining, set aside about a cup of the pasta water, you may need it later. (We do this with many of our dishes, because if at times a sauce is far too thick you can water it down with that already hot salted pasta water.) Then toss pasta in the skillet with the anchovy mix and stir well. Add the toasted breadcrumbs a little at a time. You want it medium dry. If you see that it's too dry, add a bit of that pasta water. Finished. ",
  "tyn_model":[
    "skillet",
    "oil",
    "anchovies",
    "garlic",
    "salt",
    "dish",
    "salted water",
    "water",
    "tomatoes",
    "bowl",
    "pan",
    "pepper",
    "salted pasta water",
    "anchovy mix",
    "pasta water"
  ],
  "tyn_section":[

  ]
}