{
  "title":"How to Make a Waffle Sandwich",
  "url":"https://www.wikihow.com/Make-a-Waffle-Sandwich",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Waffles"
  ],
  "methods":[
    {
      "name":"Fried Chicken Waffle Sandwich",
      "steps":[
        {
          "headline":"Pour the buttermilk and hot sauce over the chicken.",
          "description":"Toss well in a large bowl until fully coated."
        },
        {
          "headline":"Cover the bowl with plastic wrap and allow it to chill for 30 minutes.",
          "description":"This step is optional, but it allows the chicken to be more tender when fried."
        },
        {
          "headline":"Whisk the dry ingredients together.",
          "description":"In a separate bowl, combine the garlic powder, salt, flour, cayenne pepper, and black pepper. Mix until incorporated together."
        },
        {
          "headline":"Dust the breading over the chicken and fully coat each piece.",
          "description":""
        },
        {
          "headline":"Dunk the chicken back into the buttermilk and coat again in the breading.",
          "description":"Repeat for double-breaded chicken."
        },
        {
          "headline":"Place the chicken on a rack over a baking sheet.",
          "description":"Allow it to sit for about 10 minutes."
        },
        {
          "headline":"Heat two inches of oil in a heavy pot and allow it to bubble.",
          "description":""
        },
        {
          "headline":"Fry the chicken into the oil for about 4 minutes on both sides.",
          "description":"Cook each chicken piece and lay it on a plate covered with a napkin."
        },
        {
          "headline":"Make the waffle sandwich.",
          "description":"Place a piece of chicken on a waffle. Layer with tomato, avocado, and maple mustard sauce. Close with another waffle. Repeat to make more waffle sandwiches."
        },
        {
          "headline":"Serve.",
          "description":"Garnish more maple mustard sauce over the sandwich, if desired. Enjoy!"
        }
      ]
    },
    {
      "name":"Turkey Club Waffle Sandwich",
      "steps":[
        {
          "headline":"Place a greased iron skillet on a stovetop to warm up on medium heat.",
          "description":""
        },
        {
          "headline":"Lay both waffles with two slices of cheese and two slices of ham.",
          "description":""
        },
        {
          "headline":"Add two pieces of turkey and bacon onto each waffle.",
          "description":""
        },
        {
          "headline":"Place three tomato slices on each waffle and add the avocado.",
          "description":""
        },
        {
          "headline":"Close the sandwiches together and place them on the iron skillet.",
          "description":""
        },
        {
          "headline":"Fry the sandwiches on both sides for about 5 minutes.",
          "description":"Cook each side until the waffle is golden brown and cheese melts."
        },
        {
          "headline":"Serve.",
          "description":"Place the Turkey club waffle sandwiches on a serving plate. Enjoy!"
        }
      ]
    },
    {
      "name":"Bacon and Egg Waffle Sandwich",
      "steps":[
        {
          "headline":"In a large bowl, beat the milk and eggs until properly combined.",
          "description":""
        },
        {
          "headline":"Melt one teaspoon of butter over medium heat on a medium skillet.",
          "description":""
        },
        {
          "headline":"Pour a ¼ cup of the egg mixture over the medium skillet.",
          "description":""
        },
        {
          "headline":"Allow the egg to cook until it sets.",
          "description":"Flip it over with a spatula and cook on the other side."
        },
        {
          "headline":"Sprinkle two tablespoons over the cheese and fold egg in half.",
          "description":""
        },
        {
          "headline":"Make the waffle sandwich.",
          "description":"Place the cooked egg on a waffle and add bacon. Close with another waffle."
        },
        {
          "headline":"Repeat steps 3 to 6 to make four waffle sandwiches.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Place the waffle sandwiches on a large serving plate. Enjoy!"
        }
      ]
    },
    {
      "name":"Grilled Cheese Waffle Sandwich",
      "steps":[
        {
          "headline":"Beat together the wet ingredients.",
          "description":"In a large bowl, whisk the buttermilk, vanilla, butter, and eggs. Beat until fully combined."
        },
        {
          "headline":"Stir in the dry ingredients.",
          "description":"Add the flour, baking soda, baking powder, and salt. Mix until the batter is smooth with a few lumps."
        },
        {
          "headline":"Preheat your waffle iron and grease it well.",
          "description":""
        },
        {
          "headline":"Scoop one-third cup of waffle batter onto the waffle iron.",
          "description":"Cook until the waffle is golden brown."
        },
        {
          "headline":"Repeat with the rest of the waffles and place them on a plate.",
          "description":""
        },
        {
          "headline":"Lay a slice of cheese onto each waffle and close together to form sandwiches.",
          "description":""
        },
        {
          "headline":"Fry each waffle on a medium skillet over medium heat.",
          "description":"Cook both sides for about 4-5 minutes until the cheese melts."
        },
        {
          "headline":"Serve.",
          "description":"Place the waffle sandwiches onto a serving place. Cut into slices, if desired. Enjoy!"
        }
      ]
    },
    {
      "name":"Peanut Butter and Jelly Waffle Sandwich",
      "steps":[
        {
          "headline":"Spread the peanut butter on two waffles.",
          "description":""
        },
        {
          "headline":"Spread the jelly on the other two waffles.",
          "description":""
        },
        {
          "headline":"Lay the sliced banana onto each waffle, if desired.",
          "description":""
        },
        {
          "headline":"Close the peanut butter and jelly waffles together to make 2 sandwiches.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Place the waffle sandwiches on a serving plate. Slice into pieces, if desired. Enjoy!"
        }
      ]
    },
    {
      "name":"Chocolate Spread Waffle Sandwich",
      "steps":[
        {
          "headline":"Spread the chocolate spread onto each waffle.",
          "description":""
        },
        {
          "headline":"Lay the sliced banana over the waffles, if desired.",
          "description":""
        },
        {
          "headline":"Close each waffle together to make 2 sandwiches.",
          "description":""
        },
        {
          "headline":"Place the waffle sandwiches onto a serving plate.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Garnish the sandwiches with whipped cream. Enjoy!"
        }
      ]
    },
    {
      "name":"Ice Cream Waffle Sandwich",
      "steps":[
        {
          "headline":"Scoop the ice cream onto the two waffles.",
          "description":""
        },
        {
          "headline":"Close the waffles together to form a sandwich.",
          "description":""
        },
        {
          "headline":"Roll the waffle sandwich into the toppings.",
          "description":""
        },
        {
          "headline":"Place the waffle sandwiches onto a serving plate.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Garnish the sandwiches with whipped cream, if desired. Enjoy!"
        }
      ]
    },
    {
      "name":"S'more Waffle Sandwich",
      "steps":[
        {
          "headline":"Follow your waffle batter’s cooking instructions to make the waffles.",
          "description":""
        },
        {
          "headline":"Place the cooked waffles on a large plate.",
          "description":""
        },
        {
          "headline":"Sprinkle the marshmallows, graham cracker crumbs, and chocolate chips over the waffles.",
          "description":""
        },
        {
          "headline":"Close the waffle into a half and place waffle back on waffle iron.",
          "description":""
        },
        {
          "headline":"Cook the waffle until the chocolate chip melts and the marshmallows are gooey.",
          "description":""
        },
        {
          "headline":"Repeat with the rest of the waffles.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Place the waffle sandwiches on a serving plate. Enjoy!"
        }
      ]
    },
    {
      "name":"Peanut Butter Honey Waffle Sandwich",
      "steps":[
        {
          "headline":"Spread the peanut butter over the two waffles.",
          "description":""
        },
        {
          "headline":"Drizzle the honey onto both waffles.",
          "description":""
        },
        {
          "headline":"Add the sliced banana and close the waffle to form a sandwich.",
          "description":""
        },
        {
          "headline":"Fry the waffle over medium heat on a medium skillet with the butter.",
          "description":""
        },
        {
          "headline":"Place the waffle on a serving plate.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Garnish the sandwiches with whipped cream, if desired. Enjoy!"
        }
      ]
    }
  ],
  "text":" Fried Chicken Waffle Sandwich Pour the buttermilk and hot sauce over the chicken. Toss well in a large bowl until fully coated. Cover the bowl with plastic wrap and allow it to chill for 30 minutes. This step is optional, but it allows the chicken to be more tender when fried. Whisk the dry ingredients together. In a separate bowl, combine the garlic powder, salt, flour, cayenne pepper, and black pepper. Mix until incorporated together. Dust the breading over the chicken and fully coat each piece.  Dunk the chicken back into the buttermilk and coat again in the breading. Repeat for double-breaded chicken. Place the chicken on a rack over a baking sheet. Allow it to sit for about 10 minutes. Heat two inches of oil in a heavy pot and allow it to bubble.  Fry the chicken into the oil for about 4 minutes on both sides. Cook each chicken piece and lay it on a plate covered with a napkin. Make the waffle sandwich. Place a piece of chicken on a waffle. Layer with tomato, avocado, and maple mustard sauce. Close with another waffle. Repeat to make more waffle sandwiches. Serve. Garnish more maple mustard sauce over the sandwich, if desired. Enjoy! Turkey Club Waffle Sandwich Place a greased iron skillet on a stovetop to warm up on medium heat.  Lay both waffles with two slices of cheese and two slices of ham.  Add two pieces of turkey and bacon onto each waffle.  Place three tomato slices on each waffle and add the avocado.  Close the sandwiches together and place them on the iron skillet.  Fry the sandwiches on both sides for about 5 minutes. Cook each side until the waffle is golden brown and cheese melts. Serve. Place the Turkey club waffle sandwiches on a serving plate. Enjoy! Bacon and Egg Waffle Sandwich In a large bowl, beat the milk and eggs until properly combined.  Melt one teaspoon of butter over medium heat on a medium skillet.  Pour a ¼ cup of the egg mixture over the medium skillet.  Allow the egg to cook until it sets. Flip it over with a spatula and cook on the other side. Sprinkle two tablespoons over the cheese and fold egg in half.  Make the waffle sandwich. Place the cooked egg on a waffle and add bacon. Close with another waffle. Repeat steps 3 to 6 to make four waffle sandwiches.  Serve. Place the waffle sandwiches on a large serving plate. Enjoy! Grilled Cheese Waffle Sandwich Beat together the wet ingredients. In a large bowl, whisk the buttermilk, vanilla, butter, and eggs. Beat until fully combined. Stir in the dry ingredients. Add the flour, baking soda, baking powder, and salt. Mix until the batter is smooth with a few lumps. Preheat your waffle iron and grease it well.  Scoop one-third cup of waffle batter onto the waffle iron. Cook until the waffle is golden brown. Repeat with the rest of the waffles and place them on a plate.  Lay a slice of cheese onto each waffle and close together to form sandwiches.  Fry each waffle on a medium skillet over medium heat. Cook both sides for about 4-5 minutes until the cheese melts. Serve. Place the waffle sandwiches onto a serving place. Cut into slices, if desired. Enjoy! Peanut Butter and Jelly Waffle Sandwich Spread the peanut butter on two waffles.  Spread the jelly on the other two waffles.  Lay the sliced banana onto each waffle, if desired.  Close the peanut butter and jelly waffles together to make 2 sandwiches.  Serve. Place the waffle sandwiches on a serving plate. Slice into pieces, if desired. Enjoy! Chocolate Spread Waffle Sandwich Spread the chocolate spread onto each waffle.  Lay the sliced banana over the waffles, if desired.  Close each waffle together to make 2 sandwiches.  Place the waffle sandwiches onto a serving plate.  Serve. Garnish the sandwiches with whipped cream. Enjoy! Ice Cream Waffle Sandwich Scoop the ice cream onto the two waffles.  Close the waffles together to form a sandwich.  Roll the waffle sandwich into the toppings.  Place the waffle sandwiches onto a serving plate.  Serve. Garnish the sandwiches with whipped cream, if desired. Enjoy! S'more Waffle Sandwich Follow your waffle batter’s cooking instructions to make the waffles.  Place the cooked waffles on a large plate.  Sprinkle the marshmallows, graham cracker crumbs, and chocolate chips over the waffles.  Close the waffle into a half and place waffle back on waffle iron.  Cook the waffle until the chocolate chip melts and the marshmallows are gooey.  Repeat with the rest of the waffles.  Serve. Place the waffle sandwiches on a serving plate. Enjoy! Peanut Butter Honey Waffle Sandwich Spread the peanut butter over the two waffles.  Drizzle the honey onto both waffles.  Add the sliced banana and close the waffle to form a sandwich.  Fry the waffle over medium heat on a medium skillet with the butter.  Place the waffle on a serving plate.  Serve. Garnish the sandwiches with whipped cream, if desired. Enjoy!",
  "tyn_model":[
    "serving plate",
    "medium skillet",
    "peanut butter",
    "buttermilk",
    "large bowl",
    "waffle",
    "butter",
    "waffle iron",
    "banana",
    "whipped cream",
    "salt",
    "flour",
    "oil",
    "plate",
    "tomato",
    "avocado",
    "maple mustard",
    "turkey club waffle",
    "bacon",
    "eggs",
    "waffle batter",
    "chocolate spread",
    "ice cream",
    "fried chicken waffle sandwich",
    "hot sauce",
    "plastic wrap",
    "garlic powder",
    "cayenne pepper",
    "black pepper",
    "breading",
    "baking sheet",
    "heavy pot",
    "napkin",
    "chicken",
    "greased iron skillet",
    "stovetop",
    "ham",
    "turkey",
    "iron skillet",
    "milk",
    "spatula",
    "large serving plate",
    "grilled cheese waffle",
    "vanilla",
    "baking soda",
    "baking powder",
    "jelly",
    "large plate",
    "marshmallows",
    "graham cracker crumbs",
    "chocolate chips",
    "chocolate chip",
    "peanut butter honey",
    "honey"
  ],
  "tyn_section":[

  ]
}