{
  "title":"How to Make a Red Pasta Sauce",
  "url":"https://www.wikihow.com/Make-a-Red-Pasta-Sauce",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles",
    "Pasta Sauce Recipes"
  ],
  "methods":[
    {
      "name":"Smooth Sauce",
      "steps":[
        {
          "headline":"Pour water into the saucepan.",
          "description":"Pour 2 cups of warm water into a saucepan."
        },
        {
          "headline":"Add half a can of tomato paste.",
          "description":"Mix it well with the water."
        },
        {
          "headline":"Add 1 can of diced tomatoes.",
          "description":"Do not drain the water from the can, but include it in the sauce. You can also add capsicum or green chilies if you like."
        },
        {
          "headline":"Add in the carrots.",
          "description":"Finely grate 2 medium carrots or 1 large carrot and add that to the saucepan."
        },
        {
          "headline":"Add in the onions.",
          "description":"Dice 1/3 of an onion and add it to the sauce. The type of onion is up to you but red and sweet onions work best. You can alternatively use 2-3 shallots."
        },
        {
          "headline":"Add in the spices.",
          "description":"Add in 1-2 cloves of chopped garlic, 1/2 tsp of celery salt, 1 tsp of dried oregano (or fresh equivalent), 1 tbsp of dried basil (or fresh equivalent), and optionally 1 chicken bouillon cube and/or 1 bay leaf. You can add in a touch your favorite spice."
        },
        {
          "headline":"Bring to a boil on medium heat.",
          "description":"Mix the ingredients well and then bring the mixture to a boil over medium heat."
        },
        {
          "headline":"Simmer.",
          "description":"Reduce the heat to low, cover the pot, and simmer for 15-30 minutes. The longer the simmer, the more the flavors will be drawn out. Remove from heat when done."
        },
        {
          "headline":"Blend the sauce.",
          "description":"Once the sauce is cooked, if you do not like the consistency, you can make it even smoother by using a blender or a blending wand to get it as smooth as possible."
        }
      ]
    },
    {
      "name":"Chunky Sauce",
      "steps":[
        {
          "headline":"If this is intended for pasta, start boiling the water.",
          "description":""
        },
        {
          "headline":"Crush and chop the garlic.",
          "description":"You can do this however you like, as long as the oils can escape freely."
        },
        {
          "headline":"Heat up the olive oil in a saucepan on medium-high heat.",
          "description":""
        },
        {
          "headline":"Put in the garlic, wait a while (about a minute) and add the herbs and wait a few seconds.",
          "description":"If you're using wine, this is when you should add it. You can replace garlic with ginger or use a mixture of both."
        },
        {
          "headline":"Pour the tomatoes in and stir.",
          "description":"Turn the stove to high."
        },
        {
          "headline":"Salt and pepper to taste.",
          "description":""
        },
        {
          "headline":"Once it's boiling, turn it down to a simmer.",
          "description":"The longer it simmers, the more the flavors meld. Also, you can keep adding herbs, salt, pepper, and wine if you feel it needs it. Once simmering, you can start the pasta."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Smooth Sauce Pour water into the saucepan. Pour 2 cups of warm water into a saucepan. Add half a can of tomato paste. Mix it well with the water. Add 1 can of diced tomatoes. Do not drain the water from the can, but include it in the sauce. You can also add capsicum or green chilies if you like. Add in the carrots. Finely grate 2 medium carrots or 1 large carrot and add that to the saucepan. Add in the onions. Dice 1/3 of an onion and add it to the sauce. The type of onion is up to you but red and sweet onions work best. You can alternatively use 2-3 shallots. Add in the spices. Add in 1-2 cloves of chopped garlic, 1/2 tsp of celery salt, 1 tsp of dried oregano (or fresh equivalent), 1 tbsp of dried basil (or fresh equivalent), and optionally 1 chicken bouillon cube and/or 1 bay leaf. You can add in a touch your favorite spice. Bring to a boil on medium heat. Mix the ingredients well and then bring the mixture to a boil over medium heat. Simmer. Reduce the heat to low, cover the pot, and simmer for 15-30 minutes. The longer the simmer, the more the flavors will be drawn out. Remove from heat when done. Blend the sauce. Once the sauce is cooked, if you do not like the consistency, you can make it even smoother by using a blender or a blending wand to get it as smooth as possible. Chunky Sauce If this is intended for pasta, start boiling the water.  Crush and chop the garlic. You can do this however you like, as long as the oils can escape freely. Heat up the olive oil in a saucepan on medium-high heat.  Put in the garlic, wait a while (about a minute) and add the herbs and wait a few seconds. If you're using wine, this is when you should add it. You can replace garlic with ginger or use a mixture of both. Pour the tomatoes in and stir. Turn the stove to high. Salt and pepper to taste.  Once it's boiling, turn it down to a simmer. The longer it simmers, the more the flavors meld. Also, you can keep adding herbs, salt, pepper, and wine if you feel it needs it. Once simmering, you can start the pasta. Finished. ",
  "tyn_model":[
    "water",
    "saucepan",
    "garlic",
    "carrots",
    "onions",
    "onion",
    "herbs",
    "wine",
    "salt",
    "pepper",
    "tomato paste",
    "diced tomatoes",
    "capsicum or green chilies",
    "carrot",
    "spices",
    "celery salt",
    "dried oregano",
    "dried basil",
    "chicken bouillon cube",
    "bay leaf",
    "pot",
    "blender",
    "olive oil",
    "ginger",
    "tomatoes",
    "stove",
    "pasta"
  ],
  "tyn_section":[

  ]
}