{
  "title":"How to Make Rainbow Pudding Pops",
  "url":"https://www.wikihow.com/Make-Rainbow-Pudding-Pops",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts",
    "Ice Pops"
  ],
  "steps":[
    {
      "headline":"Prepare the pudding.",
      "description":"Combine the instant pudding mix packages and milk in a large bowl."
    },
    {
      "headline":"Allow the pudding to thicken.",
      "description":"Place the bowl in the refrigerator for a few minutes to accelerate time."
    },
    {
      "headline":"Make the colored pudding.",
      "description":"Divide the pudding into five small bowls. Drop about 2 to 3 drops of food coloring into the bowls, so each one is a different color. Quickly mix each color so that the food coloring is distributed evenly through the pudding."
    },
    {
      "headline":"Layer the pudding into the paper cups.",
      "description":"Fill up the cups in the following order in even amounts. It's best to distribute the first color with a certain measurement (start out with 2 tablespoons in each cup) until gone before adding the next layer. Blue (bottom of the cup)\nGreen\nYellow\nOrange\nRed (top of the cup)"
    },
    {
      "headline":"Refrigerate the cups for two hours.",
      "description":"Cover each cup with aluminum foil and stick a Popsicle stick in the middle of the foil."
    },
    {
      "headline":"Freeze the cups.",
      "description":"Transfer the cups to the freezer, preferably overnight."
    },
    {
      "headline":"Serve the pudding pops.",
      "description":"Tear off the paper cups from the frozen pudding pop for faster serving."
    }
  ],
  "text":" Prepare the pudding. Combine the instant pudding mix packages and milk in a large bowl. Allow the pudding to thicken. Place the bowl in the refrigerator for a few minutes to accelerate time. Make the colored pudding. Divide the pudding into five small bowls. Drop about 2 to 3 drops of food coloring into the bowls, so each one is a different color. Quickly mix each color so that the food coloring is distributed evenly through the pudding. Layer the pudding into the paper cups. Fill up the cups in the following order in even amounts. It's best to distribute the first color with a certain measurement (start out with 2 tablespoons in each cup) until gone before adding the next layer. Blue (bottom of the cup)\nGreen\nYellow\nOrange\nRed (top of the cup) Refrigerate the cups for two hours. Cover each cup with aluminum foil and stick a Popsicle stick in the middle of the foil. Freeze the cups. Transfer the cups to the freezer, preferably overnight. Serve the pudding pops. Tear off the paper cups from the frozen pudding pop for faster serving.",
  "tyn_model":[
    "pudding",
    "food coloring",
    "instant pudding",
    "milk",
    "large bowl",
    "refrigerator",
    "aluminum foil",
    "popsicle stick",
    "freezer",
    "pudding pops"
  ],
  "tyn_section":[

  ]
}