{
  "title":"How to Help Your Teenager Learn to Cook",
  "url":"https://www.wikihow.com/Help-Your-Teenager-Learn-to-Cook",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking for Children"
  ],
  "parts":[
    {
      "name":"Approaches to Learning",
      "steps":[
        {
          "headline":"Gauge their interest.",
          "description":"Some teens are interested in cooking. If so, it's not likely you'll have to encourage them to learn how to cook. If they're eager to learn already, give them the supplies and freedom to do some cooking for you and the rest of the family, and they'll learn by trial and error. If they're not interested, you may have to motivate them a bit more. Try explaining to them that knowing how to cook will make them even more independent, since independence is appealing to most teens."
        },
        {
          "headline":"Encourage them with their favorite recipes.",
          "description":"When learning to cook, it's often most enjoyable to start with the recipes that you enjoy the most. This is especially important if your teen is leaving for college soon; remind them that they soon won't be able to eat their favorite mac and cheese or meatloaf at home, so if they learn to cook it themselves, they won't have to go without it."
        },
        {
          "headline":"Start out simple.",
          "description":"Cooking is a tricky skill, especially for someone who isn't naturally drawn to it. Some consider it an art, others a science, but for those who aren't gifted in the kitchen arts, starting with simple recipes is best. Breakfast is a good meal to start with. You can also help your teen start with semi-prepared meals, like boxed mac and cheese or ready-made pizza crusts that they can customize with their chosen ingredients. Some simple recipes are included below to get you started."
        },
        {
          "headline":"Teach in a way appealing to your teen.",
          "description":"Every teen is different, so let them learn in a way that suits them:\nThey might benefit from real-life formal or semi-formal lessons with you, where you give them a play-by-play as you cook. If so, take the time to teach! They might prefer a trial-and-error method where they get their hands dirty and start trying out their skills. If so, provide a recipe and buy the supplies needed, and let them loose. Be available for help when they need it, but generally let them do their thing. They might like to read and compare recipes and watch videos online. Some people like to \"study up\" before hitting the kitchen. If this suits them, use the full range of resources: recipe books, websites, and YouTube videos can all help them learn."
        },
        {
          "headline":"Make it a regular event.",
          "description":"Learning to cook takes practice. Set an expectation that your teen will cook something once a week, perhaps preparing a meal for the whole family. By ensuring they get regular practice, you'll help speed up their learning curve."
        },
        {
          "headline":"Talk about food with your teens.",
          "description":"Watch cooking shows or read cookbooks together to get motivated."
        },
        {
          "headline":"Make a plan.",
          "description":"Ask them which meals they would like; go to grocery store together and buy the ingredients."
        },
        {
          "headline":"Guide them.",
          "description":"Let them do the work. Don't take over the work."
        },
        {
          "headline":"Discuss what foods are healthier options to have when friends are over.",
          "description":"This gives teens the responsibility of making food decisions for themselves and their friends."
        },
        {
          "headline":"Have fun.",
          "description":"Be a role model."
        }
      ]
    },
    {
      "name":"Simple Recipes to Try",
      "steps":[
        {
          "headline":"Start with eggs.",
          "description":"A simple French Omelette is easy. One egg per person  is enough to start with; if your omelettes are a hit, you get a lot of practice making them individually."
        },
        {
          "headline":"Gather your ingredients.",
          "description":"Turn the stove on; when the time is right, set the temperature to be on medium-high."
        },
        {
          "headline":"Crack the egg firmly down the middle into the bowl, and carefully discard the shell.",
          "description":"Using the dull side of a knife and hitting the egg firmly enough to go almost halfway through the egg works well. Hitting it too lightly gets you into all sorts of trouble, so be careful."
        },
        {
          "headline":"Add a  bit of tap water, about a teaspoonful.",
          "description":""
        },
        {
          "headline":"If you want to get fancy, you can add a teaspoonful of light soy sauce instead, but your omelette may taste just a little too flavorful for some people.",
          "description":"Also add just a tiny pinch of salt, and a tiny pinch of white pepper, or any finely-ground pepper."
        },
        {
          "headline":"Beat the egg (and salt and pepper and water) with the fork just until the yoke and the egg white are mixed.",
          "description":"If you added the water as suggested, this should not take even half a minute."
        },
        {
          "headline":"Be careful.",
          "description":"Pour  a tablespoonful of oil on the frying pan, and put it on a small burner of your kitchen range on medium high heat. If the temperature is too hot, the oil will start to smoke. If it does, turn down the burner, or move the frying pan to an unoccupied burner,  and wait until your pan cools to medium high."
        },
        {
          "headline":"Add the egg mixture, and slightly tilt and swirl the pan so that the egg spreads out over the entire pan, then put the frying pan back on the burner.",
          "description":""
        },
        {
          "headline":"Get a spatula (a flat-bladed wooden or plastic implement that won't scratch your nice non-stick pan), and watch the egg.",
          "description":"After a minute or so, the egg should get fried all around the edges. At this point, use your spatula to push the cooked egg to a side, allowing the runny part to flow into the oil. This is usually not a successful maneuver the first time you try it, because you might have waited a little too long, or not waited long enough. It doesn't matter; you can still eat the egg as long as it isn't burnt, and it isn't under cooked! You do not need so much oil that the egg is sloshing in it. Remember: just a tablespoonful is enough, and a good cook can manage with less than that."
        },
        {
          "headline":"When the egg is just barely cooked to the point that it isn't fluid, take the pan off the burner (onto a vacant burner, perhaps,) and use your spatula to fold the omelette exactly in half.",
          "description":"It is done! If your family is nervous about uncooked egg, leave it to cook a little more in the pan; if not, slide the egg onto a plate."
        },
        {
          "headline":"Crack the egg right into the hot oil in the pan.",
          "description":"Do not add water, as you did for an omelette, except as described below. You can use a tiny bit of butter for eggs, instead of olive oil, provided you've practiced enough not to burn the butter."
        },
        {
          "headline":"Let them fry to your liking.",
          "description":""
        },
        {
          "headline":"For \"over easy\" egg, you need to turn them over, which you do very carefully with the spatula.",
          "description":"You should know exactly when to do it."
        },
        {
          "headline":"For \"sunny side up\" eggs, have a heat-proof glass lid that fits your frying pan well.",
          "description":"Once the egg is in the oil, slip a teeny bit of water into the pan, and quickly cover before the water has a chance to sputter. Watch the egg get firm through the glass, and promptly take the pan off the burner just as soon as the egg is truly ready. You can't really tell with the cover on, so after about a minute, take the cover off, and check on the egg."
        },
        {
          "headline":"In a large bowl, mix an egg, a quarter cup of milk, salt, pepper, cinnamon, and nutmeg to taste.",
          "description":"You can use as much of the salt, pepper, cinnamon or nutmeg as you like, but it is strongly advised to use very little.\" A pinch is all you need; that is, less than a quarter teaspoonful. The exception is cinnamon, which you can use more of. Beat well"
        },
        {
          "headline":"Slice an old loaf of bread into slices about a third of an inch thick.",
          "description":"(Multi-grain or Oatmeal bread, or bread with nuts works really well.) Meanwhile, heat a large skillet on the stove, and spray it with Pam (or any cooking spray, or even  butter)."
        },
        {
          "headline":"Soak a slice of the bread in the egg-milk-spices mixture.",
          "description":"You don't need to make the bread totally soggy."
        },
        {
          "headline":"Once the skillet and oil or butter is hot (just too hot to touch), drain the slice of bread, and lay it on the skillet.",
          "description":"Do not put so much oil that it flows about; just a tablespoonful is all you need. Or use a small pat of butter instead."
        },
        {
          "headline":"Turn the bread over with a spatula.",
          "description":"Both sides should be a nice golden brown, but not a dark, burned brown. It doesn't matter if just the edges of the slice of bread get a tiny bit blackened. Cook the slice long. The genius of French Toast is the fragrance. The cinnamon and nutmeg combination just smells really festive. It might be an acquired taste, and French Toast and pancake syrup/jam is not exactly low in calories. However, it probably beats bacon or sausage for being low in grease, cholesterol, and sundry carcinogens."
        },
        {
          "headline":"Get a small, nice cut of beef, and cube it.",
          "description":"(Cut it into centimeter cubes.)"
        },
        {
          "headline":"Add salt, pepper, any one of soy sauce or Worcester sauce or vinegar or red wine, just enough to moisten the meat, and mix thoroughly.",
          "description":""
        },
        {
          "headline":"Shake garlic powder over the beef.",
          "description":""
        },
        {
          "headline":"Heat oil in a skillet, maybe two tablespoons full.",
          "description":"When it is hot, put in the beef, and keep moving the cubes about with a wooden skillet, until the beef is thoroughly browned on all sides."
        },
        {
          "headline":"Cut the beef into strips (about half the size of a standard french-fry) and stir-fry them.",
          "description":"The pepper and the vinegar softens the beef. When you are finished, get the beef off the skillet into a bowl."
        },
        {
          "headline":"Add discs of zucchini, carrots, button mushrooms quartered, bok choy, sliced onions, celery sticks, asparagus, with the fibrous ends snapped off, snow peas, or sweet peppers (seeded and cut into strips).",
          "description":""
        },
        {
          "headline":"Cook each one separately, and use only as many as you want.",
          "description":"The onion is almost a must, and one or two of the others. Before cooking, soak them in a light vinegar and salt mix for about five minutes. In the case of snow peas and Bok Choy, also add a little soy sauce to the marinade."
        },
        {
          "headline":"Fry in hot oil for about two minutes.",
          "description":"It will sizzle, so cover the floor near the stove top with newspaper, and wear an apron. Note that it will be messy."
        },
        {
          "headline":"Stir-fry each vegetable separately, and put in a bowl, each in its own bowl, or all in the same bowl.",
          "description":"Throw in a dash of Jane's Crazy Mixed-Up Salt, and or Pepper instead of your ordinary salt and pepper. The mushrooms take a little longer than you would expect; cook them until they turn shiny. This is called \"sweating\". Use pork tenderloin. This comes in a sausage-shaped cut, which you slice into disks crosswise. Soak them in a soy sauce, oil, vinegar, salt and pepper mix briefly, then stir-fry the disks until they're cooked. Mix them all together in a large skillet, but don't add any more oil or spray. Serve a stir-fry with rice."
        },
        {
          "headline":"Get out a cooking pot.",
          "description":"Mix together a cup of rice, and one-and-three-quarter cups of boiling water. It doesn't need to be boiling, but if you start with boiling water, your rice will come out nice and crisp and firm. If you bring the rice and cold water to a boil, the rice grains might be a little too soft. Once the rice-water mixture is at a thorough rolling boil  reduce heat  to just simmering (the mixture continues to just barely boil),"
        },
        {
          "headline":"Cover the pot, and cook for about ten minutes.",
          "description":"This steams the rice gently, so that it is cooked, but not overcooked. Only check the rice after at least ten minutes. If you wait for 15 minutes, that's even better. Consider buying  a rice cooker that cook the rice automatically for you. There is also a gadget you can buy, which is a container in which you cook rice in the microwave. It has a special lid that keeps the water in, without allowing it to boil over."
        },
        {
          "headline":"Remove the cooked rice from the heat.",
          "description":"Get a wooden spoon with a handle that's like a rod, and gently stir the rice, to break if up and fluff it to look like perfectly cooked rice. If you leave the rice packed tightly in the pot, it will continue to cook, and actually get overcooked."
        },
        {
          "headline":"Clean up some romaine lettuce thoroughly, and shred by hand into bite-sized pieces.",
          "description":"Cut some Roma tomatoes into eight, slice up some pitted olives (black, green, or both), chop up a little onion, add a few artichoke hearts, and mixed greens."
        },
        {
          "headline":"Get out a small pitcher.",
          "description":"Mix up some olive oil, garlic powder, a tiny touch of salt, black pepper, some Parmesan cheese, and finely chopped Basil (a leafy herb, sold as a plant in a pot, or as dried flakes), and pour over the salad, and toss well. Tinker with the proportions of the dressing until you like the taste and the fragrance of the dressing."
        },
        {
          "headline":"Wash up before you serve the meal.",
          "description":"The aftermath of the meal will be depressing to the cooks, so wash up the pots and pans and cooking utensils right after you use them."
        }
      ]
    }
  ],
  "text":" Approaches to Learning Gauge their interest. Some teens are interested in cooking. If so, it's not likely you'll have to encourage them to learn how to cook. If they're eager to learn already, give them the supplies and freedom to do some cooking for you and the rest of the family, and they'll learn by trial and error. If they're not interested, you may have to motivate them a bit more. Try explaining to them that knowing how to cook will make them even more independent, since independence is appealing to most teens. Encourage them with their favorite recipes. When learning to cook, it's often most enjoyable to start with the recipes that you enjoy the most. This is especially important if your teen is leaving for college soon; remind them that they soon won't be able to eat their favorite mac and cheese or meatloaf at home, so if they learn to cook it themselves, they won't have to go without it. Start out simple. Cooking is a tricky skill, especially for someone who isn't naturally drawn to it. Some consider it an art, others a science, but for those who aren't gifted in the kitchen arts, starting with simple recipes is best. Breakfast is a good meal to start with. You can also help your teen start with semi-prepared meals, like boxed mac and cheese or ready-made pizza crusts that they can customize with their chosen ingredients. Some simple recipes are included below to get you started. Teach in a way appealing to your teen. Every teen is different, so let them learn in a way that suits them:\nThey might benefit from real-life formal or semi-formal lessons with you, where you give them a play-by-play as you cook. If so, take the time to teach! They might prefer a trial-and-error method where they get their hands dirty and start trying out their skills. If so, provide a recipe and buy the supplies needed, and let them loose. Be available for help when they need it, but generally let them do their thing. They might like to read and compare recipes and watch videos online. Some people like to \"study up\" before hitting the kitchen. If this suits them, use the full range of resources: recipe books, websites, and YouTube videos can all help them learn. Make it a regular event. Learning to cook takes practice. Set an expectation that your teen will cook something once a week, perhaps preparing a meal for the whole family. By ensuring they get regular practice, you'll help speed up their learning curve. Talk about food with your teens. Watch cooking shows or read cookbooks together to get motivated. Make a plan. Ask them which meals they would like; go to grocery store together and buy the ingredients. Guide them. Let them do the work. Don't take over the work. Discuss what foods are healthier options to have when friends are over. This gives teens the responsibility of making food decisions for themselves and their friends. Have fun. Be a role model. Simple Recipes to Try Start with eggs. A simple French Omelette is easy. One egg per person  is enough to start with; if your omelettes are a hit, you get a lot of practice making them individually. Gather your ingredients. Turn the stove on; when the time is right, set the temperature to be on medium-high. Crack the egg firmly down the middle into the bowl, and carefully discard the shell. Using the dull side of a knife and hitting the egg firmly enough to go almost halfway through the egg works well. Hitting it too lightly gets you into all sorts of trouble, so be careful. Add a  bit of tap water, about a teaspoonful.  If you want to get fancy, you can add a teaspoonful of light soy sauce instead, but your omelette may taste just a little too flavorful for some people. Also add just a tiny pinch of salt, and a tiny pinch of white pepper, or any finely-ground pepper. Beat the egg (and salt and pepper and water) with the fork just until the yoke and the egg white are mixed. If you added the water as suggested, this should not take even half a minute. Be careful. Pour  a tablespoonful of oil on the frying pan, and put it on a small burner of your kitchen range on medium high heat. If the temperature is too hot, the oil will start to smoke. If it does, turn down the burner, or move the frying pan to an unoccupied burner,  and wait until your pan cools to medium high. Add the egg mixture, and slightly tilt and swirl the pan so that the egg spreads out over the entire pan, then put the frying pan back on the burner.  Get a spatula (a flat-bladed wooden or plastic implement that won't scratch your nice non-stick pan), and watch the egg. After a minute or so, the egg should get fried all around the edges. At this point, use your spatula to push the cooked egg to a side, allowing the runny part to flow into the oil. This is usually not a successful maneuver the first time you try it, because you might have waited a little too long, or not waited long enough. It doesn't matter; you can still eat the egg as long as it isn't burnt, and it isn't under cooked! You do not need so much oil that the egg is sloshing in it. Remember: just a tablespoonful is enough, and a good cook can manage with less than that. When the egg is just barely cooked to the point that it isn't fluid, take the pan off the burner (onto a vacant burner, perhaps,) and use your spatula to fold the omelette exactly in half. It is done! If your family is nervous about uncooked egg, leave it to cook a little more in the pan; if not, slide the egg onto a plate. Crack the egg right into the hot oil in the pan. Do not add water, as you did for an omelette, except as described below. You can use a tiny bit of butter for eggs, instead of olive oil, provided you've practiced enough not to burn the butter. Let them fry to your liking.  For \"over easy\" egg, you need to turn them over, which you do very carefully with the spatula. You should know exactly when to do it. For \"sunny side up\" eggs, have a heat-proof glass lid that fits your frying pan well. Once the egg is in the oil, slip a teeny bit of water into the pan, and quickly cover before the water has a chance to sputter. Watch the egg get firm through the glass, and promptly take the pan off the burner just as soon as the egg is truly ready. You can't really tell with the cover on, so after about a minute, take the cover off, and check on the egg. In a large bowl, mix an egg, a quarter cup of milk, salt, pepper, cinnamon, and nutmeg to taste. You can use as much of the salt, pepper, cinnamon or nutmeg as you like, but it is strongly advised to use very little.\" A pinch is all you need; that is, less than a quarter teaspoonful. The exception is cinnamon, which you can use more of. Beat well Slice an old loaf of bread into slices about a third of an inch thick. (Multi-grain or Oatmeal bread, or bread with nuts works really well.) Meanwhile, heat a large skillet on the stove, and spray it with Pam (or any cooking spray, or even  butter). Soak a slice of the bread in the egg-milk-spices mixture. You don't need to make the bread totally soggy. Once the skillet and oil or butter is hot (just too hot to touch), drain the slice of bread, and lay it on the skillet. Do not put so much oil that it flows about; just a tablespoonful is all you need. Or use a small pat of butter instead. Turn the bread over with a spatula. Both sides should be a nice golden brown, but not a dark, burned brown. It doesn't matter if just the edges of the slice of bread get a tiny bit blackened. Cook the slice long. The genius of French Toast is the fragrance. The cinnamon and nutmeg combination just smells really festive. It might be an acquired taste, and French Toast and pancake syrup/jam is not exactly low in calories. However, it probably beats bacon or sausage for being low in grease, cholesterol, and sundry carcinogens. Get a small, nice cut of beef, and cube it. (Cut it into centimeter cubes.) Add salt, pepper, any one of soy sauce or Worcester sauce or vinegar or red wine, just enough to moisten the meat, and mix thoroughly.  Shake garlic powder over the beef.  Heat oil in a skillet, maybe two tablespoons full. When it is hot, put in the beef, and keep moving the cubes about with a wooden skillet, until the beef is thoroughly browned on all sides. Cut the beef into strips (about half the size of a standard french-fry) and stir-fry them. The pepper and the vinegar softens the beef. When you are finished, get the beef off the skillet into a bowl. Add discs of zucchini, carrots, button mushrooms quartered, bok choy, sliced onions, celery sticks, asparagus, with the fibrous ends snapped off, snow peas, or sweet peppers (seeded and cut into strips).  Cook each one separately, and use only as many as you want. The onion is almost a must, and one or two of the others. Before cooking, soak them in a light vinegar and salt mix for about five minutes. In the case of snow peas and Bok Choy, also add a little soy sauce to the marinade. Fry in hot oil for about two minutes. It will sizzle, so cover the floor near the stove top with newspaper, and wear an apron. Note that it will be messy. Stir-fry each vegetable separately, and put in a bowl, each in its own bowl, or all in the same bowl. Throw in a dash of Jane's Crazy Mixed-Up Salt, and or Pepper instead of your ordinary salt and pepper. The mushrooms take a little longer than you would expect; cook them until they turn shiny. This is called \"sweating\". Use pork tenderloin. This comes in a sausage-shaped cut, which you slice into disks crosswise. Soak them in a soy sauce, oil, vinegar, salt and pepper mix briefly, then stir-fry the disks until they're cooked. Mix them all together in a large skillet, but don't add any more oil or spray. Serve a stir-fry with rice. Get out a cooking pot. Mix together a cup of rice, and one-and-three-quarter cups of boiling water. It doesn't need to be boiling, but if you start with boiling water, your rice will come out nice and crisp and firm. If you bring the rice and cold water to a boil, the rice grains might be a little too soft. Once the rice-water mixture is at a thorough rolling boil  reduce heat  to just simmering (the mixture continues to just barely boil), Cover the pot, and cook for about ten minutes. This steams the rice gently, so that it is cooked, but not overcooked. Only check the rice after at least ten minutes. If you wait for 15 minutes, that's even better. Consider buying  a rice cooker that cook the rice automatically for you. There is also a gadget you can buy, which is a container in which you cook rice in the microwave. It has a special lid that keeps the water in, without allowing it to boil over. Remove the cooked rice from the heat. Get a wooden spoon with a handle that's like a rod, and gently stir the rice, to break if up and fluff it to look like perfectly cooked rice. If you leave the rice packed tightly in the pot, it will continue to cook, and actually get overcooked. Clean up some romaine lettuce thoroughly, and shred by hand into bite-sized pieces. Cut some Roma tomatoes into eight, slice up some pitted olives (black, green, or both), chop up a little onion, add a few artichoke hearts, and mixed greens. Get out a small pitcher. Mix up some olive oil, garlic powder, a tiny touch of salt, black pepper, some Parmesan cheese, and finely chopped Basil (a leafy herb, sold as a plant in a pot, or as dried flakes), and pour over the salad, and toss well. Tinker with the proportions of the dressing until you like the taste and the fragrance of the dressing. Wash up before you serve the meal. The aftermath of the meal will be depressing to the cooks, so wash up the pots and pans and cooking utensils right after you use them.",
  "tyn_model":[
    "oil",
    "water",
    "rice",
    "egg",
    "salt",
    "cook",
    "spatula",
    "butter",
    "soy sauce",
    "pepper",
    "frying pan",
    "cinnamon",
    "skillet",
    "vinegar",
    "bowl",
    "eggs",
    "stove",
    "pan",
    "olive oil",
    "salt, pepper",
    "bread",
    "large skillet",
    "french toast",
    "beef",
    "garlic powder",
    "snow peas",
    "onion",
    "salt and pepper",
    "pot",
    "cooking",
    "cheese",
    "meatloaf",
    "recipe books",
    "food",
    "cooking shows",
    "knife",
    "tap water",
    "white pepper",
    "fork",
    "burner",
    "non-stick pan",
    "plate",
    "glass",
    "large bowl",
    "milk",
    "nutmeg",
    "nuts",
    "pam",
    "cooking spray",
    "egg-milk",
    "pancake syrup",
    "bacon",
    "worcester sauce",
    "red wine",
    "wooden skillet",
    "french-fry",
    "zucchini",
    "carrots",
    "button mushrooms",
    "bok choy,",
    "onions",
    "celery",
    "asparagus",
    "sweet peppers",
    "bok choy",
    "hot oil",
    "newspaper",
    "mushrooms",
    "pork tenderloin",
    "cooking pot",
    "boiling water",
    "rice-water",
    "rice cooker",
    "microwave",
    "wooden spoon",
    "romaine lettuce",
    "roma tomatoes",
    "olives",
    "artichoke hearts",
    "mixed greens",
    "small pitcher",
    "black pepper",
    "parmesan cheese",
    "basil",
    "pots",
    "pans",
    "cooking utensils"
  ],
  "tyn_section":[

  ]
}