{
  "title":"How to Evolve Haunter",
  "url":"https://www.wikihow.com/Evolve-Haunter",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Pokemon Video Games"
  ],
  "steps":[
    {
      "headline":"Catch or trade for a Haunter or Gastly.",
      "description":"Depending on the version of Pokémon you are playing, you may or may not be able to find a Haunter or Gastly in the wild. If you get a Gastly, level it up to Level 25 to evolve it into a Haunter. Game\nLocation\n\nRedBlueYellow\n\n\n Pokémon Tower\n\n\nGoldSilverCrystal\n\n\n Route 8 (Night)\n\n\nRubySapphireEmerald\n\n\n Trade only\n\n\nFireRedLeafGreen\n\n\n Pokémon Tower, Lost Cave\n\n\nDiamondPearlPlatinum\n\n\n Old Chateau\n\n\nHeartGoldSoulSilver\n\n\n Route 8, Safari Zone (Night)\n\n\nBlack\n\n\n Trade only\n\n\nWhite\n\n\n Catch and evolve Gastly\n\n\nBlack 2White 2\n\n\n Trade only\n\n\nXY\n\n\n Route 14, Route 19, Frost Cavern, Victory Road\n\n\nAlpha SapphireOmega Ruby\n\n\n Trade only"
    },
    {
      "headline":"Trade your Haunter to a friend.",
      "description":"Haunter evolves into Gengar when it is traded, so you'll need someone that you can trade with that you trust will trade it back to you. The method for trading varies depending on the version of Pokémon you are playing. In Sun, Moon, Ultra Sun, and Ultra Moon, you can trade Pokemon by selecting Festival Plaza in the menu after you've reached the Pokemon Center in Hau'oli City. Select Link Trade to trade with a friend or guest. Both you and your trading partner need to select Quick Link in the menu and press down on the touch screen. Then select Trade. You can do this any where in the Alola Region. In Black, White, Black 2, White 2, X, Y, Alpha Sapphire, and Omega Ruby, you can you can trade Pokemon at the Global Trading Station. In Diamond, Pearl, and Platinum you can trade Pokemon using a pal pad in the downstairs of any Pokemon Center. If you are using John GBA Lite, you cannot trade with other user's but you can trade with yourself using another game file."
    },
    {
      "headline":"Receive your Gengar back in a trade.",
      "description":"Once the Haunter is traded it will evolve into a Gengar. Have your friend trade it back to you so that you can use it."
    }
  ],
  "text":" Catch or trade for a Haunter or Gastly. Depending on the version of Pokémon you are playing, you may or may not be able to find a Haunter or Gastly in the wild. If you get a Gastly, level it up to Level 25 to evolve it into a Haunter. Game\nLocation\n\nRedBlueYellow\n\n\n Pokémon Tower\n\n\nGoldSilverCrystal\n\n\n Route 8 (Night)\n\n\nRubySapphireEmerald\n\n\n Trade only\n\n\nFireRedLeafGreen\n\n\n Pokémon Tower, Lost Cave\n\n\nDiamondPearlPlatinum\n\n\n Old Chateau\n\n\nHeartGoldSoulSilver\n\n\n Route 8, Safari Zone (Night)\n\n\nBlack\n\n\n Trade only\n\n\nWhite\n\n\n Catch and evolve Gastly\n\n\nBlack 2White 2\n\n\n Trade only\n\n\nXY\n\n\n Route 14, Route 19, Frost Cavern, Victory Road\n\n\nAlpha SapphireOmega Ruby\n\n\n Trade only Trade your Haunter to a friend. Haunter evolves into Gengar when it is traded, so you'll need someone that you can trade with that you trust will trade it back to you. The method for trading varies depending on the version of Pokémon you are playing. In Sun, Moon, Ultra Sun, and Ultra Moon, you can trade Pokemon by selecting Festival Plaza in the menu after you've reached the Pokemon Center in Hau'oli City. Select Link Trade to trade with a friend or guest. Both you and your trading partner need to select Quick Link in the menu and press down on the touch screen. Then select Trade. You can do this any where in the Alola Region. In Black, White, Black 2, White 2, X, Y, Alpha Sapphire, and Omega Ruby, you can you can trade Pokemon at the Global Trading Station. In Diamond, Pearl, and Platinum you can trade Pokemon using a pal pad in the downstairs of any Pokemon Center. If you are using John GBA Lite, you cannot trade with other user's but you can trade with yourself using another game file. Receive your Gengar back in a trade. Once the Haunter is traded it will evolve into a Gengar. Have your friend trade it back to you so that you can use it.",
  "tyn_model":[
    "haunter",
    "gengar",
    "pokemon",
    "pokémon",
    "gastly",
    "pokemon center"
  ],
  "tyn_section":[

  ]
}