{
  "title":"How to Make a Low Calorie Caprese Panini Sandwich",
  "url":"https://www.wikihow.com/Make-a-Low-Calorie-Caprese-Panini-Sandwich",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals"
  ],
  "steps":[
    {
      "headline":"Pre-heat a panini press, griddle or stainless steel pan over medium heat.",
      "description":""
    },
    {
      "headline":"Split the lower calorie whole-wheat (or multi-grain) sandwich roll/loaf in half horizontally (lengthwise), with a knife.",
      "description":"This more complex bread digests much more gradually than white bread to be satisfying, not spiking your blood-sugar."
    },
    {
      "headline":"Spread the prosciutto, tomato and mozzarella slices across the bottom half of the roll.",
      "description":""
    },
    {
      "headline":"Top the stuffings with green basil leaves and two thinly sliced pickled (hot) Italian cherry peppers.",
      "description":"Season with salt and black pepper."
    },
    {
      "headline":"Scoop the excess bread out of the top half, to remove more carbs/calories.",
      "description":""
    },
    {
      "headline":"Cover the sandwich with the top half of the bread and heat on a panini press, griddle or stainless-steel pan.",
      "description":"A grilled panino may be lightly oiled (with healthy olive oil) on the outside and grilled in a press (a double-sided electric grill for instance)."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Pre-heat a panini press, griddle or stainless steel pan over medium heat.  Split the lower calorie whole-wheat (or multi-grain) sandwich roll/loaf in half horizontally (lengthwise), with a knife. This more complex bread digests much more gradually than white bread to be satisfying, not spiking your blood-sugar. Spread the prosciutto, tomato and mozzarella slices across the bottom half of the roll.  Top the stuffings with green basil leaves and two thinly sliced pickled (hot) Italian cherry peppers. Season with salt and black pepper. Scoop the excess bread out of the top half, to remove more carbs/calories.  Cover the sandwich with the top half of the bread and heat on a panini press, griddle or stainless-steel pan. A grilled panino may be lightly oiled (with healthy olive oil) on the outside and grilled in a press (a double-sided electric grill for instance). Finished. ",
  "tyn_model":[
    "panini press, griddle or stainless steel pan",
    "whole-wheat (or multi-grain) sandwich roll",
    "knife",
    "white bread",
    "prosciutto",
    "tomato",
    "basil",
    "italian cherry peppers",
    "salt",
    "black pepper",
    "panini press, griddle or stainless-steel pan",
    "grilled panino",
    "olive oil",
    "electric grill"
  ],
  "tyn_section":[

  ]
}