{
  "title":"How to Have Fun on PictoChat",
  "url":"https://www.wikihow.com/Have-Fun-on-PictoChat",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo DS"
  ],
  "steps":[
    {
      "headline":"Try thinking of ways you could make video games on Pictochat, Look on how to play video games on paper for inspiration.",
      "description":"Remember to look for innovative ideas. Love super Mario? Why not try it on PictoChat?"
    },
    {
      "headline":"If you have the time and patience to make DS flip books, set yourself a series of challenges.",
      "description":"For instance, draw a bow and arrow and a target. Your challenge is to make a flip book of the arrow hitting the target. Inspiration for these challenges could be found in everyday life."
    },
    {
      "headline":"Want to draw a full-size human on PictoChat but can't because of the frame size?",
      "description":"Try using several frames to draw it. Simply start the image on frame, send it, then draw another part of the image on the next."
    },
    {
      "headline":"Think of random words and draw how they could be represented in picture form or how the word could be contorted to look like the object.",
      "description":""
    },
    {
      "headline":"Is the girl or boy you like a DS gamer?",
      "description":"Think of a way to surprise (or ask him/her out)using PictoChat."
    },
    {
      "headline":"Try making a cartoon strip in which every PictoChat frame is a new comic frame.",
      "description":"(Get together with a friend for even more fun in the PictoChat sun!)"
    },
    {
      "headline":"Ever heard of a paper RPG?",
      "description":"It's like a story except with lots of people writing it. (usually each person controls a separate character). If it works on paper, it'd definitely work on the DS!"
    },
    {
      "headline":"You could turn on your PictoChat in a place with lots of people (like a shopping center or park), and try to see if you can find anyone in any chat room.",
      "description":""
    },
    {
      "headline":"You can also colour in the whole screen black, then make sure you post it, then simply keep bringing it down and drawing pictures by rubbing out sections with the rubber.",
      "description":""
    }
  ],
  "text":" Try thinking of ways you could make video games on Pictochat, Look on how to play video games on paper for inspiration. Remember to look for innovative ideas. Love super Mario? Why not try it on PictoChat? If you have the time and patience to make DS flip books, set yourself a series of challenges. For instance, draw a bow and arrow and a target. Your challenge is to make a flip book of the arrow hitting the target. Inspiration for these challenges could be found in everyday life. Want to draw a full-size human on PictoChat but can't because of the frame size? Try using several frames to draw it. Simply start the image on frame, send it, then draw another part of the image on the next. Think of random words and draw how they could be represented in picture form or how the word could be contorted to look like the object.  Is the girl or boy you like a DS gamer? Think of a way to surprise (or ask him/her out)using PictoChat. Try making a cartoon strip in which every PictoChat frame is a new comic frame. (Get together with a friend for even more fun in the PictoChat sun!) Ever heard of a paper RPG? It's like a story except with lots of people writing it. (usually each person controls a separate character). If it works on paper, it'd definitely work on the DS! You could turn on your PictoChat in a place with lots of people (like a shopping center or park), and try to see if you can find anyone in any chat room.  You can also colour in the whole screen black, then make sure you post it, then simply keep bringing it down and drawing pictures by rubbing out sections with the rubber. ",
  "tyn_model":[
    "flip book",
    "rubber"
  ],
  "tyn_section":[

  ]
}