{
  "title":"How to Fold a Flag",
  "url":"https://www.wikihow.com/Fold-a-Flag",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Flags"
  ],
  "methods":[
    {
      "name":"Folding an American Flag",
      "steps":[
        {
          "headline":"Hold the flag waist-high.",
          "description":"Get the help of another person to hold and fold the flag. Both people should hold the flag waist-high so that flat face of the flag is parallel to the ground. Both people should hold the flag at the width ends (sides) rather than the length ends (top and bottom). The person holding the flag nearest the field of stars will remain still during the entire flag folding process. The individual holding the flag at the fully striped end will do the folding."
        },
        {
          "headline":"Fold the bottom over the field of stars.",
          "description":"Bring the bottom edge up so that it meets the top edge. Hold the edges by firmly holding down the top and bottom corners. The lower half of the striped section will be folded lengthwise over the field of stars."
        },
        {
          "headline":"Make another lengthwise fold.",
          "description":"The new bottom edge should be folded up to meet the new top edge, bringing the field of stars to the outside. The flag should now be folded in lengthwise quarters. The most recent open edge should be along the top and the most recent folded edge should be along the bottom."
        },
        {
          "headline":"Create a triangular fold at the corner of the flag.",
          "description":"Bring the bottom corner of the flag on the striped edge up so that it meets with the top edge of the flag. This should form a triangle of cloth with the striped running perpendicular to the stripes on the rest of the flag. The sides of the triangle should be evenly aligned to the sides of the flag, and there should be no overlapping material."
        },
        {
          "headline":"Fold the triangle inward along the entire length of the flag.",
          "description":"Fold the triangular tip into the rest of the flag so that it creates a flat edge again. Continue wrapping this triangular patch into the remainder of the flag until you fold the entire length into a triangle."
        },
        {
          "headline":"Note the appearance of the folded flag.",
          "description":"When finished, you should only see a triangular portion of the field of stars. None of the red and white stripes should be visible."
        }
      ]
    },
    {
      "name":"Folding a Canadian Flag Ceremoniously",
      "steps":[
        {
          "headline":"Get enough people.",
          "description":"A ceremonial flag folding should be performed with eight people. This method is not necessary for everyday folding of the Canadian flag. To fold the Canadian flag on an everyday basis, merely fold the flag with quiet dignity into a form that can be stored appropriately."
        },
        {
          "headline":"Hold the flag taut.",
          "description":"Persons 1, 3, 5, and 7 should grab the bottom edge of the flag at an equal distance apart from one another. Persons 2, 4, 6, and 8 should grab the top edge of the flag at equal distances from each other. The face of the flag should be parallel to the ground. The even numbered participants should face the odd numbered participants and vice versa."
        },
        {
          "headline":"Pass the sewn edge under and shift position.",
          "description":"The odd numbered participants holding the bottom of the flag should fold the flag under so that the bottom edge meets the top edge. Wait for the words \"Prepare to fold. Fold.\" Simultaneously, persons 2 and 8, or the two participants nearest to the top corners, should shift their hands toward the center outer edge and grab their respective corners. Persons 4 and 6 should remain still. The odd numbered participants should grab the folded edge of the flag so that it remains taut."
        },
        {
          "headline":"Fold the flag lengthwise once more.",
          "description":"Repeat the same procedure to fold the flag lengthwise into quarters. Wait for the words \"Prepare to fold. Fold.\" When done, the tip of the maple leaf should face up."
        },
        {
          "headline":"Fold up roughly one-third of the length.",
          "description":"Participants 7 and 8 should fold their end forward and up, bringing the edge to participants 5 and 6, respectively. Wait for the words \"Prepare to fold. Fold.\" Participants 3, 4, 5, and 6 should guide the flag so that it remains taut as it is folded. Once done, participants 7 and 8 step back."
        },
        {
          "headline":"Repeat the same fold twice over.",
          "description":"Participants 5 and 6 should fold their end forward and up, bringing the edge to participants 3 and 4. Once this is completed, persons 3 and 4 should fold their end up and forward, bringing the edge to participants 1 and 2. Both times you should wait for the command \"Prepare to fold. Fold.\" Keep the flag taut as you fold the flag. Each participant should step back and stand at attention after releasing the flag."
        },
        {
          "headline":"Make the final fold.",
          "description":"Participants 1 and 2 should fold the flag over to prepare it for its final presentation."
        }
      ]
    },
    {
      "name":"Method Three: Folding a British Flag for Breaking",
      "steps":[
        {
          "headline":"Hold the flag taut.",
          "description":"This can be done with as few as two people. One person should stand at one side, near the heading, while the other stands at the other side. The \"heading\" refers to the portion of the flag that connects to the pole. The face of the flag should be parallel to the ground."
        },
        {
          "headline":"Fold the flag in half lengthwise.",
          "description":"Both participants should fold the bottom edge of the flag under so that it meets with the top edge. The bottom and top edges should be evenly aligned. The center stripe extending from one side to the other should now be halved and at the new bottom, folded edge."
        },
        {
          "headline":"Fold the flag into quarters.",
          "description":"Make another lengthwise fold, bringing the new bottom edge up to meet the top edge of the flag. The edges should be evenly aligned. The half of the center stripe previously facing the ground should now face the top. This center stripe half should be the new top edge."
        },
        {
          "headline":"Bring up the bottom third of the length.",
          "description":"The person holding the side furthest from the heading should make a widthwise fold that shortens a third of the length. Fold the edge up and inward. Keep the flag taut as you fold."
        },
        {
          "headline":"Roll the remaining length up to the heading.",
          "description":"Starting from the newest folded edge, the person not holding the heading should roll up the flag until the entire remaining length is rolled. Roll tightly so that the flag will maintain its shape after tied and will not unravel or come undone as it sits."
        },
        {
          "headline":"Tie together with light cotton.",
          "description":"Tie a slip knot using light cotton twine to bind the folded and rolled flag together, keeping it in this form until you are ready for the breaking ceremony. During the breaking ceremony, the knot will be released and the flag will unfurl on its own."
        }
      ]
    },
    {
      "name":"Method Four: Folding an Australian Flag",
      "steps":[
        {
          "headline":"Hold the flag taut.",
          "description":"One person should hold the heading edge of the flag while a second person should hold the free side of the flag. The top and bottom do not need to be held. The bottom edge of the attached halyard, or rope, should face upward. The halyard should dangle down. The face of the flag should be held perpendicular to the ground."
        },
        {
          "headline":"Fold the flag lengthwise.",
          "description":"Bring the bottom edge up and over so that it meets with the top edge. The total width of the flag should be halved. The red and white \"Union Jack\" should face out."
        },
        {
          "headline":"Make another lengthwise fold.",
          "description":"Bring the new, folded bottom edge up and over so that it meets with the top edge. The total width should be quartered. The \"Union Jack\" should now be hidden by the new fold."
        },
        {
          "headline":"Bring the sides together.",
          "description":"Fold the side furthest from the halyard by bring it up and over, allowing it to meet the halyard edge of the flag. Make sure that the edges are evenly aligned."
        },
        {
          "headline":"Make an \"accordion\" fold along the length.",
          "description":"Bend a small square of the newly folded edge back so that it lies flush against the flag. Grab this new double-layer square and fold it forward, again bringing it flat against the flag. Continue folding backwards and forwards to the hoist edge, or the halyard, until the entire flag is compressed into an accordion fold."
        },
        {
          "headline":"Tie the bundled flag with the attached halyard.",
          "description":"Wind the halyard around the flag and tuck it under itself to keep the folded flag bound and secured."
        }
      ]
    }
  ],
  "text":" Folding an American Flag Hold the flag waist-high. Get the help of another person to hold and fold the flag. Both people should hold the flag waist-high so that flat face of the flag is parallel to the ground. Both people should hold the flag at the width ends (sides) rather than the length ends (top and bottom). The person holding the flag nearest the field of stars will remain still during the entire flag folding process. The individual holding the flag at the fully striped end will do the folding. Fold the bottom over the field of stars. Bring the bottom edge up so that it meets the top edge. Hold the edges by firmly holding down the top and bottom corners. The lower half of the striped section will be folded lengthwise over the field of stars. Make another lengthwise fold. The new bottom edge should be folded up to meet the new top edge, bringing the field of stars to the outside. The flag should now be folded in lengthwise quarters. The most recent open edge should be along the top and the most recent folded edge should be along the bottom. Create a triangular fold at the corner of the flag. Bring the bottom corner of the flag on the striped edge up so that it meets with the top edge of the flag. This should form a triangle of cloth with the striped running perpendicular to the stripes on the rest of the flag. The sides of the triangle should be evenly aligned to the sides of the flag, and there should be no overlapping material. Fold the triangle inward along the entire length of the flag. Fold the triangular tip into the rest of the flag so that it creates a flat edge again. Continue wrapping this triangular patch into the remainder of the flag until you fold the entire length into a triangle. Note the appearance of the folded flag. When finished, you should only see a triangular portion of the field of stars. None of the red and white stripes should be visible. Folding a Canadian Flag Ceremoniously Get enough people. A ceremonial flag folding should be performed with eight people. This method is not necessary for everyday folding of the Canadian flag. To fold the Canadian flag on an everyday basis, merely fold the flag with quiet dignity into a form that can be stored appropriately. Hold the flag taut. Persons 1, 3, 5, and 7 should grab the bottom edge of the flag at an equal distance apart from one another. Persons 2, 4, 6, and 8 should grab the top edge of the flag at equal distances from each other. The face of the flag should be parallel to the ground. The even numbered participants should face the odd numbered participants and vice versa. Pass the sewn edge under and shift position. The odd numbered participants holding the bottom of the flag should fold the flag under so that the bottom edge meets the top edge. Wait for the words \"Prepare to fold. Fold.\" Simultaneously, persons 2 and 8, or the two participants nearest to the top corners, should shift their hands toward the center outer edge and grab their respective corners. Persons 4 and 6 should remain still. The odd numbered participants should grab the folded edge of the flag so that it remains taut. Fold the flag lengthwise once more. Repeat the same procedure to fold the flag lengthwise into quarters. Wait for the words \"Prepare to fold. Fold.\" When done, the tip of the maple leaf should face up. Fold up roughly one-third of the length. Participants 7 and 8 should fold their end forward and up, bringing the edge to participants 5 and 6, respectively. Wait for the words \"Prepare to fold. Fold.\" Participants 3, 4, 5, and 6 should guide the flag so that it remains taut as it is folded. Once done, participants 7 and 8 step back. Repeat the same fold twice over. Participants 5 and 6 should fold their end forward and up, bringing the edge to participants 3 and 4. Once this is completed, persons 3 and 4 should fold their end up and forward, bringing the edge to participants 1 and 2. Both times you should wait for the command \"Prepare to fold. Fold.\" Keep the flag taut as you fold the flag. Each participant should step back and stand at attention after releasing the flag. Make the final fold. Participants 1 and 2 should fold the flag over to prepare it for its final presentation. Method Three: Folding a British Flag for Breaking Hold the flag taut. This can be done with as few as two people. One person should stand at one side, near the heading, while the other stands at the other side. The \"heading\" refers to the portion of the flag that connects to the pole. The face of the flag should be parallel to the ground. Fold the flag in half lengthwise. Both participants should fold the bottom edge of the flag under so that it meets with the top edge. The bottom and top edges should be evenly aligned. The center stripe extending from one side to the other should now be halved and at the new bottom, folded edge. Fold the flag into quarters. Make another lengthwise fold, bringing the new bottom edge up to meet the top edge of the flag. The edges should be evenly aligned. The half of the center stripe previously facing the ground should now face the top. This center stripe half should be the new top edge. Bring up the bottom third of the length. The person holding the side furthest from the heading should make a widthwise fold that shortens a third of the length. Fold the edge up and inward. Keep the flag taut as you fold. Roll the remaining length up to the heading. Starting from the newest folded edge, the person not holding the heading should roll up the flag until the entire remaining length is rolled. Roll tightly so that the flag will maintain its shape after tied and will not unravel or come undone as it sits. Tie together with light cotton. Tie a slip knot using light cotton twine to bind the folded and rolled flag together, keeping it in this form until you are ready for the breaking ceremony. During the breaking ceremony, the knot will be released and the flag will unfurl on its own. Method Four: Folding an Australian Flag Hold the flag taut. One person should hold the heading edge of the flag while a second person should hold the free side of the flag. The top and bottom do not need to be held. The bottom edge of the attached halyard, or rope, should face upward. The halyard should dangle down. The face of the flag should be held perpendicular to the ground. Fold the flag lengthwise. Bring the bottom edge up and over so that it meets with the top edge. The total width of the flag should be halved. The red and white \"Union Jack\" should face out. Make another lengthwise fold. Bring the new, folded bottom edge up and over so that it meets with the top edge. The total width should be quartered. The \"Union Jack\" should now be hidden by the new fold. Bring the sides together. Fold the side furthest from the halyard by bring it up and over, allowing it to meet the halyard edge of the flag. Make sure that the edges are evenly aligned. Make an \"accordion\" fold along the length. Bend a small square of the newly folded edge back so that it lies flush against the flag. Grab this new double-layer square and fold it forward, again bringing it flat against the flag. Continue folding backwards and forwards to the hoist edge, or the halyard, until the entire flag is compressed into an accordion fold. Tie the bundled flag with the attached halyard. Wind the halyard around the flag and tuck it under itself to keep the folded flag bound and secured.",
  "tyn_model":[
    "flag",
    "canadian flag",
    "halyard",
    "union jack",
    "american flag",
    "cloth",
    "maple",
    "british flag",
    "cotton",
    "light cotton twine",
    "australian flag",
    "rope",
    "accordion fold"
  ],
  "tyn_section":[

  ]
}