{
  "title":"How to Create Your Own Kitchen Utensils Holder",
  "url":"https://www.wikihow.com/Create-Your-Own-Kitchen-Utensils-Holder",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking Equipment",
    "Kitchen Utensils"
  ],
  "steps":[
    {
      "headline":"Use a jug.",
      "description":"The more \"Provençale\" or rustic, the better. This works really well in an old country kitchen."
    },
    {
      "headline":"Use a wooden wine box.",
      "description":"After consuming the wine, tip up the crate and seal along the open side, using either small nails or wood glue. If there is a design, logo or brand name on the side, make sure to display this side outwards in your kitchen."
    },
    {
      "headline":"Try a corn/asparagus saucepan.",
      "description":"These are saucepans that stand tall and are fairly narrow but wide enough for a set of utensils. This would work in both a rustic/country style kitchen and a more modern style of kitchen."
    },
    {
      "headline":"Use a wine cooler.",
      "description":"These have many different designs on them and they are usually made of terracotta. They are very affordable and would suit many kitchen styles."
    },
    {
      "headline":"Have your children make a papier mâché container.",
      "description":"Ask them to paint it and write their names on it. Coat with a waterproof varnish to protect the container. This will remind you of their dedication and artistry for years to come. If there is any risk of water seeping underneath this container, set it up on small trivet to protect it. These can be obtained from dollar stores easily."
    },
    {
      "headline":"Try an old candy/sweets, sugar or flour jar.",
      "description":"These are old glass jars that sometimes have a lid. You will most likely find these in an antiques store or a secondhand housewares store. The styles and types will vary depending on where you are located in the world."
    },
    {
      "headline":"Rescue an old beer stein.",
      "description":"For those who enjoy beer, this can make a great conversation piece. Many steins have fascinating scenes on them that can brighten up the kitchen. Select the larger size in order to accommodate the longer length of kitchen utensils."
    },
    {
      "headline":"Use a steel milkshake container.",
      "description":"You should be able to pick these up in used goods stores and kitchen stores. Older ones will be scuffed and will have rustic appeal. Newer ones will be shiny and will be more suitable for modern kitchens."
    },
    {
      "headline":"Use old or unusual vases.",
      "description":"This is especially good when you find the vase too heavy to cart around filled with water and flowers. It is also nicer to keep lovely old heirloom vases on display rather than shut away most times in the cupboard."
    }
  ],
  "text":" Use a jug. The more \"Provençale\" or rustic, the better. This works really well in an old country kitchen. Use a wooden wine box. After consuming the wine, tip up the crate and seal along the open side, using either small nails or wood glue. If there is a design, logo or brand name on the side, make sure to display this side outwards in your kitchen. Try a corn/asparagus saucepan. These are saucepans that stand tall and are fairly narrow but wide enough for a set of utensils. This would work in both a rustic/country style kitchen and a more modern style of kitchen. Use a wine cooler. These have many different designs on them and they are usually made of terracotta. They are very affordable and would suit many kitchen styles. Have your children make a papier mâché container. Ask them to paint it and write their names on it. Coat with a waterproof varnish to protect the container. This will remind you of their dedication and artistry for years to come. If there is any risk of water seeping underneath this container, set it up on small trivet to protect it. These can be obtained from dollar stores easily. Try an old candy/sweets, sugar or flour jar. These are old glass jars that sometimes have a lid. You will most likely find these in an antiques store or a secondhand housewares store. The styles and types will vary depending on where you are located in the world. Rescue an old beer stein. For those who enjoy beer, this can make a great conversation piece. Many steins have fascinating scenes on them that can brighten up the kitchen. Select the larger size in order to accommodate the longer length of kitchen utensils. Use a steel milkshake container. You should be able to pick these up in used goods stores and kitchen stores. Older ones will be scuffed and will have rustic appeal. Newer ones will be shiny and will be more suitable for modern kitchens. Use old or unusual vases. This is especially good when you find the vase too heavy to cart around filled with water and flowers. It is also nicer to keep lovely old heirloom vases on display rather than shut away most times in the cupboard.",
  "tyn_model":[
    "vases",
    "jug",
    "wine box",
    "wood glue",
    "saucepan",
    "saucepans",
    "wine cooler",
    "papier mâché container",
    "waterproof varnish",
    "steins",
    "used goods stores",
    "vase",
    "water",
    "flowers"
  ],
  "tyn_section":[

  ]
}