{
  "title":"How to Draw a Cat",
  "url":"https://www.wikihow.com/Draw-a-Cat",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "methods":[
    {
      "name":"Side View Standing Cat",
      "steps":[
        {
          "headline":"Sketch the main shapes.",
          "description":"Sketch a circle for the head. The body is a rectangle with a curved line at the end near to the head. A big fat oblong is drawn for the thigh area."
        },
        {
          "headline":"Sketch the basic feature of the face.",
          "description":"Add the mouth area, ears and face guidelines. Try to make the muzzle short and squarish."
        },
        {
          "headline":"Add more features of the head.",
          "description":"Add the eyes and make sure they are at the cross-section of the face’s guidelines. Now add the nose."
        },
        {
          "headline":"Sketch oblongs and circles for the thighs, legs and paws.",
          "description":"Add also the tail."
        },
        {
          "headline":"Draw the main features of the cat.",
          "description":"Use lines to indicate a pattern in the cat’s fur."
        },
        {
          "headline":"Erase the draft lines and add more details.",
          "description":""
        },
        {
          "headline":"Color the finished cat.",
          "description":"Use colored pencils, crayons, markers or watercolors"
        }
      ]
    },
    {
      "name":"Cartoon Cat",
      "steps":[
        {
          "headline":"Draw an outline of the head and body.",
          "description":"Use a circle for the head. Add a crossed vertical and horizontal line at the center of the head. Add a big oblong shape for the cat’s body."
        },
        {
          "headline":"Add the eyes using two small circles, sketch the nose and mouth.",
          "description":"Sketch two half almond shapes protruding on each side of the head."
        },
        {
          "headline":"Sketch an outline of the cat’s limbs.",
          "description":"Make the hind leg circular."
        },
        {
          "headline":"Sketch the tail, make it long and curved.",
          "description":""
        },
        {
          "headline":"Darken the eyes and add whiskers.",
          "description":"You can also add a collar on the neck."
        },
        {
          "headline":"Sketch the body and add a few furry details.",
          "description":""
        },
        {
          "headline":"Color and complete.",
          "description":""
        }
      ]
    },
    {
      "name":"Resting Cat",
      "steps":[
        {
          "headline":"Sketch a circle and an oblong.",
          "description":"These will serve as the guide for the head and the body."
        },
        {
          "headline":"Add the guidelines for the face.",
          "description":"Add the nose area, guidelines for the face, and the ears."
        },
        {
          "headline":"Sketch circles and oblongs for the thighs, the legs, and the paws.",
          "description":"There is 3 oblongs used in the picture for each leg."
        },
        {
          "headline":"Add the guide for the face.",
          "description":""
        },
        {
          "headline":"Draw the main features of the cat.",
          "description":"Use irregular lines to indicate the fur."
        },
        {
          "headline":"Erase the draft lines and add more details.",
          "description":"You can add more details like whisker and fur."
        },
        {
          "headline":"Color and Complete",
          "description":""
        }
      ]
    },
    {
      "name":"Realistic Cat",
      "steps":[
        {
          "headline":"Draw an outline of the body.",
          "description":"Sketch a circle for the head and add two crossed lines at the center. Use a much bigger circle for the body and a curved line attached to it on the back."
        },
        {
          "headline":"Sketch the outline of the face.",
          "description":"Make the cheeks appear plumped and the ears pointy and protruding on each side of the head."
        },
        {
          "headline":"Add two small oblongs on the lower part of the head, add a curved line connected to these circles.",
          "description":"This will be your guide in drawing the nose and the mouth. Draw another pair of two small oblongs at the bottom of the body’s outline and add a long rectangle shape on one side."
        },
        {
          "headline":"Draw details of the face.",
          "description":"Make the eyes almond shaped, draw the nose and in framing the face, draw small strokes to make the cat appear furry."
        },
        {
          "headline":"Add the cat’s whiskers and brows using longer strokes.",
          "description":""
        },
        {
          "headline":"Sketch the limbs, tail, and nails.",
          "description":"Remember to use small strokes to make it appear furry."
        },
        {
          "headline":"Sketch the rest of the body with small strokes.",
          "description":""
        },
        {
          "headline":"Erase unnecessary lines and color the drawing.",
          "description":""
        }
      ]
    }
  ],
  "text":" Side View Standing Cat Sketch the main shapes. Sketch a circle for the head. The body is a rectangle with a curved line at the end near to the head. A big fat oblong is drawn for the thigh area. Sketch the basic feature of the face. Add the mouth area, ears and face guidelines. Try to make the muzzle short and squarish. Add more features of the head. Add the eyes and make sure they are at the cross-section of the face’s guidelines. Now add the nose. Sketch oblongs and circles for the thighs, legs and paws. Add also the tail. Draw the main features of the cat. Use lines to indicate a pattern in the cat’s fur. Erase the draft lines and add more details.  Color the finished cat. Use colored pencils, crayons, markers or watercolors Cartoon Cat Draw an outline of the head and body. Use a circle for the head. Add a crossed vertical and horizontal line at the center of the head. Add a big oblong shape for the cat’s body. Add the eyes using two small circles, sketch the nose and mouth. Sketch two half almond shapes protruding on each side of the head. Sketch an outline of the cat’s limbs. Make the hind leg circular. Sketch the tail, make it long and curved.  Darken the eyes and add whiskers. You can also add a collar on the neck. Sketch the body and add a few furry details.  Color and complete.  Resting Cat Sketch a circle and an oblong. These will serve as the guide for the head and the body. Add the guidelines for the face. Add the nose area, guidelines for the face, and the ears. Sketch circles and oblongs for the thighs, the legs, and the paws. There is 3 oblongs used in the picture for each leg. Add the guide for the face.  Draw the main features of the cat. Use irregular lines to indicate the fur. Erase the draft lines and add more details. You can add more details like whisker and fur. Color and Complete  Realistic Cat Draw an outline of the body. Sketch a circle for the head and add two crossed lines at the center. Use a much bigger circle for the body and a curved line attached to it on the back. Sketch the outline of the face. Make the cheeks appear plumped and the ears pointy and protruding on each side of the head. Add two small oblongs on the lower part of the head, add a curved line connected to these circles. This will be your guide in drawing the nose and the mouth. Draw another pair of two small oblongs at the bottom of the body’s outline and add a long rectangle shape on one side. Draw details of the face. Make the eyes almond shaped, draw the nose and in framing the face, draw small strokes to make the cat appear furry. Add the cat’s whiskers and brows using longer strokes.  Sketch the limbs, tail, and nails. Remember to use small strokes to make it appear furry. Sketch the rest of the body with small strokes.  Erase unnecessary lines and color the drawing. ",
  "tyn_model":[
    "cat",
    "colored pencils",
    "crayons",
    "markers",
    "watercolors",
    "oblong",
    "fur"
  ],
  "tyn_section":[

  ]
}