{
  "title":"How to Make Pecan Shortbread",
  "url":"https://www.wikihow.com/Make-Pecan-Shortbread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Butter Cookies and Biscuits"
  ],
  "steps":[
    {
      "headline":"Allow the butter to soften at room temperature.",
      "description":""
    },
    {
      "headline":"Combine butter and sugar.",
      "description":"Cream together (use an electric beater if you have one). Continue to beat until light and fluffy."
    },
    {
      "headline":"Add the vanilla and mix in well.",
      "description":""
    },
    {
      "headline":"Sift the flours.",
      "description":""
    },
    {
      "headline":"Fold the flours into the beaten mixture.",
      "description":"Do this gradually - if you try to add it all at once, it will become lumpy."
    },
    {
      "headline":"Continue mixing and add in the pecans.",
      "description":""
    },
    {
      "headline":"Tear off two large pieces of plastic wrap and lay these down on a clean bench.",
      "description":""
    },
    {
      "headline":"Divide the mixture in two and place each half on one sheet of plastic.",
      "description":""
    },
    {
      "headline":"Roll the dough into log shapes, approximately 20 centimeter (7.9 in) x 7 centimeter (2.8 in) / 7.8\" x 2.8\" length and diameter.",
      "description":"Wrap each log in the plastic film and place in the refrigerator. Refrigerate for half an hour."
    },
    {
      "headline":"Preheat the oven to 150ºC/300ºF/Gas mark 2.",
      "description":""
    },
    {
      "headline":"Line the baking trays/cookie sheets with baking paper if they are not non-stick.",
      "description":""
    },
    {
      "headline":"Slice the dough into 1 centimeter (0.4 in) / 1/4\" slices.",
      "description":""
    },
    {
      "headline":"Put each slice onto the trays, with an even distance between them.",
      "description":""
    },
    {
      "headline":"Place in the oven and cook for about 30 - 40 minutes.",
      "description":"Keep an eye on them and remove them earlier if they appear to be browning sooner. The shortbread should be firm and not browned."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Allow the butter to soften at room temperature.  Combine butter and sugar. Cream together (use an electric beater if you have one). Continue to beat until light and fluffy. Add the vanilla and mix in well.  Sift the flours.  Fold the flours into the beaten mixture. Do this gradually - if you try to add it all at once, it will become lumpy. Continue mixing and add in the pecans.  Tear off two large pieces of plastic wrap and lay these down on a clean bench.  Divide the mixture in two and place each half on one sheet of plastic.  Roll the dough into log shapes, approximately 20 centimeter (7.9 in) x 7 centimeter (2.8 in) / 7.8\" x 2.8\" length and diameter. Wrap each log in the plastic film and place in the refrigerator. Refrigerate for half an hour. Preheat the oven to 150ºC/300ºF/Gas mark 2.  Line the baking trays/cookie sheets with baking paper if they are not non-stick.  Slice the dough into 1 centimeter (0.4 in) / 1/4\" slices.  Put each slice onto the trays, with an even distance between them.  Place in the oven and cook for about 30 - 40 minutes. Keep an eye on them and remove them earlier if they appear to be browning sooner. The shortbread should be firm and not browned. Finished. ",
  "tyn_model":[
    "butter",
    "oven",
    "sugar",
    "electric beater",
    "vanilla",
    "flours",
    "pecans",
    "plastic wrap",
    "plastic",
    "plastic film",
    "refrigerator",
    "baking trays",
    "cookie sheets",
    "baking paper",
    "shortbread"
  ],
  "tyn_section":[

  ]
}