{
  "title":"How to Have a Celeb Style Birthday Party",
  "url":"https://www.wikihow.com/Have-a-Celeb-Style-Birthday-Party",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Theme Parties"
  ],
  "steps":[
    {
      "headline":"Have a limo pick up all of your friends so you can all go shopping immediately.",
      "description":"Go to the mall and give each of your friends money to shop with. Buy clothes that look the same, but are different colors. Buy cute accessories and shoes too."
    },
    {
      "headline":"While at the mall, go to a cosmetic store such as Merle Norman and get free makeovers (you have to buy something like eyeshadow afterwards).",
      "description":""
    },
    {
      "headline":"After shopping, take a nice ride home in the limo, read magazines, and do prank phone calls (always use *67 so your call will be private!",
      "description":")."
    },
    {
      "headline":"When arriving home, have it set up where somebody is there to take pics right when you step out of the limo.",
      "description":""
    },
    {
      "headline":"Give your friends each a copy of everyone's pic in a photo album titled: ~Your Name~ B-Day '08 - or whatever year you do it in.",
      "description":""
    },
    {
      "headline":"Go up to your room and do nails and listen to CDs!",
      "description":""
    },
    {
      "headline":"When dinner is ready, go to the formal dining room to eat a gourmet dinner or whatever your parents made.",
      "description":"Eat on the fine china and drink fancy drinks out of your fanciest champagne or wine glasses. For dessert eat something healthy like a variety of unusual fruit."
    },
    {
      "headline":"After dinner, go back upstairs and change into your cutest pajamas and have a fashion show!",
      "description":"Play music in the background and have each girl walk down the runway/hallway and have two girls (or just use your parents) to judge them by holding up cards with the numbers 1-10 written on them. Take turns and at the end vote on who was the best! The winner gets to sleep in the bed or pick the movie you watch first (you can have more than one winner if you want)."
    },
    {
      "headline":"Then, go Slumber Surfing!",
      "description":"!You do this by getting in your sleeping bags and sliding face first down the stairs (if your stairs aren't carpeted then don't do this!)"
    },
    {
      "headline":"After that make fake margaritas (search how to make Cute, Flavorful, Fake Margaritas), smoothies, or Spa Cucumber Water (search how to make Spa Cucumber Water).",
      "description":""
    },
    {
      "headline":"Make popcorn and snack mix by mixing in marshmallows and chocolate chips.",
      "description":"Watch movies until midnight."
    },
    {
      "headline":"Do spa treatments before you go to bed so you'll sleep better.",
      "description":""
    },
    {
      "headline":"Tell scary/funny stories and listen to music.",
      "description":"After brushing your teeth, washing your face etc., decide if everyone will sleep in your room or the guest room (or both),or you could have a camp-out in the living room."
    },
    {
      "headline":"The next day eat a nice filling breakfast like English muffins with jelly or vanilla pancakes with lots of fruit and creamy milk.",
      "description":""
    },
    {
      "headline":"Spend all day swimming, watching TV, or doing each other's hair!",
      "description":"Just do something fun!"
    }
  ],
  "text":" Have a limo pick up all of your friends so you can all go shopping immediately. Go to the mall and give each of your friends money to shop with. Buy clothes that look the same, but are different colors. Buy cute accessories and shoes too. While at the mall, go to a cosmetic store such as Merle Norman and get free makeovers (you have to buy something like eyeshadow afterwards).  After shopping, take a nice ride home in the limo, read magazines, and do prank phone calls (always use *67 so your call will be private! ). When arriving home, have it set up where somebody is there to take pics right when you step out of the limo.  Give your friends each a copy of everyone's pic in a photo album titled: ~Your Name~ B-Day '08 - or whatever year you do it in.  Go up to your room and do nails and listen to CDs!  When dinner is ready, go to the formal dining room to eat a gourmet dinner or whatever your parents made. Eat on the fine china and drink fancy drinks out of your fanciest champagne or wine glasses. For dessert eat something healthy like a variety of unusual fruit. After dinner, go back upstairs and change into your cutest pajamas and have a fashion show! Play music in the background and have each girl walk down the runway/hallway and have two girls (or just use your parents) to judge them by holding up cards with the numbers 1-10 written on them. Take turns and at the end vote on who was the best! The winner gets to sleep in the bed or pick the movie you watch first (you can have more than one winner if you want). Then, go Slumber Surfing! !You do this by getting in your sleeping bags and sliding face first down the stairs (if your stairs aren't carpeted then don't do this!) After that make fake margaritas (search how to make Cute, Flavorful, Fake Margaritas), smoothies, or Spa Cucumber Water (search how to make Spa Cucumber Water).  Make popcorn and snack mix by mixing in marshmallows and chocolate chips. Watch movies until midnight. Do spa treatments before you go to bed so you'll sleep better.  Tell scary/funny stories and listen to music. After brushing your teeth, washing your face etc., decide if everyone will sleep in your room or the guest room (or both),or you could have a camp-out in the living room. The next day eat a nice filling breakfast like English muffins with jelly or vanilla pancakes with lots of fruit and creamy milk.  Spend all day swimming, watching TV, or doing each other's hair! Just do something fun!",
  "tyn_model":[
    "spa cucumber water",
    "photo album",
    "cards",
    "popcorn",
    "chocolate chips",
    "english muffins"
  ],
  "tyn_section":[

  ]
}