{
  "title":"How to Turn Construction Paper Into Colored Normal Paper",
  "url":"https://www.wikihow.com/Turn-Construction-Paper-Into-Colored-Normal-Paper",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Papermaking"
  ],
  "steps":[
    {
      "headline":"Grab any piece of construction paper, depending on the color you want the normal paper to be.",
      "description":"Fold it up and crumple it in a messy manner, but don't rip it. When you find your paper covered in fold marks, you are ready for step two. The reason you have to crumple it up is because it is easier to manage it."
    },
    {
      "headline":"Crumple up your construction paper and keep it under running water, completely wet, for at least 5 seconds.",
      "description":"Then, using extreme carefulness, squeeze out excess water and uncrumple the paper. The crumpling now not only makes it easier to manage but it also prevents the running water from pushing a hole through the paper. Blow on the paper just a little bit."
    },
    {
      "headline":"Pick up something flat, such as a book, that is big enough to cover the entire paper.",
      "description":"Place it so it completely covers the paper and sit on the object. Also, make sure you execute this action on a flat surface, otherwise the finished product will be uneven. Repeat with the other side. Continue doing this until the paper is noticeably at least a little drier and very flat. Do not continue because you see fold marks-they should be there, but if they are so deep that the paper looks kind of messy, do continue."
    },
    {
      "headline":"Fan over the paper for at least 30 seconds on both sides.",
      "description":""
    },
    {
      "headline":"Take the object you used in step three.",
      "description":"Put it over the paper so that a bit of the top shows, then carefully press down and slide slowly across a small table. You will probably need to place the object back in its original position to continue and prevent ripping. It is not necessary to repeat with the other side. However, you may do so if you wish."
    },
    {
      "headline":"Execute step four.",
      "description":""
    },
    {
      "headline":"Execute step three.",
      "description":""
    },
    {
      "headline":"Cut in front of big rips that are on edges if necessary.",
      "description":"If you do this, cut the whole edge."
    },
    {
      "headline":"Let the paper sit for around an hour or so.",
      "description":"It should be cold but crinkly dry. Your finished product should look and feel like fold-marked, colored normal paper!"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Grab any piece of construction paper, depending on the color you want the normal paper to be. Fold it up and crumple it in a messy manner, but don't rip it. When you find your paper covered in fold marks, you are ready for step two. The reason you have to crumple it up is because it is easier to manage it. Crumple up your construction paper and keep it under running water, completely wet, for at least 5 seconds. Then, using extreme carefulness, squeeze out excess water and uncrumple the paper. The crumpling now not only makes it easier to manage but it also prevents the running water from pushing a hole through the paper. Blow on the paper just a little bit. Pick up something flat, such as a book, that is big enough to cover the entire paper. Place it so it completely covers the paper and sit on the object. Also, make sure you execute this action on a flat surface, otherwise the finished product will be uneven. Repeat with the other side. Continue doing this until the paper is noticeably at least a little drier and very flat. Do not continue because you see fold marks-they should be there, but if they are so deep that the paper looks kind of messy, do continue. Fan over the paper for at least 30 seconds on both sides.  Take the object you used in step three. Put it over the paper so that a bit of the top shows, then carefully press down and slide slowly across a small table. You will probably need to place the object back in its original position to continue and prevent ripping. It is not necessary to repeat with the other side. However, you may do so if you wish. Execute step four.  Execute step three.  Cut in front of big rips that are on edges if necessary. If you do this, cut the whole edge. Let the paper sit for around an hour or so. It should be cold but crinkly dry. Your finished product should look and feel like fold-marked, colored normal paper! Finished. ",
  "tyn_model":[
    "paper",
    "water",
    "construction paper",
    "book",
    "normal paper"
  ],
  "tyn_section":[

  ]
}