{
  "title":"How to Make a Hat with a Knitting Loom",
  "url":"https://www.wikihow.com/Make-a-Hat-with-a-Knitting-Loom",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Knitting and Crochet",
    "Knitting",
    "Knitting Techniques",
    "Loom Knitting"
  ],
  "methods":[
    {
      "name":"Loom Hat",
      "steps":[
        {
          "headline":"Make a slip knot.",
          "description":"Tie the knot around the third to the last peg of the loom."
        },
        {
          "headline":"Wrap the yarn around the peg to the left of the first peg, starting at the back, around the front, and to the back again.",
          "description":""
        },
        {
          "headline":"Continue wrapping each peg to the left, just as in the previous step.",
          "description":""
        },
        {
          "headline":"Push all the loops down to the base of the loom, so they sit at the bottom of the pegs.",
          "description":""
        },
        {
          "headline":"Wrap each peg again, starting with the first peg, then moving left.",
          "description":"When you're done, you will have 2 loops on each peg."
        },
        {
          "headline":"Take the hook and pull the bottom loop over the top and off of the peg.",
          "description":"Do this to all of the pegs. As you pull the yarn up and over, slide the loop that remains back down to the base of the peg."
        },
        {
          "headline":"Continue making loops and pulling the existing ones over the new loops (repeating the previous two steps).",
          "description":"Each time, you make a row of knitting for the hat. The knitting will hang down the middle of the loom. The bottom row is your first row of knitting."
        },
        {
          "headline":"When the knitting is at least 3\" (7.5 cm) long, make the brim of the hat.",
          "description":"This step is optional, but it gives the hat a nice finished look. The brim will be half as long as your knitting to this point and will be a double thickness of knitting. Reach through the middle and bring the very first row of knitting up and onto the pegs, essentially \"folding\" a brim. There will be two strands between stitches. These are the two strands you want to place on the peg. Repeat for all the stitches. Use the hook to pull the bottom loop up over the top two strands. Repeat for all pegs. After forming the brim, continue knitting the rest of the hat as above. The first row after the brim bring both strands up and over the new loop for every peg."
        },
        {
          "headline":"When the knitting is long enough for a hat (about 8\" or 20cm for an adult hat, 6-7\" or 15-18cm for a child hat) cut the yarn, leaving about 2 feet (60cm) of yarn to work with.",
          "description":""
        },
        {
          "headline":"Thread the yarn tail through a blunt needle.",
          "description":""
        },
        {
          "headline":"Take the loop off the first peg and thread the yarn through it.",
          "description":""
        },
        {
          "headline":"Move to the left.",
          "description":"Repeat for the remaining pegs."
        },
        {
          "headline":"Pull the yarn tight.",
          "description":"Push the needle through the top center. Turn hat inside out. On the inside top of the hat, make a few stitches, then secure the loose end with a knot. Then cut the tail."
        },
        {
          "headline":"Sew a pom pom to the top.",
          "description":""
        }
      ]
    },
    {
      "name":"Rainbow Effect Loom Hat",
      "steps":[
        {
          "headline":"Tie the first color to first peg (or side peg if your loom has one) with a slipknot.",
          "description":""
        },
        {
          "headline":"Wrap the yarn from the back around the next peg.",
          "description":""
        },
        {
          "headline":"Repeat step 2 until you get all the way around.",
          "description":""
        },
        {
          "headline":"Repeat step 2 all the way around again above the round that you just completed.",
          "description":""
        },
        {
          "headline":"Hook the bottom loop and pull it over the top loop and off of the peg.",
          "description":""
        },
        {
          "headline":"Push the top loops down.",
          "description":""
        },
        {
          "headline":"Repeat steps 4, 5, and 6 until you have the desired length.",
          "description":""
        },
        {
          "headline":"To change colors, tie off the yarn by tying it around the last loop that has already been knotted in its column.",
          "description":"Or, tie the end to the new yarn's end and continue looping."
        },
        {
          "headline":"To finish off, thread through a yarn needle and take the first loop off the peg.",
          "description":"Thread the yarn and needle through the loop that you took off."
        },
        {
          "headline":"Repeat for the next peg to the left, and so on.",
          "description":""
        }
      ]
    }
  ],
  "text":" Loom Hat Make a slip knot. Tie the knot around the third to the last peg of the loom. Wrap the yarn around the peg to the left of the first peg, starting at the back, around the front, and to the back again.  Continue wrapping each peg to the left, just as in the previous step.  Push all the loops down to the base of the loom, so they sit at the bottom of the pegs.  Wrap each peg again, starting with the first peg, then moving left. When you're done, you will have 2 loops on each peg. Take the hook and pull the bottom loop over the top and off of the peg. Do this to all of the pegs. As you pull the yarn up and over, slide the loop that remains back down to the base of the peg. Continue making loops and pulling the existing ones over the new loops (repeating the previous two steps). Each time, you make a row of knitting for the hat. The knitting will hang down the middle of the loom. The bottom row is your first row of knitting. When the knitting is at least 3\" (7.5 cm) long, make the brim of the hat. This step is optional, but it gives the hat a nice finished look. The brim will be half as long as your knitting to this point and will be a double thickness of knitting. Reach through the middle and bring the very first row of knitting up and onto the pegs, essentially \"folding\" a brim. There will be two strands between stitches. These are the two strands you want to place on the peg. Repeat for all the stitches. Use the hook to pull the bottom loop up over the top two strands. Repeat for all pegs. After forming the brim, continue knitting the rest of the hat as above. The first row after the brim bring both strands up and over the new loop for every peg. When the knitting is long enough for a hat (about 8\" or 20cm for an adult hat, 6-7\" or 15-18cm for a child hat) cut the yarn, leaving about 2 feet (60cm) of yarn to work with.  Thread the yarn tail through a blunt needle.  Take the loop off the first peg and thread the yarn through it.  Move to the left. Repeat for the remaining pegs. Pull the yarn tight. Push the needle through the top center. Turn hat inside out. On the inside top of the hat, make a few stitches, then secure the loose end with a knot. Then cut the tail. Sew a pom pom to the top.  Rainbow Effect Loom Hat Tie the first color to first peg (or side peg if your loom has one) with a slipknot.  Wrap the yarn from the back around the next peg.  Repeat step 2 until you get all the way around.  Repeat step 2 all the way around again above the round that you just completed.  Hook the bottom loop and pull it over the top loop and off of the peg.  Push the top loops down.  Repeat steps 4, 5, and 6 until you have the desired length.  To change colors, tie off the yarn by tying it around the last loop that has already been knotted in its column. Or, tie the end to the new yarn's end and continue looping. To finish off, thread through a yarn needle and take the first loop off the peg. Thread the yarn and needle through the loop that you took off. Repeat for the next peg to the left, and so on. ",
  "tyn_model":[
    "yarn",
    "loom",
    "knitting",
    "hat",
    "thread",
    "needle",
    "loom hat",
    "pom pom",
    "rainbow effect loom hat",
    "slipknot",
    "yarn needle"
  ],
  "tyn_section":[

  ]
}