{
  "title":"How to Make a Bottle Cap Table with Resin Surface",
  "url":"https://www.wikihow.com/Make-a-Bottle-Cap-Table-with-Resin-Surface",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture"
  ],
  "methods":[
    {
      "name":"Assemble Supplies",
      "steps":[
        {
          "headline":"Assess your collection.",
          "description":"For full coverage, you will most likely need a vast collection that that will provide full coverage. When using bottle caps look for caps that are not rusted and still in decent shape. Consider only using bottle caps that hold meaning or significance to you--or just look really cool."
        },
        {
          "headline":"Find the right table.",
          "description":"Depending upon your collection you may be either looking for a table that can simply display your collection or you may be looking for pure decorative function and plan to cover a piece of necessary furniture. Either way, your collection must be able to completely cover the table top."
        },
        {
          "headline":"Purchase glue to hold bottle caps or your collection in place.",
          "description":"Liquid Nails or Super Glue work well or you could use contact cement for a very permanent solution."
        },
        {
          "headline":"Assemble supplies that will help you build a barrier around the perimeter of your table.",
          "description":"When you pour the resin, you don’t want it to run off the sides of the table so building a barrier is imperative. Barrier materials can include heavy cardboard, aluminum foil, duct tape and/or any other material that will help you keep the resin on the table and off the floor. Also, locating an exacto knife or box cutter will help you trim away the barrier once the resin has dried."
        },
        {
          "headline":"Purchase resin.",
          "description":"Most hardware or home improvement stores will carry pourable resin. Look for something with high gloss in order to give the table that polished finish."
        }
      ]
    },
    {
      "name":"Create the Table",
      "steps":[
        {
          "headline":"Lay out collection on clean tabletop surface.",
          "description":"Make sure the table is free of debris, dust or dirt before beginning the project. Lay out bottle caps or your collection so you can determine if you like the design."
        },
        {
          "headline":"Glue bottle caps and/or your collection in place.",
          "description":"Once you are happy with the design, glue the caps in place so they won’t move when you pour the resin. Allow ample dry time before proceeding to the next step."
        },
        {
          "headline":"Build a barrier around the perimeter of the table.",
          "description":"Secure the base of the barrier with duct tape and/or painter’s tape. You don’t want any gaps so the resin could drip out. Make sure the barrier is high enough around the sides to hold the poured resin."
        },
        {
          "headline":"Mix and pour resin.",
          "description":"Follow the instructions on the resin box for mixing and then slowly pour over the tabletop. If the resin is not getting between the bottle cap gaps, use a knife to gently spread it over the tops and in between the gaps. Allow the resin to set and dry for up to eight hours (or according to the resin box directions)."
        },
        {
          "headline":"Remove barrier and tape using your knife.",
          "description":"Carefully run the knife around the edges of the barrier to release the tape. Be careful not to scratch the table as you remove the tape and barrier."
        }
      ]
    }
  ],
  "text":" Assemble Supplies Assess your collection. For full coverage, you will most likely need a vast collection that that will provide full coverage. When using bottle caps look for caps that are not rusted and still in decent shape. Consider only using bottle caps that hold meaning or significance to you--or just look really cool. Find the right table. Depending upon your collection you may be either looking for a table that can simply display your collection or you may be looking for pure decorative function and plan to cover a piece of necessary furniture. Either way, your collection must be able to completely cover the table top. Purchase glue to hold bottle caps or your collection in place. Liquid Nails or Super Glue work well or you could use contact cement for a very permanent solution. Assemble supplies that will help you build a barrier around the perimeter of your table. When you pour the resin, you don’t want it to run off the sides of the table so building a barrier is imperative. Barrier materials can include heavy cardboard, aluminum foil, duct tape and/or any other material that will help you keep the resin on the table and off the floor. Also, locating an exacto knife or box cutter will help you trim away the barrier once the resin has dried. Purchase resin. Most hardware or home improvement stores will carry pourable resin. Look for something with high gloss in order to give the table that polished finish. Create the Table Lay out collection on clean tabletop surface. Make sure the table is free of debris, dust or dirt before beginning the project. Lay out bottle caps or your collection so you can determine if you like the design. Glue bottle caps and/or your collection in place. Once you are happy with the design, glue the caps in place so they won’t move when you pour the resin. Allow ample dry time before proceeding to the next step. Build a barrier around the perimeter of the table. Secure the base of the barrier with duct tape and/or painter’s tape. You don’t want any gaps so the resin could drip out. Make sure the barrier is high enough around the sides to hold the poured resin. Mix and pour resin. Follow the instructions on the resin box for mixing and then slowly pour over the tabletop. If the resin is not getting between the bottle cap gaps, use a knife to gently spread it over the tops and in between the gaps. Allow the resin to set and dry for up to eight hours (or according to the resin box directions). Remove barrier and tape using your knife. Carefully run the knife around the edges of the barrier to release the tape. Be careful not to scratch the table as you remove the tape and barrier.",
  "tyn_model":[
    "resin",
    "bottle caps",
    "glue",
    "knife",
    "tape",
    "table",
    "duct tape",
    "resin box",
    "contact cement",
    "aluminum foil",
    "exacto knife",
    "box cutter",
    "home improvement stores",
    "pourable resin",
    "painter’s tape",
    "bottle cap"
  ],
  "tyn_section":[

  ]
}