{
  "title":"How to Make Princess Cake (Vegan)",
  "url":"https://www.wikihow.com/Make-Princess-Cake-(Vegan)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan",
    "Vegan Baking"
  ],
  "steps":[
    {
      "headline":"Melt the chocolate at low heat over a double boiler.",
      "description":""
    },
    {
      "headline":"Add the soy or rice milk gradually and vegetable margarine to thicken the chocolate mixture.",
      "description":""
    },
    {
      "headline":"Arrange a piece of aluminum foil on a flat workspace.",
      "description":"Using a small chocolate or pastry brush, paint rectangles on the foil using the chocolate mixture. The rectangles should be slightly smaller than the size of the loaf pan, as they will be layered in it. You should be able to make about six rectangles."
    },
    {
      "headline":"Place the sheet of foil into the fridge to set.",
      "description":"Leave for approximately 30 minutes."
    },
    {
      "headline":"Make the \"cream\".",
      "description":"Blend the vegan cream with vanilla until it thickens. This should take about three to four minutes."
    },
    {
      "headline":"Prepare the cake layers in the pre-lined loaf pan:",
      "description":"Put a layer of soy whipped cream as the base Place one chocolate rectangle layer (detach carefully from the foil) Put another thin layer of soy whipped cream over the chocolate rectangle layer Repeat this process until the chocolate rectangles are exhausted (about three to four more times) Add a layer of waffles (or cookies) Place a final layer of soy whipped cream"
    },
    {
      "headline":"Garnish the cake before freezing.",
      "description":"Add the chopped almonds or hazelnuts and some grated chocolate pieces to complete the cake."
    },
    {
      "headline":"Place a sheet of baking paper or aluminium foil over the top of the loaf tin.",
      "description":"Place the cake into the freezer and allow to freeze for three hours or longer."
    },
    {
      "headline":"Serve chilled.",
      "description":"When ready to service, remove the \"lid\" from the pan and pick up the edges of the baking paper to take the cake out. It should be easy to slide the cake onto a serving platter. Use a slightly warmed knife to slice pieces for serving individual portions."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Melt the chocolate at low heat over a double boiler.  Add the soy or rice milk gradually and vegetable margarine to thicken the chocolate mixture.  Arrange a piece of aluminum foil on a flat workspace. Using a small chocolate or pastry brush, paint rectangles on the foil using the chocolate mixture. The rectangles should be slightly smaller than the size of the loaf pan, as they will be layered in it. You should be able to make about six rectangles. Place the sheet of foil into the fridge to set. Leave for approximately 30 minutes. Make the \"cream\". Blend the vegan cream with vanilla until it thickens. This should take about three to four minutes. Prepare the cake layers in the pre-lined loaf pan: Put a layer of soy whipped cream as the base Place one chocolate rectangle layer (detach carefully from the foil) Put another thin layer of soy whipped cream over the chocolate rectangle layer Repeat this process until the chocolate rectangles are exhausted (about three to four more times) Add a layer of waffles (or cookies) Place a final layer of soy whipped cream Garnish the cake before freezing. Add the chopped almonds or hazelnuts and some grated chocolate pieces to complete the cake. Place a sheet of baking paper or aluminium foil over the top of the loaf tin. Place the cake into the freezer and allow to freeze for three hours or longer. Serve chilled. When ready to service, remove the \"lid\" from the pan and pick up the edges of the baking paper to take the cake out. It should be easy to slide the cake onto a serving platter. Use a slightly warmed knife to slice pieces for serving individual portions. Finished. ",
  "tyn_model":[
    "soy whipped cream",
    "chocolate",
    "loaf pan",
    "baking paper",
    "double boiler",
    "soy or",
    "rice milk",
    "vegetable margarine",
    "aluminum foil",
    "pastry brush",
    "foil",
    "fridge",
    "vegan cream",
    "vanilla",
    "almonds",
    "aluminium foil",
    "loaf tin",
    "freezer",
    "pan",
    "serving platter",
    "knife"
  ],
  "tyn_section":[

  ]
}