{
  "title":"How to Make Peach Trifle",
  "url":"https://www.wikihow.com/Make-Peach-Trifle",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Stone Fruit"
  ],
  "steps":[
    {
      "headline":"Spread the raspberry jam over one side of the sponge cake.",
      "description":""
    },
    {
      "headline":"Cut the cake into small cubes, approximately 2 cm/ 0.7\" in size.",
      "description":""
    },
    {
      "headline":"Arrange the pieces of cake in the base of a large salad bowl.",
      "description":"Lightly sprinkle across all the pieces with both the ginger ale and the sherry."
    },
    {
      "headline":"Arrange the peach pieces on top of the sponge pieces.",
      "description":""
    },
    {
      "headline":"Add the custard.",
      "description":"As you are pouring the custard over the peach layer, use a spoon or knife to assist the tunneling of the custard down into the sponge layer. Use small movements to achieve this."
    },
    {
      "headline":"Allow the trifle to absorb the custard for about 10 minutes.",
      "description":""
    },
    {
      "headline":"Finish the topping.",
      "description":"Add whipped cream across the top of the trifle and decorate using walnuts and a few peach slices."
    },
    {
      "headline":"Place in the refrigerator to set for about one hour.",
      "description":"Serve chilled. Guests can help themselves at the table if you provide a long-handled serving spoon."
    }
  ],
  "text":" Spread the raspberry jam over one side of the sponge cake.  Cut the cake into small cubes, approximately 2 cm/ 0.7\" in size.  Arrange the pieces of cake in the base of a large salad bowl. Lightly sprinkle across all the pieces with both the ginger ale and the sherry. Arrange the peach pieces on top of the sponge pieces.  Add the custard. As you are pouring the custard over the peach layer, use a spoon or knife to assist the tunneling of the custard down into the sponge layer. Use small movements to achieve this. Allow the trifle to absorb the custard for about 10 minutes.  Finish the topping. Add whipped cream across the top of the trifle and decorate using walnuts and a few peach slices. Place in the refrigerator to set for about one hour. Serve chilled. Guests can help themselves at the table if you provide a long-handled serving spoon.",
  "tyn_model":[
    "raspberry jam",
    "sponge cake",
    "large salad bowl",
    "ginger ale",
    "sherry",
    "peach",
    "sponge",
    "custard",
    "spoon",
    "knife",
    "whipped cream",
    "walnuts",
    "refrigerator",
    "serving spoon"
  ],
  "tyn_section":[

  ]
}