{
  "title":"How to Make Leather and Bead Bracelets",
  "url":"https://www.wikihow.com/Make-Leather-and-Bead-Bracelets",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Beading"
  ],
  "steps":[
    {
      "headline":"Prepare the materials.",
      "description":"Prepare the necessary materials in the picture 1. Thread a needle to a pink thread. Nip one end of two leather cords together with a clip. Bring the knotted end of the thread to the hole of the cords."
    },
    {
      "headline":"Thread a bead.",
      "description":"Pass the needle over the cords through the knotted end of thread. Tie up the thread to one side. String a bead to a middle of the two cords. Bring the needle down the right cord."
    },
    {
      "headline":"Go on threading the beads.",
      "description":"Bring the bead over the two cords and down the left cord from inside to outside. Then thread the other bead."
    },
    {
      "headline":"Thread the beads to the end.",
      "description":"Thread the beads in the same way until the cord is suitable around your wrist. Place the beaded cords in a door shape to compare the two sides in the same. Twine the cords two times with thread in the end and knot. Do the same to make the other beaded cords. Cut off their ends in the same length."
    },
    {
      "headline":"Add a button.",
      "description":"Thread the center two cords through the button hole. Make single knots with four cords together. Cut off the redundant cords. Thread the needle to the knotted end to link the middle cords together."
    },
    {
      "headline":"String a line of beads in the center.",
      "description":"Thread a bead to the middle and tie up the thread. String the beads through the gap of each bead at two sides with up and down stitches."
    },
    {
      "headline":"The ending work.",
      "description":"Thread the beads with same doings; stop stringing beads when about 3 centimeter (1.2 in) long of the left cord. Make sure the hole can let the button at the other end in."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Prepare the materials. Prepare the necessary materials in the picture 1. Thread a needle to a pink thread. Nip one end of two leather cords together with a clip. Bring the knotted end of the thread to the hole of the cords. Thread a bead. Pass the needle over the cords through the knotted end of thread. Tie up the thread to one side. String a bead to a middle of the two cords. Bring the needle down the right cord. Go on threading the beads. Bring the bead over the two cords and down the left cord from inside to outside. Then thread the other bead. Thread the beads to the end. Thread the beads in the same way until the cord is suitable around your wrist. Place the beaded cords in a door shape to compare the two sides in the same. Twine the cords two times with thread in the end and knot. Do the same to make the other beaded cords. Cut off their ends in the same length. Add a button. Thread the center two cords through the button hole. Make single knots with four cords together. Cut off the redundant cords. Thread the needle to the knotted end to link the middle cords together. String a line of beads in the center. Thread a bead to the middle and tie up the thread. String the beads through the gap of each bead at two sides with up and down stitches. The ending work. Thread the beads with same doings; stop stringing beads when about 3 centimeter (1.2 in) long of the left cord. Make sure the hole can let the button at the other end in. Finished. ",
  "tyn_model":[
    "thread",
    "beads",
    "needle",
    "pink thread",
    "bead"
  ],
  "tyn_section":[

  ]
}