{
  "title":"How to Clean a Gas Grill Easily",
  "url":"https://www.wikihow.com/Clean-a-Gas-Grill-Easily",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "parts":[
    {
      "name":"Have Supplies Handy",
      "steps":[
        {
          "headline":"Purchase/find a box of heavy duty aluminum foil.",
          "description":"Although any type of foil will do the trick, going for the heavier variety provides you with better cleaning opportunities."
        },
        {
          "headline":"Locate your grill brush or head out to purchase one.",
          "description":"The grill brush will help you remove the loosened caked on food particles and clean the rack."
        },
        {
          "headline":"Grab supplies that will help you maintain a clean grill in the future.",
          "description":"Preparation is key to keeping the grill in better shape for future cooking. Pick up a can of non stick cooking spray, a clean wet cloth and warm soapy water. You can mix soap and water in a pan and keep near the grill for post cleaning."
        }
      ]
    },
    {
      "name":"Clean Your Grill",
      "steps":[
        {
          "headline":"Wait for grill to cool before you clean.",
          "description":"The grill can still be warm to the touch but avoid cleaning it while its still hot (to avoid burning your hands)."
        },
        {
          "headline":"Tear one sheet of aluminum foil and crumple into a ball.",
          "description":"You want a large sized ball that will be big enough to cover some space for grill cleaning."
        },
        {
          "headline":"Rub the aluminum foil ball over the grill racks, loosening any baked on food.",
          "description":"While this won’t completely clean your grill, it will scrap off any surface food that is baked on top of the rack. Run the clean cloth over the top of the rack to remove loosened food. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/10\\/Clean-a-Gas-Grill-Easily-Step-6Bullet1.jpg\\/v4-460px-Clean-a-Gas-Grill-Easily-Step-6Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/10\\/Clean-a-Gas-Grill-Easily-Step-6Bullet1.jpg\\/v4-760px-Clean-a-Gas-Grill-Easily-Step-6Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"}"
        },
        {
          "headline":"Tear another sheet of aluminum foil that is the same size as your grill rack.",
          "description":"If your grill rack is wider than the width of your foil, tear multiple sheets so it covers the grill rack completely."
        },
        {
          "headline":"Place the foil over the top of the grill rack, close the lid and turn the grill heat to high.",
          "description":"Make sure, however nothing else is inside the grill such as large, leftover pieces of food or utensils."
        },
        {
          "headline":"Bake for 15 minutes and then clean after the grill cools.",
          "description":"Cleaning the grill will mean simply wiping down the cooked ash/debris."
        }
      ]
    },
    {
      "name":"Maintain Your Grill",
      "steps":[
        {
          "headline":"Clean with soap and water.",
          "description":"Make sure you remove any remaining food or ash from the grill before using it again in the future. While cleaning it won’t take a tremendous amount of elbow grease, it may take a little time."
        },
        {
          "headline":"Spray a light coating of non stick cooking spray on top of the grill rack.",
          "description":"Don’t overdo it, just a very light amount will help future grilling experiences to be easier. You could also simply rub olive oil over the rack as well by pouring a small amount into a cloth and then rubbing the cloth over the rack."
        },
        {
          "headline":"Consider using specially designed pots and pans for the grill.",
          "description":"Most home or cooking stores sell cookware designed especially for grills."
        }
      ]
    }
  ],
  "text":" Have Supplies Handy Purchase/find a box of heavy duty aluminum foil. Although any type of foil will do the trick, going for the heavier variety provides you with better cleaning opportunities. Locate your grill brush or head out to purchase one. The grill brush will help you remove the loosened caked on food particles and clean the rack. Grab supplies that will help you maintain a clean grill in the future. Preparation is key to keeping the grill in better shape for future cooking. Pick up a can of non stick cooking spray, a clean wet cloth and warm soapy water. You can mix soap and water in a pan and keep near the grill for post cleaning. Clean Your Grill Wait for grill to cool before you clean. The grill can still be warm to the touch but avoid cleaning it while its still hot (to avoid burning your hands). Tear one sheet of aluminum foil and crumple into a ball. You want a large sized ball that will be big enough to cover some space for grill cleaning. Rub the aluminum foil ball over the grill racks, loosening any baked on food. While this won’t completely clean your grill, it will scrap off any surface food that is baked on top of the rack. Run the clean cloth over the top of the rack to remove loosened food. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/10\\/Clean-a-Gas-Grill-Easily-Step-6Bullet1.jpg\\/v4-460px-Clean-a-Gas-Grill-Easily-Step-6Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/1\\/10\\/Clean-a-Gas-Grill-Easily-Step-6Bullet1.jpg\\/v4-760px-Clean-a-Gas-Grill-Easily-Step-6Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"} Tear another sheet of aluminum foil that is the same size as your grill rack. If your grill rack is wider than the width of your foil, tear multiple sheets so it covers the grill rack completely. Place the foil over the top of the grill rack, close the lid and turn the grill heat to high. Make sure, however nothing else is inside the grill such as large, leftover pieces of food or utensils. Bake for 15 minutes and then clean after the grill cools. Cleaning the grill will mean simply wiping down the cooked ash/debris. Maintain Your Grill Clean with soap and water. Make sure you remove any remaining food or ash from the grill before using it again in the future. While cleaning it won’t take a tremendous amount of elbow grease, it may take a little time. Spray a light coating of non stick cooking spray on top of the grill rack. Don’t overdo it, just a very light amount will help future grilling experiences to be easier. You could also simply rub olive oil over the rack as well by pouring a small amount into a cloth and then rubbing the cloth over the rack. Consider using specially designed pots and pans for the grill. Most home or cooking stores sell cookware designed especially for grills.",
  "tyn_model":[
    "grill",
    "aluminum foil",
    "grill rack",
    "foil",
    "grill brush",
    "non stick cooking spray",
    "water",
    "cloth",
    "soap",
    "olive oil",
    "pots",
    "pans"
  ],
  "tyn_section":[

  ]
}