{
  "title":"How to Make Washing Soda",
  "url":"https://www.wikihow.com/Make-Washing-Soda",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Laundry",
    "Laundry Cleaning Products"
  ],
  "parts":[
    {
      "name":"Converting Baking Soda to Washing Soda",
      "steps":[
        {
          "headline":"Gather your supplies.",
          "description":"You will need a large metal baking dish (though stone or glass will also work), a one-pound (454 grams) box of baking soda, and a wooden spoon."
        },
        {
          "headline":"Preheat your oven to 400 F (204 C).",
          "description":"Cover the bottom of the baking dish with a thin layer of baking soda. Baking a thinner layer that's about one-quarter inch (0.6 cm) thick will ensure that the process occurs uniformly."
        },
        {
          "headline":"Bake the baking soda.",
          "description":"Depending on how large a batch you're making, this could take anywhere from 30 minutes to two hours. Stir every 15 minutes to speed up the conversion and ensure it happens in a uniform fashion."
        },
        {
          "headline":"Know when the process is complete.",
          "description":"As the baking soda converts to washing soda, it will become courser, grainier, and more matte. Also, washing soda doesn't clump up like baking soda does. Washing soda grains will be more like sand and will run through your fingers."
        },
        {
          "headline":"Allow to cool.",
          "description":"Once the baking soda to washing soda conversion is complete, leave the washing soda in the baking dish and allow it to cool to room temperature. Store your washing soda in an airtight container, such as a mason jar or old (clean) coffee container."
        }
      ]
    },
    {
      "name":"Understanding Baking Soda and Washing Soda",
      "steps":[
        {
          "headline":"Learn what baking soda is.",
          "description":"Baking soda, which is also known as sodium bicarbonate and sodium hydrogen carbonate, is the chemical compound with the formula NaHCO3. It is used as a cleaner, a deodorizer, and it's used in baking, along with many other uses."
        },
        {
          "headline":"Learn what washing soda is.",
          "description":"Washing soda, also known as sodium carbonate, is the chemical compound with the formula Na2CO3. Washing soda has a much higher pH level than baking soda, and is not safe to consume. The chemical difference between washing and baking soda is that baking soda has a hydrogen atom that washing soda doesn't, and it's missing one of the sodium atoms."
        },
        {
          "headline":"Understand the conversion process.",
          "description":"When baking soda is heated above a certain temperature, its chemical structure changes. When heated, the baking soda decomposes, or undergoes a dehydration process, and loses its hydrogen atom, leaving behind washing soda, water, and carbon dioxide."
        }
      ]
    },
    {
      "name":"Using Washing Soda",
      "steps":[
        {
          "headline":"Boost your laundry detergent.",
          "description":"Add between a half-cup and a full cup (125 to 250 grams) of washing soda to your washing along with your regular detergent. Use a full cup for heavily soiled loads or if you have hard water. The grease fighting nature of washing soda will boost your regular detergent's ability to clean and remove dirt and grime."
        },
        {
          "headline":"Make your own detergent.",
          "description":"Combine one-quarter cup (62.5 grams) each of washing soda and borax in a lidded plastic or glass jar. Add in one-half cup of baking soda (125 grams) and one-half cup (73 grams) of laundry flakes. Stir to combine. Use about one-half cup (125 grams) of homemade detergent per load. If you can't find laundry or soap flakes, purchase a bar of pure soap (like glycerine or Castile soap) and grate it."
        },
        {
          "headline":"Clean your dishes.",
          "description":"You can make your own dishwasher detergent by combining two cups (500 grams) each of washing soda and borax in a glass or plastic container with a lid. Replace the lid and shake to mix. Use about two tablespoons (30 grams) per dishwasher load. Don't use this detergent on aluminum, as the high alkalinity can damage the metal."
        },
        {
          "headline":"Make an all-purpose cleaner.",
          "description":"Combine one-half teaspoon of washing soda (2.5 grams), two teaspoons of borax (10 grams), and one-half teaspoon (2.5 ml) of liquid soap in a spray bottle. Add in two cups of warm water and agitate to mix. Use this to clean floors, bathrooms, toilets and showers, kitchens, or anywhere else that's dirty or grimy."
        },
        {
          "headline":"Keep drains free.",
          "description":"Once a week, pour one-quarter cup (62.5 grams) of washing soda down the drain. Let sit for 10 to 15 minutes and flush with hot water."
        },
        {
          "headline":"Clean concrete.",
          "description":"Sprinkle washing soda over spills and stains and sprinkle water over top to form a paste. Let it sit overnight and scrub it with a brush in the morning. Rinse with clean water."
        }
      ]
    }
  ],
  "text":" Converting Baking Soda to Washing Soda Gather your supplies. You will need a large metal baking dish (though stone or glass will also work), a one-pound (454 grams) box of baking soda, and a wooden spoon. Preheat your oven to 400 F (204 C). Cover the bottom of the baking dish with a thin layer of baking soda. Baking a thinner layer that's about one-quarter inch (0.6 cm) thick will ensure that the process occurs uniformly. Bake the baking soda. Depending on how large a batch you're making, this could take anywhere from 30 minutes to two hours. Stir every 15 minutes to speed up the conversion and ensure it happens in a uniform fashion. Know when the process is complete. As the baking soda converts to washing soda, it will become courser, grainier, and more matte. Also, washing soda doesn't clump up like baking soda does. Washing soda grains will be more like sand and will run through your fingers. Allow to cool. Once the baking soda to washing soda conversion is complete, leave the washing soda in the baking dish and allow it to cool to room temperature. Store your washing soda in an airtight container, such as a mason jar or old (clean) coffee container. Understanding Baking Soda and Washing Soda Learn what baking soda is. Baking soda, which is also known as sodium bicarbonate and sodium hydrogen carbonate, is the chemical compound with the formula NaHCO3. It is used as a cleaner, a deodorizer, and it's used in baking, along with many other uses. Learn what washing soda is. Washing soda, also known as sodium carbonate, is the chemical compound with the formula Na2CO3. Washing soda has a much higher pH level than baking soda, and is not safe to consume. The chemical difference between washing and baking soda is that baking soda has a hydrogen atom that washing soda doesn't, and it's missing one of the sodium atoms. Understand the conversion process. When baking soda is heated above a certain temperature, its chemical structure changes. When heated, the baking soda decomposes, or undergoes a dehydration process, and loses its hydrogen atom, leaving behind washing soda, water, and carbon dioxide. Using Washing Soda Boost your laundry detergent. Add between a half-cup and a full cup (125 to 250 grams) of washing soda to your washing along with your regular detergent. Use a full cup for heavily soiled loads or if you have hard water. The grease fighting nature of washing soda will boost your regular detergent's ability to clean and remove dirt and grime. Make your own detergent. Combine one-quarter cup (62.5 grams) each of washing soda and borax in a lidded plastic or glass jar. Add in one-half cup of baking soda (125 grams) and one-half cup (73 grams) of laundry flakes. Stir to combine. Use about one-half cup (125 grams) of homemade detergent per load. If you can't find laundry or soap flakes, purchase a bar of pure soap (like glycerine or Castile soap) and grate it. Clean your dishes. You can make your own dishwasher detergent by combining two cups (500 grams) each of washing soda and borax in a glass or plastic container with a lid. Replace the lid and shake to mix. Use about two tablespoons (30 grams) per dishwasher load. Don't use this detergent on aluminum, as the high alkalinity can damage the metal. Make an all-purpose cleaner. Combine one-half teaspoon of washing soda (2.5 grams), two teaspoons of borax (10 grams), and one-half teaspoon (2.5 ml) of liquid soap in a spray bottle. Add in two cups of warm water and agitate to mix. Use this to clean floors, bathrooms, toilets and showers, kitchens, or anywhere else that's dirty or grimy. Keep drains free. Once a week, pour one-quarter cup (62.5 grams) of washing soda down the drain. Let sit for 10 to 15 minutes and flush with hot water. Clean concrete. Sprinkle washing soda over spills and stains and sprinkle water over top to form a paste. Let it sit overnight and scrub it with a brush in the morning. Rinse with clean water.",
  "tyn_model":[
    "washing soda",
    "baking soda",
    "baking dish",
    "water",
    "borax",
    "wooden spoon",
    "oven",
    "mason jar",
    "sodium bicarbonate",
    "hydrogen carbonate",
    "sodium carbonate",
    "soda",
    "laundry detergent",
    "regular detergent",
    "detergent",
    "laundry flakes",
    "homemade detergent",
    "soap",
    "glycerine or",
    "castile soap",
    "dishwasher detergent",
    "all-purpose cleaner",
    "liquid soap",
    "spray bottle",
    "warm water",
    "hot water"
  ],
  "tyn_section":[

  ]
}