{
  "title":"How to Make Drawer Liners",
  "url":"https://www.wikihow.com/Make-Drawer-Liners",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture"
  ],
  "steps":[
    {
      "headline":"Cut the paper to the size that is best for each drawer that you intend to line.",
      "description":"It is usually best to allow each liner to fold up a little on each side to aid a good fit and provide a little extra side protection from the sides of the drawers, which are usually painted or varnished."
    },
    {
      "headline":"Fill a spray bottle with warm water.",
      "description":"Dip a teabag into the water for three minutes and then remove it."
    },
    {
      "headline":"Add three drops of clove oil and 2 - 4 drops of a favourite essential oil.",
      "description":"Good choices include lavender, rosemary, mandarin, orange, nectarine, rose, apricot, lemon or try a mixture of favourite essential oil scents. You will need to experiment with the strength of the scent depending on the oil used."
    },
    {
      "headline":"Mix well.",
      "description":""
    },
    {
      "headline":"Spray the solution onto each piece of paper.",
      "description":"Allow to dry completely. It helps to be able to do this in a sunny, warm room to speed up the drying process."
    },
    {
      "headline":"Place each piece in your drawers and put clothing back into the drawer over the drawer liners.",
      "description":""
    }
  ],
  "text":" Cut the paper to the size that is best for each drawer that you intend to line. It is usually best to allow each liner to fold up a little on each side to aid a good fit and provide a little extra side protection from the sides of the drawers, which are usually painted or varnished. Fill a spray bottle with warm water. Dip a teabag into the water for three minutes and then remove it. Add three drops of clove oil and 2 - 4 drops of a favourite essential oil. Good choices include lavender, rosemary, mandarin, orange, nectarine, rose, apricot, lemon or try a mixture of favourite essential oil scents. You will need to experiment with the strength of the scent depending on the oil used. Mix well.  Spray the solution onto each piece of paper. Allow to dry completely. It helps to be able to do this in a sunny, warm room to speed up the drying process. Place each piece in your drawers and put clothing back into the drawer over the drawer liners. ",
  "tyn_model":[
    "paper",
    "water",
    "essential oil",
    "spray bottle",
    "teabag",
    "clove oil",
    "lemon",
    "oil",
    "clothing"
  ],
  "tyn_section":[

  ]
}