{
  "title":"How to Make Apple Rings",
  "url":"https://www.wikihow.com/Make-Apple-Rings",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Apples"
  ],
  "methods":[
    {
      "name":"Preparing the Apples",
      "steps":[
        {
          "headline":"Select your apples.",
          "description":"Some apples work better than others for baking and cooking, and this applies to both dried and deep fried apple rings. Look for crispy apple varieties that will hold their shape when heated, such as:\nBraeburn\nFuji\nHoneycrisp\nGala\nPink Lady\nGranny Smith\nGolden delicious"
        },
        {
          "headline":"Wash the apples.",
          "description":"Run the apples under cold water and scrub them with a vegetable brush or cloth. This will remove excess dirt and bacteria. With a sharp knife, cut away any bruises or soft spots on the apples if you're going to deep fry them. Bruised flesh is safe to eat, but it will become mushy when heated."
        },
        {
          "headline":"Peel the apples.",
          "description":"This is more important for deep fried apples, and is optional for dried apple rings. Apple peel contains a great deal of fiber and other nutrients, so you may want to consider leaving the apples intact for dried apple rings. To peel the apples, use a sharp knife to peel off the skin. You can also use a vegetable peeler or mechanical apple peeler, which is a hand-powered crank device that turns an apple on a spit and peels it with a blade."
        },
        {
          "headline":"Core the apples.",
          "description":"Use an apple corer to remove the core from each apple. It’s important to use an apple corer, because taking out the center of the apple will give you the traditional apple ring shape. Hold the apple still with one hand and center the corer vertically over the top of the apple core. Push the corer all the way through the apple, then pull it back out to remove the core. If you don’t have an apple corer, use a thin, long, and sharp knife to cut out the core from the center of the apple. Cut a small circle around the core, remove the knife, and push the core out through the bottom."
        },
        {
          "headline":"Slice the apples.",
          "description":"The easiest way to do this is with a mandolin, because it will ensure uniform thickness for each slice. Press the bottom of the apple onto the mandolin using the vegetable holder. Use swift downward motions to slice the apple into rounds. If you don’t have a mandolin, slice the apples by hand with a sharp knife. For dried apples, slice the fruit into rings that are one-eighth to one-third inch (3.2 to 8.5 mm) thick. Thinner rings will dry faster, but can easily become crispy and hard. For deep fried apples, slice the rings one-quarter inch (6.4 mm) thick. Lay each ring out flat in a single layer. Take a small biscuit or cookie cutter and cut a smaller ring from the center of each apple slice. Then, do the same with a medium biscuit cutter so that you get a small, medium, and large apple ring from each apple slice. If you have shaped cookie cutters in graduated sizes, you can use these instead of plain circles to make shaped apple rings."
        },
        {
          "headline":"Place the cut rings into a bowl of lemon water.",
          "description":"Fill a large bowl with cold water and squeeze in the juice from one lemon. This will prevent the apples from browning. Let the apples soak for about five minutes. To add a hint of floral nuttiness to the apples, add 1 teaspoon (6 ml) vanilla to the bowl as well."
        },
        {
          "headline":"Dry and season the apples.",
          "description":"After five minutes in the lemon water, remove the apples and lay each slice flat on a clean towel. Gently pat each slice dry. You can also season the apples with spices such as:\n¼ teaspoon (1.25 g) cinnamon\n⅛ teaspoon (0.625 g) ginger or cardamom\nPinch of cloves\nAny combination of the above, or any other spices you wish to experiment with"
        }
      ]
    },
    {
      "name":"Making Deep Fried Apple Rings",
      "steps":[
        {
          "headline":"Assemble your tools.",
          "description":"Along with the prepared apples and your other ingredients, you'll also need a large mixing bowl, two small mixing bowls, a whisk, a deep pan for frying (or a deep fryer), and metal cooling racks."
        },
        {
          "headline":"Heat the oil.",
          "description":"Fill your frying pan with about an inch (2.5 cm) of oil. Heat the oil over medium heat to 350 F (177 C). Use a deep fryer or candy thermometer to maintain a consistent temperature. The best oils for frying include coconut, peanut, and canola. In case you don’t have a thermometer, drop a single popcorn kernel into the cold oil. When the kernel pops, your oil is ready. If you're using a deep fryer, make sure the oil is fresh, otherwise your apples could taste like fish and French fries and anything else you’ve fried in that oil."
        },
        {
          "headline":"Combine the cinnamon-sugar topping.",
          "description":"In your small dish, combine ⅓ cup (75 g) of sugar and 2 teaspoons (10 g) of cinnamon. Set the bowl aside. The remaining cinnamon and sugar called for in the recipe are for the batter."
        },
        {
          "headline":"Combine the dry ingredients.",
          "description":"In a large mixing bowl, measure in the flour, baking powder, salt, ⅛ teaspoon (0.6 g) of cinnamon, and 2 tablespoons (28 g) of sugar."
        },
        {
          "headline":"Combine the egg and buttermilk.",
          "description":"In a small mixing bowl, whisk together the egg and buttermilk until fully combined. When they are ready, pour the wet ingredients into the dry ingredients and whisk the batter together. Instead of buttermilk, you can use plain yogurt if you prefer."
        },
        {
          "headline":"Batter and fry the apples.",
          "description":"One at a time, dip the apple rings into the batter to coat them. Wipe off excess batter on the side of the bowl. Lay a few slices in the frying pan at a time, being sure not to crowd them, otherwise the batter will stick together and the apples rings will merge. Fry each batch for two to four minutes, turning once, until the rings are golden brown and crispy."
        },
        {
          "headline":"Cool and serve.",
          "description":"When the apple rings are done, remove them from the oil and hold them over the pan to let the excess oil drip off. Toss each one into the cinnamon-sugar mixture and coat both sides. Once coated, lay the apple rings on a wire rack, which will allow them to cool without getting soggy."
        }
      ]
    },
    {
      "name":"Making Dried Apple Rings",
      "steps":[
        {
          "headline":"Lay out the apples.",
          "description":"You can dry your apple rings in either a dehydrator or in the oven. For the dehydrator, arrange the apples on the dehydrator trays. For the oven, arrange the apples on metal cooling racks and place these onto baking sheets. This will allow air to circulate under the apples so they’ll dry more evenly. Lay the apple rings side by side, but make sure they don’t touch or overlap, otherwise they won’t dry consistently. If you're drying your apples in the oven, preheat the oven to 150 F (66 C). Set your dehydrator to between 110 and 135 F (43 and 57 C). With a lower temperature, the rings dry more consistently and thoroughly, but will need longer to dry. Use metal cooling racks because other types, such as non-stick or coated ones, may not be oven-safe."
        },
        {
          "headline":"Dehydrate the apple rings.",
          "description":"Turn the dehydrator on or put the apple rings in the oven. Prop the oven door open slightly so that air can circulate. Let the apples dry for 10 to 14 hours in the dehydrator, checking them every hour after the 10-hour mark. In the oven, dry them for five to eight hours, or longer if necessary, until they reach your desired level of dryness. You can stop drying the apples at any time, depending on your personal preference. For juicier apples, dry for a shorter time. For crispier apples, dry for longer; and for leathery apples, dry them for somewhere in the middle."
        },
        {
          "headline":"Cool and store the apples.",
          "description":"When the apples are done to your liking, remove them from the dehydrator or oven and allow them to cool to room temperature. Whatever you don’t eat or use immediately can be stored in an air-tight container for up to a year."
        }
      ]
    }
  ],
  "text":" Preparing the Apples Select your apples. Some apples work better than others for baking and cooking, and this applies to both dried and deep fried apple rings. Look for crispy apple varieties that will hold their shape when heated, such as:\nBraeburn\nFuji\nHoneycrisp\nGala\nPink Lady\nGranny Smith\nGolden delicious Wash the apples. Run the apples under cold water and scrub them with a vegetable brush or cloth. This will remove excess dirt and bacteria. With a sharp knife, cut away any bruises or soft spots on the apples if you're going to deep fry them. Bruised flesh is safe to eat, but it will become mushy when heated. Peel the apples. This is more important for deep fried apples, and is optional for dried apple rings. Apple peel contains a great deal of fiber and other nutrients, so you may want to consider leaving the apples intact for dried apple rings. To peel the apples, use a sharp knife to peel off the skin. You can also use a vegetable peeler or mechanical apple peeler, which is a hand-powered crank device that turns an apple on a spit and peels it with a blade. Core the apples. Use an apple corer to remove the core from each apple. It’s important to use an apple corer, because taking out the center of the apple will give you the traditional apple ring shape. Hold the apple still with one hand and center the corer vertically over the top of the apple core. Push the corer all the way through the apple, then pull it back out to remove the core. If you don’t have an apple corer, use a thin, long, and sharp knife to cut out the core from the center of the apple. Cut a small circle around the core, remove the knife, and push the core out through the bottom. Slice the apples. The easiest way to do this is with a mandolin, because it will ensure uniform thickness for each slice. Press the bottom of the apple onto the mandolin using the vegetable holder. Use swift downward motions to slice the apple into rounds. If you don’t have a mandolin, slice the apples by hand with a sharp knife. For dried apples, slice the fruit into rings that are one-eighth to one-third inch (3.2 to 8.5 mm) thick. Thinner rings will dry faster, but can easily become crispy and hard. For deep fried apples, slice the rings one-quarter inch (6.4 mm) thick. Lay each ring out flat in a single layer. Take a small biscuit or cookie cutter and cut a smaller ring from the center of each apple slice. Then, do the same with a medium biscuit cutter so that you get a small, medium, and large apple ring from each apple slice. If you have shaped cookie cutters in graduated sizes, you can use these instead of plain circles to make shaped apple rings. Place the cut rings into a bowl of lemon water. Fill a large bowl with cold water and squeeze in the juice from one lemon. This will prevent the apples from browning. Let the apples soak for about five minutes. To add a hint of floral nuttiness to the apples, add 1 teaspoon (6 ml) vanilla to the bowl as well. Dry and season the apples. After five minutes in the lemon water, remove the apples and lay each slice flat on a clean towel. Gently pat each slice dry. You can also season the apples with spices such as:\n¼ teaspoon (1.25 g) cinnamon\n⅛ teaspoon (0.625 g) ginger or cardamom\nPinch of cloves\nAny combination of the above, or any other spices you wish to experiment with Making Deep Fried Apple Rings Assemble your tools. Along with the prepared apples and your other ingredients, you'll also need a large mixing bowl, two small mixing bowls, a whisk, a deep pan for frying (or a deep fryer), and metal cooling racks. Heat the oil. Fill your frying pan with about an inch (2.5 cm) of oil. Heat the oil over medium heat to 350 F (177 C). Use a deep fryer or candy thermometer to maintain a consistent temperature. The best oils for frying include coconut, peanut, and canola. In case you don’t have a thermometer, drop a single popcorn kernel into the cold oil. When the kernel pops, your oil is ready. If you're using a deep fryer, make sure the oil is fresh, otherwise your apples could taste like fish and French fries and anything else you’ve fried in that oil. Combine the cinnamon-sugar topping. In your small dish, combine ⅓ cup (75 g) of sugar and 2 teaspoons (10 g) of cinnamon. Set the bowl aside. The remaining cinnamon and sugar called for in the recipe are for the batter. Combine the dry ingredients. In a large mixing bowl, measure in the flour, baking powder, salt, ⅛ teaspoon (0.6 g) of cinnamon, and 2 tablespoons (28 g) of sugar. Combine the egg and buttermilk. In a small mixing bowl, whisk together the egg and buttermilk until fully combined. When they are ready, pour the wet ingredients into the dry ingredients and whisk the batter together. Instead of buttermilk, you can use plain yogurt if you prefer. Batter and fry the apples. One at a time, dip the apple rings into the batter to coat them. Wipe off excess batter on the side of the bowl. Lay a few slices in the frying pan at a time, being sure not to crowd them, otherwise the batter will stick together and the apples rings will merge. Fry each batch for two to four minutes, turning once, until the rings are golden brown and crispy. Cool and serve. When the apple rings are done, remove them from the oil and hold them over the pan to let the excess oil drip off. Toss each one into the cinnamon-sugar mixture and coat both sides. Once coated, lay the apple rings on a wire rack, which will allow them to cool without getting soggy. Making Dried Apple Rings Lay out the apples. You can dry your apple rings in either a dehydrator or in the oven. For the dehydrator, arrange the apples on the dehydrator trays. For the oven, arrange the apples on metal cooling racks and place these onto baking sheets. This will allow air to circulate under the apples so they’ll dry more evenly. Lay the apple rings side by side, but make sure they don’t touch or overlap, otherwise they won’t dry consistently. If you're drying your apples in the oven, preheat the oven to 150 F (66 C). Set your dehydrator to between 110 and 135 F (43 and 57 C). With a lower temperature, the rings dry more consistently and thoroughly, but will need longer to dry. Use metal cooling racks because other types, such as non-stick or coated ones, may not be oven-safe. Dehydrate the apple rings. Turn the dehydrator on or put the apple rings in the oven. Prop the oven door open slightly so that air can circulate. Let the apples dry for 10 to 14 hours in the dehydrator, checking them every hour after the 10-hour mark. In the oven, dry them for five to eight hours, or longer if necessary, until they reach your desired level of dryness. You can stop drying the apples at any time, depending on your personal preference. For juicier apples, dry for a shorter time. For crispier apples, dry for longer; and for leathery apples, dry them for somewhere in the middle. Cool and store the apples. When the apples are done to your liking, remove them from the dehydrator or oven and allow them to cool to room temperature. Whatever you don’t eat or use immediately can be stored in an air-tight container for up to a year.",
  "tyn_model":[
    "apples",
    "oven",
    "oil",
    "dehydrator",
    "cinnamon",
    "knife",
    "apple corer",
    "mandolin",
    "bowl",
    "deep fryer",
    "sugar",
    "buttermilk",
    "apple",
    "lemon water",
    "⅛ teaspoon",
    "frying pan",
    "fuji",
    "gala",
    "water",
    "vegetable brush",
    "apple peel",
    "vegetable peeler",
    "apple peeler",
    "vegetable holder",
    "sharp knife",
    "biscuit or cookie cutter",
    "biscuit cutter",
    "cookie cutters",
    "cold water",
    "lemon",
    "vanilla",
    "ginger",
    "cardamom",
    "cloves",
    "whisk",
    "deep pan",
    "candy thermometer",
    "canola",
    "popcorn kernel",
    "cinnamon-sugar",
    "small dish",
    "⅓ cup",
    "flour",
    "baking powder",
    "salt",
    "small mixing bowl",
    "plain yogurt",
    "cinnamon-",
    "dehydrator trays",
    "baking sheets",
    "air-tight container"
  ],
  "tyn_section":[

  ]
}