{
  "title":"How to Make Semolina (Sooji) Halwaa",
  "url":"https://www.wikihow.com/Make-Semolina-(Sooji)-Halwaa",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Indian Desserts"
  ],
  "steps":[
    {
      "headline":"Take one cup of semolina (sooji) or wheat flour.",
      "description":""
    },
    {
      "headline":"Put the semolina or the wheat flour along with 3/4 cup of ghee (clarified butter) and start heating it in a heavy bottomed pan.",
      "description":""
    },
    {
      "headline":"Simultaneously, on another stove, put three cups of water to boil.",
      "description":""
    },
    {
      "headline":"Add one cup of sugar and one green cardamom or a small pinch of green cardamom powder to the water.",
      "description":"Boil the water till sugar dissolves completely."
    },
    {
      "headline":"Shallow fry the semolina or flour in the ghee on slow flame till the mixture turns golden brown and ghee starts leaving the mixture.",
      "description":""
    },
    {
      "headline":"Once the semolina/flour are ready, along with the hot sugar syrup, switch off both the stoves.",
      "description":""
    },
    {
      "headline":"Pour the sugar mixture in the pan with fried semolina, continuously stirring the semolina/flour to avoid formation of lumps.",
      "description":"(If you keep the semolina/flour mixture over the flame while pouring sugar syrup, there are greater chances of lump formation)"
    },
    {
      "headline":"Once the two mix together, put the pan back on flame and keep on stirring continuously till you get a semi-fluid consistency or till the ghee again starts separating out from the mixture.",
      "description":""
    },
    {
      "headline":"Garnish with chopped almonds, raisins and cashews.",
      "description":""
    }
  ],
  "text":" Take one cup of semolina (sooji) or wheat flour.  Put the semolina or the wheat flour along with 3/4 cup of ghee (clarified butter) and start heating it in a heavy bottomed pan.  Simultaneously, on another stove, put three cups of water to boil.  Add one cup of sugar and one green cardamom or a small pinch of green cardamom powder to the water. Boil the water till sugar dissolves completely. Shallow fry the semolina or flour in the ghee on slow flame till the mixture turns golden brown and ghee starts leaving the mixture.  Once the semolina/flour are ready, along with the hot sugar syrup, switch off both the stoves.  Pour the sugar mixture in the pan with fried semolina, continuously stirring the semolina/flour to avoid formation of lumps. (If you keep the semolina/flour mixture over the flame while pouring sugar syrup, there are greater chances of lump formation) Once the two mix together, put the pan back on flame and keep on stirring continuously till you get a semi-fluid consistency or till the ghee again starts separating out from the mixture.  Garnish with chopped almonds, raisins and cashews. ",
  "tyn_model":[
    "ghee",
    "semolina",
    "water",
    "sugar",
    "flour",
    "wheat flour",
    "sugar syrup",
    "pan",
    "clarified butter",
    "stove",
    "green cardamom",
    "green cardamom powder",
    "stoves",
    "almonds",
    "raisins",
    "cashews"
  ],
  "tyn_section":[

  ]
}