{
  "title":"How to Tie a Bow Tie",
  "url":"https://www.wikihow.com/Tie-a-Bow-Tie",
  "category_hierarchy":[
    "Hobbies and Crafts"
  ],
  "parts":[
    {
      "name":"Measuring the Bow Tie",
      "steps":[
        {
          "headline":"Lift up your collar.",
          "description":"Though a bow tie can be tied with the collar either up or down, you’ll have a much easier time seeing what you’re doing with the collar up, so lift it and ensure the top button of your shirt is buttoned. You should also use a mirror to help you see what you’re doing for the first several times you tie a bow tie."
        },
        {
          "headline":"Measure your neck.",
          "description":"Stand up straight and use a tailor’s measuring tape to measure your neck starting from the base of the back of your neck and ending in the front where your collar sits at just around your Adam’s apple. Place an index finger between the tape as well to give yourself some breathing room."
        },
        {
          "headline":"Size the bow tie.",
          "description":"Bow ties are one size fits all, but they have ways to adjust the length either with a slider or button holes. Most bow ties will also have pre-marked neck measurements informing you how to size them based on your neck measurement. Move the slider or buttons based on your neck measurement."
        },
        {
          "headline":"Place the bow tie around your neck.",
          "description":"Like tying a regular necktie, one end of the bow tie needs to drape over your chest longer than the other. Position the bow tie so that one end hangs roughly 1.5 inches (3.8 cm) lower than the other end. As with a regular necktie, it doesn’t matter which side the longer end is on; however, you’ll be doing most of the work with the hand on which the shorter side of the bow tie starts, so keep that in mind."
        }
      ]
    },
    {
      "name":"Tying the Bow Tie",
      "steps":[
        {
          "headline":"Cross the longer end over the shorter end.",
          "description":"You should cross the tie near your neck so that the loop around your neck is just large enough to work with but not loose; you don’t want your bow dangling in front of your chest."
        },
        {
          "headline":"Loop the long end under where the two ends cross.",
          "description":"With one hand hold the point where the two ends cross over the front of your collar. Take the dangling portion of the longer end and pass it behind and then up over the point of intersection. At this point, you can pull both ends of the bow tie to make it as tight around your neck as you will be comfortable with. Once you have the bow tie at the proper tightness, toss the longer end back over your respective shoulder. You won’t need it for the next step."
        },
        {
          "headline":"Fold the dangling end to make a loop.",
          "description":"Lift up the shorter end—which is still dangling—and fold it over on itself at the widest part of the bowed shape. Lift the whole portion and turn it 90 degrees, so it faces horizontal. This will form a loop that points to the same side as the shoulder over which the longer end is resting. Hold this fold together at the skinniest part of the bow tie, which should be just in front of your Adam’s apple. This will be the front loop of the completed bow tie, so it should already have the general shape of the finished product."
        },
        {
          "headline":"Drop the longer end over the skinny center of the bow.",
          "description":"Take the longer end off your shoulder and drape it over the skinniest part of the bow section you created in the last step."
        },
        {
          "headline":"Pinch the bow together in front of the long end.",
          "description":"Grab the left and right sides of the horizontally folded end and pinch them together in front of the dangling end. The top of the dangling end will now be held between them."
        },
        {
          "headline":"Feed the middle of the dangling end back through the knot.",
          "description":"There will be a small gap behind the bow portion that you can see while you have it pinched forward. Fold the draping end of the bow tie on itself like you did with the short end and pull the loop from the fold through the hole. It will now form the back half of the bow. The gap will be between the loose knot from step two and where you draped the longer end of the bow tie in step four."
        }
      ]
    },
    {
      "name":"Finishing the Bow Tie",
      "steps":[
        {
          "headline":"Pull at the loops.",
          "description":"Pulling at the flat ends of the bow tie will simply untie it like pulling on the dangling strings of shoelaces, so make sure you tighten the bow tie by pulling gently at the looped portions."
        },
        {
          "headline":"Straighten the bow tie.",
          "description":"As soon as you finish, the bow tie will likely be crooked, but you can easily twist the loop at the front and back bows to get it into the proper position. This may require pulling the flat ends slightly to loosen the bow tie, then repositioning it before tightening it again. Make sure the tie is fastened tightly."
        },
        {
          "headline":"Lower your collar.",
          "description":"Your bow tie is now perfectly tied and positioned, so you can put down your collar and finish getting ready."
        },
        {
          "headline":"Check the bow tie periodically.",
          "description":"Since you can’t double-knot a bow tie like you can your shoes, they loosen over the course of wear and can even come untied. Check your bow tie periodically to ensure it’s still tight and perfectly positioned."
        }
      ]
    }
  ],
  "text":" Measuring the Bow Tie Lift up your collar. Though a bow tie can be tied with the collar either up or down, you’ll have a much easier time seeing what you’re doing with the collar up, so lift it and ensure the top button of your shirt is buttoned. You should also use a mirror to help you see what you’re doing for the first several times you tie a bow tie. Measure your neck. Stand up straight and use a tailor’s measuring tape to measure your neck starting from the base of the back of your neck and ending in the front where your collar sits at just around your Adam’s apple. Place an index finger between the tape as well to give yourself some breathing room. Size the bow tie. Bow ties are one size fits all, but they have ways to adjust the length either with a slider or button holes. Most bow ties will also have pre-marked neck measurements informing you how to size them based on your neck measurement. Move the slider or buttons based on your neck measurement. Place the bow tie around your neck. Like tying a regular necktie, one end of the bow tie needs to drape over your chest longer than the other. Position the bow tie so that one end hangs roughly 1.5 inches (3.8 cm) lower than the other end. As with a regular necktie, it doesn’t matter which side the longer end is on; however, you’ll be doing most of the work with the hand on which the shorter side of the bow tie starts, so keep that in mind. Tying the Bow Tie Cross the longer end over the shorter end. You should cross the tie near your neck so that the loop around your neck is just large enough to work with but not loose; you don’t want your bow dangling in front of your chest. Loop the long end under where the two ends cross. With one hand hold the point where the two ends cross over the front of your collar. Take the dangling portion of the longer end and pass it behind and then up over the point of intersection. At this point, you can pull both ends of the bow tie to make it as tight around your neck as you will be comfortable with. Once you have the bow tie at the proper tightness, toss the longer end back over your respective shoulder. You won’t need it for the next step. Fold the dangling end to make a loop. Lift up the shorter end—which is still dangling—and fold it over on itself at the widest part of the bowed shape. Lift the whole portion and turn it 90 degrees, so it faces horizontal. This will form a loop that points to the same side as the shoulder over which the longer end is resting. Hold this fold together at the skinniest part of the bow tie, which should be just in front of your Adam’s apple. This will be the front loop of the completed bow tie, so it should already have the general shape of the finished product. Drop the longer end over the skinny center of the bow. Take the longer end off your shoulder and drape it over the skinniest part of the bow section you created in the last step. Pinch the bow together in front of the long end. Grab the left and right sides of the horizontally folded end and pinch them together in front of the dangling end. The top of the dangling end will now be held between them. Feed the middle of the dangling end back through the knot. There will be a small gap behind the bow portion that you can see while you have it pinched forward. Fold the draping end of the bow tie on itself like you did with the short end and pull the loop from the fold through the hole. It will now form the back half of the bow. The gap will be between the loose knot from step two and where you draped the longer end of the bow tie in step four. Finishing the Bow Tie Pull at the loops. Pulling at the flat ends of the bow tie will simply untie it like pulling on the dangling strings of shoelaces, so make sure you tighten the bow tie by pulling gently at the looped portions. Straighten the bow tie. As soon as you finish, the bow tie will likely be crooked, but you can easily twist the loop at the front and back bows to get it into the proper position. This may require pulling the flat ends slightly to loosen the bow tie, then repositioning it before tightening it again. Make sure the tie is fastened tightly. Lower your collar. Your bow tie is now perfectly tied and positioned, so you can put down your collar and finish getting ready. Check the bow tie periodically. Since you can’t double-knot a bow tie like you can your shoes, they loosen over the course of wear and can even come untied. Check your bow tie periodically to ensure it’s still tight and perfectly positioned.",
  "tyn_model":[
    "bow tie",
    "bow ties",
    "mirror",
    "tape",
    "slider",
    "—which",
    "—and"
  ],
  "tyn_section":[

  ]
}