{
  "title":"How to Make a 7 Layer Dip",
  "url":"https://www.wikihow.com/Make-a-7-Layer-Dip",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Snacks",
    "Dips"
  ],
  "steps":[
    {
      "headline":"Have all the ingredients on an open space, such as a counter or spare table, out of the way, which will be easy to access as you make the dip.",
      "description":""
    },
    {
      "headline":"In a medium bowl, mix the refried beans with 2/3 cup of salsa.",
      "description":"Add the diced green chilis to this mixture. Add Mexican seasonings to taste."
    },
    {
      "headline":"Layer the refried bean mixture in the bottom of the 13x9\" pan or platter.",
      "description":"Place in the freezer for roughly 10 minutes, or while you prepare the next layer."
    },
    {
      "headline":"Rinse out the bowl used for the refried bean layer.",
      "description":"Dry."
    },
    {
      "headline":"Using the same bowl, now clean, combine one of the two small containers of sour cream with 1/2 to 3/4 cup of salsa.",
      "description":"Mix thoroughly."
    },
    {
      "headline":"Take the pan out of the freezer, layer the sour cream mixture over the first layer evenly.",
      "description":"Place back in the freezer."
    },
    {
      "headline":"Rinse out the bowl.",
      "description":"Dry."
    },
    {
      "headline":"Get a cutting board, a sharp, medium sized knife, and your avocados.",
      "description":""
    },
    {
      "headline":"Cut one of the avocados in half.",
      "description":"Take out the \"nut\" at the center. Cut long lines in the avocado half about 1/2 apart. The avocados should be easily \"pulled\" from the avocado peeling. Place the avocados in the clean bowl. Do this for all of the avocados."
    },
    {
      "headline":"When all of the avocados have been peeled and they are sitting in the bowl, add the 2nd container of sour cream.",
      "description":"Also add 1/2 cup of salsa. You may also add pressed or roasted garlic. Set aside."
    },
    {
      "headline":"Take the two lemons, cut each one in half.",
      "description":"In a small bowl, squeeze the lemon halves until all the juice has been emptied from the fruit. Remove any seeds from the juice with a spoon."
    },
    {
      "headline":"Add the lemon juice to the avocado mixture.",
      "description":"Mix together with a fork, spoon, or electric mixer."
    },
    {
      "headline":"Take the pan out of the freezer.",
      "description":"Layer the guacamole (avocado mixture) over the 2nd layer."
    },
    {
      "headline":"Add the following layers on top:",
      "description":"Layer 4:  The fourth layer is a sprinkling of the cheese mix. You could use the entire bag. Layer 5:  The fifth layer is sliced olives. Sprinkle over the cheese. Layer 6:  The sixth layer is the layer you should add just before serving. The sixth layer is the cut up produce--tomatoes, green onions, and radishes. To make the sixth layer, wash, dry, and deseed the tomatoes and cut up into small bites. Wash, dry and cut up the green onions. Wash, dry, and slice the radishes. Sprinkle over the fifth layer (the olives). Layer 7:  Finally, sprinkle the last bag of mixed cheese on top of the fresh produce (sixth layer)."
    },
    {
      "headline":"Refrigerate and serve with dipping chips--tortilla chips work best, but a combination of different types of chips and crackers also work.",
      "description":""
    },
    {
      "headline":"Make the dip available with small plates, a serving spoon, and napkins.",
      "description":""
    }
  ],
  "text":" Have all the ingredients on an open space, such as a counter or spare table, out of the way, which will be easy to access as you make the dip.  In a medium bowl, mix the refried beans with 2/3 cup of salsa. Add the diced green chilis to this mixture. Add Mexican seasonings to taste. Layer the refried bean mixture in the bottom of the 13x9\" pan or platter. Place in the freezer for roughly 10 minutes, or while you prepare the next layer. Rinse out the bowl used for the refried bean layer. Dry. Using the same bowl, now clean, combine one of the two small containers of sour cream with 1/2 to 3/4 cup of salsa. Mix thoroughly. Take the pan out of the freezer, layer the sour cream mixture over the first layer evenly. Place back in the freezer. Rinse out the bowl. Dry. Get a cutting board, a sharp, medium sized knife, and your avocados.  Cut one of the avocados in half. Take out the \"nut\" at the center. Cut long lines in the avocado half about 1/2 apart. The avocados should be easily \"pulled\" from the avocado peeling. Place the avocados in the clean bowl. Do this for all of the avocados. When all of the avocados have been peeled and they are sitting in the bowl, add the 2nd container of sour cream. Also add 1/2 cup of salsa. You may also add pressed or roasted garlic. Set aside. Take the two lemons, cut each one in half. In a small bowl, squeeze the lemon halves until all the juice has been emptied from the fruit. Remove any seeds from the juice with a spoon. Add the lemon juice to the avocado mixture. Mix together with a fork, spoon, or electric mixer. Take the pan out of the freezer. Layer the guacamole (avocado mixture) over the 2nd layer. Add the following layers on top: Layer 4:  The fourth layer is a sprinkling of the cheese mix. You could use the entire bag. Layer 5:  The fifth layer is sliced olives. Sprinkle over the cheese. Layer 6:  The sixth layer is the layer you should add just before serving. The sixth layer is the cut up produce--tomatoes, green onions, and radishes. To make the sixth layer, wash, dry, and deseed the tomatoes and cut up into small bites. Wash, dry and cut up the green onions. Wash, dry, and slice the radishes. Sprinkle over the fifth layer (the olives). Layer 7:  Finally, sprinkle the last bag of mixed cheese on top of the fresh produce (sixth layer). Refrigerate and serve with dipping chips--tortilla chips work best, but a combination of different types of chips and crackers also work.  Make the dip available with small plates, a serving spoon, and napkins. ",
  "tyn_model":[
    "bowl",
    "freezer",
    "avocado",
    "salsa",
    "sour cream",
    "refried bean",
    "pan",
    "lemon",
    "spoon",
    "olives",
    "tomatoes",
    "green onions",
    "radishes",
    "medium bowl",
    "refried beans",
    "green chilis",
    "seasonings",
    "cutting board",
    "knife",
    "avocados",
    "garlic",
    "lemons",
    "small bowl",
    "fork",
    "electric mixer",
    "guacamole",
    "cheese mix",
    "cheese",
    "mixed cheese",
    "dipping chips",
    "tortilla chips",
    "crackers",
    "small plates",
    "serving spoon",
    "napkins"
  ],
  "tyn_section":[

  ]
}