{
  "title":"How to Practice With Wire and Nippers for Hat Making",
  "url":"https://www.wikihow.com/Practice-With-Wire-and-Nippers-for-Hat-Making",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "steps":[
    {
      "headline":"Familiarize yourself with the wire shapes:",
      "description":" Support brim wires: Support wires on brim include center wire from back to front, support wires from side to side, and diagonal support wires left side and diagonal support wires right side. Round brim wires: Round wires on brim include circumference edge wire, head-size wire and several divisional wires depending on size of frame."
    },
    {
      "headline":"Practice until you can turn one wire over another securely and silk on wire is not damaged and no point is felt where wire is cut off.",
      "description":"Frame wires must be immovable when frame is finished."
    },
    {
      "headline":"Practice using tie wire.",
      "description":"There are two ways to make a wire frame, by measurement or over a buckram frame for guide:\nWhen making a wire frame over a buckram frame, start at head size, fitting wires to exactly fit frame, turning and tying wires as above. When round brim wire is on and support wires have been turned over, remove wire frame from buckram frame."
    }
  ],
  "text":" Familiarize yourself with the wire shapes:  Support brim wires: Support wires on brim include center wire from back to front, support wires from side to side, and diagonal support wires left side and diagonal support wires right side. Round brim wires: Round wires on brim include circumference edge wire, head-size wire and several divisional wires depending on size of frame. Practice until you can turn one wire over another securely and silk on wire is not damaged and no point is felt where wire is cut off. Frame wires must be immovable when frame is finished. Practice using tie wire. There are two ways to make a wire frame, by measurement or over a buckram frame for guide:\nWhen making a wire frame over a buckram frame, start at head size, fitting wires to exactly fit frame, turning and tying wires as above. When round brim wire is on and support wires have been turned over, remove wire frame from buckram frame.",
  "tyn_model":[
    "wire frame",
    "wires"
  ],
  "tyn_section":[

  ]
}