{
  "title":"How to Make Four Vegetable Risotto",
  "url":"https://www.wikihow.com/Make-Four-Vegetable-Risotto",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Rice and Beans",
    "Risotto"
  ],
  "steps":[
    {
      "headline":"Prepare the stock.",
      "description":"Add the stock cubes to 1.5 litres/50fl.oz boiling water."
    },
    {
      "headline":"Cut off the ends of the zucchini and clean them.",
      "description":"Cut into small rounds."
    },
    {
      "headline":"Dice the artichoke hearts into small pieces.",
      "description":""
    },
    {
      "headline":"Cut the hard ends off the asparagus and cut them into 2 - 3 pieces each",
      "description":""
    },
    {
      "headline":"Peel the onions and chop finely.",
      "description":"Add 20g/.7oz butter and the oil and heat on low. Add the onions and cook for two minutes until transparent but not browned."
    },
    {
      "headline":"Add the rice and cook on low until the rice becomes translucent.",
      "description":"Stir frequently to ensure that all the rice is cooked."
    },
    {
      "headline":"Pour in the wine and stir until the wine evaporates.",
      "description":""
    },
    {
      "headline":"Pour in three quarters of the stock and stir.",
      "description":"Add the peas, zucchini and asparagus."
    },
    {
      "headline":"Cover and allow to simmer slowly for 20 minutes.",
      "description":"Check constantly and add more stock as needed until the stock is finished. Five minutes before removing the risotto, add the artichoke heart pieces."
    },
    {
      "headline":"Remove from the heat.",
      "description":""
    },
    {
      "headline":"Add the butter in small pieces and the Parmesan cheese.",
      "description":"Mix in gently. Salt and pepper to taste. Allow to sit for two minutes to absorb the melting butter and cheese and serve immediately."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Prepare the stock. Add the stock cubes to 1.5 litres/50fl.oz boiling water. Cut off the ends of the zucchini and clean them. Cut into small rounds. Dice the artichoke hearts into small pieces.  Cut the hard ends off the asparagus and cut them into 2 - 3 pieces each  Peel the onions and chop finely. Add 20g/.7oz butter and the oil and heat on low. Add the onions and cook for two minutes until transparent but not browned. Add the rice and cook on low until the rice becomes translucent. Stir frequently to ensure that all the rice is cooked. Pour in the wine and stir until the wine evaporates.  Pour in three quarters of the stock and stir. Add the peas, zucchini and asparagus. Cover and allow to simmer slowly for 20 minutes. Check constantly and add more stock as needed until the stock is finished. Five minutes before removing the risotto, add the artichoke heart pieces. Remove from the heat.  Add the butter in small pieces and the Parmesan cheese. Mix in gently. Salt and pepper to taste. Allow to sit for two minutes to absorb the melting butter and cheese and serve immediately. Finished. ",
  "tyn_model":[
    "stock",
    "butter",
    "rice",
    "zucchini",
    "asparagus",
    "onions",
    "wine",
    "boiling water",
    "artichoke hearts",
    "oil",
    "peas",
    "risotto",
    "artichoke heart",
    "parmesan cheese",
    "salt",
    "pepper"
  ],
  "tyn_section":[

  ]
}