{
  "title":"How to Build a Nice Front Yard on Little Space Heroes",
  "url":"https://www.wikihow.com/Build-a-Nice-Front-Yard-on-Little-Space-Heroes",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "steps":[
    {
      "headline":"Buy a house with two levels in it.",
      "description":"For example, buy a fun house."
    },
    {
      "headline":"Put  picket fences around the whole house.",
      "description":""
    },
    {
      "headline":"Put an umbrella table in and put some sun chairs.",
      "description":""
    },
    {
      "headline":"Put a kiddy pool in there and two inflatable chairs sitting right next to the kiddie pool.",
      "description":"One on the left and one on the right."
    },
    {
      "headline":"Buy the sand and a scarecrow.Once you have bought those put the sand pit on a place where it's not crowded.Now all you have to do is put the scarecrow on the sand pit.Now buy a purple flag.When you have bought it,put it on the opposite side of the scarecrow but still put it in the sand pit.",
      "description":""
    },
    {
      "headline":"Lead some picket fences for the walk way in your pad.Your guest will be really welcome.",
      "description":""
    },
    {
      "headline":"Put some bushes right at the starting of the picket fence.",
      "description":"(The walk way)"
    },
    {
      "headline":"Put one tree on the left of the entrance and put the other tree on the right of the entrance.",
      "description":""
    },
    {
      "headline":"Sit back and relax or you can invite your friends over!They will be amazed!",
      "description":""
    }
  ],
  "text":" Buy a house with two levels in it. For example, buy a fun house. Put  picket fences around the whole house.  Put an umbrella table in and put some sun chairs.  Put a kiddy pool in there and two inflatable chairs sitting right next to the kiddie pool. One on the left and one on the right. Buy the sand and a scarecrow.Once you have bought those put the sand pit on a place where it's not crowded.Now all you have to do is put the scarecrow on the sand pit.Now buy a purple flag.When you have bought it,put it on the opposite side of the scarecrow but still put it in the sand pit.  Lead some picket fences for the walk way in your pad.Your guest will be really welcome.  Put some bushes right at the starting of the picket fence. (The walk way) Put one tree on the left of the entrance and put the other tree on the right of the entrance.  Sit back and relax or you can invite your friends over!They will be amazed! ",
  "tyn_model":[
    "picket fences",
    "sand",
    "umbrella table",
    "sun chairs",
    "kiddy pool",
    "inflatable chairs",
    "scarecrow",
    "sand pit",
    "purple flag",
    "bushes",
    "picket fence"
  ],
  "tyn_section":[

  ]
}