{
  "title":"How to Make Celery and Apple Salad",
  "url":"https://www.wikihow.com/Make-Celery-and-Apple-Salad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Fruit Desserts"
  ],
  "steps":[
    {
      "headline":"Fill a large bowl with the diced apples.",
      "description":"Pour the lemon juice over the apples and mix well. Drain the liquid once the apples are coated."
    },
    {
      "headline":"Add the celery, scallion/spring onion, sultanas and walnuts to the apple and toss gently.",
      "description":""
    },
    {
      "headline":"Make the dressing.",
      "description":"Pour the olive oil, orange juice, zest and salt and pepper into the bottle or jar. Screw the lid on and shake until the ingredients are combined."
    },
    {
      "headline":"Remove the lid and add the dressing to the salad.",
      "description":"Toss through gently to coat the ingredients."
    },
    {
      "headline":"Place the salad into the refrigerator for half an hour to chill.",
      "description":""
    },
    {
      "headline":"Serve.",
      "description":"Prior to serving, lay the spinach leaves in the base of four salad bowls or plates and place the salad atop the leaves."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Fill a large bowl with the diced apples. Pour the lemon juice over the apples and mix well. Drain the liquid once the apples are coated. Add the celery, scallion/spring onion, sultanas and walnuts to the apple and toss gently.  Make the dressing. Pour the olive oil, orange juice, zest and salt and pepper into the bottle or jar. Screw the lid on and shake until the ingredients are combined. Remove the lid and add the dressing to the salad. Toss through gently to coat the ingredients. Place the salad into the refrigerator for half an hour to chill.  Serve. Prior to serving, lay the spinach leaves in the base of four salad bowls or plates and place the salad atop the leaves. Finished. ",
  "tyn_model":[
    "large bowl",
    "lemon juice",
    "celery",
    "scallion",
    "onion",
    "sultanas",
    "walnuts",
    "olive oil",
    "orange juice",
    "salt and pepper",
    "bottle",
    "jar",
    "refrigerator",
    "spinach",
    "salad bowls"
  ],
  "tyn_section":[

  ]
}