{
  "title":"How to Make Chocolate Strawberry Pancakes",
  "url":"https://www.wikihow.com/Make-Chocolate-Strawberry-Pancakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Pancakes",
    "Fruit Pancakes"
  ],
  "steps":[
    {
      "headline":"Grease a pan or griddle (or use a non-stick pan), then put it on the stovetop on medium heat.",
      "description":""
    },
    {
      "headline":"Combine the eggs and milk in a medium bowl, then beat thoroughly with a whisk.",
      "description":""
    },
    {
      "headline":"Combine the flour, sugar, strawberry Nesquik powder, and Milo powder in a large bowl.",
      "description":""
    },
    {
      "headline":"Pour the wet ingredients into the dry ingredients and mix them until they create a consistent batter without any chunks in it.",
      "description":""
    },
    {
      "headline":"Pour the batter onto the griddle until it's the size you want your pancake to be once the pan has heated up.",
      "description":""
    },
    {
      "headline":"Flip the pancake over using a spatula when the edges of the pancake start to bubble the dry.",
      "description":""
    },
    {
      "headline":"Use your spatula to check the second side after a couple minutes to see if it is golden brown.",
      "description":"If it is, remove the pancake from the pan."
    },
    {
      "headline":"Repeat steps 5-7 until all of the batter is gone or until you're satisfied with the amount of pancakes you've made.",
      "description":""
    },
    {
      "headline":"Add desired toppings and enjoy!",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Grease a pan or griddle (or use a non-stick pan), then put it on the stovetop on medium heat.  Combine the eggs and milk in a medium bowl, then beat thoroughly with a whisk.  Combine the flour, sugar, strawberry Nesquik powder, and Milo powder in a large bowl.  Pour the wet ingredients into the dry ingredients and mix them until they create a consistent batter without any chunks in it.  Pour the batter onto the griddle until it's the size you want your pancake to be once the pan has heated up.  Flip the pancake over using a spatula when the edges of the pancake start to bubble the dry.  Use your spatula to check the second side after a couple minutes to see if it is golden brown. If it is, remove the pancake from the pan. Repeat steps 5-7 until all of the batter is gone or until you're satisfied with the amount of pancakes you've made.  Add desired toppings and enjoy!  Finished. ",
  "tyn_model":[
    "spatula",
    "pan or griddle",
    "non-stick pan",
    "stovetop on",
    "eggs",
    "milk",
    "medium bowl",
    "whisk",
    "flour",
    "sugar",
    "strawberry nesquik powder",
    "milo powder",
    "large bowl",
    "griddle",
    "pan"
  ],
  "tyn_section":[

  ]
}