{
  "title":"How to Play McDonald's Monopoly",
  "url":"https://www.wikihow.com/Play-McDonald%27s-Monopoly",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Board Games",
    "Resource Management Board Games",
    "Monopoly"
  ],
  "parts":[
    {
      "name":"Getting Game Pieces",
      "steps":[
        {
          "headline":"Buy food from a McDonald's location.",
          "description":"The standard way to get game pieces for McDonald's Monopoly is by purchasing certain foods. Some foods give you four peels and others give you two. Two-peel foods include:\n10-piece chicken McNuggets\nFilet-o-Fish Sandwich\nBig Mac\nMedium and large McCafe iced and blended beverages\nLarge McCafe iced coffee and extra large Minute Maid orange juice\nMedium fountain drinks\nFruit & maple oatmeal\nEgg, sausage, or egg and egg white delight McMuffin sandwiches\nHashbrowns\nPremium McWrap\n\nFour-peel foods include:\nLarge fries\n20 piece chicken McNuggets"
        },
        {
          "headline":"Make a mail-in request.",
          "description":"Since McDonald's offers Monopoly as a \"no purchase necessary\" game, they need to provide you with a way to get pieces free of purchase. This method will still cost you the price of postage, but it's ultimately a cheaper route to go. Send in a self-addressed stamped envelope. Your address must be written by hand. The return address on your outer envelope must match the recipient's address on your SASE inside. Mail your request in by the appropriate deadline. For 2013, the deadline is August 12, 2013. The address can change from year to year, but the address for 2013 is:\n2013 MONOPOLY Game at McDonald’s Game Piece Request\nP.O. Box 49419\nStrongsville, OH 44149-0419\n\nYou will receive a total of four game stamps in the mail with each request. There are no limits on the number of requests."
        }
      ]
    },
    {
      "name":"Collecting Pieces and Winning Prizes",
      "steps":[
        {
          "headline":"Get a game board.",
          "description":"Game boards are available through most McDonald's locations. They can also be downloaded online. As you collect stamps for various Monopoly locations, peel off the back of each stamp and stick it to its corresponding place on the game board. The game board is not an essential tool. Your stamps are still valid even without the use of a game board, but game boards do allow you to keep track of your stamps more efficiently, so it is in your best interest to keep one."
        },
        {
          "headline":"Collect property sets to win.",
          "description":"If you collect all the properties on a certain avenue or railroad, you will win the prize assigned to that property set. The prizes change from year to year, but rare sets are more valuable and will win you bigger prizes. For 2013, the prizes for each property set are:\nMediterranean Avenue (Mediterranean Ave. & Baltic Ave.) - $1,000 prize\nShort Line Railroad (Reading Railroad, Pennsylvania Railroad, B. & O. Railroad, and Short Line Railroad) - Shell Fuel for a year\nVermont Avenue (Vermont Ave., Oriental Ave., & Connecticut Ave.) - $5,000 prize\nVirginia Avenue (Virginia Ave., St. Charles Place, & States Ave.) - $10,000 prize\nTennessee Avenue (Tennessee Ave., St. James Place, & New York Ave.) - Super Bowl XLVIII Trip for two (2) from EA SPORTS\nKentucky Avenue (Kentucky Ave., Indiana Ave., & Illinois Ave.) - Delta Vacations Trip for two (2) to any one Delta Vacations Destination\n\nVentnor Avenue (Ventnor Ave., Marvin Gardens, & Atlantic Ave.) - $20,000 prize\nPennsylvania Avenue (Pennsylvania Ave., Pacific Ave., & North Carolina Ave.) - 2014 FIAT® 500L\nBoardwalk (Boardwalk & Park Place) - $1,000,000 prize"
        },
        {
          "headline":"Win instantly.",
          "description":"In addition to the grand prizes you can win by collecting stamp sets, there are also a few instant-win prizes you can win simply by peeling off a prize stamp marked with that instant prize. Most instant-win prizes tend to be food prizes, but monetary prizes and other gifts are also options. Note that the prizes can vary from year to year, but the instant-win prizes for 2013 are:\nFood prizes:\nMedium French Fries\nQuarter Pounder with Cheese\nSmall Frappé or Smoothie\nRegular McFlurry or Fruit ‘N Yogurt Parfait\nAny Breakfast sandwich (excluding McMuffin®)\n\nRedbox 1 Night DVD or Blu-Ray Rental\nMy Coke Rewards 40-Point Bundles\n$5 Arch Card\nEA SPORTS $10 Promotion Code\n$10 Shell Gift Card\nHasbro Monopoly Board Game\n$25 Shell Gift Card\nShutterfly 8×8 Photo Book\n$50 Cash\nEA Sports Video Game\nurBeats Earphones\n$100 Cash\nPanasonic LUMIX® TS20 Digital Still Camera\nBeats by Dr. Dre Pill Speaker\nHeadphones\nPanasonic VIERA® 50-inch Class Plasma HDTV\nNHL® All-Star Weekend Trip\nEA SPORTS Ultimate Game Room\n$5,000 Cash\nEA SPORTS NFL Game Experience\nBeaches Resorts Vacation\nAce Hardware $7,500 Home Fixup\nNFL Pro Bowl Experience\n2013 FIAT 500 Hatchback\n2013 FIAT 500 Cabrio\n$20,000 Cash\n$100,000 Cash"
        }
      ]
    },
    {
      "name":"Claiming Prizes",
      "steps":[
        {
          "headline":"Know the prize claim deadlines.",
          "description":"Know when the deadline for claiming each prize ends. Food prizes tend to expire a few weeks after the end of the game, while larger prizes may expire after several months. For 2013:\nFood prizes must be claimed by August 26, 2013\nRedbox prizes and EA Sports video games must be claimed by September 6, 2013\nEA Sports $10 Promotion Codes must be claimed by October 31, 2013\nMy Coke Rewards Points must be claimed by September 30, 2013\nAll other prizes must be claimed by September 6, 2013"
        },
        {
          "headline":"Redeem food prizes at a local restaurant.",
          "description":"Take your instant-win food prizes into any participating McDonald's location to redeem them. These prizes cannot be used with other coupons or discounts. Only one food prize may be claimed per person per visit."
        },
        {
          "headline":"Claim prizes directly with prize partners.",
          "description":"Most prizes offered through third party sources should be claimed directly from those third-party sources. Redbox prizes should be claimed at Redbox locations, via the Redbox app, or at redbox.com/monopoly2013\nEA Sports Promotion Codes should be submitted to promo.easports.com/mcd\nMy Coke Rewards® Points should be claimed via www.mycokerewards.com"
        },
        {
          "headline":"Claim cash and merchandise prizes worth less than $600.",
          "description":"Unless the winning stamp or code must be turned into a specific prize partner, these prizes can be claimed in-store or through the website: www.iwonatmcd.com\nIn general, follow the instructions provided on the stamp to determine the best method to claim your prize."
        },
        {
          "headline":"Claim cash and merchandise prizes worth more than $600.",
          "description":"These prizes can be claimed via the prize-claim website (www.iwonatmcd.com) or through the toll-free number provided on your stamps, when applicable. Follow the instructions provided on the stamp to determine the best method to claim your prize. You will be mailed \"Prize Claim Documents\" that must be filled out in their entirety and submitted to the location provided in order to verify your prize and take care of legal matters concerning the prize. Note that vehicle prizes and travel prizes are included under this broad prize category."
        }
      ]
    },
    {
      "name":"Playing Online",
      "steps":[
        {
          "headline":"Register online at the McDonald's Monopoly website.",
          "description":"In order to play the game online, you will need a McDonald's Monopoly online account. This allows the company to keep track of which codes you have already used and who the prize winners are. Required fields include first name, last name, email address, password, date of birth, phone number, street address, city, state, and zip code. You will also need to state that you have read and agree to the official rules and privacy policy."
        },
        {
          "headline":"Get game codes.",
          "description":"Game codes can be found in a variety of places. Each code is 11 digits including numbers and letters. Games codes can be found on select game stamps when you purchase food from a McDonald's location. Select bags from McDonald's locations can also have free codes on them. Game codes can be found via the official website and other official communications from McDonald's. You may also be able to find free game codes from message boards or unofficial third-party websites."
        },
        {
          "headline":"Type your game code into the code box online.",
          "description":"At the top of the McDonald's Monopoly website, there should be a box stating “Enter Code.” Type your 11-digit code into the box and hit the “Do It” button to enter the grand prize sweepstakes and to see if you have won an instant prize. Go to: http://www.playatmcd.com/\n\nThe codes alone do not determine the winners. Instead, online winners are determined based on who submits a valid code at the chosen winning time of day for that specific day."
        },
        {
          "headline":"Win instant-win prizes.",
          "description":"If you submit your code at the winning time of day, you will automatically win one of several instant-win online prizes. The prizes change each year, but for 2013, the instant-win online prizes include:\nRedbox One Night DVD Rental\n40 My Coke Rewards Points\nEA Sports $10 Promotion Code\n1,000 My Coke Rewards Points\n$50 Cash\n$40 Shell Gift Card\nEA Sports Game\n$100 Cash\n$500 Cash\n$7,500 prize from Ace Hardware\n$20,000\n2013 FIAT 500 Cabrio"
        },
        {
          "headline":"Win the online grand prize.",
          "description":"Every time you enter a game code online using a registered account, you will be entered into the grand prize online sweepstakes, which ends at the conclusion of the game. For 2013, the grand prize is a FIAT® 500 Cabrio."
        },
        {
          "headline":"Follow the instructions to claim your prize.",
          "description":"Whenever you win a prize through the online game, an email will be sent to the email address you registered with containing specific instructions for how to claim your prize. Note that a copy of each prize claiming email will also be saved to your Account page on the McDonald's Monopoly website."
        }
      ]
    },
    {
      "name":"Other Important Rules to Remember",
      "steps":[
        {
          "headline":"Know the eligibility requirements.",
          "description":"There are certain limitations on who can play and win at McDonald's Monopoly. To be eligible, you must:\nBe 13 years of age or older\nBe a resident of the Territory (the United States, District of Columbia, Guam, Spain, and Puerto Rico)\n\nYou are not eligible if:\nYou were a McDonald's franchise owner, direct, officer, employee, agent, or independent contractor on or after January 15, 2013\nYou were a director, officer, employee, agent or independent contractor of any entity engaged in the development, production or distribution of game materials on or after January 15, 2013\nYou were a director, member, manager or officer of any prize partner on or after January 15, 2013"
        },
        {
          "headline":"Do not trade or buy game pieces.",
          "description":"The official rules prohibit the buying and selling of games pieces or stamps through unofficial third parties. If you are caught buying and trading pieces, the pieces themselves will be disqualified."
        }
      ]
    }
  ],
  "text":" Getting Game Pieces Buy food from a McDonald's location. The standard way to get game pieces for McDonald's Monopoly is by purchasing certain foods. Some foods give you four peels and others give you two. Two-peel foods include:\n10-piece chicken McNuggets\nFilet-o-Fish Sandwich\nBig Mac\nMedium and large McCafe iced and blended beverages\nLarge McCafe iced coffee and extra large Minute Maid orange juice\nMedium fountain drinks\nFruit & maple oatmeal\nEgg, sausage, or egg and egg white delight McMuffin sandwiches\nHashbrowns\nPremium McWrap\n\nFour-peel foods include:\nLarge fries\n20 piece chicken McNuggets Make a mail-in request. Since McDonald's offers Monopoly as a \"no purchase necessary\" game, they need to provide you with a way to get pieces free of purchase. This method will still cost you the price of postage, but it's ultimately a cheaper route to go. Send in a self-addressed stamped envelope. Your address must be written by hand. The return address on your outer envelope must match the recipient's address on your SASE inside. Mail your request in by the appropriate deadline. For 2013, the deadline is August 12, 2013. The address can change from year to year, but the address for 2013 is:\n2013 MONOPOLY Game at McDonald’s Game Piece Request\nP.O. Box 49419\nStrongsville, OH 44149-0419\n\nYou will receive a total of four game stamps in the mail with each request. There are no limits on the number of requests. Collecting Pieces and Winning Prizes Get a game board. Game boards are available through most McDonald's locations. They can also be downloaded online. As you collect stamps for various Monopoly locations, peel off the back of each stamp and stick it to its corresponding place on the game board. The game board is not an essential tool. Your stamps are still valid even without the use of a game board, but game boards do allow you to keep track of your stamps more efficiently, so it is in your best interest to keep one. Collect property sets to win. If you collect all the properties on a certain avenue or railroad, you will win the prize assigned to that property set. The prizes change from year to year, but rare sets are more valuable and will win you bigger prizes. For 2013, the prizes for each property set are:\nMediterranean Avenue (Mediterranean Ave. & Baltic Ave.) - $1,000 prize\nShort Line Railroad (Reading Railroad, Pennsylvania Railroad, B. & O. Railroad, and Short Line Railroad) - Shell Fuel for a year\nVermont Avenue (Vermont Ave., Oriental Ave., & Connecticut Ave.) - $5,000 prize\nVirginia Avenue (Virginia Ave., St. Charles Place, & States Ave.) - $10,000 prize\nTennessee Avenue (Tennessee Ave., St. James Place, & New York Ave.) - Super Bowl XLVIII Trip for two (2) from EA SPORTS\nKentucky Avenue (Kentucky Ave., Indiana Ave., & Illinois Ave.) - Delta Vacations Trip for two (2) to any one Delta Vacations Destination\n\nVentnor Avenue (Ventnor Ave., Marvin Gardens, & Atlantic Ave.) - $20,000 prize\nPennsylvania Avenue (Pennsylvania Ave., Pacific Ave., & North Carolina Ave.) - 2014 FIAT® 500L\nBoardwalk (Boardwalk & Park Place) - $1,000,000 prize Win instantly. In addition to the grand prizes you can win by collecting stamp sets, there are also a few instant-win prizes you can win simply by peeling off a prize stamp marked with that instant prize. Most instant-win prizes tend to be food prizes, but monetary prizes and other gifts are also options. Note that the prizes can vary from year to year, but the instant-win prizes for 2013 are:\nFood prizes:\nMedium French Fries\nQuarter Pounder with Cheese\nSmall Frappé or Smoothie\nRegular McFlurry or Fruit ‘N Yogurt Parfait\nAny Breakfast sandwich (excluding McMuffin®)\n\nRedbox 1 Night DVD or Blu-Ray Rental\nMy Coke Rewards 40-Point Bundles\n$5 Arch Card\nEA SPORTS $10 Promotion Code\n$10 Shell Gift Card\nHasbro Monopoly Board Game\n$25 Shell Gift Card\nShutterfly 8×8 Photo Book\n$50 Cash\nEA Sports Video Game\nurBeats Earphones\n$100 Cash\nPanasonic LUMIX® TS20 Digital Still Camera\nBeats by Dr. Dre Pill Speaker\nHeadphones\nPanasonic VIERA® 50-inch Class Plasma HDTV\nNHL® All-Star Weekend Trip\nEA SPORTS Ultimate Game Room\n$5,000 Cash\nEA SPORTS NFL Game Experience\nBeaches Resorts Vacation\nAce Hardware $7,500 Home Fixup\nNFL Pro Bowl Experience\n2013 FIAT 500 Hatchback\n2013 FIAT 500 Cabrio\n$20,000 Cash\n$100,000 Cash Claiming Prizes Know the prize claim deadlines. Know when the deadline for claiming each prize ends. Food prizes tend to expire a few weeks after the end of the game, while larger prizes may expire after several months. For 2013:\nFood prizes must be claimed by August 26, 2013\nRedbox prizes and EA Sports video games must be claimed by September 6, 2013\nEA Sports $10 Promotion Codes must be claimed by October 31, 2013\nMy Coke Rewards Points must be claimed by September 30, 2013\nAll other prizes must be claimed by September 6, 2013 Redeem food prizes at a local restaurant. Take your instant-win food prizes into any participating McDonald's location to redeem them. These prizes cannot be used with other coupons or discounts. Only one food prize may be claimed per person per visit. Claim prizes directly with prize partners. Most prizes offered through third party sources should be claimed directly from those third-party sources. Redbox prizes should be claimed at Redbox locations, via the Redbox app, or at redbox.com/monopoly2013\nEA Sports Promotion Codes should be submitted to promo.easports.com/mcd\nMy Coke Rewards® Points should be claimed via www.mycokerewards.com Claim cash and merchandise prizes worth less than $600. Unless the winning stamp or code must be turned into a specific prize partner, these prizes can be claimed in-store or through the website: www.iwonatmcd.com\nIn general, follow the instructions provided on the stamp to determine the best method to claim your prize. Claim cash and merchandise prizes worth more than $600. These prizes can be claimed via the prize-claim website (www.iwonatmcd.com) or through the toll-free number provided on your stamps, when applicable. Follow the instructions provided on the stamp to determine the best method to claim your prize. You will be mailed \"Prize Claim Documents\" that must be filled out in their entirety and submitted to the location provided in order to verify your prize and take care of legal matters concerning the prize. Note that vehicle prizes and travel prizes are included under this broad prize category. Playing Online Register online at the McDonald's Monopoly website. In order to play the game online, you will need a McDonald's Monopoly online account. This allows the company to keep track of which codes you have already used and who the prize winners are. Required fields include first name, last name, email address, password, date of birth, phone number, street address, city, state, and zip code. You will also need to state that you have read and agree to the official rules and privacy policy. Get game codes. Game codes can be found in a variety of places. Each code is 11 digits including numbers and letters. Games codes can be found on select game stamps when you purchase food from a McDonald's location. Select bags from McDonald's locations can also have free codes on them. Game codes can be found via the official website and other official communications from McDonald's. You may also be able to find free game codes from message boards or unofficial third-party websites. Type your game code into the code box online. At the top of the McDonald's Monopoly website, there should be a box stating “Enter Code.” Type your 11-digit code into the box and hit the “Do It” button to enter the grand prize sweepstakes and to see if you have won an instant prize. Go to: http://www.playatmcd.com/\n\nThe codes alone do not determine the winners. Instead, online winners are determined based on who submits a valid code at the chosen winning time of day for that specific day. Win instant-win prizes. If you submit your code at the winning time of day, you will automatically win one of several instant-win online prizes. The prizes change each year, but for 2013, the instant-win online prizes include:\nRedbox One Night DVD Rental\n40 My Coke Rewards Points\nEA Sports $10 Promotion Code\n1,000 My Coke Rewards Points\n$50 Cash\n$40 Shell Gift Card\nEA Sports Game\n$100 Cash\n$500 Cash\n$7,500 prize from Ace Hardware\n$20,000\n2013 FIAT 500 Cabrio Win the online grand prize. Every time you enter a game code online using a registered account, you will be entered into the grand prize online sweepstakes, which ends at the conclusion of the game. For 2013, the grand prize is a FIAT® 500 Cabrio. Follow the instructions to claim your prize. Whenever you win a prize through the online game, an email will be sent to the email address you registered with containing specific instructions for how to claim your prize. Note that a copy of each prize claiming email will also be saved to your Account page on the McDonald's Monopoly website. Other Important Rules to Remember Know the eligibility requirements. There are certain limitations on who can play and win at McDonald's Monopoly. To be eligible, you must:\nBe 13 years of age or older\nBe a resident of the Territory (the United States, District of Columbia, Guam, Spain, and Puerto Rico)\n\nYou are not eligible if:\nYou were a McDonald's franchise owner, direct, officer, employee, agent, or independent contractor on or after January 15, 2013\nYou were a director, officer, employee, agent or independent contractor of any entity engaged in the development, production or distribution of game materials on or after January 15, 2013\nYou were a director, member, manager or officer of any prize partner on or after January 15, 2013 Do not trade or buy game pieces. The official rules prohibit the buying and selling of games pieces or stamps through unofficial third parties. If you are caught buying and trading pieces, the pieces themselves will be disqualified.",
  "tyn_model":[
    "mcdonald's",
    "mcdonald's monopoly",
    "game board",
    "game boards",
    "stamps",
    "filet-o-fish sandwich",
    "mccafe iced coffee",
    "minute maid orange juice",
    "monopoly",
    "mcdonald’s",
    "game piece request",
    "game stamps",
    "mcdonald's locations",
    "shell fuel",
    "fiat® 500l\nboardwalk",
    "instant-win prizes",
    "‘n yogurt parfait",
    "shutterfly 8×8 photo book",
    "ea sports",
    "ea sports $10 promotion codes",
    "ea sports promotion",
    "“enter",
    "” type",
    "“do",
    "” button",
    "ea sports $10 promotion code\n1,000",
    "ea sports game",
    "fiat 500 cabrio",
    "fiat® 500 cabrio",
    "mcdonald's franchise owner, direct, officer"
  ],
  "tyn_section":[

  ]
}