{
  "title":"How to Brine Green Olives",
  "url":"https://www.wikihow.com/Brine-Green-Olives",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "steps":[
    {
      "headline":"Pick out some green olives.",
      "description":""
    },
    {
      "headline":"Wash the olives with water and dry them with a clean towel.",
      "description":""
    },
    {
      "headline":"Clean and sanitize a suitable container.",
      "description":"Acceptable containers are glass or porcelain jars. Ensure that there are no microbes that could disturb the process."
    },
    {
      "headline":"Fill the jar/container with olives",
      "description":""
    },
    {
      "headline":"Add the lukewarm water along with salt (according to taste).",
      "description":""
    },
    {
      "headline":"Add vinegar.",
      "description":"This reduces the pH so that your brine olives are safe from fungus and microbes."
    },
    {
      "headline":"Seal the jar tightly.",
      "description":"Prevent air from entering the jar."
    },
    {
      "headline":"Store the jar, undisturbed in a safe place.",
      "description":""
    },
    {
      "headline":"Wait a week before consuming the brine olives.",
      "description":"You may eat the olives after a week or two when or whenever you feel they are ready, but not before one week."
    }
  ],
  "text":" Pick out some green olives.  Wash the olives with water and dry them with a clean towel.  Clean and sanitize a suitable container. Acceptable containers are glass or porcelain jars. Ensure that there are no microbes that could disturb the process. Fill the jar/container with olives  Add the lukewarm water along with salt (according to taste).  Add vinegar. This reduces the pH so that your brine olives are safe from fungus and microbes. Seal the jar tightly. Prevent air from entering the jar. Store the jar, undisturbed in a safe place.  Wait a week before consuming the brine olives. You may eat the olives after a week or two when or whenever you feel they are ready, but not before one week.",
  "tyn_model":[
    "olives",
    "water",
    "salt",
    "vinegar",
    "brine olives"
  ],
  "tyn_section":[

  ]
}