{
  "title":"How to Make Vegan Chocolate Sorbet",
  "url":"https://www.wikihow.com/Make-Vegan-Chocolate-Sorbet",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan"
  ],
  "parts":[
    {
      "name":"Creating the Mixture",
      "steps":[
        {
          "headline":"Combine the sugar and the cocoa powder in a heavy-based saucepan off the heat.",
          "description":""
        },
        {
          "headline":"Add the water gradually as you stir the mixture into a paste.",
          "description":""
        },
        {
          "headline":"Keep adding the water until all the water is combined and the mixture is smooth.",
          "description":""
        },
        {
          "headline":"Bring this mixture to the boil but boil it only until the sugar has dissolved and then reduce the heat.",
          "description":""
        },
        {
          "headline":"Simmer for an additional 10 minutes.",
          "description":""
        },
        {
          "headline":"Pour the mixture into a jug and let it cool completely.",
          "description":""
        }
      ]
    },
    {
      "name":"Create the Sorbet",
      "steps":[
        {
          "headline":"Churn the mixture in an ice cream maker.",
          "description":"Follow the instructions provided with your machine. You are aiming for a consistency that is soft and able to be scooped."
        },
        {
          "headline":"Transfer it into a metal container and cover it once it reaches a scoopable consistency.",
          "description":""
        },
        {
          "headline":"Put it in the freezer overnight and it will be ready to serve the next day.",
          "description":""
        },
        {
          "headline":"Place the mixture in a metal container such as a metal bowl, cover it with plastic wrap and freeze it overnight.",
          "description":""
        },
        {
          "headline":"Remove the ice cream once every hour and beat it with an electric mixer for a minute or two.",
          "description":""
        },
        {
          "headline":"Repeat this process until the sorbet becomes smooth.",
          "description":"It could take 2 to 3 hours."
        },
        {
          "headline":"Allow it to sit overnight once smooth and it will be ready to serve the following day.",
          "description":""
        }
      ]
    }
  ],
  "text":" Creating the Mixture Combine the sugar and the cocoa powder in a heavy-based saucepan off the heat.  Add the water gradually as you stir the mixture into a paste.  Keep adding the water until all the water is combined and the mixture is smooth.  Bring this mixture to the boil but boil it only until the sugar has dissolved and then reduce the heat.  Simmer for an additional 10 minutes.  Pour the mixture into a jug and let it cool completely.  Create the Sorbet Churn the mixture in an ice cream maker. Follow the instructions provided with your machine. You are aiming for a consistency that is soft and able to be scooped. Transfer it into a metal container and cover it once it reaches a scoopable consistency.  Put it in the freezer overnight and it will be ready to serve the next day.  Place the mixture in a metal container such as a metal bowl, cover it with plastic wrap and freeze it overnight.  Remove the ice cream once every hour and beat it with an electric mixer for a minute or two.  Repeat this process until the sorbet becomes smooth. It could take 2 to 3 hours. Allow it to sit overnight once smooth and it will be ready to serve the following day. ",
  "tyn_model":[
    "water",
    "sugar",
    "cocoa powder",
    "heavy-based saucepan",
    "jug",
    "ice cream maker",
    "freezer",
    "plastic wrap",
    "ice cream",
    "electric mixer"
  ],
  "tyn_section":[

  ]
}