{
  "title":"How to Board an Anti Aircraft Wraith in Halo 3",
  "url":"https://www.wikihow.com/Board-an-Anti-Aircraft-Wraith-in-Halo-3",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Halo 3"
  ],
  "steps":[
    {
      "headline":"Locate the Anti Aircraft Wraith you wish to target.",
      "description":"They can only be found on Halo 3's campaign and are a common objective for you to eliminate. They are of a brighter colour than their purple, normal Wraith counterparts and can be be quickly identified by their tell-tale anti aircraft guns which shoot into the sky."
    },
    {
      "headline":"Destroy all other vehicles around you.",
      "description":"If you eliminate them, the Wraith will be much easier to attack and approach."
    },
    {
      "headline":"Kill the Anti Aircraft Wraith's gunner, if there is one.",
      "description":"This can be done by shooting them with a sniper or beam rifle aimed at his head. The carbine or battle rifle are also effective, although it may take significantly longer to kill the gunner by this method."
    },
    {
      "headline":"Jump on top of the Wraith's main body but DO NOT BOARD IT.",
      "description":"The Wraith is easiest to jump onto from behind, since the driver will be unaware of your presence and if you have eliminated all other enemies in the area, then you should have no problem staying on once you've jumped up."
    },
    {
      "headline":"Melee attack the hatch (The B button on your Xbox 360 controller) of the Anti Aircraft Wraith.",
      "description":"You can find it on top of the main vehicle - make sure you are aiming with your cross-hair at it to melee that exact spot."
    },
    {
      "headline":"Melee attack the Brute driving the wraith after the hatch is gone and he is exposed (The B button again) until his helmet comes off.",
      "description":"Be careful not to kill him, only to just dislodge his helmet."
    },
    {
      "headline":"Hold the Right Bunker when the message prompting you to \"Hold RB to board\" ISN'T on the top right-hand corner of your screen.",
      "description":"If it shows up at the last second, use the Right Bunker again to dismount and try the process again. Once the Right Bunker is held, shoot the driver in the head until he dies."
    },
    {
      "headline":"Let your character enter the Anti Aircraft Wraith - this will happen automatically if you have done this correctly.",
      "description":"You will now be able to enjoy your new Anti Aircraft Wraith!"
    }
  ],
  "text":" Locate the Anti Aircraft Wraith you wish to target. They can only be found on Halo 3's campaign and are a common objective for you to eliminate. They are of a brighter colour than their purple, normal Wraith counterparts and can be be quickly identified by their tell-tale anti aircraft guns which shoot into the sky. Destroy all other vehicles around you. If you eliminate them, the Wraith will be much easier to attack and approach. Kill the Anti Aircraft Wraith's gunner, if there is one. This can be done by shooting them with a sniper or beam rifle aimed at his head. The carbine or battle rifle are also effective, although it may take significantly longer to kill the gunner by this method. Jump on top of the Wraith's main body but DO NOT BOARD IT. The Wraith is easiest to jump onto from behind, since the driver will be unaware of your presence and if you have eliminated all other enemies in the area, then you should have no problem staying on once you've jumped up. Melee attack the hatch (The B button on your Xbox 360 controller) of the Anti Aircraft Wraith. You can find it on top of the main vehicle - make sure you are aiming with your cross-hair at it to melee that exact spot. Melee attack the Brute driving the wraith after the hatch is gone and he is exposed (The B button again) until his helmet comes off. Be careful not to kill him, only to just dislodge his helmet. Hold the Right Bunker when the message prompting you to \"Hold RB to board\" ISN'T on the top right-hand corner of your screen. If it shows up at the last second, use the Right Bunker again to dismount and try the process again. Once the Right Bunker is held, shoot the driver in the head until he dies. Let your character enter the Anti Aircraft Wraith - this will happen automatically if you have done this correctly. You will now be able to enjoy your new Anti Aircraft Wraith!",
  "tyn_model":[
    "anti aircraft wraith",
    "wraith",
    "bunker",
    "anti aircraft guns",
    "sniper or beam rifle",
    "carbine",
    "battle rifle",
    "melee",
    "brute"
  ],
  "tyn_section":[

  ]
}