{
  "title":"How to Draw a Giraffe",
  "url":"https://www.wikihow.com/Draw-a-Giraffe",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "methods":[
    {
      "name":"A Sketch-Style Giraffe",
      "steps":[
        {
          "headline":"Draw a triangle and a line.",
          "description":""
        },
        {
          "headline":"Add two rectangles.",
          "description":""
        },
        {
          "headline":"Add three rectangles.",
          "description":""
        },
        {
          "headline":"Add three more rectangles and add some lines around the shapes.",
          "description":"Add a small triangle on the top."
        },
        {
          "headline":"Draw lines around some of the rectangles to mark the legs.",
          "description":"Draw the tail and some details around the head. Draw the eyes too."
        },
        {
          "headline":"Add all the needed details.",
          "description":"This surely looks like a giraffe now!"
        },
        {
          "headline":"Erase unnecessary lines.",
          "description":""
        },
        {
          "headline":"Color the drawing.",
          "description":"Use black, light and darker brown."
        }
      ]
    },
    {
      "name":"A Cartoon Giraffe",
      "steps":[
        {
          "headline":"Draw an oval for the head.",
          "description":""
        },
        {
          "headline":"Draw curves with sharp edges for the mouth section and ears.",
          "description":""
        },
        {
          "headline":"Draw circles attached to the head with curves to make the giraffe’s projecting horns.",
          "description":""
        },
        {
          "headline":"Draw eyes and nostrils with ovals and curves for the eyebrows and mouth.",
          "description":""
        },
        {
          "headline":"Draw the long neck of the giraffe by making two vertical curve lines",
          "description":""
        },
        {
          "headline":"Draw two ovals (a big and small oval) attached to one another for the body.",
          "description":""
        },
        {
          "headline":"Draw four elongated trapezoids for the legs.",
          "description":""
        },
        {
          "headline":"Draw thin rectangles below each of the trapezoids drawn previously.",
          "description":""
        },
        {
          "headline":"Draw ovals for the feet of the giraffe.",
          "description":""
        },
        {
          "headline":"Draw an oval with a sharp edge attached to a curve for the tail.",
          "description":""
        },
        {
          "headline":"Based on the outline, draw the giraffe",
          "description":""
        },
        {
          "headline":"Draw the details of the giraffe such as the spots , short main, and tail details.",
          "description":""
        },
        {
          "headline":"Erase the unnecessary outlines.",
          "description":""
        },
        {
          "headline":"Color your giraffe!",
          "description":""
        }
      ]
    }
  ],
  "text":" A Sketch-Style Giraffe Draw a triangle and a line.  Add two rectangles.  Add three rectangles.  Add three more rectangles and add some lines around the shapes. Add a small triangle on the top. Draw lines around some of the rectangles to mark the legs. Draw the tail and some details around the head. Draw the eyes too. Add all the needed details. This surely looks like a giraffe now! Erase unnecessary lines.  Color the drawing. Use black, light and darker brown. A Cartoon Giraffe Draw an oval for the head.  Draw curves with sharp edges for the mouth section and ears.  Draw circles attached to the head with curves to make the giraffe’s projecting horns.  Draw eyes and nostrils with ovals and curves for the eyebrows and mouth.  Draw the long neck of the giraffe by making two vertical curve lines  Draw two ovals (a big and small oval) attached to one another for the body.  Draw four elongated trapezoids for the legs.  Draw thin rectangles below each of the trapezoids drawn previously.  Draw ovals for the feet of the giraffe.  Draw an oval with a sharp edge attached to a curve for the tail.  Based on the outline, draw the giraffe  Draw the details of the giraffe such as the spots , short main, and tail details.  Erase the unnecessary outlines.  Color your giraffe! ",
  "tyn_model":[
    "giraffe",
    "sketch-style giraffe"
  ],
  "tyn_section":[

  ]
}