{
  "title":"How to Make a Shamrock Shake",
  "url":"https://www.wikihow.com/Make-a-Shamrock-Shake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk"
  ],
  "methods":[
    {
      "name":"Easy and Classic Shamrock Shake",
      "steps":[
        {
          "headline":"Let the ice cream soften.",
          "description":"Let the ice cream sit out on the counter for about 10 minutes. This step is optional, but allowing the ice cream to sit at room temperature makes it easier to blend. As a result, your shake will be smoother and more evenly flavored."
        },
        {
          "headline":"Blend the ice cream, milk, and mint extract.",
          "description":"Add the three ingredients to an electric blender and blend on medium speed for about 30 seconds, or until evenly combined and smooth. Start with 1/4 tsp (1.25 ml) mint extract. Blend, and taste with a clean spoon. If you prefer a stronger mint flavor, add another 1/4 tsp (1.25 ml) extract. Do not get carried away, though. Mint extract is potent, so a little can go a long way. Any milk or half-and-half will work for this recipe."
        },
        {
          "headline":"Add the green food coloring and continue mixing.",
          "description":"Drop the food coloring into the shake and blend for another 15 seconds or so, just long enough to mix the color in. As with the mint extract, start with the smaller amount before trying a larger amount. If you do not like how the shake looks with 4 drops of food coloring, slowly add up to 8 drops. You could use either liquid or gel food coloring. Gel food coloring may have less impact on the texture of the shake."
        },
        {
          "headline":"Garnish with whipped cream.",
          "description":"Pour into a serving glass and enjoy immediately. If desired, the shake can be topped with whipped cream."
        }
      ]
    },
    {
      "name":"Pistachio Flavor Shamrock Shake",
      "steps":[
        {
          "headline":"Chill your serving glass.",
          "description":"Before you begin making the shake itself, get your serving glass ready by placing it in the refrigerator or freezer until it feels cold. Keep the glass in the refrigerator for 30 to 40 minutes. Keep the glass in the freezer for about 10 to 15 minutes. Note that cups made of glass will get colder at a faster rate than those made from plastic. Make sure the glass you choose will be tall enough to fit the entire milkshake."
        },
        {
          "headline":"Pour the milk into your glass.",
          "description":"Once your glass has been chilled, pour in the cold milk. Any dairy milk will work for this recipe: whole, 2 percent, 1 percent, and fat-free. You could also try soymilk or almond milk for a dairy-free alternative, but these options may slightly alter the final texture of the milk shake."
        },
        {
          "headline":"Stir in the dry pudding mix.",
          "description":"Add the pistachio instant pudding to the milk in your glass and stir, continuously and rapidly, for 2 to 3 minutes. The pudding mix must be completely dissolved. As it dissolves, it should start to thicken up the milk, but the effect may not be noticeable at first. The shake gets its flavor and color from the pudding mix."
        },
        {
          "headline":"Chill in the refrigerator for 30 minutes.",
          "description":"You can enjoy the pistachio shamrock shake as is, but if you want a thicker shake, you should let the drink sit in the refrigerator for 30 to 60 minutes. As it sets, the shake will thicken a great deal more. To speed the process up, you could also try sticking the shake in the freezer for about 10 to 15 minutes. You do not want the shake frozen solid. You only want it to get cold enough to thicken up a little."
        },
        {
          "headline":"Garnish with whipped cream, if desired.",
          "description":"Serve immediately and top with a generous portion of whipped cream, if desired."
        }
      ]
    },
    {
      "name":"Drunk Shamrock Shake",
      "steps":[
        {
          "headline":"Heat the mint leaves and sugar in water.",
          "description":"Combine the leaves from your small bunch of mint with your equal parts of water and sugar in a small saucepan. Heat on medium, stirring occasionally, until the sugar dissolves completely. This could take anywhere from 5 to 10 minutes."
        },
        {
          "headline":"Chill the mint syrup.",
          "description":"Let the syrup sit in your refrigerator for about an hour, or until it feels cool. If you want to cool the syrup down faster, place it in the freezer for 20 minutes. Before chilling the syrup, make sure that you transfer it into a heatproof bowl. If you use a plastic bowl, the heat from the syrup could cause the plastic to start melting."
        },
        {
          "headline":"Strain out the mint leaves.",
          "description":"Once the syrup feels cool, pour it through a strainer or small colander. Collect the syrup in a bowl beneath the strainer and filter out the leaves. You only need 2 Tbsp (30 ml) of this syrup for your shamrock shake. The rest can be saved in a sealed container for another dish, though. Discard the mint leaves you strained out."
        },
        {
          "headline":"Combine 2 Tbsp (30 ml) mint syrup with the ice cream, milk, whiskey, mint extract, and food coloring.",
          "description":"Add the ingredients to an electric blender and whip together on a high speed for 15 to 30 seconds, or until thoroughly combined. Taste the shake before serving it. If the mint flavor is not strong enough, you can add more mint syrup or more mint extract. If the alcohol taste is not strong enough, you can add a bit more whiskey. Be aware, though, that adding more liquid will cause your shake to thin out."
        },
        {
          "headline":"Garnish with whipped cream and a cherry, if desired.",
          "description":"Pour the shamrock shake into one or two serving glasses. Decorate each one with a generous helping of whipped cream topping and a bright red maraschino cherry."
        }
      ]
    },
    {
      "name":"Diet-Friendly Shamrock Shake",
      "steps":[
        {
          "headline":"Blend the yogurt, milk, mint extract, and sweetener.",
          "description":"Combine these four ingredients in your blender and mix on a medium setting until they are well combined. This could take about 15 to 20 seconds. Using yogurt instead of ice cream reduces the fat content of the shake while adding more calcium and probiotics. Using low-fat or nonfat milk cuts down on the number of calories in the shake. Natural sweeteners like raw honey and agave reduce the sugar and number of calories in your shake. The result is a shake with a low glycemic index, making it safer for people with diabetes or those who are at risk for diabetes."
        },
        {
          "headline":"Add the green food coloring.",
          "description":"Drop 2 or 3 drops of green food coloring into the shake and blend for another 10 to 15 seconds, or until evenly dispersed. You can skip the green food coloring altogether if you are worried about including dyes in your food."
        },
        {
          "headline":"Blend in the ice.",
          "description":"Add 5 ice cubes to the blender and blend on high until the ice is fully chopped and dispersed through the blender. This could take a few minutes. If the shake is not thick enough to suit your preferences even after the ice is mixed in, blend in another two ice cubes. Note that you may need to pause your blender and stir the contents with a rubber spatula to ensure the top and bottom of the mixture are being evenly blended."
        },
        {
          "headline":"Enjoy immediately.",
          "description":"As soon as the shake is done, transfer it into a serving glass and enjoy."
        }
      ]
    },
    {
      "name":"Healthy Vegan Shamrock Shake",
      "steps":[
        {
          "headline":"Freeze the banana.",
          "description":"Peel the banana and cut it into 2-inch (5-cm) chunks. Place these frozen banana chunks in your freezer for 20 to 30 minutes, or until they become frozen solid. You should tray freeze the bananas to prevent them from sticking together. Cover a small cookie sheet with parchment paper and arrange the banana chunks on the sheet in a single layer. Do not let the pieces touch. Stick the cookie sheet in the freezer. Done in this manner, the banana pieces should freeze separately, making them easier to blend into the shake."
        },
        {
          "headline":"Blend all the ingredients together.",
          "description":"Add the vanilla coconut milk ice cream, frozen banana chunks, 1/4 cup (60 ml) cacao nibs, peppermint oil, almond milk, spinach, and avocado to the blender. Blend on high speed until smooth and evenly colored. This should take anywhere from 30 seconds to 2 minutes, depending on the speed and strength of your blender. The coconut milk ice cream and almond milk remove dairy from the equation. The spinach and avocado give the shamrock shake a great green color without the use of dyes. The cacao nibs add a hint of milk chocolate flavor, which complements the taste of mint."
        },
        {
          "headline":"Transfer into serving glasses and sprinkle with cacao nibs.",
          "description":"Pour your shake into serving glasses and serve immediately. If desired, sprinkle each shake with additional cacao nibs before serving for an added boost of chocolate flavor."
        }
      ]
    }
  ],
  "text":" Easy and Classic Shamrock Shake Let the ice cream soften. Let the ice cream sit out on the counter for about 10 minutes. This step is optional, but allowing the ice cream to sit at room temperature makes it easier to blend. As a result, your shake will be smoother and more evenly flavored. Blend the ice cream, milk, and mint extract. Add the three ingredients to an electric blender and blend on medium speed for about 30 seconds, or until evenly combined and smooth. Start with 1/4 tsp (1.25 ml) mint extract. Blend, and taste with a clean spoon. If you prefer a stronger mint flavor, add another 1/4 tsp (1.25 ml) extract. Do not get carried away, though. Mint extract is potent, so a little can go a long way. Any milk or half-and-half will work for this recipe. Add the green food coloring and continue mixing. Drop the food coloring into the shake and blend for another 15 seconds or so, just long enough to mix the color in. As with the mint extract, start with the smaller amount before trying a larger amount. If you do not like how the shake looks with 4 drops of food coloring, slowly add up to 8 drops. You could use either liquid or gel food coloring. Gel food coloring may have less impact on the texture of the shake. Garnish with whipped cream. Pour into a serving glass and enjoy immediately. If desired, the shake can be topped with whipped cream. Pistachio Flavor Shamrock Shake Chill your serving glass. Before you begin making the shake itself, get your serving glass ready by placing it in the refrigerator or freezer until it feels cold. Keep the glass in the refrigerator for 30 to 40 minutes. Keep the glass in the freezer for about 10 to 15 minutes. Note that cups made of glass will get colder at a faster rate than those made from plastic. Make sure the glass you choose will be tall enough to fit the entire milkshake. Pour the milk into your glass. Once your glass has been chilled, pour in the cold milk. Any dairy milk will work for this recipe: whole, 2 percent, 1 percent, and fat-free. You could also try soymilk or almond milk for a dairy-free alternative, but these options may slightly alter the final texture of the milk shake. Stir in the dry pudding mix. Add the pistachio instant pudding to the milk in your glass and stir, continuously and rapidly, for 2 to 3 minutes. The pudding mix must be completely dissolved. As it dissolves, it should start to thicken up the milk, but the effect may not be noticeable at first. The shake gets its flavor and color from the pudding mix. Chill in the refrigerator for 30 minutes. You can enjoy the pistachio shamrock shake as is, but if you want a thicker shake, you should let the drink sit in the refrigerator for 30 to 60 minutes. As it sets, the shake will thicken a great deal more. To speed the process up, you could also try sticking the shake in the freezer for about 10 to 15 minutes. You do not want the shake frozen solid. You only want it to get cold enough to thicken up a little. Garnish with whipped cream, if desired. Serve immediately and top with a generous portion of whipped cream, if desired. Drunk Shamrock Shake Heat the mint leaves and sugar in water. Combine the leaves from your small bunch of mint with your equal parts of water and sugar in a small saucepan. Heat on medium, stirring occasionally, until the sugar dissolves completely. This could take anywhere from 5 to 10 minutes. Chill the mint syrup. Let the syrup sit in your refrigerator for about an hour, or until it feels cool. If you want to cool the syrup down faster, place it in the freezer for 20 minutes. Before chilling the syrup, make sure that you transfer it into a heatproof bowl. If you use a plastic bowl, the heat from the syrup could cause the plastic to start melting. Strain out the mint leaves. Once the syrup feels cool, pour it through a strainer or small colander. Collect the syrup in a bowl beneath the strainer and filter out the leaves. You only need 2 Tbsp (30 ml) of this syrup for your shamrock shake. The rest can be saved in a sealed container for another dish, though. Discard the mint leaves you strained out. Combine 2 Tbsp (30 ml) mint syrup with the ice cream, milk, whiskey, mint extract, and food coloring. Add the ingredients to an electric blender and whip together on a high speed for 15 to 30 seconds, or until thoroughly combined. Taste the shake before serving it. If the mint flavor is not strong enough, you can add more mint syrup or more mint extract. If the alcohol taste is not strong enough, you can add a bit more whiskey. Be aware, though, that adding more liquid will cause your shake to thin out. Garnish with whipped cream and a cherry, if desired. Pour the shamrock shake into one or two serving glasses. Decorate each one with a generous helping of whipped cream topping and a bright red maraschino cherry. Diet-Friendly Shamrock Shake Blend the yogurt, milk, mint extract, and sweetener. Combine these four ingredients in your blender and mix on a medium setting until they are well combined. This could take about 15 to 20 seconds. Using yogurt instead of ice cream reduces the fat content of the shake while adding more calcium and probiotics. Using low-fat or nonfat milk cuts down on the number of calories in the shake. Natural sweeteners like raw honey and agave reduce the sugar and number of calories in your shake. The result is a shake with a low glycemic index, making it safer for people with diabetes or those who are at risk for diabetes. Add the green food coloring. Drop 2 or 3 drops of green food coloring into the shake and blend for another 10 to 15 seconds, or until evenly dispersed. You can skip the green food coloring altogether if you are worried about including dyes in your food. Blend in the ice. Add 5 ice cubes to the blender and blend on high until the ice is fully chopped and dispersed through the blender. This could take a few minutes. If the shake is not thick enough to suit your preferences even after the ice is mixed in, blend in another two ice cubes. Note that you may need to pause your blender and stir the contents with a rubber spatula to ensure the top and bottom of the mixture are being evenly blended. Enjoy immediately. As soon as the shake is done, transfer it into a serving glass and enjoy. Healthy Vegan Shamrock Shake Freeze the banana. Peel the banana and cut it into 2-inch (5-cm) chunks. Place these frozen banana chunks in your freezer for 20 to 30 minutes, or until they become frozen solid. You should tray freeze the bananas to prevent them from sticking together. Cover a small cookie sheet with parchment paper and arrange the banana chunks on the sheet in a single layer. Do not let the pieces touch. Stick the cookie sheet in the freezer. Done in this manner, the banana pieces should freeze separately, making them easier to blend into the shake. Blend all the ingredients together. Add the vanilla coconut milk ice cream, frozen banana chunks, 1/4 cup (60 ml) cacao nibs, peppermint oil, almond milk, spinach, and avocado to the blender. Blend on high speed until smooth and evenly colored. This should take anywhere from 30 seconds to 2 minutes, depending on the speed and strength of your blender. The coconut milk ice cream and almond milk remove dairy from the equation. The spinach and avocado give the shamrock shake a great green color without the use of dyes. The cacao nibs add a hint of milk chocolate flavor, which complements the taste of mint. Transfer into serving glasses and sprinkle with cacao nibs. Pour your shake into serving glasses and serve immediately. If desired, sprinkle each shake with additional cacao nibs before serving for an added boost of chocolate flavor.",
  "tyn_model":[
    "milk",
    "ice cream",
    "mint extract",
    "whipped cream",
    "blender",
    "food coloring",
    "refrigerator",
    "banana",
    "green food coloring",
    "serving glass",
    "freezer",
    "cacao nibs",
    "almond milk",
    "sugar",
    "mint syrup",
    "shamrock shake",
    "electric blender",
    "water",
    "bowl",
    "whiskey",
    "yogurt",
    "ice",
    "ice cubes",
    "cookie sheet",
    "spinach",
    "avocado",
    "spoon",
    "pistachio flavor shamrock shake",
    "dairy milk",
    "soymilk or",
    "milk shake",
    "dry pudding",
    "pistachio instant pudding",
    "glass",
    "pistachio shamrock shake",
    "small saucepan",
    "heatproof bowl",
    "strainer or",
    "small colander",
    "strainer",
    "cherry",
    "sweetener",
    "agave",
    "rubber spatula",
    "bananas",
    "parchment paper",
    "shake",
    "vanilla coconut milk ice cream",
    "peppermint oil",
    "coconut milk",
    "milk chocolate",
    "mint"
  ],
  "tyn_section":[

  ]
}