{
  "title":"How to Use Mirrors to Create More Space",
  "url":"https://www.wikihow.com/Use-Mirrors-to-Create-More-Space",
  "category_hierarchy":[
    "Home and Garden",
    "Home Decorating"
  ],
  "methods":[
    {
      "name":"Using Movable Mirrors",
      "steps":[
        {
          "headline":"Place a mirror along the wall in a narrow kitchen.",
          "description":"If you have a narrow kitchen, it can easily feel cramped and uncomfortable. A longer mirror strategically placed along one wall can make a small kitchen feel bigger. Place a mirror running horizontally along one wall of your kitchen, keeping it above cabinets and other furniture so it's visible. You can buy a long mirror at a department store. Hang it alongside one wall in your kitchen. You will be surprised at how much bigger it looks. A single mirror in the kitchen is usually suitable to make your space look bigger. More than one mirror may overwhelm in the kitchen."
        },
        {
          "headline":"Fake a window using a mirror.",
          "description":"Windows can often make a small room feel larger. If you have a room with only one window, you can use a mirror to create the illusion of a window in your living space. Place a mirror directly across from one window in your home. The mirror will reflect images of outdoors, doubling the natural light in the room. It will also make the window-less wall look less closed off."
        },
        {
          "headline":"Add a mirror above your bed.",
          "description":"If you have a small bedroom that's bothering you, try hanging a large mirror over your bed. Place a bigger mirror just above your headboard. If you don't have a headboard, you can simply keep the mirror a few feet up from the end of your mattress. A mirror over your bed creates a sense of depth. This can make a small bedroom feel bigger. Keep the mirror on the wall of your bedroom and not the ceiling."
        },
        {
          "headline":"Use floor length mirrors behind furniture.",
          "description":"In a small space, furniture may feel cramped or cluttered. This issue can easily be corrected by placing large mirrors just behind big pieces of furniture. Choose floor-length mirrors the same width as your furniture. Place the mirrors just behind the furniture so the top sticks out."
        },
        {
          "headline":"Place a mirror near or in an art display.",
          "description":"Densely packed collections of paintings and objects can look cramped. Try inserting small mirrors in areas where you display artwork. If you display artwork on a shelf, use one of the drawers in the shelf to display a mirror. You can also place a standing mirror behind a piece of artwork on a mantel. If you have paintings or other artwork hung up on a wall, hang a mirror next to the paintings as well."
        }
      ]
    },
    {
      "name":"Installing Mirrors",
      "steps":[
        {
          "headline":"Install mirror doors on your closet.",
          "description":"A small closet can make you feel claustrophobic. Have mirror doors installed on your closet, as this can create the illusion of extra space. Closet doors can also create extra room in your home because you do not need to take up space with floor mirrors. If you don't have the time or money for a full installation, you can purchase a hanging mirror at a department store and hang it over the door."
        },
        {
          "headline":"Use a mirror backsplash.",
          "description":"A kitchen backsplash can be made into a mirror to make a small kitchen look larger. If you're renovating, consider a reflective back splash to make the most of your space. In addition to creating the illusion of more space, mirror back splashes are fairly easy to clean."
        },
        {
          "headline":"Add mirrors to cabinet drawers.",
          "description":"If you have a tiny kitchen or bathroom, have mirrors installed on the doors of cabinets. This can be done by simply gluing mirrored tiles or small mirrors to the front of your cabinets. This will make your kitchen feel slightly more open."
        },
        {
          "headline":"Make use of mirrored tiles.",
          "description":"Mirror tiles can be purchased at most home improvement stores. You can create a mirror wall in one room by glueing or nailing mirror tiles to the wall. You can also use them in spaces that feel cramped. For example, in a small bathroom try putting up mirrored tiles adjacent to the shower."
        }
      ]
    },
    {
      "name":"Maximizing Impact without Overdoing It",
      "steps":[
        {
          "headline":"Be strategic about where you place mirrors.",
          "description":"Do not simply hang up your mirrors everywhere in your home. Always take into account what the mirror is reflecting before hanging it up. You want to use mirrors to maximize light sources and emphasize space. Mirrors should reflect a light source in order to brighten a room by creating more light. A mirror facing a blank wall will not do much to brighten your space. Instead, place a mirror across from a window or a well-lit area in your home. You should also avoid placing mirrors in areas where they will reflect things like furniture and clutter. You do not want a mirror to make a room look more cluttered. Instead of having a mirror facing a somewhat messy desk, have it reflect a sleek mantel that only holds a few decorative items."
        },
        {
          "headline":"Do not go overboard with mirrors in the kitchen.",
          "description":"One strategically placed mirror in the kitchen is enough to make the room more open. Too many mirrors can be overwhelming and even look tacky. Mirrors are not usually necessary in the kitchen, so more than one mirror may look odd to visitors. For example, if you opt for a horizontal mirror running down one wall, do not put a mirror on the opposite wall. The effect will be overwhelming."
        },
        {
          "headline":"Avoid ceiling mirrors.",
          "description":"Ceiling mirrors are no longer in fashion. They were popular in the '70's, but many decorators find them tacky. Also, mirrors on the ceiling will not do much to create the illusion of space. Stick to hanging mirrors on the wall. Mirrors can be great in your bedroom if you want to create more space there, as well as more light. A full-length mirror near your closet can work great if it, say, reflects a window or a lamp."
        }
      ]
    }
  ],
  "text":" Using Movable Mirrors Place a mirror along the wall in a narrow kitchen. If you have a narrow kitchen, it can easily feel cramped and uncomfortable. A longer mirror strategically placed along one wall can make a small kitchen feel bigger. Place a mirror running horizontally along one wall of your kitchen, keeping it above cabinets and other furniture so it's visible. You can buy a long mirror at a department store. Hang it alongside one wall in your kitchen. You will be surprised at how much bigger it looks. A single mirror in the kitchen is usually suitable to make your space look bigger. More than one mirror may overwhelm in the kitchen. Fake a window using a mirror. Windows can often make a small room feel larger. If you have a room with only one window, you can use a mirror to create the illusion of a window in your living space. Place a mirror directly across from one window in your home. The mirror will reflect images of outdoors, doubling the natural light in the room. It will also make the window-less wall look less closed off. Add a mirror above your bed. If you have a small bedroom that's bothering you, try hanging a large mirror over your bed. Place a bigger mirror just above your headboard. If you don't have a headboard, you can simply keep the mirror a few feet up from the end of your mattress. A mirror over your bed creates a sense of depth. This can make a small bedroom feel bigger. Keep the mirror on the wall of your bedroom and not the ceiling. Use floor length mirrors behind furniture. In a small space, furniture may feel cramped or cluttered. This issue can easily be corrected by placing large mirrors just behind big pieces of furniture. Choose floor-length mirrors the same width as your furniture. Place the mirrors just behind the furniture so the top sticks out. Place a mirror near or in an art display. Densely packed collections of paintings and objects can look cramped. Try inserting small mirrors in areas where you display artwork. If you display artwork on a shelf, use one of the drawers in the shelf to display a mirror. You can also place a standing mirror behind a piece of artwork on a mantel. If you have paintings or other artwork hung up on a wall, hang a mirror next to the paintings as well. Installing Mirrors Install mirror doors on your closet. A small closet can make you feel claustrophobic. Have mirror doors installed on your closet, as this can create the illusion of extra space. Closet doors can also create extra room in your home because you do not need to take up space with floor mirrors. If you don't have the time or money for a full installation, you can purchase a hanging mirror at a department store and hang it over the door. Use a mirror backsplash. A kitchen backsplash can be made into a mirror to make a small kitchen look larger. If you're renovating, consider a reflective back splash to make the most of your space. In addition to creating the illusion of more space, mirror back splashes are fairly easy to clean. Add mirrors to cabinet drawers. If you have a tiny kitchen or bathroom, have mirrors installed on the doors of cabinets. This can be done by simply gluing mirrored tiles or small mirrors to the front of your cabinets. This will make your kitchen feel slightly more open. Make use of mirrored tiles. Mirror tiles can be purchased at most home improvement stores. You can create a mirror wall in one room by glueing or nailing mirror tiles to the wall. You can also use them in spaces that feel cramped. For example, in a small bathroom try putting up mirrored tiles adjacent to the shower. Maximizing Impact without Overdoing It Be strategic about where you place mirrors. Do not simply hang up your mirrors everywhere in your home. Always take into account what the mirror is reflecting before hanging it up. You want to use mirrors to maximize light sources and emphasize space. Mirrors should reflect a light source in order to brighten a room by creating more light. A mirror facing a blank wall will not do much to brighten your space. Instead, place a mirror across from a window or a well-lit area in your home. You should also avoid placing mirrors in areas where they will reflect things like furniture and clutter. You do not want a mirror to make a room look more cluttered. Instead of having a mirror facing a somewhat messy desk, have it reflect a sleek mantel that only holds a few decorative items. Do not go overboard with mirrors in the kitchen. One strategically placed mirror in the kitchen is enough to make the room more open. Too many mirrors can be overwhelming and even look tacky. Mirrors are not usually necessary in the kitchen, so more than one mirror may look odd to visitors. For example, if you opt for a horizontal mirror running down one wall, do not put a mirror on the opposite wall. The effect will be overwhelming. Avoid ceiling mirrors. Ceiling mirrors are no longer in fashion. They were popular in the '70's, but many decorators find them tacky. Also, mirrors on the ceiling will not do much to create the illusion of space. Stick to hanging mirrors on the wall. Mirrors can be great in your bedroom if you want to create more space there, as well as more light. A full-length mirror near your closet can work great if it, say, reflects a window or a lamp.",
  "tyn_model":[
    "mirror",
    "mirrors",
    "mirrored tiles",
    "home improvement stores",
    "mirrored"
  ],
  "tyn_section":[

  ]
}