{
  "title":"How to Clean Linoleum Floors",
  "url":"https://www.wikihow.com/Clean-Linoleum-Floors",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Floors and Stairs",
    "Floor Types",
    "Linoleum Flooring"
  ],
  "parts":[
    {
      "name":"Cleaning Your Linoleum Floors",
      "steps":[
        {
          "headline":"Clean up excess bits of dirt.",
          "description":"Sweep, dust mop or vacuum your linoleum floor to remove excess dirt on the floor’s surface. Focus on collecting dirt from areas underneath cabinets, cupboards, and appliances. If you vacuum your linoleum floor, be sure to change the vacuum settings to clean hard surfaces rather than carpet."
        },
        {
          "headline":"Try mixing a natural cleaning solution.",
          "description":"Fill up a large bucket about ¼ - ½ of the way with lukewarm water. Mix in equal parts of white vinegar. The exact measurements on the water to vinegar ratios are rather loose, because most linoleum floors do not need an entire bucket’s worth of cleaning solution to clean the floor surface. Besides, standing water can damage linoleum, so you never want to use more water than necessary. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFilip Boksa\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru, King of Maids\t\t\t\t\t\t\t\tFilip Boksa is the CEO and Founder of King of Maids, a U.S. based home cleaning service that helps clients with cleaning and organization. Filip Boksa\t\t\tCleaning Guru, King of Maids\t\t\t\tOur Expert Agrees: Use one gallon of hot water, one cup of vinegar, and a couple of drops of dish soap. Apply the mixture to your floors with a microfiber mop to gently lift dirt and grime."
        },
        {
          "headline":"Try mixing a chemical cleaning solution.",
          "description":"Use a cleaning product specifically intended for cleaning linoleum floors. Linoleum-specific cleaning products can be found in most flooring and home department stores. Most linoleum floor cleaners need to be diluted with water, so follow the manufacturer’s instructions by mixing in the appropriate amount of cleaning detergent in a large bucket filled with the correct measurements of water. If using a chemical cleaner, make sure that your cleaning area is well ventilated. Alternatively, you could mix about 6-7 drops of a mild detergent (such as dish soap) with approximately one gallon of warm water as your cleaning solution. Bear in mind that this solution will clean and disinfect your floors, but a linoleum-specific cleaner might remove dirt a little better. Chemicals that have high pH levels can be extremely damaging to linoleum flooring, so stay away from cleaning products like ammonia when cleaning your linoleum floors."
        },
        {
          "headline":"Mop the floor.",
          "description":"Dip a mop into your cleaning solution, and thoroughly wring out excess solution. Your mop should be damp, rather than dripping wet. Mop the floor in sections, working in about 4-6 square foot areas for each dip of the mop. If you want to clean you floors more thoroughly, you can use a soft bristled scrub brush instead of a mop. This method would most likely require you to work on your hands and knees. If you are cleaning your floor with a vinegar and water solution, you don’t need to rinse off your floor. Vinegar is a natural disinfectant, and the vinegar and water will evaporate along with the vinegar smell."
        },
        {
          "headline":"Rinse the floor.",
          "description":"After you have mopped the whole floor, dump out the bucket of cleaning solution and water, and thoroughly rinse out the mop with clean water. Refill the bucket of water with cool, clean water. Dip the clean mop into the clean water, wring out any excess water, and rinse the cleaning solution from the floor. Again, work in areas approximately 4-6 square foot areas for each time you dip the mop into the water. When you are finished rinsing the floor, dump out the bucket of water. If chemical cleaning solutions are not rinsed from the floor, they will attract tiny particles of dust and dirt, that will be harder to remove later."
        },
        {
          "headline":"Dry the floor.",
          "description":"Wipe down the entire floor with a towel, cleaning cloth, or a terry cloth covered mop head. Allow the floor to completely dry being moving back furniture or allow traffic on the floor surface."
        }
      ]
    },
    {
      "name":"Polishing Your Linoleum Floor",
      "steps":[
        {
          "headline":"Wash your floor.",
          "description":"Before you polish your floor, it has to be thoroughly cleaned. Vacuum and wash your floor as you normally would, using the basic cleaning method. Make sure that the floor is completely dry before proceeding to add polish. Be sure to rinse the floor thoroughly after washing. Any leftover cleaning residue could negatively affect the polish."
        },
        {
          "headline":"Pour the polish into a bucket.",
          "description":"Do not pour the polish directly on the floor. Instead, use a clean bucket to contain the polish. Be sure to follow the manufacturer’s instruction on the back of the polish to know how much you should be using."
        },
        {
          "headline":"Add the polish to the floor.",
          "description":"Apply linoleum polish to the floor, using a clean, damp mop. Apply 1-3 coats of polish in approximately 3-4 square foot areas. Allow each coat to thoroughly dry by wait approximately 30 minutes in between coats. Let the final coat of polish dry for approximately an hour before moving back furniture and walking on the floor surface. Try to restrict the number of times you drag your mop over a given area. Moving your mop over an area more than once or twice runs the risk of leaving streaks in the polish."
        }
      ]
    }
  ],
  "text":" Cleaning Your Linoleum Floors Clean up excess bits of dirt. Sweep, dust mop or vacuum your linoleum floor to remove excess dirt on the floor’s surface. Focus on collecting dirt from areas underneath cabinets, cupboards, and appliances. If you vacuum your linoleum floor, be sure to change the vacuum settings to clean hard surfaces rather than carpet. Try mixing a natural cleaning solution. Fill up a large bucket about ¼ - ½ of the way with lukewarm water. Mix in equal parts of white vinegar. The exact measurements on the water to vinegar ratios are rather loose, because most linoleum floors do not need an entire bucket’s worth of cleaning solution to clean the floor surface. Besides, standing water can damage linoleum, so you never want to use more water than necessary. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tFilip Boksa\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCleaning Guru, King of Maids\t\t\t\t\t\t\t\tFilip Boksa is the CEO and Founder of King of Maids, a U.S. based home cleaning service that helps clients with cleaning and organization. Filip Boksa\t\t\tCleaning Guru, King of Maids\t\t\t\tOur Expert Agrees: Use one gallon of hot water, one cup of vinegar, and a couple of drops of dish soap. Apply the mixture to your floors with a microfiber mop to gently lift dirt and grime. Try mixing a chemical cleaning solution. Use a cleaning product specifically intended for cleaning linoleum floors. Linoleum-specific cleaning products can be found in most flooring and home department stores. Most linoleum floor cleaners need to be diluted with water, so follow the manufacturer’s instructions by mixing in the appropriate amount of cleaning detergent in a large bucket filled with the correct measurements of water. If using a chemical cleaner, make sure that your cleaning area is well ventilated. Alternatively, you could mix about 6-7 drops of a mild detergent (such as dish soap) with approximately one gallon of warm water as your cleaning solution. Bear in mind that this solution will clean and disinfect your floors, but a linoleum-specific cleaner might remove dirt a little better. Chemicals that have high pH levels can be extremely damaging to linoleum flooring, so stay away from cleaning products like ammonia when cleaning your linoleum floors. Mop the floor. Dip a mop into your cleaning solution, and thoroughly wring out excess solution. Your mop should be damp, rather than dripping wet. Mop the floor in sections, working in about 4-6 square foot areas for each dip of the mop. If you want to clean you floors more thoroughly, you can use a soft bristled scrub brush instead of a mop. This method would most likely require you to work on your hands and knees. If you are cleaning your floor with a vinegar and water solution, you don’t need to rinse off your floor. Vinegar is a natural disinfectant, and the vinegar and water will evaporate along with the vinegar smell. Rinse the floor. After you have mopped the whole floor, dump out the bucket of cleaning solution and water, and thoroughly rinse out the mop with clean water. Refill the bucket of water with cool, clean water. Dip the clean mop into the clean water, wring out any excess water, and rinse the cleaning solution from the floor. Again, work in areas approximately 4-6 square foot areas for each time you dip the mop into the water. When you are finished rinsing the floor, dump out the bucket of water. If chemical cleaning solutions are not rinsed from the floor, they will attract tiny particles of dust and dirt, that will be harder to remove later. Dry the floor. Wipe down the entire floor with a towel, cleaning cloth, or a terry cloth covered mop head. Allow the floor to completely dry being moving back furniture or allow traffic on the floor surface. Polishing Your Linoleum Floor Wash your floor. Before you polish your floor, it has to be thoroughly cleaned. Vacuum and wash your floor as you normally would, using the basic cleaning method. Make sure that the floor is completely dry before proceeding to add polish. Be sure to rinse the floor thoroughly after washing. Any leftover cleaning residue could negatively affect the polish. Pour the polish into a bucket. Do not pour the polish directly on the floor. Instead, use a clean bucket to contain the polish. Be sure to follow the manufacturer’s instruction on the back of the polish to know how much you should be using. Add the polish to the floor. Apply linoleum polish to the floor, using a clean, damp mop. Apply 1-3 coats of polish in approximately 3-4 square foot areas. Allow each coat to thoroughly dry by wait approximately 30 minutes in between coats. Let the final coat of polish dry for approximately an hour before moving back furniture and walking on the floor surface. Try to restrict the number of times you drag your mop over a given area. Moving your mop over an area more than once or twice runs the risk of leaving streaks in the polish.",
  "tyn_model":[
    "water",
    "mop",
    "vinegar",
    "bucket",
    "polish",
    "vacuum",
    "dish soap",
    "natural cleaning solution",
    "white vinegar",
    "hot water",
    "microfiber mop",
    "cleaning detergent",
    "chemical cleaner",
    "mild detergent",
    "ammonia",
    "cleaning solution",
    "scrub brush",
    "terry cloth covered mop",
    "linoleum floor",
    "linoleum polish"
  ],
  "tyn_section":[

  ]
}