{
  "title":"How to Make Walnut Babies",
  "url":"https://www.wikihow.com/Make-Walnut-Babies",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts",
    "Nut and Seed Art and Craft"
  ],
  "parts":[
    {
      "name":"Preparing the Walnuts",
      "steps":[
        {
          "headline":"Rest the walnut on a cutting board.",
          "description":""
        },
        {
          "headline":"Use a knife or blade of a strong pair of scissors to insert into the round end of the walnut.",
          "description":"This end is the weakest part of the walnut."
        },
        {
          "headline":"Gently tap the walnut on the board.",
          "description":"Do this a few times and the prised open end should start to split, leaving the walnut in halves."
        }
      ]
    },
    {
      "name":"Adding the Cradle Hanger",
      "steps":[
        {
          "headline":"Cut a length of the narrow ribbon.",
          "description":"Cut it long enough to allow for the cradle to hang from a hook or tree branch."
        },
        {
          "headline":"Glue each end of the ribbon to either side of the walnut half.",
          "description":"Keep it balanced."
        }
      ]
    },
    {
      "name":"Making the Baby",
      "steps":[
        {
          "headline":"Make the body first.",
          "description":"Wind a pipe cleaner around a pencil to make a coil. The coiled pipe cleaner will give the impression of a baby's body beneath the cloth you'll add shortly."
        },
        {
          "headline":"Add the head to the coil.",
          "description":"Glue the bead at one end of the coil."
        }
      ]
    },
    {
      "name":"Preparing the Cradle Bedding",
      "steps":[
        {
          "headline":"Make a pillow first.",
          "description":"Cut a small rectangle from the scrap fabric."
        },
        {
          "headline":"Stuff a little wad of cotton wool or toy stuffing underneath it to form a pillow shape.",
          "description":"Glue into place at one end of the walnut half."
        },
        {
          "headline":"Cut a blanket or duvet for the baby.",
          "description":"Cut the scrap fabric into a narrowed down half circle shape, the same shape as the tapering of the walnut. This piece needs to be big enough to fit over baby's body and the lower part of the walnut shell. This will be added to the cradle in the next section."
        }
      ]
    },
    {
      "name":"Placing the Baby in the Walnut Cradle",
      "steps":[
        {
          "headline":"Place the baby inside the walnut half.",
          "description":"When adding, leave space at one end for the baby's head. Glue in place. The head should sit up a little, as if the baby is looking up and out."
        },
        {
          "headline":"Glue the blanket or duvet scrap piece over the baby's body.",
          "description":"It should cover the body completely but stop underneath the baby's head; adjust as needed. Glue all around the edges. This stops fraying from happening."
        },
        {
          "headline":"Decorate baby's face.",
          "description":"Use the fine marker to draw eyes and a smile. The eyes can show baby asleep or awake. It's up to you whether you add more features, such as two nostrils for a nose or a little squiggle for \"hair\"."
        },
        {
          "headline":"Done.",
          "description":"The walnut baby can now be hung on a tree branch, off a hook, or anywhere else. You can also rest the walnut baby on a shelf. Make as many more as you please."
        }
      ]
    }
  ],
  "text":" Preparing the Walnuts Rest the walnut on a cutting board.  Use a knife or blade of a strong pair of scissors to insert into the round end of the walnut. This end is the weakest part of the walnut. Gently tap the walnut on the board. Do this a few times and the prised open end should start to split, leaving the walnut in halves. Adding the Cradle Hanger Cut a length of the narrow ribbon. Cut it long enough to allow for the cradle to hang from a hook or tree branch. Glue each end of the ribbon to either side of the walnut half. Keep it balanced. Making the Baby Make the body first. Wind a pipe cleaner around a pencil to make a coil. The coiled pipe cleaner will give the impression of a baby's body beneath the cloth you'll add shortly. Add the head to the coil. Glue the bead at one end of the coil. Preparing the Cradle Bedding Make a pillow first. Cut a small rectangle from the scrap fabric. Stuff a little wad of cotton wool or toy stuffing underneath it to form a pillow shape. Glue into place at one end of the walnut half. Cut a blanket or duvet for the baby. Cut the scrap fabric into a narrowed down half circle shape, the same shape as the tapering of the walnut. This piece needs to be big enough to fit over baby's body and the lower part of the walnut shell. This will be added to the cradle in the next section. Placing the Baby in the Walnut Cradle Place the baby inside the walnut half. When adding, leave space at one end for the baby's head. Glue in place. The head should sit up a little, as if the baby is looking up and out. Glue the blanket or duvet scrap piece over the baby's body. It should cover the body completely but stop underneath the baby's head; adjust as needed. Glue all around the edges. This stops fraying from happening. Decorate baby's face. Use the fine marker to draw eyes and a smile. The eyes can show baby asleep or awake. It's up to you whether you add more features, such as two nostrils for a nose or a little squiggle for \"hair\". Done. The walnut baby can now be hung on a tree branch, off a hook, or anywhere else. You can also rest the walnut baby on a shelf. Make as many more as you please.",
  "tyn_model":[
    "glue",
    "walnut",
    "ribbon",
    "pipe cleaner",
    "fabric",
    "blanket",
    "cutting board",
    "knife",
    "scissors",
    "pencil",
    "cloth",
    "pillow",
    "cotton wool",
    "duvet scrap",
    "fine marker"
  ],
  "tyn_section":[

  ]
}