{
  "title":"How to Make Veal Milanese",
  "url":"https://www.wikihow.com/Make-Veal-Milanese",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "European Cuisine",
    "Italian Cuisine"
  ],
  "steps":[
    {
      "headline":"In one dish, combine breadcrumbs and Parmesan cheese.",
      "description":""
    },
    {
      "headline":"In another dish, combine and mix egg, milk, salt, and pepper.",
      "description":""
    },
    {
      "headline":"Pour vegetable oil into a shallow frying pan.",
      "description":"Heat to 375 °F (191 °C)."
    },
    {
      "headline":"Take one piece of veal, and coat entirely with egg mixture.",
      "description":""
    },
    {
      "headline":"Transfer the egg-coated piece of veal to the dry dish, and coat liberally with breadcrumbs.",
      "description":""
    },
    {
      "headline":"Repeat coating process with the other piece of veal.",
      "description":""
    },
    {
      "headline":"Test heat of vegetable oil by dropping a pinch of breadcrumbs into the frying pan, if the breadcrumbs quickly fry, then the oil is ready.",
      "description":""
    },
    {
      "headline":"Place one piece of veal into frying pan for 2 minutes; flip veal, and fry for another 2 minutes.",
      "description":""
    },
    {
      "headline":"Remove veal from frying pan, and set aside on a paper towel.",
      "description":""
    },
    {
      "headline":"Repeat frying process with the other piece of veal.",
      "description":""
    },
    {
      "headline":"Serve both pieces of veal on plate with slices of lemon.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" In one dish, combine breadcrumbs and Parmesan cheese.  In another dish, combine and mix egg, milk, salt, and pepper.  Pour vegetable oil into a shallow frying pan. Heat to 375 °F (191 °C). Take one piece of veal, and coat entirely with egg mixture.  Transfer the egg-coated piece of veal to the dry dish, and coat liberally with breadcrumbs.  Repeat coating process with the other piece of veal.  Test heat of vegetable oil by dropping a pinch of breadcrumbs into the frying pan, if the breadcrumbs quickly fry, then the oil is ready.  Place one piece of veal into frying pan for 2 minutes; flip veal, and fry for another 2 minutes.  Remove veal from frying pan, and set aside on a paper towel.  Repeat frying process with the other piece of veal.  Serve both pieces of veal on plate with slices of lemon.  Finished. ",
  "tyn_model":[
    "egg",
    "veal",
    "frying pan",
    "vegetable oil",
    "parmesan cheese",
    "milk",
    "salt",
    "pepper",
    "shallow frying pan",
    "breadcrumbs",
    "oil",
    "paper towel",
    "lemon"
  ],
  "tyn_section":[

  ]
}