{
  "title":"How to Play Beer Hockey",
  "url":"https://www.wikihow.com/Play-Beer-Hockey",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "steps":[
    {
      "headline":"Play with four players, teammates sit directly across from each other.",
      "description":""
    },
    {
      "headline":"Deal out a full deck of cards.",
      "description":"One to each player until the deck is gone."
    },
    {
      "headline":"Place a bottle cap, coin, or something similar in size to use as the puck.",
      "description":"Keep it in the middle of the table."
    },
    {
      "headline":"Start the game by having the player to left of the dealer play the first card.",
      "description":""
    },
    {
      "headline":"Scoring as many goals as possible throughout the 3 periods is the object of the game.",
      "description":"To score a goal, a team needs to have possession of the puck."
    },
    {
      "headline":"Gain possession of the puck by playing either a 3 or 7",
      "description":""
    },
    {
      "headline":"Regain possession of the puck, if your team doesn't have it.",
      "description":"Example (Player before you plays a 9 then you play a 9, you take possession.)"
    },
    {
      "headline":"Playing 3's and 7's can only gain possession not score.",
      "description":""
    },
    {
      "headline":"Move the puck in front of the player who has gained possession.",
      "description":"While possessing the puck you or your teammate can score by laying the same card as the opposite team player played before you. Example (If your team has possession and the player in front of you lays a 5 and you play a 5, you score.)"
    },
    {
      "headline":"Get scored on, you must drink until the player on your left tells you to stop.",
      "description":"After scoring, the puck goes back into the middle and players must regain possession. Ending in a tie after 3 periods an overtime period is played to determine the winner. It isn't a sudden death overtime. An entire period must be played."
    },
    {
      "headline":"Continue overtimes until you have a winner.",
      "description":""
    }
  ],
  "text":" Play with four players, teammates sit directly across from each other.  Deal out a full deck of cards. One to each player until the deck is gone. Place a bottle cap, coin, or something similar in size to use as the puck. Keep it in the middle of the table. Start the game by having the player to left of the dealer play the first card.  Scoring as many goals as possible throughout the 3 periods is the object of the game. To score a goal, a team needs to have possession of the puck. Gain possession of the puck by playing either a 3 or 7  Regain possession of the puck, if your team doesn't have it. Example (Player before you plays a 9 then you play a 9, you take possession.) Playing 3's and 7's can only gain possession not score.  Move the puck in front of the player who has gained possession. While possessing the puck you or your teammate can score by laying the same card as the opposite team player played before you. Example (If your team has possession and the player in front of you lays a 5 and you play a 5, you score.) Get scored on, you must drink until the player on your left tells you to stop. After scoring, the puck goes back into the middle and players must regain possession. Ending in a tie after 3 periods an overtime period is played to determine the winner. It isn't a sudden death overtime. An entire period must be played. Continue overtimes until you have a winner. ",
  "tyn_model":[
    "puck",
    "cards",
    "bottle cap",
    "coin",
    "drink"
  ],
  "tyn_section":[

  ]
}