{
  "title":"How to Make Fabric Flower Hair Clips Tied with Ribbons",
  "url":"https://www.wikihow.com/Make-Fabric-Flower-Hair-Clips-Tied-with-Ribbons",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts",
    "Leaf and Flower Crafts"
  ],
  "steps":[
    {
      "headline":"Make a petal.",
      "description":"Cut out a piece of cotton cloth in a rectangle shape; fold it in half. Sew a 'U' shape along the edges of the cloth as the picture shows."
    },
    {
      "headline":"Make flower shapes.",
      "description":"String the thread to make a petal, and then make another four petals linked with the first one. Sew both ends and adjust a shape of flower. Do the same to make the other flower with three petals."
    },
    {
      "headline":"Embellish the flower.",
      "description":"Glue the small flower on the large one; stick a plastic pearl button in the middle of the flowers."
    },
    {
      "headline":"Fold a ribbon bow.",
      "description":"Fold a bow with a strip of ribbon as the picture shows. Glue it to fix the shape."
    },
    {
      "headline":"Finish the flower.",
      "description":"Cross a pink ribbon to make a circle. Stick the ribbon bow and the pink ribbon down the flower. Stick the pink one at the bottom. Glue a piece of round cloth at the back of the pink ribbon."
    },
    {
      "headline":"Glue a strip of white ribbon around the hair clip to make it more beautiful.",
      "description":"Stick the flower on it."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Make a petal. Cut out a piece of cotton cloth in a rectangle shape; fold it in half. Sew a 'U' shape along the edges of the cloth as the picture shows. Make flower shapes. String the thread to make a petal, and then make another four petals linked with the first one. Sew both ends and adjust a shape of flower. Do the same to make the other flower with three petals. Embellish the flower. Glue the small flower on the large one; stick a plastic pearl button in the middle of the flowers. Fold a ribbon bow. Fold a bow with a strip of ribbon as the picture shows. Glue it to fix the shape. Finish the flower. Cross a pink ribbon to make a circle. Stick the ribbon bow and the pink ribbon down the flower. Stick the pink one at the bottom. Glue a piece of round cloth at the back of the pink ribbon. Glue a strip of white ribbon around the hair clip to make it more beautiful. Stick the flower on it. Finished. ",
  "tyn_model":[
    "ribbon",
    "pink ribbon",
    "cotton cloth",
    "thread",
    "glue"
  ],
  "tyn_section":[

  ]
}