{
  "title":"How to Make German Pancakes",
  "url":"https://www.wikihow.com/Make-German-Pancakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Pancakes"
  ],
  "methods":[
    {
      "name":"Making Pfannkuchen",
      "steps":[
        {
          "headline":"Learn about Pfannkuchen.",
          "description":"Pfannkuchen is a generic name for a sweet pancake (literally, Pfannkuchen) make in a pan either on the stove or in the oven. Pfannkuchen are a year-round favorite that can be served topped with any number of things from applesauce to powdered sugar and even peanut butter. There is no one standard recipe for Pfannkuchen, with different variations among families and geographic regions. Some variations have fruit such as cherries, blueberries, or apples folded in to them. Pfannkuchen is also known by different names within Germany including Eierkuchen, Flädle in Swabia, Schmarrn in Bavaria (which is a smashed up Pfannkuchen), or Pankech in the region around Bonn and Koblenz (called the Eifel)."
        },
        {
          "headline":"Gather supplies.",
          "description":"Before you can make your Pfannkuchen, gather the ingredients you need to make them. The recipe is so simple that you may already have everything at home. If not, the ingredients are available in any supermarket. For a Pfannkuchen that serves four people you’ll need the following ingredients: 3 large eggs; 1/2 cup all-purpose flour; 1/2 cup whole milk; 1/4 teaspoon kosher salt; 1/2 teaspoon vanilla extract; 2 tablespoons unsalted butter; 2 tablespoons fresh lemon juice (optional); 1/2 cup fruit jam (optional); 2 tablespoons confectioners' sugar. The traditional topping for Pfannkuchen is either applesauce or powdered sugar. However, consider other options such as marmalade, fresh fruit, peanut butter, Nutella. Pflaumenmus, which is a delightfully spiced plum spread, is another excellent choice."
        },
        {
          "headline":"Preheat the oven.",
          "description":"Before you can enjoy your Pfannkuchen, you need to prepare it. Preheating your over to 400° F before you start mixing ingredients will ensure that you can eat the Pfannkuchen as quickly as possible. This simple recipe calls for baking the Pfannkuchen in the oven in a pan, such as a cast iron pan, at a temperature of 400° F. Other recipes will cook the Pfannkuchen directly on the stovetop. You can try cooking the Pfannkuchen using both methods."
        },
        {
          "headline":"Mix the ingredients.",
          "description":"You’ll need to mix your ingredients together before you can put them in the pan and then the oven. It’s important to mix them in the order in which they’re listed so that you achieve the best results. Whisk the 3 large eggs to combine them. After you’ve whisked the eggs, add the ½ cup flour to the egg mixture. Continue to whisk the eggs and flour until they’re smooth. When your egg and flour mixture is smooth, add the ½ cup whole milk, ¼ teaspoon kosher salt, and ½ teaspoon vanilla. Mix all of the ingredients together until they’re well incorporated and then set aside for a moment while you prepare the pan."
        },
        {
          "headline":"Prepare the pan.",
          "description":"Once you’re mixed the ingredients, you’ll need to prepare the pan to cook the Pfannkuchen. You can use any kind of larger frying pan, but a cast-iron skillet will give you the best results. Add the 2 tablespoons unsalted butter to the skillet and then place it in the pre-heated oven until the butter melts. When the butter has melted, remove the pan from the oven and quickly pour the batter into the pan."
        },
        {
          "headline":"Cook the Pfannkuchen.",
          "description":"You’re Pfannkuchen are almost ready and only need another few minutes to cook in the oven. The mixture in the skillet will bake up into a golden and fluffy pancake before your eyes. Return the pan to the oven after you’ve poured in the mixture. Bake at 400° F for about 15 minutes. The Pfannkuchen is ready when it is puffed up and a golden color."
        },
        {
          "headline":"Top the Pfannkuchen and enjoy!",
          "description":"Drizzle your Pfannkuchen with some lemon juice and spread a topping of your choice from powdered sugar to applesauce. The time has come for you to enjoy your Pfannkuchen! If you don’t like lemon juice, then omit this step from the recipe. The traditional topping for Pfannkuchen is either applesauce or powdered sugar. However, consider other options such as marmalade, fresh fruit, peanut butter, Nutella. Pflaumenmus, which is a delightfully spiced plum spread, is another excellent choice. Sprinkle with additional powdered sugar if you like."
        }
      ]
    },
    {
      "name":"Making Kartoffelpuffer",
      "steps":[
        {
          "headline":"Learn about Kartoffelpuffer.",
          "description":"Kartoffelpuffer is a basic name for a potato (Kartoffel) pancake make in a pan. They are a favorite food in Germany from fall to spring, and are often a food seen at festivals such as Oktoberfest or at Christmas markets. Kartoffelpuffer are usually served with an herbed sour cream called Kräuterquark or applesauce, though you could even put ketchup on them. There is no one standard recipe for Kartoffelpuffer, with different variations among families and geographic regions. Kartoffelpuffer are also known by different names within Germany including Erdäpfelpuffer and Reiberdatschi in Bavaria, Dotsch in the Palatinate, and Kartoffelplätzcher in Hesse."
        },
        {
          "headline":"Gather supplies.",
          "description":"Before you can make Kartoffelpuffer, gather the ingredients you need. The recipe is quite simple and you may already have everything at home. If not, the ingredients are available in any supermarket. For enough Kartoffelpuffer for eight people, you’ll need the following ingredients: 3 large russet potatoes (about 2 1⁄2 lb. ); 2 medium yellow onions; 1⁄3 cup all-purpose flour; 3 eggs; kosher salt to taste; ground white pepper to taste; canola oil for frying. Kartoffelpuffer are usually served with applesauce or an herbed sour cream called Kräuterquark. You could even put ketchup on them."
        },
        {
          "headline":"Prep the ingredients.",
          "description":"You’ll need to prepare your ingredients before you can fry them in a pan. It’s important to follow the preparation directions exactly so that you get the best results on your Kartoffelpuffer. Peel the 3 large Russet potatoes potatoes and 2 medium yellow onions and then finely grate them with a box grater. Place the grated potatoes and onions in a colander over a separate bowl. Let the mixture drain, squeezing it until it is dry. Once the potato mixture is dry, transfer it to another bowl. Slowly pour the liquid from squeezing the potatoes. Once you reach a milky starch at the bottom of the bowl, save it and pour on top of the drained potato mixture. Add the 1⁄3 cup all-purpose flour and 3 eggs to the potato and onion mixture. Season with salt and white pepper and fold the mixture until it is evenly combined. Set the mixture aside for a moment."
        },
        {
          "headline":"Prepare the pan.",
          "description":"You’ll need to prepare the pan in order to cook your Kartoffelpuffer. You can use any kind of pan or skillet, but one that is approximately 8” will work best. Heat 1⁄4 cup canola oil in the skillet over medium heat. You’ll be working in batches, so prepare a few Kartoffelpuffer while the oil heats up. To make the Kartoffelpuffer form, measure 1⁄2 cup potato mixture, flatten it into a 4-5\" pancake with your hand. Once you have a few raw Kartoffelpuffer formed, add them to skillet and fry. Flip them once until they are a golden color and cooked through. It will take about 8 minutes to finish each batch. Transfer finished Kartoffelpuffer to a paper towel-lined baking sheet or plate to remove excess oil. Repeat the process with the remaining mixture until with more oil, as needed, and remaining potato mixture. Serve pancakes with applesauce on the side."
        },
        {
          "headline":"Top the Kartoffelpuffer and enjoy!",
          "description":"Add the topping of your choice to the Kartoffelpuffer. The time has come for you to enjoy your Pfannkuchen! Kartoffelpuffer are usually served with applesauce or an herbed sour cream called Kräuterquark. You could even put ketchup on them."
        }
      ]
    }
  ],
  "text":" Making Pfannkuchen Learn about Pfannkuchen. Pfannkuchen is a generic name for a sweet pancake (literally, Pfannkuchen) make in a pan either on the stove or in the oven. Pfannkuchen are a year-round favorite that can be served topped with any number of things from applesauce to powdered sugar and even peanut butter. There is no one standard recipe for Pfannkuchen, with different variations among families and geographic regions. Some variations have fruit such as cherries, blueberries, or apples folded in to them. Pfannkuchen is also known by different names within Germany including Eierkuchen, Flädle in Swabia, Schmarrn in Bavaria (which is a smashed up Pfannkuchen), or Pankech in the region around Bonn and Koblenz (called the Eifel). Gather supplies. Before you can make your Pfannkuchen, gather the ingredients you need to make them. The recipe is so simple that you may already have everything at home. If not, the ingredients are available in any supermarket. For a Pfannkuchen that serves four people you’ll need the following ingredients: 3 large eggs; 1/2 cup all-purpose flour; 1/2 cup whole milk; 1/4 teaspoon kosher salt; 1/2 teaspoon vanilla extract; 2 tablespoons unsalted butter; 2 tablespoons fresh lemon juice (optional); 1/2 cup fruit jam (optional); 2 tablespoons confectioners' sugar. The traditional topping for Pfannkuchen is either applesauce or powdered sugar. However, consider other options such as marmalade, fresh fruit, peanut butter, Nutella. Pflaumenmus, which is a delightfully spiced plum spread, is another excellent choice. Preheat the oven. Before you can enjoy your Pfannkuchen, you need to prepare it. Preheating your over to 400° F before you start mixing ingredients will ensure that you can eat the Pfannkuchen as quickly as possible. This simple recipe calls for baking the Pfannkuchen in the oven in a pan, such as a cast iron pan, at a temperature of 400° F. Other recipes will cook the Pfannkuchen directly on the stovetop. You can try cooking the Pfannkuchen using both methods. Mix the ingredients. You’ll need to mix your ingredients together before you can put them in the pan and then the oven. It’s important to mix them in the order in which they’re listed so that you achieve the best results. Whisk the 3 large eggs to combine them. After you’ve whisked the eggs, add the ½ cup flour to the egg mixture. Continue to whisk the eggs and flour until they’re smooth. When your egg and flour mixture is smooth, add the ½ cup whole milk, ¼ teaspoon kosher salt, and ½ teaspoon vanilla. Mix all of the ingredients together until they’re well incorporated and then set aside for a moment while you prepare the pan. Prepare the pan. Once you’re mixed the ingredients, you’ll need to prepare the pan to cook the Pfannkuchen. You can use any kind of larger frying pan, but a cast-iron skillet will give you the best results. Add the 2 tablespoons unsalted butter to the skillet and then place it in the pre-heated oven until the butter melts. When the butter has melted, remove the pan from the oven and quickly pour the batter into the pan. Cook the Pfannkuchen. You’re Pfannkuchen are almost ready and only need another few minutes to cook in the oven. The mixture in the skillet will bake up into a golden and fluffy pancake before your eyes. Return the pan to the oven after you’ve poured in the mixture. Bake at 400° F for about 15 minutes. The Pfannkuchen is ready when it is puffed up and a golden color. Top the Pfannkuchen and enjoy! Drizzle your Pfannkuchen with some lemon juice and spread a topping of your choice from powdered sugar to applesauce. The time has come for you to enjoy your Pfannkuchen! If you don’t like lemon juice, then omit this step from the recipe. The traditional topping for Pfannkuchen is either applesauce or powdered sugar. However, consider other options such as marmalade, fresh fruit, peanut butter, Nutella. Pflaumenmus, which is a delightfully spiced plum spread, is another excellent choice. Sprinkle with additional powdered sugar if you like. Making Kartoffelpuffer Learn about Kartoffelpuffer. Kartoffelpuffer is a basic name for a potato (Kartoffel) pancake make in a pan. They are a favorite food in Germany from fall to spring, and are often a food seen at festivals such as Oktoberfest or at Christmas markets. Kartoffelpuffer are usually served with an herbed sour cream called Kräuterquark or applesauce, though you could even put ketchup on them. There is no one standard recipe for Kartoffelpuffer, with different variations among families and geographic regions. Kartoffelpuffer are also known by different names within Germany including Erdäpfelpuffer and Reiberdatschi in Bavaria, Dotsch in the Palatinate, and Kartoffelplätzcher in Hesse. Gather supplies. Before you can make Kartoffelpuffer, gather the ingredients you need. The recipe is quite simple and you may already have everything at home. If not, the ingredients are available in any supermarket. For enough Kartoffelpuffer for eight people, you’ll need the following ingredients: 3 large russet potatoes (about 2 1⁄2 lb. ); 2 medium yellow onions; 1⁄3 cup all-purpose flour; 3 eggs; kosher salt to taste; ground white pepper to taste; canola oil for frying. Kartoffelpuffer are usually served with applesauce or an herbed sour cream called Kräuterquark. You could even put ketchup on them. Prep the ingredients. You’ll need to prepare your ingredients before you can fry them in a pan. It’s important to follow the preparation directions exactly so that you get the best results on your Kartoffelpuffer. Peel the 3 large Russet potatoes potatoes and 2 medium yellow onions and then finely grate them with a box grater. Place the grated potatoes and onions in a colander over a separate bowl. Let the mixture drain, squeezing it until it is dry. Once the potato mixture is dry, transfer it to another bowl. Slowly pour the liquid from squeezing the potatoes. Once you reach a milky starch at the bottom of the bowl, save it and pour on top of the drained potato mixture. Add the 1⁄3 cup all-purpose flour and 3 eggs to the potato and onion mixture. Season with salt and white pepper and fold the mixture until it is evenly combined. Set the mixture aside for a moment. Prepare the pan. You’ll need to prepare the pan in order to cook your Kartoffelpuffer. You can use any kind of pan or skillet, but one that is approximately 8” will work best. Heat 1⁄4 cup canola oil in the skillet over medium heat. You’ll be working in batches, so prepare a few Kartoffelpuffer while the oil heats up. To make the Kartoffelpuffer form, measure 1⁄2 cup potato mixture, flatten it into a 4-5\" pancake with your hand. Once you have a few raw Kartoffelpuffer formed, add them to skillet and fry. Flip them once until they are a golden color and cooked through. It will take about 8 minutes to finish each batch. Transfer finished Kartoffelpuffer to a paper towel-lined baking sheet or plate to remove excess oil. Repeat the process with the remaining mixture until with more oil, as needed, and remaining potato mixture. Serve pancakes with applesauce on the side. Top the Kartoffelpuffer and enjoy! Add the topping of your choice to the Kartoffelpuffer. The time has come for you to enjoy your Pfannkuchen! Kartoffelpuffer are usually served with applesauce or an herbed sour cream called Kräuterquark. You could even put ketchup on them.",
  "tyn_model":[
    "applesauce",
    "oven",
    "eggs",
    "powdered sugar",
    "skillet",
    "potato",
    "peanut butter",
    "all-purpose flour",
    "kosher salt",
    "flour",
    "sour cream",
    "potatoes",
    "bowl",
    "whole milk",
    "unsalted butter",
    "egg",
    "butter",
    "ketchup",
    "russet potatoes",
    "canola oil",
    "pan",
    "onions",
    "apples",
    "vanilla extract",
    "fresh lemon juice",
    "fruit jam",
    "confectioners' sugar",
    "cast iron pan",
    "vanilla",
    "frying pan",
    "cast-iron skillet",
    "lemon",
    "lemon juice",
    "marmalade",
    "nutella",
    "yellow onions",
    "ground white pepper",
    "box grater",
    "colander",
    "onion",
    "salt",
    "white pepper",
    "” will",
    "baking sheet",
    "plate",
    "oil"
  ],
  "tyn_section":[

  ]
}