{
  "title":"How to Make Garlic Stuffed Mushrooms",
  "url":"https://www.wikihow.com/Make-Garlic-Stuffed-Mushrooms",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Mushrooms"
  ],
  "steps":[
    {
      "headline":"Preheat oven to 350 °F (177 °C).",
      "description":""
    },
    {
      "headline":"Spray 9 x 13-inch baking pan with nonstick cooking spray.",
      "description":""
    },
    {
      "headline":"Remove stems from mushrooms and finely chop them.",
      "description":""
    },
    {
      "headline":"Wipe caps with a damp paper towel.",
      "description":""
    },
    {
      "headline":"Set mushroom caps aside.",
      "description":""
    },
    {
      "headline":"Melt butter and sauté onion over medium-high heat until golden brown.",
      "description":""
    },
    {
      "headline":"Add garlic.",
      "description":""
    },
    {
      "headline":"Add mushroom stems.",
      "description":""
    },
    {
      "headline":"Add soy sauce, sherry and pepper to mixture.",
      "description":""
    },
    {
      "headline":"Cook until mushrooms are softened and have changed color.",
      "description":""
    },
    {
      "headline":"Add fresh bread crumbs.",
      "description":""
    },
    {
      "headline":"Raise heat to high and cook stirring constantly until moisture is absorbed.",
      "description":""
    },
    {
      "headline":"Add 1 to 2 tablespoons fresh bread crumbs to correct mixture, if needed.",
      "description":""
    },
    {
      "headline":"Let mixture cool slightly.",
      "description":""
    },
    {
      "headline":"Add Mozzarella cheese and mix well.",
      "description":""
    },
    {
      "headline":"Stuff mushroom caps with bread crumb mixture.",
      "description":""
    },
    {
      "headline":"Place stuffed mushrooms into the prepared baking pan.",
      "description":""
    },
    {
      "headline":"Bake 15 minutes or until mushrooms are cooked through and the cheese melts.",
      "description":""
    },
    {
      "headline":"Makes 24 appetizers.",
      "description":""
    }
  ],
  "text":" Preheat oven to 350 °F (177 °C).  Spray 9 x 13-inch baking pan with nonstick cooking spray.  Remove stems from mushrooms and finely chop them.  Wipe caps with a damp paper towel.  Set mushroom caps aside.  Melt butter and sauté onion over medium-high heat until golden brown.  Add garlic.  Add mushroom stems.  Add soy sauce, sherry and pepper to mixture.  Cook until mushrooms are softened and have changed color.  Add fresh bread crumbs.  Raise heat to high and cook stirring constantly until moisture is absorbed.  Add 1 to 2 tablespoons fresh bread crumbs to correct mixture, if needed.  Let mixture cool slightly.  Add Mozzarella cheese and mix well.  Stuff mushroom caps with bread crumb mixture.  Place stuffed mushrooms into the prepared baking pan.  Bake 15 minutes or until mushrooms are cooked through and the cheese melts.  Makes 24 appetizers. ",
  "tyn_model":[
    "baking pan",
    "mushroom caps",
    "oven",
    "nonstick cooking spray",
    "butter",
    "onion",
    "garlic",
    "soy sauce",
    "sherry",
    "pepper",
    "bread crumbs",
    "mozzarella cheese",
    "bread crumb",
    "mushrooms"
  ],
  "tyn_section":[

  ]
}