{
  "title":"How to Make Hot Chocolate with Star Anise",
  "url":"https://www.wikihow.com/Make-Hot-Chocolate-with-Star-Anise",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Chocolate and Cocoa Drinks"
  ],
  "steps":[
    {
      "headline":"Break the chocolate into pieces and grate finely.",
      "description":""
    },
    {
      "headline":"Melt the chocolate gently in a double boiler or in a microwave on low.",
      "description":""
    },
    {
      "headline":"Bring the milk to the boil with the star anise.",
      "description":""
    },
    {
      "headline":"Remove from heat cover and allow the star anise to infuse for 3 minutes.",
      "description":"Remove the star anise with a small tea sieve or similar item."
    },
    {
      "headline":"Pour some boiling milk over the chocolate, constantly stirring over low heat.",
      "description":"The mixture will thicken."
    },
    {
      "headline":"Beat the liquid cream until it turns firm and light.",
      "description":""
    },
    {
      "headline":"Serve in heat-proof glasses suitable for hot chocolate.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Break the chocolate into pieces and grate finely.  Melt the chocolate gently in a double boiler or in a microwave on low.  Bring the milk to the boil with the star anise.  Remove from heat cover and allow the star anise to infuse for 3 minutes. Remove the star anise with a small tea sieve or similar item. Pour some boiling milk over the chocolate, constantly stirring over low heat. The mixture will thicken. Beat the liquid cream until it turns firm and light.  Serve in heat-proof glasses suitable for hot chocolate.  Finished. ",
  "tyn_model":[
    "chocolate",
    "milk",
    "double boiler",
    "microwave",
    "star anise",
    "tea sieve",
    "cream",
    "heat-proof glasses",
    "hot chocolate"
  ],
  "tyn_section":[

  ]
}