{
  "title":"How to Make Strawberry Stuffed French Toast",
  "url":"https://www.wikihow.com/Make-Strawberry-Stuffed-French-Toast",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "French Toast"
  ],
  "steps":[
    {
      "headline":"Get a bowl and pour in the lemon juice, lemon zest, 1 cup of strawberries, and the 2 teaspoons of sugar.",
      "description":"Mix those ingredients together and set the bowl on the side."
    },
    {
      "headline":"Use a knife and cut the bread slices in half.",
      "description":"Then take each slice of cut bread and cut another slit in them so that it looks like a \"pocket\"."
    },
    {
      "headline":"Use the strawberry mix and stuff it into the \"pockets\" that you just made.",
      "description":"\"Sew\" back the opening with toothpicks."
    },
    {
      "headline":"Grease a 13\" x 9\" baking dish and place the French toast pieces in the pan.",
      "description":""
    },
    {
      "headline":"Grab another bowl and mix the eggs, vanilla, sugar, baking powder, and milk.",
      "description":"You'll want to pour this mixture over your French toast. Turn the bread pieces over so you can coat everything."
    },
    {
      "headline":"Place it in the refrigerator for at least 30 to 60 minutes.",
      "description":"Get each side of the pieces coated by turning them often."
    },
    {
      "headline":"Go and pre-heat the oven to 400 °F (204 °C).",
      "description":""
    },
    {
      "headline":"Get a second 13\" x 9\" baking pan.",
      "description":"Grease it and transfer the coated French toast pieces over to it. Place this pan into the oven for about 3 to 6 minutes. Flip the pieces over and bake for 3 to 6 minutes."
    },
    {
      "headline":"Serve the pieces warm with extra strawberries and syrup.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Get a bowl and pour in the lemon juice, lemon zest, 1 cup of strawberries, and the 2 teaspoons of sugar. Mix those ingredients together and set the bowl on the side. Use a knife and cut the bread slices in half. Then take each slice of cut bread and cut another slit in them so that it looks like a \"pocket\". Use the strawberry mix and stuff it into the \"pockets\" that you just made. \"Sew\" back the opening with toothpicks. Grease a 13\" x 9\" baking dish and place the French toast pieces in the pan.  Grab another bowl and mix the eggs, vanilla, sugar, baking powder, and milk. You'll want to pour this mixture over your French toast. Turn the bread pieces over so you can coat everything. Place it in the refrigerator for at least 30 to 60 minutes. Get each side of the pieces coated by turning them often. Go and pre-heat the oven to 400 °F (204 °C).  Get a second 13\" x 9\" baking pan. Grease it and transfer the coated French toast pieces over to it. Place this pan into the oven for about 3 to 6 minutes. Flip the pieces over and bake for 3 to 6 minutes. Serve the pieces warm with extra strawberries and syrup.  Finished. ",
  "tyn_model":[
    "bowl",
    "french toast",
    "strawberries",
    "sugar",
    "oven",
    "lemon juice",
    "lemon",
    "knife",
    "bread",
    "strawberry",
    "baking dish",
    "eggs",
    "vanilla",
    "baking powder",
    "milk",
    "refrigerator",
    "baking pan",
    "pan",
    "syrup"
  ],
  "tyn_section":[

  ]
}