{
  "title":"How to Make Purple Cookies",
  "url":"https://www.wikihow.com/Make-Purple-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Sugar Cookies and Biscuits"
  ],
  "steps":[
    {
      "headline":"In a large bowl, cream the butter and sugar until the mixture is light and creamy.",
      "description":""
    },
    {
      "headline":"Crack in the eggs and add the vanilla.",
      "description":"Blend again."
    },
    {
      "headline":"Add the flour, pouring and adding it one cup at a time.",
      "description":""
    },
    {
      "headline":"Fold in the salt and baking powder.",
      "description":""
    },
    {
      "headline":"Blend on low speed until the cookie dough forms.",
      "description":""
    },
    {
      "headline":"Add in the red and blue food coloring.",
      "description":""
    },
    {
      "headline":"Cover the bowl with plastic wrap and chill it for about two hours.",
      "description":""
    },
    {
      "headline":"Preheat the oven to 400 degrees Fahrenheit (204 degrees Celsius).",
      "description":""
    },
    {
      "headline":"Roll out the dough on a floured surface using a rolling pin.",
      "description":"Roll it out until the dough is ¼ to ½ inch thick."
    },
    {
      "headline":"Cut out the cookies using a cookie cutter.",
      "description":""
    },
    {
      "headline":"Lay a baking tray with parchment paper.Place the cookies on the baking tray.",
      "description":""
    },
    {
      "headline":"Bake the cookies for about 6-8 minutes, until they are lightly golden.",
      "description":""
    },
    {
      "headline":"Allow the cookies to cool a wire rack for about 5 minutes.",
      "description":""
    },
    {
      "headline":"Serve.",
      "description":"Place the cookies on a serving plate. Serve with a glass of milk if desired. Enjoy!"
    }
  ],
  "text":" In a large bowl, cream the butter and sugar until the mixture is light and creamy.  Crack in the eggs and add the vanilla. Blend again. Add the flour, pouring and adding it one cup at a time.  Fold in the salt and baking powder.  Blend on low speed until the cookie dough forms.  Add in the red and blue food coloring.  Cover the bowl with plastic wrap and chill it for about two hours.  Preheat the oven to 400 degrees Fahrenheit (204 degrees Celsius).  Roll out the dough on a floured surface using a rolling pin. Roll it out until the dough is ¼ to ½ inch thick. Cut out the cookies using a cookie cutter.  Lay a baking tray with parchment paper.Place the cookies on the baking tray.  Bake the cookies for about 6-8 minutes, until they are lightly golden.  Allow the cookies to cool a wire rack for about 5 minutes.  Serve. Place the cookies on a serving plate. Serve with a glass of milk if desired. Enjoy!",
  "tyn_model":[
    "baking tray",
    "large bowl",
    "butter",
    "sugar",
    "eggs",
    "vanilla",
    "flour",
    "salt",
    "baking powder",
    "food coloring",
    "plastic wrap",
    "oven",
    "rolling pin",
    "cookie cutter",
    "parchment paper",
    "wire rack",
    "milk"
  ],
  "tyn_section":[

  ]
}