{
  "title":"How to Install a Hampton Bay Ceiling Fan",
  "url":"https://www.wikihow.com/Install-a-Hampton-Bay-Ceiling-Fan",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Walls and Ceilings",
    "Ceilings"
  ],
  "parts":[
    {
      "name":"Install the Ceiling Fan Mounting",
      "steps":[
        {
          "headline":"Loosen the two screws in the collar on top of the motor assembly.",
          "description":""
        },
        {
          "headline":"Remove the canopy ring from the canopy by turning the ring to the right until it unlocks.",
          "description":""
        },
        {
          "headline":"Remove the mounting plate from the canopy by loosening the four screws on the top of the canopy.",
          "description":"Remove the two non-slotted screws and loosen the slotted screws. This will enable you to remove the mounting plate."
        },
        {
          "headline":"Route the wires exiting the top of the fan motor through the canopy ring.",
          "description":"Make sure the slot openings are on top. Route the wires through the canopy and then through the ball/downrod assembly."
        },
        {
          "headline":"Align the holes at the bottom of the down-rod with the holes in the collar on top of the motor housing.",
          "description":""
        },
        {
          "headline":"Insert the bolt through the holes in the collar and downrod.",
          "description":"Be careful not to jam against the wiring inside the downrod. Insert clevis pin and bend to ensure security."
        },
        {
          "headline":"Tighten the two screws on the collar on top of the motor housing.",
          "description":""
        }
      ]
    },
    {
      "name":"Install the Fan to the Outlet Box",
      "steps":[
        {
          "headline":"Pass the 120-volt supply wires through the center hole in the ceiling mounting plate.",
          "description":""
        },
        {
          "headline":"Install the ceiling mounting plate on the outlet box.",
          "description":"Slide the mounting plate over the two screws provided with the outlet box. When using close-to-ceiling mounting, it is important that the mounting plate be level. If necessary, use leveling washers (not included) between the mounting plate and the outlet box. Note that the flat side of the mounting plate is toward the outlet box."
        },
        {
          "headline":"Tighten the two mounting screws securely.",
          "description":""
        },
        {
          "headline":"Lift the assembly up to the ceiling mounting plate carefully.",
          "description":"If you are using close-to-ceiling mounting, hang the fan on the hook provided by utilizing one of the holes at the outer rim of the ceiling canopy. If using standard mounting, seat"
        },
        {
          "headline":"Make sure the tab on the mounting plate socket is properly seated in the groove in the hanger ball.",
          "description":""
        }
      ]
    },
    {
      "name":"Make the Electrical Connections",
      "steps":[
        {
          "headline":"Disconnect the power.",
          "description":"If you feel you do not have enough electrical wiring knowledge or experience, have your fan installed by a licensed electrician. Follow the steps below to connect the fan to your household wiring. Use the wire connecting nuts supplied with your fan. Secure the connectors with electrical tape. Make sure there are no loose strands or connections."
        },
        {
          "headline":"Connect the ground conductor of the 120v supply (this may be a bare wire or a wire with green insulation) to the green ground lead(s) of the fan.",
          "description":"When using standard ceiling mounting, there are two green grounding leads: one from the ceiling mounting plate and one from the ball/down-rod assembly. When using Close-to-Ceiling mounting, there is only one green ground lead from the mounting plate since the ball/downrod assembly is not used."
        },
        {
          "headline":"Connect the fan motor white wire to the supply white (neutral) wire using a wire nut.",
          "description":""
        },
        {
          "headline":"Connect the fan motor black wire to the sup-ply black (hot) wire using a wire nut.",
          "description":""
        },
        {
          "headline":"Spread the wires apart.",
          "description":"The green and white wires are on one side of the outlet box and the black wire is on the other side."
        },
        {
          "headline":"Turn the wire connecting nuts upward and push into the outlet box",
          "description":""
        }
      ]
    },
    {
      "name":"Attach the Fan Blades",
      "steps":[
        {
          "headline":"Mount the fan blades to the pre-installed blade brackets by aligning the three key-slot holes in the blade with the three posts on top of the blade bracket.",
          "description":""
        },
        {
          "headline":"Hold the blade with both hands close to the blade arm and press the blade down firmly.",
          "description":"Ensure the key-slot holes are properly seated on the blade bracket posts."
        },
        {
          "headline":"While still holding the blade down with both hands, firmly slide the blade away from the motor housing until the blade engages in the locking mechanism.",
          "description":"Make sure the steel locking mechanism at the rear of the blade bracket springs upward and butts against the edge of the blade indicating a secure connection."
        },
        {
          "headline":"Visually insect the top of the blade bracket 4 to ensure that the locking mechanism is securely in place.",
          "description":""
        },
        {
          "headline":"Repeat for the remaining blades.",
          "description":""
        }
      ]
    },
    {
      "name":"Balance the Blades",
      "steps":[
        {
          "headline":"Know that all blades groups by weight.",
          "description":"Because natural woods vary in density, the fan may wobble even though the blades are weight matched. The following procedure should correct most fan wobble. Check after each step."
        },
        {
          "headline":"Check that all blades are securely mounted 1. to the blade brackets with the locking mechanisms engaged.",
          "description":""
        },
        {
          "headline":"Make sure the blade brackets are not bent 2. out of position and ensure the blade tips are even.",
          "description":"Use the enclosed blade balancing kit if the blade wobble is still noticeable by carefully following the instructions included with the kit."
        }
      ]
    }
  ],
  "text":" Install the Ceiling Fan Mounting Loosen the two screws in the collar on top of the motor assembly.  Remove the canopy ring from the canopy by turning the ring to the right until it unlocks.  Remove the mounting plate from the canopy by loosening the four screws on the top of the canopy. Remove the two non-slotted screws and loosen the slotted screws. This will enable you to remove the mounting plate. Route the wires exiting the top of the fan motor through the canopy ring. Make sure the slot openings are on top. Route the wires through the canopy and then through the ball/downrod assembly. Align the holes at the bottom of the down-rod with the holes in the collar on top of the motor housing.  Insert the bolt through the holes in the collar and downrod. Be careful not to jam against the wiring inside the downrod. Insert clevis pin and bend to ensure security. Tighten the two screws on the collar on top of the motor housing.  Install the Fan to the Outlet Box Pass the 120-volt supply wires through the center hole in the ceiling mounting plate.  Install the ceiling mounting plate on the outlet box. Slide the mounting plate over the two screws provided with the outlet box. When using close-to-ceiling mounting, it is important that the mounting plate be level. If necessary, use leveling washers (not included) between the mounting plate and the outlet box. Note that the flat side of the mounting plate is toward the outlet box. Tighten the two mounting screws securely.  Lift the assembly up to the ceiling mounting plate carefully. If you are using close-to-ceiling mounting, hang the fan on the hook provided by utilizing one of the holes at the outer rim of the ceiling canopy. If using standard mounting, seat Make sure the tab on the mounting plate socket is properly seated in the groove in the hanger ball.  Make the Electrical Connections Disconnect the power. If you feel you do not have enough electrical wiring knowledge or experience, have your fan installed by a licensed electrician. Follow the steps below to connect the fan to your household wiring. Use the wire connecting nuts supplied with your fan. Secure the connectors with electrical tape. Make sure there are no loose strands or connections. Connect the ground conductor of the 120v supply (this may be a bare wire or a wire with green insulation) to the green ground lead(s) of the fan. When using standard ceiling mounting, there are two green grounding leads: one from the ceiling mounting plate and one from the ball/down-rod assembly. When using Close-to-Ceiling mounting, there is only one green ground lead from the mounting plate since the ball/downrod assembly is not used. Connect the fan motor white wire to the supply white (neutral) wire using a wire nut.  Connect the fan motor black wire to the sup-ply black (hot) wire using a wire nut.  Spread the wires apart. The green and white wires are on one side of the outlet box and the black wire is on the other side. Turn the wire connecting nuts upward and push into the outlet box  Attach the Fan Blades Mount the fan blades to the pre-installed blade brackets by aligning the three key-slot holes in the blade with the three posts on top of the blade bracket.  Hold the blade with both hands close to the blade arm and press the blade down firmly. Ensure the key-slot holes are properly seated on the blade bracket posts. While still holding the blade down with both hands, firmly slide the blade away from the motor housing until the blade engages in the locking mechanism. Make sure the steel locking mechanism at the rear of the blade bracket springs upward and butts against the edge of the blade indicating a secure connection. Visually insect the top of the blade bracket 4 to ensure that the locking mechanism is securely in place.  Repeat for the remaining blades.  Balance the Blades Know that all blades groups by weight. Because natural woods vary in density, the fan may wobble even though the blades are weight matched. The following procedure should correct most fan wobble. Check after each step. Check that all blades are securely mounted 1. to the blade brackets with the locking mechanisms engaged.  Make sure the blade brackets are not bent 2. out of position and ensure the blade tips are even. Use the enclosed blade balancing kit if the blade wobble is still noticeable by carefully following the instructions included with the kit.",
  "tyn_model":[
    "fan",
    "fan motor",
    "wire nut",
    "ceiling fan",
    "wiring",
    "120-volt supply wires",
    "outlet box",
    "electrical wiring knowledge",
    "electrical tape",
    "fan blades",
    "blade bracket"
  ],
  "tyn_section":[

  ]
}