{
  "title":"How to Do a Wheelie in Need for Speed: ProStreet",
  "url":"https://www.wikihow.com/Do-a-Wheelie-in-Need-for-Speed:-ProStreet",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Need for Speed"
  ],
  "steps":[
    {
      "headline":"Use a RWD car with very high HP, I recommend the Shelby GT500 (the one that costs 42,000).",
      "description":""
    },
    {
      "headline":"Install all level 3 parts the lower the aero the better 2 max, And add some N20.",
      "description":"Stage 4 parts are not a must, but can make doing a longer wheelie easier. Make sure you set your rear suspensions to soft and the front suspensions to stiff.the lower the aerial the better 2 max"
    },
    {
      "headline":"Go to the drag race.",
      "description":""
    },
    {
      "headline":"Warm up your tires.",
      "description":"Green marks the optimal rpm."
    },
    {
      "headline":"Get a score of good or better.",
      "description":"Of course, max grip is the best but not a must. If you're going to break your record I would recommend getting max grip, again, for those few extra ft."
    },
    {
      "headline":"Feel the rhythm of the orange lights so you can predict the green light.",
      "description":"It works like a charm. Launch"
    },
    {
      "headline":"Use N20 when your front wheels start coming back down (this will be around the 3rd gear).",
      "description":""
    }
  ],
  "text":" Use a RWD car with very high HP, I recommend the Shelby GT500 (the one that costs 42,000).  Install all level 3 parts the lower the aero the better 2 max, And add some N20. Stage 4 parts are not a must, but can make doing a longer wheelie easier. Make sure you set your rear suspensions to soft and the front suspensions to stiff.the lower the aerial the better 2 max Go to the drag race.  Warm up your tires. Green marks the optimal rpm. Get a score of good or better. Of course, max grip is the best but not a must. If you're going to break your record I would recommend getting max grip, again, for those few extra ft. Feel the rhythm of the orange lights so you can predict the green light. It works like a charm. Launch Use N20 when your front wheels start coming back down (this will be around the 3rd gear). ",
  "tyn_model":[
    "tires",
    "n20"
  ],
  "tyn_section":[

  ]
}