{
  "title":"How to Make Sparkling Cherry Sangria",
  "url":"https://www.wikihow.com/Make-Sparkling-Cherry-Sangria",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Wine"
  ],
  "parts":[
    {
      "name":"Choose Ingredients\\/Supplies",
      "steps":[
        {
          "headline":"Select a bottle of good champagne.",
          "description":"You may want to skimp or cut corners but don't do it with the bubbly. The champagne is the basis of the drink so you want to serve your sangria with something delicious. Also, don’t go for an overly sweet champagne since you will adding fruit. One bottle of champagne makes one pitcher of sangria. Always be cautious popping the champagne cork--adults only."
        },
        {
          "headline":"Purchase fruit.",
          "description":"For this drink you will need cherries, lemons, oranges and mint. Two lemons and two oranges will do the trick, however you’ll want to load up on the cherries (1 1/2 cups) and mint (1/2 cup)."
        },
        {
          "headline":"Find a large pitcher and serving spoon.",
          "description":"You’ll not only be pouring but also spooning some of the fruit into glasses."
        },
        {
          "headline":"Locate a box of plastic wrap.",
          "description":"You should make the drink ahead of time so the fruit and champagne has an hour or two to ferment. Instead of leaving it in the refrigerator open, cover with plastic wrap to protect against other food odors that could be lurking."
        }
      ]
    },
    {
      "name":"Make Your Drink",
      "steps":[
        {
          "headline":"Wash and pat dry fruit.",
          "description":"This means even the lemons and oranges as you will be adding them to the drink with peel in tact."
        },
        {
          "headline":"Slice lemons and oranges in thick rounds (1/4 inch).",
          "description":"Try to make the slices uniform as they will add color but also flavor to the drink."
        },
        {
          "headline":"Remove cherry and mint leaf stems.",
          "description":"Consider de-pitting cherries before adding to drink (or you can still add the cherries with pits in tact). Make a small slice in the side of the cherry and pop out the pit. Discard pit. Rough chop mint to release oils and flavor (or you can add mint whole)."
        },
        {
          "headline":"Stack cherries, lemons, oranges and mint into your pitcher.",
          "description":"Place the 1 1/2 cup of cherries in first, followed by the two sliced lemons, two sliced oranges and 1/2 cup of mint."
        },
        {
          "headline":"Pop the champagne cork and pour the entire bottle of champagne over the fruit.",
          "description":"Pour slowly so the champagne doesn’t overflow."
        },
        {
          "headline":"Cover with plastic wrap and place in refrigerator for up to two hours prior to serving.",
          "description":""
        },
        {
          "headline":"Serve by pouring drink into glasses and use a large spoon to add fruit to glasses.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Choose Ingredients\\/Supplies Select a bottle of good champagne. You may want to skimp or cut corners but don't do it with the bubbly. The champagne is the basis of the drink so you want to serve your sangria with something delicious. Also, don’t go for an overly sweet champagne since you will adding fruit. One bottle of champagne makes one pitcher of sangria. Always be cautious popping the champagne cork--adults only. Purchase fruit. For this drink you will need cherries, lemons, oranges and mint. Two lemons and two oranges will do the trick, however you’ll want to load up on the cherries (1 1/2 cups) and mint (1/2 cup). Find a large pitcher and serving spoon. You’ll not only be pouring but also spooning some of the fruit into glasses. Locate a box of plastic wrap. You should make the drink ahead of time so the fruit and champagne has an hour or two to ferment. Instead of leaving it in the refrigerator open, cover with plastic wrap to protect against other food odors that could be lurking. Make Your Drink Wash and pat dry fruit. This means even the lemons and oranges as you will be adding them to the drink with peel in tact. Slice lemons and oranges in thick rounds (1/4 inch). Try to make the slices uniform as they will add color but also flavor to the drink. Remove cherry and mint leaf stems. Consider de-pitting cherries before adding to drink (or you can still add the cherries with pits in tact). Make a small slice in the side of the cherry and pop out the pit. Discard pit. Rough chop mint to release oils and flavor (or you can add mint whole). Stack cherries, lemons, oranges and mint into your pitcher. Place the 1 1/2 cup of cherries in first, followed by the two sliced lemons, two sliced oranges and 1/2 cup of mint. Pop the champagne cork and pour the entire bottle of champagne over the fruit. Pour slowly so the champagne doesn’t overflow. Cover with plastic wrap and place in refrigerator for up to two hours prior to serving.  Serve by pouring drink into glasses and use a large spoon to add fruit to glasses.  Finished. ",
  "tyn_model":[
    "champagne",
    "mint",
    "cherries",
    "lemons",
    "oranges",
    "plastic wrap",
    "fruit",
    "refrigerator",
    "cherry",
    "bubbly",
    "sangria",
    "large pitcher",
    "pitcher",
    "spoon"
  ],
  "tyn_section":[

  ]
}