{
  "title":"How to Make Larp Arrows",
  "url":"https://www.wikihow.com/Make-Larp-Arrows",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games"
  ],
  "steps":[
    {
      "headline":"Buy standard arrows, that only have a small metal tip, from your local sporting good store, or a store with a sporting good section.",
      "description":"Large box stores are a good choice, such as Walmart or Kmart."
    },
    {
      "headline":"Remove the metal tip.",
      "description":"A pair of vice grips work well, however, you can also cut right below the metal tip with a hacksaw."
    },
    {
      "headline":"Reduce cracking and widen the tip.",
      "description":"The shaft of the arrow might have cracked while removing the tip. To fix this problem wrap duct tape around the tip of the arrow building up the width of the tip (half an inch down) to the diameter of a penny."
    },
    {
      "headline":"Solidify the Tip.",
      "description":"Take a penny and set it at the top of the \"platform\" of tape on the tip. Make a cross with duct tape and secure the penny to the tip of the arrow. This step prevents the arrow from being able to penetrate through the tip of your padding."
    },
    {
      "headline":"Take a closed cell foam (such as camping mat found at Walmart or Kmart) and wrap it around the tip of the arrow.",
      "description":"Make sure the foam is above the penny! Make sure the foam makes the arrow around 1.5 to 2\" in diameter."
    },
    {
      "headline":"Tape the foam to the arrow.",
      "description":""
    },
    {
      "headline":"Cover the top of the arrow with a circle of the closed cell foam and secure it with carpet tape and duct tape or just the duct tape.",
      "description":""
    },
    {
      "headline":"Attach an \"open cell\" foam to the top of the arrow now.",
      "description":"Do Not Squish the Open Cell Foam!"
    },
    {
      "headline":"Wrap a strip of closed cell foam around the connection point between the open cell and the closed cell.",
      "description":"Make sure about an inch or two of the open cell sticks above the closed cell. (Attach with Duct Tape)"
    },
    {
      "headline":"Cover with cloth or cloth tape (Do not cover with Duct Tape as this can cut the skin.",
      "description":"Also, it causes the foam to strike harder rather than compress fully. Attach the cloth cover (if you choose cloth) with duct tape or cloth tape at the bottom of the arrowhead."
    }
  ],
  "text":" Buy standard arrows, that only have a small metal tip, from your local sporting good store, or a store with a sporting good section. Large box stores are a good choice, such as Walmart or Kmart. Remove the metal tip. A pair of vice grips work well, however, you can also cut right below the metal tip with a hacksaw. Reduce cracking and widen the tip. The shaft of the arrow might have cracked while removing the tip. To fix this problem wrap duct tape around the tip of the arrow building up the width of the tip (half an inch down) to the diameter of a penny. Solidify the Tip. Take a penny and set it at the top of the \"platform\" of tape on the tip. Make a cross with duct tape and secure the penny to the tip of the arrow. This step prevents the arrow from being able to penetrate through the tip of your padding. Take a closed cell foam (such as camping mat found at Walmart or Kmart) and wrap it around the tip of the arrow. Make sure the foam is above the penny! Make sure the foam makes the arrow around 1.5 to 2\" in diameter. Tape the foam to the arrow.  Cover the top of the arrow with a circle of the closed cell foam and secure it with carpet tape and duct tape or just the duct tape.  Attach an \"open cell\" foam to the top of the arrow now. Do Not Squish the Open Cell Foam! Wrap a strip of closed cell foam around the connection point between the open cell and the closed cell. Make sure about an inch or two of the open cell sticks above the closed cell. (Attach with Duct Tape) Cover with cloth or cloth tape (Do not cover with Duct Tape as this can cut the skin. Also, it causes the foam to strike harder rather than compress fully. Attach the cloth cover (if you choose cloth) with duct tape or cloth tape at the bottom of the arrowhead.",
  "tyn_model":[
    "duct tape",
    "foam",
    "closed cell foam",
    "arrows",
    "sporting good section",
    "vice grips",
    "hacksaw",
    "tape",
    "camping mat",
    "carpet tape",
    "cloth tape"
  ],
  "tyn_section":[

  ]
}