{
  "title":"How to Create Unique Party Balloon Decorations",
  "url":"https://www.wikihow.com/Create-Unique-Party-Balloon-Decorations",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Decorations"
  ],
  "methods":[
    {
      "name":"Determine Your Party Goals",
      "steps":[
        {
          "headline":"Decide what type of balloons will best suit the occasion.",
          "description":"For some occasions a regular latex balloon that you and your friends blow up at home will suffice. For other parties you may want helium or even Mylar balloons. Your party type should dictate what type of balloon size you will need as well. You could also use a few larger balloons surrounded by smaller balloons for interest."
        },
        {
          "headline":"Consider how you’d like to decorate with balloons.",
          "description":"Will you need to glitter or draw on the balloons or will you add props like hats or faces to your balloons. Assemble supplies based on your party. That means picking up glue, glitter or any other accessories you required to decorate your balloon. Decide on how you will anchor or hold your balloons. This includes using ribbon, sticks or adhering the balloon directly to a piece of furniture or the wall. You may also partner the balloons with a flower arrangement too so plan accordingly. Having access to a clear tape dispenser would be a good idea."
        },
        {
          "headline":"Assess the party room to help you with your balloon design.",
          "description":"Especially if you plan to hold your party outside, you may want to take weather conditions into consideration (such as wind and/or rain). The room size and shape may help you determine the number of balloons you will need. If you plan to use balloons as a table centerpiece you will need to know the size and number of tables."
        }
      ]
    },
    {
      "name":"Create Painted Balloons",
      "steps":[
        {
          "headline":"Purchase latex balloons.",
          "description":"Generally latex balloons will work best with paint as the acrylic paint typically adheres best to this material."
        },
        {
          "headline":"Pick up acrylic paint.",
          "description":"Consider using acrylic paint pens instead of the paint and brushes for a more precise design."
        },
        {
          "headline":"Consider using a pattern or a template for a more uniform paint design.",
          "description":"For example, if you are painting stars on the balloons you could place the template on top of the balloon and then paint within the template."
        },
        {
          "headline":"Blow up balloons.",
          "description":"Helium or blown up balloons will work for this project. Be sure you secure the ends by either tying a knot or using a clamp."
        },
        {
          "headline":"Place template on blown up balloon or free hand paint on the balloon.",
          "description":"Hold the balloon in your hand or secure it in an area so the balloon doesn’t float around while you are working on it."
        },
        {
          "headline":"Paint one side of the balloon and allow it to dry.",
          "description":"Read manufacturer instructions for dry time for best results."
        },
        {
          "headline":"Turn dried balloon over and paint the other side.",
          "description":"Allow the other side to properly dry before you use."
        }
      ]
    },
    {
      "name":"Design Balloons with Flower Arrangements",
      "steps":[
        {
          "headline":"Pick up a small flower arrangement.",
          "description":"Look for a smaller arrangement that sits neatly in a basket or small box. You will be transforming the arrangement into a hot air balloon in a basket so you want the basket of flowers to be smaller than the balloon you use."
        },
        {
          "headline":"Select balloons.",
          "description":"You want balloons that are larger than your flower arrangement and can be blown up with helium. Both Mylar and latex balloons will work well. You will want to use one balloon per arrangement."
        },
        {
          "headline":"Pick up other supplies.",
          "description":"You will need ribbon or string to create the hot air balloon effect, plus glue to hold it in place. Regular white glue should do the trick."
        },
        {
          "headline":"Blow up balloons using a helium tank.",
          "description":"Tie and knot the bottom or clamp in place."
        },
        {
          "headline":"Cut ribbon or string for the arrangement.",
          "description":"You will want ribbon to reach from one corner of the arrangement to the opposite corner and over the balloon. You will need approximately two pieces of string."
        },
        {
          "headline":"Glue one end of the string/ribbon to one corner of the flower arrangement box or basket, drape it over the top of the balloon and secure to the opposite side of the arrangement.",
          "description":""
        },
        {
          "headline":"Glue another piece of string to the other end of the basket/box, over the balloon and to the other end of the basket box.",
          "description":"You want the string/ribbon to end up making an “X” on top of the balloon."
        },
        {
          "headline":"Allow glue enough time to dry before moving the arrangement to tables or within the room.",
          "description":""
        }
      ]
    },
    {
      "name":"Make Hats for Balloons",
      "steps":[
        {
          "headline":"Select the hat type for the balloon.",
          "description":"From crowns and traditional party hats to wigs or bows, choose the hat that best describes the party scene. Take into consideration the balloon size when selecting the hat."
        },
        {
          "headline":"Purchase glue to hold the hat in place.",
          "description":"White glue will work but look into glue that works well with either latex or Mylar material."
        },
        {
          "headline":"Blow up balloons.",
          "description":"This method will work with balloons you blow up yourself or helium balloons."
        },
        {
          "headline":"Add hat to balloon.",
          "description":"Use enough glue so that the hat stays in place. This may mean adding a little clear tape to hold it steady as well."
        }
      ]
    }
  ],
  "text":" Determine Your Party Goals Decide what type of balloons will best suit the occasion. For some occasions a regular latex balloon that you and your friends blow up at home will suffice. For other parties you may want helium or even Mylar balloons. Your party type should dictate what type of balloon size you will need as well. You could also use a few larger balloons surrounded by smaller balloons for interest. Consider how you’d like to decorate with balloons. Will you need to glitter or draw on the balloons or will you add props like hats or faces to your balloons. Assemble supplies based on your party. That means picking up glue, glitter or any other accessories you required to decorate your balloon. Decide on how you will anchor or hold your balloons. This includes using ribbon, sticks or adhering the balloon directly to a piece of furniture or the wall. You may also partner the balloons with a flower arrangement too so plan accordingly. Having access to a clear tape dispenser would be a good idea. Assess the party room to help you with your balloon design. Especially if you plan to hold your party outside, you may want to take weather conditions into consideration (such as wind and/or rain). The room size and shape may help you determine the number of balloons you will need. If you plan to use balloons as a table centerpiece you will need to know the size and number of tables. Create Painted Balloons Purchase latex balloons. Generally latex balloons will work best with paint as the acrylic paint typically adheres best to this material. Pick up acrylic paint. Consider using acrylic paint pens instead of the paint and brushes for a more precise design. Consider using a pattern or a template for a more uniform paint design. For example, if you are painting stars on the balloons you could place the template on top of the balloon and then paint within the template. Blow up balloons. Helium or blown up balloons will work for this project. Be sure you secure the ends by either tying a knot or using a clamp. Place template on blown up balloon or free hand paint on the balloon. Hold the balloon in your hand or secure it in an area so the balloon doesn’t float around while you are working on it. Paint one side of the balloon and allow it to dry. Read manufacturer instructions for dry time for best results. Turn dried balloon over and paint the other side. Allow the other side to properly dry before you use. Design Balloons with Flower Arrangements Pick up a small flower arrangement. Look for a smaller arrangement that sits neatly in a basket or small box. You will be transforming the arrangement into a hot air balloon in a basket so you want the basket of flowers to be smaller than the balloon you use. Select balloons. You want balloons that are larger than your flower arrangement and can be blown up with helium. Both Mylar and latex balloons will work well. You will want to use one balloon per arrangement. Pick up other supplies. You will need ribbon or string to create the hot air balloon effect, plus glue to hold it in place. Regular white glue should do the trick. Blow up balloons using a helium tank. Tie and knot the bottom or clamp in place. Cut ribbon or string for the arrangement. You will want ribbon to reach from one corner of the arrangement to the opposite corner and over the balloon. You will need approximately two pieces of string. Glue one end of the string/ribbon to one corner of the flower arrangement box or basket, drape it over the top of the balloon and secure to the opposite side of the arrangement.  Glue another piece of string to the other end of the basket/box, over the balloon and to the other end of the basket box. You want the string/ribbon to end up making an “X” on top of the balloon. Allow glue enough time to dry before moving the arrangement to tables or within the room.  Make Hats for Balloons Select the hat type for the balloon. From crowns and traditional party hats to wigs or bows, choose the hat that best describes the party scene. Take into consideration the balloon size when selecting the hat. Purchase glue to hold the hat in place. White glue will work but look into glue that works well with either latex or Mylar material. Blow up balloons. This method will work with balloons you blow up yourself or helium balloons. Add hat to balloon. Use enough glue so that the hat stays in place. This may mean adding a little clear tape to hold it steady as well.",
  "tyn_model":[
    "balloons",
    "glue",
    "balloon",
    "ribbon",
    "string",
    "acrylic paint",
    "helium",
    "clear tape",
    "paint",
    "mylar balloons",
    "glitter",
    "free hand paint",
    "hot air balloon",
    "mylar and",
    "white glue",
    "helium tank",
    "“x",
    "” on",
    "helium balloons",
    "hat"
  ],
  "tyn_section":[

  ]
}