{
  "title":"How to Make Tuiles",
  "url":"https://www.wikihow.com/Make-Tuiles",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Butter Cookies and Biscuits"
  ],
  "methods":[
    {
      "name":"Plain Tuiles",
      "steps":[
        {
          "headline":"Preheat the oven to 240ºC/475ºF/gas 9.",
          "description":"Cover a baking tray (sheet) with parchment paper. Or, you can butter a tray."
        },
        {
          "headline":"Place the sugars, flour and salt in a mixing bowl.",
          "description":"Add the eggs and whisk together."
        },
        {
          "headline":"Blend in the melted butter.",
          "description":"If using, add the almonds now."
        },
        {
          "headline":"Pick up a teaspoon of the batter.",
          "description":"Place on the baking tray. Repeat across the tray, leaving plenty of room between each biscuit to spread."
        },
        {
          "headline":"Dip a fork into cold water.",
          "description":"Shake off the water. Use the back of the fork to press down gently on the batter dollops to help them spread a little."
        },
        {
          "headline":"Place in the oven.",
          "description":"Bake for around 4 minutes. The tuiles are ready when the edges turn a golden brown. The centre should stay white."
        },
        {
          "headline":"Remove from the oven.",
          "description":"While still hot, bend each biscuit over the rolling pin (or a clean bottle). Biscuits will probably break while you attempt this. You need to learn the fine timing of leaving the baked biscuits on the tray for a few seconds, then quickly turning them into curled biscuits. The biscuits can also be pressed into little moulds for different shapes, such as a basket to be filled with berries."
        },
        {
          "headline":"Set the curved biscuits aside to cool.",
          "description":"When cooled, they will harden into the curled shape. Serve with dessert or as a treat filled with whipped cream."
        }
      ]
    },
    {
      "name":"Chocolate Tuiles",
      "steps":[
        {
          "headline":"Preheat the oven to 180ºC/350ºF.",
          "description":"Lightly grease the baking tray (sheet) or line with parchment paper."
        },
        {
          "headline":"Whisk the egg whites with the icing sugar to dissolve the icing sugar.",
          "description":""
        },
        {
          "headline":"Add the flour and cocoa to the egg white.",
          "description":"Whisk again."
        },
        {
          "headline":"Let sit for 10-15 minutes.",
          "description":"After it has rested, add the melted butter and stir through."
        },
        {
          "headline":"Fill a teaspoon with the batter.",
          "description":"Pour the teaspoonful onto the prepared tray. Spread thinly with the back of a fork that has been dipped in cold water."
        },
        {
          "headline":"Add more teaspoons of batter.",
          "description":"Leave plenty of space between each one to allow for spreading during baking."
        },
        {
          "headline":"Place in the preheated oven.",
          "description":"Bake for 5-8 minutes (this longer time compared to the above recipe is due to the fact that the temperature is quite a bit lower)."
        },
        {
          "headline":"Remove when baked.",
          "description":"Since these biscuits are dark, it'll be hard to judge readiness just by looking. You'll need touch to test these ones."
        },
        {
          "headline":"Remove from the tray with a palette knife.",
          "description":"Roll over the rolling pin or clean bottle to curve each biscuit. Repeat for each biscuit."
        },
        {
          "headline":"Slip the tuile off.",
          "description":"Let it cool and harden. If using almonds as garnish, press into the biscuits before they harden."
        }
      ]
    }
  ],
  "text":" Plain Tuiles Preheat the oven to 240ºC/475ºF/gas 9. Cover a baking tray (sheet) with parchment paper. Or, you can butter a tray. Place the sugars, flour and salt in a mixing bowl. Add the eggs and whisk together. Blend in the melted butter. If using, add the almonds now. Pick up a teaspoon of the batter. Place on the baking tray. Repeat across the tray, leaving plenty of room between each biscuit to spread. Dip a fork into cold water. Shake off the water. Use the back of the fork to press down gently on the batter dollops to help them spread a little. Place in the oven. Bake for around 4 minutes. The tuiles are ready when the edges turn a golden brown. The centre should stay white. Remove from the oven. While still hot, bend each biscuit over the rolling pin (or a clean bottle). Biscuits will probably break while you attempt this. You need to learn the fine timing of leaving the baked biscuits on the tray for a few seconds, then quickly turning them into curled biscuits. The biscuits can also be pressed into little moulds for different shapes, such as a basket to be filled with berries. Set the curved biscuits aside to cool. When cooled, they will harden into the curled shape. Serve with dessert or as a treat filled with whipped cream. Chocolate Tuiles Preheat the oven to 180ºC/350ºF. Lightly grease the baking tray (sheet) or line with parchment paper. Whisk the egg whites with the icing sugar to dissolve the icing sugar.  Add the flour and cocoa to the egg white. Whisk again. Let sit for 10-15 minutes. After it has rested, add the melted butter and stir through. Fill a teaspoon with the batter. Pour the teaspoonful onto the prepared tray. Spread thinly with the back of a fork that has been dipped in cold water. Add more teaspoons of batter. Leave plenty of space between each one to allow for spreading during baking. Place in the preheated oven. Bake for 5-8 minutes (this longer time compared to the above recipe is due to the fact that the temperature is quite a bit lower). Remove when baked. Since these biscuits are dark, it'll be hard to judge readiness just by looking. You'll need touch to test these ones. Remove from the tray with a palette knife. Roll over the rolling pin or clean bottle to curve each biscuit. Repeat for each biscuit. Slip the tuile off. Let it cool and harden. If using almonds as garnish, press into the biscuits before they harden.",
  "tyn_model":[
    "oven",
    "baking tray",
    "fork",
    "parchment paper",
    "flour",
    "butter",
    "almonds",
    "water",
    "rolling pin",
    "icing sugar",
    "sugars",
    "salt",
    "mixing bowl",
    "eggs",
    "whisk",
    "whipped cream",
    "chocolate tuiles",
    "cocoa",
    "tray",
    "palette knife"
  ],
  "tyn_section":[

  ]
}