{
  "title":"How to Make a 3D Dinosaur Head",
  "url":"https://www.wikihow.com/Make-a-3D-Dinosaur-Head",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "steps":[
    {
      "headline":"Log onto http://anim8or.com and download the free anim8or software.",
      "description":""
    },
    {
      "headline":"Once downloaded, click on the anim8or icon.",
      "description":""
    },
    {
      "headline":"Once it has loaded, form a Sphere.",
      "description":"You can do this by selecting the sphere in the left toolbar."
    },
    {
      "headline":"Double click on the sphere and bring up it's editing box.",
      "description":""
    },
    {
      "headline":"Change under Div.",
      "description":"Lon 12 to 10."
    },
    {
      "headline":"Go to “View/top” and click wire-frame mode.",
      "description":""
    },
    {
      "headline":"Go to “build” and select convert to mesh.",
      "description":""
    },
    {
      "headline":"Go into “Pixel Mode” and select edge editing mode.",
      "description":"Click the dotted edged box and select the area highlighted in dark green. You may do so by dragging the dotted lined box over the selected green area."
    },
    {
      "headline":"Click on the extrude box.",
      "description":"Use this to the extrude the edge you have just highlighted."
    },
    {
      "headline":"Click on the pyramid editing tool.",
      "description":"Use this to add a point to the end of the extrusion."
    },
    {
      "headline":"Go into “View/Right”.",
      "description":"Now, still in edge editing, click on the selection tool again. Select the area shown. Click on the pixel editing button and click on the “Two-Box” button. Use this to shrink the selected area so it looks like this."
    },
    {
      "headline":"Click the “Move Arrow” icon.",
      "description":"Pull up the selected area to the back of the head as if in the pigtail almost. Click the pixel icon. Use this to draw somewhat a diamond inside the area shown. This can only be done under the pixel-editing box."
    },
    {
      "headline":"Go into the line editing mode, which is not shown in this picture, but is next to the pixel-editing button.",
      "description":"Next click on the “select” button and use it to select the lines of the diamond. Now go into “Edit” and select “Fill Holes”"
    },
    {
      "headline":"Go back into the face editing tool and select the eye and the surrounding faces.",
      "description":"Next go into “Edit” and select “Merge faces”"
    },
    {
      "headline":"Click on the texture toolbar and select your texture you want to use on your head.",
      "description":"Also include a black texture. You should still be in the face editing tool while doing this. Now select the hole head and select the texture you want to use. Click apply. Select your diamond eye and select the black texture. Click apply. Select just the beak and create a new brown texture. You can play around with it to get the brown you want. Select it and click apply."
    },
    {
      "headline":"Click on the “smooth shaded” button up at the 2nd upper toolbar.",
      "description":"Go into “Build” and select “Convert to Subdivided”"
    },
    {
      "headline":"Click on the “cylinder”  and arrange it in an upright position like so.",
      "description":""
    },
    {
      "headline":"Click on “Build” then “Convert to Mesh”.",
      "description":""
    },
    {
      "headline":"Click on the modifier button and build it over the cylinder.",
      "description":"Click “Bend” on the box that pops up."
    },
    {
      "headline":"Double-click on the modifier and set the angle to 100.",
      "description":""
    },
    {
      "headline":"Go into “Build/Modifiers” and select “Bind modifier”",
      "description":""
    },
    {
      "headline":"Still in modifiers, select “Effect modifier”",
      "description":""
    },
    {
      "headline":"Select only the X parameter rotation.",
      "description":"Rotate the modified cylinder until it is sideways."
    },
    {
      "headline":"Select only the Z Parameter rotation tool and rotate until the cylinder looks like a curved neck.",
      "description":""
    },
    {
      "headline":"Place the neck beneath the head.",
      "description":"You should check it's alignment by going to “View/Bottom” and make sure it is directly beneath the head. Finally select the same texture you had for the head and apply it to the neck. Congratulations! You just made your first pterodactyl head in anim8or!"
    }
  ],
  "text":" Log onto http://anim8or.com and download the free anim8or software.  Once downloaded, click on the anim8or icon.  Once it has loaded, form a Sphere. You can do this by selecting the sphere in the left toolbar. Double click on the sphere and bring up it's editing box.  Change under Div. Lon 12 to 10. Go to “View/top” and click wire-frame mode.  Go to “build” and select convert to mesh.  Go into “Pixel Mode” and select edge editing mode. Click the dotted edged box and select the area highlighted in dark green. You may do so by dragging the dotted lined box over the selected green area. Click on the extrude box. Use this to the extrude the edge you have just highlighted. Click on the pyramid editing tool. Use this to add a point to the end of the extrusion. Go into “View/Right”. Now, still in edge editing, click on the selection tool again. Select the area shown. Click on the pixel editing button and click on the “Two-Box” button. Use this to shrink the selected area so it looks like this. Click the “Move Arrow” icon. Pull up the selected area to the back of the head as if in the pigtail almost. Click the pixel icon. Use this to draw somewhat a diamond inside the area shown. This can only be done under the pixel-editing box. Go into the line editing mode, which is not shown in this picture, but is next to the pixel-editing button. Next click on the “select” button and use it to select the lines of the diamond. Now go into “Edit” and select “Fill Holes” Go back into the face editing tool and select the eye and the surrounding faces. Next go into “Edit” and select “Merge faces” Click on the texture toolbar and select your texture you want to use on your head. Also include a black texture. You should still be in the face editing tool while doing this. Now select the hole head and select the texture you want to use. Click apply. Select your diamond eye and select the black texture. Click apply. Select just the beak and create a new brown texture. You can play around with it to get the brown you want. Select it and click apply. Click on the “smooth shaded” button up at the 2nd upper toolbar. Go into “Build” and select “Convert to Subdivided” Click on the “cylinder”  and arrange it in an upright position like so.  Click on “Build” then “Convert to Mesh”.  Click on the modifier button and build it over the cylinder. Click “Bend” on the box that pops up. Double-click on the modifier and set the angle to 100.  Go into “Build/Modifiers” and select “Bind modifier”  Still in modifiers, select “Effect modifier”  Select only the X parameter rotation. Rotate the modified cylinder until it is sideways. Select only the Z Parameter rotation tool and rotate until the cylinder looks like a curved neck.  Place the neck beneath the head. You should check it's alignment by going to “View/Bottom” and make sure it is directly beneath the head. Finally select the same texture you had for the head and apply it to the neck. Congratulations! You just made your first pterodactyl head in anim8or!",
  "tyn_model":[
    "” and",
    "“build",
    "“view",
    "” button",
    "”  ",
    "”.",
    "“edit",
    "” click",
    "“convert",
    "anim8or software",
    "wire-frame",
    "“pixel",
    "edge editing",
    "“two",
    "“move",
    "” icon",
    "“select",
    "“fill",
    "” go",
    "“merge",
    "texture",
    "face editing tool",
    "“smooth",
    "“cylinder",
    "” then",
    "“bend",
    "” on",
    "modifier",
    "“bind",
    "“effect",
    "pterodactyl head"
  ],
  "tyn_section":[

  ]
}