{
  "title":"How to Play Final Fantasy XIV",
  "url":"https://www.wikihow.com/Play-Final-Fantasy-XIV",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Final Fantasy"
  ],
  "methods":[
    {
      "name":"Creating a Character",
      "steps":[
        {
          "headline":"Create a new character or import one from Version 1.",
          "description":"When playing FFXIV, you have a few options in terms of character creation. If you played the first version of the game, released in 2010, you can import your characters from that game. This gives you the bonus of being able to retain the inventory and skills you had, while still allowing you to change everything about your character's race, appearance, name, etc. If you did not play the original version of the game, you can create a new character."
        },
        {
          "headline":"Select race and gender.",
          "description":"Gender does not have any effect on your abilities or stats, so choose whatever you like! You can choose from a variety of races, each with their own unique look. The races do impact your stats. However, the impact is so minimal and only impacts the initial stats, so you should still choose whatever you like best. However, please note that the new race, the Au Ra, can only be selected if you have purchased the Heavensward and Stormblood expansions. The available races include the Hyur (humans), Elezen (elves), Lalafell (token tiny race), Miqo’te (cat people), Roegadyn (big brutes), and the Au Ra (Dragonfolk). You can also choose a clan, which will further impact your stats. However, similar to the overall race, the impact of the choice in the long term is not enough to take into consideration."
        },
        {
          "headline":"Customize your appearance.",
          "description":"After choosing your race and gender, you may want to adjust your appearance as well. You can choose a random or default appearance, or you can change everything from eye color (you can have two!) to your hair style."
        },
        {
          "headline":"Select a Guardian.",
          "description":"This was once a way to determine a character's elemental resistances, but this has been patched out. Now, it's merely another flavor option."
        },
        {
          "headline":"Choose a Class.",
          "description":"Your class will determine a lot about how your game will start out. Class affects what weapon you use, what role you play in battles, and the abilities you will have. It even plays a role in what clothing or armor you will have access to as the game progresses. The classes that you will immediately have access to are the warrior and mage classes. As you reach higher levels, more classes will become available, as will jobs (available at level 30 or 50, depending on whether it was introduced in Heavensward or Stormblood), allow access to more abilities, limit access to cross-class abilities). Disciples of War (physical attack) classes include Gladiators (who later become Paladins), Pugilists (who later become Monks), Marauders (who later become Warriors), Lancers (who later become Dragoons), and Archers (who later become Bards). Disciples of Magic (magical attack) classes include Conjurers (who later become White Mages), Thaumaturges (later Black Mages), and Arcanists (who later become Summoners or Scholars). Once you reach level 10, you will be given your class quest. After this point, you will have the ability to switch to a Disciples of the Hand or Disciples of the Land class, stay with your current class, or switch to one of the other starting classes. Disciples of the Hand and Land are the crafting classes and can give you and your friends access to useful, high-level items. It is important to note that your class determines which city you start the game in. Though you will eventually have access to the rest of the world, your starting city will be where you become acquainted with the game."
        }
      ]
    },
    {
      "name":"Navigating the World and Interface",
      "steps":[
        {
          "headline":"Access the menus.",
          "description":"There are a variety of menus which can be accessed using the buttons at the bottom of the screen. The system menu, for example, will allow you to access to many of the settings. You can also access the settings menu by clicking Esc. Some of the other menus include:\nThe Map. You can use a variety of maps while playing the game. You can bring up the larger map (press M if playing on a PC), look at a map when viewing your quests, or use the mini-map in the corner of your screen. The map will tell you where to go for quest objectives, as well as the location of important characters, objects, or buildings. Your journal. Your journal will have important information about your quests and quest progress. You will also be able to see maps for each quest, as well as rewards. The journal can be brought up most easily by pressing J (on a PC). Your item menus. You can access your general inventory either through the main inventory menu or by selecting the colorful squares above your main buttons. The colorful squares indicate slots in your inventory occupied by items. You can access weapons and armor through your armory menu. You can have 25 of each type of weapon. Right-click (on the PC) to get a few of the item options."
        },
        {
          "headline":"Interact with NPCs.",
          "description":"You can interact with NPCs to get quests and rewards. When buttons appear above an NPCs head, this means you can interact with them. A tan button will appear when you can talk with an NPC to get a quest. When you’ve completed a quest, a green button above the NPCs head will need to be selected in order to get your reward. When talking with any NPC, you will need to right-click on the text screens to progress through them."
        },
        {
          "headline":"Interact with your friends.",
          "description":"There are lots of ways you can interact with your friends in the game. Aside from the usual joining of guilds and friending people you know or joining their characters in the world, you can also use the Moogle Delivery Service to send messages, items, and money to other characters. Find a Moogle to receive items you are sent. You can also set up or join a Linkshell, which will allow you access to a closed chat with only the people attached to the Linkshell. This is a great way to interact with your friends or guildmates. When you are at the very beginning of the game, you will not be able to see or play with other people in the world. However, once you make it through the beginning tutorial, you will be able to join your friends."
        },
        {
          "headline":"Make use of Aetherytes and other transportation methods.",
          "description":"There are many ways, within the game, to travel between the cities, within the cities, and even to smaller settlements. Aetherytes, for example, are a great mode of transportation. These large crystals, seen throughout the world, will instantly transport you between any place you have visited before. All you have to do is attune yourself to each crystal you come across by interacting with it. You can also use airships, ferries, and Chocobos (either that you own or hire) to travel between areas. The smaller Aetherytes are for travel within your current city."
        },
        {
          "headline":"Exit the game properly.",
          "description":"The game autosaves, so you won’t need to constantly save your progress. However, to make sure that your  most recent progress saves correctly before you quit the game, make sure that you exit the game through the menu (rather than just turning it off)."
        }
      ]
    },
    {
      "name":"Starting and Progressing Through the Game",
      "steps":[
        {
          "headline":"Play through the tutorial.",
          "description":"The tutorial will have a lot of vital information and will help you get to know the complex world much better. You should pay attention and not try to skip through all of the information which appears on the screen. Even if you played the first version, it is important to remember that this game is very different. When you first begin the tutorial, you will also have the ability to set your peripherals (if playing on a PC). This will allow you to pair a game controller with PC play, if you wish to."
        },
        {
          "headline":"Become acquainted with the adventurer’s area.",
          "description":"Though it will be different for each city, there is a main Adventurer’s area, encountered at the end of the main tutorial, where you will be able to get information, acquire quests, and meet all sorts of characters."
        },
        {
          "headline":"Play through the starting quests and visit your class guild.",
          "description":"It is important not to try to skip the initial quests or a visit to your class guild. Doing these things not only gives you important information and introduces you to how the game works, it also will give you experience (XP) which will help your character level and become strong enough to defend yourself out in the world."
        },
        {
          "headline":"Complete the main quests.",
          "description":"The quests which are part of the main story of the game will be marked in much the same way as other quests (with a button hovering over characters’ heads). However, these quests are easy to distinguish because the button will have a different shape (like they’re on fire). These quests are an important way to level your first class, since the side quests are not repeatable and should be saved for leveling up second classes or general later leveling."
        }
      ]
    },
    {
      "name":"Battling Effectively",
      "steps":[
        {
          "headline":"Learn your skills for your class.",
          "description":"Learn your skills, or abilities, for your class. These abilities will let you fight better and more skillfully by giving you powerful moves and defenses. Learn your skills by leveling your character: the higher your level, the more powerful a fighter you will be. Skills are divided into three categories- Actions, Role Actions, and Traits."
        },
        {
          "headline":"Actions are activated skills that can be divided further into two categories- Class actions and Job actions.",
          "description":"Class actions are the skills available to the beginning classes, and will be available even as you progress to your class's job. Job actions can only be used when you've progressed and unlocked the job and required level to obtain them. Role actions are non-unique skills shared by the three Roles (Tank, Healer, and DPS). Each role shares the actions available (For example, every healer has access to Cleric Stance, Protect, and Esuna). Role actions are unique in that they must be assigned to an action slot in the Role menu. Classes can equip ten role actions (as many role actions as any class gets) but jobs can only equip five, so choose wisely! Traits are similar to actions, except that they are passive abilities, rather than active ones. This means that they are always in effect. Some classes and jobs get more than others. They can boost attributes, or even automatically upgrade skills. For example, Stone Mastery, a Conjurer skill, will automatically change Stone to Stone II."
        },
        {
          "headline":"Avoid enemy attacks.",
          "description":"When battling enemies, you will want to stay out of the way of their attacks if possible. If you are a ranged fighter, make sure you stay ranged. If you do have a reason to fight up close with an enemy, look out for glowing shapes on the ground around you. This is their area of attack and will show up right before they execute an attack. If the shape is red, that means it will hurt you and you need to get out of the way! As you gain levels and fight harder enemies, the amount of time you have to get out of the way will be less and less. Don’t worry, they give you plenty of time in the beginning to get used to the system."
        },
        {
          "headline":"Use combos.",
          "description":"Combos are actions used in a particular order to execute powerful moves which can really help turn a battle. You will probably not have access to any combos until you’ve gained several levels, however, as you’ll need many abilities to use in combination!"
        },
        {
          "headline":"Work with your teammates.",
          "description":"With games like this one, it is very important to work with other people to beat enemies. Each class has it’s own strengths and weaknesses and when players from a variety of classes play in balanced teams, dispatching enemies will come with ease! Consider joining a free company (player guild) or forming your own team with your friends. You can even use features of the game to make fighting with your teammates even easier. For example, enemies can be marked, which will allow you and your teammates to coordinate attacks. Use limit breaks. If you fight in a party of four or more, you’ll get to use the limit gauge. As you deal damage and heal allies, you’ll fill the gauge until a special move is unlocked. What the move will be will depend on the role and class of the player activating it, but these moves are very useful and should be taken advantage of. DPS players get highly damaging moves, the exact attack varying with class and job. Tank players can give a party wide defensive buff. Healer players are capable of fully restoring the HP of all players within 30 yards (27.4 m), with a Raise effect added at Limit break level three. Please note that Limit Break 3 is only available in Full Parties (8 or more players)."
        }
      ]
    },
    {
      "name":"Leveling Your Character",
      "steps":[
        {
          "headline":"Do lots of quests.",
          "description":"Quests are the best way to level your character, so do whatever quests you can find. If you plan on leveling more than one class, you may need to plan out what quests you do when, but you will want to be sure that you are generally doing quests. Guild Leaves are a good way to get XP and level your character. These are time-limited quests which are received from the Adventurer’s Guild. The tasks can be battle oriented or simply be a request to fetch items or craft items."
        },
        {
          "headline":"Participate in FATEs.",
          "description":"FATEs are randomly generated battles which occur as you travel around the world. Any players in the area can participate and the XP and rewards are determined only by how much you contribute to the battle. These are a great way to get XP, so make sure to get out on the road every now and again! It doesn’t matter if someone else is fighting a creature: you can join in to help! Players will not lose anything by getting help in a battle. The first person to engage an enemy will always receive 100% of the associated XP."
        },
        {
          "headline":"Fight creatures out in the world.",
          "description":"You can level grind by fighting the small, minor creatures you encounter out in the world. These will yield small XP gains, but come in an unlimited supply, so they’re still a great way to level your character."
        },
        {
          "headline":"Complete items from your logs to gain extra XP.",
          "description":"You will have a variety of logs, where you are tasked with finding X number of a particular item. Complete the collection and you will be given an XP and monetary reward. Certain logs are individualized to your class, and can be worked on at any point (in other words, don’t save them for leveling later classes). You crafting and gathering logs will give you experience rewards, generally for crafting or gathering an item for the first time. Work on your hunting log. Your hunting log will give you XP and money for killing a certain number of particular monsters. This is individualized to class, so you should feel free to go ahead and work on your hunting log at any time. This makes them a great way to level a second class."
        },
        {
          "headline":"Get XP buffs when you can.",
          "description":"Certain items and situations can help you gain XP faster. Some foods and drinks will provide a small XP buff. You will also receive an XP buff as apart of free company activities, so consider joining one."
        }
      ]
    }
  ],
  "text":" Creating a Character Create a new character or import one from Version 1. When playing FFXIV, you have a few options in terms of character creation. If you played the first version of the game, released in 2010, you can import your characters from that game. This gives you the bonus of being able to retain the inventory and skills you had, while still allowing you to change everything about your character's race, appearance, name, etc. If you did not play the original version of the game, you can create a new character. Select race and gender. Gender does not have any effect on your abilities or stats, so choose whatever you like! You can choose from a variety of races, each with their own unique look. The races do impact your stats. However, the impact is so minimal and only impacts the initial stats, so you should still choose whatever you like best. However, please note that the new race, the Au Ra, can only be selected if you have purchased the Heavensward and Stormblood expansions. The available races include the Hyur (humans), Elezen (elves), Lalafell (token tiny race), Miqo’te (cat people), Roegadyn (big brutes), and the Au Ra (Dragonfolk). You can also choose a clan, which will further impact your stats. However, similar to the overall race, the impact of the choice in the long term is not enough to take into consideration. Customize your appearance. After choosing your race and gender, you may want to adjust your appearance as well. You can choose a random or default appearance, or you can change everything from eye color (you can have two!) to your hair style. Select a Guardian. This was once a way to determine a character's elemental resistances, but this has been patched out. Now, it's merely another flavor option. Choose a Class. Your class will determine a lot about how your game will start out. Class affects what weapon you use, what role you play in battles, and the abilities you will have. It even plays a role in what clothing or armor you will have access to as the game progresses. The classes that you will immediately have access to are the warrior and mage classes. As you reach higher levels, more classes will become available, as will jobs (available at level 30 or 50, depending on whether it was introduced in Heavensward or Stormblood), allow access to more abilities, limit access to cross-class abilities). Disciples of War (physical attack) classes include Gladiators (who later become Paladins), Pugilists (who later become Monks), Marauders (who later become Warriors), Lancers (who later become Dragoons), and Archers (who later become Bards). Disciples of Magic (magical attack) classes include Conjurers (who later become White Mages), Thaumaturges (later Black Mages), and Arcanists (who later become Summoners or Scholars). Once you reach level 10, you will be given your class quest. After this point, you will have the ability to switch to a Disciples of the Hand or Disciples of the Land class, stay with your current class, or switch to one of the other starting classes. Disciples of the Hand and Land are the crafting classes and can give you and your friends access to useful, high-level items. It is important to note that your class determines which city you start the game in. Though you will eventually have access to the rest of the world, your starting city will be where you become acquainted with the game. Navigating the World and Interface Access the menus. There are a variety of menus which can be accessed using the buttons at the bottom of the screen. The system menu, for example, will allow you to access to many of the settings. You can also access the settings menu by clicking Esc. Some of the other menus include:\nThe Map. You can use a variety of maps while playing the game. You can bring up the larger map (press M if playing on a PC), look at a map when viewing your quests, or use the mini-map in the corner of your screen. The map will tell you where to go for quest objectives, as well as the location of important characters, objects, or buildings. Your journal. Your journal will have important information about your quests and quest progress. You will also be able to see maps for each quest, as well as rewards. The journal can be brought up most easily by pressing J (on a PC). Your item menus. You can access your general inventory either through the main inventory menu or by selecting the colorful squares above your main buttons. The colorful squares indicate slots in your inventory occupied by items. You can access weapons and armor through your armory menu. You can have 25 of each type of weapon. Right-click (on the PC) to get a few of the item options. Interact with NPCs. You can interact with NPCs to get quests and rewards. When buttons appear above an NPCs head, this means you can interact with them. A tan button will appear when you can talk with an NPC to get a quest. When you’ve completed a quest, a green button above the NPCs head will need to be selected in order to get your reward. When talking with any NPC, you will need to right-click on the text screens to progress through them. Interact with your friends. There are lots of ways you can interact with your friends in the game. Aside from the usual joining of guilds and friending people you know or joining their characters in the world, you can also use the Moogle Delivery Service to send messages, items, and money to other characters. Find a Moogle to receive items you are sent. You can also set up or join a Linkshell, which will allow you access to a closed chat with only the people attached to the Linkshell. This is a great way to interact with your friends or guildmates. When you are at the very beginning of the game, you will not be able to see or play with other people in the world. However, once you make it through the beginning tutorial, you will be able to join your friends. Make use of Aetherytes and other transportation methods. There are many ways, within the game, to travel between the cities, within the cities, and even to smaller settlements. Aetherytes, for example, are a great mode of transportation. These large crystals, seen throughout the world, will instantly transport you between any place you have visited before. All you have to do is attune yourself to each crystal you come across by interacting with it. You can also use airships, ferries, and Chocobos (either that you own or hire) to travel between areas. The smaller Aetherytes are for travel within your current city. Exit the game properly. The game autosaves, so you won’t need to constantly save your progress. However, to make sure that your  most recent progress saves correctly before you quit the game, make sure that you exit the game through the menu (rather than just turning it off). Starting and Progressing Through the Game Play through the tutorial. The tutorial will have a lot of vital information and will help you get to know the complex world much better. You should pay attention and not try to skip through all of the information which appears on the screen. Even if you played the first version, it is important to remember that this game is very different. When you first begin the tutorial, you will also have the ability to set your peripherals (if playing on a PC). This will allow you to pair a game controller with PC play, if you wish to. Become acquainted with the adventurer’s area. Though it will be different for each city, there is a main Adventurer’s area, encountered at the end of the main tutorial, where you will be able to get information, acquire quests, and meet all sorts of characters. Play through the starting quests and visit your class guild. It is important not to try to skip the initial quests or a visit to your class guild. Doing these things not only gives you important information and introduces you to how the game works, it also will give you experience (XP) which will help your character level and become strong enough to defend yourself out in the world. Complete the main quests. The quests which are part of the main story of the game will be marked in much the same way as other quests (with a button hovering over characters’ heads). However, these quests are easy to distinguish because the button will have a different shape (like they’re on fire). These quests are an important way to level your first class, since the side quests are not repeatable and should be saved for leveling up second classes or general later leveling. Battling Effectively Learn your skills for your class. Learn your skills, or abilities, for your class. These abilities will let you fight better and more skillfully by giving you powerful moves and defenses. Learn your skills by leveling your character: the higher your level, the more powerful a fighter you will be. Skills are divided into three categories- Actions, Role Actions, and Traits. Actions are activated skills that can be divided further into two categories- Class actions and Job actions. Class actions are the skills available to the beginning classes, and will be available even as you progress to your class's job. Job actions can only be used when you've progressed and unlocked the job and required level to obtain them. Role actions are non-unique skills shared by the three Roles (Tank, Healer, and DPS). Each role shares the actions available (For example, every healer has access to Cleric Stance, Protect, and Esuna). Role actions are unique in that they must be assigned to an action slot in the Role menu. Classes can equip ten role actions (as many role actions as any class gets) but jobs can only equip five, so choose wisely! Traits are similar to actions, except that they are passive abilities, rather than active ones. This means that they are always in effect. Some classes and jobs get more than others. They can boost attributes, or even automatically upgrade skills. For example, Stone Mastery, a Conjurer skill, will automatically change Stone to Stone II. Avoid enemy attacks. When battling enemies, you will want to stay out of the way of their attacks if possible. If you are a ranged fighter, make sure you stay ranged. If you do have a reason to fight up close with an enemy, look out for glowing shapes on the ground around you. This is their area of attack and will show up right before they execute an attack. If the shape is red, that means it will hurt you and you need to get out of the way! As you gain levels and fight harder enemies, the amount of time you have to get out of the way will be less and less. Don’t worry, they give you plenty of time in the beginning to get used to the system. Use combos. Combos are actions used in a particular order to execute powerful moves which can really help turn a battle. You will probably not have access to any combos until you’ve gained several levels, however, as you’ll need many abilities to use in combination! Work with your teammates. With games like this one, it is very important to work with other people to beat enemies. Each class has it’s own strengths and weaknesses and when players from a variety of classes play in balanced teams, dispatching enemies will come with ease! Consider joining a free company (player guild) or forming your own team with your friends. You can even use features of the game to make fighting with your teammates even easier. For example, enemies can be marked, which will allow you and your teammates to coordinate attacks. Use limit breaks. If you fight in a party of four or more, you’ll get to use the limit gauge. As you deal damage and heal allies, you’ll fill the gauge until a special move is unlocked. What the move will be will depend on the role and class of the player activating it, but these moves are very useful and should be taken advantage of. DPS players get highly damaging moves, the exact attack varying with class and job. Tank players can give a party wide defensive buff. Healer players are capable of fully restoring the HP of all players within 30 yards (27.4 m), with a Raise effect added at Limit break level three. Please note that Limit Break 3 is only available in Full Parties (8 or more players). Leveling Your Character Do lots of quests. Quests are the best way to level your character, so do whatever quests you can find. If you plan on leveling more than one class, you may need to plan out what quests you do when, but you will want to be sure that you are generally doing quests. Guild Leaves are a good way to get XP and level your character. These are time-limited quests which are received from the Adventurer’s Guild. The tasks can be battle oriented or simply be a request to fetch items or craft items. Participate in FATEs. FATEs are randomly generated battles which occur as you travel around the world. Any players in the area can participate and the XP and rewards are determined only by how much you contribute to the battle. These are a great way to get XP, so make sure to get out on the road every now and again! It doesn’t matter if someone else is fighting a creature: you can join in to help! Players will not lose anything by getting help in a battle. The first person to engage an enemy will always receive 100% of the associated XP. Fight creatures out in the world. You can level grind by fighting the small, minor creatures you encounter out in the world. These will yield small XP gains, but come in an unlimited supply, so they’re still a great way to level your character. Complete items from your logs to gain extra XP. You will have a variety of logs, where you are tasked with finding X number of a particular item. Complete the collection and you will be given an XP and monetary reward. Certain logs are individualized to your class, and can be worked on at any point (in other words, don’t save them for leveling later classes). You crafting and gathering logs will give you experience rewards, generally for crafting or gathering an item for the first time. Work on your hunting log. Your hunting log will give you XP and money for killing a certain number of particular monsters. This is individualized to class, so you should feel free to go ahead and work on your hunting log at any time. This makes them a great way to level a second class. Get XP buffs when you can. Certain items and situations can help you gain XP faster. Some foods and drinks will provide a small XP buff. You will also receive an XP buff as apart of free company activities, so consider joining one.",
  "tyn_model":[
    "journal",
    "aetherytes",
    "combos",
    "ffxiv,",
    "elezen",
    "guardian",
    "lancers",
    "dragoons",
    "archers",
    "magic",
    "thaumaturges",
    "arcanists",
    "maps",
    "map",
    "armor",
    "moogle",
    "airships",
    "ferries",
    "chocobos",
    "game controller",
    "’ heads",
    "role actions",
    "protect",
    "actions",
    "healer",
    "quests",
    "guild leaves",
    "adventurer’s guild"
  ],
  "tyn_section":[

  ]
}