{
  "title":"How to Make Bounty Bars",
  "url":"https://www.wikihow.com/Make-Bounty-Bars",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Bars and Slices"
  ],
  "steps":[
    {
      "headline":"Make the filling.",
      "description":"Pour the condensed milk in to a large bowl. Sift the icing sugar using the sieve (If you don't have one, just tip it in slowly)."
    },
    {
      "headline":"Add the desiccated coconut, and stir until there are no dry bits left.",
      "description":""
    },
    {
      "headline":"Line a loaf tin with some plastic wrap (make sure there is some plastic wrap hanging over the sides, this would come in handy later).",
      "description":""
    },
    {
      "headline":"Put in the mixture you made.",
      "description":""
    },
    {
      "headline":"Put the mixture in the fridge and leave overnight.",
      "description":""
    },
    {
      "headline":"Take the loaf tin out of the fridge the next morning.",
      "description":"The mixture should be hard by now, like the inside of a Bounty."
    },
    {
      "headline":"Lift the mixture out of the loaf tin using the plastic wrap hanging over the sides.",
      "description":""
    },
    {
      "headline":"Take the plastic wrap off and cut the mixture into small, bite-size blocks.",
      "description":""
    },
    {
      "headline":"Melt some chocolate.",
      "description":""
    },
    {
      "headline":"Roll the blocks one by one into the chocolate when the chocolate is melted.",
      "description":""
    },
    {
      "headline":"Leave the chocolate to set on the blocks when you're done.",
      "description":""
    },
    {
      "headline":"Well done, you made your own Bounty!",
      "description":""
    }
  ],
  "text":" Make the filling. Pour the condensed milk in to a large bowl. Sift the icing sugar using the sieve (If you don't have one, just tip it in slowly). Add the desiccated coconut, and stir until there are no dry bits left.  Line a loaf tin with some plastic wrap (make sure there is some plastic wrap hanging over the sides, this would come in handy later).  Put in the mixture you made.  Put the mixture in the fridge and leave overnight.  Take the loaf tin out of the fridge the next morning. The mixture should be hard by now, like the inside of a Bounty. Lift the mixture out of the loaf tin using the plastic wrap hanging over the sides.  Take the plastic wrap off and cut the mixture into small, bite-size blocks.  Melt some chocolate.  Roll the blocks one by one into the chocolate when the chocolate is melted.  Leave the chocolate to set on the blocks when you're done.  Well done, you made your own Bounty! ",
  "tyn_model":[
    "plastic wrap",
    "chocolate",
    "loaf tin",
    "condensed milk",
    "large bowl",
    "icing sugar",
    "sieve",
    "coconut",
    "fridge"
  ],
  "tyn_section":[

  ]
}