{
  "title":"How to Make a Clothespin Sailing Boat",
  "url":"https://www.wikihow.com/Make-a-Clothespin-Sailing-Boat",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Model Making",
    "Model Boats and Ships"
  ],
  "methods":[
    {
      "name":"Step One: Making the sail",
      "steps":[
        {
          "headline":"Cut a piece of strong but thin card into a triangle, for the sail.",
          "description":"The base of the triangle should be about 10-12cm (4-6\"), the edges the same."
        },
        {
          "headline":"Slide the triangle into the clothespin slit.",
          "description":"Use additional small pieces of card or poster tack to wedge it into place."
        },
        {
          "headline":"Pierce a small hole in the top corner of the sail.",
          "description":"This is the bit that will be above the water. Slip string through this and tie a small knot to prevent the string slipping back through. Trim the string to neaten."
        },
        {
          "headline":"Pull the string taut from the sail to the round clothespin end.",
          "description":"Wrap around this round knob several times. Leave string dangling down for the next step."
        }
      ]
    },
    {
      "name":"Step Two: Adding the anchor and keel weight",
      "steps":[
        {
          "headline":"Attach a weight such as a washer or other round weighted object to the end of the string.",
          "description":"This serves as the boat's anchor. Allow to dangle but trim off excess string after firmly attaching."
        },
        {
          "headline":"Place a weight on the lower side of the triangle sail.",
          "description":"This serves as the boat's keel. An object such as a button, safety pin or unwanted earring can be used for this. Glue or attach firmly in place."
        }
      ]
    },
    {
      "name":"Step Three: Finishing touches and sailing",
      "steps":[
        {
          "headline":"Add a sailor or two.",
          "description":"Cut out some people figures and glue in place on the boat."
        },
        {
          "headline":"Test sail.",
          "description":"It's most likely you'll need to make adjustments and fiddle around a bit before you discover the best sailing position for the boat. Making changes or even starting again from scratch is part of the learning process for budding boat engineers! Experiment in a basin of water first, instead of losing your sailing boat down the stream."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Step One: Making the sail Cut a piece of strong but thin card into a triangle, for the sail. The base of the triangle should be about 10-12cm (4-6\"), the edges the same. Slide the triangle into the clothespin slit. Use additional small pieces of card or poster tack to wedge it into place. Pierce a small hole in the top corner of the sail. This is the bit that will be above the water. Slip string through this and tie a small knot to prevent the string slipping back through. Trim the string to neaten. Pull the string taut from the sail to the round clothespin end. Wrap around this round knob several times. Leave string dangling down for the next step. Step Two: Adding the anchor and keel weight Attach a weight such as a washer or other round weighted object to the end of the string. This serves as the boat's anchor. Allow to dangle but trim off excess string after firmly attaching. Place a weight on the lower side of the triangle sail. This serves as the boat's keel. An object such as a button, safety pin or unwanted earring can be used for this. Glue or attach firmly in place. Step Three: Finishing touches and sailing Add a sailor or two. Cut out some people figures and glue in place on the boat. Test sail. It's most likely you'll need to make adjustments and fiddle around a bit before you discover the best sailing position for the boat. Making changes or even starting again from scratch is part of the learning process for budding boat engineers! Experiment in a basin of water first, instead of losing your sailing boat down the stream. Finished. ",
  "tyn_model":[
    "card",
    "water",
    "string",
    "glue",
    "washer"
  ],
  "tyn_section":[

  ]
}