{
  "title":"How to Find the Character Coins for Yoshi's Island DS World 1",
  "url":"https://www.wikihow.com/Find-the-Character-Coins-for-Yoshi%27s-Island-DS-World-1",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo DS"
  ],
  "steps":[
    {
      "headline":"Go down the pipe towards the end of the level.",
      "description":"MARIO."
    },
    {
      "headline":"Go into the cave with Mario and hit the M blocks to make a bouncy appear.",
      "description":"Then go back for princess peach at a stork stop and bounce up to the coin. PEACH."
    },
    {
      "headline":"Near the goal ring you will find a wind blowing into the air.",
      "description":"Use baby Peach to glide up and collect the coin. PEACH."
    },
    {
      "headline":"In the second area there is rotating spikes.",
      "description":"Hop along the platforms up to get to the top. MARIO."
    },
    {
      "headline":"Midway through the level, follow the diagonal winds.",
      "description":"They will take you to the coin. PEACH."
    },
    {
      "headline":"After you fly up with peach in the beginning, you will see M blocks.",
      "description":"Switch to Mario, hit them, and a sunflower will grow. climb it for the coin! MARIO."
    },
    {
      "headline":"There will be one area with many vines.",
      "description":"Climb with DK until you see the gold! DONKEY KONG."
    },
    {
      "headline":"This one is a puzzle.",
      "description":"You will reach an area with one locked door and one unlocked. Enter the unlocked and you will see large stones. Shoot down the first wall. Next, jump onto that wall. Shoot down the third wall and jump onto that one. Now, shoot the second one and from that wall, shoot down the fourth wall to create homogeneous \"steps.\" PEACH."
    }
  ],
  "text":" Go down the pipe towards the end of the level. MARIO. Go into the cave with Mario and hit the M blocks to make a bouncy appear. Then go back for princess peach at a stork stop and bounce up to the coin. PEACH. Near the goal ring you will find a wind blowing into the air. Use baby Peach to glide up and collect the coin. PEACH. In the second area there is rotating spikes. Hop along the platforms up to get to the top. MARIO. Midway through the level, follow the diagonal winds. They will take you to the coin. PEACH. After you fly up with peach in the beginning, you will see M blocks. Switch to Mario, hit them, and a sunflower will grow. climb it for the coin! MARIO. There will be one area with many vines. Climb with DK until you see the gold! DONKEY KONG. This one is a puzzle. You will reach an area with one locked door and one unlocked. Enter the unlocked and you will see large stones. Shoot down the first wall. Next, jump onto that wall. Shoot down the third wall and jump onto that one. Now, shoot the second one and from that wall, shoot down the fourth wall to create homogeneous \"steps.\" PEACH.",
  "tyn_model":[
    "peach",
    "spikes",
    "mario",
    "stones"
  ],
  "tyn_section":[

  ]
}