{
  "title":"How to Bake a Gooseberry Pie",
  "url":"https://www.wikihow.com/Bake-a-Gooseberry-Pie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies"
  ],
  "parts":[
    {
      "name":"Making the Pastry",
      "steps":[
        {
          "headline":"In a medium sized bowl, stir the softened butter and icing sugar using a hand blender or a whisk.",
          "description":"Make sure that they are mixed well and begin too fluff up, looking a bright yellow."
        },
        {
          "headline":"Add in beaten egg yolks to sugar mixture.",
          "description":"Blend again. Mixture may start to get watery but that is normal."
        },
        {
          "headline":"Add in the flour.",
          "description":"This time, use your fingers to crumble and smooth in pastry. Use tablespoons of water to help pastry dough form. Once doughy, roll into a ball."
        },
        {
          "headline":"Place dough in a bowl and cover it with plastic wrap or aluminum foil.",
          "description":"Place in freezer and have it freeze for half and hour (30 minutes)."
        }
      ]
    },
    {
      "name":"Making the Filling",
      "steps":[
        {
          "headline":"Pour the fresh gooseberries, caster sugar, water, and port (if desired) into a medium sized frying pan.",
          "description":"Placing the stove on medium, have it cook for about ten minutes to simmer."
        },
        {
          "headline":"Taste filling.",
          "description":"If needed, add extra sugar for more taste. If not, shut stove off and pour filling into a small bowl."
        }
      ]
    },
    {
      "name":"Baking the Pie",
      "steps":[
        {
          "headline":"Preheat your oven to 190 degrees Celsius.",
          "description":""
        },
        {
          "headline":"Remove half of the pastry from freezer.",
          "description":"Roll it out on a floured cooking space using a rolling pin. Try stretching it out until it can fit your pie dish. Once stretched, push dough into pie dish. Poke a fork on the sides of the dough."
        },
        {
          "headline":"Pour in gooseberry filling into pie.",
          "description":""
        },
        {
          "headline":"Roll out remaining pie crust.",
          "description":"Place on top of pie and use a fork to push the dough edges. Use a pastry brush to wash the top with water. Sprinkle and dust extra flour on top."
        },
        {
          "headline":"Bake pie in oven for thirty minutes.",
          "description":"The pie crust edges and top will turn golden brown when ready."
        },
        {
          "headline":"Remove from oven using oven mitts.",
          "description":"Have it cool for five minutes. Serve with vanilla ice cream or homemade whipped cream."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Pastry In a medium sized bowl, stir the softened butter and icing sugar using a hand blender or a whisk. Make sure that they are mixed well and begin too fluff up, looking a bright yellow. Add in beaten egg yolks to sugar mixture. Blend again. Mixture may start to get watery but that is normal. Add in the flour. This time, use your fingers to crumble and smooth in pastry. Use tablespoons of water to help pastry dough form. Once doughy, roll into a ball. Place dough in a bowl and cover it with plastic wrap or aluminum foil. Place in freezer and have it freeze for half and hour (30 minutes). Making the Filling Pour the fresh gooseberries, caster sugar, water, and port (if desired) into a medium sized frying pan. Placing the stove on medium, have it cook for about ten minutes to simmer. Taste filling. If needed, add extra sugar for more taste. If not, shut stove off and pour filling into a small bowl. Baking the Pie Preheat your oven to 190 degrees Celsius.  Remove half of the pastry from freezer. Roll it out on a floured cooking space using a rolling pin. Try stretching it out until it can fit your pie dish. Once stretched, push dough into pie dish. Poke a fork on the sides of the dough. Pour in gooseberry filling into pie.  Roll out remaining pie crust. Place on top of pie and use a fork to push the dough edges. Use a pastry brush to wash the top with water. Sprinkle and dust extra flour on top. Bake pie in oven for thirty minutes. The pie crust edges and top will turn golden brown when ready. Remove from oven using oven mitts. Have it cool for five minutes. Serve with vanilla ice cream or homemade whipped cream. Finished. ",
  "tyn_model":[
    "pastry",
    "water",
    "oven",
    "sugar",
    "flour",
    "pie dish",
    "butter",
    "icing sugar",
    "hand blender",
    "whisk",
    "bowl",
    "plastic wrap",
    "aluminum foil",
    "freezer",
    "gooseberries",
    "caster sugar",
    "port",
    "medium sized frying",
    "stove",
    "small bowl",
    "rolling pin",
    "fork",
    "gooseberry filling",
    "pie crust",
    "pastry brush",
    "oven mitts",
    "vanilla ice cream",
    "whipped cream"
  ],
  "tyn_section":[

  ]
}