{
  "title":"How to Upload Images to Imgur",
  "url":"https://www.wikihow.com/Upload-Images-to-Imgur",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography"
  ],
  "methods":[
    {
      "name":"On Mobile",
      "steps":[
        {
          "headline":"Open Imgur.",
          "description":"It's a dark-grey app with \"imgur\" written on it."
        },
        {
          "headline":"Tap the camera icon.",
          "description":"This option is at the bottom-center of the screen. If you aren't signed into Imgur on your phone, first tap sign in and enter your email address and password. On Android, you must first swipe the screen left before signing in."
        },
        {
          "headline":"Select a photo.",
          "description":"Your camera roll photos are displayed on this page; tapping a photo will select it. If prompted, first allow Imgur access to your phone's camera and photos. You can tap multiple photos to select each of them."
        },
        {
          "headline":"Tap Next.",
          "description":"It's in the top-right corner of the screen. On some versions of Android, you'll tap a checkmark here instead."
        },
        {
          "headline":"Enter your post's title.",
          "description":"You'll do this in the \"Post Title (required)\" field near the top of the screen."
        },
        {
          "headline":"Edit your photo if need be.",
          "description":"You can add a description or tags in the grey field at the bottom of the screen. You can also tap Add Images below your photo to select more photos to add to the post."
        },
        {
          "headline":"Tap Post.",
          "description":"This is in the top-right corner of the screen."
        },
        {
          "headline":"Tap Upload when prompted.",
          "description":"Doing so will upload your photo to Imgur."
        }
      ]
    },
    {
      "name":"On Desktop",
      "steps":[
        {
          "headline":"Go to Imgur's website.",
          "description":"It's located at https://imgur.com/."
        },
        {
          "headline":"Click New post.",
          "description":"This is a green button at the top of the Imgur home page. Doing so will open an upload window. If you aren't signed into Imgur, first click sign in in the top-left side of the page and enter your email address and password. Clicking the downward-facing arrow on the right side of this button will invoke a drop-down menu with other post options (e.g., Make a Meme)."
        },
        {
          "headline":"Click Browse.",
          "description":"It's in the middle of the upload window."
        },
        {
          "headline":"Select an image from your computer.",
          "description":"If you'd like to select multiple pictures, click them while holding down either ⌘ Command (Mac) or Ctrl (PC). You can also click and drag an image (or multiple images) into the Imgur window to upload it/them. If you have the image's URL address, you can copy it into the \"Paste Image or URL\" box."
        },
        {
          "headline":"Click Open.",
          "description":"Doing so will upload your photo to Imgur. If you dragged photos into the Imgur window, skip this step."
        },
        {
          "headline":"Add a title to your photo.",
          "description":"You'll do so in the field at the top of the photo."
        },
        {
          "headline":"Edit your photos if need be.",
          "description":"You can add a description or tags in the grey field below the photo, or you can tag a user by typing \"@\" followed by their username. You can also click Add another image below your image(s) to select more images."
        },
        {
          "headline":"Click Share to community.",
          "description":"This green button is on the right side of the page; clicking it will post your image(s) to the Imgur site."
        }
      ]
    }
  ],
  "text":" On Mobile Open Imgur. It's a dark-grey app with \"imgur\" written on it. Tap the camera icon. This option is at the bottom-center of the screen. If you aren't signed into Imgur on your phone, first tap sign in and enter your email address and password. On Android, you must first swipe the screen left before signing in. Select a photo. Your camera roll photos are displayed on this page; tapping a photo will select it. If prompted, first allow Imgur access to your phone's camera and photos. You can tap multiple photos to select each of them. Tap Next. It's in the top-right corner of the screen. On some versions of Android, you'll tap a checkmark here instead. Enter your post's title. You'll do this in the \"Post Title (required)\" field near the top of the screen. Edit your photo if need be. You can add a description or tags in the grey field at the bottom of the screen. You can also tap Add Images below your photo to select more photos to add to the post. Tap Post. This is in the top-right corner of the screen. Tap Upload when prompted. Doing so will upload your photo to Imgur. On Desktop Go to Imgur's website. It's located at https://imgur.com/. Click New post. This is a green button at the top of the Imgur home page. Doing so will open an upload window. If you aren't signed into Imgur, first click sign in in the top-left side of the page and enter your email address and password. Clicking the downward-facing arrow on the right side of this button will invoke a drop-down menu with other post options (e.g., Make a Meme). Click Browse. It's in the middle of the upload window. Select an image from your computer. If you'd like to select multiple pictures, click them while holding down either ⌘ Command (Mac) or Ctrl (PC). You can also click and drag an image (or multiple images) into the Imgur window to upload it/them. If you have the image's URL address, you can copy it into the \"Paste Image or URL\" box. Click Open. Doing so will upload your photo to Imgur. If you dragged photos into the Imgur window, skip this step. Add a title to your photo. You'll do so in the field at the top of the photo. Edit your photos if need be. You can add a description or tags in the grey field below the photo, or you can tag a user by typing \"@\" followed by their username. You can also click Add another image below your image(s) to select more images. Click Share to community. This green button is on the right side of the page; clicking it will post your image(s) to the Imgur site.",
  "tyn_model":[
    "imgur",
    "⌘ command",
    "imgur window",
    "imgur site"
  ],
  "tyn_section":[

  ]
}