{
  "title":"How to Make Snickers Toast",
  "url":"https://www.wikihow.com/Make-Snickers-Toast",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Toast"
  ],
  "steps":[
    {
      "headline":"Place the slice of toast in the toaster or on the grill.",
      "description":"So that it will toast to an even brown, cook for about three and a half minutes in an average toaster."
    },
    {
      "headline":"Place the chocolate hazelnut spread, peanut butter and butter in a microwave safe bowl.",
      "description":"The ratio recommended is (You can modify the ratio to suit your taste):\n2 parts chocolate hazelnut spread\n2 parts peanut butter\n1 part butter"
    },
    {
      "headline":"Microwave the butter, chocolate and peanut butter for 45 seconds.",
      "description":"Or, until mostly melted and fluid. At this point, you should mix them thoroughly so that they are all combined into a thin brown paste with chunks of nut spread throughout. The mix will start to solidify as the bread toasts. If you want the mixture to be fluid when you put it on the toast, put it back in the microwave for thirty seconds when the toast is almost done."
    },
    {
      "headline":"When the toast is done, spread the mix evenly over the toast and enjoy what tastes like toast coated in a melted Snickers bar!",
      "description":""
    }
  ],
  "text":" Place the slice of toast in the toaster or on the grill. So that it will toast to an even brown, cook for about three and a half minutes in an average toaster. Place the chocolate hazelnut spread, peanut butter and butter in a microwave safe bowl. The ratio recommended is (You can modify the ratio to suit your taste):\n2 parts chocolate hazelnut spread\n2 parts peanut butter\n1 part butter Microwave the butter, chocolate and peanut butter for 45 seconds. Or, until mostly melted and fluid. At this point, you should mix them thoroughly so that they are all combined into a thin brown paste with chunks of nut spread throughout. The mix will start to solidify as the bread toasts. If you want the mixture to be fluid when you put it on the toast, put it back in the microwave for thirty seconds when the toast is almost done. When the toast is done, spread the mix evenly over the toast and enjoy what tastes like toast coated in a melted Snickers bar! ",
  "tyn_model":[
    "peanut butter",
    "butter",
    "toaster",
    "grill",
    "chocolate hazelnut",
    "microwave safe bowl",
    "chocolate hazelnut spread",
    "chocolate",
    "bread",
    "toast",
    "microwave",
    "snickers bar"
  ],
  "tyn_section":[

  ]
}