{
  "title":"How to Clean Your Bathtub with Grapefruit and Salt",
  "url":"https://www.wikihow.com/Clean-Your-Bathtub-with-Grapefruit-and-Salt",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "steps":[
    {
      "headline":"Slice a grapefruit in half.",
      "description":"You should only need half of the grapefruit to get the job done in the tub so either save the other half for lunch or use it on other areas of the home."
    },
    {
      "headline":"Locate a box of sea or Kosher salt.",
      "description":"You want the larger granule of salt for more exfoliation power. If you don’t have larger grained salt, you can still use regular table salt, but you will need wider coverage when cleaning."
    },
    {
      "headline":"Rub the grapefruit all over the tub, allowing the juice to run all over the tub.",
      "description":"Make sure the juice stays in the tub and doesn’t run onto the floor."
    },
    {
      "headline":"Sprinkle salt over the tub and the grapefruit juice.",
      "description":"The juice should allow the salt to cling to the tub. You only need about ½ cup of salt for the entire tub as you will be rubbing it over porcelain and fixtures."
    },
    {
      "headline":"Rub and scrub the grapefruit into the salt, lifting stains and grime.",
      "description":"If necessary, apply a scrub brush or washcloth to the area for extra cleaning power. Allow the grapefruit/salt combo to stand in areas that are especially tough or stained. Wipe salt and grapefruit away as you work."
    },
    {
      "headline":"Rinse with clear, warm water.",
      "description":"Turn on the tub faucet and run your hands around the tub to encourage the grapefruit and salt to go down the drain. Use a washcloth to rinse and encourage a squeaky-clean surface."
    }
  ],
  "text":" Slice a grapefruit in half. You should only need half of the grapefruit to get the job done in the tub so either save the other half for lunch or use it on other areas of the home. Locate a box of sea or Kosher salt. You want the larger granule of salt for more exfoliation power. If you don’t have larger grained salt, you can still use regular table salt, but you will need wider coverage when cleaning. Rub the grapefruit all over the tub, allowing the juice to run all over the tub. Make sure the juice stays in the tub and doesn’t run onto the floor. Sprinkle salt over the tub and the grapefruit juice. The juice should allow the salt to cling to the tub. You only need about ½ cup of salt for the entire tub as you will be rubbing it over porcelain and fixtures. Rub and scrub the grapefruit into the salt, lifting stains and grime. If necessary, apply a scrub brush or washcloth to the area for extra cleaning power. Allow the grapefruit/salt combo to stand in areas that are especially tough or stained. Wipe salt and grapefruit away as you work. Rinse with clear, warm water. Turn on the tub faucet and run your hands around the tub to encourage the grapefruit and salt to go down the drain. Use a washcloth to rinse and encourage a squeaky-clean surface.",
  "tyn_model":[
    "salt",
    "grapefruit",
    "sea or",
    "kosher salt",
    "table salt",
    "tub",
    "grapefruit juice",
    "porcelain",
    "scrub brush",
    "water",
    "washcloth"
  ],
  "tyn_section":[

  ]
}