{
  "title":"How to Create a Private Outdoor Space",
  "url":"https://www.wikihow.com/Create-a-Private-Outdoor-Space",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Outdoor Living Spaces"
  ],
  "steps":[
    {
      "headline":"Select your ideal space.",
      "description":"If you have a large yard don't try to turn the entire space into a private retreat. Instead focus on an area that is smaller and can be intimate. This way you won't be competing with the swing set. People living in the city may not have this problem as space is limited to begin with."
    },
    {
      "headline":"Build a privacy wall using stone pavers.",
      "description":"This is a much better solution than standard wooden fencing. Pavers create a greater sense of privacy since they are wider and more solid to begin with. They also have an old world charm that adds beauty to your environment."
    },
    {
      "headline":"Install flooring.",
      "description":"Make your private retreat more relaxing by installing a natural and durable flooring. You can use stamped concrete, paving stones, or bamboo for an environmentally friendly and stunning solution."
    },
    {
      "headline":"Build a water feature.",
      "description":"The sound of water gently cascading over natural stone is extremely soothing. It can also block out the street noise or the sounds of neighbor kids playing. You can purchase one at any local hardware store or have a custom water feature built out of pavers."
    },
    {
      "headline":"Fill the space with your favorite plantings.",
      "description":"You can grow bamboo against the privacy walls to create an Asian feel or you can simply add pots filled with gorgeous flowers. Plant things that are fragrant to fill the space with beautiful scents."
    },
    {
      "headline":"Install lighting.",
      "description":"Hire an electrician to install lighting so that you can use your outdoor retreat in the evening. Consider built in flooring lights like they use around a pool."
    },
    {
      "headline":"Build a fire pit or outdoor fireplace.",
      "description":"You can stay warm year round sitting by the fire. This is an excellent way to relax and casts a romantic glow on your evening festivities. You can have a custom one built of pavers or purchase an above ground fire pit at the hardware store."
    },
    {
      "headline":"Install speakers  and listen to your favorite music outdoors.",
      "description":""
    },
    {
      "headline":"Grab a book, a glass of wine, and start relaxing!",
      "description":""
    }
  ],
  "text":" Select your ideal space. If you have a large yard don't try to turn the entire space into a private retreat. Instead focus on an area that is smaller and can be intimate. This way you won't be competing with the swing set. People living in the city may not have this problem as space is limited to begin with. Build a privacy wall using stone pavers. This is a much better solution than standard wooden fencing. Pavers create a greater sense of privacy since they are wider and more solid to begin with. They also have an old world charm that adds beauty to your environment. Install flooring. Make your private retreat more relaxing by installing a natural and durable flooring. You can use stamped concrete, paving stones, or bamboo for an environmentally friendly and stunning solution. Build a water feature. The sound of water gently cascading over natural stone is extremely soothing. It can also block out the street noise or the sounds of neighbor kids playing. You can purchase one at any local hardware store or have a custom water feature built out of pavers. Fill the space with your favorite plantings. You can grow bamboo against the privacy walls to create an Asian feel or you can simply add pots filled with gorgeous flowers. Plant things that are fragrant to fill the space with beautiful scents. Install lighting. Hire an electrician to install lighting so that you can use your outdoor retreat in the evening. Consider built in flooring lights like they use around a pool. Build a fire pit or outdoor fireplace. You can stay warm year round sitting by the fire. This is an excellent way to relax and casts a romantic glow on your evening festivities. You can have a custom one built of pavers or purchase an above ground fire pit at the hardware store. Install speakers  and listen to your favorite music outdoors.  Grab a book, a glass of wine, and start relaxing! ",
  "tyn_model":[
    "water",
    "fire pit",
    "stone pavers",
    "pavers",
    "concrete",
    "paving stones",
    "natural stone",
    "bamboo",
    "pots",
    "electrician",
    "fireplace",
    "speakers",
    "wine"
  ],
  "tyn_section":[

  ]
}