{
  "title":"How to Prepare and Cook Cardoons",
  "url":"https://www.wikihow.com/Prepare-and-Cook-Cardoons",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Selecting cardoons",
      "steps":[
        {
          "headline":"Look for cardoons in a farmers market or a specialty grocery store.",
          "description":"They are likely to be more readily available where growers specialize in a wide variety of heirloom vegetables. They should be readily available in quality vegetable markets in Britain and southern European countries from late winter into early summer; they are prized in some Italian and French dishes. If available in the US, look for cardoons in May, June and July."
        },
        {
          "headline":"Choose cardoons that look fresh and plump.",
          "description":"Wild-grown cardoons will appear pale green, while commercially produced ones are often white due to the practice of growing them in soil mounds. Avoid any that appear too hairy. When readied for sale, the cardoons may be trimmed to the leafy inner part already."
        }
      ]
    },
    {
      "name":"Preparing cardoons",
      "steps":[
        {
          "headline":"Pull off the tough outer stalks.",
          "description":"As noted above, this may already have been done by the retailer."
        },
        {
          "headline":"Cut off the roots.",
          "description":"Discard."
        },
        {
          "headline":"Peel the stalks.",
          "description":"Cut or pull off the stringy fibers."
        },
        {
          "headline":"Use for cooking.",
          "description":"If not cooked straight away, place the stalks into water with lemon juice squeezed into it, to prevent discoloration."
        }
      ]
    },
    {
      "name":"Cooking the cardoons",
      "steps":[
        {
          "headline":"Cut the cardoons.",
          "description":"Cut the cardoon hearts into chunks or wedges. Cut the cardoon stalks into short lengths."
        },
        {
          "headline":"Boil the cardoons.",
          "description":"Add the chopped cardoons to boiling salted water. Blanch for 5 minutes, then simmer. If you want puréed cardoons, place the boiled pieces into a blender or processor and purée them."
        },
        {
          "headline":"Fry the cardoons.",
          "description":"Melt butter in a heavy based frying pan or skillet. Add the chopped cardoons and gently fry for a few minutes until the stalks and chunks turn tender. Cardoon pieces that have been blanched and battered can also be fried. This is a treat in New Orleans."
        },
        {
          "headline":"Use in a salad.",
          "description":"Simply cut into small salad size pieces and sprinkle into a vegetable salad."
        },
        {
          "headline":"Cover cardoons in a sauce.",
          "description":"Blanch the cardoons as above. Make a cheese or white sauce. Lay the cardoons in an ovenproof dish, and then cover with the sauce. Top with grated cheese of your choice. Bake in the oven until the top browns. A thickened tomato-based sauce will also match well with cardoons, to make a stew-like dish."
        },
        {
          "headline":"Add cardoons to a stew.",
          "description":"Use a favorite vegetable stew base and add cardoons to it."
        }
      ]
    }
  ],
  "text":" Selecting cardoons Look for cardoons in a farmers market or a specialty grocery store. They are likely to be more readily available where growers specialize in a wide variety of heirloom vegetables. They should be readily available in quality vegetable markets in Britain and southern European countries from late winter into early summer; they are prized in some Italian and French dishes. If available in the US, look for cardoons in May, June and July. Choose cardoons that look fresh and plump. Wild-grown cardoons will appear pale green, while commercially produced ones are often white due to the practice of growing them in soil mounds. Avoid any that appear too hairy. When readied for sale, the cardoons may be trimmed to the leafy inner part already. Preparing cardoons Pull off the tough outer stalks. As noted above, this may already have been done by the retailer. Cut off the roots. Discard. Peel the stalks. Cut or pull off the stringy fibers. Use for cooking. If not cooked straight away, place the stalks into water with lemon juice squeezed into it, to prevent discoloration. Cooking the cardoons Cut the cardoons. Cut the cardoon hearts into chunks or wedges. Cut the cardoon stalks into short lengths. Boil the cardoons. Add the chopped cardoons to boiling salted water. Blanch for 5 minutes, then simmer. If you want puréed cardoons, place the boiled pieces into a blender or processor and purée them. Fry the cardoons. Melt butter in a heavy based frying pan or skillet. Add the chopped cardoons and gently fry for a few minutes until the stalks and chunks turn tender. Cardoon pieces that have been blanched and battered can also be fried. This is a treat in New Orleans. Use in a salad. Simply cut into small salad size pieces and sprinkle into a vegetable salad. Cover cardoons in a sauce. Blanch the cardoons as above. Make a cheese or white sauce. Lay the cardoons in an ovenproof dish, and then cover with the sauce. Top with grated cheese of your choice. Bake in the oven until the top browns. A thickened tomato-based sauce will also match well with cardoons, to make a stew-like dish. Add cardoons to a stew. Use a favorite vegetable stew base and add cardoons to it.",
  "tyn_model":[
    "cardoons",
    "vegetables",
    "vegetable markets",
    "water",
    "lemon",
    "salted water",
    "blender",
    "processor",
    "butter",
    "heavy based frying pan or skillet",
    "vegetable salad",
    "ovenproof dish",
    "oven",
    "vegetable stew"
  ],
  "tyn_section":[

  ]
}