{
  "title":"How to Remove Grime from a Stove Naturally",
  "url":"https://www.wikihow.com/Remove-Grime-from-a-Stove-Naturally",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "parts":[
    {
      "name":"Evaluating the Spill or Build Up",
      "steps":[
        {
          "headline":"Determine if you can scrub most of the crud off the stove without using any cleaners.",
          "description":"Can you lift some debris off with simple soap, water and a washcloth or sponge? Regardless if you need to attack the spill more aggressively, you should first try to remove whatever you can with soap a water."
        },
        {
          "headline":"Consider whether the spill stained your stove.",
          "description":"Although this approach may remove the actual food spill, it may not lift the stain. Check the manufacturer’s directions for ways to remove stains."
        },
        {
          "headline":"Check to see if you are dealing with a straight food spill or if you need something to de-grease the surface.",
          "description":"For grease splatters you may need to arm yourself with additional tools (also natural)."
        }
      ]
    },
    {
      "name":"Cleaning Your Stove",
      "steps":[
        {
          "headline":"Scrub surface debris from the stove.",
          "description":"Loose or easy to remove debris should be lifted with ease using a washcloth or sponge and a little soap and water."
        },
        {
          "headline":"Heat a kettle of water.",
          "description":"If you don’t own a tea kettle you could fill a mug with water and microwave on high for approximately two minutes. Another alternative is to simply boil a small pot of water. Make sure the water comes to a rolling boil before using it."
        },
        {
          "headline":"Pour a small amount of boiling water over the food spill.",
          "description":"Only a very small amount, enough to saturate and cover the spill will do the job. Don't flood the area--its not the amount of water, it's the water temperature that will loosen the debris."
        },
        {
          "headline":"Allow the water to set for up to five minutes or until water has cooled.",
          "description":"Make sure the water is cool so you don’t burn your hands."
        },
        {
          "headline":"Wipe the area clean with a cloth or sponge.",
          "description":"Lift stuck on spill with your cloth or sponge and rinse as you go."
        },
        {
          "headline":"Add lemon juice or vinegar if you are having trouble removing grease or additional debris.",
          "description":"Use steel wool or soft scrub pad to help you remove stubborn stains."
        }
      ]
    }
  ],
  "text":" Evaluating the Spill or Build Up Determine if you can scrub most of the crud off the stove without using any cleaners. Can you lift some debris off with simple soap, water and a washcloth or sponge? Regardless if you need to attack the spill more aggressively, you should first try to remove whatever you can with soap a water. Consider whether the spill stained your stove. Although this approach may remove the actual food spill, it may not lift the stain. Check the manufacturer’s directions for ways to remove stains. Check to see if you are dealing with a straight food spill or if you need something to de-grease the surface. For grease splatters you may need to arm yourself with additional tools (also natural). Cleaning Your Stove Scrub surface debris from the stove. Loose or easy to remove debris should be lifted with ease using a washcloth or sponge and a little soap and water. Heat a kettle of water. If you don’t own a tea kettle you could fill a mug with water and microwave on high for approximately two minutes. Another alternative is to simply boil a small pot of water. Make sure the water comes to a rolling boil before using it. Pour a small amount of boiling water over the food spill. Only a very small amount, enough to saturate and cover the spill will do the job. Don't flood the area--its not the amount of water, it's the water temperature that will loosen the debris. Allow the water to set for up to five minutes or until water has cooled. Make sure the water is cool so you don’t burn your hands. Wipe the area clean with a cloth or sponge. Lift stuck on spill with your cloth or sponge and rinse as you go. Add lemon juice or vinegar if you are having trouble removing grease or additional debris. Use steel wool or soft scrub pad to help you remove stubborn stains.",
  "tyn_model":[
    "water",
    "sponge",
    "soap",
    "stove",
    "cloth",
    "tea kettle",
    "mug",
    "microwave",
    "lemon juice"
  ],
  "tyn_section":[

  ]
}