{
  "title":"How to Make a Gin and Tonic Alexander",
  "url":"https://www.wikihow.com/Make-a-Gin-and-Tonic-Alexander",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Cocktails"
  ],
  "steps":[
    {
      "headline":"Prepare your cocktail area with all the listed ingredients and required items.",
      "description":""
    },
    {
      "headline":"Fill your tumbler glass to the brim with ice cubes.",
      "description":""
    },
    {
      "headline":"Pour in your gin (30ml recommended).",
      "description":""
    },
    {
      "headline":"Cut and then squeeze in a lime wedge (1/8th of a full lime).",
      "description":""
    },
    {
      "headline":"Cut a lemon wedge (1/8th of a full lemon) and then with your knife, cut away the flesh of the lemon from the skin.",
      "description":"The acid from the flesh removes the carbonation from the tonic which is undesired."
    },
    {
      "headline":"Lightly burn the lemon skin and then twist it close to the top of the glass, then place it in.",
      "description":""
    },
    {
      "headline":"Add tonic to the glass and fill just short of the top.",
      "description":""
    },
    {
      "headline":"Add a small amount of lemon bitters (3-5 drops).",
      "description":""
    },
    {
      "headline":"Stir the drink with the teaspoon.",
      "description":""
    },
    {
      "headline":"Enjoy!",
      "description":""
    }
  ],
  "text":" Prepare your cocktail area with all the listed ingredients and required items.  Fill your tumbler glass to the brim with ice cubes.  Pour in your gin (30ml recommended).  Cut and then squeeze in a lime wedge (1/8th of a full lime).  Cut a lemon wedge (1/8th of a full lemon) and then with your knife, cut away the flesh of the lemon from the skin. The acid from the flesh removes the carbonation from the tonic which is undesired. Lightly burn the lemon skin and then twist it close to the top of the glass, then place it in.  Add tonic to the glass and fill just short of the top.  Add a small amount of lemon bitters (3-5 drops).  Stir the drink with the teaspoon.  Enjoy! ",
  "tyn_model":[
    "lemon",
    "tonic",
    "glass",
    "tumbler glass",
    "ice cubes",
    "gin",
    "lime wedge",
    "knife",
    "lemon bitters",
    "teaspoon"
  ],
  "tyn_section":[

  ]
}