{
  "title":"How to Make Non‐Toxic Rust Remover Using Household Items",
  "url":"https://www.wikihow.com/Make-Non%E2%80%90Toxic-Rust-Remover-Using-Household-Items",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "parts":[
    {
      "name":"Determining the Extent of Rust",
      "steps":[
        {
          "headline":"Determine if the rusted item (small tool, bolt, dish rack, etc.)",
          "description":"is salvageable. Check to see how bad the rust is and whether or not it has eroded the material or it is more of a surface/cosmetic issue. Determine whether the item is worth saving by assessing the depth of the rust––if it's only surface and no working parts or pieces are rusted through, then these simple solutions may be helpful. On the other hand, if it is deep rust or it has eaten right through parts, then you'll need to replace pieces, consider using synthetic chemical rust removers or speak to a professional restorer relevant to the item."
        },
        {
          "headline":"Consider whether some of the rust can be scraped off or removed by scrubbing.",
          "description":"Use the right tools. You need the right tools to remove the rust. Items that may be useful for scrubbing the rust include steel wool pads, abrasive brushes, sandpaper, wire brushes or crumpled tin foil. These can be used on their own initially, then in combination with one of the methods suggested below. A dull putty knife may be used for thicker rust, helping with chipping it away. If it's fabric you're dealing with, don't scrape! Instead, follow the advice offered below relating to fabric. Whether or not you can scrape the item will depend on its fragility. If the item looks to be rusted through, it's in need of repair, and none of the remedies offered here will be of help and could make things worse."
        }
      ]
    },
    {
      "name":"Removing Rust from Household Metalware and Metallic Objects",
      "steps":[
        {
          "headline":"Note that the household item techniques offered here are useful for small household objects such as pruning tools, cutlery (not silverware), nuts and bolts, costume jewelry, parts of metallic furniture, etc.",
          "description":"For vehicles and other large items, the methods are not necessarily appropriate and separate advice should be sought. See How to clean silver for appropriate cleaning methods for silverware. See How to remove rust from a car for vehicle rust removal suggestions. Jewelry other than costume jewelry should be cleaned according to the specific metal, due to its delicacy and special features. See further How to clean silver jewelry, How to clean brass jewelry , How to clean copper jewelry and How to clean jewelry."
        },
        {
          "headline":"Use lime or lemon with salt to make a paste.",
          "description":"Use the amount of salt that will cover the rusted area, such as rust on a bathtub."
        },
        {
          "headline":"Cover the rusted area with the salt and lemon or lime paste.",
          "description":""
        },
        {
          "headline":"Allow to set for up to three hours.",
          "description":"After this time, you can scrape rust away with the lime rind. Do not leave it any longer than a few hours or the salt will increase the rust."
        },
        {
          "headline":"Wash with warm soapy water.",
          "description":"Allow to dry completely before storing away."
        },
        {
          "headline":"Use this potato trick on rusted tinware.",
          "description":"This includes trays, baking sheets, and pots and pans."
        },
        {
          "headline":"Peel a decent sized potato.",
          "description":"Once peeled, cut it into halves, to make it easier to hold."
        },
        {
          "headline":"Dip a half into either baking soda or salt.",
          "description":""
        },
        {
          "headline":"Rub the soda- or salt-coated edge of the potato over the stain on the tinware.",
          "description":"Rub until the rust has lifted off. Dip again on another part of the potato or use the other potato half if you need to keep rubbing for a while or you're rubbing a large area."
        },
        {
          "headline":"Rinse off and allow to dry quickly in a well-ventilated area.",
          "description":"Place on an uncrowded dish rack or sit the drying tinware near a warm oven to speed up the trying. Alternatively, wipe clean using a damp cloth."
        },
        {
          "headline":"Place the rusty nuts and bolts in vinegar.",
          "description":"You can also use this method for small metallic tools, such as rusty pliers. Use enough vinegar to cover. Soda or soft drink can also be used in place of vinegar. It usually works faster, thus you'll need to keep an eye on it and remove the nuts and bolts as soon as they appear rust-free."
        },
        {
          "headline":"Remove after 3 to 12 hours.",
          "description":"The rust should have come off the nuts and bolts."
        },
        {
          "headline":"Rinse the nuts and bolts or tools.",
          "description":"Wipe clean. Allow to dry in a well-ventilated place, such as on plastic mesh or a dish rack."
        },
        {
          "headline":"Make a paste from some baking soda to which you've added a small amount of water.",
          "description":"It's meant to be a thick paste, so add more baking soda if it's too runny."
        },
        {
          "headline":"Spread a thick layer of baking soda over the rusted area of the item.",
          "description":"Let it sit with the paste in place for several hours."
        },
        {
          "headline":"Scrub the paste off.",
          "description":"With scrubbing, the rust should lift off. However, be aware that you may need to repeat this process several times to be effective."
        }
      ]
    },
    {
      "name":"Removing Rust Stains from Porcelain Bathtubs or Basins",
      "steps":[
        {
          "headline":"Use this paste to remove small rust stains from porcelain baths and basins.",
          "description":"You can also try rubbing the stain with a pumice stone soaked in warm water first; this may be sufficient to remove the rust stain. If not, use the cream of tartar paste. Cream of tartar can be found at supermarkets, while hydrogen peroxide is often sold in pharmacies or drugstores."
        },
        {
          "headline":"Make a paste using cream of tartar and hydrogen peroxide.",
          "description":"Decide how much paste you need, and use that amount of cream of tartar. Then add just enough hydrogen peroxide to form a paste. If it gets too runny, add more cream of tartar."
        },
        {
          "headline":"Use a toothbrush to scrub the paste into the rust area.",
          "description":"Leave it to dry."
        },
        {
          "headline":"Rinse off when dried.",
          "description":"Check the rust area. If it has improved, you're all done. If not, repeat until the rust stain improves."
        }
      ]
    },
    {
      "name":"Preventing Rust",
      "steps":[
        {
          "headline":"Keep metallic items away from water.",
          "description":"For example, do not leave garden tools sitting in the rain."
        },
        {
          "headline":"Keep some pieces of charcoal or chalk in your toolbox.",
          "description":"These can absorb the moisture and may help to discourage rust growth."
        },
        {
          "headline":"Clean saw blades, garden snips/cutters, etc., after use to remove soil, dust, wooden shavings, etc.",
          "description":"Then wipe with a little oil or WD-40 to help discourage rust."
        },
        {
          "headline":"Bring garden furniture indoors during the colder, wet months.",
          "description":"Cover it when it is not in use. This may help to discourage the growth of rust."
        },
        {
          "headline":"Do not wash cast iron or tinware in the dishwasher.",
          "description":"This causes it to rust. Proper care and handling of cast iron pans and pots can be found here."
        },
        {
          "headline":"Do not store metallic items that are wet or damp.",
          "description":"Always ensure such items are fully dried before placing into a cupboard, the garage or anywhere else for storage. Ensure that the storage is not moist; if needed, use moisture soaking devices to reduce the humidity in the storage area."
        }
      ]
    }
  ],
  "text":" Determining the Extent of Rust Determine if the rusted item (small tool, bolt, dish rack, etc.) is salvageable. Check to see how bad the rust is and whether or not it has eroded the material or it is more of a surface/cosmetic issue. Determine whether the item is worth saving by assessing the depth of the rust––if it's only surface and no working parts or pieces are rusted through, then these simple solutions may be helpful. On the other hand, if it is deep rust or it has eaten right through parts, then you'll need to replace pieces, consider using synthetic chemical rust removers or speak to a professional restorer relevant to the item. Consider whether some of the rust can be scraped off or removed by scrubbing. Use the right tools. You need the right tools to remove the rust. Items that may be useful for scrubbing the rust include steel wool pads, abrasive brushes, sandpaper, wire brushes or crumpled tin foil. These can be used on their own initially, then in combination with one of the methods suggested below. A dull putty knife may be used for thicker rust, helping with chipping it away. If it's fabric you're dealing with, don't scrape! Instead, follow the advice offered below relating to fabric. Whether or not you can scrape the item will depend on its fragility. If the item looks to be rusted through, it's in need of repair, and none of the remedies offered here will be of help and could make things worse. Removing Rust from Household Metalware and Metallic Objects Note that the household item techniques offered here are useful for small household objects such as pruning tools, cutlery (not silverware), nuts and bolts, costume jewelry, parts of metallic furniture, etc. For vehicles and other large items, the methods are not necessarily appropriate and separate advice should be sought. See How to clean silver for appropriate cleaning methods for silverware. See How to remove rust from a car for vehicle rust removal suggestions. Jewelry other than costume jewelry should be cleaned according to the specific metal, due to its delicacy and special features. See further How to clean silver jewelry, How to clean brass jewelry , How to clean copper jewelry and How to clean jewelry. Use lime or lemon with salt to make a paste. Use the amount of salt that will cover the rusted area, such as rust on a bathtub. Cover the rusted area with the salt and lemon or lime paste.  Allow to set for up to three hours. After this time, you can scrape rust away with the lime rind. Do not leave it any longer than a few hours or the salt will increase the rust. Wash with warm soapy water. Allow to dry completely before storing away. Use this potato trick on rusted tinware. This includes trays, baking sheets, and pots and pans. Peel a decent sized potato. Once peeled, cut it into halves, to make it easier to hold. Dip a half into either baking soda or salt.  Rub the soda- or salt-coated edge of the potato over the stain on the tinware. Rub until the rust has lifted off. Dip again on another part of the potato or use the other potato half if you need to keep rubbing for a while or you're rubbing a large area. Rinse off and allow to dry quickly in a well-ventilated area. Place on an uncrowded dish rack or sit the drying tinware near a warm oven to speed up the trying. Alternatively, wipe clean using a damp cloth. Place the rusty nuts and bolts in vinegar. You can also use this method for small metallic tools, such as rusty pliers. Use enough vinegar to cover. Soda or soft drink can also be used in place of vinegar. It usually works faster, thus you'll need to keep an eye on it and remove the nuts and bolts as soon as they appear rust-free. Remove after 3 to 12 hours. The rust should have come off the nuts and bolts. Rinse the nuts and bolts or tools. Wipe clean. Allow to dry in a well-ventilated place, such as on plastic mesh or a dish rack. Make a paste from some baking soda to which you've added a small amount of water. It's meant to be a thick paste, so add more baking soda if it's too runny. Spread a thick layer of baking soda over the rusted area of the item. Let it sit with the paste in place for several hours. Scrub the paste off. With scrubbing, the rust should lift off. However, be aware that you may need to repeat this process several times to be effective. Removing Rust Stains from Porcelain Bathtubs or Basins Use this paste to remove small rust stains from porcelain baths and basins. You can also try rubbing the stain with a pumice stone soaked in warm water first; this may be sufficient to remove the rust stain. If not, use the cream of tartar paste. Cream of tartar can be found at supermarkets, while hydrogen peroxide is often sold in pharmacies or drugstores. Make a paste using cream of tartar and hydrogen peroxide. Decide how much paste you need, and use that amount of cream of tartar. Then add just enough hydrogen peroxide to form a paste. If it gets too runny, add more cream of tartar. Use a toothbrush to scrub the paste into the rust area. Leave it to dry. Rinse off when dried. Check the rust area. If it has improved, you're all done. If not, repeat until the rust stain improves. Preventing Rust Keep metallic items away from water. For example, do not leave garden tools sitting in the rain. Keep some pieces of charcoal or chalk in your toolbox. These can absorb the moisture and may help to discourage rust growth. Clean saw blades, garden snips/cutters, etc., after use to remove soil, dust, wooden shavings, etc. Then wipe with a little oil or WD-40 to help discourage rust. Bring garden furniture indoors during the colder, wet months. Cover it when it is not in use. This may help to discourage the growth of rust. Do not wash cast iron or tinware in the dishwasher. This causes it to rust. Proper care and handling of cast iron pans and pots can be found here. Do not store metallic items that are wet or damp. Always ensure such items are fully dried before placing into a cupboard, the garage or anywhere else for storage. Ensure that the storage is not moist; if needed, use moisture soaking devices to reduce the humidity in the storage area.",
  "tyn_model":[
    "salt",
    "baking soda",
    "cream of tartar",
    "lime",
    "potato",
    "vinegar",
    "hydrogen peroxide",
    "jewelry",
    "lemon",
    "water",
    "rust",
    "abrasive brushes",
    "sandpaper",
    "wire brushes",
    "putty knife",
    "fabric",
    "cutlery",
    "silver",
    "silverware",
    "baking sheets",
    "oven",
    "soda",
    "porcelain bathtubs",
    "porcelain baths",
    "pumice stone",
    "toothbrush",
    "charcoal",
    "chalk",
    "garden snips",
    "cast iron or tinware",
    "cast iron pans",
    "pots",
    "moisture soaking devices"
  ],
  "tyn_section":[

  ]
}