{
  "title":"How to Draw a Simple House",
  "url":"https://www.wikihow.com/Draw-a-Simple-House",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Geography and Nature",
    "Built Environment Drawings",
    "Drawing Houses"
  ],
  "methods":[
    {
      "name":"Starting with a Horizontal Line",
      "steps":[
        {
          "headline":"Draw a horizontal line and mark each side with a dot.",
          "description":"This will serve as the vanishing point."
        },
        {
          "headline":"Draw a vertical line across the horizontal line you had drawn earlier.",
          "description":"Connect each end of the vertical line to the vanishing point. This will end up looking like a diamond."
        },
        {
          "headline":"Add another vertical line on each side of the first vertical line you have drawn.",
          "description":""
        },
        {
          "headline":"Using the lines as outline, draw a box.",
          "description":""
        },
        {
          "headline":"On the front of the box, draw a vertical line on the center all the way up.",
          "description":"Add two slanted lines on each side."
        },
        {
          "headline":"Make adjustments to the slanted line a little bit farther to the left to make the roof look protruding away from the house’s body.",
          "description":"Darken the top lines on the top which will serve as the roof of your house."
        },
        {
          "headline":"Darken the whole outline of the house to make the structure clearer.",
          "description":""
        },
        {
          "headline":"Draw a rectangle for the door and two squares for the windows, taking into account the vanishing point.",
          "description":""
        },
        {
          "headline":"Refine details to your house.",
          "description":"You can improvise as you wish depending on how you like your house to look."
        },
        {
          "headline":"Color your drawing.",
          "description":""
        }
      ]
    },
    {
      "name":"Starting with a Cube",
      "steps":[
        {
          "headline":"Draw a cube.",
          "description":"Its lines will serve as the walls of the house. These should be approximately even, but don't worry if they're not quite perfect."
        },
        {
          "headline":"Draw two overlapping triangles on either side of the cube.",
          "description":"Don’t make them taller than the walls, though, or your finished product will look somewhat unrealistic."
        },
        {
          "headline":"Connect the sides of each triangle in order to form your roof.",
          "description":"If you don’t see a house starting to emerge in your drawing, refer to the image here and make it look more like that."
        },
        {
          "headline":"Add a large rectangle for the door, and a couple of squares or rectangles for windows.",
          "description":"Remember, we’re drawing in perspective--so for the door and window(s), add in smaller squares and rectangles inside the initial shapes for better detail."
        },
        {
          "headline":"Outline the image and erase overlapping lines.",
          "description":"There shouldn’t be too many, but whatever remains should be easy to get rid of."
        },
        {
          "headline":"Color it in and you’re done!",
          "description":"Your house can follow whatever color scheme you'd like; if you're in need of inspiration, step outside for a few minutes and look at houses in your neighborhood."
        }
      ]
    },
    {
      "name":"Starting with a Square",
      "steps":[
        {
          "headline":"Draw a square.",
          "description":"Try to keep the lines as straight as possible. You can use a ruler if you want."
        },
        {
          "headline":"Draw another square.",
          "description":"It should be congruent and behind the first square you drew. You should now have two squares overlapping one another. The further they are apart, the longer your house will be. (For a relatively square house, the distance between the squares should be about a quarter of either square’s length.)"
        },
        {
          "headline":"Connect the corners.",
          "description":"Draw lines connecting the corners of each square. Make sure you connect each to the nearest corner, and that you then connect that to the other square. This will make your squares into a three-dimensional cube."
        },
        {
          "headline":"Draw a dot above the cube, in the “front” of the house.",
          "description":"This will determine the point of the roof. It should be high in comparison to the house’s base, but not more than half its height."
        },
        {
          "headline":"Connect the upper corners to the dot.",
          "description":"They should all be attached to the dot by a smooth, straight line. This will be the roof."
        },
        {
          "headline":"Erase the dot and every inner line.",
          "description":"All of your inner lines should be gone except for the line that differentiates the roof from the base of the house. (You can still erase it if you want, but it will be harder to tell where the house stops and the roof begins.)"
        },
        {
          "headline":"Draw a door/windows.",
          "description":"The windows should be small and square, and not too close to the walls’ edges. The door is a rectangle with a circle for a doorknob. If you want you can draw a window on the side of the house, but it needs to be a parallelogram, not a square."
        },
        {
          "headline":"Color it in.",
          "description":"Create details and make sure you shade correctly. It works best if you choose a bright color for the base of the house, and an equally bright color for the roof. Then take darker versions of these colors, and color in the other side with them; this will shade your drawing effectively."
        }
      ]
    }
  ],
  "text":" Starting with a Horizontal Line Draw a horizontal line and mark each side with a dot. This will serve as the vanishing point. Draw a vertical line across the horizontal line you had drawn earlier. Connect each end of the vertical line to the vanishing point. This will end up looking like a diamond. Add another vertical line on each side of the first vertical line you have drawn.  Using the lines as outline, draw a box.  On the front of the box, draw a vertical line on the center all the way up. Add two slanted lines on each side. Make adjustments to the slanted line a little bit farther to the left to make the roof look protruding away from the house’s body. Darken the top lines on the top which will serve as the roof of your house. Darken the whole outline of the house to make the structure clearer.  Draw a rectangle for the door and two squares for the windows, taking into account the vanishing point.  Refine details to your house. You can improvise as you wish depending on how you like your house to look. Color your drawing.  Starting with a Cube Draw a cube. Its lines will serve as the walls of the house. These should be approximately even, but don't worry if they're not quite perfect. Draw two overlapping triangles on either side of the cube. Don’t make them taller than the walls, though, or your finished product will look somewhat unrealistic. Connect the sides of each triangle in order to form your roof. If you don’t see a house starting to emerge in your drawing, refer to the image here and make it look more like that. Add a large rectangle for the door, and a couple of squares or rectangles for windows. Remember, we’re drawing in perspective--so for the door and window(s), add in smaller squares and rectangles inside the initial shapes for better detail. Outline the image and erase overlapping lines. There shouldn’t be too many, but whatever remains should be easy to get rid of. Color it in and you’re done! Your house can follow whatever color scheme you'd like; if you're in need of inspiration, step outside for a few minutes and look at houses in your neighborhood. Starting with a Square Draw a square. Try to keep the lines as straight as possible. You can use a ruler if you want. Draw another square. It should be congruent and behind the first square you drew. You should now have two squares overlapping one another. The further they are apart, the longer your house will be. (For a relatively square house, the distance between the squares should be about a quarter of either square’s length.) Connect the corners. Draw lines connecting the corners of each square. Make sure you connect each to the nearest corner, and that you then connect that to the other square. This will make your squares into a three-dimensional cube. Draw a dot above the cube, in the “front” of the house. This will determine the point of the roof. It should be high in comparison to the house’s base, but not more than half its height. Connect the upper corners to the dot. They should all be attached to the dot by a smooth, straight line. This will be the roof. Erase the dot and every inner line. All of your inner lines should be gone except for the line that differentiates the roof from the base of the house. (You can still erase it if you want, but it will be harder to tell where the house stops and the roof begins.) Draw a door/windows. The windows should be small and square, and not too close to the walls’ edges. The door is a rectangle with a circle for a doorknob. If you want you can draw a window on the side of the house, but it needs to be a parallelogram, not a square. Color it in. Create details and make sure you shade correctly. It works best if you choose a bright color for the base of the house, and an equally bright color for the roof. Then take darker versions of these colors, and color in the other side with them; this will shade your drawing effectively.",
  "tyn_model":[
    "cube",
    "windows",
    "box",
    "ruler",
    "three-dimensional cube",
    "“front",
    "” of",
    "’ edges",
    "window"
  ],
  "tyn_section":[

  ]
}