{
  "title":"How to Make Easy Cream Cheese Chocolate Chip Cookies with Crescent Rolls",
  "url":"https://www.wikihow.com/Make-Easy-Cream-Cheese-Chocolate-Chip-Cookies-with-Crescent-Rolls",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Chocolate Cookies and Biscuits"
  ],
  "methods":[
    {
      "name":"Pick up Ingredients",
      "steps":[
        {
          "headline":"Purchase one can of your favorite pre-made crescent rolls.",
          "description":"Because there are many types of crescent rolls, consider going for the original flavor. You may be tempted to go for low fat but the low fat kind won’t produce the best tasting cookies. Besides, you are having cookies--live decadently!"
        },
        {
          "headline":"Ensure you have available one 8 ounce block of cream cheese (regular), sugar, vanilla and a bag of chocolate chips.",
          "description":""
        },
        {
          "headline":"Consider using the mini chocolate chips versus the larger/regular sized chips.",
          "description":"Because you will be rolling and baking you’ll want chips that will easily fit inside the crescent rolls."
        }
      ]
    },
    {
      "name":"Make the Cookies",
      "steps":[
        {
          "headline":"Combine ¼ cup of sugar with 2 tsp.",
          "description":"of vanilla and 8 ounces of cream cheese in a bowl. Make sure you allow the cream cheese to come to room temperature so it integrates into the sugar and vanilla. Use an electric mixer for best results if possible."
        },
        {
          "headline":"Pop open the crescent roll can and unroll the dough on a flat surface.",
          "description":"The dough should remain in its rectangle shape."
        },
        {
          "headline":"Spread cream cheese mixture over the top of the crescent roll.",
          "description":"Use a spatula to easily move the mixture over the entire dough rectangle. Make sure you leave a gap of approximately ½ inch around all sides."
        },
        {
          "headline":"Sprinkle ½ cup of mini chocolate chips evenly over the dough.",
          "description":"If you love your chocolate chips, add a little extra. For a little extra excitement combine chocolate chips with peanut butter or even chocolate mint chips."
        },
        {
          "headline":"Roll dough tightly and wrap in plastic wrap.",
          "description":"Although you want a neat roll, don’t roll so tightly so that your cream cheese mixture pours out of the dough sides."
        },
        {
          "headline":"Refrigerate dough for two hours to overnight.",
          "description":"You want the cream cheese and dough to intermingle and become one."
        },
        {
          "headline":"Cut dough into ¼” slices and place on a parchment lined cookie sheet.",
          "description":"Make sure the slices are uniform so the cookies bake uniformly."
        },
        {
          "headline":"Bake at 350 degrees for 12 to 14 minutes.",
          "description":"Check cookies for a golden brown color."
        },
        {
          "headline":"Transfer baked cookies to a wire rack and serve when cooled.",
          "description":""
        }
      ]
    }
  ],
  "text":" Pick up Ingredients Purchase one can of your favorite pre-made crescent rolls. Because there are many types of crescent rolls, consider going for the original flavor. You may be tempted to go for low fat but the low fat kind won’t produce the best tasting cookies. Besides, you are having cookies--live decadently! Ensure you have available one 8 ounce block of cream cheese (regular), sugar, vanilla and a bag of chocolate chips.  Consider using the mini chocolate chips versus the larger/regular sized chips. Because you will be rolling and baking you’ll want chips that will easily fit inside the crescent rolls. Make the Cookies Combine ¼ cup of sugar with 2 tsp. of vanilla and 8 ounces of cream cheese in a bowl. Make sure you allow the cream cheese to come to room temperature so it integrates into the sugar and vanilla. Use an electric mixer for best results if possible. Pop open the crescent roll can and unroll the dough on a flat surface. The dough should remain in its rectangle shape. Spread cream cheese mixture over the top of the crescent roll. Use a spatula to easily move the mixture over the entire dough rectangle. Make sure you leave a gap of approximately ½ inch around all sides. Sprinkle ½ cup of mini chocolate chips evenly over the dough. If you love your chocolate chips, add a little extra. For a little extra excitement combine chocolate chips with peanut butter or even chocolate mint chips. Roll dough tightly and wrap in plastic wrap. Although you want a neat roll, don’t roll so tightly so that your cream cheese mixture pours out of the dough sides. Refrigerate dough for two hours to overnight. You want the cream cheese and dough to intermingle and become one. Cut dough into ¼” slices and place on a parchment lined cookie sheet. Make sure the slices are uniform so the cookies bake uniformly. Bake at 350 degrees for 12 to 14 minutes. Check cookies for a golden brown color. Transfer baked cookies to a wire rack and serve when cooled. ",
  "tyn_model":[
    "cream cheese",
    "chocolate chips",
    "sugar",
    "vanilla",
    "cookies",
    "bowl",
    "electric mixer",
    "crescent roll can",
    "spatula",
    "peanut butter",
    "chocolate mint chips",
    "plastic wrap",
    "” slices",
    "parchment lined cookie sheet",
    "wire rack"
  ],
  "tyn_section":[

  ]
}