{
  "title":"How to Make Watermelon Sweet Sour Sauce With Lobster Rolls",
  "url":"https://www.wikihow.com/Make-Watermelon-Sweet-Sour-Sauce-With-Lobster-Rolls",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Watermelons"
  ],
  "steps":[
    {
      "headline":"Toss together the lobster meat, cabbage, scallions and Hoisin sauce.",
      "description":""
    },
    {
      "headline":"Divide into long mounds across the diagonal of the wrappers",
      "description":""
    },
    {
      "headline":"Leave enough space at each end of wrap to fold over the filling to enclose tightly when rolled up.",
      "description":""
    },
    {
      "headline":"Wet the edges of the wrapper and fold the short ends over the filling.",
      "description":""
    },
    {
      "headline":"Roll the wrapper from the bottom to enclose the filling completely and tightly.",
      "description":"The water will act like glue to seal the edges."
    },
    {
      "headline":"Deep fry the Spring Rolls in 360-degree oil such as rice bran oil, peanut oil or canola oil.",
      "description":""
    },
    {
      "headline":"Remove them from the oil, drain quickly on paper towel and then dust with the sesame seeds.",
      "description":""
    },
    {
      "headline":"Serve with Watermelon Sesame Sweet Sour Sauce.",
      "description":""
    }
  ],
  "text":" Toss together the lobster meat, cabbage, scallions and Hoisin sauce.  Divide into long mounds across the diagonal of the wrappers  Leave enough space at each end of wrap to fold over the filling to enclose tightly when rolled up.  Wet the edges of the wrapper and fold the short ends over the filling.  Roll the wrapper from the bottom to enclose the filling completely and tightly. The water will act like glue to seal the edges. Deep fry the Spring Rolls in 360-degree oil such as rice bran oil, peanut oil or canola oil.  Remove them from the oil, drain quickly on paper towel and then dust with the sesame seeds.  Serve with Watermelon Sesame Sweet Sour Sauce. ",
  "tyn_model":[
    "lobster meat",
    "cabbage",
    "scallions",
    "hoisin sauce",
    "water",
    "360-degree oil",
    "rice bran oil",
    "peanut oil",
    "canola oil",
    "oil",
    "paper towel",
    "sesame seeds",
    "watermelon sesame sweet sour sauce"
  ],
  "tyn_section":[

  ]
}