{
  "title":"How to Bake Armenian Apple and Grape Bread Squares",
  "url":"https://www.wikihow.com/Bake-Armenian-Apple-and-Grape-Bread-Squares",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Fruit Desserts"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 365 degrees.",
      "description":"Retrieve the 10 in. by 7 1/2 in. baking pan, brush, and vegetable oil. Grease the pan by dipping the brush into the vegetable oil, and spreading the oil accordingly to coat it lightly. Set aside."
    },
    {
      "headline":"Prepare the fruit by slicing the washed pink lady apple into medium sized cubes.",
      "description":"Vary the shapes and sizes to taste. Pick each individual grape off the stem and place them next to the apple slices."
    },
    {
      "headline":"Assemble the mixer by plugging the appliance into an electrical outlet and inputting the beaters into the appliance.",
      "description":"Press them in gently."
    },
    {
      "headline":"Measure out 1 cup of sour cream.",
      "description":"Mix in 1/2 teaspoon baking powder into the sour cream and allow it to settle. Note that the sour cream should \"grow\" as this step is being done. Set aside."
    },
    {
      "headline":"Measure out 1 1/2 cups flour and place this into the smaller bowl.",
      "description":"Mix 1/2 teaspoon of baking powder into the flour. It is best to use a measuring spoon for accuracy."
    },
    {
      "headline":"Break 2 eggs in a large mixing bowl by gently tapping it on the side of the bowl.",
      "description":"Place your fingers in the small broken part of the egg down the center, and open the egg. Allow the contents to flow into the bowl, releasing both the egg whites, and the yolk. Beat the 2 eggs with the 3/4 cup sugar by turning the mixer onto medium speed, and rotating it in the bowl a on-going, clockwise motion. Continue this until the egg and sugar mixture has softened in its color, from a darker yellow, to a light pastel shade."
    },
    {
      "headline":"Pour in the sour cream and baking soda mixture.",
      "description":"Beat this just lightly, until appropriately combined."
    },
    {
      "headline":"Apply 1/2 teaspoon of natural vanilla extract, and beat the mixture slightly.",
      "description":""
    },
    {
      "headline":"Fold in the flour and baking powder mixture into the batter.",
      "description":"Mix well, so as to avoid lumps in the batter."
    },
    {
      "headline":"Gently fold in the cubed apple and the fresh grapes.",
      "description":""
    },
    {
      "headline":"Tilt the large mixing bowl toward the baking pan, pouring the batter into the pan with a wooden spoon.",
      "description":""
    },
    {
      "headline":"Cautiously place the pan into the oven at the implied temperature.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 365 degrees. Retrieve the 10 in. by 7 1/2 in. baking pan, brush, and vegetable oil. Grease the pan by dipping the brush into the vegetable oil, and spreading the oil accordingly to coat it lightly. Set aside. Prepare the fruit by slicing the washed pink lady apple into medium sized cubes. Vary the shapes and sizes to taste. Pick each individual grape off the stem and place them next to the apple slices. Assemble the mixer by plugging the appliance into an electrical outlet and inputting the beaters into the appliance. Press them in gently. Measure out 1 cup of sour cream. Mix in 1/2 teaspoon baking powder into the sour cream and allow it to settle. Note that the sour cream should \"grow\" as this step is being done. Set aside. Measure out 1 1/2 cups flour and place this into the smaller bowl. Mix 1/2 teaspoon of baking powder into the flour. It is best to use a measuring spoon for accuracy. Break 2 eggs in a large mixing bowl by gently tapping it on the side of the bowl. Place your fingers in the small broken part of the egg down the center, and open the egg. Allow the contents to flow into the bowl, releasing both the egg whites, and the yolk. Beat the 2 eggs with the 3/4 cup sugar by turning the mixer onto medium speed, and rotating it in the bowl a on-going, clockwise motion. Continue this until the egg and sugar mixture has softened in its color, from a darker yellow, to a light pastel shade. Pour in the sour cream and baking soda mixture. Beat this just lightly, until appropriately combined. Apply 1/2 teaspoon of natural vanilla extract, and beat the mixture slightly.  Fold in the flour and baking powder mixture into the batter. Mix well, so as to avoid lumps in the batter. Gently fold in the cubed apple and the fresh grapes.  Tilt the large mixing bowl toward the baking pan, pouring the batter into the pan with a wooden spoon.  Cautiously place the pan into the oven at the implied temperature.  Finished. ",
  "tyn_model":[
    "sour cream",
    "bowl",
    "baking powder",
    "flour",
    "oven",
    "baking pan",
    "vegetable oil",
    "mixer",
    "large mixing bowl",
    "sugar",
    "brush",
    "oil",
    "beaters",
    "measuring spoon",
    "eggs",
    "baking soda",
    "natural vanilla",
    "grapes",
    "wooden spoon"
  ],
  "tyn_section":[

  ]
}