{
  "title":"How to Make a Ramen Burger",
  "url":"https://www.wikihow.com/Make-a-Ramen-Burger",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles",
    "Ramen Dishes"
  ],
  "steps":[
    {
      "headline":"Take the first five ingredients and mix together in a bowl.",
      "description":"Make 4 hamburger patties. Grill or fry as desired."
    },
    {
      "headline":"Cook the ramen packet as directed, leaving out the flavor packet.",
      "description":"Drain noodles."
    },
    {
      "headline":"Whisk the egg and thoroughly coat the noodles.",
      "description":"Separate the noodle in half. Place one half in one ramekin dish, the other half in a second ramekin dish. Place saran wrap over each dish and press the noodles down with a can of food or another bowl. Refrigerate for 15 minutes."
    },
    {
      "headline":"Make sriracha sauce by using half sriracha per half ketchup.",
      "description":"Stir."
    },
    {
      "headline":"Carefully place the noodle cakes into a medium/hot pan to make the buns.",
      "description":"Fry until golden brown on both sides. You have just made your buns."
    },
    {
      "headline":"Fry the egg over easy or over medium.",
      "description":"Time to assemble."
    },
    {
      "headline":"Spread some sriracha ketchup on the bottom half of your bun.",
      "description":"Place a layer of arugula, then the hamburger patty. Next, put cheese slice, the fried egg, and onions (sauté, chopped green onions, or onion rings). Stand back and admire your masterpiece."
    }
  ],
  "text":" Take the first five ingredients and mix together in a bowl. Make 4 hamburger patties. Grill or fry as desired. Cook the ramen packet as directed, leaving out the flavor packet. Drain noodles. Whisk the egg and thoroughly coat the noodles. Separate the noodle in half. Place one half in one ramekin dish, the other half in a second ramekin dish. Place saran wrap over each dish and press the noodles down with a can of food or another bowl. Refrigerate for 15 minutes. Make sriracha sauce by using half sriracha per half ketchup. Stir. Carefully place the noodle cakes into a medium/hot pan to make the buns. Fry until golden brown on both sides. You have just made your buns. Fry the egg over easy or over medium. Time to assemble. Spread some sriracha ketchup on the bottom half of your bun. Place a layer of arugula, then the hamburger patty. Next, put cheese slice, the fried egg, and onions (sauté, chopped green onions, or onion rings). Stand back and admire your masterpiece.",
  "tyn_model":[
    "bowl",
    "ramekin dish",
    "ramen",
    "saran wrap",
    "sriracha sauce",
    "ketchup",
    "sriracha ketchup",
    "arugula",
    "hamburger patty",
    "cheese",
    "onions",
    "sauté",
    "green onions",
    "onion rings"
  ],
  "tyn_section":[

  ]
}