{
  "title":"How to Make Korean Dakjuk",
  "url":"https://www.wikihow.com/Make-Korean-Dakjuk",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Korean Dishes"
  ],
  "steps":[
    {
      "headline":"Soak 1 1/2 cups of uncooked rice in water for 1 hour.",
      "description":""
    },
    {
      "headline":"Thoroughly wash and drain the chicken.",
      "description":""
    },
    {
      "headline":"Trim out the fat from the chicken's stomach with a knife or a pair of scissors.",
      "description":""
    },
    {
      "headline":"Place the chicken in a pot and pour 12 cups of water to make the broth.",
      "description":""
    },
    {
      "headline":"Place 1 1/2 cups of garlic cloves into the pot and let sits and boils for 40 minutes.",
      "description":""
    },
    {
      "headline":"Lower down the heat and let cook for 20 more minutes.",
      "description":""
    },
    {
      "headline":"Add in the dates, chestnuts, leek or carrots.",
      "description":""
    },
    {
      "headline":"Rinse and drain the rice and add it to the chicken broth.",
      "description":""
    },
    {
      "headline":"Remove the floating fat on of the soup with a spoon.",
      "description":""
    },
    {
      "headline":"Keep boiling for 30 more minutes in low heat.",
      "description":""
    },
    {
      "headline":"Chop 3 stalks of green onions and 2 beaten eggs.",
      "description":""
    },
    {
      "headline":"Check to see if the chicken is cook by poking the meat with a fork.",
      "description":""
    },
    {
      "headline":"Add 2 beaten eggs into the broth and let it cook for 10 seconds before stirring it.",
      "description":""
    },
    {
      "headline":"Add 1 tablespoon of salt into the broth and stir well.",
      "description":""
    },
    {
      "headline":"That's it and it is ready to be served.",
      "description":""
    }
  ],
  "text":" Soak 1 1/2 cups of uncooked rice in water for 1 hour.  Thoroughly wash and drain the chicken.  Trim out the fat from the chicken's stomach with a knife or a pair of scissors.  Place the chicken in a pot and pour 12 cups of water to make the broth.  Place 1 1/2 cups of garlic cloves into the pot and let sits and boils for 40 minutes.  Lower down the heat and let cook for 20 more minutes.  Add in the dates, chestnuts, leek or carrots.  Rinse and drain the rice and add it to the chicken broth.  Remove the floating fat on of the soup with a spoon.  Keep boiling for 30 more minutes in low heat.  Chop 3 stalks of green onions and 2 beaten eggs.  Check to see if the chicken is cook by poking the meat with a fork.  Add 2 beaten eggs into the broth and let it cook for 10 seconds before stirring it.  Add 1 tablespoon of salt into the broth and stir well.  That's it and it is ready to be served. ",
  "tyn_model":[
    "rice",
    "water",
    "chicken",
    "pot",
    "broth",
    "garlic",
    "chestnuts",
    "leek",
    "carrots",
    "chicken broth",
    "spoon",
    "green onions",
    "beaten eggs",
    "fork",
    "eggs",
    "salt"
  ],
  "tyn_section":[

  ]
}