{
  "title":"How to Create Homemade Bug Spray",
  "url":"https://www.wikihow.com/Create-Homemade-Bug-Spray",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Pests and Weeds",
    "Garden Sprays"
  ],
  "methods":[
    {
      "name":"Evaluate Ingredients",
      "steps":[
        {
          "headline":"Locate non-toxic “perfuming” agents.",
          "description":"This includes essential oils and dried herbs. Not only will these perfuming agents make your bug spray smell wonderful and and soften your skin, but they will act as natural deterrents to the little stinkers that are so bothersome. Any essential oil or herb will help to reduce bites, but citronella oil is the key to creating a really effective repellent: Add a few drops of citronella oil to your spray and only the most daring kamikazes of the insect world will dare to attack."
        },
        {
          "headline":"Find a good astringent.",
          "description":"The drying portion of the mixture will be what actually repels the bugs and stops them from wanting to bite you. Good astringent-type agents include witch hazel and apple cider vinegar."
        },
        {
          "headline":"Locate a clean spray bottle.",
          "description":"You’ll need a delivery agent for your spray so find something that you can keep handy. Also, consider picking up smaller spray bottles that can easily be carried in a bag or purse-- perfect for last minute, on the go, use."
        }
      ]
    },
    {
      "name":"Make Two Effective Non-Toxic Insect Sprays",
      "steps":[
        {
          "headline":"Create bug spray using witch hazel.",
          "description":"If mixing your spray with witch hazel, you’ll only need three ingredients--witch hazel, water and essential oils. Preferred oils include citronella, clove, lemongrass, rosemary, tea tree, eucalyptus, cedar, catnip, lavender and mint. Fill spray bottle halfway with water. If you are really going for the natural, non-toxic mixture, use distilled or pre-boiled water. This is especially helpful when trying to protect small children or infants. Add witch hazel by filling almost to the top. You will essentially be using half water and almost half witch hazel. Add 30 to 50 drops of favorite essential oil. The more oil you use, the more potent the spray. Don’t forget to include citronella! Add spray nozzle and shake to blend and mix."
        },
        {
          "headline":"Create bug spray with apple cider vinegar.",
          "description":"With this spray, you’ll want to combine your ingredients in a glass jar or bottle, as you will be fermenting the herbs in a cool dark area before you transfer to a spray bottle. The jar should have a lid or other way to be sealed. Combine 16 ounces of apple cider vinegar with 1 tbsp. (one tablespoon) each of dried rosemary, lavender, sage, thyme and mint. Be sure to include a tablespoon of each herb in your mixture. Mix ingredients in an airtight jar and place in a cool, dark area of the home. The jar will need to ferment and sit for up to three weeks. Shake jar daily to infuse and mix ingredients. A simple tip once over will do the trick: There is no need for vigorous shaking. Strain herbs from jar after three weeks and transfer liquid mixture to a spray bottle."
        }
      ]
    }
  ],
  "text":" Evaluate Ingredients Locate non-toxic “perfuming” agents. This includes essential oils and dried herbs. Not only will these perfuming agents make your bug spray smell wonderful and and soften your skin, but they will act as natural deterrents to the little stinkers that are so bothersome. Any essential oil or herb will help to reduce bites, but citronella oil is the key to creating a really effective repellent: Add a few drops of citronella oil to your spray and only the most daring kamikazes of the insect world will dare to attack. Find a good astringent. The drying portion of the mixture will be what actually repels the bugs and stops them from wanting to bite you. Good astringent-type agents include witch hazel and apple cider vinegar. Locate a clean spray bottle. You’ll need a delivery agent for your spray so find something that you can keep handy. Also, consider picking up smaller spray bottles that can easily be carried in a bag or purse-- perfect for last minute, on the go, use. Make Two Effective Non-Toxic Insect Sprays Create bug spray using witch hazel. If mixing your spray with witch hazel, you’ll only need three ingredients--witch hazel, water and essential oils. Preferred oils include citronella, clove, lemongrass, rosemary, tea tree, eucalyptus, cedar, catnip, lavender and mint. Fill spray bottle halfway with water. If you are really going for the natural, non-toxic mixture, use distilled or pre-boiled water. This is especially helpful when trying to protect small children or infants. Add witch hazel by filling almost to the top. You will essentially be using half water and almost half witch hazel. Add 30 to 50 drops of favorite essential oil. The more oil you use, the more potent the spray. Don’t forget to include citronella! Add spray nozzle and shake to blend and mix. Create bug spray with apple cider vinegar. With this spray, you’ll want to combine your ingredients in a glass jar or bottle, as you will be fermenting the herbs in a cool dark area before you transfer to a spray bottle. The jar should have a lid or other way to be sealed. Combine 16 ounces of apple cider vinegar with 1 tbsp. (one tablespoon) each of dried rosemary, lavender, sage, thyme and mint. Be sure to include a tablespoon of each herb in your mixture. Mix ingredients in an airtight jar and place in a cool, dark area of the home. The jar will need to ferment and sit for up to three weeks. Shake jar daily to infuse and mix ingredients. A simple tip once over will do the trick: There is no need for vigorous shaking. Strain herbs from jar after three weeks and transfer liquid mixture to a spray bottle.",
  "tyn_model":[
    "witch hazel",
    "apple cider vinegar",
    "water",
    "spray bottle",
    "essential oils",
    "bug spray",
    "essential oil",
    "citronella oil",
    "mint",
    "herbs",
    "jar",
    "“perfuming",
    "” agents",
    "dried herbs",
    "perfuming agents",
    "astringent",
    "astringent-",
    "tea tree",
    "catnip",
    "distilled or pre-boiled water",
    "citronella",
    "spray nozzle",
    "lavender",
    "sage",
    "thyme",
    "airtight jar"
  ],
  "tyn_section":[

  ]
}