{
  "title":"How to Make Tofu Salad and Chicken Soup",
  "url":"https://www.wikihow.com/Make-Tofu-Salad-and-Chicken-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Tofu and Tempeh"
  ],
  "steps":[
    {
      "headline":"Cut the vegetables  into small pieces.",
      "description":"Also cut the fried tofu, garlic, ginger and steamed lemon into small pieces."
    },
    {
      "headline":"Fry the garlic and onion to mix with salad.",
      "description":"Crush the chili to get small pieces."
    },
    {
      "headline":"For the soup, cut the chicken to into small pieces.",
      "description":"Mix with salt, sugar, yellow powder and a little oil. Put the pieces into hot water for at least 5 minutes. Later put in more water that you need. Add the steamed lemon, ginger and garlic to produce a good smell. After 30 minutes, it is ready for the hot soup."
    },
    {
      "headline":"To make the vegetable salad, mix all the chopped vegetables with salt, lemon, bean power, chilli, fried garlic, onion, sugar, tomato, fried tofu, cabbage, papaya, rice noodle, long bean, coriander and cumber.",
      "description":""
    },
    {
      "headline":"Serve and enjoy your delicious vegetable salad and hot chicken soup.",
      "description":"Normally, this dish is eaten during the rainy season."
    }
  ],
  "text":" Cut the vegetables  into small pieces. Also cut the fried tofu, garlic, ginger and steamed lemon into small pieces. Fry the garlic and onion to mix with salad. Crush the chili to get small pieces. For the soup, cut the chicken to into small pieces. Mix with salt, sugar, yellow powder and a little oil. Put the pieces into hot water for at least 5 minutes. Later put in more water that you need. Add the steamed lemon, ginger and garlic to produce a good smell. After 30 minutes, it is ready for the hot soup. To make the vegetable salad, mix all the chopped vegetables with salt, lemon, bean power, chilli, fried garlic, onion, sugar, tomato, fried tofu, cabbage, papaya, rice noodle, long bean, coriander and cumber.  Serve and enjoy your delicious vegetable salad and hot chicken soup. Normally, this dish is eaten during the rainy season.",
  "tyn_model":[
    "garlic",
    "ginger",
    "onion",
    "salt",
    "sugar",
    "water",
    "lemon",
    "vegetable salad",
    "tofu",
    "steamed lemon",
    "chili",
    "chicken",
    "yellow powder",
    "oil",
    "vegetables",
    "bean power",
    "chilli",
    "fried garlic",
    "tomato",
    "fried tofu",
    "cabbage",
    "papaya",
    "rice noodle",
    "long bean",
    "coriander",
    "cumber",
    "chicken soup"
  ],
  "tyn_section":[

  ]
}