{
  "title":"How to Create a Homemade Swiffer Using Chenille Socks",
  "url":"https://www.wikihow.com/Create-a-Homemade-Swiffer-Using-Chenille-Socks",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "parts":[
    {
      "name":"Find the Perfect Pair of Socks",
      "steps":[
        {
          "headline":"Evaluate your Swiffer size.",
          "description":"Because these handy devices come in a variety of sizes you will need socks that will fit. That means you may need to shop in the men’s department for the larger model or purchase extra stretchy socks."
        },
        {
          "headline":"Consider how many pairs you will need.",
          "description":"Although one pair should give you two good cleanings, you may be one of those folks who aren’t fond of doing laundry every few days. If you need to clean your floors every day but don’t want to do laundry more than once or twice a week you should consider purchasing more than one pair of socks."
        },
        {
          "headline":"Examine sock material to ensure they are made of 100% chenille material.",
          "description":"While cotton may be nice, you want material that will attract and grab floor debris. A blend may not work as well as 100% chenille."
        }
      ]
    },
    {
      "name":"Create Your Homemade Sweeper",
      "steps":[
        {
          "headline":"Open sock package and remove tags, etc.",
          "description":"Make sure any price stickers or tags have been fully removed so there is no interference while cleaning."
        },
        {
          "headline":"Slide one sock over the base of your Swiffer sweeper.",
          "description":"You may need to stretch the sock mouth to fit over the base so stretch and mold as needed."
        },
        {
          "headline":"Use Swiffer as usual, covering floor space and corners.",
          "description":"If the sock becomes filled with debris and is no longer working as well, head to the trash and wipe your hand over the bottom to remove abundant hair or debris. Continue to use until finished."
        },
        {
          "headline":"Remove sock from Swiffer base and launder as usual.",
          "description":"Avoid using fabric softener when washing the sock as fabric softener may reduce the chenille material power. Consider removing excess debris from sock before adding it to the washing machine. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2a\\/Create-a-Homemade-Swiffer-Using-Chenille-Socks-Step-7Bullet1.jpg\\/v4-459px-Create-a-Homemade-Swiffer-Using-Chenille-Socks-Step-7Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2a\\/Create-a-Homemade-Swiffer-Using-Chenille-Socks-Step-7Bullet1.jpg\\/v4-759px-Create-a-Homemade-Swiffer-Using-Chenille-Socks-Step-7Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"}"
        }
      ]
    }
  ],
  "text":" Find the Perfect Pair of Socks Evaluate your Swiffer size. Because these handy devices come in a variety of sizes you will need socks that will fit. That means you may need to shop in the men’s department for the larger model or purchase extra stretchy socks. Consider how many pairs you will need. Although one pair should give you two good cleanings, you may be one of those folks who aren’t fond of doing laundry every few days. If you need to clean your floors every day but don’t want to do laundry more than once or twice a week you should consider purchasing more than one pair of socks. Examine sock material to ensure they are made of 100% chenille material. While cotton may be nice, you want material that will attract and grab floor debris. A blend may not work as well as 100% chenille. Create Your Homemade Sweeper Open sock package and remove tags, etc. Make sure any price stickers or tags have been fully removed so there is no interference while cleaning. Slide one sock over the base of your Swiffer sweeper. You may need to stretch the sock mouth to fit over the base so stretch and mold as needed. Use Swiffer as usual, covering floor space and corners. If the sock becomes filled with debris and is no longer working as well, head to the trash and wipe your hand over the bottom to remove abundant hair or debris. Continue to use until finished. Remove sock from Swiffer base and launder as usual. Avoid using fabric softener when washing the sock as fabric softener may reduce the chenille material power. Consider removing excess debris from sock before adding it to the washing machine. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2a\\/Create-a-Homemade-Swiffer-Using-Chenille-Socks-Step-7Bullet1.jpg\\/v4-459px-Create-a-Homemade-Swiffer-Using-Chenille-Socks-Step-7Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2a\\/Create-a-Homemade-Swiffer-Using-Chenille-Socks-Step-7Bullet1.jpg\\/v4-759px-Create-a-Homemade-Swiffer-Using-Chenille-Socks-Step-7Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a> (screenshot)<br>\\n<\\/p><\\/div>\"}",
  "tyn_model":[
    "swiffer",
    "socks",
    "fabric softener",
    "swiffer sweeper"
  ],
  "tyn_section":[

  ]
}