{
  "title":"How to Make Mummy Cookie Bites",
  "url":"https://www.wikihow.com/Make-Mummy-Cookie-Bites",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits"
  ],
  "parts":[
    {
      "name":"Preparing the Cream Cheese and Oreos",
      "steps":[
        {
          "headline":"Allow the cream cheese to soften.",
          "description":"Let it sit on the countertop for a few minutes. Never microwave or force-soften the cream cheese as it might curdle."
        },
        {
          "headline":"Place the Oreos in the large plastic freezer bag, seal and crush.",
          "description":"You can use your hands to crush the bag or you can use a small, wooden mallet to gently tap the cookies until they are crushed."
        }
      ]
    },
    {
      "name":"Mixing the Ingredients and Making Balls",
      "steps":[
        {
          "headline":"Combine the softened cream cheese and Oreos in the mixing bowl to integrate.",
          "description":"Blend well until the cream cheese and Oreos form a thick dough."
        },
        {
          "headline":"Roll the cream cheese and Oreo dough into balls.",
          "description":"These balls will be the actual mummy bites so make them the size you desire (1 inch/2.5cm balls will be sufficient)."
        },
        {
          "headline":"Line the cookie sheet with waxed paper and line with dough balls.",
          "description":"Fit as many as you can on cookie sheet and grab another sheet if necessary. Make the entire batch in one shot."
        },
        {
          "headline":"Place cookie sheet(s) in the freezer.",
          "description":"Freeze balls for approximately 10 minutes."
        }
      ]
    },
    {
      "name":"Melting and Using the Chocolate",
      "steps":[
        {
          "headline":"Melt the white chocolate using either the double boiler or microwave bowl method.",
          "description":"Take the chocolate manufacturer’s instructions into consideration as well, to ensure the perfect melted consistency."
        },
        {
          "headline":"Remove the frozen balls from the freezer.",
          "description":"Dip each ball into the melted chocolate. Wait a few seconds before dipping into the chocolate, as you want the chocolate to be warm but not too hot (which may melt and/or compromise the shape of the cream cheese/Oreo balls)."
        },
        {
          "headline":"Place the chocolate dipped balls back on the waxed paper lined cookie sheet.",
          "description":"Place the sheet(s) into the refrigerator so the chocolate can harden. Refrigerate for approximately 1 hour or until bites have hardened."
        },
        {
          "headline":"Pour the remaining chocolate into the small plastic freezer bag.",
          "description":"Smooth the bag before sealing to remove air. Put the bag aside while the bites chill."
        }
      ]
    },
    {
      "name":"Decorating the Mummy Cookie Bites",
      "steps":[
        {
          "headline":"Remove chilled bites from the refrigerator.",
          "description":"Decorate with the chocolate waiting inside the freezer bag."
        },
        {
          "headline":"Snip a small amount on one end of the freezer bag.",
          "description":"This will create a small hole."
        },
        {
          "headline":"Squeeze/drizzle chocolate over each bite.",
          "description":"This is to create a “wrapped” gauzy effect."
        },
        {
          "headline":"Finish the bites with two small chocolate chip “eyes” for each mummy.",
          "description":"Replace sheet(s) in the refrigerator and allow them to remain until you are ready to serve."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preparing the Cream Cheese and Oreos Allow the cream cheese to soften. Let it sit on the countertop for a few minutes. Never microwave or force-soften the cream cheese as it might curdle. Place the Oreos in the large plastic freezer bag, seal and crush. You can use your hands to crush the bag or you can use a small, wooden mallet to gently tap the cookies until they are crushed. Mixing the Ingredients and Making Balls Combine the softened cream cheese and Oreos in the mixing bowl to integrate. Blend well until the cream cheese and Oreos form a thick dough. Roll the cream cheese and Oreo dough into balls. These balls will be the actual mummy bites so make them the size you desire (1 inch/2.5cm balls will be sufficient). Line the cookie sheet with waxed paper and line with dough balls. Fit as many as you can on cookie sheet and grab another sheet if necessary. Make the entire batch in one shot. Place cookie sheet(s) in the freezer. Freeze balls for approximately 10 minutes. Melting and Using the Chocolate Melt the white chocolate using either the double boiler or microwave bowl method. Take the chocolate manufacturer’s instructions into consideration as well, to ensure the perfect melted consistency. Remove the frozen balls from the freezer. Dip each ball into the melted chocolate. Wait a few seconds before dipping into the chocolate, as you want the chocolate to be warm but not too hot (which may melt and/or compromise the shape of the cream cheese/Oreo balls). Place the chocolate dipped balls back on the waxed paper lined cookie sheet. Place the sheet(s) into the refrigerator so the chocolate can harden. Refrigerate for approximately 1 hour or until bites have hardened. Pour the remaining chocolate into the small plastic freezer bag. Smooth the bag before sealing to remove air. Put the bag aside while the bites chill. Decorating the Mummy Cookie Bites Remove chilled bites from the refrigerator. Decorate with the chocolate waiting inside the freezer bag. Snip a small amount on one end of the freezer bag. This will create a small hole. Squeeze/drizzle chocolate over each bite. This is to create a “wrapped” gauzy effect. Finish the bites with two small chocolate chip “eyes” for each mummy. Replace sheet(s) in the refrigerator and allow them to remain until you are ready to serve. Finished. ",
  "tyn_model":[
    "chocolate",
    "cream cheese",
    "oreos",
    "refrigerator",
    "cookie sheet",
    "freezer",
    "freezer bag",
    "microwave",
    "large plastic freezer bag",
    "mallet",
    "mixing bowl",
    "oreo",
    "waxed paper",
    "cookie sheet(s",
    "white chocolate",
    "double boiler",
    "microwave bowl",
    "chocolate dipped balls",
    "waxed paper lined cookie sheet",
    "small plastic freezer bag",
    "“wrapped",
    "” gauzy",
    "chocolate chip",
    "“eyes",
    "” for"
  ],
  "tyn_section":[

  ]
}