{
  "title":"How to Make Easy Fried Rice Using Leftover Rice",
  "url":"https://www.wikihow.com/Make-Easy-Fried-Rice-Using-Leftover-Rice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Rice and Beans",
    "Fried Rice Dishes"
  ],
  "methods":[
    {
      "name":"Leftover easy fried rice from fridge",
      "steps":[
        {
          "headline":"Take the leftover cold rice out of the fridge.",
          "description":"The rice will be cold."
        },
        {
          "headline":"Get out a frying pan and put in on the burner, turn on the burner and add just enough vegetable oil to thinly coat most of the pan.",
          "description":""
        },
        {
          "headline":"Add rice to the pan, and stir it around with a spatula for about two minutes, do not turn the burner on too high, you don't want the rice to burn.",
          "description":""
        },
        {
          "headline":"Use the spatula to push the rice to one half of the pan, then push the pan to the side of the burner so that the empty side of the pan is in the middle of the burner.",
          "description":""
        },
        {
          "headline":"Turn up the burner high and add whisked eggs, stirring them with quick and choppy pushes of the spatula until the egg is cooked and in small pieces.",
          "description":""
        },
        {
          "headline":"Add frozen vegetable medley to the pan, move it back to the center of the burner and turn the heat down slightly.",
          "description":"Mix all the ingredients together until everything is cooked and hot."
        },
        {
          "headline":"Add soy sauce and sesame oil to taste.",
          "description":"Stir it all up, and it's now ready to serve."
        }
      ]
    },
    {
      "name":"Leftover easy fried rice from freezer",
      "steps":[
        {
          "headline":"Bring the frozen rice out of the freezer to defrost.",
          "description":""
        },
        {
          "headline":"Slice onions, and any other veggies you want to add.",
          "description":""
        },
        {
          "headline":"In a separate bowl, break eggs (as many as you think appropriate for the amount of rice).",
          "description":"Season to taste with salt, pepper, curry, etc."
        },
        {
          "headline":"Using a little butter in a frying pan, fry the onions and the other veggies.",
          "description":""
        },
        {
          "headline":"Add the rice and fry for a few minutes.",
          "description":""
        },
        {
          "headline":"Add the eggs to the mix.",
          "description":"Cook till it is not soggy anymore."
        },
        {
          "headline":"Add soy sauce for taste.",
          "description":"Serve."
        }
      ]
    }
  ],
  "text":" Leftover easy fried rice from fridge Take the leftover cold rice out of the fridge. The rice will be cold. Get out a frying pan and put in on the burner, turn on the burner and add just enough vegetable oil to thinly coat most of the pan.  Add rice to the pan, and stir it around with a spatula for about two minutes, do not turn the burner on too high, you don't want the rice to burn.  Use the spatula to push the rice to one half of the pan, then push the pan to the side of the burner so that the empty side of the pan is in the middle of the burner.  Turn up the burner high and add whisked eggs, stirring them with quick and choppy pushes of the spatula until the egg is cooked and in small pieces.  Add frozen vegetable medley to the pan, move it back to the center of the burner and turn the heat down slightly. Mix all the ingredients together until everything is cooked and hot. Add soy sauce and sesame oil to taste. Stir it all up, and it's now ready to serve. Leftover easy fried rice from freezer Bring the frozen rice out of the freezer to defrost.  Slice onions, and any other veggies you want to add.  In a separate bowl, break eggs (as many as you think appropriate for the amount of rice). Season to taste with salt, pepper, curry, etc. Using a little butter in a frying pan, fry the onions and the other veggies.  Add the rice and fry for a few minutes.  Add the eggs to the mix. Cook till it is not soggy anymore. Add soy sauce for taste. Serve.",
  "tyn_model":[
    "rice",
    "burner",
    "spatula",
    "eggs",
    "frying pan",
    "soy sauce",
    "onions",
    "vegetable oil",
    "frozen vegetable medley",
    "sesame oil",
    "salt",
    "butter"
  ],
  "tyn_section":[

  ]
}