{
  "title":"How to Make Hostess Twinkies",
  "url":"https://www.wikihow.com/Make-Hostess-Twinkies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes"
  ],
  "parts":[
    {
      "name":"Making the Cake",
      "steps":[
        {
          "headline":"Get a large bowl and combine the sugar, flour, baking powder, and salt.",
          "description":"Create a hole in the middle (like a well). Then add the egg yolks, water, oil, and vanilla. Mix everything together until you get a smooth mixture. Put the bowl on the side."
        },
        {
          "headline":"Get another bowl and mix the cream of tartar with the egg whites.",
          "description":"Beat them together until you get a stiff peak."
        },
        {
          "headline":"Take the egg white mixture and pour it into the first mixture you made.",
          "description":"Mix everything until all the ingredients are well combined."
        },
        {
          "headline":"Pour the final mixture in a 10 x 14 inch (25cm x 35cm) pan; there is no need to grease it.",
          "description":"Place it in the oven at 350ºF/180ºC for about 45 to 50 minutes."
        },
        {
          "headline":"Let the cake cool on the side.",
          "description":"Turn the pan upside down as you get it out, then take the edges off with a knife."
        },
        {
          "headline":"Cut the cake horizontally carefully to get two layers.",
          "description":""
        }
      ]
    },
    {
      "name":"Making the Filling",
      "steps":[
        {
          "headline":"Get a bowl and mix the sugar, flour, and butter together.",
          "description":"Beat for five minutes on a high speed and slowly mix in the vanilla and milk."
        },
        {
          "headline":"Continue beating everything together for another five minutes.",
          "description":""
        },
        {
          "headline":"Spread the filling mixture on the two cake layers.",
          "description":""
        },
        {
          "headline":"Cut the cake into small squares (about 3 x 1 inches/7.5cm x 2.5cm).",
          "description":"Wrap the individual pieces in Saran wrap."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Cake Get a large bowl and combine the sugar, flour, baking powder, and salt. Create a hole in the middle (like a well). Then add the egg yolks, water, oil, and vanilla. Mix everything together until you get a smooth mixture. Put the bowl on the side. Get another bowl and mix the cream of tartar with the egg whites. Beat them together until you get a stiff peak. Take the egg white mixture and pour it into the first mixture you made. Mix everything until all the ingredients are well combined. Pour the final mixture in a 10 x 14 inch (25cm x 35cm) pan; there is no need to grease it. Place it in the oven at 350ºF/180ºC for about 45 to 50 minutes. Let the cake cool on the side. Turn the pan upside down as you get it out, then take the edges off with a knife. Cut the cake horizontally carefully to get two layers.  Making the Filling Get a bowl and mix the sugar, flour, and butter together. Beat for five minutes on a high speed and slowly mix in the vanilla and milk. Continue beating everything together for another five minutes.  Spread the filling mixture on the two cake layers.  Cut the cake into small squares (about 3 x 1 inches/7.5cm x 2.5cm). Wrap the individual pieces in Saran wrap. Finished. ",
  "tyn_model":[
    "bowl",
    "sugar",
    "flour",
    "vanilla",
    "cake",
    "large bowl",
    "baking powder",
    "salt",
    "water",
    "oil",
    "cream",
    "egg white",
    "oven",
    "knife",
    "butter",
    "milk",
    "saran wrap"
  ],
  "tyn_section":[

  ]
}