{
  "title":"How to Do Card Tricks",
  "url":"https://www.wikihow.com/Do-Card-Tricks",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "methods":[
    {
      "name":"Picking a Card with the Color Trick",
      "steps":[
        {
          "headline":"Sort a deck of cards by color and put the black half on top of the red half.",
          "description":"It doesn’t matter what order the suits or numbers are in. Stack the cards neatly in 1 pile, so that all of the black cards are at the top of the deck and all of the red cards are at the bottom. You can also put the red half on top of the black half. Whichever way you choose, make sure you remember which color is on top. Set this up before your audience is there. Otherwise, they’ll know how the trick is done!"
        },
        {
          "headline":"Fan out the cards face down and ask your audience to pick a card.",
          "description":"When you hold the cards out, remember which side of the deck is your red cards and which is black. Tell your audience that they can choose any card in the deck. If you fan the cards to the right, then the black cards will be the right half of the deck if they were originally the cards you put on top."
        },
        {
          "headline":"Observe which half of the deck your audience pulls a card from.",
          "description":"This is key to making the trick work. You want to know what color the audience’s card is so you can find it later. For example, if the red cards are on the left half of your fanned-out deck, then you know your audience chose a red card if they pull from the left side. If you notice that your audience member is reaching for the middle, subtly shift your hand so they take 1 from the left or right instead. If they pick a card from the center, you might not be able to tell what color it is."
        },
        {
          "headline":"Ask the audience to look at the card while keeping it hidden from you.",
          "description":"Showing you the card defeats the purpose of the whole trick. You can even close your eyes or look away to ensure you don’t see it. If they accidentally do reveal the card, start the trick over."
        },
        {
          "headline":"Split the deck and have them set the card in the half that's the other color.",
          "description":"If your audience member chose a red card, pull the deck apart in the black section and ask them to place the card there. This ensures you’ll be able to locate the card in the deck. Don’t put the card back in the deck yourself. Otherwise, your audience might accuse you of rigging the trick. Keep all of the cards face down the entire time. Fun Ways to Enhance Your Trick\nTap a magic wand on the deck before you pick their card. Wear a magician costume, including a fancy top hat, for the full effect. Take a long time to pick out their card to build suspense. Sprinkle “magic dust” on the cards. Use glitter or confetti as the dust."
        },
        {
          "headline":"Look at the cards to find theirs, which will be the 1 opposite-colored card.",
          "description":"For example, if they picked a red card, their card should now be the only red card in the black half. If they selected a black card, it will be the black card among all the red cards. If you don’t see an opposite-colored card in the deck, you’ve messed up the trick somewhere along the line. Ask your audience if you can try again. You can say something like, \"Hmm it looks like you have your own magical powers, and the card has completely disappeared! Try picking another one, but only touch it with 2 fingers so your magic doesn't rub off on it again.\" Hold the cards so only you can see them while you look for the card. You don’t want the audience to see that you’ve split the deck by color."
        },
        {
          "headline":"Reveal the card to your audience.",
          "description":"To finish the trick, hold up the audience’s chosen card or lay it down on the table so they can see it. Ask them to confirm that the trick worked, by saying something like, “Is this your card?”\nYou can even add a “ta-da!” for extra flourish. To repeat the trick, reorganize the cards so they’re separated by color again."
        }
      ]
    },
    {
      "name":"Trying the Binary Card Trick",
      "steps":[
        {
          "headline":"Put an ace, 2, 4, and 8 card on the top of the deck.",
          "description":"Keep them in that order. The ace will represent 1 for this trick and will be the very top card on your pile. The cards can be any suit or color. Do this before your audience arrives. The rest of the deck can be in any order. Avoid shuffling after you put the cards on top, though, so you don’t mess them up."
        },
        {
          "headline":"Slide the deck of cards into your pocket.",
          "description":"Be careful not to jumble the cards as you put them in your pocket. You want the ace, 2, 4, and 8 to stay on top. Remember which side of the deck is the top when you hide the cards. If you don’t have a pocket, hold the cards under a table or anywhere hidden where the audience can’t see them."
        },
        {
          "headline":"Ask your audience to pick a number between 1 and 15.",
          "description":"They can choose 15, but it can’t be any number larger than that. Have them tell you their number out loud. You can have them write down the number on a piece of paper, too, if you need a visual."
        },
        {
          "headline":"Calculate in your head how to get their number using 1, 2, 4, and 8.",
          "description":"Every number between 1 and 15 can be formed by adding up some or all of the 4 top cards in your pocket. The collection of numbers that sum up to the number your audience gave you is known as its binary decomposition. Instead of trying to add different numbers using trial and error, start by subtracting the largest of your 4 cards from the audience’s number. Then subtract the next largest number and so on, until you reach 0. Don’t use a calculator or paper to do your calculation. You have to do it mentally for the trick to be impressive."
        },
        {
          "headline":"Pull out the cards that add up to that number without looking.",
          "description":"You should know where each card is because you set them on the deck in the order of 1 (ace), 2, 4, and 8. Carefully remove the correct cards. For example, if the number is 10, you’ll need the 8 and 2. The 2 is the 2nd card in your deck and the 8 is the 4th. If you accidentally pull out the wrong cards, you’ll ruin the trick. Possible Card Combinations\nIf your audience says 1, 2, 4, 8, you'll just need to pull out 1 card, since those are the exact cards on top of your deck. If they pick 15, take out all 4 cards (ace, 2, 4, and 8) from your pocket. To make any other number, add up different combinations of 1, 2, 4, and 8. So 7 would be 1 (ace), 2, and 4, for instance."
        },
        {
          "headline":"Show the cards to your audience.",
          "description":"Once you pull out the cards, arrange them in your hand so that the numbers are visible. Then flip them around so your audience can see them. Explain that the numbers add up to their chosen number. You can also lay the cards out on a table or simply hand the cards to your audience. If you want to repeat the trick, make sure you put the cards back into your pocket in the correct order."
        }
      ]
    },
    {
      "name":"Pulling a Card out of Thin Air",
      "steps":[
        {
          "headline":"Hold 1 in the palm of your hand.",
          "description":"Make sure you can’t see any edges or corners of the card when you flip your hand over. Place 1 corner of the card against the top of your pinky finger and the opposite corner on your thumb pad. You may need to slightly curve the card into your hand to rest in your palm. The card can be either face down or face up in your hand. Don’t grip too tightly or curl your hand inward too much. Keep it as outstretched as possible."
        },
        {
          "headline":"Bow the card out by pressing down with your pinky finger.",
          "description":"This will cause the card to arch out away from your hand. Flex your palm slightly outward while you push down with your little finger so the card curves out instead of in. Press gently with your pinky. If you use too much pressure, the card will snap out of your hand."
        },
        {
          "headline":"Place your thumb behind the card and rest your index finger on 1 corner.",
          "description":"This sets you up to be able to catch the card. Move your thumb so it’s sitting just behind the arch of the card. Curve the top of your index finger down slightly until it touches the top corner of the card. The more you practice this position, the faster your muscles will commit it to memory. Only your pinky finger, thumb pad, index finger, and thumb should be touching the card in this position."
        },
        {
          "headline":"Flick the card upward, catching it between your thumb and forefinger.",
          "description":"Push up against the back of the card with your thumb. As the card flips upwards, pinch your thumb and index finger together quickly to snatch the corner. Open up the rest of your fingers after you flick up the card to enhance the illusion that you pulled it out of thin air. This will take a lot of practice, so be patient! As you get more comfortable with the movements, work on speeding it up so it looks more realistic."
        }
      ]
    }
  ],
  "text":" Picking a Card with the Color Trick Sort a deck of cards by color and put the black half on top of the red half. It doesn’t matter what order the suits or numbers are in. Stack the cards neatly in 1 pile, so that all of the black cards are at the top of the deck and all of the red cards are at the bottom. You can also put the red half on top of the black half. Whichever way you choose, make sure you remember which color is on top. Set this up before your audience is there. Otherwise, they’ll know how the trick is done! Fan out the cards face down and ask your audience to pick a card. When you hold the cards out, remember which side of the deck is your red cards and which is black. Tell your audience that they can choose any card in the deck. If you fan the cards to the right, then the black cards will be the right half of the deck if they were originally the cards you put on top. Observe which half of the deck your audience pulls a card from. This is key to making the trick work. You want to know what color the audience’s card is so you can find it later. For example, if the red cards are on the left half of your fanned-out deck, then you know your audience chose a red card if they pull from the left side. If you notice that your audience member is reaching for the middle, subtly shift your hand so they take 1 from the left or right instead. If they pick a card from the center, you might not be able to tell what color it is. Ask the audience to look at the card while keeping it hidden from you. Showing you the card defeats the purpose of the whole trick. You can even close your eyes or look away to ensure you don’t see it. If they accidentally do reveal the card, start the trick over. Split the deck and have them set the card in the half that's the other color. If your audience member chose a red card, pull the deck apart in the black section and ask them to place the card there. This ensures you’ll be able to locate the card in the deck. Don’t put the card back in the deck yourself. Otherwise, your audience might accuse you of rigging the trick. Keep all of the cards face down the entire time. Fun Ways to Enhance Your Trick\nTap a magic wand on the deck before you pick their card. Wear a magician costume, including a fancy top hat, for the full effect. Take a long time to pick out their card to build suspense. Sprinkle “magic dust” on the cards. Use glitter or confetti as the dust. Look at the cards to find theirs, which will be the 1 opposite-colored card. For example, if they picked a red card, their card should now be the only red card in the black half. If they selected a black card, it will be the black card among all the red cards. If you don’t see an opposite-colored card in the deck, you’ve messed up the trick somewhere along the line. Ask your audience if you can try again. You can say something like, \"Hmm it looks like you have your own magical powers, and the card has completely disappeared! Try picking another one, but only touch it with 2 fingers so your magic doesn't rub off on it again.\" Hold the cards so only you can see them while you look for the card. You don’t want the audience to see that you’ve split the deck by color. Reveal the card to your audience. To finish the trick, hold up the audience’s chosen card or lay it down on the table so they can see it. Ask them to confirm that the trick worked, by saying something like, “Is this your card?”\nYou can even add a “ta-da!” for extra flourish. To repeat the trick, reorganize the cards so they’re separated by color again. Trying the Binary Card Trick Put an ace, 2, 4, and 8 card on the top of the deck. Keep them in that order. The ace will represent 1 for this trick and will be the very top card on your pile. The cards can be any suit or color. Do this before your audience arrives. The rest of the deck can be in any order. Avoid shuffling after you put the cards on top, though, so you don’t mess them up. Slide the deck of cards into your pocket. Be careful not to jumble the cards as you put them in your pocket. You want the ace, 2, 4, and 8 to stay on top. Remember which side of the deck is the top when you hide the cards. If you don’t have a pocket, hold the cards under a table or anywhere hidden where the audience can’t see them. Ask your audience to pick a number between 1 and 15. They can choose 15, but it can’t be any number larger than that. Have them tell you their number out loud. You can have them write down the number on a piece of paper, too, if you need a visual. Calculate in your head how to get their number using 1, 2, 4, and 8. Every number between 1 and 15 can be formed by adding up some or all of the 4 top cards in your pocket. The collection of numbers that sum up to the number your audience gave you is known as its binary decomposition. Instead of trying to add different numbers using trial and error, start by subtracting the largest of your 4 cards from the audience’s number. Then subtract the next largest number and so on, until you reach 0. Don’t use a calculator or paper to do your calculation. You have to do it mentally for the trick to be impressive. Pull out the cards that add up to that number without looking. You should know where each card is because you set them on the deck in the order of 1 (ace), 2, 4, and 8. Carefully remove the correct cards. For example, if the number is 10, you’ll need the 8 and 2. The 2 is the 2nd card in your deck and the 8 is the 4th. If you accidentally pull out the wrong cards, you’ll ruin the trick. Possible Card Combinations\nIf your audience says 1, 2, 4, 8, you'll just need to pull out 1 card, since those are the exact cards on top of your deck. If they pick 15, take out all 4 cards (ace, 2, 4, and 8) from your pocket. To make any other number, add up different combinations of 1, 2, 4, and 8. So 7 would be 1 (ace), 2, and 4, for instance. Show the cards to your audience. Once you pull out the cards, arrange them in your hand so that the numbers are visible. Then flip them around so your audience can see them. Explain that the numbers add up to their chosen number. You can also lay the cards out on a table or simply hand the cards to your audience. If you want to repeat the trick, make sure you put the cards back into your pocket in the correct order. Pulling a Card out of Thin Air Hold 1 in the palm of your hand. Make sure you can’t see any edges or corners of the card when you flip your hand over. Place 1 corner of the card against the top of your pinky finger and the opposite corner on your thumb pad. You may need to slightly curve the card into your hand to rest in your palm. The card can be either face down or face up in your hand. Don’t grip too tightly or curl your hand inward too much. Keep it as outstretched as possible. Bow the card out by pressing down with your pinky finger. This will cause the card to arch out away from your hand. Flex your palm slightly outward while you push down with your little finger so the card curves out instead of in. Press gently with your pinky. If you use too much pressure, the card will snap out of your hand. Place your thumb behind the card and rest your index finger on 1 corner. This sets you up to be able to catch the card. Move your thumb so it’s sitting just behind the arch of the card. Curve the top of your index finger down slightly until it touches the top corner of the card. The more you practice this position, the faster your muscles will commit it to memory. Only your pinky finger, thumb pad, index finger, and thumb should be touching the card in this position. Flick the card upward, catching it between your thumb and forefinger. Push up against the back of the card with your thumb. As the card flips upwards, pinch your thumb and index finger together quickly to snatch the corner. Open up the rest of your fingers after you flick up the card to enhance the illusion that you pulled it out of thin air. This will take a lot of practice, so be patient! As you get more comfortable with the movements, work on speeding it up so it looks more realistic.",
  "tyn_model":[
    "cards",
    "card",
    "magic wand",
    "“magic dust",
    "” on",
    "glitter",
    "“is",
    "”\n",
    "“ta",
    "” for",
    "paper",
    "calculator",
    "thin air"
  ],
  "tyn_section":[

  ]
}