{
  "title":"How to Add Codes Onto Your Action Replay for Nintendo DS",
  "url":"https://www.wikihow.com/Add-Codes-Onto-Your-Action-Replay-for-Nintendo-DS",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo DS"
  ],
  "steps":[
    {
      "headline":"Install your Action Replay Code manager.",
      "description":"There should be a small disc that came with your Action Replay system. Insert the disc into your computer and install the program."
    },
    {
      "headline":"Insert the Action Replay game cartridge into your Nintendo DS and turn it on.",
      "description":""
    },
    {
      "headline":"Plug one end of your your USB cord into your computer and the other end into the top of your Action Replay game cartridge.",
      "description":""
    },
    {
      "headline":"Find the code you are looking for and open up the \"Notepad\" program on your computer.",
      "description":""
    },
    {
      "headline":"Copy and paste the code onto the \"Notepad\" program.",
      "description":""
    },
    {
      "headline":"Click on File, then choose Save As....",
      "description":""
    },
    {
      "headline":"Choose the file-name you want to save this code under.",
      "description":""
    },
    {
      "headline":"Look at the bottom of the Save As.... screen There should be three lines: File Name, Save As Type, and Encoding.",
      "description":"The only thing you're going to change is the File Name. Choose a name that you want to save your code as but, don't save it as .txt. For example, let's say you name your code Josh; don't save it as Josh.txt, instead you are going to want to change it to Josh.xml. Whatever you choose as your file code name, you want to make sure to replace .txt with .xml at the end."
    },
    {
      "headline":"Once you have saved it in the proper format, your Action Replay is on and your DS is connected to your computer with the Action Replay Code Manager open, now you can add your code on your Action Replay.",
      "description":"Open up the file you saved your code in and right-click it."
    },
    {
      "headline":"Select Copy and go over to your Action Replay Code Manager On the left screen there should be a huge column with all the codes your Action Replay came preloaded with.",
      "description":"Right-click that column and choose Paste. Pasting this one code on here will have your whole library of preloaded games deleted off of your Action Replay system, don't freak out! You can easily put the preloaded games back onto your system once you are done with this code by going online with your Code Manager and resubscribe with it."
    },
    {
      "headline":"Once your code is added onto your system, you can disconnect the USB cable from your Action Replay cartridge, but don't turn it off just yet.",
      "description":"Click the little house logo on your Nintendo DS screen to go back to the main screen."
    },
    {
      "headline":"Now click the green button with the little star symbol on it and scroll down to choose your code.",
      "description":"Click the green star button again and scroll down to your code. Once again, click the green star button to check-mark the code and then without shutting off your Nintendo DS system take out the Action Replay Cartridge and insert your game cartridge. Once it's inserted, there should be a new button that says 'Start', click on that button to start up your game!"
    },
    {
      "headline":"Your code should be there!",
      "description":"Don't turn on too many cheats because it may cause your game to freeze!"
    }
  ],
  "text":" Install your Action Replay Code manager. There should be a small disc that came with your Action Replay system. Insert the disc into your computer and install the program. Insert the Action Replay game cartridge into your Nintendo DS and turn it on.  Plug one end of your your USB cord into your computer and the other end into the top of your Action Replay game cartridge.  Find the code you are looking for and open up the \"Notepad\" program on your computer.  Copy and paste the code onto the \"Notepad\" program.  Click on File, then choose Save As....  Choose the file-name you want to save this code under.  Look at the bottom of the Save As.... screen There should be three lines: File Name, Save As Type, and Encoding. The only thing you're going to change is the File Name. Choose a name that you want to save your code as but, don't save it as .txt. For example, let's say you name your code Josh; don't save it as Josh.txt, instead you are going to want to change it to Josh.xml. Whatever you choose as your file code name, you want to make sure to replace .txt with .xml at the end. Once you have saved it in the proper format, your Action Replay is on and your DS is connected to your computer with the Action Replay Code Manager open, now you can add your code on your Action Replay. Open up the file you saved your code in and right-click it. Select Copy and go over to your Action Replay Code Manager On the left screen there should be a huge column with all the codes your Action Replay came preloaded with. Right-click that column and choose Paste. Pasting this one code on here will have your whole library of preloaded games deleted off of your Action Replay system, don't freak out! You can easily put the preloaded games back onto your system once you are done with this code by going online with your Code Manager and resubscribe with it. Once your code is added onto your system, you can disconnect the USB cable from your Action Replay cartridge, but don't turn it off just yet. Click the little house logo on your Nintendo DS screen to go back to the main screen. Now click the green button with the little star symbol on it and scroll down to choose your code. Click the green star button again and scroll down to your code. Once again, click the green star button to check-mark the code and then without shutting off your Nintendo DS system take out the Action Replay Cartridge and insert your game cartridge. Once it's inserted, there should be a new button that says 'Start', click on that button to start up your game! Your code should be there! Don't turn on too many cheats because it may cause your game to freeze!",
  "tyn_model":[
    "action replay",
    "nintendo ds",
    "action replay code manager",
    "notepad\"",
    "usb cord",
    "usb cable",
    "action replay cartridge"
  ],
  "tyn_section":[

  ]
}