{
  "title":"How to Make Flavored Ice Cream Sundaes",
  "url":"https://www.wikihow.com/Make-Flavored-Ice-Cream-Sundaes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts",
    "Ice Cream Sundaes"
  ],
  "methods":[
    {
      "name":"Marsh Fudge \"Cruncherama\" Sundae",
      "steps":[
        {
          "headline":"Put 2 scoops of vanilla ice cream into a glass.",
          "description":""
        },
        {
          "headline":"Mash in marshmallows with a fork.",
          "description":""
        },
        {
          "headline":"Mix in some tiny squares of fudge.",
          "description":""
        },
        {
          "headline":"Sprinkle in some honeycomb/cookies (known as biscuits in the UK).",
          "description":""
        }
      ]
    },
    {
      "name":"Peanut Butter Nuttier Sundae",
      "steps":[
        {
          "headline":"In a bowl mix peanut butter with vanilla ice cream.",
          "description":""
        },
        {
          "headline":"Put 1 scoop of this mixture into a glass.",
          "description":""
        },
        {
          "headline":"Put a spoonful of Nutella on top.",
          "description":""
        },
        {
          "headline":"Put another scoop of the peanut butter ice cream on top.",
          "description":""
        },
        {
          "headline":"Put a spoonful of Nutella in and repeat this pattern until you reach the top of the glass.",
          "description":""
        },
        {
          "headline":"Once you've reached the top sprinkle with cookie crumbs.",
          "description":""
        }
      ]
    },
    {
      "name":"Strawberry Surprise",
      "steps":[
        {
          "headline":"Layer strawberry and vanilla ice cream in a glass.",
          "description":""
        },
        {
          "headline":"Sprinkle with chopped strawberries.",
          "description":""
        },
        {
          "headline":"Drizzle with strawberry sauce.",
          "description":""
        },
        {
          "headline":"Sprinkle cookie crumbs on top.",
          "description":""
        },
        {
          "headline":"Put a strawberry on the side of the glass.",
          "description":""
        }
      ]
    },
    {
      "name":"Tropical Tango",
      "steps":[
        {
          "headline":"Drizzle a layer of passion fruit sundae sauce on the bottom of your glass.",
          "description":""
        },
        {
          "headline":"Chop up mango and pineapple pieces and add them to your softened vanilla ice cream.",
          "description":"Mix thoroughly."
        },
        {
          "headline":"Freeze ice cream before scooping two scoops into your glass.",
          "description":""
        },
        {
          "headline":"Top with remaining passion fruit sauce, a swirl of whipped cream, and a handful of walnuts that had been pre-soaked in a honey-and-vegetable-oil mixture and then roasted until crisp.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Marsh Fudge \"Cruncherama\" Sundae Put 2 scoops of vanilla ice cream into a glass.  Mash in marshmallows with a fork.  Mix in some tiny squares of fudge.  Sprinkle in some honeycomb/cookies (known as biscuits in the UK).  Peanut Butter Nuttier Sundae In a bowl mix peanut butter with vanilla ice cream.  Put 1 scoop of this mixture into a glass.  Put a spoonful of Nutella on top.  Put another scoop of the peanut butter ice cream on top.  Put a spoonful of Nutella in and repeat this pattern until you reach the top of the glass.  Once you've reached the top sprinkle with cookie crumbs.  Strawberry Surprise Layer strawberry and vanilla ice cream in a glass.  Sprinkle with chopped strawberries.  Drizzle with strawberry sauce.  Sprinkle cookie crumbs on top.  Put a strawberry on the side of the glass.  Tropical Tango Drizzle a layer of passion fruit sundae sauce on the bottom of your glass.  Chop up mango and pineapple pieces and add them to your softened vanilla ice cream. Mix thoroughly. Freeze ice cream before scooping two scoops into your glass.  Top with remaining passion fruit sauce, a swirl of whipped cream, and a handful of walnuts that had been pre-soaked in a honey-and-vegetable-oil mixture and then roasted until crisp.  Finished. ",
  "tyn_model":[
    "glass",
    "vanilla ice cream",
    "nutella",
    "marsh fudge \"cruncherama",
    "marshmallows",
    "fork",
    "fudge",
    "honeycomb/cookies",
    "peanut butter nuttier",
    "bowl",
    "peanut butter",
    "peanut butter ice cream",
    "cookie crumbs",
    "strawberry and vanilla ice cream",
    "strawberries",
    "strawberry sauce",
    "strawberry",
    "passion fruit sundae sauce",
    "pineapple",
    "ice cream",
    "passion fruit sauce",
    "whipped cream",
    "walnuts",
    "honey",
    "vegetable-oil"
  ],
  "tyn_section":[

  ]
}