{
  "title":"How to Draw a Luma",
  "url":"https://www.wikihow.com/Draw-a-Luma",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Games Drawing"
  ],
  "steps":[
    {
      "headline":"Draw a raindrop shape.",
      "description":"You could also think of this as an oval with a pointed top."
    },
    {
      "headline":"Near the bottom, where the raindrop is almost at it's thickest, imagine continuing the line before it starts curving.",
      "description":"Draw this about half the length of the body."
    },
    {
      "headline":"Draw a line back up to the middle of the raindrop.",
      "description":""
    },
    {
      "headline":"Repeat steps 2 and 3 on the other side for the legs.",
      "description":""
    },
    {
      "headline":"At the top where there is a point, continue the line up a tiny bit, then curve the line toward the right so it is almost flat.",
      "description":""
    },
    {
      "headline":"After about 1 centimeter (0.4 in), or so it matches the size of the body, make a sharp corner and curve back toward the body.",
      "description":""
    },
    {
      "headline":"On both sides of the body, draw something like a capital A without a line sideways from the body.",
      "description":""
    },
    {
      "headline":"Round out the sides but keep the points straight.",
      "description":"These are the arms."
    },
    {
      "headline":"Draw 2 long and skinny ovals almost touching inside the raindrop.",
      "description":""
    },
    {
      "headline":"Draw 1 circle on top and 1 circle on the bottom inside each oval.",
      "description":""
    },
    {
      "headline":"Shade in the rest of the ovals for the eyes.",
      "description":""
    },
    {
      "headline":"Erase all the extra lines except for between the arms and the body (the little bit at the top where it curves and near the legs).",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Draw a raindrop shape. You could also think of this as an oval with a pointed top. Near the bottom, where the raindrop is almost at it's thickest, imagine continuing the line before it starts curving. Draw this about half the length of the body. Draw a line back up to the middle of the raindrop.  Repeat steps 2 and 3 on the other side for the legs.  At the top where there is a point, continue the line up a tiny bit, then curve the line toward the right so it is almost flat.  After about 1 centimeter (0.4 in), or so it matches the size of the body, make a sharp corner and curve back toward the body.  On both sides of the body, draw something like a capital A without a line sideways from the body.  Round out the sides but keep the points straight. These are the arms. Draw 2 long and skinny ovals almost touching inside the raindrop.  Draw 1 circle on top and 1 circle on the bottom inside each oval.  Shade in the rest of the ovals for the eyes.  Erase all the extra lines except for between the arms and the body (the little bit at the top where it curves and near the legs).  Finished. ",
  "tyn_model":[

  ],
  "tyn_section":[

  ]
}