{
  "title":"How to Make Stuffed Brinjals in Nellore Style",
  "url":"https://www.wikihow.com/Make-Stuffed-Brinjals-in-Nellore-Style",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian"
  ],
  "steps":[
    {
      "headline":"Cut and wash the brinjals under the running water.",
      "description":""
    },
    {
      "headline":"Slit the brinjals with the help of a knife as shown in the photographs.",
      "description":""
    },
    {
      "headline":"Take a frying pan and add dry pieces of coconut, garlic, cumin seeds, coriander seeds, red chillies,fenugreek seeds,bay leaves and yellow lentils.",
      "description":""
    },
    {
      "headline":"Add half-teaspoon of oil into it.",
      "description":""
    },
    {
      "headline":"Fry all of them together till one might get a strong flavor of the spices.Pour all of them in a bowl and let it cool for some time.",
      "description":""
    },
    {
      "headline":"Chop onions into small and fine pieces.",
      "description":""
    },
    {
      "headline":"Grind the roasted spices and transfer the powder in a bowl.",
      "description":""
    },
    {
      "headline":"Add fine pieces of onions into it and mix them well with the help of a spoon.",
      "description":""
    },
    {
      "headline":"Extract lemon juice and add to the above mixture.Add salt also.",
      "description":"Mix them well."
    },
    {
      "headline":"Add oil in a wok and deep fry the split brinjals.",
      "description":""
    },
    {
      "headline":"Take one fried brinjal and hold it between the fingers.",
      "description":""
    },
    {
      "headline":"Place the grinded mixture between the four splits of brinjal.",
      "description":""
    },
    {
      "headline":"Slightly press the brinjal with the fingers.",
      "description":""
    },
    {
      "headline":"Take a pressure cooker and place the stuffed brinjals one by one.",
      "description":""
    },
    {
      "headline":"Sprinkle the remaining paste over the brinjals.",
      "description":""
    },
    {
      "headline":"Cover the pressure cooker with the lid and cook for 10 minutes without placing the whistle over it.",
      "description":""
    },
    {
      "headline":"Serve it with rice.",
      "description":""
    }
  ],
  "text":" Cut and wash the brinjals under the running water.  Slit the brinjals with the help of a knife as shown in the photographs.  Take a frying pan and add dry pieces of coconut, garlic, cumin seeds, coriander seeds, red chillies,fenugreek seeds,bay leaves and yellow lentils.  Add half-teaspoon of oil into it.  Fry all of them together till one might get a strong flavor of the spices.Pour all of them in a bowl and let it cool for some time.  Chop onions into small and fine pieces.  Grind the roasted spices and transfer the powder in a bowl.  Add fine pieces of onions into it and mix them well with the help of a spoon.  Extract lemon juice and add to the above mixture.Add salt also. Mix them well. Add oil in a wok and deep fry the split brinjals.  Take one fried brinjal and hold it between the fingers.  Place the grinded mixture between the four splits of brinjal.  Slightly press the brinjal with the fingers.  Take a pressure cooker and place the stuffed brinjals one by one.  Sprinkle the remaining paste over the brinjals.  Cover the pressure cooker with the lid and cook for 10 minutes without placing the whistle over it.  Serve it with rice. ",
  "tyn_model":[
    "oil",
    "bowl",
    "onions",
    "pressure cooker",
    "water",
    "knife",
    "frying pan",
    "coconut",
    "garlic",
    "cumin seeds",
    "coriander",
    "red chillies",
    "fenugreek seeds",
    "yellow lentils",
    "spices",
    "spoon",
    "lemon juice",
    "salt",
    "wok",
    "rice"
  ],
  "tyn_section":[

  ]
}