{
  "title":"How to Make Seed Bead Bracelets in a Unique Beading Method",
  "url":"https://www.wikihow.com/Make-Seed-Bead-Bracelets-in-a-Unique-Beading-Method",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Beading"
  ],
  "parts":[
    {
      "name":"Making the First \"Bloom\" Layer",
      "steps":[
        {
          "headline":"Start by making the first \"bloom.\"",
          "description":"Break the tube bead into two 10mm long sections. Cut a 100mm long nylon wire and then unravel it. Start adding on the beads: one colored glass seed bead at the center, then on each wire end, add one tube bead and one colored glass seed bead. Add one clear glass bead on each. Add one colored glass seed bead to the end, so that both ends of the wire are crossed through the bead. Add another clear glass bead on each end. After tightening the wire, you will see a “bloom” pattern."
        },
        {
          "headline":"Add the following beads on each wire in order: one colored glass seed bead, one tube bead.",
          "description":""
        },
        {
          "headline":"Repeat the process for another bloom in the seed bead bracelet.",
          "description":""
        },
        {
          "headline":"Cross each wire end through one colored glass seed bead at the end.",
          "description":"You should have a fairly symmetrical shape, with two blooms in the middle and tapered ends where two tube beads culminate in a small colored bead at the end."
        }
      ]
    },
    {
      "name":"Making the Rest of the Band",
      "steps":[
        {
          "headline":"Add one colored glass seed bead to each of the two wire ends.",
          "description":"Then cross both ends together through another bead. Just repeat the actions until you get the ideal length."
        },
        {
          "headline":"Close the loop.",
          "description":"To do this, pull one end of the wire towards the starting seed bead. Then add one more colored seed bead on the bottom wire and string it through the starting bead as well. Cross pass one seed bead with both ends of the wire, as shown in the image."
        }
      ]
    },
    {
      "name":"Adding the Second Layer",
      "steps":[
        {
          "headline":"Repeat the bloom-making process.",
          "description":"The beading methods are almost as similar as above, but the difference is that you should share the inner seed beads and tube beads to assemble the two layers together."
        },
        {
          "headline":"Build the bracelet so that you have two blooms next to each other.",
          "description":"Refer to the image and the directions in section 1."
        },
        {
          "headline":"Complete the center blooms.",
          "description":"At this stage, you'll be finishing off the bracelet with two blooms in the center, between the existing four. Cut out another section nylon wire of 100mm. Share the tube bead and then group the 4 glass beads and seed beads as “bloom” like you did in the above steps. After that, tie a knot at last and the whole seed bead bracelet making project is done!"
        }
      ]
    }
  ],
  "text":" Making the First \"Bloom\" Layer Start by making the first \"bloom.\" Break the tube bead into two 10mm long sections. Cut a 100mm long nylon wire and then unravel it. Start adding on the beads: one colored glass seed bead at the center, then on each wire end, add one tube bead and one colored glass seed bead. Add one clear glass bead on each. Add one colored glass seed bead to the end, so that both ends of the wire are crossed through the bead. Add another clear glass bead on each end. After tightening the wire, you will see a “bloom” pattern. Add the following beads on each wire in order: one colored glass seed bead, one tube bead.  Repeat the process for another bloom in the seed bead bracelet.  Cross each wire end through one colored glass seed bead at the end. You should have a fairly symmetrical shape, with two blooms in the middle and tapered ends where two tube beads culminate in a small colored bead at the end. Making the Rest of the Band Add one colored glass seed bead to each of the two wire ends. Then cross both ends together through another bead. Just repeat the actions until you get the ideal length. Close the loop. To do this, pull one end of the wire towards the starting seed bead. Then add one more colored seed bead on the bottom wire and string it through the starting bead as well. Cross pass one seed bead with both ends of the wire, as shown in the image. Adding the Second Layer Repeat the bloom-making process. The beading methods are almost as similar as above, but the difference is that you should share the inner seed beads and tube beads to assemble the two layers together. Build the bracelet so that you have two blooms next to each other. Refer to the image and the directions in section 1. Complete the center blooms. At this stage, you'll be finishing off the bracelet with two blooms in the center, between the existing four. Cut out another section nylon wire of 100mm. Share the tube bead and then group the 4 glass beads and seed beads as “bloom” like you did in the above steps. After that, tie a knot at last and the whole seed bead bracelet making project is done!",
  "tyn_model":[
    "wire",
    "colored glass seed",
    "nylon wire",
    "clear glass",
    "“bloom",
    "” pattern",
    "seed bead",
    "colored seed bead",
    "tube beads",
    "bracelet",
    "” like",
    "seed bead bracelet"
  ],
  "tyn_section":[

  ]
}