{
  "title":"How to Make Vanilla Slice",
  "url":"https://www.wikihow.com/Make-Vanilla-Slice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Bars and Slices"
  ],
  "steps":[
    {
      "headline":"Preheat your oven to 400 degrees F (or 200 degrees C).",
      "description":""
    },
    {
      "headline":"Make sure the pastry sheets are thawed; as this would make your job easier, and they won't break.",
      "description":"Unfold them and place them flat on your baking sheets."
    },
    {
      "headline":"Place the baking sheets in the oven for about 10 to 15 minutes.",
      "description":"You'll want to see more of a lightly browned color as a result. Remove from the oven and place it on the side for later use."
    },
    {
      "headline":"Get a large saucepan and mix the cornstarch, sugar, and custard powder.",
      "description":"Add a little milk at a time, so that it forms a pasty look. Then, pour the remaining milk in, and the butter. Turn the heat on to a medium heat and stir, with a whisk, on occasion until you get a thick mixture. Wait until you get a simmer and cook for two more minutes."
    },
    {
      "headline":"Turn the heat off and add the vanilla and egg yolks.",
      "description":""
    },
    {
      "headline":"Cover a 9-inch baking dish with foil.",
      "description":"Get and lay one of the pastry sheets on the baking dish. Pour the custard mixture onto the pastry sheet and spread it out evenly in the dish. Carefully lay the other pastry sheet on top of the custard mixture."
    },
    {
      "headline":"Combine and mix the tablespoon of milk, dash of vanilla, and confectioners' sugar,in a small bowl.",
      "description":"This will be your icing. With a knife, spread the icing on top of the second pastry sheet."
    },
    {
      "headline":"Place the baking dish in the refrigerator until the custard is firm.",
      "description":"Carefully remove the dessert from the pan and serve."
    }
  ],
  "text":" Preheat your oven to 400 degrees F (or 200 degrees C).  Make sure the pastry sheets are thawed; as this would make your job easier, and they won't break. Unfold them and place them flat on your baking sheets. Place the baking sheets in the oven for about 10 to 15 minutes. You'll want to see more of a lightly browned color as a result. Remove from the oven and place it on the side for later use. Get a large saucepan and mix the cornstarch, sugar, and custard powder. Add a little milk at a time, so that it forms a pasty look. Then, pour the remaining milk in, and the butter. Turn the heat on to a medium heat and stir, with a whisk, on occasion until you get a thick mixture. Wait until you get a simmer and cook for two more minutes. Turn the heat off and add the vanilla and egg yolks.  Cover a 9-inch baking dish with foil. Get and lay one of the pastry sheets on the baking dish. Pour the custard mixture onto the pastry sheet and spread it out evenly in the dish. Carefully lay the other pastry sheet on top of the custard mixture. Combine and mix the tablespoon of milk, dash of vanilla, and confectioners' sugar,in a small bowl. This will be your icing. With a knife, spread the icing on top of the second pastry sheet. Place the baking dish in the refrigerator until the custard is firm. Carefully remove the dessert from the pan and serve.",
  "tyn_model":[
    "oven",
    "milk",
    "baking dish",
    "pastry sheets",
    "baking sheets",
    "vanilla",
    "saucepan",
    "cornstarch",
    "sugar",
    "custard powder",
    "butter",
    "whisk",
    "egg yolks",
    "foil",
    "pastry sheet",
    "confectioners' sugar",
    "bowl",
    "icing",
    "knife"
  ],
  "tyn_section":[

  ]
}