{
  "title":"How to Roast Zucchini",
  "url":"https://www.wikihow.com/Roast-Zucchini",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Squash"
  ],
  "methods":[
    {
      "name":"Simple Roasted Zucchini",
      "steps":[
        {
          "headline":"Preheat the oven to 450 degrees.",
          "description":"Roasting zucchini at a high temperature will cause the flesh to caramelize and turn golden brown, making the dish especially flavorful."
        },
        {
          "headline":"Wash the zucchini.",
          "description":"Rinse away any dirt and debris that may be left on the skin. Use a scrubber if necessary to make sure it is entirely clean."
        },
        {
          "headline":"Cut the zucchini.",
          "description":"Place a zucchini on a cutting board and use a sharp knife to cut it lengthwise. Turn the zucchini halves and use the knife to cut the halves into 1-inch pieces. Repeat with the remaining zucchinis. When roasting zucchini, it's not necessary to peel away the green skin. The skin will soften as the vegetable roasts, so there's no reason to discard it. If you wish, you can roast entire zucchini halves, or cut them into long strips like dill pickles. Cut them into whatever shape you like."
        },
        {
          "headline":"Mix the seasonings.",
          "description":"Place the Italian seasoning, pepper, and salt in a bowl and mix them all together."
        },
        {
          "headline":"Toss the zucchini in olive oil.",
          "description":"Place it in a bowl and pour the olive oil over it, then use tongs to toss the mixture until the zucchini is entirely coated."
        },
        {
          "headline":"Season the zucchini.",
          "description":"Add the garlic to the bowl. Pour the seasoning mix over the zucchini, then toss again to coat the pieces in spices."
        },
        {
          "headline":"Spread the zucchini on a baking sheet.",
          "description":"Make sure the pieces aren't overlapping - they should be in one single layer so they cook evenly."
        },
        {
          "headline":"Bake the zucchini.",
          "description":"Bake for 7 minutes, then open the oven and turn the pieces over. Bake for another 7 minutes, or until the zucchini are golden brown."
        }
      ]
    },
    {
      "name":"Cheesy Roasted Zucchini",
      "steps":[
        {
          "headline":"Preheat the oven to 450 degrees.",
          "description":""
        },
        {
          "headline":"Wash the zucchini.",
          "description":"Rinse away any dirt and debris that may be left on the skin, using a scrubber if necessary to make sure it is entirely clean."
        },
        {
          "headline":"Cut the zucchini.",
          "description":"Place a zucchini on a cutting board and use a sharp knife to cut it lengthwise. Repeat with the remaining zucchinis."
        },
        {
          "headline":"Spread the zucchini halves on a baking sheet.",
          "description":"Arrange them all flesh-side up."
        },
        {
          "headline":"Brush the zucchini halves with olive oil.",
          "description":"Make sure each one gets an even coat."
        },
        {
          "headline":"Season the zucchini with salt and pepper.",
          "description":"Put a light sprinkling of each on all the zucchini halves."
        },
        {
          "headline":"Distribute the Parmesan among the halves.",
          "description":"Put an even amount on top of each of the zucchini halves. If you need more Parmesan, feel free to add it - it won't affect the outcome of the dish."
        },
        {
          "headline":"Roast the zucchini.",
          "description":"Place the baking sheet in the oven and bake the zucchini for 10 minutes, or until the Parmesan has turned bubbly and golden brown. Remove the baking sheet from the oven."
        },
        {
          "headline":"Serve with basil.",
          "description":"Place the ribboned basil on top of the zucchini halves to serve. This is great as either a side dish or a light main course."
        }
      ]
    },
    {
      "name":"Crunchy Breaded Zucchini",
      "steps":[
        {
          "headline":"Preheat the oven to 450 degrees.",
          "description":""
        },
        {
          "headline":"Wash the zucchini.",
          "description":"Rinse away any dirt and debris that may be left on the skin, using a scrubber if necessary to make sure it is entirely clean."
        },
        {
          "headline":"Cut the zucchini.",
          "description":"Place a zucchini on a cutting board and use a sharp knife to cut it into discs that are each about 1–2 inch (2.5–5.1 cm) wide. Discard the two ends of each zucchini."
        },
        {
          "headline":"Salt the zucchini.",
          "description":"Because they have such high moisture content, it's a good idea to salt the zucchini rounds to draw out some of the moisture. This will keep the final dish nice and crunchy. Lay the zucchini rounds onto a plate lined with paper towels. Sprinkle them with salt. Let them sit for 10 minutes. Use a paper towel to wipe the moisture from each piece."
        },
        {
          "headline":"Set up the breading station.",
          "description":"Beat the egg and have it ready in a shallow bowl. Melt the butter and mix it with the bread crumbs into a separate bowl. Have your baking sheet ready nearby, so you can transfer the breaded rounds directly to it."
        },
        {
          "headline":"Bread the zucchini.",
          "description":"Slice by slice, dip the zucchini pieces first in the beaten egg, then in the bread crumb bowl. Each side of the slices should be well coated in bread crumbs. Place the coated pieces in a single layer in the baking dish."
        },
        {
          "headline":"Bake the zucchini.",
          "description":"Place the baking dish in the oven and bake the zucchini for 20 minutes, or until the breading is deep golden brown. Remove the dish from the oven."
        },
        {
          "headline":"Serve the crunchy zucchini rounds.",
          "description":"They're delicious with  marinara sauce or balsamic vinegar and olive oil."
        }
      ]
    }
  ],
  "text":" Simple Roasted Zucchini Preheat the oven to 450 degrees. Roasting zucchini at a high temperature will cause the flesh to caramelize and turn golden brown, making the dish especially flavorful. Wash the zucchini. Rinse away any dirt and debris that may be left on the skin. Use a scrubber if necessary to make sure it is entirely clean. Cut the zucchini. Place a zucchini on a cutting board and use a sharp knife to cut it lengthwise. Turn the zucchini halves and use the knife to cut the halves into 1-inch pieces. Repeat with the remaining zucchinis. When roasting zucchini, it's not necessary to peel away the green skin. The skin will soften as the vegetable roasts, so there's no reason to discard it. If you wish, you can roast entire zucchini halves, or cut them into long strips like dill pickles. Cut them into whatever shape you like. Mix the seasonings. Place the Italian seasoning, pepper, and salt in a bowl and mix them all together. Toss the zucchini in olive oil. Place it in a bowl and pour the olive oil over it, then use tongs to toss the mixture until the zucchini is entirely coated. Season the zucchini. Add the garlic to the bowl. Pour the seasoning mix over the zucchini, then toss again to coat the pieces in spices. Spread the zucchini on a baking sheet. Make sure the pieces aren't overlapping - they should be in one single layer so they cook evenly. Bake the zucchini. Bake for 7 minutes, then open the oven and turn the pieces over. Bake for another 7 minutes, or until the zucchini are golden brown. Cheesy Roasted Zucchini Preheat the oven to 450 degrees.  Wash the zucchini. Rinse away any dirt and debris that may be left on the skin, using a scrubber if necessary to make sure it is entirely clean. Cut the zucchini. Place a zucchini on a cutting board and use a sharp knife to cut it lengthwise. Repeat with the remaining zucchinis. Spread the zucchini halves on a baking sheet. Arrange them all flesh-side up. Brush the zucchini halves with olive oil. Make sure each one gets an even coat. Season the zucchini with salt and pepper. Put a light sprinkling of each on all the zucchini halves. Distribute the Parmesan among the halves. Put an even amount on top of each of the zucchini halves. If you need more Parmesan, feel free to add it - it won't affect the outcome of the dish. Roast the zucchini. Place the baking sheet in the oven and bake the zucchini for 10 minutes, or until the Parmesan has turned bubbly and golden brown. Remove the baking sheet from the oven. Serve with basil. Place the ribboned basil on top of the zucchini halves to serve. This is great as either a side dish or a light main course. Crunchy Breaded Zucchini Preheat the oven to 450 degrees.  Wash the zucchini. Rinse away any dirt and debris that may be left on the skin, using a scrubber if necessary to make sure it is entirely clean. Cut the zucchini. Place a zucchini on a cutting board and use a sharp knife to cut it into discs that are each about 1–2 inch (2.5–5.1 cm) wide. Discard the two ends of each zucchini. Salt the zucchini. Because they have such high moisture content, it's a good idea to salt the zucchini rounds to draw out some of the moisture. This will keep the final dish nice and crunchy. Lay the zucchini rounds onto a plate lined with paper towels. Sprinkle them with salt. Let them sit for 10 minutes. Use a paper towel to wipe the moisture from each piece. Set up the breading station. Beat the egg and have it ready in a shallow bowl. Melt the butter and mix it with the bread crumbs into a separate bowl. Have your baking sheet ready nearby, so you can transfer the breaded rounds directly to it. Bread the zucchini. Slice by slice, dip the zucchini pieces first in the beaten egg, then in the bread crumb bowl. Each side of the slices should be well coated in bread crumbs. Place the coated pieces in a single layer in the baking dish. Bake the zucchini. Place the baking dish in the oven and bake the zucchini for 20 minutes, or until the breading is deep golden brown. Remove the dish from the oven. Serve the crunchy zucchini rounds. They're delicious with  marinara sauce or balsamic vinegar and olive oil.",
  "tyn_model":[
    "zucchini",
    "oven",
    "baking sheet",
    "salt",
    "olive oil",
    "scrubber",
    "bowl",
    "parmesan",
    "knife",
    "basil",
    "bread crumbs",
    "baking dish",
    "vegetable",
    "dill pickles",
    "seasonings",
    "italian seasoning",
    "pepper",
    "garlic",
    "seasoning mix",
    "spices",
    "salt and pepper",
    "sharp knife",
    "plate",
    "paper towels",
    "paper towel",
    "butter",
    "egg",
    "bread crumb bowl",
    "marinara sauce",
    "balsamic vinegar"
  ],
  "tyn_section":[

  ]
}