{
  "title":"How to Reset a PS3",
  "url":"https://www.wikihow.com/Reset-a-PS3",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation 3"
  ],
  "methods":[
    {
      "name":"Resetting a Frozen PS3",
      "steps":[
        {
          "headline":"Press and hold the Power button on the PS3.",
          "description":"If your PS3 is frozen, you can perform a manual reset. You'll have to do this from the console itself, as your controllers are likely frozen as well."
        },
        {
          "headline":"Hold the Power button for about 30 seconds.",
          "description":"You'll hear three rapid beeps and your PS3 will turn itself off."
        },
        {
          "headline":"Wait a few seconds, then press the Power button to turn it back on.",
          "description":"Don't turn it on using the controller, as it may not detect the PS3."
        },
        {
          "headline":"Allow the system to check for errors.",
          "description":"Your PS3 will likely attempt to check for errors on the disk. This may take a while, or it may complete in just a few moments."
        }
      ]
    },
    {
      "name":"Resetting Video Output Settings",
      "steps":[
        {
          "headline":"Ensure that the PS3 is turned off.",
          "description":"The power light on the front should be red. If you are switching TVs or changing HDMI cables, you may have to perform this reset if nothing is appearing on the screen when you turn the PS3 on."
        },
        {
          "headline":"Unplug both the PS3 and the TV from their wall power sources.",
          "description":""
        },
        {
          "headline":"Ensure that the PS3 is connected to the TV using an HDMI cable.",
          "description":""
        },
        {
          "headline":"Plug both the PS3 and the TV back into their power sockets.",
          "description":""
        },
        {
          "headline":"Turn the TV to the correct HDMI input.",
          "description":""
        },
        {
          "headline":"Press and hold the PS3 power button until you hear the second beep.",
          "description":"This will take about five seconds."
        },
        {
          "headline":"Use the PS3 controller to finish setting up the HDMI image.",
          "description":"You may have to press the PS button on the controller to turn it on first."
        },
        {
          "headline":"Navigate to \"Settings\" → \"Display Settings\".",
          "description":"You can set the correct resolution from here."
        }
      ]
    },
    {
      "name":"Starting Safe Mode",
      "steps":[
        {
          "headline":"Know why you would use Safe Mode.",
          "description":"The PS3's Safe Mode allows you to access some diagnostic and repair tools that can fix a system that is freezing often or experiencing glitches. You can use Safe Mode to rebuild the file system or factory reset the PS3."
        },
        {
          "headline":"Backup your saved game files.",
          "description":"Before trying any repair work on the PS3 file system, it is always recommended to backup your save data in case something goes wrong. You can backup data to any USB drive, and most game saves range between 5-20 MB in size. Insert the USB drive into your PS3. Open the Game menu and select \"Saved Data Utility\". Navigate to the first game you want to backup. Press △ and select \"Copy\". Choose your USB drive and copy the file. Repeat for all the game saves you want to backup."
        },
        {
          "headline":"Turn off your PS3.",
          "description":"To enter Safe Mode, you'll need to turn your PS3 off first."
        },
        {
          "headline":"Press and hold the Power button.",
          "description":"You will hear the first beep."
        },
        {
          "headline":"Continue to hold the button until you hear a second, and then a third beep.",
          "description":"The system will power back off and the light will turn red."
        },
        {
          "headline":"Press and hold the Power button again.",
          "description":"You will hear the first and second beep as before."
        },
        {
          "headline":"Continue holding the Power button until you hear a rapid double beep.",
          "description":"Release the Power button. You will see the message \"Connect the controller using USB and then press the PS button\"."
        },
        {
          "headline":"Connect a controller and turn it on.",
          "description":"You can't use wireless controllers in Safe Mode."
        },
        {
          "headline":"Use Safe Mode to reset your PS3.",
          "description":"There are several options you can pick from that can help fix the problems your PS3 is experiencing. Try these in order to see if anything can fix it. If the fix doesn't help, move on to the next one. Restore File System - This will attempt to fix damaged files on the hard drive. Rebuild Database - This will attempt to fix the database information on your hard drive. It will delete messages and notifications, as well as delete any folders you have created. No files should be deleted. Restore PS3 System - This will restore the PS3 to its factory settings, and everything on the hard drive will be deleted. Make sure you have everything you want saved backed up before proceeding with this fix."
        }
      ]
    }
  ],
  "text":" Resetting a Frozen PS3 Press and hold the Power button on the PS3. If your PS3 is frozen, you can perform a manual reset. You'll have to do this from the console itself, as your controllers are likely frozen as well. Hold the Power button for about 30 seconds. You'll hear three rapid beeps and your PS3 will turn itself off. Wait a few seconds, then press the Power button to turn it back on. Don't turn it on using the controller, as it may not detect the PS3. Allow the system to check for errors. Your PS3 will likely attempt to check for errors on the disk. This may take a while, or it may complete in just a few moments. Resetting Video Output Settings Ensure that the PS3 is turned off. The power light on the front should be red. If you are switching TVs or changing HDMI cables, you may have to perform this reset if nothing is appearing on the screen when you turn the PS3 on. Unplug both the PS3 and the TV from their wall power sources.  Ensure that the PS3 is connected to the TV using an HDMI cable.  Plug both the PS3 and the TV back into their power sockets.  Turn the TV to the correct HDMI input.  Press and hold the PS3 power button until you hear the second beep. This will take about five seconds. Use the PS3 controller to finish setting up the HDMI image. You may have to press the PS button on the controller to turn it on first. Navigate to \"Settings\" → \"Display Settings\". You can set the correct resolution from here. Starting Safe Mode Know why you would use Safe Mode. The PS3's Safe Mode allows you to access some diagnostic and repair tools that can fix a system that is freezing often or experiencing glitches. You can use Safe Mode to rebuild the file system or factory reset the PS3. Backup your saved game files. Before trying any repair work on the PS3 file system, it is always recommended to backup your save data in case something goes wrong. You can backup data to any USB drive, and most game saves range between 5-20 MB in size. Insert the USB drive into your PS3. Open the Game menu and select \"Saved Data Utility\". Navigate to the first game you want to backup. Press △ and select \"Copy\". Choose your USB drive and copy the file. Repeat for all the game saves you want to backup. Turn off your PS3. To enter Safe Mode, you'll need to turn your PS3 off first. Press and hold the Power button. You will hear the first beep. Continue to hold the button until you hear a second, and then a third beep. The system will power back off and the light will turn red. Press and hold the Power button again. You will hear the first and second beep as before. Continue holding the Power button until you hear a rapid double beep. Release the Power button. You will see the message \"Connect the controller using USB and then press the PS button\". Connect a controller and turn it on. You can't use wireless controllers in Safe Mode. Use Safe Mode to reset your PS3. There are several options you can pick from that can help fix the problems your PS3 is experiencing. Try these in order to see if anything can fix it. If the fix doesn't help, move on to the next one. Restore File System - This will attempt to fix damaged files on the hard drive. Rebuild Database - This will attempt to fix the database information on your hard drive. It will delete messages and notifications, as well as delete any folders you have created. No files should be deleted. Restore PS3 System - This will restore the PS3 to its factory settings, and everything on the hard drive will be deleted. Make sure you have everything you want saved backed up before proceeding with this fix.",
  "tyn_model":[
    "ps3",
    "tv",
    "usb drive",
    "tvs",
    "ps3 controller",
    "hdmi",
    "→ \"",
    "△ and",
    "usb",
    "controller"
  ],
  "tyn_section":[

  ]
}