{
  "title":"How to Make Lemon Syrup",
  "url":"https://www.wikihow.com/Make-Lemon-Syrup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Syrups"
  ],
  "methods":[
    {
      "name":"Dozen Lemons Method",
      "steps":[
        {
          "headline":"Create the lemon juice.",
          "description":"Leave to stand overnight."
        },
        {
          "headline":"Make a thick syrup from the sugar with water, simmered over low heat.",
          "description":"Stir constantly."
        },
        {
          "headline":"Remove from the heat once thickened and allow to cool.",
          "description":""
        },
        {
          "headline":"Strain the lemon juice into the cooled, thickened syrup",
          "description":""
        },
        {
          "headline":"Squeeze as much oil from the grated rind as will suit the taste.",
          "description":""
        },
        {
          "headline":"Put in bottles, securely sealed, for future use.",
          "description":""
        }
      ]
    },
    {
      "name":"Tartaric Acid Method",
      "steps":[
        {
          "headline":"Peel the lemons.",
          "description":""
        },
        {
          "headline":"Put the peel into a bowl with the pips and lemon juice.",
          "description":""
        },
        {
          "headline":"Add the sugar and pour over the boiling water.",
          "description":""
        },
        {
          "headline":"Leave to infuse as it cools.",
          "description":""
        },
        {
          "headline":"Strain the mixture once cool and add the tartaric acid.",
          "description":"Stir together well."
        },
        {
          "headline":"Pour into bottles.",
          "description":"This method will result in about 3 average bottles."
        }
      ]
    }
  ],
  "text":" Dozen Lemons Method Create the lemon juice. Leave to stand overnight. Make a thick syrup from the sugar with water, simmered over low heat. Stir constantly. Remove from the heat once thickened and allow to cool.  Strain the lemon juice into the cooled, thickened syrup  Squeeze as much oil from the grated rind as will suit the taste.  Put in bottles, securely sealed, for future use.  Tartaric Acid Method Peel the lemons.  Put the peel into a bowl with the pips and lemon juice.  Add the sugar and pour over the boiling water.  Leave to infuse as it cools.  Strain the mixture once cool and add the tartaric acid. Stir together well. Pour into bottles. This method will result in about 3 average bottles.",
  "tyn_model":[
    "lemon",
    "sugar",
    "water",
    "tartaric acid",
    "oil",
    "lemons",
    "bowl",
    "lemon juice"
  ],
  "tyn_section":[

  ]
}