{
  "title":"How to Make Haleem (Minced Meat)",
  "url":"https://www.wikihow.com/Make-Haleem-(Minced-Meat)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Middle Eastern Cuisine"
  ],
  "steps":[
    {
      "headline":"In a heavy-bottomed, high-sided skillet, bring 8 cups water to a boil.",
      "description":"Once a steady boil has been reached, add wheat, mutton, and drained dal, stirring to disperse. Stir in ginger garlic paste, coriander, turmeric, red chile powder, and salt to taste. Reduce heat to low to achieve a steady simmer. Stir occasionally to prevent a film from forming on the top. If too much liquid evaporates, add ¼ c (25 g) water to the pot."
    },
    {
      "headline":"Simmer until mutton is very tender.",
      "description":"(This could take a while, so be patient.) When the meat practically falls apart, remove from heat and set skillet onto a sturdy trivet or something that is heatproof. Mash stew into a meaty paste. A potato masher works just fine for this part, though a fork or meat tenderizer would also do. (Some people use a food processor for this step!)"
    },
    {
      "headline":"Add crushed fried onion and mix well.",
      "description":"Slowly stir over low heat till the mixture pulls away from the sides of the pot. Then heat ghee and pour the contents over the haleem. Sprinkle lemon juice over before serving haleem – which should still be hot!"
    }
  ],
  "text":" In a heavy-bottomed, high-sided skillet, bring 8 cups water to a boil. Once a steady boil has been reached, add wheat, mutton, and drained dal, stirring to disperse. Stir in ginger garlic paste, coriander, turmeric, red chile powder, and salt to taste. Reduce heat to low to achieve a steady simmer. Stir occasionally to prevent a film from forming on the top. If too much liquid evaporates, add ¼ c (25 g) water to the pot. Simmer until mutton is very tender. (This could take a while, so be patient.) When the meat practically falls apart, remove from heat and set skillet onto a sturdy trivet or something that is heatproof. Mash stew into a meaty paste. A potato masher works just fine for this part, though a fork or meat tenderizer would also do. (Some people use a food processor for this step!) Add crushed fried onion and mix well. Slowly stir over low heat till the mixture pulls away from the sides of the pot. Then heat ghee and pour the contents over the haleem. Sprinkle lemon juice over before serving haleem – which should still be hot!",
  "tyn_model":[
    "water",
    "pot",
    "heavy-bottomed, high-sided skillet",
    "wheat",
    "mutton",
    "ginger garlic paste",
    "coriander",
    "turmeric",
    "red chile powder",
    "salt",
    "skillet",
    "potato masher",
    "food processor",
    "onion",
    "ghee",
    "lemon",
    "– which"
  ],
  "tyn_section":[

  ]
}