{
  "title":"How to Use Maple Syrup",
  "url":"https://www.wikihow.com/Use-Maple-Syrup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Syrups"
  ],
  "methods":[
    {
      "name":"Cooking Savory Dishes",
      "steps":[
        {
          "headline":"Make chicken dishes with a sweet twist.",
          "description":"Create a maple-bourbon sauce for a classic chicken fajita dish by combining garlic, ketchup, maple syrup, bourbon, soy sauce, apple cider vinegar, and brown sugar in a saucepan.Add 1/4 cup of vegetable oil to a saucepan over medium heat, and stir in 2 cloves of minced garlic. Cook until the garlic is lightly browned. Whisk in 1/4 cup of ketchup, 1/4 cup of maple syrup, 2 tablespoons (29.6 ml) of bourbon, 1 tablespoon (14.8 ml) of soy sauce, ⁄2 tablespoon (7.4 ml) of apple cider vinegar, and ⁄2 tablespoon (7.4 ml) of brown sugar. Bring the heat to low and simmer the sauce until thickened."
        },
        {
          "headline":"Drizzle maple syrup over roasted vegetables.",
          "description":"A roasted squash dish with sage cream gets a sweet addition with 2 tablespoons (29.6 ml) of maple syrup. Or, make maple-roasted brussels sprouts for a simple vegetable side dish.Season 2.25 pounds (1.02 kg) of baby brussels sprouts with salt and pepper in a large skillet coated with vegetable oil, and cook them over high heat until browned. Add 4 ounces (110 g) of unsalted butter and 2 tablespoons (29.6 ml) of brown sugar, cooking over moderately high heat until the sugar is melted. Add 1/4 cup of Grade A maple syrup, stirring occasionally, and cook for about seven minutes. Stir in 1 ⁄2 tablespoons (22.2 ml) of cider vinegar, and add 6 ounces (170 g) of roasted chestnuts and 1 tablespoon (14.8 ml) of walnut oil. Cook until hot. Transfer the brussels sprouts and chestnuts to a bowl using a slotted spoon. Boil the cooking liquid over high heat for about 2 minutes, and then pour it over the brussels sprouts."
        },
        {
          "headline":"Mix maple syrup into baked beans.",
          "description":"Add 1/2 cup of dark grade maple syrup to beans bathed in Dijon mustard, salt, and pepper sauce. Stir in 1/4 cup more after the mixture bakes for a more pronounced maple flavor."
        },
        {
          "headline":"Make maple-seared scallops.",
          "description":"Cover 16 10/20 scallops with maple syrup in a small bowl, and season them to taste with salt and pepper. Pour vegetable oil into a small pan over high heat, and add the scallops until they're seared on both sides and the maple syrup has caramelized. Reduce the heat to low and add 1 tablespoon (14.8 ml) of unsalted butter, allowing it to cook into the scallops for one minute."
        }
      ]
    },
    {
      "name":"Creating Decadent Desserts",
      "steps":[
        {
          "headline":"Mix maple syrup glazes for cakes, buns, and ice cream.",
          "description":"Try a maple-glazed pumpkin-cranberry coffee cake for a treat that is both sweet and warmly spiced. For a gooier coating, mix powdered sugar, melted butter, an egg white, and maple syrup for use on maple-pecan sticky buns. Add richness to your vanilla ice cream with a simple maple-walnut sauce."
        },
        {
          "headline":"Infuse crispy rice treats with a luscious maple flavor.",
          "description":"Whip together a simple maple-bacon chewy crispy bars recipe by stirring 3 tablespoons (44.4 ml) of maple syrup and 4 slices of cooked and sliced applewood-smoked bacon into 10 ounces (280 g) of melted marshmallows and 2 tablespoons (29.6 ml) of melted butter. Add 6 cups of rice cereal, and toss to combine. Pour the mixture into a 13x9-inch (33x23-cm) pan coated with cooking spray."
        },
        {
          "headline":"Balance tartness and maple sweetness with fruity treats.",
          "description":"Combine maple syrup with mangos and pineapple for a tofu-based tropical pudding.Puree 2 tablespoons of maple syrup, 24 ounces (680 g) of silken tofu, 2 peeled, pitted, and cut mangos, 1/2 teaspoon of vanilla extract, and 1/8 teaspoon of salt in a food processor until the mixture is completely smooth. Transfer it to a large bowl. Chop 1/2 of a large pineapple into 1/8-inch (0.32 cm) pieces, and fold them into the pudding. Cover the mixture and refrigerate for at least 30 minutes. Cook 3/4 cup of unsweetened and shredded coconut over medium heat in a large skillet until golden brown. Remove from skillet and let it cool. Spoon the pudding into bowls and top it with the toasted coconut."
        }
      ]
    },
    {
      "name":"Mixing Tasty Drinks",
      "steps":[
        {
          "headline":"Blend maple syrup into classic cocktail favorites.",
          "description":"Use a dark amber syrup to upgrade an old-fashioned into a rich maple-bourbon smash. Substitute regular simple syrup with maple syrup in a mint julep. Stir maple syrup in with vinegar, tequila, rum, rye, Velvet Falernum, and bitters for a riff on the Sazerac."
        },
        {
          "headline":"Cool off with fruity maple-accented punches and teas.",
          "description":"Brighten up a pear-apple-cranberry punch with two tablespoons of maple syrup. Spice a pitcher of iced tea with maple syrup for a refreshing drink on a hot day.Boil a kettle of water, and pour it into a pitcher with 6 green tea bags, 1 tablespoon (14.8 ml) of powdered star anise, 1/4 cup of maple syrup, and 1 sliced lemon. Pour in 6 cups of hot water and let it brew for 5 minutes, and then chill. Fill another pitcher with ice, and pour the tea over it."
        },
        {
          "headline":"Craft delicious maple milkshakes.",
          "description":"For a flavorful and low-fat maple-peach shake, blend 1 1/4 cups of low-fat milk, 1 cup of low-fat vanilla frozen yogurt, 6 tablespoons (88.7 ml) of Grade B maple syrup, 1 teaspoon of lemon juice, 1/4 teaspoon of salt, and 14 ounces (400 g) of chopped and peeled frozen peaches in a food processor until smooth."
        }
      ]
    }
  ],
  "text":" Cooking Savory Dishes Make chicken dishes with a sweet twist. Create a maple-bourbon sauce for a classic chicken fajita dish by combining garlic, ketchup, maple syrup, bourbon, soy sauce, apple cider vinegar, and brown sugar in a saucepan.Add 1/4 cup of vegetable oil to a saucepan over medium heat, and stir in 2 cloves of minced garlic. Cook until the garlic is lightly browned. Whisk in 1/4 cup of ketchup, 1/4 cup of maple syrup, 2 tablespoons (29.6 ml) of bourbon, 1 tablespoon (14.8 ml) of soy sauce, ⁄2 tablespoon (7.4 ml) of apple cider vinegar, and ⁄2 tablespoon (7.4 ml) of brown sugar. Bring the heat to low and simmer the sauce until thickened. Drizzle maple syrup over roasted vegetables. A roasted squash dish with sage cream gets a sweet addition with 2 tablespoons (29.6 ml) of maple syrup. Or, make maple-roasted brussels sprouts for a simple vegetable side dish.Season 2.25 pounds (1.02 kg) of baby brussels sprouts with salt and pepper in a large skillet coated with vegetable oil, and cook them over high heat until browned. Add 4 ounces (110 g) of unsalted butter and 2 tablespoons (29.6 ml) of brown sugar, cooking over moderately high heat until the sugar is melted. Add 1/4 cup of Grade A maple syrup, stirring occasionally, and cook for about seven minutes. Stir in 1 ⁄2 tablespoons (22.2 ml) of cider vinegar, and add 6 ounces (170 g) of roasted chestnuts and 1 tablespoon (14.8 ml) of walnut oil. Cook until hot. Transfer the brussels sprouts and chestnuts to a bowl using a slotted spoon. Boil the cooking liquid over high heat for about 2 minutes, and then pour it over the brussels sprouts. Mix maple syrup into baked beans. Add 1/2 cup of dark grade maple syrup to beans bathed in Dijon mustard, salt, and pepper sauce. Stir in 1/4 cup more after the mixture bakes for a more pronounced maple flavor. Make maple-seared scallops. Cover 16 10/20 scallops with maple syrup in a small bowl, and season them to taste with salt and pepper. Pour vegetable oil into a small pan over high heat, and add the scallops until they're seared on both sides and the maple syrup has caramelized. Reduce the heat to low and add 1 tablespoon (14.8 ml) of unsalted butter, allowing it to cook into the scallops for one minute. Creating Decadent Desserts Mix maple syrup glazes for cakes, buns, and ice cream. Try a maple-glazed pumpkin-cranberry coffee cake for a treat that is both sweet and warmly spiced. For a gooier coating, mix powdered sugar, melted butter, an egg white, and maple syrup for use on maple-pecan sticky buns. Add richness to your vanilla ice cream with a simple maple-walnut sauce. Infuse crispy rice treats with a luscious maple flavor. Whip together a simple maple-bacon chewy crispy bars recipe by stirring 3 tablespoons (44.4 ml) of maple syrup and 4 slices of cooked and sliced applewood-smoked bacon into 10 ounces (280 g) of melted marshmallows and 2 tablespoons (29.6 ml) of melted butter. Add 6 cups of rice cereal, and toss to combine. Pour the mixture into a 13x9-inch (33x23-cm) pan coated with cooking spray. Balance tartness and maple sweetness with fruity treats. Combine maple syrup with mangos and pineapple for a tofu-based tropical pudding.Puree 2 tablespoons of maple syrup, 24 ounces (680 g) of silken tofu, 2 peeled, pitted, and cut mangos, 1/2 teaspoon of vanilla extract, and 1/8 teaspoon of salt in a food processor until the mixture is completely smooth. Transfer it to a large bowl. Chop 1/2 of a large pineapple into 1/8-inch (0.32 cm) pieces, and fold them into the pudding. Cover the mixture and refrigerate for at least 30 minutes. Cook 3/4 cup of unsweetened and shredded coconut over medium heat in a large skillet until golden brown. Remove from skillet and let it cool. Spoon the pudding into bowls and top it with the toasted coconut. Mixing Tasty Drinks Blend maple syrup into classic cocktail favorites. Use a dark amber syrup to upgrade an old-fashioned into a rich maple-bourbon smash. Substitute regular simple syrup with maple syrup in a mint julep. Stir maple syrup in with vinegar, tequila, rum, rye, Velvet Falernum, and bitters for a riff on the Sazerac. Cool off with fruity maple-accented punches and teas. Brighten up a pear-apple-cranberry punch with two tablespoons of maple syrup. Spice a pitcher of iced tea with maple syrup for a refreshing drink on a hot day.Boil a kettle of water, and pour it into a pitcher with 6 green tea bags, 1 tablespoon (14.8 ml) of powdered star anise, 1/4 cup of maple syrup, and 1 sliced lemon. Pour in 6 cups of hot water and let it brew for 5 minutes, and then chill. Fill another pitcher with ice, and pour the tea over it. Craft delicious maple milkshakes. For a flavorful and low-fat maple-peach shake, blend 1 1/4 cups of low-fat milk, 1 cup of low-fat vanilla frozen yogurt, 6 tablespoons (88.7 ml) of Grade B maple syrup, 1 teaspoon of lemon juice, 1/4 teaspoon of salt, and 14 ounces (400 g) of chopped and peeled frozen peaches in a food processor until smooth.",
  "tyn_model":[
    "maple syrup",
    "salt",
    "brown sugar",
    "vegetable oil",
    "pitcher",
    "maple-bourbon",
    "garlic",
    "ketchup",
    "bourbon",
    "soy sauce",
    "apple cider vinegar",
    "saucepan",
    "maple-",
    "large skillet",
    "unsalted butter",
    "mangos",
    "food processor",
    "coconut",
    "chicken fajita dish",
    "sage cream",
    "baby brussels sprouts",
    "salt and pepper",
    "sugar",
    "cider vinegar",
    "roasted chestnuts",
    "walnut oil",
    "chestnuts",
    "bowl",
    "slotted spoon",
    "cooking liquid",
    "baked beans",
    "dijon mustard",
    "small bowl",
    "small pan",
    "ice cream",
    "coffee cake",
    "powdered sugar",
    "butter",
    "maple-pecan sticky buns",
    "vanilla ice cream",
    "maple-walnut sauce",
    "bacon",
    "marshmallows",
    "melted butter",
    "rice cereal",
    "cooking spray",
    "pineapple",
    "tropical pudding",
    "silken tofu",
    "vanilla extract",
    "large bowl",
    "large pineapple",
    "pudding",
    "skillet",
    "dark amber syrup",
    "old-fashioned",
    "simple syrup",
    "mint julep",
    "vinegar",
    "tequila",
    "rum",
    "rye",
    "bitters",
    "teas",
    "iced tea",
    "water",
    "green tea bags",
    "lemon",
    "hot water",
    "ice",
    "tea",
    "low-fat milk",
    "low-fat vanilla frozen yogurt",
    "lemon juice",
    "frozen peaches"
  ],
  "tyn_section":[

  ]
}