{
  "title":"How to Draw a Portrait (Mediocre Artists)",
  "url":"https://www.wikihow.com/Draw-a-Portrait-(Mediocre-Artists)",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing People",
    "Drawing Portraits"
  ],
  "steps":[
    {
      "headline":"Draw a 1 centimeter (0.4 in) X 1 centimeter (0.4 in) grid on a black and white image printed from a computer.",
      "description":"Alternatively, you can just do it on the computer by getting a grid and editing the original image."
    },
    {
      "headline":"Get an A4 piece of paper and draw a grid identical to the image's grid.",
      "description":""
    },
    {
      "headline":"Copy each square of the image's onto the A4 piece of paper's grid.",
      "description":"Do not do any shadows yet."
    },
    {
      "headline":"Erase all of the grid, to leave the line's you've drawn.",
      "description":""
    },
    {
      "headline":"Start on the hair.",
      "description":"If the image has no clear hair lines, make up your own. Try to copy the image's hair. Use a 4H pencil first, and use it lightly. After you've done this, draw new lines (for hair) with a 2B pencil, then use a 4B. Do not use the 4B pencil too excessively. You want the illusion of depth."
    },
    {
      "headline":"Do the eyes.",
      "description":"Again, focus on using the 4H more. Use the 2B for the basic lines."
    },
    {
      "headline":"Do the nose.",
      "description":"Use the 4H  and 2B for the shadows. Careful smudging works very well."
    },
    {
      "headline":"Do the mouth.",
      "description":"2B for basic lines, 4H for the shadows. The 2B should also be used a bit. With a lot of drawings, the bottom lip is not heavily outlined. This is where shadowing needs to be focused on more."
    },
    {
      "headline":"Do the ears.",
      "description":"This process should be done like the nose and eyes-with a 2B and 4H. Carefully does it."
    },
    {
      "headline":"Do any shadowing the face needs with a 4H, or smudge.",
      "description":"This is where smudging comes most useful. Don't be afraid to use an eraser."
    },
    {
      "headline":"Colour in the clothes.",
      "description":"Smudging is also handy here. The 4B can be used a bit more here too."
    }
  ],
  "text":" Draw a 1 centimeter (0.4 in) X 1 centimeter (0.4 in) grid on a black and white image printed from a computer. Alternatively, you can just do it on the computer by getting a grid and editing the original image. Get an A4 piece of paper and draw a grid identical to the image's grid.  Copy each square of the image's onto the A4 piece of paper's grid. Do not do any shadows yet. Erase all of the grid, to leave the line's you've drawn.  Start on the hair. If the image has no clear hair lines, make up your own. Try to copy the image's hair. Use a 4H pencil first, and use it lightly. After you've done this, draw new lines (for hair) with a 2B pencil, then use a 4B. Do not use the 4B pencil too excessively. You want the illusion of depth. Do the eyes. Again, focus on using the 4H more. Use the 2B for the basic lines. Do the nose. Use the 4H  and 2B for the shadows. Careful smudging works very well. Do the mouth. 2B for basic lines, 4H for the shadows. The 2B should also be used a bit. With a lot of drawings, the bottom lip is not heavily outlined. This is where shadowing needs to be focused on more. Do the ears. This process should be done like the nose and eyes-with a 2B and 4H. Carefully does it. Do any shadowing the face needs with a 4H, or smudge. This is where smudging comes most useful. Don't be afraid to use an eraser. Colour in the clothes. Smudging is also handy here. The 4B can be used a bit more here too.",
  "tyn_model":[
    "pencil",
    "paper",
    "drawings",
    "eraser",
    "colour"
  ],
  "tyn_section":[

  ]
}