{
  "title":"How to Make Glazed Carrots",
  "url":"https://www.wikihow.com/Make-Glazed-Carrots",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Making Brown Sugar Glazed Carrots",
      "steps":[
        {
          "headline":"Prepare the carrots.",
          "description":"Rinse the carrots under cool water, then chop the ends off. Peel the carrots using a vegetable peeler, then cut them into thick slices; try to make the cuts diagonal rather than straight down."
        },
        {
          "headline":"Bring some water to a boil in a skillet.",
          "description":"Fill a deep skillet with 1 inch (2.54 centimeters) of water. Place the skillet on the stove, and bring the water to a boil over medium to medium-high heat."
        },
        {
          "headline":"Add the carrots, then cook for 3 minutes, then drain them and set them aside.",
          "description":"Pour the carrots through a strainer, then place the skillet back on the stove. Shake the carrots until they are free of water, then set them aside. They will be slightly underdone, which is fine; you will continue cooking them in the glaze."
        },
        {
          "headline":"Combine the rest of the ingredients in the skillet over medium heat.",
          "description":"Put the butter, brown sugar, and pumpkin pie spice into the skillet. Turn the heat up to medium, and wait for the butter to melt, stirring occasionally with a spoon or whisk."
        },
        {
          "headline":"Wait until the glaze starts to bubble, then add the carrots, and cook for 2 more minutes.",
          "description":"Stir the carrots often with a rubber spatula. This ensures that they cook evenly, and that they get coated with the glaze."
        },
        {
          "headline":"Serve the carrots.",
          "description":"Once the carrots are tender, they are ready to serve. If you will be serving this to young children, however, allow the carrots to cool for a few minutes."
        }
      ]
    },
    {
      "name":"Making Orange Glazed Carrots",
      "steps":[
        {
          "headline":"Cook the carrots until they turn tender.",
          "description":"Put the carrots into a large saucepan, then cover them with water. Bring the water to a boil over medium heat, then cook the carrots until they turn tender, about 15 minutes."
        },
        {
          "headline":"Drain the water from the carrots, then set the carrots aside.",
          "description":"Pour the carrots through a strainer, then shake them gently to dislodge any last bits of water. Place the carrots back into the saucepan, then set the saucepan aside."
        },
        {
          "headline":"Cook the orange juice in a separate saucepan over medium heat for 5 minutes.",
          "description":"Pour the orange juice into a small saucepan, then bring it to a simmer over medium heat. Let it cook for 5 minutes."
        },
        {
          "headline":"Stir in the sugar, butter, and salt using a fork or a small whisk.",
          "description":"Don't worry if the ingredients don't come together right away. This will give you a basic glaze. If you'd like to step things up a bit, try some of the following:\nIf you'd like extra flavor, add ½ teaspoon of ground cinnamon and ¼ teaspoon of ground allspice. If you don't have any brown sugar, try ¼ cup (90 grams) of maple syrup instead. For a richer glaze, increase the butter to 4 tablespoons (55 grams)."
        },
        {
          "headline":"Cook the glaze over medium heat until it thickens, stirring often.",
          "description":"The butter will melt first, then the sugar will start to dissolve. Eventually, the glaze will start to thicken. If it is not thick enough for you, stir in 2 teaspoons of cornstarch."
        },
        {
          "headline":"Pour the glaze over the carrots, then toss the carrots.",
          "description":"You can stir the carrots up with a rubber spatula, or you can cover the saucepan with a lid and shake it. This will coat the carrots in the glaze."
        },
        {
          "headline":"Serve the carrots.",
          "description":"They taste great on their own, or as a side for a larger meal. If you are serving this to young children, let the carrots cool down for a few minutes first. It might also be a good idea to cut them into bite-sized pieces as well."
        }
      ]
    },
    {
      "name":"Making Honey Glazed Carrots",
      "steps":[
        {
          "headline":"Melt the butter in a skillet over medium heat.",
          "description":"Stir the butter occasionally with a spatula to help it melt faster and to prevent it from burning."
        },
        {
          "headline":"Add the honey and brown sugar.",
          "description":"Give everything a brisk stir with a fork or mini whisk to combine. Your basic glaze is almost complete but if you'd like a more savory dish, you could add 2 teaspoons of fresh dill and/or 2 teaspoons of fresh thyme. You can also use 1 teaspoon of dried dill or parsley instead."
        },
        {
          "headline":"Add the carrots, and continue cooking until they turn tender, about 15 minutes.",
          "description":"Stir the occasionally to prevent scorching. Adding the carrots into the glaze during the cooking process not only allows them to be coated with glaze, but it also infuses them with honey and sugar."
        },
        {
          "headline":"Serve the carrots.",
          "description":"Once the carrots are done to your liking, transfer them to a serving dish. If you are serving them to small children, let them cool for a few minutes first. It might also be a good idea to cut them into smaller pieces for very young family members."
        }
      ]
    }
  ],
  "text":" Making Brown Sugar Glazed Carrots Prepare the carrots. Rinse the carrots under cool water, then chop the ends off. Peel the carrots using a vegetable peeler, then cut them into thick slices; try to make the cuts diagonal rather than straight down. Bring some water to a boil in a skillet. Fill a deep skillet with 1 inch (2.54 centimeters) of water. Place the skillet on the stove, and bring the water to a boil over medium to medium-high heat. Add the carrots, then cook for 3 minutes, then drain them and set them aside. Pour the carrots through a strainer, then place the skillet back on the stove. Shake the carrots until they are free of water, then set them aside. They will be slightly underdone, which is fine; you will continue cooking them in the glaze. Combine the rest of the ingredients in the skillet over medium heat. Put the butter, brown sugar, and pumpkin pie spice into the skillet. Turn the heat up to medium, and wait for the butter to melt, stirring occasionally with a spoon or whisk. Wait until the glaze starts to bubble, then add the carrots, and cook for 2 more minutes. Stir the carrots often with a rubber spatula. This ensures that they cook evenly, and that they get coated with the glaze. Serve the carrots. Once the carrots are tender, they are ready to serve. If you will be serving this to young children, however, allow the carrots to cool for a few minutes. Making Orange Glazed Carrots Cook the carrots until they turn tender. Put the carrots into a large saucepan, then cover them with water. Bring the water to a boil over medium heat, then cook the carrots until they turn tender, about 15 minutes. Drain the water from the carrots, then set the carrots aside. Pour the carrots through a strainer, then shake them gently to dislodge any last bits of water. Place the carrots back into the saucepan, then set the saucepan aside. Cook the orange juice in a separate saucepan over medium heat for 5 minutes. Pour the orange juice into a small saucepan, then bring it to a simmer over medium heat. Let it cook for 5 minutes. Stir in the sugar, butter, and salt using a fork or a small whisk. Don't worry if the ingredients don't come together right away. This will give you a basic glaze. If you'd like to step things up a bit, try some of the following:\nIf you'd like extra flavor, add ½ teaspoon of ground cinnamon and ¼ teaspoon of ground allspice. If you don't have any brown sugar, try ¼ cup (90 grams) of maple syrup instead. For a richer glaze, increase the butter to 4 tablespoons (55 grams). Cook the glaze over medium heat until it thickens, stirring often. The butter will melt first, then the sugar will start to dissolve. Eventually, the glaze will start to thicken. If it is not thick enough for you, stir in 2 teaspoons of cornstarch. Pour the glaze over the carrots, then toss the carrots. You can stir the carrots up with a rubber spatula, or you can cover the saucepan with a lid and shake it. This will coat the carrots in the glaze. Serve the carrots. They taste great on their own, or as a side for a larger meal. If you are serving this to young children, let the carrots cool down for a few minutes first. It might also be a good idea to cut them into bite-sized pieces as well. Making Honey Glazed Carrots Melt the butter in a skillet over medium heat. Stir the butter occasionally with a spatula to help it melt faster and to prevent it from burning. Add the honey and brown sugar. Give everything a brisk stir with a fork or mini whisk to combine. Your basic glaze is almost complete but if you'd like a more savory dish, you could add 2 teaspoons of fresh dill and/or 2 teaspoons of fresh thyme. You can also use 1 teaspoon of dried dill or parsley instead. Add the carrots, and continue cooking until they turn tender, about 15 minutes. Stir the occasionally to prevent scorching. Adding the carrots into the glaze during the cooking process not only allows them to be coated with glaze, but it also infuses them with honey and sugar. Serve the carrots. Once the carrots are done to your liking, transfer them to a serving dish. If you are serving them to small children, let them cool for a few minutes first. It might also be a good idea to cut them into smaller pieces for very young family members.",
  "tyn_model":[
    "carrots",
    "water",
    "skillet",
    "butter",
    "saucepan",
    "brown sugar",
    "sugar",
    "strainer",
    "rubber spatula",
    "orange juice",
    "fork",
    "honey",
    "dill",
    "brown sugar glazed carrots",
    "vegetable peeler",
    "stove",
    "pumpkin pie spice",
    "spoon",
    "whisk",
    "orange glazed carrots",
    "large saucepan",
    "small saucepan",
    "salt",
    "small whisk",
    "ground cinnamon",
    "ground allspice",
    "maple syrup",
    "cornstarch",
    "spatula",
    "mini whisk",
    "fresh thyme",
    "parsley",
    "serving dish"
  ],
  "tyn_section":[

  ]
}