{
  "title":"How to Make a Special Teaser",
  "url":"https://www.wikihow.com/Make-a-Special-Teaser",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Games of Chance"
  ],
  "parts":[
    {
      "name":"Getting started",
      "steps":[
        {
          "headline":"Call your favorite sportsbook.",
          "description":"After your trusty clerk’s initial greeting, give him your account number and password, and ask for the games you’re interested in. You can make a special teaser with one game by taking both teams, plus the over and under, going for that middle. You can also combine football and basketball together or professional and collegial leagues. If you want only one game, ask for it, but if you want to hear the complete board, ask for a rundown. Have a pen and the sports’ schedule with you!"
        },
        {
          "headline":"Write the lines down.",
          "description":"A complete rundown can vary anywhere between two lines to up to more than fifty in college football or basketball. You’ll want to write the lines down to study them. With teasers, this is even more important because you’ll be adding and subtracting points before you decide what picks you want to take."
        }
      ]
    },
    {
      "name":"Deciding on the special teaser",
      "steps":[
        {
          "headline":"Decide which special teaser works for you.",
          "description":"You can take the four-teamer, which offers more points. Or the three-teamer with still a very good ten-point subtraction. Two important factors you should consider here:\nBoth special teasers have the same payout. In most sportsbooks it will be -110, so risking $110 to win $100. Ties lose in both types of special teasers. Pick your teams and totals. You can take a teaser with only teams-to-win, or combined with totals. Compare:Real Lines(NFL) Saints Pk(NFL) Giants Under 53(NCAA football) Georgia Tech +5.5(WNBA) Lynx Under 155.53-team Special Teaser $110/100 - 10 pts in football/8 pts in basketball(NFL) Saints +10(NCAA football) Georgia Tech +15.5(WNBA) Lynx Under 163.53-team regular teaser $100/170 - 7 pts in football/5 pts in basketball(NFL) Saints 13(NFL) Giants Under 53(NCAA football) Georgia Tech +18.5(WNBA) Lynx Under 165.5"
        },
        {
          "headline":"Decide on an amount.",
          "description":""
        }
      ]
    },
    {
      "name":"Placing the bet",
      "steps":[
        {
          "headline":"Make the bet.",
          "description":"Begin by telling the clerk what kind of play you want. To ask for the teaser in the middle column above, you’d say: “I want a three-team ten-point special teaser.”"
        },
        {
          "headline":"Give the clerk your picks.",
          "description":"It is not necessary to give the clerk the lines. For the example above, you would say:“With the Saints, Georgia Tech, and Minnesota Lynx under.”"
        },
        {
          "headline":"Give the clerk the amount you want to win.",
          "description":"A simple “for twenty” is enough to let the clerk know that you want to risk the necessary amount to win $20. If you say nothing after listing your picks, the clerk will prompt you by asking “for how much?” If you prefer, you can wait for this moment to give him the amount."
        },
        {
          "headline":"Listen to the read back.",
          "description":"The clerk will now ask you if you need anything else. If that’s the only play you want to make, say “no thank you”. The clerk will proceed to give you the read back. Listen carefully and make sure you’re taking the teams, the lines and the amount you wanted. If everything is in order, confirm your parlay by giving the clerk your account number and password one last time. The clerk will then thank you and end the call."
        },
        {
          "headline":"Enjoy the games!",
          "description":""
        }
      ]
    }
  ],
  "text":" Getting started Call your favorite sportsbook. After your trusty clerk’s initial greeting, give him your account number and password, and ask for the games you’re interested in. You can make a special teaser with one game by taking both teams, plus the over and under, going for that middle. You can also combine football and basketball together or professional and collegial leagues. If you want only one game, ask for it, but if you want to hear the complete board, ask for a rundown. Have a pen and the sports’ schedule with you! Write the lines down. A complete rundown can vary anywhere between two lines to up to more than fifty in college football or basketball. You’ll want to write the lines down to study them. With teasers, this is even more important because you’ll be adding and subtracting points before you decide what picks you want to take. Deciding on the special teaser Decide which special teaser works for you. You can take the four-teamer, which offers more points. Or the three-teamer with still a very good ten-point subtraction. Two important factors you should consider here:\nBoth special teasers have the same payout. In most sportsbooks it will be -110, so risking $110 to win $100. Ties lose in both types of special teasers. Pick your teams and totals. You can take a teaser with only teams-to-win, or combined with totals. Compare:Real Lines(NFL) Saints Pk(NFL) Giants Under 53(NCAA football) Georgia Tech +5.5(WNBA) Lynx Under 155.53-team Special Teaser $110/100 - 10 pts in football/8 pts in basketball(NFL) Saints +10(NCAA football) Georgia Tech +15.5(WNBA) Lynx Under 163.53-team regular teaser $100/170 - 7 pts in football/5 pts in basketball(NFL) Saints 13(NFL) Giants Under 53(NCAA football) Georgia Tech +18.5(WNBA) Lynx Under 165.5 Decide on an amount.  Placing the bet Make the bet. Begin by telling the clerk what kind of play you want. To ask for the teaser in the middle column above, you’d say: “I want a three-team ten-point special teaser.” Give the clerk your picks. It is not necessary to give the clerk the lines. For the example above, you would say:“With the Saints, Georgia Tech, and Minnesota Lynx under.” Give the clerk the amount you want to win. A simple “for twenty” is enough to let the clerk know that you want to risk the necessary amount to win $20. If you say nothing after listing your picks, the clerk will prompt you by asking “for how much?” If you prefer, you can wait for this moment to give him the amount. Listen to the read back. The clerk will now ask you if you need anything else. If that’s the only play you want to make, say “no thank you”. The clerk will proceed to give you the read back. Listen carefully and make sure you’re taking the teams, the lines and the amount you wanted. If everything is in order, confirm your parlay by giving the clerk your account number and password one last time. The clerk will then thank you and end the call. Enjoy the games! ",
  "tyn_model":[
    "clerk",
    "lynx",
    "giants",
    "saints",
    "” give",
    "“for",
    "pen",
    "’ schedule",
    "teasers",
    "“i",
    "” is",
    "” if",
    "“no",
    "”."
  ],
  "tyn_section":[

  ]
}