{
  "title":"How to Make a Pineapple Sorbet Bowl",
  "url":"https://www.wikihow.com/Make-a-Pineapple-Sorbet-Bowl",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts",
    "Sorbet and Sherbet"
  ],
  "parts":[
    {
      "name":"Preparing the Pineapple Shell",
      "steps":[
        {
          "headline":"Cut a large pineapple in half.",
          "description":"Place the other half back in the refrigerator (either make pineapple salad or pineapple juice from it, or you can make another round of pineapple sorbet bowl for a large party)."
        },
        {
          "headline":"Cut the pineapple flesh.",
          "description":"Run a knife down the middle of the flesh. Don't cut through the pineapple peel. Score around the edge of the soft flesh with the knife, to cut into it. Leave the hard flesh sides intact. Run cuts across the line you made down the center of the pineapple. This will form cubes. The flesh is now ready to be scooped out."
        },
        {
          "headline":"Scoop out the cubes of pineapple and put into a bowl.",
          "description":"Use a large metallic spoon to remove the flesh. Scrape out any leftover soft flesh, leaving the hard flesh intact to strengthen the peel sides."
        },
        {
          "headline":"Place the pineapple shell in the freezer to harden.",
          "description":"In the meantime, make the pineapple sorbet (see next)."
        }
      ]
    },
    {
      "name":"Preparing the Sorbet",
      "steps":[
        {
          "headline":"Drop the pineapple cubes into the blender or food processor.",
          "description":""
        },
        {
          "headline":"Add the sugar, lemon juice and water.",
          "description":"Blend or process until smooth."
        },
        {
          "headline":"Pour the sorbet mixture into a container suitable for freezing, or on a parchment covered baking sheet/tray with raised edges.",
          "description":""
        },
        {
          "headline":"Place in the freezer.",
          "description":"Freeze for 1-2 hours."
        },
        {
          "headline":"Remove from the freezer.",
          "description":"Turn into sorbet by hand or by machine, as follows:\nStir the frozen sorbet mixture to get it out of the container (use a metallic spoon)."
        },
        {
          "headline":"Place the mixture into an ice cream maker.",
          "description":"Following the instructions for the appliance, turn into sorbet."
        },
        {
          "headline":"Scoop the finished product into the frozen pineapple shell and place back in the freezer until needed.",
          "description":"It is recommended that it be covered with a large freezer bag to prevent icicles forming."
        },
        {
          "headline":"Put the sorbet back into the blender or food processor.",
          "description":""
        },
        {
          "headline":"Blend until smooth.",
          "description":""
        },
        {
          "headline":"Spoon the sorbet into the frozen pineapple half.",
          "description":""
        },
        {
          "headline":"Place back in the freezer; it is recommended that it be covered with a large freezer bag to prevent icicles forming.",
          "description":"Freeze for 5 hours."
        }
      ]
    }
  ],
  "text":" Preparing the Pineapple Shell Cut a large pineapple in half. Place the other half back in the refrigerator (either make pineapple salad or pineapple juice from it, or you can make another round of pineapple sorbet bowl for a large party). Cut the pineapple flesh. Run a knife down the middle of the flesh. Don't cut through the pineapple peel. Score around the edge of the soft flesh with the knife, to cut into it. Leave the hard flesh sides intact. Run cuts across the line you made down the center of the pineapple. This will form cubes. The flesh is now ready to be scooped out. Scoop out the cubes of pineapple and put into a bowl. Use a large metallic spoon to remove the flesh. Scrape out any leftover soft flesh, leaving the hard flesh intact to strengthen the peel sides. Place the pineapple shell in the freezer to harden. In the meantime, make the pineapple sorbet (see next). Preparing the Sorbet Drop the pineapple cubes into the blender or food processor.  Add the sugar, lemon juice and water. Blend or process until smooth. Pour the sorbet mixture into a container suitable for freezing, or on a parchment covered baking sheet/tray with raised edges.  Place in the freezer. Freeze for 1-2 hours. Remove from the freezer. Turn into sorbet by hand or by machine, as follows:\nStir the frozen sorbet mixture to get it out of the container (use a metallic spoon). Place the mixture into an ice cream maker. Following the instructions for the appliance, turn into sorbet. Scoop the finished product into the frozen pineapple shell and place back in the freezer until needed. It is recommended that it be covered with a large freezer bag to prevent icicles forming. Put the sorbet back into the blender or food processor.  Blend until smooth.  Spoon the sorbet into the frozen pineapple half.  Place back in the freezer; it is recommended that it be covered with a large freezer bag to prevent icicles forming. Freeze for 5 hours.",
  "tyn_model":[
    "freezer",
    "pineapple",
    "pineapple sorbet",
    "knife",
    "blender",
    "food processor",
    "freezer bag",
    "refrigerator",
    "pineapple salad",
    "pineapple juice",
    "pineapple flesh",
    "pineapple peel",
    "bowl",
    "sugar",
    "lemon juice",
    "water",
    "ice cream maker"
  ],
  "tyn_section":[

  ]
}