{
  "title":"How to Recover from a Disaster",
  "url":"https://www.wikihow.com/Recover-from-a-Disaster",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "methods":[
    {
      "name":"Safety and Medical Attention",
      "steps":[
        {
          "headline":"Check for injuries.",
          "description":"Do not attempt to move seriously injured persons unless they are in immediate danger of death or further injury. If you must move an unconscious person, first stabilize the neck and back, then call for help immediately. If the victim is not breathing, carefully position the victim for artificial respiration, clear the airway, and commence mouth-to-mouth resuscitation. Maintain body temperature with blankets. Be sure the victim does not become overheated, and never try to feed liquids to an unconscious person."
        },
        {
          "headline":"Be aware of exhaustion.",
          "description":"Don't try to do too much at once. Set priorities and pace yourself. Get enough rest, drink plenty of clean water, and eat well."
        },
        {
          "headline":"Be aware of new safety issues created by the disaster.",
          "description":"Watch for washed out roads, contaminated buildings, contaminated water, gas leaks, broken glass, damaged electrical wiring, and slippery floors."
        },
        {
          "headline":"Inform local authorities about health and safety issues, including chemical spills, downed power lines, washed out roads, smoldering insulation, and dead animals.",
          "description":""
        }
      ]
    },
    {
      "name":"Returning Home",
      "steps":[
        {
          "headline":"Walk carefully around the outside and check for loose power lines, gas leaks, and structural damage.",
          "description":"If you have any doubts about safety, have your residence inspected by a qualified building inspector or structural engineer before entering."
        },
        {
          "headline":"Do not enter your home if you smell gas, if flood waters remain around the building, or if your home was damaged by fire and the authorities have not declared it safe.",
          "description":"If it looks like the building may collapse, do not enter the house, or if you have entered, leave immediately."
        },
        {
          "headline":"Enter the home carefully and check for damage.",
          "description":"Be aware of loose boards and slippery floors. Use a battery-powered flashlight to inspect a damaged home. The flashlight should be turned on outside before entering—the battery may produce a spark that could ignite leaking gas, if present."
        },
        {
          "headline":"Pay attention for the smell of gas or hissing or blowing sounds.",
          "description":"If you notice these, open a window and leave immediately. Turn off the main gas valve from the outside, if you can. Call the gas company from a neighbor's residence. If you shut off the gas supply at the main valve, you will need a professional to turn it back on. Do not smoke or use oil, gas lanterns, candles, or torches for lighting inside a damaged home until you are sure there is no leaking gas or other flammable materials present."
        },
        {
          "headline":"Check the electrical system unless you are wet, standing in water, or unsure of your safety.",
          "description":"If possible, turn off the electricity at the main fuse box or circuit breaker. If the situation is unsafe, leave the building and call for help. Do not turn on the lights until you are sure they're safe to use. You may want to have an electrician inspect your wiring."
        },
        {
          "headline":"Turn off the electricity at the main fuse box or circuit breaker if the appliances are wet.",
          "description":"Then, unplug appliances and let them dry out. Have appliances checked by a professional before using them again. Also, have the electrical system checked by an electrician before turning the power back on."
        },
        {
          "headline":"Turn off the main water valve if pipes are damaged.",
          "description":"Check with local authorities before using any water; the water could be contaminated. Pump out wells and have the water tested by authorities before drinking. Do not flush toilets until you know that sewage lines are intact."
        },
        {
          "headline":"Throw out all food and other supplies that you suspect may have become contaminated or come in to contact with floodwater.",
          "description":""
        },
        {
          "headline":"Pump water out of your basement if it is flooded, but do so gradually (about one third of the water per day) to avoid damage.",
          "description":"The walls may collapse and the floor may buckle if the basement is pumped out while the surrounding ground is still waterlogged."
        },
        {
          "headline":"Clean up household chemical spills.",
          "description":"Disinfect items that may have been contaminated by raw sewage, bacteria, or chemicals. Also clean salvageable items."
        },
        {
          "headline":"Call your insurance agent.",
          "description":"Take pictures of damages. Keep good records of repair and cleaning costs."
        }
      ]
    },
    {
      "name":"Encountering Wildlife",
      "steps":[
        {
          "headline":"Call your local animal control office or wildlife resource office if you encounter an injured or stranded animal.",
          "description":"Never approach or attempt to help the animal yourself. Also, never corner wild animals or try to rescue them. Wild animals will likely feel threatened and may endanger themselves by dashing off into flood waters, fire, and so forth."
        },
        {
          "headline":"Let wild animals that have taken refuge in your home escape.",
          "description":"Wild animals such as snakes, opossums, and raccoons often seek refuge from flood waters on upper levels of homes and have been known to remain after water recedes. If you encounter animals in this situation, open a window or provide another escape route and the animal will likely leave on its own. Do not attempt to capture or handle the animal. Should the animal stay, call your local animal control office or wildlife resource office."
        },
        {
          "headline":"Leave a dead animal alone.",
          "description":"Animal carcasses can present serious health risks. Contact your local emergency management office or health department for help and instructions. If bitten by an animal, seek immediate medical attention."
        }
      ]
    }
  ],
  "text":" Safety and Medical Attention Check for injuries. Do not attempt to move seriously injured persons unless they are in immediate danger of death or further injury. If you must move an unconscious person, first stabilize the neck and back, then call for help immediately. If the victim is not breathing, carefully position the victim for artificial respiration, clear the airway, and commence mouth-to-mouth resuscitation. Maintain body temperature with blankets. Be sure the victim does not become overheated, and never try to feed liquids to an unconscious person. Be aware of exhaustion. Don't try to do too much at once. Set priorities and pace yourself. Get enough rest, drink plenty of clean water, and eat well. Be aware of new safety issues created by the disaster. Watch for washed out roads, contaminated buildings, contaminated water, gas leaks, broken glass, damaged electrical wiring, and slippery floors. Inform local authorities about health and safety issues, including chemical spills, downed power lines, washed out roads, smoldering insulation, and dead animals.  Returning Home Walk carefully around the outside and check for loose power lines, gas leaks, and structural damage. If you have any doubts about safety, have your residence inspected by a qualified building inspector or structural engineer before entering. Do not enter your home if you smell gas, if flood waters remain around the building, or if your home was damaged by fire and the authorities have not declared it safe. If it looks like the building may collapse, do not enter the house, or if you have entered, leave immediately. Enter the home carefully and check for damage. Be aware of loose boards and slippery floors. Use a battery-powered flashlight to inspect a damaged home. The flashlight should be turned on outside before entering—the battery may produce a spark that could ignite leaking gas, if present. Pay attention for the smell of gas or hissing or blowing sounds. If you notice these, open a window and leave immediately. Turn off the main gas valve from the outside, if you can. Call the gas company from a neighbor's residence. If you shut off the gas supply at the main valve, you will need a professional to turn it back on. Do not smoke or use oil, gas lanterns, candles, or torches for lighting inside a damaged home until you are sure there is no leaking gas or other flammable materials present. Check the electrical system unless you are wet, standing in water, or unsure of your safety. If possible, turn off the electricity at the main fuse box or circuit breaker. If the situation is unsafe, leave the building and call for help. Do not turn on the lights until you are sure they're safe to use. You may want to have an electrician inspect your wiring. Turn off the electricity at the main fuse box or circuit breaker if the appliances are wet. Then, unplug appliances and let them dry out. Have appliances checked by a professional before using them again. Also, have the electrical system checked by an electrician before turning the power back on. Turn off the main water valve if pipes are damaged. Check with local authorities before using any water; the water could be contaminated. Pump out wells and have the water tested by authorities before drinking. Do not flush toilets until you know that sewage lines are intact. Throw out all food and other supplies that you suspect may have become contaminated or come in to contact with floodwater.  Pump water out of your basement if it is flooded, but do so gradually (about one third of the water per day) to avoid damage. The walls may collapse and the floor may buckle if the basement is pumped out while the surrounding ground is still waterlogged. Clean up household chemical spills. Disinfect items that may have been contaminated by raw sewage, bacteria, or chemicals. Also clean salvageable items. Call your insurance agent. Take pictures of damages. Keep good records of repair and cleaning costs. Encountering Wildlife Call your local animal control office or wildlife resource office if you encounter an injured or stranded animal. Never approach or attempt to help the animal yourself. Also, never corner wild animals or try to rescue them. Wild animals will likely feel threatened and may endanger themselves by dashing off into flood waters, fire, and so forth. Let wild animals that have taken refuge in your home escape. Wild animals such as snakes, opossums, and raccoons often seek refuge from flood waters on upper levels of homes and have been known to remain after water recedes. If you encounter animals in this situation, open a window or provide another escape route and the animal will likely leave on its own. Do not attempt to capture or handle the animal. Should the animal stay, call your local animal control office or wildlife resource office. Leave a dead animal alone. Animal carcasses can present serious health risks. Contact your local emergency management office or health department for help and instructions. If bitten by an animal, seek immediate medical attention.",
  "tyn_model":[
    "water",
    "gas",
    "animal control office",
    "blankets",
    "liquids",
    "structural engineer",
    "flashlight",
    "—the",
    "gas lanterns",
    "candles",
    "torches",
    "electrician",
    "snakes",
    "opossums"
  ],
  "tyn_section":[

  ]
}