{
  "title":"How to Redecorate Your Bedroom Cheaply",
  "url":"https://www.wikihow.com/Redecorate-Your-Bedroom-Cheaply",
  "category_hierarchy":[
    "Home and Garden",
    "Home Decorating",
    "Budget Decorating"
  ],
  "methods":[
    {
      "name":"Organizing and Redesigning",
      "steps":[
        {
          "headline":"Clean up your room to make it easier to redecorate.",
          "description":"If you have clutter everywhere, just putting it away will make a huge difference. Organize what's on top of your nightstand, desk, or other flat surfaces, and find a place for everything on the floor. Put what you can up in drawers to get it out of the way and use organizers to make what's left look neat. Make sure everything has its own designated spot to go, and then take 5 minutes each day to put your things away. While some items, like jewelry odds and ends, look pretty displayed, others, like charging cords, should be hidden away when not in use."
        },
        {
          "headline":"Move your bed to shake up the room.",
          "description":"Your bed is typically a big piece in your room, so moving it can make a big impact. If your bed is off to one side, try putting it in the center of the wall, or vice versa. Then, when you add new linens and decorations, it will really stand out and make your room feel cheerful and comfortable."
        },
        {
          "headline":"Donate furniture to free up space.",
          "description":"If your room is feeling a little cramped, take a hard look at what you have. Decide what you actually need in your room to make it the perfect space and get rid of anything that's just a landing space for clutter. For example, if you have a chair in the corner that just ends up being a spot where you toss half-worn clothes, it's time to get rid of it! Similarly, if you don't use your desk much, maybe you should get rid of it and free up space for a comfy reading nook. It's your bedroom, so decide what you want in your mini oasis!"
        },
        {
          "headline":"Use furniture in unexpected ways.",
          "description":"Try your bookcase out as a headboard at the top of your bed, for instance. Make your desk double as a nightstand, and turn your nightstand into a display area for your favorite collectibles. Keep moving things around to figure out the configuration you like best! Get creative! You don't have to use things for their \"intended\" function."
        },
        {
          "headline":"Rearrange your artwork for a different feel.",
          "description":"You don't have to add new artwork to your room to give it a different feel. Simply try new arrangements! For instance, group it all together on wall to make a bold statement. Alternatively, arrange a large piece behind your bed and then use smaller pieces on the opposite wall to balance it out. Play around and try different things. You never know what will catch your attention."
        },
        {
          "headline":"Pick a color theme to create a cohesive look.",
          "description":"Limiting the colors you use will help your room feel \"decorated,\" not just thrown together. Opt for just a couple of bright or bold colors, and then you can even out the rest of the room with neutrals. For instance, try complementary colors, like purple and yellow, red and green, or blue and orange. Alternatively, try analogous colors, colors that are nearby on the color wheel, such as pink, red, and orange, or purple, blue-purple, and blue. Then use grey, tan, white, black, or other neutrals as your background. You could also just opt for the primary colors, red, blue, and yellow, for a very bright effect."
        }
      ]
    },
    {
      "name":"Adding Color to the Walls",
      "steps":[
        {
          "headline":"Hang up a colorful quilt, sheet, or blanket on 1 wall.",
          "description":"Many quilts and sheets have pretty patterns that can make a colorful statement. Try centering one behind your bed to create a focal point for your room, for instance. You can nail or pin up the fabric if you don't mind putting a few holes in it. You can also safety pin it around a curtain rod, then hang the rod from hooks."
        },
        {
          "headline":"Paint a single wall or even a single stripe for a cheap option.",
          "description":"If you can't afford much paint, don't worry. Try painting an accent wall, for instance. You can even just paint a large stripe down the wall behind your bed as a focal point. These options don't take much paint, but they can make a big difference to your room. Make sure to use painter's tape to block off the area you want to paint. That way, you won't go out of the boundaries you set. Buy paint on sale or that's been mixed wrong if you want to paint the whole room. If the store doesn't mix the color right, it has to do it again. The \"mistake\" paint is usually then put on discount. You can find a variety of colors, but you have to go with an open mind, as you'll have fewer options. You can also look for paint sales, which often happen around holidays, particularly during the summer."
        },
        {
          "headline":"Use stencils or paint a mural.",
          "description":"Pick up a set of stencils, and use them to create a design on part of your wall. For instance, you could create a large floral arrangement, a funky collection of animals, or a series of feathers. Sketch the design out in pencil first to be sure you like it! You could also use acrylic paints to draw something fun on one wall or in one corner. Alternatively, try adding a series of shapes up a wall in 1 or 2 colors, such as hearts or diamonds."
        },
        {
          "headline":"Create your own abstract art on foam board.",
          "description":"You can pick up poster-sized foam board from the dollar store or another cheap store. Then, create your own art! Add blocks of color across the board at a diagonal, paint stripes, or simply let your imagination guide you! Once you're done, hang it on the wall with double-sided tape or adhesive strips. Another option is try concentric circles or squares or paint your own sunset."
        },
        {
          "headline":"Frame small prints and make a collage on your wall.",
          "description":"Prints are usually fairly cheap, so you can get small ones from local artists. Then, purchase cheap frames at a dollar store. Group them together on your wall, and it will work like a much larger piece of art. Try to put pieces together that have similar themes, moods, or colors. Another option is frame cheap pieces of scrapbook paper from the craft store. These pages cost less than a dollar and come in all kinds of colors and patterns!"
        },
        {
          "headline":"Cover all or part of a wall in paper.",
          "description":"Buy pretty scrapbook paper or tear up a used book that's seen better days. Then, you can either use double-sided tape or a cornstarch paste to adhere the paper to the wall. You can cover a large area with book pages. Both of these fixes are temporary, so you can take them down and redo them when you want!"
        }
      ]
    },
    {
      "name":"Making Old Items Look New",
      "steps":[
        {
          "headline":"Cover your lampshades with new fabric.",
          "description":"Choose a thin, light-colored fabric so you still get some light through it. Measure out the fabric and wrap it around the lamp. Use sewing glue to hold it in place, and tuck the edges under to form \"seams.\" Cut the extra fabric off  at the top and bottom and glue it over the edge on the inside."
        },
        {
          "headline":"Change up your throw pillows with new fabric.",
          "description":"If you have throw pillows on your bed or chair, simply adding new covers can make a huge difference to the way your room looks. Measure the pillow and cut 2 pieces of fabric with an extra 1 inch (2.5 cm) on each side. Turn the fabric inside out and match up the edges. Sew along 3 sides and turn the pillow cover right-side out. Stuff your pillow inside the cover, and then sew a slip stitch along the final edge. Look for clearance fabric at the craft store. You'll find odds and ends of fabric for less. You can also use cheap sheets from the thrift store to recover pillows. To sew a slip stitch, fold the edges of the seam over like the ones on the other sides of the pillow. Tie a knot in your thread and pull your needle through the inside edge of one side of the seam, starting in one corner. Run it through the inside edge on the other side of the seam. Keep going back and forth all along the seam to sew it up, knotting it at the end to hold it in place. Tuck the knot inside the pillow."
        },
        {
          "headline":"Get new bedding to transform the look of your bed.",
          "description":"Your bed is the center of your room, so when you change it up, you change the whole feel. Try changing out your sheets and comforter/duvet for a whole new look for your room! Bedding can be reasonable if you shop smartly at big box stores or online. You can even find it at thrift stores, but make sure to wash it in hot water before you use it!"
        },
        {
          "headline":"Update your furniture with paint or new hardware.",
          "description":"When painting, unscrew the handles and take out any drawers. Fill in any holes or scratches with wood putty, and then sand the surface down with 150-grit sandpaper so it accepts paint. Use a paintbrush to apply your new paint; opt for indoor acrylic paint or latex paint. You may need to apply more than one coat for an even finish. For a smoother surface, apply primer first. Always work in a ventilated area. You can even try spray painting your furniture! When spray painting, make sure to hold the can at least 6 inches (15 cm) from the work surface and keep it continually moving to get an even coat. You can also buy new handles for your dressers and other furniture. The hardware store sells these pretty cheaply, or you can look online."
        },
        {
          "headline":"Update old lamps with spray paint.",
          "description":"Pick a spray paint that's meant for the material of the lamps, such as one meant for metal if they're brass. Take the lamp apart, and then use the spray paint to add a new color to the lamp! Put the lamp back together when you're done. This works best for standard table lamps with a lampshade. Make sure to take the lampshade off. Always spray in a well-ventilated area, holding the spray paint at least 6 inches (15 cm) from the surface. Keep moving the can when spraying to get an even coat. You may need to do multiple coats. For a smoother finish, try wet sanding the paint with a very fine grit wet sandpaper once the paint is dry."
        }
      ]
    },
    {
      "name":"Adding Fun Decor",
      "steps":[
        {
          "headline":"Pop a new, small rug on the floor to update the look.",
          "description":"Whether you have worn-out carpet or hardwood floors, you can make them look new with a rug on top. Rugs can get expensive, so try going to a discount store and opting for a small rug. Even a tiny one can jazz up your floor! Place it along one side of your bed so it acts as a floor mat or throw it in the center of the room to add pizzazz to a larger area."
        },
        {
          "headline":"Put a throw over the end of your bed for a pop of color.",
          "description":"Throw blankets are fairly cheap. You can even get small, fleece ones for $5 USD or so in the winter. Pick a color that goes with your theme, and then use the blanket to add some of that color to your space! If you have yarn around, you could also learn to crochet or knit, and then make yourself a small blanket. Alternatively, buy a piece of fleece fabric from a craft store. It doesn't unravel at the edges, so if you cut it evenly, you can just fold it to create a splash of color at the foot of your bed."
        },
        {
          "headline":"Hit thrift stores and vintage stores for fun knickknacks.",
          "description":"You can find fun and funky items to add pops of color to your space. Look for items that fit the theme you're going for, either in color, shape, or style. Also, try re-purposing containers and using them in new and unexpected ways! For instance, use a vintage teacup to hold your bracelets or find a fun tray to gather all your odds and ends. If you're going for a cat theme, look for fun knickknacks with cats on them! Garage and yard sales are also a good source of vintage knickknacks."
        },
        {
          "headline":"Ask your relatives if they want to part with any of their decor.",
          "description":"Sometimes, people are just getting tired of what they have around the house, and they may be willing to give it to you! Of course, be polite when asking and graciously accept what they give you. You could put a call out on a social media for any knickknacks people are getting rid of, such as \"I'm looking to redecorate my bedroom! Is anyone getting rid of knickknacks or decorations in their household?\" You could also check your attack or storage areas in your home to see if you have anything you can repurpose."
        },
        {
          "headline":"Create a shelf or a tray out of a cheap springform pan.",
          "description":"You can likely find one of these at the dollar store. Turn it on its side and hang it on the wall. Put something small inside like a succulent for a cute little display! You can even spray paint it for some more pizzazz or add a small string of battery-powered lights. You can do something similar with other cheap baking trays. Spray paint a rectangular baking pan to use as a place to gather odds and ends on your dresser, for instance!"
        },
        {
          "headline":"Put a few small plants in a sunny corner.",
          "description":"Live plants really liven up a room, and they're fairly inexpensive. All you need is a container with a drainage hole in it, some soil, and the plant. Try some small succulents, small ferns, or ivy, for instance. You can use many things as containers, including teacups, mugs, spray painted food cans, or small glass jars. Just be sure to drill some holes in the bottom for drainage. Another option is to get a pretty vase and add some fake flowers. That way, you don't have to water them!"
        },
        {
          "headline":"Scatter some cheap lighting around your room.",
          "description":"If all you have is a harsh overhead light, add some lamps and wall lighting to make your room feel cozier. Even a cheap string of patio lights strung along the top of your headboard can add a romantic feeling to your room. Also, try adding some small desk lamps in various places or a cheap kit that you attach to the wall, such as a colorful paper star lantern."
        }
      ]
    }
  ],
  "text":" Organizing and Redesigning Clean up your room to make it easier to redecorate. If you have clutter everywhere, just putting it away will make a huge difference. Organize what's on top of your nightstand, desk, or other flat surfaces, and find a place for everything on the floor. Put what you can up in drawers to get it out of the way and use organizers to make what's left look neat. Make sure everything has its own designated spot to go, and then take 5 minutes each day to put your things away. While some items, like jewelry odds and ends, look pretty displayed, others, like charging cords, should be hidden away when not in use. Move your bed to shake up the room. Your bed is typically a big piece in your room, so moving it can make a big impact. If your bed is off to one side, try putting it in the center of the wall, or vice versa. Then, when you add new linens and decorations, it will really stand out and make your room feel cheerful and comfortable. Donate furniture to free up space. If your room is feeling a little cramped, take a hard look at what you have. Decide what you actually need in your room to make it the perfect space and get rid of anything that's just a landing space for clutter. For example, if you have a chair in the corner that just ends up being a spot where you toss half-worn clothes, it's time to get rid of it! Similarly, if you don't use your desk much, maybe you should get rid of it and free up space for a comfy reading nook. It's your bedroom, so decide what you want in your mini oasis! Use furniture in unexpected ways. Try your bookcase out as a headboard at the top of your bed, for instance. Make your desk double as a nightstand, and turn your nightstand into a display area for your favorite collectibles. Keep moving things around to figure out the configuration you like best! Get creative! You don't have to use things for their \"intended\" function. Rearrange your artwork for a different feel. You don't have to add new artwork to your room to give it a different feel. Simply try new arrangements! For instance, group it all together on wall to make a bold statement. Alternatively, arrange a large piece behind your bed and then use smaller pieces on the opposite wall to balance it out. Play around and try different things. You never know what will catch your attention. Pick a color theme to create a cohesive look. Limiting the colors you use will help your room feel \"decorated,\" not just thrown together. Opt for just a couple of bright or bold colors, and then you can even out the rest of the room with neutrals. For instance, try complementary colors, like purple and yellow, red and green, or blue and orange. Alternatively, try analogous colors, colors that are nearby on the color wheel, such as pink, red, and orange, or purple, blue-purple, and blue. Then use grey, tan, white, black, or other neutrals as your background. You could also just opt for the primary colors, red, blue, and yellow, for a very bright effect. Adding Color to the Walls Hang up a colorful quilt, sheet, or blanket on 1 wall. Many quilts and sheets have pretty patterns that can make a colorful statement. Try centering one behind your bed to create a focal point for your room, for instance. You can nail or pin up the fabric if you don't mind putting a few holes in it. You can also safety pin it around a curtain rod, then hang the rod from hooks. Paint a single wall or even a single stripe for a cheap option. If you can't afford much paint, don't worry. Try painting an accent wall, for instance. You can even just paint a large stripe down the wall behind your bed as a focal point. These options don't take much paint, but they can make a big difference to your room. Make sure to use painter's tape to block off the area you want to paint. That way, you won't go out of the boundaries you set. Buy paint on sale or that's been mixed wrong if you want to paint the whole room. If the store doesn't mix the color right, it has to do it again. The \"mistake\" paint is usually then put on discount. You can find a variety of colors, but you have to go with an open mind, as you'll have fewer options. You can also look for paint sales, which often happen around holidays, particularly during the summer. Use stencils or paint a mural. Pick up a set of stencils, and use them to create a design on part of your wall. For instance, you could create a large floral arrangement, a funky collection of animals, or a series of feathers. Sketch the design out in pencil first to be sure you like it! You could also use acrylic paints to draw something fun on one wall or in one corner. Alternatively, try adding a series of shapes up a wall in 1 or 2 colors, such as hearts or diamonds. Create your own abstract art on foam board. You can pick up poster-sized foam board from the dollar store or another cheap store. Then, create your own art! Add blocks of color across the board at a diagonal, paint stripes, or simply let your imagination guide you! Once you're done, hang it on the wall with double-sided tape or adhesive strips. Another option is try concentric circles or squares or paint your own sunset. Frame small prints and make a collage on your wall. Prints are usually fairly cheap, so you can get small ones from local artists. Then, purchase cheap frames at a dollar store. Group them together on your wall, and it will work like a much larger piece of art. Try to put pieces together that have similar themes, moods, or colors. Another option is frame cheap pieces of scrapbook paper from the craft store. These pages cost less than a dollar and come in all kinds of colors and patterns! Cover all or part of a wall in paper. Buy pretty scrapbook paper or tear up a used book that's seen better days. Then, you can either use double-sided tape or a cornstarch paste to adhere the paper to the wall. You can cover a large area with book pages. Both of these fixes are temporary, so you can take them down and redo them when you want! Making Old Items Look New Cover your lampshades with new fabric. Choose a thin, light-colored fabric so you still get some light through it. Measure out the fabric and wrap it around the lamp. Use sewing glue to hold it in place, and tuck the edges under to form \"seams.\" Cut the extra fabric off  at the top and bottom and glue it over the edge on the inside. Change up your throw pillows with new fabric. If you have throw pillows on your bed or chair, simply adding new covers can make a huge difference to the way your room looks. Measure the pillow and cut 2 pieces of fabric with an extra 1 inch (2.5 cm) on each side. Turn the fabric inside out and match up the edges. Sew along 3 sides and turn the pillow cover right-side out. Stuff your pillow inside the cover, and then sew a slip stitch along the final edge. Look for clearance fabric at the craft store. You'll find odds and ends of fabric for less. You can also use cheap sheets from the thrift store to recover pillows. To sew a slip stitch, fold the edges of the seam over like the ones on the other sides of the pillow. Tie a knot in your thread and pull your needle through the inside edge of one side of the seam, starting in one corner. Run it through the inside edge on the other side of the seam. Keep going back and forth all along the seam to sew it up, knotting it at the end to hold it in place. Tuck the knot inside the pillow. Get new bedding to transform the look of your bed. Your bed is the center of your room, so when you change it up, you change the whole feel. Try changing out your sheets and comforter/duvet for a whole new look for your room! Bedding can be reasonable if you shop smartly at big box stores or online. You can even find it at thrift stores, but make sure to wash it in hot water before you use it! Update your furniture with paint or new hardware. When painting, unscrew the handles and take out any drawers. Fill in any holes or scratches with wood putty, and then sand the surface down with 150-grit sandpaper so it accepts paint. Use a paintbrush to apply your new paint; opt for indoor acrylic paint or latex paint. You may need to apply more than one coat for an even finish. For a smoother surface, apply primer first. Always work in a ventilated area. You can even try spray painting your furniture! When spray painting, make sure to hold the can at least 6 inches (15 cm) from the work surface and keep it continually moving to get an even coat. You can also buy new handles for your dressers and other furniture. The hardware store sells these pretty cheaply, or you can look online. Update old lamps with spray paint. Pick a spray paint that's meant for the material of the lamps, such as one meant for metal if they're brass. Take the lamp apart, and then use the spray paint to add a new color to the lamp! Put the lamp back together when you're done. This works best for standard table lamps with a lampshade. Make sure to take the lampshade off. Always spray in a well-ventilated area, holding the spray paint at least 6 inches (15 cm) from the surface. Keep moving the can when spraying to get an even coat. You may need to do multiple coats. For a smoother finish, try wet sanding the paint with a very fine grit wet sandpaper once the paint is dry. Adding Fun Decor Pop a new, small rug on the floor to update the look. Whether you have worn-out carpet or hardwood floors, you can make them look new with a rug on top. Rugs can get expensive, so try going to a discount store and opting for a small rug. Even a tiny one can jazz up your floor! Place it along one side of your bed so it acts as a floor mat or throw it in the center of the room to add pizzazz to a larger area. Put a throw over the end of your bed for a pop of color. Throw blankets are fairly cheap. You can even get small, fleece ones for $5 USD or so in the winter. Pick a color that goes with your theme, and then use the blanket to add some of that color to your space! If you have yarn around, you could also learn to crochet or knit, and then make yourself a small blanket. Alternatively, buy a piece of fleece fabric from a craft store. It doesn't unravel at the edges, so if you cut it evenly, you can just fold it to create a splash of color at the foot of your bed. Hit thrift stores and vintage stores for fun knickknacks. You can find fun and funky items to add pops of color to your space. Look for items that fit the theme you're going for, either in color, shape, or style. Also, try re-purposing containers and using them in new and unexpected ways! For instance, use a vintage teacup to hold your bracelets or find a fun tray to gather all your odds and ends. If you're going for a cat theme, look for fun knickknacks with cats on them! Garage and yard sales are also a good source of vintage knickknacks. Ask your relatives if they want to part with any of their decor. Sometimes, people are just getting tired of what they have around the house, and they may be willing to give it to you! Of course, be polite when asking and graciously accept what they give you. You could put a call out on a social media for any knickknacks people are getting rid of, such as \"I'm looking to redecorate my bedroom! Is anyone getting rid of knickknacks or decorations in their household?\" You could also check your attack or storage areas in your home to see if you have anything you can repurpose. Create a shelf or a tray out of a cheap springform pan. You can likely find one of these at the dollar store. Turn it on its side and hang it on the wall. Put something small inside like a succulent for a cute little display! You can even spray paint it for some more pizzazz or add a small string of battery-powered lights. You can do something similar with other cheap baking trays. Spray paint a rectangular baking pan to use as a place to gather odds and ends on your dresser, for instance! Put a few small plants in a sunny corner. Live plants really liven up a room, and they're fairly inexpensive. All you need is a container with a drainage hole in it, some soil, and the plant. Try some small succulents, small ferns, or ivy, for instance. You can use many things as containers, including teacups, mugs, spray painted food cans, or small glass jars. Just be sure to drill some holes in the bottom for drainage. Another option is to get a pretty vase and add some fake flowers. That way, you don't have to water them! Scatter some cheap lighting around your room. If all you have is a harsh overhead light, add some lamps and wall lighting to make your room feel cozier. Even a cheap string of patio lights strung along the top of your headboard can add a romantic feeling to your room. Also, try adding some small desk lamps in various places or a cheap kit that you attach to the wall, such as a colorful paper star lantern.",
  "tyn_model":[
    "fabric",
    "paint",
    "pillow",
    "spray paint",
    "bed",
    "blanket",
    "sheets",
    "decorations",
    "furniture",
    "desk",
    "artwork",
    "stencils",
    "foam board",
    "scrapbook paper",
    "throw pillows",
    "containers",
    "tray",
    "plants",
    "organizers",
    "chair",
    "bookcase",
    "quilt",
    "quilts",
    "curtain rod",
    "painter's tape",
    "feathers",
    "pencil",
    "acrylic paints",
    "frames",
    "paper",
    "cornstarch paste",
    "sewing glue",
    "pillows",
    "thread",
    "needle",
    "wood putty",
    "150-grit sandpaper",
    "paintbrush",
    "acrylic paint",
    "latex paint",
    "primer",
    "rugs",
    "rug",
    "throw blankets",
    "yarn",
    "fleece fabric",
    "teacup",
    "springform pan",
    "baking trays",
    "baking pan",
    "container",
    "soil",
    "teacups",
    "mugs",
    "spray painted food cans",
    "vase",
    "water",
    "lamps"
  ],
  "tyn_section":[

  ]
}