{
  "title":"How to Dress Up a T‐Shirt",
  "url":"https://www.wikihow.com/Dress-Up-a-T%E2%80%90Shirt",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects"
  ],
  "methods":[
    {
      "name":"Choosing Tops to Layer With",
      "steps":[
        {
          "headline":"Wear a collared shirt underneath for a dressy touch.",
          "description":"Choose a short-sleeve or long-sleeve shirt with a collar to add a dressy layer to your outfit. This can be a button-down or polo, for instance. Put on the collared shirt first, then place the tee over top. This adds a more professional touch to your outfit, making it great for a night out or a dinner date. To keep a neat and tidy appearance, choose a plain, solid-colored T-shirt. You can wear this with jeans or trousers, for instance."
        },
        {
          "headline":"Wear a button-down open over top for a polished layer.",
          "description":"Choose a striped, stylish button-down or a plaid, colorful flannel for another layer. Put on your T-shirt first, then put your arms through the sleeves of your outer layer. Don’t button up the shirt, so you can still see the tee underneath. This adds a refined touch to your outfit, making your T-shirt appear a bit dressier. Wear a flannel shirt with your T-shirt if you are going to a concert or hanging out with friends. Go with a professional button-down if you want to wear this look to the office on casual Friday."
        },
        {
          "headline":"Add a cardigan sweater to your ensemble for a business-casual look.",
          "description":"Cardigans are warm, button-down sweaters that look great with T-shirts. Go with a fitted cardigan for a polished look, or try an oversized, long cardigan for a stylish accent. This layering piece ties your look together, so your favorite T-shirt will look great whether you are heading to work or running errands. Wear a colored cardigan with a neutral tee if you want to brighten up your look. Pick a red, blue, or purple sweater, for instance. Throw on a neutral cardigan if you want a subtle outfit. Choose shades like cream, black, or brown."
        },
        {
          "headline":"Throw on a jacket or blazer for a professional touch.",
          "description":"Adding a blazer instantly makes your outfit more formal. If you have a plain shirt, you can wear a striped, plaid, or textured jacket. If you are wearing a striped or polka-dotted shirt, pair this with a plain blazer. This is a great idea if you want to look professional in the workplace or dress for a lunch meeting."
        },
        {
          "headline":"Pair your tee with a vest for a stylish layer.",
          "description":"If your shirt has a pattern or many colors, choose a neutral vest. If your shirt is plain and you want to add some embellishment, choose a vest with a fun pattern or interesting texture. Vests helps your shirt look less casual, making this a great option for a night out, for school, or for work. For example, wear skinny jeans with a red-and-navy striped tee and a navy vest."
        },
        {
          "headline":"Rock a T-shirt as a dress if it is long enough.",
          "description":"If you have a large, oversized shirt that covers you up enough, wear the tee as a dress! You can pair the shirt with stylish leggings. Or, you can purchase a T-shirt style dress for a fun, flirty option. To check the length, put on the shirt and let your arms hang straight by your sides. If your fingertips come further than the end of the shirt, it is too short. If you think your  T-shirt dress is still not fancy enough, try adding layers and accessories until it fits your formal needs. For instance, add a jacket and a pair of pumps."
        }
      ]
    },
    {
      "name":"Picking Bottoms for Your Outfit",
      "steps":[
        {
          "headline":"Go with tailored, well-fitting jeans to dress up your casual looks.",
          "description":"If you want to elevate your casual style, choose jeans that have a modern cut and fit your body well. To choose the best fit, try on several styles and select the pair that feels the best. Try a tapered, skinny jean for a modern style, or try a flared or bootcut pair for a classic look. Measure your waist and inseam with a tape measure to find your ideal jean size. In addition, try tucking in your T-shirt. This can make your outfit look pulled together. Dark-washed denim is a flattering option that you can wear with many outfits, dressy or casual. If your jeans are too tight or too loose, they may look sloppy rather than dressy."
        },
        {
          "headline":"Choose a pair of trousers for a professional style.",
          "description":"Dress pants put off a more professional vibe than jeans or leggings. Choose a khaki, brown, grey, navy, or black pair of trousers. This is an easy ensemble that is dressy enough for most business-casual office environments. If you want to style your shirt professionally, put on a vest, blazer, or cardigan over top."
        },
        {
          "headline":"Pair your tee with a stylish skirt for a upscale outfit.",
          "description":"A skirt is a polished bottom option that works great to dress up your favorite tee. You can choose a knee-length, A-line skirt to wear to the office, or go with a pencil skirt or mini skirt to wear for a night out. In addition, consider wearing a leather or fringe skirt out to the bar or club."
        }
      ]
    },
    {
      "name":"Accessorizing Your T-Shirt",
      "steps":[
        {
          "headline":"Wear a fashionable coat with your outfit for a classic touch.",
          "description":"If you aren’t wearing a blazer or jacket already, an overcoat or trench coat can be the instant upgrade you need! Choose a long coat in a bright or neutral color for a stylish outer layer. For instance, a red trench coat can look polished and modern. This is a good idea for the fall and winter or on rainy days."
        },
        {
          "headline":"Tie a scarf around your neck to add interest to your outfit.",
          "description":"Scarves add pattern, texture, and color to your outfit, which is helpful if you want to take your tee to the next level. Choose a thin, airy scarf on warm days, or go with a Pashmina or wool scarf for fall or winter weather. After you put on your shirt and bottoms, drape the scarf around your neck so both sides are about even. You can also try an infinity scarf, which is 1 piece of fabric sewn into an oval shape. Pashminas are very soft scarves made from the wool of the Kashmir Pashmina goat. For example, pair a pastel, floral scarf with white T-shirt, blue cardigan, and dark denim jeans."
        },
        {
          "headline":"Try wearing a large, statement necklace for a touch of glam.",
          "description":"Choose to wear either a 16–20 in (41–51 cm) necklace for a collarbone length, or go with a 22 in (56 cm) or longer necklace for a lengthy option. Both look great to add some embellishment and interest to your ensemble. Attractive options include necklaces with bright colors, jewels, or rhinestones. For instance, choose a blue and navy bedazzled necklace, and wear this with a plain white tee and a floral skirt. In addition, you can wear multiple necklaces to make a multi-layered look. Select 1-3 necklaces in various lengths, and wear them all together."
        },
        {
          "headline":"Choose dress shoes to finish your look.",
          "description":"You can easily dress up your T-shirt by selecting fancy footwear. Choose shoes such as heels, flats, Oxfords, or Brogues for a dressier option than sneakers or sandals. For subtle outfits, choose a neutral shoe, like tan, black, or navy. If you want a pop of color, consider a brightly-colored or patterned shoe."
        },
        {
          "headline":"Add some funky sunglasses for a stylish addition.",
          "description":"A bold, fancy pair of  sunglasses can add a great finishing touch to your outfit. Choose a colored pair, a stylish set, or those with an oversized look. This is particularly a good idea on sunny, bright days in the summer. For instance, choose an oversized, cat-eye pair for a retro look. You can choose a colorful pair, such as red or yellow, for a splash of color."
        }
      ]
    }
  ],
  "text":" Choosing Tops to Layer With Wear a collared shirt underneath for a dressy touch. Choose a short-sleeve or long-sleeve shirt with a collar to add a dressy layer to your outfit. This can be a button-down or polo, for instance. Put on the collared shirt first, then place the tee over top. This adds a more professional touch to your outfit, making it great for a night out or a dinner date. To keep a neat and tidy appearance, choose a plain, solid-colored T-shirt. You can wear this with jeans or trousers, for instance. Wear a button-down open over top for a polished layer. Choose a striped, stylish button-down or a plaid, colorful flannel for another layer. Put on your T-shirt first, then put your arms through the sleeves of your outer layer. Don’t button up the shirt, so you can still see the tee underneath. This adds a refined touch to your outfit, making your T-shirt appear a bit dressier. Wear a flannel shirt with your T-shirt if you are going to a concert or hanging out with friends. Go with a professional button-down if you want to wear this look to the office on casual Friday. Add a cardigan sweater to your ensemble for a business-casual look. Cardigans are warm, button-down sweaters that look great with T-shirts. Go with a fitted cardigan for a polished look, or try an oversized, long cardigan for a stylish accent. This layering piece ties your look together, so your favorite T-shirt will look great whether you are heading to work or running errands. Wear a colored cardigan with a neutral tee if you want to brighten up your look. Pick a red, blue, or purple sweater, for instance. Throw on a neutral cardigan if you want a subtle outfit. Choose shades like cream, black, or brown. Throw on a jacket or blazer for a professional touch. Adding a blazer instantly makes your outfit more formal. If you have a plain shirt, you can wear a striped, plaid, or textured jacket. If you are wearing a striped or polka-dotted shirt, pair this with a plain blazer. This is a great idea if you want to look professional in the workplace or dress for a lunch meeting. Pair your tee with a vest for a stylish layer. If your shirt has a pattern or many colors, choose a neutral vest. If your shirt is plain and you want to add some embellishment, choose a vest with a fun pattern or interesting texture. Vests helps your shirt look less casual, making this a great option for a night out, for school, or for work. For example, wear skinny jeans with a red-and-navy striped tee and a navy vest. Rock a T-shirt as a dress if it is long enough. If you have a large, oversized shirt that covers you up enough, wear the tee as a dress! You can pair the shirt with stylish leggings. Or, you can purchase a T-shirt style dress for a fun, flirty option. To check the length, put on the shirt and let your arms hang straight by your sides. If your fingertips come further than the end of the shirt, it is too short. If you think your  T-shirt dress is still not fancy enough, try adding layers and accessories until it fits your formal needs. For instance, add a jacket and a pair of pumps. Picking Bottoms for Your Outfit Go with tailored, well-fitting jeans to dress up your casual looks. If you want to elevate your casual style, choose jeans that have a modern cut and fit your body well. To choose the best fit, try on several styles and select the pair that feels the best. Try a tapered, skinny jean for a modern style, or try a flared or bootcut pair for a classic look. Measure your waist and inseam with a tape measure to find your ideal jean size. In addition, try tucking in your T-shirt. This can make your outfit look pulled together. Dark-washed denim is a flattering option that you can wear with many outfits, dressy or casual. If your jeans are too tight or too loose, they may look sloppy rather than dressy. Choose a pair of trousers for a professional style. Dress pants put off a more professional vibe than jeans or leggings. Choose a khaki, brown, grey, navy, or black pair of trousers. This is an easy ensemble that is dressy enough for most business-casual office environments. If you want to style your shirt professionally, put on a vest, blazer, or cardigan over top. Pair your tee with a stylish skirt for a upscale outfit. A skirt is a polished bottom option that works great to dress up your favorite tee. You can choose a knee-length, A-line skirt to wear to the office, or go with a pencil skirt or mini skirt to wear for a night out. In addition, consider wearing a leather or fringe skirt out to the bar or club. Accessorizing Your T-Shirt Wear a fashionable coat with your outfit for a classic touch. If you aren’t wearing a blazer or jacket already, an overcoat or trench coat can be the instant upgrade you need! Choose a long coat in a bright or neutral color for a stylish outer layer. For instance, a red trench coat can look polished and modern. This is a good idea for the fall and winter or on rainy days. Tie a scarf around your neck to add interest to your outfit. Scarves add pattern, texture, and color to your outfit, which is helpful if you want to take your tee to the next level. Choose a thin, airy scarf on warm days, or go with a Pashmina or wool scarf for fall or winter weather. After you put on your shirt and bottoms, drape the scarf around your neck so both sides are about even. You can also try an infinity scarf, which is 1 piece of fabric sewn into an oval shape. Pashminas are very soft scarves made from the wool of the Kashmir Pashmina goat. For example, pair a pastel, floral scarf with white T-shirt, blue cardigan, and dark denim jeans. Try wearing a large, statement necklace for a touch of glam. Choose to wear either a 16–20 in (41–51 cm) necklace for a collarbone length, or go with a 22 in (56 cm) or longer necklace for a lengthy option. Both look great to add some embellishment and interest to your ensemble. Attractive options include necklaces with bright colors, jewels, or rhinestones. For instance, choose a blue and navy bedazzled necklace, and wear this with a plain white tee and a floral skirt. In addition, you can wear multiple necklaces to make a multi-layered look. Select 1-3 necklaces in various lengths, and wear them all together. Choose dress shoes to finish your look. You can easily dress up your T-shirt by selecting fancy footwear. Choose shoes such as heels, flats, Oxfords, or Brogues for a dressier option than sneakers or sandals. For subtle outfits, choose a neutral shoe, like tan, black, or navy. If you want a pop of color, consider a brightly-colored or patterned shoe. Add some funky sunglasses for a stylish addition. A bold, fancy pair of  sunglasses can add a great finishing touch to your outfit. Choose a colored pair, a stylish set, or those with an oversized look. This is particularly a good idea on sunny, bright days in the summer. For instance, choose an oversized, cat-eye pair for a retro look. You can choose a colorful pair, such as red or yellow, for a splash of color.",
  "tyn_model":[
    "shirt",
    "scarf",
    "cardigan",
    "vest",
    "jeans",
    "necklace",
    "blazer",
    "necklaces",
    "jacket",
    "trousers",
    "sunglasses",
    "button-down or polo",
    "button-down",
    "t-",
    "cardigan sweater",
    "cardigans",
    "shirts",
    "vests",
    "skinny jeans",
    "t-shirt",
    "t-shirt style dress",
    "t-shirt dress",
    "pumps",
    "jean",
    "tape measure",
    "denim",
    "skirt",
    "trench coat",
    "scarves",
    "infinity scarf",
    "fabric",
    "jewels",
    "sneakers",
    "sandals"
  ],
  "tyn_section":[

  ]
}