{
  "title":"How to Do the Boolprop Cheat on the Sims 2",
  "url":"https://www.wikihow.com/Do-the-Boolprop-Cheat-on-the-Sims-2",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "PC Simulation",
    "Sims",
    "Sims 2"
  ],
  "steps":[
    {
      "headline":"Go to the neighborhood of your choice, press Ctrl + Shift + C in that order.",
      "description":"A box will appear at the top of the screen."
    },
    {
      "headline":"Type in or paste - boolProp testingCheatsEnabled true.",
      "description":"Enter it exactly as you see it with the spaces."
    },
    {
      "headline":"Press the enter key.",
      "description":"If you've done it right the cheat box will close by its self, if you've done it wrong the box will become bigger and you will see many things in it."
    },
    {
      "headline":"Go to create a family or to a family that's already been made.",
      "description":"To create a family you will need to type in the family's name and press Shift + N. A box will appear telling you that you've unlocked new hairstyles, skin colors, and clothes. If you're in a family already, you can do many things with it :\nChange a Sim's fitness level. Press shift and click on a Sim and select the option Change Fitness to change it to the way you want. Kill any Sim. Select the option Kill and choose any option."
    },
    {
      "headline":"Change your needs by dragging the bar to where you want it.",
      "description":"You can also do this with skills and relationships, as well as hobbies if you have the FreeTime expansion pack."
    },
    {
      "headline":"If you have the boolProp cheat on in live mode you can get special hairstyles.Different colors like purple, blue and green are some of them.To do that, first do number one, two three and then go to your family.click on the mirror, and click change appearance.then next to the different hairstyles (Black,Brown,Blond and Ginger) there should be a different icon.Click on that and you've got the different hairstyles!",
      "description":""
    },
    {
      "headline":"Let your imagination wander and have fun!",
      "description":""
    }
  ],
  "text":" Go to the neighborhood of your choice, press Ctrl + Shift + C in that order. A box will appear at the top of the screen. Type in or paste - boolProp testingCheatsEnabled true. Enter it exactly as you see it with the spaces. Press the enter key. If you've done it right the cheat box will close by its self, if you've done it wrong the box will become bigger and you will see many things in it. Go to create a family or to a family that's already been made. To create a family you will need to type in the family's name and press Shift + N. A box will appear telling you that you've unlocked new hairstyles, skin colors, and clothes. If you're in a family already, you can do many things with it :\nChange a Sim's fitness level. Press shift and click on a Sim and select the option Change Fitness to change it to the way you want. Kill any Sim. Select the option Kill and choose any option. Change your needs by dragging the bar to where you want it. You can also do this with skills and relationships, as well as hobbies if you have the FreeTime expansion pack. If you have the boolProp cheat on in live mode you can get special hairstyles.Different colors like purple, blue and green are some of them.To do that, first do number one, two three and then go to your family.click on the mirror, and click change appearance.then next to the different hairstyles (Black,Brown,Blond and Ginger) there should be a different icon.Click on that and you've got the different hairstyles!  Let your imagination wander and have fun! ",
  "tyn_model":[
    "mirror"
  ],
  "tyn_section":[

  ]
}