{
  "title":"How to Make a Mother's Day Card",
  "url":"https://www.wikihow.com/Make-a-Mother%27s-Day-Card",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Homemade Cards",
    "Making Cards for Family"
  ],
  "methods":[
    {
      "name":"Making a Photographic Card",
      "steps":[
        {
          "headline":"Get a piece of construction paper or cardstock.",
          "description":"You can find plenty of different options at any arts and craft store. For this card you will be placing a photo over the outside of the card but it’s nice to use quality paper so the whole card looks well put together."
        },
        {
          "headline":"Print out your photo.",
          "description":"You can simply print a photo on regular paper but it’s nice to use photo paper. You can choose from a variety of types of paper from glossy to matte depending on what you want. Or, go to a pharmacy like Walgreens to get it printed for best results. You can use a photo that’s already been taken of you and your mom. Or, you can go out and take a special photo made just for the card. If you have siblings consider gathering your brothers or sisters, and even your other parent, and taking a photo together. You can also make signs that say “Happy Mother’s Day!” The hold the signs up in the photo."
        },
        {
          "headline":"Glue your photo onto the outside of the card.",
          "description":"Use a glue stick or something similar so that the photo lays flat and doesn’t cause the glue to clump on the edges. Place your photo so that you have room below it or on the sides to add some more material to give your card dimension. Alternatively, you can get some nice pins and pin the photo to the card."
        },
        {
          "headline":"Add some extra details.",
          "description":"Now that the photo is placed onto the card it’s time to add a few more elements to bring the card together. Get a ribbon, some scrapbook paper, or even a small charm that you can add to the outside."
        },
        {
          "headline":"Write a nice note.",
          "description":"With your card looking well-made and tailored to your mom all that’s left to do is write her a nice note. Think about what your mother means to you and write her a note that lets her know how grateful you are for everything she does. Don’t forget to sign it at the bottom."
        }
      ]
    },
    {
      "name":"Making a Simple Textured Card",
      "steps":[
        {
          "headline":"Get some textured cardstock and scrapbook paper.",
          "description":"Look for paper that’s one single color to use as the base part of your card. Then try to find some patterned scrapbook paper that compliments the color of your card. Find out what your mom’s favorite color is if you don’t already know. Try to get some paper in this color as an added gesture. You can also use ribbons if you wish."
        },
        {
          "headline":"Glue the different pieces of paper together.",
          "description":"Fold your thick piece of cardstock in half to make your card. Then cut strips of your scrapbook paper to adhere to the cardstock. You can cut the strips at different widths so that you can layer each one over the last one. This will give a nice texture and look to the card."
        },
        {
          "headline":"Add a ribbon or a small stamped message to the front.",
          "description":"To finish the outside of your card, add something like a ribbon with a bow on it or a little message to your mom. You can also write something like “To Mom” with a fine-point marker and then punch holes through it with a pin to add even more texture and variety. Small gems can also be an added touch that ties the card together."
        },
        {
          "headline":"Write her a nice note or poem.",
          "description":"On the inside write your mom a nice message showing her how much you care. If you’re feeling really creative, you can even write her a poem."
        }
      ]
    },
    {
      "name":"Making a Sewn Phrase Card",
      "steps":[
        {
          "headline":"Get a nice blank card and matching envelope.",
          "description":"For this card, a simple, blank card works really well. There’s no need to get flashy. A nice thick brown or beige card with some texture to it will work well."
        },
        {
          "headline":"Write out the phrase you want to sew into the card with a fine-point marker.",
          "description":"Using a fine-point marker write out, in your best handwriting, a phrase or word that you think fits your mom. It could be something like “Love You,” or “Love,” or even “Thanks!”"
        },
        {
          "headline":"Poke holes over the phrase you’ve written.",
          "description":"Using a pin, poke the holes about a ¼ inch apart. Make sure that your card is open and you’re only poking holes through one piece of the paper. Take your time and go slow. If you rush you could miss a few areas. Just follow your tracing. When poking the holes, do it on top of a piece of cardboard as a cushion. You don’t have to be super precise with the holes, just aim to evenly space each one out. Be very careful when poking the holes as you could prick yourself."
        },
        {
          "headline":"Layer two strings of embroidery floss and thread through a needle.",
          "description":"Use two pieces of floss so that your word or phrase really stands out. Make sure to tie a knot at the other end of your floss. Give yourself plenty of floss to work with. You’ll cut away the extra floss at the end. You can get embroidery floss in a variety of colors. Get a color that your mom would like, like her favorite color. You could also get two different colors if you wish and combine."
        },
        {
          "headline":"Pull the floss through the first hole so that the knot hits the back of the card.",
          "description":"Once you feel the knot hit the back, or inside, of the card, continue threading the needle and floss through the rest of the holes. If you wrote in cursive and have parts of letters or words that overlap, make sure that you bring the floss over and not under the area you already threaded. This will make the card look neater. Sew through the rest of the holes. Once you’re finished, tie off a knot and cut extra floss."
        },
        {
          "headline":"Write your mom a nice note on the inside.",
          "description":"Finish your card by writing a nice note on the inside. Try to write her a note that reflects the word or phrase you sewed on the outside. Once you’ve written your note, you’re ready to place the card in the envelope and give it to your mom."
        }
      ]
    }
  ],
  "text":" Making a Photographic Card Get a piece of construction paper or cardstock. You can find plenty of different options at any arts and craft store. For this card you will be placing a photo over the outside of the card but it’s nice to use quality paper so the whole card looks well put together. Print out your photo. You can simply print a photo on regular paper but it’s nice to use photo paper. You can choose from a variety of types of paper from glossy to matte depending on what you want. Or, go to a pharmacy like Walgreens to get it printed for best results. You can use a photo that’s already been taken of you and your mom. Or, you can go out and take a special photo made just for the card. If you have siblings consider gathering your brothers or sisters, and even your other parent, and taking a photo together. You can also make signs that say “Happy Mother’s Day!” The hold the signs up in the photo. Glue your photo onto the outside of the card. Use a glue stick or something similar so that the photo lays flat and doesn’t cause the glue to clump on the edges. Place your photo so that you have room below it or on the sides to add some more material to give your card dimension. Alternatively, you can get some nice pins and pin the photo to the card. Add some extra details. Now that the photo is placed onto the card it’s time to add a few more elements to bring the card together. Get a ribbon, some scrapbook paper, or even a small charm that you can add to the outside. Write a nice note. With your card looking well-made and tailored to your mom all that’s left to do is write her a nice note. Think about what your mother means to you and write her a note that lets her know how grateful you are for everything she does. Don’t forget to sign it at the bottom. Making a Simple Textured Card Get some textured cardstock and scrapbook paper. Look for paper that’s one single color to use as the base part of your card. Then try to find some patterned scrapbook paper that compliments the color of your card. Find out what your mom’s favorite color is if you don’t already know. Try to get some paper in this color as an added gesture. You can also use ribbons if you wish. Glue the different pieces of paper together. Fold your thick piece of cardstock in half to make your card. Then cut strips of your scrapbook paper to adhere to the cardstock. You can cut the strips at different widths so that you can layer each one over the last one. This will give a nice texture and look to the card. Add a ribbon or a small stamped message to the front. To finish the outside of your card, add something like a ribbon with a bow on it or a little message to your mom. You can also write something like “To Mom” with a fine-point marker and then punch holes through it with a pin to add even more texture and variety. Small gems can also be an added touch that ties the card together. Write her a nice note or poem. On the inside write your mom a nice message showing her how much you care. If you’re feeling really creative, you can even write her a poem. Making a Sewn Phrase Card Get a nice blank card and matching envelope. For this card, a simple, blank card works really well. There’s no need to get flashy. A nice thick brown or beige card with some texture to it will work well. Write out the phrase you want to sew into the card with a fine-point marker. Using a fine-point marker write out, in your best handwriting, a phrase or word that you think fits your mom. It could be something like “Love You,” or “Love,” or even “Thanks!” Poke holes over the phrase you’ve written. Using a pin, poke the holes about a ¼ inch apart. Make sure that your card is open and you’re only poking holes through one piece of the paper. Take your time and go slow. If you rush you could miss a few areas. Just follow your tracing. When poking the holes, do it on top of a piece of cardboard as a cushion. You don’t have to be super precise with the holes, just aim to evenly space each one out. Be very careful when poking the holes as you could prick yourself. Layer two strings of embroidery floss and thread through a needle. Use two pieces of floss so that your word or phrase really stands out. Make sure to tie a knot at the other end of your floss. Give yourself plenty of floss to work with. You’ll cut away the extra floss at the end. You can get embroidery floss in a variety of colors. Get a color that your mom would like, like her favorite color. You could also get two different colors if you wish and combine. Pull the floss through the first hole so that the knot hits the back of the card. Once you feel the knot hit the back, or inside, of the card, continue threading the needle and floss through the rest of the holes. If you wrote in cursive and have parts of letters or words that overlap, make sure that you bring the floss over and not under the area you already threaded. This will make the card look neater. Sew through the rest of the holes. Once you’re finished, tie off a knot and cut extra floss. Write your mom a nice note on the inside. Finish your card by writing a nice note on the inside. Try to write her a note that reflects the word or phrase you sewed on the outside. Once you’ve written your note, you’re ready to place the card in the envelope and give it to your mom.",
  "tyn_model":[
    "floss",
    "paper",
    "scrapbook paper",
    "ribbon",
    "fine-point marker",
    "glue",
    "card",
    "“love",
    "” or",
    "embroidery floss",
    "construction paper",
    "photo paper",
    "“happy",
    "” the",
    "glue stick",
    "pins",
    "ribbons",
    "cardstock",
    "“to",
    "” with",
    "“thanks",
    "” poke",
    "pin",
    "cardboard",
    "thread"
  ],
  "tyn_section":[

  ]
}