{
  "title":"How to Easily Beat Nancy MI847J on Tekken 6",
  "url":"https://www.wikihow.com/Easily-Beat-Nancy-MI847J-on-Tekken-6",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "steps":[
    {
      "headline":"Play in Arcade Battle mode.",
      "description":"Choose the arcade mode, since this is the only game mode that will allow you to fight with Nancy-MI847J. After selecting Arcade Battle mode, you will then be greeted with the character selection screen."
    },
    {
      "headline":"Choose Jack-6.",
      "description":"There are other characters that can do the trick but Jack-6 seems to have the most effective method of beating Nancy-MI847J. He can defeat Nancy-MI847J easily in the fastest way possible, so he really is your best bet."
    },
    {
      "headline":"Get to Nancy.",
      "description":"Fight your way up until you go head-to-head with Nancy-MI847J in an Extra stage. Keep in mind that whatever the outcome of this one-rounder battle is, you will still proceed to the next level."
    },
    {
      "headline":"Execute the Dark Greeting.",
      "description":"At the start of the match, immediately go near Nancy-MI847J and do the Dark Greeting. This is one of Jack-6's heavy damager moves and can be executed by pressing f+4~1 (Tap forward + RK and quickly press LP)."
    },
    {
      "headline":"Sidestep to avoid attacks.",
      "description":"Occasionally, Nancy-MI847J will do a devastating move like shooting out a beam or bullets. In this case, simply stop attacking and do side steps by holding down the up or down button. This will help you dodge and protect yourself."
    },
    {
      "headline":"Spam with the Dark Greeting.",
      "description":"Keep on repeating the Dark Greeting until Nancy-MI847J is destroyed. Keep on attacking even if it seems to be preparing for an attack. Most of its light attacks will be stunned by the Dark Greeting, anyway. Congratulations! You've won!"
    }
  ],
  "text":" Play in Arcade Battle mode. Choose the arcade mode, since this is the only game mode that will allow you to fight with Nancy-MI847J. After selecting Arcade Battle mode, you will then be greeted with the character selection screen. Choose Jack-6. There are other characters that can do the trick but Jack-6 seems to have the most effective method of beating Nancy-MI847J. He can defeat Nancy-MI847J easily in the fastest way possible, so he really is your best bet. Get to Nancy. Fight your way up until you go head-to-head with Nancy-MI847J in an Extra stage. Keep in mind that whatever the outcome of this one-rounder battle is, you will still proceed to the next level. Execute the Dark Greeting. At the start of the match, immediately go near Nancy-MI847J and do the Dark Greeting. This is one of Jack-6's heavy damager moves and can be executed by pressing f+4~1 (Tap forward + RK and quickly press LP). Sidestep to avoid attacks. Occasionally, Nancy-MI847J will do a devastating move like shooting out a beam or bullets. In this case, simply stop attacking and do side steps by holding down the up or down button. This will help you dodge and protect yourself. Spam with the Dark Greeting. Keep on repeating the Dark Greeting until Nancy-MI847J is destroyed. Keep on attacking even if it seems to be preparing for an attack. Most of its light attacks will be stunned by the Dark Greeting, anyway. Congratulations! You've won!",
  "tyn_model":[
    "spam"
  ],
  "tyn_section":[

  ]
}