{
  "title":"How to Install Downloaded Online Games",
  "url":"https://www.wikihow.com/Install-Downloaded-Online-Games",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Electronic Game Strategies",
    "Online Game Strategies"
  ],
  "steps":[
    {
      "headline":"Find the file you just downloaded.",
      "description":"Hopefully you paid attention to the location that you downloaded it to and the name of the file."
    },
    {
      "headline":"Scan the installer file with your antivirus program to ensure that you're not about to destroy your pc.",
      "description":""
    },
    {
      "headline":"Double click the icon for the downloaded file.",
      "description":"This will typically either open the installer automatically, or decompress the file(s) needed to install the program."
    },
    {
      "headline":"Locate the executable file, if files were only uncompressed in the previous step.",
      "description":"It will typically be called setup or install (with a .exe or .com file extension, or possibly a .bat extension, instead). Skip this step if the installer opened automatically."
    },
    {
      "headline":"Pay attention to the installer.",
      "description":"You may want to tell it where to install the program, and where to put icons (i.e. many times it will put an icon in the programs menu, on the taskbar, and on the desktop, which can quickly lead to clutter)."
    },
    {
      "headline":"Complete the installation process and be sure to carefully read any instructions or \"readme\" files when complete.",
      "description":""
    },
    {
      "headline":"Activate the game by selecting it from a menu or double clicking its icon.",
      "description":""
    }
  ],
  "text":" Find the file you just downloaded. Hopefully you paid attention to the location that you downloaded it to and the name of the file. Scan the installer file with your antivirus program to ensure that you're not about to destroy your pc.  Double click the icon for the downloaded file. This will typically either open the installer automatically, or decompress the file(s) needed to install the program. Locate the executable file, if files were only uncompressed in the previous step. It will typically be called setup or install (with a .exe or .com file extension, or possibly a .bat extension, instead). Skip this step if the installer opened automatically. Pay attention to the installer. You may want to tell it where to install the program, and where to put icons (i.e. many times it will put an icon in the programs menu, on the taskbar, and on the desktop, which can quickly lead to clutter). Complete the installation process and be sure to carefully read any instructions or \"readme\" files when complete.  Activate the game by selecting it from a menu or double clicking its icon. ",
  "tyn_model":[
    "antivirus program"
  ],
  "tyn_section":[

  ]
}