{
  "title":"How to Learn About Lighting with TetherPro and Figurines",
  "url":"https://www.wikihow.com/Learn-About-Lighting-with-TetherPro-and-Figurines",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Digital Photography",
    "TetherPro"
  ],
  "steps":[
    {
      "headline":"Get some figurines.",
      "description":"You can find them just about anywhere. The key is something small. You want to set yourself up a small place that you can experiment and learn with. You could even make yourself one."
    },
    {
      "headline":"Get yourself some small reflectors.",
      "description":"Just about anything portable and lightweight will work. Here, a white meat tray is being used."
    },
    {
      "headline":"Have TetherPro on and your camera tethered to your computer.",
      "description":"This is the advantage of figurines. You can do everything in a small area."
    },
    {
      "headline":"Set your camera up on a tripod.",
      "description":"If possible, trigger your camera with a remote of some type. Also, TetherPro can trigger your camera  if you have the remote control activated in it. You will need it activated anyway to use it for learning."
    },
    {
      "headline":"Start moving things around.",
      "description":"Both the reflector and the light. Experiment with different looks and results. When you find something you like, remember how you did it."
    },
    {
      "headline":"Keep an eye on your TetherPro software and compare the various results.",
      "description":"You can also watch your histograms for reference."
    },
    {
      "headline":"Look through your images and find ones you like.",
      "description":""
    }
  ],
  "text":" Get some figurines. You can find them just about anywhere. The key is something small. You want to set yourself up a small place that you can experiment and learn with. You could even make yourself one. Get yourself some small reflectors. Just about anything portable and lightweight will work. Here, a white meat tray is being used. Have TetherPro on and your camera tethered to your computer. This is the advantage of figurines. You can do everything in a small area. Set your camera up on a tripod. If possible, trigger your camera with a remote of some type. Also, TetherPro can trigger your camera  if you have the remote control activated in it. You will need it activated anyway to use it for learning. Start moving things around. Both the reflector and the light. Experiment with different looks and results. When you find something you like, remember how you did it. Keep an eye on your TetherPro software and compare the various results. You can also watch your histograms for reference. Look through your images and find ones you like. ",
  "tyn_model":[
    "figurines",
    "reflectors",
    "white meat tray",
    "tetherpro",
    "reflector",
    "tetherpro software"
  ],
  "tyn_section":[

  ]
}