{
  "title":"How to Design a Swirl Painted Vase",
  "url":"https://www.wikihow.com/Design-a-Swirl-Painted-Vase",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects",
    "Vase Projects"
  ],
  "parts":[
    {
      "name":"Painting the vase",
      "steps":[
        {
          "headline":"Pour the first paint color into the vase.",
          "description":"Depending upon the vase size and the amount of coverage you desire, pour a small amount to coat the bottom but not fill the vase."
        },
        {
          "headline":"Twist the vase around.",
          "description":"Use your hands and wrist to twist or spin the vase so as to distribute the paint along the sides of the vase."
        },
        {
          "headline":"Move the vase in variety of directions to achieve a different design and coverage.",
          "description":""
        },
        {
          "headline":"Allow the paint plenty of time to dry.",
          "description":"If you plan to use only one color, your project is complete once the paint is totally dry. Dry upside down on a piece of paper or paper towel. Excess paint will drip onto the paper. Leave for at least 12 hours, or more if needed."
        },
        {
          "headline":"Add the next paint color once the first coating of paint has completely dried.",
          "description":"It may take up to 24 hours to ensure the paint is ready, but don’t add the next color until you are sure it won’t mingle with the previous color."
        },
        {
          "headline":"Pour a small amount of the second color into the bottom of the vase and use the same technique to swirl it around the base and sides of the vase.",
          "description":"Keep an eye on the exterior of the vase so ensure you can see the new color and it is distributed in the correct areas. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5e\\/Design-a-Swirl-Painted-Vase-Step-4Bullet2-Version-2.jpg\\/v4-459px-Design-a-Swirl-Painted-Vase-Step-4Bullet2-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5e\\/Design-a-Swirl-Painted-Vase-Step-4Bullet2-Version-2.jpg\\/v4-759px-Design-a-Swirl-Painted-Vase-Step-4Bullet2-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        }
      ]
    },
    {
      "name":"Adding decorative touches",
      "steps":[
        {
          "headline":"Add small flourishes or touches of paint to the interior or exterior of the vase using a precision paintbrush.",
          "description":"This step is optional but can complete your look. Add small dots, stars or other symbols or words to personalize the vase. If touch-ups are needed, do these now."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Painting the vase Pour the first paint color into the vase. Depending upon the vase size and the amount of coverage you desire, pour a small amount to coat the bottom but not fill the vase. Twist the vase around. Use your hands and wrist to twist or spin the vase so as to distribute the paint along the sides of the vase. Move the vase in variety of directions to achieve a different design and coverage.  Allow the paint plenty of time to dry. If you plan to use only one color, your project is complete once the paint is totally dry. Dry upside down on a piece of paper or paper towel. Excess paint will drip onto the paper. Leave for at least 12 hours, or more if needed. Add the next paint color once the first coating of paint has completely dried. It may take up to 24 hours to ensure the paint is ready, but don’t add the next color until you are sure it won’t mingle with the previous color. Pour a small amount of the second color into the bottom of the vase and use the same technique to swirl it around the base and sides of the vase. Keep an eye on the exterior of the vase so ensure you can see the new color and it is distributed in the correct areas. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5e\\/Design-a-Swirl-Painted-Vase-Step-4Bullet2-Version-2.jpg\\/v4-459px-Design-a-Swirl-Painted-Vase-Step-4Bullet2-Version-2.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/5\\/5e\\/Design-a-Swirl-Painted-Vase-Step-4Bullet2-Version-2.jpg\\/v4-759px-Design-a-Swirl-Painted-Vase-Step-4Bullet2-Version-2.jpg\",\"smallWidth\":460,\"smallHeight\":306,\"bigWidth\":760,\"bigHeight\":506.31868131868134,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Adding decorative touches Add small flourishes or touches of paint to the interior or exterior of the vase using a precision paintbrush. This step is optional but can complete your look. Add small dots, stars or other symbols or words to personalize the vase. If touch-ups are needed, do these now. Finished. ",
  "tyn_model":[
    "vase",
    "paint",
    "paper towel",
    "precision paintbrush"
  ],
  "tyn_section":[

  ]
}