{
  "title":"How to Make a Sidecar Cocktail",
  "url":"https://www.wikihow.com/Make-a-Sidecar-Cocktail",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Cocktails"
  ],
  "steps":[
    {
      "headline":"Place the lemon on a cutting board.",
      "description":""
    },
    {
      "headline":"Use a small paring knife to slice the lemon in half.",
      "description":""
    },
    {
      "headline":"Squeeze the juice from the lemon into the shaker.",
      "description":"Don’t discard the squeezed portion of the lemon; you will use it to wet the rim of the glass later."
    },
    {
      "headline":"Add ice cubes to your shaker until half-full.",
      "description":""
    },
    {
      "headline":"Pour all of the ingredients into the shaker.",
      "description":"You can obtain your lemon juice from the steps before."
    },
    {
      "headline":"Cover and shake the ingredients vigorously until everything has infused.",
      "description":""
    },
    {
      "headline":"Rub the lemon you used for juice around the rim of your martini glass.",
      "description":""
    },
    {
      "headline":"Place 1 tablespoon (14 g) of granulated sugar on a saucer or in a shallow bowl.",
      "description":""
    },
    {
      "headline":"Twist the rim of your martini glass in the sugar until the entire rim is coated with the sugar.",
      "description":""
    },
    {
      "headline":"Strain the cocktail into a cocktail glass with or without ice.",
      "description":""
    },
    {
      "headline":"Garnish with a lemon, orange or lime rind or a grapefruit, lemon etc.",
      "description":"wedge depending on the effect you want. You can obtain your garnish from your leftover lemon."
    },
    {
      "headline":"Serve and enjoy",
      "description":""
    }
  ],
  "text":" Place the lemon on a cutting board.  Use a small paring knife to slice the lemon in half.  Squeeze the juice from the lemon into the shaker. Don’t discard the squeezed portion of the lemon; you will use it to wet the rim of the glass later. Add ice cubes to your shaker until half-full.  Pour all of the ingredients into the shaker. You can obtain your lemon juice from the steps before. Cover and shake the ingredients vigorously until everything has infused.  Rub the lemon you used for juice around the rim of your martini glass.  Place 1 tablespoon (14 g) of granulated sugar on a saucer or in a shallow bowl.  Twist the rim of your martini glass in the sugar until the entire rim is coated with the sugar.  Strain the cocktail into a cocktail glass with or without ice.  Garnish with a lemon, orange or lime rind or a grapefruit, lemon etc. wedge depending on the effect you want. You can obtain your garnish from your leftover lemon. Serve and enjoy ",
  "tyn_model":[
    "lemon",
    "shaker",
    "martini glass",
    "sugar",
    "small paring knife",
    "ice cubes",
    "lemon juice",
    "granulated sugar",
    "saucer",
    "cocktail glass",
    "ice"
  ],
  "tyn_section":[

  ]
}