{
  "title":"How to Cook Green Beans",
  "url":"https://www.wikihow.com/Cook-Green-Beans",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Rice and Beans"
  ],
  "methods":[
    {
      "name":"Choosing and Preparing Green Beans",
      "steps":[
        {
          "headline":"Choose green beans that are bright and crisp.",
          "description":"The beans should feel firm to the touch. Their color should be even, with no brown spots or discoloration. If you care about presentation, choose beans that look straight rather than crooked. If you'll be cutting the beans into smaller pieces, however, you can pick crooked ones."
        },
        {
          "headline":"Grab a bundle of beans and orient the stems in the same direction.",
          "description":"Pick up a handful of beans. Make sure that all of the stems are facing in the same direction, then lightly tap them against the cutting board to even them out."
        },
        {
          "headline":"Chop the stems off with a single cut.",
          "description":"Hold the bundle against the cutting board with your non-dominant hand. Hold a sharp chef's knife in your dominant hand, and use it to chop the stems off. You can leave the tails on, or you can chop them off too. Repeat this step and the previous step until you have cut all the beans."
        },
        {
          "headline":"Rinse the green beans in cool water.",
          "description":"Place the beans into a colander and rinse them with cool water. Gently shake the colander to dislodge any excess water."
        },
        {
          "headline":"Cut the beans if the recipe calls for it.",
          "description":"Most recipes will require you to leave the beans whole, but some stir fry recipes will ask you to cut them smaller. Read the recipe that you have carefully to find out what to do. If you do decide to cut the beans, make sure that you cut them all the same length, otherwise they will not cook evenly."
        }
      ]
    },
    {
      "name":"Blanching, Steaming, and Boiling Green Beans",
      "steps":[
        {
          "headline":"Blanch green beans if you wish to preserve their color and crispness.",
          "description":"Bring a pot of water to a boil over medium-high heat. Add the beans and allow them to cook, uncovered, for 4 to 5 minutes. Drain the beans, then place them into a large bowl filled with iced water. Let the beans sit in the ice bath for 4 to 5 minutes before draining and using them. If you want to freeze the beans, blanch them for only 3 minutes. Dip them in iced water, dry them off, then freeze them in zippered bags."
        },
        {
          "headline":"Steam green beans for 3 to 5 minutes for a quick and easy meal.",
          "description":"Set a steamer basket into a saucepan filled with 1 inch (2.5 cm) of water. Add the green beans and bring the water to a boil. Cover the saucepan with a tight-fitting lid, and allow the beans to steam over medium heat for 3 to 5 minutes."
        },
        {
          "headline":"Microwave green beans for 3 to 4 minutes if you don't have a stove.",
          "description":"Place the green beans into a microwave-safe dish and add 2 tablespoons (30 milliliters) of water. Cover the dish with plastic wrap, leaving a corner open for the steam to escape. Microwave the beans on high for 3 to 4 minutes. Keep in mind that it is difficult to cook green beans evenly in the microwave."
        },
        {
          "headline":"Boil green beans for 6 minutes if you don’t have a steamer basket.",
          "description":"Fill a pot with enough water to cover the beans by 1 inch (2.5 cm). Add a dash of salt, bring the water to a boil. Add the beans, then boil them until they are tender, about 6 minutes. Drain and serve the beans."
        }
      ]
    },
    {
      "name":"Cooking Green Beans in Other Ways",
      "steps":[
        {
          "headline":"Sauté green beans for 1 to 2 minutes after steaming them.",
          "description":"Steam the green beans first for 4 to 6 minutes, then take them out of the steamer basket. Melt 2 tablespoons (30 grams) of butter in a skillet over medium-high heat. Add the beans, then cook them for 1 to 2 minutes, stirring often. Season the beans with salt and pepper before serving them. Cooking the beans before sautéing will make them more flavorful. Sautéing the beans after cooking will help caramelize and brown them. Season the beans with paprika, red pepper, or garlic powder while sautéing them for extra flavor."
        },
        {
          "headline":"Roast green beans for a warm meal.",
          "description":"Toss 1 pound (450 grams) of green beans with 1 tablespoon (15 milliliters) of oil, ½ teaspoon salt, and ½ teaspoon pepper. Spread the beans in an even layer in a parchment-lined baking pan. Roast them in a preheated oven at 425 °F (218 °C) for 10 to 12 minutes, stirring occasionally. The beans are ready when they are tender and the edges are browned. Use a large enough baking pan so that none of the beans are touching, otherwise they won't brown properly."
        },
        {
          "headline":"Cook green beans in a crock pot for a warm, hearty meal.",
          "description":"Fry and crumble 2½ ounces (75 grams) of bacon. Add it to a 6-quart (5.7-liter) crockpot along with a sliced-up yellow onion, 2 pounds (900 grams) green beans, and 8 cups (1.9 liters) of chicken broth. Season it with salt and pepper, then cover it with a lid. Cook the meal on HIGH for 8 to 10 hours. You can use a drained, 15-ounce (452-gram) jar of cocktail pearl onions and 2½ ounces (75 grams) of pre-cooked bacon pieces instead."
        },
        {
          "headline":"Add green beans to a casserole for a tasty, filling meal.",
          "description":"Cook 12 ounces (340 grams) of green beans in the microwave. Combine them with 10½ ounces (298 grams) of condensed cream of mushroom soup and a dash of black pepper. Transfer everything to a 1-quart (0.9-liter) casserole dish and cover with 1⅓-cups (65 grams) of fresh bread crumbs. Bake the casserole at 350 °F (177 °C) for 25 to 30 minutes."
        }
      ]
    }
  ],
  "text":" Choosing and Preparing Green Beans Choose green beans that are bright and crisp. The beans should feel firm to the touch. Their color should be even, with no brown spots or discoloration. If you care about presentation, choose beans that look straight rather than crooked. If you'll be cutting the beans into smaller pieces, however, you can pick crooked ones. Grab a bundle of beans and orient the stems in the same direction. Pick up a handful of beans. Make sure that all of the stems are facing in the same direction, then lightly tap them against the cutting board to even them out. Chop the stems off with a single cut. Hold the bundle against the cutting board with your non-dominant hand. Hold a sharp chef's knife in your dominant hand, and use it to chop the stems off. You can leave the tails on, or you can chop them off too. Repeat this step and the previous step until you have cut all the beans. Rinse the green beans in cool water. Place the beans into a colander and rinse them with cool water. Gently shake the colander to dislodge any excess water. Cut the beans if the recipe calls for it. Most recipes will require you to leave the beans whole, but some stir fry recipes will ask you to cut them smaller. Read the recipe that you have carefully to find out what to do. If you do decide to cut the beans, make sure that you cut them all the same length, otherwise they will not cook evenly. Blanching, Steaming, and Boiling Green Beans Blanch green beans if you wish to preserve their color and crispness. Bring a pot of water to a boil over medium-high heat. Add the beans and allow them to cook, uncovered, for 4 to 5 minutes. Drain the beans, then place them into a large bowl filled with iced water. Let the beans sit in the ice bath for 4 to 5 minutes before draining and using them. If you want to freeze the beans, blanch them for only 3 minutes. Dip them in iced water, dry them off, then freeze them in zippered bags. Steam green beans for 3 to 5 minutes for a quick and easy meal. Set a steamer basket into a saucepan filled with 1 inch (2.5 cm) of water. Add the green beans and bring the water to a boil. Cover the saucepan with a tight-fitting lid, and allow the beans to steam over medium heat for 3 to 5 minutes. Microwave green beans for 3 to 4 minutes if you don't have a stove. Place the green beans into a microwave-safe dish and add 2 tablespoons (30 milliliters) of water. Cover the dish with plastic wrap, leaving a corner open for the steam to escape. Microwave the beans on high for 3 to 4 minutes. Keep in mind that it is difficult to cook green beans evenly in the microwave. Boil green beans for 6 minutes if you don’t have a steamer basket. Fill a pot with enough water to cover the beans by 1 inch (2.5 cm). Add a dash of salt, bring the water to a boil. Add the beans, then boil them until they are tender, about 6 minutes. Drain and serve the beans. Cooking Green Beans in Other Ways Sauté green beans for 1 to 2 minutes after steaming them. Steam the green beans first for 4 to 6 minutes, then take them out of the steamer basket. Melt 2 tablespoons (30 grams) of butter in a skillet over medium-high heat. Add the beans, then cook them for 1 to 2 minutes, stirring often. Season the beans with salt and pepper before serving them. Cooking the beans before sautéing will make them more flavorful. Sautéing the beans after cooking will help caramelize and brown them. Season the beans with paprika, red pepper, or garlic powder while sautéing them for extra flavor. Roast green beans for a warm meal. Toss 1 pound (450 grams) of green beans with 1 tablespoon (15 milliliters) of oil, ½ teaspoon salt, and ½ teaspoon pepper. Spread the beans in an even layer in a parchment-lined baking pan. Roast them in a preheated oven at 425 °F (218 °C) for 10 to 12 minutes, stirring occasionally. The beans are ready when they are tender and the edges are browned. Use a large enough baking pan so that none of the beans are touching, otherwise they won't brown properly. Cook green beans in a crock pot for a warm, hearty meal. Fry and crumble 2½ ounces (75 grams) of bacon. Add it to a 6-quart (5.7-liter) crockpot along with a sliced-up yellow onion, 2 pounds (900 grams) green beans, and 8 cups (1.9 liters) of chicken broth. Season it with salt and pepper, then cover it with a lid. Cook the meal on HIGH for 8 to 10 hours. You can use a drained, 15-ounce (452-gram) jar of cocktail pearl onions and 2½ ounces (75 grams) of pre-cooked bacon pieces instead. Add green beans to a casserole for a tasty, filling meal. Cook 12 ounces (340 grams) of green beans in the microwave. Combine them with 10½ ounces (298 grams) of condensed cream of mushroom soup and a dash of black pepper. Transfer everything to a 1-quart (0.9-liter) casserole dish and cover with 1⅓-cups (65 grams) of fresh bread crumbs. Bake the casserole at 350 °F (177 °C) for 25 to 30 minutes.",
  "tyn_model":[
    "green beans",
    "water",
    "beans",
    "steamer basket",
    "colander",
    "iced water",
    "saucepan",
    "microwave",
    "salt",
    "salt and pepper",
    "bacon",
    "cutting board",
    "chef's knife",
    "stir fry",
    "large bowl",
    "ice bath",
    "stove",
    "microwave-safe dish",
    "plastic wrap",
    "pot",
    "butter",
    "skillet",
    "paprika",
    "red pepper",
    "garlic powder",
    "oil",
    "pepper",
    "parchment-lined baking pan",
    "preheated oven",
    "baking pan",
    "crock pot",
    "crockpot",
    "yellow onion",
    "chicken broth",
    "cocktail pearl onions",
    "condensed cream of mushroom soup",
    "black pepper",
    "casserole dish",
    "fresh bread crumbs"
  ],
  "tyn_section":[

  ]
}