{
  "title":"How to Control the PlayStation4 with Voice Commands",
  "url":"https://www.wikihow.com/Control-the-PlayStation4-with-Voice-Commands",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation 4"
  ],
  "parts":[
    {
      "name":"Enabling Voice Commands",
      "steps":[
        {
          "headline":"Connect your microphone to your PlayStation 4 controller.",
          "description":"To do so, simply insert the headphone's plug into the controller's headphone slot, which is located on the back of the controller between the two handles. The PS4 comes with a rudimentary headset, but you can use any PS4-compatible headset that plugs into your controller or connects via Bluetooth. If you have a PlayStation 4 camera set up, you can also use its microphone."
        },
        {
          "headline":"Press your controller's PS button.",
          "description":"As long as your controller is attached to your PlayStation 4, doing this will turn on both your controller and your console. You can also press the PS4's power button, which is on the left side of the front of the console, to turn it on."
        },
        {
          "headline":"Scroll up from the home page.",
          "description":"Doing so will prompt the menu bar to appear."
        },
        {
          "headline":"Scroll right to Settings and press X.",
          "description":"The Settings icon resembles a bag."
        },
        {
          "headline":"Scroll down to System and press X.",
          "description":"You'll find this option near the bottom of the page."
        },
        {
          "headline":"Select Voice Operation Settings and press X.",
          "description":"It's near the top of the page."
        },
        {
          "headline":"Select Operate PS4 with Voice and press X.",
          "description":"This will place a checkmark in the box on the right side of the page, signifying that Voice Operation is now active. If there's a checkmark in the box, Voice Operation is already enabled."
        }
      ]
    },
    {
      "name":"Using Voice Commands",
      "steps":[
        {
          "headline":"Say \"PlayStation\" into the microphone.",
          "description":"Doing so will bring up the PlayStation 4's Voice Operation bar at the bottom of the TV's screen. If at any point the voice bar disappears, simply say \"PlayStation\" again to bring it back."
        },
        {
          "headline":"Say \"Home.\"",
          "description":"This will take you back to the PlayStation 4's home page."
        },
        {
          "headline":"Say \"Log in.\"",
          "description":"This command brings up a list of all profiles saved to your PS4. You can select a user by saying \"User [number].\" You'll see a user's number listed in the middle of their profile's card."
        },
        {
          "headline":"Say the name of a game.",
          "description":"Doing so will select it on the home page. This also works with apps and menu items (e.g., \"Library\", \"Settings\", or \"PlayStation Store\")."
        },
        {
          "headline":"Say \"Start.\"",
          "description":"This will open the game."
        },
        {
          "headline":"Say \"Take screenshot.\"",
          "description":"Using this command at any time during the game will prompt your PS4 to save a picture of whatever is on the screen."
        },
        {
          "headline":"Say \"Start power.\"",
          "description":"This command launches the Power menu, from which you can say one of the following commands:\n\"Turn off PS4\" - Turns off your PS4. \"Enter Rest Mode\" - Places your PlayStation 4 in Rest Mode, where connected controllers can still charge and downloads can proceed."
        },
        {
          "headline":"Say \"All commands.\"",
          "description":"This command brings up a list of all of your PS4's available commands."
        }
      ]
    }
  ],
  "text":" Enabling Voice Commands Connect your microphone to your PlayStation 4 controller. To do so, simply insert the headphone's plug into the controller's headphone slot, which is located on the back of the controller between the two handles. The PS4 comes with a rudimentary headset, but you can use any PS4-compatible headset that plugs into your controller or connects via Bluetooth. If you have a PlayStation 4 camera set up, you can also use its microphone. Press your controller's PS button. As long as your controller is attached to your PlayStation 4, doing this will turn on both your controller and your console. You can also press the PS4's power button, which is on the left side of the front of the console, to turn it on. Scroll up from the home page. Doing so will prompt the menu bar to appear. Scroll right to Settings and press X. The Settings icon resembles a bag. Scroll down to System and press X. You'll find this option near the bottom of the page. Select Voice Operation Settings and press X. It's near the top of the page. Select Operate PS4 with Voice and press X. This will place a checkmark in the box on the right side of the page, signifying that Voice Operation is now active. If there's a checkmark in the box, Voice Operation is already enabled. Using Voice Commands Say \"PlayStation\" into the microphone. Doing so will bring up the PlayStation 4's Voice Operation bar at the bottom of the TV's screen. If at any point the voice bar disappears, simply say \"PlayStation\" again to bring it back. Say \"Home.\" This will take you back to the PlayStation 4's home page. Say \"Log in.\" This command brings up a list of all profiles saved to your PS4. You can select a user by saying \"User [number].\" You'll see a user's number listed in the middle of their profile's card. Say the name of a game. Doing so will select it on the home page. This also works with apps and menu items (e.g., \"Library\", \"Settings\", or \"PlayStation Store\"). Say \"Start.\" This will open the game. Say \"Take screenshot.\" Using this command at any time during the game will prompt your PS4 to save a picture of whatever is on the screen. Say \"Start power.\" This command launches the Power menu, from which you can say one of the following commands:\n\"Turn off PS4\" - Turns off your PS4. \"Enter Rest Mode\" - Places your PlayStation 4 in Rest Mode, where connected controllers can still charge and downloads can proceed. Say \"All commands.\" This command brings up a list of all of your PS4's available commands.",
  "tyn_model":[
    "ps4",
    "playstation 4",
    "microphone",
    "voice operation",
    "playstation",
    "headphone",
    "playstation store",
    "4"
  ],
  "tyn_section":[

  ]
}