{
  "title":"How to Make a Star with String",
  "url":"https://www.wikihow.com/Make-a-Star-with-String",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "String Games"
  ],
  "steps":[
    {
      "headline":"Make the Cup and Saucer using a short string loop or a regular size loop that has been doubled.",
      "description":""
    },
    {
      "headline":"Hold your hands with fingers pointing up.",
      "description":"Look at the center of the figure where the bottom of the cup sits on the saucer. This part is made up of three strings. Two are crossed and go to the near side of the forefingers; the other is on top and loops around the far forefinger/far thumb strings."
    },
    {
      "headline":"Use your little fingers to pick up this top straight string as shown.",
      "description":""
    },
    {
      "headline":"Release the strings on your thumbs.",
      "description":""
    },
    {
      "headline":"Move your thumbs over the forefinger nooses and pick up the near little finger strings.",
      "description":"Allow the loose string to go over the strings you are pulling back with your thumbs."
    },
    {
      "headline":"Release the string noose on your right little finger.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Make the Cup and Saucer using a short string loop or a regular size loop that has been doubled.  Hold your hands with fingers pointing up. Look at the center of the figure where the bottom of the cup sits on the saucer. This part is made up of three strings. Two are crossed and go to the near side of the forefingers; the other is on top and loops around the far forefinger/far thumb strings. Use your little fingers to pick up this top straight string as shown.  Release the strings on your thumbs.  Move your thumbs over the forefinger nooses and pick up the near little finger strings. Allow the loose string to go over the strings you are pulling back with your thumbs. Release the string noose on your right little finger.  Finished. ",
  "tyn_model":[
    "cup",
    "saucer",
    "string noose"
  ],
  "tyn_section":[

  ]
}