{
  "title":"How to Fly a Halo Pelican",
  "url":"https://www.wikihow.com/Fly-a-Halo-Pelican",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Halo"
  ],
  "steps":[
    {
      "headline":"Make sure that you own a copy of Halo Combat Evolved for PC (Also known as Halo 1).",
      "description":"Have the ID code handy for the next step's download."
    },
    {
      "headline":"Have the secondary program that contains mods and stuff for flying Pelicans.",
      "description":"This program is called Halo Custom Edition (Also known as Halo CE. You can find this program by following this URL: Download and selecting \"download now\". Don't worry - this site has been triple checked for harmful viruses. The download is free but could take awhile... get some food. Popcorn, cereal, tea..."
    },
    {
      "headline":"Add an icon.",
      "description":"Once you have halo CE downloaded, give it its own special icon."
    },
    {
      "headline":"Get a map to place the Pelican on, because Halo CE alone is pretty lame.",
      "description":"This leads to a map called \"Huge***\". Inappropriate name I suppose, but that's its name. Once again, simply scroll down and hit the download button."
    },
    {
      "headline":"Wait for the zip folder.",
      "description":"Once the map you've gotten is downloaded, it should create its own zip folder on your desktop called 'huge***.zip'. This is good. Double click the zip folder. You should see a number of random files, but look for the one titled: 'huge***.map'. The map means you can put it into Halo CE. Leave it there for now (cold snap  is also a suitable map)"
    },
    {
      "headline":"Right click the Halo CE icon and select properties.",
      "description":"Locate and click the 'open file location' button. This should open another screen that has folders, triggers, and basically everything else in Halo 1. Find the folder that's called: 'Maps'. Open it. You should see a list of all the maps like 'Death Island', 'Ice Land', etc."
    },
    {
      "headline":"Drag the 'huge*** map file from the huge*** zip folder into the Maps folder of Halo CE, alongside 'Death Island' and stuff.",
      "description":"(It really doesn't matter where so long as its in the Maps folder.) Once the map file has been transferred, things should start to disappear off of your screen. A good thing. Now click \"Apply\" followed by \"OK\" on the 'Properties' screen of Halo CE"
    },
    {
      "headline":"Open up Halo CE by double-clicking the icon.",
      "description":""
    },
    {
      "headline":"Click 'Multiplayer'.",
      "description":"Then click 'Create Game'"
    },
    {
      "headline":"Select your new map called 'huge***' from the list of maps inside of Halo.",
      "description":""
    },
    {
      "headline":"Select a gametype, such as CTF or Slayer.",
      "description":""
    },
    {
      "headline":"Start the game.",
      "description":"You should be in a huge-*** hangar. Look around for a Pelican Drop ship ."
    },
    {
      "headline":"Climb in through the back up to the pilot seat and hit 'E'.",
      "description":""
    },
    {
      "headline":"Hold spacebar to hover upwards, and hold 'Ctrl' to land.",
      "description":"Otherwise it is regular 'W' and mouse moving for movement."
    },
    {
      "headline":"Have fun in your brand new Halo Pelican!",
      "description":""
    }
  ],
  "text":" Make sure that you own a copy of Halo Combat Evolved for PC (Also known as Halo 1). Have the ID code handy for the next step's download. Have the secondary program that contains mods and stuff for flying Pelicans. This program is called Halo Custom Edition (Also known as Halo CE. You can find this program by following this URL: Download and selecting \"download now\". Don't worry - this site has been triple checked for harmful viruses. The download is free but could take awhile... get some food. Popcorn, cereal, tea... Add an icon. Once you have halo CE downloaded, give it its own special icon. Get a map to place the Pelican on, because Halo CE alone is pretty lame. This leads to a map called \"Huge***\". Inappropriate name I suppose, but that's its name. Once again, simply scroll down and hit the download button. Wait for the zip folder. Once the map you've gotten is downloaded, it should create its own zip folder on your desktop called 'huge***.zip'. This is good. Double click the zip folder. You should see a number of random files, but look for the one titled: 'huge***.map'. The map means you can put it into Halo CE. Leave it there for now (cold snap  is also a suitable map) Right click the Halo CE icon and select properties. Locate and click the 'open file location' button. This should open another screen that has folders, triggers, and basically everything else in Halo 1. Find the folder that's called: 'Maps'. Open it. You should see a list of all the maps like 'Death Island', 'Ice Land', etc. Drag the 'huge*** map file from the huge*** zip folder into the Maps folder of Halo CE, alongside 'Death Island' and stuff. (It really doesn't matter where so long as its in the Maps folder.) Once the map file has been transferred, things should start to disappear off of your screen. A good thing. Now click \"Apply\" followed by \"OK\" on the 'Properties' screen of Halo CE Open up Halo CE by double-clicking the icon.  Click 'Multiplayer'. Then click 'Create Game' Select your new map called 'huge***' from the list of maps inside of Halo.  Select a gametype, such as CTF or Slayer.  Start the game. You should be in a huge-*** hangar. Look around for a Pelican Drop ship . Climb in through the back up to the pilot seat and hit 'E'.  Hold spacebar to hover upwards, and hold 'Ctrl' to land. Otherwise it is regular 'W' and mouse moving for movement. Have fun in your brand new Halo Pelican! ",
  "tyn_model":[
    "popcorn",
    "cereal",
    "tea",
    "map",
    "pelican",
    "halo ce",
    "cold snap  is",
    "maps",
    "halo",
    "slayer",
    "mouse"
  ],
  "tyn_section":[

  ]
}