{
  "title":"How to Duplicate Pokémon in Pokémon Emerald, FireRed, and LeafGreen",
  "url":"https://www.wikihow.com/Duplicate-Pok%C3%A9mon-in-Pok%C3%A9mon-Emerald,-FireRed,-and-LeafGreen",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Pokemon Video Games"
  ],
  "steps":[
    {
      "headline":"Place the Pokémon you want to duplicate into your match list.",
      "description":"If you want to duplicate any item, place the item(s) on the Pokémon. Place unwanted or deletable Pokémon into the second GBA's matchlist."
    },
    {
      "headline":"Go to a Pokémon Center.",
      "description":"There, go to the Pokémon Cable Club lady and enter the trading room."
    },
    {
      "headline":"Trade wanted Pokémon with unwanted Pokémon.",
      "description":"Exit the room."
    },
    {
      "headline":"Save the game with the desired Pokémon, but do not save the game with the undesired Pokémon.",
      "description":""
    },
    {
      "headline":"Turn off the GBA containing undesired Pokémon and turn it back on.",
      "description":"Both games now have desired Pokémon (and their items)."
    }
  ],
  "text":" Place the Pokémon you want to duplicate into your match list. If you want to duplicate any item, place the item(s) on the Pokémon. Place unwanted or deletable Pokémon into the second GBA's matchlist. Go to a Pokémon Center. There, go to the Pokémon Cable Club lady and enter the trading room. Trade wanted Pokémon with unwanted Pokémon. Exit the room. Save the game with the desired Pokémon, but do not save the game with the undesired Pokémon.  Turn off the GBA containing undesired Pokémon and turn it back on. Both games now have desired Pokémon (and their items).",
  "tyn_model":[
    "pokémon center",
    "pokémon cable club"
  ],
  "tyn_section":[

  ]
}