{
  "title":"How to Make an Ark Pop up Card (Robert Sabuda Method)",
  "url":"https://www.wikihow.com/Make-an-Ark-Pop-up-Card-(Robert-Sabuda-Method)",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Homemade Cards",
    "Pop Up Cards"
  ],
  "steps":[
    {
      "headline":"Click here to get the card templates.",
      "description":"Print out the piece for the ark on a heavy paper, like cardstock or construction paper. Click on the image on the right and print out the full size version."
    },
    {
      "headline":"Print out the card for the ark on the same heavy paper.",
      "description":"Click on the image on the right and print out the full size version."
    },
    {
      "headline":"Use a ruler as a guide, take the rounded end of a paper clip (or a ballpoint pen that has run out of ink) and press along the dotted lines of the pop-up piece.",
      "description":""
    },
    {
      "headline":"Use a ruler as a guide, take the rounded end of a paper clip (or a ballpoint pen that has run out of ink) and press along the dotted line on the center of the card.",
      "description":"Go all the way from the top to the bottom of the card!"
    },
    {
      "headline":"Open the pop so you can see all the dotted lines.",
      "description":""
    },
    {
      "headline":"Put a small amount of glue in the area below the elephants head marked Glue here",
      "description":""
    },
    {
      "headline":"Pick up the pop and bring the tab (on the side with the giraffe) towards the glue area.",
      "description":""
    },
    {
      "headline":"Lay the pop down and press the tab into the glue.",
      "description":""
    },
    {
      "headline":"Put a small amount of glue on the reaming area marked \"Glue here.\"",
      "description":""
    },
    {
      "headline":"Fold that piece over onto the remaining tab on the ark and press the glue.",
      "description":"Let dry!"
    },
    {
      "headline":"Fold the card in half along the dotted line and crease.",
      "description":"Open the card."
    },
    {
      "headline":"Put a small amount of glue on the area marked \"Glue here\" on the right side only.",
      "description":""
    },
    {
      "headline":"Pick up the pop (with the bird at the top) and fold the right water tab backwards so it matches the position of the glue area.",
      "description":"Look carefully at this picture and the picture in Step 27 so you'll understand how to attach the pop to the glue area. Press the tab into the glue area."
    },
    {
      "headline":"Flip the pop-up over and fold back the other tab shaped like water and crease.",
      "description":""
    },
    {
      "headline":"Put a small amount of glue on the remaining area marked \"Glue here.\"",
      "description":""
    },
    {
      "headline":"Make sure the pop is laying completely flat against the card, begin to fold the card closed.",
      "description":""
    },
    {
      "headline":"Close the card completely.",
      "description":"Press on the card to make sure the glue area on the inside is adhering to the tab.let dry. Don't open the card right away or the pop-up will come unglued!"
    },
    {
      "headline":"Look!",
      "description":"Your pop-up ark is finished! Happy sailing!"
    }
  ],
  "text":" Click here to get the card templates. Print out the piece for the ark on a heavy paper, like cardstock or construction paper. Click on the image on the right and print out the full size version. Print out the card for the ark on the same heavy paper. Click on the image on the right and print out the full size version. Use a ruler as a guide, take the rounded end of a paper clip (or a ballpoint pen that has run out of ink) and press along the dotted lines of the pop-up piece.  Use a ruler as a guide, take the rounded end of a paper clip (or a ballpoint pen that has run out of ink) and press along the dotted line on the center of the card. Go all the way from the top to the bottom of the card! Open the pop so you can see all the dotted lines.  Put a small amount of glue in the area below the elephants head marked Glue here  Pick up the pop and bring the tab (on the side with the giraffe) towards the glue area.  Lay the pop down and press the tab into the glue.  Put a small amount of glue on the reaming area marked \"Glue here.\"  Fold that piece over onto the remaining tab on the ark and press the glue. Let dry! Fold the card in half along the dotted line and crease. Open the card. Put a small amount of glue on the area marked \"Glue here\" on the right side only.  Pick up the pop (with the bird at the top) and fold the right water tab backwards so it matches the position of the glue area. Look carefully at this picture and the picture in Step 27 so you'll understand how to attach the pop to the glue area. Press the tab into the glue area. Flip the pop-up over and fold back the other tab shaped like water and crease.  Put a small amount of glue on the remaining area marked \"Glue here.\"  Make sure the pop is laying completely flat against the card, begin to fold the card closed.  Close the card completely. Press on the card to make sure the glue area on the inside is adhering to the tab.let dry. Don't open the card right away or the pop-up will come unglued! Look! Your pop-up ark is finished! Happy sailing!",
  "tyn_model":[
    "glue",
    "card",
    "ruler",
    "ballpoint pen",
    "construction paper",
    "water"
  ],
  "tyn_section":[

  ]
}