{
  "title":"How to Make French Silk Pie",
  "url":"https://www.wikihow.com/Make-French-Silk-Pie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies"
  ],
  "steps":[
    {
      "headline":"Make a Graham Cracker Pie Crust by melting 1/2 cup butter, adding 2 tablespoons of brown sugar, and mixing in 1 1/2 cups crushed graham crackers.",
      "description":"Bake at 350 degrees for 15 minutes, then cool."
    },
    {
      "headline":"In the microwave, or over low heat on the stove, melt 1/2 cup butter and 4 squares unsweetened baking cocoa.",
      "description":""
    },
    {
      "headline":"Place this hot mixture into an electric mixer, add 1 cup sugar, and beat well, until smooth and creamy.",
      "description":""
    },
    {
      "headline":"Add 3 drops peppermint extract.",
      "description":""
    },
    {
      "headline":"Add 3 large eggs, one at a time, blending each one well before adding the next.",
      "description":""
    },
    {
      "headline":"Pour into pie crust.",
      "description":""
    },
    {
      "headline":"Cool completely in the refrigerator.",
      "description":""
    },
    {
      "headline":"Cut in very small slices (it's very rich!",
      "description":")."
    },
    {
      "headline":"Top with a dollop of real whipped cream.",
      "description":""
    },
    {
      "headline":"Optional -- top with one leaf fresh mint.",
      "description":""
    }
  ],
  "text":" Make a Graham Cracker Pie Crust by melting 1/2 cup butter, adding 2 tablespoons of brown sugar, and mixing in 1 1/2 cups crushed graham crackers. Bake at 350 degrees for 15 minutes, then cool. In the microwave, or over low heat on the stove, melt 1/2 cup butter and 4 squares unsweetened baking cocoa.  Place this hot mixture into an electric mixer, add 1 cup sugar, and beat well, until smooth and creamy.  Add 3 drops peppermint extract.  Add 3 large eggs, one at a time, blending each one well before adding the next.  Pour into pie crust.  Cool completely in the refrigerator.  Cut in very small slices (it's very rich! ). Top with a dollop of real whipped cream.  Optional -- top with one leaf fresh mint. ",
  "tyn_model":[
    "butter",
    "graham cracker pie crust",
    "brown sugar",
    "crushed graham crackers",
    "microwave",
    "unsweetened baking cocoa",
    "electric mixer",
    "sugar",
    "peppermint extract",
    "eggs",
    "pie crust",
    "refrigerator",
    "whipped cream",
    "mint"
  ],
  "tyn_section":[

  ]
}