{
  "title":"How to Make a Miserable Teddy Bear Feel Better",
  "url":"https://www.wikihow.com/Make-a-Miserable-Teddy-Bear-Feel-Better",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Traditional Toys",
    "Teddy Bears"
  ],
  "parts":[
    {
      "name":"Finding Out What Has Upset Teddy",
      "steps":[
        {
          "headline":"Ask your bear what is wrong.",
          "description":"If it doesn't tell you, it may be too stressed out, annoyed or doesn't really want to tell you cause it might be about you, so be gentle and kind. Tell the bear that it'll be alright. It might actually tell you at this stage, but if it doesn't, just take care of it some more and forget about asking him/her. Do not pressure the bear, or it may get even more upset. Simply comfort it by giving it a cuddle, making it a warm drink or reading a story to it."
        },
        {
          "headline":"Give the teddy bear some space.",
          "description":"Don't smother your bear, give it its own space to think about what's wrong. In time it may realize that the best thing to do will be to open up and tell you so that the problem can be sorted."
        }
      ]
    },
    {
      "name":"Consoling Your Teddy",
      "steps":[
        {
          "headline":"Cuddle and kiss your teddy bear.",
          "description":"This should at least make it smile. If it smiles, that's good! That means the bear's already on its way to feeling better."
        },
        {
          "headline":"Make the bear relax by cradling it.",
          "description":"If the bear is too big to be cradled, just put it on your lap and stroke it gently. If you like, you can give the bear one of its favorite toys."
        },
        {
          "headline":"Softly sing a lullaby, like \"Twinkle, Twinkle, Little Star\" or tell the bear a story.",
          "description":"Your bear will feel much happier (and sleepier) afterward."
        }
      ]
    },
    {
      "name":"Fixing Possible Bear Problems",
      "steps":[
        {
          "headline":"Feed the bear.",
          "description":"If it's near feeding time, feed it breakfast, lunch or dinner. Just make it feel comfortable."
        },
        {
          "headline":"Go do something fun.",
          "description":"Your bear might forget all about it if you do something fun enough."
        },
        {
          "headline":"Don't neglect your bear.",
          "description":"If you neglect your toy, that may be the reason why it is miserable. Try to spend as much time with the bear as you can, and try to take it everywhere you go, but be careful that it doesn't get lost!"
        },
        {
          "headline":"Get the bear ready for bed.",
          "description":"If it's bedtime, tuck the bear in and tell it that things will be better in the morning. Read or sing to the bear until it falls asleep."
        },
        {
          "headline":"Let the bear sleep.",
          "description":"It may only be tiredness that's making your bear grouchy!"
        },
        {
          "headline":"Be good to your bear.",
          "description":"Never yell, or neglect your teddy bear and it should feel better."
        },
        {
          "headline":"Rinse and repeat as needed.",
          "description":"Keep your bear happy."
        }
      ]
    }
  ],
  "text":" Finding Out What Has Upset Teddy Ask your bear what is wrong. If it doesn't tell you, it may be too stressed out, annoyed or doesn't really want to tell you cause it might be about you, so be gentle and kind. Tell the bear that it'll be alright. It might actually tell you at this stage, but if it doesn't, just take care of it some more and forget about asking him/her. Do not pressure the bear, or it may get even more upset. Simply comfort it by giving it a cuddle, making it a warm drink or reading a story to it. Give the teddy bear some space. Don't smother your bear, give it its own space to think about what's wrong. In time it may realize that the best thing to do will be to open up and tell you so that the problem can be sorted. Consoling Your Teddy Cuddle and kiss your teddy bear. This should at least make it smile. If it smiles, that's good! That means the bear's already on its way to feeling better. Make the bear relax by cradling it. If the bear is too big to be cradled, just put it on your lap and stroke it gently. If you like, you can give the bear one of its favorite toys. Softly sing a lullaby, like \"Twinkle, Twinkle, Little Star\" or tell the bear a story. Your bear will feel much happier (and sleepier) afterward. Fixing Possible Bear Problems Feed the bear. If it's near feeding time, feed it breakfast, lunch or dinner. Just make it feel comfortable. Go do something fun. Your bear might forget all about it if you do something fun enough. Don't neglect your bear. If you neglect your toy, that may be the reason why it is miserable. Try to spend as much time with the bear as you can, and try to take it everywhere you go, but be careful that it doesn't get lost! Get the bear ready for bed. If it's bedtime, tuck the bear in and tell it that things will be better in the morning. Read or sing to the bear until it falls asleep. Let the bear sleep. It may only be tiredness that's making your bear grouchy! Be good to your bear. Never yell, or neglect your teddy bear and it should feel better. Rinse and repeat as needed. Keep your bear happy.",
  "tyn_model":[
    "bear"
  ],
  "tyn_section":[

  ]
}