{
  "title":"How to Make Bacon and Cheese Beer Dip",
  "url":"https://www.wikihow.com/Make-Bacon-and-Cheese-Beer-Dip",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Snacks",
    "Dips"
  ],
  "methods":[
    {
      "name":"Bacon Cheese Beer Dip",
      "steps":[
        {
          "headline":"Combine the ingredients together in a medium bowl with a hand mixer.",
          "description":"Integrate the cream cheese with the ranch dip mix first, then whisk in the beer."
        },
        {
          "headline":"Sprinkle the bacon pieces, cheese, and scallions.",
          "description":"Use the mixer to blend everything together."
        },
        {
          "headline":"Refrigerate the mixture.",
          "description":"Seal the top of the bowl with plastic wrap and allow two hours for chilling time."
        }
      ]
    },
    {
      "name":"Bacon Cheese Jalapeno Beer Dip",
      "steps":[
        {
          "headline":"Roast the jalapenos.",
          "description":"Place the jalapeno halves on a baking sheet, facing up. Bake in a 375°F/190°C oven for about 15 minutes."
        },
        {
          "headline":"Heat the beer in a small saucepan over a low setting.",
          "description":"Add the chopped cheese and cheese sauce to the beer and stir. Remove from the heat when the cheese melts."
        },
        {
          "headline":"Chop the jalapenos into fine pieces.",
          "description":"Add them to the warm beer mixture."
        },
        {
          "headline":"Sprinkle the bacon pieces on top and serve.",
          "description":""
        }
      ]
    }
  ],
  "text":" Bacon Cheese Beer Dip Combine the ingredients together in a medium bowl with a hand mixer. Integrate the cream cheese with the ranch dip mix first, then whisk in the beer. Sprinkle the bacon pieces, cheese, and scallions. Use the mixer to blend everything together. Refrigerate the mixture. Seal the top of the bowl with plastic wrap and allow two hours for chilling time. Bacon Cheese Jalapeno Beer Dip Roast the jalapenos. Place the jalapeno halves on a baking sheet, facing up. Bake in a 375°F/190°C oven for about 15 minutes. Heat the beer in a small saucepan over a low setting. Add the chopped cheese and cheese sauce to the beer and stir. Remove from the heat when the cheese melts. Chop the jalapenos into fine pieces. Add them to the warm beer mixture. Sprinkle the bacon pieces on top and serve. ",
  "tyn_model":[
    "bacon",
    "jalapenos",
    "bacon cheese beer dip",
    "medium bowl",
    "hand mixer",
    "cream cheese",
    "ranch dip",
    "scallions",
    "mixer",
    "plastic wrap",
    "bacon cheese",
    "jalapeno beer dip",
    "jalapeno",
    "baking sheet",
    "small saucepan",
    "cheese sauce"
  ],
  "tyn_section":[

  ]
}