{
  "title":"How to Level Up in Elder Scrolls Online",
  "url":"https://www.wikihow.com/Level-Up-in-Elder-Scrolls-Online",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games"
  ],
  "methods":[
    {
      "name":"Choosing Skills Wisely",
      "steps":[
        {
          "headline":"Choose skills that you will use.",
          "description":"The key to leveling skills quickly is to emphasize and choose skills that you will actually use in the first place. Using skills means that you gain experience with them, and the more you use them the more experience you'll get. So while a certain ability or weapon may be cool, don't be surprised if it slows you down when it comes to leveling."
        },
        {
          "headline":"Choose a race which benefits your play style.",
          "description":"Certain races have bonuses to XP (experience) with certain skills. Examples include Altmer with Destruction Staffs, Bosmer with bows, Bretons with Light Armor, and Khajiit with Medium Armor. Decide what skill you really want to be good with and then consider creating a character with that race bonus."
        },
        {
          "headline":"Experiment before committing to a build.",
          "description":"It takes time to figure out just the right build and just the right skills you'll need in order to get your character leveled up quickly. Even just deciding what skills you care about the most can take time. You may need to experiment, so be patient."
        }
      ]
    },
    {
      "name":"Doing Quests",
      "steps":[
        {
          "headline":"Do general quests.",
          "description":"General quests, picked up from NPCs across Tamriel, can give you lots of experience. You get this not only for completing the quest, but also for killing the enemies you encounter along the way! More demanding quests will give you a higher amount of money, so don't only go for quick and easy quests."
        },
        {
          "headline":"Do guild quests.",
          "description":"Guilds are back in the installment of the Elder Scrolls, so take advantage and complete the guild quest lines. The various quests you pick up can give you an easily laid out way to get XP, helping you level faster by creating a clear path of things to do."
        },
        {
          "headline":"Fight in the faction wars.",
          "description":"Since battling is the real way to gain XP, what better way can there be to gain it than to participate in a full-scale war? Once you reach level 10, you'll be allow to participate in the war effort, fighting for your home Alliance (and later, switching sides if you want to). This will net you loads of XP, depending on the size of the battle and how much you participate."
        }
      ]
    },
    {
      "name":"Grinding Levels",
      "steps":[
        {
          "headline":"Explore the world.",
          "description":"For MMO vets, yes, level grinding is still the main way to get XP. For MMO newbies, level grinding will be the bane of your existence. Start by getting out into the world. Specifically, get out into the wilderness. The more dangerous the environment, the better."
        },
        {
          "headline":"Kill creatures.",
          "description":"Step 2, as it turns out, is to kill a bunch of stuff. Use your preferred method and try to kill things on your own to maximize XP gained. Have fun! (just kidding)"
        },
        {
          "headline":"Rinse and repeat.",
          "description":"The infamous \"Step 3: Profit\". Just keep killing things and getting the XP. It may be boring sometimes, but eventually it adds up and you'll get to where you want to be."
        }
      ]
    },
    {
      "name":"Collecting Skyshards",
      "steps":[
        {
          "headline":"Seek the Skyshards.",
          "description":"Skyshards are new to the Elderscrolls universe. These shards, when collected, will give you a bonus skill point to spend. You'll have to start by searching the world for them. Keep an ear out, as well as an eye. They make a ringing sound and shine very brightly, so they're easy to spot from a distance."
        },
        {
          "headline":"Activate the Skyshards.",
          "description":"Once you see a Skyshard, activate it by clicking on it in order to harness its power. Don't worry if you see someone else at the site: one person absorbing a Skyshard does not stop another from doing the same."
        },
        {
          "headline":"Distribute the skill point.",
          "description":"Once you have a set of 3, you get a point to spend. Keep track of how many you currently have by checking your Skills and Abilities Menu."
        }
      ]
    },
    {
      "name":"Other Considerations",
      "steps":[
        {
          "headline":"Try crafting.",
          "description":"Crafting items can level you overall, but it will also level your skills in that crafting specialty. This is useful for getting experience and the skills necessary to make quality items (that you can sell!). There are a number of different crafting skills to try, including weapon smithing, armor smithing, and alchemy."
        },
        {
          "headline":"Fight harder enemies.",
          "description":"The harder the enemies you fight, the more XP you'll get when you kill them. As such, if you're getting into higher levels and you see those wolves aren't really leveling your skills anymore, you'll know it's time to move on to something a little bigger. Quest time!"
        },
        {
          "headline":"Fight with others.",
          "description":"Some less well-balanced MMOs allow other people to steal your kills, but not so in ESO. Since you don't need to worry about stealing someone's kill, you should feel free to help out others in battles. If you help enough, you'll get a little XP. If you really work together, you can split the XP evenly!"
        },
        {
          "headline":"Get buffs.",
          "description":"You can get buffs (or bonuses to your normal leveling rate) through a few different means. The easiest is to find a Mundus Stone (like the standing stones in Skyrim or birth-signs in Oblivion) which will increase the stat you wish to level. These are located across Tamriel and you will need to seek them out."
        }
      ]
    }
  ],
  "text":" Choosing Skills Wisely Choose skills that you will use. The key to leveling skills quickly is to emphasize and choose skills that you will actually use in the first place. Using skills means that you gain experience with them, and the more you use them the more experience you'll get. So while a certain ability or weapon may be cool, don't be surprised if it slows you down when it comes to leveling. Choose a race which benefits your play style. Certain races have bonuses to XP (experience) with certain skills. Examples include Altmer with Destruction Staffs, Bosmer with bows, Bretons with Light Armor, and Khajiit with Medium Armor. Decide what skill you really want to be good with and then consider creating a character with that race bonus. Experiment before committing to a build. It takes time to figure out just the right build and just the right skills you'll need in order to get your character leveled up quickly. Even just deciding what skills you care about the most can take time. You may need to experiment, so be patient. Doing Quests Do general quests. General quests, picked up from NPCs across Tamriel, can give you lots of experience. You get this not only for completing the quest, but also for killing the enemies you encounter along the way! More demanding quests will give you a higher amount of money, so don't only go for quick and easy quests. Do guild quests. Guilds are back in the installment of the Elder Scrolls, so take advantage and complete the guild quest lines. The various quests you pick up can give you an easily laid out way to get XP, helping you level faster by creating a clear path of things to do. Fight in the faction wars. Since battling is the real way to gain XP, what better way can there be to gain it than to participate in a full-scale war? Once you reach level 10, you'll be allow to participate in the war effort, fighting for your home Alliance (and later, switching sides if you want to). This will net you loads of XP, depending on the size of the battle and how much you participate. Grinding Levels Explore the world. For MMO vets, yes, level grinding is still the main way to get XP. For MMO newbies, level grinding will be the bane of your existence. Start by getting out into the world. Specifically, get out into the wilderness. The more dangerous the environment, the better. Kill creatures. Step 2, as it turns out, is to kill a bunch of stuff. Use your preferred method and try to kill things on your own to maximize XP gained. Have fun! (just kidding) Rinse and repeat. The infamous \"Step 3: Profit\". Just keep killing things and getting the XP. It may be boring sometimes, but eventually it adds up and you'll get to where you want to be. Collecting Skyshards Seek the Skyshards. Skyshards are new to the Elderscrolls universe. These shards, when collected, will give you a bonus skill point to spend. You'll have to start by searching the world for them. Keep an ear out, as well as an eye. They make a ringing sound and shine very brightly, so they're easy to spot from a distance. Activate the Skyshards. Once you see a Skyshard, activate it by clicking on it in order to harness its power. Don't worry if you see someone else at the site: one person absorbing a Skyshard does not stop another from doing the same. Distribute the skill point. Once you have a set of 3, you get a point to spend. Keep track of how many you currently have by checking your Skills and Abilities Menu. Other Considerations Try crafting. Crafting items can level you overall, but it will also level your skills in that crafting specialty. This is useful for getting experience and the skills necessary to make quality items (that you can sell!). There are a number of different crafting skills to try, including weapon smithing, armor smithing, and alchemy. Fight harder enemies. The harder the enemies you fight, the more XP you'll get when you kill them. As such, if you're getting into higher levels and you see those wolves aren't really leveling your skills anymore, you'll know it's time to move on to something a little bigger. Quest time! Fight with others. Some less well-balanced MMOs allow other people to steal your kills, but not so in ESO. Since you don't need to worry about stealing someone's kill, you should feel free to help out others in battles. If you help enough, you'll get a little XP. If you really work together, you can split the XP evenly! Get buffs. You can get buffs (or bonuses to your normal leveling rate) through a few different means. The easiest is to find a Mundus Stone (like the standing stones in Skyrim or birth-signs in Oblivion) which will increase the stat you wish to level. These are located across Tamriel and you will need to seek them out.",
  "tyn_model":[
    "skills",
    "altmer",
    "bosmer",
    "bows",
    "bretons",
    "elder scrolls",
    "xp",
    "skyshard",
    "stone"
  ],
  "tyn_section":[

  ]
}