{
  "title":"How to Cook Yam Smashed in Rice (Linongot)",
  "url":"https://www.wikihow.com/Cook-Yam-Smashed-in-Rice-(Linongot)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Rice and Beans"
  ],
  "steps":[
    {
      "headline":"Take 3 medium-sized yams and peel them.",
      "description":""
    },
    {
      "headline":"Wash the yams after peeling and cut them into thin slices",
      "description":""
    },
    {
      "headline":"Put the yams aside after slicing.",
      "description":""
    },
    {
      "headline":"Fill a medium-sized rice pot with 3 cups of rice.",
      "description":""
    },
    {
      "headline":"Wash the rice twice and mix the yam into the pot.",
      "description":""
    },
    {
      "headline":"Fill the pot containing rice and yam with 6 1/2 cups of water.",
      "description":""
    },
    {
      "headline":"Put the pot on the gas stove or over a fire and monitor it.",
      "description":""
    },
    {
      "headline":"When the rice and yam is almost cooked, lessen the fire.",
      "description":""
    },
    {
      "headline":"The rice and yam is considered cooked when both are soft but not mushy.",
      "description":""
    },
    {
      "headline":"Turn off the fire and let the pot cool down.",
      "description":""
    },
    {
      "headline":"After 10 minutes, take a wooden ladle and stir the rice and yam together while smashing it.",
      "description":""
    },
    {
      "headline":"Mash both the yam and rice into a thick paste.",
      "description":""
    },
    {
      "headline":"Take a portion of the yam and rice paste and put it onto a 'tarap' leaf.",
      "description":""
    },
    {
      "headline":"Wrap the leaf around the rice and yam paste and set aside for consumption.",
      "description":""
    },
    {
      "headline":"Repeat action 14 until all the rice and yam paste in the pot is finished.",
      "description":""
    }
  ],
  "text":" Take 3 medium-sized yams and peel them.  Wash the yams after peeling and cut them into thin slices  Put the yams aside after slicing.  Fill a medium-sized rice pot with 3 cups of rice.  Wash the rice twice and mix the yam into the pot.  Fill the pot containing rice and yam with 6 1/2 cups of water.  Put the pot on the gas stove or over a fire and monitor it.  When the rice and yam is almost cooked, lessen the fire.  The rice and yam is considered cooked when both are soft but not mushy.  Turn off the fire and let the pot cool down.  After 10 minutes, take a wooden ladle and stir the rice and yam together while smashing it.  Mash both the yam and rice into a thick paste.  Take a portion of the yam and rice paste and put it onto a 'tarap' leaf.  Wrap the leaf around the rice and yam paste and set aside for consumption.  Repeat action 14 until all the rice and yam paste in the pot is finished. ",
  "tyn_model":[
    "rice",
    "pot",
    "yams",
    "medium-sized rice pot",
    "water",
    "gas stove",
    "fire",
    "wooden ladle",
    "yam",
    "tarap' leaf"
  ],
  "tyn_section":[

  ]
}