{
  "title":"How to Contact Xbox Live",
  "url":"https://www.wikihow.com/Contact-Xbox-Live",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Xbox Live"
  ],
  "methods":[
    {
      "name":"Using the Official Xbox Method",
      "steps":[
        {
          "headline":"Go to the Xbox “Contact Us” home page at http://support.xbox.com/en-US/contact-us.",
          "description":""
        },
        {
          "headline":"Click on the category that best describes your inquiry or concern about Xbox Live.",
          "description":"You will have the option to choose from “Xbox 360,” “My account,” and “Billing.” For example, if you want to cancel your Xbox Live membership, click on “My Account.”"
        },
        {
          "headline":"Navigate to the “Xbox Live” section.",
          "description":""
        },
        {
          "headline":"Click on the link that best describes the nature of your Xbox Live issue.",
          "description":"For example, if you are experiencing network issues with Xbox Live, click on “Networking.” The landing page will refresh and provide you with a number of different contact methods."
        },
        {
          "headline":"Click on the contact method you want to use for consulting with a representative from Xbox Live.",
          "description":"Common contact methods include live chat, support forums, Twitter support, and telephone."
        },
        {
          "headline":"Follow the on-screen prompts to connect with an Xbox Live representative.",
          "description":"For example, if you chose to chat with a representative, you will be required to sign in with your Microsoft username and password, whereas if you chose the Twitter option, you will be redirected to the official Twitter page for Xbox Support."
        }
      ]
    },
    {
      "name":"Using the Xbox Support Forum",
      "steps":[
        {
          "headline":"Go to the Xbox Forums home page at http://forums.xbox.com/.",
          "description":""
        },
        {
          "headline":"Click on “Xbox Support Forum.”",
          "description":""
        },
        {
          "headline":"Click on the sub-group that best describes the nature of your issue.",
          "description":"The two categories you may choose from are “Networking Hardware Information” and “Xbox 360 Support.”"
        },
        {
          "headline":"Browse through and click on the forum conversation that best fits your inquiry.",
          "description":"For example, if you are having problems connecting to Xbox Live from your console, click on “Connecting to Xbox Live for information on troubleshooting and resolving your Xbox Live issue.”\nIf there are no categories that fit the nature of your inquiry, you may post a new question or message to the forum after signing into your Microsoft account. A Xbox support representative or other Xbox Live user will then respond to your message shortly."
        }
      ]
    },
    {
      "name":"Calling Xbox by Telephone",
      "steps":[
        {
          "headline":"Call Xbox Support at 1-800-469-9269.",
          "description":"The Xbox contact center is open between Monday and Friday from 9 a.m. to 5 p.m. EST."
        },
        {
          "headline":"Wait for Xbox to provide you with prompts, then dial the number “0” six times in a row.",
          "description":""
        },
        {
          "headline":"Wait on the line for an Xbox representative to answer your call.",
          "description":"In most cases, it will take an average of 23 minutes for your call to be answered."
        }
      ]
    }
  ],
  "text":" Using the Official Xbox Method Go to the Xbox “Contact Us” home page at http://support.xbox.com/en-US/contact-us.  Click on the category that best describes your inquiry or concern about Xbox Live. You will have the option to choose from “Xbox 360,” “My account,” and “Billing.” For example, if you want to cancel your Xbox Live membership, click on “My Account.” Navigate to the “Xbox Live” section.  Click on the link that best describes the nature of your Xbox Live issue. For example, if you are experiencing network issues with Xbox Live, click on “Networking.” The landing page will refresh and provide you with a number of different contact methods. Click on the contact method you want to use for consulting with a representative from Xbox Live. Common contact methods include live chat, support forums, Twitter support, and telephone. Follow the on-screen prompts to connect with an Xbox Live representative. For example, if you chose to chat with a representative, you will be required to sign in with your Microsoft username and password, whereas if you chose the Twitter option, you will be redirected to the official Twitter page for Xbox Support. Using the Xbox Support Forum Go to the Xbox Forums home page at http://forums.xbox.com/.  Click on “Xbox Support Forum.”  Click on the sub-group that best describes the nature of your issue. The two categories you may choose from are “Networking Hardware Information” and “Xbox 360 Support.” Browse through and click on the forum conversation that best fits your inquiry. For example, if you are having problems connecting to Xbox Live from your console, click on “Connecting to Xbox Live for information on troubleshooting and resolving your Xbox Live issue.”\nIf there are no categories that fit the nature of your inquiry, you may post a new question or message to the forum after signing into your Microsoft account. A Xbox support representative or other Xbox Live user will then respond to your message shortly. Calling Xbox by Telephone Call Xbox Support at 1-800-469-9269. The Xbox contact center is open between Monday and Friday from 9 a.m. to 5 p.m. EST. Wait for Xbox to provide you with prompts, then dial the number “0” six times in a row.  Wait on the line for an Xbox representative to answer your call. In most cases, it will take an average of 23 minutes for your call to be answered.",
  "tyn_model":[
    "xbox live",
    "“xbox",
    "” and",
    "“networking",
    "“contact",
    "” home",
    "” “",
    "“billing",
    "” for",
    "“my",
    "” navigate",
    "” section",
    "” the",
    "telephone",
    "twitter",
    "xbox support forum",
    "xbox forums",
    "”  ",
    "” browse",
    "“connecting",
    "”\n",
    "xbox support representative",
    "xbox live user will",
    "xbox support",
    "xbox",
    "“0",
    "” six",
    "xbox representative"
  ],
  "tyn_section":[

  ]
}