{
  "title":"How to Cook a Chicken in a George Foreman Rotisserie",
  "url":"https://www.wikihow.com/Cook-a-Chicken-in-a-George-Foreman-Rotisserie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "parts":[
    {
      "name":"Preparing the Chicken",
      "steps":[
        {
          "headline":"Remove the giblets (also known as innards) from the chicken.",
          "description":""
        },
        {
          "headline":"Wash the chicken, thoroughly, both inside and out.",
          "description":"Dry the chicken with paper towels."
        },
        {
          "headline":"Rub some olive oil onto the chicken.",
          "description":"Don't add too much."
        },
        {
          "headline":"Tie the legs and the wings snug to the chicken using cooking twine.",
          "description":"This is known as trussing."
        },
        {
          "headline":"Mix the spices together.",
          "description":"The amounts are approximate, depending on your taste and the size of your chicken."
        },
        {
          "headline":"Put the chicken on a plate and wrap up with plastic wrap.",
          "description":"Refrigerate for 4 to 24 hours. (Longer is better)."
        }
      ]
    },
    {
      "name":"Cooking the Chicken",
      "steps":[
        {
          "headline":"Put the prong on the rotisserie spit and tighten it down.",
          "description":"Then push the chicken onto it."
        },
        {
          "headline":"Put the chicken on the rotisserie bar.",
          "description":""
        },
        {
          "headline":"Set the timer for 1½ hours.",
          "description":"The cooking time is approximately 25 minutes per pound/450g."
        },
        {
          "headline":"Be sure that it is completely cooked.",
          "description":"If you have a meat thermometer, use it to check; it is ready when its internal temperature has reached 160ºF/71ºC and there is no more pink."
        },
        {
          "headline":"Serve and enjoy your healthy (er) chicken dinner.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preparing the Chicken Remove the giblets (also known as innards) from the chicken.  Wash the chicken, thoroughly, both inside and out. Dry the chicken with paper towels. Rub some olive oil onto the chicken. Don't add too much. Tie the legs and the wings snug to the chicken using cooking twine. This is known as trussing. Mix the spices together. The amounts are approximate, depending on your taste and the size of your chicken. Put the chicken on a plate and wrap up with plastic wrap. Refrigerate for 4 to 24 hours. (Longer is better). Cooking the Chicken Put the prong on the rotisserie spit and tighten it down. Then push the chicken onto it. Put the chicken on the rotisserie bar.  Set the timer for 1½ hours. The cooking time is approximately 25 minutes per pound/450g. Be sure that it is completely cooked. If you have a meat thermometer, use it to check; it is ready when its internal temperature has reached 160ºF/71ºC and there is no more pink. Serve and enjoy your healthy (er) chicken dinner. ",
  "tyn_model":[
    "chicken",
    "paper towels",
    "olive oil",
    "cooking twine",
    "spices",
    "plate",
    "plastic wrap",
    "rotisserie spit",
    "rotisserie bar",
    "meat thermometer"
  ],
  "tyn_section":[

  ]
}