{
  "title":"How to Buy a Bed",
  "url":"https://www.wikihow.com/Buy-a-Bed",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "parts":[
    {
      "name":"Choosing a Mattress",
      "steps":[
        {
          "headline":"Purchase an inner spring mattress.",
          "description":"Inner spring is the most common mattress type, and almost every mattress store will carry this model. Chances are you have either seen or slept on this type of mattress before. The inner spring mattress is usually distinguished by coil count. Generally, the higher the coil count, the higher the price. However, these types of mattresses are available in all price ranges. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKatherine Tlapa\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInterior Designer\t\t\t\t\t\t\t\tKatherine Tlapa is an interior designer, currently working as a Design Specialist for Modsy, a design service based in San Francisco. She also runs her own DIY Home Design blog, My Eclectic Grace. She received her BFA in Interior Architecture from Ohio University in 2016. Katherine Tlapa\t\t\tInterior Designer\t\t\t\tYou don't always need a box spring to go with your mattress. Katherine Tlapa, an interior designer, advises: \"If you have a bed frame that has large open slats, then you need a box spring to keep the mattress from falling through. But for most platform beds, you do not actually need a box spring.\""
        },
        {
          "headline":"Consider buying a foam mattress.",
          "description":"Foam mattresses are made of memory foam, which is soft and conforms to the body. It is good for people who desire extra softness. This type is often more expensive than the inner spring type of mattress because it conforms to people's bodies. This can be good for some people and a negative for others. For example, people with pressure points and joint problems may prefer a foam mattress. Some people find that this type of mattress makes them uncomfortably warm. Maybe your current mattress is quite soft, and you want to find a bed with adequate firmness. If this is your situation, then you may want to avoid memory foam and stick to an inner-spring type of mattress."
        },
        {
          "headline":"Look into air mattresses.",
          "description":"Air mattresses can be adjusted by the user for an appropriate amount of softness. This is done with an electric pump. Sleep Number beds are the most well known type of air mattress. These beds are separated into 2 areas, which can be controlled by remotes. The air pockets above the coils can be firm or soft. Often times, mattresses like this will have a foam covering as well. If you disagree about the type of mattress you and your partner want, you should consider an air mattress."
        },
        {
          "headline":"Consider significant additional features.",
          "description":"There are characteristics in mattresses that you may specifically want or need. For instance, you might want to make sure you are buying an “eco-friendly” mattress. In that case, research potential mattresses to see if they were built to either OE Standards or the Global Organic Textile Standards (GOTS). If you have pain or simply feel uncomfortable, you may want a bed with adjustable positioning. This type of bed will allow you to rest at an incline. If you have specific health concerns you might want to ask your doctor for advice."
        },
        {
          "headline":"Choose a size preference.",
          "description":"You might consider a twin if you are by yourself. Maybe you’re alone, but you want some extra space. In that case, a full could be what you want. Queen size and king size beds are generally preferred by couples. Twin, full, queen, and king are all standard mattress sizes. However, if these sizes are too small for you, then you may want to consider the California King size. This extra large mattress is 72 by 84 inches (182 cm by 213 cm). Make sure you consider the size of the bedroom. You might like a king, but if it barely fits into the room it's not going to be a good choice."
        },
        {
          "headline":"Test your mattress.",
          "description":"Lie on the mattress in your regular fashion. Aim to spend at least 15 minutes on the mattress. You want to create a sleeping situation as close to the one you have at home. Make sure that you change positions frequently in order to imitate how you would normally go to sleep. Never buy a mattress that is untested. If you will share the mattress, make sure both people try it before you buy. There are an increasing number of mattresses you can buy online. These can be a great choice if you are looking to save money, though you will not be able to try them out. Make sure the company you buy from has a good return policy and that you understand the terms."
        }
      ]
    },
    {
      "name":"Picking a Bed Frame",
      "steps":[
        {
          "headline":"Measure your room.",
          "description":"Look at the space where your bed will go, and measure it with a tape ruler. Make sure there is at least a few feet of space to the walls and any furniture in the room. The size of the bed will depend on the size of the room. Another way to get an accurate measure if you already have a mattress, is to place the mattress on the floor of your room. By doing this, you will see exactly how much space the mattress itself will take up. This will be incredibly helpful in choosing what type of bed frame to buy. Common bed frame sizes are twin, full, queen, and king. A twin bed frame will fit in a space of 39 inches by 70 inches (99 to 178 cm). For a full bed frame, you will generally need a space measuring 54 by 75 inches (137 by 190 cm). 60 by 80 inches (152 by 203 cm) is a large enough space for a queen bed frame. A king bed frame will require 72 by 84 inches (183 by 213 cm). These sizes vary between the EU and United States. You should note this in case you buy the bed frame or mattress from a retailer in an EU country."
        },
        {
          "headline":"Measure your mattress.",
          "description":"Check the height of the mattress and bed sets you are considering. Then, determine if you need a high or low bed frame. So, if you have a mattress that’s four inches high, then you might want to consider a high bed frame. Using a low bed frame with this mattress might lead to your bed standing too close to the floor. You don’t want the bed frame to be so high that it is difficult to get in and out. At the same time, you don’t want to get a bed frame that is so low that your mattress is touching the ground."
        },
        {
          "headline":"Determine whether you want a footboard.",
          "description":"Measure how tall you are. A bed frame that is too small will be uncomfortable, because you will consistently be banging your head or feet when you get into it. Use your height to decide if you need a bed frame with a foot board. If you don’t, you can buy minimal bed frames in both wood and metal."
        },
        {
          "headline":"Buy a platform bed frame.",
          "description":"This type of bed frame has wooden slats that hold your mattress up. If you are in the market for a smaller frame, consider buying a platform bed frame. With some beds, you may not need a box spring in addition to the platform. Take into account that platform bed frames are generally closer to the ground than other bed frames. If you prefer a simple look with the mattress resting right on the slats of the frame, there's no need for a boxspring."
        },
        {
          "headline":"Buy a bed frame with bottom storage.",
          "description":"Depending on your living situation, you might need a bed that has multiple functions. If your apartment or room is quite small, then you might benefit from a bed that can store your things. A bed frame with bottom storage will have space under the bed for books, supplies, and other possessions. Usually, this storage area is located under the place where you will put your mattress. This is an especially great option for rooms without a closet or small apartments that are lacking in storage space in general. You can even find bed frames with built in drawers."
        },
        {
          "headline":"Choose a color and style.",
          "description":"Pick a frame with colors and décor style that you like. Page through décor magazines such as Pottery Barn, West Elm, Ikea, Restoration Hardware and Crate and Barrel. Try to take detailed notes about what you like. Choose your style and then go comparison shopping in furniture stores or in box stores, like Target."
        }
      ]
    },
    {
      "name":"Finding the Right Price",
      "steps":[
        {
          "headline":"Don’t rush.",
          "description":"Give yourself some time to buy the perfect bed. Don’t simply buy the first thing that you see. You want to make sure that you have done thorough research. The more rushed you are in making a purchase, the less likely you are to find a good deal."
        },
        {
          "headline":"Choose the right time.",
          "description":"Buy your mattress in May if possible. Mattress companies often come out with new models in May or June. These are also months when retailers will mark down old models. Other good times include holidays, like Labor Day and President’s Day, when furniture stores have big sales."
        },
        {
          "headline":"Be cautious when buying online.",
          "description":"Unless you are completely sure, it is best to avoid buying a mattress online. If you slept on the mattress while staying with friends or at a bed and breakfast, you may be able to order it at discount online without too much worry. Yes, there are definitely cheap options on the Internet; however, since you usually won’t be able to see the bed firsthand, you should be wary of online deals."
        },
        {
          "headline":"Do comparison shopping online.",
          "description":"After you test out mattresses at several stores, look online for the best prices. Make sure to include shipping costs and warranties. The price you calculate online may be cheaper than what is offered in-store, in which case you can bring the price into a store to ask for a price reduction. After going to several stores, create a comparison sheet between retailers."
        },
        {
          "headline":"Get a comfort warranty.",
          "description":"Talk to the salesperson and ask if they offer a comfort guarantee. A comfort warranty states that if the bed is not comfortable, then you can exchange or return it. If they do, ask for specific details. You want to know if you will need to exchange the bed or pay for the bed to be shipped back. Generally, this is included in the mattress price. Give preference to any retailer that gives a comfort guarantee for 1 year after purchase."
        },
        {
          "headline":"Search for discounts.",
          "description":"Look for any discounts available. For example, some stores give you a discount for buying a bed set. Sold separately, a box spring and mattress can be over $1,000 each. However, most bed stores are willing to make a deal when you purchase both at once. Some stores offer prices reduction if you find that another store has a cheaper price for the same item. You should also ask about payment plans, and if it is possible to sign up for one."
        },
        {
          "headline":"Consider interest-free financing.",
          "description":"Going this route depends on your budget. If you think you can pay for the bed immediately, then you probably shouldn’t use an installment plan. However, if you can’t pay for your bed up front, many furniture stores still offer installment payments. Speak to the salesperson, and ask for information about this option. All plans are not the same. For example, stores will often ask you to go through a third party lender such as a bank or finance company. Usually, these institutions will need to approve you for credit. They may also have minimum purchase amounts and application fees."
        }
      ]
    }
  ],
  "text":" Choosing a Mattress Purchase an inner spring mattress. Inner spring is the most common mattress type, and almost every mattress store will carry this model. Chances are you have either seen or slept on this type of mattress before. The inner spring mattress is usually distinguished by coil count. Generally, the higher the coil count, the higher the price. However, these types of mattresses are available in all price ranges. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKatherine Tlapa\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tInterior Designer\t\t\t\t\t\t\t\tKatherine Tlapa is an interior designer, currently working as a Design Specialist for Modsy, a design service based in San Francisco. She also runs her own DIY Home Design blog, My Eclectic Grace. She received her BFA in Interior Architecture from Ohio University in 2016. Katherine Tlapa\t\t\tInterior Designer\t\t\t\tYou don't always need a box spring to go with your mattress. Katherine Tlapa, an interior designer, advises: \"If you have a bed frame that has large open slats, then you need a box spring to keep the mattress from falling through. But for most platform beds, you do not actually need a box spring.\" Consider buying a foam mattress. Foam mattresses are made of memory foam, which is soft and conforms to the body. It is good for people who desire extra softness. This type is often more expensive than the inner spring type of mattress because it conforms to people's bodies. This can be good for some people and a negative for others. For example, people with pressure points and joint problems may prefer a foam mattress. Some people find that this type of mattress makes them uncomfortably warm. Maybe your current mattress is quite soft, and you want to find a bed with adequate firmness. If this is your situation, then you may want to avoid memory foam and stick to an inner-spring type of mattress. Look into air mattresses. Air mattresses can be adjusted by the user for an appropriate amount of softness. This is done with an electric pump. Sleep Number beds are the most well known type of air mattress. These beds are separated into 2 areas, which can be controlled by remotes. The air pockets above the coils can be firm or soft. Often times, mattresses like this will have a foam covering as well. If you disagree about the type of mattress you and your partner want, you should consider an air mattress. Consider significant additional features. There are characteristics in mattresses that you may specifically want or need. For instance, you might want to make sure you are buying an “eco-friendly” mattress. In that case, research potential mattresses to see if they were built to either OE Standards or the Global Organic Textile Standards (GOTS). If you have pain or simply feel uncomfortable, you may want a bed with adjustable positioning. This type of bed will allow you to rest at an incline. If you have specific health concerns you might want to ask your doctor for advice. Choose a size preference. You might consider a twin if you are by yourself. Maybe you’re alone, but you want some extra space. In that case, a full could be what you want. Queen size and king size beds are generally preferred by couples. Twin, full, queen, and king are all standard mattress sizes. However, if these sizes are too small for you, then you may want to consider the California King size. This extra large mattress is 72 by 84 inches (182 cm by 213 cm). Make sure you consider the size of the bedroom. You might like a king, but if it barely fits into the room it's not going to be a good choice. Test your mattress. Lie on the mattress in your regular fashion. Aim to spend at least 15 minutes on the mattress. You want to create a sleeping situation as close to the one you have at home. Make sure that you change positions frequently in order to imitate how you would normally go to sleep. Never buy a mattress that is untested. If you will share the mattress, make sure both people try it before you buy. There are an increasing number of mattresses you can buy online. These can be a great choice if you are looking to save money, though you will not be able to try them out. Make sure the company you buy from has a good return policy and that you understand the terms. Picking a Bed Frame Measure your room. Look at the space where your bed will go, and measure it with a tape ruler. Make sure there is at least a few feet of space to the walls and any furniture in the room. The size of the bed will depend on the size of the room. Another way to get an accurate measure if you already have a mattress, is to place the mattress on the floor of your room. By doing this, you will see exactly how much space the mattress itself will take up. This will be incredibly helpful in choosing what type of bed frame to buy. Common bed frame sizes are twin, full, queen, and king. A twin bed frame will fit in a space of 39 inches by 70 inches (99 to 178 cm). For a full bed frame, you will generally need a space measuring 54 by 75 inches (137 by 190 cm). 60 by 80 inches (152 by 203 cm) is a large enough space for a queen bed frame. A king bed frame will require 72 by 84 inches (183 by 213 cm). These sizes vary between the EU and United States. You should note this in case you buy the bed frame or mattress from a retailer in an EU country. Measure your mattress. Check the height of the mattress and bed sets you are considering. Then, determine if you need a high or low bed frame. So, if you have a mattress that’s four inches high, then you might want to consider a high bed frame. Using a low bed frame with this mattress might lead to your bed standing too close to the floor. You don’t want the bed frame to be so high that it is difficult to get in and out. At the same time, you don’t want to get a bed frame that is so low that your mattress is touching the ground. Determine whether you want a footboard. Measure how tall you are. A bed frame that is too small will be uncomfortable, because you will consistently be banging your head or feet when you get into it. Use your height to decide if you need a bed frame with a foot board. If you don’t, you can buy minimal bed frames in both wood and metal. Buy a platform bed frame. This type of bed frame has wooden slats that hold your mattress up. If you are in the market for a smaller frame, consider buying a platform bed frame. With some beds, you may not need a box spring in addition to the platform. Take into account that platform bed frames are generally closer to the ground than other bed frames. If you prefer a simple look with the mattress resting right on the slats of the frame, there's no need for a boxspring. Buy a bed frame with bottom storage. Depending on your living situation, you might need a bed that has multiple functions. If your apartment or room is quite small, then you might benefit from a bed that can store your things. A bed frame with bottom storage will have space under the bed for books, supplies, and other possessions. Usually, this storage area is located under the place where you will put your mattress. This is an especially great option for rooms without a closet or small apartments that are lacking in storage space in general. You can even find bed frames with built in drawers. Choose a color and style. Pick a frame with colors and décor style that you like. Page through décor magazines such as Pottery Barn, West Elm, Ikea, Restoration Hardware and Crate and Barrel. Try to take detailed notes about what you like. Choose your style and then go comparison shopping in furniture stores or in box stores, like Target. Finding the Right Price Don’t rush. Give yourself some time to buy the perfect bed. Don’t simply buy the first thing that you see. You want to make sure that you have done thorough research. The more rushed you are in making a purchase, the less likely you are to find a good deal. Choose the right time. Buy your mattress in May if possible. Mattress companies often come out with new models in May or June. These are also months when retailers will mark down old models. Other good times include holidays, like Labor Day and President’s Day, when furniture stores have big sales. Be cautious when buying online. Unless you are completely sure, it is best to avoid buying a mattress online. If you slept on the mattress while staying with friends or at a bed and breakfast, you may be able to order it at discount online without too much worry. Yes, there are definitely cheap options on the Internet; however, since you usually won’t be able to see the bed firsthand, you should be wary of online deals. Do comparison shopping online. After you test out mattresses at several stores, look online for the best prices. Make sure to include shipping costs and warranties. The price you calculate online may be cheaper than what is offered in-store, in which case you can bring the price into a store to ask for a price reduction. After going to several stores, create a comparison sheet between retailers. Get a comfort warranty. Talk to the salesperson and ask if they offer a comfort guarantee. A comfort warranty states that if the bed is not comfortable, then you can exchange or return it. If they do, ask for specific details. You want to know if you will need to exchange the bed or pay for the bed to be shipped back. Generally, this is included in the mattress price. Give preference to any retailer that gives a comfort guarantee for 1 year after purchase. Search for discounts. Look for any discounts available. For example, some stores give you a discount for buying a bed set. Sold separately, a box spring and mattress can be over $1,000 each. However, most bed stores are willing to make a deal when you purchase both at once. Some stores offer prices reduction if you find that another store has a cheaper price for the same item. You should also ask about payment plans, and if it is possible to sign up for one. Consider interest-free financing. Going this route depends on your budget. If you think you can pay for the bed immediately, then you probably shouldn’t use an installment plan. However, if you can’t pay for your bed up front, many furniture stores still offer installment payments. Speak to the salesperson, and ask for information about this option. All plans are not the same. For example, stores will often ask you to go through a third party lender such as a bank or finance company. Usually, these institutions will need to approve you for credit. They may also have minimum purchase amounts and application fees.",
  "tyn_model":[
    "mattress",
    "bed frame",
    "bed",
    "mattresses",
    "interior designer",
    "bed frames",
    "inner spring mattress",
    "memory foam",
    "air mattresses",
    "air mattress",
    "mattress store",
    "interior architecture",
    "foam mattress",
    "foam mattresses",
    "sleep number beds",
    "“eco",
    "” mattress",
    "tape ruler",
    "bed sets",
    "comfort warranty",
    "bed set",
    "box spring",
    "installment plan"
  ],
  "tyn_section":[

  ]
}