{
  "title":"How to Teach a Quilting Class",
  "url":"https://www.wikihow.com/Teach-a-Quilting-Class",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Quilting"
  ],
  "parts":[
    {
      "name":"Preparing Yourself",
      "steps":[
        {
          "headline":"Do your homework first.",
          "description":"Ask around the local area and see where classes are held, ie. at quilting guilds, groups, colleges or shops. If classes are not currently held nearby, consider whether you are prepared to hold classes at home or in a hired hall. If possible find an experienced local quilt teacher that can suggest where to start (and perhaps where to avoid). Find out the basis of pay normally expected. Are classes charged per day, per hour or per student? Once you have established that there is a place to teach, and that the pay is acceptable, begin preparing a class as follows."
        },
        {
          "headline":"Take an account of the quilting skills you excel at.",
          "description":"Develop a basic plan of what type of skill or project you would be confident teaching."
        },
        {
          "headline":"Jot down notes while thinking about the class for seed ideas.",
          "description":"Be careful not to use another person's class or pattern as the basis for the class without written consent. Violating a copyright is not just rude; it is illegal. Many quilt designers are happy for their work to be used, but always always always get that in writing."
        },
        {
          "headline":"Know that a typical full-day quilting class lasts for six hours.",
          "description":"This may seem extreme at first, but for a well prepared teacher the time will fly. Plan a project that can be completed or well-started by a novice during six hours. If this class is a skill class, create some sort of project such as a cushion top, table runner, lap quilt or wall hanging using that skill."
        }
      ]
    },
    {
      "name":"Preparing Your Materials",
      "steps":[
        {
          "headline":"Prepare samples of your class project.",
          "description":"Make sure it actually goes together as expected! Keep precise notes of the steps used, and measurements and materials used. Most teachers provide some sort of notes or patterns for their students. The notes taken while making samples will make the hand-outs much easier to write. Sometimes a partially finished project makes a good visual to teach some part of a technique. Create any visuals you may use in class."
        },
        {
          "headline":"Calculate the 'needs list.'",
          "description":"Write down exactly what students would need to bring to the class for the project. Remember to include things like extension cords for machines, spare needles, and cutting boards. Classes run more smoothly when students have all the tools they need to accomplish their project."
        },
        {
          "headline":"Double-check the 'needs list' for accuracy.",
          "description":"Consider adding slightly more fabric than needed to allow for cutting errors."
        },
        {
          "headline":"Prepare notes for yourself.",
          "description":"Start with greetings and introductions all round, perhaps include a brief chat of how you came to be a quilter and why this project is going to be fun and exciting. Starting with personal interaction and positive enthusiasm will help students relax and get class headed the right direction. the \"teacher\" class notes should break the project down into practical incremental steps. These may not be referred to a great deal if you are very confident in your subject matter (which is fine) but be sure to look them over as you teach to ensure you are not forgetting anything essential."
        },
        {
          "headline":"Prepare notes for the students.",
          "description":"These may be as brief or as detailed as desired, but should include enough information for attendees to complete their project at home. It is also a good idea to list the class name, your name, email address and a copyright to each page of the notes. These notes reflect your personal style. They may be hand written or crafted on a computer, either way as long as they looks tidy. Think of what kind of notes you would want from a class. Are they neat? Are they clear? Are they complete? Have someone who quilts proofread the student notes for typos or unclear areas."
        },
        {
          "headline":"Consider doing a \"test class.\"",
          "description":"If practical - recruit a few (3 or 4) quilt friends to be a 'guinea pig' class before offering it to a shop or guild. This is an opportunity to find any part of the instruction that needs tweaking and also enables you to honestly say you have taught this class previously. A practice class is not essential, but thorough preparation is."
        }
      ]
    },
    {
      "name":"Planning with the Venue and Students",
      "steps":[
        {
          "headline":"Make a proposal for the targeted teaching venue.",
          "description":"Generally the proposal should include a cover letter introducing yourself, the class being proposing, as well as photos of the class samples and referrals from previous students. Again this is a representation of you, so make this as professional as possible"
        },
        {
          "headline":"Figure out specifics with the venue.",
          "description":"Some things to discuss include class times, building access (door locks, alarms and such) access to additional supplies if needed, class size, chalkboard or wipe board, ironing boards, irons, lighting, electrical outlets, restroom facilities, food availability for lunch (usually) student parking, pay schedule (some pay before a certain date the next month - know ahead so there are no surprises). Also reimbursement for class notes or kits, if you are bringing hard to find supplies for the class."
        },
        {
          "headline":"Let your students know the plan.",
          "description":"When a class is scheduled, provide venue with needs list to distribute to students."
        },
        {
          "headline":"Confirm everything before your first class.",
          "description":"The day before the class ring the employer and confirm class numbers. Prepare sufficient notes/kits for the class."
        }
      ]
    },
    {
      "name":"Starting the Class",
      "steps":[
        {
          "headline":"Set up at the venue.",
          "description":"The day of the class arrive early and hang samples if possible. Make sure the room is tidy and inviting; if the temperature is extreme take measures to have that dealt with."
        },
        {
          "headline":"Greet each student and make note of where they sit.",
          "description":"To help remember names, draw a rough sketch of the seating (for instance 6 rectangles for 6 desks) and note names in relation to where students sit. Refer to it frequently and in a short time the names will roll easily off your tongue. It makes a difference to the class when students know you have taken time to learn their names."
        },
        {
          "headline":"Make introductions and double check everyone has their notes.",
          "description":"Teach the lesson keeping an eye on the faces of the students to see if they appear to be understanding. Encourage them to ask questions if they aren't sure about something."
        },
        {
          "headline":"Be involved.",
          "description":"As students begin to work on their project, circulate the room. Looking at each person's efforts. If a student attempts to dominate your time excuse yourself with \"I just need to check on how so and so is doing…\"   Some students will tootle along needing no help which makes them easy to ignore. Try to give each meaningful attention."
        }
      ]
    },
    {
      "name":"Teaching the Class",
      "steps":[
        {
          "headline":"Teach with a supportive style.",
          "description":"If a student is doing something wrong, suggest with words like \"You might find this easier if you try to hold the fabric this way\" or \"Hey, I have a little technique that just might make that go together easier\"   Attempt to downplay mistakes, and praise effort. Be careful that overachievers don't make other students feel like the class is a race. There is always that one. When someone finishes something very quickly don't make a fuss. Encourage those who need it. If a student seems overwhelmed or discouraged, spending a couple of minutes encouraging them is important. With warm smiles, confide in them of how often you have to re-do items. Reassure them it's normal! Encourage a positive atmosphere. Keep the whole class experience as positive as possible, avoiding criticism of other tutors, groups or student (which just makes a person look petty) ."
        },
        {
          "headline":"Get your students' attention.",
          "description":"When new information is being introduced make sure you have everyone's attention and that everyone can see if you are doing a demonstration."
        },
        {
          "headline":"Encourage frequent breaks.",
          "description":"Make sure your students flex their necks and shoulders and wrists."
        },
        {
          "headline":"Ask permission before taking photos of people in class.",
          "description":"Try to get photos of everyone and perhaps a group photo with the group showing their work. A collection of these photos will bring a smile years later!"
        },
        {
          "headline":"Build connections with your students.",
          "description":"Thank the class for attending and encourage them to leave their email (with their name written beside it) so you can let them know about any future classes."
        },
        {
          "headline":"Clean up at the end.",
          "description":"Tidy the room and collect any lost and found items to give to the hosting venue."
        }
      ]
    }
  ],
  "text":" Preparing Yourself Do your homework first. Ask around the local area and see where classes are held, ie. at quilting guilds, groups, colleges or shops. If classes are not currently held nearby, consider whether you are prepared to hold classes at home or in a hired hall. If possible find an experienced local quilt teacher that can suggest where to start (and perhaps where to avoid). Find out the basis of pay normally expected. Are classes charged per day, per hour or per student? Once you have established that there is a place to teach, and that the pay is acceptable, begin preparing a class as follows. Take an account of the quilting skills you excel at. Develop a basic plan of what type of skill or project you would be confident teaching. Jot down notes while thinking about the class for seed ideas. Be careful not to use another person's class or pattern as the basis for the class without written consent. Violating a copyright is not just rude; it is illegal. Many quilt designers are happy for their work to be used, but always always always get that in writing. Know that a typical full-day quilting class lasts for six hours. This may seem extreme at first, but for a well prepared teacher the time will fly. Plan a project that can be completed or well-started by a novice during six hours. If this class is a skill class, create some sort of project such as a cushion top, table runner, lap quilt or wall hanging using that skill. Preparing Your Materials Prepare samples of your class project. Make sure it actually goes together as expected! Keep precise notes of the steps used, and measurements and materials used. Most teachers provide some sort of notes or patterns for their students. The notes taken while making samples will make the hand-outs much easier to write. Sometimes a partially finished project makes a good visual to teach some part of a technique. Create any visuals you may use in class. Calculate the 'needs list.' Write down exactly what students would need to bring to the class for the project. Remember to include things like extension cords for machines, spare needles, and cutting boards. Classes run more smoothly when students have all the tools they need to accomplish their project. Double-check the 'needs list' for accuracy. Consider adding slightly more fabric than needed to allow for cutting errors. Prepare notes for yourself. Start with greetings and introductions all round, perhaps include a brief chat of how you came to be a quilter and why this project is going to be fun and exciting. Starting with personal interaction and positive enthusiasm will help students relax and get class headed the right direction. the \"teacher\" class notes should break the project down into practical incremental steps. These may not be referred to a great deal if you are very confident in your subject matter (which is fine) but be sure to look them over as you teach to ensure you are not forgetting anything essential. Prepare notes for the students. These may be as brief or as detailed as desired, but should include enough information for attendees to complete their project at home. It is also a good idea to list the class name, your name, email address and a copyright to each page of the notes. These notes reflect your personal style. They may be hand written or crafted on a computer, either way as long as they looks tidy. Think of what kind of notes you would want from a class. Are they neat? Are they clear? Are they complete? Have someone who quilts proofread the student notes for typos or unclear areas. Consider doing a \"test class.\" If practical - recruit a few (3 or 4) quilt friends to be a 'guinea pig' class before offering it to a shop or guild. This is an opportunity to find any part of the instruction that needs tweaking and also enables you to honestly say you have taught this class previously. A practice class is not essential, but thorough preparation is. Planning with the Venue and Students Make a proposal for the targeted teaching venue. Generally the proposal should include a cover letter introducing yourself, the class being proposing, as well as photos of the class samples and referrals from previous students. Again this is a representation of you, so make this as professional as possible Figure out specifics with the venue. Some things to discuss include class times, building access (door locks, alarms and such) access to additional supplies if needed, class size, chalkboard or wipe board, ironing boards, irons, lighting, electrical outlets, restroom facilities, food availability for lunch (usually) student parking, pay schedule (some pay before a certain date the next month - know ahead so there are no surprises). Also reimbursement for class notes or kits, if you are bringing hard to find supplies for the class. Let your students know the plan. When a class is scheduled, provide venue with needs list to distribute to students. Confirm everything before your first class. The day before the class ring the employer and confirm class numbers. Prepare sufficient notes/kits for the class. Starting the Class Set up at the venue. The day of the class arrive early and hang samples if possible. Make sure the room is tidy and inviting; if the temperature is extreme take measures to have that dealt with. Greet each student and make note of where they sit. To help remember names, draw a rough sketch of the seating (for instance 6 rectangles for 6 desks) and note names in relation to where students sit. Refer to it frequently and in a short time the names will roll easily off your tongue. It makes a difference to the class when students know you have taken time to learn their names. Make introductions and double check everyone has their notes. Teach the lesson keeping an eye on the faces of the students to see if they appear to be understanding. Encourage them to ask questions if they aren't sure about something. Be involved. As students begin to work on their project, circulate the room. Looking at each person's efforts. If a student attempts to dominate your time excuse yourself with \"I just need to check on how so and so is doing…\"   Some students will tootle along needing no help which makes them easy to ignore. Try to give each meaningful attention. Teaching the Class Teach with a supportive style. If a student is doing something wrong, suggest with words like \"You might find this easier if you try to hold the fabric this way\" or \"Hey, I have a little technique that just might make that go together easier\"   Attempt to downplay mistakes, and praise effort. Be careful that overachievers don't make other students feel like the class is a race. There is always that one. When someone finishes something very quickly don't make a fuss. Encourage those who need it. If a student seems overwhelmed or discouraged, spending a couple of minutes encouraging them is important. With warm smiles, confide in them of how often you have to re-do items. Reassure them it's normal! Encourage a positive atmosphere. Keep the whole class experience as positive as possible, avoiding criticism of other tutors, groups or student (which just makes a person look petty) . Get your students' attention. When new information is being introduced make sure you have everyone's attention and that everyone can see if you are doing a demonstration. Encourage frequent breaks. Make sure your students flex their necks and shoulders and wrists. Ask permission before taking photos of people in class. Try to get photos of everyone and perhaps a group photo with the group showing their work. A collection of these photos will bring a smile years later! Build connections with your students. Thank the class for attending and encourage them to leave their email (with their name written beside it) so you can let them know about any future classes. Clean up at the end. Tidy the room and collect any lost and found items to give to the hosting venue.",
  "tyn_model":[
    "quilt",
    "fabric",
    "quilt teacher",
    "table runner",
    "extension cords",
    "quilter",
    "ironing boards",
    "irons",
    "…\"",
    "tutors"
  ],
  "tyn_section":[

  ]
}