{
  "title":"How to Make Nutella Stuffed Croissants",
  "url":"https://www.wikihow.com/Make-Nutella-Stuffed-Croissants",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets"
  ],
  "steps":[
    {
      "headline":"Open and unwrap refrigerated croissant dough.",
      "description":"Unroll dough and separate croissant pieces (there should be perforated edges to use as a guide). Lay croissant pieces on a clean, flat surface."
    },
    {
      "headline":"Add 1 tsp.",
      "description":"of Nutella to the middle of the croissant piece. Use the spoon to spread the Nutella out into a small square (leaving approximately 1 or 2” from the edge)."
    },
    {
      "headline":"Place 5 to 8 mini-marshmallows on top of your Nutella square.",
      "description":"Cover the square with marshmallows without overwhelming it."
    },
    {
      "headline":"Fold croissant piece into a triangle.",
      "description":"Make sure none of the Nutella or marshmallows ooze from the sides. If they do, remove some of the filling until you have a comfortable fit."
    },
    {
      "headline":"Crimp the edges of the croissant using your fork.",
      "description":"Work your way around the folded edges by gently pressing down with the fork tongs to create a crimping pattern."
    },
    {
      "headline":"Bake croissants according to package/manufacturer directions.",
      "description":"Marshmallows should melt into the Nutella to create a creamy, chocolaty filling."
    }
  ],
  "text":" Open and unwrap refrigerated croissant dough. Unroll dough and separate croissant pieces (there should be perforated edges to use as a guide). Lay croissant pieces on a clean, flat surface. Add 1 tsp. of Nutella to the middle of the croissant piece. Use the spoon to spread the Nutella out into a small square (leaving approximately 1 or 2” from the edge). Place 5 to 8 mini-marshmallows on top of your Nutella square. Cover the square with marshmallows without overwhelming it. Fold croissant piece into a triangle. Make sure none of the Nutella or marshmallows ooze from the sides. If they do, remove some of the filling until you have a comfortable fit. Crimp the edges of the croissant using your fork. Work your way around the folded edges by gently pressing down with the fork tongs to create a crimping pattern. Bake croissants according to package/manufacturer directions. Marshmallows should melt into the Nutella to create a creamy, chocolaty filling.",
  "tyn_model":[
    "nutella",
    "croissant",
    "croissant dough",
    "spoon",
    "” from",
    "marshmallows",
    "fork",
    "fork tongs"
  ],
  "tyn_section":[

  ]
}