{
  "title":"How to Make Creamed Strips of Sirloin",
  "url":"https://www.wikihow.com/Make-Creamed-Strips-of-Sirloin",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 375°F/190°C.",
      "description":""
    },
    {
      "headline":"In a skillet, fry the sirloin steak over medium heat with the butter.",
      "description":"Cook and flip the steak occasionally, for a few minutes."
    },
    {
      "headline":"Transfer the steak to a baking dish.",
      "description":"Use a slotted spoon to transfer the meat, to avoid carrying liquid over. Leave the steak juices in the skillet."
    },
    {
      "headline":"Reuse the same skillet for the cream sauce.",
      "description":"Cook the mushrooms for a few minutes, to enhance the flavours of the mushrooms. Combine the ginger, sherry, mustard, cream, salt, and pepper to the skillet. Continue stirring for a few minutes while stirring occasionally."
    },
    {
      "headline":"Add the cream sauce to the steak.",
      "description":"Be sure to drizzle the sauce all over the top instead of dumping it in the middle or one spot."
    },
    {
      "headline":"Bake the mixture.",
      "description":"Insert the baking dish into the oven and allow it to cook for 10 minutes."
    },
    {
      "headline":"Boil the pasta.",
      "description":"Add the basil and olive oil and follow the directions on the pasta box to cook it to al dente."
    },
    {
      "headline":"Drain the pasta completely and add it to a serving dish.",
      "description":""
    },
    {
      "headline":"Place the sirloin steak on top of the pasta.",
      "description":"Drizzle the cream sauce mixture on top of the steak and sprinkle some basil on top."
    },
    {
      "headline":"Enjoy this dish with toast or baguette.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 375°F/190°C.  In a skillet, fry the sirloin steak over medium heat with the butter. Cook and flip the steak occasionally, for a few minutes. Transfer the steak to a baking dish. Use a slotted spoon to transfer the meat, to avoid carrying liquid over. Leave the steak juices in the skillet. Reuse the same skillet for the cream sauce. Cook the mushrooms for a few minutes, to enhance the flavours of the mushrooms. Combine the ginger, sherry, mustard, cream, salt, and pepper to the skillet. Continue stirring for a few minutes while stirring occasionally. Add the cream sauce to the steak. Be sure to drizzle the sauce all over the top instead of dumping it in the middle or one spot. Bake the mixture. Insert the baking dish into the oven and allow it to cook for 10 minutes. Boil the pasta. Add the basil and olive oil and follow the directions on the pasta box to cook it to al dente. Drain the pasta completely and add it to a serving dish.  Place the sirloin steak on top of the pasta. Drizzle the cream sauce mixture on top of the steak and sprinkle some basil on top. Enjoy this dish with toast or baguette. ",
  "tyn_model":[
    "skillet",
    "cream sauce",
    "oven",
    "baking dish",
    "mushrooms",
    "basil",
    "butter",
    "slotted spoon",
    "ginger",
    "sherry",
    "mustard",
    "cream",
    "salt",
    "pepper",
    "olive oil",
    "baguette"
  ],
  "tyn_section":[

  ]
}