{
  "title":"How to Make an Organic Fruit and Vegetable Wash",
  "url":"https://www.wikihow.com/Make-an-Organic-Fruit-and-Vegetable-Wash",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning"
  ],
  "steps":[
    {
      "headline":"Prepare the organic lemon.",
      "description":"You can use a normal lemon, which would be slightly cheaper, but the wash couldn't be called \"organic\", just \"natural\". Regardless, both kinds of lemons will be fine for the task. Slice the lemon in half. Squeeze out one tablespoon of lemon juice into the spray bottle. The lemon juice is both a natural disinfectant and will leave your fruits and vegetables smelling nice."
    },
    {
      "headline":"Pour 2 tablespoons of vinegar into the spray bottle along with one cup of water.",
      "description":"The vinegar provides some additional disinfectant power."
    },
    {
      "headline":"Screw on the top.",
      "description":"Shake the mixture vigorously."
    },
    {
      "headline":"Spray the wash on all of your fruits and vegetables prior to using them.",
      "description":"After each spray, rinse it off. They're now ready to eat or use in cooking."
    }
  ],
  "text":" Prepare the organic lemon. You can use a normal lemon, which would be slightly cheaper, but the wash couldn't be called \"organic\", just \"natural\". Regardless, both kinds of lemons will be fine for the task. Slice the lemon in half. Squeeze out one tablespoon of lemon juice into the spray bottle. The lemon juice is both a natural disinfectant and will leave your fruits and vegetables smelling nice. Pour 2 tablespoons of vinegar into the spray bottle along with one cup of water. The vinegar provides some additional disinfectant power. Screw on the top. Shake the mixture vigorously. Spray the wash on all of your fruits and vegetables prior to using them. After each spray, rinse it off. They're now ready to eat or use in cooking.",
  "tyn_model":[
    "lemon",
    "lemon juice",
    "spray bottle",
    "vinegar",
    "water"
  ],
  "tyn_section":[

  ]
}