{
  "title":"How to Print a Design Onto a Shirt Using Sandpaper",
  "url":"https://www.wikihow.com/Print-a-Design-Onto-a-Shirt-Using-Sandpaper",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects"
  ],
  "steps":[
    {
      "headline":"Heat the iron up (a moderate-to-high setting as all iron settings vary).",
      "description":""
    },
    {
      "headline":"Draw out your design (in pencil first) on the gritty side of the sandpaper.",
      "description":"Whatever you draw it will come reversed; like that when you look in the mirror."
    },
    {
      "headline":"Trace the drawing in crayon.",
      "description":"Color very thoroughly. You want to get it into the sandpaper good."
    },
    {
      "headline":"Put the cardboard under the shirt.",
      "description":"(Make sure it'll match up in the place where you're going to print.)"
    },
    {
      "headline":"Place the newsprint spread-out on a flat surface (or the floor) and place the shirt on top of the newsprint.",
      "description":""
    },
    {
      "headline":"Make sure the shirt is flat on the surface, no wrinkles, no bunching-up.",
      "description":""
    },
    {
      "headline":"Place your sandpaper design-side down on the area of the shirt where your cardboard is.",
      "description":""
    },
    {
      "headline":"Place a piece of newsprint over your sandpaper and start ironing.",
      "description":""
    },
    {
      "headline":"Lift up the newsprint every two minutes.",
      "description":"Oily spots will start to rise up through the smooth side of the sandpaper. This is supposed to happen. Keep ironing until you don't see much more oil coming up."
    },
    {
      "headline":"Put the iron down and lift the newsprint off the sandpaper.",
      "description":"Gently peel the sandpaper off the shirt and marvel at your amazing creation!"
    },
    {
      "headline":"Lay it out to dry for about five minutes and then you're done.",
      "description":""
    }
  ],
  "text":" Heat the iron up (a moderate-to-high setting as all iron settings vary).  Draw out your design (in pencil first) on the gritty side of the sandpaper. Whatever you draw it will come reversed; like that when you look in the mirror. Trace the drawing in crayon. Color very thoroughly. You want to get it into the sandpaper good. Put the cardboard under the shirt. (Make sure it'll match up in the place where you're going to print.) Place the newsprint spread-out on a flat surface (or the floor) and place the shirt on top of the newsprint.  Make sure the shirt is flat on the surface, no wrinkles, no bunching-up.  Place your sandpaper design-side down on the area of the shirt where your cardboard is.  Place a piece of newsprint over your sandpaper and start ironing.  Lift up the newsprint every two minutes. Oily spots will start to rise up through the smooth side of the sandpaper. This is supposed to happen. Keep ironing until you don't see much more oil coming up. Put the iron down and lift the newsprint off the sandpaper. Gently peel the sandpaper off the shirt and marvel at your amazing creation! Lay it out to dry for about five minutes and then you're done. ",
  "tyn_model":[
    "iron",
    "cardboard",
    "sandpaper",
    "crayon",
    "shirt"
  ],
  "tyn_section":[

  ]
}