{
  "title":"How to Reconstitute Dried Fruit",
  "url":"https://www.wikihow.com/Reconstitute-Dried-Fruit",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Preservation Techniques",
    "Drying Food"
  ],
  "methods":[
    {
      "name":"Reconstituting the Dried Fruit",
      "steps":[
        {
          "headline":"Select the dried fruit.",
          "description":"Whether your following a recipe or simply preparing fruit for a dessert dish, choose the type and amount needed. Most types of dried fruit will reconstitute well."
        },
        {
          "headline":"Put the fruit into a large bowl.",
          "description":"The fruit should not come more than halfway up the bowl, as it is going to double or even treble in size once the moisture is restored."
        },
        {
          "headline":"Pour water over the fruit.",
          "description":"Pour enough to cover, and about another inch/2.5 centimeter (1.0 in) of water over the top."
        },
        {
          "headline":"Let the fruit stand.",
          "description":"The fruit should soak for at least 12 hours, or overnight. Either place a lid, upside down plate or clean tea towel over the top, to prevent insects or anything else from falling in during the soaking process."
        },
        {
          "headline":"Check that the fruit has reconstituted adequately.",
          "description":"If you're happy it's ready, use as required. If not, leave a bit longer."
        }
      ]
    },
    {
      "name":"Cooking the Fruit",
      "steps":[
        {
          "headline":"Cook the fruit.",
          "description":"If you are making dessert from the fruit, one good option is to cook the reconstituted fruit."
        },
        {
          "headline":"Pour the soaking water and fruit into a saucepan or pot.",
          "description":""
        },
        {
          "headline":"Bring to the boil and cook for a few minutes or until the fruit is soft enough.",
          "description":""
        },
        {
          "headline":"Drain.",
          "description":"Pour the fruit into serving bowls."
        },
        {
          "headline":"Serve.",
          "description":"Serve warm or chilled. Add a dollop of whipped cream or a scoop of ice cream."
        }
      ]
    }
  ],
  "text":" Reconstituting the Dried Fruit Select the dried fruit. Whether your following a recipe or simply preparing fruit for a dessert dish, choose the type and amount needed. Most types of dried fruit will reconstitute well. Put the fruit into a large bowl. The fruit should not come more than halfway up the bowl, as it is going to double or even treble in size once the moisture is restored. Pour water over the fruit. Pour enough to cover, and about another inch/2.5 centimeter (1.0 in) of water over the top. Let the fruit stand. The fruit should soak for at least 12 hours, or overnight. Either place a lid, upside down plate or clean tea towel over the top, to prevent insects or anything else from falling in during the soaking process. Check that the fruit has reconstituted adequately. If you're happy it's ready, use as required. If not, leave a bit longer. Cooking the Fruit Cook the fruit. If you are making dessert from the fruit, one good option is to cook the reconstituted fruit. Pour the soaking water and fruit into a saucepan or pot.  Bring to the boil and cook for a few minutes or until the fruit is soft enough.  Drain. Pour the fruit into serving bowls. Serve. Serve warm or chilled. Add a dollop of whipped cream or a scoop of ice cream.",
  "tyn_model":[
    "water",
    "dried fruit",
    "large bowl",
    "bowl",
    "tea towel",
    "saucepan",
    "pot",
    "serving bowls",
    "whipped cream",
    "ice cream"
  ],
  "tyn_section":[

  ]
}