{
  "title":"How to Mosaic a Headboard",
  "url":"https://www.wikihow.com/Mosaic-a-Headboard",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects",
    "Mosaic Projects"
  ],
  "steps":[
    {
      "headline":"Go to your local home improvement store and get grout, rubber gloves, a mask to cover your mouth and nose, goggles, a putty knife, tile of your choice, and glue (white glue, wood glue, rubber cement, or hot glue gun)",
      "description":""
    },
    {
      "headline":"Lay newspaper down on a picnic table or your lawn, then set your item on top (for instance, your headboard.",
      "description":""
    },
    {
      "headline":"Place tile(whole pieces) in an old pillowcase, then start tapping the top of the pillowcase with a hammer(to break the tile into pieces.)",
      "description":""
    },
    {
      "headline":"Next, arrange the tile pieces on your head board, as you will want it to look when it's finished.",
      "description":""
    },
    {
      "headline":"Piece by piece, dab a little glue to the bottoms of the tile, then adhere it back to the spot in which you have it arranged.",
      "description":"The glue keeps the tile in place while the application of the grout is being applied."
    },
    {
      "headline":"With your putty knife, apply the grout directly to the top of the tile, making sure it gets into all the gaps.",
      "description":"Don't worry about grout on the tops of the tile pieces, take a damp rag and wipe clean. Push grout down in cracks with your hands(while wearing your rubber gloves.)"
    },
    {
      "headline":"Read the manufacturer's directions on drying time.",
      "description":""
    },
    {
      "headline":"Install your new mosaic headboard.",
      "description":""
    }
  ],
  "text":" Go to your local home improvement store and get grout, rubber gloves, a mask to cover your mouth and nose, goggles, a putty knife, tile of your choice, and glue (white glue, wood glue, rubber cement, or hot glue gun)  Lay newspaper down on a picnic table or your lawn, then set your item on top (for instance, your headboard.  Place tile(whole pieces) in an old pillowcase, then start tapping the top of the pillowcase with a hammer(to break the tile into pieces.)  Next, arrange the tile pieces on your head board, as you will want it to look when it's finished.  Piece by piece, dab a little glue to the bottoms of the tile, then adhere it back to the spot in which you have it arranged. The glue keeps the tile in place while the application of the grout is being applied. With your putty knife, apply the grout directly to the top of the tile, making sure it gets into all the gaps. Don't worry about grout on the tops of the tile pieces, take a damp rag and wipe clean. Push grout down in cracks with your hands(while wearing your rubber gloves.) Read the manufacturer's directions on drying time.  Install your new mosaic headboard. ",
  "tyn_model":[
    "grout",
    "glue",
    "rubber gloves",
    "putty knife",
    "goggles",
    "white glue",
    "wood glue",
    "rubber cement",
    "hot glue gun",
    "newspaper"
  ],
  "tyn_section":[

  ]
}