{
  "title":"How to Replace a Broken Drive Belt in a Clothes Dryer",
  "url":"https://www.wikihow.com/Replace-a-Broken-Drive-Belt-in-a-Clothes-Dryer",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Home Repairs"
  ],
  "steps":[
    {
      "headline":"Safety first!",
      "description":"Unplug the machine from the wall-socket and make  sure the machine has been idle long enough so that the heater elements, etc. have cooled."
    },
    {
      "headline":"Remove the top cover of the machine by undoing the 2 bolts at the back of the top panel.",
      "description":""
    },
    {
      "headline":"You should now be able to see if the belt is broken or not.",
      "description":"It should be wrapped around the back of the drum. In this picture, you can see it has snapped and is loose on the drum."
    },
    {
      "headline":"Remove the plastic cover at the bottom rear of the machine and take off the black belt going from the red pulley to the white pulley (this turns the fan).",
      "description":""
    },
    {
      "headline":"At the back of the machine, undo the 5 or 6 bolts securing the air-flow cover...",
      "description":""
    },
    {
      "headline":"...revealing the drum securing e-ring and washers.",
      "description":""
    },
    {
      "headline":"Remove these and keep them in a safe place for now.",
      "description":""
    },
    {
      "headline":"The drum is no longer holding in the back panel of the machine.",
      "description":""
    },
    {
      "headline":"Using a 7mm socket wrench, remove the screws holding in the back panel of the machine.",
      "description":"Take care to support the panel (and the drum) as the screws are removed. A second pair of hands is useful here!"
    },
    {
      "headline":"Taking care to support the drum, move the back panel away from the machine slightly.",
      "description":"Do not move more than a few inches yet!"
    },
    {
      "headline":"Before removing the back panel any more, carefully undo the electrical connector for the heating element.",
      "description":""
    },
    {
      "headline":"Remove the broken belt if not already done.",
      "description":""
    },
    {
      "headline":"Move the back panel away from the drum and put the new belt over the top of the drum (towards the rear) and feed it through between the drum and the back panel and finally around the motor-shaft.",
      "description":""
    },
    {
      "headline":"The motor can pivot and has a spring securing it to the body of the machine.",
      "description":""
    },
    {
      "headline":"NOTE CAREFULLY how the belt needs to pass over the pulley-wheel, then under the motor-shaft!",
      "description":""
    },
    {
      "headline":"The trick to fitting the belt is to hold the belt with your left hand as shown in Step 14 - and with your other hand, push the pulley-wheel anti-clockwise until you can get the belt to loop over it.",
      "description":""
    },
    {
      "headline":"Once this is in place, the hard work is over.",
      "description":"Rotate the drum slowly by hand to make sure the belt is able to travel unhindered. Now is your chance to hoover [vacuum] out the back of the machine! Reconnect the heating element connector."
    },
    {
      "headline":"Re-fit the back cover, taking care to line up the drum with the hole.",
      "description":""
    },
    {
      "headline":"Screw on the back panel.",
      "description":"Replace the washers/e-ring securing the drum. Make sure you put back on everything you removed (such as the belt for the fan)."
    },
    {
      "headline":"Re-fit the top cover.",
      "description":""
    },
    {
      "headline":"You're good to go!",
      "description":""
    }
  ],
  "text":" Safety first! Unplug the machine from the wall-socket and make  sure the machine has been idle long enough so that the heater elements, etc. have cooled. Remove the top cover of the machine by undoing the 2 bolts at the back of the top panel.  You should now be able to see if the belt is broken or not. It should be wrapped around the back of the drum. In this picture, you can see it has snapped and is loose on the drum. Remove the plastic cover at the bottom rear of the machine and take off the black belt going from the red pulley to the white pulley (this turns the fan).  At the back of the machine, undo the 5 or 6 bolts securing the air-flow cover...  ...revealing the drum securing e-ring and washers.  Remove these and keep them in a safe place for now.  The drum is no longer holding in the back panel of the machine.  Using a 7mm socket wrench, remove the screws holding in the back panel of the machine. Take care to support the panel (and the drum) as the screws are removed. A second pair of hands is useful here! Taking care to support the drum, move the back panel away from the machine slightly. Do not move more than a few inches yet! Before removing the back panel any more, carefully undo the electrical connector for the heating element.  Remove the broken belt if not already done.  Move the back panel away from the drum and put the new belt over the top of the drum (towards the rear) and feed it through between the drum and the back panel and finally around the motor-shaft.  The motor can pivot and has a spring securing it to the body of the machine.  NOTE CAREFULLY how the belt needs to pass over the pulley-wheel, then under the motor-shaft!  The trick to fitting the belt is to hold the belt with your left hand as shown in Step 14 - and with your other hand, push the pulley-wheel anti-clockwise until you can get the belt to loop over it.  Once this is in place, the hard work is over. Rotate the drum slowly by hand to make sure the belt is able to travel unhindered. Now is your chance to hoover [vacuum] out the back of the machine! Reconnect the heating element connector. Re-fit the back cover, taking care to line up the drum with the hole.  Screw on the back panel. Replace the washers/e-ring securing the drum. Make sure you put back on everything you removed (such as the belt for the fan). Re-fit the top cover.  You're good to go! ",
  "tyn_model":[
    "belt",
    "drum",
    "heater",
    "fan",
    "air-flow cover",
    "e-ring",
    "washers",
    "7mm socket wrench",
    "electrical connector",
    "vacuum",
    "heating element"
  ],
  "tyn_section":[

  ]
}