{
  "title":"How to Make Pan Fried Turbot",
  "url":"https://www.wikihow.com/Make-Pan-Fried-Turbot",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "steps":[
    {
      "headline":"Shake a little salt and pepper on both sides of the fillets.",
      "description":"Dip the fillets in a bowl of flour and try to shake off any excess flour."
    },
    {
      "headline":"Oil and heat a pan over medium heat and lay the fish fillets in the pan.",
      "description":"Fry each fillet side for 2 minutes, more or less time due to the thickness and size of each one."
    },
    {
      "headline":"Remove the fish from the pan and discard the oil in a bowl.",
      "description":"Use a paper towel and wipe the frying pan."
    },
    {
      "headline":"Add the butter to the heated pan to foam up.",
      "description":"Cook the tomatoes with lemon juice and a dash of salt and pepper for a few seconds. Remove the mixture from the heat. Add the chopped parsley on top and give it a small stir."
    },
    {
      "headline":"Serve the fish fillets on plates.",
      "description":"Scoop a good serving of the tomato mixture and place it on the top of the fish."
    }
  ],
  "text":" Shake a little salt and pepper on both sides of the fillets. Dip the fillets in a bowl of flour and try to shake off any excess flour. Oil and heat a pan over medium heat and lay the fish fillets in the pan. Fry each fillet side for 2 minutes, more or less time due to the thickness and size of each one. Remove the fish from the pan and discard the oil in a bowl. Use a paper towel and wipe the frying pan. Add the butter to the heated pan to foam up. Cook the tomatoes with lemon juice and a dash of salt and pepper for a few seconds. Remove the mixture from the heat. Add the chopped parsley on top and give it a small stir. Serve the fish fillets on plates. Scoop a good serving of the tomato mixture and place it on the top of the fish.",
  "tyn_model":[
    "salt and pepper",
    "bowl",
    "flour",
    "oil",
    "pan",
    "paper towel",
    "frying pan",
    "butter",
    "tomatoes",
    "lemon",
    "parsley",
    "plates",
    "tomato"
  ],
  "tyn_section":[

  ]
}