{
  "title":"How to Bake Corn Muffins",
  "url":"https://www.wikihow.com/Bake-Corn-Muffins",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Muffins"
  ],
  "steps":[
    {
      "headline":"Mix all of the dry ingredients together.",
      "description":""
    },
    {
      "headline":"Crack and add the whole eggs, (how to break an egg) shortening, and half of the of milk to the dry ingredients.",
      "description":"Beat for one minute."
    },
    {
      "headline":"Add the remainder of the ingredients.",
      "description":""
    },
    {
      "headline":"Use a beater to mix until just blended.",
      "description":""
    },
    {
      "headline":"Grease a muffin pan lightly or line with specialty paper cups.",
      "description":""
    },
    {
      "headline":"Fill the molds 3/4 of the way with the mix.",
      "description":""
    },
    {
      "headline":"Bake at 350 degrees F (180 degrees C) for 25-30 minutes.",
      "description":""
    },
    {
      "headline":"Check to see that they have been fully baked.",
      "description":"To do this, insert a toothpick into a muffin to check if it comes out clean. If so, they are done. If not, add a few more minutes."
    },
    {
      "headline":"Eat or serve warm.",
      "description":"Add a slice of butter for a richer taste!"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Mix all of the dry ingredients together.  Crack and add the whole eggs, (how to break an egg) shortening, and half of the of milk to the dry ingredients. Beat for one minute. Add the remainder of the ingredients.  Use a beater to mix until just blended.  Grease a muffin pan lightly or line with specialty paper cups.  Fill the molds 3/4 of the way with the mix.  Bake at 350 degrees F (180 degrees C) for 25-30 minutes.  Check to see that they have been fully baked. To do this, insert a toothpick into a muffin to check if it comes out clean. If so, they are done. If not, add a few more minutes. Eat or serve warm. Add a slice of butter for a richer taste! Finished. ",
  "tyn_model":[
    "eggs",
    "shortening",
    "milk",
    "beater",
    "muffin pan",
    "specialty paper cups",
    "toothpick",
    "muffin",
    "butter"
  ],
  "tyn_section":[

  ]
}