{
  "title":"How to Make a Loofah Basket",
  "url":"https://www.wikihow.com/Make-a-Loofah-Basket",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts"
  ],
  "steps":[
    {
      "headline":"Cut the top off the loofah sponge.",
      "description":""
    },
    {
      "headline":"Upend the loofah sponge and cut down the middle.",
      "description":""
    },
    {
      "headline":"Open the cut loofah sponge right out.",
      "description":""
    },
    {
      "headline":"Take a small round piece of cardboard that is sized to fit at the base of the cut loofah.",
      "description":""
    },
    {
      "headline":"Wrap the loofah sponge around the cardboard circle base.",
      "description":""
    },
    {
      "headline":"Close the loofah sponge.",
      "description":"Holding the end with the cardboard circle, so that the circle does not slip loose, quickly stitch together the two sides of the wrapped loofah."
    },
    {
      "headline":"Cut a handle from a spare loofah sponge piece.",
      "description":""
    },
    {
      "headline":"Hold the handle to the edge of the open top of the loofah sponge.",
      "description":""
    },
    {
      "headline":"Attach the handle by stitching it to each side the loofah sponge basket.",
      "description":""
    },
    {
      "headline":"Decorate the basket.",
      "description":"Glue or stitch on the decoration that you have chosen."
    },
    {
      "headline":"Use it.",
      "description":"Place emery boards, nail scissors etc. in your basket for storage and easy use."
    }
  ],
  "text":" Cut the top off the loofah sponge.  Upend the loofah sponge and cut down the middle.  Open the cut loofah sponge right out.  Take a small round piece of cardboard that is sized to fit at the base of the cut loofah.  Wrap the loofah sponge around the cardboard circle base.  Close the loofah sponge. Holding the end with the cardboard circle, so that the circle does not slip loose, quickly stitch together the two sides of the wrapped loofah. Cut a handle from a spare loofah sponge piece.  Hold the handle to the edge of the open top of the loofah sponge.  Attach the handle by stitching it to each side the loofah sponge basket.  Decorate the basket. Glue or stitch on the decoration that you have chosen. Use it. Place emery boards, nail scissors etc. in your basket for storage and easy use.",
  "tyn_model":[
    "loofah sponge",
    "cardboard",
    "glue",
    "emery boards",
    "nail scissors"
  ],
  "tyn_section":[

  ]
}