{
  "title":"How to Make a Simple Gravy",
  "url":"https://www.wikihow.com/Make-a-Simple-Gravy",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Gravies"
  ],
  "parts":[
    {
      "name":"Mixing in a Bowl",
      "steps":[
        {
          "headline":"Add the water in the mixing bowl.",
          "description":"Set it aside."
        },
        {
          "headline":"Sift the flour in another mixing bowl.",
          "description":""
        },
        {
          "headline":"Put all the flour at the mixing bowl.",
          "description":"Please put one at a time while mixing it thoroughly with a whisk."
        },
        {
          "headline":"Add the salt and pepper.",
          "description":""
        },
        {
          "headline":"Put the soy sauce.",
          "description":"Mix it again."
        },
        {
          "headline":"Add the vinegar.",
          "description":"Again, mix it for 1-2 minutes."
        },
        {
          "headline":"Make sure all the ingredients is evenly distributed, and you're done.",
          "description":"A milk-based gravy can be done by pouring the milk in the mixing bowl (optional)."
        }
      ]
    },
    {
      "name":"In the Pan",
      "steps":[
        {
          "headline":"Heat the pan in a light heat.",
          "description":""
        },
        {
          "headline":"Scoop some butter or margarine and put it in the pan.",
          "description":""
        },
        {
          "headline":"Melt them, and mix it slowly.",
          "description":"Then, add the chicken broth."
        },
        {
          "headline":"Mix it while you letting it simmer.",
          "description":""
        },
        {
          "headline":"Below the boiling point.",
          "description":"Add the mixture then mix it for 3-5 minutes."
        },
        {
          "headline":"Mix it until the mixture and the broth is mixed onto each other.",
          "description":"Then it will become stiff, so mix it thoroughly."
        },
        {
          "headline":"Turn off the heat if the vinegar smell in the gravy disappeared.",
          "description":""
        }
      ]
    },
    {
      "name":"Serving",
      "steps":[
        {
          "headline":"Put it in a small bowl.",
          "description":""
        },
        {
          "headline":"Get your side dishes, especially rice or vegetables.",
          "description":""
        },
        {
          "headline":"Get your delicious fried chicken and put it in the table.",
          "description":""
        },
        {
          "headline":"Call your friends or family to eat with.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Mixing in a Bowl Add the water in the mixing bowl. Set it aside. Sift the flour in another mixing bowl.  Put all the flour at the mixing bowl. Please put one at a time while mixing it thoroughly with a whisk. Add the salt and pepper.  Put the soy sauce. Mix it again. Add the vinegar. Again, mix it for 1-2 minutes. Make sure all the ingredients is evenly distributed, and you're done. A milk-based gravy can be done by pouring the milk in the mixing bowl (optional). In the Pan Heat the pan in a light heat.  Scoop some butter or margarine and put it in the pan.  Melt them, and mix it slowly. Then, add the chicken broth. Mix it while you letting it simmer.  Below the boiling point. Add the mixture then mix it for 3-5 minutes. Mix it until the mixture and the broth is mixed onto each other. Then it will become stiff, so mix it thoroughly. Turn off the heat if the vinegar smell in the gravy disappeared.  Serving Put it in a small bowl.  Get your side dishes, especially rice or vegetables.  Get your delicious fried chicken and put it in the table.  Call your friends or family to eat with.  Finished. ",
  "tyn_model":[
    "mixing bowl",
    "flour",
    "vinegar",
    "pan",
    "water",
    "whisk",
    "salt and pepper",
    "soy sauce",
    "milk",
    "butter",
    "margarine",
    "chicken broth",
    "broth",
    "fried chicken"
  ],
  "tyn_section":[

  ]
}