{
  "title":"How to Make Indian Style Scrambled Eggs",
  "url":"https://www.wikihow.com/Make-Indian-Style-Scrambled-Eggs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Scrambled Eggs"
  ],
  "steps":[
    {
      "headline":"Add 3 to 4 tablespoons of oil in a wok.",
      "description":"Heat over a low flame."
    },
    {
      "headline":"Add a teaspoon of crushed garlic.",
      "description":"Fry the garlic till it becomes golden brown."
    },
    {
      "headline":"Add some finely chopped onion.",
      "description":""
    },
    {
      "headline":"Keep stirring the garlic and onion till the raw smell of the onion is gone.",
      "description":"This will take from one to four minutes."
    },
    {
      "headline":"Put in the eggs, turmeric and salt.",
      "description":"Dash in some pepper or chili for that spicy Indian touch."
    },
    {
      "headline":"Keeping flame or heat on low, continuously stir the ingredients for about 5 to 10 minutes.",
      "description":"The eggs might burn at the bottom. To prevent this from happening, keep stirring."
    },
    {
      "headline":"Remove from the heat.",
      "description":"Once the scrambled eggs have cooked completely, the scramble will be mostly dry. At this point, switch off the flame."
    },
    {
      "headline":"Add some chopped cilantro to the Indian style scrambled eggs.",
      "description":"Serve and enjoy!"
    }
  ],
  "text":" Add 3 to 4 tablespoons of oil in a wok. Heat over a low flame. Add a teaspoon of crushed garlic. Fry the garlic till it becomes golden brown. Add some finely chopped onion.  Keep stirring the garlic and onion till the raw smell of the onion is gone. This will take from one to four minutes. Put in the eggs, turmeric and salt. Dash in some pepper or chili for that spicy Indian touch. Keeping flame or heat on low, continuously stir the ingredients for about 5 to 10 minutes. The eggs might burn at the bottom. To prevent this from happening, keep stirring. Remove from the heat. Once the scrambled eggs have cooked completely, the scramble will be mostly dry. At this point, switch off the flame. Add some chopped cilantro to the Indian style scrambled eggs. Serve and enjoy!",
  "tyn_model":[
    "eggs",
    "garlic",
    "oil",
    "wok",
    "crushed garlic",
    "onion",
    "turmeric",
    "salt",
    "pepper",
    "cilantro",
    "scrambled eggs"
  ],
  "tyn_section":[

  ]
}