{
  "title":"How to Cook Yellow Rice",
  "url":"https://www.wikihow.com/Cook-Yellow-Rice",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Rice and Beans"
  ],
  "methods":[
    {
      "name":"Spanish Yellow Rice",
      "steps":[
        {
          "headline":"Sauté the shallot.",
          "description":"Melt the butter or margarine in a large, deep skillet, then add the finely diced shallot and garlic and Sauté for approximately five minutes at medium heat. Continue cooking them until they start to brown."
        },
        {
          "headline":"Add the long grain rice, turmeric powder, and salt and stir well.",
          "description":""
        },
        {
          "headline":"Add the stock and bring the contents of the skillet to boil.",
          "description":""
        },
        {
          "headline":"Simmer the rice.",
          "description":"Reduce the heat to medium-low, or low enough so that the contents will simmer without boiling over, then cover the skillet with a lid. Allow the contents to simmer under the closed lid for 15 minutes, or until the liquid is absorbed by the rice and the rice is tender. Check the rice to determine if it is finished cooking. If you still see liquid, it needs more time. Take care not to scorch the rice. Keep the heat low so it won't burn."
        },
        {
          "headline":"Finish the rice.",
          "description":"Stir in the frozen peas and top it with cilantro. Serve alongside meat and vegetable dishes."
        }
      ]
    },
    {
      "name":"Indonesian Yellow Rice",
      "steps":[
        {
          "headline":"Mix the turmeric with water.",
          "description":"This helps to distribute it throughout the rice as before cooking. You can skip this step if you want to cook the dish as quickly as possible."
        },
        {
          "headline":"Add all the ingredients to a large pot.",
          "description":"Place the rice, coconut milk, spices, lemongrass and leaves in the pot. Use a large spoon to stir the ingredients until they are mixed well. Cover the pot."
        },
        {
          "headline":"Cook the rice.",
          "description":"Place the pot on the stove over medium high heat. Bring the contents to a boil, then reduce to a simmer. Continue simmering until the rice has absorbed the water. Check the rice while it's cooking to make sure it doesn't burn. If it looks like it's getting dried out, add a little water. You can also moisten the rice by adding extra coconut milk."
        },
        {
          "headline":"Finish the rice.",
          "description":"Remove it from heat and extract the lemongrass and leaves from the pot. Fluff the rice and spoon it onto a platter, or mold it into the classic cone shape. Serve immediately."
        }
      ]
    },
    {
      "name":"Indian Yellow Rice",
      "steps":[
        {
          "headline":"Add all of the ingredients to a large pot.",
          "description":"Place the rice, water, and spices together in a pot. Use a spoon to stir the ingredients together well. Cover the pot."
        },
        {
          "headline":"Cook the rice.",
          "description":"Place the pot over medium high heat. Bring the contents to a boil, then reduce to a simmer. Continue cooking the rice until it has absorbed the water. Check the rice to make sure it doesn't get too dry. Add more water if it looks like it's beginning to dry out. For extra flavor, you can add a little vegetable or chicken stock instead of water."
        },
        {
          "headline":"Finish the rice.",
          "description":"Remove it from heat and use a few forks to fluff it up. Transfer it to a serving dish and serve with lamb, beef, chicken or a vegetarian dish."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Spanish Yellow Rice Sauté the shallot. Melt the butter or margarine in a large, deep skillet, then add the finely diced shallot and garlic and Sauté for approximately five minutes at medium heat. Continue cooking them until they start to brown. Add the long grain rice, turmeric powder, and salt and stir well.  Add the stock and bring the contents of the skillet to boil.  Simmer the rice. Reduce the heat to medium-low, or low enough so that the contents will simmer without boiling over, then cover the skillet with a lid. Allow the contents to simmer under the closed lid for 15 minutes, or until the liquid is absorbed by the rice and the rice is tender. Check the rice to determine if it is finished cooking. If you still see liquid, it needs more time. Take care not to scorch the rice. Keep the heat low so it won't burn. Finish the rice. Stir in the frozen peas and top it with cilantro. Serve alongside meat and vegetable dishes. Indonesian Yellow Rice Mix the turmeric with water. This helps to distribute it throughout the rice as before cooking. You can skip this step if you want to cook the dish as quickly as possible. Add all the ingredients to a large pot. Place the rice, coconut milk, spices, lemongrass and leaves in the pot. Use a large spoon to stir the ingredients until they are mixed well. Cover the pot. Cook the rice. Place the pot on the stove over medium high heat. Bring the contents to a boil, then reduce to a simmer. Continue simmering until the rice has absorbed the water. Check the rice while it's cooking to make sure it doesn't burn. If it looks like it's getting dried out, add a little water. You can also moisten the rice by adding extra coconut milk. Finish the rice. Remove it from heat and extract the lemongrass and leaves from the pot. Fluff the rice and spoon it onto a platter, or mold it into the classic cone shape. Serve immediately. Indian Yellow Rice Add all of the ingredients to a large pot. Place the rice, water, and spices together in a pot. Use a spoon to stir the ingredients together well. Cover the pot. Cook the rice. Place the pot over medium high heat. Bring the contents to a boil, then reduce to a simmer. Continue cooking the rice until it has absorbed the water. Check the rice to make sure it doesn't get too dry. Add more water if it looks like it's beginning to dry out. For extra flavor, you can add a little vegetable or chicken stock instead of water. Finish the rice. Remove it from heat and use a few forks to fluff it up. Transfer it to a serving dish and serve with lamb, beef, chicken or a vegetarian dish. Finished. ",
  "tyn_model":[
    "rice",
    "water",
    "pot",
    "skillet",
    "large pot",
    "coconut milk",
    "spices",
    "lemongrass",
    "yellow rice",
    "butter",
    "margarine",
    "shallot",
    "garlic",
    "sauté",
    "long grain rice",
    "turmeric powder",
    "salt",
    "stock",
    "frozen peas",
    "cilantro",
    "turmeric",
    "large spoon",
    "stove",
    "spoon",
    "vegetable or chicken stock",
    "forks",
    "serving dish"
  ],
  "tyn_section":[

  ]
}