{
  "title":"How to Make Nutmeg Ice Cream",
  "url":"https://www.wikihow.com/Make-Nutmeg-Ice-Cream",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts"
  ],
  "methods":[
    {
      "name":"Using an Ice Cream Maker",
      "steps":[
        {
          "headline":"Toast the nutmeg.",
          "description":"Place the grated nutmeg into a frying pan or skillet. Warm over medium heat for 1-2 minutes to toast. Immediately remove the pan from heat and set aside."
        },
        {
          "headline":"Heat the half-and-half with the cracked nutmeg in the saucepan.",
          "description":"Heat gently, until it starts to simmer. Just as it simmers, take the saucepan off the heat and set aside to cool. Allow the nutmeg to infuse through the half-and-half for 10 minutes."
        },
        {
          "headline":"Whisk the sugar and egg yolks together in a mixing bowl.",
          "description":"Gradually pour in the cooled half-and-half mixture while continuing to whisk the mixture."
        },
        {
          "headline":"Pour the whisked mixture back into the saucepan.",
          "description":"Cook over a gently heat while stirring continuously until the mixture thickens. This will take about 8-10 minutes."
        },
        {
          "headline":"Remove from the heat.",
          "description":"Pour the mixture through the strainer and back into the mixing bowl. Add the toasted nutmeg and cream and whisk through well."
        },
        {
          "headline":"Cover the mixture.",
          "description":"Place in the refrigerator to chill for about 10-15 minutes."
        },
        {
          "headline":"Once chilled, pour into an ice cream maker and follow the directions of the manufacturer.",
          "description":"When made, either serve or store in an airtight container and store in the freezer. See Version 2 below for the manual ice cream making method."
        },
        {
          "headline":"Serve.",
          "description":"This ice cream is great with spicy desserts and puddings. It's also lovely on its own."
        }
      ]
    },
    {
      "name":"Making it Manually",
      "steps":[
        {
          "headline":"Pour the double cream and the full cream milk into the saucepan.",
          "description":"Turn on the heat and heat until just boiling. Remove from the heat and let cool."
        },
        {
          "headline":"Whisk the egg yolks and sugar together.",
          "description":"Pour in the cooled cream and milk mixture gradually, whisking continuously as you pour."
        },
        {
          "headline":"Wash the saucepan for reuse.",
          "description":"Then pour the entire mixture back into the saucepan and reheat gently. Continue stirring as it heats. After about 8-10 minutes, the mixture will begin to thicken."
        },
        {
          "headline":"Add the ice cream mixture to an ice cream maker.",
          "description":"Follow the manufacturer's instructions. Alternatively, pour into a freezer-proof baking dish lined with greaseproof or parchment paper. Freeze for 1.5 hours; when the edges appear frozen, stir the slightly frozen mixture up, then freeze again for another 1.5 hours. Repeat twice, or until the ice cream is thick and smooth enough to be enjoyed as ice cream."
        },
        {
          "headline":"Serve.",
          "description":"Serve with spicy puddings, hot desserts and with milkshakes where nutmeg will complement the flavor deliciously."
        }
      ]
    }
  ],
  "text":" Using an Ice Cream Maker Toast the nutmeg. Place the grated nutmeg into a frying pan or skillet. Warm over medium heat for 1-2 minutes to toast. Immediately remove the pan from heat and set aside. Heat the half-and-half with the cracked nutmeg in the saucepan. Heat gently, until it starts to simmer. Just as it simmers, take the saucepan off the heat and set aside to cool. Allow the nutmeg to infuse through the half-and-half for 10 minutes. Whisk the sugar and egg yolks together in a mixing bowl. Gradually pour in the cooled half-and-half mixture while continuing to whisk the mixture. Pour the whisked mixture back into the saucepan. Cook over a gently heat while stirring continuously until the mixture thickens. This will take about 8-10 minutes. Remove from the heat. Pour the mixture through the strainer and back into the mixing bowl. Add the toasted nutmeg and cream and whisk through well. Cover the mixture. Place in the refrigerator to chill for about 10-15 minutes. Once chilled, pour into an ice cream maker and follow the directions of the manufacturer. When made, either serve or store in an airtight container and store in the freezer. See Version 2 below for the manual ice cream making method. Serve. This ice cream is great with spicy desserts and puddings. It's also lovely on its own. Making it Manually Pour the double cream and the full cream milk into the saucepan. Turn on the heat and heat until just boiling. Remove from the heat and let cool. Whisk the egg yolks and sugar together. Pour in the cooled cream and milk mixture gradually, whisking continuously as you pour. Wash the saucepan for reuse. Then pour the entire mixture back into the saucepan and reheat gently. Continue stirring as it heats. After about 8-10 minutes, the mixture will begin to thicken. Add the ice cream mixture to an ice cream maker. Follow the manufacturer's instructions. Alternatively, pour into a freezer-proof baking dish lined with greaseproof or parchment paper. Freeze for 1.5 hours; when the edges appear frozen, stir the slightly frozen mixture up, then freeze again for another 1.5 hours. Repeat twice, or until the ice cream is thick and smooth enough to be enjoyed as ice cream. Serve. Serve with spicy puddings, hot desserts and with milkshakes where nutmeg will complement the flavor deliciously.",
  "tyn_model":[
    "saucepan",
    "ice cream",
    "ice cream maker",
    "nutmeg",
    "sugar",
    "egg yolks",
    "mixing bowl",
    "cream",
    "frying pan",
    "skillet",
    "half-and-half",
    "strainer",
    "refrigerator",
    "double cream",
    "full cream milk",
    "milk",
    "freezer-proof baking dish",
    "parchment paper"
  ],
  "tyn_section":[

  ]
}