{
  "title":"How to Enter the Get to Know Contest (Canadians)",
  "url":"https://www.wikihow.com/Enter-the-Get-to-Know-Contest-(Canadians)",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography"
  ],
  "steps":[
    {
      "headline":"Go to the Get-to-Know website home page: http://www.get-to-know.org/",
      "description":""
    },
    {
      "headline":"Click the Contest button at the top of the page.",
      "description":"This page also lists the prizes and how to participate. On the left side of the page it says \"Easy steps to Enter\". Click 'Get Outdoors' to begin."
    },
    {
      "headline":"Click \"Next Step\".",
      "description":"That will take you to the \"How to Enter\" page."
    },
    {
      "headline":"Review the rules and read the prizes.",
      "description":""
    },
    {
      "headline":"Click \"Next Step\" when you are done reading.",
      "description":"This takes you to the \"Enter Now\" page. Again, you can read the rules and regulations here."
    },
    {
      "headline":"Click the category you would like to enter.",
      "description":"This option will not appear when the contest is not running. If you are American and would like to enter, make sure you click USA under \"country\" on the far left side before entering."
    },
    {
      "headline":"Download your photos (for photography, videos, music or art), or write your poem.",
      "description":"Make sure to go out into nature for your inspirations!"
    },
    {
      "headline":"Fill in your information.",
      "description":"Note that the paragraph questions on the bottom are optional."
    },
    {
      "headline":"Click the \"Submit\" button.",
      "description":"You will be asked if you would like to complete another submission or view the gallery."
    }
  ],
  "text":" Go to the Get-to-Know website home page: http://www.get-to-know.org/  Click the Contest button at the top of the page. This page also lists the prizes and how to participate. On the left side of the page it says \"Easy steps to Enter\". Click 'Get Outdoors' to begin. Click \"Next Step\". That will take you to the \"How to Enter\" page. Review the rules and read the prizes.  Click \"Next Step\" when you are done reading. This takes you to the \"Enter Now\" page. Again, you can read the rules and regulations here. Click the category you would like to enter. This option will not appear when the contest is not running. If you are American and would like to enter, make sure you click USA under \"country\" on the far left side before entering. Download your photos (for photography, videos, music or art), or write your poem. Make sure to go out into nature for your inspirations! Fill in your information. Note that the paragraph questions on the bottom are optional. Click the \"Submit\" button. You will be asked if you would like to complete another submission or view the gallery.",
  "tyn_model":[
    "poem"
  ],
  "tyn_section":[

  ]
}