{
  "title":"How to Make a Decorative Wooden Serviette Ring",
  "url":"https://www.wikihow.com/Make-a-Decorative-Wooden-Serviette-Ring",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping"
  ],
  "parts":[
    {
      "name":"Designing the serviette ring",
      "steps":[
        {
          "headline":"Choose a wooden or plastic decoration.",
          "description":"This is the part that will match the décor, so choose with care. It also needs to have at least one flat area at the back that can be attached to the serviette ring. Wooden cutouts and flat plastic pieces are usually the best choices, and many can be sourced from craft or dollar stores. Ideas to match a décor include:\nStars, moons and the sun for a party\nA Christmas tree, Santa face or reindeer for a Christmas theme\nFruit or cornucopia for harvest festivals\nFlags, national icons for patriotic events\nAnimals, toys or cartoon characters for a kid's party or the kids' end of the table\nBirthday symbols for a birthday party\nNumbers for anniversaries and special birthdays, etc."
        },
        {
          "headline":"Place the decorative element up against the ring.",
          "description":"Check that it fits, looks good and will match the theme you're trying to develop."
        },
        {
          "headline":"Prepare the decorative elements if needed.",
          "description":"Remove labels, stickers, etc. and any elements that won't add to the decorative effect. If they need cleaning, clean them."
        }
      ]
    },
    {
      "name":"Making the serviette ring",
      "steps":[
        {
          "headline":"Spray paint the entire serviette ring and the decoration.",
          "description":"Allow to dry. Repeat for as many serviette rings as you're making."
        },
        {
          "headline":"Place a blob of glue onto the ring and the back of the decoration.",
          "description":"Gently press the decoration to the ring, in the right place. Hold for a few seconds. Let dry completely. Repeat for as many serviette rings as you're making."
        },
        {
          "headline":"Slip the serviettes through the rings.",
          "description":"Make sure that the rings are completely dry before doing this. They're now ready to grace the table."
        }
      ]
    }
  ],
  "text":" Designing the serviette ring Choose a wooden or plastic decoration. This is the part that will match the décor, so choose with care. It also needs to have at least one flat area at the back that can be attached to the serviette ring. Wooden cutouts and flat plastic pieces are usually the best choices, and many can be sourced from craft or dollar stores. Ideas to match a décor include:\nStars, moons and the sun for a party\nA Christmas tree, Santa face or reindeer for a Christmas theme\nFruit or cornucopia for harvest festivals\nFlags, national icons for patriotic events\nAnimals, toys or cartoon characters for a kid's party or the kids' end of the table\nBirthday symbols for a birthday party\nNumbers for anniversaries and special birthdays, etc. Place the decorative element up against the ring. Check that it fits, looks good and will match the theme you're trying to develop. Prepare the decorative elements if needed. Remove labels, stickers, etc. and any elements that won't add to the decorative effect. If they need cleaning, clean them. Making the serviette ring Spray paint the entire serviette ring and the decoration. Allow to dry. Repeat for as many serviette rings as you're making. Place a blob of glue onto the ring and the back of the decoration. Gently press the decoration to the ring, in the right place. Hold for a few seconds. Let dry completely. Repeat for as many serviette rings as you're making. Slip the serviettes through the rings. Make sure that the rings are completely dry before doing this. They're now ready to grace the table.",
  "tyn_model":[
    "serviette ring",
    "reindeer",
    "numbers",
    "labels",
    "stickers",
    "paint",
    "glue",
    "serviettes"
  ],
  "tyn_section":[

  ]
}