{
  "title":"How to Evolve a Newtgat Into a Salamango on Viva Piñata",
  "url":"https://www.wikihow.com/Evolve-a-Newtgat-Into-a-Salamango-on-Viva-Pi%C3%B1ata",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Viva Pinata"
  ],
  "steps":[
    {
      "headline":"Attract a Newtgat to your garden.",
      "description":"You will have to have 30 pinometers of water. You can make more water by using the shovel. If you don't know how much water you have, check the journal in the garden area section. Now go to Costolot's store and buy 3 watercress seeds for 13 chocolate coins each. Plant them near water. Once the Newtgat comes into your garden, it will eat some of the watercress. It won't eat them all at once, but it will come back and eat the rest later. Once it eats all 3 of the watercress it will become a resident! If you have already had a Newtgat as a resident before, you can buy another one from Gretchen Fetchem."
    },
    {
      "headline":"Buy a chili seed or a chili pepper from Costolot's Store.",
      "description":"The peppers cost 400 chocolate coins each. To grow your own peppers, each seed costs 22 chocolate coins."
    },
    {
      "headline":"Once you have bought or grown your chili, move your Newtgat to eat the Chilli.",
      "description":"Select your Newtgat by moving your cursor over it and pressing A. Now find your pepper. Move your cursor over it and press A. You may have to do this 2 or 3 times if it doesn't work the first time."
    },
    {
      "headline":"After the Newtgat has eaten the chili, you will see a flash of light and it will change into a Salamango.",
      "description":"You will unlock an award for this."
    },
    {
      "headline":"To unlock another award, make another Salamango using the same method (or buy one from Gretchen Fetchem).",
      "description":"Complete the romance requirements for both salamangos. You can find the romance requirements in the journal. When both have the pink hearts above them, you can romance them by directing them to each other. Once you complete the minigame, you will get an award for romancing salamangos and you will get another Salamango which you can sell to Costolot's store for 2100 chocolate coins."
    }
  ],
  "text":" Attract a Newtgat to your garden. You will have to have 30 pinometers of water. You can make more water by using the shovel. If you don't know how much water you have, check the journal in the garden area section. Now go to Costolot's store and buy 3 watercress seeds for 13 chocolate coins each. Plant them near water. Once the Newtgat comes into your garden, it will eat some of the watercress. It won't eat them all at once, but it will come back and eat the rest later. Once it eats all 3 of the watercress it will become a resident! If you have already had a Newtgat as a resident before, you can buy another one from Gretchen Fetchem. Buy a chili seed or a chili pepper from Costolot's Store. The peppers cost 400 chocolate coins each. To grow your own peppers, each seed costs 22 chocolate coins. Once you have bought or grown your chili, move your Newtgat to eat the Chilli. Select your Newtgat by moving your cursor over it and pressing A. Now find your pepper. Move your cursor over it and press A. You may have to do this 2 or 3 times if it doesn't work the first time. After the Newtgat has eaten the chili, you will see a flash of light and it will change into a Salamango. You will unlock an award for this. To unlock another award, make another Salamango using the same method (or buy one from Gretchen Fetchem). Complete the romance requirements for both salamangos. You can find the romance requirements in the journal. When both have the pink hearts above them, you can romance them by directing them to each other. Once you complete the minigame, you will get an award for romancing salamangos and you will get another Salamango which you can sell to Costolot's store for 2100 chocolate coins.",
  "tyn_model":[
    "water",
    "watercress",
    "salamango",
    "peppers",
    "chili",
    "shovel",
    "chili seed",
    "chili pepper",
    "chilli",
    "pepper",
    "salamangos",
    "chocolate coins"
  ],
  "tyn_section":[

  ]
}