{
  "title":"How to Grill Vegetables",
  "url":"https://www.wikihow.com/Grill-Vegetables",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "parts":[
    {
      "name":"Setting Up the Grill",
      "steps":[
        {
          "headline":"Get the grill hot.",
          "description":"If you have a gas grill, preheat on medium for at least 10 minutes. If you are using a charcoal grill, wait until the charcoal is good and gray."
        },
        {
          "headline":"Clean the grill.",
          "description":"Once it is hot, this will be easy to do. Grab your grill brush and get each nook and cranny of the grate. Then, dab a paper towel in oil and wipe it down to prevent sticking. You'll be glad you did this later when half of your vegetables don't end seared to the grate. Even though your vegetables have oil on them (they will, right?) you need this coating on your grill. Don't skip this step."
        }
      ]
    },
    {
      "name":"Preparing the Vegetables",
      "steps":[
        {
          "headline":"Boil certain vegetables.",
          "description":"Dense root vegetables like potatoes, carrots, and beets take this extra step. They need to be precooked to let the grilling take effect. Boil them until they're partially cooked (only just starting to get tender) and proceed as normal. You don't have to boil them whole! Even if they are in smaller pieces, they need the extra cooking time."
        },
        {
          "headline":"Wash the veggies and pat them dry.",
          "description":"Though raw vegetables are delicious and great for you, they still need to be clean! Run them under cold water and pat dry with a paper towel."
        },
        {
          "headline":"Slice up certain kinds.",
          "description":"Asparagus, big Portobello mushrooms and corn on the cob don't need to be cut up, but onions, zucchini, and pepper are grilled best when sliced. The root vegetables discussed above should be sliced up, too."
        },
        {
          "headline":"Oil them up.",
          "description":"This way, they will not stick to the grill, you will get those restaurant-like grill marks, and they will be delicious. You don't want the oil soaking the vegetables and dripping off in a stream, but you do want them coated evenly. If a marinade is more your style, see below."
        },
        {
          "headline":"Alternately, use a marinade of lemon juice and olive oil.",
          "description":"Combine equal parts olive oil and lemon juice. Add fresh herbs like thyme, basil, chives, or rosemary. If you are a garlic fan, a couple cloves will add a good kick. Pour the marinade over the vegetables. Toss the vegetables to coat them and allow them to soak up the flavor for about an hour. Place these on the grill in a basket or tin foil packet. They are probably sliced into smaller pieces if they are marinated, so keep them above the flames. Depending on the vegetables you used, this could take just a few minutes. Make a taste test if you are unsure -- your tongue will know when they are done."
        }
      ]
    },
    {
      "name":"Grilling the Vegetables",
      "steps":[
        {
          "headline":"Consider the size of each vegetable when placing on the grill.",
          "description":"You will need different apparatuses for the varying sizes. Large pieces can be placed directly on, but if they're too small they'll fall through the grate! Buy a grilling basket for sliced up onion, pepper, mushrooms, etc. If you do not have time, use tin foil and wrap up in a covered, rectangular shape that opens on top. Another alternative is to use skewers, though those sometimes can be precarious. If using a foil packet, throw in some butter, oil, and seasonings. If using skewers, use metal ones. Wood and bamboo should be soaked in water for half an hour earlier to prevent charring."
        },
        {
          "headline":"Start grilling!",
          "description":"You will want to keep an eye on the vegetables as certain ones take longer than others do. Namely eggplant and onion, even if they're cut up. Asparagus, mushrooms, peppers and zucchini all cook fast. Cooking times vary by size, weight, density, and just how done you like your greens."
        },
        {
          "headline":"Monitor for doneness.",
          "description":"Once the vegetables are all on, keep an eye on them. Your peppers may finish twice as fast as your eggplant, so stay on the watch. If they're going too fast, move them to the edges of the grill where it's not as hot. Take off the vegetables as they finish and either put them above the grill (if applicable) or keep them warm on a separate rack or board."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Setting Up the Grill Get the grill hot. If you have a gas grill, preheat on medium for at least 10 minutes. If you are using a charcoal grill, wait until the charcoal is good and gray. Clean the grill. Once it is hot, this will be easy to do. Grab your grill brush and get each nook and cranny of the grate. Then, dab a paper towel in oil and wipe it down to prevent sticking. You'll be glad you did this later when half of your vegetables don't end seared to the grate. Even though your vegetables have oil on them (they will, right?) you need this coating on your grill. Don't skip this step. Preparing the Vegetables Boil certain vegetables. Dense root vegetables like potatoes, carrots, and beets take this extra step. They need to be precooked to let the grilling take effect. Boil them until they're partially cooked (only just starting to get tender) and proceed as normal. You don't have to boil them whole! Even if they are in smaller pieces, they need the extra cooking time. Wash the veggies and pat them dry. Though raw vegetables are delicious and great for you, they still need to be clean! Run them under cold water and pat dry with a paper towel. Slice up certain kinds. Asparagus, big Portobello mushrooms and corn on the cob don't need to be cut up, but onions, zucchini, and pepper are grilled best when sliced. The root vegetables discussed above should be sliced up, too. Oil them up. This way, they will not stick to the grill, you will get those restaurant-like grill marks, and they will be delicious. You don't want the oil soaking the vegetables and dripping off in a stream, but you do want them coated evenly. If a marinade is more your style, see below. Alternately, use a marinade of lemon juice and olive oil. Combine equal parts olive oil and lemon juice. Add fresh herbs like thyme, basil, chives, or rosemary. If you are a garlic fan, a couple cloves will add a good kick. Pour the marinade over the vegetables. Toss the vegetables to coat them and allow them to soak up the flavor for about an hour. Place these on the grill in a basket or tin foil packet. They are probably sliced into smaller pieces if they are marinated, so keep them above the flames. Depending on the vegetables you used, this could take just a few minutes. Make a taste test if you are unsure -- your tongue will know when they are done. Grilling the Vegetables Consider the size of each vegetable when placing on the grill. You will need different apparatuses for the varying sizes. Large pieces can be placed directly on, but if they're too small they'll fall through the grate! Buy a grilling basket for sliced up onion, pepper, mushrooms, etc. If you do not have time, use tin foil and wrap up in a covered, rectangular shape that opens on top. Another alternative is to use skewers, though those sometimes can be precarious. If using a foil packet, throw in some butter, oil, and seasonings. If using skewers, use metal ones. Wood and bamboo should be soaked in water for half an hour earlier to prevent charring. Start grilling! You will want to keep an eye on the vegetables as certain ones take longer than others do. Namely eggplant and onion, even if they're cut up. Asparagus, mushrooms, peppers and zucchini all cook fast. Cooking times vary by size, weight, density, and just how done you like your greens. Monitor for doneness. Once the vegetables are all on, keep an eye on them. Your peppers may finish twice as fast as your eggplant, so stay on the watch. If they're going too fast, move them to the edges of the grill where it's not as hot. Take off the vegetables as they finish and either put them above the grill (if applicable) or keep them warm on a separate rack or board. Finished. ",
  "tyn_model":[
    "grill",
    "vegetables",
    "oil",
    "water",
    "asparagus",
    "zucchini",
    "pepper",
    "lemon juice",
    "olive oil",
    "tin foil",
    "mushrooms",
    "skewers",
    "eggplant",
    "peppers",
    "gas grill",
    "charcoal grill",
    "charcoal",
    "grill brush",
    "paper towel",
    "potatoes",
    "carrots",
    "veggies",
    "onions",
    "root vegetables",
    "basil",
    "chives",
    "rosemary",
    "garlic",
    "grilling basket",
    "foil",
    "butter",
    "seasonings",
    "bamboo",
    "onion"
  ],
  "tyn_section":[

  ]
}