{
  "title":"How to Use an Oven",
  "url":"https://www.wikihow.com/Use-an-Oven",
  "category_hierarchy":[
    "Home and Garden",
    "Home Appliances"
  ],
  "methods":[
    {
      "name":"Using a Gas Oven",
      "steps":[
        {
          "headline":"Figure out the basics of your oven.",
          "description":"Before you start attempting to use your gas oven, or any oven, read over any instruction manuals you have. This will inform you of the basics of how to turn the oven on and off as well how to move the racks and other aspects of how your oven works. Every oven comes with racks. Before using your oven, experiment with taking them in and out of the oven. Depending on what you're cooking, you may have to adjust the oven racks. It's a good idea to get a sense of how to do so. Figure out how to turn the oven on and set the temperature. Usually, you have to turn a knob near the front of the oven to do so. You can then turn the knob to the appropriate heat setting. Some ovens give off a signal, such as light going on and off or a noise being made, indicating when the oven is adequately heated."
        },
        {
          "headline":"Use an oven thermometer.",
          "description":"Gas ovens tend to fluctuate in temperature. Even if you set the oven for a specific temperature, the heat may rise or fall unexpectedly during the cooking process. Therefore, use an oven thermometer to measure temperature. You may need to turn the heat slightly up or slightly down during the cooking process. Use the oven light to monitor the oven's temperature. Opening the oven too often during the cooking process can cause the temperature to drop suddenly."
        },
        {
          "headline":"Rotate your trays while cooking.",
          "description":"Heat tends to fluctuate in a gas oven. Some spots will become hotter or colder during the cooking process. Therefore, it can help to occasionally open the oven and rotate your baking trays a few degrees to ensure things cook evenly. Cakes, breads, and muffin trays should be rotated 90 degrees halfway through cooking. If you're using more than one rack to bake something like cookies, switch the top and bottom trays as well. Casserole dishes should be rotated slightly multiple times during the cooking process."
        },
        {
          "headline":"Place a baking stone on your oven's floor.",
          "description":"A baking stone can be used to cook things like baked goods and pizzas. However, it can also help regulate temperature in a gas oven. It can help radiate temperature upward in a more even fashion. Place it on the bottom of your oven or on the lowest rack when you're not using it. Then, place whatever you're cooking just above the baking stone to help it cook more evenly."
        },
        {
          "headline":"Move items higher up for browner tops.",
          "description":"It can sometimes be hard to get things like pies to brown on the top in a gas oven. It can help to move dishes you need to brown to the top tray. This will allow them to brown faster."
        },
        {
          "headline":"Turn up the temperature for added crispiness.",
          "description":"Gas ovens tend to be more humid, which can affect crispiness. Things like roasted potatoes may not get crisp as easily in a gas oven. It can help to turn the oven temperature up about 25 degrees hotter than the recipe calls for. This will result in a crispier final product."
        },
        {
          "headline":"Do not use dark metal cookware.",
          "description":"You should never use dark metals in a gas oven. In a gas oven, heat comes from the bottom of the oven. Dark metal cookware will absorb heat faster, which can result in the bottoms of dishes become brown or burnt. Instead of dark metal cookware, opt for light-colored metal, glass, or silicone."
        }
      ]
    },
    {
      "name":"Using an Electric Oven",
      "steps":[
        {
          "headline":"Familiarize yourself with the basics.",
          "description":"Make sure you read your oven's manual for the basics of using an electric oven. This should show you how to turn the oven on and off and how to do things like move the racks up and down in the oven. Make sure you know how to set the temperature. Electronic ovens usually allow you to punch in the temperature electronically and will then give an indication when the oven is ready. A light on your oven may go on or off or it may make a noise to indicate it's heated."
        },
        {
          "headline":"Give your oven extra time to preheat.",
          "description":"Start preheating your oven while you begin preparing foods and baked goods if you're using an electronic oven. Gas ovens tend to heat quickly, but electric ovens need more time to reach the proper temperature. You should use an oven thermometer to make sure your electric oven is at the right temperature."
        },
        {
          "headline":"Bake items in the middle oven rack.",
          "description":"Unless a recipe specifies an item should be placed on the upper or lower oven rack, always use the middle rack with an electric oven. This is the spot where the heat will be least likely to fluctuate during the cooking process. This will make your food cook more evenly throughout."
        },
        {
          "headline":"Add steam when necessary.",
          "description":"Electric ovens tend to be fairly dry. Oftentimes, this can delay bread and other similar foods from rising. If you're struggling to make something like a pizza crust or loaf of bread rise, try adding a little steam to your electronic oven. You can pour a cup of hot water into a pan and then set it at the bottom of the oven. You can also open the oven a crack and use a spray bottle to spritz some water into the oven."
        },
        {
          "headline":"Select the right bakeware for what you're cooking.",
          "description":"You can use a diverse range of bakeware in an electric oven. However, different bakeware will yield different results. Make sure to use the right bakeware for what you're cooking. If you want browning around the sides and bottoms of your foods, go for metal bakeware. If you want to decrease browning, go for glass or silicone products."
        }
      ]
    },
    {
      "name":"Cleaning Your Oven",
      "steps":[
        {
          "headline":"Take advantage of the self cleaning option.",
          "description":"If your oven has a self cleaning option, that's usually the best way to get the job done. Your oven's instruction manual should indicate how to use the self cleaning option. Usually, the oven will lock and self clean for about two hours. After the oven finishes self cleaning, you simply wipe off any debris with a paper towel."
        },
        {
          "headline":"Remove and clean your oven racks.",
          "description":"If your oven does not have a self cleaning option, you will need to clean it manually. To start, remove the oven racks and clean them. Lay a towel down on the bottom of your bathtub and fill the tub with hot water. Add half a cup of powder dishwasher detergent and swish it around into the water. Let the racks soak for about four hours. Then, wipe off any gunk and stains with a non-abrasive scrub brush. Rinse the racks completely and then allow them to air dry."
        },
        {
          "headline":"Coat your oven in baking soda and water.",
          "description":"Mix baking soda and water until you form a workable paste. Then, use a cloth or sponge to coat the inside of your oven with your paste. Make sure to get the sides, bottom, and top of your oven."
        },
        {
          "headline":"Add vinegar and scrub off the baking soda.",
          "description":"Pour vinegar over the baking soda and water mixture. Allow the vinegar to sit on until it begins to fizzle lightly. This should happen fairly quickly. This helps loosen dirt and debris, allowing you to easily clean your oven. Once the vinegar is fizzling, use a sponge to scrub down the top, bottom, and sides of an oven. Scrub until you remove all loose dirt and debris. When you're done, use a paper towel to remove any lingering baking soda, water, and loose dirt and bits of food."
        },
        {
          "headline":"Place the oven racks back in the oven.",
          "description":"After you've cleaned out the interior of the oven, place your oven racks back in place. Your oven should now be clean and ready to use."
        }
      ]
    }
  ],
  "text":" Using a Gas Oven Figure out the basics of your oven. Before you start attempting to use your gas oven, or any oven, read over any instruction manuals you have. This will inform you of the basics of how to turn the oven on and off as well how to move the racks and other aspects of how your oven works. Every oven comes with racks. Before using your oven, experiment with taking them in and out of the oven. Depending on what you're cooking, you may have to adjust the oven racks. It's a good idea to get a sense of how to do so. Figure out how to turn the oven on and set the temperature. Usually, you have to turn a knob near the front of the oven to do so. You can then turn the knob to the appropriate heat setting. Some ovens give off a signal, such as light going on and off or a noise being made, indicating when the oven is adequately heated. Use an oven thermometer. Gas ovens tend to fluctuate in temperature. Even if you set the oven for a specific temperature, the heat may rise or fall unexpectedly during the cooking process. Therefore, use an oven thermometer to measure temperature. You may need to turn the heat slightly up or slightly down during the cooking process. Use the oven light to monitor the oven's temperature. Opening the oven too often during the cooking process can cause the temperature to drop suddenly. Rotate your trays while cooking. Heat tends to fluctuate in a gas oven. Some spots will become hotter or colder during the cooking process. Therefore, it can help to occasionally open the oven and rotate your baking trays a few degrees to ensure things cook evenly. Cakes, breads, and muffin trays should be rotated 90 degrees halfway through cooking. If you're using more than one rack to bake something like cookies, switch the top and bottom trays as well. Casserole dishes should be rotated slightly multiple times during the cooking process. Place a baking stone on your oven's floor. A baking stone can be used to cook things like baked goods and pizzas. However, it can also help regulate temperature in a gas oven. It can help radiate temperature upward in a more even fashion. Place it on the bottom of your oven or on the lowest rack when you're not using it. Then, place whatever you're cooking just above the baking stone to help it cook more evenly. Move items higher up for browner tops. It can sometimes be hard to get things like pies to brown on the top in a gas oven. It can help to move dishes you need to brown to the top tray. This will allow them to brown faster. Turn up the temperature for added crispiness. Gas ovens tend to be more humid, which can affect crispiness. Things like roasted potatoes may not get crisp as easily in a gas oven. It can help to turn the oven temperature up about 25 degrees hotter than the recipe calls for. This will result in a crispier final product. Do not use dark metal cookware. You should never use dark metals in a gas oven. In a gas oven, heat comes from the bottom of the oven. Dark metal cookware will absorb heat faster, which can result in the bottoms of dishes become brown or burnt. Instead of dark metal cookware, opt for light-colored metal, glass, or silicone. Using an Electric Oven Familiarize yourself with the basics. Make sure you read your oven's manual for the basics of using an electric oven. This should show you how to turn the oven on and off and how to do things like move the racks up and down in the oven. Make sure you know how to set the temperature. Electronic ovens usually allow you to punch in the temperature electronically and will then give an indication when the oven is ready. A light on your oven may go on or off or it may make a noise to indicate it's heated. Give your oven extra time to preheat. Start preheating your oven while you begin preparing foods and baked goods if you're using an electronic oven. Gas ovens tend to heat quickly, but electric ovens need more time to reach the proper temperature. You should use an oven thermometer to make sure your electric oven is at the right temperature. Bake items in the middle oven rack. Unless a recipe specifies an item should be placed on the upper or lower oven rack, always use the middle rack with an electric oven. This is the spot where the heat will be least likely to fluctuate during the cooking process. This will make your food cook more evenly throughout. Add steam when necessary. Electric ovens tend to be fairly dry. Oftentimes, this can delay bread and other similar foods from rising. If you're struggling to make something like a pizza crust or loaf of bread rise, try adding a little steam to your electronic oven. You can pour a cup of hot water into a pan and then set it at the bottom of the oven. You can also open the oven a crack and use a spray bottle to spritz some water into the oven. Select the right bakeware for what you're cooking. You can use a diverse range of bakeware in an electric oven. However, different bakeware will yield different results. Make sure to use the right bakeware for what you're cooking. If you want browning around the sides and bottoms of your foods, go for metal bakeware. If you want to decrease browning, go for glass or silicone products. Cleaning Your Oven Take advantage of the self cleaning option. If your oven has a self cleaning option, that's usually the best way to get the job done. Your oven's instruction manual should indicate how to use the self cleaning option. Usually, the oven will lock and self clean for about two hours. After the oven finishes self cleaning, you simply wipe off any debris with a paper towel. Remove and clean your oven racks. If your oven does not have a self cleaning option, you will need to clean it manually. To start, remove the oven racks and clean them. Lay a towel down on the bottom of your bathtub and fill the tub with hot water. Add half a cup of powder dishwasher detergent and swish it around into the water. Let the racks soak for about four hours. Then, wipe off any gunk and stains with a non-abrasive scrub brush. Rinse the racks completely and then allow them to air dry. Coat your oven in baking soda and water. Mix baking soda and water until you form a workable paste. Then, use a cloth or sponge to coat the inside of your oven with your paste. Make sure to get the sides, bottom, and top of your oven. Add vinegar and scrub off the baking soda. Pour vinegar over the baking soda and water mixture. Allow the vinegar to sit on until it begins to fizzle lightly. This should happen fairly quickly. This helps loosen dirt and debris, allowing you to easily clean your oven. Once the vinegar is fizzling, use a sponge to scrub down the top, bottom, and sides of an oven. Scrub until you remove all loose dirt and debris. When you're done, use a paper towel to remove any lingering baking soda, water, and loose dirt and bits of food. Place the oven racks back in the oven. After you've cleaned out the interior of the oven, place your oven racks back in place. Your oven should now be clean and ready to use.",
  "tyn_model":[
    "oven",
    "water",
    "gas oven",
    "baking soda",
    "electric oven",
    "bakeware",
    "vinegar",
    "oven thermometer",
    "baking stone",
    "sponge",
    "oven light",
    "gas ovens",
    "potatoes",
    "cookware",
    "electric ovens",
    "electronic oven",
    "pan",
    "spray bottle",
    "hot water",
    "dishwasher detergent",
    "paper towel",
    "oven racks"
  ],
  "tyn_section":[

  ]
}