{
  "title":"How to Move Heavy Furniture",
  "url":"https://www.wikihow.com/Move-Heavy-Furniture",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture"
  ],
  "methods":[
    {
      "name":"Moving Heavy Furniture Using Sliders",
      "steps":[
        {
          "headline":"Invest in furniture sliders.",
          "description":"You can buy the sliders of appropriate size at your local hardware or home goods store. National chains like Home Depot or Lowes will definitely sell furniture sliders. If you are planning to move your furniture over carpet or grass you should buy sliders that specialize in that movement. If you don’t have any sliders you can also try using Frisbees."
        },
        {
          "headline":"Place your sliders under the corners of the furniture.",
          "description":"Lift each corner and put a slider underneath so that the smooth edge is towards the floor. This will reduce the friction and make moving much easier."
        },
        {
          "headline":"Push the furniture.",
          "description":"Once you have the sliders under the corners of the furniture you can begin to push it. Having another person would be helpful to ensure that the furniture does not tip. Push the furniture from a lower section rather than the top to minimize the risk of tipping. The friction is almost eliminated with sliders and the furniture should move very easily."
        }
      ]
    },
    {
      "name":"Using Additional Equipment to Move Furniture",
      "steps":[
        {
          "headline":"Use a shoulder dolly.",
          "description":"These are lifting straps that connect to your shoulders and help take the weight off your back. They help you utilize your stronger muscle groups while also giving you added leverage. You can buy a shoulder dolly online. Shoulder dollies are not recommended for moving furniture up or down stairs – the weight will shift almost completely to the person on the bottom."
        },
        {
          "headline":"Use moving blankets.",
          "description":"Instead of sliders, you can also use the moving blankets that are generally used to keep furniture safe during a move. Moving blankets work in a similar way to sliders, although you will put the entire blanket under the piece of furniture. Once the entire blanket is under the furniture you can start pulling the blanket in the direction you want to move. The furniture should slide along with it. This is much easier than trying to lift the whole thing. If you need to move heavy furniture upstairs you can fold up a bunch of moving blankets and place them on each step to turn your stairs into a makeshift ramp. Once you’ve done that you can place another blanket under the piece of furniture and pull the edge to move the furniture up the steps. If your steps are particularly steep it would be a good idea to have a friend steady the back of the furniture."
        },
        {
          "headline":"Use a moving dolly.",
          "description":"A hand truck or a square moving dolly could be good options depending on the type of furniture you’re moving. A hand truck is a piece of metal moving equipment that stands upright with wheels on the bottom. The handle is at the top and a platform to hold the furniture is at the bottom by the wheels. Moving dollies are small square platforms with four wheels. You can find moving dolly’s of all different sizes. Use a hand truck to move furniture by wheeling the platform under the piece of furniture you’re trying to move. A hand truck will work well for smaller bookcases, tables, and dressers. Lean the furniture against the hand truck and tilt the handle toward you. The furniture will lean with the hand truck and you’ll be able to wheel it around. This is much easier than pushing it. Be very careful with hand trucks. If you try to move a piece of furniture that is too large it could fall and crush you. Your strength will be keeping the furniture upright. Moving dollies are very easy to use. All you need to do is place the furniture on top of them and then you’ll be able to use the dolly's wheels to push it around. Make sure you find a dolly that is large enough for the piece of furniture you plan to move. Having a friend to help you pick up the furniture would make the process of getting it on the dolly easier."
        },
        {
          "headline":"Place a glossy magazine under the corners.",
          "description":"Glossy magazines can help reduce friction with the floor and allow you to drag the entire piece of furniture. You won’t damage the floor and you won’t feel the weight of the furniture nearly as much. However, you will probably destroy the magazine. Having someone to help you lift up each corner of the furniture while you place the magazines would make the process much easier. You can also try placing the magazines on the floor, lifting the corners by yourself, and then pushing the magazine under the corner using your foot."
        }
      ]
    },
    {
      "name":"Moving Heavy Furniture Manually",
      "steps":[
        {
          "headline":"Use a high-low method.",
          "description":"You will need two people to use this method, but it works well if you have to manually move large pieces of furniture like a large dresser or bookcase. Tilt the furniture backward so that one person carries the top of it while the other side stays low and the second person carries the bottom. Maintain this angle as you move. This way you don’t have to lift the furniture all the way back up when you are ready to set it upright. It will also fit the angle of stairs more easily."
        },
        {
          "headline":"Bend from the knees and hips when lifting furniture.",
          "description":"Use your core and legs to lift heavy furniture rather than bending from the waist and using your back to lift. You can really hurt yourself if you try to use your back. Your thighs are strong and less prone to injury."
        },
        {
          "headline":"Hook chairs around corners.",
          "description":"Turn the chair on its side in an ‘L’ shape. This will make it much easier to fit the chair through doors and sharp corners. Moving heavy furniture is difficult enough as it is without having to maneuver your way through doors with trial and error. Move the back of the chair through the doorway or corner first and then curl around the door frame to get it through easily. If you’re confused about how to bend from your hips, start by squatting. Pick up the furniture from the squatting position using your legs to propel you upward."
        },
        {
          "headline":"Take the legs off heavy tables and the drawers out of dressers.",
          "description":"The lighter you can make a piece of furniture before you move it, the better. Taking the legs off of a heavy table will make it much less unwieldy. If the table can be broken up into separate sections then move each section one by one. Separating a piece of furniture into component parts is always a good tactic. Remove each drawer from your dresser prior to moving it. That way you can transport the drawers individually and then come back for the dresser itself."
        },
        {
          "headline":"Remove everything from a bookshelf before you move it.",
          "description":"Trying to move a bookcase filled up with books will be a very challenging task. It’s going to be a lot heavier and you’ll have to worry about balancing the bookcase correctly so nothing falls out. Take the time to remove the books. It will save you time and energy in the long run."
        },
        {
          "headline":"Consider hiring movers.",
          "description":"If you are unable to find anyone to help you it is probably not a good idea to try to move a massive dresser down a flight of stairs. You might damage your house, break the furniture, or seriously injure yourself. Hiring movers can be pretty affordable if you’re only moving a few items. Research moving companies in your area and call the company to get a quote. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMarty Stevens-Heebner, SMM-C, CPO®\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Move Manager\t\t\t\t\t\t\t\tMarty Stevens-Heebner was the first Certified Senior Move Manager (SMM-C) in the United States and is Founder and CEO of Clear Home Solutions, a move management and professional organizing company based in southern California. Marty is also a Certified Professional Organizer and a Certified Aging in Place Specialist (CAPS) through the National Association of Home Builders. She is the President-Elect and is on the board of directors of the National Association for Senior Move Managers, a member of the National Association of Professional Organizers, and has been acknowledged as a Hoarding Specialist and AD/HD Specialist through the Institute for Challenging Disorganization. Marty Stevens-Heebner, SMM-C, CPO®\t\t\tProfessional Move Manager\t\t\t\tOur Expert Agrees: If you need to move heavy furniture, it's often a good idea to hire professional movers. They're trained for this sort of thing, so they'll be able to move the furniture safely, and you won't have to worry about your friends falling or getting hurt. Many companies now will do smaller moves, so even if you only have a few things you need moved, you can often still find someone who can help."
        }
      ]
    }
  ],
  "text":" Moving Heavy Furniture Using Sliders Invest in furniture sliders. You can buy the sliders of appropriate size at your local hardware or home goods store. National chains like Home Depot or Lowes will definitely sell furniture sliders. If you are planning to move your furniture over carpet or grass you should buy sliders that specialize in that movement. If you don’t have any sliders you can also try using Frisbees. Place your sliders under the corners of the furniture. Lift each corner and put a slider underneath so that the smooth edge is towards the floor. This will reduce the friction and make moving much easier. Push the furniture. Once you have the sliders under the corners of the furniture you can begin to push it. Having another person would be helpful to ensure that the furniture does not tip. Push the furniture from a lower section rather than the top to minimize the risk of tipping. The friction is almost eliminated with sliders and the furniture should move very easily. Using Additional Equipment to Move Furniture Use a shoulder dolly. These are lifting straps that connect to your shoulders and help take the weight off your back. They help you utilize your stronger muscle groups while also giving you added leverage. You can buy a shoulder dolly online. Shoulder dollies are not recommended for moving furniture up or down stairs – the weight will shift almost completely to the person on the bottom. Use moving blankets. Instead of sliders, you can also use the moving blankets that are generally used to keep furniture safe during a move. Moving blankets work in a similar way to sliders, although you will put the entire blanket under the piece of furniture. Once the entire blanket is under the furniture you can start pulling the blanket in the direction you want to move. The furniture should slide along with it. This is much easier than trying to lift the whole thing. If you need to move heavy furniture upstairs you can fold up a bunch of moving blankets and place them on each step to turn your stairs into a makeshift ramp. Once you’ve done that you can place another blanket under the piece of furniture and pull the edge to move the furniture up the steps. If your steps are particularly steep it would be a good idea to have a friend steady the back of the furniture. Use a moving dolly. A hand truck or a square moving dolly could be good options depending on the type of furniture you’re moving. A hand truck is a piece of metal moving equipment that stands upright with wheels on the bottom. The handle is at the top and a platform to hold the furniture is at the bottom by the wheels. Moving dollies are small square platforms with four wheels. You can find moving dolly’s of all different sizes. Use a hand truck to move furniture by wheeling the platform under the piece of furniture you’re trying to move. A hand truck will work well for smaller bookcases, tables, and dressers. Lean the furniture against the hand truck and tilt the handle toward you. The furniture will lean with the hand truck and you’ll be able to wheel it around. This is much easier than pushing it. Be very careful with hand trucks. If you try to move a piece of furniture that is too large it could fall and crush you. Your strength will be keeping the furniture upright. Moving dollies are very easy to use. All you need to do is place the furniture on top of them and then you’ll be able to use the dolly's wheels to push it around. Make sure you find a dolly that is large enough for the piece of furniture you plan to move. Having a friend to help you pick up the furniture would make the process of getting it on the dolly easier. Place a glossy magazine under the corners. Glossy magazines can help reduce friction with the floor and allow you to drag the entire piece of furniture. You won’t damage the floor and you won’t feel the weight of the furniture nearly as much. However, you will probably destroy the magazine. Having someone to help you lift up each corner of the furniture while you place the magazines would make the process much easier. You can also try placing the magazines on the floor, lifting the corners by yourself, and then pushing the magazine under the corner using your foot. Moving Heavy Furniture Manually Use a high-low method. You will need two people to use this method, but it works well if you have to manually move large pieces of furniture like a large dresser or bookcase. Tilt the furniture backward so that one person carries the top of it while the other side stays low and the second person carries the bottom. Maintain this angle as you move. This way you don’t have to lift the furniture all the way back up when you are ready to set it upright. It will also fit the angle of stairs more easily. Bend from the knees and hips when lifting furniture. Use your core and legs to lift heavy furniture rather than bending from the waist and using your back to lift. You can really hurt yourself if you try to use your back. Your thighs are strong and less prone to injury. Hook chairs around corners. Turn the chair on its side in an ‘L’ shape. This will make it much easier to fit the chair through doors and sharp corners. Moving heavy furniture is difficult enough as it is without having to maneuver your way through doors with trial and error. Move the back of the chair through the doorway or corner first and then curl around the door frame to get it through easily. If you’re confused about how to bend from your hips, start by squatting. Pick up the furniture from the squatting position using your legs to propel you upward. Take the legs off heavy tables and the drawers out of dressers. The lighter you can make a piece of furniture before you move it, the better. Taking the legs off of a heavy table will make it much less unwieldy. If the table can be broken up into separate sections then move each section one by one. Separating a piece of furniture into component parts is always a good tactic. Remove each drawer from your dresser prior to moving it. That way you can transport the drawers individually and then come back for the dresser itself. Remove everything from a bookshelf before you move it. Trying to move a bookcase filled up with books will be a very challenging task. It’s going to be a lot heavier and you’ll have to worry about balancing the bookcase correctly so nothing falls out. Take the time to remove the books. It will save you time and energy in the long run. Consider hiring movers. If you are unable to find anyone to help you it is probably not a good idea to try to move a massive dresser down a flight of stairs. You might damage your house, break the furniture, or seriously injure yourself. Hiring movers can be pretty affordable if you’re only moving a few items. Research moving companies in your area and call the company to get a quote. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMarty Stevens-Heebner, SMM-C, CPO®\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Move Manager\t\t\t\t\t\t\t\tMarty Stevens-Heebner was the first Certified Senior Move Manager (SMM-C) in the United States and is Founder and CEO of Clear Home Solutions, a move management and professional organizing company based in southern California. Marty is also a Certified Professional Organizer and a Certified Aging in Place Specialist (CAPS) through the National Association of Home Builders. She is the President-Elect and is on the board of directors of the National Association for Senior Move Managers, a member of the National Association of Professional Organizers, and has been acknowledged as a Hoarding Specialist and AD/HD Specialist through the Institute for Challenging Disorganization. Marty Stevens-Heebner, SMM-C, CPO®\t\t\tProfessional Move Manager\t\t\t\tOur Expert Agrees: If you need to move heavy furniture, it's often a good idea to hire professional movers. They're trained for this sort of thing, so they'll be able to move the furniture safely, and you won't have to worry about your friends falling or getting hurt. Many companies now will do smaller moves, so even if you only have a few things you need moved, you can often still find someone who can help.",
  "tyn_model":[
    "sliders",
    "furniture",
    "hand truck",
    "blanket",
    "magazines",
    "movers",
    "furniture sliders",
    "shoulder dolly",
    "blankets",
    "moving blankets",
    "moving dolly",
    "dolly",
    "chair",
    "table",
    "bookcase",
    "books",
    "home goods store",
    "frisbees",
    "slider",
    "– the",
    "trucks",
    "dollies",
    "magazine",
    "chairs",
    "‘l",
    "’ shape",
    "tables",
    "dressers",
    "dresser",
    "smm-c,",
    "clear home",
    "move management and professional organizing",
    "organizer"
  ],
  "tyn_section":[

  ]
}