{
  "title":"How to Declutter Your Closets",
  "url":"https://www.wikihow.com/Declutter-Your-Closets",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Home Organization",
    "Clutter Busting"
  ],
  "parts":[
    {
      "name":"Clearing out Your Closet",
      "steps":[
        {
          "headline":"Go through your closets once each season.",
          "description":"Set a regular schedule so you can keep your closets as organized as possible. Choose a time to examine the clothes, coats, linens, and other items in your closets and decide if you want to keep or discard them. For instance, if you have a set of bedsheets that you never use, donate them so you have more room for other items. If you store flashlights in your closet, you could check every few months to make sure that the batteries are still working."
        },
        {
          "headline":"Remove everything from your closet and sort through the items.",
          "description":"Clear out everything you keep in your closet and place each item on a flat surface, like a bedspread or floor. Once your closet is emptied, set aside a large storage or trash bag, then label it “Discard” or “Donate.” Place all of your unwanted items in this bag so you can invest in better replacements. If needed, set aside multiple bags for any unwanted items. You can also set aside shoes and accessories that you don’t want anymore."
        },
        {
          "headline":"Try on different pieces of clothing to see if they still fit.",
          "description":"If you want to hang onto an older garment, check the tag to see if you’ll fit into it properly. Slip on the piece of clothing to see if it’s tight or baggy. If the clothing doesn’t fit, you can place it in the donation or discard bag. If the clothing does still fit, ask yourself if you enjoy wearing each article of clothing. If you don’t enjoy wearing a certain piece of clothing, there’s no point in keeping it in your closet."
        },
        {
          "headline":"Donate your unwanted, gently used items.",
          "description":"Search online to find charities or organizations near you that repurpose or recycle gently-used clothes, accessories, and other objects. See if there’s a specific drop-off location or if the group is willing to pick up the donations from your home. If you don’t want to give your belongings to a charity, you can also sell mint-condition items at a consignment shop. You can drop off items at organizations like the Red Cross. If you donate something especially expensive to charity, you may qualify for a tax deduction."
        },
        {
          "headline":"Scrub off dust or dirt from any walls or surfaces.",
          "description":"Soak a rag or paper towel in cool water, then wipe down any dusty or dirty surfaces within your closet. Focus especially on shelves or other flat areas that have collected a lot of dust over the past few months. Wait an hour or so for the surfaces to dry completely before you place anything back in your closet. Start by cleaning the highest surfaces in your closet, then work your way to the bottom. This way, you won’t spread extra dust to other portions of the closet. If your floor looks especially dusty, consider vacuuming it."
        }
      ]
    },
    {
      "name":"Reorganizing the Space",
      "steps":[
        {
          "headline":"Use storage racks and dividers to maximize your closet space.",
          "description":"Measure the height, width, and length of your closet to get an idea of how much space you have to work with. After this, visit your local home goods or home improvement store to browse through different closet organizers and racks. Choose organizers that can be installed in the closet or items that can be draped over the hanging rod. Use these organizers, racks, and dividers to make the most of your space. Over-the-door storage is another great option you can consider, especially if you’re looking for a handy place to store smaller items, like shoes. You can also use a storage rack to organize your belts, ties, and scarves. Place your shoes on a shoe rack or line them up on the floor so they don’t take up much space."
        },
        {
          "headline":"Set up extra shelving in your closet to keep things organized.",
          "description":"Visit your local home goods or home improvement store to find shelving units that can fit above or below the hanging rod in the center of your closet. Choose items that match the dimensions of your closet so you can make the most of your storage space. Shelves are great for holding folded fabric items, from sweaters to towels, and can also store boxes or containers of toys, holiday decorations, or other items you don't want to display in your home. Put items you don't use as often on higher shelves.Tip: A dresser can add a lot of unique storage opportunities to your closet!"
        },
        {
          "headline":"Install a drop rod to hang more clothes.",
          "description":"Search online or in a home goods store to find a drop rod, which can be draped over the existing rod in your closet. Use it if you need extra space to hang your clothes, coats, or other items. For instance, if you use your closet to store a lot of coats and jackets, you could use 1 rod for winter coats and the drop rod for springtime jackets. You can purchase a closet drop rod for under $20."
        },
        {
          "headline":"Put your fancy and delicate garments on hangers.",
          "description":"Invest in sturdy, uniform hangers that can safely hold your dress shirts, jackets, and other fancy clothing items without any risk of slippage. Try to organize your hangers in a way that makes sense to you so you can easily access your garments later on. For instance, use color-coded hangers to sort your clothes by type. You could put dress shirts on pink hangers, vests on green hangers, and so on. You can also order your clothes by color (e.g., red, orange, yellow, etc.). If some of your clothing items are out of season, arrange them in the back of your closet until you plan on wearing them frequently."
        },
        {
          "headline":"Fold and stack thick or bulky items.",
          "description":"Take your clothing, linens, and other thick items and fold them so they form a square shape. Stack these items in a vertical pile so you can arrange them on shelves or in storage organizers. Ideally, try not to pile your garments any higher than 1 ft (30 cm), and leave at least 6 in (15 cm) of space between the top of the pile and the bottom of the next shelf. Try to keep your clothing piles organized by type. For instance, keep your bedsheets in 1 pile and your pillowcases in another."
        },
        {
          "headline":"Arrange wall hooks to hold accessories and other small items.",
          "description":"Take adhesive wall hooks and stick them to prominent, eye-level locations within your closet. Use these hooks to display garments, accessories, and other small odds and ends that you store in your closet, like a spare set of keys. If you want to remove or reorganize your clothing or accessories, you can simply pull off the hook and use another adhesive tab to hang it up again."
        }
      ]
    }
  ],
  "text":" Clearing out Your Closet Go through your closets once each season. Set a regular schedule so you can keep your closets as organized as possible. Choose a time to examine the clothes, coats, linens, and other items in your closets and decide if you want to keep or discard them. For instance, if you have a set of bedsheets that you never use, donate them so you have more room for other items. If you store flashlights in your closet, you could check every few months to make sure that the batteries are still working. Remove everything from your closet and sort through the items. Clear out everything you keep in your closet and place each item on a flat surface, like a bedspread or floor. Once your closet is emptied, set aside a large storage or trash bag, then label it “Discard” or “Donate.” Place all of your unwanted items in this bag so you can invest in better replacements. If needed, set aside multiple bags for any unwanted items. You can also set aside shoes and accessories that you don’t want anymore. Try on different pieces of clothing to see if they still fit. If you want to hang onto an older garment, check the tag to see if you’ll fit into it properly. Slip on the piece of clothing to see if it’s tight or baggy. If the clothing doesn’t fit, you can place it in the donation or discard bag. If the clothing does still fit, ask yourself if you enjoy wearing each article of clothing. If you don’t enjoy wearing a certain piece of clothing, there’s no point in keeping it in your closet. Donate your unwanted, gently used items. Search online to find charities or organizations near you that repurpose or recycle gently-used clothes, accessories, and other objects. See if there’s a specific drop-off location or if the group is willing to pick up the donations from your home. If you don’t want to give your belongings to a charity, you can also sell mint-condition items at a consignment shop. You can drop off items at organizations like the Red Cross. If you donate something especially expensive to charity, you may qualify for a tax deduction. Scrub off dust or dirt from any walls or surfaces. Soak a rag or paper towel in cool water, then wipe down any dusty or dirty surfaces within your closet. Focus especially on shelves or other flat areas that have collected a lot of dust over the past few months. Wait an hour or so for the surfaces to dry completely before you place anything back in your closet. Start by cleaning the highest surfaces in your closet, then work your way to the bottom. This way, you won’t spread extra dust to other portions of the closet. If your floor looks especially dusty, consider vacuuming it. Reorganizing the Space Use storage racks and dividers to maximize your closet space. Measure the height, width, and length of your closet to get an idea of how much space you have to work with. After this, visit your local home goods or home improvement store to browse through different closet organizers and racks. Choose organizers that can be installed in the closet or items that can be draped over the hanging rod. Use these organizers, racks, and dividers to make the most of your space. Over-the-door storage is another great option you can consider, especially if you’re looking for a handy place to store smaller items, like shoes. You can also use a storage rack to organize your belts, ties, and scarves. Place your shoes on a shoe rack or line them up on the floor so they don’t take up much space. Set up extra shelving in your closet to keep things organized. Visit your local home goods or home improvement store to find shelving units that can fit above or below the hanging rod in the center of your closet. Choose items that match the dimensions of your closet so you can make the most of your storage space. Shelves are great for holding folded fabric items, from sweaters to towels, and can also store boxes or containers of toys, holiday decorations, or other items you don't want to display in your home. Put items you don't use as often on higher shelves.Tip: A dresser can add a lot of unique storage opportunities to your closet! Install a drop rod to hang more clothes. Search online or in a home goods store to find a drop rod, which can be draped over the existing rod in your closet. Use it if you need extra space to hang your clothes, coats, or other items. For instance, if you use your closet to store a lot of coats and jackets, you could use 1 rod for winter coats and the drop rod for springtime jackets. You can purchase a closet drop rod for under $20. Put your fancy and delicate garments on hangers. Invest in sturdy, uniform hangers that can safely hold your dress shirts, jackets, and other fancy clothing items without any risk of slippage. Try to organize your hangers in a way that makes sense to you so you can easily access your garments later on. For instance, use color-coded hangers to sort your clothes by type. You could put dress shirts on pink hangers, vests on green hangers, and so on. You can also order your clothes by color (e.g., red, orange, yellow, etc.). If some of your clothing items are out of season, arrange them in the back of your closet until you plan on wearing them frequently. Fold and stack thick or bulky items. Take your clothing, linens, and other thick items and fold them so they form a square shape. Stack these items in a vertical pile so you can arrange them on shelves or in storage organizers. Ideally, try not to pile your garments any higher than 1 ft (30 cm), and leave at least 6 in (15 cm) of space between the top of the pile and the bottom of the next shelf. Try to keep your clothing piles organized by type. For instance, keep your bedsheets in 1 pile and your pillowcases in another. Arrange wall hooks to hold accessories and other small items. Take adhesive wall hooks and stick them to prominent, eye-level locations within your closet. Use these hooks to display garments, accessories, and other small odds and ends that you store in your closet, like a spare set of keys. If you want to remove or reorganize your clothing or accessories, you can simply pull off the hook and use another adhesive tab to hang it up again.",
  "tyn_model":[
    "organizers",
    "drop rod",
    "rod",
    "hangers",
    "wall hooks",
    "flashlights",
    "large storage or trash bag",
    "“discard",
    "” or",
    "“donate",
    "” place",
    "rag",
    "paper towel",
    "water",
    "dust",
    "storage racks",
    "home goods or",
    "home improvement store",
    "storage rack",
    "home goods or home improvement store",
    "shelving units",
    "dresser",
    "home goods store",
    "dress shirts",
    "vests",
    "clothing",
    "linens",
    "storage organizers",
    "garments",
    "adhesive tab"
  ],
  "tyn_section":[

  ]
}