{
  "title":"How to Make a Painted Paper Butterfly",
  "url":"https://www.wikihow.com/Make-a-Painted-Paper-Butterfly",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Making a Squish Butterfly Painting",
      "steps":[
        {
          "headline":"Crease  a sheet of white paper down the middle.",
          "description":"Fold your paper in half widthwise or hamburger style, then unfold it. The crease down the middle will be your guide. The paper needs to have a smooth texture, so something like cardstock, printer paper, or even a plain paper plate will all work. Do not use construction paper. It will soak up the paint. The size of the paper does not matter, although larger pieces are easier to work with."
        },
        {
          "headline":"Choose 2 to 3 colors pf paint.",
          "description":"You can use acrylic craft paint, tempera paint, or poster paint. Make sure that these colors look nice together, especially when mixed. For example, red, yellow, and orange are a great combination. Blue, pink, and purple is another combination that works well. Don't use opposite colors, such as red and green, or you will get brown. You can use white as 1 of your colors. This will give you a pastel look. Use glittery or metallic paint as 1 of your colors if you want to give your butterfly extra sparkle."
        },
        {
          "headline":"Drop 2 to 3 blobs of paint using your first color.",
          "description":"You can squirt the paint directly from the bottle, or you can drop the paint with a spoon instead. Place some of the blobs closer to the crease, and others further from the crease. Don't put the paint too close to the edge of the paper, or it will squirt out when you squish it."
        },
        {
          "headline":"Add a few more blobs using your other colors.",
          "description":"Make 2 to 3 blobs using the other colors. Keep the blobs close together. If they are too far apart, they won't blend together and create a butterfly. Don't use too much paint, or the paper will get soggy. If you are starting to see more paint than white paper, stop!"
        },
        {
          "headline":"Fold your paper back in half, then press on it.",
          "description":"Don't pick up the paper. Simply fold the left side over onto the right, just like closing a book. Press on the paper with your fingers to squish the paint around. You may feel the paint moving through the paper, which is fine."
        },
        {
          "headline":"Unfold the paper and let the paint dry.",
          "description":"Each time you do this project, you will get a different shape and combinations of colors. Sometimes, the shapes look like butterflies, and sometimes they look like something else. Set the paper aside so that it can dry. This can take as little as 15 minutes to as long as an hour. If your butterfly doesn't look like a butterfly at all, you can cut the paper into a butterfly shape. Click here to learn how to turn painted paper into a cut-out butterfly."
        },
        {
          "headline":"Add a body and antennae, if desired.",
          "description":"Paint the body black, or glue a row of black pompoms down the middle instead. Use a thin paintbrush and black paint to add 2 antennae above the butterfly's head. You can also draw the antenna on with glitter glue instead. Make your butterfly fancier by decorating the wings with glitter glue and/or rhinestones. Glue 2 googly eyes to the head if you want a silly butterfly."
        }
      ]
    },
    {
      "name":"Creating a Cut-Out Butterfly",
      "steps":[
        {
          "headline":"Squirt 2 to 3 colors of paint onto a sheet of white paper.",
          "description":"You can use acrylic craft paint, tempera paint, or poster paint. Cardstock or printer paper will work the best, but you can use a paper plate too. Don't use construction paper, as it will soak the paint up too much."
        },
        {
          "headline":"Spread the paint around to cover the entire paper.",
          "description":"You can do this with a paintbrush or a sponge brush. Make sure that the different colors of paint touch, but don't mix them together too much, or you will get a solid color. You want a sort of tie dye effect. If you run out of paint, simply squirt more on. You want to cover as much of the paper as possible."
        },
        {
          "headline":"Let the paper dry for at least 15 to 20 minutes.",
          "description":"This should not take very long at all, about 15 to 20 minutes. If the paper is taking too long to dry, you can speed the process up with a hair dryer, or by setting the paper out in the sun."
        },
        {
          "headline":"Fold the paper in half widthwise or hamburger style.",
          "description":"Bring the narrow ends of the paper together, then flatten the paper. It does not matter if the paint is on the outside or on the inside."
        },
        {
          "headline":"Draw half of a butterfly on the paper, with the body along the fold.",
          "description":"You can make up your own butterfly shape, or you can use a stencil/template. You can make 1 big butterfly, or you can make several smaller butterflies. If you are making more than 1 butterfly, make sure that they are all on the fold."
        },
        {
          "headline":"Cut the paper along the line that you drew.",
          "description":"If you drew on the painted side of the paper, make sure that you cut just inside the lines. This way, they won't show up when you finish your butterfly."
        },
        {
          "headline":"Unfold the butterfly and decorate it, if desired.",
          "description":"You can leave your butterfly the way it is, or you can decorate it further with paint, glue, and other items. If you do decide to decorate your butterfly, make sure that you let it dry before moving on. Here are some decorating ideas:\nGlue pompoms down the middle for the body. You can also use black paint instead. Fold a pipe cleaner into a V, then glue it behind the head for the antenna. Glue tiny googly eyes to the head to make a face. You can also paint eyes on instead. Paint designs onto the wings with black or white paint, or glitter glue. Glue gemstones to the wings to make them sparkle."
        },
        {
          "headline":"Thread string through the butterfly so that you can hang it up.",
          "description":"Use a needle to thread some string through the top of the butterfly. Tie the ends of the string together so that you can hang it. If you made many small butterflies, you can thread them onto a longer piece of string, and use them as a garland instead."
        }
      ]
    },
    {
      "name":"Making a Ruffled Tie Dye Butterfly",
      "steps":[
        {
          "headline":"Paint a slotted, wooden clothespin with black or brown acrylic paint.",
          "description":"Use a paintbrush with synthetic bristles to apply black or brown acrylic craft paint to the clothespin, then let the paint dry. This should only take about 15 to 20 minutes. If you can't find craft paint, you can use tempera paint or poster paint instead. Slotted clothespins look like dolls. They have a round head, a narrow neck, and 2 thin legs. They do not open and close like regular clothespins. If you don't have clothespins, use a craft stick instead. You only need to paint 1 side."
        },
        {
          "headline":"Paint a piece of white paper 2 to 3 different watercolors.",
          "description":"Choose 2 to 3 different colors of watercolor, and apply them to the paper in blobs with a watercolor brush. Let the colors flow together to create a tie dye effect. Choose colors that look nice when mixed together, such as blue, pink, and purple. Don't use contrasting colors, such as red and green, or you may get brown where they mix. Construction paper will work the best, but you can use printer paper too. Watercolor brushes are soft and made from camelhair. Don't use stiff brushes because they don't pick up enough paint."
        },
        {
          "headline":"Set the paper aside so that it can dry.",
          "description":"This can take a few hours, so you can do something else in the meantime. If you can't wait, you can dry the paper with a hairdryer, or leave it out in the hot sun for a bit. How long the paint takes to dry depends on what type of paper you used, how wet you made it, and so forth."
        },
        {
          "headline":"Fold the paper into a fan starting from the narrow end.",
          "description":"Fold the narrow edge down by ⁄2 inch (1.3 cm). Turn the paper over, and fold the edge down by another ⁄2 inch (1.3 cm). Keep doing this until you reach the other end of the paper. You can make the folds smaller than ⁄2 inch (1.3 cm), but don't make them bigger. If you used a craft stick, fold the paper in half and cut out a butterfly shape instead. Place the body of the butterfly on the fold."
        },
        {
          "headline":"Slide the fan into the clothespin.",
          "description":"Hold the fan by the middle and turn it so that the edges open up, like a bowtie. Pinch the middle of the fan, and slide it up into the slot on the clothespin. You'll get something that looks like: >|<. If you get something that looks like --|--, the fan is turned the wrong way. Secure the fan inside the clothespin with glue. Hot glue will work the best, but you can use thick tacky glue too. If you used a craft stick, glue the cut-out butterfly to the back of the stick. The painted side of the paper needs to be facing up, with the stick down the middle."
        },
        {
          "headline":"Glue some googly eyes onto the head of the clothespin.",
          "description":"Place 2 tiny drops of tacky glue, hot glue, or white school glue onto the round part of the clothespin. Next, press 2 tiny googly eyes into the glue, then let the glue dry. Make sure that you are gluing the eyes to the front of the butterfly. If you don't have googly eyes, you can use tiny buttons or pompoms instead. Make sure that they are small enough to fit on the head part of the clothespin."
        },
        {
          "headline":"Wrap a pipecleaner around the neck to make the antenna.",
          "description":"Make a V-shape with a pipe cleaner. Wrap it around the neck of the clothespin, just below the round head. Twist the pipe cleaner once or twice so that it holds. Black will be the most realistic, but you can use any color you want. If you are using a craft stick, fold the pipe cleaner in half to make a V, then hot glue it to the back of the stick."
        },
        {
          "headline":"Shape the antenna into a V, then curl the ends.",
          "description":"Open up the pipe cleaner to make a V. Cut the ends down if you think they are too long. Use your finger, a pen, or a pencil to curl the ends of the pipe cleaner into spirals."
        }
      ]
    }
  ],
  "text":" Making a Squish Butterfly Painting Crease  a sheet of white paper down the middle. Fold your paper in half widthwise or hamburger style, then unfold it. The crease down the middle will be your guide. The paper needs to have a smooth texture, so something like cardstock, printer paper, or even a plain paper plate will all work. Do not use construction paper. It will soak up the paint. The size of the paper does not matter, although larger pieces are easier to work with. Choose 2 to 3 colors pf paint. You can use acrylic craft paint, tempera paint, or poster paint. Make sure that these colors look nice together, especially when mixed. For example, red, yellow, and orange are a great combination. Blue, pink, and purple is another combination that works well. Don't use opposite colors, such as red and green, or you will get brown. You can use white as 1 of your colors. This will give you a pastel look. Use glittery or metallic paint as 1 of your colors if you want to give your butterfly extra sparkle. Drop 2 to 3 blobs of paint using your first color. You can squirt the paint directly from the bottle, or you can drop the paint with a spoon instead. Place some of the blobs closer to the crease, and others further from the crease. Don't put the paint too close to the edge of the paper, or it will squirt out when you squish it. Add a few more blobs using your other colors. Make 2 to 3 blobs using the other colors. Keep the blobs close together. If they are too far apart, they won't blend together and create a butterfly. Don't use too much paint, or the paper will get soggy. If you are starting to see more paint than white paper, stop! Fold your paper back in half, then press on it. Don't pick up the paper. Simply fold the left side over onto the right, just like closing a book. Press on the paper with your fingers to squish the paint around. You may feel the paint moving through the paper, which is fine. Unfold the paper and let the paint dry. Each time you do this project, you will get a different shape and combinations of colors. Sometimes, the shapes look like butterflies, and sometimes they look like something else. Set the paper aside so that it can dry. This can take as little as 15 minutes to as long as an hour. If your butterfly doesn't look like a butterfly at all, you can cut the paper into a butterfly shape. Click here to learn how to turn painted paper into a cut-out butterfly. Add a body and antennae, if desired. Paint the body black, or glue a row of black pompoms down the middle instead. Use a thin paintbrush and black paint to add 2 antennae above the butterfly's head. You can also draw the antenna on with glitter glue instead. Make your butterfly fancier by decorating the wings with glitter glue and/or rhinestones. Glue 2 googly eyes to the head if you want a silly butterfly. Creating a Cut-Out Butterfly Squirt 2 to 3 colors of paint onto a sheet of white paper. You can use acrylic craft paint, tempera paint, or poster paint. Cardstock or printer paper will work the best, but you can use a paper plate too. Don't use construction paper, as it will soak the paint up too much. Spread the paint around to cover the entire paper. You can do this with a paintbrush or a sponge brush. Make sure that the different colors of paint touch, but don't mix them together too much, or you will get a solid color. You want a sort of tie dye effect. If you run out of paint, simply squirt more on. You want to cover as much of the paper as possible. Let the paper dry for at least 15 to 20 minutes. This should not take very long at all, about 15 to 20 minutes. If the paper is taking too long to dry, you can speed the process up with a hair dryer, or by setting the paper out in the sun. Fold the paper in half widthwise or hamburger style. Bring the narrow ends of the paper together, then flatten the paper. It does not matter if the paint is on the outside or on the inside. Draw half of a butterfly on the paper, with the body along the fold. You can make up your own butterfly shape, or you can use a stencil/template. You can make 1 big butterfly, or you can make several smaller butterflies. If you are making more than 1 butterfly, make sure that they are all on the fold. Cut the paper along the line that you drew. If you drew on the painted side of the paper, make sure that you cut just inside the lines. This way, they won't show up when you finish your butterfly. Unfold the butterfly and decorate it, if desired. You can leave your butterfly the way it is, or you can decorate it further with paint, glue, and other items. If you do decide to decorate your butterfly, make sure that you let it dry before moving on. Here are some decorating ideas:\nGlue pompoms down the middle for the body. You can also use black paint instead. Fold a pipe cleaner into a V, then glue it behind the head for the antenna. Glue tiny googly eyes to the head to make a face. You can also paint eyes on instead. Paint designs onto the wings with black or white paint, or glitter glue. Glue gemstones to the wings to make them sparkle. Thread string through the butterfly so that you can hang it up. Use a needle to thread some string through the top of the butterfly. Tie the ends of the string together so that you can hang it. If you made many small butterflies, you can thread them onto a longer piece of string, and use them as a garland instead. Making a Ruffled Tie Dye Butterfly Paint a slotted, wooden clothespin with black or brown acrylic paint. Use a paintbrush with synthetic bristles to apply black or brown acrylic craft paint to the clothespin, then let the paint dry. This should only take about 15 to 20 minutes. If you can't find craft paint, you can use tempera paint or poster paint instead. Slotted clothespins look like dolls. They have a round head, a narrow neck, and 2 thin legs. They do not open and close like regular clothespins. If you don't have clothespins, use a craft stick instead. You only need to paint 1 side. Paint a piece of white paper 2 to 3 different watercolors. Choose 2 to 3 different colors of watercolor, and apply them to the paper in blobs with a watercolor brush. Let the colors flow together to create a tie dye effect. Choose colors that look nice when mixed together, such as blue, pink, and purple. Don't use contrasting colors, such as red and green, or you may get brown where they mix. Construction paper will work the best, but you can use printer paper too. Watercolor brushes are soft and made from camelhair. Don't use stiff brushes because they don't pick up enough paint. Set the paper aside so that it can dry. This can take a few hours, so you can do something else in the meantime. If you can't wait, you can dry the paper with a hairdryer, or leave it out in the hot sun for a bit. How long the paint takes to dry depends on what type of paper you used, how wet you made it, and so forth. Fold the paper into a fan starting from the narrow end. Fold the narrow edge down by ⁄2 inch (1.3 cm). Turn the paper over, and fold the edge down by another ⁄2 inch (1.3 cm). Keep doing this until you reach the other end of the paper. You can make the folds smaller than ⁄2 inch (1.3 cm), but don't make them bigger. If you used a craft stick, fold the paper in half and cut out a butterfly shape instead. Place the body of the butterfly on the fold. Slide the fan into the clothespin. Hold the fan by the middle and turn it so that the edges open up, like a bowtie. Pinch the middle of the fan, and slide it up into the slot on the clothespin. You'll get something that looks like: >|<. If you get something that looks like --|--, the fan is turned the wrong way. Secure the fan inside the clothespin with glue. Hot glue will work the best, but you can use thick tacky glue too. If you used a craft stick, glue the cut-out butterfly to the back of the stick. The painted side of the paper needs to be facing up, with the stick down the middle. Glue some googly eyes onto the head of the clothespin. Place 2 tiny drops of tacky glue, hot glue, or white school glue onto the round part of the clothespin. Next, press 2 tiny googly eyes into the glue, then let the glue dry. Make sure that you are gluing the eyes to the front of the butterfly. If you don't have googly eyes, you can use tiny buttons or pompoms instead. Make sure that they are small enough to fit on the head part of the clothespin. Wrap a pipecleaner around the neck to make the antenna. Make a V-shape with a pipe cleaner. Wrap it around the neck of the clothespin, just below the round head. Twist the pipe cleaner once or twice so that it holds. Black will be the most realistic, but you can use any color you want. If you are using a craft stick, fold the pipe cleaner in half to make a V, then hot glue it to the back of the stick. Shape the antenna into a V, then curl the ends. Open up the pipe cleaner to make a V. Cut the ends down if you think they are too long. Use your finger, a pen, or a pencil to curl the ends of the pipe cleaner into spirals.",
  "tyn_model":[
    "paper",
    "paint",
    "glue",
    "pipe cleaner",
    "white paper",
    "printer paper",
    "tempera paint",
    "glitter glue",
    "construction paper",
    "acrylic craft paint",
    "poster paint",
    "string",
    "butterfly",
    "bottle",
    "spoon",
    "black paint",
    "rhinestones",
    "paper plate",
    "sponge brush",
    "hair dryer",
    "needle",
    "black or brown acrylic paint",
    "clothespins",
    "watercolors",
    "watercolor",
    "watercolor brush",
    "watercolor brushes",
    "hairdryer",
    "fan",
    "googly eyes",
    "tacky glue",
    "hot glue",
    "white school glue",
    "pipecleaner",
    "pen",
    "pencil"
  ],
  "tyn_section":[

  ]
}