{
  "title":"How to Make Green Thickies",
  "url":"https://www.wikihow.com/Make-Green-Thickies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk",
    "Smoothies"
  ],
  "steps":[
    {
      "headline":"Blend the greens, the banana(s),  and the milk, or whatever you are using.",
      "description":"You need to do this first because greens are pretty fibrous and need the extra blending time to get broken down enough. Be sure that the greens are broken down enough. You should have a slurry at this point."
    },
    {
      "headline":"Add in the 'extra' ingredients that you want.",
      "description":"Some examples are chia seeds, Macao powder, protein powder, ground flax (if you have whole flax, grind it before adding it to a smoothie. ), peanut butter, oatmeal, and cacao powder to name a few. Use caution when adding cacao powder. While it adds great nutrients and flavor to your smoothie, you can add too much."
    },
    {
      "headline":"Add your fruits.",
      "description":"You will want to blend it until it is smooth (or at least as smooth as your blender can get it). If you have a less powerful blender, you may need to blend for five to ten minutes."
    },
    {
      "headline":"If you want, you could add more fruit for color and flavor.",
      "description":""
    }
  ],
  "text":" Blend the greens, the banana(s),  and the milk, or whatever you are using. You need to do this first because greens are pretty fibrous and need the extra blending time to get broken down enough. Be sure that the greens are broken down enough. You should have a slurry at this point. Add in the 'extra' ingredients that you want. Some examples are chia seeds, Macao powder, protein powder, ground flax (if you have whole flax, grind it before adding it to a smoothie. ), peanut butter, oatmeal, and cacao powder to name a few. Use caution when adding cacao powder. While it adds great nutrients and flavor to your smoothie, you can add too much. Add your fruits. You will want to blend it until it is smooth (or at least as smooth as your blender can get it). If you have a less powerful blender, you may need to blend for five to ten minutes. If you want, you could add more fruit for color and flavor. ",
  "tyn_model":[
    "cacao powder",
    "blender",
    "milk",
    "slurry",
    "chia seeds",
    "macao powder",
    "protein powder",
    "ground flax",
    "peanut butter",
    "oatmeal",
    "fruits",
    "fruit"
  ],
  "tyn_section":[

  ]
}