{
  "title":"How to Make a Hunger Games Map in Minecraft",
  "url":"https://www.wikihow.com/Make-a-Hunger-Games-Map-in-Minecraft",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games",
    "Minecraft",
    "Minecraft Servers",
    "Minecraft Minigames"
  ],
  "steps":[
    {
      "headline":"Create a superflat world.",
      "description":"This is good for space and to not have to dig down hills."
    },
    {
      "headline":"Decide what kind of world you want it to be.",
      "description":"For ex. Volcanoes, villages, Forests (good for slender maps), castles, boats, or even a mansion."
    },
    {
      "headline":"Get building!",
      "description":"This is a good opportunity for friends to come in your world, and to get them to help you build!"
    },
    {
      "headline":"Hide chests.",
      "description":"Put inside some food, armor, swords, bows and arrows."
    },
    {
      "headline":"Create a boundary.",
      "description":"This is so no one could run off during a round of hunger games. If you prefer easy, do a fence and if you prefer expert, make a wall of blocks."
    },
    {
      "headline":"Test it with friends.",
      "description":"If you enjoy your world, follow the next step! If you don't like the game, make changes or add new features to make it more exciting."
    },
    {
      "headline":"Now, put it for download!",
      "description":"If you followed step 6, do this step. If not, redo step 6."
    },
    {
      "headline":"That's your map complete!",
      "description":""
    }
  ],
  "text":" Create a superflat world. This is good for space and to not have to dig down hills. Decide what kind of world you want it to be. For ex. Volcanoes, villages, Forests (good for slender maps), castles, boats, or even a mansion. Get building! This is a good opportunity for friends to come in your world, and to get them to help you build! Hide chests. Put inside some food, armor, swords, bows and arrows. Create a boundary. This is so no one could run off during a round of hunger games. If you prefer easy, do a fence and if you prefer expert, make a wall of blocks. Test it with friends. If you enjoy your world, follow the next step! If you don't like the game, make changes or add new features to make it more exciting. Now, put it for download! If you followed step 6, do this step. If not, redo step 6. That's your map complete! ",
  "tyn_model":[
    "boats",
    "food",
    "armor",
    "swords",
    "fence",
    "blocks"
  ],
  "tyn_section":[

  ]
}