{
  "title":"How to Make Cognac Wreaths",
  "url":"https://www.wikihow.com/Make-Cognac-Wreaths",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking"
  ],
  "steps":[
    {
      "headline":"Place the flour onto a wooden cutting board.",
      "description":""
    },
    {
      "headline":"Cut the flour directly into the flour on the board.",
      "description":""
    },
    {
      "headline":"Sprinkle the flour and butter with the cognac and sugar.",
      "description":""
    },
    {
      "headline":"Knead well.",
      "description":""
    },
    {
      "headline":"Place in a cool place overnight.",
      "description":"Cover with a damp tea towel if you have concerns about insects etc."
    },
    {
      "headline":"Preheat the oven to 350ºF-400ºF/175ºC-200ºC.",
      "description":""
    },
    {
      "headline":"Roll out the dough into 8\"/20 centimeter (7.9 in) strips length and about the thickness of a pencil.",
      "description":"Fold the strips in half and twist them."
    },
    {
      "headline":"Continue to fold into a wreath shape and pinch the ends together to join the cookie.",
      "description":""
    },
    {
      "headline":"Place each cognac wreath cookie onto a pre-greased cookie sheet.",
      "description":""
    },
    {
      "headline":"Bake in the oven for about 10 minutes.",
      "description":"Remove and cool on a wire cake rack."
    },
    {
      "headline":"Finished!",
      "description":""
    }
  ],
  "text":" Place the flour onto a wooden cutting board.  Cut the flour directly into the flour on the board.  Sprinkle the flour and butter with the cognac and sugar.  Knead well.  Place in a cool place overnight. Cover with a damp tea towel if you have concerns about insects etc. Preheat the oven to 350ºF-400ºF/175ºC-200ºC.  Roll out the dough into 8\"/20 centimeter (7.9 in) strips length and about the thickness of a pencil. Fold the strips in half and twist them. Continue to fold into a wreath shape and pinch the ends together to join the cookie.  Place each cognac wreath cookie onto a pre-greased cookie sheet.  Bake in the oven for about 10 minutes. Remove and cool on a wire cake rack. Finished! ",
  "tyn_model":[
    "flour",
    "oven",
    "butter",
    "cognac",
    "sugar",
    "tea towel",
    "pencil",
    "cognac wreath",
    "cookie sheet",
    "cake rack"
  ],
  "tyn_section":[

  ]
}