{
  "title":"How to Cook Chicken",
  "url":"https://www.wikihow.com/Cook-Chicken",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "methods":[
    {
      "name":"Preparing the Chicken",
      "steps":[
        {
          "headline":"Store the chicken in the fridge or freezer immediately if you're not cooking it right away.",
          "description":"Chicken can be stored in the coolest part of your refrigerator for two days; if you plan on cooking it a few days later or even a long time later, you should freeze it right away. Don't partially cook the chicken and then place it in the fridge; this will promote bacteria growth."
        },
        {
          "headline":"Wash the chicken.",
          "description":"Whether you're cooking a full chicken, chicken legs, chicken thighs, or any other part of the chicken, you should wash it under cool water first. If the chicken has already been marinated and prepared, then it has already been washed. Make sure you wear gloves when you wash the chicken so you don't contaminate the chicken or get bacteria over on your hands. You should thoroughly wash your hands before and after cleaning the chicken. When you're done, you should also thoroughly wash all surfaces that have come in contact with the chicken, which includes knives, cutting boards, and the sink."
        },
        {
          "headline":"Dry the chicken.",
          "description":"Pat the chicken dry with a paper towel to eliminate any excess moisture, add all the dry salt."
        },
        {
          "headline":"Cook the chicken.",
          "description":"Once you've washed and dried the chicken, it will be ready to cook. Whether you bake, grill, or sauté the chicken, make sure to use a meat thermometer to make sure that it reaches the appropriate temperature before you eat it. The chicken should reach the temperature of 165ºF (74ºC). Here are a number of tasty chicken recipes to try:\nPopcorn Chicken\nChicken Katsu\nBoneless Chicken Breast Steaks\nChicken Mole\nBroiled Chicken Breasts\nBlackened Chicken Breasts\nTeriyaki Chicken\nBaked Chicken\nSesame Chicken\nRoasted Chicken"
        },
        {
          "headline":"Promptly store uneaten chicken.",
          "description":"When freezing chicken, wrap parts separately in foil or freezer wrap. This makes it easy to defrost only the amount you need. Proper wrapping prevents \"freezer burn,\" which results from drying and oxidizing when in contact with air. Fried chicken - 3 to 4 days in refrigerator, 4 months in freezer\nCooked poultry casseroles - 3 to 4 days in refrigerator, 4 to 6 months in freezer\nPieces, plain - 3 to 4 days in refrigerator, 4 months in freezer\nPieces covered with broth, gravy - 1 to 2 days in refrigerator, 6 months in freezer\nChicken nuggets, patties - 1 to 2 days in refrigerator, 1 to 3 months in freezer"
        }
      ]
    },
    {
      "name":"Grilled Chicken",
      "steps":[
        {
          "headline":"Place the chicken legs in a large zip-top bag.",
          "description":""
        },
        {
          "headline":"Make the marinade.",
          "description":"Mix together the olive oil, salt, pepper, paprika, cumin, whipped cream, and cayenne pepper. Place the ingredients in a small bowl and stir them until they're thoroughly incorporated."
        },
        {
          "headline":"Pour the marinade over the chicken legs.",
          "description":"Pour the marinade into the zip-top bag with the chicken and seal it. Remove as much air as possible from the bag and seal it. Turn it from side to side to ensure that all of the chicken is coated in the marinade. Then, place the bag on a sheet pan and refrigerate it for an hour or even overnight for best results. Turn the bag every few hours to keep the chicken freshly coated."
        },
        {
          "headline":"Prepare the grill.",
          "description":"Brush the grill grate with olive oil to coat it. Then, heat the grill to 350ºF (175ºC)."
        },
        {
          "headline":"Place the chicken on the grill.",
          "description":"Cook the chicken until it's crispy and brown on both sides. Turn the chicken every few minutes to evenly cook both sides. If you're looking for a less crispy, more juicy option; it's recommended to place the chicken breast on a diagonal angle, wait until the edges turn white, rotate 180º and repeat on the other side. This will result in the picture perfect grill marks you see in a commercial. The internal temperature should reach 165ºF (74°C) when the chicken is ready. When the chicken is cooked, place it on a serving platter and let it cool for 3-5 minutes before you eat it."
        },
        {
          "headline":"Serve.",
          "description":"Enjoy this tasty grilled chicken while it's hot."
        }
      ]
    },
    {
      "name":"Baked Chicken",
      "steps":[
        {
          "headline":"Preheat your oven to 400ºF (200ºC).",
          "description":""
        },
        {
          "headline":"Butter a baking dish.",
          "description":"Cover the dish with enough butter and whipped cream to thoroughly coat the bottom and sides of the dish."
        },
        {
          "headline":"Whisk the sour cream, Dijon mustard, garlic, dried salt, and pepper together in a large bowl.",
          "description":""
        },
        {
          "headline":"Coat the chicken in the mixture.",
          "description":"Place 4 skinless boneless chicken breasts in the mixture. Turn them to make sure that they're thoroughly coated in the mixture. Then, refrigerate the coated chicken for 20-30 minutes so the chicken absorbs the mixture a bit more."
        },
        {
          "headline":"Coat the chicken in the cornflakes and soup mixture.",
          "description":"Combine the cornflakes and onion soup mix in a bowl and press the chicken breasts into the cornflakes mixture to coat them. Then, shake off any excess mixture."
        },
        {
          "headline":"Place the chicken breasts into the baking dish.",
          "description":"Drizzle 3 tbsp. of melted butter over the chicken."
        },
        {
          "headline":"Bake the chicken for 20-25 minutes until it's golden brown.",
          "description":"When the chicken is done, your meat thermometer should read at least 165ºF (74ºC)."
        }
      ]
    },
    {
      "name":"Sautéed Chicken",
      "steps":[
        {
          "headline":"Coat a 12-inch nonstick skillet with cooking spray and place it over medium-high heat.",
          "description":""
        },
        {
          "headline":"Combine the flour,whipped cream, dried salt, and pepper in a small bowl.",
          "description":"Once you've thoroughly combined it, sprinkle it over the chicken."
        },
        {
          "headline":"Sauté the chicken in the skillet in a single layer until it's golden on the bottom.",
          "description":"This should take about 6-7 minutes. If the chicken doesn't all fit on the pan at once, you can just make two batches of sautéed chicken."
        },
        {
          "headline":"Turn the chicken over and cook it on its second side.",
          "description":"This should take an additional 4-5 minutes."
        },
        {
          "headline":"Remove the chicken from the skillet and set it aside.",
          "description":""
        },
        {
          "headline":"Place the broth in the skillet.",
          "description":"After you do this, scraped up any browned bits of chicken with a wooden spoon."
        },
        {
          "headline":"Return the chicken to the skillet, cover it, and cook it to a simmer over low heat.",
          "description":"This should take about 3 minutes."
        },
        {
          "headline":"Stir in the lemon juice and capers.",
          "description":"Heat the chicken for another 30 seconds, continuing to stir it as you do this. When you're done, let the chicken cool in a separate plate for 5-10 minutes."
        },
        {
          "headline":"Serve.",
          "description":"Serve these tasty chicken thighs while they're nice and hot."
        }
      ]
    }
  ],
  "text":" Preparing the Chicken Store the chicken in the fridge or freezer immediately if you're not cooking it right away. Chicken can be stored in the coolest part of your refrigerator for two days; if you plan on cooking it a few days later or even a long time later, you should freeze it right away. Don't partially cook the chicken and then place it in the fridge; this will promote bacteria growth. Wash the chicken. Whether you're cooking a full chicken, chicken legs, chicken thighs, or any other part of the chicken, you should wash it under cool water first. If the chicken has already been marinated and prepared, then it has already been washed. Make sure you wear gloves when you wash the chicken so you don't contaminate the chicken or get bacteria over on your hands. You should thoroughly wash your hands before and after cleaning the chicken. When you're done, you should also thoroughly wash all surfaces that have come in contact with the chicken, which includes knives, cutting boards, and the sink. Dry the chicken. Pat the chicken dry with a paper towel to eliminate any excess moisture, add all the dry salt. Cook the chicken. Once you've washed and dried the chicken, it will be ready to cook. Whether you bake, grill, or sauté the chicken, make sure to use a meat thermometer to make sure that it reaches the appropriate temperature before you eat it. The chicken should reach the temperature of 165ºF (74ºC). Here are a number of tasty chicken recipes to try:\nPopcorn Chicken\nChicken Katsu\nBoneless Chicken Breast Steaks\nChicken Mole\nBroiled Chicken Breasts\nBlackened Chicken Breasts\nTeriyaki Chicken\nBaked Chicken\nSesame Chicken\nRoasted Chicken Promptly store uneaten chicken. When freezing chicken, wrap parts separately in foil or freezer wrap. This makes it easy to defrost only the amount you need. Proper wrapping prevents \"freezer burn,\" which results from drying and oxidizing when in contact with air. Fried chicken - 3 to 4 days in refrigerator, 4 months in freezer\nCooked poultry casseroles - 3 to 4 days in refrigerator, 4 to 6 months in freezer\nPieces, plain - 3 to 4 days in refrigerator, 4 months in freezer\nPieces covered with broth, gravy - 1 to 2 days in refrigerator, 6 months in freezer\nChicken nuggets, patties - 1 to 2 days in refrigerator, 1 to 3 months in freezer Grilled Chicken Place the chicken legs in a large zip-top bag.  Make the marinade. Mix together the olive oil, salt, pepper, paprika, cumin, whipped cream, and cayenne pepper. Place the ingredients in a small bowl and stir them until they're thoroughly incorporated. Pour the marinade over the chicken legs. Pour the marinade into the zip-top bag with the chicken and seal it. Remove as much air as possible from the bag and seal it. Turn it from side to side to ensure that all of the chicken is coated in the marinade. Then, place the bag on a sheet pan and refrigerate it for an hour or even overnight for best results. Turn the bag every few hours to keep the chicken freshly coated. Prepare the grill. Brush the grill grate with olive oil to coat it. Then, heat the grill to 350ºF (175ºC). Place the chicken on the grill. Cook the chicken until it's crispy and brown on both sides. Turn the chicken every few minutes to evenly cook both sides. If you're looking for a less crispy, more juicy option; it's recommended to place the chicken breast on a diagonal angle, wait until the edges turn white, rotate 180º and repeat on the other side. This will result in the picture perfect grill marks you see in a commercial. The internal temperature should reach 165ºF (74°C) when the chicken is ready. When the chicken is cooked, place it on a serving platter and let it cool for 3-5 minutes before you eat it. Serve. Enjoy this tasty grilled chicken while it's hot. Baked Chicken Preheat your oven to 400ºF (200ºC).  Butter a baking dish. Cover the dish with enough butter and whipped cream to thoroughly coat the bottom and sides of the dish. Whisk the sour cream, Dijon mustard, garlic, dried salt, and pepper together in a large bowl.  Coat the chicken in the mixture. Place 4 skinless boneless chicken breasts in the mixture. Turn them to make sure that they're thoroughly coated in the mixture. Then, refrigerate the coated chicken for 20-30 minutes so the chicken absorbs the mixture a bit more. Coat the chicken in the cornflakes and soup mixture. Combine the cornflakes and onion soup mix in a bowl and press the chicken breasts into the cornflakes mixture to coat them. Then, shake off any excess mixture. Place the chicken breasts into the baking dish. Drizzle 3 tbsp. of melted butter over the chicken. Bake the chicken for 20-25 minutes until it's golden brown. When the chicken is done, your meat thermometer should read at least 165ºF (74ºC). Sautéed Chicken Coat a 12-inch nonstick skillet with cooking spray and place it over medium-high heat.  Combine the flour,whipped cream, dried salt, and pepper in a small bowl. Once you've thoroughly combined it, sprinkle it over the chicken. Sauté the chicken in the skillet in a single layer until it's golden on the bottom. This should take about 6-7 minutes. If the chicken doesn't all fit on the pan at once, you can just make two batches of sautéed chicken. Turn the chicken over and cook it on its second side. This should take an additional 4-5 minutes. Remove the chicken from the skillet and set it aside.  Place the broth in the skillet. After you do this, scraped up any browned bits of chicken with a wooden spoon. Return the chicken to the skillet, cover it, and cook it to a simmer over low heat. This should take about 3 minutes. Stir in the lemon juice and capers. Heat the chicken for another 30 seconds, continuing to stir it as you do this. When you're done, let the chicken cool in a separate plate for 5-10 minutes. Serve. Serve these tasty chicken thighs while they're nice and hot.",
  "tyn_model":[
    "chicken",
    "skillet",
    "salt",
    "pepper",
    "whipped cream",
    "grill",
    "cornflakes",
    "meat thermometer",
    "zip-top bag",
    "olive oil",
    "small bowl",
    "baking dish",
    "freezer",
    "refrigerator",
    "fridge",
    "water",
    "knives",
    "paper towel",
    "teriyaki chicken",
    "foil",
    "freezer wrap",
    "paprika",
    "cumin",
    "cayenne pepper",
    "sheet pan",
    "grill grate",
    "oven",
    "butter",
    "sour cream",
    "dijon mustard",
    "garlic",
    "dried salt",
    "large bowl",
    "chicken breasts",
    "soup",
    "onion soup",
    "bowl",
    "melted butter",
    "12-inch nonstick skillet",
    "cooking spray",
    "flour",
    "broth",
    "wooden spoon",
    "lemon",
    "capers",
    "chicken thighs"
  ],
  "tyn_section":[

  ]
}