{
  "title":"How to Keep Sliced Bananas from Discoloring",
  "url":"https://www.wikihow.com/Keep-Sliced-Bananas-from-Discoloring",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Preservation Techniques"
  ],
  "methods":[
    {
      "name":"Using Fruit Juice",
      "steps":[
        {
          "headline":"Buy fruit juice or squeeze your own.",
          "description":"There are several fruit juices that can keep banana slices from turning brown. You can use fresh juice or storebought varieties — it doesn't matter. See our juicing guide if you'd like to make your own. Either way, you won't need much — a half cup or so is plenty for one or two bananas. Lemon juice is the most well-known juice used for keeping fruits from turning brown. It works just as well for bananas as it does for apples. However, there are many other juices that work well, including:\nLime juice\nOrange juice\nTinned pineapple juice\nTinned or fresh grapefruit juice\nApple juice"
        },
        {
          "headline":"Coat the sliced bananas in the juice.",
          "description":"To do this, you can sprinkle the juice over the slices or dip the slices into the juice. You can also immerse the slices in the juice and leave them there for a few minutes, allowing them to soak up some of the juice. This can be great for keeping them fresh-looking but may affect their taste a little more than normal. Another quick way to coat the bananas is to put them in a sealed plastic bag with the juice and gently turn it over a few times. To minimize any change to the flavor of the bananas, use the juice sparingly or place it in a spray bottle and spritz it over the slices."
        },
        {
          "headline":"Use or store the bananas.",
          "description":"Once they're soaked in fruit juice, the bananas will take much longer to turn brown. Whether you're eating the slices raw or making a pie, fruit kabobs, a parfait, or a fruit salad, you can trust that your bananas will look fresh well through the end of the meal. They should even last without refrigeration in a plastic container for a few hours — perfect for packed lunches. Even with the fruit juice, banana slices are best consumed the same day. The cold temperatures of refrigerators can turn the peels brown, but if you're OK with this, the fruit itself should remain fresh. If you do refrigerate the slices, be sure to put them in an airtight container with as little air in it as possible."
        },
        {
          "headline":"Revive discolored banana slices with pineapple or grapefruit juice.",
          "description":"If your banana slices are already brown, all is not lost. You can lighten discolored banana slices by immersing them in tinned pineapple juice or grapefruit juice for 10-15 minutes. They won't quite return to their original pale yellow color, but they will look fresher and more delicious."
        }
      ]
    },
    {
      "name":"Using Other Tricks",
      "steps":[
        {
          "headline":"Use soda water.",
          "description":"Fruit juice isn't the only thing that can keep bananas from turning an unappealing brown. For example, soda water and club soda are known for their ability to keep sliced fruit fresh. Best of all, these liquids have the added benefit that they don't affect the taste of banana. Use them as you would use fruit juices, soaking the slices in the soda water before serving or storing them. Be sure to use soda water or club soda. Tonic water, a beverage that looks the same, has a strong flavor that doesn't go well with bananas."
        },
        {
          "headline":"Use tap water.",
          "description":"Tap water doesn't work quite as well as fruit juice or the other solutions in this article, but it's something you'll always have available and it's basically free. This, too, is used the same as the fruit juices: soak the banana slices in the water before using them how you wish."
        },
        {
          "headline":"Use diluted citric acid.",
          "description":"Citric acid (the same chemical that makes citrus fruits like lemons sour) is sold in a purified form as a canning additive. In this form, it is specifically used to keep fruit from discoloring as it stores. However, it's often difficult to find pure citric acid. Your best bet will usually be a health food store or a hardware store. Luckily, it is not especially expensive — less than $10 for a small bottle is common. To use citric acid, add three teaspoons to a cup of water and mix. Soak the slices in the bath as normal. Don't use undiluted citric acid, as it is far too sour."
        },
        {
          "headline":"Use diluted vinegar.",
          "description":"Vinegar can be used similarly to citric acid to keep fruit fresh. However, its strong sourness also makes it necessary to dilute it. As with citric acid, add a few teaspoons to a cup of water to make a bath and soak the banana pieces as normal."
        },
        {
          "headline":"Use dissolved vitamin C. Ascorbic acid, or vitamin C, is another acid that can keep fruit from turning brown.",
          "description":"Powdered vitamin C can usually be found in most supermarkets as a cold-fighting supplement. Dissolve this in water (according to the directions on the package) to make a bath and soak the banana slices as normal. If you're in a pinch, a ground-up vitamin C tablet works as well."
        },
        {
          "headline":"Limit exposure to air.",
          "description":"Since banana slices turn brown when they are exposed to the oxygen in the air, keeping the fruit from physically touching the air will prevent the browning reaction from occurring. There are many ways to do this. A few are listed below. One easy trick involves wax paper. Cut the slices so that they are all about the same slice, then lay them on a tray. Cut a square of wax paper to fit the tray, then lay it down over the slices and gently press it down so it sticks to each. The banana slices will be sandwiched between the paper and the tray without any air exposure. If you have the time, you can also cut small squares of wax paper of plastic wrap and lay them individually over each slice. Be sure to remove them before you eat. If you have a vacuum storage device (e.g., Food Saver, etc. ), you can also try packing the slices in an air-free container."
        }
      ]
    }
  ],
  "text":" Using Fruit Juice Buy fruit juice or squeeze your own. There are several fruit juices that can keep banana slices from turning brown. You can use fresh juice or storebought varieties — it doesn't matter. See our juicing guide if you'd like to make your own. Either way, you won't need much — a half cup or so is plenty for one or two bananas. Lemon juice is the most well-known juice used for keeping fruits from turning brown. It works just as well for bananas as it does for apples. However, there are many other juices that work well, including:\nLime juice\nOrange juice\nTinned pineapple juice\nTinned or fresh grapefruit juice\nApple juice Coat the sliced bananas in the juice. To do this, you can sprinkle the juice over the slices or dip the slices into the juice. You can also immerse the slices in the juice and leave them there for a few minutes, allowing them to soak up some of the juice. This can be great for keeping them fresh-looking but may affect their taste a little more than normal. Another quick way to coat the bananas is to put them in a sealed plastic bag with the juice and gently turn it over a few times. To minimize any change to the flavor of the bananas, use the juice sparingly or place it in a spray bottle and spritz it over the slices. Use or store the bananas. Once they're soaked in fruit juice, the bananas will take much longer to turn brown. Whether you're eating the slices raw or making a pie, fruit kabobs, a parfait, or a fruit salad, you can trust that your bananas will look fresh well through the end of the meal. They should even last without refrigeration in a plastic container for a few hours — perfect for packed lunches. Even with the fruit juice, banana slices are best consumed the same day. The cold temperatures of refrigerators can turn the peels brown, but if you're OK with this, the fruit itself should remain fresh. If you do refrigerate the slices, be sure to put them in an airtight container with as little air in it as possible. Revive discolored banana slices with pineapple or grapefruit juice. If your banana slices are already brown, all is not lost. You can lighten discolored banana slices by immersing them in tinned pineapple juice or grapefruit juice for 10-15 minutes. They won't quite return to their original pale yellow color, but they will look fresher and more delicious. Using Other Tricks Use soda water. Fruit juice isn't the only thing that can keep bananas from turning an unappealing brown. For example, soda water and club soda are known for their ability to keep sliced fruit fresh. Best of all, these liquids have the added benefit that they don't affect the taste of banana. Use them as you would use fruit juices, soaking the slices in the soda water before serving or storing them. Be sure to use soda water or club soda. Tonic water, a beverage that looks the same, has a strong flavor that doesn't go well with bananas. Use tap water. Tap water doesn't work quite as well as fruit juice or the other solutions in this article, but it's something you'll always have available and it's basically free. This, too, is used the same as the fruit juices: soak the banana slices in the water before using them how you wish. Use diluted citric acid. Citric acid (the same chemical that makes citrus fruits like lemons sour) is sold in a purified form as a canning additive. In this form, it is specifically used to keep fruit from discoloring as it stores. However, it's often difficult to find pure citric acid. Your best bet will usually be a health food store or a hardware store. Luckily, it is not especially expensive — less than $10 for a small bottle is common. To use citric acid, add three teaspoons to a cup of water and mix. Soak the slices in the bath as normal. Don't use undiluted citric acid, as it is far too sour. Use diluted vinegar. Vinegar can be used similarly to citric acid to keep fruit fresh. However, its strong sourness also makes it necessary to dilute it. As with citric acid, add a few teaspoons to a cup of water to make a bath and soak the banana pieces as normal. Use dissolved vitamin C. Ascorbic acid, or vitamin C, is another acid that can keep fruit from turning brown. Powdered vitamin C can usually be found in most supermarkets as a cold-fighting supplement. Dissolve this in water (according to the directions on the package) to make a bath and soak the banana slices as normal. If you're in a pinch, a ground-up vitamin C tablet works as well. Limit exposure to air. Since banana slices turn brown when they are exposed to the oxygen in the air, keeping the fruit from physically touching the air will prevent the browning reaction from occurring. There are many ways to do this. A few are listed below. One easy trick involves wax paper. Cut the slices so that they are all about the same slice, then lay them on a tray. Cut a square of wax paper to fit the tray, then lay it down over the slices and gently press it down so it sticks to each. The banana slices will be sandwiched between the paper and the tray without any air exposure. If you have the time, you can also cut small squares of wax paper of plastic wrap and lay them individually over each slice. Be sure to remove them before you eat. If you have a vacuum storage device (e.g., Food Saver, etc. ), you can also try packing the slices in an air-free container.",
  "tyn_model":[
    "bananas",
    "banana",
    "citric acid",
    "fruit juice",
    "soda water",
    "water",
    "fruit juices",
    "vitamin c",
    "wax paper",
    "tray",
    "pineapple juice",
    "grapefruit juice",
    "club soda",
    "tap water",
    "vinegar",
    "— it",
    "juicing guide",
    "— a",
    "lemon",
    "apples",
    "lime juice",
    "orange juice",
    "apple juice",
    "sealed plastic bag",
    "spray bottle",
    "fruit kabobs",
    "fruit salad",
    "— perfect",
    "airtight container",
    "pineapple or grapefruit juice",
    "tonic water",
    "— less",
    "vitamin c.",
    "ascorbic acid",
    "paper",
    "plastic wrap",
    "vacuum storage device",
    "food saver"
  ],
  "tyn_section":[

  ]
}