{
  "title":"How to Make Glowing Bottles for a Blacklight",
  "url":"https://www.wikihow.com/Make-Glowing-Bottles-for-a-Blacklight",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Glass and Stained Glass Projects",
    "Glass Bottle Projects"
  ],
  "steps":[
    {
      "headline":"Buy or find a blacklight.",
      "description":"The incandescent screw-in model will work, but will require more than one bulb, and these burn out constantly. A real glassware you would like to light up. For example, a lot of people use empty expensive liquor bottles. Any nifty glassware that can contain fluid is acceptable. A suggestion is an empty bottle of Bawls Guarana, it is blue and the black light and the ink will make it look great."
    },
    {
      "headline":"Purchase a variety of cheap highlighters, in many bright colors.",
      "description":"Feel free to color coordinate or go crazy and use all of the colors in a rainbow."
    },
    {
      "headline":"Break open the highlighter tip to obtain the fluid inside the felt tip.",
      "description":"Soak the felt strip inside in a small container of water or rubbing alcohol to get the ink out into a nice fluid. Water is a suitable solvent."
    },
    {
      "headline":"Fill the bottle up.",
      "description":"The more ink, the better. Adding rubbing alcohol to the mixture will stop the water from getting moldy inside in case it's an expensive bottle of 1776 Champagne', or even your $40 investment on Grey Goose."
    },
    {
      "headline":"Cap and arrange it.",
      "description":"It will glow under a blacklight and looks amazing, especially if you use several different colors and glasses."
    }
  ],
  "text":" Buy or find a blacklight. The incandescent screw-in model will work, but will require more than one bulb, and these burn out constantly. A real glassware you would like to light up. For example, a lot of people use empty expensive liquor bottles. Any nifty glassware that can contain fluid is acceptable. A suggestion is an empty bottle of Bawls Guarana, it is blue and the black light and the ink will make it look great. Purchase a variety of cheap highlighters, in many bright colors. Feel free to color coordinate or go crazy and use all of the colors in a rainbow. Break open the highlighter tip to obtain the fluid inside the felt tip. Soak the felt strip inside in a small container of water or rubbing alcohol to get the ink out into a nice fluid. Water is a suitable solvent. Fill the bottle up. The more ink, the better. Adding rubbing alcohol to the mixture will stop the water from getting moldy inside in case it's an expensive bottle of 1776 Champagne', or even your $40 investment on Grey Goose. Cap and arrange it. It will glow under a blacklight and looks amazing, especially if you use several different colors and glasses.",
  "tyn_model":[
    "water",
    "rubbing alcohol",
    "incandescent screw-in model",
    "bawls guarana",
    "highlighters",
    "highlighter tip",
    "champagne",
    "grey goose",
    "glasses"
  ],
  "tyn_section":[

  ]
}