{
  "title":"How to Make Pino",
  "url":"https://www.wikihow.com/Make-Pino",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Japanese Dishes"
  ],
  "steps":[
    {
      "headline":"Melt the ice cream completely.",
      "description":"Put the liquid into the mold(s) and put into the freezer or fridge and leave overnight."
    },
    {
      "headline":"Before you take out the hardened cream, melt the chocolate.",
      "description":"Pour in only a bit of hot water and keep mixing. Once the chocolate becomes grainy, bubbly, or otherwise sludge looking, slowly add the honey. This should restore it back to how it was before you added water. Put it in the fridge until cooled, but not set."
    },
    {
      "headline":"Take out the chocolate and the ice cream.",
      "description":"Pop the ice cream out of the molds and dip it in the melted chocolate. Put the pino on a tray and put it in the fridge. Leave until set."
    },
    {
      "headline":"Take the pino out of the fridge and slowly put the skewers or knives into the middle of the pino, trying not to break the chocolate.",
      "description":""
    },
    {
      "headline":"Serve.",
      "description":""
    }
  ],
  "text":" Melt the ice cream completely. Put the liquid into the mold(s) and put into the freezer or fridge and leave overnight. Before you take out the hardened cream, melt the chocolate. Pour in only a bit of hot water and keep mixing. Once the chocolate becomes grainy, bubbly, or otherwise sludge looking, slowly add the honey. This should restore it back to how it was before you added water. Put it in the fridge until cooled, but not set. Take out the chocolate and the ice cream. Pop the ice cream out of the molds and dip it in the melted chocolate. Put the pino on a tray and put it in the fridge. Leave until set. Take the pino out of the fridge and slowly put the skewers or knives into the middle of the pino, trying not to break the chocolate.  Serve. ",
  "tyn_model":[
    "chocolate",
    "ice cream",
    "fridge",
    "hot water",
    "honey",
    "water",
    "tray",
    "skewers",
    "knives"
  ],
  "tyn_section":[

  ]
}