{
  "title":"How to Catch Articuno, Zapdos, and Moltres in Pokémon X and Y",
  "url":"https://www.wikihow.com/Catch-Articuno,-Zapdos,-and-Moltres-in-Pok%C3%A9mon-X-and-Y",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Pokemon Video Games",
    "Pokemon X and Y"
  ],
  "parts":[
    {
      "name":"Cornering the Bird",
      "steps":[
        {
          "headline":"Make sure that you meet the prerequisites.",
          "description":"You'll need to have completed the following prerequisites both to view Articuno/Zapdos/Moltres and to have a chance of catching them:\nDefeated the Elite Four after earning all eight badges\nHave the National Pokédex available\nHave a Pokémon near level 70"
        },
        {
          "headline":"Determine which legendary bird you'll be able to capture.",
          "description":"The legendary bird that appears in your game is contingent on the starter that you chose at the beginning of the game:\n\nChespin - You'll be able to catch Articuno. Fennekin - You'll be able to catch Zapdos. Froakie - You'll be able to catch Moltres."
        },
        {
          "headline":"Travel to the Kalos region.",
          "description":"If you aren't already here after the Elite Four fight, travel back to Kalos in order to find the legendary bird."
        },
        {
          "headline":"Run into your game's legendary bird.",
          "description":"Simply walk around in some grass to trigger the bird to appear. You shouldn't run into any other Pokémon while doing this, though your experience may vary."
        },
        {
          "headline":"Track the bird.",
          "description":"Open the National Pokédex and find the bird (which should be in your Pokédex due to your recent encounter with it), then select the bird to view its current route on the map. The route will be glowing red."
        },
        {
          "headline":"Travel to the bird's new area via bike.",
          "description":"Flying to a different city will cause the bird to move again, so you'll need to travel on your bike instead. If the bird is several cities over, flying to a new city in order to reset the bird's location to be closer to you is a good strategy."
        },
        {
          "headline":"Encounter the legendary bird.",
          "description":"Walk around in some grass until the legendary bird appears and then flees. This should be the second time that you've encountered the bird."
        },
        {
          "headline":"Encounter the legendary bird at least 9 more times.",
          "description":"Each time you run into the bird, it will flee to a different section of the map, at which point you can track the bird and then bike (but not fly) to that section and repeat the process. You'll need to do this at least 10 times after your initial encounter in the Kalos region, though this number may vary by an encounter or two. There's no discernible pattern for the legendary bird's travel routes. If you pass through too many areas in succession, the bird will move again. This makes it impossible to catch up with the bird if it moves to a cross-map area, so you'll need to fly to a different city and wait for the bird to move again."
        },
        {
          "headline":"Wait for the bird to flee to Sea Spirit's Den.",
          "description":"After you've encountered the legendary bird enough times, it will show up in Sea Spirit's Den, which is where it will stay until you capture it."
        }
      ]
    },
    {
      "name":"Catching the Bird",
      "steps":[
        {
          "headline":"Stock up on the right PokéBalls.",
          "description":"You'll predominately want to use Dusk Balls to catch your bird, but there are a few other options you might want to try as well:\n\nQuick Ball - Use one of these at the beginning of the fight. Quick Balls have a 5x chance of catching a Pokémon when used as the first move in a fight, after which point they drop to a 1x chance. Dusk Ball - Best used for most of the catch phase. Dusk Balls have a 3.5x chance of catching a Pokémon that's in a cave, which applies to Sea Spirit's Den. Timer Ball - Best used after your 31st turn, as the Timer Ball has a 4x chance of catching Pokémon after this point. Master Ball - While the Master Ball should be used for Mewtwo, you can use the Master Ball on Articuno/Zapdos/Moltres to guarantee a capture."
        },
        {
          "headline":"Make sure that you have a Pokémon who knows the \"Surf\" HM.",
          "description":"Since Sea Spirit's Den is across a pier, you can only access the Sea Spirit's Den cave by surfing over to it. You can initiate the \"Surf\" action by approaching a body of water."
        },
        {
          "headline":"Travel to Sea Spirit's Den.",
          "description":"It's in the north part of Azure Bay, which is a point on the far-left side of the map. Once you take the tram there, you'll wade into the water to activate the \"Surf\" HM and then surf over to the cave."
        },
        {
          "headline":"Save before entering Sea Spirit's Den.",
          "description":"Since the chances of you capturing the legendary bird are low, you'll want to save your progress right before entering the cave so that you can reload and try again if your Pokémon dies or if you run out of PokéBalls."
        },
        {
          "headline":"Initiate the battle if necessary.",
          "description":"In most cases, walking into Sea Spirit's Den and moving around a bit will trigger the fight, but you may have to navigate through a conversational prompt or dialogue option before the fight will begin. This is why it's important to save before you enter Sea Spirit's Den, as the fight may be triggered immediately after you enter the cave."
        },
        {
          "headline":"Toss a Quick Ball at the bird.",
          "description":"Even with the Quick Ball's high chances of catching a Pokémon on the first try, this will rarely be enough to catch a legendary bird; however, it's worth a shot."
        },
        {
          "headline":"Get the bird down to under 10 HP.",
          "description":"The way in which you do this will depend on the type of Pokémon that you use and the types of attacks that your legendary bird uses, but you'll generally want to err on the side of lower-damage attacks once the bird is under 50 percent health. Once you've knocked the bird's health down into a small sliver of red, you can proceed. Your chances of catching the bird increase as the bird's health decreases. If you accidentally defeat the bird, you'll need to reload your save and try again."
        },
        {
          "headline":"Begin trying to catch the bird.",
          "description":"For every turn that you get, toss a Dusk PokéBall at the bird. After you've had 31 turns, start using Timer Balls, as the extra .5x chance of catching a Pokémon will often give you the edge that you need. If you run out of PokéBalls before you can catch the bird, you'll need to reload your save and try again."
        },
        {
          "headline":"Save your game once you catch the bird.",
          "description":"Now that you've finally caught your legendary bird, you don't want all of your hard work to go to waste! Many of your lower-level Pokémon will level up after your catch the legendary bird."
        }
      ]
    }
  ],
  "text":" Cornering the Bird Make sure that you meet the prerequisites. You'll need to have completed the following prerequisites both to view Articuno/Zapdos/Moltres and to have a chance of catching them:\nDefeated the Elite Four after earning all eight badges\nHave the National Pokédex available\nHave a Pokémon near level 70 Determine which legendary bird you'll be able to capture. The legendary bird that appears in your game is contingent on the starter that you chose at the beginning of the game:\n\nChespin - You'll be able to catch Articuno. Fennekin - You'll be able to catch Zapdos. Froakie - You'll be able to catch Moltres. Travel to the Kalos region. If you aren't already here after the Elite Four fight, travel back to Kalos in order to find the legendary bird. Run into your game's legendary bird. Simply walk around in some grass to trigger the bird to appear. You shouldn't run into any other Pokémon while doing this, though your experience may vary. Track the bird. Open the National Pokédex and find the bird (which should be in your Pokédex due to your recent encounter with it), then select the bird to view its current route on the map. The route will be glowing red. Travel to the bird's new area via bike. Flying to a different city will cause the bird to move again, so you'll need to travel on your bike instead. If the bird is several cities over, flying to a new city in order to reset the bird's location to be closer to you is a good strategy. Encounter the legendary bird. Walk around in some grass until the legendary bird appears and then flees. This should be the second time that you've encountered the bird. Encounter the legendary bird at least 9 more times. Each time you run into the bird, it will flee to a different section of the map, at which point you can track the bird and then bike (but not fly) to that section and repeat the process. You'll need to do this at least 10 times after your initial encounter in the Kalos region, though this number may vary by an encounter or two. There's no discernible pattern for the legendary bird's travel routes. If you pass through too many areas in succession, the bird will move again. This makes it impossible to catch up with the bird if it moves to a cross-map area, so you'll need to fly to a different city and wait for the bird to move again. Wait for the bird to flee to Sea Spirit's Den. After you've encountered the legendary bird enough times, it will show up in Sea Spirit's Den, which is where it will stay until you capture it. Catching the Bird Stock up on the right PokéBalls. You'll predominately want to use Dusk Balls to catch your bird, but there are a few other options you might want to try as well:\n\nQuick Ball - Use one of these at the beginning of the fight. Quick Balls have a 5x chance of catching a Pokémon when used as the first move in a fight, after which point they drop to a 1x chance. Dusk Ball - Best used for most of the catch phase. Dusk Balls have a 3.5x chance of catching a Pokémon that's in a cave, which applies to Sea Spirit's Den. Timer Ball - Best used after your 31st turn, as the Timer Ball has a 4x chance of catching Pokémon after this point. Master Ball - While the Master Ball should be used for Mewtwo, you can use the Master Ball on Articuno/Zapdos/Moltres to guarantee a capture. Make sure that you have a Pokémon who knows the \"Surf\" HM. Since Sea Spirit's Den is across a pier, you can only access the Sea Spirit's Den cave by surfing over to it. You can initiate the \"Surf\" action by approaching a body of water. Travel to Sea Spirit's Den. It's in the north part of Azure Bay, which is a point on the far-left side of the map. Once you take the tram there, you'll wade into the water to activate the \"Surf\" HM and then surf over to the cave. Save before entering Sea Spirit's Den. Since the chances of you capturing the legendary bird are low, you'll want to save your progress right before entering the cave so that you can reload and try again if your Pokémon dies or if you run out of PokéBalls. Initiate the battle if necessary. In most cases, walking into Sea Spirit's Den and moving around a bit will trigger the fight, but you may have to navigate through a conversational prompt or dialogue option before the fight will begin. This is why it's important to save before you enter Sea Spirit's Den, as the fight may be triggered immediately after you enter the cave. Toss a Quick Ball at the bird. Even with the Quick Ball's high chances of catching a Pokémon on the first try, this will rarely be enough to catch a legendary bird; however, it's worth a shot. Get the bird down to under 10 HP. The way in which you do this will depend on the type of Pokémon that you use and the types of attacks that your legendary bird uses, but you'll generally want to err on the side of lower-damage attacks once the bird is under 50 percent health. Once you've knocked the bird's health down into a small sliver of red, you can proceed. Your chances of catching the bird increase as the bird's health decreases. If you accidentally defeat the bird, you'll need to reload your save and try again. Begin trying to catch the bird. For every turn that you get, toss a Dusk PokéBall at the bird. After you've had 31 turns, start using Timer Balls, as the extra .5x chance of catching a Pokémon will often give you the edge that you need. If you run out of PokéBalls before you can catch the bird, you'll need to reload your save and try again. Save your game once you catch the bird. Now that you've finally caught your legendary bird, you don't want all of your hard work to go to waste! Many of your lower-level Pokémon will level up after your catch the legendary bird.",
  "tyn_model":[
    "sea spirit",
    "pokémon",
    "bird",
    "dusk balls",
    "water",
    "quick ball",
    "legendary bird",
    "articuno",
    "fennekin",
    "zapdos",
    "sea spirit's",
    "pier",
    "sea spirit's den",
    "surf",
    "pokéballs"
  ],
  "tyn_section":[

  ]
}