{
  "title":"How to Make Hollywood Two Tone Cheesecake",
  "url":"https://www.wikihow.com/Make-Hollywood-Two-Tone-Cheesecake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies",
    "Cheesecake"
  ],
  "steps":[
    {
      "headline":"For the crust, combine graham cracker crumbs sugar melted butter and mix well.",
      "description":"Press into a greased 9–10 inch (22.9–25.4 cm) springform pan, bringing it up along the sides to about 1 inch (2.5 cm) from top of pan. Keep the crust in the refrigerator, or cool place, while preparing filling."
    },
    {
      "headline":"For the filling, combine the next four ingredients and beat until smooth with an electric mixer or heavy wooden spoon.",
      "description":"Pour into pan, spread until smooth and uniform over the crust."
    },
    {
      "headline":"Bake in preheated oven at 375 F (190 C) degrees for 20 minutes.",
      "description":"Remove from oven, place on cake rack, and let stand in room temperature for about 15 minutes. Raise oven temperature to 475 F (240 C) degrees."
    },
    {
      "headline":"About a minute or two before time is up, prepare the second part of the filling, using the final three ingredients (sour cream, sugar, vanilla).",
      "description":"Generously sprinkle cinnamon on top before the second filling is applied."
    },
    {
      "headline":"To prepare the second part of the filling, with a spoon, mix the ingredients only until well blended.",
      "description":"Pour over the cool baked first part of filling, starting from the side to center by tablespoonfuls. Spread evenly, as gently as possible. The whole top should be covered."
    },
    {
      "headline":"Bake in 475 F (240 C) degree oven for 10 minutes.",
      "description":"Remove from oven and let sit at room temperature for 5 to 6 hours."
    },
    {
      "headline":"Store in refrigerator and serve the next day.",
      "description":""
    },
    {
      "headline":"Cover with waxed paper before putting into the refrigerator, being careful not to let the waxed paper touch the topping.",
      "description":""
    }
  ],
  "text":" For the crust, combine graham cracker crumbs sugar melted butter and mix well. Press into a greased 9–10 inch (22.9–25.4 cm) springform pan, bringing it up along the sides to about 1 inch (2.5 cm) from top of pan. Keep the crust in the refrigerator, or cool place, while preparing filling. For the filling, combine the next four ingredients and beat until smooth with an electric mixer or heavy wooden spoon. Pour into pan, spread until smooth and uniform over the crust. Bake in preheated oven at 375 F (190 C) degrees for 20 minutes. Remove from oven, place on cake rack, and let stand in room temperature for about 15 minutes. Raise oven temperature to 475 F (240 C) degrees. About a minute or two before time is up, prepare the second part of the filling, using the final three ingredients (sour cream, sugar, vanilla). Generously sprinkle cinnamon on top before the second filling is applied. To prepare the second part of the filling, with a spoon, mix the ingredients only until well blended. Pour over the cool baked first part of filling, starting from the side to center by tablespoonfuls. Spread evenly, as gently as possible. The whole top should be covered. Bake in 475 F (240 C) degree oven for 10 minutes. Remove from oven and let sit at room temperature for 5 to 6 hours. Store in refrigerator and serve the next day.  Cover with waxed paper before putting into the refrigerator, being careful not to let the waxed paper touch the topping. ",
  "tyn_model":[
    "oven",
    "refrigerator",
    "waxed paper",
    "graham cracker crumbs",
    "butter",
    "springform pan",
    "electric mixer",
    "heavy wooden spoon",
    "cake rack",
    "sour cream",
    "sugar",
    "vanilla",
    "cinnamon",
    "spoon"
  ],
  "tyn_section":[

  ]
}