{
  "title":"How to Make Chili Oil",
  "url":"https://www.wikihow.com/Make-Chili-Oil",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "parts":[
    {
      "name":"Choosing Your Ingredients",
      "steps":[
        {
          "headline":"Choose your chilies.",
          "description":"All chilies are not created equal, so you have options when it comes to your chili oil ingredients. While Thai chilies are quite spicy, Ancho chilies will give your oil a smokier flavor. California chilies are very mild, and guajillo chilies have spice with a citrus tang. Make sure you do a bit of research before selecting the chilies you’ll use for your chili oil."
        },
        {
          "headline":"Select your oil.",
          "description":"Before deciding which oil to use for this recipe, you should determine that you’ll be using the chili oil for. If you’re going to be cooking with it, it’s great to use more neutral oils like vegetable or peanut oils. However, if you’re going to be using it as a topper for dishes, you might want to select something a bit more flavorful. In this case, a great olive oil or sesame oil can add an interesting flavor."
        },
        {
          "headline":"Experiment with flavors.",
          "description":"Once you’ve figured out this basic recipe, don’t be afraid to get creative. Try new chilies and new oils to create different types of chili oils. Once you’ve discovered which combinations you like most, you can officially create your own, homemade chili oil for every occasion."
        }
      ]
    },
    {
      "name":"Heating Your Ingredients",
      "steps":[
        {
          "headline":"Heat two tablespoons (29.57 mL) of oil.",
          "description":"For this recipe, you’ll want to use a small, heavy saucepan. Set your stovetop to medium heat. For now, you’ll only add this small portion of the oil to the pan. You don't need to get the oil sizzling – in fact, you definitely don't want to heat the oil this much. As soon as the oil is in the pan and the heat is turned on, you can move along to the next step."
        },
        {
          "headline":"Add the chili flakes and whole chilies.",
          "description":"Cook these in the oil, stirring continuously. Don’t walk away from the pan, because it will not take long for the chilies to be ready. Once they start lightly sizzling, you’re ready for the next step. If the chilies turn brown, you’ll need to start over. The key is to heat them up enough so that their flavors will seep into the oil, but not to fully cook them."
        },
        {
          "headline":"Pour in the rest of the oil.",
          "description":"You’ll want to leave it on the stovetop until the oil is warm, but don’t get it any hotter than that. To see if the chili oil is ready, touch it with your finger. Begin touching the oil as soon as you pour it into the pan, while it is still room temperature. Touch it every thirty seconds or so after that, to avoid allowing it to get hot. As soon as it is warm to touch, remove it from the heat. If you're worried you left your oil on the stove too long and it may have gotten hot, remove it from the heat and let it sit for a bit before touching it with your fingertip. However, you really want to avoid letting it ever get hot."
        }
      ]
    },
    {
      "name":"Storing Your Chili Oil",
      "steps":[
        {
          "headline":"Remove your oil from the stovetop.",
          "description":"As soon as you’ve tested the oil and have confirmed that it’s thoroughly warmed, you’re ready to remove the pan from heat. Let it sit as it cools down to room temperature."
        },
        {
          "headline":"Pour your cooled oil into a bottle.",
          "description":"You can purchase empty airtight bottles at most stores where kitchen supplies are sold. However, you can always clean out an empty bottle you have around the house. Repurpose an old olive oil bottle after thoroughly cleaning it with some water and dish soap. Shake your bottle of chili oil sporadically to make sure the chilies are distributed throughout the oil."
        },
        {
          "headline":"Test your oil before using it.",
          "description":"If you taste your homemade chili oil right after making it, it might taste pretty mild. However, the chilies will continue to release heat after you bottle it up. In other words, your chili oil can get gradually hotter the longer it sits! If you’re pouring it into a stir-fry, make sure you do a quick taste test first. Chili oil be stored from about 9 months to one year."
        }
      ]
    }
  ],
  "text":" Choosing Your Ingredients Choose your chilies. All chilies are not created equal, so you have options when it comes to your chili oil ingredients. While Thai chilies are quite spicy, Ancho chilies will give your oil a smokier flavor. California chilies are very mild, and guajillo chilies have spice with a citrus tang. Make sure you do a bit of research before selecting the chilies you’ll use for your chili oil. Select your oil. Before deciding which oil to use for this recipe, you should determine that you’ll be using the chili oil for. If you’re going to be cooking with it, it’s great to use more neutral oils like vegetable or peanut oils. However, if you’re going to be using it as a topper for dishes, you might want to select something a bit more flavorful. In this case, a great olive oil or sesame oil can add an interesting flavor. Experiment with flavors. Once you’ve figured out this basic recipe, don’t be afraid to get creative. Try new chilies and new oils to create different types of chili oils. Once you’ve discovered which combinations you like most, you can officially create your own, homemade chili oil for every occasion. Heating Your Ingredients Heat two tablespoons (29.57 mL) of oil. For this recipe, you’ll want to use a small, heavy saucepan. Set your stovetop to medium heat. For now, you’ll only add this small portion of the oil to the pan. You don't need to get the oil sizzling – in fact, you definitely don't want to heat the oil this much. As soon as the oil is in the pan and the heat is turned on, you can move along to the next step. Add the chili flakes and whole chilies. Cook these in the oil, stirring continuously. Don’t walk away from the pan, because it will not take long for the chilies to be ready. Once they start lightly sizzling, you’re ready for the next step. If the chilies turn brown, you’ll need to start over. The key is to heat them up enough so that their flavors will seep into the oil, but not to fully cook them. Pour in the rest of the oil. You’ll want to leave it on the stovetop until the oil is warm, but don’t get it any hotter than that. To see if the chili oil is ready, touch it with your finger. Begin touching the oil as soon as you pour it into the pan, while it is still room temperature. Touch it every thirty seconds or so after that, to avoid allowing it to get hot. As soon as it is warm to touch, remove it from the heat. If you're worried you left your oil on the stove too long and it may have gotten hot, remove it from the heat and let it sit for a bit before touching it with your fingertip. However, you really want to avoid letting it ever get hot. Storing Your Chili Oil Remove your oil from the stovetop. As soon as you’ve tested the oil and have confirmed that it’s thoroughly warmed, you’re ready to remove the pan from heat. Let it sit as it cools down to room temperature. Pour your cooled oil into a bottle. You can purchase empty airtight bottles at most stores where kitchen supplies are sold. However, you can always clean out an empty bottle you have around the house. Repurpose an old olive oil bottle after thoroughly cleaning it with some water and dish soap. Shake your bottle of chili oil sporadically to make sure the chilies are distributed throughout the oil. Test your oil before using it. If you taste your homemade chili oil right after making it, it might taste pretty mild. However, the chilies will continue to release heat after you bottle it up. In other words, your chili oil can get gradually hotter the longer it sits! If you’re pouring it into a stir-fry, make sure you do a quick taste test first. Chili oil be stored from about 9 months to one year.",
  "tyn_model":[
    "oil",
    "chili oil",
    "chilies",
    "olive oil",
    "ancho chilies",
    "sesame oil",
    "oils",
    "chili oils",
    "saucepan",
    "stovetop",
    "– in",
    "chili flakes",
    "stove",
    "bottle",
    "airtight bottles",
    "water",
    "dish soap",
    "stir-fry"
  ],
  "tyn_section":[

  ]
}