{
  "title":"How to Make Coffee Flan",
  "url":"https://www.wikihow.com/Make-Coffee-Flan",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Cooked Cream and Milk Desserts"
  ],
  "steps":[
    {
      "headline":"Pre-heat your oven to 315 degrees F, 160 degrees C, or on gas mark 2.5.",
      "description":""
    },
    {
      "headline":"Heat a pan over medium heat and mix the water and sugar in the pan together.",
      "description":"Stir constantly as the mixture turns brown. Remove the pan from the heat when it reaches a golden color."
    },
    {
      "headline":"Fill the aluminum cups with about a tablespoon of the caramel mixture.",
      "description":""
    },
    {
      "headline":"Heat a pan under medium heat and add the cream and milk to the pan.",
      "description":"Add the vanilla essence, coffee mixture, cinnamon stick, pods, and the condensed milk to the pan."
    },
    {
      "headline":"Wait until everything comes to a boil and then remove the pan from the heat.",
      "description":"Leave it on the side so the flavors mix together."
    },
    {
      "headline":"Whisk the eggs in a bowl Add the coffee sauce mixture a little at a time and stir it well each time.",
      "description":""
    },
    {
      "headline":"Sieve the mixture into another saucepan and stir the mixture with a whisk as the liquid drips into the pan.",
      "description":""
    },
    {
      "headline":"Line a roasting tray with a tea towel.",
      "description":"The tea towel will stabilize the cups and make sure they still in place."
    },
    {
      "headline":"Pour the mixture into a tall jug or container and pour it into the metal cups.",
      "description":"Leave about a centimeter at the top of each cup."
    },
    {
      "headline":"Add and cover about a third of the roasting tray with hot water.",
      "description":""
    },
    {
      "headline":"Place the roasting tray in the oven for 15 to 20 minutes.",
      "description":"Carefully shake them afterward to see if they have set."
    },
    {
      "headline":"Remove them from the oven and remove the metal cups from the tray for cooling.",
      "description":""
    },
    {
      "headline":"Throw out the water and discard the towel from the tray and place the cups back in.",
      "description":"Place the tray in the refrigerator for a few hours."
    },
    {
      "headline":"Wait until the flans have thoroughly chilled.",
      "description":"Take a knife and carefully go around the edges of each flan."
    },
    {
      "headline":"Remove the flans from the cups by turning them over on plates and lightly press down on them to ease out the flan.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Pre-heat your oven to 315 degrees F, 160 degrees C, or on gas mark 2.5.  Heat a pan over medium heat and mix the water and sugar in the pan together. Stir constantly as the mixture turns brown. Remove the pan from the heat when it reaches a golden color. Fill the aluminum cups with about a tablespoon of the caramel mixture.  Heat a pan under medium heat and add the cream and milk to the pan. Add the vanilla essence, coffee mixture, cinnamon stick, pods, and the condensed milk to the pan. Wait until everything comes to a boil and then remove the pan from the heat. Leave it on the side so the flavors mix together. Whisk the eggs in a bowl Add the coffee sauce mixture a little at a time and stir it well each time.  Sieve the mixture into another saucepan and stir the mixture with a whisk as the liquid drips into the pan.  Line a roasting tray with a tea towel. The tea towel will stabilize the cups and make sure they still in place. Pour the mixture into a tall jug or container and pour it into the metal cups. Leave about a centimeter at the top of each cup. Add and cover about a third of the roasting tray with hot water.  Place the roasting tray in the oven for 15 to 20 minutes. Carefully shake them afterward to see if they have set. Remove them from the oven and remove the metal cups from the tray for cooling.  Throw out the water and discard the towel from the tray and place the cups back in. Place the tray in the refrigerator for a few hours. Wait until the flans have thoroughly chilled. Take a knife and carefully go around the edges of each flan. Remove the flans from the cups by turning them over on plates and lightly press down on them to ease out the flan.  Finished. ",
  "tyn_model":[
    "oven",
    "pan",
    "roasting tray",
    "water",
    "tea towel",
    "tray",
    "sugar",
    "aluminum cups",
    "cream",
    "milk",
    "vanilla",
    "coffee",
    "cinnamon stick",
    "condensed milk",
    "eggs",
    "bowl",
    "coffee sauce",
    "saucepan",
    "whisk",
    "tall jug",
    "hot water",
    "towel",
    "refrigerator",
    "knife",
    "cups",
    "plates"
  ],
  "tyn_section":[

  ]
}