{
  "title":"How to Make Raspberry and Ginger Cheesecake",
  "url":"https://www.wikihow.com/Make-Raspberry-and-Ginger-Cheesecake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies",
    "Cheesecake"
  ],
  "steps":[
    {
      "headline":"Heat a small pan on the stove.",
      "description":"Melt the [Make Butter|butter]] over medium heat and remove from stove top."
    },
    {
      "headline":"Use a rolling pin to mash the biscuits into fine crumbs.",
      "description":"Add the crumbs to the melted butter and mix."
    },
    {
      "headline":"Scoop the biscuit/butter mixture into the tin and place it in the refrigerator for about an hour.",
      "description":""
    },
    {
      "headline":"Whip the cream in a bowl until it's firm, not stiff.",
      "description":"Add the caster sugar, mascarpone, and fromage frais to the bowl. Mix and blend everything well together."
    },
    {
      "headline":"Save a handful of raspberries on the side and use the rest of them in the mixture.",
      "description":"Continue whipping or mixing until the raspberries has combined well."
    },
    {
      "headline":"Remove the biscuit/butter mixture from the refrigerator and spoon the cream mixture on top of the chilled mixture.",
      "description":""
    },
    {
      "headline":"Place the tin back in the refrigerator for an extra 3 hours.",
      "description":""
    },
    {
      "headline":"Remove the tin from the cheesecake.",
      "description":""
    },
    {
      "headline":"Garnish with the reserved raspberries and serve.",
      "description":""
    }
  ],
  "text":" Heat a small pan on the stove. Melt the [Make Butter|butter]] over medium heat and remove from stove top. Use a rolling pin to mash the biscuits into fine crumbs. Add the crumbs to the melted butter and mix. Scoop the biscuit/butter mixture into the tin and place it in the refrigerator for about an hour.  Whip the cream in a bowl until it's firm, not stiff. Add the caster sugar, mascarpone, and fromage frais to the bowl. Mix and blend everything well together. Save a handful of raspberries on the side and use the rest of them in the mixture. Continue whipping or mixing until the raspberries has combined well. Remove the biscuit/butter mixture from the refrigerator and spoon the cream mixture on top of the chilled mixture.  Place the tin back in the refrigerator for an extra 3 hours.  Remove the tin from the cheesecake.  Garnish with the reserved raspberries and serve. ",
  "tyn_model":[
    "refrigerator",
    "raspberries",
    "butter",
    "cream",
    "bowl",
    "small pan",
    "rolling pin",
    "caster sugar",
    "mascarpone",
    "fromage frais",
    "biscuit/butter"
  ],
  "tyn_section":[

  ]
}