{
  "title":"How to Evolve Flabebe Into Floette and Florges",
  "url":"https://www.wikihow.com/Evolve-Flabebe-Into-Floette-and-Florges",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Pokemon Video Games"
  ],
  "steps":[
    {
      "headline":"Find a Flabebe by walking around in the flowers.",
      "description":"Flabebe can be found early, just after the 1st gym, to be specific. The color of her flower does not do anything, it is purely for cosmetics."
    },
    {
      "headline":"Train her to Level 19.",
      "description":"This should be done by before the 2nd gym. Using that, you will have evolved her into Floette. She does not learn any new moves upon evolution, though."
    },
    {
      "headline":"Find a Shiny Stone to evolve Floette into Florges.",
      "description":"To find a Shiny Stone, you will have to wait until you have beat the Shalour City gym leader, Korrina. Soon after, Calem or Serena (depending on the gender chosen at the beginning of the game) will give you HM04 Surf. This is a tool you need to claim your Shiny Stone."
    },
    {
      "headline":"Surf until you reach an island.",
      "description":"Although this is optional, before finding it, you have to battle a Backpacker with a Linoone. After battling him, go into the Baa De Mer Ranch, and on a ledge in one corner, you have gained your coveted Shiny Stone!"
    },
    {
      "headline":"Evolve Floette into Florges.",
      "description":""
    }
  ],
  "text":" Find a Flabebe by walking around in the flowers. Flabebe can be found early, just after the 1st gym, to be specific. The color of her flower does not do anything, it is purely for cosmetics. Train her to Level 19. This should be done by before the 2nd gym. Using that, you will have evolved her into Floette. She does not learn any new moves upon evolution, though. Find a Shiny Stone to evolve Floette into Florges. To find a Shiny Stone, you will have to wait until you have beat the Shalour City gym leader, Korrina. Soon after, Calem or Serena (depending on the gender chosen at the beginning of the game) will give you HM04 Surf. This is a tool you need to claim your Shiny Stone. Surf until you reach an island. Although this is optional, before finding it, you have to battle a Backpacker with a Linoone. After battling him, go into the Baa De Mer Ranch, and on a ledge in one corner, you have gained your coveted Shiny Stone! Evolve Floette into Florges. ",
  "tyn_model":[
    "flabebe",
    "surf",
    "florges",
    "linoone"
  ],
  "tyn_section":[

  ]
}