{
  "title":"How to Draw Final Fantasy Characters",
  "url":"https://www.wikihow.com/Draw-Final-Fantasy-Characters",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Games Drawing"
  ],
  "methods":[
    {
      "name":"Tifa Lockhart",
      "steps":[
        {
          "headline":"Near the topmost of the paper, draw a circle for the head.",
          "description":""
        },
        {
          "headline":"Below the circle, draw a curved spade shape for the chin and jaws.",
          "description":""
        },
        {
          "headline":"Within the circle and chin shape, draw a cross with two horizontal and parallel beams.",
          "description":"Adjust these lines to the direction to where you'd like the character to be facing."
        },
        {
          "headline":"Beneath these, draw a shape for Tifa's neck.",
          "description":""
        },
        {
          "headline":"Draw an oval stretched vertically (but slightly slanted) just below the neck.",
          "description":"This will be the guide for Tifa's torso. Draw a horizontal line in between the neck and the torso shapes. From this line, estimate the length between one shoulder to the other shoulder. Draw pipes and circles to represent joints and arms."
        },
        {
          "headline":"Draw a skirt-shaped outline beneath the oval.",
          "description":"Adjust the level of this skirt to where Tifa's hips should be."
        },
        {
          "headline":"Draw a long pipes and joints to represent Tifa's legs, joints and feet.",
          "description":""
        },
        {
          "headline":"Using the guide lines on her head, draw Tifa's facial details: eyes, mouth, nose, etc.",
          "description":""
        },
        {
          "headline":"Begin tracing her long hair.",
          "description":"Remember that Tifa's hair is tied near its tip."
        },
        {
          "headline":"Start tracing her body outlines.",
          "description":""
        },
        {
          "headline":"Add more details on her body and clothes.",
          "description":""
        },
        {
          "headline":"Draw more details on her accessories.",
          "description":""
        },
        {
          "headline":"Erase unnecessary lines.",
          "description":""
        },
        {
          "headline":"Color the drawing as desired.",
          "description":""
        }
      ]
    },
    {
      "name":"Cloud Strife",
      "steps":[
        {
          "headline":"Near the topmost of the paper, draw a circle for the head.",
          "description":""
        },
        {
          "headline":"Below the circle, draw a curved spade shape for the chin and jaws.",
          "description":""
        },
        {
          "headline":"Beneath these, draw a smaller shape for Cloud's neck.",
          "description":""
        },
        {
          "headline":"Draw a horizontal line below the neck.",
          "description":"Estimate its length for this will be the guide for his shoulders."
        },
        {
          "headline":"Draw an oval stretched vertically just below this horizontal line.",
          "description":"This will be the guide for Cloud's torso."
        },
        {
          "headline":"Starting from his shoulders, draw pipes and circles to represent joints, limbs and hands.",
          "description":""
        },
        {
          "headline":"Draw a pair of pipes below the octagon to represent his legs and feet.",
          "description":"Make the pipes that represent his thigh a bit bulgier."
        },
        {
          "headline":"Draw a vertical line at the center of the entire head and chin part.",
          "description":"Make three parallel horizontal lines that will intersect their middle with the vertical line. This will be the lines to guide the placement of Cloud's facial features."
        },
        {
          "headline":"Using these line guides, draw Cloud's facial details: eyes, mouth, nose, etc.",
          "description":""
        },
        {
          "headline":"For Cloud's spiky hair, draw long fringes or bangs that \"claws\" forward.",
          "description":"Make one of the spiky hair stand diagonally upward and have bigger volume than the rest. One of his hair's volume also points downward."
        },
        {
          "headline":"Begin tracing the outline of cloud's body.",
          "description":""
        },
        {
          "headline":"Add details on his clothes, arms and accessory.",
          "description":""
        },
        {
          "headline":"Add details on his pants and shoes.",
          "description":""
        },
        {
          "headline":"Erase unnecessary lines.",
          "description":""
        },
        {
          "headline":"For the sword, draw a short line by his hand.",
          "description":"Add outline for his signature buster sword."
        },
        {
          "headline":"Add details for Cloud's buster sword.",
          "description":""
        },
        {
          "headline":"Erase unnecessary lines.",
          "description":""
        },
        {
          "headline":"Color the drawing as desired.",
          "description":""
        }
      ]
    }
  ],
  "text":" Tifa Lockhart Near the topmost of the paper, draw a circle for the head.  Below the circle, draw a curved spade shape for the chin and jaws.  Within the circle and chin shape, draw a cross with two horizontal and parallel beams. Adjust these lines to the direction to where you'd like the character to be facing. Beneath these, draw a shape for Tifa's neck.  Draw an oval stretched vertically (but slightly slanted) just below the neck. This will be the guide for Tifa's torso. Draw a horizontal line in between the neck and the torso shapes. From this line, estimate the length between one shoulder to the other shoulder. Draw pipes and circles to represent joints and arms. Draw a skirt-shaped outline beneath the oval. Adjust the level of this skirt to where Tifa's hips should be. Draw a long pipes and joints to represent Tifa's legs, joints and feet.  Using the guide lines on her head, draw Tifa's facial details: eyes, mouth, nose, etc.  Begin tracing her long hair. Remember that Tifa's hair is tied near its tip. Start tracing her body outlines.  Add more details on her body and clothes.  Draw more details on her accessories.  Erase unnecessary lines.  Color the drawing as desired.  Cloud Strife Near the topmost of the paper, draw a circle for the head.  Below the circle, draw a curved spade shape for the chin and jaws.  Beneath these, draw a smaller shape for Cloud's neck.  Draw a horizontal line below the neck. Estimate its length for this will be the guide for his shoulders. Draw an oval stretched vertically just below this horizontal line. This will be the guide for Cloud's torso. Starting from his shoulders, draw pipes and circles to represent joints, limbs and hands.  Draw a pair of pipes below the octagon to represent his legs and feet. Make the pipes that represent his thigh a bit bulgier. Draw a vertical line at the center of the entire head and chin part. Make three parallel horizontal lines that will intersect their middle with the vertical line. This will be the lines to guide the placement of Cloud's facial features. Using these line guides, draw Cloud's facial details: eyes, mouth, nose, etc.  For Cloud's spiky hair, draw long fringes or bangs that \"claws\" forward. Make one of the spiky hair stand diagonally upward and have bigger volume than the rest. One of his hair's volume also points downward. Begin tracing the outline of cloud's body.  Add details on his clothes, arms and accessory.  Add details on his pants and shoes.  Erase unnecessary lines.  For the sword, draw a short line by his hand. Add outline for his signature buster sword. Add details for Cloud's buster sword.  Erase unnecessary lines.  Color the drawing as desired. ",
  "tyn_model":[
    "pipes",
    "cloud",
    "paper",
    "spade",
    "sword"
  ],
  "tyn_section":[

  ]
}