{
  "title":"How to Draw a Stegosaurus",
  "url":"https://www.wikihow.com/Draw-a-Stegosaurus",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "methods":[
    {
      "name":"Cartoon Stegosaurus",
      "steps":[
        {
          "headline":"Draw a large circle near the right side of the paper.",
          "description":""
        },
        {
          "headline":"Draw a smaller circle intersecting by the right side of the bigger circle.",
          "description":"This will be the guide for its nose."
        },
        {
          "headline":"Draw a lightly stretched circle (vertically) below and just touching the large circle.",
          "description":""
        },
        {
          "headline":"From this latest drawn circle, draw a large horizontal oval by the left side of it, still just touching each other.",
          "description":""
        },
        {
          "headline":"For the tail, attach a small circle on the other side of this large oval.",
          "description":"By this new circle, attach a long isosceles triangle, followed by a smaller circle and triangle."
        },
        {
          "headline":"Draw four polygons below the oval to represent the legs.",
          "description":""
        },
        {
          "headline":"Back at the circle that represent the head, draw a slightly curved horizontal line across the center of it.",
          "description":"The little circle that represent its nose should be below the level of this line."
        },
        {
          "headline":"Start tracing the body outline of this stegosaurus.",
          "description":""
        },
        {
          "headline":"Draw its eyes and mouth.",
          "description":""
        },
        {
          "headline":"Add a series of pentagon shaped plates at its back.",
          "description":"At the very tip of its tail, draw pairs of claw-like spikes. Add details on its feet."
        },
        {
          "headline":"Evaluate and polish drawing details.",
          "description":""
        },
        {
          "headline":"Erase unnecessary lines.",
          "description":""
        },
        {
          "headline":"Add skin details like spots of different sizes.",
          "description":""
        },
        {
          "headline":"Color the drawing as desired.",
          "description":""
        }
      ]
    },
    {
      "name":"Regular Stegosaurus",
      "steps":[
        {
          "headline":"Draw a small circle near the right side of the paper.",
          "description":""
        },
        {
          "headline":"Draw a bigger horizontal oval intersecting this circle from its left side.",
          "description":"This will be the guide for its neck."
        },
        {
          "headline":"Draw a larger diagonal oval attached to the left side of previous oval.",
          "description":""
        },
        {
          "headline":"For the tail, draw a long isosceles triangle, with its base attached at the left side of the largest oval.",
          "description":""
        },
        {
          "headline":"Draw four polygons below the oval to represent the legs.",
          "description":"Add small circles beneath each of these legs."
        },
        {
          "headline":"Start tracing the body outline of this stegosaurus.",
          "description":""
        },
        {
          "headline":"Add a series of pentagon shaped plates at its back--small pairs of plates from its neck and getting bigger towards the thigh part, and getting smaller again towards the tail.",
          "description":"At the very tip of its tail, draw two pairs of claw-like spikes."
        },
        {
          "headline":"Add details on its feet and trace the stegosaurus' mouth, nose and eyes.",
          "description":""
        },
        {
          "headline":"Evaluate and polish drawing details.",
          "description":""
        },
        {
          "headline":"Add line dashes as detail to the stegosaurus' back plates.",
          "description":""
        },
        {
          "headline":"Add skin details.",
          "description":"Since dinosaurs were reptiles, make it somewhat scaly and leathery."
        },
        {
          "headline":"Erase unnecessary lines.",
          "description":""
        },
        {
          "headline":"Color the drawing as desired.",
          "description":""
        }
      ]
    }
  ],
  "text":" Cartoon Stegosaurus Draw a large circle near the right side of the paper.  Draw a smaller circle intersecting by the right side of the bigger circle. This will be the guide for its nose. Draw a lightly stretched circle (vertically) below and just touching the large circle.  From this latest drawn circle, draw a large horizontal oval by the left side of it, still just touching each other.  For the tail, attach a small circle on the other side of this large oval. By this new circle, attach a long isosceles triangle, followed by a smaller circle and triangle. Draw four polygons below the oval to represent the legs.  Back at the circle that represent the head, draw a slightly curved horizontal line across the center of it. The little circle that represent its nose should be below the level of this line. Start tracing the body outline of this stegosaurus.  Draw its eyes and mouth.  Add a series of pentagon shaped plates at its back. At the very tip of its tail, draw pairs of claw-like spikes. Add details on its feet. Evaluate and polish drawing details.  Erase unnecessary lines.  Add skin details like spots of different sizes.  Color the drawing as desired.  Regular Stegosaurus Draw a small circle near the right side of the paper.  Draw a bigger horizontal oval intersecting this circle from its left side. This will be the guide for its neck. Draw a larger diagonal oval attached to the left side of previous oval.  For the tail, draw a long isosceles triangle, with its base attached at the left side of the largest oval.  Draw four polygons below the oval to represent the legs. Add small circles beneath each of these legs. Start tracing the body outline of this stegosaurus.  Add a series of pentagon shaped plates at its back--small pairs of plates from its neck and getting bigger towards the thigh part, and getting smaller again towards the tail. At the very tip of its tail, draw two pairs of claw-like spikes. Add details on its feet and trace the stegosaurus' mouth, nose and eyes.  Evaluate and polish drawing details.  Add line dashes as detail to the stegosaurus' back plates.  Add skin details. Since dinosaurs were reptiles, make it somewhat scaly and leathery. Erase unnecessary lines.  Color the drawing as desired. ",
  "tyn_model":[
    "stegosaurus",
    "plates",
    "paper",
    "isosceles triangle",
    "dinosaurs"
  ],
  "tyn_section":[

  ]
}