{
  "title":"How to Prepare Kreplach",
  "url":"https://www.wikihow.com/Prepare-Kreplach",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Pasta and Noodles"
  ],
  "steps":[
    {
      "headline":"Heat frying pan over medium heat, add 2 Tbsp of oil.",
      "description":""
    },
    {
      "headline":"When warm, add the sliced onions and sauté until translucent.",
      "description":""
    },
    {
      "headline":"Cut the cooled brisket into chunks and put with the sautéed onions into the bowl of a food processor.",
      "description":""
    },
    {
      "headline":"Grind the brisket until the meat has the consistency of ground beef.",
      "description":"If needed, add a little sauce from the brisket to make the filling moist enough to handle. Set aside."
    },
    {
      "headline":"In a separate bowl, combine the flour, eggs, salt and 6 Tbsp of oil.",
      "description":"Knead well. Once the dough starts to come together dump it out onto a floured surface and continue kneading until the dough becomes workable and firm."
    },
    {
      "headline":"Roll the dough out to about 1/4″ thickness then using a water-glass or a biscuit cutter, cut the dough into circles.",
      "description":""
    },
    {
      "headline":"Fill each circle with about a tablespoon of the brisket filling, then fold dough to make a semi-circle and pinch all seams well.",
      "description":""
    },
    {
      "headline":"Drop the kreplach into a pot of boiling water and cook until the kreplach float to the surface.",
      "description":"Add a Tablespoon of kosher salt to the water and also let the kreplach boil in the water for an additional couple of minutes after they floated to the surface."
    },
    {
      "headline":"Place 3 kreplach in a bowl of hot chicken broth and serve garnish with a pinch of fresh dill.",
      "description":""
    }
  ],
  "text":" Heat frying pan over medium heat, add 2 Tbsp of oil.  When warm, add the sliced onions and sauté until translucent.  Cut the cooled brisket into chunks and put with the sautéed onions into the bowl of a food processor.  Grind the brisket until the meat has the consistency of ground beef. If needed, add a little sauce from the brisket to make the filling moist enough to handle. Set aside. In a separate bowl, combine the flour, eggs, salt and 6 Tbsp of oil. Knead well. Once the dough starts to come together dump it out onto a floured surface and continue kneading until the dough becomes workable and firm. Roll the dough out to about 1/4″ thickness then using a water-glass or a biscuit cutter, cut the dough into circles.  Fill each circle with about a tablespoon of the brisket filling, then fold dough to make a semi-circle and pinch all seams well.  Drop the kreplach into a pot of boiling water and cook until the kreplach float to the surface. Add a Tablespoon of kosher salt to the water and also let the kreplach boil in the water for an additional couple of minutes after they floated to the surface. Place 3 kreplach in a bowl of hot chicken broth and serve garnish with a pinch of fresh dill. ",
  "tyn_model":[
    "water",
    "oil",
    "onions",
    "bowl",
    "frying pan",
    "food processor",
    "brisket",
    "flour",
    "eggs",
    "salt",
    "water-glass",
    "biscuit cutter",
    "pot",
    "kosher salt",
    "hot chicken broth",
    "dill"
  ],
  "tyn_section":[

  ]
}