{
  "title":"How to Brighten up Your Living Room",
  "url":"https://www.wikihow.com/Brighten-up-Your-Living-Room",
  "category_hierarchy":[
    "Home and Garden",
    "Home Decorating"
  ],
  "steps":[
    {
      "headline":"Paint your living room a different color!",
      "description":"It's a major change, but it's a certain way to give new attention to an old, boring room. For a big living room, you can paint all of the walls a color, but if you are living in a smaller house you can choose one wall to paint and keep the others white so the new color will not be so overpowering."
    },
    {
      "headline":"Buy  cushions that are soft, silky or fluffy!",
      "description":"Buy them so that they match the color scheme in your living room."
    },
    {
      "headline":"Purchase  modern, cool vases and some  flowers to go along with them.",
      "description":"Purchase silk flowers that are realistic and match the vibe of the room. You can get these from most places. They don't need watering and they look nice."
    },
    {
      "headline":"Find some nice picture frames, and fill them with family pictures or interesting pieces of modern art.",
      "description":""
    },
    {
      "headline":"Purchase a small basket that looks nice and can sit somewhere in the room and hold magazines and newspapers to minimize the clutter.",
      "description":""
    },
    {
      "headline":"Get some nice candles!",
      "description":"You would be surprised how pretty that some candles and candle holders are. Why do you need to buy boring, plain, simple candles? To add an extra touch of luxury, buy scented candles."
    },
    {
      "headline":"Finish  with a stylish, modern lamp to really brighten up your living room!",
      "description":""
    }
  ],
  "text":" Paint your living room a different color! It's a major change, but it's a certain way to give new attention to an old, boring room. For a big living room, you can paint all of the walls a color, but if you are living in a smaller house you can choose one wall to paint and keep the others white so the new color will not be so overpowering. Buy  cushions that are soft, silky or fluffy! Buy them so that they match the color scheme in your living room. Purchase  modern, cool vases and some  flowers to go along with them. Purchase silk flowers that are realistic and match the vibe of the room. You can get these from most places. They don't need watering and they look nice. Find some nice picture frames, and fill them with family pictures or interesting pieces of modern art.  Purchase a small basket that looks nice and can sit somewhere in the room and hold magazines and newspapers to minimize the clutter.  Get some nice candles! You would be surprised how pretty that some candles and candle holders are. Why do you need to buy boring, plain, simple candles? To add an extra touch of luxury, buy scented candles. Finish  with a stylish, modern lamp to really brighten up your living room! ",
  "tyn_model":[
    "candles",
    "cushions",
    "vases",
    "flowers",
    "silk flowers",
    "picture frames",
    "basket",
    "candle holders",
    "scented candles",
    "lamp"
  ],
  "tyn_section":[

  ]
}