{
  "title":"How to Make a Fabric Flower Bouquet",
  "url":"https://www.wikihow.com/Make-a-Fabric-Flower-Bouquet",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts",
    "Leaf and Flower Crafts"
  ],
  "steps":[
    {
      "headline":"Cut plain pink fabric.",
      "description":"Measure it into a strip, at about 12 centimeter (4.7 in) by 70 centimeter (27.6 in)."
    },
    {
      "headline":"Iron the fabric.",
      "description":"Fold it in half along the length and iron it again."
    },
    {
      "headline":"Roll the fabric into a flower formation.",
      "description":"Gather roll-ups and form a flower with the fabric."
    },
    {
      "headline":"Secure the fabric with an elastic band.",
      "description":""
    },
    {
      "headline":"Cut your gardening wire to 35 centimeter (13.8 in).",
      "description":"Feed it through the centre of the fabric flower."
    },
    {
      "headline":"Use your pliers to turn the end of the wire round into a swirl.",
      "description":"Pull the wire through the fabric flower."
    },
    {
      "headline":"Cut the dark green felt into 10 centimeter (3.9 in) x 10 centimeter (3.9 in) squares.",
      "description":""
    },
    {
      "headline":"Use a glue gun along the outside of the felt square.",
      "description":"Wrap it around the fabric flower."
    },
    {
      "headline":"Repeat this for all your roses, around 14 in total.",
      "description":""
    },
    {
      "headline":"Bunch the flowers together, starting with the larger roses in the centre.",
      "description":"Once all the flowers are gathered together, twist the wires together and bend them in half to create a handle."
    },
    {
      "headline":"Bind them together with gaffer tape.",
      "description":"Using a large piece of light green felt, cover the handle by wrapping the felt around the bouquet."
    },
    {
      "headline":"Fold the corners of the felt back to create leaves",
      "description":""
    },
    {
      "headline":"Cut the green fabric ribbon to a 30 centimeter (11.8 in) piece and tie it round the outside into a lovely bow.",
      "description":""
    }
  ],
  "text":" Cut plain pink fabric. Measure it into a strip, at about 12 centimeter (4.7 in) by 70 centimeter (27.6 in). Iron the fabric. Fold it in half along the length and iron it again. Roll the fabric into a flower formation. Gather roll-ups and form a flower with the fabric. Secure the fabric with an elastic band.  Cut your gardening wire to 35 centimeter (13.8 in). Feed it through the centre of the fabric flower. Use your pliers to turn the end of the wire round into a swirl. Pull the wire through the fabric flower. Cut the dark green felt into 10 centimeter (3.9 in) x 10 centimeter (3.9 in) squares.  Use a glue gun along the outside of the felt square. Wrap it around the fabric flower. Repeat this for all your roses, around 14 in total.  Bunch the flowers together, starting with the larger roses in the centre. Once all the flowers are gathered together, twist the wires together and bend them in half to create a handle. Bind them together with gaffer tape. Using a large piece of light green felt, cover the handle by wrapping the felt around the bouquet. Fold the corners of the felt back to create leaves  Cut the green fabric ribbon to a 30 centimeter (11.8 in) piece and tie it round the outside into a lovely bow. ",
  "tyn_model":[
    "fabric",
    "iron",
    "elastic band",
    "gardening wire",
    "pliers",
    "wire",
    "glue gun",
    "roses",
    "gaffer tape",
    "green fabric ribbon"
  ],
  "tyn_section":[

  ]
}