{
  "title":"How to Make Vodka Gummy Bear Popsicles",
  "url":"https://www.wikihow.com/Make-Vodka-Gummy-Bear-Popsicles",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Jelly Candy"
  ],
  "steps":[
    {
      "headline":"Soak gummy bears in a bowl of vodka for at least 8 to 12 hours.",
      "description":"The amount of bears you use depends on the number of popsicles you’d like to make. However, you can still enjoy the vodka soaked bears even if they don’t make it into the popsicle mold. Keep soaking the bears in a cool, dry spot in the kitchen, preferably covered with plastic wrap. If you have curious pets who can jump on the counter, be on the safe side and keep these puppies well covered and away from interested cats, dogs or even kids."
    },
    {
      "headline":"Drain vodka from bowl.",
      "description":"There are a few ways you can do this:\nPour bowl of soaking bears into a strainer and allow the vodka to run down the drain  (which would be a pity to waste all that good vodka). Set a strainer over a large bowl so you can capture the vodka in the bowl and re-use for drinks later. The vodka may be flavored so you won’t want to return it to its original container."
    },
    {
      "headline":"Spray your popsicle trays or cups lightly with non stick spray.",
      "description":"Don't overdo it, but simply coat the inside of the tray or cup so your pop is easy to remove once frozen."
    },
    {
      "headline":"Make lemonade drink base and pour into popsicle trays or cups.",
      "description":"Fill cups or trays approximately ¾ of the way with drink base."
    },
    {
      "headline":"Add vodka-infused gummy bears to each popsicle.",
      "description":"Use approximately 5 gummy bears per popsicle. Push bears down toward the bottom of the mold using a chopstick. Don’t overload the popsicle as it could create problems with the freezing process."
    },
    {
      "headline":"Add a popsicle stick to each mold.",
      "description":"If you are using a cup, you may need to tape toothpicks to your stick and prop the stick in place on the sides of the cup."
    },
    {
      "headline":"Freeze popsicles overnight or for at least 8 hours.",
      "description":"Consider adding a light covering of plastic wrap to protect your pops from any foul odors in the freezer."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Soak gummy bears in a bowl of vodka for at least 8 to 12 hours. The amount of bears you use depends on the number of popsicles you’d like to make. However, you can still enjoy the vodka soaked bears even if they don’t make it into the popsicle mold. Keep soaking the bears in a cool, dry spot in the kitchen, preferably covered with plastic wrap. If you have curious pets who can jump on the counter, be on the safe side and keep these puppies well covered and away from interested cats, dogs or even kids. Drain vodka from bowl. There are a few ways you can do this:\nPour bowl of soaking bears into a strainer and allow the vodka to run down the drain  (which would be a pity to waste all that good vodka). Set a strainer over a large bowl so you can capture the vodka in the bowl and re-use for drinks later. The vodka may be flavored so you won’t want to return it to its original container. Spray your popsicle trays or cups lightly with non stick spray. Don't overdo it, but simply coat the inside of the tray or cup so your pop is easy to remove once frozen. Make lemonade drink base and pour into popsicle trays or cups. Fill cups or trays approximately ¾ of the way with drink base. Add vodka-infused gummy bears to each popsicle. Use approximately 5 gummy bears per popsicle. Push bears down toward the bottom of the mold using a chopstick. Don’t overload the popsicle as it could create problems with the freezing process. Add a popsicle stick to each mold. If you are using a cup, you may need to tape toothpicks to your stick and prop the stick in place on the sides of the cup. Freeze popsicles overnight or for at least 8 hours. Consider adding a light covering of plastic wrap to protect your pops from any foul odors in the freezer. Finished. ",
  "tyn_model":[
    "vodka",
    "bowl",
    "plastic wrap",
    "strainer",
    "popsicle trays",
    "non stick spray",
    "tray",
    "lemonade drink base",
    "gummy bears",
    "popsicle stick",
    "popsicles",
    "freezer"
  ],
  "tyn_section":[

  ]
}