{
  "title":"How to Draw Chevrons",
  "url":"https://www.wikihow.com/Draw-Chevrons",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Shapes",
    "Drawing Patterns and Prints"
  ],
  "methods":[
    {
      "name":"Horizontal Chevrons",
      "steps":[
        {
          "headline":"Draw a series of equally distanced vertical lines.",
          "description":""
        },
        {
          "headline":"Draw a series of equally distanced horizontal lines, intersecting the vertical lines.",
          "description":"This should form a series of squares resembling a chess board."
        },
        {
          "headline":"Repeat the previous steps, this time splitting the previous squares into smaller squares.",
          "description":"However, leave the topmost and leftmost side undivided (leaving them as rectangles)."
        },
        {
          "headline":"Make zigzag patterns on the topmost rectangles.",
          "description":"Do this by tracing lines connecting the low-left corner to the top-right corner, then diagonally down to where the squares intersect, then diagonally up again to the next corner, and so forth. You should see right triangles being formed. It is helpful if you utilize these little squares to form your pattern."
        },
        {
          "headline":"Repeat the zigzag pattern, following a horizontal pattern.",
          "description":""
        },
        {
          "headline":"Think of the vertical lines as having a designated letter (A, B, C, D, E, F, etc.)",
          "description":"Remove the vertical lines B, D, F and so forth, following this pattern of alternating erasures."
        },
        {
          "headline":"Carefully erase horizontal lines.",
          "description":"By now you would have chevrons pointing upward."
        },
        {
          "headline":"Finalize the pattern as you like.",
          "description":"If you desire to have a continuous zigzag pattern of chevrons, remove all vertical and horizontal lines. Alternately color in-between zigzag lines."
        },
        {
          "headline":"Color further the drawing as desired.",
          "description":""
        }
      ]
    },
    {
      "name":"Vertical Chevrons",
      "steps":[
        {
          "headline":"Draw a series of equally distanced horizontal lines.",
          "description":""
        },
        {
          "headline":"Draw a series of equally distanced vertical lines, intersecting the vertical lines.",
          "description":"This should form a series of horizontal rectangles."
        },
        {
          "headline":"Draw another series of vertical lines in between the rectangles.",
          "description":"This should form a series of squares resembling a chess board."
        },
        {
          "headline":"Make vertical zigzag patterns, moving from one corner to another corner of these square diagonally.",
          "description":"You should see right triangles being formed."
        },
        {
          "headline":"Repeat the pattern all throughout.",
          "description":""
        },
        {
          "headline":"Remove the vertical and horizontal lines.",
          "description":"Alternately color in-between zigzag lines, or add other details as desired."
        }
      ]
    }
  ],
  "text":" Horizontal Chevrons Draw a series of equally distanced vertical lines.  Draw a series of equally distanced horizontal lines, intersecting the vertical lines. This should form a series of squares resembling a chess board. Repeat the previous steps, this time splitting the previous squares into smaller squares. However, leave the topmost and leftmost side undivided (leaving them as rectangles). Make zigzag patterns on the topmost rectangles. Do this by tracing lines connecting the low-left corner to the top-right corner, then diagonally down to where the squares intersect, then diagonally up again to the next corner, and so forth. You should see right triangles being formed. It is helpful if you utilize these little squares to form your pattern. Repeat the zigzag pattern, following a horizontal pattern.  Think of the vertical lines as having a designated letter (A, B, C, D, E, F, etc.) Remove the vertical lines B, D, F and so forth, following this pattern of alternating erasures. Carefully erase horizontal lines. By now you would have chevrons pointing upward. Finalize the pattern as you like. If you desire to have a continuous zigzag pattern of chevrons, remove all vertical and horizontal lines. Alternately color in-between zigzag lines. Color further the drawing as desired.  Vertical Chevrons Draw a series of equally distanced horizontal lines.  Draw a series of equally distanced vertical lines, intersecting the vertical lines. This should form a series of horizontal rectangles. Draw another series of vertical lines in between the rectangles. This should form a series of squares resembling a chess board. Make vertical zigzag patterns, moving from one corner to another corner of these square diagonally. You should see right triangles being formed. Repeat the pattern all throughout.  Remove the vertical and horizontal lines. Alternately color in-between zigzag lines, or add other details as desired.",
  "tyn_model":[
    "chess board"
  ],
  "tyn_section":[

  ]
}