{
  "title":"How to Make Poached Pears in Wine",
  "url":"https://www.wikihow.com/Make-Poached-Pears-in-Wine",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "steps":[
    {
      "headline":"Imagine that the pears are in the pan and pour enough wine to that amount.",
      "description":"Do not place the pears in the pan at this time."
    },
    {
      "headline":"Place the vanilla, sugar, and cinnamon stick into the pan and place the lid on.",
      "description":""
    },
    {
      "headline":"Let the wine mixture become to a simmer.",
      "description":""
    },
    {
      "headline":"Use a vegetable peeler and peel the skins off from the pears.",
      "description":"Leave the stalks on (the \"sticks\" on top)."
    },
    {
      "headline":"Turn down the heat and place the pears carefully in the pan.",
      "description":"Let the pears cook for 2 hours (or until the pears are very soft) at a very low temperature."
    },
    {
      "headline":"Place the pears on a cutting board.",
      "description":""
    },
    {
      "headline":"Heat the wine mixture back to a boil on medium heat.",
      "description":"Make sure that your result is a thickened \"sauce\" or mixture."
    },
    {
      "headline":"Cut the bottom of each pear.",
      "description":"This allows them to stand up on their own."
    },
    {
      "headline":"Serve the pears with the stalk up.",
      "description":"Drizzle the wine mixture over the pears."
    }
  ],
  "text":" Imagine that the pears are in the pan and pour enough wine to that amount. Do not place the pears in the pan at this time. Place the vanilla, sugar, and cinnamon stick into the pan and place the lid on.  Let the wine mixture become to a simmer.  Use a vegetable peeler and peel the skins off from the pears. Leave the stalks on (the \"sticks\" on top). Turn down the heat and place the pears carefully in the pan. Let the pears cook for 2 hours (or until the pears are very soft) at a very low temperature. Place the pears on a cutting board.  Heat the wine mixture back to a boil on medium heat. Make sure that your result is a thickened \"sauce\" or mixture. Cut the bottom of each pear. This allows them to stand up on their own. Serve the pears with the stalk up. Drizzle the wine mixture over the pears.",
  "tyn_model":[
    "wine",
    "vanilla",
    "sugar",
    "cinnamon",
    "vegetable peeler",
    "pan",
    "cutting board",
    "sauce"
  ],
  "tyn_section":[

  ]
}