{
  "title":"How to Halve a Recipe",
  "url":"https://www.wikihow.com/Halve-a-Recipe",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "methods":[
    {
      "name":"Following Rules for Reducing Recipes by Half",
      "steps":[
        {
          "headline":"Decide which recipes should be halved.",
          "description":"While most recipes can be halved, recipes that use yeast should often be left. If you can't easily halve a recipe, consider baking a full portion and freezing half or giving some away. Keep in mind that it's easy to halve most cooking recipes. For example, a delicate souffle might not rise properly if you halve the ingredients, but it's easy to halve the ingredients for a batch of cookies."
        },
        {
          "headline":"Cut all of the ingredients in half.",
          "description":"To halve a recipe, it's important to reduce each ingredient by half. This ensures that the ratios of the recipe are the same as for the original recipe. Tip: If you struggle with figuring out how to halve ingredients, search for easy to print kitchen charts that show common conversions. For example, if a recipe calls for 4 cups (950 ml) of stock, 2 cups (250 g) of chicken, 1 carrot, and 1/2 cup (15 g) of fresh parsley, you'd use 2 cups (470 ml) of stock, 1 cup (125 g) of chicken, 1/2 of a carrot, and 1/4 cup (7.5 g) of fresh parsley."
        },
        {
          "headline":"Rewrite the reduced recipe so it's easier to follow.",
          "description":"If you're making adjustments to a recipe that only has 2 or 3 ingredients, you might not need to do this. However, if you're halving a recipe with a long list of ingredients, take the time to write out the recipe with the reduced amounts. This will prevent you from forgetting and accidentally adding too much of an ingredient."
        },
        {
          "headline":"Follow the recipe's directions.",
          "description":"Once you've scaled down all of the ingredients by half, you're ready to follow the recipe. You don't need to make any adjustments to the method of assembling the ingredients, although you may need to change pan sizes for baking. For example, if you're marinating beef for a stew and you've already marinated half of the beef in the reduced marinade, follow the recipe's instructions to sear the meat. Then add the rest of the ingredients and simmer the stew."
        },
        {
          "headline":"Cook the recipe at the directed temperature.",
          "description":"Even though you're cutting the ingredients in half, you don't need to change the cooking temperature. Reducing the oven temperature could mean that the food wouldn't cook fast enough and could cause foodborne illness. Raising the oven temperature could cause the food to brown quickly or even burn. For example, if you're supposed to sauté chopped onions over medium heat for 8 to 10 minutes, you'll still need to keep the heat at medium. The only time you might need to adjust the temperature is if you're using a glass baking dish instead of a metal one. In this case, reduce the oven temperature by 25 degrees."
        },
        {
          "headline":"Check the food halfway through the cooking time.",
          "description":"If you are baking half a recipe in a dish that is of half its original size, you might need to reduce the cooking time, as well. Begin checking the food halfway through the cooking time. It probably won't be done just yet, but check it every few minutes after this point. Keep in mind that if you're cutting the number of something, such as cookies or cupcakes, they'll still need to bake for the recommended time. For example, if you're baking brownies, begin checking them at 20 minutes instead of 40 minutes, especially if you don't adjust the pan size."
        }
      ]
    },
    {
      "name":"Scaling Down Baked Goods",
      "steps":[
        {
          "headline":"Whisk an egg and measure it to get half an egg.",
          "description":"If you have a recipe that calls for 1 egg, avoid using just the white or the yolk. Instead, crack the egg into a bowl and whisk it until the white and yolk are combined. Then measure out half of the liquid egg to use in your recipe. Tip: Although the amount of egg will depend on the size of the egg, half of a large beaten egg is about 2 tablespoons (30 ml). If you don't feel like wasting the remaining half of the egg, consider using an egg substitute that comes in a carton instead."
        },
        {
          "headline":"Weigh your ingredients for the best results.",
          "description":"Sometimes when you halve ingredients, you'll get an awkward measurement, such as 5/6 of a cup. If this happens, consider using the metric system and weigh the ingredients. This will make it much simpler to simply use half of the amount. For example, if you're making bread and the recipe calls for 3 2/3 cup of flour weigh it to find the metric amount, which is 458 g. Then divide that by 2 to get 229 g.\nThis is important to do if you're unsure how much is in a package. For example, if your recipe calls for a package of dry pudding, don't eyeball half of it. Weigh it instead for the most accurate results."
        },
        {
          "headline":"Adjust the pan size by volume.",
          "description":"When you're halving a casserole, cake, brownies, or something that will fill an entire dish, use a smaller pan. Figure out the volume of the dish the recipe recommends and then use a dish with half the volume. Using the right size pan will ensure that the food bakes properly. For example, if you want to halve a brownie recipe that's originally baked in a 9 in × 13 in (23 cm × 33 cm) pan, use an 8 in × 8 in (20 cm × 20 cm) pan instead. This will prevent the brownies from being too thin, which would cause them to be crispy or dry."
        }
      ]
    }
  ],
  "text":" Following Rules for Reducing Recipes by Half Decide which recipes should be halved. While most recipes can be halved, recipes that use yeast should often be left. If you can't easily halve a recipe, consider baking a full portion and freezing half or giving some away. Keep in mind that it's easy to halve most cooking recipes. For example, a delicate souffle might not rise properly if you halve the ingredients, but it's easy to halve the ingredients for a batch of cookies. Cut all of the ingredients in half. To halve a recipe, it's important to reduce each ingredient by half. This ensures that the ratios of the recipe are the same as for the original recipe. Tip: If you struggle with figuring out how to halve ingredients, search for easy to print kitchen charts that show common conversions. For example, if a recipe calls for 4 cups (950 ml) of stock, 2 cups (250 g) of chicken, 1 carrot, and 1/2 cup (15 g) of fresh parsley, you'd use 2 cups (470 ml) of stock, 1 cup (125 g) of chicken, 1/2 of a carrot, and 1/4 cup (7.5 g) of fresh parsley. Rewrite the reduced recipe so it's easier to follow. If you're making adjustments to a recipe that only has 2 or 3 ingredients, you might not need to do this. However, if you're halving a recipe with a long list of ingredients, take the time to write out the recipe with the reduced amounts. This will prevent you from forgetting and accidentally adding too much of an ingredient. Follow the recipe's directions. Once you've scaled down all of the ingredients by half, you're ready to follow the recipe. You don't need to make any adjustments to the method of assembling the ingredients, although you may need to change pan sizes for baking. For example, if you're marinating beef for a stew and you've already marinated half of the beef in the reduced marinade, follow the recipe's instructions to sear the meat. Then add the rest of the ingredients and simmer the stew. Cook the recipe at the directed temperature. Even though you're cutting the ingredients in half, you don't need to change the cooking temperature. Reducing the oven temperature could mean that the food wouldn't cook fast enough and could cause foodborne illness. Raising the oven temperature could cause the food to brown quickly or even burn. For example, if you're supposed to sauté chopped onions over medium heat for 8 to 10 minutes, you'll still need to keep the heat at medium. The only time you might need to adjust the temperature is if you're using a glass baking dish instead of a metal one. In this case, reduce the oven temperature by 25 degrees. Check the food halfway through the cooking time. If you are baking half a recipe in a dish that is of half its original size, you might need to reduce the cooking time, as well. Begin checking the food halfway through the cooking time. It probably won't be done just yet, but check it every few minutes after this point. Keep in mind that if you're cutting the number of something, such as cookies or cupcakes, they'll still need to bake for the recommended time. For example, if you're baking brownies, begin checking them at 20 minutes instead of 40 minutes, especially if you don't adjust the pan size. Scaling Down Baked Goods Whisk an egg and measure it to get half an egg. If you have a recipe that calls for 1 egg, avoid using just the white or the yolk. Instead, crack the egg into a bowl and whisk it until the white and yolk are combined. Then measure out half of the liquid egg to use in your recipe. Tip: Although the amount of egg will depend on the size of the egg, half of a large beaten egg is about 2 tablespoons (30 ml). If you don't feel like wasting the remaining half of the egg, consider using an egg substitute that comes in a carton instead. Weigh your ingredients for the best results. Sometimes when you halve ingredients, you'll get an awkward measurement, such as 5/6 of a cup. If this happens, consider using the metric system and weigh the ingredients. This will make it much simpler to simply use half of the amount. For example, if you're making bread and the recipe calls for 3 2/3 cup of flour weigh it to find the metric amount, which is 458 g. Then divide that by 2 to get 229 g.\nThis is important to do if you're unsure how much is in a package. For example, if your recipe calls for a package of dry pudding, don't eyeball half of it. Weigh it instead for the most accurate results. Adjust the pan size by volume. When you're halving a casserole, cake, brownies, or something that will fill an entire dish, use a smaller pan. Figure out the volume of the dish the recipe recommends and then use a dish with half the volume. Using the right size pan will ensure that the food bakes properly. For example, if you want to halve a brownie recipe that's originally baked in a 9 in × 13 in (23 cm × 33 cm) pan, use an 8 in × 8 in (20 cm × 20 cm) pan instead. This will prevent the brownies from being too thin, which would cause them to be crispy or dry.",
  "tyn_model":[
    "oven",
    "cookies",
    "stock",
    "chicken",
    "carrot",
    "fresh parsley",
    "beef",
    "pan",
    "yeast",
    "reduced marinade",
    "onions",
    "baking dish",
    "bowl",
    "whisk",
    "egg",
    "egg substitute",
    "flour",
    "dry pudding",
    "dish",
    "× 13",
    "× 33",
    "× 8",
    "× 20"
  ],
  "tyn_section":[

  ]
}