{
  "title":"How to Make Sweet Biscuits",
  "url":"https://www.wikihow.com/Make-Sweet-Biscuits",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits"
  ],
  "steps":[
    {
      "headline":"Preheat oven to 450 degrees F (230 degrees C).",
      "description":""
    },
    {
      "headline":"Sift the dry ingredients (flour, salt, baking powder, and sugar) together thoroughly.",
      "description":""
    },
    {
      "headline":"Soften butter in microwave for about 10-15 seconds.",
      "description":"Use two knives or something similar to cut it into the dry mix until the dough resembles coarse crumbs."
    },
    {
      "headline":"Add the milk, and mix until you have to use your hands.",
      "description":"Add more flour if it is too moist."
    },
    {
      "headline":"Roll the dough out on a cutting board.",
      "description":"It should be about an inch thick. Cut it out with the bottom of a glass or dough cutter."
    },
    {
      "headline":"Put the dough on a cookie sheet, bake in the oven for 12 to 15 minutes.",
      "description":""
    },
    {
      "headline":"Serve warm.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat oven to 450 degrees F (230 degrees C).  Sift the dry ingredients (flour, salt, baking powder, and sugar) together thoroughly.  Soften butter in microwave for about 10-15 seconds. Use two knives or something similar to cut it into the dry mix until the dough resembles coarse crumbs. Add the milk, and mix until you have to use your hands. Add more flour if it is too moist. Roll the dough out on a cutting board. It should be about an inch thick. Cut it out with the bottom of a glass or dough cutter. Put the dough on a cookie sheet, bake in the oven for 12 to 15 minutes.  Serve warm.  Finished. ",
  "tyn_model":[
    "oven",
    "flour",
    "salt",
    "baking powder",
    "sugar",
    "butter",
    "microwave",
    "milk",
    "cutting board",
    "glass or dough cutter",
    "cookie sheet"
  ],
  "tyn_section":[

  ]
}