{
  "title":"How to Make Peach Shortcake",
  "url":"https://www.wikihow.com/Make-Peach-Shortcake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Shortcakes"
  ],
  "parts":[
    {
      "name":"Making the Shortcake",
      "steps":[
        {
          "headline":"Place the oven rack in the center and preheat the oven.",
          "description":"To ensure that the shortcake will bake evenly, check that your oven rack is in the center position. Next, set the temperature to 450 degrees Fahrenheit (232 degrees Celsius) to preheat the oven. Most ovens beep or flash an indicator light when the oven has reached the preheated temperature. Pay attention so you know when yours is ready."
        },
        {
          "headline":"Grease a pan.",
          "description":"Find a 8-inch by 8-inch (20.32 cm x 20.32 cm) baking dish or pan for your shortcake. Use butter or a nonstick cooking spray to lightly grease the pan so the shortcake won’t stick to it when it’s time to remove it. If you prefer not to grease the pan, line it with parchment paper or a nonstick baking liner."
        },
        {
          "headline":"Combine the flour, sugar, baking powder, salt, and nutmeg.",
          "description":"Sift 2 cups (250 g) all-purpose flour with ⅓ cup (66 g) granulated sugar, 4 teaspoons (20 g) baking powder, 1 teaspoon (3 g) kosher salt, and a pinch of ground nutmeg in a large mixing bowl. Mix until the ingredients are well blended. If you don’t have a sifter, you can use a fine mesh strainer. Place it over the bowl and dump the flour in it, shaking it to help the flour pass through. If you don’t have a sifter or strainer, use a whisk or fork to mix up the flour before adding it to the mixing bowl so it has a lighter texture."
        },
        {
          "headline":"Cut the butter into the dry ingredients.",
          "description":"Take ½ cup or 1 stick (113 g) of very cold unsalted butter that’s been cut into small pieces and add it to the bowl with the flour mixture. Use a pastry cutter to cut the butter into the dry ingredients. Continue working until the butter is cut into pieces that are as big as small peas. If you don’t have a pastry cutter, you can use a fork or a butter knife to cut the butter into the flour."
        },
        {
          "headline":"Add the egg and milk.",
          "description":"After you’ve cut the butter into the dry ingredients, mix in 1 well-beaten egg and ⅓ cup (78 ml) cold milk. Stir together until the egg and milk just moisten the dry ingredients. Avoid overmixing the batter or you may wind up with a tough shortcake."
        },
        {
          "headline":"Press the batter into the bottom of the pan.",
          "description":"Once you’ve mixed in the egg and milk, press the batter into the bottom of your greased or lined pan. Work quickly and avoid touching the batter too much so you can keep the butter cold."
        },
        {
          "headline":"Bake the shortcake for 15 to 20 minutes.",
          "description":"Place the pan in the preheated oven, and allow it to bake for 15 to 20 minutes. You’ll know that it’s done when the top of the shortcake is a golden color. Allow it to cool for approximately 20 minutes on a wire rack. To make sure that the shortcake bakes evenly, place it on the center of the oven rack. That allows air to circulate around evenly in both directions."
        },
        {
          "headline":"Cut the shortcake into squares.",
          "description":"Once the shortcake is cool enough to handle, it’s time to divide it into individual servings. Cut the cake into even squares. You can make them any size that you prefer, but 2-inch (5 cm) square is usually a good size."
        }
      ]
    },
    {
      "name":"Preparing the Peaches and Cream",
      "steps":[
        {
          "headline":"Boil the peaches for easy peeling.",
          "description":"For the shortcake, you’ll need 4 ripe peaches that have been peeled. To make it easier, use a knife to make a small “x” at the bottom of each, and place them in a large pot of boiling water. Allow them to boil for 30 seconds. Use a slotted spoon to take the peaches out of the pot, so you don’t take any boiling water with them."
        },
        {
          "headline":"Drop the peaches into ice water and remove the skins.",
          "description":"When you remove the peaches from the boiling water, place them immediately in a bowl of ice water. That will stop the peaches from cooking any further, but the skins will be loosened enough that you can remove them with your fingers. It’s easiest to start peeling the skin from the bottom of the peaches where you made the “x.”"
        },
        {
          "headline":"Slice the peaches and mix with sugar.",
          "description":"Once the skins are removed, cut the peaches in half and remove the pit. Next, slice the peaches lengthwise to create ½-inch (1.27 cm) thick slices and place them in a medium bowl. Add 2 teaspoons (10 g) of granulated sugar to the peaches, and mix well. Set the bowl aside. If you want your peaches to have a deeper flavor, replace the granulated sugar with light brown sugar."
        },
        {
          "headline":"Combine the melted butter and rum.",
          "description":"In a separate bowl, stir 3 tablespoons (42 g) unsalted butter that’s been melted and 3 tablespoons (45 ml) dark rum together. Mix until well blended, and then set aside. If you aren’t a fan of rum, you can replace it with 3 tablespoons (45 ml) of amaretto or peach schnapps."
        },
        {
          "headline":"Whip the heavy cream in a chilled bowl until it thickens slightly.",
          "description":"Chill a bowl in the refrigerator for an hour or so, and then pour 1 ½ cups (355 ml) cold heavy cream into it. Whip the cream on medium speed with the whisk attachment on a stand mixer or hand mixer until the liquid starts to thicken. You can whip the cream by hand with a whisk, but the process will take longer."
        },
        {
          "headline":"Fold in the honey.",
          "description":"When the cream has thickened slightly, add 5 tablespoons (106 g) of honey to it. Use a spatula to gently fold the honey into the cream. You may need to push down the cream from the sides of the bowl to incorporate the honey completely. Choose a honey that has a delicate flavor so it won’t overpower the flavor of the peaches. Clover or orange blossom honey is a good option."
        },
        {
          "headline":"Whip the cream until soft peaks form.",
          "description":"Turn the stand mixer or hand mixer back on, and whip the cream on medium-high speed. Continue until soft peaks form. It’s best to use the whipped cream right after you make it, but if you’re not going to assemble the shortcakes right away, place it in the refrigerator."
        }
      ]
    },
    {
      "name":"Assembling the Peach Shortcake",
      "steps":[
        {
          "headline":"Cut the shortcake squares in half and brush with the rum butter.",
          "description":"With a knife, split the shortcake squares in half horizontally. Use a pastry brush to apply the rum butter mixture to each cut side of the shortcake and place on a plate. If you don’t have a pastry brush, try using a coffee filter or your fingers to brush the butter over the shortcake."
        },
        {
          "headline":"Cover one piece of the shortcake with the peaches and cream.",
          "description":"Place one buttered piece of the shortcake in the center of the plate, and spoon enough peaches to cover the square onto it. Next, top the peaches with a dollop of the whipped cream."
        },
        {
          "headline":"Place second piece of the shortcake on top and add more fruit and cream.",
          "description":"Top the first shortcake half with the other piece. Layer a few more peach slices and another dollop of whipped cream on top to finish off the shortcake. If you prefer, you can top the second layer of shortcake with only whipped cream."
        }
      ]
    }
  ],
  "text":" Making the Shortcake Place the oven rack in the center and preheat the oven. To ensure that the shortcake will bake evenly, check that your oven rack is in the center position. Next, set the temperature to 450 degrees Fahrenheit (232 degrees Celsius) to preheat the oven. Most ovens beep or flash an indicator light when the oven has reached the preheated temperature. Pay attention so you know when yours is ready. Grease a pan. Find a 8-inch by 8-inch (20.32 cm x 20.32 cm) baking dish or pan for your shortcake. Use butter or a nonstick cooking spray to lightly grease the pan so the shortcake won’t stick to it when it’s time to remove it. If you prefer not to grease the pan, line it with parchment paper or a nonstick baking liner. Combine the flour, sugar, baking powder, salt, and nutmeg. Sift 2 cups (250 g) all-purpose flour with ⅓ cup (66 g) granulated sugar, 4 teaspoons (20 g) baking powder, 1 teaspoon (3 g) kosher salt, and a pinch of ground nutmeg in a large mixing bowl. Mix until the ingredients are well blended. If you don’t have a sifter, you can use a fine mesh strainer. Place it over the bowl and dump the flour in it, shaking it to help the flour pass through. If you don’t have a sifter or strainer, use a whisk or fork to mix up the flour before adding it to the mixing bowl so it has a lighter texture. Cut the butter into the dry ingredients. Take ½ cup or 1 stick (113 g) of very cold unsalted butter that’s been cut into small pieces and add it to the bowl with the flour mixture. Use a pastry cutter to cut the butter into the dry ingredients. Continue working until the butter is cut into pieces that are as big as small peas. If you don’t have a pastry cutter, you can use a fork or a butter knife to cut the butter into the flour. Add the egg and milk. After you’ve cut the butter into the dry ingredients, mix in 1 well-beaten egg and ⅓ cup (78 ml) cold milk. Stir together until the egg and milk just moisten the dry ingredients. Avoid overmixing the batter or you may wind up with a tough shortcake. Press the batter into the bottom of the pan. Once you’ve mixed in the egg and milk, press the batter into the bottom of your greased or lined pan. Work quickly and avoid touching the batter too much so you can keep the butter cold. Bake the shortcake for 15 to 20 minutes. Place the pan in the preheated oven, and allow it to bake for 15 to 20 minutes. You’ll know that it’s done when the top of the shortcake is a golden color. Allow it to cool for approximately 20 minutes on a wire rack. To make sure that the shortcake bakes evenly, place it on the center of the oven rack. That allows air to circulate around evenly in both directions. Cut the shortcake into squares. Once the shortcake is cool enough to handle, it’s time to divide it into individual servings. Cut the cake into even squares. You can make them any size that you prefer, but 2-inch (5 cm) square is usually a good size. Preparing the Peaches and Cream Boil the peaches for easy peeling. For the shortcake, you’ll need 4 ripe peaches that have been peeled. To make it easier, use a knife to make a small “x” at the bottom of each, and place them in a large pot of boiling water. Allow them to boil for 30 seconds. Use a slotted spoon to take the peaches out of the pot, so you don’t take any boiling water with them. Drop the peaches into ice water and remove the skins. When you remove the peaches from the boiling water, place them immediately in a bowl of ice water. That will stop the peaches from cooking any further, but the skins will be loosened enough that you can remove them with your fingers. It’s easiest to start peeling the skin from the bottom of the peaches where you made the “x.” Slice the peaches and mix with sugar. Once the skins are removed, cut the peaches in half and remove the pit. Next, slice the peaches lengthwise to create ½-inch (1.27 cm) thick slices and place them in a medium bowl. Add 2 teaspoons (10 g) of granulated sugar to the peaches, and mix well. Set the bowl aside. If you want your peaches to have a deeper flavor, replace the granulated sugar with light brown sugar. Combine the melted butter and rum. In a separate bowl, stir 3 tablespoons (42 g) unsalted butter that’s been melted and 3 tablespoons (45 ml) dark rum together. Mix until well blended, and then set aside. If you aren’t a fan of rum, you can replace it with 3 tablespoons (45 ml) of amaretto or peach schnapps. Whip the heavy cream in a chilled bowl until it thickens slightly. Chill a bowl in the refrigerator for an hour or so, and then pour 1 ½ cups (355 ml) cold heavy cream into it. Whip the cream on medium speed with the whisk attachment on a stand mixer or hand mixer until the liquid starts to thicken. You can whip the cream by hand with a whisk, but the process will take longer. Fold in the honey. When the cream has thickened slightly, add 5 tablespoons (106 g) of honey to it. Use a spatula to gently fold the honey into the cream. You may need to push down the cream from the sides of the bowl to incorporate the honey completely. Choose a honey that has a delicate flavor so it won’t overpower the flavor of the peaches. Clover or orange blossom honey is a good option. Whip the cream until soft peaks form. Turn the stand mixer or hand mixer back on, and whip the cream on medium-high speed. Continue until soft peaks form. It’s best to use the whipped cream right after you make it, but if you’re not going to assemble the shortcakes right away, place it in the refrigerator. Assembling the Peach Shortcake Cut the shortcake squares in half and brush with the rum butter. With a knife, split the shortcake squares in half horizontally. Use a pastry brush to apply the rum butter mixture to each cut side of the shortcake and place on a plate. If you don’t have a pastry brush, try using a coffee filter or your fingers to brush the butter over the shortcake. Cover one piece of the shortcake with the peaches and cream. Place one buttered piece of the shortcake in the center of the plate, and spoon enough peaches to cover the square onto it. Next, top the peaches with a dollop of the whipped cream. Place second piece of the shortcake on top and add more fruit and cream. Top the first shortcake half with the other piece. Layer a few more peach slices and another dollop of whipped cream on top to finish off the shortcake. If you prefer, you can top the second layer of shortcake with only whipped cream.",
  "tyn_model":[
    "cream",
    "butter",
    "peaches",
    "flour",
    "bowl",
    "oven",
    "honey",
    "milk",
    "whipped cream",
    "granulated sugar",
    "whisk",
    "water",
    "oven rack",
    "sugar",
    "baking powder",
    "nutmeg",
    "⅓ cup",
    "sifter",
    "unsalted butter",
    "pastry cutter",
    "egg",
    "knife",
    "ice water",
    "rum",
    "heavy cream",
    "refrigerator",
    "stand mixer",
    "hand mixer",
    "rum butter",
    "pastry brush",
    "plate",
    "pan",
    "baking dish",
    "nonstick cooking spray",
    "parchment paper",
    "nonstick baking liner",
    "salt",
    "all-purpose flour",
    "kosher salt",
    "large mixing bowl",
    "fine mesh strainer",
    "strainer",
    "mixing bowl",
    "fork",
    "butter knife",
    "shortcake",
    "cake",
    "“x",
    "” at",
    "slotted spoon",
    "“x.",
    "” slice",
    "medium bowl",
    "brown sugar",
    "dark rum",
    "amaretto or",
    "peach schnapps",
    "spatula",
    "clover or",
    "peach shortcake",
    "coffee filter",
    "peach"
  ],
  "tyn_section":[

  ]
}