{
  "title":"How to Make a Water Works at Home",
  "url":"https://www.wikihow.com/Make-a-Water-Works-at-Home",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games"
  ],
  "methods":[
    {
      "name":"Getting the Supplies",
      "steps":[
        {
          "headline":"Plan the date and make sure you choose a day where your friends and kids can have a great time.",
          "description":"Check your local weather for any unexpected weather such as…\nSnow/hail\nExtreme coldness (below 60 degrees is a good reference)\nWindy days (even if it’s hot outside, the wind will blow everything away!)"
        },
        {
          "headline":"Prepare a card inviting neighbours, friends, and others.",
          "description":"You can use the sample I made or make your own. Mail the card a week in advance so the guests will have time to respond. Make sure to include the location, date, and time of the event."
        },
        {
          "headline":"Get the materials listed, any department store has these things especially around the summertime.",
          "description":"Dollar stores have the cheapest foam noodles and blow up baby pools. Make sure your swing set has at least the following things -\n1 Slide\nA rooftop\nA ladder\nAny additional water play toys"
        },
        {
          "headline":"Your guests will be hungry after a long day's play.",
          "description":"Make sure to have plenty of food and beverages. Burgers and hot dogs are always a great idea."
        }
      ]
    },
    {
      "name":"Assembly",
      "steps":[
        {
          "headline":"Position the blow up pool at the end of the slide.",
          "description":"The purpose of this is to have a water slide end up in a pool. Fill the pool with 5 inches (12.7 cm) of water to 2 feet (0.6 m). Any more will just end up splashing out when you go down the slide."
        },
        {
          "headline":"Cut the noodles and hang them to create a water passageway from the top of the swing set to the pool, and have a small tub of water and some plastic cups on the swing set the kids can pour water down the tubes.",
          "description":""
        },
        {
          "headline":"Place water guns in various locations on the swing set.",
          "description":"This way the kids can shoot each other with water as they play on the Water Works. It is a good idea to position them so the water will never hit the sitting area or the food and grill."
        },
        {
          "headline":"Place a medium sized bucket at the top of the house.",
          "description":"Every once in a while you can ring a bell and your kids will excitedly run closer to it to get soaked! This item is just like the big bucket on most water work attractions."
        },
        {
          "headline":"Finally hook up a sprinkler to your hose and attach over the swings.",
          "description":"For safety, consider removing the swings off their hooks so kids don't slip off them. Now enjoy an awesome time at your family water works, yours will truly be the best house on the block!"
        }
      ]
    }
  ],
  "text":" Getting the Supplies Plan the date and make sure you choose a day where your friends and kids can have a great time. Check your local weather for any unexpected weather such as…\nSnow/hail\nExtreme coldness (below 60 degrees is a good reference)\nWindy days (even if it’s hot outside, the wind will blow everything away!) Prepare a card inviting neighbours, friends, and others. You can use the sample I made or make your own. Mail the card a week in advance so the guests will have time to respond. Make sure to include the location, date, and time of the event. Get the materials listed, any department store has these things especially around the summertime. Dollar stores have the cheapest foam noodles and blow up baby pools. Make sure your swing set has at least the following things -\n1 Slide\nA rooftop\nA ladder\nAny additional water play toys Your guests will be hungry after a long day's play. Make sure to have plenty of food and beverages. Burgers and hot dogs are always a great idea. Assembly Position the blow up pool at the end of the slide. The purpose of this is to have a water slide end up in a pool. Fill the pool with 5 inches (12.7 cm) of water to 2 feet (0.6 m). Any more will just end up splashing out when you go down the slide. Cut the noodles and hang them to create a water passageway from the top of the swing set to the pool, and have a small tub of water and some plastic cups on the swing set the kids can pour water down the tubes.  Place water guns in various locations on the swing set. This way the kids can shoot each other with water as they play on the Water Works. It is a good idea to position them so the water will never hit the sitting area or the food and grill. Place a medium sized bucket at the top of the house. Every once in a while you can ring a bell and your kids will excitedly run closer to it to get soaked! This item is just like the big bucket on most water work attractions. Finally hook up a sprinkler to your hose and attach over the swings. For safety, consider removing the swings off their hooks so kids don't slip off them. Now enjoy an awesome time at your family water works, yours will truly be the best house on the block!",
  "tyn_model":[
    "water",
    "water works",
    "…\n",
    "blow up baby pools",
    "ladder",
    "water play toys",
    "blow up pool",
    "water slide",
    "noodles",
    "swing set",
    "water guns",
    "bucket",
    "water work attractions",
    "sprinkler",
    "hose"
  ],
  "tyn_section":[

  ]
}