{
  "title":"How to Keep a Knitting Journal",
  "url":"https://www.wikihow.com/Keep-a-Knitting-Journal",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Knitting and Crochet",
    "Knitting",
    "Knitting Tools and Accessories"
  ],
  "steps":[
    {
      "headline":"Find or buy a notebook or writing pad and stash it in your knitting bag or basket.",
      "description":"Make sure that it fits first! Smaller notebooks are best, as they take up less space than normal, school-sized ones."
    },
    {
      "headline":"Grab a pen or pencil, then keep it with the notebook at all times.",
      "description":"Consider getting a pen that can stay on your notebook for added convenience."
    },
    {
      "headline":"Put the title of the pattern at the top of the page so you won't lose track of your project.",
      "description":"Record the date that you're knitting on. Print out, photocopy, or manually copy over the pattern you're working on into your journal. Then while you're working through the project use a system of tallies, check marks, etc. to keep track of your place in the pattern. Write yourself helpful notes to remember if you ever revisit the pattern again."
    },
    {
      "headline":"Record information about your needles and yarn.",
      "description":"It's important to remember what sort of yarn you're using if you plan to throw away the wrapper. (You could actually just stick the wrapper onto the page.) It's good to write down the needles you used for future reference."
    },
    {
      "headline":"Use the journal to keep track of abbreviations.",
      "description":"If the pattern you're using doesn't explain all the abbreviations they use completely, look them up and write yourself a little explanation so you don't waste time looking them up while you're knitting."
    },
    {
      "headline":"Tape or paste pictures into the journal.",
      "description":"You can also use fun pens and maybe a sticker or a piece of yarn from each project, so your journal becomes really fun and sort of like a scrapbook."
    },
    {
      "headline":"Record final details once you've finished the project.",
      "description":"How much yarn did it take? What would you have done differently a second time around? What did you think of that brand of yarn? All of this is helpful for future knitting projects."
    }
  ],
  "text":" Find or buy a notebook or writing pad and stash it in your knitting bag or basket. Make sure that it fits first! Smaller notebooks are best, as they take up less space than normal, school-sized ones. Grab a pen or pencil, then keep it with the notebook at all times. Consider getting a pen that can stay on your notebook for added convenience. Put the title of the pattern at the top of the page so you won't lose track of your project. Record the date that you're knitting on. Print out, photocopy, or manually copy over the pattern you're working on into your journal. Then while you're working through the project use a system of tallies, check marks, etc. to keep track of your place in the pattern. Write yourself helpful notes to remember if you ever revisit the pattern again. Record information about your needles and yarn. It's important to remember what sort of yarn you're using if you plan to throw away the wrapper. (You could actually just stick the wrapper onto the page.) It's good to write down the needles you used for future reference. Use the journal to keep track of abbreviations. If the pattern you're using doesn't explain all the abbreviations they use completely, look them up and write yourself a little explanation so you don't waste time looking them up while you're knitting. Tape or paste pictures into the journal. You can also use fun pens and maybe a sticker or a piece of yarn from each project, so your journal becomes really fun and sort of like a scrapbook. Record final details once you've finished the project. How much yarn did it take? What would you have done differently a second time around? What did you think of that brand of yarn? All of this is helpful for future knitting projects.",
  "tyn_model":[
    "yarn",
    "journal",
    "pen",
    "notebook",
    "notebook or writing pad",
    "notebooks",
    "pencil",
    "needles",
    "pens"
  ],
  "tyn_section":[

  ]
}