{
  "title":"How to Play \"Button, Button, Who's Got the Button?\"",
  "url":"https://www.wikihow.com/Play-%22Button,-Button,-Who%27s-Got-the-Button%3F%22",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Games for Children"
  ],
  "methods":[
    {
      "name":"Basic Game Concept[1]\n\tX\n\t\tResearch source",
      "steps":[
        {
          "headline":"Choose a child to be the \"IT\" or leader for the game round.",
          "description":"Give them a button."
        },
        {
          "headline":"Have the children form a circle.",
          "description":"Ask them to put their arms stretched out in front of them, with their hands and palms together."
        },
        {
          "headline":"Have the leader go around to each child in the circle.",
          "description":"Have them weave their hands into the other children's hands. They will need to drop the button in a random child's palms. Even if they don't hold the button anymore, the child needs to perform the hand weaving to everyone in the circle, so no one knows who holds the button, expect for the leader and button holder."
        },
        {
          "headline":"Start the initial chant before each guess.",
          "description":"Either have the circle or leader ask, \"Button, button, who's got the button? \"."
        },
        {
          "headline":"Allow one child in the group to guess.",
          "description":"Have them think of whom could have the button in their hands."
        },
        {
          "headline":"Determine the rounds:",
          "description":"If the guessed name does not have the button, repeat the chant, and have the next child on the left to the previous guesser to choose the potential button holder. If the child with the button has not been guessed yet, but it is the button holder's turn, they must choose another name (so the group still does not know it's them). Once the button holder's name is guessed correctly, the current button holder then becomes the new leader and chooses another child to hold the button."
        }
      ]
    },
    {
      "name":"Behind Backs Version[2]\n\tX\n\t\tResearch source",
      "steps":[
        {
          "headline":"Choose a child to be the \"IT\" or leader for the game round.",
          "description":""
        },
        {
          "headline":"Have the children form a circle.",
          "description":"Ask them to put their hands behind their backs and the leader"
        },
        {
          "headline":"Have the leader go in the middle of the circle.",
          "description":""
        },
        {
          "headline":"Place a button in a child's hand behind their back.",
          "description":""
        },
        {
          "headline":"Allow the children to trade the button between hands.",
          "description":"The leader must guess who holds the button. For a more entertaining approach and to confuse the leader, have all the children in the circle \"mimic\" hand motions, so they all appear to be passing the button on."
        },
        {
          "headline":"Determine the rounds:",
          "description":"If the leader chooses the wrong name (the child with empty hands), they must choose a new name. If the leader chooses the correct name (the child with the button), the button holder is the new leader."
        }
      ]
    },
    {
      "name":"Hide and Seek Version[3]\n\tX\n\t\tResearch source",
      "steps":[
        {
          "headline":"Have the child participants cover their eyes.",
          "description":"For a surprising approach, have them wait in another room."
        },
        {
          "headline":"Hide the button.",
          "description":"Make sure the button can easily be found, even by the smallest child, and not in a well-hiding place."
        },
        {
          "headline":"Allow the children to find the button.",
          "description":"Use proximity phrases such as, \"Timmy is hot\" (the child is close to the button hiding spot) or \"Susie is very cold!\" (the child is very far away from the button)."
        },
        {
          "headline":"Declare the winner.",
          "description":"The child whom finds the button is the winner, and the next person to hide it for the next round."
        }
      ]
    },
    {
      "name":"Staircase Version[4]\n\tX\n\t\tResearch source",
      "steps":[
        {
          "headline":"Position children at the bottom step of a staircase.",
          "description":""
        },
        {
          "headline":"Have an adult hold the button in one of their fists.",
          "description":"Extend the arms out in front to show two fists in front of the children."
        },
        {
          "headline":"Ask the children, \"Button, button, who's got the button?\"",
          "description":""
        },
        {
          "headline":"Have the child whom guesses the correct fist advance a step.",
          "description":""
        },
        {
          "headline":"Place your hands behind your back, choose a fist for the button, and extend your arms out again.",
          "description":"Repeat the question and have them guess again."
        },
        {
          "headline":"Declare the winner.",
          "description":"The child whom gets to the top step first is the winner."
        }
      ]
    }
  ],
  "text":" Basic Game Concept[1]\n\tX\n\t\tResearch source Choose a child to be the \"IT\" or leader for the game round. Give them a button. Have the children form a circle. Ask them to put their arms stretched out in front of them, with their hands and palms together. Have the leader go around to each child in the circle. Have them weave their hands into the other children's hands. They will need to drop the button in a random child's palms. Even if they don't hold the button anymore, the child needs to perform the hand weaving to everyone in the circle, so no one knows who holds the button, expect for the leader and button holder. Start the initial chant before each guess. Either have the circle or leader ask, \"Button, button, who's got the button? \". Allow one child in the group to guess. Have them think of whom could have the button in their hands. Determine the rounds: If the guessed name does not have the button, repeat the chant, and have the next child on the left to the previous guesser to choose the potential button holder. If the child with the button has not been guessed yet, but it is the button holder's turn, they must choose another name (so the group still does not know it's them). Once the button holder's name is guessed correctly, the current button holder then becomes the new leader and chooses another child to hold the button. Behind Backs Version[2]\n\tX\n\t\tResearch source Choose a child to be the \"IT\" or leader for the game round.  Have the children form a circle. Ask them to put their hands behind their backs and the leader Have the leader go in the middle of the circle.  Place a button in a child's hand behind their back.  Allow the children to trade the button between hands. The leader must guess who holds the button. For a more entertaining approach and to confuse the leader, have all the children in the circle \"mimic\" hand motions, so they all appear to be passing the button on. Determine the rounds: If the leader chooses the wrong name (the child with empty hands), they must choose a new name. If the leader chooses the correct name (the child with the button), the button holder is the new leader. Hide and Seek Version[3]\n\tX\n\t\tResearch source Have the child participants cover their eyes. For a surprising approach, have them wait in another room. Hide the button. Make sure the button can easily be found, even by the smallest child, and not in a well-hiding place. Allow the children to find the button. Use proximity phrases such as, \"Timmy is hot\" (the child is close to the button hiding spot) or \"Susie is very cold!\" (the child is very far away from the button). Declare the winner. The child whom finds the button is the winner, and the next person to hide it for the next round. Staircase Version[4]\n\tX\n\t\tResearch source Position children at the bottom step of a staircase.  Have an adult hold the button in one of their fists. Extend the arms out in front to show two fists in front of the children. Ask the children, \"Button, button, who's got the button?\"  Have the child whom guesses the correct fist advance a step.  Place your hands behind your back, choose a fist for the button, and extend your arms out again. Repeat the question and have them guess again. Declare the winner. The child whom gets to the top step first is the winner.",
  "tyn_model":[
    "chant",
    "button",
    "staircase"
  ],
  "tyn_section":[

  ]
}