{
  "title":"How to Display LEGOs",
  "url":"https://www.wikihow.com/Display-LEGOs",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Construction Toys",
    "LEGO and Other Building Blocks"
  ],
  "methods":[
    {
      "name":"Using Display Shelves",
      "steps":[
        {
          "headline":"Organize your LEGOs on a bookshelf if you want easy access.",
          "description":"A simple bookcase is a great place for keeping LEGO figures where you can grab and play with them but still enjoy how they look. Choose a bookshelf that is the best height for accessing the LEGOs that you need, and leave at least 1 inch (2.5 cm) in between figures to prevent them from hitting against each other. If you’re worried about your LEGO figures falling over on the shelf, you can attach large base plates to the shelves with glue or velcro strips, and then snap the figures into the plates when you’re ready to display them."
        },
        {
          "headline":"Attach floating shelves to the wall to keep LEGOs out of reach.",
          "description":"Look for shelves that have a lip on the front to keep the LEGOs from falling off, and hang the shelf above a bed or high on a wall. This will keep the figures out of reach but allow them to be visible in the room. When you’re hanging shelves, remember to use a level and read the instructions before attempting to drill holes."
        },
        {
          "headline":"Place a stackable hutch on top of a dresser to keep LEGOs away from the ground.",
          "description":"If you have small kids or pets in your house, you might not want to have the figures near the ground. Look on online marketplaces for a “hutch,” which is a shelving unit that sits on the top of a dresser or desk. You can also purchase some desks and dressers with display hutches already attached to them."
        },
        {
          "headline":"Consider placing LEGOs on a piece of furniture with drawers for added storage.",
          "description":"If you have a large LEGO collection, look for a piece of furniture with shelving on top and drawers or cabinets on the bottom. Then, place your finished figures on the shelves and the unfinished projects and loose bricks in containers in the drawers. Additionally, you can use the top part of the desk or dresser as an assembly station where you put together the LEGO figures."
        }
      ]
    },
    {
      "name":"Showcasing Mini Figures",
      "steps":[
        {
          "headline":"Consider getting stackable cases for a flexible storage solution.",
          "description":"The LEGO company makes a set of storage cases for Mini Figures that can be stacked on top of each other for permanent storage. Unstacked, you can open and remove the figures easily to play with them. When you’re done using the figures, put them back in the container and stack them up again. These are also great for storing LEGO figures if you have children who can easily get into storage boxes or cabinets."
        },
        {
          "headline":"Build a display frame out of LEGOs if you want a DIY solution.",
          "description":"Use a 32 by 32 cm (13 by 13 in) or a 48 by 48 cm (19 by 19 in) LEGO base plate, and attach bricks to the perimeter to make a frame. Then, mount the plate to the wall for easy access, and attach your LEGO Mini Figures by snapping them into the base plate. Make sure the base plate is securely attached to the wall with mounting strips or brackets before you attach the figures to it. If it’s not, the added weight can cause it to fall off."
        },
        {
          "headline":"Use a shadow box if you want to create a gallery-like display.",
          "description":"Remove the glass from a shadow box and glue standard bricks to the mat in the back of the box. Make sure the bricks are the right side up and there’s at least 2.75 inches (7.0 cm) in between rows of bricks. Then, stick the Mini Figures on the top of the bricks and replace the glass. If you want to able to remove the figures easily, don’t put the glass back on the box so you can reach in and take it off of its stand."
        }
      ]
    },
    {
      "name":"Cleaning and Maintaining Your LEGOs",
      "steps":[
        {
          "headline":"Dust your LEGO figures and display frequently to keep them clean.",
          "description":"Use a natural feather duster, a microfiber cloth, a brush, or canned air to blow dust and debris off of your LEGO figures when they’re on display. Try to dust every month if possible to keep your LEGO figures looking bright and shiny, and don’t forget to wipe off the display shelves as well! Avoid using vacuum cleaners to dust your collection, as the powerful suction can cause smaller pieces to become loose and get trapped in the vacuum."
        },
        {
          "headline":"Keep your LEGO figures out of direct sunlight to prevent discoloration.",
          "description":"When you’re setting up your display area, make sure it is not in direct sunlight and away from any windows or doorways. Long-term exposure to sunlight can cause the bricks to lose their color over time. Additionally, try to keep artificial light, like bright lamps, away from your display area. While they’re less harmful, they can still cause the LEGOs to change color if they’re strong enough."
        },
        {
          "headline":"Sort your LEGO pieces by color or function to avoid lost pieces.",
          "description":"If you have a large collection, it can be easy to lose pieces when you take apart or put together your figures. Come up with a system that works for you, and remember to account for your displayed items when thinking about how many pieces of each type of brick you have. It might be helpful to keep your storage area near your display area in case you need to quickly grab a brick or replace an item. For example, you might store all of your 2 by 2 square bricks in a container so you have them all together. If you have special sets of LEGOs that go together, like a Ferris wheel or car set, store all of the pieces to the set in one large container to keep them together."
        }
      ]
    }
  ],
  "text":" Using Display Shelves Organize your LEGOs on a bookshelf if you want easy access. A simple bookcase is a great place for keeping LEGO figures where you can grab and play with them but still enjoy how they look. Choose a bookshelf that is the best height for accessing the LEGOs that you need, and leave at least 1 inch (2.5 cm) in between figures to prevent them from hitting against each other. If you’re worried about your LEGO figures falling over on the shelf, you can attach large base plates to the shelves with glue or velcro strips, and then snap the figures into the plates when you’re ready to display them. Attach floating shelves to the wall to keep LEGOs out of reach. Look for shelves that have a lip on the front to keep the LEGOs from falling off, and hang the shelf above a bed or high on a wall. This will keep the figures out of reach but allow them to be visible in the room. When you’re hanging shelves, remember to use a level and read the instructions before attempting to drill holes. Place a stackable hutch on top of a dresser to keep LEGOs away from the ground. If you have small kids or pets in your house, you might not want to have the figures near the ground. Look on online marketplaces for a “hutch,” which is a shelving unit that sits on the top of a dresser or desk. You can also purchase some desks and dressers with display hutches already attached to them. Consider placing LEGOs on a piece of furniture with drawers for added storage. If you have a large LEGO collection, look for a piece of furniture with shelving on top and drawers or cabinets on the bottom. Then, place your finished figures on the shelves and the unfinished projects and loose bricks in containers in the drawers. Additionally, you can use the top part of the desk or dresser as an assembly station where you put together the LEGO figures. Showcasing Mini Figures Consider getting stackable cases for a flexible storage solution. The LEGO company makes a set of storage cases for Mini Figures that can be stacked on top of each other for permanent storage. Unstacked, you can open and remove the figures easily to play with them. When you’re done using the figures, put them back in the container and stack them up again. These are also great for storing LEGO figures if you have children who can easily get into storage boxes or cabinets. Build a display frame out of LEGOs if you want a DIY solution. Use a 32 by 32 cm (13 by 13 in) or a 48 by 48 cm (19 by 19 in) LEGO base plate, and attach bricks to the perimeter to make a frame. Then, mount the plate to the wall for easy access, and attach your LEGO Mini Figures by snapping them into the base plate. Make sure the base plate is securely attached to the wall with mounting strips or brackets before you attach the figures to it. If it’s not, the added weight can cause it to fall off. Use a shadow box if you want to create a gallery-like display. Remove the glass from a shadow box and glue standard bricks to the mat in the back of the box. Make sure the bricks are the right side up and there’s at least 2.75 inches (7.0 cm) in between rows of bricks. Then, stick the Mini Figures on the top of the bricks and replace the glass. If you want to able to remove the figures easily, don’t put the glass back on the box so you can reach in and take it off of its stand. Cleaning and Maintaining Your LEGOs Dust your LEGO figures and display frequently to keep them clean. Use a natural feather duster, a microfiber cloth, a brush, or canned air to blow dust and debris off of your LEGO figures when they’re on display. Try to dust every month if possible to keep your LEGO figures looking bright and shiny, and don’t forget to wipe off the display shelves as well! Avoid using vacuum cleaners to dust your collection, as the powerful suction can cause smaller pieces to become loose and get trapped in the vacuum. Keep your LEGO figures out of direct sunlight to prevent discoloration. When you’re setting up your display area, make sure it is not in direct sunlight and away from any windows or doorways. Long-term exposure to sunlight can cause the bricks to lose their color over time. Additionally, try to keep artificial light, like bright lamps, away from your display area. While they’re less harmful, they can still cause the LEGOs to change color if they’re strong enough. Sort your LEGO pieces by color or function to avoid lost pieces. If you have a large collection, it can be easy to lose pieces when you take apart or put together your figures. Come up with a system that works for you, and remember to account for your displayed items when thinking about how many pieces of each type of brick you have. It might be helpful to keep your storage area near your display area in case you need to quickly grab a brick or replace an item. For example, you might store all of your 2 by 2 square bricks in a container so you have them all together. If you have special sets of LEGOs that go together, like a Ferris wheel or car set, store all of the pieces to the set in one large container to keep them together.",
  "tyn_model":[
    "bricks",
    "shelves",
    "container",
    "glass",
    "lego figures",
    "lego",
    "bookshelf",
    "glue",
    "shelf",
    "level",
    "“hutch",
    "” which",
    "lego base",
    "plate",
    "lego mini figures",
    "shadow box",
    "natural feather duster",
    "microfiber cloth",
    "brush",
    "canned air",
    "dust",
    "vacuum cleaners",
    "vacuum"
  ],
  "tyn_section":[

  ]
}