{
  "title":"How to Make Elderberry Jelly",
  "url":"https://www.wikihow.com/Make-Elderberry-Jelly",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Jams and Jellies"
  ],
  "steps":[
    {
      "headline":"Wash the elderberries.",
      "description":"Remove any stalks. this can be done using a fork rather than your fingers..."
    },
    {
      "headline":"Put the elderberries into the pan.",
      "description":"Bring to a boil and then simmer for half an hour. During this time the berries will become a soft pulp."
    },
    {
      "headline":"Mash the berries and continue cooking.",
      "description":""
    },
    {
      "headline":"Pour the mashed elderberries into the muslin.",
      "description":"Tie the muslin and hang the elderberries over a bowl to allow them to drip. Leave overnight."
    },
    {
      "headline":"The next day, measure the juice in the bowl.",
      "description":"For every pint of juice, add 1 pound of sugar."
    },
    {
      "headline":"Boil in the pan (cleaned).",
      "description":"Continue to boil until the berries reach setting point. This will take approximately 10 - 15 minutes. Test to see if it is set as per instructions under \"Tips\"."
    },
    {
      "headline":"Pour into warm jars.",
      "description":"Seal immediately."
    }
  ],
  "text":" Wash the elderberries. Remove any stalks. this can be done using a fork rather than your fingers... Put the elderberries into the pan. Bring to a boil and then simmer for half an hour. During this time the berries will become a soft pulp. Mash the berries and continue cooking.  Pour the mashed elderberries into the muslin. Tie the muslin and hang the elderberries over a bowl to allow them to drip. Leave overnight. The next day, measure the juice in the bowl. For every pint of juice, add 1 pound of sugar. Boil in the pan (cleaned). Continue to boil until the berries reach setting point. This will take approximately 10 - 15 minutes. Test to see if it is set as per instructions under \"Tips\". Pour into warm jars. Seal immediately.",
  "tyn_model":[
    "elderberries",
    "pan",
    "muslin",
    "bowl",
    "fork",
    "berries",
    "sugar",
    "jars"
  ],
  "tyn_section":[

  ]
}