{
  "title":"How to Make Peaceful Lanterns Out of Jars",
  "url":"https://www.wikihow.com/Make-Peaceful-Lanterns-Out-of-Jars",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Lanterns"
  ],
  "steps":[
    {
      "headline":"Select a clear glass jar or cup.",
      "description":"The jar or cup must be wide enough for a candle to be placed inside of it with ease."
    },
    {
      "headline":"Choose the colored tissue paper.",
      "description":"You can have a single color or you can mix up a few colors, or even make a rainbow effect. Obviously, the more colors you have, the more effort you'll need to put into arranging them in a suitable pattern as you attach them. Cut the tissue into neat squares or other suitable shapes. Cut with care. Tissue paper tends to tear easily."
    },
    {
      "headline":"Dip the paintbrush into the Mod Podge, allowing excess Mod Podge to drip back into the container.",
      "description":"It is really important that there is just enough Mod Podge on the brush, not dripping with it, as it may tear the tissue paper if saturated. It helps to rub the brush against the side of the pot to remove excess Mod Podge."
    },
    {
      "headline":"Add the tissue paper pieces to the outside of the jar or cup.",
      "description":"Paint the jar with Mod Podge in sections at a time. Perhaps begin at the base and work your way up, or vice versa, turning the jar to complete one section at a time. Once an area of the jar has been painted with the Mod Podge, affix tissue paper pieces to it with care. Overlap the tissue paper to make clean joins."
    },
    {
      "headline":"Continue onto the next sections until the whole jar or cup has been papered.",
      "description":"Be sure to cover the base of the jar or cup as well. Allow to dry completely."
    },
    {
      "headline":"Add the sealant layer.",
      "description":"Once again, dip the paintbrush into the Mod Podge, ensuring that there isn't an excess of Mod Podge on the paintbrush. Paint gently and carefully over the tissue paper on the outside of the jar or cup. As you paint, be sure to paint down any pieces of paper that might be sticking up at an awkward angle. This will neaten the whole effect."
    },
    {
      "headline":"Allow to dry completely before use.",
      "description":"Once dried, the peaceful lantern is ready for use."
    },
    {
      "headline":"Slip a tea light candle into the jar.",
      "description":"If battery-operated, turn it on before adding it. If a real candle, place it first, then use a long-handled match to light it."
    },
    {
      "headline":"Place the peaceful lantern wherever it's needed.",
      "description":"This lantern will windproof any flame, so it can be used outdoors as well as inside. It's ideal for mood lighting, as a table centerpiece or to simply glow away at an outdoor party."
    }
  ],
  "text":" Select a clear glass jar or cup. The jar or cup must be wide enough for a candle to be placed inside of it with ease. Choose the colored tissue paper. You can have a single color or you can mix up a few colors, or even make a rainbow effect. Obviously, the more colors you have, the more effort you'll need to put into arranging them in a suitable pattern as you attach them. Cut the tissue into neat squares or other suitable shapes. Cut with care. Tissue paper tends to tear easily. Dip the paintbrush into the Mod Podge, allowing excess Mod Podge to drip back into the container. It is really important that there is just enough Mod Podge on the brush, not dripping with it, as it may tear the tissue paper if saturated. It helps to rub the brush against the side of the pot to remove excess Mod Podge. Add the tissue paper pieces to the outside of the jar or cup. Paint the jar with Mod Podge in sections at a time. Perhaps begin at the base and work your way up, or vice versa, turning the jar to complete one section at a time. Once an area of the jar has been painted with the Mod Podge, affix tissue paper pieces to it with care. Overlap the tissue paper to make clean joins. Continue onto the next sections until the whole jar or cup has been papered. Be sure to cover the base of the jar or cup as well. Allow to dry completely. Add the sealant layer. Once again, dip the paintbrush into the Mod Podge, ensuring that there isn't an excess of Mod Podge on the paintbrush. Paint gently and carefully over the tissue paper on the outside of the jar or cup. As you paint, be sure to paint down any pieces of paper that might be sticking up at an awkward angle. This will neaten the whole effect. Allow to dry completely before use. Once dried, the peaceful lantern is ready for use. Slip a tea light candle into the jar. If battery-operated, turn it on before adding it. If a real candle, place it first, then use a long-handled match to light it. Place the peaceful lantern wherever it's needed. This lantern will windproof any flame, so it can be used outdoors as well as inside. It's ideal for mood lighting, as a table centerpiece or to simply glow away at an outdoor party.",
  "tyn_model":[
    "tissue paper",
    "mod podge",
    "lantern",
    "clear glass jar",
    "tissue",
    "paintbrush",
    "pot",
    "peaceful lantern",
    "tea light candle",
    "long-handled match"
  ],
  "tyn_section":[

  ]
}