{
  "title":"How to Make Ham Yam Pizza",
  "url":"https://www.wikihow.com/Make-Ham-Yam-Pizza",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Sandwiches and Quick Meals",
    "Pizza"
  ],
  "steps":[
    {
      "headline":"Preheat oven per the instructions with your pizza crusts (probably around 425F [220C]).",
      "description":""
    },
    {
      "headline":"Open the can of yams and empty the yams into a dish.",
      "description":"If you drain the yams, reserve the liquid."
    },
    {
      "headline":"Mash the yams with the potato masher or a sturdy fork.",
      "description":"If you drained the yams, add the reserved liquid as necessary to keep the mashed yams from being too much like a paste. Try for a consistency like a thick tomato sauce."
    },
    {
      "headline":"Ladle half the yams onto each pizza crust.",
      "description":"Use the bottom of the ladle or your fingers to spread the sauce evenly to within about 1/2\" (1 cm) of the edge."
    },
    {
      "headline":"Sprinkle a cup of mozzarella onto the yams on each pizza crust.",
      "description":"Spread evenly with your fingers to the edge of the sauce."
    },
    {
      "headline":"Spread the ham evenly on the cheese.",
      "description":"Add other toppings, if desired, including the pineapple garnish."
    },
    {
      "headline":"Put the pizzas in the oven, either directly on the racks or on the pizza baking pan(s) or stone.",
      "description":"Bake the time specified for your crusts, probably about ten minutes, or until the cheese in the center of the pizza is melted."
    },
    {
      "headline":"Allow to cool briefly before cutting.",
      "description":"Serve immediately."
    },
    {
      "headline":"Leftovers may be stored in the refrigerator, just as with any other pizza, and reheated in the microwave (or not).",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat oven per the instructions with your pizza crusts (probably around 425F [220C]).  Open the can of yams and empty the yams into a dish. If you drain the yams, reserve the liquid. Mash the yams with the potato masher or a sturdy fork. If you drained the yams, add the reserved liquid as necessary to keep the mashed yams from being too much like a paste. Try for a consistency like a thick tomato sauce. Ladle half the yams onto each pizza crust. Use the bottom of the ladle or your fingers to spread the sauce evenly to within about 1/2\" (1 cm) of the edge. Sprinkle a cup of mozzarella onto the yams on each pizza crust. Spread evenly with your fingers to the edge of the sauce. Spread the ham evenly on the cheese. Add other toppings, if desired, including the pineapple garnish. Put the pizzas in the oven, either directly on the racks or on the pizza baking pan(s) or stone. Bake the time specified for your crusts, probably about ten minutes, or until the cheese in the center of the pizza is melted. Allow to cool briefly before cutting. Serve immediately. Leftovers may be stored in the refrigerator, just as with any other pizza, and reheated in the microwave (or not).  Finished. ",
  "tyn_model":[
    "oven",
    "yams",
    "dish",
    "potato masher",
    "sturdy fork",
    "ladle",
    "mozzarella",
    "ham",
    "pineapple",
    "pizza baking pan(s",
    "refrigerator",
    "microwave"
  ],
  "tyn_section":[

  ]
}