{
  "title":"How to Make Fruity Pebble Pudding Popsicles",
  "url":"https://www.wikihow.com/Make-Fruity-Pebble-Pudding-Popsicles",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts",
    "Ice Pops"
  ],
  "steps":[
    {
      "headline":"Beat the instant pudding and milk together.",
      "description":"Stir them together in a large bowl for about 3-4 minutes, until properly mixed together."
    },
    {
      "headline":"Fold in the Fruity Pebbles.",
      "description":"Mix again until well-incorporated."
    },
    {
      "headline":"Pour the popsicle mixture into an ice pop mold.",
      "description":"Be careful not to over-fill each mold. Leave a little room near the top of each cavity so you can insert the popsicle stick correctly."
    },
    {
      "headline":"Place wooden popsicle sticks in the middle of each mold.",
      "description":""
    },
    {
      "headline":"Freeze the popsicles.",
      "description":"Allow them to freezer for about 4 hours until solid."
    },
    {
      "headline":"Remove the popsicles from the molds.",
      "description":"Wash the molds with a little bit of warm water to make removing them easier. Pop each of them out and place them on a plate."
    },
    {
      "headline":"Enjoy!",
      "description":""
    }
  ],
  "text":" Beat the instant pudding and milk together. Stir them together in a large bowl for about 3-4 minutes, until properly mixed together. Fold in the Fruity Pebbles. Mix again until well-incorporated. Pour the popsicle mixture into an ice pop mold. Be careful not to over-fill each mold. Leave a little room near the top of each cavity so you can insert the popsicle stick correctly. Place wooden popsicle sticks in the middle of each mold.  Freeze the popsicles. Allow them to freezer for about 4 hours until solid. Remove the popsicles from the molds. Wash the molds with a little bit of warm water to make removing them easier. Pop each of them out and place them on a plate. Enjoy! ",
  "tyn_model":[
    "instant pudding",
    "milk",
    "large bowl",
    "fruity pebbles",
    "ice pop mold",
    "popsicle stick",
    "popsicle sticks",
    "water",
    "plate"
  ],
  "tyn_section":[

  ]
}