{
  "title":"How to Make Salmon Fishcakes with Mashed Potatoes",
  "url":"https://www.wikihow.com/Make-Salmon-Fishcakes-with-Mashed-Potatoes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Salmon"
  ],
  "steps":[
    {
      "headline":"Salt some water and boil the potatoes in it for 20 minutes.",
      "description":"Drain the water out of the pan."
    },
    {
      "headline":"Use your potato masher to mash the potatoes in the pan.",
      "description":"Scoop the mashed potatoes into a bowl and leave it on the side for it to cool down."
    },
    {
      "headline":"Boil water in another pan and cook the fish for 8 minutes.",
      "description":""
    },
    {
      "headline":"Use a slotted spoon to carry the fish out of the water and onto a plate for it to cool down.",
      "description":""
    },
    {
      "headline":"Peel off any skin and de-bone anything as you break each fillet into small pieces.",
      "description":""
    },
    {
      "headline":"Combine the fish pieces, melted butter, mashed potatoes, dill, salt, and pepper into a bowl.",
      "description":"Mix all ingredients thoroughly."
    },
    {
      "headline":"Mold the mixture into flat balls with your hands into 2 ⁄2 centimeters (1.0 in) thick each.",
      "description":"Stack all of the flatten balls on a place and place them in the refrigerator for 20 minutes."
    },
    {
      "headline":"Make \"dipping\" stations.",
      "description":"Beat the eggs into one small bowl, pour the flour into another bowl, and the bread crumbs into a separate bowl. Dip each fishcake into the flour first, then egg, then bread crumbs."
    },
    {
      "headline":"Fry the dipped fishcakes into a heated and oiled pan for 4 minutes each.",
      "description":"Try to achieve a golden brown color on both sides."
    },
    {
      "headline":"Remove them from the pan with a slotted spoon and drain the leftover oil out on paper towels.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Salt some water and boil the potatoes in it for 20 minutes. Drain the water out of the pan. Use your potato masher to mash the potatoes in the pan. Scoop the mashed potatoes into a bowl and leave it on the side for it to cool down. Boil water in another pan and cook the fish for 8 minutes.  Use a slotted spoon to carry the fish out of the water and onto a plate for it to cool down.  Peel off any skin and de-bone anything as you break each fillet into small pieces.  Combine the fish pieces, melted butter, mashed potatoes, dill, salt, and pepper into a bowl. Mix all ingredients thoroughly. Mold the mixture into flat balls with your hands into 2 ⁄2 centimeters (1.0 in) thick each. Stack all of the flatten balls on a place and place them in the refrigerator for 20 minutes. Make \"dipping\" stations. Beat the eggs into one small bowl, pour the flour into another bowl, and the bread crumbs into a separate bowl. Dip each fishcake into the flour first, then egg, then bread crumbs. Fry the dipped fishcakes into a heated and oiled pan for 4 minutes each. Try to achieve a golden brown color on both sides. Remove them from the pan with a slotted spoon and drain the leftover oil out on paper towels.  Finished. ",
  "tyn_model":[
    "water",
    "potatoes",
    "bowl",
    "slotted spoon",
    "flour",
    "potato masher",
    "plate",
    "butter",
    "dill",
    "salt",
    "pepper",
    "refrigerator",
    "eggs",
    "bread",
    "egg",
    "bread crumbs",
    "heated and oiled pan",
    "oil",
    "paper towels"
  ],
  "tyn_section":[

  ]
}