{
  "title":"How to Make Toffee Poke Cake",
  "url":"https://www.wikihow.com/Make-Toffee-Poke-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Chocolate Cakes"
  ],
  "steps":[
    {
      "headline":"Bake the cake in a 9x13 inch (22cm x 28cm) baking pan.",
      "description":"Use the original directions or instructions according to the recipe of your choice. Set the cake aside to cool completely."
    },
    {
      "headline":"Make the holes in the cake.",
      "description":"Use the round tip at the end of a wooden spoon to create evenly portioned holes throughout the entire cake."
    },
    {
      "headline":"Fill the holes with the butterscotch-caramel topping.",
      "description":"Pour the topping over the cake, filling in the holes as best as you can."
    },
    {
      "headline":"Use a rubber spatula to distribute the whipped cream evenly on the cake.",
      "description":"Sprinkle the top with the chopped candy."
    },
    {
      "headline":"Refrigerate the cake.",
      "description":"Use plastic wrap to cover the cake and place it in the refrigerator to chill for a few hours. This allows the filling to absorb into the cake. Allow the cake to chill until it's ready to be served."
    }
  ],
  "text":" Bake the cake in a 9x13 inch (22cm x 28cm) baking pan. Use the original directions or instructions according to the recipe of your choice. Set the cake aside to cool completely. Make the holes in the cake. Use the round tip at the end of a wooden spoon to create evenly portioned holes throughout the entire cake. Fill the holes with the butterscotch-caramel topping. Pour the topping over the cake, filling in the holes as best as you can. Use a rubber spatula to distribute the whipped cream evenly on the cake. Sprinkle the top with the chopped candy. Refrigerate the cake. Use plastic wrap to cover the cake and place it in the refrigerator to chill for a few hours. This allows the filling to absorb into the cake. Allow the cake to chill until it's ready to be served.",
  "tyn_model":[
    "baking pan",
    "wooden spoon",
    "butterscotch-caramel topping",
    "rubber spatula",
    "whipped cream",
    "plastic wrap",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}