{
  "title":"How to Start an Internet Auction Business",
  "url":"https://www.wikihow.com/Start-an-Internet-Auction-Business",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Collecting"
  ],
  "steps":[
    {
      "headline":"Registering at these internet auction sites is a relatively simple process.",
      "description":"For the purpose of this article we will stick to eBay. Ebay is miles ahead of the competition. In a distant second yahoo, which is very far behind eBay in terms of website traffic and market research."
    },
    {
      "headline":"The registration process is self-explanatory.",
      "description":"You must give your basic contact information (your name, address, number where you can be reached, email address, and of course your credit card or other payment method). You will only be charged for any sales transaction fees that you incur as a result of your listing and selling items. Each auction site will have a list of their fees (these fees are very small)."
    },
    {
      "headline":"Each site has a list of rules.",
      "description":"They may differ from site to site. You will have to get a working knowledge of these rules. Print the rules out and study them, this will save you from future headaches. Some sites will even offer online tutorials to help you become familiar with the rules and how to buy or sell on that particular auction site."
    },
    {
      "headline":"Auction sites operate a little differently when it comes to honesty and credibility.",
      "description":"They use a feedback system (which simply means that after every transaction the seller and the buyer rate each other on the entire deal: Great, Good, Excellent, bad, etc...). This score determines how reputable the seller and buyer have been. You will need to focus on doing business with people who have high feedback scores (90% or higher). Just starting out and not having a feedback score will make doing business on eBay a little more difficult but not impossible."
    },
    {
      "headline":"Placing a bid is a really easy process.",
      "description":"Before you start placing items up for auction, I recommend that you buy a few items first. You can buy 3 or 4 items for less than $50 and this will build up your feedback score."
    },
    {
      "headline":"Putting items up for auction is just a little bit more complicated.",
      "description":"When you list items on eBay, you must talk about them in a way that let’s your enthusiasm for the item show through (you want the customer to be excited from your excitement)."
    },
    {
      "headline":"Your Title- this is your headline, this should grab the readers attention.",
      "description":""
    },
    {
      "headline":"Your Item description-you will have to balance boasting about your particular item and being completely accurate about the condition of your items (being honest about flaws will not keep your items from selling).",
      "description":"If you have negatives;  alternate them with positive statements. Make sure that you have more positive statements about your items  than negative statements."
    },
    {
      "headline":"Here is a list of descriptive selling words you can include in your description.",
      "description":"Beautiful, great, fun, dramatic, pretty, fantastic, high-end, vintage, wonderful, powerful, elaborate, quality, and gorgeous."
    },
    {
      "headline":"Your terms of service are your policies for doing business.",
      "description":"This will include: shipping and handling, how soon you want receive payment and of course the different payment types you will accept. Please ponder these decisions carefully, this is the terms under which you will do business. Keep your terms as simple as you can, if they are too long and wordy you may drive customers away."
    },
    {
      "headline":"You are now a internet auction business owner.",
      "description":"Set your goals and aim high."
    }
  ],
  "text":" Registering at these internet auction sites is a relatively simple process. For the purpose of this article we will stick to eBay. Ebay is miles ahead of the competition. In a distant second yahoo, which is very far behind eBay in terms of website traffic and market research. The registration process is self-explanatory. You must give your basic contact information (your name, address, number where you can be reached, email address, and of course your credit card or other payment method). You will only be charged for any sales transaction fees that you incur as a result of your listing and selling items. Each auction site will have a list of their fees (these fees are very small). Each site has a list of rules. They may differ from site to site. You will have to get a working knowledge of these rules. Print the rules out and study them, this will save you from future headaches. Some sites will even offer online tutorials to help you become familiar with the rules and how to buy or sell on that particular auction site. Auction sites operate a little differently when it comes to honesty and credibility. They use a feedback system (which simply means that after every transaction the seller and the buyer rate each other on the entire deal: Great, Good, Excellent, bad, etc...). This score determines how reputable the seller and buyer have been. You will need to focus on doing business with people who have high feedback scores (90% or higher). Just starting out and not having a feedback score will make doing business on eBay a little more difficult but not impossible. Placing a bid is a really easy process. Before you start placing items up for auction, I recommend that you buy a few items first. You can buy 3 or 4 items for less than $50 and this will build up your feedback score. Putting items up for auction is just a little bit more complicated. When you list items on eBay, you must talk about them in a way that let’s your enthusiasm for the item show through (you want the customer to be excited from your excitement). Your Title- this is your headline, this should grab the readers attention.  Your Item description-you will have to balance boasting about your particular item and being completely accurate about the condition of your items (being honest about flaws will not keep your items from selling). If you have negatives;  alternate them with positive statements. Make sure that you have more positive statements about your items  than negative statements. Here is a list of descriptive selling words you can include in your description. Beautiful, great, fun, dramatic, pretty, fantastic, high-end, vintage, wonderful, powerful, elaborate, quality, and gorgeous. Your terms of service are your policies for doing business. This will include: shipping and handling, how soon you want receive payment and of course the different payment types you will accept. Please ponder these decisions carefully, this is the terms under which you will do business. Keep your terms as simple as you can, if they are too long and wordy you may drive customers away. You are now a internet auction business owner. Set your goals and aim high.",
  "tyn_model":[
    "ebay",
    "auction sites",
    "internet auction business owner"
  ],
  "tyn_section":[

  ]
}