{
  "title":"How to Make a Yogurt Paste Marinade",
  "url":"https://www.wikihow.com/Make-a-Yogurt-Paste-Marinade",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices",
    "Spice Mixes"
  ],
  "steps":[
    {
      "headline":"Put your desired amount of yogurt in a bowl.",
      "description":""
    },
    {
      "headline":"Cover around 1/8 of the surface with extra virgin olive oil.",
      "description":""
    },
    {
      "headline":"Sprinkle a generous amount of chili powder on it ; At this time, you can stir the mixture, it should turn slightly pink.",
      "description":""
    },
    {
      "headline":"Add the other dry ingredients, make sure not do overdo any of them, especially the garlic powder and salt.",
      "description":""
    },
    {
      "headline":"At this time you can add ingredients of your choosing, proceed with caution",
      "description":""
    },
    {
      "headline":"Mix it well, and top it off with extra lemon pepper seasoning, black pepper and mustard, then some vinegar.",
      "description":""
    },
    {
      "headline":"Stir it well .",
      "description":""
    },
    {
      "headline":"The paste is now done.",
      "description":""
    },
    {
      "headline":"---",
      "description":""
    },
    {
      "headline":"Get out your desired, thawed item that you wish to marinate.",
      "description":""
    },
    {
      "headline":"Chicken and Ground beef are HIGHLY RECOMMENDED.",
      "description":""
    },
    {
      "headline":"If you choose ground beef, make patties.",
      "description":""
    },
    {
      "headline":"Make deep cuts in the item.",
      "description":""
    },
    {
      "headline":"Drizzle the item with vinegar and apply the paste to the nooks and crannies and leave a good amount of excess paste at the bottom.",
      "description":""
    },
    {
      "headline":"Cover up the item and let it sit in the fridge for at least 3 hours.",
      "description":""
    },
    {
      "headline":"Now you can either grill it, bake it in an oven, or \"boil/fry/simmer\" it in a pan, covered.",
      "description":""
    },
    {
      "headline":"When you take out the item, splash on almost all of the remaining liquid.",
      "description":""
    },
    {
      "headline":"I suggest you serve it either by itself, or with white rice, or yellow rice(yellowed by turmeric powder)",
      "description":""
    }
  ],
  "text":" Put your desired amount of yogurt in a bowl.  Cover around 1/8 of the surface with extra virgin olive oil.  Sprinkle a generous amount of chili powder on it ; At this time, you can stir the mixture, it should turn slightly pink.  Add the other dry ingredients, make sure not do overdo any of them, especially the garlic powder and salt.  At this time you can add ingredients of your choosing, proceed with caution  Mix it well, and top it off with extra lemon pepper seasoning, black pepper and mustard, then some vinegar.  Stir it well .  The paste is now done.  ---  Get out your desired, thawed item that you wish to marinate.  Chicken and Ground beef are HIGHLY RECOMMENDED.  If you choose ground beef, make patties.  Make deep cuts in the item.  Drizzle the item with vinegar and apply the paste to the nooks and crannies and leave a good amount of excess paste at the bottom.  Cover up the item and let it sit in the fridge for at least 3 hours.  Now you can either grill it, bake it in an oven, or \"boil/fry/simmer\" it in a pan, covered.  When you take out the item, splash on almost all of the remaining liquid.  I suggest you serve it either by itself, or with white rice, or yellow rice(yellowed by turmeric powder) ",
  "tyn_model":[
    "vinegar",
    "ground beef",
    "yogurt",
    "bowl",
    "extra virgin olive oil",
    "chili powder",
    "garlic powder",
    "salt",
    "extra lemon pepper",
    "black pepper",
    "mustard",
    "chicken",
    "fridge",
    "white rice",
    "yellow rice(yellowed",
    "turmeric"
  ],
  "tyn_section":[

  ]
}