{
  "title":"How to Make Bindaetuk (Korean Pancakes)",
  "url":"https://www.wikihow.com/Make-Bindaetuk-(Korean-Pancakes)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Pancakes"
  ],
  "parts":[
    {
      "name":"Pancake Mixture",
      "steps":[
        {
          "headline":"Place the 2 cups of flour in a bowl.",
          "description":""
        },
        {
          "headline":"Gently pour ¾ cups of water, ¾ cups of vegetable oil, and 2 tsp of sesame oil into the bowl.",
          "description":""
        },
        {
          "headline":"Mix the batter together efficiently for about 2 minutes with the whisk.",
          "description":""
        },
        {
          "headline":"Place the scallions, green pepper, baking soda, and salt into the bowl.",
          "description":""
        },
        {
          "headline":"Mix evenly with the batter for 2 minutes.",
          "description":""
        },
        {
          "headline":"Place your spatula, ladle, and the batter near the stove.",
          "description":"Take your frying pan and place it on your stove."
        },
        {
          "headline":"Pour a dab of vegetable oil and spread evenly on the frying pan.",
          "description":""
        },
        {
          "headline":"Heat the frying pan over medium-low until the oil is hot.",
          "description":""
        },
        {
          "headline":"Gently pour a small mixture of the batter onto the frying pan with your ladle in a circular motion until the pancake is about 6–7 inches (15–18 cm) in diameter.",
          "description":"Caution: Make sure there is a safe distance between you and the frying pan in case of oil splatters."
        },
        {
          "headline":"Cook for 2-3 minutes then flip gently on the other side for another 2-3 minutes.",
          "description":""
        },
        {
          "headline":"Remove pancake to plate and let it cool.",
          "description":""
        },
        {
          "headline":"Repeat until the batter is gone, adding only enough additional oil to the frying pan to keep surface evenly greased.",
          "description":""
        }
      ]
    },
    {
      "name":"Dipping Sauce",
      "steps":[
        {
          "headline":"Pour 4 tbsp of soy sauce into a small bowl.",
          "description":""
        },
        {
          "headline":"Place a pinch of sesame seeds onto the soy sauce and mix gently.",
          "description":""
        },
        {
          "headline":"Add a pinch of red pepper into the sauce and mix evenly.",
          "description":"If you cannot handle spices, ignore this step!"
        },
        {
          "headline":"You have now finished making these delicious Korean pancakes!",
          "description":"Now sit down and relax with a cup of coffee or tea and a plate of these pancakes. Enjoy!"
        }
      ]
    }
  ],
  "text":" Pancake Mixture Place the 2 cups of flour in a bowl.  Gently pour ¾ cups of water, ¾ cups of vegetable oil, and 2 tsp of sesame oil into the bowl.  Mix the batter together efficiently for about 2 minutes with the whisk.  Place the scallions, green pepper, baking soda, and salt into the bowl.  Mix evenly with the batter for 2 minutes.  Place your spatula, ladle, and the batter near the stove. Take your frying pan and place it on your stove. Pour a dab of vegetable oil and spread evenly on the frying pan.  Heat the frying pan over medium-low until the oil is hot.  Gently pour a small mixture of the batter onto the frying pan with your ladle in a circular motion until the pancake is about 6–7 inches (15–18 cm) in diameter. Caution: Make sure there is a safe distance between you and the frying pan in case of oil splatters. Cook for 2-3 minutes then flip gently on the other side for another 2-3 minutes.  Remove pancake to plate and let it cool.  Repeat until the batter is gone, adding only enough additional oil to the frying pan to keep surface evenly greased.  Dipping Sauce Pour 4 tbsp of soy sauce into a small bowl.  Place a pinch of sesame seeds onto the soy sauce and mix gently.  Add a pinch of red pepper into the sauce and mix evenly. If you cannot handle spices, ignore this step! You have now finished making these delicious Korean pancakes! Now sit down and relax with a cup of coffee or tea and a plate of these pancakes. Enjoy!",
  "tyn_model":[
    "frying pan",
    "bowl",
    "vegetable oil",
    "ladle",
    "stove",
    "oil",
    "soy sauce",
    "flour",
    "water",
    "sesame oil",
    "whisk",
    "scallions",
    "green pepper",
    "baking soda",
    "salt",
    "spatula",
    "small bowl",
    "sesame seeds",
    "red pepper",
    "tea"
  ],
  "tyn_section":[

  ]
}