{
  "title":"How to Build a 8 by 10 Feet  Storage Shed",
  "url":"https://www.wikihow.com/Build-a-8-by-10-Feet--Storage-Shed",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Outdoor Buildings",
    "Sheds"
  ],
  "steps":[
    {
      "headline":"Set the four concrete blocks in the four corners of the shed site.",
      "description":"Level the blocks."
    },
    {
      "headline":"Frame the floor by setting the 2x6 treated lumber on top of the blocks.",
      "description":""
    },
    {
      "headline":"Nail the frame together.",
      "description":""
    },
    {
      "headline":"Nail the ¾ inch plywood to the frame.",
      "description":""
    },
    {
      "headline":"Frame 4 6-foot high sections of wall with the 2x4s.",
      "description":"(Caution: Door and window openings should be incorporated in the appropriate walls.)"
    },
    {
      "headline":"Erect the walls one by one on the floor.",
      "description":""
    },
    {
      "headline":"Frame the roof by building six trusses.",
      "description":""
    },
    {
      "headline":"Attach the trusses to the walls, starting with the outside ones and working toward the center of the shed.",
      "description":""
    },
    {
      "headline":"Nail the ship lapped boards to the wall frame and the ½ plywood to the roof frame.",
      "description":""
    },
    {
      "headline":"Cover the roof with shingles.",
      "description":""
    },
    {
      "headline":"Build and hang door.",
      "description":""
    },
    {
      "headline":"Install a salvaged window in the wall opening.",
      "description":""
    },
    {
      "headline":"Remove nails.",
      "description":""
    },
    {
      "headline":"Scrap lumber and other debris from site.",
      "description":""
    }
  ],
  "text":" Set the four concrete blocks in the four corners of the shed site. Level the blocks. Frame the floor by setting the 2x6 treated lumber on top of the blocks.  Nail the frame together.  Nail the ¾ inch plywood to the frame.  Frame 4 6-foot high sections of wall with the 2x4s. (Caution: Door and window openings should be incorporated in the appropriate walls.) Erect the walls one by one on the floor.  Frame the roof by building six trusses.  Attach the trusses to the walls, starting with the outside ones and working toward the center of the shed.  Nail the ship lapped boards to the wall frame and the ½ plywood to the roof frame.  Cover the roof with shingles.  Build and hang door.  Install a salvaged window in the wall opening.  Remove nails.  Scrap lumber and other debris from site. ",
  "tyn_model":[
    "lumber",
    "plywood",
    "concrete",
    "boards",
    "shingles",
    "nails"
  ],
  "tyn_section":[

  ]
}