{
  "title":"How to Make a Chocolate Cake in a Pressure Cooker",
  "url":"https://www.wikihow.com/Make-a-Chocolate-Cake-in-a-Pressure-Cooker",
  "category_hierarchy":[
    "Home and Garden",
    "Home Appliances"
  ],
  "steps":[
    {
      "headline":"Break 2 eggs in a bowl and beat it well.",
      "description":""
    },
    {
      "headline":"Add 1 tsp of vanilla essence and 1/2 a cup of oil and beat it well.",
      "description":""
    },
    {
      "headline":"Add flour little by little and beat it until the batter becomes smooth.",
      "description":""
    },
    {
      "headline":"Add 1/2 tsp of baking powder and 1/2 a cup of sugar.",
      "description":"Mix it well and beat it until it becomes smooth."
    },
    {
      "headline":"Add 4 tsps of cocoa powder and mix until it looks like a liquid chocolate.",
      "description":""
    },
    {
      "headline":"Take a tin suitable for the pressure cooker and grease it with oil.",
      "description":""
    },
    {
      "headline":"Add flour little by little above the oil in the tin.",
      "description":""
    },
    {
      "headline":"Pour the batter into the tin.",
      "description":""
    },
    {
      "headline":"Preheat for 5 minutes on high temperature.",
      "description":""
    },
    {
      "headline":"Place the cake mixture into the pressure cooker.",
      "description":"Leave on a low heat for approximately 25-30 minutes."
    },
    {
      "headline":"After 25 minutes, open the pressure cooker and put a knife in the center of the cake.",
      "description":"If it the cake mixture sticks to the knife, place the cake back into the pressure cooker for an extra 5-10 minutes. If there is no mixture on your knife, your cake is cooked."
    },
    {
      "headline":"Remove the cake from the tin.",
      "description":""
    },
    {
      "headline":"Plate up, and serve.",
      "description":""
    }
  ],
  "text":" Break 2 eggs in a bowl and beat it well.  Add 1 tsp of vanilla essence and 1/2 a cup of oil and beat it well.  Add flour little by little and beat it until the batter becomes smooth.  Add 1/2 tsp of baking powder and 1/2 a cup of sugar. Mix it well and beat it until it becomes smooth. Add 4 tsps of cocoa powder and mix until it looks like a liquid chocolate.  Take a tin suitable for the pressure cooker and grease it with oil.  Add flour little by little above the oil in the tin.  Pour the batter into the tin.  Preheat for 5 minutes on high temperature.  Place the cake mixture into the pressure cooker. Leave on a low heat for approximately 25-30 minutes. After 25 minutes, open the pressure cooker and put a knife in the center of the cake. If it the cake mixture sticks to the knife, place the cake back into the pressure cooker for an extra 5-10 minutes. If there is no mixture on your knife, your cake is cooked. Remove the cake from the tin.  Plate up, and serve. ",
  "tyn_model":[
    "pressure cooker",
    "oil",
    "knife",
    "flour",
    "eggs",
    "bowl",
    "vanilla essence",
    "baking powder",
    "sugar",
    "cocoa powder"
  ],
  "tyn_section":[

  ]
}