{
  "title":"How to Get Wax off Carpets",
  "url":"https://www.wikihow.com/Get-Wax-off-Carpets",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Stain Removal",
    "Wax Removal"
  ],
  "methods":[
    {
      "name":"Using an Iron",
      "steps":[
        {
          "headline":"Plug your iron in somewhere within reach of the waxy patch.",
          "description":"Turn the iron onto its lowest setting and do not use the steam function on the iron, if it exists."
        },
        {
          "headline":"Using a blunt knife, scrape off as much excess wax as possible.",
          "description":"The back of a butter knife is fine. You can do this while waiting for you iron to heat up."
        },
        {
          "headline":"Lay some brown paper or a paper towel over the remaining wax and iron over the top.",
          "description":"Keep the iron moving slowly, just as you would when ironing clothes, and make sure you don't burn anything. The heat will cause the wax to melt and absorb into the paper."
        },
        {
          "headline":"Reposition the paper and keep ironing over a fresh part of the piece of paper until most of the wax has been absorbed.",
          "description":""
        },
        {
          "headline":"Check the carpet for stains.",
          "description":"If stains or dyes exist:\nTry blotting a little bit of rubbing alcohol onto the area with a white cloth or rag. Take care not to drench the carpet in rubbing alcohol, though. Keep blotting the stain until it no longer appears on the carpet. Cover wet area with a clean cloth and cover with books or other heavy objects overnight in order to soak up any remaining rubbing alcohol."
        }
      ]
    },
    {
      "name":"Using a Lighter and a Spoon",
      "steps":[
        {
          "headline":"Freeze the wax first with ice cubes.",
          "description":"Take four or five ice cubes, put them in a plastic bag, and cover the wax until it is suitably frozen."
        },
        {
          "headline":"With a knife, softly remove as much cold wax as you can without damaging the fabric.",
          "description":""
        },
        {
          "headline":"Cover any remaining wax with blotting paper.",
          "description":""
        },
        {
          "headline":"Heat the back of an old spoon for 5 to 10 seconds under a lighter flame.",
          "description":"A match is suitable, but a lighter is easier to use, and you don't risk burning yourself or dropping any spent embers."
        },
        {
          "headline":"With the spoon still hot, move the back of it over the blotting paper, on top of the wax.",
          "description":"Make sure the back of your spoon gets placed directly where the wax is. Notice how the blotting paper soaks up the wax."
        },
        {
          "headline":"Using different parts of the blotting paper, repeat heating the spoon and placing it on top of the wax.",
          "description":""
        },
        {
          "headline":"Clean any remaining dye/stains with rubbing alcohol or carpet detergent.",
          "description":"Use rubbing alcohol (method explained above) or carpet detergent to lift any remaining dye from the wax from the carpet. Mix one 1/2 tablespoon of carpet detergent with 2 cups of warm water. Soak a cloth in the mixture, wring out, and cover the stain with the cloth. Move from the outside in, gently working the cloth into the carpet and being careful not to spread the stain elsewhere on the carpet. Repeat until as much dye as possible has been removed. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/73\\/Get-Wax-off-Carpets-Step-13.jpg\\/v4-460px-Get-Wax-off-Carpets-Step-13.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/73\\/Get-Wax-off-Carpets-Step-13.jpg\\/v4-760px-Get-Wax-off-Carpets-Step-13.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        }
      ]
    }
  ],
  "text":" Using an Iron Plug your iron in somewhere within reach of the waxy patch. Turn the iron onto its lowest setting and do not use the steam function on the iron, if it exists. Using a blunt knife, scrape off as much excess wax as possible. The back of a butter knife is fine. You can do this while waiting for you iron to heat up. Lay some brown paper or a paper towel over the remaining wax and iron over the top. Keep the iron moving slowly, just as you would when ironing clothes, and make sure you don't burn anything. The heat will cause the wax to melt and absorb into the paper. Reposition the paper and keep ironing over a fresh part of the piece of paper until most of the wax has been absorbed.  Check the carpet for stains. If stains or dyes exist:\nTry blotting a little bit of rubbing alcohol onto the area with a white cloth or rag. Take care not to drench the carpet in rubbing alcohol, though. Keep blotting the stain until it no longer appears on the carpet. Cover wet area with a clean cloth and cover with books or other heavy objects overnight in order to soak up any remaining rubbing alcohol. Using a Lighter and a Spoon Freeze the wax first with ice cubes. Take four or five ice cubes, put them in a plastic bag, and cover the wax until it is suitably frozen. With a knife, softly remove as much cold wax as you can without damaging the fabric.  Cover any remaining wax with blotting paper.  Heat the back of an old spoon for 5 to 10 seconds under a lighter flame. A match is suitable, but a lighter is easier to use, and you don't risk burning yourself or dropping any spent embers. With the spoon still hot, move the back of it over the blotting paper, on top of the wax. Make sure the back of your spoon gets placed directly where the wax is. Notice how the blotting paper soaks up the wax. Using different parts of the blotting paper, repeat heating the spoon and placing it on top of the wax.  Clean any remaining dye/stains with rubbing alcohol or carpet detergent. Use rubbing alcohol (method explained above) or carpet detergent to lift any remaining dye from the wax from the carpet. Mix one 1/2 tablespoon of carpet detergent with 2 cups of warm water. Soak a cloth in the mixture, wring out, and cover the stain with the cloth. Move from the outside in, gently working the cloth into the carpet and being careful not to spread the stain elsewhere on the carpet. Repeat until as much dye as possible has been removed. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/73\\/Get-Wax-off-Carpets-Step-13.jpg\\/v4-460px-Get-Wax-off-Carpets-Step-13.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/7\\/73\\/Get-Wax-off-Carpets-Step-13.jpg\\/v4-760px-Get-Wax-off-Carpets-Step-13.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}",
  "tyn_model":[
    "iron",
    "rubbing alcohol",
    "spoon",
    "blotting paper",
    "wax",
    "carpet detergent",
    "lighter",
    "ice cubes",
    "cloth",
    "butter knife",
    "brown paper",
    "paper towel",
    "paper",
    "white cloth",
    "plastic bag",
    "knife",
    "warm water",
    "dye",
    "parser"
  ],
  "tyn_section":[

  ]
}