{
  "title":"How to Make Papier Mâché Paste",
  "url":"https://www.wikihow.com/Make-Papier-M%C3%A2ch%C3%A9-Paste",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Papier Mache"
  ],
  "methods":[
    {
      "name":"Making Your Paste on the Stove",
      "steps":[
        {
          "headline":"Get your water started.",
          "description":"Measure ½ cup of water, and add it to a pot. Turn the heat on high and bring it to a boil"
        },
        {
          "headline":"Create your flour mixture.",
          "description":"Add ½ cup of flour, ½ cup of cold water, and ¾ teaspoon of salt together to a bowl. Mix these well to create a thin paste."
        },
        {
          "headline":"Combine your ingredients.",
          "description":"Pour the flour mixture into the boiling water and stir, keeping the mixture at a boil for five minutes. Then, turn off the stove and continue stirring until a thick paste forms."
        },
        {
          "headline":"Wait for it to cool.",
          "description":"After a thick paste has formed, leave it to cool on the stove until it is cool to the touch. If you are in a hurry, you can consider letting it set on a cold burner for 15 minutes, and then placing it in the freezer for another 15-20 minutes."
        },
        {
          "headline":"Stir before use.",
          "description":"As soon as your paste has cooled to room temperature, it is ready to use! Apply it to your papier mâché project using a paintbrush for the smoothest coat. Don't worry about heating it up again unless it is too thick to use. Store any excess in a glass jar and refrigerate."
        }
      ]
    },
    {
      "name":"Making Paste Using the Shaking Method",
      "steps":[
        {
          "headline":"Combine your ingredients.",
          "description":"Add ½ cup of flour, ½ cup of cool water, and ¾ teaspoon of salt to a plastic bag. If you would like, you can optionally add food coloring to change the hue of your glue."
        },
        {
          "headline":"Mix the ingredients.",
          "description":"Close the top of the bag and check that it is secure. Then, shake the bag vigorously to mix all the ingredients. Use your fingers to squish any lumps of flour that won't mix in."
        },
        {
          "headline":"Finish your glue.",
          "description":"When you are certain that your paste is well stirred, you can cut a small hole at one of the bottom corners of the bag."
        },
        {
          "headline":"Use your papier mâché paste.",
          "description":"Hold the bag like you would an icing bag and gently squeeze the paste from the corner. Use a paintbrush to spread out the glue over the item you are decoupaging."
        }
      ]
    },
    {
      "name":"Making Paste Using White Glue",
      "steps":[
        {
          "headline":"Gather your ingredients.",
          "description":"To create this paste, you will need a plain white school glue, cool water, and a bowl to mix it in."
        },
        {
          "headline":"Combine the ingredients.",
          "description":"Add 3 parts of glue to 1 part of water to the bowl. Use a spoon to stir the mixture so that the glue and water are thoroughly combined."
        },
        {
          "headline":"Use your glue.",
          "description":"Your glue is ready to use immediately after mixing with the water. Use a paintbrush to dip in the paste and layer onto the object you are using for papier mâché."
        }
      ]
    }
  ],
  "text":" Making Your Paste on the Stove Get your water started. Measure ½ cup of water, and add it to a pot. Turn the heat on high and bring it to a boil Create your flour mixture. Add ½ cup of flour, ½ cup of cold water, and ¾ teaspoon of salt together to a bowl. Mix these well to create a thin paste. Combine your ingredients. Pour the flour mixture into the boiling water and stir, keeping the mixture at a boil for five minutes. Then, turn off the stove and continue stirring until a thick paste forms. Wait for it to cool. After a thick paste has formed, leave it to cool on the stove until it is cool to the touch. If you are in a hurry, you can consider letting it set on a cold burner for 15 minutes, and then placing it in the freezer for another 15-20 minutes. Stir before use. As soon as your paste has cooled to room temperature, it is ready to use! Apply it to your papier mâché project using a paintbrush for the smoothest coat. Don't worry about heating it up again unless it is too thick to use. Store any excess in a glass jar and refrigerate. Making Paste Using the Shaking Method Combine your ingredients. Add ½ cup of flour, ½ cup of cool water, and ¾ teaspoon of salt to a plastic bag. If you would like, you can optionally add food coloring to change the hue of your glue. Mix the ingredients. Close the top of the bag and check that it is secure. Then, shake the bag vigorously to mix all the ingredients. Use your fingers to squish any lumps of flour that won't mix in. Finish your glue. When you are certain that your paste is well stirred, you can cut a small hole at one of the bottom corners of the bag. Use your papier mâché paste. Hold the bag like you would an icing bag and gently squeeze the paste from the corner. Use a paintbrush to spread out the glue over the item you are decoupaging. Making Paste Using White Glue Gather your ingredients. To create this paste, you will need a plain white school glue, cool water, and a bowl to mix it in. Combine the ingredients. Add 3 parts of glue to 1 part of water to the bowl. Use a spoon to stir the mixture so that the glue and water are thoroughly combined. Use your glue. Your glue is ready to use immediately after mixing with the water. Use a paintbrush to dip in the paste and layer onto the object you are using for papier mâché.",
  "tyn_model":[
    "water",
    "glue",
    "flour",
    "bowl",
    "salt",
    "stove",
    "pot",
    "cold water",
    "freezer",
    "papier mâché",
    "glass jar",
    "plastic bag",
    "food coloring",
    "papier mâché paste",
    "icing bag",
    "white glue",
    "white school glue",
    "spoon"
  ],
  "tyn_section":[

  ]
}