{
  "title":"How to Make Farmer's Cheese Stew",
  "url":"https://www.wikihow.com/Make-Farmer%27s-Cheese-Stew",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Cheese"
  ],
  "steps":[
    {
      "headline":"Use oil to fry farmer's cheese.",
      "description":"Make sure it gets brown. Keep oil aside."
    },
    {
      "headline":"Take 1 onion and cut it in half.",
      "description":"Get one half and dice. (After peeling and washing). Cut the remaining 1 and 1/2 onion and cut. Put it in the blender. Wash the pepper and put in the blender too with 1 and half chopped can of tomatoes. Leave the other half for later."
    },
    {
      "headline":"Add a little bit of water and blend till there are no lumps.",
      "description":""
    },
    {
      "headline":"Pour saved oil in saucepan and allow to get hot.",
      "description":"Put diced onion in oil. Stir and allow to get light brown."
    },
    {
      "headline":"Put tomato puree in oil and stir to mix.",
      "description":""
    },
    {
      "headline":"Pour the blended onion, pepper and tomato into the sauce with oil and diced onion.",
      "description":""
    },
    {
      "headline":"Put three pinches of salt and cube or Maggie.",
      "description":"Stir and leave on fire for about 3 mins and then stir."
    },
    {
      "headline":"Put fried farmers cheese in sauce.",
      "description":"Put fire power down.Add 1 teaspoon of oil to sauce and leave for 5-10 mins."
    },
    {
      "headline":"Enjoy your stew!",
      "description":""
    }
  ],
  "text":" Use oil to fry farmer's cheese. Make sure it gets brown. Keep oil aside. Take 1 onion and cut it in half. Get one half and dice. (After peeling and washing). Cut the remaining 1 and 1/2 onion and cut. Put it in the blender. Wash the pepper and put in the blender too with 1 and half chopped can of tomatoes. Leave the other half for later. Add a little bit of water and blend till there are no lumps.  Pour saved oil in saucepan and allow to get hot. Put diced onion in oil. Stir and allow to get light brown. Put tomato puree in oil and stir to mix.  Pour the blended onion, pepper and tomato into the sauce with oil and diced onion.  Put three pinches of salt and cube or Maggie. Stir and leave on fire for about 3 mins and then stir. Put fried farmers cheese in sauce. Put fire power down.Add 1 teaspoon of oil to sauce and leave for 5-10 mins. Enjoy your stew! ",
  "tyn_model":[
    "oil",
    "onion",
    "blender",
    "pepper",
    "farmer's cheese",
    "tomatoes",
    "water",
    "saucepan",
    "tomato puree",
    "tomato",
    "salt",
    "fried farmers cheese"
  ],
  "tyn_section":[

  ]
}