{
  "title":"How to Use a Quesadilla Maker",
  "url":"https://www.wikihow.com/Use-a-Quesadilla-Maker",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Central and South American Cuisine",
    "Quesadillas"
  ],
  "steps":[
    {
      "headline":"Plug in the quesadilla maker.",
      "description":"Get out two tortillas that have been in the refrigerator. Get out shredded cheese."
    },
    {
      "headline":"When the green light goes out, open up the maker and lay one tortilla down.",
      "description":""
    },
    {
      "headline":"Spread cheese lightly on the tortilla - make sure it's even.",
      "description":""
    },
    {
      "headline":"Put the second tortilla on the other one with the shredded cheese lightly melted.",
      "description":"Lightly press down on the maker. Keep down till you hear the cheese sizzle and you see it coming out of the quesadilla."
    },
    {
      "headline":"Lift open the maker, and remove the quesadilla.",
      "description":"Let it cool for one minute."
    },
    {
      "headline":"Cut along lines of the quesadilla into four equal parts.",
      "description":""
    },
    {
      "headline":"Unplug the maker.",
      "description":""
    },
    {
      "headline":"Enjoy your cheese quesadilla.",
      "description":""
    }
  ],
  "text":" Plug in the quesadilla maker. Get out two tortillas that have been in the refrigerator. Get out shredded cheese. When the green light goes out, open up the maker and lay one tortilla down.  Spread cheese lightly on the tortilla - make sure it's even.  Put the second tortilla on the other one with the shredded cheese lightly melted. Lightly press down on the maker. Keep down till you hear the cheese sizzle and you see it coming out of the quesadilla. Lift open the maker, and remove the quesadilla. Let it cool for one minute. Cut along lines of the quesadilla into four equal parts.  Unplug the maker.  Enjoy your cheese quesadilla. ",
  "tyn_model":[
    "maker",
    "quesadilla maker",
    "refrigerator",
    "cheese",
    "cheese quesadilla"
  ],
  "tyn_section":[

  ]
}