{
  "title":"How to Play Catchy Tunes in Mario Party 7",
  "url":"https://www.wikihow.com/Play-Catchy-Tunes-in-Mario-Party-7",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Mario Party Series"
  ],
  "steps":[
    {
      "headline":"Learn the objective of the game.",
      "description":"Gather five different music symbols in 30 seconds."
    },
    {
      "headline":"Jump to grab them.",
      "description":"Use the \"A\" button to jump to get the musical symbols that are falling from above."
    },
    {
      "headline":"Jump on the other players.",
      "description":"Jumping on them will stun them for a few seconds, not allowing them to move for the time being."
    },
    {
      "headline":"Watch the shadows of the notes.",
      "description":"This will determine where the symbols will fall."
    },
    {
      "headline":"Keep an eye on your chart.",
      "description":"This will log which symbol you captured."
    },
    {
      "headline":"Learn how a winner is determined.",
      "description":"If a character captures all five symbols within the 30-second time limit, they win the minigame. If no characters manages to get all five symbols within the time limit, the minigame ends in a tie."
    }
  ],
  "text":" Learn the objective of the game. Gather five different music symbols in 30 seconds. Jump to grab them. Use the \"A\" button to jump to get the musical symbols that are falling from above. Jump on the other players. Jumping on them will stun them for a few seconds, not allowing them to move for the time being. Watch the shadows of the notes. This will determine where the symbols will fall. Keep an eye on your chart. This will log which symbol you captured. Learn how a winner is determined. If a character captures all five symbols within the 30-second time limit, they win the minigame. If no characters manages to get all five symbols within the time limit, the minigame ends in a tie.",
  "tyn_model":[

  ],
  "tyn_section":[

  ]
}