{
  "title":"How to Make Fruit Puree",
  "url":"https://www.wikihow.com/Make-Fruit-Puree",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "methods":[
    {
      "name":"Banana-Apple Puree",
      "steps":[
        {
          "headline":"Peel the apple.",
          "description":"Remove the core and rasp the apple into a bowl."
        },
        {
          "headline":"Peel the banana.",
          "description":"Cut the banana into small pieces with a knife and puree it with a fork until it smooth."
        },
        {
          "headline":"Mix both the apple and the banana until the mixture is smooth.",
          "description":"You can add some orange juice to it for extra flavour but this isn't necessary. To make the puree thicker you can add a cookie for kids usually a grain cookie."
        }
      ]
    },
    {
      "name":"Melon-Apricot Puree",
      "steps":[
        {
          "headline":"Remove the pit out of the apricots and cut the apricots into pieces.",
          "description":""
        },
        {
          "headline":"Remove the pits of the melon.",
          "description":"Peel the melon and remove the pits out of it."
        },
        {
          "headline":"Puree both in a bowl while using a fork.",
          "description":""
        }
      ]
    },
    {
      "name":"Peach Puree",
      "steps":[
        {
          "headline":"Peel the peach.",
          "description":""
        },
        {
          "headline":"Remove the pit.",
          "description":""
        },
        {
          "headline":"Cut the peach into pieces.",
          "description":""
        },
        {
          "headline":"Puree the peach with a knife into a bowl.",
          "description":"To make the puree thicker you can add a cookie for kids usually a grain cookie."
        }
      ]
    },
    {
      "name":"Kiwi Puree",
      "steps":[
        {
          "headline":"Peal the kiwi.",
          "description":""
        },
        {
          "headline":"Cut it into pieces.",
          "description":""
        },
        {
          "headline":"Puree the kiwi with a fork until the mixture is smooth.",
          "description":"To make the puree thicker, you can add a cookie for kids, This is usually a grain cookie."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Banana-Apple Puree Peel the apple. Remove the core and rasp the apple into a bowl. Peel the banana. Cut the banana into small pieces with a knife and puree it with a fork until it smooth. Mix both the apple and the banana until the mixture is smooth. You can add some orange juice to it for extra flavour but this isn't necessary. To make the puree thicker you can add a cookie for kids usually a grain cookie. Melon-Apricot Puree Remove the pit out of the apricots and cut the apricots into pieces.  Remove the pits of the melon. Peel the melon and remove the pits out of it. Puree both in a bowl while using a fork.  Peach Puree Peel the peach.  Remove the pit.  Cut the peach into pieces.  Puree the peach with a knife into a bowl. To make the puree thicker you can add a cookie for kids usually a grain cookie. Kiwi Puree Peal the kiwi.  Cut it into pieces.  Puree the kiwi with a fork until the mixture is smooth. To make the puree thicker, you can add a cookie for kids, This is usually a grain cookie. Finished. ",
  "tyn_model":[
    "apple",
    "bowl",
    "banana",
    "fork",
    "cookie",
    "peach",
    "knife",
    "apricots",
    "orange juice",
    "melon"
  ],
  "tyn_section":[

  ]
}