{
  "title":"How to Make a Paper Boat",
  "url":"https://www.wikihow.com/Make-a-Paper-Boat",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Model Making",
    "Model Boats and Ships"
  ],
  "parts":[
    {
      "name":"Creating the Initial Folds",
      "steps":[
        {
          "headline":"Fold an 8 ½ in x 11 in (21.5 cm x 28 cm) sheet of paper in half.",
          "description":"Lay the paper down vertically and fold it from left to right so that its corners meet up. You can use ordinary white printer paper, construction paper, or origami paper. This is called folding the paper \"hot dog style.\" Make a neat crease along the paper. To strengthen the crease, run your finger down the fold 3-4 more times."
        },
        {
          "headline":"Unfold the paper, rotate it 90 degrees, and fold it in half again.",
          "description":"At this point, the paper should be lying down horizontally. Once you’ve adjusted the paper, fold from left to right. This \"hamburger style\" fold will create a new crease in the center of the page. You should now have 2 creases along both centers (x-axis and y-axis) of the page."
        },
        {
          "headline":"Flip the paper so that the fold opens toward you.",
          "description":"Then, fold down the top corners towards the middle of the paper while leaving 1-2 in (2.5-5 cm) of space at the bottom. Make sure the folds line up with the center crease. Crease along the edges to secure the folds. Use the crease you made before to help line up the folds coming in from the corners."
        },
        {
          "headline":"Bring the bottom of the paper up to fold it against both sides.",
          "description":"Grab the flap at the bottom of the paper and fold it up against the bottom of the 2 folded triangles. Turn the paper over and do the same thing to the flap on that side. This will make a paper hat. The 2 folds should line up with each other.Tip: When you go to fold the second side, use the first fold as a reference point."
        },
        {
          "headline":"Take the bottom corners and fold them in.",
          "description":"On 1 side of the paper, grab the corners of the rectangle that are sticking out over the triangle. Wrap these parts of the paper around the edges of the triangle and crease them so that they stay wrapped around the edge of the triangle. Then, fold the bottom flaps around the edges of the triangle and back towards you. Take it a step further: Try out our new wikiHow Origami for Beginners Course! Learn popular origami and test your hand at more advanced figures.Take it a step further: Watch this video for access to our origami class\nThe flaps closest to you should be folded in front of the back flaps, not over them. If you fold over the back flaps, you won’t be able to fold the back flaps themselves."
        }
      ]
    },
    {
      "name":"Making the Final Folds",
      "steps":[
        {
          "headline":"Make the triangle into a square.",
          "description":"Pick up the triangle, rotate it 45 degrees, then use your fingers to open up the bottom of the triangle. Pull the paper apart gently until it pops into a square shape. Make sure the bottom corners of the triangle fold over each other and become the bottom corner of a diamond. Crease the paper along its edges so that it stays in the square shape."
        },
        {
          "headline":"Fold up the bottom flaps.",
          "description":"Arrange your paper so that the bottom points of the diamond can fold upward. Fold up 1 corner, aligning it with the top corner. Then, flip the paper over and do the same thing to the other side. The bottom of the diamond should be the part of the paper with extra folds."
        },
        {
          "headline":"Construct the triangle into a square again.",
          "description":"Just like last time, pick up the triangle, rotate it 45 degrees, then open up the bottom of your new triangle with your fingers. Crease the paper along its edges so that it stays in the square shape. The bottom corners will line up to become the bottom point of a square diamond."
        },
        {
          "headline":"Pull out the triangles on the side of the square.",
          "description":"Start at the top of the diamond, and gently pull the two sides apart so that the seam running down the middle of the diamond blooms. Crease the bottom of the folded out sides to make the boat a bit stronger. You may need to pull up the triangle inside the diamond while pulling apart the two sides. Try to keep the triangle inside the diamond sticking straight up as this will be your boat's \"mast.\""
        },
        {
          "headline":"Float your boat.",
          "description":"Fill a small tub with water and place the boat on the water. If it starts to droop a little, keep making small adjustments to keep the sides up and prevent the boat from sinking. You can reinforce the corners with clear tape and tape around the bottom to keep your boat dry.Tip: Waterproof your boat! Use a waxed paper from an art store to make your boat last longer, or color one side of the paper completely with a crayon. You can also try to make your boat out of aluminum foil."
        }
      ]
    }
  ],
  "text":" Creating the Initial Folds Fold an 8 ½ in x 11 in (21.5 cm x 28 cm) sheet of paper in half. Lay the paper down vertically and fold it from left to right so that its corners meet up. You can use ordinary white printer paper, construction paper, or origami paper. This is called folding the paper \"hot dog style.\" Make a neat crease along the paper. To strengthen the crease, run your finger down the fold 3-4 more times. Unfold the paper, rotate it 90 degrees, and fold it in half again. At this point, the paper should be lying down horizontally. Once you’ve adjusted the paper, fold from left to right. This \"hamburger style\" fold will create a new crease in the center of the page. You should now have 2 creases along both centers (x-axis and y-axis) of the page. Flip the paper so that the fold opens toward you. Then, fold down the top corners towards the middle of the paper while leaving 1-2 in (2.5-5 cm) of space at the bottom. Make sure the folds line up with the center crease. Crease along the edges to secure the folds. Use the crease you made before to help line up the folds coming in from the corners. Bring the bottom of the paper up to fold it against both sides. Grab the flap at the bottom of the paper and fold it up against the bottom of the 2 folded triangles. Turn the paper over and do the same thing to the flap on that side. This will make a paper hat. The 2 folds should line up with each other.Tip: When you go to fold the second side, use the first fold as a reference point. Take the bottom corners and fold them in. On 1 side of the paper, grab the corners of the rectangle that are sticking out over the triangle. Wrap these parts of the paper around the edges of the triangle and crease them so that they stay wrapped around the edge of the triangle. Then, fold the bottom flaps around the edges of the triangle and back towards you. Take it a step further: Try out our new wikiHow Origami for Beginners Course! Learn popular origami and test your hand at more advanced figures.Take it a step further: Watch this video for access to our origami class\nThe flaps closest to you should be folded in front of the back flaps, not over them. If you fold over the back flaps, you won’t be able to fold the back flaps themselves. Making the Final Folds Make the triangle into a square. Pick up the triangle, rotate it 45 degrees, then use your fingers to open up the bottom of the triangle. Pull the paper apart gently until it pops into a square shape. Make sure the bottom corners of the triangle fold over each other and become the bottom corner of a diamond. Crease the paper along its edges so that it stays in the square shape. Fold up the bottom flaps. Arrange your paper so that the bottom points of the diamond can fold upward. Fold up 1 corner, aligning it with the top corner. Then, flip the paper over and do the same thing to the other side. The bottom of the diamond should be the part of the paper with extra folds. Construct the triangle into a square again. Just like last time, pick up the triangle, rotate it 45 degrees, then open up the bottom of your new triangle with your fingers. Crease the paper along its edges so that it stays in the square shape. The bottom corners will line up to become the bottom point of a square diamond. Pull out the triangles on the side of the square. Start at the top of the diamond, and gently pull the two sides apart so that the seam running down the middle of the diamond blooms. Crease the bottom of the folded out sides to make the boat a bit stronger. You may need to pull up the triangle inside the diamond while pulling apart the two sides. Try to keep the triangle inside the diamond sticking straight up as this will be your boat's \"mast.\" Float your boat. Fill a small tub with water and place the boat on the water. If it starts to droop a little, keep making small adjustments to keep the sides up and prevent the boat from sinking. You can reinforce the corners with clear tape and tape around the bottom to keep your boat dry.Tip: Waterproof your boat! Use a waxed paper from an art store to make your boat last longer, or color one side of the paper completely with a crayon. You can also try to make your boat out of aluminum foil.",
  "tyn_model":[
    "paper",
    "water",
    "construction paper",
    "paper hat",
    "origami",
    "origami class",
    "clear tape",
    "tape",
    "waxed paper",
    "crayon",
    "aluminum foil"
  ],
  "tyn_section":[

  ]
}