{
  "title":"How to Safely Turn off the Pilot Lights on Your Gas Stove",
  "url":"https://www.wikihow.com/Safely-Turn-off-the-Pilot-Lights-on-Your-Gas-Stove",
  "category_hierarchy":[
    "Home and Garden",
    "Home Appliances"
  ],
  "parts":[
    {
      "name":"Identifying the Pilot Light",
      "steps":[
        {
          "headline":"Open the windows in your kitchen.",
          "description":"Before you can look more closely at the pilot light, it’s important that you open several windows in the same room as the stove so there is no chance of carbon monoxide gas getting trapped in the room. Carbon monoxide (CO) is a colorless, odorless gas that can be poisonous at high levels of exposure. Your gas stove contains carbon monoxide, so it is important that you turn off the stove correctly and maintain good airflow when you look at the pilot light."
        },
        {
          "headline":"Expose the burners on the gas range.",
          "description":"A gas kitchen range, or stove, usually has two or more pilot lights. There are one to two pilot lights that heat up the surface burners on the top of your stove and one pilot light that ignites the burners to heat your oven. To expose the pilot lights on your stovetop so you can see them, make sure the burners on the stovetop are all turned to the OFF position and the oven is turned to OFF. If you have used the stovetop recently, wait at least an hour for the burners to cool down. Then, take the metal covers of the burners off and place them to one side. Run your hands along the front bottom of the stove top and the stovetop up. There should be a latch under the stove top to prop the stovetop up. Make sure the latch is in place and the stovetop is firmly propped."
        },
        {
          "headline":"Identify the pilot lights.",
          "description":"Once the stovetop burners are exposed, you should see four round cylinders for each burner on the stovetop, or two round cylinders if you have a two burner stovetop. There will be a main gas line on the left and right sides of the stovetop, running from the top and the bottom burners. In the middle of both burners, there should be two small openings. These openings are where the flame for the pilot light would be if the stove top was turned ON. There should be no flame, as your stovetop is set to OFF."
        }
      ]
    },
    {
      "name":"Switching the Pilot Light Off",
      "steps":[
        {
          "headline":"Check the owner’s manual for the location of the stove’s pilot light switch.",
          "description":"Usually, your stove’s pilot light switch is located along the gas line on the inside of the stovetop. You should see a small switch or valve that you can turn from ON to OFF. Always double check the owner’s manual for your stove to make sure you have identified the right switch. Handling the gas line should be done with caution. If you are not sure where the stove’s pilot light switch is, call your energy company and/or the stove’s manufacturer to confirm."
        },
        {
          "headline":"Do not smoke or have open flames in the room.",
          "description":"To prevent a fire or a gas explosion, do not smoke or have open flames, such as candles, in the room when you switch off the pilot light. Confirm the window in the room is open and there are no open flames."
        },
        {
          "headline":"Turn the gas valve to off.",
          "description":"There will be a switch that you can turn from ON to OFF to turn off the stove’s pilot light. There should then be no gas going to the pilot light for the stovetop or for the oven."
        },
        {
          "headline":"Confirm the gas valve is shut off properly.",
          "description":"It can be difficult to smell carbon monoxide gas to confirm the valve is shut off properly. If your home has a carbon monoxide detector, it will likely go off if there is carbon monoxide in the home. There should be no carbon monoxide in your home if the gas valve is shut off properly and the pilot light is turned off correctly. The symptoms of CO poisoning include headache, fatigue, shortness of breath, nausea, and dizziness. If you are exposed to high levels of CO gas, you may experience more severe symptoms like mental confusion, vomiting, loss of muscular coordination and loss of consciousness, as well as possibly death. If you experience any of these symptoms, you should leave your home and get fresh air outside right away. Do not stay in your home, as you could lose consciousness from CO exposure. Call the fire department and report your symptoms. You should also talk to your doctor as soon as possible and let her know you suspect you may have been exposed to CO gas."
        }
      ]
    }
  ],
  "text":" Identifying the Pilot Light Open the windows in your kitchen. Before you can look more closely at the pilot light, it’s important that you open several windows in the same room as the stove so there is no chance of carbon monoxide gas getting trapped in the room. Carbon monoxide (CO) is a colorless, odorless gas that can be poisonous at high levels of exposure. Your gas stove contains carbon monoxide, so it is important that you turn off the stove correctly and maintain good airflow when you look at the pilot light. Expose the burners on the gas range. A gas kitchen range, or stove, usually has two or more pilot lights. There are one to two pilot lights that heat up the surface burners on the top of your stove and one pilot light that ignites the burners to heat your oven. To expose the pilot lights on your stovetop so you can see them, make sure the burners on the stovetop are all turned to the OFF position and the oven is turned to OFF. If you have used the stovetop recently, wait at least an hour for the burners to cool down. Then, take the metal covers of the burners off and place them to one side. Run your hands along the front bottom of the stove top and the stovetop up. There should be a latch under the stove top to prop the stovetop up. Make sure the latch is in place and the stovetop is firmly propped. Identify the pilot lights. Once the stovetop burners are exposed, you should see four round cylinders for each burner on the stovetop, or two round cylinders if you have a two burner stovetop. There will be a main gas line on the left and right sides of the stovetop, running from the top and the bottom burners. In the middle of both burners, there should be two small openings. These openings are where the flame for the pilot light would be if the stove top was turned ON. There should be no flame, as your stovetop is set to OFF. Switching the Pilot Light Off Check the owner’s manual for the location of the stove’s pilot light switch. Usually, your stove’s pilot light switch is located along the gas line on the inside of the stovetop. You should see a small switch or valve that you can turn from ON to OFF. Always double check the owner’s manual for your stove to make sure you have identified the right switch. Handling the gas line should be done with caution. If you are not sure where the stove’s pilot light switch is, call your energy company and/or the stove’s manufacturer to confirm. Do not smoke or have open flames in the room. To prevent a fire or a gas explosion, do not smoke or have open flames, such as candles, in the room when you switch off the pilot light. Confirm the window in the room is open and there are no open flames. Turn the gas valve to off. There will be a switch that you can turn from ON to OFF to turn off the stove’s pilot light. There should then be no gas going to the pilot light for the stovetop or for the oven. Confirm the gas valve is shut off properly. It can be difficult to smell carbon monoxide gas to confirm the valve is shut off properly. If your home has a carbon monoxide detector, it will likely go off if there is carbon monoxide in the home. There should be no carbon monoxide in your home if the gas valve is shut off properly and the pilot light is turned off correctly. The symptoms of CO poisoning include headache, fatigue, shortness of breath, nausea, and dizziness. If you are exposed to high levels of CO gas, you may experience more severe symptoms like mental confusion, vomiting, loss of muscular coordination and loss of consciousness, as well as possibly death. If you experience any of these symptoms, you should leave your home and get fresh air outside right away. Do not stay in your home, as you could lose consciousness from CO exposure. Call the fire department and report your symptoms. You should also talk to your doctor as soon as possible and let her know you suspect you may have been exposed to CO gas.",
  "tyn_model":[
    "stove",
    "carbon monoxide",
    "stovetop",
    "oven",
    "gas",
    "gas stove",
    "energy company",
    "candles",
    "carbon monoxide gas",
    "carbon monoxide detector",
    "co gas"
  ],
  "tyn_section":[

  ]
}