{
  "title":"How to Snack on Frozen Fruit",
  "url":"https://www.wikihow.com/Snack-on-Frozen-Fruit",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Fruit Desserts"
  ],
  "methods":[
    {
      "name":"Making Frozen Fruit",
      "steps":[
        {
          "headline":"Experiment to find the frozen fruits you like best.",
          "description":"All kinds of fruit can be frozen safely, and stored for up to a year. Some fruits taste great frozen, while others you might want to thaw first. It is entirely up to your tastebuds to decide. Bananas. Papaya. Berry fruits, e.g. strawberries, raspberries, blackberries. Kiwi. Oranges. Pineapple. Blueberries. Seedless grapes."
        },
        {
          "headline":"Make frozen bananas.",
          "description":"These are always popular when frozen, because they take on a texture like ice cream. Peel the bananas and cut them in half. Wrap in plastic (optional), lay flat on a baking tray and place into the freezer. They will take about two hours to freeze, but ideally you should leave them in the freezer overnight. If you have children, insert a popsicle stick before freezing, to help small hands hold them."
        },
        {
          "headline":"Try frozen berries.",
          "description":"Clean and remove the green leaves and stems of strawberries and freeze for several hours. You can also freeze blueberries, raspberries, and blackberries. Allow them to thaw for about 10 minutes prior to serving."
        },
        {
          "headline":"Snack on frozen oranges and watermelon.",
          "description":"Cut oranges into quarters, and watermelon into bite-sized pieces. Wrap the fruit in plastic food wrap and arrange it on a plate or tray. Freeze for several hours."
        },
        {
          "headline":"Create frozen fruit kebabs.",
          "description":"Cut fruit into chunks and slide onto a kebab stick. Place in the freezer and remove when frozen. They should take about two to three hours to freeze. This makes an excellent barbecue or poolside snack in the heat of summer. Strawberries and bananas make a great combination. Watermelon and grapes make a tasty summer treat. Orange and mango cubes make a fancy, tropical treat."
        },
        {
          "headline":"Try frozen grapes.",
          "description":"Grapes are low in calories and are packed with vitamins and antioxidants. When frozen, they become pleasantly crunchy with smooth, sorbet-like centers. Rinse a large bunch of grapes under cool or lukewarm water, and pat dry with a paper towel. They don't need to be completely dry. Place your grapes in a sealed plastic bag, and freeze them overnight. You can also put frozen grapes directly in a glass of white wine instead of an ice cube."
        },
        {
          "headline":"Freeze mango cubes.",
          "description":"Cut two mangoes into bite-sized cubes and put them in a sealed plastic bag and freeze them. Enjoy them plain, or drizzle a small amount of lime juice over them. They should be frozen in about two hours. Kiwi are also delicious when prepared this way."
        }
      ]
    },
    {
      "name":"Making Frozen Fruit Snacks",
      "steps":[
        {
          "headline":"Try a chocolate covered kiwi pop.",
          "description":"Cut kiwi into ½ inch (about 10 mm) slices, and pat them dry with a paper towel. Dip slices in melted chocolate, lay them flat in a covered container, and let them freeze for two to three hours."
        },
        {
          "headline":"Make yogurt-coated strawberries.",
          "description":"Nip the leafy ends off a pound (500 g) of strawberries, and roll the berries in a cup (250 ml) of Greek yogurt. Place them in a single layer in a wide plastic container and freeze. Or, you can also space them out on a wax paper lined cookie sheet. After they are frozen, you can transfer them to a plastic container or Ziploc bag and keep them in the freezer until you want them. Try different flavors of yogurt, like vanilla or chocolate. Try mixing Greek yogurt with honey for a topping. You can also make yogurt-filled berries, by removing the center of the strawberries and filling them with yogurt."
        },
        {
          "headline":"Try a frozen banana shake.",
          "description":"Peel several bananas and freeze them for two to three hours. Blend the frozen bananas to a creamy consistency in your food processor, then serve in a tall milkshake glass. Add sweet ingredients for more flavor: dark chocolate chips, or peanut butter. Add a lot or a little, according to your taste preferences and whether or not you are trying to limit calories."
        },
        {
          "headline":"Make miniature lemon-berry pops.",
          "description":"For this one, you'll need some lemonade, honey, a small amount of sliced or diced berries, and an ice cube tray. Use any type of berry you like: strawberries, blueberries, blackberries, or raspberries work well. Drizzle a small amount of honey into the bottom of the ice cube tray. Fill trays with lemonade, and add chopped berries to each cube. Cover the tray with aluminum foil, and poke a toothpick into the center of each ice cube compartment. Freeze for several hours until solid, and you'll have mini fruit popsicles."
        },
        {
          "headline":"Try blueberry yogurt kebabs.",
          "description":"Stick several blueberries on a wooden skewer, and roll the entire thing in Greek yogurt. Line the kebabs on a plate and place in freezer until the yogurt is frozen solid."
        },
        {
          "headline":"Try frozen banana nut bites.",
          "description":"Create tiny frozen banana sandwiches in minutes. In addition to being tasty, they are low in calories and high in protein and fiber. Blend together 1 ripe banana, 1 Tablespoon of peanut butter, and 2 ounces (50 g) of vanilla Greek yogurt. Peel 3 bananas and cut them into ½ inch (about 10 mm) slices. Spread the peanut butter-yogurt mixture onto a banana slice, then top with another banana slice. Put your mini banana bites on a plate and freeze for 2-3 hours."
        },
        {
          "headline":"Try an apricot raspberry smoothie.",
          "description":"In your blender, mix 1 small can of apricot nectar (about 6 ounces or 170 g), 3 fresh halved apricots, 3 ice cubes, and 1 tablespoon of honey until smooth. Add ¼ cup (60 ml) of frozen raspberries, and blend a little longer until the raspberries are slightly broken up but not liquefied. Serve cold in a tall glass."
        },
        {
          "headline":"Try a cantaloupe lime smoothie.",
          "description":"In your blender, combine ½ teaspoon of lime peel, 2 tablespoons lime juice, 2 cups of diced frozen cantaloupe, 1/3 cup (78 ml) of diced frozen peaches, 1 tablespoon of honey and 3 ice cubes. Blend all these ingredients together until they are smooth, and serve in a tall glass."
        },
        {
          "headline":"Try a strawberry banana smoothie.",
          "description":"Gather together ¾ cup of frozen strawberries, ½ cup of orange juice, and one banana. Combine all these ingredients in your blender, and mix until smooth. Pour immediately into a tall glass and enjoy."
        }
      ]
    },
    {
      "name":"Working With Fruit",
      "steps":[
        {
          "headline":"Wash your fruit thoroughly.",
          "description":"If the package is labeled “prewashed,” you don't need to wash the fruit again, although you can if you like. Do not wash berries until you are ready to eat (or freeze) them. Wash your hands well, along with your counter tops, sink, and cutting board. Wash fruit in cold or lukewarm running water. Warm or hot water may damage fruit. Scrub whole fruit (like apples and pears) gently with a soft-bristled brush, or just rub the fruit with your fingers. Use a commercial fruit-washing solution, if you like, but water should be sufficient. If you want to soak your fruit, use 3 parts water to 1 part vinegar and soak in the sink for 5 to 10 minutes. This may help extend the life of the fruit, but is entirely optional."
        },
        {
          "headline":"Keep frozen fruit pieces from fusing together.",
          "description":"When freezing fruit, be careful not to stack wet pieces on top of each other. You'll wind up with a big brick of frozen fruit that is difficult to eat – and even more difficult to share. Wash your fruit before cutting it into pieces. Pat the pieces dry with a paper towel. You can leave a little moisture, but the pieces should not be completely wet. Arrange your fruit pieces on a cookie sheet or large serving plate, on top of a layer of wax paper. Be sure the pieces aren't wedged too close together, or stacked on top of each other. Once your fruit pieces are completely frozen, you can transfer them into a tupperware container or a larger zip-lock freezer bag, and they won't stick together."
        },
        {
          "headline":"Try using toothpicks and popsicle sticks.",
          "description":"Before freezing, skewer your fruit with toothpicks or popsicle sticks. Once frozen, your snacks will have little “handles” – making them easier to manage. Insert one end of a popsicle stick into larger fruit pieces like banana halves. Use toothpicks in smaller treats like melon cubes, or mini popsicles made in ice cube trays. (Decorative toothpicks are especially festive – you can find these in the baking supplies section at the grocery store.)"
        },
        {
          "headline":"Store your raw fruit correctly.",
          "description":"Store your fruit as far as possible away from raw meat, seafood, and poultry – meat juices can leak or drip onto fruit and contaminate it. Prevent this by storing your fruit above any meat in your refrigerator. Keep your fruit separate from meat in your shopping cart and in your shopping bags."
        },
        {
          "headline":"Know which fruits to refrigerate.",
          "description":"Most fruits should be refrigerated at 40 degrees Fahrenheit (about 4.5 degrees Celsius) or below. However, don't refrigerate tropical fruits, like mangoes, because the cool temperatures can cause shriveling, darkening, and an unpleasant flavor. Refrigerate cherries, strawberries, blueberries, raspberries, blackberries. Don't wash them until you are ready to eat (or freeze) them, as water may damage them. Store apples up to a week on your kitchen counter, or longer in the refrigerator. Store citrus fruit in the crisper drawer in your refrigerator. Keep melons in the refrigerator on a shelf – not the crisper drawer. Peaches, plums, nectarines, and other stone fruit should be ripened in a paper bag on a countertop, then moved to the refrigerator."
        },
        {
          "headline":"Designate a fruit-cutting board.",
          "description":"Use separate cutting boards for meat, vegetables and fruits to avoid contamination. Clean your fruit cutting board before each use. To help you remember to keep cutting boards separate, buy a different color for each use. For example, a red one for raw meat, a green one for vegetables, and a yellow one for fruit."
        },
        {
          "headline":"Be aware of pesticides.",
          "description":"Before you prepare your fruit, be sure to wash it thoroughly. Many fruits are listed on the Environmental Working Group (EWG)'s “Dirty Dozen” list of foods most likely to be contaminated by pesticides. In order of potential danger from contaminants, these fruits are:\nStrawberries. Apples. Nectarines. Peaches. Grapes. Cherries. Grapes. Blueberries."
        }
      ]
    }
  ],
  "text":" Making Frozen Fruit Experiment to find the frozen fruits you like best. All kinds of fruit can be frozen safely, and stored for up to a year. Some fruits taste great frozen, while others you might want to thaw first. It is entirely up to your tastebuds to decide. Bananas. Papaya. Berry fruits, e.g. strawberries, raspberries, blackberries. Kiwi. Oranges. Pineapple. Blueberries. Seedless grapes. Make frozen bananas. These are always popular when frozen, because they take on a texture like ice cream. Peel the bananas and cut them in half. Wrap in plastic (optional), lay flat on a baking tray and place into the freezer. They will take about two hours to freeze, but ideally you should leave them in the freezer overnight. If you have children, insert a popsicle stick before freezing, to help small hands hold them. Try frozen berries. Clean and remove the green leaves and stems of strawberries and freeze for several hours. You can also freeze blueberries, raspberries, and blackberries. Allow them to thaw for about 10 minutes prior to serving. Snack on frozen oranges and watermelon. Cut oranges into quarters, and watermelon into bite-sized pieces. Wrap the fruit in plastic food wrap and arrange it on a plate or tray. Freeze for several hours. Create frozen fruit kebabs. Cut fruit into chunks and slide onto a kebab stick. Place in the freezer and remove when frozen. They should take about two to three hours to freeze. This makes an excellent barbecue or poolside snack in the heat of summer. Strawberries and bananas make a great combination. Watermelon and grapes make a tasty summer treat. Orange and mango cubes make a fancy, tropical treat. Try frozen grapes. Grapes are low in calories and are packed with vitamins and antioxidants. When frozen, they become pleasantly crunchy with smooth, sorbet-like centers. Rinse a large bunch of grapes under cool or lukewarm water, and pat dry with a paper towel. They don't need to be completely dry. Place your grapes in a sealed plastic bag, and freeze them overnight. You can also put frozen grapes directly in a glass of white wine instead of an ice cube. Freeze mango cubes. Cut two mangoes into bite-sized cubes and put them in a sealed plastic bag and freeze them. Enjoy them plain, or drizzle a small amount of lime juice over them. They should be frozen in about two hours. Kiwi are also delicious when prepared this way. Making Frozen Fruit Snacks Try a chocolate covered kiwi pop. Cut kiwi into ½ inch (about 10 mm) slices, and pat them dry with a paper towel. Dip slices in melted chocolate, lay them flat in a covered container, and let them freeze for two to three hours. Make yogurt-coated strawberries. Nip the leafy ends off a pound (500 g) of strawberries, and roll the berries in a cup (250 ml) of Greek yogurt. Place them in a single layer in a wide plastic container and freeze. Or, you can also space them out on a wax paper lined cookie sheet. After they are frozen, you can transfer them to a plastic container or Ziploc bag and keep them in the freezer until you want them. Try different flavors of yogurt, like vanilla or chocolate. Try mixing Greek yogurt with honey for a topping. You can also make yogurt-filled berries, by removing the center of the strawberries and filling them with yogurt. Try a frozen banana shake. Peel several bananas and freeze them for two to three hours. Blend the frozen bananas to a creamy consistency in your food processor, then serve in a tall milkshake glass. Add sweet ingredients for more flavor: dark chocolate chips, or peanut butter. Add a lot or a little, according to your taste preferences and whether or not you are trying to limit calories. Make miniature lemon-berry pops. For this one, you'll need some lemonade, honey, a small amount of sliced or diced berries, and an ice cube tray. Use any type of berry you like: strawberries, blueberries, blackberries, or raspberries work well. Drizzle a small amount of honey into the bottom of the ice cube tray. Fill trays with lemonade, and add chopped berries to each cube. Cover the tray with aluminum foil, and poke a toothpick into the center of each ice cube compartment. Freeze for several hours until solid, and you'll have mini fruit popsicles. Try blueberry yogurt kebabs. Stick several blueberries on a wooden skewer, and roll the entire thing in Greek yogurt. Line the kebabs on a plate and place in freezer until the yogurt is frozen solid. Try frozen banana nut bites. Create tiny frozen banana sandwiches in minutes. In addition to being tasty, they are low in calories and high in protein and fiber. Blend together 1 ripe banana, 1 Tablespoon of peanut butter, and 2 ounces (50 g) of vanilla Greek yogurt. Peel 3 bananas and cut them into ½ inch (about 10 mm) slices. Spread the peanut butter-yogurt mixture onto a banana slice, then top with another banana slice. Put your mini banana bites on a plate and freeze for 2-3 hours. Try an apricot raspberry smoothie. In your blender, mix 1 small can of apricot nectar (about 6 ounces or 170 g), 3 fresh halved apricots, 3 ice cubes, and 1 tablespoon of honey until smooth. Add ¼ cup (60 ml) of frozen raspberries, and blend a little longer until the raspberries are slightly broken up but not liquefied. Serve cold in a tall glass. Try a cantaloupe lime smoothie. In your blender, combine ½ teaspoon of lime peel, 2 tablespoons lime juice, 2 cups of diced frozen cantaloupe, 1/3 cup (78 ml) of diced frozen peaches, 1 tablespoon of honey and 3 ice cubes. Blend all these ingredients together until they are smooth, and serve in a tall glass. Try a strawberry banana smoothie. Gather together ¾ cup of frozen strawberries, ½ cup of orange juice, and one banana. Combine all these ingredients in your blender, and mix until smooth. Pour immediately into a tall glass and enjoy. Working With Fruit Wash your fruit thoroughly. If the package is labeled “prewashed,” you don't need to wash the fruit again, although you can if you like. Do not wash berries until you are ready to eat (or freeze) them. Wash your hands well, along with your counter tops, sink, and cutting board. Wash fruit in cold or lukewarm running water. Warm or hot water may damage fruit. Scrub whole fruit (like apples and pears) gently with a soft-bristled brush, or just rub the fruit with your fingers. Use a commercial fruit-washing solution, if you like, but water should be sufficient. If you want to soak your fruit, use 3 parts water to 1 part vinegar and soak in the sink for 5 to 10 minutes. This may help extend the life of the fruit, but is entirely optional. Keep frozen fruit pieces from fusing together. When freezing fruit, be careful not to stack wet pieces on top of each other. You'll wind up with a big brick of frozen fruit that is difficult to eat – and even more difficult to share. Wash your fruit before cutting it into pieces. Pat the pieces dry with a paper towel. You can leave a little moisture, but the pieces should not be completely wet. Arrange your fruit pieces on a cookie sheet or large serving plate, on top of a layer of wax paper. Be sure the pieces aren't wedged too close together, or stacked on top of each other. Once your fruit pieces are completely frozen, you can transfer them into a tupperware container or a larger zip-lock freezer bag, and they won't stick together. Try using toothpicks and popsicle sticks. Before freezing, skewer your fruit with toothpicks or popsicle sticks. Once frozen, your snacks will have little “handles” – making them easier to manage. Insert one end of a popsicle stick into larger fruit pieces like banana halves. Use toothpicks in smaller treats like melon cubes, or mini popsicles made in ice cube trays. (Decorative toothpicks are especially festive – you can find these in the baking supplies section at the grocery store.) Store your raw fruit correctly. Store your fruit as far as possible away from raw meat, seafood, and poultry – meat juices can leak or drip onto fruit and contaminate it. Prevent this by storing your fruit above any meat in your refrigerator. Keep your fruit separate from meat in your shopping cart and in your shopping bags. Know which fruits to refrigerate. Most fruits should be refrigerated at 40 degrees Fahrenheit (about 4.5 degrees Celsius) or below. However, don't refrigerate tropical fruits, like mangoes, because the cool temperatures can cause shriveling, darkening, and an unpleasant flavor. Refrigerate cherries, strawberries, blueberries, raspberries, blackberries. Don't wash them until you are ready to eat (or freeze) them, as water may damage them. Store apples up to a week on your kitchen counter, or longer in the refrigerator. Store citrus fruit in the crisper drawer in your refrigerator. Keep melons in the refrigerator on a shelf – not the crisper drawer. Peaches, plums, nectarines, and other stone fruit should be ripened in a paper bag on a countertop, then moved to the refrigerator. Designate a fruit-cutting board. Use separate cutting boards for meat, vegetables and fruits to avoid contamination. Clean your fruit cutting board before each use. To help you remember to keep cutting boards separate, buy a different color for each use. For example, a red one for raw meat, a green one for vegetables, and a yellow one for fruit. Be aware of pesticides. Before you prepare your fruit, be sure to wash it thoroughly. Many fruits are listed on the Environmental Working Group (EWG)'s “Dirty Dozen” list of foods most likely to be contaminated by pesticides. In order of potential danger from contaminants, these fruits are:\nStrawberries. Apples. Nectarines. Peaches. Grapes. Cherries. Grapes. Blueberries.",
  "tyn_model":[
    "strawberries",
    "grapes",
    "bananas",
    "fruits",
    "water",
    "raspberries",
    "blueberries",
    "honey",
    "refrigerator",
    "fruit",
    "yogurt",
    "blackberries",
    "oranges",
    "freezer",
    "berries",
    "watermelon",
    "greek yogurt",
    "peanut butter",
    "banana",
    "blender",
    "tall glass",
    "popsicle stick",
    "plate",
    "mango",
    "paper towel",
    "sealed plastic bag",
    "ice cube",
    "lime juice",
    "lemonade",
    "ice cube tray",
    "ice cubes",
    "popsicle sticks",
    "cherries",
    "apples",
    "peaches",
    "pesticides",
    "frozen fruit",
    "pineapple",
    "frozen bananas",
    "ice cream",
    "baking tray",
    "plastic food wrap",
    "kebab stick",
    "white wine",
    "chocolate covered kiwi",
    "chocolate",
    "yogurt-",
    "wide plastic container",
    "wax paper lined cookie sheet",
    "ziploc bag",
    "frozen banana shake",
    "food processor",
    "milkshake glass",
    "dark chocolate chips",
    "lemon-berry pops",
    "aluminum foil",
    "blueberry yogurt",
    "banana nut",
    "frozen banana sandwiches",
    "vanilla greek yogurt",
    "banana slice",
    "apricot raspberry smoothie",
    "apricot nectar",
    "apricots",
    "cantaloupe lime smoothie",
    "lime peel",
    "frozen cantaloupe",
    "frozen peaches",
    "strawberry banana smoothie",
    "frozen strawberries",
    "orange juice",
    "“prewashed",
    "” you",
    "vinegar",
    "– and",
    "cookie sheet or",
    "wax paper",
    "tupperware container",
    "zip-lock freezer bag",
    "“handles",
    "” –",
    "toothpicks",
    "ice cube trays",
    "– you",
    "poultry",
    "– meat",
    "citrus fruit",
    "melons",
    "– not",
    "plums",
    "fruit-cutting board",
    "fruit cutting board",
    "vegetables",
    "environmental working group",
    "“dirty",
    "” list",
    "nectarines"
  ],
  "tyn_section":[

  ]
}