{
  "title":"How to Play the Suspect Game",
  "url":"https://www.wikihow.com/Play-the-Suspect-Game",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "steps":[
    {
      "headline":"Have at least 3 people for this game to work properly.",
      "description":"Even better, have more than 5."
    },
    {
      "headline":"Choose your people's roles.",
      "description":"There are many roles needed for this game. Police officer,  jail attendant (can be a police officer or someone else), suspect(s) and base attendant."
    },
    {
      "headline":"Choose your rooms.",
      "description":"You need a room for the base, the suspects house, the court and the jail. Choose these according to your house. Tips on the best rooms are in the tips section below."
    },
    {
      "headline":"Start by having your suspect(s) go in to the suspect's house.",
      "description":""
    },
    {
      "headline":"Then, have them lean against the door.",
      "description":"Ask them not to lock the door. Have them lean heavily on the door instead."
    },
    {
      "headline":"Next, outside their door, the police officer should say \"attending scene\".",
      "description":"Have them say this rather loud, but not shouting."
    },
    {
      "headline":"Then the police officer should bang hard on the suspect's door.",
      "description":""
    },
    {
      "headline":"At this time, the suspect(s) can either choose to open the door right away, but this can be less fun.",
      "description":"Or, they can continue leaning against the door, and have the police try to force it open."
    },
    {
      "headline":"To force the door open, push hard and open the door normally at the same time.",
      "description":"This is extremely difficult if you have (a) strong suspect(s), but can be easy if your suspect(s) is/are less strong."
    },
    {
      "headline":"So you've got the door open some way or another.",
      "description":"Now, the police officer should say, \"I'm arresting you for(insert crime here). You will be taken to (insert prison name here)\". The suspect(s) will then be taken out of the room."
    },
    {
      "headline":"Take them to your designated jail, and shut them in it.",
      "description":"As tempting as it may be, do not tie them down in any way."
    },
    {
      "headline":"Now, it's the suspect(s) time to plot how to get out of  jail.",
      "description":""
    },
    {
      "headline":"Have your suspect(s) make noises like they're sick and then pretend that they have fainted on the floor.",
      "description":"When your jail attendant hears this, they should pretend to call an ambulance. A police officer or the jail or base attendant can be paramedic. The suspect(s) should thrash about screaming and then suddenly faint again a number of times. The ambulance person should pretend to give them tests and jags and then they should turn their back. While their back is turned, the suspect(s) escape(s)."
    },
    {
      "headline":"If you don't want to do that one, you can just try to get out of the jail room.",
      "description":"All police should be returned to base at this point, except for the jail attendant. The jail attendant should look away then the suspect(s) escape(s)."
    },
    {
      "headline":"Each time your suspect(s) escape(s), catch them and put them back in jail.",
      "description":""
    },
    {
      "headline":"In about 15 minutes, come and get them for their court case.",
      "description":"Bring them in to your court room and try to ask them questions. From their answers and what they did, give them a sentence, from 15 minutes to life, until their not suspect any more."
    },
    {
      "headline":"Swap roles.",
      "description":"After as long as you want, change roles. After you have changed, follow all steps again."
    }
  ],
  "text":" Have at least 3 people for this game to work properly. Even better, have more than 5. Choose your people's roles. There are many roles needed for this game. Police officer,  jail attendant (can be a police officer or someone else), suspect(s) and base attendant. Choose your rooms. You need a room for the base, the suspects house, the court and the jail. Choose these according to your house. Tips on the best rooms are in the tips section below. Start by having your suspect(s) go in to the suspect's house.  Then, have them lean against the door. Ask them not to lock the door. Have them lean heavily on the door instead. Next, outside their door, the police officer should say \"attending scene\". Have them say this rather loud, but not shouting. Then the police officer should bang hard on the suspect's door.  At this time, the suspect(s) can either choose to open the door right away, but this can be less fun. Or, they can continue leaning against the door, and have the police try to force it open. To force the door open, push hard and open the door normally at the same time. This is extremely difficult if you have (a) strong suspect(s), but can be easy if your suspect(s) is/are less strong. So you've got the door open some way or another. Now, the police officer should say, \"I'm arresting you for(insert crime here). You will be taken to (insert prison name here)\". The suspect(s) will then be taken out of the room. Take them to your designated jail, and shut them in it. As tempting as it may be, do not tie them down in any way. Now, it's the suspect(s) time to plot how to get out of  jail.  Have your suspect(s) make noises like they're sick and then pretend that they have fainted on the floor. When your jail attendant hears this, they should pretend to call an ambulance. A police officer or the jail or base attendant can be paramedic. The suspect(s) should thrash about screaming and then suddenly faint again a number of times. The ambulance person should pretend to give them tests and jags and then they should turn their back. While their back is turned, the suspect(s) escape(s). If you don't want to do that one, you can just try to get out of the jail room. All police should be returned to base at this point, except for the jail attendant. The jail attendant should look away then the suspect(s) escape(s). Each time your suspect(s) escape(s), catch them and put them back in jail.  In about 15 minutes, come and get them for their court case. Bring them in to your court room and try to ask them questions. From their answers and what they did, give them a sentence, from 15 minutes to life, until their not suspect any more. Swap roles. After as long as you want, change roles. After you have changed, follow all steps again.",
  "tyn_model":[
    "jail"
  ],
  "tyn_section":[

  ]
}