{
  "title":"How to Connect Your Xbox 360 to Xbox Live (if You're New to Xbox 360)",
  "url":"https://www.wikihow.com/Connect-Your-Xbox-360-to-Xbox-Live-(if-You%27re-New-to-Xbox-360)",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Xbox Live"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Determine whether you are connecting wirelessly or through Ethernet.",
          "description":"The 360 Slim and new E models both have wireless adapters built-in, or can be connected through Ethernet. The original 360 model has an Ethernet port, but needs a wireless adapter in order to connect to a Wi-Fi network."
        },
        {
          "headline":"You may get better signal using the wireless adapter as opposed to the built-in wireless.",
          "description":""
        },
        {
          "headline":"Connect with an Ethernet cable.",
          "description":"If you are using a wired connection to your network, use an Ethernet cable to connect your Xbox 360 to your router. As long as your home network has been set up correctly, that is all you need to do."
        },
        {
          "headline":"To test the connection, turn on the 360.",
          "description":"When you are on the Dashboard, press the Guide button (the center Xbox button). Select Settings, then System Settings, and then Network Settings. Under Wired Network, select Test Xbox LIVE Connection."
        },
        {
          "headline":"Connect via Wi-Fi.",
          "description":"If you are using a wireless adapter, connect it to the back of the console via USB and flip the antenna(s) up. You should see a green light when it is functioning. Select Settings from the Dashboard, and then System Settings. Select Network Settings and under Wireless Network, you can choose your router’s name."
        },
        {
          "headline":"After selecting your router, you will need to enter your password if your wireless network is encrypted.",
          "description":"After entering your password, the 360 will automatically attempt to connect to Xbox LIVE."
        }
      ]
    },
    {
      "name":"Setting Up an Account",
      "steps":[
        {
          "headline":"Understand the difference between Free and Gold accounts.",
          "description":"Free accounts let you purchase and download games from the Marketplace, as well as track your Gamerscore. If you want to use services such as Netflix or play multiplayer games online, you will need a Gold account."
        },
        {
          "headline":"Set up you account.",
          "description":"Press the Guide button on the controller. Select Join Xbox live. You will need a Microsoft ID in order to sign up for either the Free or Gold accounts. This ID is the same as your Hotmail or Messenger accounts, if you use those programs."
        },
        {
          "headline":"If you wish to sign up for Gold, you will need a valid credit card.",
          "description":""
        },
        {
          "headline":"Pick an account name.",
          "description":"When signing up for an Xbox LIVE account, you will need to pick your username, or gamertag. This must be unique, and cannot contain any offensive material."
        }
      ]
    },
    {
      "name":"Managing the Account",
      "steps":[
        {
          "headline":"Renew your Gold account.",
          "description":"If you signed up for Gold with a credit card, you will be automatically renewed and the fee will be charged to your card. To use a prepaid code, Press the Guide button and select Settings. Select Account, and then Account Management. Choose your Gold account, and click “Redeem code”. Enter the code on your prepaid card, and the time will be credited to your account."
        },
        {
          "headline":"Cancel Xbox LIVE Gold.",
          "description":"Visit the LIVE Account page on your computer. You will need to sign in with your Microsoft ID. Select the Xbox LIVE section. In the center of the screen, click the Cancel Auto Payment link. If you signed up with a two-year plan that included the Xbox 360 console, canceling the auto payment will terminate the contract and you will have to pay an early-termination fee."
        }
      ]
    }
  ],
  "text":" Steps Determine whether you are connecting wirelessly or through Ethernet. The 360 Slim and new E models both have wireless adapters built-in, or can be connected through Ethernet. The original 360 model has an Ethernet port, but needs a wireless adapter in order to connect to a Wi-Fi network. You may get better signal using the wireless adapter as opposed to the built-in wireless.  Connect with an Ethernet cable. If you are using a wired connection to your network, use an Ethernet cable to connect your Xbox 360 to your router. As long as your home network has been set up correctly, that is all you need to do. To test the connection, turn on the 360. When you are on the Dashboard, press the Guide button (the center Xbox button). Select Settings, then System Settings, and then Network Settings. Under Wired Network, select Test Xbox LIVE Connection. Connect via Wi-Fi. If you are using a wireless adapter, connect it to the back of the console via USB and flip the antenna(s) up. You should see a green light when it is functioning. Select Settings from the Dashboard, and then System Settings. Select Network Settings and under Wireless Network, you can choose your router’s name. After selecting your router, you will need to enter your password if your wireless network is encrypted. After entering your password, the 360 will automatically attempt to connect to Xbox LIVE. Setting Up an Account Understand the difference between Free and Gold accounts. Free accounts let you purchase and download games from the Marketplace, as well as track your Gamerscore. If you want to use services such as Netflix or play multiplayer games online, you will need a Gold account. Set up you account. Press the Guide button on the controller. Select Join Xbox live. You will need a Microsoft ID in order to sign up for either the Free or Gold accounts. This ID is the same as your Hotmail or Messenger accounts, if you use those programs. If you wish to sign up for Gold, you will need a valid credit card.  Pick an account name. When signing up for an Xbox LIVE account, you will need to pick your username, or gamertag. This must be unique, and cannot contain any offensive material. Managing the Account Renew your Gold account. If you signed up for Gold with a credit card, you will be automatically renewed and the fee will be charged to your card. To use a prepaid code, Press the Guide button and select Settings. Select Account, and then Account Management. Choose your Gold account, and click “Redeem code”. Enter the code on your prepaid card, and the time will be credited to your account. Cancel Xbox LIVE Gold. Visit the LIVE Account page on your computer. You will need to sign in with your Microsoft ID. Select the Xbox LIVE section. In the center of the screen, click the Cancel Auto Payment link. If you signed up with a two-year plan that included the Xbox 360 console, canceling the auto payment will terminate the contract and you will have to pay an early-termination fee.",
  "tyn_model":[
    "wireless adapter",
    "ethernet cable",
    "xbox 360",
    "router",
    "360",
    "xbox live",
    "wireless adapters",
    "wi-fi network",
    "xbox live connection",
    "wi-fi",
    "usb",
    "xbox live account",
    "credit card",
    "“redeem",
    "”.",
    "xbox live gold"
  ],
  "tyn_section":[

  ]
}