{
  "title":"How to Replace Eggs in Your Cooking",
  "url":"https://www.wikihow.com/Replace-Eggs-in-Your-Cooking",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Vegan"
  ],
  "methods":[
    {
      "name":"Replacing Eggs in Baking",
      "steps":[
        {
          "headline":"Replace 1 egg with 1/4 cup (30 g) of banana puree to add moisture.",
          "description":"Banana is one of the most popular choices for egg replacements in sweet recipes like muffins, breads, and cake. Use 1/2 banana to yield 1/4 cup (30 g) of puree. The banana will alter the taste of your baked goods, so make sure you like banana-flavored muffins, breads, etc. before you add it to your recipe. Otherwise, look for something with a milder taste."
        },
        {
          "headline":"Use applesauce to add moisture, density, and sweetness.",
          "description":"Applesauce works great with recipes like brownies and chocolate cake because the chocolate hides the flavor of the applesauce. Use 1/3 cup (43 g) of puree to replace 1 egg. Applesauce and other fruit purees will add heaviness and density, so if you want something lighter, use 1/4 cup (30 g) of puree with 1 Tsp baking powder for a lighter, fluffier product."
        },
        {
          "headline":"Try 1/3 cup (43 g) of pumpkin to replace 1 egg in muffins and breads.",
          "description":"Pumpkin can also leave a distinct flavor in baked goods, so it's best to incorporate it in a recipe that works well with pumpkin. Bread, muffins, and spice cakes will all benefit from the moisture, binding properties, and taste of pumpkin. Make sure the pumpkin is pureed so that it is smooth and won't make lumps in your baked goods."
        },
        {
          "headline":"Make use of baking soda and vinegar to help your recipe rise.",
          "description":"Substitute 1 egg with 1 Tbsp. vinegar plus 1 Tsp. baking soda whisked together. Baking soda will give your baked goods a warm, golden brown color. Baking soda will react with acids in your recipe (like vinegar, buttermilk, cream of tartar) and release carbon dioxide, causing your baked goods to rise."
        },
        {
          "headline":"Try baking powder and vegetable oil to help baked goods rise.",
          "description":"Substitute 1 egg with 2 Tbsp. water plus 1 Tbsp. vegetable oil plus 1 Tsp. baking powder. Whisk them together thoroughly. Using baking powder will result in a lighter, fluffier product."
        },
        {
          "headline":"Substitute egg whites with agar powder.",
          "description":"Mix 1 Tbsp agar powder in 1 Tbsp water. Whip the mixture, then let it chill in the fridge. Whip it again and it will be ready to use. This is equivalent to 1 egg white, so increase as necessary for the recipe. Agar powder is also known as agar-agar, Kanten, Japanese isinglass, or Ceylon moss. Agar is vegan and can also be used to replace gelatin."
        },
        {
          "headline":"Replace 3 eggs in boxed cake mixes with 1 can of soda.",
          "description":"This isn't exactly the healthiest egg alternative, but it will leaven your cake and can add an interesting flavor! A can of soda (12 ounces) is equivalent to adding 3 eggs to your recipe. When using soda, omit the oil in the recipe to avoid runniness. You can choose the type of soda based on its flavor and how well it combines with your cake. For example, you could combine French vanilla cake mix with orange soda to create a creamsicle cake. Ginger ale would pair well with spice cake mix. Chocolate cake mix and root beer would result in a chocolate root beer float cake."
        },
        {
          "headline":"Use finely ground flax and chia seeds to add a nutty flavor.",
          "description":"Grind the seeds as finely as possible in a coffee or spice grinder. Mix 1 Tbsp. ground flax seed or 1 Tbsp. ground chia seed with 3 Tbsp. of water to replace 1 egg. Allow the mixture to sit for 30 minutes until it thickens and has a jelly-like consistency. Flax seeds have a slightly nutty flavor, so use it in recipes that would benefit from this flavor. Chia seeds will deepen the color of your baked goods. If the eggs are meant to bind and leaven, add an additional 1/4 Tsp. of baking powder."
        },
        {
          "headline":"Use gelatin to bind sweet recipes like cookies and muffins.",
          "description":"Gelatin will not alter the flavor in things like cakes and cookies. 1 Tbsp. gelatin plus 3 tablespoons warm water will replace 1 egg. Be aware that gelatin is not vegan. If you're looking for something vegan that will give you similar results, try agar powder."
        },
        {
          "headline":"Avoid powders entirely, if you don't like powders at all.",
          "description":"Instead, use 2 tablespoons of an oil and 1 tablespoon of water per egg you'd like to replace. Eggs can also be substituted for 2 tablespoons of a liquid plus 2 tablespoons of flour plus half a tablespoon shortening, but there are other alternatives."
        }
      ]
    },
    {
      "name":"Replacing Eggs in Main Dishes",
      "steps":[
        {
          "headline":"Use store-bought egg replacer products for recipes with lots of eggs.",
          "description":"Look for egg replacers, not egg substitutes, since egg substitutes can sometimes still contain egg. Use egg replacer products in dishes that are mostly eggs, like scrambles. Ener-G Egg Replacer is a popular vegan product you can try out. Check for it at your local health food store. Follow the directions on the box for each product. Generally, you mix the egg replacer with water and add it to your recipe. Avoid products like Egg Beaters and Better’n Eggs. These are egg substitutes, and they still contain egg!"
        },
        {
          "headline":"Use tofu to replace eggs when they make up the majority of the dish.",
          "description":"Tofu makes a great egg substitute in breakfast scrambles, quiches, and custards. Puree the tofu to make sure there are no lumps or chunks in your dish. Use 1/4 cup tofu per egg. Use silken or soft tofu -- firm tofu won't blend very well. Make sure the tofu is plain and neither baked nor seasoned. Tofu will not fluff like eggs, but the texture is otherwise very similar to eggs."
        },
        {
          "headline":"Use mashed potatoes as a binder.",
          "description":"Starchy mashed potatoes work especially well in savory dishes like meatloaf, a veggie loaf or burgers. Add 1/4 cup (30 g) of mashed potatoes to replace 1 egg. You can use mashed potatoes made from scratch, but dehydrated potatoes and instant mashed potato products work, too."
        },
        {
          "headline":"Use soft tofu as an emulsifier in vegan condiments.",
          "description":"Tofu contains lecithin, which acts as an emulsifier and will thicken and stabilize vegan recipes for mayonnaise, ranch dressing, and hollandaise sauce. Make sure you use a soft, unflavored tofu, not firm, seasoned, or baked. 1/4 cup puréed tofu replaces 1 egg."
        },
        {
          "headline":"Use turmeric to color your egg-free dish.",
          "description":"If you are making vegan scrambled eggs and still want that golden egg color, turmeric will do the job. It can also add a peppery, tart flavor to your dish. Use just a pinch of turmeric in your recipe to turn your tofu or other egg substitute yellow. Make sure you stir well to incorporate the turmeric into the dish."
        }
      ]
    }
  ],
  "text":" Replacing Eggs in Baking Replace 1 egg with 1/4 cup (30 g) of banana puree to add moisture. Banana is one of the most popular choices for egg replacements in sweet recipes like muffins, breads, and cake. Use 1/2 banana to yield 1/4 cup (30 g) of puree. The banana will alter the taste of your baked goods, so make sure you like banana-flavored muffins, breads, etc. before you add it to your recipe. Otherwise, look for something with a milder taste. Use applesauce to add moisture, density, and sweetness. Applesauce works great with recipes like brownies and chocolate cake because the chocolate hides the flavor of the applesauce. Use 1/3 cup (43 g) of puree to replace 1 egg. Applesauce and other fruit purees will add heaviness and density, so if you want something lighter, use 1/4 cup (30 g) of puree with 1 Tsp baking powder for a lighter, fluffier product. Try 1/3 cup (43 g) of pumpkin to replace 1 egg in muffins and breads. Pumpkin can also leave a distinct flavor in baked goods, so it's best to incorporate it in a recipe that works well with pumpkin. Bread, muffins, and spice cakes will all benefit from the moisture, binding properties, and taste of pumpkin. Make sure the pumpkin is pureed so that it is smooth and won't make lumps in your baked goods. Make use of baking soda and vinegar to help your recipe rise. Substitute 1 egg with 1 Tbsp. vinegar plus 1 Tsp. baking soda whisked together. Baking soda will give your baked goods a warm, golden brown color. Baking soda will react with acids in your recipe (like vinegar, buttermilk, cream of tartar) and release carbon dioxide, causing your baked goods to rise. Try baking powder and vegetable oil to help baked goods rise. Substitute 1 egg with 2 Tbsp. water plus 1 Tbsp. vegetable oil plus 1 Tsp. baking powder. Whisk them together thoroughly. Using baking powder will result in a lighter, fluffier product. Substitute egg whites with agar powder. Mix 1 Tbsp agar powder in 1 Tbsp water. Whip the mixture, then let it chill in the fridge. Whip it again and it will be ready to use. This is equivalent to 1 egg white, so increase as necessary for the recipe. Agar powder is also known as agar-agar, Kanten, Japanese isinglass, or Ceylon moss. Agar is vegan and can also be used to replace gelatin. Replace 3 eggs in boxed cake mixes with 1 can of soda. This isn't exactly the healthiest egg alternative, but it will leaven your cake and can add an interesting flavor! A can of soda (12 ounces) is equivalent to adding 3 eggs to your recipe. When using soda, omit the oil in the recipe to avoid runniness. You can choose the type of soda based on its flavor and how well it combines with your cake. For example, you could combine French vanilla cake mix with orange soda to create a creamsicle cake. Ginger ale would pair well with spice cake mix. Chocolate cake mix and root beer would result in a chocolate root beer float cake. Use finely ground flax and chia seeds to add a nutty flavor. Grind the seeds as finely as possible in a coffee or spice grinder. Mix 1 Tbsp. ground flax seed or 1 Tbsp. ground chia seed with 3 Tbsp. of water to replace 1 egg. Allow the mixture to sit for 30 minutes until it thickens and has a jelly-like consistency. Flax seeds have a slightly nutty flavor, so use it in recipes that would benefit from this flavor. Chia seeds will deepen the color of your baked goods. If the eggs are meant to bind and leaven, add an additional 1/4 Tsp. of baking powder. Use gelatin to bind sweet recipes like cookies and muffins. Gelatin will not alter the flavor in things like cakes and cookies. 1 Tbsp. gelatin plus 3 tablespoons warm water will replace 1 egg. Be aware that gelatin is not vegan. If you're looking for something vegan that will give you similar results, try agar powder. Avoid powders entirely, if you don't like powders at all. Instead, use 2 tablespoons of an oil and 1 tablespoon of water per egg you'd like to replace. Eggs can also be substituted for 2 tablespoons of a liquid plus 2 tablespoons of flour plus half a tablespoon shortening, but there are other alternatives. Replacing Eggs in Main Dishes Use store-bought egg replacer products for recipes with lots of eggs. Look for egg replacers, not egg substitutes, since egg substitutes can sometimes still contain egg. Use egg replacer products in dishes that are mostly eggs, like scrambles. Ener-G Egg Replacer is a popular vegan product you can try out. Check for it at your local health food store. Follow the directions on the box for each product. Generally, you mix the egg replacer with water and add it to your recipe. Avoid products like Egg Beaters and Better’n Eggs. These are egg substitutes, and they still contain egg! Use tofu to replace eggs when they make up the majority of the dish. Tofu makes a great egg substitute in breakfast scrambles, quiches, and custards. Puree the tofu to make sure there are no lumps or chunks in your dish. Use 1/4 cup tofu per egg. Use silken or soft tofu -- firm tofu won't blend very well. Make sure the tofu is plain and neither baked nor seasoned. Tofu will not fluff like eggs, but the texture is otherwise very similar to eggs. Use mashed potatoes as a binder. Starchy mashed potatoes work especially well in savory dishes like meatloaf, a veggie loaf or burgers. Add 1/4 cup (30 g) of mashed potatoes to replace 1 egg. You can use mashed potatoes made from scratch, but dehydrated potatoes and instant mashed potato products work, too. Use soft tofu as an emulsifier in vegan condiments. Tofu contains lecithin, which acts as an emulsifier and will thicken and stabilize vegan recipes for mayonnaise, ranch dressing, and hollandaise sauce. Make sure you use a soft, unflavored tofu, not firm, seasoned, or baked. 1/4 cup puréed tofu replaces 1 egg. Use turmeric to color your egg-free dish. If you are making vegan scrambled eggs and still want that golden egg color, turmeric will do the job. It can also add a peppery, tart flavor to your dish. Use just a pinch of turmeric in your recipe to turn your tofu or other egg substitute yellow. Make sure you stir well to incorporate the turmeric into the dish.",
  "tyn_model":[
    "tofu",
    "baking powder",
    "water",
    "gelatin",
    "applesauce",
    "pumpkin",
    "baking soda",
    "egg",
    "agar powder",
    "soda",
    "eggs",
    "turmeric",
    "banana",
    "vinegar",
    "potatoes",
    "vegetable oil",
    "oil",
    "chia seeds",
    "egg replacer",
    "mashed potatoes",
    "banana puree",
    "baked goods",
    "chocolate cake",
    "puree",
    "spice cakes",
    "buttermilk,",
    "agar-agar",
    "ceylon moss",
    "agar",
    "french vanilla cake mix",
    "orange soda",
    "ginger ale",
    "spice cake mix",
    "chocolate cake mix",
    "root beer",
    "root beer float cake",
    "flax",
    "coffee or spice grinder",
    "ground flax seed",
    "warm water",
    "flour",
    "shortening",
    "ener-g egg replacer",
    "mayonnaise",
    "ranch dressing",
    "hollandaise sauce",
    "scrambled eggs"
  ],
  "tyn_section":[

  ]
}