{
  "title":"How to Choose Beetroot",
  "url":"https://www.wikihow.com/Choose-Beetroot",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "parts":[
    {
      "name":"Choosing the Right Kind of Beetroot",
      "steps":[
        {
          "headline":"Pick a standard medium-size beetroot for everyday use.",
          "description":"Medium beetroots are about the size of the average adult fist. This the the regular beetroot you see most often at the grocery store. It’s great for roasting, juicing, and anything else you want to try. They are the easiest to cook and the least likely to have hard cores. They’re by far the most common beetroot and are also the most cost-effective option."
        },
        {
          "headline":"Choose a baby beetroot for salads.",
          "description":"These tiny beets resemble radishes and are perfect for eating raw or in salads. They also usually come with the greens still attached, which you can include in your salad! You can find them at most large grocery stores."
        },
        {
          "headline":"Try an heirloom variety.",
          "description":"There are many heirloom varieties of beet that are great for soups, roasts, salads, and juices. They’re often sweeter and more tender than regular beetroot, but they can be more expensive and hard to find. Try your local farmer’s market during the winter. Golden varieties like the Lutz Green Leaf have a bright gold color that won’t stain as much as a regular beet. If you dislike the earthy flavors of standard beetroot, try the Cylindra or the Detroit Dark Red, both of which are sweet and tender. If you’re worried about stains, try the Chioggia. It’s almost white in color and won’t mark or stain your teeth or clothes like other beets."
        }
      ]
    },
    {
      "name":"Picking the Best Beetroot",
      "steps":[
        {
          "headline":"Check for green, vibrant leaves.",
          "description":"If your beetroot has leaves attached, check them for wilting, yellowing, or rot. They should be bright green and feel slightly firm to the touch. You don’t have to throw away a beet with wilted leaves if you already have it, but you shouldn’t buy it from the store."
        },
        {
          "headline":"Press the beetroot to check for firmness.",
          "description":"Beets are at their best when they’re firm to the touch. Soft spots mean that the beetroot is too old to eat and may be rotten inside. But be careful--your beetroot should be firm, but not rock hard. A beet that is very hard to the touch will be difficult to cook."
        },
        {
          "headline":"Examine the beet for blemishes.",
          "description":"Roots are tough, so a few blemishes don’t mean you can’t eat it, but they will shorten its shelf life and can introduce bacteria. Always try to buy beetroot with smooth, unmarked skin."
        },
        {
          "headline":"Buy beets that have fully intact roots.",
          "description":"Every beetroot has a long, tapered root at the end. Check each end root to make sure it isn't broken or damaged--a broken root can make the whole beet spoil more quickly."
        },
        {
          "headline":"Choose the smallest beetroot you can.",
          "description":"The smaller the beetroot, the sweeter and tenderer it will be. Large beetroots often have a dull taste and hard, wood-like cores. If you have a choice between two beetroots, always pick the smallest one."
        }
      ]
    },
    {
      "name":"Storing Your Beetroot",
      "steps":[
        {
          "headline":"Avoid washing beetroot before storing it.",
          "description":"The outer layer of skin can be rubbed partially off by washing, leaving your beetroot vulnerable to spoilage. Instead of washing your beets as soon as you buy them, wait until you begin prepping them to eat."
        },
        {
          "headline":"Separate the leaves from the root.",
          "description":"Some beets have leaves attached when you buy them. The leaves will go bad before the actual root does, so remove the leaves from the beetroot right away. Keep at least 1 inch (25 mm) of stem on to prevent the color from bleeding out during cooking. Baby beets are the exception. They should have their leaves kept on!"
        },
        {
          "headline":"Store the leaves in the refrigerator.",
          "description":"If you want to keep the leaves, put them in a plastic bag in your refrigerator's crisper drawer. They'll spoil much more quickly than the rest of the root, so you should eat them within a day or two. They can be eaten raw or cooked."
        },
        {
          "headline":"Store the beetroot in a cool, dark, and dry place.",
          "description":"Beetroot will last from ten days to three weeks if stored properly. Keep them somewhere cool, dark, and dry, like your refrigerator’s vegetable drawer or a root cellar. You can also freeze cooked beetroot for several months."
        },
        {
          "headline":"Dispose of beetroot that is mushy, discolored, or smells.",
          "description":"Check your stored beetroots regularly to make sure they aren't spoiled. If you see any beets that are mushy, have a greenish or blackish color, or give off a strong odor, dispose of them immediately."
        }
      ]
    }
  ],
  "text":" Choosing the Right Kind of Beetroot Pick a standard medium-size beetroot for everyday use. Medium beetroots are about the size of the average adult fist. This the the regular beetroot you see most often at the grocery store. It’s great for roasting, juicing, and anything else you want to try. They are the easiest to cook and the least likely to have hard cores. They’re by far the most common beetroot and are also the most cost-effective option. Choose a baby beetroot for salads. These tiny beets resemble radishes and are perfect for eating raw or in salads. They also usually come with the greens still attached, which you can include in your salad! You can find them at most large grocery stores. Try an heirloom variety. There are many heirloom varieties of beet that are great for soups, roasts, salads, and juices. They’re often sweeter and more tender than regular beetroot, but they can be more expensive and hard to find. Try your local farmer’s market during the winter. Golden varieties like the Lutz Green Leaf have a bright gold color that won’t stain as much as a regular beet. If you dislike the earthy flavors of standard beetroot, try the Cylindra or the Detroit Dark Red, both of which are sweet and tender. If you’re worried about stains, try the Chioggia. It’s almost white in color and won’t mark or stain your teeth or clothes like other beets. Picking the Best Beetroot Check for green, vibrant leaves. If your beetroot has leaves attached, check them for wilting, yellowing, or rot. They should be bright green and feel slightly firm to the touch. You don’t have to throw away a beet with wilted leaves if you already have it, but you shouldn’t buy it from the store. Press the beetroot to check for firmness. Beets are at their best when they’re firm to the touch. Soft spots mean that the beetroot is too old to eat and may be rotten inside. But be careful--your beetroot should be firm, but not rock hard. A beet that is very hard to the touch will be difficult to cook. Examine the beet for blemishes. Roots are tough, so a few blemishes don’t mean you can’t eat it, but they will shorten its shelf life and can introduce bacteria. Always try to buy beetroot with smooth, unmarked skin. Buy beets that have fully intact roots. Every beetroot has a long, tapered root at the end. Check each end root to make sure it isn't broken or damaged--a broken root can make the whole beet spoil more quickly. Choose the smallest beetroot you can. The smaller the beetroot, the sweeter and tenderer it will be. Large beetroots often have a dull taste and hard, wood-like cores. If you have a choice between two beetroots, always pick the smallest one. Storing Your Beetroot Avoid washing beetroot before storing it. The outer layer of skin can be rubbed partially off by washing, leaving your beetroot vulnerable to spoilage. Instead of washing your beets as soon as you buy them, wait until you begin prepping them to eat. Separate the leaves from the root. Some beets have leaves attached when you buy them. The leaves will go bad before the actual root does, so remove the leaves from the beetroot right away. Keep at least 1 inch (25 mm) of stem on to prevent the color from bleeding out during cooking. Baby beets are the exception. They should have their leaves kept on! Store the leaves in the refrigerator. If you want to keep the leaves, put them in a plastic bag in your refrigerator's crisper drawer. They'll spoil much more quickly than the rest of the root, so you should eat them within a day or two. They can be eaten raw or cooked. Store the beetroot in a cool, dark, and dry place. Beetroot will last from ten days to three weeks if stored properly. Keep them somewhere cool, dark, and dry, like your refrigerator’s vegetable drawer or a root cellar. You can also freeze cooked beetroot for several months. Dispose of beetroot that is mushy, discolored, or smells. Check your stored beetroots regularly to make sure they aren't spoiled. If you see any beets that are mushy, have a greenish or blackish color, or give off a strong odor, dispose of them immediately.",
  "tyn_model":[
    "beetroot",
    "beets",
    "beet",
    "beetroots",
    "refrigerator",
    "vegetable drawer"
  ],
  "tyn_section":[

  ]
}