{
  "title":"How to Live with Less",
  "url":"https://www.wikihow.com/Live-with-Less",
  "category_hierarchy":[
    "Home and Garden",
    "Sustainable Living"
  ],
  "methods":[
    {
      "name":"Minimizing Transportation Costs",
      "steps":[
        {
          "headline":"Use mass transit.",
          "description":"This can’t be stressed enough. You’ll save on gas, vehicle maintenance, and car payments. There are a variety of mass transit options. Get a bus pass. There are usually several spots to be picked up. The schedules are fairly regular. And in some locations, there are even employee commute plans and discounts. Jump on the train. Trains are a safe form of transportation that helps you avoid airport crowds, and you don’t have to do any driving. On top of that, the scenery is great, the boarding times are flexible, and there are often discounted tickets for children. Ride the subway. Subway rides are incredibly affordable, flexible, and have diverse route combinations. You can travel all over a large city with very minimal effort or strain on the wallet."
        },
        {
          "headline":"Ride your bike.",
          "description":"Bike commuting often saves a bunch of time on the way to and from work. Just remember to find a safe route, keep your bike working great, remain visible, and follow the rules of the road."
        },
        {
          "headline":"Walk when possible.",
          "description":"If the store is just a mile down the road, take a walk. Be sure to find a safe road or sidewalk when possible, and always walk facing traffic. You’ll get some great exercise and you’ll thank yourself later."
        }
      ]
    },
    {
      "name":"Using Free Services",
      "steps":[
        {
          "headline":"Go to the public library.",
          "description":"The library is a great location of information and resources. Most libraries have grown beyond simply having books and periodicals. There are a ton of things that can be had for free at the library. Borrow DVDs and Blu-Rays. Checking out DVDs from the library eliminates the need for the movie theater, Red Box, and Netflix. Use the internet. Get all of your job, work, and social browsing done at the library. Free yourself of an internet bill. Checkout audio books. Many libraries have audio books on a variety of mediums, including options for some e-readers. Get free music. Libraries often have a vast supply of music available. Listen to a favorite CD and renew it until your heart is content."
        },
        {
          "headline":"Utilize public offerings.",
          "description":"Depending on where you live, there could be a ton of free stuff going on. Many larger cities make it a point to get the city involved, particularly if they’d like to draw attention and visitors to a specific spot. Go to movies in the park. Some cities offer free movies on huge screens for free. Bring a blanket, your favorite snacks, maybe a bottle of wine, and you’ve got entertainment for the night. Listen to restaurant bands. It’s not uncommon for live music to crank out of restaurant doors and windows until the wee hours. Find a comfortable location, order an hors d'oeuvre if you’d like, and you can listen all night long. You might even dance along! Use free kids workshops. At many large-scale hardware stores, there are free weekend workshops. Great family entertainment! No tools or hard-hats required. Join local clubs. Look around your area and there are sure to be a variety of clubs. From book clubs to salsa clubs, you’ll meet great people, have wonderful conversation, and share memorable experiences. You may even pick up a great skill."
        },
        {
          "headline":"Find a free, hot shower.",
          "description":"If you’re trying to get by with minimal usage of hot water, and low-priced utilities, there are a few ways to accomplish that feat with free memberships. It all depends on where you live, but if these opportunities are in your location, take advantage of them while you're out and about. Try the YMCA. Some locations do not require a membership fee. If you’re lucky enough to be near one of those spots, just get your pass or access to the facility, and the showers are included. Go to a swimming pool. Skip the swimming part, and go straight to the showers. Many public pools require nothing but identification, and some just a single, up-front fee. After that, the showers are open all summer. Hit a campground. Even though campgrounds are typically cheap to visit, you could easily hike into the location from a few miles out and walk into the campground showers. Use showers at the beach. Easy access, free water, mostly for swimmers and surfers wanting to get the salt off. These outdoor showers are a perfect opportunity to get cleaned up."
        }
      ]
    },
    {
      "name":"Spending Money Wisely",
      "steps":[
        {
          "headline":"Save while spending.",
          "description":"You don’t always need the newest and the best item. There are deals to be had if you keep your eyes open to opportunity. Use a little creativity and you can get what you want for minimal amounts. Buy used. It’s widely known the average new car is a poor investment, but there are a variety of used items that can be purchased to save a lot of money. Look for great deals on clothes at thrift stores, and tools at auctions. Buy at flea markets. People selling at flea markets are often knowledgeable in their niche market. Make no mistake, however, they’re trying to make a deal, and need to sell for less than a retail store to remain feasible. Buy at garage sales/yard sales. Face facts, most garage sales are people looking to get rid of their excess. It’s the possessions they don’t want. They’d much rather make a sale than haul it to the dump. Low-ball every item you see and you’ll walk away with plenty."
        },
        {
          "headline":"Use rewards programs.",
          "description":"Many rewards programs offer free items, discounted items, or a percentage off just for being part of their commerce family. Collect the key rings, punch cards, and free membership numbers to take advantage of whatever deal is currently the best."
        },
        {
          "headline":"Recycle, refurbish, and repurpose.",
          "description":"Make the most of what you have. Be creative and you’ll find a variety of uses for what you already have lying around. Recycle your favorite fabrics to make a floor cushion. Use old paint cans to store screws and nails. Freeze wet sponges and use them as ice packs. Turn an old baby crib into a learning or play area."
        },
        {
          "headline":"Grow and catch your own food.",
          "description":"Buying groceries costs a lot of money because it's not just the food you're purchasing. You're also paying for the labor required to plant, cultivate, deliver, and display the food where you purchase it. Plant a garden. Depending on the plant, the yield for a year doesn’t take many seeds. In fact, to get a year’s worth some vegetables like squash, peppers, and sweet potatoes, it’s less than 5 plants per year. Hunt and fish for your own food. One mature buck will provide 50+ lbs. of meat. That’s countless meals. And fish are very plentiful in the right spots. You could provide the families meat for quite some time with just a few successful trips into the wilderness or waterways."
        },
        {
          "headline":"Save on groceries.",
          "description":"The food bill, especially for households with several people or teenagers, costs an inordinate amount of money. There are several ways to shave that food bill down, however, and save some money. Use coupons. Couponing has become an art-form of sorts, with TV shows and people actually completing huge purchases where, at the end, the store pays them. Learn the tricks of the trade, the discount codes, the “cash back” options, and discover the deals. Take advantage of BOGO deals. BOGO, Buy One Get One, is something that happens at stores all the time. Especially large grocery stores. If you see something nonperishable that your family definitely is going to use in the future (e.g. toilet paper, soap, razors, batteries) and there is a BOGO, it may be time to stock up. The bill might hurt at first, but it will pay off eventually. Prep your meals before work. Avoid the temptations of going out to eat. You’ll save big money not going out, some approximate it at about $500 per month. Take the time to make your own meals, and you’ll not only eat cheaper, but you’ll likely eat healthier."
        },
        {
          "headline":"Choose foods that go a long way.",
          "description":"For very minimal money you can buy quite a bit of rice, beans, pasta, or potatoes. Mix any of those with a whole chicken, that can be separated and frozen for multiple meals, and you’ve got cheap meals for days."
        }
      ]
    },
    {
      "name":"Downgrading Your Necessities",
      "steps":[
        {
          "headline":"Choose minimal furniture.",
          "description":"Assemble a 3’ x 7’ shelf to use as a window seat during the day and as a bed at night. Choose a roll-up cushion, sleeping bag and pillow for bedding, and store your laptop, clothing, bedding, linen and kitchen items beneath the shelf. Cut a slotted handle in the side of a cardboard box for easy pull-out storage."
        },
        {
          "headline":"Make the most of a smaller wardrobe.",
          "description":"Select seven versatile outfits, a hooded coat and gloves. Select three types of footwear to include boots, shoes and sneakers."
        },
        {
          "headline":"Choose minimal cosmetics and make the rest yourself.",
          "description":"Take care of yourself without some commonly used items. You can brush your teeth without a toothbrush, make your own shampoo, soap, deodorant, and toothpaste, and even use your fingers to brush your hair."
        },
        {
          "headline":"Choose minimal linen.",
          "description":"Include a couple bath towels. Besides those towels keep a few multipurpose towels for hand, face, and kitchen usage."
        },
        {
          "headline":"Choose minimal kitchen items for multiple purposes.",
          "description":"Use one large knife to chop and to cut meat, a deep frying pan to steam, fry, or sauté veggies, a spatula to stir and serve, a single bowl and plate. Use a pot to boil and serve as a mixing bowl. Try using a mug as not just a drinking cup, but also a ladle and measuring cup. A fork can double as a whisk, and a spoon can double as a measuring device. Use a towel as a potholder or trivet. Reuse a jar for food storage or as a vase to hold utensils."
        },
        {
          "headline":"Use a laptop and ditch your smart-phone.",
          "description":"Switching to an old flip-phone and using a laptop for media will easily save money because it eliminates your data plan (and potential overage charges). Aside from printing coupons and important documents, adjust to being paperless and doing all other required business on only the laptop."
        }
      ]
    }
  ],
  "text":" Minimizing Transportation Costs Use mass transit. This can’t be stressed enough. You’ll save on gas, vehicle maintenance, and car payments. There are a variety of mass transit options. Get a bus pass. There are usually several spots to be picked up. The schedules are fairly regular. And in some locations, there are even employee commute plans and discounts. Jump on the train. Trains are a safe form of transportation that helps you avoid airport crowds, and you don’t have to do any driving. On top of that, the scenery is great, the boarding times are flexible, and there are often discounted tickets for children. Ride the subway. Subway rides are incredibly affordable, flexible, and have diverse route combinations. You can travel all over a large city with very minimal effort or strain on the wallet. Ride your bike. Bike commuting often saves a bunch of time on the way to and from work. Just remember to find a safe route, keep your bike working great, remain visible, and follow the rules of the road. Walk when possible. If the store is just a mile down the road, take a walk. Be sure to find a safe road or sidewalk when possible, and always walk facing traffic. You’ll get some great exercise and you’ll thank yourself later. Using Free Services Go to the public library. The library is a great location of information and resources. Most libraries have grown beyond simply having books and periodicals. There are a ton of things that can be had for free at the library. Borrow DVDs and Blu-Rays. Checking out DVDs from the library eliminates the need for the movie theater, Red Box, and Netflix. Use the internet. Get all of your job, work, and social browsing done at the library. Free yourself of an internet bill. Checkout audio books. Many libraries have audio books on a variety of mediums, including options for some e-readers. Get free music. Libraries often have a vast supply of music available. Listen to a favorite CD and renew it until your heart is content. Utilize public offerings. Depending on where you live, there could be a ton of free stuff going on. Many larger cities make it a point to get the city involved, particularly if they’d like to draw attention and visitors to a specific spot. Go to movies in the park. Some cities offer free movies on huge screens for free. Bring a blanket, your favorite snacks, maybe a bottle of wine, and you’ve got entertainment for the night. Listen to restaurant bands. It’s not uncommon for live music to crank out of restaurant doors and windows until the wee hours. Find a comfortable location, order an hors d'oeuvre if you’d like, and you can listen all night long. You might even dance along! Use free kids workshops. At many large-scale hardware stores, there are free weekend workshops. Great family entertainment! No tools or hard-hats required. Join local clubs. Look around your area and there are sure to be a variety of clubs. From book clubs to salsa clubs, you’ll meet great people, have wonderful conversation, and share memorable experiences. You may even pick up a great skill. Find a free, hot shower. If you’re trying to get by with minimal usage of hot water, and low-priced utilities, there are a few ways to accomplish that feat with free memberships. It all depends on where you live, but if these opportunities are in your location, take advantage of them while you're out and about. Try the YMCA. Some locations do not require a membership fee. If you’re lucky enough to be near one of those spots, just get your pass or access to the facility, and the showers are included. Go to a swimming pool. Skip the swimming part, and go straight to the showers. Many public pools require nothing but identification, and some just a single, up-front fee. After that, the showers are open all summer. Hit a campground. Even though campgrounds are typically cheap to visit, you could easily hike into the location from a few miles out and walk into the campground showers. Use showers at the beach. Easy access, free water, mostly for swimmers and surfers wanting to get the salt off. These outdoor showers are a perfect opportunity to get cleaned up. Spending Money Wisely Save while spending. You don’t always need the newest and the best item. There are deals to be had if you keep your eyes open to opportunity. Use a little creativity and you can get what you want for minimal amounts. Buy used. It’s widely known the average new car is a poor investment, but there are a variety of used items that can be purchased to save a lot of money. Look for great deals on clothes at thrift stores, and tools at auctions. Buy at flea markets. People selling at flea markets are often knowledgeable in their niche market. Make no mistake, however, they’re trying to make a deal, and need to sell for less than a retail store to remain feasible. Buy at garage sales/yard sales. Face facts, most garage sales are people looking to get rid of their excess. It’s the possessions they don’t want. They’d much rather make a sale than haul it to the dump. Low-ball every item you see and you’ll walk away with plenty. Use rewards programs. Many rewards programs offer free items, discounted items, or a percentage off just for being part of their commerce family. Collect the key rings, punch cards, and free membership numbers to take advantage of whatever deal is currently the best. Recycle, refurbish, and repurpose. Make the most of what you have. Be creative and you’ll find a variety of uses for what you already have lying around. Recycle your favorite fabrics to make a floor cushion. Use old paint cans to store screws and nails. Freeze wet sponges and use them as ice packs. Turn an old baby crib into a learning or play area. Grow and catch your own food. Buying groceries costs a lot of money because it's not just the food you're purchasing. You're also paying for the labor required to plant, cultivate, deliver, and display the food where you purchase it. Plant a garden. Depending on the plant, the yield for a year doesn’t take many seeds. In fact, to get a year’s worth some vegetables like squash, peppers, and sweet potatoes, it’s less than 5 plants per year. Hunt and fish for your own food. One mature buck will provide 50+ lbs. of meat. That’s countless meals. And fish are very plentiful in the right spots. You could provide the families meat for quite some time with just a few successful trips into the wilderness or waterways. Save on groceries. The food bill, especially for households with several people or teenagers, costs an inordinate amount of money. There are several ways to shave that food bill down, however, and save some money. Use coupons. Couponing has become an art-form of sorts, with TV shows and people actually completing huge purchases where, at the end, the store pays them. Learn the tricks of the trade, the discount codes, the “cash back” options, and discover the deals. Take advantage of BOGO deals. BOGO, Buy One Get One, is something that happens at stores all the time. Especially large grocery stores. If you see something nonperishable that your family definitely is going to use in the future (e.g. toilet paper, soap, razors, batteries) and there is a BOGO, it may be time to stock up. The bill might hurt at first, but it will pay off eventually. Prep your meals before work. Avoid the temptations of going out to eat. You’ll save big money not going out, some approximate it at about $500 per month. Take the time to make your own meals, and you’ll not only eat cheaper, but you’ll likely eat healthier. Choose foods that go a long way. For very minimal money you can buy quite a bit of rice, beans, pasta, or potatoes. Mix any of those with a whole chicken, that can be separated and frozen for multiple meals, and you’ve got cheap meals for days. Downgrading Your Necessities Choose minimal furniture. Assemble a 3’ x 7’ shelf to use as a window seat during the day and as a bed at night. Choose a roll-up cushion, sleeping bag and pillow for bedding, and store your laptop, clothing, bedding, linen and kitchen items beneath the shelf. Cut a slotted handle in the side of a cardboard box for easy pull-out storage. Make the most of a smaller wardrobe. Select seven versatile outfits, a hooded coat and gloves. Select three types of footwear to include boots, shoes and sneakers. Choose minimal cosmetics and make the rest yourself. Take care of yourself without some commonly used items. You can brush your teeth without a toothbrush, make your own shampoo, soap, deodorant, and toothpaste, and even use your fingers to brush your hair. Choose minimal linen. Include a couple bath towels. Besides those towels keep a few multipurpose towels for hand, face, and kitchen usage. Choose minimal kitchen items for multiple purposes. Use one large knife to chop and to cut meat, a deep frying pan to steam, fry, or sauté veggies, a spatula to stir and serve, a single bowl and plate. Use a pot to boil and serve as a mixing bowl. Try using a mug as not just a drinking cup, but also a ladle and measuring cup. A fork can double as a whisk, and a spoon can double as a measuring device. Use a towel as a potholder or trivet. Reuse a jar for food storage or as a vase to hold utensils. Use a laptop and ditch your smart-phone. Switching to an old flip-phone and using a laptop for media will easily save money because it eliminates your data plan (and potential overage charges). Aside from printing coupons and important documents, adjust to being paperless and doing all other required business on only the laptop.",
  "tyn_model":[
    "mass transit",
    "subway",
    "bike",
    "dvds",
    "audio books",
    "music",
    "water",
    "fish",
    "meat",
    "soap",
    "linen",
    "laptop",
    "bus",
    "train",
    "trains",
    "books",
    "blanket",
    "swimming pool",
    "showers",
    "tools",
    "garage sales/",
    "garage sales",
    "sponges",
    "ice packs",
    "garden",
    "vegetables",
    "squash",
    "peppers",
    "sweet potatoes",
    "coupons",
    "couponing",
    "“cash",
    "” options",
    "toilet paper",
    "razors",
    "batteries",
    "rice",
    "beans",
    "pasta",
    "potatoes",
    "chicken",
    "’ x",
    "’ shelf",
    "roll-up cushion",
    "sleeping bag",
    "cardboard box",
    "gloves",
    "cosmetics",
    "shampoo",
    "bath towels",
    "knife",
    "deep frying",
    "spatula",
    "bowl",
    "plate",
    "pot",
    "mug",
    "drinking cup",
    "ladle",
    "fork",
    "whisk",
    "spoon",
    "towel",
    "jar",
    "smart-phone",
    "flip-phone"
  ],
  "tyn_section":[

  ]
}