{
  "title":"How to Mine in 7 Days to Die",
  "url":"https://www.wikihow.com/Mine-in-7-Days-to-Die",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "PC Roleplaying Games"
  ],
  "parts":[
    {
      "name":"Preparing to Dig",
      "steps":[
        {
          "headline":"Make a Shovel.",
          "description":"The Shovel is a tool used for digging the first layer of your mine and destroying ground blocks like dirt. It can be found randomly in the game, or you can craft it. To create a Shovel, you need two types of items: 3 Sticks and 4 Iron Ingots. After gathering the items, press I to open your craft window and then click Shovel to see the highlighted pattern of the tool you're about to make. You will need to place the materials in the correct spots to create the basic Shovel shape. At the lower left side of the window, place the 4 Iron ingots into the bottom box (forming a 2x2 box). Add the sticks horizontally from the upper right of the craft window."
        },
        {
          "headline":"Make a Pickaxe.",
          "description":"The pickaxe is the main tool used to dig deeper layers with tougher blocks made of stones, ores, metal and other minerals. A mere shovel can't break these blocks easily, and trying will just lower its durability. To make a Pickaxe, you need 4 Iron Ingots and 3 Sticks. Press I to open your craft window; select Pickaxe from the list to activate the highlighted pattern of the tool. Following the pattern, place the Iron ingot in each box. Line up the three sticks horizontally over the highlighted pattern."
        },
        {
          "headline":"Make Torches.",
          "description":"Zombies spawn in dark areas, including mine tunnels. It's important that you place a lot of torches in your mineshaft to avoid this. To make a torch, you need 1 Brown Grass or 1 Cloth Fragment and 1 Stick. Press I and put the Stick in the middle and then add the Brown Grass or Cloth Fragment right above it. Torches can be placed against the wall or on the floor. Sometimes it doesn't show that it's burning, but rest assured it still generates light."
        },
        {
          "headline":"Gather Food and Water.",
          "description":"While you're underground and digging, your Hunger and Stamina will decrease as time passes so it's important to have enough supplies before you jump into a long excavation."
        }
      ]
    },
    {
      "name":"Digging Your Mine",
      "steps":[
        {
          "headline":"Dig deep.",
          "description":"Zombies can dig through the ground. To avoid being invaded by Zombies, you will need to dig deep until you can no longer hear anything from the surface. You can create a ladder for your climb up to the surface, or simply make stairs using the blocks you have from digging. A good spot for your mineshaft can be in the basement floor inside the house; it will protect you from hordes and giant bugs."
        },
        {
          "headline":"Avoid making a big room.",
          "description":"Mining a huge room, just like in real life, has a chance to cave-in that could possibly kill you. Make sure to leave support pillars; a simple stone block is enough to protect your room from collapsing."
        },
        {
          "headline":"Mine Ores, Coal and Minerals.",
          "description":"Use the pickaxe to destroy the blocks and pick up ores, coal and other minerals as you dig. Remember to drink water; a high stamina and low thirst makes your character dig faster which saves a lot of the durability of your tool."
        },
        {
          "headline":"Make TNT.",
          "description":"This alternative way will help you dig easier, saving you from using so much food and water, but using it is riskier as the chance of having a cave-in is quite high. To make TNT, you need 7 Papers, 1 Plant Fiber and 2 Gun Powders. You can find Plant Fibers around the world. To create a one, you need Yucca Plants and Brown Grass\nPaper can be crafted from a book; place it in the center of the craft window. You can find paper in the world too, mostly in rubbish or trash. To create Gunpowder, place 1 Potassium Nitrate Powder at the center of the craft window then 1 Lump of Coal above. Both items can be found through digging. Except for crossbow, shooting TNT with any weapon will detonate it. It is recommended that you stand a good distance away from it before detonating since TNT causes a lot of splash damage."
        },
        {
          "headline":"Use Cobblestone to mark your path.",
          "description":"Mining can get disorienting, so try laying down cobblestone as you go to clearly mark your path in and out. You can then mine off to the sides of the path you created."
        }
      ]
    },
    {
      "name":"Surviving using Mining",
      "steps":[
        {
          "headline":"Make a digging site ASAP.",
          "description":"To survive, gather food and water and then jump straight to digging. In multiplayer mode, especially with Friendly Fire switched off, players tend to kill other players to get their loot; ammunition and weaponry will be hard to find. You will last a lot longer if you create a good underground bunker. Make sure to block up your entrance to avoid other players from discovering your hide out."
        },
        {
          "headline":"Make Explosives.",
          "description":"Explosives such as Tin Land Mine and Pipe Bomb are good weapons. You can throw pipe bombs at players or zombies, while the tin land mine is a ground-based explosive which can be strategically placed on any flat surface except water. Tin Land Mine: You need 1 Scrap Metal, 1 Gunpowder, and 1 Candy Tin Can. To craft, just place the three materials in the middle of the craft window from top to bottom, scrap metal, Gunpowder and candy tin can, respectively. Pipe Bomb: You only need 1 Plant Fiber, 1 Gunpowder and 1 short Iron Pipe. Short Iron Pipe can be found in air conditioners or can be crafted from Forging Iron. To craft a Pipe Bomb, place the Gunpowder in the very center of the craft window, Plant Fibers above it and the Short Iron Pipe below."
        },
        {
          "headline":"Make an entrance and exit.",
          "description":"If you plan on spending a lot of time underground, you should consider having to openings to your mine. While this can be a little more difficult to defend, it can greatly increase your chance of survival if one entrance is blocked. Use land mines to defend the exit you are least likely to use, and make sure that it is well-disguised."
        }
      ]
    }
  ],
  "text":" Preparing to Dig Make a Shovel. The Shovel is a tool used for digging the first layer of your mine and destroying ground blocks like dirt. It can be found randomly in the game, or you can craft it. To create a Shovel, you need two types of items: 3 Sticks and 4 Iron Ingots. After gathering the items, press I to open your craft window and then click Shovel to see the highlighted pattern of the tool you're about to make. You will need to place the materials in the correct spots to create the basic Shovel shape. At the lower left side of the window, place the 4 Iron ingots into the bottom box (forming a 2x2 box). Add the sticks horizontally from the upper right of the craft window. Make a Pickaxe. The pickaxe is the main tool used to dig deeper layers with tougher blocks made of stones, ores, metal and other minerals. A mere shovel can't break these blocks easily, and trying will just lower its durability. To make a Pickaxe, you need 4 Iron Ingots and 3 Sticks. Press I to open your craft window; select Pickaxe from the list to activate the highlighted pattern of the tool. Following the pattern, place the Iron ingot in each box. Line up the three sticks horizontally over the highlighted pattern. Make Torches. Zombies spawn in dark areas, including mine tunnels. It's important that you place a lot of torches in your mineshaft to avoid this. To make a torch, you need 1 Brown Grass or 1 Cloth Fragment and 1 Stick. Press I and put the Stick in the middle and then add the Brown Grass or Cloth Fragment right above it. Torches can be placed against the wall or on the floor. Sometimes it doesn't show that it's burning, but rest assured it still generates light. Gather Food and Water. While you're underground and digging, your Hunger and Stamina will decrease as time passes so it's important to have enough supplies before you jump into a long excavation. Digging Your Mine Dig deep. Zombies can dig through the ground. To avoid being invaded by Zombies, you will need to dig deep until you can no longer hear anything from the surface. You can create a ladder for your climb up to the surface, or simply make stairs using the blocks you have from digging. A good spot for your mineshaft can be in the basement floor inside the house; it will protect you from hordes and giant bugs. Avoid making a big room. Mining a huge room, just like in real life, has a chance to cave-in that could possibly kill you. Make sure to leave support pillars; a simple stone block is enough to protect your room from collapsing. Mine Ores, Coal and Minerals. Use the pickaxe to destroy the blocks and pick up ores, coal and other minerals as you dig. Remember to drink water; a high stamina and low thirst makes your character dig faster which saves a lot of the durability of your tool. Make TNT. This alternative way will help you dig easier, saving you from using so much food and water, but using it is riskier as the chance of having a cave-in is quite high. To make TNT, you need 7 Papers, 1 Plant Fiber and 2 Gun Powders. You can find Plant Fibers around the world. To create a one, you need Yucca Plants and Brown Grass\nPaper can be crafted from a book; place it in the center of the craft window. You can find paper in the world too, mostly in rubbish or trash. To create Gunpowder, place 1 Potassium Nitrate Powder at the center of the craft window then 1 Lump of Coal above. Both items can be found through digging. Except for crossbow, shooting TNT with any weapon will detonate it. It is recommended that you stand a good distance away from it before detonating since TNT causes a lot of splash damage. Use Cobblestone to mark your path. Mining can get disorienting, so try laying down cobblestone as you go to clearly mark your path in and out. You can then mine off to the sides of the path you created. Surviving using Mining Make a digging site ASAP. To survive, gather food and water and then jump straight to digging. In multiplayer mode, especially with Friendly Fire switched off, players tend to kill other players to get their loot; ammunition and weaponry will be hard to find. You will last a lot longer if you create a good underground bunker. Make sure to block up your entrance to avoid other players from discovering your hide out. Make Explosives. Explosives such as Tin Land Mine and Pipe Bomb are good weapons. You can throw pipe bombs at players or zombies, while the tin land mine is a ground-based explosive which can be strategically placed on any flat surface except water. Tin Land Mine: You need 1 Scrap Metal, 1 Gunpowder, and 1 Candy Tin Can. To craft, just place the three materials in the middle of the craft window from top to bottom, scrap metal, Gunpowder and candy tin can, respectively. Pipe Bomb: You only need 1 Plant Fiber, 1 Gunpowder and 1 short Iron Pipe. Short Iron Pipe can be found in air conditioners or can be crafted from Forging Iron. To craft a Pipe Bomb, place the Gunpowder in the very center of the craft window, Plant Fibers above it and the Short Iron Pipe below. Make an entrance and exit. If you plan on spending a lot of time underground, you should consider having to openings to your mine. While this can be a little more difficult to defend, it can greatly increase your chance of survival if one entrance is blocked. Use land mines to defend the exit you are least likely to use, and make sure that it is well-disguised.",
  "tyn_model":[
    "pickaxe",
    "shovel",
    "water",
    "tnt",
    "gunpowder",
    "torches",
    "coal",
    "pipe bomb",
    "iron",
    "plant fiber",
    "plant fibers",
    "paper",
    "cobblestone",
    "short iron pipe",
    "stones",
    "iron ingot",
    "torch",
    "brown grass",
    "food",
    "ladder",
    "minerals",
    "papers",
    "potassium nitrate",
    "friendly fire",
    "ammunition",
    "weaponry",
    "explosives",
    "pipe bombs",
    "tin land mine",
    "candy tin can",
    "scrap metal",
    "candy tin",
    "air conditioners",
    "forging iron",
    "land mines"
  ],
  "tyn_section":[

  ]
}