{
  "title":"How to Make Oatmeal Play Clay",
  "url":"https://www.wikihow.com/Make-Oatmeal-Play-Clay",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids",
    "Putty Dough and Slime"
  ],
  "methods":[
    {
      "name":"Oatmeal play clay",
      "steps":[
        {
          "headline":"Mix the flour and oatmeal in a large bowl.",
          "description":"Add the water slowly, adjusting if it becomes too wet or stays too dry. Add a few drops of food coloring if wished."
        },
        {
          "headline":"Store in an airtight container.",
          "description":""
        },
        {
          "headline":"Allow plenty of chances for playing with this fun play clay.",
          "description":"Let the kids make whatever they like; if they're not sure, you can encourage them to sculpt figurines, bowls, dolls or beads to make jewelry."
        }
      ]
    },
    {
      "name":"Oat play dough",
      "steps":[
        {
          "headline":"Place all of the dry ingredients, except for the oats, into a mixing bowl.",
          "description":"Mix together well."
        },
        {
          "headline":"Add the oil.",
          "description":"Stir in to combine thoroughly."
        },
        {
          "headline":"Add the boiling water.",
          "description":"Stir in one cup at a time, stirring vigorously to combine each cup completely."
        },
        {
          "headline":"Allow to cool enough to handle.",
          "description":""
        },
        {
          "headline":"Place the dough onto a work surface.",
          "description":"Knead it until it ceases to be sticky and is smooth to the touch."
        },
        {
          "headline":"Add the oats.",
          "description":"Add gradually, until the dough reaches the consistency you like. Knead until smooth."
        },
        {
          "headline":"Play with the oat dough.",
          "description":"Give the dough to your child to play with. Give with some plastic cookie cutters for the ultimate fun. Store in an airtight container when not in use. Although not toxic if eaten, it is so salty that a child should be put off using it."
        }
      ]
    }
  ],
  "text":" Oatmeal play clay Mix the flour and oatmeal in a large bowl. Add the water slowly, adjusting if it becomes too wet or stays too dry. Add a few drops of food coloring if wished. Store in an airtight container.  Allow plenty of chances for playing with this fun play clay. Let the kids make whatever they like; if they're not sure, you can encourage them to sculpt figurines, bowls, dolls or beads to make jewelry. Oat play dough Place all of the dry ingredients, except for the oats, into a mixing bowl. Mix together well. Add the oil. Stir in to combine thoroughly. Add the boiling water. Stir in one cup at a time, stirring vigorously to combine each cup completely. Allow to cool enough to handle.  Place the dough onto a work surface. Knead it until it ceases to be sticky and is smooth to the touch. Add the oats. Add gradually, until the dough reaches the consistency you like. Knead until smooth. Play with the oat dough. Give the dough to your child to play with. Give with some plastic cookie cutters for the ultimate fun. Store in an airtight container when not in use. Although not toxic if eaten, it is so salty that a child should be put off using it.",
  "tyn_model":[
    "water",
    "airtight container",
    "oats",
    "oatmeal play clay",
    "flour",
    "oatmeal",
    "large bowl",
    "food coloring",
    "bowls",
    "oat play dough",
    "mixing bowl",
    "oil",
    "oat dough"
  ],
  "tyn_section":[

  ]
}