{
  "title":"How to Activate Overdrive on Rock Band",
  "url":"https://www.wikihow.com/Activate-Overdrive-on-Rock-Band",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Rock Band"
  ],
  "parts":[
    {
      "name":"Guitar",
      "steps":[
        {
          "headline":"Pick a song on guitar; whether it's bass or regular guitar.",
          "description":""
        },
        {
          "headline":"Get all the overdrive phrase notes.",
          "description":""
        },
        {
          "headline":"Look a the bottom of the screen, and you should see your multiplier.",
          "description":"Right below that, there's a bar, and if you get two Overdrive phrases it will be yellow covering halfway of the bar."
        },
        {
          "headline":"Use Overdrive by lifting the guitar sideways, just like Guitar Hero.",
          "description":""
        }
      ]
    },
    {
      "name":"Microphone",
      "steps":[
        {
          "headline":"Sing on the right notes when the notes are gold.",
          "description":""
        },
        {
          "headline":"When there are no words, but a golden box, scream or say anything into the microphone to activate overdrive.",
          "description":""
        }
      ]
    },
    {
      "name":"Keyboard",
      "steps":[
        {
          "headline":"Play keyboard in the same way as the guitar.",
          "description":"(Unless using Pro Keys.)"
        },
        {
          "headline":"When the notes turn chrome/white, hit all of them.",
          "description":"Don't mess up a note or you lose your chance."
        },
        {
          "headline":"You have an Overdrive meter in the same area as guitar.",
          "description":"At least two overdrive phrases needed."
        },
        {
          "headline":"Right by the touch bar, there is a button.",
          "description":"Press it and you will activate Overdrive."
        }
      ]
    }
  ],
  "text":" Guitar Pick a song on guitar; whether it's bass or regular guitar.  Get all the overdrive phrase notes.  Look a the bottom of the screen, and you should see your multiplier. Right below that, there's a bar, and if you get two Overdrive phrases it will be yellow covering halfway of the bar. Use Overdrive by lifting the guitar sideways, just like Guitar Hero.  Microphone Sing on the right notes when the notes are gold.  When there are no words, but a golden box, scream or say anything into the microphone to activate overdrive.  Keyboard Play keyboard in the same way as the guitar. (Unless using Pro Keys.) When the notes turn chrome/white, hit all of them. Don't mess up a note or you lose your chance. You have an Overdrive meter in the same area as guitar. At least two overdrive phrases needed. Right by the touch bar, there is a button. Press it and you will activate Overdrive.",
  "tyn_model":[
    "guitar",
    "microphone",
    "keyboard",
    "guitar hero"
  ],
  "tyn_section":[

  ]
}