{
  "title":"How to Beat Zexion (Data Battle) in Kingdom Hearts II",
  "url":"https://www.wikihow.com/Beat-Zexion-(Data-Battle)-in-Kingdom-Hearts-II",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "parts":[
    {
      "name":"Knowing Which Equipment to Use",
      "steps":[
        {
          "headline":"Use Decisive Pumpkin.",
          "description":"This weapon has the unique ability Combo Boost; this lets you do more damage the longer your combo gets."
        },
        {
          "headline":"Have Full Bloom+.",
          "description":"This adds 3 points to Sora's strength."
        },
        {
          "headline":"Have High Ribbon.",
          "description":"This gives Sora +25% damage reduction to all elements."
        },
        {
          "headline":"Have Ribbon.",
          "description":"Damage from all elements are reduced."
        },
        {
          "headline":"Collect lots of Ethers and Elixirs.",
          "description":"These are essential in the battle in case you need to restore HP and MP."
        }
      ]
    },
    {
      "name":"Knowing about Zexion's Attacks",
      "steps":[
        {
          "headline":"Be careful of his book transform.",
          "description":"Zexion transforms you and your party members into books. This attack is unavoidable, even if you try to break the books, so you'll just be missing out on precious combos that you can hit Zexion with. Every time Zexion turns someone into a book, he'll leave you a small opportunity to land a combo on him, so stay close!"
        },
        {
          "headline":"Block his book attack.",
          "description":"While in the book world, books will fly at you. This attack is blockable with Reflega"
        },
        {
          "headline":"Dodge his coordinated book attack.",
          "description":"Books will attack Sora in a certain sequence. You can dodge this attack by gliding (while in the air, analog + □) around the area. This attack is the best way to spot which book is Zexion. Zexion will always be that one book that's not in sync with the others."
        },
        {
          "headline":"Watch for his shuffle.",
          "description":"Zexion manipulates your attack panel, turning it into a book. Press ∆ to shuffle the pages and find \"Release,\" \"Sneak Away,\" or \"Regain.\" Also, you can use words such as \"Treasure\" or \"Heal\" to get some HP balls."
        },
        {
          "headline":"Be careful of his meteor shower.",
          "description":"You'll see 3 spotlights, 2 red and 1 blue. If you manage to step on the blue one, you'll be spared from the meteor shower, and you'll be able to find Zexion quickly."
        }
      ]
    },
    {
      "name":"Battling Zexion",
      "steps":[
        {
          "headline":"Get near Zexion as soon as the battle starts.",
          "description":"Donald and Goofy will get turned to books, leave them as it's unavoidable. Your goal here is to land a combo on Zexion after he turns either Goofy or Donald into a book. You'll have about a second to land a hit on him during that time, so be quick."
        },
        {
          "headline":"Cast Reflega a second after you get pulled into the book world.",
          "description":"This will help you avoid the damage from his first attack and lock on to him. Zexion will be that first book that attacks you."
        },
        {
          "headline":"Keep attacking the book you locked on to until you see the Reaction Command.",
          "description":"Press ∆ when it appears. Zexion may try to attack you; all of his attacks can be blocked with Reflega without a problem."
        },
        {
          "headline":"Attack Zexion with a combo once you get out of the book world.",
          "description":"This will be your only way of dealing damage on him, so don't let it slip. After a combo Zexion will once again pull you into the book world."
        },
        {
          "headline":"Watch out for the spotlights.",
          "description":"Depending on how much damage you dealt Zexion, he may use his desperation move. A good way of guessing where the blue light will go is by counting to 13 and jumping on the spot that you predict will turn blue."
        },
        {
          "headline":"Proceed using Reflega and attacking Zexion's book form until you get a Reaction Command.",
          "description":"Sometimes Zexion will use shuffle and turn your command panel into a book; just look for \"Sneak Away,\" \"Release,\" or \"Regain\" to dispel it."
        },
        {
          "headline":"Get a combo on him once you get sent back to the real world.",
          "description":""
        },
        {
          "headline":"Repeat this process until he dies.",
          "description":""
        }
      ]
    }
  ],
  "text":" Knowing Which Equipment to Use Use Decisive Pumpkin. This weapon has the unique ability Combo Boost; this lets you do more damage the longer your combo gets. Have Full Bloom+. This adds 3 points to Sora's strength. Have High Ribbon. This gives Sora +25% damage reduction to all elements. Have Ribbon. Damage from all elements are reduced. Collect lots of Ethers and Elixirs. These are essential in the battle in case you need to restore HP and MP. Knowing about Zexion's Attacks Be careful of his book transform. Zexion transforms you and your party members into books. This attack is unavoidable, even if you try to break the books, so you'll just be missing out on precious combos that you can hit Zexion with. Every time Zexion turns someone into a book, he'll leave you a small opportunity to land a combo on him, so stay close! Block his book attack. While in the book world, books will fly at you. This attack is blockable with Reflega Dodge his coordinated book attack. Books will attack Sora in a certain sequence. You can dodge this attack by gliding (while in the air, analog + □) around the area. This attack is the best way to spot which book is Zexion. Zexion will always be that one book that's not in sync with the others. Watch for his shuffle. Zexion manipulates your attack panel, turning it into a book. Press ∆ to shuffle the pages and find \"Release,\" \"Sneak Away,\" or \"Regain.\" Also, you can use words such as \"Treasure\" or \"Heal\" to get some HP balls. Be careful of his meteor shower. You'll see 3 spotlights, 2 red and 1 blue. If you manage to step on the blue one, you'll be spared from the meteor shower, and you'll be able to find Zexion quickly. Battling Zexion Get near Zexion as soon as the battle starts. Donald and Goofy will get turned to books, leave them as it's unavoidable. Your goal here is to land a combo on Zexion after he turns either Goofy or Donald into a book. You'll have about a second to land a hit on him during that time, so be quick. Cast Reflega a second after you get pulled into the book world. This will help you avoid the damage from his first attack and lock on to him. Zexion will be that first book that attacks you. Keep attacking the book you locked on to until you see the Reaction Command. Press ∆ when it appears. Zexion may try to attack you; all of his attacks can be blocked with Reflega without a problem. Attack Zexion with a combo once you get out of the book world. This will be your only way of dealing damage on him, so don't let it slip. After a combo Zexion will once again pull you into the book world. Watch out for the spotlights. Depending on how much damage you dealt Zexion, he may use his desperation move. A good way of guessing where the blue light will go is by counting to 13 and jumping on the spot that you predict will turn blue. Proceed using Reflega and attacking Zexion's book form until you get a Reaction Command. Sometimes Zexion will use shuffle and turn your command panel into a book; just look for \"Sneak Away,\" \"Release,\" or \"Regain\" to dispel it. Get a combo on him once you get sent back to the real world.  Repeat this process until he dies. ",
  "tyn_model":[
    "zexion",
    "book",
    "books",
    "reflega",
    "pumpkin",
    "ribbon",
    "ethers",
    "elixirs",
    "□)",
    "∆ to",
    "∆ when"
  ],
  "tyn_section":[

  ]
}