{
  "title":"How to Clean Tough Stains from a Bathtub",
  "url":"https://www.wikihow.com/Clean-Tough-Stains-from-a-Bathtub",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Stain Removal"
  ],
  "methods":[
    {
      "name":"Removing Stains from an Acrylic Bathtub",
      "steps":[
        {
          "headline":"Avoid abrasive chemical cleaners.",
          "description":"When cleaning an acrylic bathtub, stay away from harsh astringent powders such as Comet and Ajax, as well as harsh chemicals like bleach. Acrylic is a soft material and is therefore easily damaged. These types of products are almost guaranteed to ruin your tub's finish. It's generally a good idea to start with the gentlest cleaning solution available to you and work your way up to more powerful options if that doesn't work."
        },
        {
          "headline":"Spray the stains with vinegar.",
          "description":"Distilled white vinegar makes an excellent natural cleaning solution, especially on smooth surfaces like acrylic that release stains easily. Fill a spray bottle with vinegar and keep it on hand for routine bathroom cleaning tasks. Apply the vinegar liberally to completely cover the affected area. Lemon juice makes a fine alternative to vinegar if you happen to have some in the refrigerator."
        },
        {
          "headline":"Allow the vinegar to sit for 10-20 minutes.",
          "description":"As it sits, the acidity in the vinegar will break down mold, grime and discoloration so that they can wiped away with ease. You may even see stains begin to dissolve and run off on their own, before you even begin scrubbing. Make sure you give the vinegar ample time to begin working. For especially troublesome spots, sprinkle a little baking soda onto the vinegar as it soaks."
        },
        {
          "headline":"Wipe away the stains with a soft sponge.",
          "description":"The yellow side of a normal dish sponge will do the trick. After being soaked with vinegar, dirt and grime should simply lift off with little difficulty. Use a quick back and forth scrubbing motion, and continue treating the stains until they vanish. You can also use specialty scrubbing tools, like the Mr. Clean Magic Eraser, which are made from porous melamine foam for added stain-fighting power."
        },
        {
          "headline":"Rinse out the inside of the tub.",
          "description":"Run the faucet for a few minutes to wash away every last trace of dissolved grime and dirty vinegar solution. If you’re cleaning a bathtub with an adjustable shower head, turn it on and direct the stream over the areas you just treated. Once it’s clean, the tub will need to dry so that stain-causing bacteria doesn’t return. Most bathtub stains are the result of germs that create a filmy residue as they accumulate. Leave the shower curtain drawn and switch on the overhead fan so that the tub receives steady airflow."
        }
      ]
    },
    {
      "name":"Removing Stains from an Enamel Bathtub",
      "steps":[
        {
          "headline":"Try cleaning with vinegar first.",
          "description":"Though it’s a mild natural cleanser, vinegar will typically be potent enough to deal with most stains when applied heavily and given time to set up. Spray the tub down thoroughly, let the vinegar sit for a few minutes, then scrub away the stains using a sponge or stiff-bristled brush. If you discover that vinegar isn't having the desired effect, you can move on to more intensive methods. There will come a point when simply adding more and more vinegar won’t suffice."
        },
        {
          "headline":"Use a bleach-free commercial cleaning spray.",
          "description":"Products like Lysol All Purpose Cleaner, Kaboom, Shout! and Scrubbing Bubbles shower cleaner are good for eating away at tough stains without damaging delicate surfaces. Since most of these products contain a similar combination of ingredients, any of them will work as well as another. Just make sure whatever product you choose doesn’t contain bleach, as this can severely weaken the outer enamel layer of the tub. Only buy cleaners that have been approved for use on enamel-coated bathroom surfaces. Be sure to check the label carefully before buying a particular cleaning product so you'll know you’re getting what you need. If possible, open a nearby window, open the door, and turn on a fan to ventilate the bathroom while you clean with any of these products."
        },
        {
          "headline":"Make your own natural cleaner.",
          "description":"If you're reluctant to go shopping, you can formulate a simple all-purpose bathroom cleaner at home by mixing together warm water, baking soda, Castile soap and essential oils in a spray bottle. All of these ingredients are readily available and safe to use but are quite potent when brought together. Once they're combined, spray the mixture onto the stained surface and give it a few minutes to take effect before wiping it away. If you're having trouble tracking down Castile soap, hydrogen peroxide will make an acceptable substitute. Essential oils like tea tree and peppermint can also act as natural disinfectants."
        },
        {
          "headline":"Soak problem areas for several minutes.",
          "description":"Mist on the solution and give it a chance to sit. Pay special attention to places with heavy staining and discoloration. The cleaning solution should get to work dissolving these stains right away. The longer you let the solution sit, the more effective it will be at lifting long-settled residue. Wear gloves and work in a well-ventilated area when handling chemical cleaning solutions."
        },
        {
          "headline":"Scrub out the stains gently.",
          "description":"Use a soft sponge or microfiber towel to avoid leaving marks or scratches. Go over the stains using a gentle circular motion. When you’re finished, rinse away any remaining dirt and cleaning solution and let the tub dry completely. If necessary, apply another burst of cleaning solution. Wipe and repeat until the stains come out of the enamel finish. Using anything more abrasive than a sponge to scrub enamel may wear down the finish."
        }
      ]
    },
    {
      "name":"Removing Stains from a Porcelain Bathtub",
      "steps":[
        {
          "headline":"Pick up a canister of abrasive cleaning powder.",
          "description":"For thick buildup on porcelain surfaces, you’ll need to use something a little more heavy-duty. Use a product like Comet or Ajax that comes in powdered form. The small particles will be able to penetrate deeper into stains that have set up on the surface of the tub to remove them. Powdered cleansers contain chemicals known as surfactants which have mild abrasive properties. This makes them much more effective for addressing hardened, stuck-on residue. Apply abrasive cleansers sparingly. For most jobs, a single canister be enough for a single thorough cleaning."
        },
        {
          "headline":"Stick with natural alternatives.",
          "description":"Alternately, tough stains like rust and hard water residue can be treated with a mixture of hydrogen peroxide and cream of tartar. Blend the two ingredients together until they're about the same consistency as cake frosting and spread them directly over the stains. After 10 minutes, buff the stains with a nylon brush or pumice stone until they're erased completely. Homemade concoctions like hydrogen peroxide and cream of tartar will be preferable for those who are wary of the health and environmental effects of chemical cleaning products. Hydrogen peroxide will also help treat age-related discoloration and lighten the finish of the tub."
        },
        {
          "headline":"Sprinkle the cleaning powder around the stained tub.",
          "description":"A moderate dusting should be enough to deal with most messes. The powder won’t stick to the surface of the porcelain on its own, but when combined with a liquid it will form a paste that can be spread directly over stains. Be sure to cover the bottom of the tub, where accumulated mold can become a slipping hazard."
        },
        {
          "headline":"Add enough water to produce a paste.",
          "description":"Spray purified or ordinary tap water onto the cleaning powder. With the addition of moisture, the powder will take on a thick, foamy consistency. Rub this paste into the stains and give it about half an hour to take effect. You can also wet a clean sponge or washcloth and use it to rub in the cleaner until it thickens. Another option is to wet the tub before you apply the cleanser. Spray the tub with the shower head or fill a cup with water and pour it around the inside of the tub. Be careful not to add an excessive amount of water. The cleaner won’t be as effective if it’s too thin."
        },
        {
          "headline":"Scour the stains with a sturdy scrubber.",
          "description":"Since porcelain has a hard, durable finish, you can scrub it safely with an abrasive implement without worrying about scratching it up. For best results, equip a pumice stone or stiff-bristled scrubbing brush. Work on the stains until they’re completely erased, then rinse the tub with clean water and let it dry before using it again. If you don’t own a dedicated scrubbing brush, you can use the rough green side of a kitchen sponge. Never use steel wool or any similar material to scour a porcelain tub. Even though porcelain is scratch-resistant, this can be enough to cause permanent damage to the finish."
        }
      ]
    }
  ],
  "text":" Removing Stains from an Acrylic Bathtub Avoid abrasive chemical cleaners. When cleaning an acrylic bathtub, stay away from harsh astringent powders such as Comet and Ajax, as well as harsh chemicals like bleach. Acrylic is a soft material and is therefore easily damaged. These types of products are almost guaranteed to ruin your tub's finish. It's generally a good idea to start with the gentlest cleaning solution available to you and work your way up to more powerful options if that doesn't work. Spray the stains with vinegar. Distilled white vinegar makes an excellent natural cleaning solution, especially on smooth surfaces like acrylic that release stains easily. Fill a spray bottle with vinegar and keep it on hand for routine bathroom cleaning tasks. Apply the vinegar liberally to completely cover the affected area. Lemon juice makes a fine alternative to vinegar if you happen to have some in the refrigerator. Allow the vinegar to sit for 10-20 minutes. As it sits, the acidity in the vinegar will break down mold, grime and discoloration so that they can wiped away with ease. You may even see stains begin to dissolve and run off on their own, before you even begin scrubbing. Make sure you give the vinegar ample time to begin working. For especially troublesome spots, sprinkle a little baking soda onto the vinegar as it soaks. Wipe away the stains with a soft sponge. The yellow side of a normal dish sponge will do the trick. After being soaked with vinegar, dirt and grime should simply lift off with little difficulty. Use a quick back and forth scrubbing motion, and continue treating the stains until they vanish. You can also use specialty scrubbing tools, like the Mr. Clean Magic Eraser, which are made from porous melamine foam for added stain-fighting power. Rinse out the inside of the tub. Run the faucet for a few minutes to wash away every last trace of dissolved grime and dirty vinegar solution. If you’re cleaning a bathtub with an adjustable shower head, turn it on and direct the stream over the areas you just treated. Once it’s clean, the tub will need to dry so that stain-causing bacteria doesn’t return. Most bathtub stains are the result of germs that create a filmy residue as they accumulate. Leave the shower curtain drawn and switch on the overhead fan so that the tub receives steady airflow. Removing Stains from an Enamel Bathtub Try cleaning with vinegar first. Though it’s a mild natural cleanser, vinegar will typically be potent enough to deal with most stains when applied heavily and given time to set up. Spray the tub down thoroughly, let the vinegar sit for a few minutes, then scrub away the stains using a sponge or stiff-bristled brush. If you discover that vinegar isn't having the desired effect, you can move on to more intensive methods. There will come a point when simply adding more and more vinegar won’t suffice. Use a bleach-free commercial cleaning spray. Products like Lysol All Purpose Cleaner, Kaboom, Shout! and Scrubbing Bubbles shower cleaner are good for eating away at tough stains without damaging delicate surfaces. Since most of these products contain a similar combination of ingredients, any of them will work as well as another. Just make sure whatever product you choose doesn’t contain bleach, as this can severely weaken the outer enamel layer of the tub. Only buy cleaners that have been approved for use on enamel-coated bathroom surfaces. Be sure to check the label carefully before buying a particular cleaning product so you'll know you’re getting what you need. If possible, open a nearby window, open the door, and turn on a fan to ventilate the bathroom while you clean with any of these products. Make your own natural cleaner. If you're reluctant to go shopping, you can formulate a simple all-purpose bathroom cleaner at home by mixing together warm water, baking soda, Castile soap and essential oils in a spray bottle. All of these ingredients are readily available and safe to use but are quite potent when brought together. Once they're combined, spray the mixture onto the stained surface and give it a few minutes to take effect before wiping it away. If you're having trouble tracking down Castile soap, hydrogen peroxide will make an acceptable substitute. Essential oils like tea tree and peppermint can also act as natural disinfectants. Soak problem areas for several minutes. Mist on the solution and give it a chance to sit. Pay special attention to places with heavy staining and discoloration. The cleaning solution should get to work dissolving these stains right away. The longer you let the solution sit, the more effective it will be at lifting long-settled residue. Wear gloves and work in a well-ventilated area when handling chemical cleaning solutions. Scrub out the stains gently. Use a soft sponge or microfiber towel to avoid leaving marks or scratches. Go over the stains using a gentle circular motion. When you’re finished, rinse away any remaining dirt and cleaning solution and let the tub dry completely. If necessary, apply another burst of cleaning solution. Wipe and repeat until the stains come out of the enamel finish. Using anything more abrasive than a sponge to scrub enamel may wear down the finish. Removing Stains from a Porcelain Bathtub Pick up a canister of abrasive cleaning powder. For thick buildup on porcelain surfaces, you’ll need to use something a little more heavy-duty. Use a product like Comet or Ajax that comes in powdered form. The small particles will be able to penetrate deeper into stains that have set up on the surface of the tub to remove them. Powdered cleansers contain chemicals known as surfactants which have mild abrasive properties. This makes them much more effective for addressing hardened, stuck-on residue. Apply abrasive cleansers sparingly. For most jobs, a single canister be enough for a single thorough cleaning. Stick with natural alternatives. Alternately, tough stains like rust and hard water residue can be treated with a mixture of hydrogen peroxide and cream of tartar. Blend the two ingredients together until they're about the same consistency as cake frosting and spread them directly over the stains. After 10 minutes, buff the stains with a nylon brush or pumice stone until they're erased completely. Homemade concoctions like hydrogen peroxide and cream of tartar will be preferable for those who are wary of the health and environmental effects of chemical cleaning products. Hydrogen peroxide will also help treat age-related discoloration and lighten the finish of the tub. Sprinkle the cleaning powder around the stained tub. A moderate dusting should be enough to deal with most messes. The powder won’t stick to the surface of the porcelain on its own, but when combined with a liquid it will form a paste that can be spread directly over stains. Be sure to cover the bottom of the tub, where accumulated mold can become a slipping hazard. Add enough water to produce a paste. Spray purified or ordinary tap water onto the cleaning powder. With the addition of moisture, the powder will take on a thick, foamy consistency. Rub this paste into the stains and give it about half an hour to take effect. You can also wet a clean sponge or washcloth and use it to rub in the cleaner until it thickens. Another option is to wet the tub before you apply the cleanser. Spray the tub with the shower head or fill a cup with water and pour it around the inside of the tub. Be careful not to add an excessive amount of water. The cleaner won’t be as effective if it’s too thin. Scour the stains with a sturdy scrubber. Since porcelain has a hard, durable finish, you can scrub it safely with an abrasive implement without worrying about scratching it up. For best results, equip a pumice stone or stiff-bristled scrubbing brush. Work on the stains until they’re completely erased, then rinse the tub with clean water and let it dry before using it again. If you don’t own a dedicated scrubbing brush, you can use the rough green side of a kitchen sponge. Never use steel wool or any similar material to scour a porcelain tub. Even though porcelain is scratch-resistant, this can be enough to cause permanent damage to the finish.",
  "tyn_model":[
    "vinegar",
    "sponge",
    "water",
    "hydrogen peroxide",
    "porcelain",
    "bleach",
    "spray bottle",
    "baking soda",
    "tub",
    "shower head",
    "castile soap",
    "cream of tartar",
    "pumice stone",
    "cleaning powder",
    "astringent powders",
    "lemon juice",
    "dish sponge",
    "magic eraser",
    "melamine foam",
    "shower curtain",
    "all purpose cleaner",
    "scrubbing bubbles",
    "shower cleaner",
    "cleaners",
    "cleaning product",
    "fan",
    "natural cleaner",
    "all-purpose bathroom cleaner",
    "essential oils",
    "tea tree",
    "chemical cleaning solutions",
    "microfiber towel",
    "porcelain bathtub",
    "abrasive cleaning powder",
    "comet",
    "ajax",
    "abrasive cleansers",
    "cake frosting",
    "nylon brush",
    "tap water",
    "scrubber",
    "scrubbing brush",
    "kitchen sponge",
    "porcelain tub"
  ],
  "tyn_section":[

  ]
}