{
  "title":"How to Make Any Room Glamorous",
  "url":"https://www.wikihow.com/Make-Any-Room-Glamorous",
  "category_hierarchy":[
    "Home and Garden",
    "Home Decorating",
    "Interior Design for Rooms"
  ],
  "steps":[
    {
      "headline":"Evaluate the key pieces of furniture in the room.",
      "description":"For example, your key pieces might be a couch, coffee table and chair for a family room."
    },
    {
      "headline":"Select a color palette that you love- preferably 3 colors.",
      "description":"For a bold look, go with contrasting colors like white, black and gray. For a softer palette, try something like white, light gray, and a pastel such as yellow or mint."
    },
    {
      "headline":"Pick a focal point.",
      "description":"This is what you love most about this room and where someone's attention is drawn immediately upon walking into the space. Some examples of focal points include high ceilings or beautiful windows. If you are not sure about a focal point, skip to #6."
    },
    {
      "headline":"After picking the focal point, add something that will enhance that special feature.",
      "description":"This is where the glamour comes in; if your focal point is a high ceiling, add a beautiful chandelier. If you have great windows, add dramatic curtains in a bold pattern or luxurious fabric."
    },
    {
      "headline":"Accessorize, accessorize, accessorize.",
      "description":"This is the key to taking your room from bland to fabulous. For your furniture, mix and match pillows of different fabrics and colors in your color pallet to add depth to your room. On a coffee table, add a few unique pieces that will add interest- books, serving tray filled with candies, or a set of candles of all different shapes and sizes. On an end table, add a quirky table lamp or flower arrangement, real or fake, in your color pallet."
    },
    {
      "headline":"Use a great rug.",
      "description":"If you couldn't find a focal point, a rug, if the space permits, is a great option. Find one that is in a solid color with great texture, or one with a dynamic bold pattern such a chevron, overlapping circles, or an ikat pattern."
    },
    {
      "headline":"Make sure no wall is left behind.",
      "description":"A blank wall has so much potential. Here’s what you can do to make it pop. Hint: A wall can also serve as a focal point."
    },
    {
      "headline":"Consider an accent wall!",
      "description":"It is instant glamour, will pull your whole room together, and all you have to do is pick one of the 3 colors from your color palette."
    },
    {
      "headline":"Add a piece of art that takes up most of the wall.",
      "description":"This makes a dramatic statement while also expressing your personal style."
    },
    {
      "headline":"Use a mirror.",
      "description":"You can never go wrong with a mirror. This is especially useful if your room is on the small side. It will make your space seem twice as big. A mirror will add tremendous depth, and of course, glamour!"
    },
    {
      "headline":"Now enjoy!",
      "description":"Your room is a reflection of your style, and, above all, glamorous!"
    }
  ],
  "text":" Evaluate the key pieces of furniture in the room. For example, your key pieces might be a couch, coffee table and chair for a family room. Select a color palette that you love- preferably 3 colors. For a bold look, go with contrasting colors like white, black and gray. For a softer palette, try something like white, light gray, and a pastel such as yellow or mint. Pick a focal point. This is what you love most about this room and where someone's attention is drawn immediately upon walking into the space. Some examples of focal points include high ceilings or beautiful windows. If you are not sure about a focal point, skip to #6. After picking the focal point, add something that will enhance that special feature. This is where the glamour comes in; if your focal point is a high ceiling, add a beautiful chandelier. If you have great windows, add dramatic curtains in a bold pattern or luxurious fabric. Accessorize, accessorize, accessorize. This is the key to taking your room from bland to fabulous. For your furniture, mix and match pillows of different fabrics and colors in your color pallet to add depth to your room. On a coffee table, add a few unique pieces that will add interest- books, serving tray filled with candies, or a set of candles of all different shapes and sizes. On an end table, add a quirky table lamp or flower arrangement, real or fake, in your color pallet. Use a great rug. If you couldn't find a focal point, a rug, if the space permits, is a great option. Find one that is in a solid color with great texture, or one with a dynamic bold pattern such a chevron, overlapping circles, or an ikat pattern. Make sure no wall is left behind. A blank wall has so much potential. Here’s what you can do to make it pop. Hint: A wall can also serve as a focal point. Consider an accent wall! It is instant glamour, will pull your whole room together, and all you have to do is pick one of the 3 colors from your color palette. Add a piece of art that takes up most of the wall. This makes a dramatic statement while also expressing your personal style. Use a mirror. You can never go wrong with a mirror. This is especially useful if your room is on the small side. It will make your space seem twice as big. A mirror will add tremendous depth, and of course, glamour! Now enjoy! Your room is a reflection of your style, and, above all, glamorous!",
  "tyn_model":[
    "mirror",
    "windows",
    "rug",
    "pastel",
    "chandelier",
    "curtains",
    "pillows",
    "coffee table",
    "candles"
  ],
  "tyn_section":[

  ]
}