{
  "title":"How to Grill Turkey",
  "url":"https://www.wikihow.com/Grill-Turkey",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes"
  ],
  "methods":[
    {
      "name":"Preparing the Grilled Turkey",
      "steps":[
        {
          "headline":"If you are using a charcoal grill, fill a chimney starter to the rim with charcoal and burn the coals until they are lightly covered with ash.",
          "description":"Spread the coals in a half circle on one side of the charcoal grate."
        },
        {
          "headline":"Place a large, disposable drip pan in the center of the charcoal grate and fill it about halfway with warm water.",
          "description":"This maintains the temperature of the fire."
        },
        {
          "headline":"Put the cooking grate in place, close the lid, and let the coals burn down to low heat.",
          "description":"Keep all the vents open. If you are using a gas grill, preheat the grill on high until the temperature hits 500 °F (260 °C). Then turn the burners down to indirect low heat (300 to 350 deg F)"
        },
        {
          "headline":"Start by rinsing your turkey with cold, clean water inside and out.",
          "description":"Remove the giblets, neck, etc. from the bird. Lightly coat the bird with some of the melted butter, and season with pepper."
        },
        {
          "headline":"Pour the chicken stock into a sturdy 9×13-inch roasting pan.",
          "description":"Add the onions, carrots, and celery. Place the turkey breast side down in the roasting pan."
        },
        {
          "headline":"Place the roasting pan in the center of the cooking grate.",
          "description":"If you’re using a charcoal grill, place the pan so that the turkey legs face the charcoal. Add half of your applewood to the charcoal or put them in the smoker box of your gas grill."
        },
        {
          "headline":"After 1 hour of grilling, add 10-12 unlit charcoal briquettes to maintain the temperature of your grill.",
          "description":"Position it between the lit charcoal using long-handled tongs. Add the remaining applewood. Also, turn the turkey over in the pan so the breast faces up. Continue grilling over indirect low heat with the lid closed for another hour."
        },
        {
          "headline":"At the end of the second hour, baste the turkey all over with the remaining butter.",
          "description":"If any parts are getting too dark, wrap them with aluminum foil. Once again add 10-12 charcoal briquettes to the lit charcoal to maintain the heat of your charcoal grill. Continue cooking over indirect low heat. The total cooking time will be 2.5 to 3.5 hours. The bird is done when the internal temp reaches 175 °F (79 °C) in the thick part of the thigh and 165 in the breast."
        },
        {
          "headline":"Move the turkey to a cutting board, wrap in aluminum foil, and allow it to rest for 30 minutes before carving.",
          "description":"While it’s resting, make the gravy."
        }
      ]
    },
    {
      "name":"Making the Gravy",
      "steps":[
        {
          "headline":"Strain the pan liquid through a sieve into a large fat separator and discard the solids.",
          "description":""
        },
        {
          "headline":"Add enough chicken stock to equal about 4 cups of liquid to the liquid in the fat separator.",
          "description":""
        },
        {
          "headline":"Place the roasting pan over a stove top burner set to medium heat.",
          "description":"Add butter."
        },
        {
          "headline":"Melt the butter and slowly add the flour, stirring frequently.",
          "description":"As the butter melts, stir with a wooden spoon and cook until the mixture turns the color of peanut butter, about 5 minutes, stirring frequently. This process is very similar to making a roux."
        },
        {
          "headline":"Add 4 cups of the reserved pan liquid (but not the fat) plus the wine.",
          "description":""
        },
        {
          "headline":"Bring the gravy to a low boil, whisking if needed to dissolve the lumps (you should not get lumps if you cook the flour to a mixture of pure butter and turkey drippings, lumps are caused when flour hits water before being coated in oil).",
          "description":"Lower the heat and simmer the gravy for a few minutes or until it reaches the consistency you like. If the gravy gets too thick, add more chicken stock a little at a time and simmer until it reaches the right thickness."
        },
        {
          "headline":"Turn off the heat.",
          "description":"Add the parsley. Add salt and pepper to taste. Enjoy!"
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preparing the Grilled Turkey If you are using a charcoal grill, fill a chimney starter to the rim with charcoal and burn the coals until they are lightly covered with ash. Spread the coals in a half circle on one side of the charcoal grate. Place a large, disposable drip pan in the center of the charcoal grate and fill it about halfway with warm water. This maintains the temperature of the fire. Put the cooking grate in place, close the lid, and let the coals burn down to low heat. Keep all the vents open. If you are using a gas grill, preheat the grill on high until the temperature hits 500 °F (260 °C). Then turn the burners down to indirect low heat (300 to 350 deg F) Start by rinsing your turkey with cold, clean water inside and out. Remove the giblets, neck, etc. from the bird. Lightly coat the bird with some of the melted butter, and season with pepper. Pour the chicken stock into a sturdy 9×13-inch roasting pan. Add the onions, carrots, and celery. Place the turkey breast side down in the roasting pan. Place the roasting pan in the center of the cooking grate. If you’re using a charcoal grill, place the pan so that the turkey legs face the charcoal. Add half of your applewood to the charcoal or put them in the smoker box of your gas grill. After 1 hour of grilling, add 10-12 unlit charcoal briquettes to maintain the temperature of your grill. Position it between the lit charcoal using long-handled tongs. Add the remaining applewood. Also, turn the turkey over in the pan so the breast faces up. Continue grilling over indirect low heat with the lid closed for another hour. At the end of the second hour, baste the turkey all over with the remaining butter. If any parts are getting too dark, wrap them with aluminum foil. Once again add 10-12 charcoal briquettes to the lit charcoal to maintain the heat of your charcoal grill. Continue cooking over indirect low heat. The total cooking time will be 2.5 to 3.5 hours. The bird is done when the internal temp reaches 175 °F (79 °C) in the thick part of the thigh and 165 in the breast. Move the turkey to a cutting board, wrap in aluminum foil, and allow it to rest for 30 minutes before carving. While it’s resting, make the gravy. Making the Gravy Strain the pan liquid through a sieve into a large fat separator and discard the solids.  Add enough chicken stock to equal about 4 cups of liquid to the liquid in the fat separator.  Place the roasting pan over a stove top burner set to medium heat. Add butter. Melt the butter and slowly add the flour, stirring frequently. As the butter melts, stir with a wooden spoon and cook until the mixture turns the color of peanut butter, about 5 minutes, stirring frequently. This process is very similar to making a roux. Add 4 cups of the reserved pan liquid (but not the fat) plus the wine.  Bring the gravy to a low boil, whisking if needed to dissolve the lumps (you should not get lumps if you cook the flour to a mixture of pure butter and turkey drippings, lumps are caused when flour hits water before being coated in oil). Lower the heat and simmer the gravy for a few minutes or until it reaches the consistency you like. If the gravy gets too thick, add more chicken stock a little at a time and simmer until it reaches the right thickness. Turn off the heat. Add the parsley. Add salt and pepper to taste. Enjoy! Finished. ",
  "tyn_model":[
    "butter",
    "charcoal",
    "roasting pan",
    "turkey",
    "charcoal grill",
    "water",
    "chicken stock",
    "flour",
    "charcoal grate",
    "cooking grate",
    "gas grill",
    "grill",
    "applewood",
    "aluminum foil",
    "chimney starter",
    "drip pan",
    "pepper",
    "onions",
    "carrots",
    "celery",
    "long-handled tongs",
    "pan",
    "cutting board",
    "sieve",
    "large fat separator",
    "fat separator",
    "stove top burner",
    "wooden spoon",
    "peanut butter",
    "reserved pan",
    "wine",
    "oil",
    "parsley",
    "salt and pepper"
  ],
  "tyn_section":[

  ]
}