{
  "title":"How to Choose a Melon",
  "url":"https://www.wikihow.com/Choose-a-Melon",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "methods":[
    {
      "name":"Choosing a Cantaloupe",
      "steps":[
        {
          "headline":"Examine the cantaloupe’s color and texture.",
          "description":"A good, ripe cantaloupe will have a base color that’s tinted gold, so avoid those that appear green. The skin shouldn’t have any tears or scars, and the netting on its surface should be thick, coarse, and strongly defined. If the cantaloupe’s base color still has a greenish tint, that usually means that it isn’t ripe yet. It’s normal for the netting on the cantaloupe’s skin to be more pronounced in some areas than others."
        },
        {
          "headline":"Test the cantaloupe’s weight.",
          "description":"Once you’ve found a cantaloupe with skin that appears healthy, pick it up and test its weight. The melon should feel fairly heavy for its size. To determine whether it is a good weight, you may have to test several cantaloupes from the store’s display. That will help you determine if one in particular feels heavy enough."
        },
        {
          "headline":"Smell the cantaloupe.",
          "description":"One of the best ways to determine if a cantaloupe is ripe and healthy is to smell it. If the melon has a sweet, musky scent, it’s likely ripe and a good one to bring home. Smell the cantaloupe at the blossom end to test for ripeness. That’s the end of the melon that’s opposite the stem area. If the cantaloupe smells perfume, that may be an indication that it’s overripe."
        },
        {
          "headline":"Check out the cantaloupe’s end stem.",
          "description":"Finally, before purchasing a cantaloupe, examine the stem area. Make sure that there aren’t any tears in the skin, as these can sometimes mean that the melon was harvested too early. There should also be a slight indentation in the stem area to show that the cantaloupe separated easily from the vine when it was harvested. The stem itself shouldn’t be attached to the cantaloupe. That usually indicates that the melon hasn’t matured. Avoid any cantaloupes that are soft or moist in the stem area."
        }
      ]
    },
    {
      "name":"Selecting a Watermelon",
      "steps":[
        {
          "headline":"Look for a watermelon with dull skin and a uniform shape.",
          "description":"While a watermelon should be a bright green color, its skin shouldn’t be shiny. Instead, look for one with skin that’s slightly dull. It should also have a uniform shape to indicate that it’s matured fully. If a watermelon’s skin is shiny, it may indicate that the melon isn’t ripe."
        },
        {
          "headline":"Find a watermelon with a creamy patch on the underside.",
          "description":"Next, pick the watermelon up and examine the bottom. There should be a creamy yellow spot from where the melon rested on the ground as it was growing. This field spot indicates that the watermelon spent plenty of time in the sun maturing instead of being harvested too early. The deeper the color of a watermelon’s field spot is the sweeter the melon will be. A white spot is fine, but a yellow spot is best."
        },
        {
          "headline":"Check the texture of the watermelon’s skin for bumps and dents.",
          "description":"As you’re holding the watermelon, run your fingers along its skin to examine the texture. There shouldn’t be any dents, bumps, or irregular curves, which can indicate that the melon didn’t get regular sun and water as it grew. Instead, choose a smooth, even melon. Make sure that there aren’t any cuts or scars in the watermelon’s skin either."
        },
        {
          "headline":"Test the watermelon’s weight.",
          "description":"With the watermelon in your hands, make sure that it has a good weight. It should feel heavy for its size, so compare it with another melon that’s a similar size to see if it has a good heft to it."
        },
        {
          "headline":"Tap your knuckles against the watermelon.",
          "description":"Finally, hold the watermelon a couple of inches from your ear and knock on it with your knuckles. If the melon is ripe, it should make a hollow, tenor-like sound. The knocking test shouldn’t be used as the only test for ripeness because not all watermelon farmers agree that it is accurate. Overripe watermelons can sometimes make the same sound as ripe fruit. Use it to confirm that a melon that meets all of the other criteria is ready to bring home. If the watermelon makes a thudding sound when you hit it, it is likely still full of water and not yet ripe."
        }
      ]
    },
    {
      "name":"Picking Out a Honeydew",
      "steps":[
        {
          "headline":"Examine the honeydew’s skin for a rich, creamy color.",
          "description":"A healthy, ripe honeydew will be a cream, yellow, or gold color. Avoid melons that are overly green because they aren’t ripe yet. If you choose a honeydew that’s a creamy white color, it won’t be ripe yet but will ripen if you leave it out at room temperature for a few days."
        },
        {
          "headline":"Choose a symmetrical honeydew.",
          "description":"A healthy ripe honeydew will have a spherical shape. More important than looking at the shape, though, is to make sure that the melon you choose is symmetrical. If one end is larger than the other, it can indicate that the honeydew didn’t grow evenly and probably isn't the best choice."
        },
        {
          "headline":"Feel the honeydew’s skin.",
          "description":"Run your fingers along the skin of the honeydew to examine its texture. It should have a smooth, velvety feel with no noticeable dents or bumps. It’s also normal for a honeydew’s skin to have a slightly waxy feel because the sugar in the melon rises to the surface as it ripens."
        },
        {
          "headline":"Check the honeydew’s scent.",
          "description":"Just as with a cantaloupe, you can usually tell if a honeydew is ripe by sniffing it. It should give off a sweet, pleasant scent. A honeydew’s scent will be most evident when the melon is at room temperature."
        },
        {
          "headline":"Shake the honeydew and listen to the sound.",
          "description":"Finally, before purchasing a honeydew, shake it gently. If you hear the seeds rattling around inside, the melon is ripe. If you shake the honeydew and it sounds soupy or slushy inside, that likely means it’s overripe."
        }
      ]
    }
  ],
  "text":" Choosing a Cantaloupe Examine the cantaloupe’s color and texture. A good, ripe cantaloupe will have a base color that’s tinted gold, so avoid those that appear green. The skin shouldn’t have any tears or scars, and the netting on its surface should be thick, coarse, and strongly defined. If the cantaloupe’s base color still has a greenish tint, that usually means that it isn’t ripe yet. It’s normal for the netting on the cantaloupe’s skin to be more pronounced in some areas than others. Test the cantaloupe’s weight. Once you’ve found a cantaloupe with skin that appears healthy, pick it up and test its weight. The melon should feel fairly heavy for its size. To determine whether it is a good weight, you may have to test several cantaloupes from the store’s display. That will help you determine if one in particular feels heavy enough. Smell the cantaloupe. One of the best ways to determine if a cantaloupe is ripe and healthy is to smell it. If the melon has a sweet, musky scent, it’s likely ripe and a good one to bring home. Smell the cantaloupe at the blossom end to test for ripeness. That’s the end of the melon that’s opposite the stem area. If the cantaloupe smells perfume, that may be an indication that it’s overripe. Check out the cantaloupe’s end stem. Finally, before purchasing a cantaloupe, examine the stem area. Make sure that there aren’t any tears in the skin, as these can sometimes mean that the melon was harvested too early. There should also be a slight indentation in the stem area to show that the cantaloupe separated easily from the vine when it was harvested. The stem itself shouldn’t be attached to the cantaloupe. That usually indicates that the melon hasn’t matured. Avoid any cantaloupes that are soft or moist in the stem area. Selecting a Watermelon Look for a watermelon with dull skin and a uniform shape. While a watermelon should be a bright green color, its skin shouldn’t be shiny. Instead, look for one with skin that’s slightly dull. It should also have a uniform shape to indicate that it’s matured fully. If a watermelon’s skin is shiny, it may indicate that the melon isn’t ripe. Find a watermelon with a creamy patch on the underside. Next, pick the watermelon up and examine the bottom. There should be a creamy yellow spot from where the melon rested on the ground as it was growing. This field spot indicates that the watermelon spent plenty of time in the sun maturing instead of being harvested too early. The deeper the color of a watermelon’s field spot is the sweeter the melon will be. A white spot is fine, but a yellow spot is best. Check the texture of the watermelon’s skin for bumps and dents. As you’re holding the watermelon, run your fingers along its skin to examine the texture. There shouldn’t be any dents, bumps, or irregular curves, which can indicate that the melon didn’t get regular sun and water as it grew. Instead, choose a smooth, even melon. Make sure that there aren’t any cuts or scars in the watermelon’s skin either. Test the watermelon’s weight. With the watermelon in your hands, make sure that it has a good weight. It should feel heavy for its size, so compare it with another melon that’s a similar size to see if it has a good heft to it. Tap your knuckles against the watermelon. Finally, hold the watermelon a couple of inches from your ear and knock on it with your knuckles. If the melon is ripe, it should make a hollow, tenor-like sound. The knocking test shouldn’t be used as the only test for ripeness because not all watermelon farmers agree that it is accurate. Overripe watermelons can sometimes make the same sound as ripe fruit. Use it to confirm that a melon that meets all of the other criteria is ready to bring home. If the watermelon makes a thudding sound when you hit it, it is likely still full of water and not yet ripe. Picking Out a Honeydew Examine the honeydew’s skin for a rich, creamy color. A healthy, ripe honeydew will be a cream, yellow, or gold color. Avoid melons that are overly green because they aren’t ripe yet. If you choose a honeydew that’s a creamy white color, it won’t be ripe yet but will ripen if you leave it out at room temperature for a few days. Choose a symmetrical honeydew. A healthy ripe honeydew will have a spherical shape. More important than looking at the shape, though, is to make sure that the melon you choose is symmetrical. If one end is larger than the other, it can indicate that the honeydew didn’t grow evenly and probably isn't the best choice. Feel the honeydew’s skin. Run your fingers along the skin of the honeydew to examine its texture. It should have a smooth, velvety feel with no noticeable dents or bumps. It’s also normal for a honeydew’s skin to have a slightly waxy feel because the sugar in the melon rises to the surface as it ripens. Check the honeydew’s scent. Just as with a cantaloupe, you can usually tell if a honeydew is ripe by sniffing it. It should give off a sweet, pleasant scent. A honeydew’s scent will be most evident when the melon is at room temperature. Shake the honeydew and listen to the sound. Finally, before purchasing a honeydew, shake it gently. If you hear the seeds rattling around inside, the melon is ripe. If you shake the honeydew and it sounds soupy or slushy inside, that likely means it’s overripe.",
  "tyn_model":[
    "watermelon",
    "honeydew",
    "cantaloupe",
    "melon",
    "cantaloupes",
    "water",
    "netting",
    "watermelons",
    "melons",
    "sugar"
  ],
  "tyn_section":[

  ]
}