{
  "title":"How to Make Sponge Patterned Paper",
  "url":"https://www.wikihow.com/Make-Sponge-Patterned-Paper",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Papermaking"
  ],
  "parts":[
    {
      "name":"Preparing the paint",
      "steps":[
        {
          "headline":"Choose the paint colors.",
          "description":"The colors should be complementary, using two alternative colors for each piece of paper you are using. One color must be considerably lighter than the first color."
        },
        {
          "headline":"Dilute the first color.",
          "description":"Add a dash of water to weaken the color slightly."
        },
        {
          "headline":"Fill the dish or tray with the diluted paint.",
          "description":""
        }
      ]
    },
    {
      "name":"Printing the first color",
      "steps":[
        {
          "headline":"Dampen the sponge.",
          "description":"Squeeze out any excess water; it should be damp, not soaking."
        },
        {
          "headline":"Dip into the first, darker paint color.",
          "description":"Press the sponge gently on the kitchen paper towel. This removes the heavier layer of paint."
        },
        {
          "headline":"Press the sponge to the actual plain paper intended for wrapping.",
          "description":"Start from one corner of the paper and press lightly in several spots."
        },
        {
          "headline":"Turn the sponge around and press lightly again.",
          "description":""
        },
        {
          "headline":"Re-dip the sponge as often as needed until you've finished printing across the paper.",
          "description":""
        },
        {
          "headline":"Let it dry.",
          "description":"The sheet of paper may even be interesting enough for you to stop here; that's completely up to you."
        }
      ]
    },
    {
      "name":"Printing the second color",
      "steps":[
        {
          "headline":"Wash the first color out of the sponge.",
          "description":""
        },
        {
          "headline":"Repeat the dilute-and-pour method for the second, much lighter color.",
          "description":"Dilute slightly, then add to its own dish or tray."
        },
        {
          "headline":"Dip the dampened sponge as before.",
          "description":"Overprint the paper by dabbing as before. However, this time be sparing in how and where you dab, and don't overdo the printing or you'll spoil the effect."
        },
        {
          "headline":"Let dry.",
          "description":"When it is absolutely dry, it can be used to wrap your gifts."
        }
      ]
    }
  ],
  "text":" Preparing the paint Choose the paint colors. The colors should be complementary, using two alternative colors for each piece of paper you are using. One color must be considerably lighter than the first color. Dilute the first color. Add a dash of water to weaken the color slightly. Fill the dish or tray with the diluted paint.  Printing the first color Dampen the sponge. Squeeze out any excess water; it should be damp, not soaking. Dip into the first, darker paint color. Press the sponge gently on the kitchen paper towel. This removes the heavier layer of paint. Press the sponge to the actual plain paper intended for wrapping. Start from one corner of the paper and press lightly in several spots. Turn the sponge around and press lightly again.  Re-dip the sponge as often as needed until you've finished printing across the paper.  Let it dry. The sheet of paper may even be interesting enough for you to stop here; that's completely up to you. Printing the second color Wash the first color out of the sponge.  Repeat the dilute-and-pour method for the second, much lighter color. Dilute slightly, then add to its own dish or tray. Dip the dampened sponge as before. Overprint the paper by dabbing as before. However, this time be sparing in how and where you dab, and don't overdo the printing or you'll spoil the effect. Let dry. When it is absolutely dry, it can be used to wrap your gifts.",
  "tyn_model":[
    "sponge",
    "paint",
    "water",
    "dish or",
    "kitchen paper",
    "paper"
  ],
  "tyn_section":[

  ]
}