{
  "title":"How to Beat No. 10 of Mushroom XIII in Kingdom Hearts II",
  "url":"https://www.wikihow.com/Beat-No.-10-of-Mushroom-XIII-in-Kingdom-Hearts-II",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation"
  ],
  "parts":[
    {
      "name":"Preparing Your Character",
      "steps":[
        {
          "headline":"Find Mushroom no.",
          "description":"10. Go to Isla de Muerta in Port Royale (Pirates of the Caribbean world.) Head inside the cavern and keep heading forward until you reach the Moonlight Nook; this is the area before the boss room (where you fought Barbosa)."
        },
        {
          "headline":"Equip Rumbling Rose.",
          "description":"This keyblade will help you deal more damage by letting you bypass the 2nd normal combo and immediately letting you chain 2 finishers."
        }
      ]
    },
    {
      "name":"Beating Mushroom no. 10",
      "steps":[
        {
          "headline":"Press ∆ to start the challenge.",
          "description":""
        },
        {
          "headline":"Quick run (analog + hold □) immediately back near the entrance.",
          "description":"This is the best place to stand as you'll be able to see the whole area, giving you a lot of visibility when the mushrooms shuffle."
        },
        {
          "headline":"Pause the game as soon as the mushrooms start to shuffle.",
          "description":"It's a cheap technique, but it helps a lot. Keep pausing and playing the game while the mushrooms shuffle; this will help you follow the mushrooms around easily."
        },
        {
          "headline":"Quick run back to the mushrooms and lock onto the real mushroom.",
          "description":""
        },
        {
          "headline":"Attack it quickly.",
          "description":"You won't be allowed to attack it much at first."
        },
        {
          "headline":"Quick run back to the entrance.",
          "description":""
        },
        {
          "headline":"Repeat the pause-and-play method.",
          "description":"As the amount of correct guesses goes up, the mushroom will also let you attack it longer."
        },
        {
          "headline":"Keep doing this until the mushroom dies.",
          "description":"It will be hard at first, but eventually you'll get used to the timing of quick runs and attacks."
        }
      ]
    }
  ],
  "text":" Preparing Your Character Find Mushroom no. 10. Go to Isla de Muerta in Port Royale (Pirates of the Caribbean world.) Head inside the cavern and keep heading forward until you reach the Moonlight Nook; this is the area before the boss room (where you fought Barbosa). Equip Rumbling Rose. This keyblade will help you deal more damage by letting you bypass the 2nd normal combo and immediately letting you chain 2 finishers. Beating Mushroom no. 10 Press ∆ to start the challenge.  Quick run (analog + hold □) immediately back near the entrance. This is the best place to stand as you'll be able to see the whole area, giving you a lot of visibility when the mushrooms shuffle. Pause the game as soon as the mushrooms start to shuffle. It's a cheap technique, but it helps a lot. Keep pausing and playing the game while the mushrooms shuffle; this will help you follow the mushrooms around easily. Quick run back to the mushrooms and lock onto the real mushroom.  Attack it quickly. You won't be allowed to attack it much at first. Quick run back to the entrance.  Repeat the pause-and-play method. As the amount of correct guesses goes up, the mushroom will also let you attack it longer. Keep doing this until the mushroom dies. It will be hard at first, but eventually you'll get used to the timing of quick runs and attacks.",
  "tyn_model":[
    "mushrooms",
    "mushroom",
    "∆ to",
    "□)"
  ],
  "tyn_section":[

  ]
}