{
  "title":"How to Make a Double O",
  "url":"https://www.wikihow.com/Make-a-Double-O",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Text and Lettering"
  ],
  "methods":[
    {
      "name":"Ordinary \"O\"s",
      "steps":[
        {
          "headline":"Gather your resources as listed in the \"Things You'll Need\" section.",
          "description":""
        },
        {
          "headline":"Place the pencil in the compass.",
          "description":"Play around with the angle of the compass to fine tune your desired size and width. For a regular size paper, try placing the pencil at a 45 degree angle."
        },
        {
          "headline":"Place the compass on the paper and start drawing your circle.",
          "description":"Be careful that you don't accidentally move the holding point off the paper."
        },
        {
          "headline":"Adjust the diameter of the compass setting so that second \"O\" can be formed— all the while keeping the center-point stick steady on the same center.",
          "description":"After your first circle, draw the second circle exactly in the middle. Consider using a ruler to measure the middle point of the circle."
        },
        {
          "headline":"Try out other creative stuff once your double \"O\"s are ready!",
          "description":""
        }
      ]
    },
    {
      "name":"Colored \"O\"s",
      "steps":[
        {
          "headline":"Read the section called Ordinary \"O\"s.",
          "description":""
        },
        {
          "headline":"Repeat the double \"O\" all over your canvas.",
          "description":""
        },
        {
          "headline":"Add a nice contrasting color to the design.",
          "description":""
        },
        {
          "headline":"Consider drawing other types of the double \"O\" throughout your art piece.",
          "description":""
        },
        {
          "headline":"Voila.",
          "description":""
        }
      ]
    },
    {
      "name":"\"Traveling\" \"O\"s",
      "steps":[
        {
          "headline":"Nestle the inner \"O\" up against the edge of the larger \"O\".",
          "description":""
        },
        {
          "headline":"Draw a series of these with the touch point positioned at different clock positions, e.g.",
          "description":"2 o'clock, 4 o'clock, 6, 8, 10 and 12, successively across the paper. With a little imagination, the illusion suggests a traveling wheel - perhaps on a level plain, climbing an incline (mountain) or tearing down a slope faster and faster (2, 4, 6:30,10, 3,...)."
        }
      ]
    },
    {
      "name":"Flip Book \"O\"s",
      "steps":[
        {
          "headline":"Cut many smaller pieces of light cardstock all the same size.",
          "description":"(Paper will work too.)"
        },
        {
          "headline":"Staple these together evenly along one edge.",
          "description":"The beginning conceptualization is of a stationary rotating double \"O.\""
        },
        {
          "headline":"Drive a push pin through the stack to mark the center of the larger circle.",
          "description":"Do not get too aggressive when marking the center point. If you drive the push pin through a whole bunch of cards, the top ones might have a large, unsightly center point. Instead, mark only a few at a time, using the last visible prick as the starting location for the next set. An alternative to the push pin is to use a needle and thimble. Again, do not get in a hurry or too aggressive with marking the cards."
        },
        {
          "headline":"Using a compass draw the same size large circle on each page.",
          "description":""
        },
        {
          "headline":"Locate the touch point on successive pieces of paper to achieve the pattern you envision.",
          "description":""
        },
        {
          "headline":"Draw a smaller circle by placing the pencil point on the touch point and placing the pointed pivot of the compass on the visual diameter of the large circle, then carefully scribe the smaller circle.",
          "description":""
        },
        {
          "headline":"Draw the rest of the smaller circles in the same way without changing the compass setting.",
          "description":""
        },
        {
          "headline":"Shade each smaller circle with pencil or color the interiors.",
          "description":""
        },
        {
          "headline":"Test the effect by fanning through the book.",
          "description":""
        },
        {
          "headline":"Brainstorm further variations.",
          "description":"Use your imagination and invite the kids to get involved in this fun, creative activity. Use the double \"O\" as a central element for a more extensive scene. Make the double \"O\"s travel linearly, back and forth, along an arc, along the periphery of still larger circle, across the solar system...\nUse the push pin/needle technique to transfer the needed guidelines and design elements to later cards in the book. Lightly pencil in the guidelines on each card (to be erased later). Create a circle that gives the illusion of rotating clockwise, stopping, then rotating counter-clockwise. Work to produce an army of bouncing \"O\"s, all bouncing at different heights and at different rates. Have them roll off the screen and back onto the screen. Make the green one disappear, then reappear a moment later inside a garden - and start growing. Have the double \"O\"s perform unexpected actions at the strangest times,..."
        },
        {
          "headline":"Extend the concept and experiment with zoetropes.",
          "description":""
        }
      ]
    }
  ],
  "text":" Ordinary \"O\"s Gather your resources as listed in the \"Things You'll Need\" section.  Place the pencil in the compass. Play around with the angle of the compass to fine tune your desired size and width. For a regular size paper, try placing the pencil at a 45 degree angle. Place the compass on the paper and start drawing your circle. Be careful that you don't accidentally move the holding point off the paper. Adjust the diameter of the compass setting so that second \"O\" can be formed— all the while keeping the center-point stick steady on the same center. After your first circle, draw the second circle exactly in the middle. Consider using a ruler to measure the middle point of the circle. Try out other creative stuff once your double \"O\"s are ready!  Colored \"O\"s Read the section called Ordinary \"O\"s.  Repeat the double \"O\" all over your canvas.  Add a nice contrasting color to the design.  Consider drawing other types of the double \"O\" throughout your art piece.  Voila.  \"Traveling\" \"O\"s Nestle the inner \"O\" up against the edge of the larger \"O\".  Draw a series of these with the touch point positioned at different clock positions, e.g. 2 o'clock, 4 o'clock, 6, 8, 10 and 12, successively across the paper. With a little imagination, the illusion suggests a traveling wheel - perhaps on a level plain, climbing an incline (mountain) or tearing down a slope faster and faster (2, 4, 6:30,10, 3,...). Flip Book \"O\"s Cut many smaller pieces of light cardstock all the same size. (Paper will work too.) Staple these together evenly along one edge. The beginning conceptualization is of a stationary rotating double \"O.\" Drive a push pin through the stack to mark the center of the larger circle. Do not get too aggressive when marking the center point. If you drive the push pin through a whole bunch of cards, the top ones might have a large, unsightly center point. Instead, mark only a few at a time, using the last visible prick as the starting location for the next set. An alternative to the push pin is to use a needle and thimble. Again, do not get in a hurry or too aggressive with marking the cards. Using a compass draw the same size large circle on each page.  Locate the touch point on successive pieces of paper to achieve the pattern you envision.  Draw a smaller circle by placing the pencil point on the touch point and placing the pointed pivot of the compass on the visual diameter of the large circle, then carefully scribe the smaller circle.  Draw the rest of the smaller circles in the same way without changing the compass setting.  Shade each smaller circle with pencil or color the interiors.  Test the effect by fanning through the book.  Brainstorm further variations. Use your imagination and invite the kids to get involved in this fun, creative activity. Use the double \"O\" as a central element for a more extensive scene. Make the double \"O\"s travel linearly, back and forth, along an arc, along the periphery of still larger circle, across the solar system...\nUse the push pin/needle technique to transfer the needed guidelines and design elements to later cards in the book. Lightly pencil in the guidelines on each card (to be erased later). Create a circle that gives the illusion of rotating clockwise, stopping, then rotating counter-clockwise. Work to produce an army of bouncing \"O\"s, all bouncing at different heights and at different rates. Have them roll off the screen and back onto the screen. Make the green one disappear, then reappear a moment later inside a garden - and start growing. Have the double \"O\"s perform unexpected actions at the strangest times,... Extend the concept and experiment with zoetropes. ",
  "tyn_model":[
    "compass",
    "paper",
    "pencil",
    "push pin",
    "needle",
    "— all",
    "ruler",
    "canvas",
    "traveling wheel",
    "flip book",
    "cardstock",
    "thimble",
    "book",
    "garden"
  ],
  "tyn_section":[

  ]
}