{
  "title":"How to Make a Violet Milkshake",
  "url":"https://www.wikihow.com/Make-a-Violet-Milkshake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk"
  ],
  "methods":[
    {
      "name":"Candied violet milkshake",
      "steps":[
        {
          "headline":"Place the glasses into the freezer to chill for 15 minutes.",
          "description":""
        },
        {
          "headline":"Keep aside a few crystallised violets for decoration.",
          "description":"Add the rest to the food processor and process until they form a fine powder."
        },
        {
          "headline":"Pour the chilled milk into the processor, along with the ice cubes.",
          "description":"Process on high until the mixture takes on a creamy texture."
        },
        {
          "headline":"Pour the violet milkshake into the chilled glasses.",
          "description":""
        },
        {
          "headline":"Sprinkle the remaining crystallised violets on the top of each milkshake for decoration.",
          "description":"Add a straw and it's ready to serve."
        }
      ]
    },
    {
      "name":"Blueberry violet milkshake",
      "steps":[
        {
          "headline":"Put the ingredients into the blender.",
          "description":"Leave a few violet flowers out for decoration."
        },
        {
          "headline":"Blend to combine.",
          "description":"Blend until smooth."
        },
        {
          "headline":"Pour into a tall serving glass.",
          "description":"Float a few violet flowers on top for garnish."
        }
      ]
    }
  ],
  "text":" Candied violet milkshake Place the glasses into the freezer to chill for 15 minutes.  Keep aside a few crystallised violets for decoration. Add the rest to the food processor and process until they form a fine powder. Pour the chilled milk into the processor, along with the ice cubes. Process on high until the mixture takes on a creamy texture. Pour the violet milkshake into the chilled glasses.  Sprinkle the remaining crystallised violets on the top of each milkshake for decoration. Add a straw and it's ready to serve. Blueberry violet milkshake Put the ingredients into the blender. Leave a few violet flowers out for decoration. Blend to combine. Blend until smooth. Pour into a tall serving glass. Float a few violet flowers on top for garnish.",
  "tyn_model":[
    "freezer",
    "food processor",
    "milk",
    "processor",
    "ice cubes",
    "glasses",
    "straw",
    "blueberry violet milkshake",
    "blender",
    "tall serving glass",
    "violet flowers"
  ],
  "tyn_section":[

  ]
}