{
  "title":"How to Install a Ceiling Fan in a New Location",
  "url":"https://www.wikihow.com/Install-a-Ceiling-Fan-in-a-New-Location",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Walls and Ceilings",
    "Ceilings"
  ],
  "steps":[
    {
      "headline":"Turn the power off in the area that you will be putting the ceiling fan.",
      "description":""
    },
    {
      "headline":"Place the ceiling fan box (only the box part) on the ceiling.",
      "description":"Trace it with a pencil."
    },
    {
      "headline":"With a jigsaw, cut around the hole you just made.",
      "description":""
    },
    {
      "headline":"Screw the ceiling fan box back onto the ceiling brace.",
      "description":""
    },
    {
      "headline":"Place 2 2X4\" wood blocks onto each end of the fan brace.",
      "description":"Secure them with screws."
    },
    {
      "headline":"Place the fan brace on either side of 2 wood braces in the attic.",
      "description":"Secure it with screws."
    },
    {
      "headline":"Run the wiring through the box.",
      "description":""
    },
    {
      "headline":"Secure the ceiling fan box to the fan brace with screws.",
      "description":""
    },
    {
      "headline":"Place the mounting bracket onto the ceiling fan box.",
      "description":"Secure it with screws."
    },
    {
      "headline":"Assemble the down rod and/or canopy onto the top of the motor housing following the instructions.",
      "description":""
    },
    {
      "headline":"Un-secure the canopy ring from the canopy.",
      "description":"Let it fall to the top of the motor housing."
    },
    {
      "headline":"Hang the ceiling fan onto the mounting bracket.",
      "description":""
    },
    {
      "headline":"Cut the excess wiring with wire cutters after measuring it.",
      "description":""
    },
    {
      "headline":"Connect the green ground wire from the mounting bracket into the gold or green ground wire in the ceiling.",
      "description":"Secure the screw."
    },
    {
      "headline":"Connect each colored wire from the ceiling fan to each colored wire in the ceiling.",
      "description":"Secure with wire nuts."
    },
    {
      "headline":"Slide the canopy up to the ceiling.",
      "description":"Secure the screws."
    },
    {
      "headline":"Slide the canopy ring up to the canopy.",
      "description":"Twist to secure it."
    },
    {
      "headline":"From the ground, secure each blade to each blade bracket with screws.",
      "description":""
    },
    {
      "headline":"Secure each blade bracket to the motor housing with screws.",
      "description":""
    },
    {
      "headline":"If you are not using the light kit",
      "description":"Twist the black and blue wires together and secure them with a wire nut. Place the no-light cap over the wiring. Secure it with screws."
    },
    {
      "headline":"If using the light kit",
      "description":"Connect the colored wires from the ceiling fan to the colored wires from the light kit. Secure them with wire nuts. Secure it to the ceiling fan with screws. Screw light bulbs into the light bulb sockets. Secure the light shades to the light sockets with thumbscrews."
    },
    {
      "headline":"Place the pull chain pendants onto the pull chains.",
      "description":""
    },
    {
      "headline":"Turn the power back on and enjoy the ceiling fan.",
      "description":""
    }
  ],
  "text":" Turn the power off in the area that you will be putting the ceiling fan.  Place the ceiling fan box (only the box part) on the ceiling. Trace it with a pencil. With a jigsaw, cut around the hole you just made.  Screw the ceiling fan box back onto the ceiling brace.  Place 2 2X4\" wood blocks onto each end of the fan brace. Secure them with screws. Place the fan brace on either side of 2 wood braces in the attic. Secure it with screws. Run the wiring through the box.  Secure the ceiling fan box to the fan brace with screws.  Place the mounting bracket onto the ceiling fan box. Secure it with screws. Assemble the down rod and/or canopy onto the top of the motor housing following the instructions.  Un-secure the canopy ring from the canopy. Let it fall to the top of the motor housing. Hang the ceiling fan onto the mounting bracket.  Cut the excess wiring with wire cutters after measuring it.  Connect the green ground wire from the mounting bracket into the gold or green ground wire in the ceiling. Secure the screw. Connect each colored wire from the ceiling fan to each colored wire in the ceiling. Secure with wire nuts. Slide the canopy up to the ceiling. Secure the screws. Slide the canopy ring up to the canopy. Twist to secure it. From the ground, secure each blade to each blade bracket with screws.  Secure each blade bracket to the motor housing with screws.  If you are not using the light kit Twist the black and blue wires together and secure them with a wire nut. Place the no-light cap over the wiring. Secure it with screws. If using the light kit Connect the colored wires from the ceiling fan to the colored wires from the light kit. Secure them with wire nuts. Secure it to the ceiling fan with screws. Screw light bulbs into the light bulb sockets. Secure the light shades to the light sockets with thumbscrews. Place the pull chain pendants onto the pull chains.  Turn the power back on and enjoy the ceiling fan. ",
  "tyn_model":[
    "screws",
    "ceiling fan box",
    "wire nuts",
    "light kit",
    "ceiling fan",
    "pencil",
    "jigsaw",
    "fan",
    "wire cutters",
    "wire nut",
    "pull chain"
  ],
  "tyn_section":[

  ]
}