{
  "title":"How to Have the \"Old Skool\" Ratchet Look While Having Armor On in Ratchet and Clank: Size Matters (PSP)",
  "url":"https://www.wikihow.com/Have-the-%22Old-Skool%22-Ratchet-Look-While-Having-Armor-On-in-Ratchet-and-Clank:-Size-Matters-(PSP)",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PSP"
  ],
  "steps":[
    {
      "headline":"First you must have your strongest armor on.",
      "description":""
    },
    {
      "headline":"Then once that is done put on any skin that you have bought on the Skins section of the Secrets menu.",
      "description":""
    },
    {
      "headline":"Then you should look either like a pirate, Ratchet at the beach, Ratchet in a dinosaur suit, or Dan.",
      "description":""
    },
    {
      "headline":"Then in gameplay, press the select button.",
      "description":""
    },
    {
      "headline":"While in 1rst person mode, press Start and select the Armor menu.",
      "description":""
    },
    {
      "headline":"Once on that menu where it shows your armor, do not un-equip any armor.",
      "description":"Just press either the triangle button or the start button. Then when you walk around and play, Ratchet has no armor on, but still has it's strength and it's special ability."
    }
  ],
  "text":" First you must have your strongest armor on.  Then once that is done put on any skin that you have bought on the Skins section of the Secrets menu.  Then you should look either like a pirate, Ratchet at the beach, Ratchet in a dinosaur suit, or Dan.  Then in gameplay, press the select button.  While in 1rst person mode, press Start and select the Armor menu.  Once on that menu where it shows your armor, do not un-equip any armor. Just press either the triangle button or the start button. Then when you walk around and play, Ratchet has no armor on, but still has it's strength and it's special ability.",
  "tyn_model":[
    "armor",
    "ratchet"
  ],
  "tyn_section":[

  ]
}