{
  "title":"How to Go to a Birthday Party with Your Infant",
  "url":"https://www.wikihow.com/Go-to-a-Birthday-Party-with-Your-Infant",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Parties for Children",
    "Baby and Toddler Parties"
  ],
  "parts":[
    {
      "name":"Preparing for the Party",
      "steps":[
        {
          "headline":"Inquire about the party.",
          "description":"Ask for details about the party, and make sure the event will be baby-friendly. Make a decision about attending the party based on this information. Some things to consider:\nWill the party be inside or outside? If outside, what will the weather be like? You may decide that your baby is not yet ready to handle an outdoor party in extreme temperatures or very windy weather. How many people will be there? If the party will be very noisy and crowded, you may want to skip the event. Babies tend to get distressed in large crowds. Will there be a lot of smoke? If many of the guests will be smoking, you should either skip the party or find a babysitter. You don’t want to expose your infant to smoke. Will other babies or children be present? You may not feel comfortable being the only person at the party with a child in tow."
        },
        {
          "headline":"Talk to other parents.",
          "description":"More experienced parents may be able to give you some advice about bringing your baby along to a party. If these people will be at the same event, that’s even better!"
        }
      ]
    },
    {
      "name":"Packing Your Diaper Bag",
      "steps":[
        {
          "headline":"Bring plenty of diapers, wipes, blankets, and towels.",
          "description":"You’ll need to pack a diaper bag. When you do so, bring more diapers than you think you’ll need – you never know when your baby will decide to make life inconvenient. Make sure you have wet wipes as well, and a towel or blanket to use for a changing surface. Towels and blankets can do double-duty as coverings if your baby decides to nap at the party."
        },
        {
          "headline":"Pack feeding supplies.",
          "description":"If you breastfeed exclusively, consider bringing a blanket to help you feed your baby discreetly. If your infant drinks formula, bring it – along with bottles and nipples."
        },
        {
          "headline":"Consider a sling.",
          "description":"Slings can be fantastic because they let you keep your hands free even as you hold your baby close. If your infant is comfortable in a sling, take it along!"
        },
        {
          "headline":"Take a stroller.",
          "description":"If the party is outside (or someplace with plenty of room), bring your stroller. Your infant can sleep in it if he or she gets tired, and it works as a good, familiar place to set your baby in the unfamiliar environment of a birthday party."
        },
        {
          "headline":"Bring extra clothes for you and your baby.",
          "description":"Be prepared for diaper-related accidents, spitting up, and other miscellaneous infant messiness. Bring a fresh set of clothes for yourself and your infant. If this will be the first time many people will see your baby, you may want to pick extra special clothes for the occasion, but don’t choose anything to fussy or difficult, as that will make changes unnecessarily complicated."
        }
      ]
    },
    {
      "name":"Enjoying the Party",
      "steps":[
        {
          "headline":"Take care of your baby’s basic needs before you go.",
          "description":"Feed the baby and give it a fresh diaper before you leave. This will maximize the odds of your infant being in a pleasant (or sleepy) mood for the birthday party."
        },
        {
          "headline":"Keep your distance from large crowds.",
          "description":"Avoid placing your baby in the center of a large, busy, noisy gathering. Too much talking and noise can overstimulate an infant, which may be upsetting and may lead to difficulty winding down and sleeping later."
        },
        {
          "headline":"Avoid letting everyone hold your baby.",
          "description":"If your infant is very young, it’s important to avoid unnecessary germs. Children, especially, have notoriously dirty hands; try not to let them hold or touch your baby. If you have to, you can make up excuses. If there are people who you’d rather did not touch your baby, you can tell them that your baby is nervous or sleepy, or simply say that you’re trying to minimize the risk of your infant getting sick."
        },
        {
          "headline":"Enlist help.",
          "description":"If your spouse or partner is with you, take turns holding your baby so that the other person can relax and enjoy the birthday party. Otherwise, a friend or relative can serve this purpose."
        },
        {
          "headline":"Feed your baby in a quiet corner.",
          "description":"It’s best to isolate yourself in some quiet corner of the party when it’s time to feed your infant. Otherwise, your baby might be too distracted or overstimulated to eat well."
        },
        {
          "headline":"Find a place for your infant to sleep.",
          "description":"Babies tend to sleep a lot, so if you are at a party for more than an hour or two, you will probably need to find a place to let yours nap. Possibilities include:\nSleeping in a sling. This has the advantage of keeping your baby next to you and works well as long as the noise of the party does not keep your baby awake. Sleeping in a stroller. If you brought the stroller, this works as well. Sleeping in a quiet room. If the party is indoors, you can ask the host whether you can leave your baby to nap in an unused room. Assuming the baby isn’t mobile yet, you can place him or her on a towel in the middle of a large bed, covered by a blanket. Check on your baby often."
        },
        {
          "headline":"Know when to call it quits.",
          "description":"If your baby gets too fussy, it’s best for everyone – you, your baby, and the other party guests – for you to leave. Even if your baby seems content, you should not stay out much past his or her usual bedtime, as this will disrupt the sleep schedule considerably."
        }
      ]
    },
    {
      "name":"Unwinding After the Party",
      "steps":[
        {
          "headline":"Give your baby a warm bath.",
          "description":"Birthday parties are full of new faces and new sounds, so your infant may be overstimulated and cranky. When you get home, give your baby a warm bath, and apply lotion. Baby lotions scented with lavender are particularly relaxing and may help your baby sleep."
        },
        {
          "headline":"Feed your baby in peace and quiet.",
          "description":"You can either be silent, or speak to your baby in a low, soothing voice; alternatively, you can sing a slow, calming lullaby."
        },
        {
          "headline":"Prepare for a restless night.",
          "description":"Even if you do these steps, your baby may not sleep peacefully after an experience like a birthday party. He or she may wake frequently at night."
        }
      ]
    }
  ],
  "text":" Preparing for the Party Inquire about the party. Ask for details about the party, and make sure the event will be baby-friendly. Make a decision about attending the party based on this information. Some things to consider:\nWill the party be inside or outside? If outside, what will the weather be like? You may decide that your baby is not yet ready to handle an outdoor party in extreme temperatures or very windy weather. How many people will be there? If the party will be very noisy and crowded, you may want to skip the event. Babies tend to get distressed in large crowds. Will there be a lot of smoke? If many of the guests will be smoking, you should either skip the party or find a babysitter. You don’t want to expose your infant to smoke. Will other babies or children be present? You may not feel comfortable being the only person at the party with a child in tow. Talk to other parents. More experienced parents may be able to give you some advice about bringing your baby along to a party. If these people will be at the same event, that’s even better! Packing Your Diaper Bag Bring plenty of diapers, wipes, blankets, and towels. You’ll need to pack a diaper bag. When you do so, bring more diapers than you think you’ll need – you never know when your baby will decide to make life inconvenient. Make sure you have wet wipes as well, and a towel or blanket to use for a changing surface. Towels and blankets can do double-duty as coverings if your baby decides to nap at the party. Pack feeding supplies. If you breastfeed exclusively, consider bringing a blanket to help you feed your baby discreetly. If your infant drinks formula, bring it – along with bottles and nipples. Consider a sling. Slings can be fantastic because they let you keep your hands free even as you hold your baby close. If your infant is comfortable in a sling, take it along! Take a stroller. If the party is outside (or someplace with plenty of room), bring your stroller. Your infant can sleep in it if he or she gets tired, and it works as a good, familiar place to set your baby in the unfamiliar environment of a birthday party. Bring extra clothes for you and your baby. Be prepared for diaper-related accidents, spitting up, and other miscellaneous infant messiness. Bring a fresh set of clothes for yourself and your infant. If this will be the first time many people will see your baby, you may want to pick extra special clothes for the occasion, but don’t choose anything to fussy or difficult, as that will make changes unnecessarily complicated. Enjoying the Party Take care of your baby’s basic needs before you go. Feed the baby and give it a fresh diaper before you leave. This will maximize the odds of your infant being in a pleasant (or sleepy) mood for the birthday party. Keep your distance from large crowds. Avoid placing your baby in the center of a large, busy, noisy gathering. Too much talking and noise can overstimulate an infant, which may be upsetting and may lead to difficulty winding down and sleeping later. Avoid letting everyone hold your baby. If your infant is very young, it’s important to avoid unnecessary germs. Children, especially, have notoriously dirty hands; try not to let them hold or touch your baby. If you have to, you can make up excuses. If there are people who you’d rather did not touch your baby, you can tell them that your baby is nervous or sleepy, or simply say that you’re trying to minimize the risk of your infant getting sick. Enlist help. If your spouse or partner is with you, take turns holding your baby so that the other person can relax and enjoy the birthday party. Otherwise, a friend or relative can serve this purpose. Feed your baby in a quiet corner. It’s best to isolate yourself in some quiet corner of the party when it’s time to feed your infant. Otherwise, your baby might be too distracted or overstimulated to eat well. Find a place for your infant to sleep. Babies tend to sleep a lot, so if you are at a party for more than an hour or two, you will probably need to find a place to let yours nap. Possibilities include:\nSleeping in a sling. This has the advantage of keeping your baby next to you and works well as long as the noise of the party does not keep your baby awake. Sleeping in a stroller. If you brought the stroller, this works as well. Sleeping in a quiet room. If the party is indoors, you can ask the host whether you can leave your baby to nap in an unused room. Assuming the baby isn’t mobile yet, you can place him or her on a towel in the middle of a large bed, covered by a blanket. Check on your baby often. Know when to call it quits. If your baby gets too fussy, it’s best for everyone – you, your baby, and the other party guests – for you to leave. Even if your baby seems content, you should not stay out much past his or her usual bedtime, as this will disrupt the sleep schedule considerably. Unwinding After the Party Give your baby a warm bath. Birthday parties are full of new faces and new sounds, so your infant may be overstimulated and cranky. When you get home, give your baby a warm bath, and apply lotion. Baby lotions scented with lavender are particularly relaxing and may help your baby sleep. Feed your baby in peace and quiet. You can either be silent, or speak to your baby in a low, soothing voice; alternatively, you can sing a slow, calming lullaby. Prepare for a restless night. Even if you do these steps, your baby may not sleep peacefully after an experience like a birthday party. He or she may wake frequently at night.",
  "tyn_model":[
    "diapers",
    "wipes",
    "blankets",
    "towels",
    "– you",
    "towel",
    "blanket",
    "sling",
    "stroller",
    "diaper bag",
    "formula",
    "– along",
    "bottles",
    "nipples",
    "slings",
    "– for",
    "lotion",
    "lotions",
    "lavender"
  ],
  "tyn_section":[

  ]
}