{
  "title":"How to Beat the Mortal Kombat Story Mode",
  "url":"https://www.wikihow.com/Beat-the-Mortal-Kombat-Story-Mode",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Mortal Kombat"
  ],
  "steps":[
    {
      "headline":"Begin your game.",
      "description":"Press Start on the main screen and adjust your settings by going to Options and Gameplay. You set your difficulty for the story mode from Beginner to Expert. If it's your first time playing this game, set it to Beginner. If you know the game really well, set it to Expert. Confirm your settings and press the Story Mode button."
    },
    {
      "headline":"Go through the first chapter which is Johnny Cage.",
      "description":"His first fight is against Reptile where you fight him in the Night Courtyard. His second fight is against Baraka where you fight him in the Night Courtyard. His third fight is against Sonya Blade where you fight her in the Night Pit. His fourth fight is against Kano where you fight him in the Night Pit."
    },
    {
      "headline":"Go through the second chapter which is Sonya Blade.",
      "description":"Her first fight is against Sub-Zero. Her second fight is against Raiden. Her third fight is against Jade and Kitana. Her fourth fight is against Kano."
    },
    {
      "headline":"Go through the third chapter which is Scorpion.",
      "description":"His first fight is against Kung Lao. His second fight is against Nightwolf. His third fight is against Cyrax and Sektor. His fourth fight is against Sub-Zero."
    },
    {
      "headline":"Go through the fourth chapter which is Cyrax.",
      "description":"His first fight is against Sheeva. His second fight is against Baraka. His third fight is against Johnny Cage. His fourth fight is against Sektor."
    },
    {
      "headline":"Go through the fifth chapter which is Liu Kang.",
      "description":"His first fight is against Ermac. His second fight is against Kitana. His third fight is against Quan Chi and Scorpion. His fourth fight is against the secondary boss called Goro. His fifth fight is against Shang Tsung."
    },
    {
      "headline":"Go through the sixth chapter which is Jax.",
      "description":"His first fight is against Baraka. His second fight is against Johnny Cage. His third fight is against Jade. His fourth fight is against Sheeva."
    },
    {
      "headline":"Go through the seventh chapter which is Smoke.",
      "description":"His first fight is against Kitana. His second fight is against Kano. His third fight is against Reptile and Sub-Zero. His fourth fight is against Sektor."
    },
    {
      "headline":"Go through the eighth chapter which is Sub-Zero.",
      "description":"His first fight is against Cyrax. His second fight is against Ermac. His third fight is against Reptile. His fourth fight is against Scorpion."
    },
    {
      "headline":"Go through the ninth chapter which is Kitana.",
      "description":"Her first fight is against Johnny Cage and Smoke. Her second fight is against Jade. Her third fight is against Mileena. Her fourth fight is against Shang Tsung."
    },
    {
      "headline":"Go through the tenth chapter which is Jade.",
      "description":"Her first fight is against Baraka. Her second fight is against Sheeva. Her third fight is against Mileena. Her fourth fight is against Smoke."
    },
    {
      "headline":"Go through the eleventh chapter which is Kung Lao.",
      "description":"His first fight is against Noob. His second fight is against the secondary boss called Goro. His third fight is against Quan Chi and Shang Tsung. His fourth fight is against the other secondary boss called Kintaro. His fifth fight is against the ultimate boss called Shao Kahn but you don't fight him as Kung Lao because he has been unfortunately killed by the ultimate boss called Shao Kahn so you fight him as Liu Kang."
    },
    {
      "headline":"Go through the twelfth chapter which is Stryker.",
      "description":"His first fight is against Reptile. His second fight is against Mileena. His third fight is against the other secondary boss called Kintaro. His fourth fight is against Ermac."
    },
    {
      "headline":"Go through the thirteenth chapter which is Kabal.",
      "description":"His first fight is against Kano. His second fight is against Mileena and Noob. His third fight is against the new character called Cyber Sub-Zero. His fourth fight is against Sheeva."
    },
    {
      "headline":"Go through the fourteenth chapter which is the new character called Cyber Sub-Zero.",
      "description":"His first fight is against Sektor. His second fight is against the secondary bosses called Goro and Kintaro. His third fight is against Ermac. His fourth fight is against Noob."
    },
    {
      "headline":"Go through the fifteenth chapter which is Nightwolf.",
      "description":"His first fight is against Quan Chi. His second fight is against Cyrax. His third fight is against Sektor. His fourth fight is against Sindel."
    },
    {
      "headline":"Go through the sixteenth chapter which is Raiden.",
      "description":"His first fight is against Scorpion. His second fight is against Jax, Kabal, and Stryker. His third fight is against Kitana, Kung Lao, and Nightwolf. His fourth fight is against Liu Kang. His fifth fight is against the ultimate boss called Shao Kahn."
    },
    {
      "headline":"Reward yourself.",
      "description":"You should take yourself to do something really nice after completing the story mode like eat tasty food or go to a special place. You should unlock 5 to 6 achievements or trophies after you finished the story mode. We hope you enjoyed playing Mortal Kombat. Thanks for reading our awesome article!"
    }
  ],
  "text":" Begin your game. Press Start on the main screen and adjust your settings by going to Options and Gameplay. You set your difficulty for the story mode from Beginner to Expert. If it's your first time playing this game, set it to Beginner. If you know the game really well, set it to Expert. Confirm your settings and press the Story Mode button. Go through the first chapter which is Johnny Cage. His first fight is against Reptile where you fight him in the Night Courtyard. His second fight is against Baraka where you fight him in the Night Courtyard. His third fight is against Sonya Blade where you fight her in the Night Pit. His fourth fight is against Kano where you fight him in the Night Pit. Go through the second chapter which is Sonya Blade. Her first fight is against Sub-Zero. Her second fight is against Raiden. Her third fight is against Jade and Kitana. Her fourth fight is against Kano. Go through the third chapter which is Scorpion. His first fight is against Kung Lao. His second fight is against Nightwolf. His third fight is against Cyrax and Sektor. His fourth fight is against Sub-Zero. Go through the fourth chapter which is Cyrax. His first fight is against Sheeva. His second fight is against Baraka. His third fight is against Johnny Cage. His fourth fight is against Sektor. Go through the fifth chapter which is Liu Kang. His first fight is against Ermac. His second fight is against Kitana. His third fight is against Quan Chi and Scorpion. His fourth fight is against the secondary boss called Goro. His fifth fight is against Shang Tsung. Go through the sixth chapter which is Jax. His first fight is against Baraka. His second fight is against Johnny Cage. His third fight is against Jade. His fourth fight is against Sheeva. Go through the seventh chapter which is Smoke. His first fight is against Kitana. His second fight is against Kano. His third fight is against Reptile and Sub-Zero. His fourth fight is against Sektor. Go through the eighth chapter which is Sub-Zero. His first fight is against Cyrax. His second fight is against Ermac. His third fight is against Reptile. His fourth fight is against Scorpion. Go through the ninth chapter which is Kitana. Her first fight is against Johnny Cage and Smoke. Her second fight is against Jade. Her third fight is against Mileena. Her fourth fight is against Shang Tsung. Go through the tenth chapter which is Jade. Her first fight is against Baraka. Her second fight is against Sheeva. Her third fight is against Mileena. Her fourth fight is against Smoke. Go through the eleventh chapter which is Kung Lao. His first fight is against Noob. His second fight is against the secondary boss called Goro. His third fight is against Quan Chi and Shang Tsung. His fourth fight is against the other secondary boss called Kintaro. His fifth fight is against the ultimate boss called Shao Kahn but you don't fight him as Kung Lao because he has been unfortunately killed by the ultimate boss called Shao Kahn so you fight him as Liu Kang. Go through the twelfth chapter which is Stryker. His first fight is against Reptile. His second fight is against Mileena. His third fight is against the other secondary boss called Kintaro. His fourth fight is against Ermac. Go through the thirteenth chapter which is Kabal. His first fight is against Kano. His second fight is against Mileena and Noob. His third fight is against the new character called Cyber Sub-Zero. His fourth fight is against Sheeva. Go through the fourteenth chapter which is the new character called Cyber Sub-Zero. His first fight is against Sektor. His second fight is against the secondary bosses called Goro and Kintaro. His third fight is against Ermac. His fourth fight is against Noob. Go through the fifteenth chapter which is Nightwolf. His first fight is against Quan Chi. His second fight is against Cyrax. His third fight is against Sektor. His fourth fight is against Sindel. Go through the sixteenth chapter which is Raiden. His first fight is against Scorpion. His second fight is against Jax, Kabal, and Stryker. His third fight is against Kitana, Kung Lao, and Nightwolf. His fourth fight is against Liu Kang. His fifth fight is against the ultimate boss called Shao Kahn. Reward yourself. You should take yourself to do something really nice after completing the story mode like eat tasty food or go to a special place. You should unlock 5 to 6 achievements or trophies after you finished the story mode. We hope you enjoyed playing Mortal Kombat. Thanks for reading our awesome article!",
  "tyn_model":[
    "zero",
    "jade",
    "cyrax",
    "sektor",
    "scorpion",
    "reptile",
    "cage",
    "ermac",
    "baraka",
    "smoke",
    "noob",
    "stryker",
    "mortal kombat"
  ],
  "tyn_section":[

  ]
}