{
  "title":"How to Become a Better Photographer with a Nifty Fifty",
  "url":"https://www.wikihow.com/Become-a-Better-Photographer-with-a-Nifty-Fifty",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Learning Photography"
  ],
  "steps":[
    {
      "headline":"Realize that 'point, click, shoot' doesn't work.",
      "description":"Just because you got a photo doesn't mean you got a good one. You will have to put some effort into it."
    },
    {
      "headline":"Get your 50mm lens.",
      "description":"Most makes of camera will have a 50mm 1.8 prime lens that is pretty affordable. If you go to f1.4, then the price will be considerably higher. You could use an older lens if you have a digital and save money, but you have to be really careful about the electronics of your camera. Better safe, than sorry. If you do have an old 50mm (or any other short prime lens), they are great using extension tubes and/or reversal rings."
    },
    {
      "headline":"Put your 50mm on your camera and don't bring a backup lens, 'just in case'.",
      "description":"Your goal here is to make the lens work for you, instead of reaching for a zoom or a longer lens."
    },
    {
      "headline":"Be sure that you have some knowledge as to how to use aperture in your photos.",
      "description":"One of the great things about a 1.8 (or so) prime lens, is that it has a fairly large aperture for you to use blur (bokeh) to good effect in your shots."
    },
    {
      "headline":"Take your camera with you.",
      "description":"You won't learn anything with it sitting on the shelf."
    },
    {
      "headline":"Don't carry your camera and try to get that pretty flower photograph while standing up.",
      "description":"It simply will not work. Get on the ground, or at the very least, on your knees."
    },
    {
      "headline":"Take pictures for certain effects.",
      "description":"MEAN to shot the photo where just about everything is blurry but that one 'thing'. Try to shoot hyperfocal shots!"
    },
    {
      "headline":"Practice framing shots.",
      "description":"Work on your composition."
    },
    {
      "headline":"Don't 'Spray and Pray'.",
      "description":"This is when you just hit the button on your camera, shoot off a lot of shots, and pray that one will be a good one."
    },
    {
      "headline":"While learning, and even when you think you got it, don't be afraid to 'chimp'.",
      "description":"Use the advantage that digital photography provides you. You can see the shot, figure out what went wrong, and fix it."
    }
  ],
  "text":" Realize that 'point, click, shoot' doesn't work. Just because you got a photo doesn't mean you got a good one. You will have to put some effort into it. Get your 50mm lens. Most makes of camera will have a 50mm 1.8 prime lens that is pretty affordable. If you go to f1.4, then the price will be considerably higher. You could use an older lens if you have a digital and save money, but you have to be really careful about the electronics of your camera. Better safe, than sorry. If you do have an old 50mm (or any other short prime lens), they are great using extension tubes and/or reversal rings. Put your 50mm on your camera and don't bring a backup lens, 'just in case'. Your goal here is to make the lens work for you, instead of reaching for a zoom or a longer lens. Be sure that you have some knowledge as to how to use aperture in your photos. One of the great things about a 1.8 (or so) prime lens, is that it has a fairly large aperture for you to use blur (bokeh) to good effect in your shots. Take your camera with you. You won't learn anything with it sitting on the shelf. Don't carry your camera and try to get that pretty flower photograph while standing up. It simply will not work. Get on the ground, or at the very least, on your knees. Take pictures for certain effects. MEAN to shot the photo where just about everything is blurry but that one 'thing'. Try to shoot hyperfocal shots! Practice framing shots. Work on your composition. Don't 'Spray and Pray'. This is when you just hit the button on your camera, shoot off a lot of shots, and pray that one will be a good one. While learning, and even when you think you got it, don't be afraid to 'chimp'. Use the advantage that digital photography provides you. You can see the shot, figure out what went wrong, and fix it.",
  "tyn_model":[
    "camera",
    "50mm",
    "50mm lens",
    "50mm 1.8 prime lens"
  ],
  "tyn_section":[

  ]
}