{
  "title":"How to Perform the Original \"Psychic Force\"",
  "url":"https://www.wikihow.com/Perform-the-Original-%22Psychic-Force%22",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Card Games"
  ],
  "steps":[
    {
      "headline":"Send your assistant, who is also completely fluent in this trick, out of the room.",
      "description":""
    },
    {
      "headline":"Shuffle a standard deck of cards.",
      "description":""
    },
    {
      "headline":"Deal out cards face up onto a table.",
      "description":"Deal the first card to the top of the table in front of your left arm. Deal the second card to the top of the table in front of your right arm. Continue dealing down these columns, alternating left and right as described in step four."
    },
    {
      "headline":"Watch the cards very carefully as you are dealing, keeping an eye out for the numbered cards 4,5,6,7,8,9 or 10.",
      "description":"You will note that the design on all seven of these cards consists of two vertical columns of pips with optional center pips (the ten has two center pips, the odd-numbered cards have one center pip, the remaining cards have none.) Your goal is to deal out the shape of the pips on one of these cards, and to have that card be present on the table. Ideally, you would like the 10 card to be present, because that allows you to deal the largest number of  cards onto the table -- however, unless you are able to pre-arrange the deck, you cannot be certain of this. See the example in the next step."
    },
    {
      "headline":"Consider this random deal of cards:  Say that, on the first deal, an Ace comes up -- place the card toward the top of the table in line with your left arm.",
      "description":"On the next card, a Jack comes up -- place this card level with the Ace in line with your right hand. The next card to come up is a 7. Place this card directly below the Ace. Note that the 7 is one of your target cards. This means that you are safe to deal out at least four more cards. Using the 7 as a template, the fourth and sixth cards you deal would be placed underneath the the Jack, while the fifth card would be placed under the Ace and the 7. Your seventh card would be placed in the middle row, centered. In this manner, the cards you have dealt out will match the pips on the 7. If one of the cards after the 7 turned out to be an 8, 9 or 10, feel free to change your layout \"on the fly\" and go for the higher card."
    },
    {
      "headline":"Ask your mark, once the cards are laid out, to choose one card by touching the face of the card.",
      "description":""
    },
    {
      "headline":"Direct your assistant to come back into the room.",
      "description":"Your assistant now looks at the cards on the table. First, she determines what card shape has been laid out. Next, she examines the cards in the order they were laid out, and finds the first card which matches the corresponding card shape. This card is now the \"control\" card. For example, the \"control\" card for step 4, above, would be the 7 card in the first column just below the Ace."
    },
    {
      "headline":"Ask your assistant what card was chosen using the following method:  Touch one of the cards on the table (in the same manner as the card was chosen) and say \"Was this the card?\"",
      "description":""
    },
    {
      "headline":"When you touch the \"control\" card, touch the pip on the card whose position indicates the chosen card.",
      "description":"In the example above, say that the mark selected the Jack at the top of the right hand column; you might use the following scenario:  Touch the Ace and say \"Was this the card?\". Touch the 7 on the top right pip and say \"Was this the card?\". Touch the card in the center and ask. Now, touch the jack -- this time, your assistant will answer \"yes\"."
    }
  ],
  "text":" Send your assistant, who is also completely fluent in this trick, out of the room.  Shuffle a standard deck of cards.  Deal out cards face up onto a table. Deal the first card to the top of the table in front of your left arm. Deal the second card to the top of the table in front of your right arm. Continue dealing down these columns, alternating left and right as described in step four. Watch the cards very carefully as you are dealing, keeping an eye out for the numbered cards 4,5,6,7,8,9 or 10. You will note that the design on all seven of these cards consists of two vertical columns of pips with optional center pips (the ten has two center pips, the odd-numbered cards have one center pip, the remaining cards have none.) Your goal is to deal out the shape of the pips on one of these cards, and to have that card be present on the table. Ideally, you would like the 10 card to be present, because that allows you to deal the largest number of  cards onto the table -- however, unless you are able to pre-arrange the deck, you cannot be certain of this. See the example in the next step. Consider this random deal of cards:  Say that, on the first deal, an Ace comes up -- place the card toward the top of the table in line with your left arm. On the next card, a Jack comes up -- place this card level with the Ace in line with your right hand. The next card to come up is a 7. Place this card directly below the Ace. Note that the 7 is one of your target cards. This means that you are safe to deal out at least four more cards. Using the 7 as a template, the fourth and sixth cards you deal would be placed underneath the the Jack, while the fifth card would be placed under the Ace and the 7. Your seventh card would be placed in the middle row, centered. In this manner, the cards you have dealt out will match the pips on the 7. If one of the cards after the 7 turned out to be an 8, 9 or 10, feel free to change your layout \"on the fly\" and go for the higher card. Ask your mark, once the cards are laid out, to choose one card by touching the face of the card.  Direct your assistant to come back into the room. Your assistant now looks at the cards on the table. First, she determines what card shape has been laid out. Next, she examines the cards in the order they were laid out, and finds the first card which matches the corresponding card shape. This card is now the \"control\" card. For example, the \"control\" card for step 4, above, would be the 7 card in the first column just below the Ace. Ask your assistant what card was chosen using the following method:  Touch one of the cards on the table (in the same manner as the card was chosen) and say \"Was this the card?\"  When you touch the \"control\" card, touch the pip on the card whose position indicates the chosen card. In the example above, say that the mark selected the Jack at the top of the right hand column; you might use the following scenario:  Touch the Ace and say \"Was this the card?\". Touch the 7 on the top right pip and say \"Was this the card?\". Touch the card in the center and ask. Now, touch the jack -- this time, your assistant will answer \"yes\".",
  "tyn_model":[
    "cards",
    "table",
    "jack",
    "7",
    "ace",
    "card"
  ],
  "tyn_section":[

  ]
}