{
  "title":"How to Locate and Beat the 6th Colossus in Shadow of the Colossus",
  "url":"https://www.wikihow.com/Locate-and-Beat-the-6th-Colossus-in-Shadow-of-the-Colossus",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation 2"
  ],
  "parts":[
    {
      "name":"Locate the Sixth Colossus",
      "steps":[
        {
          "headline":"Head outside the shrine and call Agro by pressing X.",
          "description":"Stand next to Agro and press ∆ in order to mount her."
        },
        {
          "headline":"Take out your sword.",
          "description":"Start looking around for where the light centralizes."
        },
        {
          "headline":"Head southwest–west toward the mountains.",
          "description":"You will see a dense green forest. Go through the path that leads into the forest."
        },
        {
          "headline":"Keep going through the forest.",
          "description":"Head right as soon as you see the end of the forest and a pool of water below. Continue until you see a path that leads outside the forest."
        },
        {
          "headline":"Take the path.",
          "description":"You'll see that the area will begin to change from a mud to sand; this means you're on the right track."
        },
        {
          "headline":"Take out your sword and shine it ahead of you.",
          "description":"It will centralize toward the southwest."
        },
        {
          "headline":"Head southwest until you see a large Greek temple–like structure.",
          "description":"Go inside the crevice and dismount Agro."
        },
        {
          "headline":"Climb through up the blocks and down the stairs.",
          "description":"Turn right at the end of the stairs and you'll see another set of blocks. Climb through these too."
        },
        {
          "headline":"Go through the corridor and down the stairs.",
          "description":"At the end of it, a cut scene will play. Now make your way down to the ground below. Do NOT jump! Wander will die from this height."
        },
        {
          "headline":"Go towards the edge and attempt to fall down while pressing R1.",
          "description":"Wander will automatically grab onto the ledge. Release R1 and press it again in order to fall down to the next ledge."
        },
        {
          "headline":"Repeat steps 10 until you get to the ground.",
          "description":"A short cut scene will play showing the sixth colossus being released from its confinement."
        }
      ]
    },
    {
      "name":"Defeat the Sixth Colossus",
      "steps":[
        {
          "headline":"Run!",
          "description":"Go towards the opposite side of the wall you climbed down on."
        },
        {
          "headline":"Jump on the half pillars on the opposite wall.",
          "description":"Once you're on the pillar, jump on top of the wall and fall down on the next area. Be fast while doing this; Barba might attack you while you're on the wall."
        },
        {
          "headline":"Repeat step 2 for the next wall and the one after that.",
          "description":""
        },
        {
          "headline":"Hide under a fixated temple ruin in front of all the walls.",
          "description":"Barba can't touch you while you're under it."
        },
        {
          "headline":"Take out your bow and start shooting Barba to get its attention.",
          "description":"When Barba tries to peek at you, his beard will touch the ground."
        },
        {
          "headline":"Run toward Barba's beard and latch onto it.",
          "description":"He'll shake for a while, so hold on a bit."
        },
        {
          "headline":"Climb toward his back once he stops moving.",
          "description":"Then make your way to the top of its head for the first weak point."
        },
        {
          "headline":"Charge up your sword and stab it twice.",
          "description":"This should be enough to make the weak point disappear. Be careful since Barba is an extremely violent shaker, so don't let go of its hair until it stops shaking."
        },
        {
          "headline":"Climb down toward Barba's back.",
          "description":"Go to the left side for the second weak point."
        },
        {
          "headline":"Charge up your sword and stab it until Barba dies.",
          "description":""
        }
      ]
    }
  ],
  "text":" Locate the Sixth Colossus Head outside the shrine and call Agro by pressing X. Stand next to Agro and press ∆ in order to mount her. Take out your sword. Start looking around for where the light centralizes. Head southwest–west toward the mountains. You will see a dense green forest. Go through the path that leads into the forest. Keep going through the forest. Head right as soon as you see the end of the forest and a pool of water below. Continue until you see a path that leads outside the forest. Take the path. You'll see that the area will begin to change from a mud to sand; this means you're on the right track. Take out your sword and shine it ahead of you. It will centralize toward the southwest. Head southwest until you see a large Greek temple–like structure. Go inside the crevice and dismount Agro. Climb through up the blocks and down the stairs. Turn right at the end of the stairs and you'll see another set of blocks. Climb through these too. Go through the corridor and down the stairs. At the end of it, a cut scene will play. Now make your way down to the ground below. Do NOT jump! Wander will die from this height. Go towards the edge and attempt to fall down while pressing R1. Wander will automatically grab onto the ledge. Release R1 and press it again in order to fall down to the next ledge. Repeat steps 10 until you get to the ground. A short cut scene will play showing the sixth colossus being released from its confinement. Defeat the Sixth Colossus Run! Go towards the opposite side of the wall you climbed down on. Jump on the half pillars on the opposite wall. Once you're on the pillar, jump on top of the wall and fall down on the next area. Be fast while doing this; Barba might attack you while you're on the wall. Repeat step 2 for the next wall and the one after that.  Hide under a fixated temple ruin in front of all the walls. Barba can't touch you while you're under it. Take out your bow and start shooting Barba to get its attention. When Barba tries to peek at you, his beard will touch the ground. Run toward Barba's beard and latch onto it. He'll shake for a while, so hold on a bit. Climb toward his back once he stops moving. Then make your way to the top of its head for the first weak point. Charge up your sword and stab it twice. This should be enough to make the weak point disappear. Be careful since Barba is an extremely violent shaker, so don't let go of its hair until it stops shaking. Climb down toward Barba's back. Go to the left side for the second weak point. Charge up your sword and stab it until Barba dies. ",
  "tyn_model":[
    "sword",
    "barba",
    "blocks",
    "wander",
    "∆ in",
    "–west",
    "water",
    "–like structure",
    "agro",
    "bow",
    "shaker"
  ],
  "tyn_section":[

  ]
}