{
  "title":"How to Locate and Beat the 4th Colossus in Shadow of the Colossus",
  "url":"https://www.wikihow.com/Locate-and-Beat-the-4th-Colossus-in-Shadow-of-the-Colossus",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation 2"
  ],
  "parts":[
    {
      "name":"Locating the Fourth Colossus",
      "steps":[
        {
          "headline":"Head outside the shrine and press X to call Agro.",
          "description":"Press ∆ once Agro is near to mount her."
        },
        {
          "headline":"Take out your sword by pressing O.",
          "description":"Look around the area until the light reflecting off the sword centralizes on a particular area on the southwest part of the map, or quadrant G5."
        },
        {
          "headline":"Head toward the mountains.",
          "description":"You'll see that there are two branching paths, take the one on the left and continue along this path until you come out of a canyon."
        },
        {
          "headline":"Turn right and continue climbing down the path.",
          "description":"After a while, you will reach a grassy area."
        },
        {
          "headline":"Keep going forward past the small tunnel system.",
          "description":"A cut scene will play, after which you will fight Phaedra."
        }
      ]
    },
    {
      "name":"Defeating the Fourth Colossus",
      "steps":[
        {
          "headline":"Dismount Agro.",
          "description":"Immediately run toward the tunnel system you saw on your way to Phaedra's lair. It's a large mound of dirt with 3 holes (caves) that serve as entryways."
        },
        {
          "headline":"Stand on top a cave.",
          "description":"Do this until Phaedra comes over to stamp on you - hide inside one before he can."
        },
        {
          "headline":"Wait for Phaedra to climb on top of your cave.",
          "description":"He will start stomping on the ground. You'll notice tremors and dust falling from the ceiling of the tunnels."
        },
        {
          "headline":"Exit the tunnel through one of the other entryways.",
          "description":"Do not exit the one you climbed through  as the colossus will be waiting for you there."
        },
        {
          "headline":"Wait for Phaedra to lower its body and peer inside the entry you first went through.",
          "description":""
        },
        {
          "headline":"Run toward Phaedra as soon as it lowers its body.",
          "description":"When it does this, you'll see that there's a part of Phaedra's tail that you can climb on."
        },
        {
          "headline":"Jump onto Phaedra's tail.",
          "description":"Climb up its back and continue moving toward the neck."
        },
        {
          "headline":"Charge your sword and stab at the Phaedra's first weak point.",
          "description":"This should be at the midsection of its neck. Be careful that you don't waste too much stamina or you'll fall."
        },
        {
          "headline":"Stab the first weak point around 2 to 3 times.",
          "description":"Phaedra will eventually lower its head, and the real weak point will appear."
        },
        {
          "headline":"Climb your way up to Phaedra's head.",
          "description":"This will lead you to the main weak point."
        },
        {
          "headline":"Charge your sword.",
          "description":"Continue stabbing the weak point until the colossus dies."
        }
      ]
    }
  ],
  "text":" Locating the Fourth Colossus Head outside the shrine and press X to call Agro. Press ∆ once Agro is near to mount her. Take out your sword by pressing O. Look around the area until the light reflecting off the sword centralizes on a particular area on the southwest part of the map, or quadrant G5. Head toward the mountains. You'll see that there are two branching paths, take the one on the left and continue along this path until you come out of a canyon. Turn right and continue climbing down the path. After a while, you will reach a grassy area. Keep going forward past the small tunnel system. A cut scene will play, after which you will fight Phaedra. Defeating the Fourth Colossus Dismount Agro. Immediately run toward the tunnel system you saw on your way to Phaedra's lair. It's a large mound of dirt with 3 holes (caves) that serve as entryways. Stand on top a cave. Do this until Phaedra comes over to stamp on you - hide inside one before he can. Wait for Phaedra to climb on top of your cave. He will start stomping on the ground. You'll notice tremors and dust falling from the ceiling of the tunnels. Exit the tunnel through one of the other entryways. Do not exit the one you climbed through  as the colossus will be waiting for you there. Wait for Phaedra to lower its body and peer inside the entry you first went through.  Run toward Phaedra as soon as it lowers its body. When it does this, you'll see that there's a part of Phaedra's tail that you can climb on. Jump onto Phaedra's tail. Climb up its back and continue moving toward the neck. Charge your sword and stab at the Phaedra's first weak point. This should be at the midsection of its neck. Be careful that you don't waste too much stamina or you'll fall. Stab the first weak point around 2 to 3 times. Phaedra will eventually lower its head, and the real weak point will appear. Climb your way up to Phaedra's head. This will lead you to the main weak point. Charge your sword. Continue stabbing the weak point until the colossus dies.",
  "tyn_model":[
    "phaedra",
    "sword",
    "∆ once",
    "dirt"
  ],
  "tyn_section":[

  ]
}