{
  "title":"How to Draw a Bucket",
  "url":"https://www.wikihow.com/Draw-a-Bucket",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Objects",
    "Drawing Household Objects"
  ],
  "steps":[
    {
      "headline":"Draw an ellipse or oval, horizontally.",
      "description":""
    },
    {
      "headline":"Draw two lines slanting inwards from the edges of the ellipse.",
      "description":""
    },
    {
      "headline":"Draw a curve connecting the bottom of the two slanted lines.",
      "description":"This curve follows the bottom half of the ellipse that started the bucket."
    },
    {
      "headline":"Draw a circle and a loop for a handle.",
      "description":"Remember that the handle goes outside the bucket, and that you can't see the part of the handle that's behind the bucket."
    },
    {
      "headline":"Put some liquid in the bucket.",
      "description":"The liquid follows the top curve of the bucket and goes all the way to the front edge."
    },
    {
      "headline":"If you want, try adding some shading and shadow to the bucket.",
      "description":"Decide which side the light is on, then darken parts more that are further from the light."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Draw an ellipse or oval, horizontally.  Draw two lines slanting inwards from the edges of the ellipse.  Draw a curve connecting the bottom of the two slanted lines. This curve follows the bottom half of the ellipse that started the bucket. Draw a circle and a loop for a handle. Remember that the handle goes outside the bucket, and that you can't see the part of the handle that's behind the bucket. Put some liquid in the bucket. The liquid follows the top curve of the bucket and goes all the way to the front edge. If you want, try adding some shading and shadow to the bucket. Decide which side the light is on, then darken parts more that are further from the light. Finished. ",
  "tyn_model":[
    "bucket",
    "liquid"
  ],
  "tyn_section":[

  ]
}