{
  "title":"How to Take Care of a Stuffed Chick",
  "url":"https://www.wikihow.com/Take-Care-of-a-Stuffed-Chick",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Traditional Toys",
    "Stuffed Animals"
  ],
  "steps":[
    {
      "headline":"Name your stuffed chick.",
      "description":"You can name it a cute mashup of the word 'chirp', or about its color. For example:\nChip\nChirrup\nChirpé\nCream\nSunshine\nTry keeping the name unique. Your chick is special and needs to stand out from other toy chicks."
    },
    {
      "headline":"Create a bed for your stuffed chick.",
      "description":"This can be made out of a box of a considerable size, for example a shoebox. Make sure that your stuffed chick will be comfortable in it. You can sew a mini pillow and duvet if you like, and put a little lamp by their bed. If you'd like, you can be creative and decorate the box for your stuffed chick's bed."
    },
    {
      "headline":"Use a bowl to give the stuffed chick a bath.",
      "description":"Don't use real water; just do a pretend dip, otherwise the chick may not dry properly and it might grow mildew or become stinky. You can get a rubber duck for the chick's friend and that can have a bath instead."
    },
    {
      "headline":"Feed the stuffed chick.",
      "description":"Use pretend food that is made out of clay. You can make food from coloured paper cut into pieces. Give this to your chick as food. Try modelling real food that chicks eat such as grain and mealworms. Do not feed your stuffed chick real food. Real food might leave stains on the stuffed toy, which can attract silverfish or other insects that might chew on your toy and ruin it."
    },
    {
      "headline":"Let your stuffed chick go to the bathroom.",
      "description":"Chickens go to the bathroom anywhere outside, but you can house train yours and use a small container for it, such as a washed margarine container. Fill it with scrunched paper to pretend it's soil or kitty litter."
    },
    {
      "headline":"Brush the stuffed chick's teeth.",
      "description":"Use a brush that no one uses anymore, or a new one from the dollar store that's just for you to play with. Do not use toothpaste; it will get stuck on the stuffed toy and it's very hard to remove. If you'd like, you can make your own toothbrush for your stuffed chick."
    },
    {
      "headline":"Create toys for your chick.",
      "description":"While you do not need to make toys for it, this can be a fun thing to do. Or, take some other toys and let the stuffed chick play with these."
    },
    {
      "headline":"Take your stuffed chick with you to places.",
      "description":"Take it when you go on car trips, visit the park or go to a friend's house. Always remember to bring it home with you again."
    }
  ],
  "text":" Name your stuffed chick. You can name it a cute mashup of the word 'chirp', or about its color. For example:\nChip\nChirrup\nChirpé\nCream\nSunshine\nTry keeping the name unique. Your chick is special and needs to stand out from other toy chicks. Create a bed for your stuffed chick. This can be made out of a box of a considerable size, for example a shoebox. Make sure that your stuffed chick will be comfortable in it. You can sew a mini pillow and duvet if you like, and put a little lamp by their bed. If you'd like, you can be creative and decorate the box for your stuffed chick's bed. Use a bowl to give the stuffed chick a bath. Don't use real water; just do a pretend dip, otherwise the chick may not dry properly and it might grow mildew or become stinky. You can get a rubber duck for the chick's friend and that can have a bath instead. Feed the stuffed chick. Use pretend food that is made out of clay. You can make food from coloured paper cut into pieces. Give this to your chick as food. Try modelling real food that chicks eat such as grain and mealworms. Do not feed your stuffed chick real food. Real food might leave stains on the stuffed toy, which can attract silverfish or other insects that might chew on your toy and ruin it. Let your stuffed chick go to the bathroom. Chickens go to the bathroom anywhere outside, but you can house train yours and use a small container for it, such as a washed margarine container. Fill it with scrunched paper to pretend it's soil or kitty litter. Brush the stuffed chick's teeth. Use a brush that no one uses anymore, or a new one from the dollar store that's just for you to play with. Do not use toothpaste; it will get stuck on the stuffed toy and it's very hard to remove. If you'd like, you can make your own toothbrush for your stuffed chick. Create toys for your chick. While you do not need to make toys for it, this can be a fun thing to do. Or, take some other toys and let the stuffed chick play with these. Take your stuffed chick with you to places. Take it when you go on car trips, visit the park or go to a friend's house. Always remember to bring it home with you again.",
  "tyn_model":[
    "cream",
    "shoebox",
    "lamp",
    "bowl",
    "water",
    "grain",
    "margarine container",
    "brush",
    "toothpaste"
  ],
  "tyn_section":[

  ]
}