{
  "title":"How to Make Breakfast Cake",
  "url":"https://www.wikihow.com/Make-Breakfast-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast"
  ],
  "steps":[
    {
      "headline":"Preheat oven to 375 degrees Fahrenheit (190 degrees Celsius).",
      "description":""
    },
    {
      "headline":"Grease a 9 x 13 inch cake pan.",
      "description":""
    },
    {
      "headline":"Cream the sugar and shortening using an electric mixer in a large bowl.",
      "description":""
    },
    {
      "headline":"Pour the vanilla extract.",
      "description":"Blend again."
    },
    {
      "headline":"In a separate bowl, sift the flour and baking powder until light and fluffy.",
      "description":""
    },
    {
      "headline":"Fold in the flour and mix into the creamed mixture.",
      "description":"Blend on low speed until there are no flour streaks and the batter is smooth."
    },
    {
      "headline":"Pour the cake batter into the cake pan.",
      "description":""
    },
    {
      "headline":"Sprinkle over the cinnamon and brown sugar over the batter.",
      "description":""
    },
    {
      "headline":"Bake the cake in the oven for about 35-45 minutes, until the cake is golden brown.",
      "description":""
    },
    {
      "headline":"Allow the cake to cool for about 10 minutes.",
      "description":""
    },
    {
      "headline":"Serve.",
      "description":"Slice the cake into pieces. Lay a piece on a serving plate. Enjoy!"
    }
  ],
  "text":" Preheat oven to 375 degrees Fahrenheit (190 degrees Celsius).  Grease a 9 x 13 inch cake pan.  Cream the sugar and shortening using an electric mixer in a large bowl.  Pour the vanilla extract. Blend again. In a separate bowl, sift the flour and baking powder until light and fluffy.  Fold in the flour and mix into the creamed mixture. Blend on low speed until there are no flour streaks and the batter is smooth. Pour the cake batter into the cake pan.  Sprinkle over the cinnamon and brown sugar over the batter.  Bake the cake in the oven for about 35-45 minutes, until the cake is golden brown.  Allow the cake to cool for about 10 minutes.  Serve. Slice the cake into pieces. Lay a piece on a serving plate. Enjoy!",
  "tyn_model":[
    "oven",
    "cake pan",
    "flour",
    "sugar",
    "shortening",
    "electric mixer",
    "large bowl",
    "vanilla extract",
    "baking powder",
    "cake batter",
    "cinnamon",
    "brown sugar",
    "serving plate"
  ],
  "tyn_section":[

  ]
}