{
  "title":"How to Make a Mason Jar Utensil Holder",
  "url":"https://www.wikihow.com/Make-a-Mason-Jar-Utensil-Holder",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping"
  ],
  "steps":[
    {
      "headline":"Choose a slab of wood.",
      "description":"It could be a sheet of timber, a piece of fencing or an old cabinet door. This will be the base board for your utensil holder. Any ssh size, shape or type of wood is fine."
    },
    {
      "headline":"Take measurements.",
      "description":"The size of holder you make will depend on the space you plan to put your utensil holder. Measuring utensils will also be advantageous."
    },
    {
      "headline":"Cut a 12\" x 12\" piece of wood.",
      "description":"Your utensil holder base can be a foot wide or a foot long or even a square foot, doesn't matter."
    },
    {
      "headline":"Get another piece.",
      "description":"Measure it about 1 inch (2.5 cm) wide and 12 inch (30.5 cm) in length."
    },
    {
      "headline":"Cut the wood, using a saw.",
      "description":"This will be placed on the board to serve as a holder."
    },
    {
      "headline":"Apply wood glue to the wood.",
      "description":"Mount it onto the board."
    },
    {
      "headline":"Let it dry for a couple of hours.",
      "description":""
    },
    {
      "headline":"Obtain 3 hose clamps.",
      "description":""
    },
    {
      "headline":"Drill a hole on the center of each of the clamps.",
      "description":""
    },
    {
      "headline":"Drill 3 holes into the board.",
      "description":"Make note of the distance between the holes, you'll need this information."
    },
    {
      "headline":"Screw the hose clamps on the board.",
      "description":""
    },
    {
      "headline":"Screw the jars into the clamps.",
      "description":""
    },
    {
      "headline":"Hang your utensil holder.",
      "description":"Hang it on your kitchen wall using an appropriate hanger such as a picture hook, or add some rope or twine which you could somehow attach to the board."
    }
  ],
  "text":" Choose a slab of wood. It could be a sheet of timber, a piece of fencing or an old cabinet door. This will be the base board for your utensil holder. Any ssh size, shape or type of wood is fine. Take measurements. The size of holder you make will depend on the space you plan to put your utensil holder. Measuring utensils will also be advantageous. Cut a 12\" x 12\" piece of wood. Your utensil holder base can be a foot wide or a foot long or even a square foot, doesn't matter. Get another piece. Measure it about 1 inch (2.5 cm) wide and 12 inch (30.5 cm) in length. Cut the wood, using a saw. This will be placed on the board to serve as a holder. Apply wood glue to the wood. Mount it onto the board. Let it dry for a couple of hours.  Obtain 3 hose clamps.  Drill a hole on the center of each of the clamps.  Drill 3 holes into the board. Make note of the distance between the holes, you'll need this information. Screw the hose clamps on the board.  Screw the jars into the clamps.  Hang your utensil holder. Hang it on your kitchen wall using an appropriate hanger such as a picture hook, or add some rope or twine which you could somehow attach to the board.",
  "tyn_model":[
    "utensil holder",
    "utensils",
    "saw",
    "wood glue",
    "hose clamps",
    "hose",
    "jars",
    "rope",
    "twine"
  ],
  "tyn_section":[

  ]
}