{
  "title":"How to Organize a Halo 3 System Link Party",
  "url":"https://www.wikihow.com/Organize-a-Halo-3-System-Link-Party",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Halo 3"
  ],
  "steps":[
    {
      "headline":"Figure out who you want to invite.",
      "description":"Your neighbors, your school friends, your longtime companions, you're friend's friends? Get an exact number count before you start."
    },
    {
      "headline":"Make a list.",
      "description":"See how many of them have Xbox 360s, how many of them have Halo 3, how many of them have Hard Drives? You will also need a rough guess of how many controllers they have, and if they are wireless."
    },
    {
      "headline":"Televisions are the main issue.",
      "description":"You can't really lug a flat-screen back and forth, so you may have to settle for some smaller ones. Craigslist has many small used televisions for under 20 dollars, but if you are not that dedicated, see if anyone you know has a little TV in their garage."
    },
    {
      "headline":"Before telling people a date, see if any of them have something going on, work, school, homework, sports practice, anything, just make sure they are all good.",
      "description":""
    },
    {
      "headline":"Assign which people are going to be on which consoles.",
      "description":"Everyone is going to be sad they are stuck with CQB and Mark VI again, so you'll have to decide which consoles are being brought. (Memory Units are very helpful)"
    },
    {
      "headline":"Decide on a layout, are you going to make the televisions face outwards, like a game of battleship, or side by side in a panoramic display?",
      "description":"Make sure you have enough chairs, or a couch, or if people are going to be sitting on the floor."
    },
    {
      "headline":"If you have more than two consoles, make sure you get a router and all the necessary cables, or you can use wireless networks.",
      "description":""
    },
    {
      "headline":"Get food, it helps.",
      "description":"Players will be hungry from all this killing, so snacks are much appreciated. Even an enormous bowl of chips will do, but you need something."
    },
    {
      "headline":"Make sure that sound systems are fully tweaked, and, if you have multiple sets of speakers on different consoles, make sure they are the same volume.",
      "description":""
    },
    {
      "headline":"Set up a digital invitation, such as e-vite, so you can check to see who is coming in the push of a button.",
      "description":""
    },
    {
      "headline":"Decide on a playlist, and forward it to all your guests, this way there will be no arguing over what will be played.",
      "description":""
    },
    {
      "headline":"If you have a custom map that needs forge to build, make sure you make it way in advance.",
      "description":""
    },
    {
      "headline":"Set up a scoreboard so you can see who wins.",
      "description":""
    }
  ],
  "text":" Figure out who you want to invite. Your neighbors, your school friends, your longtime companions, you're friend's friends? Get an exact number count before you start. Make a list. See how many of them have Xbox 360s, how many of them have Halo 3, how many of them have Hard Drives? You will also need a rough guess of how many controllers they have, and if they are wireless. Televisions are the main issue. You can't really lug a flat-screen back and forth, so you may have to settle for some smaller ones. Craigslist has many small used televisions for under 20 dollars, but if you are not that dedicated, see if anyone you know has a little TV in their garage. Before telling people a date, see if any of them have something going on, work, school, homework, sports practice, anything, just make sure they are all good.  Assign which people are going to be on which consoles. Everyone is going to be sad they are stuck with CQB and Mark VI again, so you'll have to decide which consoles are being brought. (Memory Units are very helpful) Decide on a layout, are you going to make the televisions face outwards, like a game of battleship, or side by side in a panoramic display? Make sure you have enough chairs, or a couch, or if people are going to be sitting on the floor. If you have more than two consoles, make sure you get a router and all the necessary cables, or you can use wireless networks.  Get food, it helps. Players will be hungry from all this killing, so snacks are much appreciated. Even an enormous bowl of chips will do, but you need something. Make sure that sound systems are fully tweaked, and, if you have multiple sets of speakers on different consoles, make sure they are the same volume.  Set up a digital invitation, such as e-vite, so you can check to see who is coming in the push of a button.  Decide on a playlist, and forward it to all your guests, this way there will be no arguing over what will be played.  If you have a custom map that needs forge to build, make sure you make it way in advance.  Set up a scoreboard so you can see who wins. ",
  "tyn_model":[
    "televisions",
    "consoles",
    "xbox 360s",
    "controllers",
    "tv",
    "chairs",
    "router",
    "speakers",
    "scoreboard"
  ],
  "tyn_section":[

  ]
}