{
  "title":"How to Make Couscous with Salmon and Zucchini",
  "url":"https://www.wikihow.com/Make-Couscous-with-Salmon-and-Zucchini",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "steps":[
    {
      "headline":"Set up your plates somewhere accessible before you start.",
      "description":"This allows you to plate the food right away once it's finished cooking."
    },
    {
      "headline":"Add olive oil to your skillet and preheat.",
      "description":"Add the onions and a few pinches of piment, and sauté on medium heat until onions are transparent in color."
    },
    {
      "headline":"Add the garlic, salt and pepper to taste.",
      "description":"Sauté for 1 to 2 minutes (be sure to stir every now and then when sautéing ingredients)."
    },
    {
      "headline":"Add the bell peppers and simmer on low - medium heat until they become tender and have released their juices.",
      "description":"This may take 15 to 30 minutes (give or take) depending on the strength of your stove. Make sure to keep an eye on the vegetables while they simmer, you don't want your onions to burn. Stir as needed."
    },
    {
      "headline":"Add the diced tomatoes and the cup of white wine.",
      "description":"Cover and simmer on low heat until tender. Let it simmer for a good 20 to 40 minutes. This allows the white wine to permeate the vegetables and creates a nice flavor."
    },
    {
      "headline":"Approximately ten minutes before the sauce is ready, boil the 1 cup of water and butter in the small saucepan over high heat.",
      "description":"While the water is coming to a boil, place the couscous in a bowl."
    },
    {
      "headline":"Directly after the water in the small saucepan has come to a boil, pour over the couscous and stir.",
      "description":"Cover the bowl with a kitchen towel and let sit for 5 to 10 minutes, or until the couscous has absorbed the water. When the water is absorbed gently fluff the couscous with a fork. While the couscous sits, add the zucchini to the vegetable sauce, and heat 1 - 2 tablespoons of olive over high heat in second skillet."
    },
    {
      "headline":"Season salmon fillets with salt and pepper, and drizzle with lemon.",
      "description":"Add the fillets to the pan skin side down, and reduced to medium - low heat. Cook the fillets for approximately 7 minutes until cooked 3/4 of the way through. Turn fillets and cook for 3 minutes or until slightly pink in the center."
    },
    {
      "headline":"Start plating your dishes while the salmon is cooking.",
      "description":"Begin by serving a portion of couscous on each plate."
    },
    {
      "headline":"Add the sauce over each portion of couscous.",
      "description":"Be sure to give each plate an equal amount of sauce and vegetables, but don't drown the couscous in sauce either!"
    },
    {
      "headline":"Serve the salmon directly after it's finished cooking.",
      "description":"Place each fillet of salmon over the sauce and couscous, and center nicely."
    },
    {
      "headline":"Finish by sprinkling some parsley on top and adding a quick squeeze of lemon.",
      "description":"Serve and enjoy!"
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Set up your plates somewhere accessible before you start. This allows you to plate the food right away once it's finished cooking. Add olive oil to your skillet and preheat. Add the onions and a few pinches of piment, and sauté on medium heat until onions are transparent in color. Add the garlic, salt and pepper to taste. Sauté for 1 to 2 minutes (be sure to stir every now and then when sautéing ingredients). Add the bell peppers and simmer on low - medium heat until they become tender and have released their juices. This may take 15 to 30 minutes (give or take) depending on the strength of your stove. Make sure to keep an eye on the vegetables while they simmer, you don't want your onions to burn. Stir as needed. Add the diced tomatoes and the cup of white wine. Cover and simmer on low heat until tender. Let it simmer for a good 20 to 40 minutes. This allows the white wine to permeate the vegetables and creates a nice flavor. Approximately ten minutes before the sauce is ready, boil the 1 cup of water and butter in the small saucepan over high heat. While the water is coming to a boil, place the couscous in a bowl. Directly after the water in the small saucepan has come to a boil, pour over the couscous and stir. Cover the bowl with a kitchen towel and let sit for 5 to 10 minutes, or until the couscous has absorbed the water. When the water is absorbed gently fluff the couscous with a fork. While the couscous sits, add the zucchini to the vegetable sauce, and heat 1 - 2 tablespoons of olive over high heat in second skillet. Season salmon fillets with salt and pepper, and drizzle with lemon. Add the fillets to the pan skin side down, and reduced to medium - low heat. Cook the fillets for approximately 7 minutes until cooked 3/4 of the way through. Turn fillets and cook for 3 minutes or until slightly pink in the center. Start plating your dishes while the salmon is cooking. Begin by serving a portion of couscous on each plate. Add the sauce over each portion of couscous. Be sure to give each plate an equal amount of sauce and vegetables, but don't drown the couscous in sauce either! Serve the salmon directly after it's finished cooking. Place each fillet of salmon over the sauce and couscous, and center nicely. Finish by sprinkling some parsley on top and adding a quick squeeze of lemon. Serve and enjoy! Finished. ",
  "tyn_model":[
    "water",
    "salmon",
    "skillet",
    "onions",
    "vegetables",
    "white wine",
    "small saucepan",
    "bowl",
    "lemon",
    "plates",
    "olive oil",
    "garlic",
    "salt",
    "pepper",
    "bell peppers",
    "stove",
    "tomatoes",
    "butter",
    "kitchen towel",
    "fork",
    "zucchini",
    "vegetable sauce",
    "olive",
    "salt and pepper",
    "dishes",
    "couscous",
    "parsley"
  ],
  "tyn_section":[

  ]
}