{
  "title":"How to Complete a Text Adventure Without Cheating",
  "url":"https://www.wikihow.com/Complete-a-Text-Adventure-Without-Cheating",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games"
  ],
  "steps":[
    {
      "headline":"Read any documentation that does not contain specific clues.",
      "description":"Make sure you understand how to parse your commands. Text adventures typically accept commands such as \"open mailbox\", \"take letter\", \"read letter\", or \"climb tree\". Movement typically requires a simple compass direction, such as \"north\" or \"northwest\" (n or nw will usually suffice). Some games will give a fair amount of detail up front. Other games are quite vague at the outset."
    },
    {
      "headline":"Read every word that comes up during gameplay.",
      "description":"If you just skim over things, you may miss an important clue. The look command will tell you exactly where you are. A room description will appear automatically at any new location. Whether it appears at every subsequent visit depends on whether the game is in verbose or brief mode. Brief mode is usually the default setting, but this can be changed on command. If a word ever comes up which you are unfamiliar with, look up the definition."
    },
    {
      "headline":"Examine or read every object, to pick up additional clues.",
      "description":"You can examine a character, although it may be urgent to do something about him/her/it."
    },
    {
      "headline":"Pick up (or take) any object which you can, as there will likely be a use for it somewhere.",
      "description":"The inventory command will remind you of what all is in your possession. Most games have \"baggage limits\", so you may have to drop something before taking something else. There may also be passages which limit how much you can carry through. Such limits usually consider the collective weight of your inventory, not merely the quantity. Some objects can act as containers; for example, you could put coins in bag. This may let you carry more inventory, or otherwise give you flexibility. When you leave an object behind, don't count on it being present when you return."
    },
    {
      "headline":"Make a map as you go.",
      "description":"Before starting a map, explore enough to get a sense of the area, so that you can space it correctly. Remember that there are ten possible directions: north, east, south, west, northwest, northeast, southwest, southeast, up, and down. If a room has more than three visible exits, chances are that it is centrally located. Some games have an exits command which will always tell you which directions you can go in. In any event, the room descriptions will often spell this out. If there is not room to draw a line in the logical direction, use N, S, E, W, NE, NW, SE, and SW notations. For up and down, use U and D notations. Some pathways are effectively curves or even circles. Going north and then south will not always get you back to where you started. At the beginning of Zork, for example, if you go north, you'd then have to go west to get back to the first location. Experiment with the directions, and make the appropriate curves on your map. Some passages are one-way; this may or may not be explicitly noted when you try to go back. For example, you might climb up a chimney, but then be told \"Only Santa Claus climbs down chimneys\". If you find you can't return to the previous room, draw a one-way arrow. There will often be \"underground\" and \"above ground\" areas, which will require separate maps. In a maze or forest, several locations may have identical descriptions. Such areas are especially important to map, and should have separate sections if they are large. Keep track of each room's exits. Again, going west and then east will not always get you back to the same place; the path could be a curve, a circle, or one-way. In this type of area, such quirks are less obvious. You can drop an object to mark each place (objects don't always stay put, however). Once you have a complete and accurate map of the area, there should be no further need to mark locations with dropped objects, unless a mistake was made. If you can go in one direction forever, you've found either a circle or a loop; dropped objects can tell you which. If going south leads directly back to the selfsame room, draw a circle to indicate that. If going south and then south gets you back to the first room, and going south again gets you back to the second room, draw a U-shaped line. Lines may intersect; such a map could get messy. It may be best to avoid a large maze for as long as you can. Once you have experience navigating the game, the maze may make more sense. Note where objects or hazards are found. Some things may appear at random locations, but this will become apparent soon enough. If you encounter a locked door or an enemy blocking your path, it is likely that you can open up a new passage. Use a dotted line to note a potential passage. If the barrier is something else, there may or may not be a solution; the game has to have boundaries. If a barrier seems to be on the outskirts of the game area, there may be no way around or through it. If there's an underground level, there may be multiple routes back up to the surface, some of which may not even involve a direct up. If two locations on different maps turn out to be side-by-side, just note that on each map. There may also be ways to teleport from one location to another. If you discover one, note it on the map, making clear how you get from place to place. Test to see whether you can teleport back and forth, or if it only works one way."
    },
    {
      "headline":"Keep general notes.",
      "description":"If the game keeps score, note anything which increases your score. If merely picking up an object gives you points, said object is a treasure. Keep a list of treasures and their original locations. The treasures may ultimately have to be deposited somewhere, or given to someone. Note anything interesting. Just as a seemingly useless object likely has a purpose somewhere, an obscure bit of information may be a clue. In an adventure with multiple installments, such as Zork, one episode may contain a clue pertinent to a subsequent episode. So don't immediately discard your notes when you finish a game. Some clues may be given when you \"die\". Even if the game is over, read the concluding text."
    },
    {
      "headline":"Save your game frequently.",
      "description":"Danger could be lurking around the corner. Even if you know where you're going, many text adventures feature random occurrences which can mess you up. Save the game before entering a maze, and after successfully navigating it. If you get hopelessly lost, restore a position from the maze's entrance. If you are \"injured\", it may be best just to restore a saved game where you are in perfect health, if the injury is avoidable. An injury may make it harder to navigate the game. Not all text adventures keep track of health, but those that do will usually have a diagnose command that tells you your exact status. Likewise, if you \"die\" and come back, consider restoring a saved game where you haven't died. \"Death\" may cost you points and leave you with residual injuries. Moreover, your possessions may be scattered throughout the game area."
    },
    {
      "headline":"But don't rely entirely on a saved game.",
      "description":"You may have already done something inconspicuous which will prevent you from finishing. With your map and information accumulated, you can always redo it from the beginning. If an object is irretrievably lost or damaged, the game is likely unwinnable unless said object has already served its purpose, or has no particular purpose. Likewise, a character may have a purpose that cannot be fulfilled once he is gone."
    },
    {
      "headline":"Try anything and everything you can think of, with the two previous points in mind.",
      "description":"You are not likely to get very far without some experimenting. Do not assume that a particular action will produce the same result every time, even in identical situations. Randomness is often present in text adventures. Consider possible uses for each object. If you reach a point where an object might be useful, but you don't have it and can't soon retrieve it, consider restarting from a previous position."
    },
    {
      "headline":"Once you largely know where to go and what to do, it may be best to restart from scratch and do everything as efficiently as possible.",
      "description":"Your moves are counted, and some things are time-sensitive; for example, a light source may eventually go out. If you have a lantern or other light source which can be switched on and off, turn it off when you don't need it."
    }
  ],
  "text":" Read any documentation that does not contain specific clues. Make sure you understand how to parse your commands. Text adventures typically accept commands such as \"open mailbox\", \"take letter\", \"read letter\", or \"climb tree\". Movement typically requires a simple compass direction, such as \"north\" or \"northwest\" (n or nw will usually suffice). Some games will give a fair amount of detail up front. Other games are quite vague at the outset. Read every word that comes up during gameplay. If you just skim over things, you may miss an important clue. The look command will tell you exactly where you are. A room description will appear automatically at any new location. Whether it appears at every subsequent visit depends on whether the game is in verbose or brief mode. Brief mode is usually the default setting, but this can be changed on command. If a word ever comes up which you are unfamiliar with, look up the definition. Examine or read every object, to pick up additional clues. You can examine a character, although it may be urgent to do something about him/her/it. Pick up (or take) any object which you can, as there will likely be a use for it somewhere. The inventory command will remind you of what all is in your possession. Most games have \"baggage limits\", so you may have to drop something before taking something else. There may also be passages which limit how much you can carry through. Such limits usually consider the collective weight of your inventory, not merely the quantity. Some objects can act as containers; for example, you could put coins in bag. This may let you carry more inventory, or otherwise give you flexibility. When you leave an object behind, don't count on it being present when you return. Make a map as you go. Before starting a map, explore enough to get a sense of the area, so that you can space it correctly. Remember that there are ten possible directions: north, east, south, west, northwest, northeast, southwest, southeast, up, and down. If a room has more than three visible exits, chances are that it is centrally located. Some games have an exits command which will always tell you which directions you can go in. In any event, the room descriptions will often spell this out. If there is not room to draw a line in the logical direction, use N, S, E, W, NE, NW, SE, and SW notations. For up and down, use U and D notations. Some pathways are effectively curves or even circles. Going north and then south will not always get you back to where you started. At the beginning of Zork, for example, if you go north, you'd then have to go west to get back to the first location. Experiment with the directions, and make the appropriate curves on your map. Some passages are one-way; this may or may not be explicitly noted when you try to go back. For example, you might climb up a chimney, but then be told \"Only Santa Claus climbs down chimneys\". If you find you can't return to the previous room, draw a one-way arrow. There will often be \"underground\" and \"above ground\" areas, which will require separate maps. In a maze or forest, several locations may have identical descriptions. Such areas are especially important to map, and should have separate sections if they are large. Keep track of each room's exits. Again, going west and then east will not always get you back to the same place; the path could be a curve, a circle, or one-way. In this type of area, such quirks are less obvious. You can drop an object to mark each place (objects don't always stay put, however). Once you have a complete and accurate map of the area, there should be no further need to mark locations with dropped objects, unless a mistake was made. If you can go in one direction forever, you've found either a circle or a loop; dropped objects can tell you which. If going south leads directly back to the selfsame room, draw a circle to indicate that. If going south and then south gets you back to the first room, and going south again gets you back to the second room, draw a U-shaped line. Lines may intersect; such a map could get messy. It may be best to avoid a large maze for as long as you can. Once you have experience navigating the game, the maze may make more sense. Note where objects or hazards are found. Some things may appear at random locations, but this will become apparent soon enough. If you encounter a locked door or an enemy blocking your path, it is likely that you can open up a new passage. Use a dotted line to note a potential passage. If the barrier is something else, there may or may not be a solution; the game has to have boundaries. If a barrier seems to be on the outskirts of the game area, there may be no way around or through it. If there's an underground level, there may be multiple routes back up to the surface, some of which may not even involve a direct up. If two locations on different maps turn out to be side-by-side, just note that on each map. There may also be ways to teleport from one location to another. If you discover one, note it on the map, making clear how you get from place to place. Test to see whether you can teleport back and forth, or if it only works one way. Keep general notes. If the game keeps score, note anything which increases your score. If merely picking up an object gives you points, said object is a treasure. Keep a list of treasures and their original locations. The treasures may ultimately have to be deposited somewhere, or given to someone. Note anything interesting. Just as a seemingly useless object likely has a purpose somewhere, an obscure bit of information may be a clue. In an adventure with multiple installments, such as Zork, one episode may contain a clue pertinent to a subsequent episode. So don't immediately discard your notes when you finish a game. Some clues may be given when you \"die\". Even if the game is over, read the concluding text. Save your game frequently. Danger could be lurking around the corner. Even if you know where you're going, many text adventures feature random occurrences which can mess you up. Save the game before entering a maze, and after successfully navigating it. If you get hopelessly lost, restore a position from the maze's entrance. If you are \"injured\", it may be best just to restore a saved game where you are in perfect health, if the injury is avoidable. An injury may make it harder to navigate the game. Not all text adventures keep track of health, but those that do will usually have a diagnose command that tells you your exact status. Likewise, if you \"die\" and come back, consider restoring a saved game where you haven't died. \"Death\" may cost you points and leave you with residual injuries. Moreover, your possessions may be scattered throughout the game area. But don't rely entirely on a saved game. You may have already done something inconspicuous which will prevent you from finishing. With your map and information accumulated, you can always redo it from the beginning. If an object is irretrievably lost or damaged, the game is likely unwinnable unless said object has already served its purpose, or has no particular purpose. Likewise, a character may have a purpose that cannot be fulfilled once he is gone. Try anything and everything you can think of, with the two previous points in mind. You are not likely to get very far without some experimenting. Do not assume that a particular action will produce the same result every time, even in identical situations. Randomness is often present in text adventures. Consider possible uses for each object. If you reach a point where an object might be useful, but you don't have it and can't soon retrieve it, consider restarting from a previous position. Once you largely know where to go and what to do, it may be best to restart from scratch and do everything as efficiently as possible. Your moves are counted, and some things are time-sensitive; for example, a light source may eventually go out. If you have a lantern or other light source which can be switched on and off, turn it off when you don't need it.",
  "tyn_model":[
    "map",
    "coins",
    "maps",
    "lantern"
  ],
  "tyn_section":[

  ]
}