{
  "title":"How to Reuse a Jar",
  "url":"https://www.wikihow.com/Reuse-a-Jar",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Glass and Stained Glass Projects",
    "Jar Projects"
  ],
  "methods":[
    {
      "name":"Preparing the Jar",
      "steps":[
        {
          "headline":"Clean the jar with soap and water.",
          "description":"If your jar used to contain food or other perishable items, be sure to thoroughly scrub the inside with soap and water to avoid bacterial or mold growth. Any residual odors can be removed by using baking soda and vinegar. Some odors, like sauerkraut or coffee, are more stubborn. If baking soda and vinegar did not work, you can also use soapy water combined with coarse sea salt to absorb the odor. Shake the jar vigorously for 30 seconds to abrasively clean the inside of the jar, then rinse and let the jar dry."
        },
        {
          "headline":"Remove the label by soaking it in water and vinegar.",
          "description":"Most labels should be removable by using a combination of water and white vinegar or washing soda. Fill your sink or a tub with the solution and submerge the jar for around 10 minutes. Some labels can take up to half an hour, but feel free to check before then. Use a sponge or steel wool to scrub off any remaining adhesive. You can also use nail polish remover or mineral spirits to remove residue from particularly stubborn labels. Another method for removing labels is to use a hair dryer and melt the adhesive behind the label with prolonged heat. This method has mixed results, however, and will only work on glass jars. This method is unsuitable for plastic containers as they would melt under the heat."
        },
        {
          "headline":"Dry the jar with a towel.",
          "description":"Future decorations like paint, tape, or glue have limited effectiveness when applied to a wet surface. You can either dry the jar with a towel or let it air dry in sunlight or overnight. If you choose to use a towel, pay special attention to the threads at the top where water is most likely to remain. Drying a jar in sunlight has the added bonus of potentially removing any leftover odor that you missed."
        }
      ]
    },
    {
      "name":"Decorating the Jar",
      "steps":[
        {
          "headline":"Paint the jar with glass paint.",
          "description":"Glass is a tricky material, so some types of paint will work better than others. For best results use “glass paint” - also known as acrylic enamel paint. This type of paint will stick more strongly to glass than others and will also dry with a glossy sheen that resists scratching and peeling. Other paints will work fine, but multiple coats are advised to ensure that they stick and provide ample coverage. Fully painted jars work best when you do not want or care to see the contents. When using a jar as a terrarium or flower pot, for example, you could paint over the dirt and make it so only the plants themselves are visible. It is not recommended to paint jars that you intend to use with food. Most paints are harmful when consumed, though a few select brands are considered food-safe. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tClaire Donovan-Blackwood\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCrafting Expert, Heart Handmade UK\t\t\t\t\t\t\t\tClaire Donovan-Blackwood is the owner of Heart Handmade UK, a site dedicated to living a happy, creative life. She is a 12 year blogging veteran who loves making crafting and DIY as easy as possible for others, with a focus on mindfulness in making. Claire Donovan-Blackwood\t\t\tCrafting Expert, Heart Handmade UK\t\t\t\tGet creative when you're deciding what to do with your jar! Claire Donovan-Blackwood, owner of Heart Handmade UK, says: \"There are so many fun crafts you can do with glass jars. You can turn them into soap dispensers, for instance. I think old Bell jars look especially great in a bathroom. You can also use them for storing pens and markers, or for crafts like crochet. You can even make a colorful candle by melting different crayons and layering them in the jar!\""
        },
        {
          "headline":"Paint the lid.",
          "description":"If you want to decorate your jar but still see the contents, the lid is still fully customizable. If the lid is also made of glass, then use specifically designed glass paint. If the lid is made from metal, spray paint would stick to it best."
        },
        {
          "headline":"Decorate the exterior with ribbon and twine.",
          "description":"Bows can be tied around the neck of the jar and glued in place so they do not move. You can also glue ribbon and twine all the way around a jar, spiraling up from the bottom to the top and cover the entire jar. This can be layered on top of an already painted jar to give a dimensional and decorative look."
        },
        {
          "headline":"Attach decorative objects with glue.",
          "description":"Depending on what you store inside of the jar, you could glue a sample piece to the lid as a visual representation of its contents. If the jar is purely for decoration, then you can attach whatever you think looks nice instead. Dried leaves, flowers, or glass beads can all be positioned and fixed in place with an adhesive like hot glue or super glue. Some glues, like wood glue and Elmer's glue, do not work on glass. For best results use hot glue, super glue, or epoxy."
        }
      ]
    },
    {
      "name":"Organizing Objects",
      "steps":[
        {
          "headline":"Label your jars.",
          "description":"Whatever you choose to put in them, it is always a good idea to label the jars so you can remember what you repurposed them for. Labels can be purchased from an office supplies store, printed from a label maker, or you can simply make your own from paper and tape! If you intend to permanently label a jar, you can also use a stencil and paint your label on directly."
        },
        {
          "headline":"Keep hardware organized and separated.",
          "description":"Each jar can be used to hold a different type of hardware. For example, they could be used to separate woodscrews from bolts and keep different types of wire distinct from one another. These jars could be kept in a tray to prevent them from rolling around, though you could also attach them to the underside of a shelf. To do so, just sink a nail or screw through the lid into the underside of the shelf and tightly secure it. When you are done using the jar, simply tighten the jar back onto the designated lid."
        },
        {
          "headline":"Organize office supplies on your desk.",
          "description":"Objects like pencils, pens, and paintbrushes can also be stored in jars, just without using the lid. The naturally heavy weight of glass jars makes them more ideal for this situation than a lighter container like a plastic cup. This method still runs the risk of tipping over and spilling the contents, but this can be avoided by either adding weight to the bottom of a jar or not storing too many items in it at a time. Jars can also be used to store safety pins, thumbtacks, staples, paper clips, and similar supplies. The advantage to storing them in a jar is that, once sealed, they cannot spill or become mixed with other supplies."
        },
        {
          "headline":"Store sewing needles and thread.",
          "description":"The inside of the jar can be dedicated for housing your many spools of thread while the lid can be repurposed into a pincushion. Mason jars are ideal for the pin cushion lid because the main part of the lid pops out and leaves only the rim. To make a pin cushion lid, you'll need a large circle of fabric, some stuffing, and a small circle of cardboard traced from the inside of the Mason jar. Run a needle and thread through the edges of your fabric circle. Then pull the two ends of the string like a drawstring and tighten the cloth around your stuffing. Glue your cardboard circle over the opening of your cloth bundle and then push it through the Mason jar lid from the underside. Once sealed onto the jar, this will hold your pin cushion in place and you can stick your sewing needles into the top."
        },
        {
          "headline":"Save your spare change.",
          "description":"Instead of losing or throwing out your spare change, keep it in a jar instead. Dedicate the money saved to your date or movie fund and label the jar accordingly. It may take a while, but this idea will pay for itself."
        },
        {
          "headline":"Make a candle holder.",
          "description":"Candle holders are easy to make. Just situate the candle upright in the bottom of the jar and light it. Leave the lid off so that the candle has enough oxygen to continue burning. When you want the candle to stop burning, you can either blow the candle out or seal the jar and wait a few moments for the flame to run out of oxygen."
        },
        {
          "headline":"Make a potpourri holder.",
          "description":"Potpourri is made by combining dried flower petals, herbs, barks, spices, and fragrance oils. Combine the spices and oils together, then pour over the remaining ingredients in a bowl. After storing in a dark, dry place for 4-8 weeks, the potpourri is ready to be displayed. At that point, just pour the potpourri into a jar, arranging it in whatever fashion you find most appealing, then place wherever you want the scents to be strongest."
        }
      ]
    },
    {
      "name":"Serving Food",
      "steps":[
        {
          "headline":"Use jars as serving and storage containers.",
          "description":"Mason jars are well suited to being converted into drinking glasses, all you need to do is wash them! Larger jars like pickle jars are better suited to storing flour, rice, and other cooking ingredients. Smaller jars, like those used for baby food, can be converted into spice holders, though their varying sizes could be uncooperative to your existing spice rack. Do not use jars to serve hot food. Unless the jar is made from tempered glass, which is very unlikely, it runs a high risk of cracking and shattering due to the sudden change in heat. Only use jars to serve or store food that is intended to stay at room temperature."
        },
        {
          "headline":"Use jars to hold snacks.",
          "description":"You can also use jars to hold dry snacks like pretzels or chips that are not in risk of going bad. You can also store hard baked goods, like cookies or biscottis, in jars provided they will be consumed relatively soon. You should keep these jars sealed, however, to ensure that they stay dry and do not become stale."
        },
        {
          "headline":"Use jars to preserve food.",
          "description":"Mason and Ball jars can be reused to preserve food. If you have never canned food before, start off with a small batch of something simple like vegetables. Make sure that the food you choose is fresh and in good condition. Find a recipe and follow it, making sure to keep your hands clean throughout the process to avoid excess bacteria. Sterilize your jars by boiling them then fill the jars with your selected food and canning liquid. Place a softened seal on each jar and seal the lid on. After doing so, process them in a water or pressure canner according to the recipe. Label your canned goods with the month, year, and their contents. According to the National Center for Home Food Preservation, home canned goods are safe to consume for a full year after they were canned, so remember to eat them before they expire. Commercial mayonnaise, pickle, and baby food jars should never be used for this process."
        }
      ]
    }
  ],
  "text":" Preparing the Jar Clean the jar with soap and water. If your jar used to contain food or other perishable items, be sure to thoroughly scrub the inside with soap and water to avoid bacterial or mold growth. Any residual odors can be removed by using baking soda and vinegar. Some odors, like sauerkraut or coffee, are more stubborn. If baking soda and vinegar did not work, you can also use soapy water combined with coarse sea salt to absorb the odor. Shake the jar vigorously for 30 seconds to abrasively clean the inside of the jar, then rinse and let the jar dry. Remove the label by soaking it in water and vinegar. Most labels should be removable by using a combination of water and white vinegar or washing soda. Fill your sink or a tub with the solution and submerge the jar for around 10 minutes. Some labels can take up to half an hour, but feel free to check before then. Use a sponge or steel wool to scrub off any remaining adhesive. You can also use nail polish remover or mineral spirits to remove residue from particularly stubborn labels. Another method for removing labels is to use a hair dryer and melt the adhesive behind the label with prolonged heat. This method has mixed results, however, and will only work on glass jars. This method is unsuitable for plastic containers as they would melt under the heat. Dry the jar with a towel. Future decorations like paint, tape, or glue have limited effectiveness when applied to a wet surface. You can either dry the jar with a towel or let it air dry in sunlight or overnight. If you choose to use a towel, pay special attention to the threads at the top where water is most likely to remain. Drying a jar in sunlight has the added bonus of potentially removing any leftover odor that you missed. Decorating the Jar Paint the jar with glass paint. Glass is a tricky material, so some types of paint will work better than others. For best results use “glass paint” - also known as acrylic enamel paint. This type of paint will stick more strongly to glass than others and will also dry with a glossy sheen that resists scratching and peeling. Other paints will work fine, but multiple coats are advised to ensure that they stick and provide ample coverage. Fully painted jars work best when you do not want or care to see the contents. When using a jar as a terrarium or flower pot, for example, you could paint over the dirt and make it so only the plants themselves are visible. It is not recommended to paint jars that you intend to use with food. Most paints are harmful when consumed, though a few select brands are considered food-safe. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tClaire Donovan-Blackwood\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCrafting Expert, Heart Handmade UK\t\t\t\t\t\t\t\tClaire Donovan-Blackwood is the owner of Heart Handmade UK, a site dedicated to living a happy, creative life. She is a 12 year blogging veteran who loves making crafting and DIY as easy as possible for others, with a focus on mindfulness in making. Claire Donovan-Blackwood\t\t\tCrafting Expert, Heart Handmade UK\t\t\t\tGet creative when you're deciding what to do with your jar! Claire Donovan-Blackwood, owner of Heart Handmade UK, says: \"There are so many fun crafts you can do with glass jars. You can turn them into soap dispensers, for instance. I think old Bell jars look especially great in a bathroom. You can also use them for storing pens and markers, or for crafts like crochet. You can even make a colorful candle by melting different crayons and layering them in the jar!\" Paint the lid. If you want to decorate your jar but still see the contents, the lid is still fully customizable. If the lid is also made of glass, then use specifically designed glass paint. If the lid is made from metal, spray paint would stick to it best. Decorate the exterior with ribbon and twine. Bows can be tied around the neck of the jar and glued in place so they do not move. You can also glue ribbon and twine all the way around a jar, spiraling up from the bottom to the top and cover the entire jar. This can be layered on top of an already painted jar to give a dimensional and decorative look. Attach decorative objects with glue. Depending on what you store inside of the jar, you could glue a sample piece to the lid as a visual representation of its contents. If the jar is purely for decoration, then you can attach whatever you think looks nice instead. Dried leaves, flowers, or glass beads can all be positioned and fixed in place with an adhesive like hot glue or super glue. Some glues, like wood glue and Elmer's glue, do not work on glass. For best results use hot glue, super glue, or epoxy. Organizing Objects Label your jars. Whatever you choose to put in them, it is always a good idea to label the jars so you can remember what you repurposed them for. Labels can be purchased from an office supplies store, printed from a label maker, or you can simply make your own from paper and tape! If you intend to permanently label a jar, you can also use a stencil and paint your label on directly. Keep hardware organized and separated. Each jar can be used to hold a different type of hardware. For example, they could be used to separate woodscrews from bolts and keep different types of wire distinct from one another. These jars could be kept in a tray to prevent them from rolling around, though you could also attach them to the underside of a shelf. To do so, just sink a nail or screw through the lid into the underside of the shelf and tightly secure it. When you are done using the jar, simply tighten the jar back onto the designated lid. Organize office supplies on your desk. Objects like pencils, pens, and paintbrushes can also be stored in jars, just without using the lid. The naturally heavy weight of glass jars makes them more ideal for this situation than a lighter container like a plastic cup. This method still runs the risk of tipping over and spilling the contents, but this can be avoided by either adding weight to the bottom of a jar or not storing too many items in it at a time. Jars can also be used to store safety pins, thumbtacks, staples, paper clips, and similar supplies. The advantage to storing them in a jar is that, once sealed, they cannot spill or become mixed with other supplies. Store sewing needles and thread. The inside of the jar can be dedicated for housing your many spools of thread while the lid can be repurposed into a pincushion. Mason jars are ideal for the pin cushion lid because the main part of the lid pops out and leaves only the rim. To make a pin cushion lid, you'll need a large circle of fabric, some stuffing, and a small circle of cardboard traced from the inside of the Mason jar. Run a needle and thread through the edges of your fabric circle. Then pull the two ends of the string like a drawstring and tighten the cloth around your stuffing. Glue your cardboard circle over the opening of your cloth bundle and then push it through the Mason jar lid from the underside. Once sealed onto the jar, this will hold your pin cushion in place and you can stick your sewing needles into the top. Save your spare change. Instead of losing or throwing out your spare change, keep it in a jar instead. Dedicate the money saved to your date or movie fund and label the jar accordingly. It may take a while, but this idea will pay for itself. Make a candle holder. Candle holders are easy to make. Just situate the candle upright in the bottom of the jar and light it. Leave the lid off so that the candle has enough oxygen to continue burning. When you want the candle to stop burning, you can either blow the candle out or seal the jar and wait a few moments for the flame to run out of oxygen. Make a potpourri holder. Potpourri is made by combining dried flower petals, herbs, barks, spices, and fragrance oils. Combine the spices and oils together, then pour over the remaining ingredients in a bowl. After storing in a dark, dry place for 4-8 weeks, the potpourri is ready to be displayed. At that point, just pour the potpourri into a jar, arranging it in whatever fashion you find most appealing, then place wherever you want the scents to be strongest. Serving Food Use jars as serving and storage containers. Mason jars are well suited to being converted into drinking glasses, all you need to do is wash them! Larger jars like pickle jars are better suited to storing flour, rice, and other cooking ingredients. Smaller jars, like those used for baby food, can be converted into spice holders, though their varying sizes could be uncooperative to your existing spice rack. Do not use jars to serve hot food. Unless the jar is made from tempered glass, which is very unlikely, it runs a high risk of cracking and shattering due to the sudden change in heat. Only use jars to serve or store food that is intended to stay at room temperature. Use jars to hold snacks. You can also use jars to hold dry snacks like pretzels or chips that are not in risk of going bad. You can also store hard baked goods, like cookies or biscottis, in jars provided they will be consumed relatively soon. You should keep these jars sealed, however, to ensure that they stay dry and do not become stale. Use jars to preserve food. Mason and Ball jars can be reused to preserve food. If you have never canned food before, start off with a small batch of something simple like vegetables. Make sure that the food you choose is fresh and in good condition. Find a recipe and follow it, making sure to keep your hands clean throughout the process to avoid excess bacteria. Sterilize your jars by boiling them then fill the jars with your selected food and canning liquid. Place a softened seal on each jar and seal the lid on. After doing so, process them in a water or pressure canner according to the recipe. Label your canned goods with the month, year, and their contents. According to the National Center for Home Food Preservation, home canned goods are safe to consume for a full year after they were canned, so remember to eat them before they expire. Commercial mayonnaise, pickle, and baby food jars should never be used for this process.",
  "tyn_model":[
    "jars",
    "jar",
    "water",
    "vinegar",
    "towel",
    "paint",
    "thread",
    "soap",
    "baking soda",
    "tape",
    "glue",
    "glass paint",
    "paints",
    "glass jars",
    "pens",
    "ribbon",
    "twine",
    "hot glue",
    "super glue",
    "sewing needles",
    "mason jars",
    "fabric",
    "stuffing",
    "cardboard",
    "mason jar",
    "spices",
    "soapy water",
    "sea salt",
    "white vinegar",
    "washing soda",
    "sponge",
    "nail polish remover",
    "mineral spirits",
    "hair dryer",
    "adhesive",
    "“glass",
    "” -",
    "acrylic enamel paint",
    "heart handmade uk",
    "markers",
    "crayons",
    "spray paint",
    "wood glue",
    "elmer's glue",
    "epoxy",
    "label maker",
    "wire",
    "staples",
    "pin cushion lid",
    "needle",
    "cloth",
    "pin cushion",
    "candle holder",
    "candle holders",
    "candle",
    "potpourri holder",
    "herbs",
    "fragrance oils",
    "bowl",
    "potpourri",
    "pickle jars",
    "spice holders",
    "spice rack",
    "tempered glass",
    "mason and ball jars",
    "canned",
    "vegetables",
    "canning liquid",
    "pressure canner",
    "canned goods",
    "mayonnaise",
    "pickle",
    "baby food jars"
  ],
  "tyn_section":[

  ]
}