{
  "title":"How to Avoid Being Socially Awkward at a College Party",
  "url":"https://www.wikihow.com/Avoid-Being-Socially-Awkward-at-a-College-Party",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties"
  ],
  "methods":[
    {
      "name":"Talking to Others",
      "steps":[
        {
          "headline":"Prepare conversation topics ahead of time.",
          "description":"If social interaction stresses you out, think of a few topics that you are comfortable discussing. Before the party, come up with questions or responses you might give regarding these topics. If you practice possible conversation scenarios ahead of time, you won’t have to worry about thinking on the spot. Possible topics include:\nMemes or viral videos you think are funny. The latest celebrity faux pas posted to social media. Opinions on new music and film releases."
        },
        {
          "headline":"Consider the atmosphere.",
          "description":"You might be super excited about your topic for the final paper, but will your peers grasp the main idea while they’re dancing to loud techno music? Think of topics that can be easily understood in a loud and over-stimulated environment. These topics might include music, class schedules, or anything else that is simple and within your conversation comfort zone."
        },
        {
          "headline":"Have an anecdote or two prepared.",
          "description":"This short story could stem from personal experience, an episode from your favorite TV show, or a post you saw on social media. Add some humor if you can, but don’t panic if you can’t. Humorous or not, snippets from your personal life will flow easily because they are genuine. You could say:\n“For the longest time, I thought Prince was singing, ‘Don’t party like an overlord’ in ‘1999.’ Good thing I never tried that song at karaoke!”\n“I still can’t decide if my favorite of the Doctor’s companions is Martha or Rose. They were both equally great.”\n“George Takei is one of my favorite celebrities to follow on Twitter. He’s either thought-provoking or flat-out hilarious!”"
        },
        {
          "headline":"Talk about current events.",
          "description":"Almost everyone attending a college party is connected to social media, giving them common ground when it comes to current events. However, specific topics will depend on the type of party. If it’s a toga party, you’ll want to focus on pop culture references or on-campus quirks that interest you. If it’s a Pride Week party, you could talk about politics or activism."
        },
        {
          "headline":"Approach people or groups that don’t intimidate you.",
          "description":"If you recognize a classmate who you’ve never talked to, here’s your chance. If you see someone who also looks a bit nervous, a conversation eases both of your anxieties. Simple ice-breakers include:\n“You sit behind me in physics, right? I’m Jennifer. Nice to meet you.”\n“So what brings you here tonight?”\n“I’m actually a physics major. What about you?”\n“I hear these parties are always a hit. Is this your first, or have you been to a few before?”"
        },
        {
          "headline":"Join a conversation in progress.",
          "description":"Stand close enough to glean what others are saying. Introduce yourself to the people closest to you, and ask if you could squeeze in. Observe the reactions of the others in the group, and do what they do. For instance, if someone tells a funny joke, laugh when the others laugh."
        }
      ]
    },
    {
      "name":"Keeping the Right Frame of Mind",
      "steps":[
        {
          "headline":"Relax before the party.",
          "description":"Parties are not as big of a deal as they’re cracked up to be. A few hours before the party, go for a jog, do some yoga, or find a quiet space to meditate. Any of these will help you to shake off some stress. When you begin to relax, your thoughts will flow more naturally and you will be able to be yourself without your anxious thoughts holding you back."
        },
        {
          "headline":"Bring at least one close friend to the party.",
          "description":"Choose a friend you can rely on and stick with for the night. Friends can keep you calm by pulling you out of awkward conversations or jumping into them. They will also make it less uncomfortable if you decide to step back for a while and not talk to anyone else."
        },
        {
          "headline":"Take a breather.",
          "description":"If you feel yourself getting flustered at the party, excuse yourself for a second. Go to the bathroom or step outside into the fresh air and gather your thoughts. Remind yourself that there’s nothing to feel uncomfortable about, it’s just a party."
        },
        {
          "headline":"Stay sober.",
          "description":"Introverts sometimes use alcohol as “liquid courage.” However, getting drunk hides the real you. Worse, you could end up doing something you’ll regret the next day. When you stay sober, you maintain your self-control and actually reduce the risk of social awkwardness. If you don’t drink alcohol, you don’t have to feel left out. You could opt for punch or a soft drink. Ginger ale, if available, can mimic the appearance of white wine or beer. If opaque cups are available, you could drink water from yours. No one has to know your drink is alcohol-free."
        }
      ]
    },
    {
      "name":"Choosing Your Clothing",
      "steps":[
        {
          "headline":"Ask the host if there’s a dress code.",
          "description":"At most parties, partygoers wear their street clothes. However, in college, especially around Rush Week or certain holidays, some parties require a bit of conformity. If it’s early in the semester, the fraternities and sororities might throw toga parties. If it’s closer to Halloween, you could be going to a costume party. You might have to wear red for a Valentine’s Day party. While each outfit will have some degree of individuality, standing out too much could trigger social awkwardness."
        },
        {
          "headline":"Wear an outfit that makes you feel confident.",
          "description":"What you wear to a party can determine whether you’re fidgeting all night or feeling comfortable and relaxed. Wear an outfit that reflects you. If you feel confident in your outfit, confidence in your social skills is right around the corner. Even if there’s a dress code, you don’t have to sacrifice confidence. If you’re nervous about wearing a toga, ask the host of there’s some wiggle room in the dress code. Maybe you could wear a white tank top and white trousers under your costume. If black isn’t your color, forget about the Goth costume for Halloween and opt for something a bit lighter."
        },
        {
          "headline":"Don’t wear anything too thick.",
          "description":"Thick fabrics can cause you to sweat, increasing your internal stress levels. In the winter, wear a jacket over your party outfit. If it gets too hot, stash your jacket in the coat room, or ask the host where you can hang it."
        },
        {
          "headline":"Opt for a loose and light-colored top.",
          "description":"Lighter colors do not attract heat as well as dark colors do. Looser clothes allow more air to pass between the fabric and the skin, making the wearer feel cooler and less likely to sweat. If you do sweat, a loose top will not stick to your skin and pick up embarrassing sweat stains."
        }
      ]
    },
    {
      "name":"Positioning Yourself",
      "steps":[
        {
          "headline":"Hang out by the buffet.",
          "description":"The food table is a social hot spot that always has a flux of people. If you find yourself alone, make your way over to the refreshments. This location eases social anxieties and takes the spotlight off you. Food generates conversations. People love free food, so party goers will always make their way over to the chips and dip. If you are getting a plate of food at the same time as someone else, strike up a discussion about how great the punch is or how bad the quiche is. The refreshments table allows you to be occupied. This is one of the few places at a party where you can be alone and not look awkward. If you are holding a drink or a plate of food, you’ll be less likely to fidget."
        },
        {
          "headline":"Head to the dance floor.",
          "description":"This is another social hot spot where you can be occupied. You don’t have to dance to every song. If the DJ is playing your favorite song, you can dance to that. When the music switches to something that you don’t like, use that as an excuse to get something to drink. You can dance with others or by yourself. If you don’t feel comfortable dancing, don’t worry! You and other spectators can talk about the music or engage in some light self-mockery. (“Last time I tried to dance, my friends thought I was trying to shoo away a swarm of gnats.”) On the other hand, if you choose not to talk to anyone, you could use your attention to your peers’ moves as an excuse."
        },
        {
          "headline":"Check out any games in progress.",
          "description":"Whether you plan to participate or simply observe, see if any games are taking place. While games like beer pong and “I never…” usually involve alcohol, you might be able to find one or two (like air hockey or foosball) that do not. If more than one game is going on, you will have a choice of what to play. On the other hand, if you choose to just watch, you and other spectators will have a mutual conversation topic."
        },
        {
          "headline":"Give yourself a role at the party.",
          "description":"Take it upon yourself to introduce people to each other, make or distribute drinks, or tell the DJ what songs people want to hear. These interactions require you to be more talkative and let your social side shine."
        }
      ]
    }
  ],
  "text":" Talking to Others Prepare conversation topics ahead of time. If social interaction stresses you out, think of a few topics that you are comfortable discussing. Before the party, come up with questions or responses you might give regarding these topics. If you practice possible conversation scenarios ahead of time, you won’t have to worry about thinking on the spot. Possible topics include:\nMemes or viral videos you think are funny. The latest celebrity faux pas posted to social media. Opinions on new music and film releases. Consider the atmosphere. You might be super excited about your topic for the final paper, but will your peers grasp the main idea while they’re dancing to loud techno music? Think of topics that can be easily understood in a loud and over-stimulated environment. These topics might include music, class schedules, or anything else that is simple and within your conversation comfort zone. Have an anecdote or two prepared. This short story could stem from personal experience, an episode from your favorite TV show, or a post you saw on social media. Add some humor if you can, but don’t panic if you can’t. Humorous or not, snippets from your personal life will flow easily because they are genuine. You could say:\n“For the longest time, I thought Prince was singing, ‘Don’t party like an overlord’ in ‘1999.’ Good thing I never tried that song at karaoke!”\n“I still can’t decide if my favorite of the Doctor’s companions is Martha or Rose. They were both equally great.”\n“George Takei is one of my favorite celebrities to follow on Twitter. He’s either thought-provoking or flat-out hilarious!” Talk about current events. Almost everyone attending a college party is connected to social media, giving them common ground when it comes to current events. However, specific topics will depend on the type of party. If it’s a toga party, you’ll want to focus on pop culture references or on-campus quirks that interest you. If it’s a Pride Week party, you could talk about politics or activism. Approach people or groups that don’t intimidate you. If you recognize a classmate who you’ve never talked to, here’s your chance. If you see someone who also looks a bit nervous, a conversation eases both of your anxieties. Simple ice-breakers include:\n“You sit behind me in physics, right? I’m Jennifer. Nice to meet you.”\n“So what brings you here tonight?”\n“I’m actually a physics major. What about you?”\n“I hear these parties are always a hit. Is this your first, or have you been to a few before?” Join a conversation in progress. Stand close enough to glean what others are saying. Introduce yourself to the people closest to you, and ask if you could squeeze in. Observe the reactions of the others in the group, and do what they do. For instance, if someone tells a funny joke, laugh when the others laugh. Keeping the Right Frame of Mind Relax before the party. Parties are not as big of a deal as they’re cracked up to be. A few hours before the party, go for a jog, do some yoga, or find a quiet space to meditate. Any of these will help you to shake off some stress. When you begin to relax, your thoughts will flow more naturally and you will be able to be yourself without your anxious thoughts holding you back. Bring at least one close friend to the party. Choose a friend you can rely on and stick with for the night. Friends can keep you calm by pulling you out of awkward conversations or jumping into them. They will also make it less uncomfortable if you decide to step back for a while and not talk to anyone else. Take a breather. If you feel yourself getting flustered at the party, excuse yourself for a second. Go to the bathroom or step outside into the fresh air and gather your thoughts. Remind yourself that there’s nothing to feel uncomfortable about, it’s just a party. Stay sober. Introverts sometimes use alcohol as “liquid courage.” However, getting drunk hides the real you. Worse, you could end up doing something you’ll regret the next day. When you stay sober, you maintain your self-control and actually reduce the risk of social awkwardness. If you don’t drink alcohol, you don’t have to feel left out. You could opt for punch or a soft drink. Ginger ale, if available, can mimic the appearance of white wine or beer. If opaque cups are available, you could drink water from yours. No one has to know your drink is alcohol-free. Choosing Your Clothing Ask the host if there’s a dress code. At most parties, partygoers wear their street clothes. However, in college, especially around Rush Week or certain holidays, some parties require a bit of conformity. If it’s early in the semester, the fraternities and sororities might throw toga parties. If it’s closer to Halloween, you could be going to a costume party. You might have to wear red for a Valentine’s Day party. While each outfit will have some degree of individuality, standing out too much could trigger social awkwardness. Wear an outfit that makes you feel confident. What you wear to a party can determine whether you’re fidgeting all night or feeling comfortable and relaxed. Wear an outfit that reflects you. If you feel confident in your outfit, confidence in your social skills is right around the corner. Even if there’s a dress code, you don’t have to sacrifice confidence. If you’re nervous about wearing a toga, ask the host of there’s some wiggle room in the dress code. Maybe you could wear a white tank top and white trousers under your costume. If black isn’t your color, forget about the Goth costume for Halloween and opt for something a bit lighter. Don’t wear anything too thick. Thick fabrics can cause you to sweat, increasing your internal stress levels. In the winter, wear a jacket over your party outfit. If it gets too hot, stash your jacket in the coat room, or ask the host where you can hang it. Opt for a loose and light-colored top. Lighter colors do not attract heat as well as dark colors do. Looser clothes allow more air to pass between the fabric and the skin, making the wearer feel cooler and less likely to sweat. If you do sweat, a loose top will not stick to your skin and pick up embarrassing sweat stains. Positioning Yourself Hang out by the buffet. The food table is a social hot spot that always has a flux of people. If you find yourself alone, make your way over to the refreshments. This location eases social anxieties and takes the spotlight off you. Food generates conversations. People love free food, so party goers will always make their way over to the chips and dip. If you are getting a plate of food at the same time as someone else, strike up a discussion about how great the punch is or how bad the quiche is. The refreshments table allows you to be occupied. This is one of the few places at a party where you can be alone and not look awkward. If you are holding a drink or a plate of food, you’ll be less likely to fidget. Head to the dance floor. This is another social hot spot where you can be occupied. You don’t have to dance to every song. If the DJ is playing your favorite song, you can dance to that. When the music switches to something that you don’t like, use that as an excuse to get something to drink. You can dance with others or by yourself. If you don’t feel comfortable dancing, don’t worry! You and other spectators can talk about the music or engage in some light self-mockery. (“Last time I tried to dance, my friends thought I was trying to shoo away a swarm of gnats.”) On the other hand, if you choose not to talk to anyone, you could use your attention to your peers’ moves as an excuse. Check out any games in progress. Whether you plan to participate or simply observe, see if any games are taking place. While games like beer pong and “I never…” usually involve alcohol, you might be able to find one or two (like air hockey or foosball) that do not. If more than one game is going on, you will have a choice of what to play. On the other hand, if you choose to just watch, you and other spectators will have a mutual conversation topic. Give yourself a role at the party. Take it upon yourself to introduce people to each other, make or distribute drinks, or tell the DJ what songs people want to hear. These interactions require you to be more talkative and let your social side shine.",
  "tyn_model":[
    "”\n",
    "“i",
    "alcohol",
    "jacket",
    "“for",
    "‘do",
    "’ in",
    "‘1999",
    "’ good",
    "“george",
    "” talk",
    "“you",
    "“so",
    "” join",
    "“liquid",
    "” however",
    "water",
    "toga",
    "fabrics",
    "punch",
    "quiche",
    "“last",
    "gnats",
    "”)",
    "’ moves",
    "…”",
    "air hockey"
  ],
  "tyn_section":[

  ]
}