{
  "title":"How to Spray Paint the Gears of War Symbol",
  "url":"https://www.wikihow.com/Spray-Paint-the-Gears-of-War-Symbol",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Gears of War"
  ],
  "steps":[
    {
      "headline":"Put a coat or 2 of primer on whatever you are spray painting on and let that dry for the amount stated on the can.",
      "description":""
    },
    {
      "headline":"When the primer is completely dry, you can choose to either spray paint the background color, or the color of the picture, which ever you choose, put on as many coats as the can says, and let it dry for the amount of time stated on the can.",
      "description":""
    },
    {
      "headline":"If you decided to spray the background color first, you will have to mask the entire area, and cut out the gear and skull shape.",
      "description":"If you don't want to risk chipping the paint, you can get a sheet of thin cardboard, from a soda can box, and cut the shape out of that, place it on the area where you want and tape it down nice and tight so that the paint doesn't get underneath it. Spray several coats or however many the can says, and let it dry for the amount of time said on the can."
    },
    {
      "headline":"If you spray painted the picture's color first, you mask the shape of the picture where you want it on your project.",
      "description":"and then you just spray paint the entire project with the background color. apply as many coats as required, and let dry for the time stated on the can."
    },
    {
      "headline":"Take the masking of, and if you are pleased with your work, spray a couple of coats of clear coat on the project(or how many stated on can) let it dry for the amount of time stated on the can, and you are finished.",
      "description":""
    },
    {
      "headline":"But if you messed up something or you just don't like your results, you can just redo it by respray painting one of the colors, and starting from square one.",
      "description":""
    },
    {
      "headline":"Now you can put your finished(hopefully) project somewhere in your house, hang it up in your room, do whatever you want with it.",
      "description":"show it off to your friends among many other things."
    }
  ],
  "text":" Put a coat or 2 of primer on whatever you are spray painting on and let that dry for the amount stated on the can.  When the primer is completely dry, you can choose to either spray paint the background color, or the color of the picture, which ever you choose, put on as many coats as the can says, and let it dry for the amount of time stated on the can.  If you decided to spray the background color first, you will have to mask the entire area, and cut out the gear and skull shape. If you don't want to risk chipping the paint, you can get a sheet of thin cardboard, from a soda can box, and cut the shape out of that, place it on the area where you want and tape it down nice and tight so that the paint doesn't get underneath it. Spray several coats or however many the can says, and let it dry for the amount of time said on the can. If you spray painted the picture's color first, you mask the shape of the picture where you want it on your project. and then you just spray paint the entire project with the background color. apply as many coats as required, and let dry for the time stated on the can. Take the masking of, and if you are pleased with your work, spray a couple of coats of clear coat on the project(or how many stated on can) let it dry for the amount of time stated on the can, and you are finished.  But if you messed up something or you just don't like your results, you can just redo it by respray painting one of the colors, and starting from square one.  Now you can put your finished(hopefully) project somewhere in your house, hang it up in your room, do whatever you want with it. show it off to your friends among many other things.",
  "tyn_model":[
    "paint",
    "primer",
    "spray painting",
    "spray paint",
    "soda can",
    "spray painted",
    "clear coat",
    "respray"
  ],
  "tyn_section":[

  ]
}