{
  "title":"How to Make Pizza Burgers",
  "url":"https://www.wikihow.com/Make-Pizza-Burgers",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "steps":[
    {
      "headline":"Put all your ground meat into a big bowl and crack in one egg.",
      "description":""
    },
    {
      "headline":"Flavor your meat if you wish.",
      "description":"Experiment with seasonings and sauces, such as Goya seasoning or Lawry's meat seasoning, or a touch of sauce on it, like Ginger Soy Sauce or Worcestershire sauce, along with salt."
    },
    {
      "headline":"Mix everything together really good.",
      "description":""
    },
    {
      "headline":"Make your burger mix into 8 patties.",
      "description":""
    },
    {
      "headline":"Cook your burgers however you like.",
      "description":""
    },
    {
      "headline":"Take out your buns and separate the top halves from the bottom halves.",
      "description":""
    },
    {
      "headline":"Use a tablespoon to dish out 3 tablespoons (44.4 ml) of spaghetti sauce on each bun bottom.",
      "description":""
    },
    {
      "headline":"Put the cooked burgers on buns.",
      "description":"Then put three tablespoons shredded mozzarella on each burger. Put on the top buns."
    },
    {
      "headline":"Preheat the oven to 350 °F (177 °C) and put the burgers in, bun and all, for five minutes to melt cheese and warm sauce.",
      "description":"Take them out."
    },
    {
      "headline":"Enjoy.",
      "description":"You just made two popular dishes in one!"
    }
  ],
  "text":" Put all your ground meat into a big bowl and crack in one egg.  Flavor your meat if you wish. Experiment with seasonings and sauces, such as Goya seasoning or Lawry's meat seasoning, or a touch of sauce on it, like Ginger Soy Sauce or Worcestershire sauce, along with salt. Mix everything together really good.  Make your burger mix into 8 patties.  Cook your burgers however you like.  Take out your buns and separate the top halves from the bottom halves.  Use a tablespoon to dish out 3 tablespoons (44.4 ml) of spaghetti sauce on each bun bottom.  Put the cooked burgers on buns. Then put three tablespoons shredded mozzarella on each burger. Put on the top buns. Preheat the oven to 350 °F (177 °C) and put the burgers in, bun and all, for five minutes to melt cheese and warm sauce. Take them out. Enjoy. You just made two popular dishes in one!",
  "tyn_model":[
    "egg",
    "goya seasoning",
    "lawry's meat seasoning",
    "ginger soy sauce",
    "worcestershire sauce",
    "salt",
    "spaghetti sauce",
    "mozzarella",
    "oven",
    "cheese"
  ],
  "tyn_section":[

  ]
}