{
  "title":"How to Update the Xbox",
  "url":"https://www.wikihow.com/Update-the-Xbox",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox"
  ],
  "methods":[
    {
      "name":"Updating the Xbox One Manually",
      "steps":[
        {
          "headline":"Turn on your Xbox One.",
          "description":"To do so, you can press the Xbox button on the console itself, or you can hold down the Guide button on a connected controller. If you use the console's button, be sure to turn on a controller as well."
        },
        {
          "headline":"Press your controller's Guide button.",
          "description":"It's the Xbox logo in the middle of the controller. Doing so will prompt a pop-out window to appear on the left side of the screen."
        },
        {
          "headline":"Select the gear icon and press A.",
          "description":"This option is at the bottom of the pop-own menu."
        },
        {
          "headline":"Select System and press A.",
          "description":"It's a tab on the left side of the screen. If your Xbox One isn't connected to the Internet, first select and open Network, select and open Network settings, choose a wireless network, and press A to connect to it."
        },
        {
          "headline":"Select Updates and press A.",
          "description":"This will take you to the \"Updates\" page where you can select and install any recent updates."
        },
        {
          "headline":"Select Keep my console up to date and press A.",
          "description":"You should see a checkmark appear in the box to the right of \"date\". While optional, doing this will ensure that your Xbox One downloads the latest updates automatically, which will minimize the inconvenience of having an update cut into your playing time. If there's already a check in the \"Keep my console up to date\" box, your console is updating automatically."
        },
        {
          "headline":"Select Update console and press A.",
          "description":"Doing so will prompt the latest updates to begin downloading to your Xbox One.Your Xbox One may restart several times during this process."
        }
      ]
    },
    {
      "name":"Updating the Xbox 360 via Internet",
      "steps":[
        {
          "headline":"Turn on your Xbox 360.",
          "description":"You can do this by pressing the Power button on the Xbox 360 console, or you can press and hold the Guide button on a connected controller. If you use the Power button, be sure to turn on a controller as well."
        },
        {
          "headline":"Press the Guide button.",
          "description":"This is the Xbox logo in the middle of the controller."
        },
        {
          "headline":"Scroll over to the Settings page.",
          "description":"It's the far-right option in the guide. You can press RB or flick the analog stick right to scroll over."
        },
        {
          "headline":"Select System Settings and press A.",
          "description":"This will open the System Settings menu."
        },
        {
          "headline":"Select Network Settings and press A.",
          "description":"You'll find this option near the middle of the page."
        },
        {
          "headline":"Select your current network and press A.",
          "description":"The Network Settings menu should open to this network, but if not, first scroll left or right to find it."
        },
        {
          "headline":"Select Test Xbox Live Connection and press A.",
          "description":"This will prompt your console to test each aspect of your Internet connection. The process will likely take around a minute to complete."
        },
        {
          "headline":"Select Yes if prompted.",
          "description":"Doing so will begin downloading the current update to your console. If you aren't prompted to download an update, your console is up to date."
        }
      ]
    },
    {
      "name":"Updating the Xbox 360 via USB or CD",
      "steps":[
        {
          "headline":"Insert your flash drive or CD into your computer.",
          "description":"Flash drives plug into USB ports, which are rectangular slots likely found on the side(s) of your computer's housing; a CD, on the other hand, goes in your computer's CD slot. If you're using a CD, make sure it's a CD-RW (\"read-write\") rather than a CD-R (\"read only\"). If a blank window for your flash drive or CD pops up, leave it alone--you'll need to use it in a minute."
        },
        {
          "headline":"Download the Xbox update file for USB or CD.",
          "description":"You can do so from the Xbox website:\n\nUSB - Go to the following link to start your download: http://www.xbox.com/system-update-usb\n\n\nCD - Go to the following link to start your download: http://www.xbox.com/system-update-cd\n\nYou may first need to confirm the download or choose a save location before continuing."
        },
        {
          "headline":"Double-click the downloaded folder.",
          "description":"This will unzip it, allowing you to view its contents."
        },
        {
          "headline":"Copy the folder's contents.",
          "description":"To do so, select everything inside of the folder, then press Ctrl+C (PC) or ⌘ Command+C (Mac)."
        },
        {
          "headline":"Open your flash drive or CD.",
          "description":"If your flash drive or CD didn't prompt a window to pop up, you can open the respective storage option either by opening My PC and double-clicking the flash drive or CD icon at the bottom of the window (PC) or by opening Finder and clicking the flash drive or CD name in the left-hand pane (Mac)."
        },
        {
          "headline":"Paste the update folder's contents into your flash drive or CD.",
          "description":"To do so, simply click the white space in the flash drive's or CD's window and press Ctrl+V (PC) or ⌘ Command+V (Mac). Make sure you paste the contents in the main window of the flash drive or CD and not in a folder."
        },
        {
          "headline":"Turn on your Xbox 360.",
          "description":"You can do this by pressing the Power button on the Xbox 360 console, or you can press and hold the Guide button on a connected controller."
        },
        {
          "headline":"Insert your flash drive or disk.",
          "description":"The flash drive goes in one of the USB slots on the far-right side of the console's face, while the disk goes in the console's CD tray."
        },
        {
          "headline":"Turn your console off, then turn it back on.",
          "description":"Your update should be available in a pop-up window as soon as the console loads the Home screen. If you use the console's Power button to do this, be sure to turn on a controller as well."
        },
        {
          "headline":"Select Yes and press A.",
          "description":"This will prompt the update to begin."
        }
      ]
    }
  ],
  "text":" Updating the Xbox One Manually Turn on your Xbox One. To do so, you can press the Xbox button on the console itself, or you can hold down the Guide button on a connected controller. If you use the console's button, be sure to turn on a controller as well. Press your controller's Guide button. It's the Xbox logo in the middle of the controller. Doing so will prompt a pop-out window to appear on the left side of the screen. Select the gear icon and press A. This option is at the bottom of the pop-own menu. Select System and press A. It's a tab on the left side of the screen. If your Xbox One isn't connected to the Internet, first select and open Network, select and open Network settings, choose a wireless network, and press A to connect to it. Select Updates and press A. This will take you to the \"Updates\" page where you can select and install any recent updates. Select Keep my console up to date and press A. You should see a checkmark appear in the box to the right of \"date\". While optional, doing this will ensure that your Xbox One downloads the latest updates automatically, which will minimize the inconvenience of having an update cut into your playing time. If there's already a check in the \"Keep my console up to date\" box, your console is updating automatically. Select Update console and press A. Doing so will prompt the latest updates to begin downloading to your Xbox One.Your Xbox One may restart several times during this process. Updating the Xbox 360 via Internet Turn on your Xbox 360. You can do this by pressing the Power button on the Xbox 360 console, or you can press and hold the Guide button on a connected controller. If you use the Power button, be sure to turn on a controller as well. Press the Guide button. This is the Xbox logo in the middle of the controller. Scroll over to the Settings page. It's the far-right option in the guide. You can press RB or flick the analog stick right to scroll over. Select System Settings and press A. This will open the System Settings menu. Select Network Settings and press A. You'll find this option near the middle of the page. Select your current network and press A. The Network Settings menu should open to this network, but if not, first scroll left or right to find it. Select Test Xbox Live Connection and press A. This will prompt your console to test each aspect of your Internet connection. The process will likely take around a minute to complete. Select Yes if prompted. Doing so will begin downloading the current update to your console. If you aren't prompted to download an update, your console is up to date. Updating the Xbox 360 via USB or CD Insert your flash drive or CD into your computer. Flash drives plug into USB ports, which are rectangular slots likely found on the side(s) of your computer's housing; a CD, on the other hand, goes in your computer's CD slot. If you're using a CD, make sure it's a CD-RW (\"read-write\") rather than a CD-R (\"read only\"). If a blank window for your flash drive or CD pops up, leave it alone--you'll need to use it in a minute. Download the Xbox update file for USB or CD. You can do so from the Xbox website:\n\nUSB - Go to the following link to start your download: http://www.xbox.com/system-update-usb\n\n\nCD - Go to the following link to start your download: http://www.xbox.com/system-update-cd\n\nYou may first need to confirm the download or choose a save location before continuing. Double-click the downloaded folder. This will unzip it, allowing you to view its contents. Copy the folder's contents. To do so, select everything inside of the folder, then press Ctrl+C (PC) or ⌘ Command+C (Mac). Open your flash drive or CD. If your flash drive or CD didn't prompt a window to pop up, you can open the respective storage option either by opening My PC and double-clicking the flash drive or CD icon at the bottom of the window (PC) or by opening Finder and clicking the flash drive or CD name in the left-hand pane (Mac). Paste the update folder's contents into your flash drive or CD. To do so, simply click the white space in the flash drive's or CD's window and press Ctrl+V (PC) or ⌘ Command+V (Mac). Make sure you paste the contents in the main window of the flash drive or CD and not in a folder. Turn on your Xbox 360. You can do this by pressing the Power button on the Xbox 360 console, or you can press and hold the Guide button on a connected controller. Insert your flash drive or disk. The flash drive goes in one of the USB slots on the far-right side of the console's face, while the disk goes in the console's CD tray. Turn your console off, then turn it back on. Your update should be available in a pop-up window as soon as the console loads the Home screen. If you use the console's Power button to do this, be sure to turn on a controller as well. Select Yes and press A. This will prompt the update to begin.",
  "tyn_model":[
    "flash drive",
    "xbox one",
    "xbox 360",
    "cd",
    "controller",
    "usb",
    "xbox live connection",
    "flash drives",
    "⌘ command+c",
    "finder",
    "⌘ command+v",
    "disk",
    "console"
  ],
  "tyn_section":[

  ]
}