{
  "title":"How to Sync GBA4iOS with Dropbox",
  "url":"https://www.wikihow.com/Sync-GBA4iOS-with-Dropbox",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Emulators and Roms"
  ],
  "parts":[
    {
      "name":"Set Up and Install GBA4iOS",
      "steps":[
        {
          "headline":"Go to your iOS device’s settings.",
          "description":""
        },
        {
          "headline":"Change the Date & Time.",
          "description":"Under the \"General\" tab, go to Date and Time and change the date to 18th February, 2014. If you don’t do this, then the GBA4iOS will NOT work."
        },
        {
          "headline":"Download GBA4iOS from http://gba4iosapp.com/download/",
          "description":""
        },
        {
          "headline":"Download version 2.0.1 if you are running iOS 7 on your device.",
          "description":"Download version 1.6.2 if you are on iOS 6 or earlier."
        },
        {
          "headline":"Open the app.",
          "description":"After downloading the app, you will be asked to open it."
        }
      ]
    },
    {
      "name":"Set Dropbox with GBA4iOS",
      "steps":[
        {
          "headline":"Tap the + logo.",
          "description":"When you open GBA4iOS, you will be able to see a plus (+) sign at the top left of your device."
        },
        {
          "headline":"Choose a game.",
          "description":"When you tap the plus logo, it will take you to the games library. You can pick any gaming title you like (whichever ones appear on the list, that is)."
        },
        {
          "headline":"Save to Dropbox.",
          "description":"Now, you will be able to view several options; one of them will be the \"Save to Dropbox.\" After you press on this option, it will ask you to enter your Dropbox details after opening a new window."
        },
        {
          "headline":"Enter your Dropbox details.",
          "description":"The game will be saved in the new Dropbox windows after you have entered the correct details."
        },
        {
          "headline":"Download.",
          "description":"Selecting \"Download Now\" will force the program to download the title directly to your iOS device and display it on the left panel."
        }
      ]
    },
    {
      "name":"Sync Dropbox with GBA4iOS",
      "steps":[
        {
          "headline":"Go to your GBA4iOS application.",
          "description":"If you want to use Dropbox for Sync, then press the settings gear icon located at the top left of your device."
        },
        {
          "headline":"Keep scrolling down until you see the option to enable Dropbox Sync.",
          "description":""
        },
        {
          "headline":"Enter email address & password.",
          "description":"The application will ask you to enter your email address and password for confirmation. After entering your security credentials, all you have to do is press \"Sign In\" and afterwards, it will start displaying that Dropbox Sync has been enabled."
        },
        {
          "headline":"View GBA4iOS folder.",
          "description":"Now that you proceed forward and open your Dropbox, you will clearly be able to view a folder labelled GBA4iOS. The GBA4iOS folder will have all the gaming titles present in it."
        }
      ]
    }
  ],
  "text":" Set Up and Install GBA4iOS Go to your iOS device’s settings.  Change the Date & Time. Under the \"General\" tab, go to Date and Time and change the date to 18th February, 2014. If you don’t do this, then the GBA4iOS will NOT work. Download GBA4iOS from http://gba4iosapp.com/download/  Download version 2.0.1 if you are running iOS 7 on your device. Download version 1.6.2 if you are on iOS 6 or earlier. Open the app. After downloading the app, you will be asked to open it. Set Dropbox with GBA4iOS Tap the + logo. When you open GBA4iOS, you will be able to see a plus (+) sign at the top left of your device. Choose a game. When you tap the plus logo, it will take you to the games library. You can pick any gaming title you like (whichever ones appear on the list, that is). Save to Dropbox. Now, you will be able to view several options; one of them will be the \"Save to Dropbox.\" After you press on this option, it will ask you to enter your Dropbox details after opening a new window. Enter your Dropbox details. The game will be saved in the new Dropbox windows after you have entered the correct details. Download. Selecting \"Download Now\" will force the program to download the title directly to your iOS device and display it on the left panel. Sync Dropbox with GBA4iOS Go to your GBA4iOS application. If you want to use Dropbox for Sync, then press the settings gear icon located at the top left of your device. Keep scrolling down until you see the option to enable Dropbox Sync.  Enter email address & password. The application will ask you to enter your email address and password for confirmation. After entering your security credentials, all you have to do is press \"Sign In\" and afterwards, it will start displaying that Dropbox Sync has been enabled. View GBA4iOS folder. Now that you proceed forward and open your Dropbox, you will clearly be able to view a folder labelled GBA4iOS. The GBA4iOS folder will have all the gaming titles present in it.",
  "tyn_model":[
    "dropbox",
    "dropbox sync",
    "ios device",
    "dropbox details"
  ],
  "tyn_section":[

  ]
}