{
  "title":"How to Enjoy Spicy Foods",
  "url":"https://www.wikihow.com/Enjoy-Spicy-Foods",
  "category_hierarchy":[
    "Food and Entertaining",
    "Appreciation of Food"
  ],
  "methods":[
    {
      "name":"Increasing Your Tolerance to Spicy Food",
      "steps":[
        {
          "headline":"Start by adding mild spices to your food.",
          "description":"If you're not used to eating a lot of spice, it's best to start off by introducing just a little heat at a time to the dishes you're eating. Sprinkle a little cracked black pepper over the top of a baked potato, for instance, or add a few drops of hot sauce to the ketchup you're using for your fries. If you do this regularly, your palate will get used to a little heat, which may make it easier for you to tackle really spicy foods later on. Mild chillies like poblano or banana peppers are another great way to experiment with heat. Try adding them to soups, stews, tacos, casseroles, and other dishes. You can also add a spicy sauce alongside a mild dish. That way, you can control the heat as you're eating. Did You Know? The Scoville scale measures the capsaicin in chili peppers, or the substance that makes them hot. Bell pepper is a 0 on the Scoville scale, while the Carolina Reaper is 1,500,000 units. However, black pepper gets its heat from the compound piperine, so it's not measured on the Scoville scale."
        },
        {
          "headline":"Add one spice at a time to your food.",
          "description":"If you start mixing spices together, you might not be able to pick out which flavors you like the best. Instead, try just adding one heat source at a time to your food. Once you familiarize yourself with the subtle smoky, earthy, nutty, or even sweet flavors contained in different spices, you can start experimenting with combining them in your dishes. Using mild heat is a great way to start learning the flavors of different peppers, since your tastebuds won't be overwhelmed by a burning sensation. If you're really committed to embracing spicy flavors, you might even want to write down your experiences in a notebook or a note app on your phone. That way, you'll remember which spices you liked or didn't like."
        },
        {
          "headline":"Eat spicy foods slowly.",
          "description":"When you sit down to a dish with a lot of heat, try to take your time while you're eating. While it might seem like it will be easier if you eat the whole thing as fast as possible, this will cause your body to have a stronger reaction to the spice. By eating slowly, you can keep the heat at a more tolerable level. Eating slowly will also give you time to sip something cold or nibble on something else between bites of the hotter dish."
        },
        {
          "headline":"Gradually increase the spice level as you get more comfortable.",
          "description":"Once you find that you can tolerate mild spices, start pushing yourself to try hotter foods. Add in seeded, chopped chillies to your dishes, such as jalapenos and serrano peppers. The more often you eat them, the more comfortable you'll become. Over time, you might even find that you miss the heat when you eat a non-spicy dish! Spicy chips and other snacks can be a good way to push yourself to try hotter foods! They may burn your mouth, but the addictive crunch will often have you coming back for more. Don't force yourself to eat foods that are uncomfortably spicy if you don't want to. However, if you really want to push your tolerance, don't be afraid to take on something a little too hot once in a while. Keep in mind that the heat will fade, and just have fun with the challenge!"
        },
        {
          "headline":"Focus on the other flavors of the food.",
          "description":"Even if your mouth is burning, try to turn your attention to a different flavor in the dish that you're eating. For instance, if you're eating a cheeseburger with jalapenos on top, try to focus on the flavor of the beef or the cheese, instead. That can help distract you as you adjust to the heat level. If you're dining out and you order a spicy dish, try to identify as many different flavors and ingredients while you're eating as you can. For instance, if you're eating a spicy Thai soup, you might try to detect ginger, lemongrass, Thai basil, mint, or other ingredients that are common in that cuisine."
        }
      ]
    },
    {
      "name":"Staying Cool While You Eat",
      "steps":[
        {
          "headline":"Enjoy an ice-cold drink while you're eating hot foods.",
          "description":"If you know you'll be eating something that has more spice than you're used to, make sure you have a nice cold beverage on hand, and don't be afraid to refill your drink if you need to. Cold drinks numb your mouth slightly when you drink them, which helps ease the burn from eating something spicy. Milk is especially great for cooling your mouth after you eat chili peppers. The high fat content in milk helps wash away the capsaicin better than just water will. If you're old enough to drink, the alcohol in beer can also help ease the burn."
        },
        {
          "headline":"Add dairy to the meal to cool it off.",
          "description":"Just like milk can cool off your mouth, dairy is an effective way to cool off a dish that's a little too spicy. Try adding a dollop of sour cream or yogurt to your plate to help balance the spice and make the dish more enjoyable. If you don't eat dairy, you can use coconut milk in your dish instead. Citrus flavors and cooling herbs like mint and cilantro may also help ease the heat of a spicy food."
        },
        {
          "headline":"Pair your dish with food that's high in carbs.",
          "description":"Crackers, bread, and rice are all great ways to help spread out concentrated spices. This can make the dish more manageable for you, allowing you to enjoy the subtle flavors of the food, rather than just being overwhelmed by spice. The starch may help absorb some of the spicy components in the food, while the rough texture can help distract your tastebuds from the heat."
        },
        {
          "headline":"Wait about 15 minutes for the heat to fade.",
          "description":"If you eat something that's just way too hot and it leaves your mouth burning, try not to panic. The effects of spicy food typically only last for about 15 minutes, so if you're patient, it will fade. While the heat is fading, keep reminding yourself that this experience will help you be more able to tolerate spicy foods in the future."
        }
      ]
    }
  ],
  "text":" Increasing Your Tolerance to Spicy Food Start by adding mild spices to your food. If you're not used to eating a lot of spice, it's best to start off by introducing just a little heat at a time to the dishes you're eating. Sprinkle a little cracked black pepper over the top of a baked potato, for instance, or add a few drops of hot sauce to the ketchup you're using for your fries. If you do this regularly, your palate will get used to a little heat, which may make it easier for you to tackle really spicy foods later on. Mild chillies like poblano or banana peppers are another great way to experiment with heat. Try adding them to soups, stews, tacos, casseroles, and other dishes. You can also add a spicy sauce alongside a mild dish. That way, you can control the heat as you're eating. Did You Know? The Scoville scale measures the capsaicin in chili peppers, or the substance that makes them hot. Bell pepper is a 0 on the Scoville scale, while the Carolina Reaper is 1,500,000 units. However, black pepper gets its heat from the compound piperine, so it's not measured on the Scoville scale. Add one spice at a time to your food. If you start mixing spices together, you might not be able to pick out which flavors you like the best. Instead, try just adding one heat source at a time to your food. Once you familiarize yourself with the subtle smoky, earthy, nutty, or even sweet flavors contained in different spices, you can start experimenting with combining them in your dishes. Using mild heat is a great way to start learning the flavors of different peppers, since your tastebuds won't be overwhelmed by a burning sensation. If you're really committed to embracing spicy flavors, you might even want to write down your experiences in a notebook or a note app on your phone. That way, you'll remember which spices you liked or didn't like. Eat spicy foods slowly. When you sit down to a dish with a lot of heat, try to take your time while you're eating. While it might seem like it will be easier if you eat the whole thing as fast as possible, this will cause your body to have a stronger reaction to the spice. By eating slowly, you can keep the heat at a more tolerable level. Eating slowly will also give you time to sip something cold or nibble on something else between bites of the hotter dish. Gradually increase the spice level as you get more comfortable. Once you find that you can tolerate mild spices, start pushing yourself to try hotter foods. Add in seeded, chopped chillies to your dishes, such as jalapenos and serrano peppers. The more often you eat them, the more comfortable you'll become. Over time, you might even find that you miss the heat when you eat a non-spicy dish! Spicy chips and other snacks can be a good way to push yourself to try hotter foods! They may burn your mouth, but the addictive crunch will often have you coming back for more. Don't force yourself to eat foods that are uncomfortably spicy if you don't want to. However, if you really want to push your tolerance, don't be afraid to take on something a little too hot once in a while. Keep in mind that the heat will fade, and just have fun with the challenge! Focus on the other flavors of the food. Even if your mouth is burning, try to turn your attention to a different flavor in the dish that you're eating. For instance, if you're eating a cheeseburger with jalapenos on top, try to focus on the flavor of the beef or the cheese, instead. That can help distract you as you adjust to the heat level. If you're dining out and you order a spicy dish, try to identify as many different flavors and ingredients while you're eating as you can. For instance, if you're eating a spicy Thai soup, you might try to detect ginger, lemongrass, Thai basil, mint, or other ingredients that are common in that cuisine. Staying Cool While You Eat Enjoy an ice-cold drink while you're eating hot foods. If you know you'll be eating something that has more spice than you're used to, make sure you have a nice cold beverage on hand, and don't be afraid to refill your drink if you need to. Cold drinks numb your mouth slightly when you drink them, which helps ease the burn from eating something spicy. Milk is especially great for cooling your mouth after you eat chili peppers. The high fat content in milk helps wash away the capsaicin better than just water will. If you're old enough to drink, the alcohol in beer can also help ease the burn. Add dairy to the meal to cool it off. Just like milk can cool off your mouth, dairy is an effective way to cool off a dish that's a little too spicy. Try adding a dollop of sour cream or yogurt to your plate to help balance the spice and make the dish more enjoyable. If you don't eat dairy, you can use coconut milk in your dish instead. Citrus flavors and cooling herbs like mint and cilantro may also help ease the heat of a spicy food. Pair your dish with food that's high in carbs. Crackers, bread, and rice are all great ways to help spread out concentrated spices. This can make the dish more manageable for you, allowing you to enjoy the subtle flavors of the food, rather than just being overwhelmed by spice. The starch may help absorb some of the spicy components in the food, while the rough texture can help distract your tastebuds from the heat. Wait about 15 minutes for the heat to fade. If you eat something that's just way too hot and it leaves your mouth burning, try not to panic. The effects of spicy food typically only last for about 15 minutes, so if you're patient, it will fade. While the heat is fading, keep reminding yourself that this experience will help you be more able to tolerate spicy foods in the future.",
  "tyn_model":[
    "spices",
    "milk",
    "jalapenos",
    "cracked black pepper",
    "baked potato",
    "hot sauce",
    "ketchup",
    "capsaicin",
    "chili peppers",
    "bell pepper",
    "carolina reaper",
    "black pepper",
    "peppers",
    "chillies",
    "serrano peppers",
    "ginger",
    "lemongrass",
    "thai basil",
    "mint",
    "ice-cold drink",
    "water",
    "beer",
    "dairy",
    "sour cream",
    "yogurt",
    "coconut milk",
    "crackers",
    "bread",
    "rice",
    "starch"
  ],
  "tyn_section":[

  ]
}