{
  "title":"How to Make Prawn Cream Curry",
  "url":"https://www.wikihow.com/Make-Prawn-Cream-Curry",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Prawns and Shrimp"
  ],
  "steps":[
    {
      "headline":"Pare the shells and wash the prawns.",
      "description":""
    },
    {
      "headline":"Mix salt, garlic paste, cumin paste and red chili powder in it.",
      "description":"Marinade."
    },
    {
      "headline":"Put your pan on burner.",
      "description":"Put oil in it."
    },
    {
      "headline":"Add onion.",
      "description":"Fry it until it becomes golden color."
    },
    {
      "headline":"Add marinated prawn.",
      "description":""
    },
    {
      "headline":"Stir it until the prawn becomes fried and red in color.",
      "description":""
    },
    {
      "headline":"Add ½ cup water.",
      "description":""
    },
    {
      "headline":"When the curry becomes thick, add cinnamon and cardamom powder (combined) and the nut paste.",
      "description":"Stir."
    },
    {
      "headline":"Add coconut milk and fresh cream when the curry is becoming fried.",
      "description":""
    },
    {
      "headline":"After 5-7 minute, the oil will be visible over the curry.",
      "description":"Add lemon juice and pull it from the burner."
    },
    {
      "headline":"Serve hot prawn cream curry with paratha, bread, or rice.",
      "description":""
    }
  ],
  "text":" Pare the shells and wash the prawns.  Mix salt, garlic paste, cumin paste and red chili powder in it. Marinade. Put your pan on burner. Put oil in it. Add onion. Fry it until it becomes golden color. Add marinated prawn.  Stir it until the prawn becomes fried and red in color.  Add ½ cup water.  When the curry becomes thick, add cinnamon and cardamom powder (combined) and the nut paste. Stir. Add coconut milk and fresh cream when the curry is becoming fried.  After 5-7 minute, the oil will be visible over the curry. Add lemon juice and pull it from the burner. Serve hot prawn cream curry with paratha, bread, or rice. ",
  "tyn_model":[
    "oil",
    "salt",
    "garlic paste",
    "cumin paste",
    "red chili powder",
    "marinade",
    "pan",
    "onion",
    "water",
    "cinnamon",
    "cardamom powder",
    "nut paste",
    "coconut milk",
    "fresh cream",
    "lemon juice",
    "prawn cream curry",
    "rice"
  ],
  "tyn_section":[

  ]
}