{
  "title":"How to Clean Your Bedroom in Sections",
  "url":"https://www.wikihow.com/Clean-Your-Bedroom-in-Sections",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "methods":[
    {
      "name":"Preparing to Clean",
      "steps":[
        {
          "headline":"Put on comfortable clothes.",
          "description":"Comfy clothing will feel much less restricting, and therefore better when working in a space for thirty minutes or more. If you feel cut off from moving, you're more likely to become agitated or upset. Scientific studies show that tight or restricting clothing can caused mood swings."
        },
        {
          "headline":"Set some music.",
          "description":"Whether you want to feel relaxed with some classical melodies or rock out and feel great with EDM tunes, go for it. Whatever you feel most comfortable and/or most effective listening to whilst cleaning your bedroom, set it up\nIf you don't have a ton of music, look for a free playlist on your computer to play. You can also use the free apps Spotify, Pandora, or iHeartRadio on a mobile device."
        },
        {
          "headline":"Set up your supplies.",
          "description":"You'll most likely be less frustrated if you have everything at the palm of your hand and reader to go. Leave the items in your door frame or in another easily-accessible arena. A duster, a can of Pledge (or another brand of wood protector), antibacterial wipes, a bottle of window cleaner, and a microfiber (or otherwise soft) cloth are all good basics to hit. If you don't already have them in your room, grab a trash bin and a hamper/dirty clothing bucket."
        }
      ]
    },
    {
      "name":"Cleaning Your Dresser",
      "steps":[
        {
          "headline":"Remove everything off of the top of your dresser.",
          "description":"Empty any containers or bags you have, and leave them off to the side in a separate pile. Make sure the containers have their very own pile for the dresser."
        },
        {
          "headline":"Label your containers.",
          "description":"Even if it takes a while, choose what types of items (i.e. folders, magazines, etc.) you wish to keep in the containers. Write the use on a sticky note and press it onto the container. This will make things easier to remember later on."
        },
        {
          "headline":"Separate the cluttered pile into different piles.",
          "description":"Have at least the main three: keep, recycle, and throw away. Put everything into its according stash. Label them with sticky notes if you find it necessary. Keep the mounds a good distance away from each other. This way, nothing will fall or stray away into the wrong clutter."
        },
        {
          "headline":"Grab three bags.",
          "description":"Push your keep pile away from the others, and then label the different bags (paper ones work best; you can  also use small bins or containers) as so: donate, recycle, throw away. Go through your recycling and trash piles and pick out nice or salvageable things to donate to those in need. In the end, you can put the rest of the things into their according bags or bins. Donating is one of the best ways to feel fantastic about cleaning your room. Not only are you getting an organised, fresh room, but you know that your things will go to a person who needs them."
        },
        {
          "headline":"Separate your kept items into decorations and other things.",
          "description":"Set up decorations how you wish on the top of your dresser. Finally, scoop the rest of your things near the containers. We'll work with those items later."
        }
      ]
    }
  ],
  "text":" Preparing to Clean Put on comfortable clothes. Comfy clothing will feel much less restricting, and therefore better when working in a space for thirty minutes or more. If you feel cut off from moving, you're more likely to become agitated or upset. Scientific studies show that tight or restricting clothing can caused mood swings. Set some music. Whether you want to feel relaxed with some classical melodies or rock out and feel great with EDM tunes, go for it. Whatever you feel most comfortable and/or most effective listening to whilst cleaning your bedroom, set it up\nIf you don't have a ton of music, look for a free playlist on your computer to play. You can also use the free apps Spotify, Pandora, or iHeartRadio on a mobile device. Set up your supplies. You'll most likely be less frustrated if you have everything at the palm of your hand and reader to go. Leave the items in your door frame or in another easily-accessible arena. A duster, a can of Pledge (or another brand of wood protector), antibacterial wipes, a bottle of window cleaner, and a microfiber (or otherwise soft) cloth are all good basics to hit. If you don't already have them in your room, grab a trash bin and a hamper/dirty clothing bucket. Cleaning Your Dresser Remove everything off of the top of your dresser. Empty any containers or bags you have, and leave them off to the side in a separate pile. Make sure the containers have their very own pile for the dresser. Label your containers. Even if it takes a while, choose what types of items (i.e. folders, magazines, etc.) you wish to keep in the containers. Write the use on a sticky note and press it onto the container. This will make things easier to remember later on. Separate the cluttered pile into different piles. Have at least the main three: keep, recycle, and throw away. Put everything into its according stash. Label them with sticky notes if you find it necessary. Keep the mounds a good distance away from each other. This way, nothing will fall or stray away into the wrong clutter. Grab three bags. Push your keep pile away from the others, and then label the different bags (paper ones work best; you can  also use small bins or containers) as so: donate, recycle, throw away. Go through your recycling and trash piles and pick out nice or salvageable things to donate to those in need. In the end, you can put the rest of the things into their according bags or bins. Donating is one of the best ways to feel fantastic about cleaning your room. Not only are you getting an organised, fresh room, but you know that your things will go to a person who needs them. Separate your kept items into decorations and other things. Set up decorations how you wish on the top of your dresser. Finally, scoop the rest of your things near the containers. We'll work with those items later.",
  "tyn_model":[
    "containers",
    "decorations",
    "music",
    "duster",
    "pledge",
    "wood protector",
    "antibacterial wipes",
    "window cleaner",
    "microfiber (",
    "trash bin",
    "hamper/dirty clothing bucket",
    "sticky note",
    "container",
    "sticky notes"
  ],
  "tyn_section":[

  ]
}