{
  "title":"How to Play Anomia",
  "url":"https://www.wikihow.com/Play-Anomia",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "methods":[
    {
      "name":"Setting Up the Game",
      "steps":[
        {
          "headline":"Choose between the red deck and the blue deck.",
          "description":"Anomia comes with two different playing decks. The red deck is a bit more advanced than the blue deck, so it's best to start playing with the blue one. Move to the red deck if you and your friends want more of a challenge. There is also a special party version of Anomia with six decks and more categories to make things interesting. Decide with your friends which deck appeals to you the most."
        },
        {
          "headline":"Shuffle the deck and split it.",
          "description":"You should shuffle the playing deck about five or six times. Split the deck in two as evenly as possible. Place the two decks face-down on the playing table. Draw from either deck during the game. There should be two draw piles so that everyone at the table can reach one from their seat."
        },
        {
          "headline":"Draw cards to see which player will go first.",
          "description":"Each player should draw a card and throw it down on the table, face-up, without looking at it first. Watch the cards that other players flip up and look for a symbol on an opponent's card that matches your own. As soon as you do, shout out an example of the person, place, or thing on their card. Whoever does this correctly first \"wins\" the card away from the other player. The person who gains the most cards during this pre-game wins, and gets to keep the cards with them during the actual game. As a general rule, the person who shuffles the cards should draw the first card."
        },
        {
          "headline":"Vote on whether or not to follow the \"no repeats\" rule.",
          "description":"An optional rule of Anomia is that the same answer can't be repeated for different face offs. If you give an example for one opponent's card, no players can repeat that same example for the rest of the game. It's important to discuss this option or have a vote between players before the game starts."
        }
      ]
    },
    {
      "name":"Playing the Game",
      "steps":[
        {
          "headline":"Draw and reveal a card.",
          "description":"Pick up a card from the deck at the center of the table. Flip it upwards quickly as you place it down so everyone can see it. Don't look at your card before you put it down. According to the game instructions, the person who shuffles the cards should go first. Put the card face-up in front of you. This is the beginning of your play pile. If you draw a card and the symbol on it doesn't match the symbols on any active cards, it is the next player's turn to draw."
        },
        {
          "headline":"Watch for a symbol that matches the one on your card.",
          "description":"Going in a clockwise direction around the table, have players draw cards one-at-a-time. Keep a close eye on each card that gets flipped up on the table. Be ready to think fast! If the symbol on your card matches another player's, you now have to \"face off\" with your opponent."
        },
        {
          "headline":"Name an example of the category on your opponent's card.",
          "description":"As soon as you recognize your own symbol on someone else's card, read the category listed on it. Think fast and name an example of that category as fast as you can. To keep you on your toes, your opponent will be doing the same thing with your card. For instance, if your opponent's card says \"Canadian city\", you might yell out \"Edmonton!\""
        },
        {
          "headline":"Collect your opponent's card if you answer first and correctly.",
          "description":"If you blurt out a correct example of the person, place or thing on your opponent's card before they come up with one for yours, you win the \"face off\" round. Collect your opponent's card. Place it face down in a \"win\" pile next to your play pile. If you won the pre-game round, the cards you won then will also be in your \"win\" pile."
        },
        {
          "headline":"Start a cascade round if the loser's next play card has a matching symbol.",
          "description":"A cascade round occurs if the loser's next card has a matching symbol to any other player's. Launch into a new face-off immediately if there is a symbol match. The cascade round only ends when no cards with matching symbols are face up on the table. After all face-offs and cascades are over, resume normal game play."
        },
        {
          "headline":"Place wild cards between the two play piles.",
          "description":"Each Anomia deck has eight wild cards, each with two symbols on them. When a wild card is drawn during the game, put it in between the two draw piles. If the two wild card symbols appear on cards topping any two player's play piles, start another face-off round. If you draw a wild card, you're allowed to pick up another card after any face off rounds are done. Once a wild card is drawn, it stays in play until another wild card comes up to replace it. As game play continues, any two players with a card with the wild card's symbols must launch into a face off round."
        },
        {
          "headline":"Do a tie-breaker if two players tie during a face off.",
          "description":"In the event of a tie between you and another player, a third player should draw a card and flip it up onto the table. You and your opponent must both try to give an answer for that card. Whoever wins this tie breaker gets the loser's original card, and the tie breaker card gets shuffled back into a play deck."
        },
        {
          "headline":"Count the cards in your \"win\" pile once the draw piles are empty.",
          "description":"Play Anomia until the two draw piles are empty. At this point, count the cards in your \"win\" pile. Whoever has the most cards wins."
        }
      ]
    }
  ],
  "text":" Setting Up the Game Choose between the red deck and the blue deck. Anomia comes with two different playing decks. The red deck is a bit more advanced than the blue deck, so it's best to start playing with the blue one. Move to the red deck if you and your friends want more of a challenge. There is also a special party version of Anomia with six decks and more categories to make things interesting. Decide with your friends which deck appeals to you the most. Shuffle the deck and split it. You should shuffle the playing deck about five or six times. Split the deck in two as evenly as possible. Place the two decks face-down on the playing table. Draw from either deck during the game. There should be two draw piles so that everyone at the table can reach one from their seat. Draw cards to see which player will go first. Each player should draw a card and throw it down on the table, face-up, without looking at it first. Watch the cards that other players flip up and look for a symbol on an opponent's card that matches your own. As soon as you do, shout out an example of the person, place, or thing on their card. Whoever does this correctly first \"wins\" the card away from the other player. The person who gains the most cards during this pre-game wins, and gets to keep the cards with them during the actual game. As a general rule, the person who shuffles the cards should draw the first card. Vote on whether or not to follow the \"no repeats\" rule. An optional rule of Anomia is that the same answer can't be repeated for different face offs. If you give an example for one opponent's card, no players can repeat that same example for the rest of the game. It's important to discuss this option or have a vote between players before the game starts. Playing the Game Draw and reveal a card. Pick up a card from the deck at the center of the table. Flip it upwards quickly as you place it down so everyone can see it. Don't look at your card before you put it down. According to the game instructions, the person who shuffles the cards should go first. Put the card face-up in front of you. This is the beginning of your play pile. If you draw a card and the symbol on it doesn't match the symbols on any active cards, it is the next player's turn to draw. Watch for a symbol that matches the one on your card. Going in a clockwise direction around the table, have players draw cards one-at-a-time. Keep a close eye on each card that gets flipped up on the table. Be ready to think fast! If the symbol on your card matches another player's, you now have to \"face off\" with your opponent. Name an example of the category on your opponent's card. As soon as you recognize your own symbol on someone else's card, read the category listed on it. Think fast and name an example of that category as fast as you can. To keep you on your toes, your opponent will be doing the same thing with your card. For instance, if your opponent's card says \"Canadian city\", you might yell out \"Edmonton!\" Collect your opponent's card if you answer first and correctly. If you blurt out a correct example of the person, place or thing on your opponent's card before they come up with one for yours, you win the \"face off\" round. Collect your opponent's card. Place it face down in a \"win\" pile next to your play pile. If you won the pre-game round, the cards you won then will also be in your \"win\" pile. Start a cascade round if the loser's next play card has a matching symbol. A cascade round occurs if the loser's next card has a matching symbol to any other player's. Launch into a new face-off immediately if there is a symbol match. The cascade round only ends when no cards with matching symbols are face up on the table. After all face-offs and cascades are over, resume normal game play. Place wild cards between the two play piles. Each Anomia deck has eight wild cards, each with two symbols on them. When a wild card is drawn during the game, put it in between the two draw piles. If the two wild card symbols appear on cards topping any two player's play piles, start another face-off round. If you draw a wild card, you're allowed to pick up another card after any face off rounds are done. Once a wild card is drawn, it stays in play until another wild card comes up to replace it. As game play continues, any two players with a card with the wild card's symbols must launch into a face off round. Do a tie-breaker if two players tie during a face off. In the event of a tie between you and another player, a third player should draw a card and flip it up onto the table. You and your opponent must both try to give an answer for that card. Whoever wins this tie breaker gets the loser's original card, and the tie breaker card gets shuffled back into a play deck. Count the cards in your \"win\" pile once the draw piles are empty. Play Anomia until the two draw piles are empty. At this point, count the cards in your \"win\" pile. Whoever has the most cards wins.",
  "tyn_model":[
    "anomia",
    "cards",
    "card"
  ],
  "tyn_section":[

  ]
}