{
  "title":"How to Paint Miniatures",
  "url":"https://www.wikihow.com/Paint-Miniatures",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Wargaming"
  ],
  "methods":[
    {
      "name":"Preparing to Paint Your Miniature",
      "steps":[
        {
          "headline":"Gather your supplies.",
          "description":"First you need a comfortable and well lit work area. You also should have hobby knives, a small file set, fingernail filing boards, super glue, a clean pot of water, and a paint set."
        },
        {
          "headline":"Clean your miniature.",
          "description":"When miniatures are cast a release agent is applied to them. This is an oily or powdery substance that needs to be removed before you start painting. Wash with warm soapy water to clean off any mold release on the model. Let the miniature dry."
        },
        {
          "headline":"Remove mold lines.",
          "description":"Now using the hobby knife, trim away any mold flash. That's the extra material around the model that will make a thin line sticking to the miniature horizontally. When the two halves of the miniature are connected in the casting process, this line is often left behind. You should use your knife to remove any other irregularities on the miniature at this point. Oftentimes the extremities have points or bubbles that shouldn’t be there. Use short strokes of the knife to remove the mold lines. Try not to damage the miniature, just swipe off any excess material or bubbles. The irregularities should be pretty obvious."
        },
        {
          "headline":"Assemble.",
          "description":"Some miniatures have extra parts that need to be assembled, such as a sword or shield. This can be the hardest part. Small parts like hands, small weapons, antennas and other pieces can be glued with a simple tube of superglue. Larger metal pieces may need to be pinned. Pinning requires drilling a hole in each end of the hand or wherever you are attaching the metal piece. Then you need to string a small piece of hard wire through the hole and connect the wire to the metal piece. Then glue together everything with a superglue or a two part epoxy for stronger hold."
        }
      ]
    },
    {
      "name":"Priming and Attaching Your Base",
      "steps":[
        {
          "headline":"Use an appropriate amount of white primer.",
          "description":"Depending on how many details your miniature has you might want to use less or more primer. The more primer you use, the more your colors will pop once you start painting. However, if you use too much primer you’ll also fill in some smaller details of the miniature accidentally.."
        },
        {
          "headline":"Begin priming.",
          "description":"For colorful models prime with a white primer. If you’re painting a darker model you can try to prime with black or gray. Remember two or three thin coats are better than a thick coat that might fill in details. Let the model dry between coats. In general, use a white primer. This will allow your colors to pop once you start painting your miniature."
        },
        {
          "headline":"Buy or find your base.",
          "description":"Most miniatures come with a separate base. If the base is part of the entire miniature that normally means the miniature will be unstable and tip over. You want a stable base, especially if you plan to use your miniature for board games. You can buy a separate base online or at a craft shop. You don't need to remove the base of your miniature if it came with one, just attach it to a larger base. Bases that are already connected to a miniature are usually quite small."
        },
        {
          "headline":"Attach your base using high quality super glue.",
          "description":"Thick consistency crazy glue is recommended because it can fill in the small gaps between the miniature and the base. Avoid putting it in area where it will obscure details. Consider buying a super glue accelerant at a hobby shop to make this process faster. Not having to wait is a huge help."
        }
      ]
    },
    {
      "name":"Painting Your Miniature",
      "steps":[
        {
          "headline":"Choose your color scheme.",
          "description":"This is where a color wheel will come in handy. Choose primary colors that you think match your miniature, and then mix the primary colors in equal proportion to get secondary colors. Choose complementary color pairings - these are colors that lie directly across from each other on the color wheel. Avoid using too many colors. If you're painting historical miniatures it could be a good idea to look at pictures or history books to get an idea of what that character would look like. If you're painting miniatures from a game, try searching on the internet for your character. This only applies if you want to paint the character as accurately as possible. Feel free to use your imagination. As a general rule of thumb, don't use more than three major colors in your miniature or it will end up looking messy."
        },
        {
          "headline":"Add your base coat.",
          "description":"Once you’ve chosen your color scheme you can add your first coat of paint over your primer. Remember that you won’t be adding details yet. Start with the hardest to reach part of the model part and paint a thin coat with the base color of that part. Continue painting the parts with the correct color from most difficult to to the largest least difficulty part of the miniature. Apply several thin coats rather than one thick coat."
        },
        {
          "headline":"Dark wash the miniature.",
          "description":"This is a technique done to bring out the shadows. Mix your base coat with brown or black and then dilute it. Now apply a layer of paint to an area filled with detail. This will bring out shadows and make the miniature look much more detailed and interesting. Let dry."
        },
        {
          "headline":"Apply details.",
          "description":"Try using oil paint when you go to paint the face and skin areas of your miniature. Oil paint dries slower and blends more smoothly, so you can add more detail. Use a smaller brush to add smaller details like the eyes or fingernails. Try to keep a steady hand and make sure your miniature has had time to dry off after the dark washing. You don't want your details to drip."
        },
        {
          "headline":"Dry brush the miniature.",
          "description":"After your miniature is dried, and if you’re happy with it, you’re ready to dry brush the miniature. Mix the base color with a bit of white and then apply a small amount of this mixture to your paint brush. Wipe a little off on a rag or paper towel. Now use the dry brush on the model. The idea is to imagine a hypothetical light source and use this mixture to simulate how the light would hit the miniature. Build the area up with lighter colors."
        },
        {
          "headline":"Protect the model using a spray varnish, dull cote or sealer.",
          "description":"These can be found in arts and crafts stores. Spray in a well ventilated area with a clear coat. Again, several thin coats are best. Let varnish dry between coats."
        }
      ]
    }
  ],
  "text":" Preparing to Paint Your Miniature Gather your supplies. First you need a comfortable and well lit work area. You also should have hobby knives, a small file set, fingernail filing boards, super glue, a clean pot of water, and a paint set. Clean your miniature. When miniatures are cast a release agent is applied to them. This is an oily or powdery substance that needs to be removed before you start painting. Wash with warm soapy water to clean off any mold release on the model. Let the miniature dry. Remove mold lines. Now using the hobby knife, trim away any mold flash. That's the extra material around the model that will make a thin line sticking to the miniature horizontally. When the two halves of the miniature are connected in the casting process, this line is often left behind. You should use your knife to remove any other irregularities on the miniature at this point. Oftentimes the extremities have points or bubbles that shouldn’t be there. Use short strokes of the knife to remove the mold lines. Try not to damage the miniature, just swipe off any excess material or bubbles. The irregularities should be pretty obvious. Assemble. Some miniatures have extra parts that need to be assembled, such as a sword or shield. This can be the hardest part. Small parts like hands, small weapons, antennas and other pieces can be glued with a simple tube of superglue. Larger metal pieces may need to be pinned. Pinning requires drilling a hole in each end of the hand or wherever you are attaching the metal piece. Then you need to string a small piece of hard wire through the hole and connect the wire to the metal piece. Then glue together everything with a superglue or a two part epoxy for stronger hold. Priming and Attaching Your Base Use an appropriate amount of white primer. Depending on how many details your miniature has you might want to use less or more primer. The more primer you use, the more your colors will pop once you start painting. However, if you use too much primer you’ll also fill in some smaller details of the miniature accidentally.. Begin priming. For colorful models prime with a white primer. If you’re painting a darker model you can try to prime with black or gray. Remember two or three thin coats are better than a thick coat that might fill in details. Let the model dry between coats. In general, use a white primer. This will allow your colors to pop once you start painting your miniature. Buy or find your base. Most miniatures come with a separate base. If the base is part of the entire miniature that normally means the miniature will be unstable and tip over. You want a stable base, especially if you plan to use your miniature for board games. You can buy a separate base online or at a craft shop. You don't need to remove the base of your miniature if it came with one, just attach it to a larger base. Bases that are already connected to a miniature are usually quite small. Attach your base using high quality super glue. Thick consistency crazy glue is recommended because it can fill in the small gaps between the miniature and the base. Avoid putting it in area where it will obscure details. Consider buying a super glue accelerant at a hobby shop to make this process faster. Not having to wait is a huge help. Painting Your Miniature Choose your color scheme. This is where a color wheel will come in handy. Choose primary colors that you think match your miniature, and then mix the primary colors in equal proportion to get secondary colors. Choose complementary color pairings - these are colors that lie directly across from each other on the color wheel. Avoid using too many colors. If you're painting historical miniatures it could be a good idea to look at pictures or history books to get an idea of what that character would look like. If you're painting miniatures from a game, try searching on the internet for your character. This only applies if you want to paint the character as accurately as possible. Feel free to use your imagination. As a general rule of thumb, don't use more than three major colors in your miniature or it will end up looking messy. Add your base coat. Once you’ve chosen your color scheme you can add your first coat of paint over your primer. Remember that you won’t be adding details yet. Start with the hardest to reach part of the model part and paint a thin coat with the base color of that part. Continue painting the parts with the correct color from most difficult to to the largest least difficulty part of the miniature. Apply several thin coats rather than one thick coat. Dark wash the miniature. This is a technique done to bring out the shadows. Mix your base coat with brown or black and then dilute it. Now apply a layer of paint to an area filled with detail. This will bring out shadows and make the miniature look much more detailed and interesting. Let dry. Apply details. Try using oil paint when you go to paint the face and skin areas of your miniature. Oil paint dries slower and blends more smoothly, so you can add more detail. Use a smaller brush to add smaller details like the eyes or fingernails. Try to keep a steady hand and make sure your miniature has had time to dry off after the dark washing. You don't want your details to drip. Dry brush the miniature. After your miniature is dried, and if you’re happy with it, you’re ready to dry brush the miniature. Mix the base color with a bit of white and then apply a small amount of this mixture to your paint brush. Wipe a little off on a rag or paper towel. Now use the dry brush on the model. The idea is to imagine a hypothetical light source and use this mixture to simulate how the light would hit the miniature. Build the area up with lighter colors. Protect the model using a spray varnish, dull cote or sealer. These can be found in arts and crafts stores. Spray in a well ventilated area with a clear coat. Again, several thin coats are best. Let varnish dry between coats.",
  "tyn_model":[
    "primer",
    "super glue",
    "water",
    "knife",
    "superglue",
    "paint",
    "oil paint",
    "hobby knives",
    "fingernail filing boards",
    "paint set",
    "hobby knife",
    "white primer",
    "glue",
    "color wheel",
    "paint brush",
    "spray varnish",
    "varnish"
  ],
  "tyn_section":[

  ]
}