{
  "title":"How to Make Chocoflan",
  "url":"https://www.wikihow.com/Make-Chocoflan",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Chocolate Cakes"
  ],
  "steps":[
    {
      "headline":"Get out a Bundt pan.",
      "description":"Coat it lightly with butter."
    },
    {
      "headline":"Now add to the pan half a cup of cajeta.",
      "description":""
    },
    {
      "headline":"Put the Bundt into a Roasting pan.",
      "description":""
    },
    {
      "headline":"Add the butter and sugar in a bowl and stir until the mixture is fluffy.",
      "description":""
    },
    {
      "headline":"Then beat in the egg.",
      "description":""
    },
    {
      "headline":"Get out another bowl and in it mix the flour, baking powder, baking soda and cocoa.",
      "description":"Then put the flour mixture with the butter mixture and add about half of the buttermilk."
    },
    {
      "headline":"Get out a blender and combine the condensed milk, evaporated milk, eggs vanilla and cream cheese.",
      "description":"Mix until well combined."
    },
    {
      "headline":"Place the cake mixture into the Bundt pan.",
      "description":"Now pour the flan mixture over the top. Cover it with foil."
    },
    {
      "headline":"Pour boiling water into the roasting pan.",
      "description":""
    },
    {
      "headline":"Place the pan into the oven.",
      "description":"Cook until the mixture is firm and a toothpick comes out clear. It should take about an hour."
    },
    {
      "headline":"Let it cool completely in its pan.",
      "description":"Slowly scrape a knife all around the edge until the cake seems like it will come out. Carefully tip the cake out onto a plate and serve."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Get out a Bundt pan. Coat it lightly with butter. Now add to the pan half a cup of cajeta.  Put the Bundt into a Roasting pan.  Add the butter and sugar in a bowl and stir until the mixture is fluffy.  Then beat in the egg.  Get out another bowl and in it mix the flour, baking powder, baking soda and cocoa. Then put the flour mixture with the butter mixture and add about half of the buttermilk. Get out a blender and combine the condensed milk, evaporated milk, eggs vanilla and cream cheese. Mix until well combined. Place the cake mixture into the Bundt pan. Now pour the flan mixture over the top. Cover it with foil. Pour boiling water into the roasting pan.  Place the pan into the oven. Cook until the mixture is firm and a toothpick comes out clear. It should take about an hour. Let it cool completely in its pan. Slowly scrape a knife all around the edge until the cake seems like it will come out. Carefully tip the cake out onto a plate and serve. Finished. ",
  "tyn_model":[
    "butter",
    "bundt pan",
    "roasting pan",
    "bowl",
    "flour",
    "sugar",
    "egg",
    "baking powder",
    "baking soda",
    "cocoa",
    "buttermilk",
    "blender",
    "condensed milk",
    "evaporated milk",
    "eggs vanilla",
    "cream cheese",
    "foil",
    "water",
    "oven",
    "knife",
    "plate"
  ],
  "tyn_section":[

  ]
}