{
  "title":"How to Kill German Roaches",
  "url":"https://www.wikihow.com/Kill-German-Roaches",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control",
    "Cockroach Control"
  ],
  "methods":[
    {
      "name":"Baiting and Trapping German Roaches",
      "steps":[
        {
          "headline":"Use gel baits.",
          "description":"This type of bait comes in a tube and is applied by squeezing the tube to dispense the gel. Apply the gel along window and door trims, behind the trashcan, and along the cabinet doors in your kitchen and bathroom. Also apply bait gel under sinks where the drainpipe enters the wall in your kitchen and bathroom. Apply gel bait in the crevices and cracks of your kitchen drawers, and along upper shelving and baseboards. If you have children or pets, then make sure to apply the gel in areas that are out of their reach."
        },
        {
          "headline":"Try a bait station.",
          "description":"Bait stations consist of a plastic housing that contains poison. Cockroaches enter through small holes in the housing to retrieve the bait. Make sure to place the bait stations against the walls and in corners in high traffic areas like your kitchen and bathroom. Place bait stations behind the refrigerator, microwave, oven, toasters, toilet, and other major appliances in your kitchen and bathroom. Also place them underneath your dishwasher, refrigerator, oven, washer, dryer, and hot water heater. Identify high traffic areas by looking for roach droppings. Roach droppings resemble ground black pepper."
        },
        {
          "headline":"Use a sticky trap.",
          "description":"Sticky traps contain pheromones that will attract the roaches. Upon entering the trap, the roaches will become stuck in it and suffocate. Also place these traps against the walls and in corners in high traffic areas. Place sticky traps in the same areas you place bait stations. Do not spray sticky traps and bait stations with insecticides or cleaning products. These will contaminate the baits. If the bait is contaminated, then the roaches will not enter."
        }
      ]
    },
    {
      "name":"Using Boric Acid",
      "steps":[
        {
          "headline":"Use a duster bulb to apply the acid.",
          "description":"A duster bulb will enable you to apply a thin layer of boric acid. Squeeze the bulb to puff a small layer of powder along the floor and walls in your kitchen and bathroom. The layer should be barely visible to your eye. Do not apply too much boric acid. If you do, then the roaches will be able to detect it and they will avoid the area. Do not use a spoon to apply the boric acid. You can purchase the acid from your local hardware store. Do not apply the acid on countertops, especially where food is prepared."
        },
        {
          "headline":"Administer boric acid in between your walls.",
          "description":"Drill a hole in your drywall big enough to fit the tip of the duster bulb. Place the tip of the duster bulb into the hole. Squeeze the bulb to dispense the boric acid in between your walls. Since roaches tend to live in between walls, this is an effective way to kill them."
        },
        {
          "headline":"Use it in combination with gel bait and bait stations.",
          "description":"But do not use it in combination with sticky traps. The traps will prevent the roaches from going back home, which helps spread the acid to other roaches."
        }
      ]
    },
    {
      "name":"Preventing German Roaches",
      "steps":[
        {
          "headline":"Sanitize surfaces in your kitchen.",
          "description":"Remove particles of food and clean up spills on your counters, tables, sink, stovetop, and other surfaces in your kitchen. Also make sure to sweep your kitchen and dining room floors, as well as other areas where you eat at least five times a week, if not every day. Try not to leave dirty dishes and food in the sink overnight. Empty the trash every night and cover the trashcan with a tight fitting lid."
        },
        {
          "headline":"Store food in airtight containers.",
          "description":"Store flour, sugar, cookies, bread, cereal, crackers, and other food items in airtight containers. This will prevent the cockroaches from smelling the food and invading your kitchen."
        },
        {
          "headline":"Caulk holes and cracks.",
          "description":"Use an expanding foam to cover cracks, holes, crevices, and gaps along the bottom of the walls in your kitchen and bathroom. Make sure to cover cracks and crevices around the pipes under the sinks in your kitchen and bathroom as well. You can purchase expanding foams from your local hardware store. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKevin Carrillo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMMPC, Pest Control Specialist\t\t\t\t\t\t\t\tKevin Carrillo is a Pest Control Specialist and the Senior Project Manager for MMPC, a pest control service and certified Minority-owned Business Enterprise (MBE) based in the New York City area. MMPC is certified by the industry’s leading codes and practices, including the National Pest Management Association (NPMA), QualityPro, GreenPro, and The New York Pest Management Association (NYPMA). MMPC's work has been featured in CNN, NPR, and ABC News. Kevin Carrillo\t\t\tMMPC, Pest Control Specialist\t\t\t\tCheck products coming into your home for roaches, as well. Roaches are really good at hitching a ride and coming in on products, whether it's in a shopping bag from a grocery store or a product delivered same-day from a warehouse. You might even unknowingly set up a roach nest, especially if you store all of your bags under the sink or you keep a big pile of cardboard in your home."
        }
      ]
    }
  ],
  "text":" Baiting and Trapping German Roaches Use gel baits. This type of bait comes in a tube and is applied by squeezing the tube to dispense the gel. Apply the gel along window and door trims, behind the trashcan, and along the cabinet doors in your kitchen and bathroom. Also apply bait gel under sinks where the drainpipe enters the wall in your kitchen and bathroom. Apply gel bait in the crevices and cracks of your kitchen drawers, and along upper shelving and baseboards. If you have children or pets, then make sure to apply the gel in areas that are out of their reach. Try a bait station. Bait stations consist of a plastic housing that contains poison. Cockroaches enter through small holes in the housing to retrieve the bait. Make sure to place the bait stations against the walls and in corners in high traffic areas like your kitchen and bathroom. Place bait stations behind the refrigerator, microwave, oven, toasters, toilet, and other major appliances in your kitchen and bathroom. Also place them underneath your dishwasher, refrigerator, oven, washer, dryer, and hot water heater. Identify high traffic areas by looking for roach droppings. Roach droppings resemble ground black pepper. Use a sticky trap. Sticky traps contain pheromones that will attract the roaches. Upon entering the trap, the roaches will become stuck in it and suffocate. Also place these traps against the walls and in corners in high traffic areas. Place sticky traps in the same areas you place bait stations. Do not spray sticky traps and bait stations with insecticides or cleaning products. These will contaminate the baits. If the bait is contaminated, then the roaches will not enter. Using Boric Acid Use a duster bulb to apply the acid. A duster bulb will enable you to apply a thin layer of boric acid. Squeeze the bulb to puff a small layer of powder along the floor and walls in your kitchen and bathroom. The layer should be barely visible to your eye. Do not apply too much boric acid. If you do, then the roaches will be able to detect it and they will avoid the area. Do not use a spoon to apply the boric acid. You can purchase the acid from your local hardware store. Do not apply the acid on countertops, especially where food is prepared. Administer boric acid in between your walls. Drill a hole in your drywall big enough to fit the tip of the duster bulb. Place the tip of the duster bulb into the hole. Squeeze the bulb to dispense the boric acid in between your walls. Since roaches tend to live in between walls, this is an effective way to kill them. Use it in combination with gel bait and bait stations. But do not use it in combination with sticky traps. The traps will prevent the roaches from going back home, which helps spread the acid to other roaches. Preventing German Roaches Sanitize surfaces in your kitchen. Remove particles of food and clean up spills on your counters, tables, sink, stovetop, and other surfaces in your kitchen. Also make sure to sweep your kitchen and dining room floors, as well as other areas where you eat at least five times a week, if not every day. Try not to leave dirty dishes and food in the sink overnight. Empty the trash every night and cover the trashcan with a tight fitting lid. Store food in airtight containers. Store flour, sugar, cookies, bread, cereal, crackers, and other food items in airtight containers. This will prevent the cockroaches from smelling the food and invading your kitchen. Caulk holes and cracks. Use an expanding foam to cover cracks, holes, crevices, and gaps along the bottom of the walls in your kitchen and bathroom. Make sure to cover cracks and crevices around the pipes under the sinks in your kitchen and bathroom as well. You can purchase expanding foams from your local hardware store. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tKevin Carrillo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tMMPC, Pest Control Specialist\t\t\t\t\t\t\t\tKevin Carrillo is a Pest Control Specialist and the Senior Project Manager for MMPC, a pest control service and certified Minority-owned Business Enterprise (MBE) based in the New York City area. MMPC is certified by the industry’s leading codes and practices, including the National Pest Management Association (NPMA), QualityPro, GreenPro, and The New York Pest Management Association (NYPMA). MMPC's work has been featured in CNN, NPR, and ABC News. Kevin Carrillo\t\t\tMMPC, Pest Control Specialist\t\t\t\tCheck products coming into your home for roaches, as well. Roaches are really good at hitching a ride and coming in on products, whether it's in a shopping bag from a grocery store or a product delivered same-day from a warehouse. You might even unknowingly set up a roach nest, especially if you store all of your bags under the sink or you keep a big pile of cardboard in your home.",
  "tyn_model":[
    "boric acid",
    "duster bulb",
    "pest control specialist",
    "sticky traps",
    "airtight containers",
    "roaches",
    "gel baits",
    "bait",
    "bait gel",
    "gel bait",
    "bait station",
    "refrigerator",
    "microwave",
    "toasters",
    "hot water heater",
    "sticky trap",
    "spoon",
    "trash",
    "trashcan",
    "flour",
    "sugar",
    "cereal",
    "cockroaches",
    "expanding foam",
    "expanding foams",
    "pest control service",
    "pest management association",
    "roach",
    "cardboard"
  ],
  "tyn_section":[

  ]
}