{
  "title":"How to Create a Stereo Auxiliary on an Old School Radio",
  "url":"https://www.wikihow.com/Create-a-Stereo-Auxiliary-on-an-Old-School-Radio",
  "category_hierarchy":[
    "Hobbies and Crafts"
  ],
  "steps":[
    {
      "headline":"Yank out the radio.",
      "description":""
    },
    {
      "headline":"Crack open the radio case and try to get at the read head of the cassette deck.",
      "description":"It's that unit in the center that runs against the tape. Alternatively you can find the first circuit board where the leads from the head go."
    },
    {
      "headline":"Either hack apart an old headphone lead, or preferably buy a 1/8 stereo jack and some wire and make one from scratch.",
      "description":"This helps because old headphones have a weird coating that's hard to solder. If you want to be fussy find out which lead is left and which is right. Mine was labeled on the circuit board."
    },
    {
      "headline":"Now solder the two upper leads to the read head.",
      "description":"The tip of the jack is left, the middle bit right, and the base is ground. I attach the ground, but it works without it."
    },
    {
      "headline":"Now reinstall the radio and snake your new jack lead out a hole somewhere.",
      "description":""
    },
    {
      "headline":"To activate the cassette function you must insert a tape.",
      "description":""
    },
    {
      "headline":"Plug in your MP3 player or portable CD player or whatever fits a 1/8 jack, pop in the dead tape and enjoy.",
      "description":""
    }
  ],
  "text":" Yank out the radio.  Crack open the radio case and try to get at the read head of the cassette deck. It's that unit in the center that runs against the tape. Alternatively you can find the first circuit board where the leads from the head go. Either hack apart an old headphone lead, or preferably buy a 1/8 stereo jack and some wire and make one from scratch. This helps because old headphones have a weird coating that's hard to solder. If you want to be fussy find out which lead is left and which is right. Mine was labeled on the circuit board. Now solder the two upper leads to the read head. The tip of the jack is left, the middle bit right, and the base is ground. I attach the ground, but it works without it. Now reinstall the radio and snake your new jack lead out a hole somewhere.  To activate the cassette function you must insert a tape.  Plug in your MP3 player or portable CD player or whatever fits a 1/8 jack, pop in the dead tape and enjoy. ",
  "tyn_model":[
    "radio",
    "radio case",
    "headphone lead",
    "wire",
    "headphones",
    "circuit board",
    "tape",
    "mp3 player"
  ],
  "tyn_section":[

  ]
}