{
  "title":"How to Make Serabi",
  "url":"https://www.wikihow.com/Make-Serabi",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Indonesian Dishes"
  ],
  "steps":[
    {
      "headline":"Combine egg, coconut milk, water, and salt.",
      "description":"In a bowl add in all the 4 ingredients and mix well."
    },
    {
      "headline":"Put baking powder and sifted flour into the wet ingredients.",
      "description":"Mix it all up until smooth and well combined. Set this mixture aside to begin making the sauce."
    },
    {
      "headline":"Start making the coconut sauce.",
      "description":"In a pan add in coconut milk, coconut sugar, palm sugar, salt and pandan leaf. The sauce is complete once the sugar fully dissolves. When the sugar has dissolved add in chopped fruits and allow to cook for 5 minutes."
    },
    {
      "headline":"Start making the serabi.",
      "description":"Grease a frying pan with cooking oil to prevent burning and put it on low heat. Then use 2 tablespoons of batter for 1 serabi. Only cook one side of the serabi  in order to tell if it's done tiny holes should start to form on top."
    },
    {
      "headline":"Remove from heat once it's fully cooked and all the batter is used.",
      "description":""
    },
    {
      "headline":"Serve the serabi.",
      "description":"Grab a bowl and pour some sauce on top of the serabi."
    }
  ],
  "text":" Combine egg, coconut milk, water, and salt. In a bowl add in all the 4 ingredients and mix well. Put baking powder and sifted flour into the wet ingredients. Mix it all up until smooth and well combined. Set this mixture aside to begin making the sauce. Start making the coconut sauce. In a pan add in coconut milk, coconut sugar, palm sugar, salt and pandan leaf. The sauce is complete once the sugar fully dissolves. When the sugar has dissolved add in chopped fruits and allow to cook for 5 minutes. Start making the serabi. Grease a frying pan with cooking oil to prevent burning and put it on low heat. Then use 2 tablespoons of batter for 1 serabi. Only cook one side of the serabi  in order to tell if it's done tiny holes should start to form on top. Remove from heat once it's fully cooked and all the batter is used.  Serve the serabi. Grab a bowl and pour some sauce on top of the serabi.",
  "tyn_model":[
    "coconut milk",
    "salt",
    "bowl",
    "sugar",
    "egg",
    "water",
    "baking powder",
    "sifted flour",
    "coconut sauce",
    "coconut sugar",
    "palm sugar",
    "pandan leaf",
    "fruits",
    "frying pan",
    "cooking oil"
  ],
  "tyn_section":[

  ]
}