{
  "title":"How to Brine a Fresh Ham",
  "url":"https://www.wikihow.com/Brine-a-Fresh-Ham",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "steps":[
    {
      "headline":"Purchase a fresh ham roast.",
      "description":"Fresh ham is not the cured, smoked product we associate with ham. It is a cut of pork. Choose one that is 8-12 pounds total weight. Ham needs to be thawed and not frozen when you place it in the brine.You also need a food grade container large enough to place your ham and brine in and have the meat completely covered by the brine."
    },
    {
      "headline":"Take 6 cups of the water and put into a large kettle on your stove.",
      "description":"Add in all of the other ingredients, except the remaining water. Bring to a boil."
    },
    {
      "headline":"Stir to dissolve the salt and sugar.",
      "description":"Boil about 2 minutes."
    },
    {
      "headline":"Remove from heat and let cool to room temperature.",
      "description":""
    },
    {
      "headline":"Place your fresh ham roast into the container you have chosen.",
      "description":""
    },
    {
      "headline":"Pour the cooled brine recipe over the ham.",
      "description":""
    },
    {
      "headline":"Add the rest of the water and stir it around to combine.",
      "description":"The ham needs to be completely covered by liquid."
    },
    {
      "headline":"Keep at 38–40 °F (3–4 °C).",
      "description":"If you do not have a cold garage or room in your refrigerator, reduce the water you add by 6 cups. Add 1 pound of ice instead."
    },
    {
      "headline":"Keep meat in brine no less than 48 hours.",
      "description":"You can brine up to 4 days if you keep the temperature down."
    },
    {
      "headline":"Remove from brine.",
      "description":"Pat dry and let meat come close to room temperature."
    },
    {
      "headline":"Roast in the oven until done, about 21 minutes per pound of meat.",
      "description":""
    },
    {
      "headline":"Remove from oven and let rest on counter for 5-10 minutes before carving.",
      "description":""
    }
  ],
  "text":" Purchase a fresh ham roast. Fresh ham is not the cured, smoked product we associate with ham. It is a cut of pork. Choose one that is 8-12 pounds total weight. Ham needs to be thawed and not frozen when you place it in the brine.You also need a food grade container large enough to place your ham and brine in and have the meat completely covered by the brine. Take 6 cups of the water and put into a large kettle on your stove. Add in all of the other ingredients, except the remaining water. Bring to a boil. Stir to dissolve the salt and sugar. Boil about 2 minutes. Remove from heat and let cool to room temperature.  Place your fresh ham roast into the container you have chosen.  Pour the cooled brine recipe over the ham.  Add the rest of the water and stir it around to combine. The ham needs to be completely covered by liquid. Keep at 38–40 °F (3–4 °C). If you do not have a cold garage or room in your refrigerator, reduce the water you add by 6 cups. Add 1 pound of ice instead. Keep meat in brine no less than 48 hours. You can brine up to 4 days if you keep the temperature down. Remove from brine. Pat dry and let meat come close to room temperature. Roast in the oven until done, about 21 minutes per pound of meat.  Remove from oven and let rest on counter for 5-10 minutes before carving. ",
  "tyn_model":[
    "ham",
    "water",
    "oven",
    "pork",
    "large kettle",
    "salt",
    "sugar",
    "refrigerator",
    "ice"
  ],
  "tyn_section":[

  ]
}