{
  "title":"How to Do a 100 Hit Combo in Marvel Vs Capcom 2",
  "url":"https://www.wikihow.com/Do-a-100-Hit-Combo-in-Marvel-Vs-Capcom-2",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Arcade Games"
  ],
  "steps":[
    {
      "headline":"Find yourself a game.",
      "description":"Most big arcades have them or you can try to rent a copy. You can also buy it on Playstation Network (PS3) or Xbox Live Arcade (360) for 14.99."
    },
    {
      "headline":"When you play a friend or the computer, select T.Bonne, Cable, and Ironman in that order.",
      "description":""
    },
    {
      "headline":"Start by accumulating 3 bars of super with combos or assist attacks.",
      "description":""
    },
    {
      "headline":"When you get an open shot, use T.Bonne's \"Lunch Rush\" (quarter circle forward + weak and strong punch).",
      "description":""
    },
    {
      "headline":"Right before the enemy hits the ground, do that same button combo, but right after you do hold the joystick down lightly.",
      "description":"Cable will come in and fire that huge laser he has. Holding the stick down redirects the blast lower to the ground."
    },
    {
      "headline":"After about 7-8 seconds of lasering the crap out of someone, do that same button combo again; this time, Ironman will switch in and use his proton cannon.",
      "description":""
    },
    {
      "headline":"If done correctly, this should total a little over 100 hits!",
      "description":"That's about 2/3 of someone's life; just damage them a little in the beginning and finish them with this!"
    }
  ],
  "text":" Find yourself a game. Most big arcades have them or you can try to rent a copy. You can also buy it on Playstation Network (PS3) or Xbox Live Arcade (360) for 14.99. When you play a friend or the computer, select T.Bonne, Cable, and Ironman in that order.  Start by accumulating 3 bars of super with combos or assist attacks.  When you get an open shot, use T.Bonne's \"Lunch Rush\" (quarter circle forward + weak and strong punch).  Right before the enemy hits the ground, do that same button combo, but right after you do hold the joystick down lightly. Cable will come in and fire that huge laser he has. Holding the stick down redirects the blast lower to the ground. After about 7-8 seconds of lasering the crap out of someone, do that same button combo again; this time, Ironman will switch in and use his proton cannon.  If done correctly, this should total a little over 100 hits! That's about 2/3 of someone's life; just damage them a little in the beginning and finish them with this!",
  "tyn_model":[
    "game",
    "cable",
    "ironman",
    "joystick",
    "proton cannon"
  ],
  "tyn_section":[

  ]
}