{
  "title":"How to Make an Easy Chicken Salad",
  "url":"https://www.wikihow.com/Make-an-Easy-Chicken-Salad",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Salads",
    "Chicken Salads"
  ],
  "methods":[
    {
      "name":"Classic Chicken Salad",
      "steps":[
        {
          "headline":"Prepare your ingredients.",
          "description":"You'll need the following:\n2-3 cups of boiled chicken breast, coarsely chopped\n2 stalks celery, chopped\n1/2 red bell pepper, seeded and chopped\n4-6 green olives, pitted and minced\n1/4 cup chopped red onion\n1/2 apple, cored and chopped\n1/3 head iceberg lettuce, chopped\n5 tablespoons mayonnaise\n1 tablespoon sweet berry preserves\n2 teaspoons fresh squeezed lemon juice\nSalt and pepper"
        },
        {
          "headline":"Boil the chicken.",
          "description":"Bring a medium sized pot of water to a boil, and then place the chicken breasts inside. Reduce to a simmer, cover the pot, and allow the breasts cook for 15-20 minutes."
        },
        {
          "headline":"Strain the water from the pot and transfer the chicken to a cutting board.",
          "description":"Once the breasts have cooled, chop them into small pieces."
        },
        {
          "headline":"Combine the chicken, vegetables, and chopped apple in a large bowl.",
          "description":"Set aside."
        },
        {
          "headline":"Mix together the mayonnaise, lemon juice, and berry preserves in a separate bowl.",
          "description":"Add salt and pepper to taste, and then drizzle the dressing over the salad."
        },
        {
          "headline":"Toss the salad and dressing together.",
          "description":""
        },
        {
          "headline":"Serve at room temperature or refrigerate for 3-5 hours before serving.",
          "description":""
        }
      ]
    },
    {
      "name":"Chicken Noodle Salad",
      "steps":[
        {
          "headline":"Gather your ingredients.",
          "description":"Here's what you'll need to make a chicken noodle salad:\nMayonnaise\nChicken (cut into small pieces)\nCarrots (chopped)\nBlack olives\nCelery (chopped)\nRadishes (chopped)\nYellow peppers (chopped)\nNoodles\nAny other vegetables of your choice"
        },
        {
          "headline":"Gather the ingredients.",
          "description":""
        },
        {
          "headline":"Boil the noodles.",
          "description":"When the noodles are good, put them in the fridge so that they can cool."
        },
        {
          "headline":"Prepare all the vegetables and chicken you want in the salad by cutting them into small pieces (dime or nickel sized).",
          "description":""
        },
        {
          "headline":"Put the noodles in a bowl when the noodles are cold and ready.",
          "description":"The size of the bowl depends on how much stuff you're putting in it. Put the rest of the ingredients in and take out the mayo."
        },
        {
          "headline":"Put however much mayo you like or think you need into it.",
          "description":"There should be enough to be a layer on most of it, but you don't want the salad to be just mayo."
        },
        {
          "headline":"Mix everything together.",
          "description":"You can eat it now or put it back in the refrigerator until you need it."
        }
      ]
    },
    {
      "name":"Southern Chicken Salad",
      "steps":[
        {
          "headline":"Gather your ingredients.",
          "description":"Here's what you'll need to make a southern chicken salad:\n4 boneless chicken breasts\n3 hard-boiled eggs\n1/2 grapes, halved, or 1/4 cup raisins (optional)\n1/2 cup light mayonnaise\n1 tablespoon dill relish\n1 tablespoon lemon juice\n1 tablespoon honey\n1/4 tablespoon celery seed\n1 teaspoon garlic powder\n1 teaspoon onion powder\n1 teaspoon basil\nSalt & pepper"
        },
        {
          "headline":"Slowly boil chicken in salted water or chicken broth until chicken starts to come apart.",
          "description":"Over low heat, this should take about an hour."
        },
        {
          "headline":"Remove chicken from water, let drain, and sprinkle with garlic, onion powder, celery seed and basil.",
          "description":"Set in the fridge to cool."
        },
        {
          "headline":"Hard-boil the eggs.",
          "description":"If you want, you can use the same water that you used in order to boil the chicken."
        },
        {
          "headline":"Once finished, set the eggs under running cool water.",
          "description":"Wait for the eggs to cool down in their shells."
        },
        {
          "headline":"Peel eggs and gently cube them up.",
          "description":"They should be about 1/4\" cube."
        },
        {
          "headline":"Remove the chicken from the refrigerator and begin shredding with a knife and fork.",
          "description":""
        },
        {
          "headline":"Mix mayo, relish, lemon juice, and honey together in a separate bowl.",
          "description":""
        },
        {
          "headline":"Combine chicken, eggs, grapes (or raisins), and dressing.",
          "description":"Cover with plastic wrap and set into the refrigerator again to cool for at least 30, preferably an hour."
        },
        {
          "headline":"Serve!",
          "description":""
        }
      ]
    },
    {
      "name":"Chinese Chicken Salad",
      "steps":[
        {
          "headline":"Gather your ingredients.",
          "description":"Here's what you'll need to make a Chinese chicken salad:\n4 tablespoons low-sodium soy sauce, divided\n2 teaspoons toasted sesame oil, divided\n1 pound skinless, boneless chicken breasts\n1/2 head of Napa cabbage, thinly shredded (about 6 cups)\n1/4 head red cabbage, shredded (about 2 cups)\n1 large carrot, shredded (about 2 cups)\n3 scallions, trimmed and thinly sliced, greens included (about 1/2 cup)\n2 Mandarin oranges, peeled and chopped\n6 ounces Chinese noodles, heated briefly to crisp\n1/3 cup rice wine vinegar\n1 teaspoon minced garlic\n1 teaspoon minced ginger\n2 tablespoons canola oil\n2 tablespoons brown sugar\n1 1/2 teaspoons chili-garlic sauce or chili sauce\n1/4 cup sliced almonds, toasted"
        },
        {
          "headline":"Preheat oven to 350° F (177° C).",
          "description":""
        },
        {
          "headline":"Combine 1 tablespoon sesame oil and ⁄2 tablespoon (7.4 ml) soy sauce, brushing over chicken breasts completely.",
          "description":""
        },
        {
          "headline":"When oven is finished preheating, place chicken breasts in oven for 13 to 15 minutes, or until fully cooked through.",
          "description":"Chicken meat will turn from pinkish to white when fully cooked; juices will run clear."
        },
        {
          "headline":"Cut chicken into slices.",
          "description":"Chicken slices should ideally be about 1/4 to 1/2\" thick."
        },
        {
          "headline":"In a salad bowl, combine Napa cabbage, red cabbage, carrot, scallions, Mandarin orange, noodles, and sliced chicken.",
          "description":""
        },
        {
          "headline":"Whisk together the salad dressing ingredients in a separate bowl.",
          "description":"Whisk together 3 tablespoons soy sauce, vinegar, garlic, ginger, oil, 1 1/2 teaspoons sesame oil, brown sugar and chili sauce."
        },
        {
          "headline":"Incorporate dressing into salad and toss.",
          "description":""
        },
        {
          "headline":"Top or garnish with toasted almonds.",
          "description":"Serve!"
        }
      ]
    }
  ],
  "text":" Classic Chicken Salad Prepare your ingredients. You'll need the following:\n2-3 cups of boiled chicken breast, coarsely chopped\n2 stalks celery, chopped\n1/2 red bell pepper, seeded and chopped\n4-6 green olives, pitted and minced\n1/4 cup chopped red onion\n1/2 apple, cored and chopped\n1/3 head iceberg lettuce, chopped\n5 tablespoons mayonnaise\n1 tablespoon sweet berry preserves\n2 teaspoons fresh squeezed lemon juice\nSalt and pepper Boil the chicken. Bring a medium sized pot of water to a boil, and then place the chicken breasts inside. Reduce to a simmer, cover the pot, and allow the breasts cook for 15-20 minutes. Strain the water from the pot and transfer the chicken to a cutting board. Once the breasts have cooled, chop them into small pieces. Combine the chicken, vegetables, and chopped apple in a large bowl. Set aside. Mix together the mayonnaise, lemon juice, and berry preserves in a separate bowl. Add salt and pepper to taste, and then drizzle the dressing over the salad. Toss the salad and dressing together.  Serve at room temperature or refrigerate for 3-5 hours before serving.  Chicken Noodle Salad Gather your ingredients. Here's what you'll need to make a chicken noodle salad:\nMayonnaise\nChicken (cut into small pieces)\nCarrots (chopped)\nBlack olives\nCelery (chopped)\nRadishes (chopped)\nYellow peppers (chopped)\nNoodles\nAny other vegetables of your choice Gather the ingredients.  Boil the noodles. When the noodles are good, put them in the fridge so that they can cool. Prepare all the vegetables and chicken you want in the salad by cutting them into small pieces (dime or nickel sized).  Put the noodles in a bowl when the noodles are cold and ready. The size of the bowl depends on how much stuff you're putting in it. Put the rest of the ingredients in and take out the mayo. Put however much mayo you like or think you need into it. There should be enough to be a layer on most of it, but you don't want the salad to be just mayo. Mix everything together. You can eat it now or put it back in the refrigerator until you need it. Southern Chicken Salad Gather your ingredients. Here's what you'll need to make a southern chicken salad:\n4 boneless chicken breasts\n3 hard-boiled eggs\n1/2 grapes, halved, or 1/4 cup raisins (optional)\n1/2 cup light mayonnaise\n1 tablespoon dill relish\n1 tablespoon lemon juice\n1 tablespoon honey\n1/4 tablespoon celery seed\n1 teaspoon garlic powder\n1 teaspoon onion powder\n1 teaspoon basil\nSalt & pepper Slowly boil chicken in salted water or chicken broth until chicken starts to come apart. Over low heat, this should take about an hour. Remove chicken from water, let drain, and sprinkle with garlic, onion powder, celery seed and basil. Set in the fridge to cool. Hard-boil the eggs. If you want, you can use the same water that you used in order to boil the chicken. Once finished, set the eggs under running cool water. Wait for the eggs to cool down in their shells. Peel eggs and gently cube them up. They should be about 1/4\" cube. Remove the chicken from the refrigerator and begin shredding with a knife and fork.  Mix mayo, relish, lemon juice, and honey together in a separate bowl.  Combine chicken, eggs, grapes (or raisins), and dressing. Cover with plastic wrap and set into the refrigerator again to cool for at least 30, preferably an hour. Serve!  Chinese Chicken Salad Gather your ingredients. Here's what you'll need to make a Chinese chicken salad:\n4 tablespoons low-sodium soy sauce, divided\n2 teaspoons toasted sesame oil, divided\n1 pound skinless, boneless chicken breasts\n1/2 head of Napa cabbage, thinly shredded (about 6 cups)\n1/4 head red cabbage, shredded (about 2 cups)\n1 large carrot, shredded (about 2 cups)\n3 scallions, trimmed and thinly sliced, greens included (about 1/2 cup)\n2 Mandarin oranges, peeled and chopped\n6 ounces Chinese noodles, heated briefly to crisp\n1/3 cup rice wine vinegar\n1 teaspoon minced garlic\n1 teaspoon minced ginger\n2 tablespoons canola oil\n2 tablespoons brown sugar\n1 1/2 teaspoons chili-garlic sauce or chili sauce\n1/4 cup sliced almonds, toasted Preheat oven to 350° F (177° C).  Combine 1 tablespoon sesame oil and ⁄2 tablespoon (7.4 ml) soy sauce, brushing over chicken breasts completely.  When oven is finished preheating, place chicken breasts in oven for 13 to 15 minutes, or until fully cooked through. Chicken meat will turn from pinkish to white when fully cooked; juices will run clear. Cut chicken into slices. Chicken slices should ideally be about 1/4 to 1/2\" thick. In a salad bowl, combine Napa cabbage, red cabbage, carrot, scallions, Mandarin orange, noodles, and sliced chicken.  Whisk together the salad dressing ingredients in a separate bowl. Whisk together 3 tablespoons soy sauce, vinegar, garlic, ginger, oil, 1 1/2 teaspoons sesame oil, brown sugar and chili sauce. Incorporate dressing into salad and toss.  Top or garnish with toasted almonds. Serve!",
  "tyn_model":[
    "chicken",
    "water",
    "noodles",
    "eggs",
    "mayonnaise",
    "mayo",
    "salt",
    "refrigerator",
    "garlic",
    "oven",
    "celery",
    "apple",
    "pot",
    "vegetables",
    "chicken noodle salad",
    "bowl",
    "grapes",
    "lemon juice",
    "honey",
    "celery seed",
    "onion powder",
    "basil",
    "dressing",
    "napa cabbage",
    "red cabbage",
    "carrot",
    "scallions",
    "ginger",
    "brown sugar",
    "chili sauce",
    "sesame oil",
    "soy sauce",
    "boiled chicken breast",
    "red bell pepper",
    "green olives",
    "red onion",
    "iceberg lettuce",
    "sweet berry preserves",
    "fresh squeezed lemon juice",
    "cutting board",
    "large bowl",
    "lemon",
    "pepper",
    "carrots",
    "black olives",
    "radishes",
    "yellow peppers",
    "fridge",
    "salad",
    "raisins",
    "dill relish",
    "garlic powder",
    "salted water",
    "chicken broth",
    "knife",
    "fork",
    "plastic wrap",
    "chinese chicken salad",
    "low-sodium soy sauce",
    "toasted sesame oil",
    "mandarin oranges",
    "chinese noodles",
    "rice wine vinegar",
    "canola oil",
    "chili-garlic sauce",
    "almonds",
    "salad bowl",
    "mandarin orange",
    "salad dressing",
    "vinegar",
    "oil",
    "toasted almonds"
  ],
  "tyn_section":[

  ]
}