{
  "title":"How to Make a Hair Clip with a Scarf Attached",
  "url":"https://www.wikihow.com/Make-a-Hair-Clip-with-a-Scarf-Attached",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "steps":[
    {
      "headline":"Assemble the items needed.",
      "description":"These are listed below under \"Things You'll Need\". For the scarf, use a smallish long sized one of a very pliable and gauze-like fabric."
    },
    {
      "headline":"Open the barrette or hair clip.",
      "description":""
    },
    {
      "headline":"Lay one end of the scarf so that it overlaps the fastener end (opening end) of the barrette or hair clip.",
      "description":""
    },
    {
      "headline":"Wrap the wire around the scarf and the end of the barrette or hair clip.",
      "description":"Attach the scarf to the barrette or hair clip at this point."
    },
    {
      "headline":"Fold the scarf around this part of the barrette.",
      "description":""
    },
    {
      "headline":"Using the wire, create a scarf loop.",
      "description":"It should end close to the original wire wrap. Pull the scarf mostly through this loop but leave enough behind to stand upright, as shown."
    },
    {
      "headline":"Wrap the one loop of wire over the end of the newly formed loop.",
      "description":""
    },
    {
      "headline":"Repeat.",
      "description":"Keep making wire loops and weaving the scarf through until you reach the hinge end of the barrette (or the scarf runs out, whichever comes first)."
    },
    {
      "headline":"Tuck the end of the scarf under itself to tie it all down neatly.",
      "description":"Wrap one last wire loop to hold it down."
    },
    {
      "headline":"Tie off the wire and clip the ends off.",
      "description":""
    },
    {
      "headline":"Adjust the loops of wire so that they lay evenly along the length of the barrette.",
      "description":"Adjust the scarf loops so that they sit up evenly across the barrette or hair clip and have a neat appearance overall."
    },
    {
      "headline":"Wear it and enjoy!",
      "description":""
    }
  ],
  "text":" Assemble the items needed. These are listed below under \"Things You'll Need\". For the scarf, use a smallish long sized one of a very pliable and gauze-like fabric. Open the barrette or hair clip.  Lay one end of the scarf so that it overlaps the fastener end (opening end) of the barrette or hair clip.  Wrap the wire around the scarf and the end of the barrette or hair clip. Attach the scarf to the barrette or hair clip at this point. Fold the scarf around this part of the barrette.  Using the wire, create a scarf loop. It should end close to the original wire wrap. Pull the scarf mostly through this loop but leave enough behind to stand upright, as shown. Wrap the one loop of wire over the end of the newly formed loop.  Repeat. Keep making wire loops and weaving the scarf through until you reach the hinge end of the barrette (or the scarf runs out, whichever comes first). Tuck the end of the scarf under itself to tie it all down neatly. Wrap one last wire loop to hold it down. Tie off the wire and clip the ends off.  Adjust the loops of wire so that they lay evenly along the length of the barrette. Adjust the scarf loops so that they sit up evenly across the barrette or hair clip and have a neat appearance overall. Wear it and enjoy! ",
  "tyn_model":[
    "scarf",
    "wire",
    "barrette"
  ],
  "tyn_section":[

  ]
}