{
  "title":"How to Get Rid of Pigeons",
  "url":"https://www.wikihow.com/Get-Rid-of-Pigeons",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control",
    "Bird Pest Control"
  ],
  "methods":[
    {
      "name":"Making Roosting Spaces Less Appealing",
      "steps":[
        {
          "headline":"Use anti-roosting spike strips.",
          "description":"You can attach these to just about any spot that a bird might want to perch, such as the roof of a house. Buy spikes at the hardware store or garden centers. Attach according to the manufacturer's instructions. A smoother alternative is to use a “Slinky” toy, available from department and toy stores. Spread it out along the handrail of a balcony, with the coils not more than 1 ⁄2 inches (3.8 cm) apart. Wire it (or use duct tape) in place every ⁄12 inch (1.7 cm). The pigeons hate it because it makes the surface uncomfortable for them to land on."
        },
        {
          "headline":"Install weatherproof string in popular roosting areas.",
          "description":"Tie the string from one end to another of the area. Place it about 1 inch (2.5 cm) above the perching spot. This will prevent them from being able to balance anywhere, so they cannot roost."
        },
        {
          "headline":"Install sloped sheathing.",
          "description":"Sheathing made of metal, plywood, or PVC provides a slippery surface that birds can't roost on. Sheathing products, such as BirdSlide™, consist of three sheaths that form right triangles. The base fits securely into flat roosting areas. The surface is a 40- to 60-degree angle that birds can't perch. Place it on eaves, ledges, window sills, and other flat areas where pigeons roost."
        },
        {
          "headline":"Avoid feeding pigeons.",
          "description":"Never feed pigeons or allow bird feeders to remain on your property. Pigeons have excellent memories when it comes to food sources. They'll constantly return to places where they have human accomplices. You can bend this rule if you're using pigeon birth control, which relies on the flock mentality and long memories for long-term effectiveness."
        },
        {
          "headline":"Eliminate other food sources.",
          "description":"Food sources for pigeons can include grass seed, berries from pyracantha bushes or olive trees, and dog or cat food left outside. Don't constantly put seed on a lawn if the seed isn’t germinating. Eliminating or controlling their access to the source of food will reduce the number of pigeons."
        }
      ]
    },
    {
      "name":"Sealing off Entrances",
      "steps":[
        {
          "headline":"Seal off your attic.",
          "description":"Fill any gaps between your roof shingles or in the siding of your house. Seal the edges of places where birds nest using hardware cloth and silicon caulk or plastic bird netting. Close off the space above the rafters where pigeons roost and nest with industrial bird netting. You can further prevent access to your attic by trimming tree branches that grow close to your roof."
        },
        {
          "headline":"Cap your chimneys.",
          "description":"Pigeons enjoy roosting in chimneys. Install mesh stainless steel caps that prevent animals from entering while still allowing smoke to escape. If you're not skilled at scaling roofs, call an expert to do this. Just make sure that no pigeons are in the chimney while it's being capped."
        },
        {
          "headline":"Tuck netting under places where pigeons nest.",
          "description":"Mesh is a popular humane deterrent because it can be used anywhere and is pleasing to the eye. Cover any surface where pigeons may perch or lay their eggs, such as under air conditioning units. This will prevent them from entering the place at all."
        },
        {
          "headline":"Hire professionals.",
          "description":"If you find pigeons in your attic or other interior spaces, hire a professional to install a one-way door. These devices allow the birds to exit the area but prevent them from re-entering. You can also hire professionals to clean up any droppings, feathers, or other refuse left behind. Professional cleaners will have the proper cleaning equipment and protection gear that might be too expensive to obtain on their own."
        }
      ]
    },
    {
      "name":"Scaring off the Pigeons",
      "steps":[
        {
          "headline":"Spray pigeons with water from a garden hose.",
          "description":"Pigeons won't appreciate the force or concentration of the water being targeted at them. Spray the birds when they first arrive. If you wait until they set up house, it will be too late."
        },
        {
          "headline":"Install “scare-pigeons.” These lightweight kites or decoys are sold in the form of hawk silhouettes.",
          "description":"Place them where the pigeons usually roost. Be aware that pigeons will grow used to the presence of mute raptors that “perch” in the same location. For good measure, move the decoy on a regular basis."
        },
        {
          "headline":"Use reflective surfaces.",
          "description":"When the sun hits reflective objects, it creates a prism effect that interferes with the birds' eyesight. Install reflective tape or foil balloons to scare away the pigeons. If money is tight, string old CDs from nearby trees or along awnings."
        }
      ]
    }
  ],
  "text":" Making Roosting Spaces Less Appealing Use anti-roosting spike strips. You can attach these to just about any spot that a bird might want to perch, such as the roof of a house. Buy spikes at the hardware store or garden centers. Attach according to the manufacturer's instructions. A smoother alternative is to use a “Slinky” toy, available from department and toy stores. Spread it out along the handrail of a balcony, with the coils not more than 1 ⁄2 inches (3.8 cm) apart. Wire it (or use duct tape) in place every ⁄12 inch (1.7 cm). The pigeons hate it because it makes the surface uncomfortable for them to land on. Install weatherproof string in popular roosting areas. Tie the string from one end to another of the area. Place it about 1 inch (2.5 cm) above the perching spot. This will prevent them from being able to balance anywhere, so they cannot roost. Install sloped sheathing. Sheathing made of metal, plywood, or PVC provides a slippery surface that birds can't roost on. Sheathing products, such as BirdSlide™, consist of three sheaths that form right triangles. The base fits securely into flat roosting areas. The surface is a 40- to 60-degree angle that birds can't perch. Place it on eaves, ledges, window sills, and other flat areas where pigeons roost. Avoid feeding pigeons. Never feed pigeons or allow bird feeders to remain on your property. Pigeons have excellent memories when it comes to food sources. They'll constantly return to places where they have human accomplices. You can bend this rule if you're using pigeon birth control, which relies on the flock mentality and long memories for long-term effectiveness. Eliminate other food sources. Food sources for pigeons can include grass seed, berries from pyracantha bushes or olive trees, and dog or cat food left outside. Don't constantly put seed on a lawn if the seed isn’t germinating. Eliminating or controlling their access to the source of food will reduce the number of pigeons. Sealing off Entrances Seal off your attic. Fill any gaps between your roof shingles or in the siding of your house. Seal the edges of places where birds nest using hardware cloth and silicon caulk or plastic bird netting. Close off the space above the rafters where pigeons roost and nest with industrial bird netting. You can further prevent access to your attic by trimming tree branches that grow close to your roof. Cap your chimneys. Pigeons enjoy roosting in chimneys. Install mesh stainless steel caps that prevent animals from entering while still allowing smoke to escape. If you're not skilled at scaling roofs, call an expert to do this. Just make sure that no pigeons are in the chimney while it's being capped. Tuck netting under places where pigeons nest. Mesh is a popular humane deterrent because it can be used anywhere and is pleasing to the eye. Cover any surface where pigeons may perch or lay their eggs, such as under air conditioning units. This will prevent them from entering the place at all. Hire professionals. If you find pigeons in your attic or other interior spaces, hire a professional to install a one-way door. These devices allow the birds to exit the area but prevent them from re-entering. You can also hire professionals to clean up any droppings, feathers, or other refuse left behind. Professional cleaners will have the proper cleaning equipment and protection gear that might be too expensive to obtain on their own. Scaring off the Pigeons Spray pigeons with water from a garden hose. Pigeons won't appreciate the force or concentration of the water being targeted at them. Spray the birds when they first arrive. If you wait until they set up house, it will be too late. Install “scare-pigeons.” These lightweight kites or decoys are sold in the form of hawk silhouettes. Place them where the pigeons usually roost. Be aware that pigeons will grow used to the presence of mute raptors that “perch” in the same location. For good measure, move the decoy on a regular basis. Use reflective surfaces. When the sun hits reflective objects, it creates a prism effect that interferes with the birds' eyesight. Install reflective tape or foil balloons to scare away the pigeons. If money is tight, string old CDs from nearby trees or along awnings.",
  "tyn_model":[
    "pigeons",
    "water",
    "anti-roosting spike strips",
    "spikes",
    "“slinky",
    "” toy",
    "duct tape",
    "weatherproof string",
    "string",
    "™,",
    "bird feeders",
    "berries",
    "hardware cloth",
    "silicon caulk",
    "industrial bird netting",
    "mesh",
    "humane deterrent",
    "air conditioning",
    "garden hose",
    "“scare",
    "” these",
    "kites",
    "“perch",
    "” in",
    "reflective tape",
    "foil balloons",
    "cds"
  ],
  "tyn_section":[

  ]
}