{
  "title":"How to Make Sprouts Tasty",
  "url":"https://www.wikihow.com/Make-Sprouts-Tasty",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables",
    "Cruciferous Vegetables"
  ],
  "methods":[
    {
      "name":"Making Seasoned Fried Sprouts",
      "steps":[
        {
          "headline":"Combine dry ingredients.",
          "description":"Believe it or not, the same sorts of sprouts that are often seen as flavorless or bland (like alfalfa sprouts and mung bean sprouts) can make a quick, easy, and delicious dish all on their own with the right seasonings! To begin, combine cayenne pepper, black pepper, and salt in a small bowl. Use the \"Seasoned Fried Sprouts\" ingredients list above for guidance. If you enjoy strong, spicy flavors, you may want to add any of your favorite seasonings to the dry mixture. A little cumin and curry powder can give this dish a savory twist, but there's no \"right\" way to prepare sprouts, so feel free to add other flavors as you please — for instance, ginger, garlic, and coriander are all good additions."
        },
        {
          "headline":"Heat oil in a pan.",
          "description":"We're going to sauté our sprouts, so we'll need a hot pan to start with. Add your sesame oil to a medium-sized frying pan on the stove, then set the burner to a medium-high heat. Allow the oil to heat until lightly shimmering or just barely smoking before continuing (this should only take a minute or two.) Note that, compared to other oils, sesame oil has a low smoke point, which means it will begin to produce smoke at fairly low temperatures (specifically, about 350-410°F/175-210°C.) This means you'll want to keep an eye on the stove while the oil heats — if cooked too hot, sesame oil will make lots of smoke, causing burnt-tasting food, a smokey kitchen, and a blaring smoke alarm, so reduce the heat once you notice smoke."
        },
        {
          "headline":"Sauté the sprouts in the pan.",
          "description":"When your oil's nice and hot, pour in the sprouts. They should immediately begin to sizzle — if they don't, increase the heat a little. Cook, stirring frequently, for about five minutes. Ideally, your sprouts should be fairly dry before you add them to the pan. Adding too much water can cause the oil to sputter and fizz, which can potentially lead to stains or burns. Try patting your sprouts down with a paper towel if you notice lots of water droplets on them."
        },
        {
          "headline":"Add seasoning when sprouts are almost clear and stir.",
          "description":"Your sprouts should cook fairly quickly. As they do so, you should start noticing them gradually lose their whitish color and turn translucent or clear. When they're almost clear, pour in your mix of dry seasonings and stir to coat the sprouts evenly. Cook for about one more minute, then remove from heat. You can add your seasonings to the dish earlier, but this isn't always advisable, since some seasonings (like black pepper) can burn if cooked too long. Adding the seasonings just before the dish is finished allows them to release their flavor and aroma while keeping your food safe from their acrid flavor when burnt."
        },
        {
          "headline":"Serve!",
          "description":"Congratulations — you've just made a delicious, nutritious, low-calorie dish from nothing more than a handful of sprouts and some basic spices! Enjoy your sprouts on their own or eat them with your favorite light carb (like rice, tortilla or flatbread) for a vegetarian snack."
        }
      ]
    },
    {
      "name":"Making a Spicy Sprout Salad",
      "steps":[
        {
          "headline":"Mix sprouts, onion, and tomatoes in a salad bowl.",
          "description":"You don't have to eat sprouts on their own — in fact, they're often best when paired with other ingredients with complementing flavors! In this recipe, we'll use sprouts as the \"greens\" for a basic salad. To start, gently toss your sprouts with chopped red onion and tomatoes in a mixing bowl. With their relatively mild flavor, red onions are frequently used for salads. However, if you find them too strong, try soaking them in water before adding them or using a sweet onion as an alternative. In terms of tomatoes, there's no wrong answer here — anything from a large, hearty beefsteak tomato to a handful of flavorful cherry tomatoes will work well."
        },
        {
          "headline":"Mix dry ingredients in separate bowl.",
          "description":"Next, add chili powder, salt, and chaat masala to a small mixing bowl. Stir to combine. Chaat masala is an Indian spice blend that's often available at ethnic grocers or in the \"spice\" aisle of well-stocked grocery stores. If you can't find any, you can approximate the flavor with cumin, salt, and crushed red pepper, though the final taste will be somewhat different."
        },
        {
          "headline":"Season salad with dry ingredients and lemon.",
          "description":"Spritz your veggies with the juice of half of a small lemon, then toss it gently to get an even coating. Sprinkle your dry seasonings over the dish and toss again to combine. The powdery seasoning should cling to the lemon juice, creating a sort of makeshift \"dressing\"."
        },
        {
          "headline":"Add coriander leaves (cilantro) and/or dressing if desired.",
          "description":"At this point, you may want to add a few coriander leaves to your salad if you have them available. Coriander leaves have a spicy, aromatic taste that complements the mild flavor of sprouts excellently. You may also add your preferred salad dressing, but use caution — not all dressings pair well with the tart, spicy taste of your lemon-and-spice seasoning. You may want to try testing dressings on individual sprouts until you find a taste you like."
        },
        {
          "headline":"Serve!",
          "description":"Congratulations! Your salad is ready to eat. Serve the salad on its own as a light, refreshing treat or as a side-dish for heartier main courses (especially Asian dishes.)"
        }
      ]
    },
    {
      "name":"Making a Moo Shu Sprout Dish",
      "steps":[
        {
          "headline":"Heat oil in a pan.",
          "description":"Sprouts aren't always featured in light side dishes — sometimes, they're part of the main course. For this hearty stir fry-style dish, we'll be preparing all of our ingredients in the same hot pan. To start, heat a teaspoon or so of sesame oil in a pan over medium-high heat until it shimmers or smokes ever-so-gently."
        },
        {
          "headline":"Cook eggs omelet-style.",
          "description":"Crack four eggs into a small bowl, beat or whisk them together, then add them to your hot pan. Turn the egg mixture frequently with a spoon or spatula to keep it from sticking to the bottom of the pan. Cook eggs until firm and omelet-like, but broken into pieces (not in one single piece like an actual omelet.) To be clear, you don't want a soft, smooth texture like you might use for scrambled eggs. You want your eggs cooked a little more solid — ideally, they should still be soft, but should have a bit of firm chewiness to them."
        },
        {
          "headline":"Cook ginger and garlic until soft and aromatic.",
          "description":"When your eggs are cooked, remove them to a plate and wipe the pan down with a paper towel or a clean rag. Toss in your ginger and garlic and allow them to sauté on their own for just a minute or two. When they're fragrant and lightly seared, continue to the next step. Don't wait too long — both ginger and garlic can burn if cooked on their own for more than a few minutes."
        },
        {
          "headline":"Add sprouts, vegetables, soy, vinegar, and half the scallions.",
          "description":"Once you add these vegetables and liquid ingredients to the pan, stir them to combine, then cover the pan. Let the vegetables simmer under the lid for about three minutes, stirring once or twice. Cook until the vegetables begin to soften before proceeding to the next step. Covering with a lid keeps the moisture of your ingredients contained in the pan, preventing them from drying out or searing while they soften (and helping them cook evenly.) If you're having a hard time getting your vegetables to soften or cook evenly, try adding a splash of water to the pan to create additional hot steam under the lid."
        },
        {
          "headline":"Add eggs, hoisin, and remaining scallions.",
          "description":"When your vegetables are softened, add all of the remaining ingredients to the pan. Your goal is now simply to warm the ingredients, not cook them any more. Once the ingredients are uniformly hot, you're done! Adding half of the scallions at the end of the cooking process keeps them crispy, which creates a pleasing contrast with the soft texture of the scallions you added earlier."
        },
        {
          "headline":"Serve!",
          "description":"Congratulations! You're ready to enjoy this filling, nutritious sprout-centric meal. Serve hot from the pan on a plate or serving platter (if feeding multiple people) and dig in!"
        }
      ]
    },
    {
      "name":"Using Sprouts in Other Recipes",
      "steps":[
        {
          "headline":"Use sprouts as a light salad garnish.",
          "description":"If you've got some extra sprouts lying around, you don't necessarily have to go to the trouble of making an entire sprout-based recipe — instead, try simply adding them to your favorite dish! For example, if you already have a salad ready, add sprouts over the top for an extra \"crunch!\" Sprouts' neutral flavor goes well with most salad ingredients, so don't be afraid to experiment! Sprouts don't just taste good in your salad — they can give it a big nutritional boost! Most sprouts are relatively rich in protein, vitamins A, C, and E, and other essential nutrients."
        },
        {
          "headline":"Add crunch to phos or soups.",
          "description":"Is your soup a little lacking? Try giving it with some texture with a handful of sprouts! Sprouts are frequently added to lend variety to clear Asian soups and broths (like, famously, Vietnamese pho soup). However, there's no reason not to add sprouts to other types of soup, so don't hesitate to toss some in your homemade chicken noodle soup or tomato bisque."
        },
        {
          "headline":"Use sprouts as a sandwich topper.",
          "description":"Iceberg lettuce tastes boring and, nutritionally speaking, is fairly weak. For a better alternative, use sprouts! Laying a handful of your favorite sprouts over the top of a sandwich's meats, vegetables, and cheeses gives the same satisfying, fresh crunch as lettuce with the addition of sprouts' nutrition benefits. Be careful to eat your sandwich over the plate after you add sprouts to it — no matter how hard you try, it's tricky to eat a \"sprout-y\" sandwich without some falling out."
        },
        {
          "headline":"Add sprouts to brown rice or quinoa dishes.",
          "description":"If you've ever ordered quinoa at a restaurant, you may have eaten sprouts without even knowing it. Sprouts are often added to quinoa, rice, couscous, and other grains to modify their taste and texture (and for nutritional reasons.) The grains mentioned here are already quite nutritious in their own right, so give them a further boost by stirring some sprouts in! Thinner sprouts like alfalfa are best for this — thick sprouts like mung bean sprouts aren't necessarily bad with grains, but their textures can pair somewhat oddly with the relative softness of the grains."
        }
      ]
    }
  ],
  "text":" Making Seasoned Fried Sprouts Combine dry ingredients. Believe it or not, the same sorts of sprouts that are often seen as flavorless or bland (like alfalfa sprouts and mung bean sprouts) can make a quick, easy, and delicious dish all on their own with the right seasonings! To begin, combine cayenne pepper, black pepper, and salt in a small bowl. Use the \"Seasoned Fried Sprouts\" ingredients list above for guidance. If you enjoy strong, spicy flavors, you may want to add any of your favorite seasonings to the dry mixture. A little cumin and curry powder can give this dish a savory twist, but there's no \"right\" way to prepare sprouts, so feel free to add other flavors as you please — for instance, ginger, garlic, and coriander are all good additions. Heat oil in a pan. We're going to sauté our sprouts, so we'll need a hot pan to start with. Add your sesame oil to a medium-sized frying pan on the stove, then set the burner to a medium-high heat. Allow the oil to heat until lightly shimmering or just barely smoking before continuing (this should only take a minute or two.) Note that, compared to other oils, sesame oil has a low smoke point, which means it will begin to produce smoke at fairly low temperatures (specifically, about 350-410°F/175-210°C.) This means you'll want to keep an eye on the stove while the oil heats — if cooked too hot, sesame oil will make lots of smoke, causing burnt-tasting food, a smokey kitchen, and a blaring smoke alarm, so reduce the heat once you notice smoke. Sauté the sprouts in the pan. When your oil's nice and hot, pour in the sprouts. They should immediately begin to sizzle — if they don't, increase the heat a little. Cook, stirring frequently, for about five minutes. Ideally, your sprouts should be fairly dry before you add them to the pan. Adding too much water can cause the oil to sputter and fizz, which can potentially lead to stains or burns. Try patting your sprouts down with a paper towel if you notice lots of water droplets on them. Add seasoning when sprouts are almost clear and stir. Your sprouts should cook fairly quickly. As they do so, you should start noticing them gradually lose their whitish color and turn translucent or clear. When they're almost clear, pour in your mix of dry seasonings and stir to coat the sprouts evenly. Cook for about one more minute, then remove from heat. You can add your seasonings to the dish earlier, but this isn't always advisable, since some seasonings (like black pepper) can burn if cooked too long. Adding the seasonings just before the dish is finished allows them to release their flavor and aroma while keeping your food safe from their acrid flavor when burnt. Serve! Congratulations — you've just made a delicious, nutritious, low-calorie dish from nothing more than a handful of sprouts and some basic spices! Enjoy your sprouts on their own or eat them with your favorite light carb (like rice, tortilla or flatbread) for a vegetarian snack. Making a Spicy Sprout Salad Mix sprouts, onion, and tomatoes in a salad bowl. You don't have to eat sprouts on their own — in fact, they're often best when paired with other ingredients with complementing flavors! In this recipe, we'll use sprouts as the \"greens\" for a basic salad. To start, gently toss your sprouts with chopped red onion and tomatoes in a mixing bowl. With their relatively mild flavor, red onions are frequently used for salads. However, if you find them too strong, try soaking them in water before adding them or using a sweet onion as an alternative. In terms of tomatoes, there's no wrong answer here — anything from a large, hearty beefsteak tomato to a handful of flavorful cherry tomatoes will work well. Mix dry ingredients in separate bowl. Next, add chili powder, salt, and chaat masala to a small mixing bowl. Stir to combine. Chaat masala is an Indian spice blend that's often available at ethnic grocers or in the \"spice\" aisle of well-stocked grocery stores. If you can't find any, you can approximate the flavor with cumin, salt, and crushed red pepper, though the final taste will be somewhat different. Season salad with dry ingredients and lemon. Spritz your veggies with the juice of half of a small lemon, then toss it gently to get an even coating. Sprinkle your dry seasonings over the dish and toss again to combine. The powdery seasoning should cling to the lemon juice, creating a sort of makeshift \"dressing\". Add coriander leaves (cilantro) and/or dressing if desired. At this point, you may want to add a few coriander leaves to your salad if you have them available. Coriander leaves have a spicy, aromatic taste that complements the mild flavor of sprouts excellently. You may also add your preferred salad dressing, but use caution — not all dressings pair well with the tart, spicy taste of your lemon-and-spice seasoning. You may want to try testing dressings on individual sprouts until you find a taste you like. Serve! Congratulations! Your salad is ready to eat. Serve the salad on its own as a light, refreshing treat or as a side-dish for heartier main courses (especially Asian dishes.) Making a Moo Shu Sprout Dish Heat oil in a pan. Sprouts aren't always featured in light side dishes — sometimes, they're part of the main course. For this hearty stir fry-style dish, we'll be preparing all of our ingredients in the same hot pan. To start, heat a teaspoon or so of sesame oil in a pan over medium-high heat until it shimmers or smokes ever-so-gently. Cook eggs omelet-style. Crack four eggs into a small bowl, beat or whisk them together, then add them to your hot pan. Turn the egg mixture frequently with a spoon or spatula to keep it from sticking to the bottom of the pan. Cook eggs until firm and omelet-like, but broken into pieces (not in one single piece like an actual omelet.) To be clear, you don't want a soft, smooth texture like you might use for scrambled eggs. You want your eggs cooked a little more solid — ideally, they should still be soft, but should have a bit of firm chewiness to them. Cook ginger and garlic until soft and aromatic. When your eggs are cooked, remove them to a plate and wipe the pan down with a paper towel or a clean rag. Toss in your ginger and garlic and allow them to sauté on their own for just a minute or two. When they're fragrant and lightly seared, continue to the next step. Don't wait too long — both ginger and garlic can burn if cooked on their own for more than a few minutes. Add sprouts, vegetables, soy, vinegar, and half the scallions. Once you add these vegetables and liquid ingredients to the pan, stir them to combine, then cover the pan. Let the vegetables simmer under the lid for about three minutes, stirring once or twice. Cook until the vegetables begin to soften before proceeding to the next step. Covering with a lid keeps the moisture of your ingredients contained in the pan, preventing them from drying out or searing while they soften (and helping them cook evenly.) If you're having a hard time getting your vegetables to soften or cook evenly, try adding a splash of water to the pan to create additional hot steam under the lid. Add eggs, hoisin, and remaining scallions. When your vegetables are softened, add all of the remaining ingredients to the pan. Your goal is now simply to warm the ingredients, not cook them any more. Once the ingredients are uniformly hot, you're done! Adding half of the scallions at the end of the cooking process keeps them crispy, which creates a pleasing contrast with the soft texture of the scallions you added earlier. Serve! Congratulations! You're ready to enjoy this filling, nutritious sprout-centric meal. Serve hot from the pan on a plate or serving platter (if feeding multiple people) and dig in! Using Sprouts in Other Recipes Use sprouts as a light salad garnish. If you've got some extra sprouts lying around, you don't necessarily have to go to the trouble of making an entire sprout-based recipe — instead, try simply adding them to your favorite dish! For example, if you already have a salad ready, add sprouts over the top for an extra \"crunch!\" Sprouts' neutral flavor goes well with most salad ingredients, so don't be afraid to experiment! Sprouts don't just taste good in your salad — they can give it a big nutritional boost! Most sprouts are relatively rich in protein, vitamins A, C, and E, and other essential nutrients. Add crunch to phos or soups. Is your soup a little lacking? Try giving it with some texture with a handful of sprouts! Sprouts are frequently added to lend variety to clear Asian soups and broths (like, famously, Vietnamese pho soup). However, there's no reason not to add sprouts to other types of soup, so don't hesitate to toss some in your homemade chicken noodle soup or tomato bisque. Use sprouts as a sandwich topper. Iceberg lettuce tastes boring and, nutritionally speaking, is fairly weak. For a better alternative, use sprouts! Laying a handful of your favorite sprouts over the top of a sandwich's meats, vegetables, and cheeses gives the same satisfying, fresh crunch as lettuce with the addition of sprouts' nutrition benefits. Be careful to eat your sandwich over the plate after you add sprouts to it — no matter how hard you try, it's tricky to eat a \"sprout-y\" sandwich without some falling out. Add sprouts to brown rice or quinoa dishes. If you've ever ordered quinoa at a restaurant, you may have eaten sprouts without even knowing it. Sprouts are often added to quinoa, rice, couscous, and other grains to modify their taste and texture (and for nutritional reasons.) The grains mentioned here are already quite nutritious in their own right, so give them a further boost by stirring some sprouts in! Thinner sprouts like alfalfa are best for this — thick sprouts like mung bean sprouts aren't necessarily bad with grains, but their textures can pair somewhat oddly with the relative softness of the grains.",
  "tyn_model":[
    "sprouts",
    "pan",
    "seasonings",
    "oil",
    "eggs",
    "vegetables",
    "ginger",
    "garlic",
    "coriander",
    "sesame oil",
    "water",
    "scallions",
    "salt",
    "tomatoes",
    "lemon",
    "black pepper",
    "— if",
    "chaat masala",
    "plate",
    "quinoa",
    "grains",
    "alfalfa sprouts",
    "mung bean sprouts",
    "cayenne pepper",
    "seasoned fried sprouts",
    "curry powder",
    "— for",
    "frying pan",
    "burner",
    "stove",
    "seasoning",
    "— you",
    "spices",
    "onion",
    "salad bowl",
    "— in",
    "red onion",
    "mixing bowl",
    "red onions",
    "sweet onion",
    "— anything",
    "cherry tomatoes",
    "chili powder",
    "cumin",
    "crushed red pepper",
    "cilantro",
    "salad dressing",
    "— not",
    "lemon-and-spice seasoning",
    "— sometimes",
    "stir fry-style dish",
    "spoon",
    "spatula",
    "scrambled eggs",
    "— ideally",
    "paper towel",
    "— both",
    "vinegar",
    "hoisin",
    "sprout",
    "— instead",
    "— they",
    "chicken noodle soup",
    "tomato bisque",
    "iceberg lettuce",
    "lettuce",
    "— no",
    "brown rice",
    "rice",
    "couscous",
    "alfalfa",
    "— thick"
  ],
  "tyn_section":[

  ]
}