{
  "title":"How to Make Chocolate Coconut Bars",
  "url":"https://www.wikihow.com/Make-Chocolate-Coconut-Bars",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cookies and Biscuits",
    "Bars and Slices"
  ],
  "steps":[
    {
      "headline":"Combine flour, baking powder, and salt into a bowl and set it aside.",
      "description":""
    },
    {
      "headline":"Crack the eggs into a mixing bowl and add  sugar.",
      "description":"Beat at a medium speed with an  electric mixer until it becomes thickened and light lemon colored. Stir in the contents of the bowl that you have set aside. This is the batter."
    },
    {
      "headline":"Combine coconut and 1/2 cup of the batter in a separate bowl and set that aside.",
      "description":"Stir the chocolate into the remaining batter."
    },
    {
      "headline":"Pour the chocolate mixture into a greased and floured 8 inch (20.3 cm) square pan.",
      "description":"Dollop the coconut mixture on top. Swirl the coconut batter into the chocolate batter with a knife or narrow metal spatula."
    },
    {
      "headline":"Bake at 350ºF/180ºC for 20-25 minutes or until a wooden toothpick or a cake tester inserted in the center comes out clean.",
      "description":""
    },
    {
      "headline":"Cool the pan on a wire rack, cut your creation into bars or hearts, and enjoy!",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Combine flour, baking powder, and salt into a bowl and set it aside.  Crack the eggs into a mixing bowl and add  sugar. Beat at a medium speed with an  electric mixer until it becomes thickened and light lemon colored. Stir in the contents of the bowl that you have set aside. This is the batter. Combine coconut and 1/2 cup of the batter in a separate bowl and set that aside. Stir the chocolate into the remaining batter. Pour the chocolate mixture into a greased and floured 8 inch (20.3 cm) square pan. Dollop the coconut mixture on top. Swirl the coconut batter into the chocolate batter with a knife or narrow metal spatula. Bake at 350ºF/180ºC for 20-25 minutes or until a wooden toothpick or a cake tester inserted in the center comes out clean.  Cool the pan on a wire rack, cut your creation into bars or hearts, and enjoy!  Finished. ",
  "tyn_model":[
    "bowl",
    "coconut",
    "chocolate",
    "flour",
    "baking powder",
    "salt",
    "eggs",
    "mixing bowl",
    "sugar",
    "electric mixer",
    "coconut batter",
    "chocolate batter",
    "knife",
    "cake tester"
  ],
  "tyn_section":[

  ]
}