{
  "title":"How to Migrate Pokémon to Soul Silver",
  "url":"https://www.wikihow.com/Migrate-Pok%C3%A9mon-to-Soul-Silver",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo DS"
  ],
  "parts":[
    {
      "name":"Loading Soul Silver",
      "steps":[
        {
          "headline":"Plug in the Soul Silver game cartridge to the smaller slot at the top of the Nintendo DS.",
          "description":"Soul Silver uses the new DS game cartridge, which is a lot smaller compared to the early ones."
        },
        {
          "headline":"Plug in any Game Boy Advance Pokémon cartridge into the slot provided at the bottom of your Nintendo DS.",
          "description":"Yes, you can use any Game Boy Advance Pokémon game as long as it fits into the Game Boy Cartridge slot provided at the bottom of the DS."
        },
        {
          "headline":"Power on your Nintendo DS.",
          "description":"Slide the Power switch at the right side of the device upward to turn it on. Wait for the Soul Silver screen to load."
        },
        {
          "headline":"Enter the game’s menu.",
          "description":"Once Soul Silver finishes loading, press the Start button on the title screen when prompted to enter the game’s main menu."
        }
      ]
    },
    {
      "name":"Migrating Your Pokémon",
      "steps":[
        {
          "headline":"Select “Migrate from [name of the Pokémon Gameboy cartridge you inserted]” from the menu.",
          "description":"Use the DS’ arrow buttons to navigate through the main menu to this option. Tap on the lower screen to select the option. The device will ask you if you want to migrate Pokémon from the Game Boy cartridge."
        },
        {
          "headline":"Tap on \"Yes\" to proceed.",
          "description":"A message will then appear on the screen warning you that once you migrate, you can’t return the Pokémon back to the Game Boy Pak. Again, tap on \"Yes\" to confirm."
        },
        {
          "headline":"Choose which Pokémon to migrate.",
          "description":"Simply tap on the Pokémon you want to move (a red dot will identify the ones you’ve selected), and press the green right arrow to proceed. A small text box will appear telling you how many Pokémon you’ve selected. Simply tap on “Yes” to continue."
        },
        {
          "headline":"Confirm the migration.",
          "description":"Another confirmation screen will appear, just press \"Yes\" again to proceed, and the migration process will begin, which will take a few seconds. Once the migration finishes, press the A button of the device and Soul Silver will reload."
        }
      ]
    },
    {
      "name":"Getting the Pokémon You Migrated",
      "steps":[
        {
          "headline":"Load your saved game.",
          "description":"After Soul Silver has reloaded and the title screen has appeared, press the Start button to continue to the main menu. Scroll down and tap on \"Continue\" to load your saved game."
        },
        {
          "headline":"Go to a building called Pal Park.",
          "description":"This is located in Fuchsia City. Pal Park is a place where events like Catching Show are held."
        },
        {
          "headline":"Join the Catching Show.",
          "description":"Enter the building and talk to the character behind the desk, and you will be asked if you want to participate in the Catching Show. Tap on Yes, and you will be lead to a field at the back of the building, where you’ll be given six Park Balls to use to catch Pokémon."
        },
        {
          "headline":"Catch Pokémon.",
          "description":"Roam around the grassy areas of the field and you’ll encounter wild Pokémon. The Pokémon you’ll encounter here are the ones you migrated. Just throw a Park Ball at the Pokémon to catch them, bringing those Pokémon back to your roster."
        }
      ]
    }
  ],
  "text":" Loading Soul Silver Plug in the Soul Silver game cartridge to the smaller slot at the top of the Nintendo DS. Soul Silver uses the new DS game cartridge, which is a lot smaller compared to the early ones. Plug in any Game Boy Advance Pokémon cartridge into the slot provided at the bottom of your Nintendo DS. Yes, you can use any Game Boy Advance Pokémon game as long as it fits into the Game Boy Cartridge slot provided at the bottom of the DS. Power on your Nintendo DS. Slide the Power switch at the right side of the device upward to turn it on. Wait for the Soul Silver screen to load. Enter the game’s menu. Once Soul Silver finishes loading, press the Start button on the title screen when prompted to enter the game’s main menu. Migrating Your Pokémon Select “Migrate from [name of the Pokémon Gameboy cartridge you inserted]” from the menu. Use the DS’ arrow buttons to navigate through the main menu to this option. Tap on the lower screen to select the option. The device will ask you if you want to migrate Pokémon from the Game Boy cartridge. Tap on \"Yes\" to proceed. A message will then appear on the screen warning you that once you migrate, you can’t return the Pokémon back to the Game Boy Pak. Again, tap on \"Yes\" to confirm. Choose which Pokémon to migrate. Simply tap on the Pokémon you want to move (a red dot will identify the ones you’ve selected), and press the green right arrow to proceed. A small text box will appear telling you how many Pokémon you’ve selected. Simply tap on “Yes” to continue. Confirm the migration. Another confirmation screen will appear, just press \"Yes\" again to proceed, and the migration process will begin, which will take a few seconds. Once the migration finishes, press the A button of the device and Soul Silver will reload. Getting the Pokémon You Migrated Load your saved game. After Soul Silver has reloaded and the title screen has appeared, press the Start button to continue to the main menu. Scroll down and tap on \"Continue\" to load your saved game. Go to a building called Pal Park. This is located in Fuchsia City. Pal Park is a place where events like Catching Show are held. Join the Catching Show. Enter the building and talk to the character behind the desk, and you will be asked if you want to participate in the Catching Show. Tap on Yes, and you will be lead to a field at the back of the building, where you’ll be given six Park Balls to use to catch Pokémon. Catch Pokémon. Roam around the grassy areas of the field and you’ll encounter wild Pokémon. The Pokémon you’ll encounter here are the ones you migrated. Just throw a Park Ball at the Pokémon to catch them, bringing those Pokémon back to your roster.",
  "tyn_model":[
    "nintendo ds",
    "game boy advance",
    "game boy",
    "soul silver",
    "game boy cartridge",
    "“migrate",
    "” from",
    "ds",
    "’ arrow",
    "pokémon",
    "“yes",
    "” to",
    "device",
    "park ball"
  ],
  "tyn_section":[

  ]
}