{
  "title":"How to Make a Pie Crust in a Food Processor",
  "url":"https://www.wikihow.com/Make-a-Pie-Crust-in-a-Food-Processor",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Pastries",
    "Pie Crusts"
  ],
  "steps":[
    {
      "headline":"Place all dry ingredients in the food processor, with the multi-purpose blade (the standard metal cutting one) and pulse three to five times for 1 1/2 seconds  for each pulse.",
      "description":""
    },
    {
      "headline":"Add the butter, that has been cut into little chunks, and pulse three to five times for 1 1/2 seconds per pulse.",
      "description":"Lift the mixture completely by stirring it in an upwards motion, bringing the ingredients on the bottom to the top."
    },
    {
      "headline":"Add shortening in little chunks; pulse three to five times for 1 1/2 seconds per pulse.",
      "description":"Lift the mixture again."
    },
    {
      "headline":"Add three or four tbs.",
      "description":"of iced water (no chunks of ice should be added) and pulse three to five times for 1 1/2 seconds per pulse. Lift mixture."
    },
    {
      "headline":"Add three or four more tbs.",
      "description":"of water. Pulse and lift, as directed above. Add just enough water so that the mixture forms a dough and lifts away from the food processor walls."
    },
    {
      "headline":"Squeeze some of the mixture in your hand.",
      "description":"It should be slightly sticky but still soft and fluffy."
    },
    {
      "headline":"Transfer the mixture into a bowl and shape into two approximately even balls.",
      "description":""
    },
    {
      "headline":"Set down a large sheet of waxed paper or a pastry cloth with some flour on it.",
      "description":"Use your hand to press one of the balls into a disc. Then roll it out, being careful not to rip it, until it's a bit bigger then the pie pan that is being used to bake the crust in."
    },
    {
      "headline":"Place your pie pan on the rolled out dough upside down and.",
      "description":"Using the wax paper to lift the dough, flip the it over. Tuck your pie dough down into the pan without stretching or ripping it."
    },
    {
      "headline":"Use the other dough for the top crust or for a second pie, depending on your recipe.",
      "description":""
    },
    {
      "headline":"Form the outer crust by pinching with fingers or pressing a fork along the rim.",
      "description":"If the pie has a top crust, form both edges together."
    },
    {
      "headline":"Trim off any excess with a knife and roll it into the next crust.",
      "description":"If you have small scraps left over, you can bake them separately with a little cinnamon and sugar, and just enough butter to make it stick."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Place all dry ingredients in the food processor, with the multi-purpose blade (the standard metal cutting one) and pulse three to five times for 1 1/2 seconds  for each pulse.  Add the butter, that has been cut into little chunks, and pulse three to five times for 1 1/2 seconds per pulse. Lift the mixture completely by stirring it in an upwards motion, bringing the ingredients on the bottom to the top. Add shortening in little chunks; pulse three to five times for 1 1/2 seconds per pulse. Lift the mixture again. Add three or four tbs. of iced water (no chunks of ice should be added) and pulse three to five times for 1 1/2 seconds per pulse. Lift mixture. Add three or four more tbs. of water. Pulse and lift, as directed above. Add just enough water so that the mixture forms a dough and lifts away from the food processor walls. Squeeze some of the mixture in your hand. It should be slightly sticky but still soft and fluffy. Transfer the mixture into a bowl and shape into two approximately even balls.  Set down a large sheet of waxed paper or a pastry cloth with some flour on it. Use your hand to press one of the balls into a disc. Then roll it out, being careful not to rip it, until it's a bit bigger then the pie pan that is being used to bake the crust in. Place your pie pan on the rolled out dough upside down and. Using the wax paper to lift the dough, flip the it over. Tuck your pie dough down into the pan without stretching or ripping it. Use the other dough for the top crust or for a second pie, depending on your recipe.  Form the outer crust by pinching with fingers or pressing a fork along the rim. If the pie has a top crust, form both edges together. Trim off any excess with a knife and roll it into the next crust. If you have small scraps left over, you can bake them separately with a little cinnamon and sugar, and just enough butter to make it stick. Finished. ",
  "tyn_model":[
    "food processor",
    "butter",
    "water",
    "pie pan",
    "multi-purpose blade",
    "iced water",
    "bowl",
    "waxed paper",
    "pastry cloth",
    "flour",
    "wax paper",
    "pie dough",
    "fork",
    "knife",
    "cinnamon",
    "sugar"
  ],
  "tyn_section":[

  ]
}