{
  "title":"How to Make Ham Croquettes",
  "url":"https://www.wikihow.com/Make-Ham-Croquettes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Pork"
  ],
  "methods":[
    {
      "name":"Traditional Ham Croquettes",
      "steps":[
        {
          "headline":"Sauté the scallions.",
          "description":"Heat the butter in a saucepan over medium heat until the butter melts. Add the scallions and flour. Stir the mixture and cook about 2 minutes until the scallions start to soften a bit."
        },
        {
          "headline":"Make a roux.",
          "description":"Slowly add in the milk while you whisk. Keep whisking and cooking until the mixture thickens up and the flour dissolves. There shouldn't be any lumps."
        },
        {
          "headline":"Add the ham.",
          "description":"Stir in the diced ham and take the pan off of the heat."
        },
        {
          "headline":"Add the eggs yolks.",
          "description":"Whisk the mixture very quickly while you add the egg yolks. Make sure they are completely incorporated."
        },
        {
          "headline":"Stir in the seasonings.",
          "description":"Put the pan back on the stove over medium heat and add the mustard, sage, salt, and pepper. Stir well till the mixture is combined. Set it aside to cool completely. To speed up cooling, spread the mixture on a baking sheet."
        },
        {
          "headline":"Prepare to coat the croquettes.",
          "description":"In one bowl, whisk the egg and water. Set it aside. Set the breadcrumbs aside in another bowl."
        },
        {
          "headline":"Heat your oil.",
          "description":"Place the oil in a large pot on the stove and heat it to 375 degrees. You really need to have a deep-fry thermometer to gauge how hot the oil is. Your croquettes may not cook evenly if the oil is too hot or not hot enough."
        },
        {
          "headline":"Shape the croquettes.",
          "description":"Using a spoon or cookie scoop, scoop 1 tablespoon of your cooled ham and cheese mixture. Shape the mixture into a 2-inch oval. Repeat this with the rest of the mixture. Dust your hands with flour to make shaping easier. Floured hands will keep the mixture from sticking to your hands."
        },
        {
          "headline":"Dredge or coat the croquettes.",
          "description":"Take an oval and completely cover it in the whisked egg. Then place it in the breadcrumbs. Roll it around so the croquette is completely covered. Place it on a baking sheet lined with wax paper or parchment paper. Repeat this for the rest of the croquettes."
        },
        {
          "headline":"Fry the croquettes.",
          "description":"When your oil has reached 375 degrees F, carefully lower 3 or 4 croquettes at a time into the oil. Do this slowly or the temperature of the oil will drop quickly, making them cook unevenly. Fry the croquettes for 1 or 2 minutes, or until they're completely golden brown. Fry the rest of the croquettes and let them cool off a little bit before you serve them. Keep checking the temperature of the oil as you fry the other batches of croquettes."
        },
        {
          "headline":"Take the cooked croquettes out of the oil.",
          "description":"Remove the cooked croquettes with a slotted spoon and set them on paper towels to cool a little. Then serve them."
        }
      ]
    },
    {
      "name":"Ham and Cheese Croquettes",
      "steps":[
        {
          "headline":"Sauté the onion.",
          "description":"Heat the butter and oil in a saucepan over medium heat until the butter melts. Add the minced onion, salt, and pepper. Stir the onion and cook until it turns clear, about 3 minutes."
        },
        {
          "headline":"Make a roux.",
          "description":"Add the flour to the onions and stir really well, letting it cook for 1 minute. Whisk or stir in the milk. Keep stirring and cooking the mixture for about 3 minutes. There shouldn't be any lumps and the mixture should start to thicken a little."
        },
        {
          "headline":"Add the ham and cheese.",
          "description":"Stir in the finely diced ham and 1/3 of the grated cheese. The mixture should be very thick but not lumpy, like a paste, by this point. Set the mixture aside to cool completely. To speed up cooling, spread the mixture on a baking sheet."
        },
        {
          "headline":"Prepare to coat the croquettes.",
          "description":"In one bowl, whisk the eggs and set them aside. In another bowl, stir together the breadcrumbs and the remaining 1/4 cup of Manchego cheese. Set this mixture aside."
        },
        {
          "headline":"Heat the oil.",
          "description":"Place the oil in a large pot on the stove and heat it to 375 degrees. You really need to have a deep-fry thermometer to gauge how hot the oil is. Your croquettes may not cook evenly if the oil is too hot or not hot enough."
        },
        {
          "headline":"Shape the croquettes.",
          "description":"Using a spoon or cookie scoop, scoop 1 tablespoon of your cooled ham and cheese mixture. Shape the mixture into a 2-inch oval. Repeat this with the rest of the mixture. Dust your hands with flour to make shaping easier. Floured hands will keep the mixture from sticking to your hands."
        },
        {
          "headline":"Dredge or coat the croquettes.",
          "description":"Take an oval and completely cover it in the whisked egg. Then place it in the breadcrumb and cheese coating. Roll it around so the croquette is completely covered. Place it on a baking sheet lined with wax paper or parchment paper. Repeat this for the rest of the croquettes."
        },
        {
          "headline":"Fry the croquettes.",
          "description":"When your oil has reached 375 degrees F, carefully lower 3 or 4 croquettes at a time into the oil. Do this slowly or the temperature of the oil will drop quickly, making them cook unevenly. Fry the croquettes for 1 or 2 minutes, or until they're completely golden brown. Fry the rest of the croquettes and let them cool off a little bit before you serve them. Keep checking the temperature of the oil as you fry the other batches of croquettes."
        },
        {
          "headline":"Remove the cooked croquettes.",
          "description":"Remove the cooked croquettes with a slotted spoon and set them on paper towels to cool a little."
        }
      ]
    }
  ],
  "text":" Traditional Ham Croquettes Sauté the scallions. Heat the butter in a saucepan over medium heat until the butter melts. Add the scallions and flour. Stir the mixture and cook about 2 minutes until the scallions start to soften a bit. Make a roux. Slowly add in the milk while you whisk. Keep whisking and cooking until the mixture thickens up and the flour dissolves. There shouldn't be any lumps. Add the ham. Stir in the diced ham and take the pan off of the heat. Add the eggs yolks. Whisk the mixture very quickly while you add the egg yolks. Make sure they are completely incorporated. Stir in the seasonings. Put the pan back on the stove over medium heat and add the mustard, sage, salt, and pepper. Stir well till the mixture is combined. Set it aside to cool completely. To speed up cooling, spread the mixture on a baking sheet. Prepare to coat the croquettes. In one bowl, whisk the egg and water. Set it aside. Set the breadcrumbs aside in another bowl. Heat your oil. Place the oil in a large pot on the stove and heat it to 375 degrees. You really need to have a deep-fry thermometer to gauge how hot the oil is. Your croquettes may not cook evenly if the oil is too hot or not hot enough. Shape the croquettes. Using a spoon or cookie scoop, scoop 1 tablespoon of your cooled ham and cheese mixture. Shape the mixture into a 2-inch oval. Repeat this with the rest of the mixture. Dust your hands with flour to make shaping easier. Floured hands will keep the mixture from sticking to your hands. Dredge or coat the croquettes. Take an oval and completely cover it in the whisked egg. Then place it in the breadcrumbs. Roll it around so the croquette is completely covered. Place it on a baking sheet lined with wax paper or parchment paper. Repeat this for the rest of the croquettes. Fry the croquettes. When your oil has reached 375 degrees F, carefully lower 3 or 4 croquettes at a time into the oil. Do this slowly or the temperature of the oil will drop quickly, making them cook unevenly. Fry the croquettes for 1 or 2 minutes, or until they're completely golden brown. Fry the rest of the croquettes and let them cool off a little bit before you serve them. Keep checking the temperature of the oil as you fry the other batches of croquettes. Take the cooked croquettes out of the oil. Remove the cooked croquettes with a slotted spoon and set them on paper towels to cool a little. Then serve them. Ham and Cheese Croquettes Sauté the onion. Heat the butter and oil in a saucepan over medium heat until the butter melts. Add the minced onion, salt, and pepper. Stir the onion and cook until it turns clear, about 3 minutes. Make a roux. Add the flour to the onions and stir really well, letting it cook for 1 minute. Whisk or stir in the milk. Keep stirring and cooking the mixture for about 3 minutes. There shouldn't be any lumps and the mixture should start to thicken a little. Add the ham and cheese. Stir in the finely diced ham and 1/3 of the grated cheese. The mixture should be very thick but not lumpy, like a paste, by this point. Set the mixture aside to cool completely. To speed up cooling, spread the mixture on a baking sheet. Prepare to coat the croquettes. In one bowl, whisk the eggs and set them aside. In another bowl, stir together the breadcrumbs and the remaining 1/4 cup of Manchego cheese. Set this mixture aside. Heat the oil. Place the oil in a large pot on the stove and heat it to 375 degrees. You really need to have a deep-fry thermometer to gauge how hot the oil is. Your croquettes may not cook evenly if the oil is too hot or not hot enough. Shape the croquettes. Using a spoon or cookie scoop, scoop 1 tablespoon of your cooled ham and cheese mixture. Shape the mixture into a 2-inch oval. Repeat this with the rest of the mixture. Dust your hands with flour to make shaping easier. Floured hands will keep the mixture from sticking to your hands. Dredge or coat the croquettes. Take an oval and completely cover it in the whisked egg. Then place it in the breadcrumb and cheese coating. Roll it around so the croquette is completely covered. Place it on a baking sheet lined with wax paper or parchment paper. Repeat this for the rest of the croquettes. Fry the croquettes. When your oil has reached 375 degrees F, carefully lower 3 or 4 croquettes at a time into the oil. Do this slowly or the temperature of the oil will drop quickly, making them cook unevenly. Fry the croquettes for 1 or 2 minutes, or until they're completely golden brown. Fry the rest of the croquettes and let them cool off a little bit before you serve them. Keep checking the temperature of the oil as you fry the other batches of croquettes. Remove the cooked croquettes. Remove the cooked croquettes with a slotted spoon and set them on paper towels to cool a little.",
  "tyn_model":[
    "oil",
    "ham",
    "cheese",
    "flour",
    "butter",
    "baking sheet",
    "stove",
    "onion",
    "scallions",
    "saucepan",
    "milk",
    "pan",
    "salt",
    "pepper",
    "large pot",
    "deep-fry thermometer",
    "spoon",
    "breadcrumbs",
    "wax paper",
    "parchment paper",
    "slotted spoon",
    "paper towels",
    "whisk",
    "eggs yolks",
    "egg yolks",
    "seasonings",
    "mustard",
    "sage",
    "water",
    "bowl",
    "whisked egg",
    "onions",
    "eggs",
    "egg",
    "breadcrumb"
  ],
  "tyn_section":[

  ]
}