{
  "title":"How to Order at Chipotle",
  "url":"https://www.wikihow.com/Order-at-Chipotle",
  "category_hierarchy":[
    "Food and Entertaining",
    "Dining Out"
  ],
  "methods":[
    {
      "name":"Ordering From the Standard Menu",
      "steps":[
        {
          "headline":"Choose your “vessel.” You can have a burrito in a large flour tortilla, crispy or soft corn tacos or soft flour tacos.",
          "description":"If you don’t want any tortillas, you can order a burrito bowl or a salad. You can choose to order a “double-wrapped burrito” with two flour tortilla shells at no additional charge. This is best to do if you like more of a bite or if you plan on piling your burrito too high to wrap with just one tortilla. The standard “tacos” orders will get you three tacos with the choice of soft flour or corn tortillas or crispy fried corn taco shells. You can also order a “single taco” or \"two tacos\" as long as you specify it at the beginning of your order."
        },
        {
          "headline":"Choose your rice.",
          "description":"Burritos and burrito bowls will also come with brown or white cilantro-lime rice, which you can decline if you choose. Brown rice is the healthier choice with a slightly thicker texture and a nuttier flavor than white rice."
        },
        {
          "headline":"Decide if you want black or pinto beans.",
          "description":"Black beans have slightly fewer calories in them than pinto beans, but other than that, there’s not much difference in nutritional value."
        },
        {
          "headline":"Decide whether or not you want a serving of the fajita vegetable mix at no extra charge.",
          "description":"Made with bell peppers, onions, and fresh oregano, the veggies add color and a wonderful flavor to your meal."
        },
        {
          "headline":"Choose your protein.",
          "description":"You can ask for a little more or less protein if you feel like the 4 oz serving doesn't suit your tastes but keep in mind that you will be charged extra if you ask for a double serving of meat, and if you choose to get less than a serving, you'll get charged for the 4 ounces. Braised pork carnitas, the CEO, Steve Ells' favorite and the least spicy meat. Adobo-marinated grilled chicken, the second least spiciest meat and the most popular protein option. Sofritas, Chipotle's vegan protein option. Made from poblano peppers and tofu, sofritas packs a punch. Barbacoa, shredded beef, the second spiciest meat on the menu. Adobo-marinated steak. There is no spicier meat in the entire restaurant. Milder tastes beware!"
        },
        {
          "headline":"Tell them if you want your choice of salsas, sour cream and cheese.",
          "description":"Customize your order by saying you want a lot or very little of these items. They have several kinds of salsa, so choose according to the amount of spice you like:\nFresh tomato salsa (mild)\nRoasted chili-corn salsa (medium)\nTomatillo-green chili salsa (medium)\nTomatillo-red chili salsa (hot)"
        },
        {
          "headline":"Opt to order guacamole, but remember it will result in an extra charge.",
          "description":"Some Chipotle fans claim that if you order it on the side, you get substantially more, even though the amount should add up to 4 oz either way."
        },
        {
          "headline":"Choose to add fresh cilantro, onions, hot sauce, lettuce or extra on most items.",
          "description":"You will get these items for free. You will choose these items when your order is half filled and a Chipotle employee is adding fresh ingredients to the top before they wrap it up."
        },
        {
          "headline":"Add freshly made chips and guacamole for a side.",
          "description":"This is an extra charge with any order. Chips are around $1.27, while chips and guacamole are close to three dollars."
        },
        {
          "headline":"Order off the kid’s menu.",
          "description":"There are two options. All kids meals have the choice of a small bag of chips or fruit on the side and organic milk or juice to drink. A small cheese quesadilla with two sides. Chipotle workers may automatically add rice and beans as your side, but you have the choice to pick anything off the line. You may add meat or guacamole to the quesadilla for an extra charge. A build your own kit. This comes with two soft or crispy taco shells, one meat, and any two ingredients of your choice."
        },
        {
          "headline":"Finish with a regular or large fountain soda or a bottled drink.",
          "description":"Some locations have margaritas or beer at for between $4 and $7."
        }
      ]
    },
    {
      "name":"Ordering Special Items",
      "steps":[
        {
          "headline":"Order a quesadilla.",
          "description":"As with most standard quesadillas, it includes cheese on a large flour tortilla. It is not on the menu, but your friend behind the glass will know how to make it."
        },
        {
          "headline":"Experiment with “quesarito.” Try to order this when there isn't a line, as it takes a while.",
          "description":"You will receive burrito ingredients wrapped in a cheesy quesadilla. Order half the ingredients of a burrito with this option, and they might call it a “burritodilla,” because it’s flatter, like a quesadilla."
        },
        {
          "headline":"Pick nachos.",
          "description":"For a small additional charge, you can get cheese, beans, meat and salsa on top of fresh tortilla chips."
        },
        {
          "headline":"Order “free” extras.",
          "description":"You can ask for extra rice or an extra tortilla for free. One “hack” includes ordering a burrito bowl and asking for a free tortilla. You can even get the tortilla draped inside of the bowl under all the toppings. It's the best of both worlds: the amount of food in the bowl and the soft, warmness of a burrito-sized tortilla."
        },
        {
          "headline":"Choose the burrito bowl if you are hungry.",
          "description":"You can fit more food when it comes with a bowl. Ask for the free tortilla to make your own mini burrito."
        },
        {
          "headline":"Divvy up your order.",
          "description":"Order both black and pinto beans, or half one type of meat and half of another type of meat."
        }
      ]
    }
  ],
  "text":" Ordering From the Standard Menu Choose your “vessel.” You can have a burrito in a large flour tortilla, crispy or soft corn tacos or soft flour tacos. If you don’t want any tortillas, you can order a burrito bowl or a salad. You can choose to order a “double-wrapped burrito” with two flour tortilla shells at no additional charge. This is best to do if you like more of a bite or if you plan on piling your burrito too high to wrap with just one tortilla. The standard “tacos” orders will get you three tacos with the choice of soft flour or corn tortillas or crispy fried corn taco shells. You can also order a “single taco” or \"two tacos\" as long as you specify it at the beginning of your order. Choose your rice. Burritos and burrito bowls will also come with brown or white cilantro-lime rice, which you can decline if you choose. Brown rice is the healthier choice with a slightly thicker texture and a nuttier flavor than white rice. Decide if you want black or pinto beans. Black beans have slightly fewer calories in them than pinto beans, but other than that, there’s not much difference in nutritional value. Decide whether or not you want a serving of the fajita vegetable mix at no extra charge. Made with bell peppers, onions, and fresh oregano, the veggies add color and a wonderful flavor to your meal. Choose your protein. You can ask for a little more or less protein if you feel like the 4 oz serving doesn't suit your tastes but keep in mind that you will be charged extra if you ask for a double serving of meat, and if you choose to get less than a serving, you'll get charged for the 4 ounces. Braised pork carnitas, the CEO, Steve Ells' favorite and the least spicy meat. Adobo-marinated grilled chicken, the second least spiciest meat and the most popular protein option. Sofritas, Chipotle's vegan protein option. Made from poblano peppers and tofu, sofritas packs a punch. Barbacoa, shredded beef, the second spiciest meat on the menu. Adobo-marinated steak. There is no spicier meat in the entire restaurant. Milder tastes beware! Tell them if you want your choice of salsas, sour cream and cheese. Customize your order by saying you want a lot or very little of these items. They have several kinds of salsa, so choose according to the amount of spice you like:\nFresh tomato salsa (mild)\nRoasted chili-corn salsa (medium)\nTomatillo-green chili salsa (medium)\nTomatillo-red chili salsa (hot) Opt to order guacamole, but remember it will result in an extra charge. Some Chipotle fans claim that if you order it on the side, you get substantially more, even though the amount should add up to 4 oz either way. Choose to add fresh cilantro, onions, hot sauce, lettuce or extra on most items. You will get these items for free. You will choose these items when your order is half filled and a Chipotle employee is adding fresh ingredients to the top before they wrap it up. Add freshly made chips and guacamole for a side. This is an extra charge with any order. Chips are around $1.27, while chips and guacamole are close to three dollars. Order off the kid’s menu. There are two options. All kids meals have the choice of a small bag of chips or fruit on the side and organic milk or juice to drink. A small cheese quesadilla with two sides. Chipotle workers may automatically add rice and beans as your side, but you have the choice to pick anything off the line. You may add meat or guacamole to the quesadilla for an extra charge. A build your own kit. This comes with two soft or crispy taco shells, one meat, and any two ingredients of your choice. Finish with a regular or large fountain soda or a bottled drink. Some locations have margaritas or beer at for between $4 and $7. Ordering Special Items Order a quesadilla. As with most standard quesadillas, it includes cheese on a large flour tortilla. It is not on the menu, but your friend behind the glass will know how to make it. Experiment with “quesarito.” Try to order this when there isn't a line, as it takes a while. You will receive burrito ingredients wrapped in a cheesy quesadilla. Order half the ingredients of a burrito with this option, and they might call it a “burritodilla,” because it’s flatter, like a quesadilla. Pick nachos. For a small additional charge, you can get cheese, beans, meat and salsa on top of fresh tortilla chips. Order “free” extras. You can ask for extra rice or an extra tortilla for free. One “hack” includes ordering a burrito bowl and asking for a free tortilla. You can even get the tortilla draped inside of the bowl under all the toppings. It's the best of both worlds: the amount of food in the bowl and the soft, warmness of a burrito-sized tortilla. Choose the burrito bowl if you are hungry. You can fit more food when it comes with a bowl. Ask for the free tortilla to make your own mini burrito. Divvy up your order. Order both black and pinto beans, or half one type of meat and half of another type of meat.",
  "tyn_model":[
    "rice",
    "guacamole",
    "burrito bowl",
    "chips",
    "bowl",
    "onions",
    "sofritas",
    "cheese",
    "tortilla",
    "“vessel",
    "” you",
    "“double",
    "” with",
    "flour tortilla shells",
    "“tacos",
    "” orders",
    "corn tortillas",
    "“single",
    "” or",
    "burritos",
    "burrito bowls",
    "white rice",
    "fajita vegetable mix",
    "bell peppers",
    "oregano",
    "braised pork carnitas",
    "adobo-marinated",
    "grilled chicken",
    "tofu",
    "barbacoa",
    "salsas",
    "sour cream",
    "salsa",
    "fresh tomato salsa",
    "roasted chili-corn salsa",
    "green chili salsa",
    "chipotle fans",
    "cilantro",
    "hot sauce",
    "lettuce",
    "chipotle employee",
    "organic milk",
    "chipotle workers",
    "fountain soda",
    "quesadilla",
    "“quesarito",
    "” try",
    "burrito",
    "“burritodilla",
    "” because",
    "nachos",
    "tortilla chips",
    "“free",
    "” extras",
    "“hack",
    "” includes",
    "burrito-sized",
    "pinto beans"
  ],
  "tyn_section":[

  ]
}