{
  "title":"How to Use Old Coffee Grounds Around the House",
  "url":"https://www.wikihow.com/Use-Old-Coffee-Grounds-Around-the-House",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Coffee"
  ],
  "methods":[
    {
      "name":"Preparing the Coffee Grounds for Use",
      "steps":[
        {
          "headline":"Remove the used coffee filter from the coffee pot.",
          "description":"Empty the coffee grounds onto a paper towel."
        },
        {
          "headline":"Spread the coffee grounds around the paper towel.",
          "description":"Allow them to dry for twenty-four hours."
        },
        {
          "headline":"Decide what you'd like to do with the coffee grounds.",
          "description":"Several methods are suggested here. if not using, put them into an airtight container for use later. Be sure to label it, as this is for reuse in household needs, not as a drink."
        }
      ]
    },
    {
      "name":"Making Body Scrub Using Coffee Grounds",
      "steps":[
        {
          "headline":"Gather the ingredients onto a work surface.",
          "description":"As well as the oil, vanilla extract and sugar, you'll need 1/3 cup of dried coffee grounds."
        },
        {
          "headline":"Add all of these ingredients to a bowl.",
          "description":"Pour the oil in last. Stir to mix the ingredients together."
        },
        {
          "headline":"Rub the body scrub on slightly wet skin.",
          "description":"Allow to soak for one to three minutes."
        },
        {
          "headline":"Rinse the body scrub away with warm water.",
          "description":"Dab dry gently with a clean towel. Add moisturizer or lotion, as desired."
        }
      ]
    },
    {
      "name":"Making Potpourri Using Coffee Grounds",
      "steps":[
        {
          "headline":"Gather three cups of dried flower petals of your choice.",
          "description":"Ideal flowers include dried rose petals, dried lavender, dried pansies and the like. You'll also need a vanilla or mocha body spray along with 3/4 of a cup of the dried coffee grounds."
        },
        {
          "headline":"Lay the dried petals out on a paper towel.",
          "description":"Lay them out in a thin layer."
        },
        {
          "headline":"Spray the petals lightly with body spray.",
          "description":"Don't overdo this, the scent shouldn't be too intense. You can always add more if needed."
        },
        {
          "headline":"Mix the petals and coffee grounds in a small bowl.",
          "description":""
        },
        {
          "headline":"Cover the bowl with a lid or saran wrap.",
          "description":"Allow to sit for 2 weeks, to let the scents infuse. You may find it needs longer, up to 6 weeks, to smell its best."
        },
        {
          "headline":"Uncover the bowl when you feel it is ready to use.",
          "description":"This will reveal the scent. Choose a place to put the potpourri bowl, to allow the scent to waft around your house."
        }
      ]
    }
  ],
  "text":" Preparing the Coffee Grounds for Use Remove the used coffee filter from the coffee pot. Empty the coffee grounds onto a paper towel. Spread the coffee grounds around the paper towel. Allow them to dry for twenty-four hours. Decide what you'd like to do with the coffee grounds. Several methods are suggested here. if not using, put them into an airtight container for use later. Be sure to label it, as this is for reuse in household needs, not as a drink. Making Body Scrub Using Coffee Grounds Gather the ingredients onto a work surface. As well as the oil, vanilla extract and sugar, you'll need 1/3 cup of dried coffee grounds. Add all of these ingredients to a bowl. Pour the oil in last. Stir to mix the ingredients together. Rub the body scrub on slightly wet skin. Allow to soak for one to three minutes. Rinse the body scrub away with warm water. Dab dry gently with a clean towel. Add moisturizer or lotion, as desired. Making Potpourri Using Coffee Grounds Gather three cups of dried flower petals of your choice. Ideal flowers include dried rose petals, dried lavender, dried pansies and the like. You'll also need a vanilla or mocha body spray along with 3/4 of a cup of the dried coffee grounds. Lay the dried petals out on a paper towel. Lay them out in a thin layer. Spray the petals lightly with body spray. Don't overdo this, the scent shouldn't be too intense. You can always add more if needed. Mix the petals and coffee grounds in a small bowl.  Cover the bowl with a lid or saran wrap. Allow to sit for 2 weeks, to let the scents infuse. You may find it needs longer, up to 6 weeks, to smell its best. Uncover the bowl when you feel it is ready to use. This will reveal the scent. Choose a place to put the potpourri bowl, to allow the scent to waft around your house.",
  "tyn_model":[
    "coffee grounds",
    "bowl",
    "paper towel",
    "oil",
    "body scrub",
    "coffee filter",
    "coffee pot",
    "airtight container",
    "vanilla extract",
    "sugar",
    "water",
    "lavender",
    "vanilla or mocha body spray",
    "body spray",
    "small bowl",
    "saran wrap",
    "potpourri bowl"
  ],
  "tyn_section":[

  ]
}