{
  "title":"How to Make Easy Rocky Road Using Digestive Biscuits",
  "url":"https://www.wikihow.com/Make-Easy-Rocky-Road-Using-Digestive-Biscuits",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts"
  ],
  "steps":[
    {
      "headline":"Combine the chocolate, butter and syrup in a pan over heat.",
      "description":"Stir till you get a thick glossy chocolate mix with no lumps. Reserve 60ml of this mixture in a jug and put the jug aside."
    },
    {
      "headline":"Crush the digestives in a freezer bag with a rolling pin.",
      "description":"Leave some larger pieces to add extra crunch."
    },
    {
      "headline":"Add the crushed biscuits to the non-reserved chocolate mix.",
      "description":"Add the marshmallows too. Stir till you get a new thick crunchy mixture."
    },
    {
      "headline":"Pour the mixture into a baking tin of whatever size, according to how thin or thick you want your rocky road to be.",
      "description":"It is recommended that you use a small-medium square baking tin."
    },
    {
      "headline":"Pour the reserved chocolate mix evenly across the rocky road.",
      "description":""
    },
    {
      "headline":"Place in the fridge.",
      "description":"Chill for at least 2 hours but preferably overnight, for best results."
    },
    {
      "headline":"Cut into pieces.",
      "description":"Once taken out of the fridge, cut into equal rectangular pieces."
    },
    {
      "headline":"Serve on a plate for your friends and family.",
      "description":"Be proud as they compliment you on your rocky roads and remember to save a big slice for yourself! These are best eaten for the first two days after making but can realistically still taste nice for about six."
    }
  ],
  "text":" Combine the chocolate, butter and syrup in a pan over heat. Stir till you get a thick glossy chocolate mix with no lumps. Reserve 60ml of this mixture in a jug and put the jug aside. Crush the digestives in a freezer bag with a rolling pin. Leave some larger pieces to add extra crunch. Add the crushed biscuits to the non-reserved chocolate mix. Add the marshmallows too. Stir till you get a new thick crunchy mixture. Pour the mixture into a baking tin of whatever size, according to how thin or thick you want your rocky road to be. It is recommended that you use a small-medium square baking tin. Pour the reserved chocolate mix evenly across the rocky road.  Place in the fridge. Chill for at least 2 hours but preferably overnight, for best results. Cut into pieces. Once taken out of the fridge, cut into equal rectangular pieces. Serve on a plate for your friends and family. Be proud as they compliment you on your rocky roads and remember to save a big slice for yourself! These are best eaten for the first two days after making but can realistically still taste nice for about six.",
  "tyn_model":[
    "chocolate",
    "baking tin",
    "fridge",
    "butter",
    "syrup",
    "pan",
    "jug",
    "freezer bag",
    "rolling pin",
    "biscuits",
    "marshmallows",
    "plate"
  ],
  "tyn_section":[

  ]
}