{
  "title":"How to Find Hidden Secrets or \"Easter Eggs\" in Programs or Games",
  "url":"https://www.wikihow.com/Find-Hidden-Secrets-or-%22Easter-Eggs%22-in-Programs-or-Games",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "steps":[
    {
      "headline":"Look around in the program files.",
      "description":"Many times there will be pictures or files hidden there."
    },
    {
      "headline":"Look in the \"help\", or \"about\" section of the program.",
      "description":"Many times it will involve holding down some keys (like shift or ctrl) while opening the \"help\" or \"about\" file."
    },
    {
      "headline":"Try looking up forums for that program or game; often when people find one, they will become excited and tell everyone.",
      "description":""
    },
    {
      "headline":"Try searching on Google, (i.e.",
      "description":"(your program) Easter eggs or hidden secrets)."
    },
    {
      "headline":"In games, look around and explore every inch of the game world.",
      "description":"Often programmers will name characters something funny; it may just take a while for you to realize that it is a inside joke."
    },
    {
      "headline":"Search for the program or game on Eeggs for a huge list.",
      "description":""
    },
    {
      "headline":"Also, you can also use the \"tab\" key to search for places that can be clicked.",
      "description":""
    }
  ],
  "text":" Look around in the program files. Many times there will be pictures or files hidden there. Look in the \"help\", or \"about\" section of the program. Many times it will involve holding down some keys (like shift or ctrl) while opening the \"help\" or \"about\" file. Try looking up forums for that program or game; often when people find one, they will become excited and tell everyone.  Try searching on Google, (i.e. (your program) Easter eggs or hidden secrets). In games, look around and explore every inch of the game world. Often programmers will name characters something funny; it may just take a while for you to realize that it is a inside joke. Search for the program or game on Eeggs for a huge list.  Also, you can also use the \"tab\" key to search for places that can be clicked. ",
  "tyn_model":[
    "program"
  ],
  "tyn_section":[

  ]
}