{
  "title":"How to Make Peach Lemonade",
  "url":"https://www.wikihow.com/Make-Peach-Lemonade",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Citrus Based Drinks",
    "Lemonade Drinks"
  ],
  "steps":[
    {
      "headline":"Put the sugar, cinnamon sticks and 1 cup of water into a large, heavy-based saucepan.",
      "description":""
    },
    {
      "headline":"Heat the liquid on low heat and stir regularly until sugar dissolves (approximately 5 - 8 minutes).",
      "description":""
    },
    {
      "headline":"Allow to simmer for approximately quarter of an hour or until the mixture thickens to a syrup-like consistency.",
      "description":""
    },
    {
      "headline":"Remove from the heat and allow to cool.",
      "description":""
    },
    {
      "headline":"Remove the cinnamon sticks from the cooled liquid.",
      "description":""
    },
    {
      "headline":"Add the peaches and mint to a blender or food processor.",
      "description":"Pour in the cooled liquid and blend or process until smooth."
    },
    {
      "headline":"Pour the smooth mixture into a glass jug.",
      "description":"Cover if not serving immediately and refrigerate to chill."
    },
    {
      "headline":"Serve.",
      "description":"Pour some of this syrup into a glass, add crushed ice and fill with bottle lemonade. Float a slice of lemon at the top of the drink. The mint pieces will also float in small pieces and this adds to the presentation of the drink."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Put the sugar, cinnamon sticks and 1 cup of water into a large, heavy-based saucepan.  Heat the liquid on low heat and stir regularly until sugar dissolves (approximately 5 - 8 minutes).  Allow to simmer for approximately quarter of an hour or until the mixture thickens to a syrup-like consistency.  Remove from the heat and allow to cool.  Remove the cinnamon sticks from the cooled liquid.  Add the peaches and mint to a blender or food processor. Pour in the cooled liquid and blend or process until smooth. Pour the smooth mixture into a glass jug. Cover if not serving immediately and refrigerate to chill. Serve. Pour some of this syrup into a glass, add crushed ice and fill with bottle lemonade. Float a slice of lemon at the top of the drink. The mint pieces will also float in small pieces and this adds to the presentation of the drink. Finished. ",
  "tyn_model":[
    "sugar",
    "water",
    "large, heavy-based saucepan",
    "cinnamon sticks",
    "peaches",
    "mint",
    "blender",
    "food processor",
    "glass jug",
    "glass",
    "crushed ice",
    "bottle lemonade",
    "lemon"
  ],
  "tyn_section":[

  ]
}