{
  "title":"How to Make Ribena Halloween Punch",
  "url":"https://www.wikihow.com/Make-Ribena-Halloween-Punch",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Mocktails"
  ],
  "steps":[
    {
      "headline":"Make up Ribena or blackcurrant-flavored drink.",
      "description":"Pour the liquid into the punch bowl."
    },
    {
      "headline":"Pour an equal amount of fizzy lemonade in.",
      "description":"This will dilute the mixture, so if you want the drink stronger, pour in less lemonade or add more neat Ribena."
    },
    {
      "headline":"Add small amounts of other juices for taste.",
      "description":"Or add chopped-up pieces of fruit."
    },
    {
      "headline":"Add garnish items.",
      "description":"Some examples of gross edible items include:\nEyeballs made from black grape or olive halves attached to kiwifruit halves. Frozen hand made from a strong solution of Ribena (so that it doesn't dilute the flavor as it melts)\nGummy worms or gel-based candies in the shapes of things such as brains, fingers, etc. False teeth candies."
    },
    {
      "headline":"Keep chilled in the refrigerator until serving.",
      "description":"Cover with a lid or some plastic food wrap prior to serving."
    },
    {
      "headline":"Serve.",
      "description":"Place in the center of the table or buffet setting, along with an appropriate serving spoon or cup. Happy Halloween!"
    }
  ],
  "text":" Make up Ribena or blackcurrant-flavored drink. Pour the liquid into the punch bowl. Pour an equal amount of fizzy lemonade in. This will dilute the mixture, so if you want the drink stronger, pour in less lemonade or add more neat Ribena. Add small amounts of other juices for taste. Or add chopped-up pieces of fruit. Add garnish items. Some examples of gross edible items include:\nEyeballs made from black grape or olive halves attached to kiwifruit halves. Frozen hand made from a strong solution of Ribena (so that it doesn't dilute the flavor as it melts)\nGummy worms or gel-based candies in the shapes of things such as brains, fingers, etc. False teeth candies. Keep chilled in the refrigerator until serving. Cover with a lid or some plastic food wrap prior to serving. Serve. Place in the center of the table or buffet setting, along with an appropriate serving spoon or cup. Happy Halloween!",
  "tyn_model":[
    "lemonade",
    "ribena",
    "punch bowl",
    "gummy worms",
    "false teeth candies",
    "refrigerator",
    "plastic food wrap"
  ],
  "tyn_section":[

  ]
}