{
  "title":"How to Play Age of Empires 3",
  "url":"https://www.wikihow.com/Play-Age-of-Empires-3",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Understand the difference of micro and macro, and be able to identify the three most basic strategies.",
          "description":"The Rush is one of the simplest strategies around, but there is quite a lot of risk involved with it. With the rush the player sacrifices the economy in order to build an army before the enemy has any way to counter it. Because the rushing player sacrifices so much of his economy for an early attack, a failed rush often results in the victory for the other player. The most famous is perhaps the Zergling Rush from Starcraft. Rushing in AoE3 is very hard because the defending player can garrison all his villagers inside the town center and build some anti-rush forces for a small fee. The Boom is quite hard to do, as it require the player to balance economic growth and military investments. The idea is to keep military investments at a minimum through the first parts of the game, building up the economy until the point where you can overpower your opponent with superior forces through upgrades. A single misstep, though, and your forces might be outnumbered and defeated in the early parts of the game. The Turtle, or Turtling as it's called is a defensive strategy as the name suggests. The player invests only in a small force and builds more static defense like towers. When turtling you focus on economy and defense, not building an attacking force. Macro is the term given to any gameplay that benefits the player in the long term. Expanding your base or taking map control are examples of macro. Macro is to micro as strategy is to tactics. With good macro you will always have a good army and plenty of resources. Micro is the opposite of macro, and refers to moving individual units. It is most often used about military units. Good micro is an essential skill, and it can make your troops a lot more effective. It is a skill that must be practiced, but there is a good amount of techniques that can be learned. One example is \"dancing\", where a player takes a ranged unit, fires at a melee one, moves away and fires again. Repeating this process, the melee unit won't be able to land a single hit on the ranged unit."
        },
        {
          "headline":"Prepare for the game by adjusting some settings in the User Interface.",
          "description":"You should choose to have the list of players enabled, which allows you to see which age your enemy is in and how many trading posts he has. The game score also indicates how well you're doing compared to the enemy. In addition, make sure you can see additional information about how you distribute your villagers. This way you can see how many villagers are working on gathering resources at any time. Start a normal Skirmish game and select one computer opponent. You should be able to beat the computer on the difficulty Hard without too much trouble if you're familiar with the interface and the game. It does not matter what civilization you choose; what you read in this guide applies to the whole game. The map you choose is of great importance. Avoid water maps because it complicates the road for victory. Also, to keep things as straight-forward as possible avoid maps with choke points. You may want to select \"Record Game\" and thus be able to review your own game and figure out what went wrong in case you should lose."
        }
      ]
    },
    {
      "name":"Discovery Age",
      "steps":[
        {
          "headline":"Focus on collecting as much food as possible as soon as the game starts.",
          "description":"Gather at all the crates first, and build a house to support the villagers that will pop out. Then focus on hunting or gathering berries. You absolutely do not want to build mills until you've exhausted all the natural resources. You should also start creating villagers from the very beginning, and you should have continuous production of them until you choose to age up to the Colonial Age. So make sure you have enough food."
        },
        {
          "headline":"Select your explorer and start exploring.",
          "description":"You want to locate the enemy base as soon as possible. He will probably be as far away from the edge as you are, so circle the entire map at that distance from the edge. Discovering the enemy's location is not too difficult. It's also useful to assign your explorer a number. To do this, select him and press control + (number)."
        },
        {
          "headline":"Make 2-3 villagers gather wood, and consider making a market.",
          "description":"Wood is very precious at this stage of the game, and building a market won't benefit you immediately. You will, however, have a stronger economy later in the game. If you don't build a market you will have your barracks up sooner. One thing to keep in mind while gathering resources is to spread your villagers around, thus reducing risk. As an example, you can mine from two goldmines instead of one. This does require some more attention to detail, though, and it can be harder to protect your villagers in case you're being attacked."
        },
        {
          "headline":"Build your economy related buildings away from the enemy, and your military units toward him.",
          "description":"This way your economy will have some protection while your troops won't be obstructed by buildings. Build close to the town center and build towers for protection."
        },
        {
          "headline":"Keep your villagers hunting as close to the town center as possible as it offers protection from harassment.",
          "description":"While hunting you'll gradually scare animals away from your town center, but you can avoid this by hunting from the outside and towards your town center. By using a couple of villagers you can scare groups of animals towards your home base for more security. You can also consider building a tower/outpost/blockhouse later in the game to support your hunting if it's a long way from your home base. If attacked, simply hide your villagers inside and if the enemy persists, bring in your troops. Doing this also increases your map control and can help you notice enemy advancements."
        },
        {
          "headline":"Advance to the Colonial Age when you have at least 17 villagers.",
          "description":"For more skilled players 15 villagers is more advisable but beware for you must know what you are doing economy wise if you chose this strategy."
        }
      ]
    },
    {
      "name":"Colonial Age",
      "steps":[
        {
          "headline":"Start building your barracks immediately.",
          "description":"If possible, you should also send a shipment with military troops. As soon as your barracks are built, start building troops. When you have an army of 10-20 men including your explorer, go for an attack. This attack is far from the final blow, but it can be really decisive.If you've done a good job of scouting, you might be able to locate the enemy's villagers. At least some of them are likely to be hunting out of reach from towers and enemy forces. Raiding these will give you an advantage. First of all, villagers cost resources so just by killing a few villagers you can force your opponent to spend money on something else than military troops. Second, a dead villager doesn't collect resources, you can add all the resources a villager could have been gathered to the loss. Thirdly, you're denying the enemy player resources. Hopefully he will retreat his villagers and in this period of time he will, of course, not be able to gather resources with those villagers.Note that this isn't a rush. It's called harassment and its purpose is not to defeat the enemy base. Therefore, keep your troops alive and do not attack buildings. In fact, you should ignore towers and trading posts. With some luck and skill you will be able to take the lead at this point through a stronger economy."
        },
        {
          "headline":"Keep producing troops while raiding the enemy villagers.",
          "description":"Many players are unable to focus on both building their home base and engaging in military operations, and it is simply something that takes practice. The buildings you need the most at this point are the market, if you hadn't already built it, and the stable. You can expect your population to go up, so try to stay ahead of the curve and build houses."
        },
        {
          "headline":"Expect an attack around this time.",
          "description":"Instead of going for the very early harass, you could wait for the enemy to come to you. When he attacks you, take out his force with the support from towers etc and immediately go for a counter-attack."
        },
        {
          "headline":"Notice what type of playing style you have.",
          "description":"You may wish to age up again quickly, or if things are going well, keep producing and sending units. If you feel that you can produce units faster than the enemy can kill yours even with you sitting in his base, do just that. Build one more barracks and pump out troops as fast as possible. You might also be able to take this path to victory if you're able to take down the enemy barracks. If your enemy is aging up, you want to age up as well in most cases."
        }
      ]
    },
    {
      "name":"Fortress Age",
      "steps":[
        {
          "headline":"Try to respond to your opponents' building and counter his units.",
          "description":"However, as the game progresses, it becomes harder and harder to give advice. As an example, if your opponent builds three stables you should make a lot of pikemen to counter cavalry. But the number of strategies you can use at this point is so large that it's impossible to say that something is wrong to do."
        },
        {
          "headline":"Try to macro up regardless.",
          "description":"The later units become more gold-demanding (especially artillery), so an extra plantation is a good idea. Also, you should be exhausted for natural resources at this point, so if you still have villagers hunting half-across the map, pull them back and build a mill instead. If you're low on wood, consider some extra gold and use the market to buy wood. But it's not cost-effective, so only buy wood when you need it badly (for buildings or ships). With units, you should be able to find an alternative without a wood-cost."
        },
        {
          "headline":"Get your fortress up as soon as possible.",
          "description":"Be offensive with the placement of your fortress, but don't overreach yourself. If you can't back up your fortress with forces at a few moments notice you risk losing it."
        },
        {
          "headline":"Do not feel limited by a population cap of 200.",
          "description":"Remember that units not fighting are a waste and that upgrading units is more effective when you already have them. Likewise, don't upgrade units if you don't have any. Beyond the Fortress Age, the idea of the game is to basically keep producing troops and tech-ing up. Cards are your friends. Your card shipments are incredibly useful. Somethings such as forts and military units have to wait for there are many more useful shipments. Increasing your speed time of infantry and cavalry is very useful and needed. Make a deck that suits you but have many essential cards such as crates of wood, food, or coin or many improvements to give you an advantage against your opponent."
        }
      ]
    }
  ],
  "text":" Steps Understand the difference of micro and macro, and be able to identify the three most basic strategies. The Rush is one of the simplest strategies around, but there is quite a lot of risk involved with it. With the rush the player sacrifices the economy in order to build an army before the enemy has any way to counter it. Because the rushing player sacrifices so much of his economy for an early attack, a failed rush often results in the victory for the other player. The most famous is perhaps the Zergling Rush from Starcraft. Rushing in AoE3 is very hard because the defending player can garrison all his villagers inside the town center and build some anti-rush forces for a small fee. The Boom is quite hard to do, as it require the player to balance economic growth and military investments. The idea is to keep military investments at a minimum through the first parts of the game, building up the economy until the point where you can overpower your opponent with superior forces through upgrades. A single misstep, though, and your forces might be outnumbered and defeated in the early parts of the game. The Turtle, or Turtling as it's called is a defensive strategy as the name suggests. The player invests only in a small force and builds more static defense like towers. When turtling you focus on economy and defense, not building an attacking force. Macro is the term given to any gameplay that benefits the player in the long term. Expanding your base or taking map control are examples of macro. Macro is to micro as strategy is to tactics. With good macro you will always have a good army and plenty of resources. Micro is the opposite of macro, and refers to moving individual units. It is most often used about military units. Good micro is an essential skill, and it can make your troops a lot more effective. It is a skill that must be practiced, but there is a good amount of techniques that can be learned. One example is \"dancing\", where a player takes a ranged unit, fires at a melee one, moves away and fires again. Repeating this process, the melee unit won't be able to land a single hit on the ranged unit. Prepare for the game by adjusting some settings in the User Interface. You should choose to have the list of players enabled, which allows you to see which age your enemy is in and how many trading posts he has. The game score also indicates how well you're doing compared to the enemy. In addition, make sure you can see additional information about how you distribute your villagers. This way you can see how many villagers are working on gathering resources at any time. Start a normal Skirmish game and select one computer opponent. You should be able to beat the computer on the difficulty Hard without too much trouble if you're familiar with the interface and the game. It does not matter what civilization you choose; what you read in this guide applies to the whole game. The map you choose is of great importance. Avoid water maps because it complicates the road for victory. Also, to keep things as straight-forward as possible avoid maps with choke points. You may want to select \"Record Game\" and thus be able to review your own game and figure out what went wrong in case you should lose. Discovery Age Focus on collecting as much food as possible as soon as the game starts. Gather at all the crates first, and build a house to support the villagers that will pop out. Then focus on hunting or gathering berries. You absolutely do not want to build mills until you've exhausted all the natural resources. You should also start creating villagers from the very beginning, and you should have continuous production of them until you choose to age up to the Colonial Age. So make sure you have enough food. Select your explorer and start exploring. You want to locate the enemy base as soon as possible. He will probably be as far away from the edge as you are, so circle the entire map at that distance from the edge. Discovering the enemy's location is not too difficult. It's also useful to assign your explorer a number. To do this, select him and press control + (number). Make 2-3 villagers gather wood, and consider making a market. Wood is very precious at this stage of the game, and building a market won't benefit you immediately. You will, however, have a stronger economy later in the game. If you don't build a market you will have your barracks up sooner. One thing to keep in mind while gathering resources is to spread your villagers around, thus reducing risk. As an example, you can mine from two goldmines instead of one. This does require some more attention to detail, though, and it can be harder to protect your villagers in case you're being attacked. Build your economy related buildings away from the enemy, and your military units toward him. This way your economy will have some protection while your troops won't be obstructed by buildings. Build close to the town center and build towers for protection. Keep your villagers hunting as close to the town center as possible as it offers protection from harassment. While hunting you'll gradually scare animals away from your town center, but you can avoid this by hunting from the outside and towards your town center. By using a couple of villagers you can scare groups of animals towards your home base for more security. You can also consider building a tower/outpost/blockhouse later in the game to support your hunting if it's a long way from your home base. If attacked, simply hide your villagers inside and if the enemy persists, bring in your troops. Doing this also increases your map control and can help you notice enemy advancements. Advance to the Colonial Age when you have at least 17 villagers. For more skilled players 15 villagers is more advisable but beware for you must know what you are doing economy wise if you chose this strategy. Colonial Age Start building your barracks immediately. If possible, you should also send a shipment with military troops. As soon as your barracks are built, start building troops. When you have an army of 10-20 men including your explorer, go for an attack. This attack is far from the final blow, but it can be really decisive.If you've done a good job of scouting, you might be able to locate the enemy's villagers. At least some of them are likely to be hunting out of reach from towers and enemy forces. Raiding these will give you an advantage. First of all, villagers cost resources so just by killing a few villagers you can force your opponent to spend money on something else than military troops. Second, a dead villager doesn't collect resources, you can add all the resources a villager could have been gathered to the loss. Thirdly, you're denying the enemy player resources. Hopefully he will retreat his villagers and in this period of time he will, of course, not be able to gather resources with those villagers.Note that this isn't a rush. It's called harassment and its purpose is not to defeat the enemy base. Therefore, keep your troops alive and do not attack buildings. In fact, you should ignore towers and trading posts. With some luck and skill you will be able to take the lead at this point through a stronger economy. Keep producing troops while raiding the enemy villagers. Many players are unable to focus on both building their home base and engaging in military operations, and it is simply something that takes practice. The buildings you need the most at this point are the market, if you hadn't already built it, and the stable. You can expect your population to go up, so try to stay ahead of the curve and build houses. Expect an attack around this time. Instead of going for the very early harass, you could wait for the enemy to come to you. When he attacks you, take out his force with the support from towers etc and immediately go for a counter-attack. Notice what type of playing style you have. You may wish to age up again quickly, or if things are going well, keep producing and sending units. If you feel that you can produce units faster than the enemy can kill yours even with you sitting in his base, do just that. Build one more barracks and pump out troops as fast as possible. You might also be able to take this path to victory if you're able to take down the enemy barracks. If your enemy is aging up, you want to age up as well in most cases. Fortress Age Try to respond to your opponents' building and counter his units. However, as the game progresses, it becomes harder and harder to give advice. As an example, if your opponent builds three stables you should make a lot of pikemen to counter cavalry. But the number of strategies you can use at this point is so large that it's impossible to say that something is wrong to do. Try to macro up regardless. The later units become more gold-demanding (especially artillery), so an extra plantation is a good idea. Also, you should be exhausted for natural resources at this point, so if you still have villagers hunting half-across the map, pull them back and build a mill instead. If you're low on wood, consider some extra gold and use the market to buy wood. But it's not cost-effective, so only buy wood when you need it badly (for buildings or ships). With units, you should be able to find an alternative without a wood-cost. Get your fortress up as soon as possible. Be offensive with the placement of your fortress, but don't overreach yourself. If you can't back up your fortress with forces at a few moments notice you risk losing it. Do not feel limited by a population cap of 200. Remember that units not fighting are a waste and that upgrading units is more effective when you already have them. Likewise, don't upgrade units if you don't have any. Beyond the Fortress Age, the idea of the game is to basically keep producing troops and tech-ing up. Cards are your friends. Your card shipments are incredibly useful. Somethings such as forts and military units have to wait for there are many more useful shipments. Increasing your speed time of infantry and cavalry is very useful and needed. Make a deck that suits you but have many essential cards such as crates of wood, food, or coin or many improvements to give you an advantage against your opponent.",
  "tyn_model":[
    "units",
    "wood",
    "explorer",
    "rush",
    "food",
    "turtle",
    "towers",
    "micro",
    "macro",
    "computer",
    "water",
    "berries",
    "animals",
    "troops",
    "artillery",
    "mill",
    "cards"
  ],
  "tyn_section":[

  ]
}