{
  "title":"How to Improve Your Photography with Manual Focus",
  "url":"https://www.wikihow.com/Improve-Your-Photography-with-Manual-Focus",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Digital Photography"
  ],
  "methods":[
    {
      "name":"Utilizing Your Camera",
      "steps":[
        {
          "headline":"Switch off the automatic focus.",
          "description":"Look at your camera to find where the manual focus option is located. If you're using a film camera, you'll be able to select \"M\" on the settings ring, but if you're using a digital camera, you should see a small slide marked \"AF\" or \"M.\" Slide this tab to \"M\" for manual focus. \"AF\" stands for automatic focus."
        },
        {
          "headline":"Enable your camera's manual focus assistance features.",
          "description":"Most digital cameras now offer some tools to make it easier to shoot manually. For example, look for a focus ring to appear in the bottom corner of your viewfinder as you're adjusting. If the image isn't in focus, you'll see arrows instead of the circle. Another type of manual focus assist is a focus point that will light up if it's in focus. Your film camera should also have a split screen and microprism ring that you can use to tell if the image is in focus."
        },
        {
          "headline":"Magnify the area you want to photograph before you focus.",
          "description":"To get the sharpest image, use the lens or zoom-in and zoom-out feature to magnify the part of the image that you want to focus on. Then you'll be able to tell if your camera's sensors can accurately focus on the space. If your camera is having trouble, you'll need to pull back and then try focusing again or switch to a lens that suits your needs better, such as a wide-angle lens if you're shooting landscape photos, a macro-lens for extreme close ups, a telephoto lens for distant shots, or a fisheye lens for distortion."
        },
        {
          "headline":"Use tethered shooting to increase your control over the camera's focus.",
          "description":"Instead of relying on your digital camera's relatively small LCD monitor, connect your camera to a tablet or laptop while you're setting up your shot. This way, you'll be able to magnify and view parts of the image on a much larger screen. Since tethering relies on being able to see the image immediately, you won't be able to do this if you're working with film that has to be developed. Tethered shooting is also a good idea if you'd like to begin editing an image before the photo shoot is finished. You can play around with your photo editing software and make adjustments to the camera, if necessary."
        }
      ]
    },
    {
      "name":"Taking a Photo",
      "steps":[
        {
          "headline":"Imagine how you'd like the image to look.",
          "description":"Before you even point your camera at a subject, determine what you want to be in the frame, what you'd like to focus on, and whether or not you want the background to be in focus or blurry. Having a basic idea of how you want to set up the shot will help you make the manual adjustments to achieve it. For example, if you'll be taking a photograph of fireworks, you can focus your camera on the night sky and then leave the shutter open until you've captured a burst of fireworks. Remember that if you're photographing an action shot, set up the frame before the action happens so you're prepared to catch it."
        },
        {
          "headline":"Use a grid to frame the image.",
          "description":"Program your camera to place a grid on the viewing screen so you can see exactly what's in the frame and what will be the focus of the shot. This is especially important if you're shooting according to the rule of thirds. This guideline helps you compose shots that are balanced by picturing an image divided into vertical and horizontal thirds. Place items of interest where these lines intersect. Keep in mind that many older film cameras also have grids or focusing split-screens that you can use to line up your shot. For example, if you're photographing a stretch of the beach, look at the grid to see where the vertical and horizontal lines connect. Then place a person or item of interest at one of those points."
        },
        {
          "headline":"Adjust the focus ring until your subject is sharp.",
          "description":"If you're using your camera's zoom-in and zoom-out feature, get your subject as sharp as you can. Then turn the focus ring slowly so the subject is entirely in focus. If you're having trouble telling if it's in focus, drastically turn the ring out of focus and then back again. If your subject hasn't moved into the frame yet, focus on the position you expect the subject to be in. If you can, have someone stand in that space so you can focus. Making drastic changes with the focus ring can actually help your eyes adjust quicker to when the subject is back in focus."
        },
        {
          "headline":"Set the aperture to get the depth of focus you want and release the shutter.",
          "description":"Since your camera won't be adjusting the aperture as you focus, you'll need to consider the depth of field that you want. Once you've focused, look at the aperture and decide if it's giving you enough depth of field. Remember that a wide aperture will blur the background details, but a narrow aperture will show more details. If you're happy with it, release the shutter to take the photo. If you're taking an action shot, decide if you want to capture the background in detail or if you want it to blur and suggest movement. For example, if you're photographing a person standing in a field and you want to capture the field in the distance, but the aperture is large (such as f/2.8), you'll get a shallow depth of field. To deepen the depth of field, make the aperture smaller (such as f/22) before you take the shot."
        }
      ]
    },
    {
      "name":"Changing the Way You Photograph",
      "steps":[
        {
          "headline":"Use a tripod to reduce camera shake.",
          "description":"Whether you're photographing an insect close up or you want to capture a stunning vista, reduce the risk of blurry photos by using a tripod. This is especially important if you'll be using a slow shutter speed to take a photograph. If you don't have a tripod handy, prop your camera against a steady surface such as a wall, column, or table."
        },
        {
          "headline":"Use ambient light to stage your photos.",
          "description":"One of the easiest ways to become comfortable with manual lighting is to photograph using strictly ambient light. Once you become comfortable with focusing manually, then try adding studio lighting or using the flash. If you're shooting indoors, try to get lots of natural light coming from the windows and add artificial lighting until it's bright enough to register. However, be aware that if you're shooting in color, having both natural and artificial lighting will cast two different colors of light."
        },
        {
          "headline":"Take your time when you focus and take the photographs.",
          "description":"It's easy to take lots of pictures very quickly when you're photographing with the automatic setting. When you switch to focusing manually, take your time to frame the shot, set the aperture, and adjust the shutter speed. If you need to, keep adjusting these variables as you photograph. For example, give yourself extra time to consider which lens would be appropriate for the distance you're shooting. You'll become faster and more efficient as you become more familiar with manual focus."
        },
        {
          "headline":"Try using manual lenses.",
          "description":"Instead of simply adjusting your auto-focus lens to manual, search for vintage manual lenses. These will give you higher-quality images, although you'll need a variety of lenses so you can select the right lens for your needs. For example, use a macro manual lens if you'd like to photograph a close-up of a flower or plant. To then photograph a landscape, you'll need to take off the macro lens and use a good distance lens (such as a 35mm)."
        },
        {
          "headline":"Practice whenever you can.",
          "description":"Since a large part of shooting with the manual focus requires knowing what you're looking at, you need to practice. Practicing will train your eyes over time to know when a subject is in focus or you have the lighting set up correctly. Take lots of photos and don't be afraid to try different lenses, subject materials, or settings."
        }
      ]
    }
  ],
  "text":" Utilizing Your Camera Switch off the automatic focus. Look at your camera to find where the manual focus option is located. If you're using a film camera, you'll be able to select \"M\" on the settings ring, but if you're using a digital camera, you should see a small slide marked \"AF\" or \"M.\" Slide this tab to \"M\" for manual focus. \"AF\" stands for automatic focus. Enable your camera's manual focus assistance features. Most digital cameras now offer some tools to make it easier to shoot manually. For example, look for a focus ring to appear in the bottom corner of your viewfinder as you're adjusting. If the image isn't in focus, you'll see arrows instead of the circle. Another type of manual focus assist is a focus point that will light up if it's in focus. Your film camera should also have a split screen and microprism ring that you can use to tell if the image is in focus. Magnify the area you want to photograph before you focus. To get the sharpest image, use the lens or zoom-in and zoom-out feature to magnify the part of the image that you want to focus on. Then you'll be able to tell if your camera's sensors can accurately focus on the space. If your camera is having trouble, you'll need to pull back and then try focusing again or switch to a lens that suits your needs better, such as a wide-angle lens if you're shooting landscape photos, a macro-lens for extreme close ups, a telephoto lens for distant shots, or a fisheye lens for distortion. Use tethered shooting to increase your control over the camera's focus. Instead of relying on your digital camera's relatively small LCD monitor, connect your camera to a tablet or laptop while you're setting up your shot. This way, you'll be able to magnify and view parts of the image on a much larger screen. Since tethering relies on being able to see the image immediately, you won't be able to do this if you're working with film that has to be developed. Tethered shooting is also a good idea if you'd like to begin editing an image before the photo shoot is finished. You can play around with your photo editing software and make adjustments to the camera, if necessary. Taking a Photo Imagine how you'd like the image to look. Before you even point your camera at a subject, determine what you want to be in the frame, what you'd like to focus on, and whether or not you want the background to be in focus or blurry. Having a basic idea of how you want to set up the shot will help you make the manual adjustments to achieve it. For example, if you'll be taking a photograph of fireworks, you can focus your camera on the night sky and then leave the shutter open until you've captured a burst of fireworks. Remember that if you're photographing an action shot, set up the frame before the action happens so you're prepared to catch it. Use a grid to frame the image. Program your camera to place a grid on the viewing screen so you can see exactly what's in the frame and what will be the focus of the shot. This is especially important if you're shooting according to the rule of thirds. This guideline helps you compose shots that are balanced by picturing an image divided into vertical and horizontal thirds. Place items of interest where these lines intersect. Keep in mind that many older film cameras also have grids or focusing split-screens that you can use to line up your shot. For example, if you're photographing a stretch of the beach, look at the grid to see where the vertical and horizontal lines connect. Then place a person or item of interest at one of those points. Adjust the focus ring until your subject is sharp. If you're using your camera's zoom-in and zoom-out feature, get your subject as sharp as you can. Then turn the focus ring slowly so the subject is entirely in focus. If you're having trouble telling if it's in focus, drastically turn the ring out of focus and then back again. If your subject hasn't moved into the frame yet, focus on the position you expect the subject to be in. If you can, have someone stand in that space so you can focus. Making drastic changes with the focus ring can actually help your eyes adjust quicker to when the subject is back in focus. Set the aperture to get the depth of focus you want and release the shutter. Since your camera won't be adjusting the aperture as you focus, you'll need to consider the depth of field that you want. Once you've focused, look at the aperture and decide if it's giving you enough depth of field. Remember that a wide aperture will blur the background details, but a narrow aperture will show more details. If you're happy with it, release the shutter to take the photo. If you're taking an action shot, decide if you want to capture the background in detail or if you want it to blur and suggest movement. For example, if you're photographing a person standing in a field and you want to capture the field in the distance, but the aperture is large (such as f/2.8), you'll get a shallow depth of field. To deepen the depth of field, make the aperture smaller (such as f/22) before you take the shot. Changing the Way You Photograph Use a tripod to reduce camera shake. Whether you're photographing an insect close up or you want to capture a stunning vista, reduce the risk of blurry photos by using a tripod. This is especially important if you'll be using a slow shutter speed to take a photograph. If you don't have a tripod handy, prop your camera against a steady surface such as a wall, column, or table. Use ambient light to stage your photos. One of the easiest ways to become comfortable with manual lighting is to photograph using strictly ambient light. Once you become comfortable with focusing manually, then try adding studio lighting or using the flash. If you're shooting indoors, try to get lots of natural light coming from the windows and add artificial lighting until it's bright enough to register. However, be aware that if you're shooting in color, having both natural and artificial lighting will cast two different colors of light. Take your time when you focus and take the photographs. It's easy to take lots of pictures very quickly when you're photographing with the automatic setting. When you switch to focusing manually, take your time to frame the shot, set the aperture, and adjust the shutter speed. If you need to, keep adjusting these variables as you photograph. For example, give yourself extra time to consider which lens would be appropriate for the distance you're shooting. You'll become faster and more efficient as you become more familiar with manual focus. Try using manual lenses. Instead of simply adjusting your auto-focus lens to manual, search for vintage manual lenses. These will give you higher-quality images, although you'll need a variety of lenses so you can select the right lens for your needs. For example, use a macro manual lens if you'd like to photograph a close-up of a flower or plant. To then photograph a landscape, you'll need to take off the macro lens and use a good distance lens (such as a 35mm). Practice whenever you can. Since a large part of shooting with the manual focus requires knowing what you're looking at, you need to practice. Practicing will train your eyes over time to know when a subject is in focus or you have the lighting set up correctly. Take lots of photos and don't be afraid to try different lenses, subject materials, or settings.",
  "tyn_model":[
    "camera",
    "lens",
    "tripod",
    "lenses",
    "film camera",
    "fisheye lens",
    "photo editing software",
    "fireworks",
    "film cameras"
  ],
  "tyn_section":[

  ]
}