{
  "title":"How to Make Paleo Coconut Flour Brownies",
  "url":"https://www.wikihow.com/Make-Paleo-Coconut-Flour-Brownies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Specialty Diet Recipes",
    "Gluten Free Dishes"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 300 °F (149 °C).",
      "description":""
    },
    {
      "headline":"Oil the sides and bottom of an 8 X 8 or 9 X 9 glass pan.",
      "description":""
    },
    {
      "headline":"Get your ingredients all together.",
      "description":"You will need to have set the eggs out for a few hours to get to room temperature.]]"
    },
    {
      "headline":"Add all of the ingredients into the bowl and mix thoroughly.",
      "description":"You can do it by hand or with a mixing device."
    },
    {
      "headline":"Use the spatula to spoon all of the batter into the baking pan after mixing together.",
      "description":""
    },
    {
      "headline":"Bake in the 300 degree oven for 30 - 35 minutes.",
      "description":""
    },
    {
      "headline":"Make sure that the brownies are done and then allow to cool for at least half an hour before removing from the cake pan.",
      "description":""
    },
    {
      "headline":"Enjoy your brownies!",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 300 °F (149 °C).  Oil the sides and bottom of an 8 X 8 or 9 X 9 glass pan.  Get your ingredients all together. You will need to have set the eggs out for a few hours to get to room temperature.]] Add all of the ingredients into the bowl and mix thoroughly. You can do it by hand or with a mixing device. Use the spatula to spoon all of the batter into the baking pan after mixing together.  Bake in the 300 degree oven for 30 - 35 minutes.  Make sure that the brownies are done and then allow to cool for at least half an hour before removing from the cake pan.  Enjoy your brownies!  Finished. ",
  "tyn_model":[
    "oven",
    "eggs",
    "bowl",
    "spatula",
    "baking pan",
    "300 degree oven",
    "cake pan"
  ],
  "tyn_section":[

  ]
}