{
  "title":"How to Play Atari Breakout on Google",
  "url":"https://www.wikihow.com/Play-Atari-Breakout-on-Google",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games"
  ],
  "steps":[
    {
      "headline":"Open a web browser.",
      "description":"You can play Atari Breakout in popular web browsers such as Google Chrome, Firefox, Microsoft Edge, Internet Explorer, and Safari."
    },
    {
      "headline":"Open Google Images.",
      "description":"Go to https://www.google.com/imghp in your web browser. This will open a page with the Google Images search bar."
    },
    {
      "headline":"Click the search bar.",
      "description":"It's in the middle of the page."
    },
    {
      "headline":"Type in atari breakout.",
      "description":"Make sure that your spelling is correct before proceeding."
    },
    {
      "headline":"Press ↵ Enter.",
      "description":"Doing so will search Google Images for \"Atari Breakout\", which will trigger the game to appear in your browser window."
    },
    {
      "headline":"Wait for the Atari Breakout game to load.",
      "description":"Depending on your browser, it may take anywhere from less than a second to several seconds before the Atari Breakout interface appears."
    },
    {
      "headline":"Play the game.",
      "description":"Using your mouse to control the left and right movement of the bar at the bottom of the page, bounce the ball between the bar and the colored rectangles. The goal is to break all of the colored rectangles on the screen without letting the ball fall past the bar that you're controlling. You have four lives at the start of a game, and you lose a life each time the ball falls below the bar. You can see your current lives in the top-left side of the page. You can pause the game or mute the game's audio at any time by clicking the \"Pause\" {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/4\\/47\\/Android7pause.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/4\\/47\\/Android7pause.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":760,\"bigHeight\":760,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of an Android icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a><br>\\n<\\/p><\\/div>\"} or speaker-shaped \"Volume\" button at the top of the page, respectively."
    }
  ],
  "text":" Open a web browser. You can play Atari Breakout in popular web browsers such as Google Chrome, Firefox, Microsoft Edge, Internet Explorer, and Safari. Open Google Images. Go to https://www.google.com/imghp in your web browser. This will open a page with the Google Images search bar. Click the search bar. It's in the middle of the page. Type in atari breakout. Make sure that your spelling is correct before proceeding. Press ↵ Enter. Doing so will search Google Images for \"Atari Breakout\", which will trigger the game to appear in your browser window. Wait for the Atari Breakout game to load. Depending on your browser, it may take anywhere from less than a second to several seconds before the Atari Breakout interface appears. Play the game. Using your mouse to control the left and right movement of the bar at the bottom of the page, bounce the ball between the bar and the colored rectangles. The goal is to break all of the colored rectangles on the screen without letting the ball fall past the bar that you're controlling. You have four lives at the start of a game, and you lose a life each time the ball falls below the bar. You can see your current lives in the top-left side of the page. You can pause the game or mute the game's audio at any time by clicking the \"Pause\" {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/4\\/47\\/Android7pause.png\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/4\\/47\\/Android7pause.png\",\"smallWidth\":460,\"smallHeight\":460,\"bigWidth\":760,\"bigHeight\":760,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>I edited this screenshot of an Android icon.\\n<\\/p><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"http:\\/\\/en.wikipedia.org\\/wiki\\/Fair_use\\\">Fair Use<\\/a><br>\\n<\\/p><\\/div>\"} or speaker-shaped \"Volume\" button at the top of the page, respectively.",
  "tyn_model":[
    "google images",
    "atari breakout",
    "internet explorer",
    "↵ enter",
    "atari breakout interface",
    "mouse"
  ],
  "tyn_section":[

  ]
}