{
  "title":"How to Cook a Southern Omelet",
  "url":"https://www.wikihow.com/Cook-a-Southern-Omelet",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Omelets"
  ],
  "steps":[
    {
      "headline":"Chop up any veggies or meats you'd like to add before you begin.",
      "description":"Have everything ready before you turn on the pan."
    },
    {
      "headline":"Crack 3 eggs into a bowl and beat them with a fork or whisk until the color is even.",
      "description":"A bit of air in the mix will make for a lighter omelet."
    },
    {
      "headline":"Heat the pan empty over medium heat.",
      "description":"When it's fairly warm, drop in a pat of butter or drizzle in a bit of oil and let that heat up."
    },
    {
      "headline":"Sauté any meats that haven't been cooked yet.",
      "description":"This is a good opportunity to use up leftover bits of meat."
    },
    {
      "headline":"Sauté the vegetables, starting with those that need the most cooking.",
      "description":"Cook until they are crisp-tender."
    },
    {
      "headline":"Add a bit of salt and a bit more pepper and pour in the eggs.",
      "description":""
    },
    {
      "headline":"Let the omelet cook for a while.",
      "description":"You can lift up the edge if you need to see how well done it is, but don't stir it. This is an omelet, not scrambled eggs."
    },
    {
      "headline":"Add any grated or sliced cheese you want.",
      "description":""
    },
    {
      "headline":"Flip the omelet and cook it on the other side.",
      "description":"Add more seasoning, if you wish."
    },
    {
      "headline":"Slide the finished omelet onto a plate.",
      "description":"Garnish with more cheese, sour cream, salsa, guacamole, and anything else you'd like."
    },
    {
      "headline":"Serve with your choice of side dishes.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Chop up any veggies or meats you'd like to add before you begin. Have everything ready before you turn on the pan. Crack 3 eggs into a bowl and beat them with a fork or whisk until the color is even. A bit of air in the mix will make for a lighter omelet. Heat the pan empty over medium heat. When it's fairly warm, drop in a pat of butter or drizzle in a bit of oil and let that heat up. Sauté any meats that haven't been cooked yet. This is a good opportunity to use up leftover bits of meat. Sauté the vegetables, starting with those that need the most cooking. Cook until they are crisp-tender. Add a bit of salt and a bit more pepper and pour in the eggs.  Let the omelet cook for a while. You can lift up the edge if you need to see how well done it is, but don't stir it. This is an omelet, not scrambled eggs. Add any grated or sliced cheese you want.  Flip the omelet and cook it on the other side. Add more seasoning, if you wish. Slide the finished omelet onto a plate. Garnish with more cheese, sour cream, salsa, guacamole, and anything else you'd like. Serve with your choice of side dishes.  Finished. ",
  "tyn_model":[
    "pan",
    "eggs",
    "bowl",
    "whisk",
    "butter",
    "oil",
    "vegetables",
    "salt",
    "pepper",
    "scrambled eggs",
    "seasoning",
    "plate",
    "cheese",
    "sour cream",
    "salsa",
    "guacamole"
  ],
  "tyn_section":[

  ]
}