{
  "title":"How to Cross Breed Nepenthes",
  "url":"https://www.wikihow.com/Cross-Breed-Nepenthes",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Carnivorous Plants"
  ],
  "parts":[
    {
      "name":"Cross-pollinating",
      "steps":[
        {
          "headline":"Obtain the Nepenthes plants.",
          "description":"Obtain the species when they're in bloom. That way, you'll know up front what you like the shape or colour of."
        },
        {
          "headline":"Keep the plants away from animal pollinators.",
          "description":"This will help to avoid random pollination."
        },
        {
          "headline":"Pollinate the plants with a small paintbrush.",
          "description":"Always keep note of which brush has been applied to which plant - mixta to raja and raja to mixta. It might help to stick a label on each brush, or colored dots, etc., to avoid accidental mix-ups."
        },
        {
          "headline":"Keep pollinating for three to five days.",
          "description":""
        },
        {
          "headline":"Wait for the seeds to form.",
          "description":"Carefully pinch off the seed heads and remove the seeds. Store the seeds in a paper bag kept a cool dark place."
        }
      ]
    },
    {
      "name":"Next spring",
      "steps":[
        {
          "headline":"Plant the seeds you harvested after cross-pollinating the plants the following spring.",
          "description":""
        },
        {
          "headline":"Make up a mixture of 2 parts peat and 1 part moss.",
          "description":"Water lightly (or spray) to dampen."
        },
        {
          "headline":"Place the pots in 20ml of water.",
          "description":"Make 5mm deep trenches."
        },
        {
          "headline":"Place the seeds in carefully and cover up.",
          "description":"Water well. Seedlings should emerge in 1 to 4 weeks."
        },
        {
          "headline":"Thin out the Nepenthes seedlings from strongest to weakest.",
          "description":"When traps appear, pot separately. At this stage, you should find that your desired species has grown."
        }
      ]
    }
  ],
  "text":" Cross-pollinating Obtain the Nepenthes plants. Obtain the species when they're in bloom. That way, you'll know up front what you like the shape or colour of. Keep the plants away from animal pollinators. This will help to avoid random pollination. Pollinate the plants with a small paintbrush. Always keep note of which brush has been applied to which plant - mixta to raja and raja to mixta. It might help to stick a label on each brush, or colored dots, etc., to avoid accidental mix-ups. Keep pollinating for three to five days.  Wait for the seeds to form. Carefully pinch off the seed heads and remove the seeds. Store the seeds in a paper bag kept a cool dark place. Next spring Plant the seeds you harvested after cross-pollinating the plants the following spring.  Make up a mixture of 2 parts peat and 1 part moss. Water lightly (or spray) to dampen. Place the pots in 20ml of water. Make 5mm deep trenches. Place the seeds in carefully and cover up. Water well. Seedlings should emerge in 1 to 4 weeks. Thin out the Nepenthes seedlings from strongest to weakest. When traps appear, pot separately. At this stage, you should find that your desired species has grown.",
  "tyn_model":[
    "water",
    "peat",
    "moss",
    "pots",
    "pot"
  ],
  "tyn_section":[

  ]
}