{
  "title":"How to Make French Onion Dip",
  "url":"https://www.wikihow.com/Make-French-Onion-Dip",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Party Snacks",
    "Dips"
  ],
  "methods":[
    {
      "name":"Method One: Simple French Onion Dip",
      "steps":[
        {
          "headline":"Add the oil, salt and onions to a pot.",
          "description":"Alternately, you can use a pan or a skillet. Make sure those onions are as thinly diced as possible if you want the dip to have a creamy, even texture. If you like the more lumpy consistency, though, then you can dice the onions a bit thicker. Cook on medium heat until the onions are caramelized (this should take about 20 minutes). Continue to stir frequently so the onions don't get burned."
        },
        {
          "headline":"Remove the onions from the stove and let them cool.",
          "description":"This should take another 15 minutes at least."
        },
        {
          "headline":"Mix the remaining ingredients in a bowl.",
          "description":"Mix the sour cream, mayonnaise, garlic powder, white pepper, and additional salt together in a bowl until the ingredients combine."
        },
        {
          "headline":"Add the cooled onions and stir.",
          "description":"Stir the mixture until the caramelized onions and the sour cream mixture have combined, giving the dip a nice light brown color and a creamy consistency."
        },
        {
          "headline":"Serve.",
          "description":"You can either serve this dip immediately with chips, veggies, or a baguette, or place it in the fridge for a few hours to let it cool. If you do refrigerate it, you have to make sure that it is well-covered."
        }
      ]
    },
    {
      "name":"Method Two: Low-Fat French Onion Dip",
      "steps":[
        {
          "headline":"Place the oil and onions in a large saucepan pan over medium heat.",
          "description":"You can use a skillet in a pinch. Make sure the onions are really finely diced to give the dip the right texture. Add a pinch of salt to the mixture and stir it frequently so that the ingredients combine."
        },
        {
          "headline":"Cook for 15-18 minutes.",
          "description":"Toward the end of the cooking process, you may need to add a bit of water to keep the onions from burning. You have to be vigilant as you stir the ingredients. Essentially, you're caramelizing your onions here. You can even do this a day or two in advance instead of making the entire dip if you like; this can even give it a richer taste."
        },
        {
          "headline":"Add the minced garlic.",
          "description":"Mince 1 clove of garlic and add it to the mixture, stirring it for a few seconds until the garlic becomes aromatic."
        },
        {
          "headline":"Turn off the heat.",
          "description":"Take the pan off of the stove to help it cool faster."
        },
        {
          "headline":"Stir in the Worcestershire Sauce and thyme.",
          "description":"Add the Worcestershire sauce and the thyme (after stripping the leaves away from the two springs) to the onion and oil mixture and stir it until you've thoroughly combined the ingredients. Then, let it cool to thicken. This should take at least 15 minutes or so."
        },
        {
          "headline":"Mix the cooled mixture with the Greek yogurt.",
          "description":"Now, mix the onion dip with the Greek yogurt, to give it a more healthy and creamy flavor. You can add a teaspoon of celery salt and a few shakes of freshly ground black pepper to give it some extra flavor. If you like, you can wait a few hours (or even a day!) before serving this dish. This can help the ingredients combine a bit and can give it a more tasty consistency."
        },
        {
          "headline":"Serve.",
          "description":"Garnish the dish with another sprig of thyme and serve it with whatever dippers you like. Try some veggies, such as broccoli or carrots, or pita chips, instead of the less-healthy (but tasty) potato chips if you really want this to be a low-fat option. You can make this a day in advance, as long as you cover it well and keep it in the fridge."
        }
      ]
    },
    {
      "name":"Method Three: Oven-Baked French Onion Dip",
      "steps":[
        {
          "headline":"Caramelize your onions.",
          "description":"Simply heat the olive oil and the butter in a skillet over medium to high heat, and add the diced onions when the butter has melted. Stir or toss the ingredients to thoroughly combine them and then turn the heat to low and cook for about 10-12 minutes, continuing to stir as you cook. Here's what else you should do:\nAfter cooking over low heat for 10-12 minutes, sprinkle 1/4-1/2 tsp. of salt onto the mixture and keep cooking for another 15-25 minutes, or until the onions are amber in color and begin to get translucent. Add 6-8 cloves of garlic in the last 5 minutes or so. If you add them sooner, they may burn a bit. You can even add 1/2 a teaspoon of brown or white sugar at the midway cooking point if you want to sweeten them up a bit."
        },
        {
          "headline":"Preheat your oven to 425ºF(218ºC).",
          "description":"You can turn on your oven while you caramelize your onions since it will take some time for it to heat up."
        },
        {
          "headline":"Combine the ingredients on a pan or a pie plate.",
          "description":"Use either an ordinary pie plate or an 8 x 8\" pan for the cream cheese, Gruyere, Parmesan, and the caramelized onions. If you're not a big Gruyere fan, you can substitute it with regular Swiss cheese. You can also combine the ingredients in a bowl first and then place them on the pie plate if that's easier."
        },
        {
          "headline":"Bake for 15-20 minutes.",
          "description":"Bake the ingredients until the dish is hot in the middle and golden on top. Check on it every few minutes to make sure that you haven't burned the onions."
        },
        {
          "headline":"Serve.",
          "description":"Serve this tasty baked French onion dip with tortilla chips, sourdough bread, or a sliced baguette."
        }
      ]
    }
  ],
  "text":" Method One: Simple French Onion Dip Add the oil, salt and onions to a pot. Alternately, you can use a pan or a skillet. Make sure those onions are as thinly diced as possible if you want the dip to have a creamy, even texture. If you like the more lumpy consistency, though, then you can dice the onions a bit thicker. Cook on medium heat until the onions are caramelized (this should take about 20 minutes). Continue to stir frequently so the onions don't get burned. Remove the onions from the stove and let them cool. This should take another 15 minutes at least. Mix the remaining ingredients in a bowl. Mix the sour cream, mayonnaise, garlic powder, white pepper, and additional salt together in a bowl until the ingredients combine. Add the cooled onions and stir. Stir the mixture until the caramelized onions and the sour cream mixture have combined, giving the dip a nice light brown color and a creamy consistency. Serve. You can either serve this dip immediately with chips, veggies, or a baguette, or place it in the fridge for a few hours to let it cool. If you do refrigerate it, you have to make sure that it is well-covered. Method Two: Low-Fat French Onion Dip Place the oil and onions in a large saucepan pan over medium heat. You can use a skillet in a pinch. Make sure the onions are really finely diced to give the dip the right texture. Add a pinch of salt to the mixture and stir it frequently so that the ingredients combine. Cook for 15-18 minutes. Toward the end of the cooking process, you may need to add a bit of water to keep the onions from burning. You have to be vigilant as you stir the ingredients. Essentially, you're caramelizing your onions here. You can even do this a day or two in advance instead of making the entire dip if you like; this can even give it a richer taste. Add the minced garlic. Mince 1 clove of garlic and add it to the mixture, stirring it for a few seconds until the garlic becomes aromatic. Turn off the heat. Take the pan off of the stove to help it cool faster. Stir in the Worcestershire Sauce and thyme. Add the Worcestershire sauce and the thyme (after stripping the leaves away from the two springs) to the onion and oil mixture and stir it until you've thoroughly combined the ingredients. Then, let it cool to thicken. This should take at least 15 minutes or so. Mix the cooled mixture with the Greek yogurt. Now, mix the onion dip with the Greek yogurt, to give it a more healthy and creamy flavor. You can add a teaspoon of celery salt and a few shakes of freshly ground black pepper to give it some extra flavor. If you like, you can wait a few hours (or even a day!) before serving this dish. This can help the ingredients combine a bit and can give it a more tasty consistency. Serve. Garnish the dish with another sprig of thyme and serve it with whatever dippers you like. Try some veggies, such as broccoli or carrots, or pita chips, instead of the less-healthy (but tasty) potato chips if you really want this to be a low-fat option. You can make this a day in advance, as long as you cover it well and keep it in the fridge. Method Three: Oven-Baked French Onion Dip Caramelize your onions. Simply heat the olive oil and the butter in a skillet over medium to high heat, and add the diced onions when the butter has melted. Stir or toss the ingredients to thoroughly combine them and then turn the heat to low and cook for about 10-12 minutes, continuing to stir as you cook. Here's what else you should do:\nAfter cooking over low heat for 10-12 minutes, sprinkle 1/4-1/2 tsp. of salt onto the mixture and keep cooking for another 15-25 minutes, or until the onions are amber in color and begin to get translucent. Add 6-8 cloves of garlic in the last 5 minutes or so. If you add them sooner, they may burn a bit. You can even add 1/2 a teaspoon of brown or white sugar at the midway cooking point if you want to sweeten them up a bit. Preheat your oven to 425ºF(218ºC). You can turn on your oven while you caramelize your onions since it will take some time for it to heat up. Combine the ingredients on a pan or a pie plate. Use either an ordinary pie plate or an 8 x 8\" pan for the cream cheese, Gruyere, Parmesan, and the caramelized onions. If you're not a big Gruyere fan, you can substitute it with regular Swiss cheese. You can also combine the ingredients in a bowl first and then place them on the pie plate if that's easier. Bake for 15-20 minutes. Bake the ingredients until the dish is hot in the middle and golden on top. Check on it every few minutes to make sure that you haven't burned the onions. Serve. Serve this tasty baked French onion dip with tortilla chips, sourdough bread, or a sliced baguette.",
  "tyn_model":[
    "onions",
    "salt",
    "garlic",
    "oil",
    "pan",
    "skillet",
    "bowl",
    "thyme",
    "pie plate",
    "stove",
    "sour cream",
    "baguette",
    "worcestershire sauce",
    "onion",
    "greek yogurt",
    "butter",
    "oven",
    "gruyere",
    "french onion dip",
    "pot",
    "mayonnaise",
    "garlic powder",
    "white pepper",
    "low-fat french onion",
    "large saucepan",
    "water",
    "celery salt",
    "freshly ground black pepper",
    "pita chips",
    "potato chips",
    "oven-baked french onion",
    "olive oil",
    "brown or white sugar",
    "cream cheese",
    "parmesan",
    "swiss cheese",
    "french onion",
    "tortilla chips",
    "sourdough bread"
  ],
  "tyn_section":[

  ]
}