{
  "title":"How to Make a Ginamay",
  "url":"https://www.wikihow.com/Make-a-Ginamay",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Philippine Dishes"
  ],
  "steps":[
    {
      "headline":"Prepare different cuts of vegetables.",
      "description":"There are the maçedoine, julienne, jardinière and paysanne methods to choose from."
    },
    {
      "headline":"Cut the pork into the same size as the vegetables.",
      "description":""
    },
    {
      "headline":"Prepare your heated cooking oil in a pan.",
      "description":""
    },
    {
      "headline":"Pour all the onion and garlic together first and forget about what they say about putting the carrots.",
      "description":"It doesn't taste good when carrots are over - boiled. Once the onion is cooked but not browned, add the meat and carrots. Once everything is fully cooked, add the water."
    },
    {
      "headline":"Adding the tomato sauce, seasoning and white pepper is optional.",
      "description":"(You are often told to add broth cubes and other kinds of seasoning, but it's cheating)."
    },
    {
      "headline":"Boil for a few minutes until cooked.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Prepare different cuts of vegetables. There are the maçedoine, julienne, jardinière and paysanne methods to choose from. Cut the pork into the same size as the vegetables.  Prepare your heated cooking oil in a pan.  Pour all the onion and garlic together first and forget about what they say about putting the carrots. It doesn't taste good when carrots are over - boiled. Once the onion is cooked but not browned, add the meat and carrots. Once everything is fully cooked, add the water. Adding the tomato sauce, seasoning and white pepper is optional. (You are often told to add broth cubes and other kinds of seasoning, but it's cheating). Boil for a few minutes until cooked.  Finished. ",
  "tyn_model":[
    "carrots",
    "onion",
    "pork",
    "vegetables",
    "cooking oil",
    "pan",
    "garlic",
    "meat",
    "water",
    "tomato sauce",
    "white pepper",
    "broth"
  ],
  "tyn_section":[

  ]
}