{
  "title":"How to Make Chicken Jalfrezi",
  "url":"https://www.wikihow.com/Make-Chicken-Jalfrezi",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Indian Chicken Dishes"
  ],
  "steps":[
    {
      "headline":"Prepare the ingredients.",
      "description":"Chop the onion, garlic, and chilli into fine pieces. Be sure to take out the chilli seeds unless you prefer really spicy food. Cut the pepper into small slices, grate the ginger, and cube the chicken."
    },
    {
      "headline":"Fry the prepared ingredients.",
      "description":"Heat the vegetable oil over a low/medium heat in the frying pan. Add the prepared ingredients to the pan. Fry everything until the onions look more transparent and soft/tender."
    },
    {
      "headline":"Season.",
      "description":"Add the salt, curry powder/paste, and tomato puree to the pan. Stir for about 30 seconds or so."
    },
    {
      "headline":"Add chicken to the pan.",
      "description":"Toss in the cubed chicken and stir until the chicken is fully cooked."
    },
    {
      "headline":"Simmer everything.",
      "description":"Slowly pour the water into the pan and lower the heat to a simmer. Let it bubble and then add the ginger and pepper to the pan. Wait for about another minute or so for these ingredients to cook."
    },
    {
      "headline":"Serve.",
      "description":"Either place the pan on a trivet in the middle of the table for guests to help themselves from, or serve individual portions."
    }
  ],
  "text":" Prepare the ingredients. Chop the onion, garlic, and chilli into fine pieces. Be sure to take out the chilli seeds unless you prefer really spicy food. Cut the pepper into small slices, grate the ginger, and cube the chicken. Fry the prepared ingredients. Heat the vegetable oil over a low/medium heat in the frying pan. Add the prepared ingredients to the pan. Fry everything until the onions look more transparent and soft/tender. Season. Add the salt, curry powder/paste, and tomato puree to the pan. Stir for about 30 seconds or so. Add chicken to the pan. Toss in the cubed chicken and stir until the chicken is fully cooked. Simmer everything. Slowly pour the water into the pan and lower the heat to a simmer. Let it bubble and then add the ginger and pepper to the pan. Wait for about another minute or so for these ingredients to cook. Serve. Either place the pan on a trivet in the middle of the table for guests to help themselves from, or serve individual portions.",
  "tyn_model":[
    "chicken",
    "chilli",
    "pepper",
    "ginger",
    "onion",
    "garlic",
    "vegetable oil",
    "frying pan",
    "onions",
    "salt",
    "curry powder",
    "tomato puree",
    "water"
  ],
  "tyn_section":[

  ]
}