{
  "title":"How to Make \"Media Bingo\"",
  "url":"https://www.wikihow.com/Make-%22Media-Bingo%22",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "methods":[
    {
      "name":"The Game Cards",
      "steps":[
        {
          "headline":"Design the 6 x 5 image by using either Word or Excel, Then, even each of the mini squares at 0.75\" x 0.75\"",
          "description":""
        },
        {
          "headline":"Boldly outline the Top Squares.",
          "description":""
        },
        {
          "headline":"Type in the genres, Television, Movies, Pop Culture, Music and Literature, in each of the top squares,",
          "description":""
        },
        {
          "headline":"List 5 of its Sub-Genres underneath each genre, but underneath Pop Culture, keep the center square as a Free Space and just list 4 subgenres.",
          "description":"But, change as many subgenres as needed via each Media type."
        },
        {
          "headline":"Print out as many of the Cards as you had made when done.",
          "description":""
        },
        {
          "headline":"Cut out the Cards, then glue them onto an even size of cardstock.",
          "description":""
        },
        {
          "headline":"When dry enough, you're done!",
          "description":""
        }
      ]
    },
    {
      "name":"The Calling Cards",
      "steps":[
        {
          "headline":"Use either a Business Card or a Useless Credit Card as a Stencil.",
          "description":""
        },
        {
          "headline":"Use your stencil to draw 75 Calling Cards.",
          "description":""
        },
        {
          "headline":"List the Media Genre on the top, underline it, then list 1 of its 15 chosen subgenres from the game cards underneath at longer length.",
          "description":""
        },
        {
          "headline":"Outline the writing with a Black or Dark Blue Pen.",
          "description":""
        },
        {
          "headline":"Cut the cards out.",
          "description":""
        },
        {
          "headline":"Shuffle them, and then you're done!",
          "description":""
        }
      ]
    },
    {
      "name":"The Chips",
      "steps":[
        {
          "headline":"Use a Quarter-sized Stencil to draw your BINGO chips.",
          "description":""
        },
        {
          "headline":"Trace it onto Light Heavy Cardboard.",
          "description":""
        },
        {
          "headline":"Cut the Chips out.",
          "description":""
        },
        {
          "headline":"Be Prepared to play Media BINGO.",
          "description":""
        }
      ]
    }
  ],
  "text":" The Game Cards Design the 6 x 5 image by using either Word or Excel, Then, even each of the mini squares at 0.75\" x 0.75\"  Boldly outline the Top Squares.  Type in the genres, Television, Movies, Pop Culture, Music and Literature, in each of the top squares,  List 5 of its Sub-Genres underneath each genre, but underneath Pop Culture, keep the center square as a Free Space and just list 4 subgenres. But, change as many subgenres as needed via each Media type. Print out as many of the Cards as you had made when done.  Cut out the Cards, then glue them onto an even size of cardstock.  When dry enough, you're done!  The Calling Cards Use either a Business Card or a Useless Credit Card as a Stencil.  Use your stencil to draw 75 Calling Cards.  List the Media Genre on the top, underline it, then list 1 of its 15 chosen subgenres from the game cards underneath at longer length.  Outline the writing with a Black or Dark Blue Pen.  Cut the cards out.  Shuffle them, and then you're done!  The Chips Use a Quarter-sized Stencil to draw your BINGO chips.  Trace it onto Light Heavy Cardboard.  Cut the Chips out.  Be Prepared to play Media BINGO. ",
  "tyn_model":[
    "stencil",
    "word",
    "excel",
    "glue",
    "cardstock",
    "pen"
  ],
  "tyn_section":[

  ]
}