{
  "title":"How to Go on an Imaginary Adventure Outside",
  "url":"https://www.wikihow.com/Go-on-an-Imaginary-Adventure-Outside",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games"
  ],
  "parts":[
    {
      "name":"Setup",
      "steps":[
        {
          "headline":"Get your stuff.",
          "description":"You don't have to have stuff, but it helps. Some stuff that could be useful includes (but is not limited to) sticks, play swords, bike helmets, balls, a pretend wand, and (a) scooter(s) and/or bike(s)."
        },
        {
          "headline":"Draw a map.",
          "description":"You can have only one land, or multiple lands, such as a home base and 5 other worlds or places. You can either do this with paper and pencil or on a driveway with chalk. Then to go to another place, you could walk on your map if it's on a driveway, or \"teleport\" by looking at a paper map and pointing to a place. You could either make up places or use ones that already exist, such as your home, your town, or movie/book worlds."
        },
        {
          "headline":"Put your stuff (if you have it) in your worlds/land or home base.",
          "description":"For instance, you could put helmets and scooters and sticks/play swords and wands and balls in your home base, putting them into \"shops\" where you can get that stuff."
        },
        {
          "headline":"Think of your main goal.",
          "description":"Are you trying to save the balance between your worlds? Are you defeating an enemy? You can of course have small missions within your main goal, but try to think up a big goal to achieve, or you risk your adventure going on forever and ever until you lose interest and forget about it."
        },
        {
          "headline":"Create limitations.",
          "description":"This might make your adventure more fun and challenging. It probably won't be as fun if everything goes perfectly and you complete your adventure in 5 minutes. You could have an unlocking system, where certain worlds, missions/goals and items are locked until you finish a smaller mission or goal in the whole sequence. You could also have a leveling up system, where after you complete missions/goals or battle (if you're into that) a certain number of times, you level up. This could also add to the unlocking system, level up and unlock a certain item or world. Another option is to have battles in order to complete something. You could also have to earn coins/money to buy items. If you want, you could add this to the unlocking system. You unlock something and you can buy it."
        }
      ]
    },
    {
      "name":"Playing",
      "steps":[
        {
          "headline":"Start in your home base if you have one.",
          "description":"It would be a good place to start, especially if you have stuff in there."
        },
        {
          "headline":"Get items.",
          "description":"Get the basic armor if you have an unlocking system. Grab a weapon if you want."
        },
        {
          "headline":"Travel.",
          "description":"Go to one of your worlds and complete a side goal if you want. Or start working your way to accomplishing your main goal."
        },
        {
          "headline":"Complete side missions.",
          "description":"Maybe you could have it where you get a new sword if you defeat one of your enemies, or help the princess. Or maybe some of these all work up to the puzzle of how to complete your main goal."
        },
        {
          "headline":"Battle (optional).",
          "description":"This could be a side goal- or an obstacle that's keeping you from accomplishing your goals. It helps if you have someone else battle you. If no one else will play, imagine your enemy. If you use sticks and battle another person, try not to hit too hard and cause injury. Sometimes it's good not to win every time, especially when battling an imaginary foe. See what happens when you lose a battle!"
        },
        {
          "headline":"Complete your main goal.",
          "description":"Try not to rush up to this step! Your adventure might not be as fun. The adventure can last more than a day."
        }
      ]
    }
  ],
  "text":" Setup Get your stuff. You don't have to have stuff, but it helps. Some stuff that could be useful includes (but is not limited to) sticks, play swords, bike helmets, balls, a pretend wand, and (a) scooter(s) and/or bike(s). Draw a map. You can have only one land, or multiple lands, such as a home base and 5 other worlds or places. You can either do this with paper and pencil or on a driveway with chalk. Then to go to another place, you could walk on your map if it's on a driveway, or \"teleport\" by looking at a paper map and pointing to a place. You could either make up places or use ones that already exist, such as your home, your town, or movie/book worlds. Put your stuff (if you have it) in your worlds/land or home base. For instance, you could put helmets and scooters and sticks/play swords and wands and balls in your home base, putting them into \"shops\" where you can get that stuff. Think of your main goal. Are you trying to save the balance between your worlds? Are you defeating an enemy? You can of course have small missions within your main goal, but try to think up a big goal to achieve, or you risk your adventure going on forever and ever until you lose interest and forget about it. Create limitations. This might make your adventure more fun and challenging. It probably won't be as fun if everything goes perfectly and you complete your adventure in 5 minutes. You could have an unlocking system, where certain worlds, missions/goals and items are locked until you finish a smaller mission or goal in the whole sequence. You could also have a leveling up system, where after you complete missions/goals or battle (if you're into that) a certain number of times, you level up. This could also add to the unlocking system, level up and unlock a certain item or world. Another option is to have battles in order to complete something. You could also have to earn coins/money to buy items. If you want, you could add this to the unlocking system. You unlock something and you can buy it. Playing Start in your home base if you have one. It would be a good place to start, especially if you have stuff in there. Get items. Get the basic armor if you have an unlocking system. Grab a weapon if you want. Travel. Go to one of your worlds and complete a side goal if you want. Or start working your way to accomplishing your main goal. Complete side missions. Maybe you could have it where you get a new sword if you defeat one of your enemies, or help the princess. Or maybe some of these all work up to the puzzle of how to complete your main goal. Battle (optional). This could be a side goal- or an obstacle that's keeping you from accomplishing your goals. It helps if you have someone else battle you. If no one else will play, imagine your enemy. If you use sticks and battle another person, try not to hit too hard and cause injury. Sometimes it's good not to win every time, especially when battling an imaginary foe. See what happens when you lose a battle! Complete your main goal. Try not to rush up to this step! Your adventure might not be as fun. The adventure can last more than a day.",
  "tyn_model":[
    "sticks",
    "paper",
    "balls",
    "map",
    "pencil",
    "chalk",
    "scooters",
    "swords",
    "weapon",
    "sword",
    "battle"
  ],
  "tyn_section":[

  ]
}