{
  "title":"How to Evolve Gligar",
  "url":"https://www.wikihow.com/Evolve-Gligar",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Pokemon Video Games"
  ],
  "parts":[
    {
      "name":"Evolving Gligar",
      "steps":[
        {
          "headline":"Transfer your Gligar to a Generation IV or later Pokémon game (if necessary).",
          "description":"Gligar's evolution, Gliscor, was introduced in the Generation IV versions of Pokémon (Diamond, Pearl, and Platinum), even though Gligar was introduced in Generation II. If you're playing Ruby, Sapphire, Emerald, FireRed, or LeafGreen, you'll need to transfer Gligar to a Generation IV game in order to evolve it. You can transfer from Generation III to Generation IV, but you can't transfer from Generation I or II to Generation III. This means that a Gligar from Gold, Silver, or Crystal cannot be evolved into Gliscor, because it cannot be transferred to a version that supports it. To transfer from Generation III to Generation IV, you'll need to have received the National Pokedex in your Generation III game. Insert the GBA cartridge in your DS and select \"Migrate\" from the main menu of your Generation IV game. Select Gligar and five other Pokémon you want to migrate. In your Generation IV game, visit the Pal Park on Route 221 to catch your migrated Gligar."
        },
        {
          "headline":"Find a Razor Fang.",
          "description":"This item is required to evolve your Gligar to a Gliscor. It can only be found in Generation IV or later games:\n\nGame\nLocation\n\nDiamondPearlPlatinum\n\n\n Battle Tower, Route 225 (Platinum),Battle Park (D,P), Route 214 (Platinum)\n\n\nHeartGoldSoulSilver\n\n\n Battle Frontier\n\n\nBlackWhite\n\n\n Route 13, Abundant Shrine, Battle Subway\n\n\nBlack 2White 2\n\n\n Route 11, Battle Subway,Pokémon World Tournament\n\n\nXY\n\n\n Battle Maison, PokeMileage Club\n\n\nAlpha SapphireOmega Ruby\n\n\n Battle Resort"
        },
        {
          "headline":"Give the Razor Fang to your Gligar to hold.",
          "description":"Your Gligar must be holding this item in order to evolve. The Razor Fang can cause your opponent to Flinch during battle, which makes it a fairly useful item regardless."
        },
        {
          "headline":"Wait until nightfall in your game.",
          "description":"Gligar can only evolve when it levels up during the night in your game. The Pokémon games use your system clock to determine the in-game time, and the transition to night occurs at different times for different games. Game\nNighttime\n\nDiamondPearlPlatinumHeartGoldSoulSilver\n\n\n 8 PM - 4 AM\n\n\nBlackWhiteBlack 2White 2\n\n\n Spring: 8 PM - 5 AMSummer: 9 PM - 4 AMAutumn: 8 PM - 6 AMWinter: 7 PM - 7 AM\n\n\nXYAlpha SapphireOmega Ruby\n\n\n 8 PM - 4 AM\n\n\nChanging your system's time in later games will prevent you from being able to evolve Gligar at night for 24 hours. You can safely change your system time while playing Diamond, Pearl, or Platinum to fast-forward to Nighttime."
        },
        {
          "headline":"Level up Gligar while it's dark to evolve into Gliscor.",
          "description":"It doesn't matter what level Gligar is, it just needs to level up at night while holding the Razor Fang. It will attempt to evolve as soon as it levels up. You can level up by fighting a wild Pokémon or a trainer, or by using a Rare Candy."
        }
      ]
    },
    {
      "name":"Obtaining Razor Fangs",
      "steps":[
        {
          "headline":"Get the Razor Fang in Diamond, Pearl, or Platinum.",
          "description":"Fight in the Battle Tower after defeating the Elite Four to earn Battle Points (BP). You can spend 48 BP to purchase a Razor Claw. In Platinum, you can find a Razor Fang in the lower-left corner of Route 225, but you'll need Rock Climb to reach it. You can also find one hidden in the southern tall grass on Route 214, but this is Platinum-only as well. In HeartGold and SoulSilver, you can only get a Razor Fang from the Battle Frontier."
        },
        {
          "headline":"Find a Razor Fang in Black or White.",
          "description":"There are three ways to get a Razor Fang in Black or White:\nYou can find a Razor Claw on Route 13 on the cliff to the south of Artist Zach. Route 13 becomes available after completing the story. You can find a Razor Claw at the Abundant Shrine, southwest of the trainer named Maki. You can earn a Razor Fang at the Battle Subway by winning 48 BP."
        },
        {
          "headline":"Get a Razor Fang in Black 2 or White 2.",
          "description":"Like their predecessors, there are three ways to get a Razor Fang in Black 2 and White 2:\nBring a Pokémon that knows Surf and Waterfall, and travel to Route 11. You'll find the Razor Fang to the right of Thalia. Earn 8 BP at the Pokémon World Tournament to get a Razor Fang. The Pokémon World Tournament is in Driftveil. This may be the easiest way to get a Razor Fang in the game. You can also get a Razor Fang for 8 BP at the Battle Subway as well, which becomes available later than the Pokémon World Tournament."
        },
        {
          "headline":"Win a Razor Fang in X or Y.",
          "description":"You can't find a Razor Fang in the world in these game. They'll need to be won:\nA Razor Fang costs 48 BP from the Battle Maison, available after beating the game. You can win a Razor Claw by playing the Balloon Popping game at the PokeMileage Club. The game costs 100 Miles, which are earned by walking in the game and trading with other players. You'll need to play the Level 3 version of the game to get a chance at the Razor Claw."
        },
        {
          "headline":"Find a Razor Fang in Alpha Sapphire and Omega Ruby.",
          "description":"There are a couple of different ways to get a Razor Fang in the newest Pokémon games:\nThe Battle Maison at the Battle Resort stocks Razor Fangs for 48 BP. Nearly every Mirage Island will have a Razor Fang on it, making this the easiest way to get one. Like X and Y, you can win one at the PokeMileage Club for playing the Level 3 Balloon Popping game."
        }
      ]
    }
  ],
  "text":" Evolving Gligar Transfer your Gligar to a Generation IV or later Pokémon game (if necessary). Gligar's evolution, Gliscor, was introduced in the Generation IV versions of Pokémon (Diamond, Pearl, and Platinum), even though Gligar was introduced in Generation II. If you're playing Ruby, Sapphire, Emerald, FireRed, or LeafGreen, you'll need to transfer Gligar to a Generation IV game in order to evolve it. You can transfer from Generation III to Generation IV, but you can't transfer from Generation I or II to Generation III. This means that a Gligar from Gold, Silver, or Crystal cannot be evolved into Gliscor, because it cannot be transferred to a version that supports it. To transfer from Generation III to Generation IV, you'll need to have received the National Pokedex in your Generation III game. Insert the GBA cartridge in your DS and select \"Migrate\" from the main menu of your Generation IV game. Select Gligar and five other Pokémon you want to migrate. In your Generation IV game, visit the Pal Park on Route 221 to catch your migrated Gligar. Find a Razor Fang. This item is required to evolve your Gligar to a Gliscor. It can only be found in Generation IV or later games:\n\nGame\nLocation\n\nDiamondPearlPlatinum\n\n\n Battle Tower, Route 225 (Platinum),Battle Park (D,P), Route 214 (Platinum)\n\n\nHeartGoldSoulSilver\n\n\n Battle Frontier\n\n\nBlackWhite\n\n\n Route 13, Abundant Shrine, Battle Subway\n\n\nBlack 2White 2\n\n\n Route 11, Battle Subway,Pokémon World Tournament\n\n\nXY\n\n\n Battle Maison, PokeMileage Club\n\n\nAlpha SapphireOmega Ruby\n\n\n Battle Resort Give the Razor Fang to your Gligar to hold. Your Gligar must be holding this item in order to evolve. The Razor Fang can cause your opponent to Flinch during battle, which makes it a fairly useful item regardless. Wait until nightfall in your game. Gligar can only evolve when it levels up during the night in your game. The Pokémon games use your system clock to determine the in-game time, and the transition to night occurs at different times for different games. Game\nNighttime\n\nDiamondPearlPlatinumHeartGoldSoulSilver\n\n\n 8 PM - 4 AM\n\n\nBlackWhiteBlack 2White 2\n\n\n Spring: 8 PM - 5 AMSummer: 9 PM - 4 AMAutumn: 8 PM - 6 AMWinter: 7 PM - 7 AM\n\n\nXYAlpha SapphireOmega Ruby\n\n\n 8 PM - 4 AM\n\n\nChanging your system's time in later games will prevent you from being able to evolve Gligar at night for 24 hours. You can safely change your system time while playing Diamond, Pearl, or Platinum to fast-forward to Nighttime. Level up Gligar while it's dark to evolve into Gliscor. It doesn't matter what level Gligar is, it just needs to level up at night while holding the Razor Fang. It will attempt to evolve as soon as it levels up. You can level up by fighting a wild Pokémon or a trainer, or by using a Rare Candy. Obtaining Razor Fangs Get the Razor Fang in Diamond, Pearl, or Platinum. Fight in the Battle Tower after defeating the Elite Four to earn Battle Points (BP). You can spend 48 BP to purchase a Razor Claw. In Platinum, you can find a Razor Fang in the lower-left corner of Route 225, but you'll need Rock Climb to reach it. You can also find one hidden in the southern tall grass on Route 214, but this is Platinum-only as well. In HeartGold and SoulSilver, you can only get a Razor Fang from the Battle Frontier. Find a Razor Fang in Black or White. There are three ways to get a Razor Fang in Black or White:\nYou can find a Razor Claw on Route 13 on the cliff to the south of Artist Zach. Route 13 becomes available after completing the story. You can find a Razor Claw at the Abundant Shrine, southwest of the trainer named Maki. You can earn a Razor Fang at the Battle Subway by winning 48 BP. Get a Razor Fang in Black 2 or White 2. Like their predecessors, there are three ways to get a Razor Fang in Black 2 and White 2:\nBring a Pokémon that knows Surf and Waterfall, and travel to Route 11. You'll find the Razor Fang to the right of Thalia. Earn 8 BP at the Pokémon World Tournament to get a Razor Fang. The Pokémon World Tournament is in Driftveil. This may be the easiest way to get a Razor Fang in the game. You can also get a Razor Fang for 8 BP at the Battle Subway as well, which becomes available later than the Pokémon World Tournament. Win a Razor Fang in X or Y. You can't find a Razor Fang in the world in these game. They'll need to be won:\nA Razor Fang costs 48 BP from the Battle Maison, available after beating the game. You can win a Razor Claw by playing the Balloon Popping game at the PokeMileage Club. The game costs 100 Miles, which are earned by walking in the game and trading with other players. You'll need to play the Level 3 version of the game to get a chance at the Razor Claw. Find a Razor Fang in Alpha Sapphire and Omega Ruby. There are a couple of different ways to get a Razor Fang in the newest Pokémon games:\nThe Battle Maison at the Battle Resort stocks Razor Fangs for 48 BP. Nearly every Mirage Island will have a Razor Fang on it, making this the easiest way to get one. Like X and Y, you can win one at the PokeMileage Club for playing the Level 3 Balloon Popping game.",
  "tyn_model":[
    "razor fang",
    "gligar",
    "razor claw",
    "gliscor",
    "pokémon",
    "razor fangs",
    "gba cartridge",
    "ds"
  ],
  "tyn_section":[

  ]
}