{
  "title":"How to Cut Dryfish",
  "url":"https://www.wikihow.com/Cut-Dryfish",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "parts":[
    {
      "name":"Heading and gutting the fish",
      "steps":[
        {
          "headline":"Remove the head by taking a knife and slicing down on the 'neck area' behind the eyes and above the gills.",
          "description":"Keep the bottom lip on the fish, but remove the cheeks and gills along with the head."
        },
        {
          "headline":"Move your knife to the base of the tail where the fish's \"vent\" is.",
          "description":"Starting at this hole, insert your knife and slice the fish upwards towards the head. Slice the fish entirely up the belly until it can be spread open."
        },
        {
          "headline":"Remove everything within the belly (depending on the sex of the fish there may be eggs or a sperm sack).",
          "description":"Once all of the guts have been removed, take the knife and cut the 'blood line' (which can be found at the base of the spine within the open belly; it will look like a dark red strip). Remove all of the blood from within the blood line."
        },
        {
          "headline":"Rinse the fish in fresh water.",
          "description":""
        }
      ]
    },
    {
      "name":"Cutting through the flesh to the stomach",
      "steps":[
        {
          "headline":"Cut through the meat toward the stomach.",
          "description":"Avoid the rib cage. Use your knife and cut down toward the stomach of the fish, tracing the rib cage as you cut."
        },
        {
          "headline":"Remove a 'fillet' from the meat, but do not remove it from the tail.",
          "description":"Follow the meat cut up to the base of the tail and then stop."
        }
      ]
    },
    {
      "name":"Repeating on the opposite side",
      "steps":[
        {
          "headline":"Starting on the other side, once again cut a strip of meat from the base of the spine, filleting all the way to the stomach, removing the rib cage.",
          "description":"Keep the meat on at the base of the tail."
        },
        {
          "headline":"Remove the rib cage (body).",
          "description":"Once you have cut the fillets on each side of the fish, you should have three strips connected together at the base of the tail. Keep both of your fillets attached to the tail, but remove the body, by cutting through the spinal cord at the base of the tail."
        }
      ]
    },
    {
      "name":"Slicing the fish",
      "steps":[
        {
          "headline":"Cut slices In each fillet.",
          "description":"Starting on one fillet, lay it flat on the cutting board. Hold the knife at an angle, and slice the fish's meat approximately 2 inches (5.1 cm) from the base of the tail. Do not cut through the skin of the fish. Cut only the meat. Continue making slits in the fish every 2 inches (5.1 cm) until you reach the bottom."
        },
        {
          "headline":"Cut one vertical slice down the stomach side: To prevent your fish from curling while drying, cut one vertical slit (again not going through the skin but only the meat) down the stomach of the fish and through the cartilage of the mouth.",
          "description":""
        },
        {
          "headline":"Repeat the previous two steps on the other side.",
          "description":"With your other fillet, repeat this process of cutting slices into the fish and one vertical strip down."
        }
      ]
    },
    {
      "name":"Drying the fish",
      "steps":[
        {
          "headline":"Hang the fish outside in the sun and wind for one day, skin facing out.",
          "description":"Hang the fish only on sunny, windy days when the flies are not active. Hang the fish off the ground (typically on a pole with one fillet on each side). The skin should be facing outwards, the fillets inwards. Allow them to sun-dry for 24 hours."
        },
        {
          "headline":"Flip the fish and continue drying.",
          "description":"Flip the fish so that the fillets are facing outwards and let them dry again for another 24 hours in the sun and wind."
        },
        {
          "headline":"Smoke the fish for two weeks.",
          "description":"Hang the fish in a smokehouse and keep smoke on the fillets for two to four weeks. Alder smoke works best, and alder chips are typically quite affordable."
        }
      ]
    }
  ],
  "text":" Heading and gutting the fish Remove the head by taking a knife and slicing down on the 'neck area' behind the eyes and above the gills. Keep the bottom lip on the fish, but remove the cheeks and gills along with the head. Move your knife to the base of the tail where the fish's \"vent\" is. Starting at this hole, insert your knife and slice the fish upwards towards the head. Slice the fish entirely up the belly until it can be spread open. Remove everything within the belly (depending on the sex of the fish there may be eggs or a sperm sack). Once all of the guts have been removed, take the knife and cut the 'blood line' (which can be found at the base of the spine within the open belly; it will look like a dark red strip). Remove all of the blood from within the blood line. Rinse the fish in fresh water.  Cutting through the flesh to the stomach Cut through the meat toward the stomach. Avoid the rib cage. Use your knife and cut down toward the stomach of the fish, tracing the rib cage as you cut. Remove a 'fillet' from the meat, but do not remove it from the tail. Follow the meat cut up to the base of the tail and then stop. Repeating on the opposite side Starting on the other side, once again cut a strip of meat from the base of the spine, filleting all the way to the stomach, removing the rib cage. Keep the meat on at the base of the tail. Remove the rib cage (body). Once you have cut the fillets on each side of the fish, you should have three strips connected together at the base of the tail. Keep both of your fillets attached to the tail, but remove the body, by cutting through the spinal cord at the base of the tail. Slicing the fish Cut slices In each fillet. Starting on one fillet, lay it flat on the cutting board. Hold the knife at an angle, and slice the fish's meat approximately 2 inches (5.1 cm) from the base of the tail. Do not cut through the skin of the fish. Cut only the meat. Continue making slits in the fish every 2 inches (5.1 cm) until you reach the bottom. Cut one vertical slice down the stomach side: To prevent your fish from curling while drying, cut one vertical slit (again not going through the skin but only the meat) down the stomach of the fish and through the cartilage of the mouth.  Repeat the previous two steps on the other side. With your other fillet, repeat this process of cutting slices into the fish and one vertical strip down. Drying the fish Hang the fish outside in the sun and wind for one day, skin facing out. Hang the fish only on sunny, windy days when the flies are not active. Hang the fish off the ground (typically on a pole with one fillet on each side). The skin should be facing outwards, the fillets inwards. Allow them to sun-dry for 24 hours. Flip the fish and continue drying. Flip the fish so that the fillets are facing outwards and let them dry again for another 24 hours in the sun and wind. Smoke the fish for two weeks. Hang the fish in a smokehouse and keep smoke on the fillets for two to four weeks. Alder smoke works best, and alder chips are typically quite affordable.",
  "tyn_model":[
    "fish",
    "knife",
    "meat",
    "water",
    "cutting board",
    "flies",
    "alder chips"
  ],
  "tyn_section":[

  ]
}