{
  "title":"How to Make and Play Chips a Bunch",
  "url":"https://www.wikihow.com/Make-and-Play-Chips-a-Bunch",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Creating Games"
  ],
  "methods":[
    {
      "name":"Make the Board",
      "steps":[
        {
          "headline":"Find a medium-sized, recycled piece of cardboard.",
          "description":""
        },
        {
          "headline":"Use a medicine cap as a stencil to make 40 circles in five rows of eight circles each on the cardboard.",
          "description":""
        },
        {
          "headline":"Label the columns alphabetically and the rows numerically along the edges of the board.",
          "description":""
        },
        {
          "headline":"Use a somewhat shorter length of cardboard to make a holder of the different assets of the game.",
          "description":""
        },
        {
          "headline":"After the holder is finished, staple it on the bottom of the game board, so that it can fold.",
          "description":""
        }
      ]
    },
    {
      "name":"Make the Chips",
      "steps":[
        {
          "headline":"Use the same medicine cap to make the chips out of cardboard.",
          "description":""
        },
        {
          "headline":"Make three chips apiece labeled as each of the following: Lose Everything, Free Turn, and different genres of prizes, such a Vacation or a Timely Supply of Something.",
          "description":""
        },
        {
          "headline":"Make four chips apiece labeled as each of the following: $500, $1,000, $2,500, $5,000, $10,000, $25,000, $50,000, Double your Money, Quintuple your Money, and Decouple your Money.",
          "description":""
        },
        {
          "headline":"Make a single red chip out of card stock.",
          "description":"That's known to be \"The Mystery Jackpot Spot\"."
        }
      ]
    },
    {
      "name":"Play Chips-A-Bunch",
      "steps":[
        {
          "headline":"Call each chip out by alpha-numeric code.",
          "description":"Whatever is on that chip is a part of your earnings."
        },
        {
          "headline":"If a multiplier was on the chip, then you've multiplied your earnings.",
          "description":""
        },
        {
          "headline":"You must avoid finding a \"Lose Everything\" chip.",
          "description":"However, if you don't have anything right from the start and a Lose Everything was drawn, then the chip is no good."
        },
        {
          "headline":"In the second round known as Super Chips-A-Bunch, the earnings are doubled and the  multipliers are increased.",
          "description":""
        },
        {
          "headline":"Whoever has the most earnings in cash and prizes from both rounds gets to play \"The Mystery Jackpot Spot\" bonus round.",
          "description":"You'll need one player to tally up everything earned from the first two rounds. That's the Jackpot."
        }
      ]
    },
    {
      "name":"Play the Bonus Round",
      "steps":[
        {
          "headline":"There are five spread-out chips on the Chips-A-Bunch board.",
          "description":""
        },
        {
          "headline":"There is a 1-in-5 chance to find the chip which is bearing the Mystery Jackpot spot underneath it.",
          "description":""
        },
        {
          "headline":"There is a 4-in-5 chance of earning an additional $500.",
          "description":""
        }
      ]
    }
  ],
  "text":" Make the Board Find a medium-sized, recycled piece of cardboard.  Use a medicine cap as a stencil to make 40 circles in five rows of eight circles each on the cardboard.  Label the columns alphabetically and the rows numerically along the edges of the board.  Use a somewhat shorter length of cardboard to make a holder of the different assets of the game.  After the holder is finished, staple it on the bottom of the game board, so that it can fold.  Make the Chips Use the same medicine cap to make the chips out of cardboard.  Make three chips apiece labeled as each of the following: Lose Everything, Free Turn, and different genres of prizes, such a Vacation or a Timely Supply of Something.  Make four chips apiece labeled as each of the following: $500, $1,000, $2,500, $5,000, $10,000, $25,000, $50,000, Double your Money, Quintuple your Money, and Decouple your Money.  Make a single red chip out of card stock. That's known to be \"The Mystery Jackpot Spot\". Play Chips-A-Bunch Call each chip out by alpha-numeric code. Whatever is on that chip is a part of your earnings. If a multiplier was on the chip, then you've multiplied your earnings.  You must avoid finding a \"Lose Everything\" chip. However, if you don't have anything right from the start and a Lose Everything was drawn, then the chip is no good. In the second round known as Super Chips-A-Bunch, the earnings are doubled and the  multipliers are increased.  Whoever has the most earnings in cash and prizes from both rounds gets to play \"The Mystery Jackpot Spot\" bonus round. You'll need one player to tally up everything earned from the first two rounds. That's the Jackpot. Play the Bonus Round There are five spread-out chips on the Chips-A-Bunch board.  There is a 1-in-5 chance to find the chip which is bearing the Mystery Jackpot spot underneath it.  There is a 4-in-5 chance of earning an additional $500. ",
  "tyn_model":[
    "cardboard",
    "medicine cap",
    "game board",
    "card stock"
  ],
  "tyn_section":[

  ]
}