{
  "title":"How to Choose Musical Toys",
  "url":"https://www.wikihow.com/Choose-Musical-Toys",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Traditional Toys"
  ],
  "steps":[
    {
      "headline":"Choose toys that will not break easily.",
      "description":"Look carefully at the item you want to purchase. Is it sturdy? Match the break ability of the toy to the level of destructiveness of your child."
    },
    {
      "headline":"Match the musical instrument to the interests of your child.",
      "description":"If your child loves flute music, purchase a flute. If they like rock, purchase an electric guitar or drum set."
    },
    {
      "headline":"Research your options.",
      "description":"There are a wide range of possibilities out there in the \"toy instrument\" category. Some are sturdier than others... some are more musically accurate than others. Knowledge is power in these cases."
    },
    {
      "headline":"Choose an introductory level instrument.",
      "description":"There is no need to rush out and purchase a $800 instrument for a very young child. A simple \"Recorder\" may sate your child's musical inclinations just fine."
    },
    {
      "headline":"Ask advice from a music teacher.",
      "description":"Someone who teaches young children can give you excellent advice about which instruments can hold up to abuse while still retaining their musical quality."
    },
    {
      "headline":"Choose an instrument whose noise you can tolerate for long periods of time.",
      "description":""
    }
  ],
  "text":" Choose toys that will not break easily. Look carefully at the item you want to purchase. Is it sturdy? Match the break ability of the toy to the level of destructiveness of your child. Match the musical instrument to the interests of your child. If your child loves flute music, purchase a flute. If they like rock, purchase an electric guitar or drum set. Research your options. There are a wide range of possibilities out there in the \"toy instrument\" category. Some are sturdier than others... some are more musically accurate than others. Knowledge is power in these cases. Choose an introductory level instrument. There is no need to rush out and purchase a $800 instrument for a very young child. A simple \"Recorder\" may sate your child's musical inclinations just fine. Ask advice from a music teacher. Someone who teaches young children can give you excellent advice about which instruments can hold up to abuse while still retaining their musical quality. Choose an instrument whose noise you can tolerate for long periods of time. ",
  "tyn_model":[
    "instrument",
    "flute",
    "toys",
    "musical instrument",
    "electric guitar",
    "drum",
    "recorder",
    "music teacher",
    "instruments"
  ],
  "tyn_section":[

  ]
}