{
  "title":"How to Get Free LEGOs",
  "url":"https://www.wikihow.com/Get-Free-LEGOs",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Construction Toys",
    "LEGO and Other Building Blocks"
  ],
  "methods":[
    {
      "name":"Becoming a Lego VIP",
      "steps":[
        {
          "headline":"Register with LEGO to be a VIP.",
          "description":"LEGO VIP status is free to anyone 18 and older. As a VIP you’ll enjoy special shopping days at the LEGO store and access to free samples during special events. Go online to LEGO.com and click on the link to VIP section. Complete the online registration. When shopping online at LEGO.com click Join VIP program when you checkout. Register at an official LEGO store to join the VIP program."
        },
        {
          "headline":"Sign up for VIP newsletters and special deals.",
          "description":"As a LEGO VIP you will receive notice of new product launches and have the opportunity to register for special VIP gifts. Take advantage of all the free perks of VIP membership to have the most chances to receive free LEGO products."
        },
        {
          "headline":"Attend VIP only shopping days at your local LEGO store.",
          "description":"Check the LEGO website to find the store nearest you. Each store participates in VIP only shopping hours and gives out gifts and prizes to VIP attendees. Arrive early during VIP shopping to ensure the gifts are available; some items may have limited quantities."
        }
      ]
    },
    {
      "name":"Getting Missing Parts",
      "steps":[
        {
          "headline":"Find the box for your LEGO set that is missing parts.",
          "description":"Look for the set number on the side of the box or on the instructions. If you can’t find the box or instructions, you can look up the product number online. Go to www.lego.com/en-us/products. Scroll through the pictures of Lego products and find your theme and set. Copy the set number so you can use it later when you are requesting parts."
        },
        {
          "headline":"Go to LEGO.com.",
          "description":"If you have damaged or missing LEGO pieces you can request a replacement part to be shipped for free. Access the customer service portion of the LEGO.com homepage by clicking on the link at the bottom of the page. Click on the “Missing Parts” link. Enter your age and your country of origin on the “Bricks & Pieces” page (You must be 18 years old or older to shop online at the LEGO.com website). Click “Next.”\nAsk a parent for help if you are under 18."
        },
        {
          "headline":"Select “My new set has a missing piece” or “My new set has a broken piece.” Type in the set number.",
          "description":"Click “Go.” This will bring you to a listing of all the parts contained in the set number you entered. Not all parts are available for replacement at all times. If your part is out of stock, you can request a new one be sent once it is available."
        },
        {
          "headline":"Select the parts that are missing.",
          "description":"Click “Checkout” after you are done choosing pieces."
        },
        {
          "headline":"Enter your shipping address, including your email address.",
          "description":"Click “Next” and then confirm the shipment. Unless you chose to buy pieces, the order should be free of charge."
        },
        {
          "headline":"Look for your email confirmation.",
          "description":"Your LEGO should arrive within a couple of weeks."
        }
      ]
    },
    {
      "name":"Entering Lego Contests",
      "steps":[
        {
          "headline":"Set up a Google Alert for “LEGO Contest\".",
          "description":"LEGO occasionally hosts building contests. The prizes are large, expensive sets of LEGO. Go to Google.com/alerts. Type in your query, “LEGO contests.”\nType in your email, and choose the frequency of the alert."
        },
        {
          "headline":"Follow the Google alert links as they come into your inbox.",
          "description":"Read the instructions carefully so you know what you are eligible to win."
        },
        {
          "headline":"Use your existing LEGO to build a creative design.",
          "description":"Most Lego contests are during the holiday season or are promotions for Lego products. Try to be as creative as possible. Follow the theme of the contest to have the best chance of winning. Some contests may allow more than one entry per person, build multiple designs to maximize your chance of winning."
        },
        {
          "headline":"Snap a high-resolution photo of the LEGO structure or object you’ve built.",
          "description":"Upload it to the contest site, and type in your personal information to enter the contest."
        },
        {
          "headline":"Wait several days to several weeks for the contest results.",
          "description":"If you win the contest you will be notified that you are a winner and should receive your prize within a few weeks. Some contests may have limitations for ages of applicants, make sure to read the details when you are registering for the contest."
        }
      ]
    },
    {
      "name":"Getting LEGO on Halloween",
      "steps":[
        {
          "headline":"Dress up in your favorite Halloween costume on Halloween.",
          "description":"Consider making a costume of your favorite LEGO man or structure."
        },
        {
          "headline":"Go to a LEGO store to trick or treat.",
          "description":"LEGO stores often give free LEGO items on Halloween to costumed customers."
        },
        {
          "headline":"Check websites of local toy stores.",
          "description":"Many big box toy stores, such as Target, provide LEGO giveaways during the Halloween season. Check online to see if a store near you is participating in a giveaway."
        }
      ]
    },
    {
      "name":"Renting LEGOs",
      "steps":[
        {
          "headline":"Sign up for membership with a toy rental company.",
          "description":"As an alternative to purchasing expensive, elaborate LEGO sets, you can rent as many sets as you’d like (one at a time) for a monthly fee."
        },
        {
          "headline":"Choose the sets you’d like to build.",
          "description":"Once you have selected a set, the company will ship the LEGO set and instructions to your house. You can make a list of several sets in the order you’d like to receive them. Each set will ship after you return the previous set. Most companies only allow you to rent one set at a time."
        },
        {
          "headline":"Build your LEGO set.",
          "description":"Enjoy playing with and building your LEGO set for as long as you’d like during your membership."
        },
        {
          "headline":"Return your set when you're done.",
          "description":"Once you send back your current set, the rental company will send you the next item on your playlist. Keep each item until you are done with it and return it for a new LEGO set. Currently there is no additional charge if you lose a piece in the process of building and playing with a rented LEGO set."
        }
      ]
    }
  ],
  "text":" Becoming a Lego VIP Register with LEGO to be a VIP. LEGO VIP status is free to anyone 18 and older. As a VIP you’ll enjoy special shopping days at the LEGO store and access to free samples during special events. Go online to LEGO.com and click on the link to VIP section. Complete the online registration. When shopping online at LEGO.com click Join VIP program when you checkout. Register at an official LEGO store to join the VIP program. Sign up for VIP newsletters and special deals. As a LEGO VIP you will receive notice of new product launches and have the opportunity to register for special VIP gifts. Take advantage of all the free perks of VIP membership to have the most chances to receive free LEGO products. Attend VIP only shopping days at your local LEGO store. Check the LEGO website to find the store nearest you. Each store participates in VIP only shopping hours and gives out gifts and prizes to VIP attendees. Arrive early during VIP shopping to ensure the gifts are available; some items may have limited quantities. Getting Missing Parts Find the box for your LEGO set that is missing parts. Look for the set number on the side of the box or on the instructions. If you can’t find the box or instructions, you can look up the product number online. Go to www.lego.com/en-us/products. Scroll through the pictures of Lego products and find your theme and set. Copy the set number so you can use it later when you are requesting parts. Go to LEGO.com. If you have damaged or missing LEGO pieces you can request a replacement part to be shipped for free. Access the customer service portion of the LEGO.com homepage by clicking on the link at the bottom of the page. Click on the “Missing Parts” link. Enter your age and your country of origin on the “Bricks & Pieces” page (You must be 18 years old or older to shop online at the LEGO.com website). Click “Next.”\nAsk a parent for help if you are under 18. Select “My new set has a missing piece” or “My new set has a broken piece.” Type in the set number. Click “Go.” This will bring you to a listing of all the parts contained in the set number you entered. Not all parts are available for replacement at all times. If your part is out of stock, you can request a new one be sent once it is available. Select the parts that are missing. Click “Checkout” after you are done choosing pieces. Enter your shipping address, including your email address. Click “Next” and then confirm the shipment. Unless you chose to buy pieces, the order should be free of charge. Look for your email confirmation. Your LEGO should arrive within a couple of weeks. Entering Lego Contests Set up a Google Alert for “LEGO Contest\". LEGO occasionally hosts building contests. The prizes are large, expensive sets of LEGO. Go to Google.com/alerts. Type in your query, “LEGO contests.”\nType in your email, and choose the frequency of the alert. Follow the Google alert links as they come into your inbox. Read the instructions carefully so you know what you are eligible to win. Use your existing LEGO to build a creative design. Most Lego contests are during the holiday season or are promotions for Lego products. Try to be as creative as possible. Follow the theme of the contest to have the best chance of winning. Some contests may allow more than one entry per person, build multiple designs to maximize your chance of winning. Snap a high-resolution photo of the LEGO structure or object you’ve built. Upload it to the contest site, and type in your personal information to enter the contest. Wait several days to several weeks for the contest results. If you win the contest you will be notified that you are a winner and should receive your prize within a few weeks. Some contests may have limitations for ages of applicants, make sure to read the details when you are registering for the contest. Getting LEGO on Halloween Dress up in your favorite Halloween costume on Halloween. Consider making a costume of your favorite LEGO man or structure. Go to a LEGO store to trick or treat. LEGO stores often give free LEGO items on Halloween to costumed customers. Check websites of local toy stores. Many big box toy stores, such as Target, provide LEGO giveaways during the Halloween season. Check online to see if a store near you is participating in a giveaway. Renting LEGOs Sign up for membership with a toy rental company. As an alternative to purchasing expensive, elaborate LEGO sets, you can rent as many sets as you’d like (one at a time) for a monthly fee. Choose the sets you’d like to build. Once you have selected a set, the company will ship the LEGO set and instructions to your house. You can make a list of several sets in the order you’d like to receive them. Each set will ship after you return the previous set. Most companies only allow you to rent one set at a time. Build your LEGO set. Enjoy playing with and building your LEGO set for as long as you’d like during your membership. Return your set when you're done. Once you send back your current set, the rental company will send you the next item on your playlist. Keep each item until you are done with it and return it for a new LEGO set. Currently there is no additional charge if you lose a piece in the process of building and playing with a rented LEGO set.",
  "tyn_model":[
    "lego",
    "lego set",
    "lego products",
    "“next",
    "”\n",
    "“my",
    "“lego",
    "“missing",
    "” link",
    "“bricks",
    "” page",
    "” or",
    "” type",
    "“go",
    "” this",
    "“checkout",
    "” after",
    "” and",
    "lego store",
    "legos",
    "toy rental company"
  ],
  "tyn_section":[

  ]
}