{
  "title":"How to Learn About Cameras with Flickr's Camera Finder",
  "url":"https://www.wikihow.com/Learn-About-Cameras-with-Flickr%27s-Camera-Finder",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography"
  ],
  "steps":[
    {
      "headline":"Go to the camera finder that you can find on Flickr.",
      "description":""
    },
    {
      "headline":"Select the camera that you are thinking about getting or switching to.",
      "description":"Here, the Nikon D3100 has been selected."
    },
    {
      "headline":"Take a screenshot of it.",
      "description":"This will make it easier to compare it with your other possible choices."
    },
    {
      "headline":"Look at the various data that you will want to compare.",
      "description":"A few are:\n\nSensor Resolution/pixel count - 14.2 megapixels here\nLCD Size - This is pretty specific to you. Big is nice, but not necessary. Media Type - SD cards are a little easier to get hold of\nWeight - If you are carrying it around, this is information you will want to know\n\nLens Mount - There are various types of lens and while most cameras will use the same mount for their make of camera, some don't. It is good information to have."
    },
    {
      "headline":"Look over at the side of the page and the usage that Flickr is seeing for the D3100.",
      "description":"Here you see that it had a steady decline until recently?? Nikon have a big sale? ?"
    },
    {
      "headline":"Do the same thing with other cameras that you are considering.",
      "description":""
    },
    {
      "headline":"Compare usage.",
      "description":"You might want to do this to see how they compare with each other. For the most part, digital cameras, on Flickr, seemed to decline a bit. At least 2 of the Nikons. The D800 was all over the place and the Canon did fairly well but has a similar pattern as the 2 Nikons. Maybe, it's the iPhone?"
    },
    {
      "headline":"Scroll down the page and look at the images that people have shared made with those particular cameras.",
      "description":"Flickr can do this as long as your images retain their EXIF information."
    },
    {
      "headline":"Check out the page for the camera body you are looking at.",
      "description":"Nikon here. You can see lots of different kinds of Nikons and the various data that they collect."
    }
  ],
  "text":" Go to the camera finder that you can find on Flickr.  Select the camera that you are thinking about getting or switching to. Here, the Nikon D3100 has been selected. Take a screenshot of it. This will make it easier to compare it with your other possible choices. Look at the various data that you will want to compare. A few are:\n\nSensor Resolution/pixel count - 14.2 megapixels here\nLCD Size - This is pretty specific to you. Big is nice, but not necessary. Media Type - SD cards are a little easier to get hold of\nWeight - If you are carrying it around, this is information you will want to know\n\nLens Mount - There are various types of lens and while most cameras will use the same mount for their make of camera, some don't. It is good information to have. Look over at the side of the page and the usage that Flickr is seeing for the D3100. Here you see that it had a steady decline until recently?? Nikon have a big sale? ? Do the same thing with other cameras that you are considering.  Compare usage. You might want to do this to see how they compare with each other. For the most part, digital cameras, on Flickr, seemed to decline a bit. At least 2 of the Nikons. The D800 was all over the place and the Canon did fairly well but has a similar pattern as the 2 Nikons. Maybe, it's the iPhone? Scroll down the page and look at the images that people have shared made with those particular cameras. Flickr can do this as long as your images retain their EXIF information. Check out the page for the camera body you are looking at. Nikon here. You can see lots of different kinds of Nikons and the various data that they collect.",
  "tyn_model":[
    "flickr",
    "camera finder",
    "camera",
    "cameras",
    "digital cameras",
    "canon",
    "nikon",
    "nikons"
  ],
  "tyn_section":[

  ]
}