{
  "title":"How to Make Upside Down Toffee Apple Cake",
  "url":"https://www.wikihow.com/Make-Upside-Down-Toffee-Apple-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Fruit Cakes"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 180ºC.",
      "description":"(350F) Prepare the cake tin by either greasing it, or lining it with baking paper."
    },
    {
      "headline":"Make the toffee part first.",
      "description":"In a small saucepan, add the sugar, cinnamon stick and water. Stir the sugar until it dissolves. Boil until the the mixture turns golden brown. This will take about 10 minutes. Remove the cinnamon stick and pour the toffee mixture into the base of the cake tin."
    },
    {
      "headline":"Prepare the apple slices.",
      "description":"Peel, core and slice the fresh apples. Layer the slices across the toffee base in the cake tin."
    },
    {
      "headline":"Make the cake.",
      "description":"Cream the butter and sugar together. Add the eggs, one at a time and the vanilla."
    },
    {
      "headline":"Stir in the flour, baking powder, cloves.",
      "description":"Add the milk as you stir; it might not be necessary to use the whole cup, so use your judgment as you stir. Once the mixture is combined well, pour over the apple and toffee base in the cake tin."
    },
    {
      "headline":"Place in the oven to bake for 40-50 minutes, or until the cake is golden brown and a skewer pierced into the cake returns clean.",
      "description":""
    },
    {
      "headline":"Remove from the oven.",
      "description":"Run a knife around the edge of the tin to move the cake away from the tin. Put a large serving plate over the mouth of the tin and carefully turn over the whole tin. The cake should gently slide onto the plate, with the toffee apple topping facing upwards."
    },
    {
      "headline":"Serve.",
      "description":"This goes well with whipped cream and some fresh apple slices."
    }
  ],
  "text":" Preheat the oven to 180ºC. (350F) Prepare the cake tin by either greasing it, or lining it with baking paper. Make the toffee part first. In a small saucepan, add the sugar, cinnamon stick and water. Stir the sugar until it dissolves. Boil until the the mixture turns golden brown. This will take about 10 minutes. Remove the cinnamon stick and pour the toffee mixture into the base of the cake tin. Prepare the apple slices. Peel, core and slice the fresh apples. Layer the slices across the toffee base in the cake tin. Make the cake. Cream the butter and sugar together. Add the eggs, one at a time and the vanilla. Stir in the flour, baking powder, cloves. Add the milk as you stir; it might not be necessary to use the whole cup, so use your judgment as you stir. Once the mixture is combined well, pour over the apple and toffee base in the cake tin. Place in the oven to bake for 40-50 minutes, or until the cake is golden brown and a skewer pierced into the cake returns clean.  Remove from the oven. Run a knife around the edge of the tin to move the cake away from the tin. Put a large serving plate over the mouth of the tin and carefully turn over the whole tin. The cake should gently slide onto the plate, with the toffee apple topping facing upwards. Serve. This goes well with whipped cream and some fresh apple slices.",
  "tyn_model":[
    "cake tin",
    "sugar",
    "oven",
    "cinnamon stick",
    "toffee",
    "apple",
    "baking paper",
    "small saucepan",
    "water",
    "apples",
    "butter",
    "eggs",
    "vanilla",
    "flour",
    "baking powder",
    "cloves",
    "milk",
    "knife",
    "large serving plate",
    "plate",
    "toffee apple topping",
    "whipped cream"
  ],
  "tyn_section":[

  ]
}