{
  "title":"How to Make Kumara Cheesecake",
  "url":"https://www.wikihow.com/Make-Kumara-Cheesecake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies",
    "Cheesecake"
  ],
  "steps":[
    {
      "headline":"Prepare the baking tin by cutting the baking paper to fit the base.",
      "description":"Grease the sides with butter, or use a spray-on oil. Preheat the oven to 180ºC."
    },
    {
      "headline":"Peel and wash the kumara.",
      "description":"Cut into small chunks and boil. When soft, remove from the heat."
    },
    {
      "headline":"Wash the lemon and grate its zest.",
      "description":"Put to one side. Squeeze the juice from the lemon into a container."
    },
    {
      "headline":"Put the kumara and sugar into a food processor.",
      "description":"Pour the lemon juice over the top. Pulse and reduce the ingredients to a paste consistency."
    },
    {
      "headline":"Add the cream cheese and pulse until it is mixed into the paste.",
      "description":""
    },
    {
      "headline":"Add the eggs, one after the other, and process into the paste using the lowest processor setting.",
      "description":""
    },
    {
      "headline":"Remove from the processor and fold in the lemon zest.",
      "description":""
    },
    {
      "headline":"Pour the mixture into the baking tin and smooth evenly.",
      "description":""
    },
    {
      "headline":"Put into the oven to bake for 40 minutes.",
      "description":"Or, bake until the top is golden and the edges of the cheesecake are shrinking away from the edge of the tin."
    },
    {
      "headline":"Sit the whole tin over a wire cooling rack.",
      "description":"Leave the cheesecake until it has cooled down completely before removing the tin."
    },
    {
      "headline":"Arrange the cheesecake on a suitable serving plate.",
      "description":"Dust the top with icing sugar. It should be chilled prior to serving. Serve with fruit and whipped cream."
    }
  ],
  "text":" Prepare the baking tin by cutting the baking paper to fit the base. Grease the sides with butter, or use a spray-on oil. Preheat the oven to 180ºC. Peel and wash the kumara. Cut into small chunks and boil. When soft, remove from the heat. Wash the lemon and grate its zest. Put to one side. Squeeze the juice from the lemon into a container. Put the kumara and sugar into a food processor. Pour the lemon juice over the top. Pulse and reduce the ingredients to a paste consistency. Add the cream cheese and pulse until it is mixed into the paste.  Add the eggs, one after the other, and process into the paste using the lowest processor setting.  Remove from the processor and fold in the lemon zest.  Pour the mixture into the baking tin and smooth evenly.  Put into the oven to bake for 40 minutes. Or, bake until the top is golden and the edges of the cheesecake are shrinking away from the edge of the tin. Sit the whole tin over a wire cooling rack. Leave the cheesecake until it has cooled down completely before removing the tin. Arrange the cheesecake on a suitable serving plate. Dust the top with icing sugar. It should be chilled prior to serving. Serve with fruit and whipped cream.",
  "tyn_model":[
    "lemon",
    "baking tin",
    "oven",
    "baking paper",
    "butter",
    "spray-on oil",
    "container",
    "sugar",
    "food processor",
    "cream cheese",
    "eggs",
    "processor",
    "icing sugar",
    "fruit",
    "whipped cream"
  ],
  "tyn_section":[

  ]
}