{
  "title":"How to Make Potato Water for Cleaning Fabric",
  "url":"https://www.wikihow.com/Make-Potato-Water-for-Cleaning-Fabric",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "Home Cleaning Preparations"
  ],
  "steps":[
    {
      "headline":"Pour the water into a large container or basin.",
      "description":""
    },
    {
      "headline":"Grate the potatoes into the container.",
      "description":"There is no need to peel them if they are clean; if they are dirty, either wash well, or peel."
    },
    {
      "headline":"Strain the water through a sieve into another large container that contains the same amount of water.",
      "description":"Push down hard on the potato gratings caught in the sieve to release more liquid into the new container."
    },
    {
      "headline":"Leave to settle.",
      "description":"It is now ready for use. Use by dipping a clean sponge into the water and dabbing the sponge directly on stains on fabric and soiled clothes. If using on a carpet, dab directly on the spot."
    },
    {
      "headline":"Wash the portable items after with cold water.",
      "description":"For carpets and rugs, either simply leave to dry, or wipe gently with a moist cloth dipped in cold water."
    }
  ],
  "text":" Pour the water into a large container or basin.  Grate the potatoes into the container. There is no need to peel them if they are clean; if they are dirty, either wash well, or peel. Strain the water through a sieve into another large container that contains the same amount of water. Push down hard on the potato gratings caught in the sieve to release more liquid into the new container. Leave to settle. It is now ready for use. Use by dipping a clean sponge into the water and dabbing the sponge directly on stains on fabric and soiled clothes. If using on a carpet, dab directly on the spot. Wash the portable items after with cold water. For carpets and rugs, either simply leave to dry, or wipe gently with a moist cloth dipped in cold water.",
  "tyn_model":[
    "water",
    "sieve",
    "sponge",
    "potatoes",
    "potato"
  ],
  "tyn_section":[

  ]
}