{
  "title":"How to Make Wassail",
  "url":"https://www.wikihow.com/Make-Wassail",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Beer and Cider"
  ],
  "methods":[
    {
      "name":"Apple cider and pineapple juice wassail",
      "steps":[
        {
          "headline":"Combine the apple cider, brown sugar, cinnamon sticks and cloves in a deep saucepan.",
          "description":""
        },
        {
          "headline":"Bring the liquid to a boil over medium heat.",
          "description":"After it begins to boil, reduce the heat to low and let it simmer for 5 minutes."
        },
        {
          "headline":"Mix in the orange juice concentrate and pineapple juice.",
          "description":"Continue simmering the wassail until it's is evenly heated."
        },
        {
          "headline":"Strain the liquid through a cheesecloth or sieve into a slow cooker.",
          "description":"Stir in the rum, if you're using it."
        },
        {
          "headline":"Allow the drink to set for about 10 minutes in the slow cooker.",
          "description":"Turn the slow cooker on Low if you need to keep the drink warm for an extended period of time."
        },
        {
          "headline":"Serve the wassail in a tulip glass and garnish with a slice of fresh apple.",
          "description":""
        }
      ]
    },
    {
      "name":"Apple cider and orange juice wassail",
      "steps":[
        {
          "headline":"Bring the apple cider to a simmer in a stock pot.",
          "description":"Add the frozen orange juice concentrate and mix the juices together with a whisk."
        },
        {
          "headline":"Wrap whole allspice and cloves into a bouquet garni, using cheesecloth for the wrapping and securing the bouquet garni with kitchen string.",
          "description":"Alternately, you can place the spices into a tea ball."
        },
        {
          "headline":"Add this spice packet to the pot along with the cinnamon sticks.",
          "description":"Simmer the liquid for 1 hour."
        },
        {
          "headline":"Remove the bouquet garni and stir in the brown sugar.",
          "description":""
        },
        {
          "headline":"Serve the wassail warm in a clear mug.",
          "description":"Garnish the beverage with an orange slice."
        }
      ]
    },
    {
      "name":"Apple cider and tea wassail",
      "steps":[
        {
          "headline":"Wrap the cinnamon sticks, cloves and ground ginger in cheesecloth or in a cloth spice bag.",
          "description":"Secure the top with kitchen string."
        },
        {
          "headline":"Make the spice liquid by combining the spice bag, water and sugar in a large stock pot.",
          "description":"Bring the mixture to a boil over high heat. Allow the liquid to boil for 2 to 3 minutes. Then, remove the stock pot from the heat, cover it and allow the liquid to steep overnight."
        },
        {
          "headline":"Stir the tea, orange juice concentrate, lemon juice concentrate and apple cider into the steeped spice liquid.",
          "description":""
        },
        {
          "headline":"Fill the empty 6-ounce (177 ml) can from the lemon juice concentrate with water.",
          "description":"Pour the can into the stock pot. Repeat the process 9 times to add a total of 10 cans of water into the mixture."
        },
        {
          "headline":"Warm the stock pot over medium heat.",
          "description":"Allow the wassail to simmer until it is heated through, stirring occasionally."
        },
        {
          "headline":"Serve the hot wassail in a mug garnished with a cinnamon stick.",
          "description":"If you're adding brandy, pour 1.5 ounces (1 jigger) of peach brandy into each mug before adding the wassail."
        }
      ]
    }
  ],
  "text":" Apple cider and pineapple juice wassail Combine the apple cider, brown sugar, cinnamon sticks and cloves in a deep saucepan.  Bring the liquid to a boil over medium heat. After it begins to boil, reduce the heat to low and let it simmer for 5 minutes. Mix in the orange juice concentrate and pineapple juice. Continue simmering the wassail until it's is evenly heated. Strain the liquid through a cheesecloth or sieve into a slow cooker. Stir in the rum, if you're using it. Allow the drink to set for about 10 minutes in the slow cooker. Turn the slow cooker on Low if you need to keep the drink warm for an extended period of time. Serve the wassail in a tulip glass and garnish with a slice of fresh apple.  Apple cider and orange juice wassail Bring the apple cider to a simmer in a stock pot. Add the frozen orange juice concentrate and mix the juices together with a whisk. Wrap whole allspice and cloves into a bouquet garni, using cheesecloth for the wrapping and securing the bouquet garni with kitchen string. Alternately, you can place the spices into a tea ball. Add this spice packet to the pot along with the cinnamon sticks. Simmer the liquid for 1 hour. Remove the bouquet garni and stir in the brown sugar.  Serve the wassail warm in a clear mug. Garnish the beverage with an orange slice. Apple cider and tea wassail Wrap the cinnamon sticks, cloves and ground ginger in cheesecloth or in a cloth spice bag. Secure the top with kitchen string. Make the spice liquid by combining the spice bag, water and sugar in a large stock pot. Bring the mixture to a boil over high heat. Allow the liquid to boil for 2 to 3 minutes. Then, remove the stock pot from the heat, cover it and allow the liquid to steep overnight. Stir the tea, orange juice concentrate, lemon juice concentrate and apple cider into the steeped spice liquid.  Fill the empty 6-ounce (177 ml) can from the lemon juice concentrate with water. Pour the can into the stock pot. Repeat the process 9 times to add a total of 10 cans of water into the mixture. Warm the stock pot over medium heat. Allow the wassail to simmer until it is heated through, stirring occasionally. Serve the hot wassail in a mug garnished with a cinnamon stick. If you're adding brandy, pour 1.5 ounces (1 jigger) of peach brandy into each mug before adding the wassail.",
  "tyn_model":[
    "apple cider",
    "stock pot",
    "cinnamon sticks",
    "cloves",
    "orange juice",
    "slow cooker",
    "water",
    "pineapple juice",
    "brown sugar",
    "wassail",
    "cheesecloth",
    "kitchen string",
    "deep saucepan",
    "cheesecloth or sieve",
    "rum",
    "tulip glass",
    "whisk",
    "allspice",
    "tea ball",
    "spice packet",
    "pot",
    "clear mug",
    "orange slice",
    "tea wassail",
    "ginger",
    "spice bag",
    "sugar",
    "large stock pot",
    "tea",
    "orange juice concentrate",
    "lemon juice concentrate",
    "lemon juice",
    "cinnamon stick",
    "brandy",
    "peach brandy"
  ],
  "tyn_section":[

  ]
}