{
  "title":"How to Make Triple Chocolate Brownies",
  "url":"https://www.wikihow.com/Make-Triple-Chocolate-Brownies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Brownies"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350° Fahrenheit or 120° Celsius.",
      "description":""
    },
    {
      "headline":"Grease and flour a 13-by 9-inch baking pan.",
      "description":""
    },
    {
      "headline":"Melt the bittersweet and unsweetened chocolate with the butter.",
      "description":"Place a metal bowl over a large pan of barely simmering water. Melt both chocolates with the butter, stirring well with a spoon."
    },
    {
      "headline":"Remove the bowl from the heat and allow the chocolate to cool.",
      "description":""
    },
    {
      "headline":"Add in the vanilla extract, eggs, and sugar.",
      "description":"Stir well with a whisk."
    },
    {
      "headline":"Pour the flour and salt into the brownie batter.",
      "description":"Mix well until the batter starts to get thick. Ensure there are no flour streaks."
    },
    {
      "headline":"Fold in the chocolate chips and stir until fully combined.",
      "description":""
    },
    {
      "headline":"Bake the brownies in the oven for about 25-30 minutes.",
      "description":"The tops of the brownies should be smooth."
    },
    {
      "headline":"Allow the brownies to cool and then slice into squares.",
      "description":""
    },
    {
      "headline":"Serve.",
      "description":"Place a brownie on a serving plate. Garnish with extra chocolate chips and adding a scoopful of vanilla ice cream on top. Enjoy!"
    }
  ],
  "text":" Preheat the oven to 350° Fahrenheit or 120° Celsius.  Grease and flour a 13-by 9-inch baking pan.  Melt the bittersweet and unsweetened chocolate with the butter. Place a metal bowl over a large pan of barely simmering water. Melt both chocolates with the butter, stirring well with a spoon. Remove the bowl from the heat and allow the chocolate to cool.  Add in the vanilla extract, eggs, and sugar. Stir well with a whisk. Pour the flour and salt into the brownie batter. Mix well until the batter starts to get thick. Ensure there are no flour streaks. Fold in the chocolate chips and stir until fully combined.  Bake the brownies in the oven for about 25-30 minutes. The tops of the brownies should be smooth. Allow the brownies to cool and then slice into squares.  Serve. Place a brownie on a serving plate. Garnish with extra chocolate chips and adding a scoopful of vanilla ice cream on top. Enjoy!",
  "tyn_model":[
    "flour",
    "oven",
    "butter",
    "chocolate chips",
    "baking pan",
    "bittersweet and unsweetened chocolate",
    "water",
    "spoon",
    "bowl",
    "vanilla extract",
    "eggs",
    "sugar",
    "whisk",
    "salt",
    "brownie batter",
    "serving plate",
    "vanilla ice cream"
  ],
  "tyn_section":[

  ]
}