{
  "title":"How to Select a Food Processor",
  "url":"https://www.wikihow.com/Select-a-Food-Processor",
  "category_hierarchy":[
    "Home and Garden",
    "Home Appliances"
  ],
  "steps":[
    {
      "headline":"Look for the safety lock.",
      "description":"Play with it in the store to see if it is easy to use. Do the pieces of it appear and feel solid, or do they look as if they might break from difficulty of moving or poor quality? The safety lock feature is complicated and expensive to fix if it breaks."
    },
    {
      "headline":"Check the storage features.",
      "description":"It is really useful to have a storage space for the cord and to have \"on-board\" storage for any attachments, so that they are not lost or damaged during storage."
    },
    {
      "headline":"Make sure that the processor has the blades that you will use most frequently for your style of cooking.",
      "description":"Ask the assistant for advice if you are not sure which ones come with the food processor that interests you but generally processor blades include:\nSabatier blade - the standard \"S\" shaped blade\nShredding disc - shreds vegetables and fruits\nSlicing disc - slices fruits and vegetables\nJulienne disc - creates long thin vegetable and fruit cuts\nDough blade - the paddles are less curved than the sabatier blade\nFrench fry disc - creates chips for frying\nPurifier or juicer blades - these vary in type and purpose"
    },
    {
      "headline":"Decide what additional accessories you will use.",
      "description":"If your food processor already comes with the lot, you don't need to worry about \"added extras\" but if you're in the budget end of the market, your basic model might only come with basic blades and you will need to purchase additional more fancy versions. Ask yourself how likely you are to use additional blades before purchasing them, as they can end up being an expensive waste of money."
    },
    {
      "headline":"Prefer a more expensive model if you use a food processor frequently.",
      "description":"For your extra money, you will get a stronger and more durable motor and gears, the processor will be quieter and more stable and it will be less likely to conk out on you with frequent heavy usage. This is especially important for catering work, as well as heavy home usage. Otherwise, if you are an infrequent user of a food processor, the lower end of the range will serve you well."
    }
  ],
  "text":" Look for the safety lock. Play with it in the store to see if it is easy to use. Do the pieces of it appear and feel solid, or do they look as if they might break from difficulty of moving or poor quality? The safety lock feature is complicated and expensive to fix if it breaks. Check the storage features. It is really useful to have a storage space for the cord and to have \"on-board\" storage for any attachments, so that they are not lost or damaged during storage. Make sure that the processor has the blades that you will use most frequently for your style of cooking. Ask the assistant for advice if you are not sure which ones come with the food processor that interests you but generally processor blades include:\nSabatier blade - the standard \"S\" shaped blade\nShredding disc - shreds vegetables and fruits\nSlicing disc - slices fruits and vegetables\nJulienne disc - creates long thin vegetable and fruit cuts\nDough blade - the paddles are less curved than the sabatier blade\nFrench fry disc - creates chips for frying\nPurifier or juicer blades - these vary in type and purpose Decide what additional accessories you will use. If your food processor already comes with the lot, you don't need to worry about \"added extras\" but if you're in the budget end of the market, your basic model might only come with basic blades and you will need to purchase additional more fancy versions. Ask yourself how likely you are to use additional blades before purchasing them, as they can end up being an expensive waste of money. Prefer a more expensive model if you use a food processor frequently. For your extra money, you will get a stronger and more durable motor and gears, the processor will be quieter and more stable and it will be less likely to conk out on you with frequent heavy usage. This is especially important for catering work, as well as heavy home usage. Otherwise, if you are an infrequent user of a food processor, the lower end of the range will serve you well.",
  "tyn_model":[
    "food processor",
    "processor",
    "french fry",
    "purifier",
    "juicer"
  ],
  "tyn_section":[

  ]
}