{
  "title":"How to Isolate Entomopathogenic Nematodes",
  "url":"https://www.wikihow.com/Isolate-Entomopathogenic-Nematodes",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Pests and Weeds"
  ],
  "steps":[
    {
      "headline":"Use the hand shovel to collect a sample of soil.",
      "description":""
    },
    {
      "headline":"Fill the small plastic sealable container to about halfway with the soil sample you collected.",
      "description":""
    },
    {
      "headline":"Next, drop about 5 or 6 wax worm larvae into the plastic container and allow it to incubate at room temperature for one week.",
      "description":""
    },
    {
      "headline":"After the incubation period remove the wax worms from the soil container and place them in the small Petri disk lined with a sheet of filter paper.",
      "description":""
    },
    {
      "headline":"Moisten the filter paper with a few drops of distilled water.",
      "description":""
    },
    {
      "headline":"Half-fill the larger Petri dish with distilled water and place the smaller Petri dish into it.",
      "description":"(This should resemble a moat-like design)"
    },
    {
      "headline":"Incubate the dishes for one week.",
      "description":""
    },
    {
      "headline":"After a week the nematodes will have emerged and will be visible in the water of the larger Petri dish.",
      "description":""
    },
    {
      "headline":"Remove the small Petri dish.",
      "description":""
    },
    {
      "headline":"Pour the nematode solution from the large Petri dish into the large sealable bottle.",
      "description":""
    },
    {
      "headline":"Fill the large sealable bottle with distilled water and refrigerate for one week.",
      "description":"This allows the nematodes to reproduce."
    }
  ],
  "text":" Use the hand shovel to collect a sample of soil.  Fill the small plastic sealable container to about halfway with the soil sample you collected.  Next, drop about 5 or 6 wax worm larvae into the plastic container and allow it to incubate at room temperature for one week.  After the incubation period remove the wax worms from the soil container and place them in the small Petri disk lined with a sheet of filter paper.  Moisten the filter paper with a few drops of distilled water.  Half-fill the larger Petri dish with distilled water and place the smaller Petri dish into it. (This should resemble a moat-like design) Incubate the dishes for one week.  After a week the nematodes will have emerged and will be visible in the water of the larger Petri dish.  Remove the small Petri dish.  Pour the nematode solution from the large Petri dish into the large sealable bottle.  Fill the large sealable bottle with distilled water and refrigerate for one week. This allows the nematodes to reproduce.",
  "tyn_model":[
    "petri dish",
    "distilled water",
    "filter paper",
    "hand shovel",
    "wax worm",
    "plastic container",
    "wax worms",
    "soil container",
    "petri disk",
    "dishes",
    "water"
  ],
  "tyn_section":[

  ]
}