{
  "title":"How to Take Care of Succulent Seedlings",
  "url":"https://www.wikihow.com/Take-Care-of-Succulent-Seedlings",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Succulents and Cacti"
  ],
  "steps":[
    {
      "headline":"Keep succulent seedlings well watered.",
      "description":"Their root system is close to the soil surface during the first months of growth, meaning that they dry out very quickly."
    },
    {
      "headline":"Mist spray.",
      "description":"Do this in the evenings to replicate the environment that a succulent would be used to growing in outdoors. Mist spray is absorbed well by succulents."
    },
    {
      "headline":"Keep the ventilation a top priority.",
      "description":"If there is too much moisture and inadequate ventilation, there is a risk of fungal growth."
    },
    {
      "headline":"Move the seedlings once they are large enough to handle.",
      "description":"Transplant outdoors to fresh seedling trays or into large pots for continued growth, to encourage the setting of deeper roots. On transplanting, keep the plant in a warm place for 48 hours and withhold any watering during this time. The 48 hour break gives the rootstock a chance to recover from being moved."
    },
    {
      "headline":"Continue watering and tending.",
      "description":"As the succulent grows larger, it will need less tending and less watering. Plant in the garden bed when it is larger, if wished."
    }
  ],
  "text":" Keep succulent seedlings well watered. Their root system is close to the soil surface during the first months of growth, meaning that they dry out very quickly. Mist spray. Do this in the evenings to replicate the environment that a succulent would be used to growing in outdoors. Mist spray is absorbed well by succulents. Keep the ventilation a top priority. If there is too much moisture and inadequate ventilation, there is a risk of fungal growth. Move the seedlings once they are large enough to handle. Transplant outdoors to fresh seedling trays or into large pots for continued growth, to encourage the setting of deeper roots. On transplanting, keep the plant in a warm place for 48 hours and withhold any watering during this time. The 48 hour break gives the rootstock a chance to recover from being moved. Continue watering and tending. As the succulent grows larger, it will need less tending and less watering. Plant in the garden bed when it is larger, if wished.",
  "tyn_model":[
    "mist spray",
    "pots",
    "garden bed"
  ],
  "tyn_section":[

  ]
}