{
  "title":"How to Slice a Banana Before It Is Peeled",
  "url":"https://www.wikihow.com/Slice-a-Banana-Before-It-Is-Peeled",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Peeling Food"
  ],
  "methods":[
    {
      "name":"Using a Needle",
      "steps":[
        {
          "headline":"Stealthily secure a banana that is ready to eat.",
          "description":"You don't want one which is too green, or has too many dark spots. The idea is that your friend or family member will actually want to eat it."
        },
        {
          "headline":"Find a small needle, which is at least as long as the diameter of the banana.",
          "description":""
        },
        {
          "headline":"Locate one of the seams of the banana, and insert the needle at the starting point.",
          "description":"When bananas are peeled, we usually pull them apart along seams. This point can be at the top or bottom of the banana."
        },
        {
          "headline":"Push the needle carefully through the skin and into the banana.",
          "description":"Push it far enough to reach to the other side but don't puncture through."
        },
        {
          "headline":"Without rupturing the entry point of the hole, move the needle back and forth, creating a clean slice inside the banana.",
          "description":""
        },
        {
          "headline":"Once you are satisfied that the spot has been cut, carefully pull the needle out of the spot, move up (or down) the banana about 1/2\" / 1.2 centimeter (0.5 in), along the seam, and reinsert the needle.",
          "description":"Repeat steps 5 and 6."
        },
        {
          "headline":"Continue this process until you are finished.",
          "description":""
        },
        {
          "headline":"Present the unpeeled banana to a friend.",
          "description":"Watch their surprise as they peel it and as discover the banana is already sliced."
        }
      ]
    },
    {
      "name":"Using Thread",
      "steps":[
        {
          "headline":"Instead of using the needle to slice the banana, get some length of thread.",
          "description":""
        },
        {
          "headline":"Using the needle and thread as in sewing, enter the banana at one point, and go 1 to 2 centimeter (0.4 to 0.8 in) to one side, and exit the banana.",
          "description":""
        },
        {
          "headline":"Enter the existing exit point with your needle and thread, and continue as in step 2 until you've gone all the way around the banana.",
          "description":""
        },
        {
          "headline":"Exit the needle at your original entry hole.",
          "description":""
        },
        {
          "headline":"Pull both ends of the thread, and the thread will slice the banana very cleanly.",
          "description":""
        },
        {
          "headline":"Get creative:  Using this method you can create interesting patterns.",
          "description":"Try to make a spiral or triangle banana pieces."
        }
      ]
    }
  ],
  "text":" Using a Needle Stealthily secure a banana that is ready to eat. You don't want one which is too green, or has too many dark spots. The idea is that your friend or family member will actually want to eat it. Find a small needle, which is at least as long as the diameter of the banana.  Locate one of the seams of the banana, and insert the needle at the starting point. When bananas are peeled, we usually pull them apart along seams. This point can be at the top or bottom of the banana. Push the needle carefully through the skin and into the banana. Push it far enough to reach to the other side but don't puncture through. Without rupturing the entry point of the hole, move the needle back and forth, creating a clean slice inside the banana.  Once you are satisfied that the spot has been cut, carefully pull the needle out of the spot, move up (or down) the banana about 1/2\" / 1.2 centimeter (0.5 in), along the seam, and reinsert the needle. Repeat steps 5 and 6. Continue this process until you are finished.  Present the unpeeled banana to a friend. Watch their surprise as they peel it and as discover the banana is already sliced. Using Thread Instead of using the needle to slice the banana, get some length of thread.  Using the needle and thread as in sewing, enter the banana at one point, and go 1 to 2 centimeter (0.4 to 0.8 in) to one side, and exit the banana.  Enter the existing exit point with your needle and thread, and continue as in step 2 until you've gone all the way around the banana.  Exit the needle at your original entry hole.  Pull both ends of the thread, and the thread will slice the banana very cleanly.  Get creative:  Using this method you can create interesting patterns. Try to make a spiral or triangle banana pieces.",
  "tyn_model":[
    "banana",
    "needle",
    "thread",
    "bananas",
    "needle and thread"
  ],
  "tyn_section":[

  ]
}