{
  "title":"How to Replant a Stargazer Lily Outside",
  "url":"https://www.wikihow.com/Replant-a-Stargazer-Lily-Outside",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing"
  ],
  "methods":[
    {
      "name":"Replanting a Stargazer Lily after Winter Storage",
      "steps":[
        {
          "headline":"Replant your lily after the heavy frosts and rainfalls of winter are over.",
          "description":"If you've moved your Stargazer lily indoors to protect it over the winter months, you should think about replanting it outside once the frosts and heavy rainfall are over. This is likely to be in mid-spring. Try to prepare the ground well ahead of time by applying plenty of organic matter (such as manure) to the soil in order to improve drainage. You should start doing this over the winter, well before you replant your Stargazer lilies in the spring. If you apply fresh manure too close to planting there’s always a risk of ‘scorching’ the plant tissue, so avoid this if possible."
        },
        {
          "headline":"Make sure your bulbs were not damaged during the winter before replanting them.",
          "description":"Check your overwintered bulbs carefully for any signs of rot or damage. Plant them in a hole around 5 inches (12.7 cm) deep and at least twice the width of your bulb. Cover the bulbs with soil, water well and apply a layer of mulch to a depth of about 2 inches (5.1 cm). Stargazer lilies should be spaced about 10 inches (25.4 cm) apart."
        },
        {
          "headline":"Cut away any ‘dead heads’ while the flower blooms after being replanted.",
          "description":"As your plant flowers in the growing season, pinch away the dead flower heads to prevent seed production. This helps the plant to store energy that will keep it alive over the winter and allow it to be successfully replanted the following year. Be sure to let the foliage and flower stems die back naturally without cutting them, as this also helps the plant to preserve energy."
        },
        {
          "headline":"Remove the bulb in late fall to store it over winter again.",
          "description":"In late fall you can cut back the brown foliage and stem to about 2 inches (5.1 cm) from the bulb. Lift the bulbs without damaging them and try to keep as much of the root intact as possible. Wash the bulb off under lukewarm water. It’s also a good idea to apply a fungicidal powder (available at any garden supply store). Apply the fungicidal powder according the the instructions on the packaging."
        },
        {
          "headline":"Store the bulb in a brown bag during the winter and then repeat the replanting process in the spring.",
          "description":"Place the roots in a paper bag with some light, soil-less potting mix, ideally one with lots of perilite, as this helps the air circulate. Overwinter the bags in a cool dry place such as a shed or cellar. This method of overwintering should give your plants the best chance of getting re-established the following year."
        }
      ]
    },
    {
      "name":"Moving an Indoor Lily to an Outside Location",
      "steps":[
        {
          "headline":"Choose a sunny spot for your lily.",
          "description":"If your Stargazer lily has been an indoor plant up to this point, you can still move it outdoors and expect it to thrive. Choose a sunny spot if possible, although these lilies will tolerate a patch of garden that is in shade for part of the day."
        },
        {
          "headline":"Look for a spot that has well-drained soil.",
          "description":"Stargazers aren't too fussy about the soil type but they prefer a well-drained soil. If your garden soil retains puddles easily, you may like to incorporate some compost or organic matter such as well-rotted manure into the ground to improve the drainage. The further ahead of planting you can do this, the better."
        },
        {
          "headline":"Choose the time of year you would like to replant your lily.",
          "description":"It’s best to transplant an indoor Stargazer to the outdoors in the springtime, however you can do this at any time in the growing season from spring to late autumn."
        },
        {
          "headline":"Replant your lily.",
          "description":"Remove the plant from its container being careful not to damage the roots or bulb. Make a hole around 5 inches (12.7 cm) deep and at least twice the width of your bulb. If you’re planting more than one Stargazer lily, they should be spaced about 10 inches (25.4 cm) apart. Place the plant in the hole and cover the bulbs with soil. Water well and apply a layer of mulch (grass clippings, straw or bark chips work well)."
        },
        {
          "headline":"Help your plant to survive cold winters.",
          "description":"If you’re in a climate which experiences cold, wet winters you might want to protect your Stargazer lily over the winter months by mulching, cloche protection or moving it back indoors over the winter. If you choose to move your plant indoors for the winter, you may find Method 1 helpful when it comes time to replant your stargazer lily."
        }
      ]
    },
    {
      "name":"Replanting a Stargazer Lily in a New Location",
      "steps":[
        {
          "headline":"Prepare your planting site ahead of time.",
          "description":"If you need to move your Stargazer lily, try to do so in the late fall after the growing season ends, or in the springtime. It’s always a good idea to prepare a new planting site well ahead of time, so dig plenty of organic matter into the ground a few months in advance if you can do so. Well-rotted manure or spent mushroom compost works well."
        },
        {
          "headline":"Dig up your lilies from their current location.",
          "description":"Dig up the plants from their old location carefully. This means using a garden spade to cut the soil a good distance from the plant so as not to damage the plant and bulb. You may find older plants have divided themselves and are now clumps of bulbs rather than singles. If that’s the case, separate groups of bulbs and replant them individually in the new location."
        },
        {
          "headline":"Replant your lily.",
          "description":"In the new location, make a hole around 5 inches (12.7 cm) deep and at least twice the width of your bulb. Cover the bulbs with soil, water well and apply a layer of mulch to a depth of about 2 inches (5.1 cm). Stargazer lilies should be spaced about 10 inches (25.4 cm) apart. They’ll appreciate being watered when the soil is dry, at least until they are well-established. Stargazer lilies will thrive if fed regularly during their lifetime."
        },
        {
          "headline":"Be aware that your lily may ‘protest’ the location change.",
          "description":"Sometimes a lily will protest against a move by not flowering that year. Don't worry too much though - it should flower again the following year."
        }
      ]
    }
  ],
  "text":" Replanting a Stargazer Lily after Winter Storage Replant your lily after the heavy frosts and rainfalls of winter are over. If you've moved your Stargazer lily indoors to protect it over the winter months, you should think about replanting it outside once the frosts and heavy rainfall are over. This is likely to be in mid-spring. Try to prepare the ground well ahead of time by applying plenty of organic matter (such as manure) to the soil in order to improve drainage. You should start doing this over the winter, well before you replant your Stargazer lilies in the spring. If you apply fresh manure too close to planting there’s always a risk of ‘scorching’ the plant tissue, so avoid this if possible. Make sure your bulbs were not damaged during the winter before replanting them. Check your overwintered bulbs carefully for any signs of rot or damage. Plant them in a hole around 5 inches (12.7 cm) deep and at least twice the width of your bulb. Cover the bulbs with soil, water well and apply a layer of mulch to a depth of about 2 inches (5.1 cm). Stargazer lilies should be spaced about 10 inches (25.4 cm) apart. Cut away any ‘dead heads’ while the flower blooms after being replanted. As your plant flowers in the growing season, pinch away the dead flower heads to prevent seed production. This helps the plant to store energy that will keep it alive over the winter and allow it to be successfully replanted the following year. Be sure to let the foliage and flower stems die back naturally without cutting them, as this also helps the plant to preserve energy. Remove the bulb in late fall to store it over winter again. In late fall you can cut back the brown foliage and stem to about 2 inches (5.1 cm) from the bulb. Lift the bulbs without damaging them and try to keep as much of the root intact as possible. Wash the bulb off under lukewarm water. It’s also a good idea to apply a fungicidal powder (available at any garden supply store). Apply the fungicidal powder according the the instructions on the packaging. Store the bulb in a brown bag during the winter and then repeat the replanting process in the spring. Place the roots in a paper bag with some light, soil-less potting mix, ideally one with lots of perilite, as this helps the air circulate. Overwinter the bags in a cool dry place such as a shed or cellar. This method of overwintering should give your plants the best chance of getting re-established the following year. Moving an Indoor Lily to an Outside Location Choose a sunny spot for your lily. If your Stargazer lily has been an indoor plant up to this point, you can still move it outdoors and expect it to thrive. Choose a sunny spot if possible, although these lilies will tolerate a patch of garden that is in shade for part of the day. Look for a spot that has well-drained soil. Stargazers aren't too fussy about the soil type but they prefer a well-drained soil. If your garden soil retains puddles easily, you may like to incorporate some compost or organic matter such as well-rotted manure into the ground to improve the drainage. The further ahead of planting you can do this, the better. Choose the time of year you would like to replant your lily. It’s best to transplant an indoor Stargazer to the outdoors in the springtime, however you can do this at any time in the growing season from spring to late autumn. Replant your lily. Remove the plant from its container being careful not to damage the roots or bulb. Make a hole around 5 inches (12.7 cm) deep and at least twice the width of your bulb. If you’re planting more than one Stargazer lily, they should be spaced about 10 inches (25.4 cm) apart. Place the plant in the hole and cover the bulbs with soil. Water well and apply a layer of mulch (grass clippings, straw or bark chips work well). Help your plant to survive cold winters. If you’re in a climate which experiences cold, wet winters you might want to protect your Stargazer lily over the winter months by mulching, cloche protection or moving it back indoors over the winter. If you choose to move your plant indoors for the winter, you may find Method 1 helpful when it comes time to replant your stargazer lily. Replanting a Stargazer Lily in a New Location Prepare your planting site ahead of time. If you need to move your Stargazer lily, try to do so in the late fall after the growing season ends, or in the springtime. It’s always a good idea to prepare a new planting site well ahead of time, so dig plenty of organic matter into the ground a few months in advance if you can do so. Well-rotted manure or spent mushroom compost works well. Dig up your lilies from their current location. Dig up the plants from their old location carefully. This means using a garden spade to cut the soil a good distance from the plant so as not to damage the plant and bulb. You may find older plants have divided themselves and are now clumps of bulbs rather than singles. If that’s the case, separate groups of bulbs and replant them individually in the new location. Replant your lily. In the new location, make a hole around 5 inches (12.7 cm) deep and at least twice the width of your bulb. Cover the bulbs with soil, water well and apply a layer of mulch to a depth of about 2 inches (5.1 cm). Stargazer lilies should be spaced about 10 inches (25.4 cm) apart. They’ll appreciate being watered when the soil is dry, at least until they are well-established. Stargazer lilies will thrive if fed regularly during their lifetime. Be aware that your lily may ‘protest’ the location change. Sometimes a lily will protest against a move by not flowering that year. Don't worry too much though - it should flower again the following year.",
  "tyn_model":[
    "stargazer lily",
    "stargazer lilies",
    "water",
    "manure",
    "soil",
    "mulch",
    "lily",
    "’ the",
    "fungicidal powder",
    "compost",
    "organic matter",
    "‘scorching",
    "‘dead",
    "’ while",
    "potting mix",
    "stargazer",
    "lilies",
    "garden spade",
    "‘protest"
  ],
  "tyn_section":[

  ]
}