{
  "title":"How to Make Nasi Goring Dish",
  "url":"https://www.wikihow.com/Make-Nasi-Goring-Dish",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine"
  ],
  "steps":[
    {
      "headline":"Allow the cooked rice to cool by spreading it flatly on a baking tray.",
      "description":"Use a fork to separate the grains of rice."
    },
    {
      "headline":"Make three flat ham omelets in a frying pan.",
      "description":"When they are cool, roll up each omelet and cut it into strips. Set the strips aside."
    },
    {
      "headline":"Blanche the prawns until they are fully cooked.",
      "description":"Peel and slice them."
    },
    {
      "headline":"Blanche the chicken breast and then slice lengthwise.",
      "description":""
    },
    {
      "headline":"Grind the terasi or bagoong together with the garlic and onion in a blender.",
      "description":"Also add a little bit of oil. Blend the mixture until a fine paste is formed."
    },
    {
      "headline":"Cut the beef into thin strips.",
      "description":""
    },
    {
      "headline":"Heat the oil in a wok.",
      "description":""
    },
    {
      "headline":"Fry the terasi or bagoong paste (on low heat) without browning them.",
      "description":""
    },
    {
      "headline":"Add the beef strips.",
      "description":"Stir them in well to evenly coat the beef with the paste and at the same time cook the beef."
    },
    {
      "headline":"Add the chicken and prawns.",
      "description":"Stir and cook for about two minutes."
    },
    {
      "headline":"Mix in the cooked rice, soy sauce, ketchup and white pepper.",
      "description":"Mix well. Add some salt for taste."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Allow the cooked rice to cool by spreading it flatly on a baking tray. Use a fork to separate the grains of rice. Make three flat ham omelets in a frying pan. When they are cool, roll up each omelet and cut it into strips. Set the strips aside. Blanche the prawns until they are fully cooked. Peel and slice them. Blanche the chicken breast and then slice lengthwise.  Grind the terasi or bagoong together with the garlic and onion in a blender. Also add a little bit of oil. Blend the mixture until a fine paste is formed. Cut the beef into thin strips.  Heat the oil in a wok.  Fry the terasi or bagoong paste (on low heat) without browning them.  Add the beef strips. Stir them in well to evenly coat the beef with the paste and at the same time cook the beef. Add the chicken and prawns. Stir and cook for about two minutes. Mix in the cooked rice, soy sauce, ketchup and white pepper. Mix well. Add some salt for taste. Finished. ",
  "tyn_model":[
    "beef",
    "rice",
    "oil",
    "baking tray",
    "fork",
    "frying pan",
    "chicken breast",
    "garlic",
    "onion",
    "blender",
    "wok",
    "terasi or bagoong paste",
    "chicken",
    "cooked rice",
    "soy sauce",
    "ketchup",
    "white pepper",
    "salt"
  ],
  "tyn_section":[

  ]
}