{
  "title":"How to Make a Simple Cheese Sauce",
  "url":"https://www.wikihow.com/Make-a-Simple-Cheese-Sauce",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Cheese"
  ],
  "methods":[
    {
      "name":"Simple Sauce",
      "steps":[
        {
          "headline":"Gather your ingredients.",
          "description":"The quality of your ingredients can affect the quality of your cheese sauce. Start with a sharp cheddar cheese, shredded or in a block. If the cheese comes in a block, use a grater to make 2 cups of shredded cheese. You can substitute cheddar cheese with other cheeses such as Gouda, or Swiss cheese. To spice up the basic sauce, add salsa, hot sauce, beer, or wine for a little extra flavor."
        },
        {
          "headline":"Melt 4 tablespoons of butter.",
          "description":"In a saucepan over medium heat, slowly heat the butter for your cheese sauce. Keep an eye on the butter as it melts. You don’t want the butter to brown or turn a dark, burnt color, as this will change the flavor of your sauce."
        },
        {
          "headline":"Whisk in 4 tablespoons of flour.",
          "description":"Slowly add the flour to the butter, blending evenly with a whisk. Then, add flour and mix until flour is completely blended with butter. Allow the mixture to cook for several minutes, until it just begins to change color slightly. Be careful not to burn the mixture, as it will make your cheese sauce taste burnt."
        },
        {
          "headline":"Add 3 cups of milk.",
          "description":"Slowly pour in the milk, stirring constantly until the mixture gets thick. Try to avoid lumps in the mixture. Pouring the milk slowly and stirring constantly will help you avoid lumps."
        },
        {
          "headline":"Add 1 teaspoon spices.",
          "description":"Add 1 teaspoon salt, pepper, cayenne pepper, or other spices such as dried rosemary or thyme. Get creative and amp up the flavor of your cheese sauce. Start with 1 teaspoon of your chosen spice. You can adjust the sauce to taste once you add in the cheese. Use caution when adding salt. Too much salt is difficult to remove, and many cheeses have a high salt content already. The sauce may also have salt in it already if you used salted butter."
        },
        {
          "headline":"Remove the sauce from the heat.",
          "description":"Removing the sauce from the heat before you add the shredded cheese will prevent the sauce from separating or curdling."
        },
        {
          "headline":"Stir in the shredded cheese.",
          "description":"Add the shredded cheese one handful at a time. Stir the sauce with a spoon and allow the cheese to melt each time before adding more cheese."
        },
        {
          "headline":"Serve immediately.",
          "description":"The cheese sauce may harden as it cools, so serve it right away, drizzled over chips, on a baked potato, or over steamed vegetables."
        },
        {
          "headline":"Store any leftover sauce in an airtight container in the refrigerator.",
          "description":"It should keep for up to three days. Don’t reheat leftover sauce over high heat, or reboil it. This will cause it to become stringy or separate. Reheat any leftover sauce on low heat, stirring it constantly until it is ready to serve."
        }
      ]
    },
    {
      "name":"Fancy Sauce",
      "steps":[
        {
          "headline":"Gather your ingredients.",
          "description":"This recipe calls for sodium citrate, which is a type of salt that works as an emulsifier. This means that when it is added to cheese sauce, it reduces the cheese’s acidity, makes the proteins in the cheese more soluble, and prevents it from separating. Instead, it helps to create a smooth, creamy texture to your cheese sauce. Look in speciality food stores and online for sodium citrate. It looks like salt and tastes salty and slightly sour. You will only need a very small amount of sodium citrate in the sauce for it to do it’s job, so it is not upping the sodium level of your cheese sauce. If you can't find sodium citrate, you can use 2 teaspoons of citric acid (or sour salt) and 2.5 teaspoons of baking sodium as a substitute. Citric acid, or sour salt, can be found in the kosher section of most grocery stores. You should also use high-quality cheese for your fancy cheese sauce, such as Pepper Jack, Gouda, or Gruyère. These cheeses will likely come in blocks. Use a grater to make 1 cup of your chosen fancy cheese."
        },
        {
          "headline":"Mix ½ teaspoon sodium citrate with ½ cup liquid.",
          "description":"In a medium saucepan, mix together the sodium citrate and the water, beer, or wine. There should be enough liquid mixture to just cover the bottom of your saucepan; the entire ½ cup may not be necessary so pour the liquid in a little bit at a time."
        },
        {
          "headline":"Heat the liquid mixture.",
          "description":"Place the medium saucepan on a medium heat and bring the liquid to a low simmer, but not a full boil. There should be small bubbles forming on the surface of the liquid."
        },
        {
          "headline":"Add the grated cheese to the pan.",
          "description":"Add the cheese to the pan and stir with a spoon until the cheese has melted and is blended with the liquid. Thanks to the sodium citrate, the sauce should have a smooth, creamy consistency."
        },
        {
          "headline":"Serve the sauce.",
          "description":"Put your sauce in a bowl and dip chips or vegetables into it, or pour it over chips to make nachos. You can even pour it on top of steamed vegetables to make them more delicious. The sauce should maintain its creamy texture, even as it begins to cool. This sauce can be stored for up to a week in the refrigerator."
        }
      ]
    },
    {
      "name":"Vegan Substitute",
      "steps":[
        {
          "headline":"Gather your ingredients.",
          "description":"Sometimes people who are vegan or lactose intolerant may crave cheese sauce. While nothing really replicates the cheesy goodness of the perfect cheese sauce, a vegan cheese-style sauce may help you kick the craving. The key to making good vegan cheese sauce is using starchy vegetables like zucchini and potatoes to give the sauce a creamy texture and keep it from separating. You will need access to a high powered blender, food processor, or Vitamix to create a creamy texture for this sauce. Nutritional yeast can be found in health food stores in the form of flakes or powder. It has a strong, savory flavor that is nutty and tangy. The deactivated yeast is a popular vegan substitute for cheese in recipes. If you are allergic to soy sauce, you can substitute it for vegan worcestershire sauce, sold at most health food and speciality food stores. It will give the sauce a similar flavor, but you will need to add more salt to make up for the saltiness that soy sauce provides."
        },
        {
          "headline":"Prepare the zucchini.",
          "description":"Preheat your oven to 415 °F (213 °C) and line a sheet pan with parchment paper. Peel all the green skin off the zucchini with a vegetable peeler. Then, slice it into ¼ inch slices and place the slices on the sheet pan. Season the slices with a dash of salt and pepper. Bake the zucchini for 15 minutes until they appear tender and soft to the touch. Peeling the zucchini will prevent the sauce from coming out a strange green-yellow color."
        },
        {
          "headline":"Cook 5 small potatoes by roasting them or steaming them.",
          "description":"Peel the potatoes and cut them into quarters. Place the potatoes on another sheet pan and into the oven with the zucchini for about 10 minutes, until they appear soft. You can also cook the potatoes fast in the microwave for about 5 minutes, covered, until they are very soft to the touch. Do not boil the potatoes, as they will get water-logged and make your cheese sauce runny."
        },
        {
          "headline":"Mash up the cooked potatoes with a fork.",
          "description":"Then, use a dry measuring cup to measure out 1 cup of mashed potatoes. It’s important to measure the mashed potatoes for accurate results and a solid vegan cheese sauce. Add the 1 cup of mashed potatoes to your high speed blender, food processor, or Vitamix."
        },
        {
          "headline":"Add the cooked zucchini to the the blender.",
          "description":"Then, add ¼ cup nutritional yeast, ½ teaspoon garlic powder, ½ teaspoon onion powder, ½ teaspoon fine sea salt, ¾ teaspoon smoked or regular paprika, 2 teaspoons low-sodium soy sauce or vegan worcestershire sauce, and 1 tablespoon (14.8 ml) fresh lemon juice to the blender. Pour in ¾ cup of water and add more if needed, stopping at 1 cup."
        },
        {
          "headline":"Blend the ingredients together until smooth.",
          "description":"You may need to stop and scrape the bottom and sides of the blender to make sure all the ingredients are combined. Do not add more than 1 cup of water until you’ve blended the sauce for several minutes on high. The sauce will seem very thick at first, but it will start to turn very smooth from all the water in the zucchini. Keep blending until the sauce gets thick and creamy. If the sauce still seems too thick after several minutes of blending, add a very small amount of water to just blend it. If the sauce seems a bit too thin, you can add 1–2 tablespoons (14.8–29.6 ml) of mashed potatoes to thicken it up."
        },
        {
          "headline":"Taste and season the sauce.",
          "description":"You may want to add extra lemon juice, salt or other spices to bring out a stronger flavor in the sauce. If you are using the worcestershire sauce to substitute for soy sauce, you will likely need to add more salt."
        },
        {
          "headline":"Add any extra toppings.",
          "description":"Sprinkle a dash of red pepper flakes, a few sliced jalapenos or a ¼ cup of chopped tomatoes to add freshness and tanginess to the sauce. This recipe makes 2 ½ cups of sauce. Drizzle the sauce over macaroni, a baked potato, or roasted vegetables for a delicious vegan meal."
        }
      ]
    }
  ],
  "text":" Simple Sauce Gather your ingredients. The quality of your ingredients can affect the quality of your cheese sauce. Start with a sharp cheddar cheese, shredded or in a block. If the cheese comes in a block, use a grater to make 2 cups of shredded cheese. You can substitute cheddar cheese with other cheeses such as Gouda, or Swiss cheese. To spice up the basic sauce, add salsa, hot sauce, beer, or wine for a little extra flavor. Melt 4 tablespoons of butter. In a saucepan over medium heat, slowly heat the butter for your cheese sauce. Keep an eye on the butter as it melts. You don’t want the butter to brown or turn a dark, burnt color, as this will change the flavor of your sauce. Whisk in 4 tablespoons of flour. Slowly add the flour to the butter, blending evenly with a whisk. Then, add flour and mix until flour is completely blended with butter. Allow the mixture to cook for several minutes, until it just begins to change color slightly. Be careful not to burn the mixture, as it will make your cheese sauce taste burnt. Add 3 cups of milk. Slowly pour in the milk, stirring constantly until the mixture gets thick. Try to avoid lumps in the mixture. Pouring the milk slowly and stirring constantly will help you avoid lumps. Add 1 teaspoon spices. Add 1 teaspoon salt, pepper, cayenne pepper, or other spices such as dried rosemary or thyme. Get creative and amp up the flavor of your cheese sauce. Start with 1 teaspoon of your chosen spice. You can adjust the sauce to taste once you add in the cheese. Use caution when adding salt. Too much salt is difficult to remove, and many cheeses have a high salt content already. The sauce may also have salt in it already if you used salted butter. Remove the sauce from the heat. Removing the sauce from the heat before you add the shredded cheese will prevent the sauce from separating or curdling. Stir in the shredded cheese. Add the shredded cheese one handful at a time. Stir the sauce with a spoon and allow the cheese to melt each time before adding more cheese. Serve immediately. The cheese sauce may harden as it cools, so serve it right away, drizzled over chips, on a baked potato, or over steamed vegetables. Store any leftover sauce in an airtight container in the refrigerator. It should keep for up to three days. Don’t reheat leftover sauce over high heat, or reboil it. This will cause it to become stringy or separate. Reheat any leftover sauce on low heat, stirring it constantly until it is ready to serve. Fancy Sauce Gather your ingredients. This recipe calls for sodium citrate, which is a type of salt that works as an emulsifier. This means that when it is added to cheese sauce, it reduces the cheese’s acidity, makes the proteins in the cheese more soluble, and prevents it from separating. Instead, it helps to create a smooth, creamy texture to your cheese sauce. Look in speciality food stores and online for sodium citrate. It looks like salt and tastes salty and slightly sour. You will only need a very small amount of sodium citrate in the sauce for it to do it’s job, so it is not upping the sodium level of your cheese sauce. If you can't find sodium citrate, you can use 2 teaspoons of citric acid (or sour salt) and 2.5 teaspoons of baking sodium as a substitute. Citric acid, or sour salt, can be found in the kosher section of most grocery stores. You should also use high-quality cheese for your fancy cheese sauce, such as Pepper Jack, Gouda, or Gruyère. These cheeses will likely come in blocks. Use a grater to make 1 cup of your chosen fancy cheese. Mix ½ teaspoon sodium citrate with ½ cup liquid. In a medium saucepan, mix together the sodium citrate and the water, beer, or wine. There should be enough liquid mixture to just cover the bottom of your saucepan; the entire ½ cup may not be necessary so pour the liquid in a little bit at a time. Heat the liquid mixture. Place the medium saucepan on a medium heat and bring the liquid to a low simmer, but not a full boil. There should be small bubbles forming on the surface of the liquid. Add the grated cheese to the pan. Add the cheese to the pan and stir with a spoon until the cheese has melted and is blended with the liquid. Thanks to the sodium citrate, the sauce should have a smooth, creamy consistency. Serve the sauce. Put your sauce in a bowl and dip chips or vegetables into it, or pour it over chips to make nachos. You can even pour it on top of steamed vegetables to make them more delicious. The sauce should maintain its creamy texture, even as it begins to cool. This sauce can be stored for up to a week in the refrigerator. Vegan Substitute Gather your ingredients. Sometimes people who are vegan or lactose intolerant may crave cheese sauce. While nothing really replicates the cheesy goodness of the perfect cheese sauce, a vegan cheese-style sauce may help you kick the craving. The key to making good vegan cheese sauce is using starchy vegetables like zucchini and potatoes to give the sauce a creamy texture and keep it from separating. You will need access to a high powered blender, food processor, or Vitamix to create a creamy texture for this sauce. Nutritional yeast can be found in health food stores in the form of flakes or powder. It has a strong, savory flavor that is nutty and tangy. The deactivated yeast is a popular vegan substitute for cheese in recipes. If you are allergic to soy sauce, you can substitute it for vegan worcestershire sauce, sold at most health food and speciality food stores. It will give the sauce a similar flavor, but you will need to add more salt to make up for the saltiness that soy sauce provides. Prepare the zucchini. Preheat your oven to 415 °F (213 °C) and line a sheet pan with parchment paper. Peel all the green skin off the zucchini with a vegetable peeler. Then, slice it into ¼ inch slices and place the slices on the sheet pan. Season the slices with a dash of salt and pepper. Bake the zucchini for 15 minutes until they appear tender and soft to the touch. Peeling the zucchini will prevent the sauce from coming out a strange green-yellow color. Cook 5 small potatoes by roasting them or steaming them. Peel the potatoes and cut them into quarters. Place the potatoes on another sheet pan and into the oven with the zucchini for about 10 minutes, until they appear soft. You can also cook the potatoes fast in the microwave for about 5 minutes, covered, until they are very soft to the touch. Do not boil the potatoes, as they will get water-logged and make your cheese sauce runny. Mash up the cooked potatoes with a fork. Then, use a dry measuring cup to measure out 1 cup of mashed potatoes. It’s important to measure the mashed potatoes for accurate results and a solid vegan cheese sauce. Add the 1 cup of mashed potatoes to your high speed blender, food processor, or Vitamix. Add the cooked zucchini to the the blender. Then, add ¼ cup nutritional yeast, ½ teaspoon garlic powder, ½ teaspoon onion powder, ½ teaspoon fine sea salt, ¾ teaspoon smoked or regular paprika, 2 teaspoons low-sodium soy sauce or vegan worcestershire sauce, and 1 tablespoon (14.8 ml) fresh lemon juice to the blender. Pour in ¾ cup of water and add more if needed, stopping at 1 cup. Blend the ingredients together until smooth. You may need to stop and scrape the bottom and sides of the blender to make sure all the ingredients are combined. Do not add more than 1 cup of water until you’ve blended the sauce for several minutes on high. The sauce will seem very thick at first, but it will start to turn very smooth from all the water in the zucchini. Keep blending until the sauce gets thick and creamy. If the sauce still seems too thick after several minutes of blending, add a very small amount of water to just blend it. If the sauce seems a bit too thin, you can add 1–2 tablespoons (14.8–29.6 ml) of mashed potatoes to thicken it up. Taste and season the sauce. You may want to add extra lemon juice, salt or other spices to bring out a stronger flavor in the sauce. If you are using the worcestershire sauce to substitute for soy sauce, you will likely need to add more salt. Add any extra toppings. Sprinkle a dash of red pepper flakes, a few sliced jalapenos or a ¼ cup of chopped tomatoes to add freshness and tanginess to the sauce. This recipe makes 2 ½ cups of sauce. Drizzle the sauce over macaroni, a baked potato, or roasted vegetables for a delicious vegan meal.",
  "tyn_model":[
    "cheese sauce",
    "potatoes",
    "salt",
    "zucchini",
    "butter",
    "sodium citrate",
    "water",
    "flour",
    "blender",
    "saucepan",
    "milk",
    "soy sauce",
    "worcestershire sauce",
    "grater",
    "wine",
    "spoon",
    "baked potato",
    "citric acid",
    "sour salt",
    "cheese",
    "vegetables",
    "food processor",
    "nutritional yeast",
    "oven",
    "cheddar cheese",
    "swiss cheese",
    "salsa",
    "hot sauce",
    "whisk",
    "spices",
    "salt, pepper",
    "cayenne pepper",
    "salted butter",
    "airtight container",
    "refrigerator",
    "baking sodium",
    "pepper jack",
    "gruyère",
    "medium saucepan",
    "pan",
    "bowl",
    "deactivated yeast",
    "parchment paper",
    "vegetable peeler",
    "sheet pan",
    "salt and pepper",
    "microwave",
    "fork",
    "high speed blender",
    "vitamix.",
    "garlic powder",
    "onion powder",
    "fine sea salt",
    "smoked or regular paprika",
    "low-sodium soy sauce",
    "lemon juice",
    "mashed potatoes",
    "lemon",
    "red pepper",
    "jalapenos",
    "tomatoes",
    "macaroni"
  ],
  "tyn_section":[

  ]
}