{
  "title":"How to Identify Genuine Leather",
  "url":"https://www.wikihow.com/Identify-Genuine-Leather",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Leatherworking"
  ],
  "methods":[
    {
      "name":"Distinguishing Real Leather From Fake",
      "steps":[
        {
          "headline":"Be wary of any product that doesn't specifically claim to be real leather.",
          "description":"If it is labeled as ‘manmade material,’ it is definitely synthetic leather. But if it doesn't say anything at all, chances are good the manufacturer wants to conceal the fact that it isn't real leather. Of course, used goods may have lost their tags. But most manufacturers are proud of the fact that they use real leather, and will note it as following:\nReal leather\nGenuine leather\nTop/Full grain leather\nMade with animal products"
        },
        {
          "headline":"Check the surface grain, the little \"pebbles\" and pores, for imperfections and uniqueness that signal genuine leather.",
          "description":"Imperfections, in leather, are actually a good thing. Remember, real leather is made from animal skin, and thus each piece is as random and unique as the animal it came from. Very regular, even, and similar grains often indicate a machine-made piece. Real leather might have scratches, creases, and wrinkles -- this is a good thing! Note that, as manufacturers get more skilled, their designs are better mimicking real leather. This makes buying online, where you only have a picture, very difficult to do."
        },
        {
          "headline":"Press into the leather, looking for creases and wrinkles.",
          "description":"Real leather will wrinkle under the tough, just like real skin. Synthetic materials usually just depress down under your finger, retaining rigidity and shape."
        },
        {
          "headline":"Smell the leather, searching for a natural, musty smell instead of plastic-like or chemical-y.",
          "description":"If you're completely unsure of the smell you're looking for, head into a store that you know sells genuine leather and test out a few bags and shoes. Ask if they have any synthetic pieces and smell those as well. Once you know what you're looking for, the smell differences will be unmistakable. Remember, leather is just worked animal skin. Faux leather is made of plastic. It seems obvious, but real leather will smell like skin and fake will smell like plastic."
        },
        {
          "headline":"Use the fire test, recognizing that it will likely ruin part of the good.",
          "description":"While there are few circumstances where burning a good is preferable to leaving it alone, this experiment works if you have a small, hard-to-see area that you can test, like the underside of a couch. Hold a flame up to the area for 5-10 seconds to test it out:\nReal leather will only char slightly, and smell a bit like burnt hair. Faux leather will actually catch flame, and smells like burning plastic."
        },
        {
          "headline":"Note the edges, as real leather has rough edges where faux has even, perfect edges.",
          "description":"Machine made leather looks machine cut. Real leather is made of many strands, which naturally fray around the edges. Faux leather made from plastic has no such strands, meaning the edges are cleanly cut."
        },
        {
          "headline":"Bend the leather, looking for it to change color slightly in real leather.",
          "description":"Similar to the \"wrinkle test,\" real leather has a unique elasticity when bent, changing color and wrinkling up naturally. Faux leather is much more rigid and regular, and will usually be difficult to bend by comparison."
        },
        {
          "headline":"Drop a small amount of water on the good, as real leather absorbs moisture.",
          "description":"If the good is fake, the water will simply puddle up on top. But real leather will absorb a small drop of water in only a few seconds , telling you quickly if it is genuine."
        },
        {
          "headline":"Know that real leather goods are rarely ever cheap.",
          "description":"A product completely made of real leather will be quite expensive. They usually sell at fixed prices. Shop around and get a feel for the price of real leather, semi leather, and synthetic leather products to understand the differences between them. Among leathers, cow leather price is the highest due to its durability and easy tanning property. Split leather, which is an under layer split from the surface layer, is less expensive than top grain or belting leather. If a deal seems too good to be true, it likely is. Real leather is expensive. While all real leather goods are much more expensive than fake, there are actually different types of real leather as well, all with widely different pricing."
        },
        {
          "headline":"Ignore color, as even colored leathers can be genuine.",
          "description":"A bright blue piece of leather furniture may not look natural, but this doesn't mean it isn't made of real leather. Colors and dyes can be added to both synthetics and natural leathers, so ignore color and stick to feel, smell, and texture when searching for real or faux leather."
        }
      ]
    },
    {
      "name":"Knowing the Different Types of Real Leather",
      "steps":[
        {
          "headline":"Understand that \"Genuine Leather\" is only one kind of real, legitimate leather on the market.",
          "description":"Most people are more concerned about differentiating real leather from faux, or fake leather. But serious connoisseurs know that there are actually multiple grades of real leather, of which \"Genuine Leather\" is actually the second lowest grade. From most luxurious to least, the other types of real leather are:\nFull Grain Leather\nTop Grain Leather\nGenuine Leather\nBonded Leather"
        },
        {
          "headline":"Purchase \"full grain\" leather for only for the most high-end products.",
          "description":"Full grain leather only uses the very highest (closest to the air) layer of skin, which is the toughest, most durable, and most beloved. It is left unfinished, meaning it has completely unique characteristics, creases, and coloring. Because of the smaller amount of leather on the surface of each animal and the difficulty of working with full grain toughness, the price is understandably high. Be aware that some manufacturers will report something is \"made with full grain leather\" even if only parts of the chair or sofa are full grain. This is another reason why buying without seeing the good is rarely recommended."
        },
        {
          "headline":"Search for \"top grain leather\" to get high-quality goods at a much more reasonable price.",
          "description":"The most common \"luxury\" leather is top grain, which takes the layer of skin just below full grain and works it lightly to remove imperfections. It is smoother and more consistent than full grain, but easier to work as well, keeping the price down. While not as durable as full grain, it is still a strong, well-crafted leather."
        },
        {
          "headline":"Know that \"genuine leather\" usually has a suede side or feeling to it.",
          "description":"Genuine leather is made by stripping off the harder, more expensive grains from the top, then using the softer, easier to work leather underneath. It is not as durable as full or top grain, but it is much cheaper since it can be manufactured into a variety of goods with ease. Remember -- genuine leather is a specific grade, not the phrase for real leather. If you request genuine leather in a leather shop, they will have a specific type of product in mind."
        },
        {
          "headline":"Stay away from \"bonded leather,\" which is made from ground up and glued leather shavings.",
          "description":"While bonded leather is still leather, it isn't an unbroken or regular piece of animal skin. Instead, the shavings from all the other leather grades are collected, ground up, and mixed with an adhesive liquid to make a piece of leather. Though cheap, the quality is severely lacking. Because the quality is less impressive, bonded leather is often used for book covers and other smaller, less worn items."
        }
      ]
    }
  ],
  "text":" Distinguishing Real Leather From Fake Be wary of any product that doesn't specifically claim to be real leather. If it is labeled as ‘manmade material,’ it is definitely synthetic leather. But if it doesn't say anything at all, chances are good the manufacturer wants to conceal the fact that it isn't real leather. Of course, used goods may have lost their tags. But most manufacturers are proud of the fact that they use real leather, and will note it as following:\nReal leather\nGenuine leather\nTop/Full grain leather\nMade with animal products Check the surface grain, the little \"pebbles\" and pores, for imperfections and uniqueness that signal genuine leather. Imperfections, in leather, are actually a good thing. Remember, real leather is made from animal skin, and thus each piece is as random and unique as the animal it came from. Very regular, even, and similar grains often indicate a machine-made piece. Real leather might have scratches, creases, and wrinkles -- this is a good thing! Note that, as manufacturers get more skilled, their designs are better mimicking real leather. This makes buying online, where you only have a picture, very difficult to do. Press into the leather, looking for creases and wrinkles. Real leather will wrinkle under the tough, just like real skin. Synthetic materials usually just depress down under your finger, retaining rigidity and shape. Smell the leather, searching for a natural, musty smell instead of plastic-like or chemical-y. If you're completely unsure of the smell you're looking for, head into a store that you know sells genuine leather and test out a few bags and shoes. Ask if they have any synthetic pieces and smell those as well. Once you know what you're looking for, the smell differences will be unmistakable. Remember, leather is just worked animal skin. Faux leather is made of plastic. It seems obvious, but real leather will smell like skin and fake will smell like plastic. Use the fire test, recognizing that it will likely ruin part of the good. While there are few circumstances where burning a good is preferable to leaving it alone, this experiment works if you have a small, hard-to-see area that you can test, like the underside of a couch. Hold a flame up to the area for 5-10 seconds to test it out:\nReal leather will only char slightly, and smell a bit like burnt hair. Faux leather will actually catch flame, and smells like burning plastic. Note the edges, as real leather has rough edges where faux has even, perfect edges. Machine made leather looks machine cut. Real leather is made of many strands, which naturally fray around the edges. Faux leather made from plastic has no such strands, meaning the edges are cleanly cut. Bend the leather, looking for it to change color slightly in real leather. Similar to the \"wrinkle test,\" real leather has a unique elasticity when bent, changing color and wrinkling up naturally. Faux leather is much more rigid and regular, and will usually be difficult to bend by comparison. Drop a small amount of water on the good, as real leather absorbs moisture. If the good is fake, the water will simply puddle up on top. But real leather will absorb a small drop of water in only a few seconds , telling you quickly if it is genuine. Know that real leather goods are rarely ever cheap. A product completely made of real leather will be quite expensive. They usually sell at fixed prices. Shop around and get a feel for the price of real leather, semi leather, and synthetic leather products to understand the differences between them. Among leathers, cow leather price is the highest due to its durability and easy tanning property. Split leather, which is an under layer split from the surface layer, is less expensive than top grain or belting leather. If a deal seems too good to be true, it likely is. Real leather is expensive. While all real leather goods are much more expensive than fake, there are actually different types of real leather as well, all with widely different pricing. Ignore color, as even colored leathers can be genuine. A bright blue piece of leather furniture may not look natural, but this doesn't mean it isn't made of real leather. Colors and dyes can be added to both synthetics and natural leathers, so ignore color and stick to feel, smell, and texture when searching for real or faux leather. Knowing the Different Types of Real Leather Understand that \"Genuine Leather\" is only one kind of real, legitimate leather on the market. Most people are more concerned about differentiating real leather from faux, or fake leather. But serious connoisseurs know that there are actually multiple grades of real leather, of which \"Genuine Leather\" is actually the second lowest grade. From most luxurious to least, the other types of real leather are:\nFull Grain Leather\nTop Grain Leather\nGenuine Leather\nBonded Leather Purchase \"full grain\" leather for only for the most high-end products. Full grain leather only uses the very highest (closest to the air) layer of skin, which is the toughest, most durable, and most beloved. It is left unfinished, meaning it has completely unique characteristics, creases, and coloring. Because of the smaller amount of leather on the surface of each animal and the difficulty of working with full grain toughness, the price is understandably high. Be aware that some manufacturers will report something is \"made with full grain leather\" even if only parts of the chair or sofa are full grain. This is another reason why buying without seeing the good is rarely recommended. Search for \"top grain leather\" to get high-quality goods at a much more reasonable price. The most common \"luxury\" leather is top grain, which takes the layer of skin just below full grain and works it lightly to remove imperfections. It is smoother and more consistent than full grain, but easier to work as well, keeping the price down. While not as durable as full grain, it is still a strong, well-crafted leather. Know that \"genuine leather\" usually has a suede side or feeling to it. Genuine leather is made by stripping off the harder, more expensive grains from the top, then using the softer, easier to work leather underneath. It is not as durable as full or top grain, but it is much cheaper since it can be manufactured into a variety of goods with ease. Remember -- genuine leather is a specific grade, not the phrase for real leather. If you request genuine leather in a leather shop, they will have a specific type of product in mind. Stay away from \"bonded leather,\" which is made from ground up and glued leather shavings. While bonded leather is still leather, it isn't an unbroken or regular piece of animal skin. Instead, the shavings from all the other leather grades are collected, ground up, and mixed with an adhesive liquid to make a piece of leather. Though cheap, the quality is severely lacking. Because the quality is less impressive, bonded leather is often used for book covers and other smaller, less worn items.",
  "tyn_model":[
    "leather",
    "water",
    "bonded leather",
    "‘manmade",
    "’ it",
    "fire",
    "flame",
    "full grain leather",
    "top grain leather",
    "top grain",
    "genuine leather",
    "animal skin",
    "adhesive liquid"
  ],
  "tyn_section":[

  ]
}