{
  "title":"How to Make a Banana Shake",
  "url":"https://www.wikihow.com/Make-a-Banana-Shake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk",
    "Fruit Based Shakes"
  ],
  "methods":[
    {
      "name":"Making a Banana Shake With Kefir",
      "steps":[
        {
          "headline":"Put 2 to 3 bananas in a bowl.",
          "description":""
        },
        {
          "headline":"Now put in a liter of kefir and a teaspoon of sugar.",
          "description":""
        },
        {
          "headline":"Put 1 cup milk into the mix.",
          "description":""
        },
        {
          "headline":"Using a blender, blend all ingredients together.",
          "description":""
        },
        {
          "headline":"Relax with your fresh banana smoothie!",
          "description":""
        }
      ]
    },
    {
      "name":"Making a Banana Shake With Peanut Butter",
      "steps":[
        {
          "headline":"Place the frozen banana slices, maple syrup and peanut butter into the blender.",
          "description":"Add the 1/4 cup of milk."
        },
        {
          "headline":"Blend on low.",
          "description":"Continue blending until you can see that the banana slices have been cut into small pieces."
        },
        {
          "headline":"Turn the blender up to high.",
          "description":"Add more liquid, if needed, to make a creamy texture."
        },
        {
          "headline":"Pour the shake into a glass.",
          "description":"If wished, add another tablespoon of peanut butter while pouring; it will create a swirl in the glass."
        },
        {
          "headline":"Sprinkle with cinnamon for a topping.",
          "description":"Add a straw and serve immediately."
        }
      ]
    },
    {
      "name":"Making a Coconut Milk and Banana Shake",
      "steps":[
        {
          "headline":"Cut the bananas into 1 inch (2.5cm) slices.",
          "description":"Place the slides into a resealable bag and pop in the freezer to freeze. Allow to freeze for a few hours or overnight."
        },
        {
          "headline":"Pour half a cup of coconut milk into the blender.",
          "description":"Add the vanilla extract and some of the frozen banana slices. Blend them together."
        },
        {
          "headline":"Continue adding small amounts of the frozen banana slices.",
          "description":"Blend until all have been added in. If you need more coconut milk, add extra. (Use extra coconut milk to swish out any leftover pieces of banana at the end.)"
        },
        {
          "headline":"Pour the shake into the drinking glass.",
          "description":"Sprinkle nutmeg or cinnamon on top for added flavor."
        }
      ]
    },
    {
      "name":"Making a Sugarless Banana and Vanilla Shake",
      "steps":[
        {
          "headline":"Place the frozen banana slices, vanilla and milk into the blender.",
          "description":""
        },
        {
          "headline":"Blend until smooth.",
          "description":""
        },
        {
          "headline":"Pour into a glass.",
          "description":"Sprinkle cinnamon or nutmeg on top for a topping, if wished."
        },
        {
          "headline":"Serve immediately.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making a Banana Shake With Kefir Put 2 to 3 bananas in a bowl.  Now put in a liter of kefir and a teaspoon of sugar.  Put 1 cup milk into the mix.  Using a blender, blend all ingredients together.  Relax with your fresh banana smoothie!  Making a Banana Shake With Peanut Butter Place the frozen banana slices, maple syrup and peanut butter into the blender. Add the 1/4 cup of milk. Blend on low. Continue blending until you can see that the banana slices have been cut into small pieces. Turn the blender up to high. Add more liquid, if needed, to make a creamy texture. Pour the shake into a glass. If wished, add another tablespoon of peanut butter while pouring; it will create a swirl in the glass. Sprinkle with cinnamon for a topping. Add a straw and serve immediately. Making a Coconut Milk and Banana Shake Cut the bananas into 1 inch (2.5cm) slices. Place the slides into a resealable bag and pop in the freezer to freeze. Allow to freeze for a few hours or overnight. Pour half a cup of coconut milk into the blender. Add the vanilla extract and some of the frozen banana slices. Blend them together. Continue adding small amounts of the frozen banana slices. Blend until all have been added in. If you need more coconut milk, add extra. (Use extra coconut milk to swish out any leftover pieces of banana at the end.) Pour the shake into the drinking glass. Sprinkle nutmeg or cinnamon on top for added flavor. Making a Sugarless Banana and Vanilla Shake Place the frozen banana slices, vanilla and milk into the blender.  Blend until smooth.  Pour into a glass. Sprinkle cinnamon or nutmeg on top for a topping, if wished. Serve immediately.  Finished. ",
  "tyn_model":[
    "blender",
    "coconut milk",
    "milk",
    "banana",
    "cinnamon",
    "peanut butter",
    "glass",
    "bowl",
    "kefir",
    "sugar",
    "banana smoothie",
    "maple syrup",
    "straw",
    "bananas",
    "resealable bag",
    "freezer",
    "vanilla extract",
    "drinking glass",
    "vanilla"
  ],
  "tyn_section":[

  ]
}