{
  "title":"How to Make Basic Cupcakes",
  "url":"https://www.wikihow.com/Make-Basic-Cupcakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Cupcakes"
  ],
  "steps":[
    {
      "headline":"Cream together the butter with the sugar until light and moist.",
      "description":""
    },
    {
      "headline":"Add the vanilla extract and mix it in.",
      "description":""
    },
    {
      "headline":"Add the eggs (one at a time) to the batter.",
      "description":"Mix it well. (It may look like it's curdling but don't worry.)"
    },
    {
      "headline":"Add the flour with the baking soda and milk.",
      "description":"Mix well until all bits of flour disappear."
    },
    {
      "headline":"Preheat oven to 350 °F (175 °C).",
      "description":""
    },
    {
      "headline":"Line your cupcake pan with cupcake liners.",
      "description":""
    },
    {
      "headline":"Add the batter into the cupcake liners.",
      "description":"Fill them half up."
    },
    {
      "headline":"Bake the cupcakes for 15-20 minutes.",
      "description":"Insert a toothpick and if it comes out clean your cupcakes are done."
    },
    {
      "headline":"Let them cool for a few minutes in the pan then take them out.",
      "description":""
    },
    {
      "headline":"Voila!",
      "description":"Your awesome and delicious cupcakes are done!"
    }
  ],
  "text":" Cream together the butter with the sugar until light and moist.  Add the vanilla extract and mix it in.  Add the eggs (one at a time) to the batter. Mix it well. (It may look like it's curdling but don't worry.) Add the flour with the baking soda and milk. Mix well until all bits of flour disappear. Preheat oven to 350 °F (175 °C).  Line your cupcake pan with cupcake liners.  Add the batter into the cupcake liners. Fill them half up. Bake the cupcakes for 15-20 minutes. Insert a toothpick and if it comes out clean your cupcakes are done. Let them cool for a few minutes in the pan then take them out.  Voila! Your awesome and delicious cupcakes are done!",
  "tyn_model":[
    "flour",
    "cupcake liners",
    "butter",
    "sugar",
    "vanilla extract",
    "eggs",
    "baking soda",
    "milk",
    "oven",
    "cupcake pan",
    "toothpick",
    "pan"
  ],
  "tyn_section":[

  ]
}