{
  "title":"How to Make a Traditional Pastichio",
  "url":"https://www.wikihow.com/Make-a-Traditional-Pastichio",
  "category_hierarchy":[
    "Food and Entertaining"
  ],
  "parts":[
    {
      "name":"Bechamel (Cream) Sauce",
      "steps":[
        {
          "headline":"Heat 828 litres of milk and butter almost to a boil.",
          "description":"Mix the remaining 118 millilitres of milk with flour and slowly add to hot mixture."
        },
        {
          "headline":"Continue heating until the mixture thickens, stirring constantly.",
          "description":"If you don’t stir the mixture, the milk and butter will burn to the bottom of the pan. If the mixture doesn’t thicken to the consistency of soft pudding in 15-20 minutes, add 15 grams of cornstarch."
        },
        {
          "headline":"Remove Bechamel Sauce from heat and set aside.",
          "description":""
        },
        {
          "headline":"Once sauce has cooled slightly, beat in eggs.",
          "description":"Make sure that the sauce has cooled or else you will end up with scrambled eggs."
        }
      ]
    },
    {
      "name":"Meat Sauce",
      "steps":[
        {
          "headline":"Sauté onions and garlic in oil until they are soft and yellow.",
          "description":"Safety Note:  The oil may splatter out of the pan. Keep your arms covered and stand back from the pan so you don’t get burned by hot oil."
        },
        {
          "headline":"Add meat to the onions and garlic.",
          "description":""
        },
        {
          "headline":"Mix all of the spices, the tomato paste, and the tomatoes into the meat.",
          "description":"Allow the meat to simmer until browned. Add extra water if the meat mixture becomes too thick."
        },
        {
          "headline":"In a separate pot, cook the Macaroni according to the directions on the box.",
          "description":""
        },
        {
          "headline":"Once the macaroni is cooked, drain out the hot water and fill the pot with cold water.",
          "description":"Leave the macaroni sitting in cold water."
        }
      ]
    },
    {
      "name":"Assembly",
      "steps":[
        {
          "headline":"Preheat oven to 200 degrees celsius.",
          "description":""
        },
        {
          "headline":"Grease a 22x33x7 centimetres baking pan with butter.",
          "description":""
        },
        {
          "headline":"Place a layer of macaroni in the bottom of the pan.",
          "description":""
        },
        {
          "headline":"Cover the noodles with ½ of the meat; sprinkle 1/3 of the cheese on top of the meat.",
          "description":""
        },
        {
          "headline":"Repeat Steps 2 and 3, creating a second layer with the rest of the macaroni and meat and another 1/3 of the cheese.",
          "description":""
        },
        {
          "headline":"Pour ¾ of the Béchamel sauce on top of the pastichio.",
          "description":"Sprinkle with half of the remaining cheese."
        },
        {
          "headline":"Bake for 5 minutes.",
          "description":"Remove the pastichio from the oven and add the remaining béchamel sauce and cheese on top."
        },
        {
          "headline":"Reduce the oven temperature to 163ºC.",
          "description":"Bake for another 45 minutes, until the top of the pastichio has browned."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Bechamel (Cream) Sauce Heat 828 litres of milk and butter almost to a boil. Mix the remaining 118 millilitres of milk with flour and slowly add to hot mixture. Continue heating until the mixture thickens, stirring constantly. If you don’t stir the mixture, the milk and butter will burn to the bottom of the pan. If the mixture doesn’t thicken to the consistency of soft pudding in 15-20 minutes, add 15 grams of cornstarch. Remove Bechamel Sauce from heat and set aside.  Once sauce has cooled slightly, beat in eggs. Make sure that the sauce has cooled or else you will end up with scrambled eggs. Meat Sauce Sauté onions and garlic in oil until they are soft and yellow. Safety Note:  The oil may splatter out of the pan. Keep your arms covered and stand back from the pan so you don’t get burned by hot oil. Add meat to the onions and garlic.  Mix all of the spices, the tomato paste, and the tomatoes into the meat. Allow the meat to simmer until browned. Add extra water if the meat mixture becomes too thick. In a separate pot, cook the Macaroni according to the directions on the box.  Once the macaroni is cooked, drain out the hot water and fill the pot with cold water. Leave the macaroni sitting in cold water. Assembly Preheat oven to 200 degrees celsius.  Grease a 22x33x7 centimetres baking pan with butter.  Place a layer of macaroni in the bottom of the pan.  Cover the noodles with ½ of the meat; sprinkle 1/3 of the cheese on top of the meat.  Repeat Steps 2 and 3, creating a second layer with the rest of the macaroni and meat and another 1/3 of the cheese.  Pour ¾ of the Béchamel sauce on top of the pastichio. Sprinkle with half of the remaining cheese. Bake for 5 minutes. Remove the pastichio from the oven and add the remaining béchamel sauce and cheese on top. Reduce the oven temperature to 163ºC. Bake for another 45 minutes, until the top of the pastichio has browned. Finished. ",
  "tyn_model":[
    "water",
    "milk",
    "butter",
    "oil",
    "oven",
    "onions",
    "garlic",
    "pot",
    "béchamel sauce",
    "bechamel (cream",
    "flour",
    "cornstarch",
    "bechamel sauce",
    "eggs",
    "scrambled eggs",
    "meat sauce",
    "spices",
    "tomato paste",
    "tomatoes",
    "baking pan",
    "noodles",
    "macaroni",
    "meat",
    "cheese"
  ],
  "tyn_section":[

  ]
}