{
  "title":"How to Make a Chicken Stew Al Manuel",
  "url":"https://www.wikihow.com/Make-a-Chicken-Stew-Al-Manuel",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Philippine Dishes"
  ],
  "steps":[
    {
      "headline":"Marinate the chicken in onion, garlic and soy sauce.",
      "description":""
    },
    {
      "headline":"Chop all vegetables into different kinds of slices.",
      "description":""
    },
    {
      "headline":"After marinating, heat a small amount of cooking oil in pan.",
      "description":""
    },
    {
      "headline":"Sear the chicken on the frying pan to lock the flavors.",
      "description":""
    },
    {
      "headline":"Add the spices (onion, garlic).",
      "description":"Sauté the chicken with the onions, garlic, potatoes and carrots."
    },
    {
      "headline":"Place the chicken in another saucepan and boil for 20 minutes on medium heat or 40 minutes on low heat with GSM Blue(Ginebra San Miguel 50% alcohol content) or any alcoholic beverages.",
      "description":""
    },
    {
      "headline":"After boiling the chicken for 20 minutes, add the potato and a bit of sautéed onion and garlic to the saucepan.",
      "description":""
    },
    {
      "headline":"To thicken the stock, you need to add mushroom soup with starch.",
      "description":""
    },
    {
      "headline":"After 20 minutes, add all the other ingredients and season to taste.",
      "description":""
    },
    {
      "headline":"If it lacks acidity then add more tomato sauce.",
      "description":""
    },
    {
      "headline":"Place in a plate and garnish with just a little rosemary or parsley.",
      "description":""
    },
    {
      "headline":"Serve and eat.",
      "description":""
    }
  ],
  "text":" Marinate the chicken in onion, garlic and soy sauce.  Chop all vegetables into different kinds of slices.  After marinating, heat a small amount of cooking oil in pan.  Sear the chicken on the frying pan to lock the flavors.  Add the spices (onion, garlic). Sauté the chicken with the onions, garlic, potatoes and carrots. Place the chicken in another saucepan and boil for 20 minutes on medium heat or 40 minutes on low heat with GSM Blue(Ginebra San Miguel 50% alcohol content) or any alcoholic beverages.  After boiling the chicken for 20 minutes, add the potato and a bit of sautéed onion and garlic to the saucepan.  To thicken the stock, you need to add mushroom soup with starch.  After 20 minutes, add all the other ingredients and season to taste.  If it lacks acidity then add more tomato sauce.  Place in a plate and garnish with just a little rosemary or parsley.  Serve and eat. ",
  "tyn_model":[
    "garlic",
    "chicken",
    "onion",
    "saucepan",
    "soy sauce",
    "cooking oil",
    "frying pan",
    "onions",
    "potatoes",
    "carrots",
    "potato",
    "mushroom soup",
    "tomato sauce",
    "plate",
    "rosemary",
    "parsley"
  ],
  "tyn_section":[

  ]
}