{
  "title":"How to Make Wiggly Finger Wonderfuls",
  "url":"https://www.wikihow.com/Make-Wiggly-Finger-Wonderfuls",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking for Children",
    "Toddler Recipes"
  ],
  "steps":[
    {
      "headline":"Put the unflavored gelatin in a large bowl.",
      "description":""
    },
    {
      "headline":"Pour the pineapple juice in the bowl.",
      "description":""
    },
    {
      "headline":"Pour the boiling water in the bowl, at a slow rate, while you stir constantly.",
      "description":"Make sure that the gelatin is dissolved."
    },
    {
      "headline":"Add the orange juice to the bowl.",
      "description":""
    },
    {
      "headline":"Mix everything together thoroughly.",
      "description":""
    },
    {
      "headline":"Carefully pour the mixture in a 9 x 12 inch pan",
      "description":""
    },
    {
      "headline":"Place the pan in the refrigerator until it's \"set\" (more solid than liquid).",
      "description":""
    },
    {
      "headline":"Wait until it's Jello-like and \"wiggly\".",
      "description":"Remove the pan from the refrigerator."
    },
    {
      "headline":"Cut the Jello into \"finger lengths\" or pieces appropriate for your toddler.",
      "description":""
    },
    {
      "headline":"Serve immediately or store pieces in an airtight container in the refrigerator.",
      "description":""
    }
  ],
  "text":" Put the unflavored gelatin in a large bowl.  Pour the pineapple juice in the bowl.  Pour the boiling water in the bowl, at a slow rate, while you stir constantly. Make sure that the gelatin is dissolved. Add the orange juice to the bowl.  Mix everything together thoroughly.  Carefully pour the mixture in a 9 x 12 inch pan  Place the pan in the refrigerator until it's \"set\" (more solid than liquid).  Wait until it's Jello-like and \"wiggly\". Remove the pan from the refrigerator. Cut the Jello into \"finger lengths\" or pieces appropriate for your toddler.  Serve immediately or store pieces in an airtight container in the refrigerator. ",
  "tyn_model":[
    "refrigerator",
    "bowl",
    "large bowl",
    "pineapple juice",
    "water",
    "gelatin",
    "orange juice",
    "jello",
    "airtight container"
  ],
  "tyn_section":[

  ]
}