{
  "title":"How to Select and Store Cucumbers",
  "url":"https://www.wikihow.com/Select-and-Store-Cucumbers",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Food Selection and Storage"
  ],
  "steps":[
    {
      "headline":"Look for cucumbers with a bright, even colour of skin without dullness or sweating.",
      "description":"The cucumber should look fresh."
    },
    {
      "headline":"Test the firmness of the cucumber.",
      "description":"A good cucumber is firm and does not bend. This firmness should be right through to the tips of the cucumber."
    },
    {
      "headline":"Look for a fleshy cucumber but not too large in its shape.",
      "description":"Smaller cucumbers are crisper and have finer seeds, making them more appealing to many people, especially kids."
    },
    {
      "headline":"Avoid cucumbers with blemishes, soft spots, yellowing, or easily bent.",
      "description":""
    },
    {
      "headline":"Do not store cucumbers in the refrigerator as they are sensitive to cold.",
      "description":"They will fare much better on the countertop, unless you eat them in less than 3 days. Also avoid storing near fruit (especially melons, tomatoes and bananas) as this will cause cucumbers to yellow and deteriorate quickly."
    }
  ],
  "text":" Look for cucumbers with a bright, even colour of skin without dullness or sweating. The cucumber should look fresh. Test the firmness of the cucumber. A good cucumber is firm and does not bend. This firmness should be right through to the tips of the cucumber. Look for a fleshy cucumber but not too large in its shape. Smaller cucumbers are crisper and have finer seeds, making them more appealing to many people, especially kids. Avoid cucumbers with blemishes, soft spots, yellowing, or easily bent.  Do not store cucumbers in the refrigerator as they are sensitive to cold. They will fare much better on the countertop, unless you eat them in less than 3 days. Also avoid storing near fruit (especially melons, tomatoes and bananas) as this will cause cucumbers to yellow and deteriorate quickly.",
  "tyn_model":[
    "cucumbers",
    "cucumber",
    "refrigerator",
    "tomatoes",
    "bananas"
  ],
  "tyn_section":[

  ]
}