{
  "title":"How to Make Christmas Peppermint Meltaways",
  "url":"https://www.wikihow.com/Make-Christmas-Peppermint-Meltaways",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy"
  ],
  "methods":[
    {
      "name":"Making the Cookies",
      "steps":[
        {
          "headline":"Preheat your oven to 350 F (180 C) and set a baking sheet aside for later.",
          "description":""
        },
        {
          "headline":"Mix together the sugar, butter and 1/2 teaspoon peppermint extract in large mixing bowl.",
          "description":""
        },
        {
          "headline":"Whisk the ingredients at medium speed until the batter is creamy (1 to 2 minutes).",
          "description":""
        },
        {
          "headline":"Reduce the speed to low and add the flour and cornstarch to the mixture.",
          "description":""
        },
        {
          "headline":"Beat until the ingredients are well mixed (1 to 2 minutes).",
          "description":""
        },
        {
          "headline":"Cover the batter and refrigerate it until it becomes firm (30 to 60 minutes).",
          "description":""
        },
        {
          "headline":"Shape rounded teaspoonfuls of dough into 1\" balls and place them 2\" apart on your ungreased cookie sheet.",
          "description":""
        },
        {
          "headline":"Let the cookies bake for 12 to 15 minutes or until the edges of the cookies are slightly browned.",
          "description":""
        },
        {
          "headline":"Let the cookies stand for 1 minute at room temperature and then remove them from the cookie sheet and place them on wire racks to cool thoroughly.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    },
    {
      "name":"Making the Glaze",
      "steps":[
        {
          "headline":"Blend the 1 1/2 cups of powdered sugar, 2 tablespoons of butter, 1/4 teaspoon of peppermint extract and enough milk to get the desired glazing consistency in a small bowl.",
          "description":""
        },
        {
          "headline":"Add some food coloring to the glaze if desired.",
          "description":""
        },
        {
          "headline":"Trickle the glaze over the cooled cookies while they're still on the wire rack.",
          "description":""
        },
        {
          "headline":"Sprinkle them promptly with crushed candy so that it sticks easily to the glaze.",
          "description":""
        },
        {
          "headline":"Let them sit at room temperature until the glaze firms up and serve with cold milk.",
          "description":""
        }
      ]
    }
  ],
  "text":" Making the Cookies Preheat your oven to 350 F (180 C) and set a baking sheet aside for later.  Mix together the sugar, butter and 1/2 teaspoon peppermint extract in large mixing bowl.  Whisk the ingredients at medium speed until the batter is creamy (1 to 2 minutes).  Reduce the speed to low and add the flour and cornstarch to the mixture.  Beat until the ingredients are well mixed (1 to 2 minutes).  Cover the batter and refrigerate it until it becomes firm (30 to 60 minutes).  Shape rounded teaspoonfuls of dough into 1\" balls and place them 2\" apart on your ungreased cookie sheet.  Let the cookies bake for 12 to 15 minutes or until the edges of the cookies are slightly browned.  Let the cookies stand for 1 minute at room temperature and then remove them from the cookie sheet and place them on wire racks to cool thoroughly.  Finished.  Making the Glaze Blend the 1 1/2 cups of powdered sugar, 2 tablespoons of butter, 1/4 teaspoon of peppermint extract and enough milk to get the desired glazing consistency in a small bowl.  Add some food coloring to the glaze if desired.  Trickle the glaze over the cooled cookies while they're still on the wire rack.  Sprinkle them promptly with crushed candy so that it sticks easily to the glaze.  Let them sit at room temperature until the glaze firms up and serve with cold milk. ",
  "tyn_model":[
    "butter",
    "peppermint extract",
    "milk",
    "oven",
    "baking sheet",
    "sugar",
    "large mixing bowl",
    "flour",
    "cornstarch",
    "cookie sheet",
    "powdered sugar",
    "small bowl",
    "food coloring",
    "wire rack"
  ],
  "tyn_section":[

  ]
}