{
  "title":"How to Browse an Auction Using Godaddy",
  "url":"https://www.wikihow.com/Browse-an-Auction-Using-Godaddy",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Collecting"
  ],
  "parts":[
    {
      "name":"Logging into Godaddy",
      "steps":[
        {
          "headline":"Open a web browser.",
          "description":"Double-click a web browser's icon on your desktop to launch it."
        },
        {
          "headline":"Head for the Godaddy website.",
          "description":"Once the browser is open, type in www.godaddy.com on the address bar at the top of the screen and hit Enter. You will be taken to the website's home screen."
        },
        {
          "headline":"Log into your Godaddy account.",
          "description":"Type in your username and password on the fields provided then click “Sign in” to access your account."
        }
      ]
    },
    {
      "name":"Browsing Auctions",
      "steps":[
        {
          "headline":"Go to Godaddy's Auction page.",
          "description":"Click “Domains” from the menu buttons at the top of the page and select “Browse Auctions” from the drop-down menu that will appear. This will take you to the Auction section/page of Godaddy."
        },
        {
          "headline":"Search for a particular auction entry.",
          "description":"Enter the items you want to search for on the text field provided located on the upper portion of the page, and click “Go” to start the search query. All the auction entries that are related to the item you entered will be displayed in tabular form."
        },
        {
          "headline":"Browse by popular searches.",
          "description":"The Popular Searches option lets you browse auction entries by category. This sorts out the domains up for auction by date, status, or in alphabetical order. Click the “Popular Searches” drop-down list and choose how you want to view the Auction page."
        },
        {
          "headline":"Specify the number of domains/auction entries displayed on the Auction page.",
          "description":"Click the “Search Results to Return” drop-down menu and select your desired number of items to display."
        },
        {
          "headline":"View the bidding details.",
          "description":"Click the name of the domain displayed on the list, and the bidding details will appear right below the entry. The bidding details contain the following information:\n\nAuction Ends — The date the auction for the domain will end\n\nItem # — The item number of the domain on the auction list\n\nPrice — The current price/highest bid for the domain/auction entry\n\nStatus — Shows the status of the auction (whether it's still open for bidding or already closed)\n\nSale Type — States whether the entry is a public or private auction\n\nBid/Offers — The number of bids made for the auction entry\n\nAge — How long has the domain been on the Auction list\n\nViews — How many times the entry has been viewed by users"
        }
      ]
    },
    {
      "name":"Bidding in Godaddy",
      "steps":[
        {
          "headline":"Start bidding.",
          "description":"Beside the names of every domain displayed in the Auction page is a text box labeled “Offer $ or more.” Here you can type in the price you want to bid for any site you choose. Once you're done, hit the “Enter” button on your keyboard to place your bid. A review screen will appear containing the summary of your bid. Click on the “Submit” button to confirm and post your bid."
        },
        {
          "headline":"Buy a domain.",
          "description":"If you don't like to bid and would want to purchase the auction entry immediately, click on “Buy Now,” and the auction entry/domain will be added to your account's cart."
        },
        {
          "headline":"Add auction entries to your watching list.",
          "description":"On the left side of the auction entry's name you'll see a gray “eye” icon, which adds the selected auction entry to your watch list when clicked. This allows you to keep a close watch on the activities happening on the auction."
        },
        {
          "headline":"Wait for the auction to end.",
          "description":"Once the auction ends, the domain/auction entry will be awarded to the member with the highest bid value."
        }
      ]
    }
  ],
  "text":" Logging into Godaddy Open a web browser. Double-click a web browser's icon on your desktop to launch it. Head for the Godaddy website. Once the browser is open, type in www.godaddy.com on the address bar at the top of the screen and hit Enter. You will be taken to the website's home screen. Log into your Godaddy account. Type in your username and password on the fields provided then click “Sign in” to access your account. Browsing Auctions Go to Godaddy's Auction page. Click “Domains” from the menu buttons at the top of the page and select “Browse Auctions” from the drop-down menu that will appear. This will take you to the Auction section/page of Godaddy. Search for a particular auction entry. Enter the items you want to search for on the text field provided located on the upper portion of the page, and click “Go” to start the search query. All the auction entries that are related to the item you entered will be displayed in tabular form. Browse by popular searches. The Popular Searches option lets you browse auction entries by category. This sorts out the domains up for auction by date, status, or in alphabetical order. Click the “Popular Searches” drop-down list and choose how you want to view the Auction page. Specify the number of domains/auction entries displayed on the Auction page. Click the “Search Results to Return” drop-down menu and select your desired number of items to display. View the bidding details. Click the name of the domain displayed on the list, and the bidding details will appear right below the entry. The bidding details contain the following information:\n\nAuction Ends — The date the auction for the domain will end\n\nItem # — The item number of the domain on the auction list\n\nPrice — The current price/highest bid for the domain/auction entry\n\nStatus — Shows the status of the auction (whether it's still open for bidding or already closed)\n\nSale Type — States whether the entry is a public or private auction\n\nBid/Offers — The number of bids made for the auction entry\n\nAge — How long has the domain been on the Auction list\n\nViews — How many times the entry has been viewed by users Bidding in Godaddy Start bidding. Beside the names of every domain displayed in the Auction page is a text box labeled “Offer $ or more.” Here you can type in the price you want to bid for any site you choose. Once you're done, hit the “Enter” button on your keyboard to place your bid. A review screen will appear containing the summary of your bid. Click on the “Submit” button to confirm and post your bid. Buy a domain. If you don't like to bid and would want to purchase the auction entry immediately, click on “Buy Now,” and the auction entry/domain will be added to your account's cart. Add auction entries to your watching list. On the left side of the auction entry's name you'll see a gray “eye” icon, which adds the selected auction entry to your watch list when clicked. This allows you to keep a close watch on the activities happening on the auction. Wait for the auction to end. Once the auction ends, the domain/auction entry will be awarded to the member with the highest bid value.",
  "tyn_model":[
    "— the",
    "domain",
    "web browser",
    "” to",
    "” from",
    "” drop",
    "— how",
    "” button",
    "godaddy website",
    "godaddy account",
    "“sign",
    "godaddy's",
    "“domains",
    "“browse",
    "godaddy.",
    "“go",
    "“popular",
    "“search",
    "— shows",
    "— states",
    "“offer",
    "” here",
    "“enter",
    "“submit",
    "“buy",
    "” and",
    "“eye",
    "” icon"
  ],
  "tyn_section":[

  ]
}