{
  "title":"How to Make Gardening Gloves Last Longer",
  "url":"https://www.wikihow.com/Make-Gardening-Gloves-Last-Longer",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "steps":[
    {
      "headline":"Brush the dirt off your gloves after use each time.",
      "description":"This helps prevent them from stiffening up and becoming too hard to use. It also helps prevent general wear and tear."
    },
    {
      "headline":"Wash occasionally.",
      "description":"It is a good idea to hand wash your gardening gloves now and then. This removes dirt and brings back their suppleness."
    },
    {
      "headline":"Turn your gardening gloves inside out when one starts to wear.",
      "description":"Change hands. One of the gloves usually wears out more rapidly before the other."
    },
    {
      "headline":"Store them neatly and flat.",
      "description":"Always unfurl gardening gloves before storing so that they lay flat. Put them somewhere that they won't be crushed by other objects or lost. Pin together to prevent losing one accidentally; a clothespin or peg is ideal for keeping them together and stops spiders etc. from crawling inside too."
    }
  ],
  "text":" Brush the dirt off your gloves after use each time. This helps prevent them from stiffening up and becoming too hard to use. It also helps prevent general wear and tear. Wash occasionally. It is a good idea to hand wash your gardening gloves now and then. This removes dirt and brings back their suppleness. Turn your gardening gloves inside out when one starts to wear. Change hands. One of the gloves usually wears out more rapidly before the other. Store them neatly and flat. Always unfurl gardening gloves before storing so that they lay flat. Put them somewhere that they won't be crushed by other objects or lost. Pin together to prevent losing one accidentally; a clothespin or peg is ideal for keeping them together and stops spiders etc. from crawling inside too.",
  "tyn_model":[
    "gardening gloves",
    "gloves",
    "clothespin or"
  ],
  "tyn_section":[

  ]
}