{
  "title":"How to Cook Asian Style Chicken Noodle Soup",
  "url":"https://www.wikihow.com/Cook-Asian-Style-Chicken-Noodle-Soup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Japanese Dishes"
  ],
  "steps":[
    {
      "headline":"Prepare the oil by heating it in the large soup pot over a high heat.",
      "description":""
    },
    {
      "headline":"Mix the garlic, pepper, and sliced onion to the pot and stir for 2 minutes.",
      "description":"Season the mixture if necessary."
    },
    {
      "headline":"Carefully pour the chicken stock and add the shredded carrots in the pot and stir thoroughly.",
      "description":""
    },
    {
      "headline":"Place a lid on the pot and bring it up to a slow boil.",
      "description":""
    },
    {
      "headline":"Wait until it boils and then add the chicken.",
      "description":"Lower the heat and let the food simmer for 5 minutes."
    },
    {
      "headline":"Add the noodles to the pot and continue to let it simmer for another 5 minutes.",
      "description":""
    },
    {
      "headline":"Remove the pot from the heat.",
      "description":"Squirt the lime juice in the soup and serve into soup bowls."
    },
    {
      "headline":"Garnish each bowl with coriander, a basil leaf, and a bit of bean sprouts.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Prepare the oil by heating it in the large soup pot over a high heat.  Mix the garlic, pepper, and sliced onion to the pot and stir for 2 minutes. Season the mixture if necessary. Carefully pour the chicken stock and add the shredded carrots in the pot and stir thoroughly.  Place a lid on the pot and bring it up to a slow boil.  Wait until it boils and then add the chicken. Lower the heat and let the food simmer for 5 minutes. Add the noodles to the pot and continue to let it simmer for another 5 minutes.  Remove the pot from the heat. Squirt the lime juice in the soup and serve into soup bowls. Garnish each bowl with coriander, a basil leaf, and a bit of bean sprouts.  Finished. ",
  "tyn_model":[
    "pot",
    "oil",
    "large soup pot",
    "garlic",
    "pepper",
    "onion",
    "chicken stock",
    "carrots",
    "chicken",
    "noodles",
    "lime juice",
    "soup bowls",
    "coriander",
    "basil",
    "bean sprouts"
  ],
  "tyn_section":[

  ]
}