{
  "title":"How to Organize Your Fridge",
  "url":"https://www.wikihow.com/Organize-Your-Fridge",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Cleaning",
    "House Cleaning"
  ],
  "methods":[
    {
      "name":"Separating Foods and Condiments",
      "steps":[
        {
          "headline":"Keep meat and dairy on the bottom shelves.",
          "description":"Dairy and meat products tend to go bad fast. You should keep such items on the bottom shelf of your fridge near the back. This area is generally the coldest, keeping these products freshest for the longest. This also helps juices from meat from contaminating the entire fridge in the event they drip. You should also wrap meat products carefully, especially raw meat, in plastic wrap to prevent contamination. Placed wrapped raw meat in a bowl, dish, tray, etc., to catch any leaking juices."
        },
        {
          "headline":"Use the side drawer for condiments.",
          "description":"Your side drawer is the warmest part of your fridge. As condiments do not need super cold temperatures to stay fresh, you should store them here. You can also store cooking oils, juice, water, and butter in the side drawers if you don't have space for them elsewhere in the fridge."
        },
        {
          "headline":"Put produce in the crisper drawer.",
          "description":"The crisper drawer is designed to keep produce. Many crisper drawers have a humidity level you can set. Even if your fridge does not have an adjustable humidity level for the crisper drawer, you should still store produce here. Items that thrive at lower humidity include many fruits, such as apples, avocados, peaches, plums, and pears. Vegetables, like green onions, broccoli, and cauliflower, do well at higher humidity levels."
        },
        {
          "headline":"Use your upper shelf for items that don't spoil easily.",
          "description":"Your upper shelf is warmer than other parts of the fridge. You should store items that are not as prone to spoilage in this area. Snack foods and spreads, like hummus, jam, and jelly, can be stored in the upper level of the fridge. While yogurt is a dairy product, it is fermented so it can safely be stored in the upper shelf. Leftover foods can be stored in the upper shelf."
        },
        {
          "headline":"Keep certain food items out of the fridge.",
          "description":"Many people put items in the fridge that do not belong there. This can make items spoil faster and take up space unnecessarily. They should be stored in the pantry instead. Keep the following items out of your fridge:\nCoffee\nGarlic\nBananas\nBread\nPotatoes\nOnions\nTomatoes"
        },
        {
          "headline":"Store food for the long term in your freezer.",
          "description":"If you're short on space, and have food you're not going to eat quickly, transfer it to the freezer. This will free up space in your fridge and save it for later. Items like meat, cheese, milk, and herbs can keep for months in the freezer."
        }
      ]
    },
    {
      "name":"Using Shelves and Drawers",
      "steps":[
        {
          "headline":"Use and label baskets.",
          "description":"If you do not have a lot of individual storage spaces in your fridge, stop by a local department store and pick up some baskets. Label each basket and separate food items by basket. For example, you can have a basket for cheese, a basket for deli meats, and so on. A bonus of baskets is that they easily slide out of the fridge, so you can access food quickly if necessary."
        },
        {
          "headline":"Place labels on your drawers.",
          "description":"If you have drawers in your fridge, label them. This will help you keep track of what items go where and, if you have guests, they'll know where to put things away in your fridge. Side drawers often get particularly messy, so label these. For example, one side drawer can be labeled \"condiments\" while another can be labeled \"Drinks and milk.\""
        },
        {
          "headline":"Line shelves with plastic wrap.",
          "description":"Spills happen in fridges, even if you're well organized. A great way to keep your fridge clean and organized is plastic wrap. Remove all items from your fridge and lay down a layer of plastic wrap. In the event a spill occurs, simply remove the plastic wrap and replace it. Plastic wrap may work particularly well in areas where you keep sticky, messy items."
        },
        {
          "headline":"Use stackable containers.",
          "description":"Avoid storing leftovers in round containers. You're better off storing leftovers in square Tupperware containers, as these can be easily stacked in your fridge. This helps you make the most of your space."
        },
        {
          "headline":"Make use of removable shelves.",
          "description":"Most fridges have shelves that are removable and able to be repositioned. Take some time to think about and try different arrangements while your fridge is empty (either upon purchase or after a thorough cleaning). Position the shelves so that you minimize wasted space and maximize your ability to organize and access foods easily."
        }
      ]
    },
    {
      "name":"Keeping Your Fridge Organized",
      "steps":[
        {
          "headline":"Line bins with paper towels.",
          "description":"If you have bins in your fridge, line them with paper towels. This can help collect messes, like crumbs and spills. Replace the paper towels each time you clean your fridge. Crisper drawers can often be difficult to remove and clean, so paper towels can be particularly helpful here."
        },
        {
          "headline":"Take precautions storing sticky items.",
          "description":"You should use removable shelf bins for sticky items. Jams, syrups, and sauces can spill easily. Cleaning can be difficult if you cannot soak a bin in the fridge. Opt for easy to remove drawers so you can clean up sticky spills easily. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDonna Smallin Kuper\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOrganization Expert & Author\t\t\t\t\t\t\t\tDonna Smallin Kuper is a Cleaning and Organization Expert. Donna is the best selling author of more than a dozen of books on clearing clutter and simplifying life, and her work has been published in Better Homes & Gardens, Real Simple, and Woman’s Day. She has been a featured guest on CBS Early Show, Better TV, and HGTV. In 2006, she received the Founders Award from the National Association of Professional Organizers. She is an Institute of Inspection Cleaning and Restoriation (IICRC) Certified House Cleaning Technician. Donna Smallin Kuper\t\t\tOrganization Expert & Author\t\t\t\tDonna Smallin Kuper, Organizing Expert, advises: “Make it a habit to clean up any spills immediately - it's easier to clean a fresh spill than one that's hardened. Before returning items to your fridge, give them a quick wipe to remove any drips.”"
        },
        {
          "headline":"Maximize your shelf space.",
          "description":"Remove empty cans and containers promptly. There's no reason to have an empty milk container clogging space. Try storing leftovers in small bags rather than large bins. If you have more space in your fridge, it's easier to stay organized."
        },
        {
          "headline":"Clean your fridge regularly.",
          "description":"You should spot clean your fridge every week. This means wiping up small spills and removing crumbs from drawers and surfaces. Every three to four months, you should deep clean your fridge. This means removing food to give the fridge a good, thorough cleaning. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDonna Smallin Kuper\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOrganization Expert & Author\t\t\t\t\t\t\t\tDonna Smallin Kuper is a Cleaning and Organization Expert. Donna is the best selling author of more than a dozen of books on clearing clutter and simplifying life, and her work has been published in Better Homes & Gardens, Real Simple, and Woman’s Day. She has been a featured guest on CBS Early Show, Better TV, and HGTV. In 2006, she received the Founders Award from the National Association of Professional Organizers. She is an Institute of Inspection Cleaning and Restoriation (IICRC) Certified House Cleaning Technician. Donna Smallin Kuper\t\t\tOrganization Expert & Author\t\t\t\tDonna Smallin Kuper, Organizing Expert, advises: “The best time to clean your fridge is before you go grocery shopping. Toss anything that's expired or questionable (when in doubt, throw it out) and make a note of what you need to replace.\""
        },
        {
          "headline":"Deep clean your fridge properly.",
          "description":"When you deep clean your fridge, you remove all items from the fridge, as well as any removable drawers or compartments. Food should be stored in a cooler while you clean. Wash down the shelves in the fridge using warm, soapy water. Wash all removable drawers in the sink, as you would dishes. When you're done, dry your fridge as best you can and return all items to the fridge."
        }
      ]
    }
  ],
  "text":" Separating Foods and Condiments Keep meat and dairy on the bottom shelves. Dairy and meat products tend to go bad fast. You should keep such items on the bottom shelf of your fridge near the back. This area is generally the coldest, keeping these products freshest for the longest. This also helps juices from meat from contaminating the entire fridge in the event they drip. You should also wrap meat products carefully, especially raw meat, in plastic wrap to prevent contamination. Placed wrapped raw meat in a bowl, dish, tray, etc., to catch any leaking juices. Use the side drawer for condiments. Your side drawer is the warmest part of your fridge. As condiments do not need super cold temperatures to stay fresh, you should store them here. You can also store cooking oils, juice, water, and butter in the side drawers if you don't have space for them elsewhere in the fridge. Put produce in the crisper drawer. The crisper drawer is designed to keep produce. Many crisper drawers have a humidity level you can set. Even if your fridge does not have an adjustable humidity level for the crisper drawer, you should still store produce here. Items that thrive at lower humidity include many fruits, such as apples, avocados, peaches, plums, and pears. Vegetables, like green onions, broccoli, and cauliflower, do well at higher humidity levels. Use your upper shelf for items that don't spoil easily. Your upper shelf is warmer than other parts of the fridge. You should store items that are not as prone to spoilage in this area. Snack foods and spreads, like hummus, jam, and jelly, can be stored in the upper level of the fridge. While yogurt is a dairy product, it is fermented so it can safely be stored in the upper shelf. Leftover foods can be stored in the upper shelf. Keep certain food items out of the fridge. Many people put items in the fridge that do not belong there. This can make items spoil faster and take up space unnecessarily. They should be stored in the pantry instead. Keep the following items out of your fridge:\nCoffee\nGarlic\nBananas\nBread\nPotatoes\nOnions\nTomatoes Store food for the long term in your freezer. If you're short on space, and have food you're not going to eat quickly, transfer it to the freezer. This will free up space in your fridge and save it for later. Items like meat, cheese, milk, and herbs can keep for months in the freezer. Using Shelves and Drawers Use and label baskets. If you do not have a lot of individual storage spaces in your fridge, stop by a local department store and pick up some baskets. Label each basket and separate food items by basket. For example, you can have a basket for cheese, a basket for deli meats, and so on. A bonus of baskets is that they easily slide out of the fridge, so you can access food quickly if necessary. Place labels on your drawers. If you have drawers in your fridge, label them. This will help you keep track of what items go where and, if you have guests, they'll know where to put things away in your fridge. Side drawers often get particularly messy, so label these. For example, one side drawer can be labeled \"condiments\" while another can be labeled \"Drinks and milk.\" Line shelves with plastic wrap. Spills happen in fridges, even if you're well organized. A great way to keep your fridge clean and organized is plastic wrap. Remove all items from your fridge and lay down a layer of plastic wrap. In the event a spill occurs, simply remove the plastic wrap and replace it. Plastic wrap may work particularly well in areas where you keep sticky, messy items. Use stackable containers. Avoid storing leftovers in round containers. You're better off storing leftovers in square Tupperware containers, as these can be easily stacked in your fridge. This helps you make the most of your space. Make use of removable shelves. Most fridges have shelves that are removable and able to be repositioned. Take some time to think about and try different arrangements while your fridge is empty (either upon purchase or after a thorough cleaning). Position the shelves so that you minimize wasted space and maximize your ability to organize and access foods easily. Keeping Your Fridge Organized Line bins with paper towels. If you have bins in your fridge, line them with paper towels. This can help collect messes, like crumbs and spills. Replace the paper towels each time you clean your fridge. Crisper drawers can often be difficult to remove and clean, so paper towels can be particularly helpful here. Take precautions storing sticky items. You should use removable shelf bins for sticky items. Jams, syrups, and sauces can spill easily. Cleaning can be difficult if you cannot soak a bin in the fridge. Opt for easy to remove drawers so you can clean up sticky spills easily. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDonna Smallin Kuper\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOrganization Expert & Author\t\t\t\t\t\t\t\tDonna Smallin Kuper is a Cleaning and Organization Expert. Donna is the best selling author of more than a dozen of books on clearing clutter and simplifying life, and her work has been published in Better Homes & Gardens, Real Simple, and Woman’s Day. She has been a featured guest on CBS Early Show, Better TV, and HGTV. In 2006, she received the Founders Award from the National Association of Professional Organizers. She is an Institute of Inspection Cleaning and Restoriation (IICRC) Certified House Cleaning Technician. Donna Smallin Kuper\t\t\tOrganization Expert & Author\t\t\t\tDonna Smallin Kuper, Organizing Expert, advises: “Make it a habit to clean up any spills immediately - it's easier to clean a fresh spill than one that's hardened. Before returning items to your fridge, give them a quick wipe to remove any drips.” Maximize your shelf space. Remove empty cans and containers promptly. There's no reason to have an empty milk container clogging space. Try storing leftovers in small bags rather than large bins. If you have more space in your fridge, it's easier to stay organized. Clean your fridge regularly. You should spot clean your fridge every week. This means wiping up small spills and removing crumbs from drawers and surfaces. Every three to four months, you should deep clean your fridge. This means removing food to give the fridge a good, thorough cleaning. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDonna Smallin Kuper\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOrganization Expert & Author\t\t\t\t\t\t\t\tDonna Smallin Kuper is a Cleaning and Organization Expert. Donna is the best selling author of more than a dozen of books on clearing clutter and simplifying life, and her work has been published in Better Homes & Gardens, Real Simple, and Woman’s Day. She has been a featured guest on CBS Early Show, Better TV, and HGTV. In 2006, she received the Founders Award from the National Association of Professional Organizers. She is an Institute of Inspection Cleaning and Restoriation (IICRC) Certified House Cleaning Technician. Donna Smallin Kuper\t\t\tOrganization Expert & Author\t\t\t\tDonna Smallin Kuper, Organizing Expert, advises: “The best time to clean your fridge is before you go grocery shopping. Toss anything that's expired or questionable (when in doubt, throw it out) and make a note of what you need to replace.\" Deep clean your fridge properly. When you deep clean your fridge, you remove all items from the fridge, as well as any removable drawers or compartments. Food should be stored in a cooler while you clean. Wash down the shelves in the fridge using warm, soapy water. Wash all removable drawers in the sink, as you would dishes. When you're done, dry your fridge as best you can and return all items to the fridge.",
  "tyn_model":[
    "fridge",
    "plastic wrap",
    "condiments",
    "freezer",
    "milk",
    "baskets",
    "paper towels",
    "water",
    "produce",
    "food",
    "cheese",
    "basket",
    "cleaning and organization expert",
    "dairy",
    "bowl",
    "dish",
    "tray",
    "cooking oils",
    "butter",
    "crisper drawer",
    "crisper drawers",
    "apples",
    "avocados",
    "peaches",
    "plums",
    "broccoli",
    "cauliflower",
    "hummus",
    "jam",
    "jelly",
    "yogurt",
    "coffee",
    "garlic",
    "bananas",
    "bread",
    "potatoes",
    "onions",
    "tomatoes",
    "herbs",
    "tupperware containers",
    "shelves",
    "paper",
    "towels",
    "jams",
    "syrups",
    "sauces",
    "bin",
    "kuper",
    "homes & gardens",
    "house cleaning technician",
    "organizing expert",
    "“make",
    "” maximize",
    "containers",
    "“the"
  ],
  "tyn_section":[

  ]
}