{
  "title":"How to Make Butter and Raisin Buns",
  "url":"https://www.wikihow.com/Make-Butter-and-Raisin-Buns",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Buns"
  ],
  "steps":[
    {
      "headline":"Combine the ingredients.",
      "description":"Into the mixing bowl, add the flour, sugar, salt, fresh yeast, butter and water. Lower in the hook attachment and slowly blend for 4 minutes. Don't add any more water at this point. After 4 minutes, turn up the speed and blend for a further 3 minutes. In the final minute, add the raisins and mix for 1 minute more. Switch off the mixer, take out the hook and remove the bowl."
    },
    {
      "headline":"Remove and rest.",
      "description":"Take the dough out of the bowl and mould it into a ball. Sprinkle over some flour and cover with a clean tea towel. Let it rest for a few minutes before cutting."
    },
    {
      "headline":"Cut the dough.",
      "description":"Remove the tea towel and using a large knife, cut the dough in half. Sprinkle flour over one half, knead it a little and cut it into small slices. Take one slice and roll it into a ball. Repeat until all the dough is used making roughly 16 balls."
    },
    {
      "headline":"Prepare for baking.",
      "description":"Line the baking tray with wax paper, sprinkle over some flour and arrange the balls of dough into rows on the baking tray. Make sure there is enough room for expansion between each one. Brush them generously with the beaten egg mixture, sprinkle the sesame seeds and rock salt on top. Cut two diagonal lines in the dough."
    },
    {
      "headline":"Preheat the oven.",
      "description":"Set the oven to 190ºC (375ºF/ gas mark 5)."
    },
    {
      "headline":"Allow the dough to rise.",
      "description":"While the oven is warming up, cover the tray with a clean tea towel and let the buns rise for 1 hour. See tip below on improving flavour."
    },
    {
      "headline":"Bake.",
      "description":"Put the tray in the centre of the oven and bake for 15 minutes."
    },
    {
      "headline":"Remove after 15 minutes.",
      "description":"If you like them browner, brush with beaten egg 5 minutes before removing."
    },
    {
      "headline":"Serve.",
      "description":"You can eat these hot or cold with lashings of butter and jam."
    }
  ],
  "text":" Combine the ingredients. Into the mixing bowl, add the flour, sugar, salt, fresh yeast, butter and water. Lower in the hook attachment and slowly blend for 4 minutes. Don't add any more water at this point. After 4 minutes, turn up the speed and blend for a further 3 minutes. In the final minute, add the raisins and mix for 1 minute more. Switch off the mixer, take out the hook and remove the bowl. Remove and rest. Take the dough out of the bowl and mould it into a ball. Sprinkle over some flour and cover with a clean tea towel. Let it rest for a few minutes before cutting. Cut the dough. Remove the tea towel and using a large knife, cut the dough in half. Sprinkle flour over one half, knead it a little and cut it into small slices. Take one slice and roll it into a ball. Repeat until all the dough is used making roughly 16 balls. Prepare for baking. Line the baking tray with wax paper, sprinkle over some flour and arrange the balls of dough into rows on the baking tray. Make sure there is enough room for expansion between each one. Brush them generously with the beaten egg mixture, sprinkle the sesame seeds and rock salt on top. Cut two diagonal lines in the dough. Preheat the oven. Set the oven to 190ºC (375ºF/ gas mark 5). Allow the dough to rise. While the oven is warming up, cover the tray with a clean tea towel and let the buns rise for 1 hour. See tip below on improving flavour. Bake. Put the tray in the centre of the oven and bake for 15 minutes. Remove after 15 minutes. If you like them browner, brush with beaten egg 5 minutes before removing. Serve. You can eat these hot or cold with lashings of butter and jam.",
  "tyn_model":[
    "flour",
    "oven",
    "tea towel",
    "butter",
    "water",
    "bowl",
    "baking tray",
    "mixing bowl",
    "sugar",
    "salt",
    "fresh yeast",
    "raisins",
    "mixer",
    "large knife",
    "wax paper",
    "sesame seeds",
    "rock salt",
    "tray",
    "beaten egg",
    "jam"
  ],
  "tyn_section":[

  ]
}