{
  "title":"How to Upload an Image to TinyPic.com",
  "url":"https://www.wikihow.com/Upload-an-Image-to-TinyPic.com",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography"
  ],
  "steps":[
    {
      "headline":"Visit the TinyPic homepage.",
      "description":"Open a web browser and go to http://tinypic.com."
    },
    {
      "headline":"Browse your device for the image file.",
      "description":"Click the Choose File button at the top of the upload form."
    },
    {
      "headline":"Tag your image (optional).",
      "description":"This is to link your photo to the website's categories."
    },
    {
      "headline":"Resize your image (optional).",
      "description":""
    },
    {
      "headline":"Submit the image to be uploaded.",
      "description":"Click the big green UPLOAD NOW! button."
    },
    {
      "headline":"Complete the CAPTCHA.",
      "description":"Follow the instructions provided by entering the text shown into the text box right underneath. Press UPLOAD NOW! to submit. Click the arrow button to load new text. You can opt for audio captcha by clicking the sound icon."
    },
    {
      "headline":"Wait to redirected to the image info page where you will see a listing of links and code.",
      "description":"To copy, highlight with mouse and press Ctrl+C or right click and press Copy. To paste, press Ctrl+V or right click and press Paste."
    }
  ],
  "text":" Visit the TinyPic homepage. Open a web browser and go to http://tinypic.com. Browse your device for the image file. Click the Choose File button at the top of the upload form. Tag your image (optional). This is to link your photo to the website's categories. Resize your image (optional).  Submit the image to be uploaded. Click the big green UPLOAD NOW! button. Complete the CAPTCHA. Follow the instructions provided by entering the text shown into the text box right underneath. Press UPLOAD NOW! to submit. Click the arrow button to load new text. You can opt for audio captcha by clicking the sound icon. Wait to redirected to the image info page where you will see a listing of links and code. To copy, highlight with mouse and press Ctrl+C or right click and press Copy. To paste, press Ctrl+V or right click and press Paste.",
  "tyn_model":[

  ],
  "tyn_section":[

  ]
}