{
  "title":"How to Make a Passion Fruit Martini",
  "url":"https://www.wikihow.com/Make-a-Passion-Fruit-Martini",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Alcoholic Drinks",
    "Spirits and Liqueurs",
    "Cocktails",
    "Vodka Based Cocktails"
  ],
  "steps":[
    {
      "headline":"Chill your martini glass.",
      "description":"You can either put a few ice cubes with water or place it in the freezer while you make your drink."
    },
    {
      "headline":"Cut one of the passion fruits in half.",
      "description":"Scrape the insides into the mixing glass."
    },
    {
      "headline":"Measure and pour the vodka, liqueur, lemon juice, passion fruit juice, and syrup into the mixing glass.",
      "description":""
    },
    {
      "headline":"Fill the mixing glass with ice.",
      "description":""
    },
    {
      "headline":"Slap the cocktail shaker on the top of the mixing glass and shake well.",
      "description":""
    },
    {
      "headline":"Gently release the two halves from each other.",
      "description":"Place a strainer on the cocktail glass and strain the contents in the martini glass."
    },
    {
      "headline":"Cut the other passion fruit in half.",
      "description":"Place one half on top of the drink and serve."
    }
  ],
  "text":" Chill your martini glass. You can either put a few ice cubes with water or place it in the freezer while you make your drink. Cut one of the passion fruits in half. Scrape the insides into the mixing glass. Measure and pour the vodka, liqueur, lemon juice, passion fruit juice, and syrup into the mixing glass.  Fill the mixing glass with ice.  Slap the cocktail shaker on the top of the mixing glass and shake well.  Gently release the two halves from each other. Place a strainer on the cocktail glass and strain the contents in the martini glass. Cut the other passion fruit in half. Place one half on top of the drink and serve.",
  "tyn_model":[
    "mixing glass",
    "martini glass",
    "ice cubes",
    "passion fruits",
    "vodka",
    "liqueur",
    "lemon juice",
    "passion fruit juice",
    "syrup",
    "ice",
    "cocktail shaker",
    "strainer",
    "cocktail glass",
    "passion fruit"
  ],
  "tyn_section":[

  ]
}