{
  "title":"How to Ally with the Grox in Spore",
  "url":"https://www.wikihow.com/Ally-with-the-Grox-in-Spore",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "PC Simulation"
  ],
  "steps":[
    {
      "headline":"Go toward the center of the galaxy with a colony Incredi-Pak (if you're a Zealot, the Incredi-Pak is not needed).",
      "description":""
    },
    {
      "headline":"Keep going until you meet the Grox.",
      "description":"They should have a red or orange face, depending on whether you have the Gracious Greeting passive ability."
    },
    {
      "headline":"You'll know you have met the Grox when three things happen:",
      "description":"As mentioned above, they have a bad relation by default. They have a unique empire color. A bunch of ships should come to \"greet\" you with lasers."
    },
    {
      "headline":"Get out and find a good planet near the Grox to use the Incred-Pak.",
      "description":"If you're a Zealot, go to a home system near the Grox and use Fanatical Frenzy."
    },
    {
      "headline":"Start doing missions for the Grox.",
      "description":"If you're a Zealot, you may save, exit, and reload to capture another planet. Repeat this process."
    },
    {
      "headline":"If you're not a Scientist or a Zealot, try to to build up your colonies by placing 200 buildings or conquering 50 systems.",
      "description":"This should unlock the Planet Buster."
    },
    {
      "headline":"Buy four or five Busters and start busting planets near the Grox.",
      "description":"If you're a Scientist or Zealot, go use your superpower near the Grox, and do missions for them."
    },
    {
      "headline":"Once you've used the destructive super weapons and done enough missions, you should be friendly (blue faced) with the Grox.",
      "description":"Now, go over to one of their systems. Notice that they still attack you. Once you look at the communications, you should see this:\nCompleted Missions +50\nBroke the Galactic Code +50\nWe Distrust Strangers -70."
    },
    {
      "headline":"You may also have the Gracious Greeting + 10.",
      "description":"If so, ask for a trade route. If not, bribe them until you get Gifts +10, then ask for a trade route, or vice versa."
    },
    {
      "headline":"Wait.",
      "description":""
    },
    {
      "headline":"Soon the trade route should give you a +30, and now the Grox have a green face.",
      "description":"Now just fly over, open communications, go to diplomacy and ally."
    },
    {
      "headline":"You're done!",
      "description":""
    }
  ],
  "text":" Go toward the center of the galaxy with a colony Incredi-Pak (if you're a Zealot, the Incredi-Pak is not needed).  Keep going until you meet the Grox. They should have a red or orange face, depending on whether you have the Gracious Greeting passive ability. You'll know you have met the Grox when three things happen: As mentioned above, they have a bad relation by default. They have a unique empire color. A bunch of ships should come to \"greet\" you with lasers. Get out and find a good planet near the Grox to use the Incred-Pak. If you're a Zealot, go to a home system near the Grox and use Fanatical Frenzy. Start doing missions for the Grox. If you're a Zealot, you may save, exit, and reload to capture another planet. Repeat this process. If you're not a Scientist or a Zealot, try to to build up your colonies by placing 200 buildings or conquering 50 systems. This should unlock the Planet Buster. Buy four or five Busters and start busting planets near the Grox. If you're a Scientist or Zealot, go use your superpower near the Grox, and do missions for them. Once you've used the destructive super weapons and done enough missions, you should be friendly (blue faced) with the Grox. Now, go over to one of their systems. Notice that they still attack you. Once you look at the communications, you should see this:\nCompleted Missions +50\nBroke the Galactic Code +50\nWe Distrust Strangers -70. You may also have the Gracious Greeting + 10. If so, ask for a trade route. If not, bribe them until you get Gifts +10, then ask for a trade route, or vice versa. Wait.  Soon the trade route should give you a +30, and now the Grox have a green face. Now just fly over, open communications, go to diplomacy and ally. You're done! ",
  "tyn_model":[
    "grox",
    "incredi-pak",
    "lasers",
    "incred-pak",
    "scientist",
    "planet buster"
  ],
  "tyn_section":[

  ]
}