{
  "title":"How to Play and Win at Gunbound",
  "url":"https://www.wikihow.com/Play-and-Win-at-Gunbound",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games"
  ],
  "steps":[
    {
      "headline":"Don't be intimidated.",
      "description":"Just ignore people who say you are using a \"noob strategy\" such as Shotgunning and dt noob (Covered later)."
    },
    {
      "headline":"Listen to the advice of more experienced teammates.",
      "description":"For example, if someone on your team tells you to drop into a hole (called \"hiding\") in order to avoid being killed, please do so for the good of the team."
    },
    {
      "headline":"If you're new, pick a well rounded mobile (Mage, Ice and Armor in particular) and play with it all the time.",
      "description":"Weak mobiles (such as JD, Lightning, BF) are not necessarily weak, but require the user to have a good amount of accuracy and strategy. Advanced bots (Nak, Trico, Boomer) should only be used if you have in depth knowledge of the game. For example, using Trico requires the user to keep the shot in the air a certain amount of time to hit properly. Yes, it is possible, and there are many players that can hit perfectly 80%+ of the time."
    },
    {
      "headline":"When picking items, a safe bet is duals (item that looks like two red bullets) or dual+ (one red and one yellow bullet).",
      "description":"Most rooms have only dual or dual+ turned on. If other items are on, heal is probably best for beginners (bandaid and medkit items)."
    },
    {
      "headline":"Each mobile has a certain weight to it, that's why it's advised to practice with a certain mobile.",
      "description":"If you use random (or pick different mobiles each game) your \"feel\" (ability to guess how much power to use) will be messed up."
    },
    {
      "headline":"Think about what mobile your enemy is using.",
      "description":"Some bots cannot hit easily at long range, for example (like bigfoot) so teleporting away from those bots might help. Others have trouble hitting bots in a deep pit (sate). Most of the bots have some weakness. Listen to your teammates if they tell you to move."
    },
    {
      "headline":"If you get hit, it can help to move after each shot to force the enemy to adjust his shot.",
      "description":"This simple tactic can cause a lot of misses and give you the chance to live longer. Just don't move to a place where you can't easily shoot, and don't bother when they're so close they can't miss."
    },
    {
      "headline":"Avoid tough rooms until you get better.",
      "description":"Usually (not always) players with high ranks will be good. Avoid rooms full of medal, phoenix, knight and dragon rank players. Also watch out for rooms where players intentionally kick anyone they see as a threat, or change the settings to favor their best bots. You can't learn much going against these players, and you will frustrate your teammate(s) if they were expecting advanced players in their room and got a beginner instead."
    },
    {
      "headline":"There are servers for beginners, use them and everyone will be friendlier and you won't get killed so easily, so you have more chances to shoot and learn.",
      "description":"If you feel that the best way to get better is to play vs. good players, go ahead but don't complain about unfair teams or dying before you get a shot... also, remember that not everyone with a wand or dragon rank is automatically a god, so talk to them normally and they'll probably be willing to help you. Whine, complain, throw insults, comment on their missed shots, or accuse them of cheating and you won't get any help and you'll probably get kicked."
    },
    {
      "headline":"Understand Delay.",
      "description":"Delay is the numbers in the bottom left of your screen. This is what makes opponents sometimes shoot twice after your shot. It's wise to read a guide on Delay, as it introduces a whole level of strategy to the game. A guide can be found in the external links."
    },
    {
      "headline":"Understand wind.",
      "description":"When wind is pointing against you, or down+against you, it holds your shot back, sometimes by a lot. So you need to add power. Also, using a lower angle can help your shot cut through this kind of wind and make it go further, so try lowering your angle if adding power isn't helping much. Wind pointing against and up (up+left if you're shooting right) also holds the shot back, but not as much. To adjust for wind blowing down, just add power. If wind's going up or up+forward, reduce power so it doesn't fly too far. Lastly, wind pointing down+forward shoves the shot forward a bit, but not much. Just reduce power a bit. Depending on how \"down\" this wind is, you might not need to adjust power at all, or you may even need to add a bit."
    },
    {
      "headline":"A dual often gives the enemy 2 turns in a row against you, so you only want to use it when it's a sure hit.",
      "description":"It's best to use to kill an enemy with less than half their life left. Definitely avoid using it when you're unsure if it will hit, like when shooting through a tornado. When you have a sure shot on the enemy it's usually ok to use dual+ or dual. If you're right next to them, you can try it without a test shot, but from further away, try shot 1 or 2 first, and only use the item once you are sure it will hit."
    },
    {
      "headline":"Your SS can be almost as strong as dual or dual+, but it's usually trickier to use, so again don't use it unless you're sure it can hit for nice damage.",
      "description":"Many SS shots need a \"trick\" to get good damage so it's not enough just to hit the enemy. For example armor's SS must be in the air a little while before it can do good damage, and mage's works best vs shielded bots with blue lifebars. In fact almost none of the bots have a simple SS that requires no thinking."
    },
    {
      "headline":"Shotgun (SG) if needed.",
      "description":"A good SG will guarantee maximum damage at close range. Just don't dual unless you're positive you'll hit completely. Sometimes the first shot will drop the opponent and the second shot will fly right over their head!"
    },
    {
      "headline":"Try to take the easiest shot possible, usually the closest enemy.",
      "description":"But also play smart. If an enemy is almost dead, and you can kill him, it might prevent that enemy from getting one more turn and doing huge damage to someone before he dies. Don't worry about taking someone else's kills, and don't worry about someone else killing your guy either. ANY kill leads to a win which leads to GP and gold. Failing to kill can lead to a loss, which leads to sad feelings :("
    },
    {
      "headline":"Keep your cool, take your time and you are sure to win.",
      "description":""
    },
    {
      "headline":"If you plan on becoming REALLY good, you can learn about formulas.",
      "description":"Formulas are just a mathematical approach to shooting (as opposed to using \"feel\"). CreeDo's website has many guides on formula usage as well as in depth tips for each mobile."
    }
  ],
  "text":" Don't be intimidated. Just ignore people who say you are using a \"noob strategy\" such as Shotgunning and dt noob (Covered later). Listen to the advice of more experienced teammates. For example, if someone on your team tells you to drop into a hole (called \"hiding\") in order to avoid being killed, please do so for the good of the team. If you're new, pick a well rounded mobile (Mage, Ice and Armor in particular) and play with it all the time. Weak mobiles (such as JD, Lightning, BF) are not necessarily weak, but require the user to have a good amount of accuracy and strategy. Advanced bots (Nak, Trico, Boomer) should only be used if you have in depth knowledge of the game. For example, using Trico requires the user to keep the shot in the air a certain amount of time to hit properly. Yes, it is possible, and there are many players that can hit perfectly 80%+ of the time. When picking items, a safe bet is duals (item that looks like two red bullets) or dual+ (one red and one yellow bullet). Most rooms have only dual or dual+ turned on. If other items are on, heal is probably best for beginners (bandaid and medkit items). Each mobile has a certain weight to it, that's why it's advised to practice with a certain mobile. If you use random (or pick different mobiles each game) your \"feel\" (ability to guess how much power to use) will be messed up. Think about what mobile your enemy is using. Some bots cannot hit easily at long range, for example (like bigfoot) so teleporting away from those bots might help. Others have trouble hitting bots in a deep pit (sate). Most of the bots have some weakness. Listen to your teammates if they tell you to move. If you get hit, it can help to move after each shot to force the enemy to adjust his shot. This simple tactic can cause a lot of misses and give you the chance to live longer. Just don't move to a place where you can't easily shoot, and don't bother when they're so close they can't miss. Avoid tough rooms until you get better. Usually (not always) players with high ranks will be good. Avoid rooms full of medal, phoenix, knight and dragon rank players. Also watch out for rooms where players intentionally kick anyone they see as a threat, or change the settings to favor their best bots. You can't learn much going against these players, and you will frustrate your teammate(s) if they were expecting advanced players in their room and got a beginner instead. There are servers for beginners, use them and everyone will be friendlier and you won't get killed so easily, so you have more chances to shoot and learn. If you feel that the best way to get better is to play vs. good players, go ahead but don't complain about unfair teams or dying before you get a shot... also, remember that not everyone with a wand or dragon rank is automatically a god, so talk to them normally and they'll probably be willing to help you. Whine, complain, throw insults, comment on their missed shots, or accuse them of cheating and you won't get any help and you'll probably get kicked. Understand Delay. Delay is the numbers in the bottom left of your screen. This is what makes opponents sometimes shoot twice after your shot. It's wise to read a guide on Delay, as it introduces a whole level of strategy to the game. A guide can be found in the external links. Understand wind. When wind is pointing against you, or down+against you, it holds your shot back, sometimes by a lot. So you need to add power. Also, using a lower angle can help your shot cut through this kind of wind and make it go further, so try lowering your angle if adding power isn't helping much. Wind pointing against and up (up+left if you're shooting right) also holds the shot back, but not as much. To adjust for wind blowing down, just add power. If wind's going up or up+forward, reduce power so it doesn't fly too far. Lastly, wind pointing down+forward shoves the shot forward a bit, but not much. Just reduce power a bit. Depending on how \"down\" this wind is, you might not need to adjust power at all, or you may even need to add a bit. A dual often gives the enemy 2 turns in a row against you, so you only want to use it when it's a sure hit. It's best to use to kill an enemy with less than half their life left. Definitely avoid using it when you're unsure if it will hit, like when shooting through a tornado. When you have a sure shot on the enemy it's usually ok to use dual+ or dual. If you're right next to them, you can try it without a test shot, but from further away, try shot 1 or 2 first, and only use the item once you are sure it will hit. Your SS can be almost as strong as dual or dual+, but it's usually trickier to use, so again don't use it unless you're sure it can hit for nice damage. Many SS shots need a \"trick\" to get good damage so it's not enough just to hit the enemy. For example armor's SS must be in the air a little while before it can do good damage, and mage's works best vs shielded bots with blue lifebars. In fact almost none of the bots have a simple SS that requires no thinking. Shotgun (SG) if needed. A good SG will guarantee maximum damage at close range. Just don't dual unless you're positive you'll hit completely. Sometimes the first shot will drop the opponent and the second shot will fly right over their head! Try to take the easiest shot possible, usually the closest enemy. But also play smart. If an enemy is almost dead, and you can kill him, it might prevent that enemy from getting one more turn and doing huge damage to someone before he dies. Don't worry about taking someone else's kills, and don't worry about someone else killing your guy either. ANY kill leads to a win which leads to GP and gold. Failing to kill can lead to a loss, which leads to sad feelings :( Keep your cool, take your time and you are sure to win.  If you plan on becoming REALLY good, you can learn about formulas. Formulas are just a mathematical approach to shooting (as opposed to using \"feel\"). CreeDo's website has many guides on formula usage as well as in depth tips for each mobile.",
  "tyn_model":[
    "mobile",
    "wind",
    "mobiles",
    "trico",
    "formulas",
    "armor",
    "lightning",
    "bots",
    "heal",
    "servers",
    "dual",
    "ss",
    "shotgun",
    "formula"
  ],
  "tyn_section":[

  ]
}