{
  "title":"How to Make a French Japanese Custard Fusion Recipe",
  "url":"https://www.wikihow.com/Make-a-French-Japanese-Custard-Fusion-Recipe",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Japanese Dishes"
  ],
  "steps":[
    {
      "headline":"Devein the prawn or shrimp, cut into small dice.",
      "description":""
    },
    {
      "headline":"Combine 1 cup Kikoman soy sauce and 3 tablespoon sake in medium bowl, add chicken, mix well, cover; stand for 10 minutes.",
      "description":"You can add dashi to the marinate."
    },
    {
      "headline":"Then stir fry the chicken with spices.",
      "description":""
    },
    {
      "headline":"Blanch the shrimp after you have seared all the spices for a few seconds.",
      "description":""
    },
    {
      "headline":"Combine 30 grams dashi, remaining (390 g) banana puree( created by cooking chicken  and blending the banana with the soy sauce until it is pureed) and 1 teaspoon extra sake in medium bowl;add the egg mixture and stir gently.",
      "description":"( egg mixture is 1 can (390g) condensed milk and 10 egg yolks )"
    },
    {
      "headline":"Coat the inside of the ramekin with butter.",
      "description":""
    },
    {
      "headline":"Divide chicken, prawns and raisins between four ¾-cup (180ml) ; combined mixture among cups, leaving 1cm space between egg mixture and top of cup.",
      "description":"Cover cups with aluminum wrap. Fill the moulds to about 1 to  1 1/4 inch thick."
    },
    {
      "headline":"Mix well the 195 grams banana puree 390 grams condensed milk, 390 grams egg mixture, and  5 tablespoons of pure lemon juice and 3 tablespoons vanilla by hand or blender.",
      "description":""
    },
    {
      "headline":"Add 3 tablespoons of 100% pure all natural vanilla extract.",
      "description":""
    },
    {
      "headline":"Place cups inside a large steamer, allowing space between cups for steam to circulate.",
      "description":"If you don't have a steamer then you can place a milk bottle rack over a wok or large saucepan of simmering water, reduce heat; steam, covered with aluminum foil, about 20 - 45 minutes or until custard sets."
    },
    {
      "headline":"Remove aluminum wrap then place hot cups on saucers or small plates; sprinkle on top with melted milk chocolate or a small chunk of pineapple and strawberry for garnish.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Devein the prawn or shrimp, cut into small dice.  Combine 1 cup Kikoman soy sauce and 3 tablespoon sake in medium bowl, add chicken, mix well, cover; stand for 10 minutes. You can add dashi to the marinate. Then stir fry the chicken with spices.  Blanch the shrimp after you have seared all the spices for a few seconds.  Combine 30 grams dashi, remaining (390 g) banana puree( created by cooking chicken  and blending the banana with the soy sauce until it is pureed) and 1 teaspoon extra sake in medium bowl;add the egg mixture and stir gently. ( egg mixture is 1 can (390g) condensed milk and 10 egg yolks ) Coat the inside of the ramekin with butter.  Divide chicken, prawns and raisins between four ¾-cup (180ml) ; combined mixture among cups, leaving 1cm space between egg mixture and top of cup. Cover cups with aluminum wrap. Fill the moulds to about 1 to  1 1/4 inch thick. Mix well the 195 grams banana puree 390 grams condensed milk, 390 grams egg mixture, and  5 tablespoons of pure lemon juice and 3 tablespoons vanilla by hand or blender.  Add 3 tablespoons of 100% pure all natural vanilla extract.  Place cups inside a large steamer, allowing space between cups for steam to circulate. If you don't have a steamer then you can place a milk bottle rack over a wok or large saucepan of simmering water, reduce heat; steam, covered with aluminum foil, about 20 - 45 minutes or until custard sets. Remove aluminum wrap then place hot cups on saucers or small plates; sprinkle on top with melted milk chocolate or a small chunk of pineapple and strawberry for garnish.  Finished. ",
  "tyn_model":[
    "chicken",
    "shrimp",
    "sake",
    "dashi",
    "banana",
    "condensed milk",
    "aluminum wrap",
    "kikoman soy sauce",
    "spices",
    "soy sauce",
    "medium bowl;add",
    "ramekin",
    "butter",
    "raisins",
    "banana puree",
    "pure lemon juice",
    "vanilla",
    "blender",
    "100% pure all natural vanilla",
    "large steamer",
    "steamer",
    "milk bottle rack",
    "wok",
    "water",
    "aluminum foil",
    "saucers",
    "small plates",
    "milk chocolate",
    "pineapple",
    "strawberry"
  ],
  "tyn_section":[

  ]
}