{
  "title":"How to Make Brownie Ice Cream Cupcakes",
  "url":"https://www.wikihow.com/Make-Brownie-Ice-Cream-Cupcakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Cupcakes"
  ],
  "steps":[
    {
      "headline":"Preheat oven according to brown mix package directions.",
      "description":"Also, make sure you follow heating instructions for cupcakes or a small pan so they don’t burn."
    },
    {
      "headline":"Prepare brownie mix according to package directions.",
      "description":"Consider spraying the muffin tin with non-stick cooking spray while you mix brownie batter."
    },
    {
      "headline":"Pour brownie batter into muffin tin mix, filling 2/3 to ¾ of the way.",
      "description":"Make sure you will have enough room to create an indent in your brownies without having the batter spill over the top of each cup."
    },
    {
      "headline":"Spray the bottom of the second muffin tin with non stick spray and then gently press the bottom of the tray into your muffin tin cups.",
      "description":""
    },
    {
      "headline":"Bake with tin over the cups to hold in place for ¾ of the directed time (according to brown recipe)",
      "description":"Remove top tin and bake the brown muffins to completion. Remove baked brownies from oven and allow them to cool completely."
    },
    {
      "headline":"Add one large scoop of ice cream to each brownie cup.",
      "description":"Make sure the scoop is small enough to fit inside the cup. Top with your favorite toppings such as sprinkles and hot fudge."
    }
  ],
  "text":" Preheat oven according to brown mix package directions. Also, make sure you follow heating instructions for cupcakes or a small pan so they don’t burn. Prepare brownie mix according to package directions. Consider spraying the muffin tin with non-stick cooking spray while you mix brownie batter. Pour brownie batter into muffin tin mix, filling 2/3 to ¾ of the way. Make sure you will have enough room to create an indent in your brownies without having the batter spill over the top of each cup. Spray the bottom of the second muffin tin with non stick spray and then gently press the bottom of the tray into your muffin tin cups.  Bake with tin over the cups to hold in place for ¾ of the directed time (according to brown recipe) Remove top tin and bake the brown muffins to completion. Remove baked brownies from oven and allow them to cool completely. Add one large scoop of ice cream to each brownie cup. Make sure the scoop is small enough to fit inside the cup. Top with your favorite toppings such as sprinkles and hot fudge.",
  "tyn_model":[
    "muffin tin",
    "oven",
    "brownie batter",
    "brown mix",
    "brownie mix",
    "non-stick cooking spray",
    "non stick spray",
    "tray",
    "ice cream",
    "hot fudge"
  ],
  "tyn_section":[

  ]
}