{
  "title":"How to Get Rid of a Wild Rose Bush",
  "url":"https://www.wikihow.com/Get-Rid-of-a-Wild-Rose-Bush",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Pests and Weeds"
  ],
  "methods":[
    {
      "name":"Using Weed Killer",
      "steps":[
        {
          "headline":"Choose an appropriate weed killer.",
          "description":"Chemical weed killers containing glyphosate are an easy way to kill unwanted Wild Rose,  but you do need to be very careful not to let it impact the plants that you don’t want to remove. Some chemical weed killers will linger in the soil so chose your weed killer carefully if you want to replant in the area soon after. Also make sure you choose a weed killer effective for use on woody plants."
        },
        {
          "headline":"Get rid of Wild Rose bushes in late summer, if possible.",
          "description":"Late summer is the best time to apply weed killer to Wild Rose bushes. It’s always best to remove the bushes before the hips set (in late summer or fall). Choose a still day so the wind doesn’t spread your chemicals. Also try to pick a dry day with no rain forecast so rain doesn’t wash the weed killer away. It’s recommended that you avoid digging up plants in the winter as the ground can be harder to work with."
        },
        {
          "headline":"Follow the specific instructions provided with your chosen weed killer.",
          "description":"It’s best to read the instructions for whatever brand of weed killer you buy in order to find out the recommended method. However, in most cases you can use the following approach when using a weed killer:\nProtect other plants and the ground as required, perhaps using plastic sheeting. Wear protective clothing and gloves and consider using eyewear. Exclude children and animals from the area\nSpray the bush with the chemicals, making sure you saturate the base of the bush and the stem. Wait a few weeks for it to take effect. Re-apply if necessary."
        },
        {
          "headline":"Use a stump killer if you need to remove Wild Rose in winter.",
          "description":"Some chemical weed killers are marketed as stump killers. These work best over the colder months when the sap isn’t rising (usually November – March). To use a stump killer, prune off the branches and then saw the main stem of the bush down to a few inches from the ground. Apply the stump killer to the fresh cut wood. This will only work on living wood so if the bush is already dead or the stem you are applying it to is brown and dried out, it won’t have the effect of killing the rest of the bush. You may need to drill holes into the stem to get the chemicals to penetrate if it doesn’t seem to work the first time."
        },
        {
          "headline":"Wait several weeks before digging up the dead rose bush.",
          "description":"Chemical weed killers should kill a plant right down to the roots so it cannot regrow even if the roots are left in the soil. However, you should avoid removing the bush for several weeks to ensure the chemicals have spread right through the plant’s root structure. You will probably want to remove the dead plant after the weed killer has done its job. This is to prevent the dead stump from becoming an eyesore or trip hazard. As the dead stump won’t break down very quickly in the soil, you’ll want to remove the bulk of it in before you can replant the area. A mattock will help you to remove the root crown and stump from the ground a few weeks after treating with the weed killer."
        },
        {
          "headline":"Avoid using household chemicals to kill the rose bush.",
          "description":"Some people will advise you to use household chemicals such as salt, vinegar or bleach to kill roses. However, this is not recommended as these chemicals are likely to contaminate the soil, making it difficult to cultivate the area later. Instead you should use branded chemicals intended for garden use such as Roundup."
        }
      ]
    },
    {
      "name":"Digging Up the Wild Rose Bush",
      "steps":[
        {
          "headline":"Start by watering the plant well the day before.",
          "description":"This will hopefully help the root mass to stay fairly intact when you extract it. If any parts of root are left in the ground they may revive and grow a new plant, which you obviously want to avoid!"
        },
        {
          "headline":"Prune your wild rose back to just a few inches above the ground.",
          "description":"It’s a good idea to protect your arms when you do this – use heavy-duty gardening gloves and thick sleeves."
        },
        {
          "headline":"Carefully remove the entire root ball from the soil.",
          "description":"When you come to dig, expect the root ball to mostly extend to about 6 inches (15.2 cm) out from the main stem of the rose. Aim to dig in this area using a spade. Make every effort to avoid leaving any root parts behind as these may re-sprout. It may make sense to remove some of the surrounding soil just to be sure."
        },
        {
          "headline":"Burn or dispose of the rose bush, rather than composting it.",
          "description":"It’s best to burn the rose bush once extracted, or throw it out with the household trash. Avoid composting it. Any soil should also be removed from the premises so it does not contaminate a new area with sprouting rose roots. If you are leaving the bush on a bonfire pile for later disposal or burning, make sure it isn't in contact with the ground, as it may re-root this way if left for long enough."
        },
        {
          "headline":"Watch out for re-growth.",
          "description":"After you are finished extracting the rose bushes, keep an eye on the area for a few months just to check nothing springs up in the area. This may indicate you have left roots behind in the ground that need to be removed."
        },
        {
          "headline":"Consider more extreme removal methods if the rose bush continues to reappear.",
          "description":"If you have a severe problem with new roses appearing from root runners and root sections left in the ground, consider using a chemical weed killer. If you prefer to avoid this, you could try excluding the light from the area. Weed control fabric can be purchased which allows water to penetrate but not light. Cover the area with the fabric and weigh it down with large stones. You’ll need to leave it for several months before the rose bushes die off."
        }
      ]
    }
  ],
  "text":" Using Weed Killer Choose an appropriate weed killer. Chemical weed killers containing glyphosate are an easy way to kill unwanted Wild Rose,  but you do need to be very careful not to let it impact the plants that you don’t want to remove. Some chemical weed killers will linger in the soil so chose your weed killer carefully if you want to replant in the area soon after. Also make sure you choose a weed killer effective for use on woody plants. Get rid of Wild Rose bushes in late summer, if possible. Late summer is the best time to apply weed killer to Wild Rose bushes. It’s always best to remove the bushes before the hips set (in late summer or fall). Choose a still day so the wind doesn’t spread your chemicals. Also try to pick a dry day with no rain forecast so rain doesn’t wash the weed killer away. It’s recommended that you avoid digging up plants in the winter as the ground can be harder to work with. Follow the specific instructions provided with your chosen weed killer. It’s best to read the instructions for whatever brand of weed killer you buy in order to find out the recommended method. However, in most cases you can use the following approach when using a weed killer:\nProtect other plants and the ground as required, perhaps using plastic sheeting. Wear protective clothing and gloves and consider using eyewear. Exclude children and animals from the area\nSpray the bush with the chemicals, making sure you saturate the base of the bush and the stem. Wait a few weeks for it to take effect. Re-apply if necessary. Use a stump killer if you need to remove Wild Rose in winter. Some chemical weed killers are marketed as stump killers. These work best over the colder months when the sap isn’t rising (usually November – March). To use a stump killer, prune off the branches and then saw the main stem of the bush down to a few inches from the ground. Apply the stump killer to the fresh cut wood. This will only work on living wood so if the bush is already dead or the stem you are applying it to is brown and dried out, it won’t have the effect of killing the rest of the bush. You may need to drill holes into the stem to get the chemicals to penetrate if it doesn’t seem to work the first time. Wait several weeks before digging up the dead rose bush. Chemical weed killers should kill a plant right down to the roots so it cannot regrow even if the roots are left in the soil. However, you should avoid removing the bush for several weeks to ensure the chemicals have spread right through the plant’s root structure. You will probably want to remove the dead plant after the weed killer has done its job. This is to prevent the dead stump from becoming an eyesore or trip hazard. As the dead stump won’t break down very quickly in the soil, you’ll want to remove the bulk of it in before you can replant the area. A mattock will help you to remove the root crown and stump from the ground a few weeks after treating with the weed killer. Avoid using household chemicals to kill the rose bush. Some people will advise you to use household chemicals such as salt, vinegar or bleach to kill roses. However, this is not recommended as these chemicals are likely to contaminate the soil, making it difficult to cultivate the area later. Instead you should use branded chemicals intended for garden use such as Roundup. Digging Up the Wild Rose Bush Start by watering the plant well the day before. This will hopefully help the root mass to stay fairly intact when you extract it. If any parts of root are left in the ground they may revive and grow a new plant, which you obviously want to avoid! Prune your wild rose back to just a few inches above the ground. It’s a good idea to protect your arms when you do this – use heavy-duty gardening gloves and thick sleeves. Carefully remove the entire root ball from the soil. When you come to dig, expect the root ball to mostly extend to about 6 inches (15.2 cm) out from the main stem of the rose. Aim to dig in this area using a spade. Make every effort to avoid leaving any root parts behind as these may re-sprout. It may make sense to remove some of the surrounding soil just to be sure. Burn or dispose of the rose bush, rather than composting it. It’s best to burn the rose bush once extracted, or throw it out with the household trash. Avoid composting it. Any soil should also be removed from the premises so it does not contaminate a new area with sprouting rose roots. If you are leaving the bush on a bonfire pile for later disposal or burning, make sure it isn't in contact with the ground, as it may re-root this way if left for long enough. Watch out for re-growth. After you are finished extracting the rose bushes, keep an eye on the area for a few months just to check nothing springs up in the area. This may indicate you have left roots behind in the ground that need to be removed. Consider more extreme removal methods if the rose bush continues to reappear. If you have a severe problem with new roses appearing from root runners and root sections left in the ground, consider using a chemical weed killer. If you prefer to avoid this, you could try excluding the light from the area. Weed control fabric can be purchased which allows water to penetrate but not light. Cover the area with the fabric and weigh it down with large stones. You’ll need to leave it for several months before the rose bushes die off.",
  "tyn_model":[
    "weed killer",
    "weed killers",
    "stump killer",
    "wild rose",
    "stump killers",
    "– march",
    "chemical weed killers",
    "salt",
    "vinegar",
    "bleach",
    "roses",
    "roundup",
    "wild rose bush",
    "– use",
    "spade",
    "bonfire",
    "weed control fabric",
    "fabric"
  ],
  "tyn_section":[

  ]
}