{
  "title":"How to Galvanize Steel",
  "url":"https://www.wikihow.com/Galvanize-Steel",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"Hot-Dip Galvanizing",
      "steps":[
        {
          "headline":"Clean away the surface contaminants.",
          "description":"Before any other steps can be taken, the steel surface must be cleaned thoroughly. How this is done depends on what has to be cleaned away. Dirt, grease, oil, or paint markings require the use of a mild acid, a hot alkali, or a biological cleaning agent. Asphalt, epoxy, vinyl, or the slag from welding need to be cleaned by sandblasting or with other abrasives."
        },
        {
          "headline":"Pickle away the rust.",
          "description":"Pickling is done with hydrochloric acid or hot sulfuric acid; it removes both rust and mill scale. In some cases, abrasive cleaning may be enough to remove the rust, or it may be necessary to use both a pickling solution and abrasives. In some cases, larger abrasives such as buckshot are air-blasted onto the steel."
        },
        {
          "headline":"Put the metal in flux.",
          "description":"In this case, “flux” is a solution of zinc ammonium chloride that removes any remaining rust and scale and protects the steel from rusting until it is actually galvanized."
        },
        {
          "headline":"Immerse the steel in molten zinc.",
          "description":"The bath of molten zinc should be at least 98 percent zinc and maintained at a temperature range of 815 to 850 degrees F (435 to 455 degrees C). While the steel is immersed in the zinc bath, its iron reacts with the zinc to form a series of alloy layers and an outer layer of pure zinc."
        },
        {
          "headline":"Take the galvanized steel out of the zinc bath slowly.",
          "description":"Most of the excess zinc will drain off; what doesn’t drain off can be vibrated off or spun off in a centrifuge."
        },
        {
          "headline":"Cool the galvanized steel.",
          "description":"Cooling the metal stops the galvanization reaction, which continues as long as the steel is the same temperature it was while immersed in the zinc bath. Cooling can be done in one of several ways:\nImmerse the steel in a passivation solution such as potassium hydroxide. Immerse the steel in water. Let the steel cool in the open air."
        },
        {
          "headline":"Inspect the galvanized steel.",
          "description":"Once the galvanized steel is cooled, check it to make sure the zinc coating looks good, sticks to the steel, and is thick enough. There are a number of tests that can be performed to ensure the galvanization was successful. Standards for hot-dip galvanizing and inspecting its results have been established by such organizations as the American Society for Testing and Materials (now called ASTM International), the International Standards Organization (ISO), the Canadian Standards Association (CSA), and the American Association of State Highway and Transportation Officials (AASHTO). :"
        }
      ]
    },
    {
      "name":"Electrogalvanizing",
      "steps":[
        {
          "headline":"Prepare the steel as for hot-dip galvanizing.",
          "description":"The steel must be cleaned and de-rusted before the electrogalvanization can occur."
        },
        {
          "headline":"Prepare a zinc electrolyte solution.",
          "description":"Either zinc sulfate or zinc cyanide is normally used for the electrolyte."
        },
        {
          "headline":"Immerse the steel in the electrolyte.",
          "description":"The solution will react with the steel to cause the zinc to precipitate onto the steel, coating it. The longer the steel is left in the electrolyte, the thicker the coating that will be produced. While this method offers greater control over how thick the zinc coating is than does hot-dip galvanizing, it usually does not allow for layers to become as thick."
        }
      ]
    },
    {
      "name":"Sherardizing",
      "steps":[
        {
          "headline":"Prepare the steel as with the other galvanization methods.",
          "description":"Clean away the dirt with acid or sandblasting as necessary and pickle away the rust."
        },
        {
          "headline":"Place the steel in an airless enclosure.",
          "description":""
        },
        {
          "headline":"Surround the steel with powdered zinc.",
          "description":""
        },
        {
          "headline":"Heat the steel.",
          "description":"This melts the powdered zinc into a liquid that, when cooled, leaving a thin alloy coating. Sherardizing is best used for shaped steel pieces, as the galvanic coating will follow the configurations of the steel underneath. It is best used with fairly small metal objects."
        }
      ]
    },
    {
      "name":"Metallic Spraying",
      "steps":[
        {
          "headline":"Prepare the steel as with the other methods.",
          "description":"Clean off all the dirt and remove the rust so it’s ready to be sprayed."
        },
        {
          "headline":"Spray on a fine molten zinc coating.",
          "description":""
        },
        {
          "headline":"Heat the coated steel to ensure proper bonding.",
          "description":"Galvanic coatings produced with this method are less brittle and less prone to peeling and flaking, but provide less protection from rusting for the steel underneath."
        }
      ]
    }
  ],
  "text":" Hot-Dip Galvanizing Clean away the surface contaminants. Before any other steps can be taken, the steel surface must be cleaned thoroughly. How this is done depends on what has to be cleaned away. Dirt, grease, oil, or paint markings require the use of a mild acid, a hot alkali, or a biological cleaning agent. Asphalt, epoxy, vinyl, or the slag from welding need to be cleaned by sandblasting or with other abrasives. Pickle away the rust. Pickling is done with hydrochloric acid or hot sulfuric acid; it removes both rust and mill scale. In some cases, abrasive cleaning may be enough to remove the rust, or it may be necessary to use both a pickling solution and abrasives. In some cases, larger abrasives such as buckshot are air-blasted onto the steel. Put the metal in flux. In this case, “flux” is a solution of zinc ammonium chloride that removes any remaining rust and scale and protects the steel from rusting until it is actually galvanized. Immerse the steel in molten zinc. The bath of molten zinc should be at least 98 percent zinc and maintained at a temperature range of 815 to 850 degrees F (435 to 455 degrees C). While the steel is immersed in the zinc bath, its iron reacts with the zinc to form a series of alloy layers and an outer layer of pure zinc. Take the galvanized steel out of the zinc bath slowly. Most of the excess zinc will drain off; what doesn’t drain off can be vibrated off or spun off in a centrifuge. Cool the galvanized steel. Cooling the metal stops the galvanization reaction, which continues as long as the steel is the same temperature it was while immersed in the zinc bath. Cooling can be done in one of several ways:\nImmerse the steel in a passivation solution such as potassium hydroxide. Immerse the steel in water. Let the steel cool in the open air. Inspect the galvanized steel. Once the galvanized steel is cooled, check it to make sure the zinc coating looks good, sticks to the steel, and is thick enough. There are a number of tests that can be performed to ensure the galvanization was successful. Standards for hot-dip galvanizing and inspecting its results have been established by such organizations as the American Society for Testing and Materials (now called ASTM International), the International Standards Organization (ISO), the Canadian Standards Association (CSA), and the American Association of State Highway and Transportation Officials (AASHTO). : Electrogalvanizing Prepare the steel as for hot-dip galvanizing. The steel must be cleaned and de-rusted before the electrogalvanization can occur. Prepare a zinc electrolyte solution. Either zinc sulfate or zinc cyanide is normally used for the electrolyte. Immerse the steel in the electrolyte. The solution will react with the steel to cause the zinc to precipitate onto the steel, coating it. The longer the steel is left in the electrolyte, the thicker the coating that will be produced. While this method offers greater control over how thick the zinc coating is than does hot-dip galvanizing, it usually does not allow for layers to become as thick. Sherardizing Prepare the steel as with the other galvanization methods. Clean away the dirt with acid or sandblasting as necessary and pickle away the rust. Place the steel in an airless enclosure.  Surround the steel with powdered zinc.  Heat the steel. This melts the powdered zinc into a liquid that, when cooled, leaving a thin alloy coating. Sherardizing is best used for shaped steel pieces, as the galvanic coating will follow the configurations of the steel underneath. It is best used with fairly small metal objects. Metallic Spraying Prepare the steel as with the other methods. Clean off all the dirt and remove the rust so it’s ready to be sprayed. Spray on a fine molten zinc coating.  Heat the coated steel to ensure proper bonding. Galvanic coatings produced with this method are less brittle and less prone to peeling and flaking, but provide less protection from rusting for the steel underneath.",
  "tyn_model":[
    "zinc",
    "zinc bath",
    "hot-dip galvanizing",
    "sherardizing",
    "mild acid",
    "biological cleaning agent",
    "pickle",
    "hydrochloric acid",
    "hot sulfuric acid",
    "pickling solution",
    "“flux",
    "” is",
    "zinc ammonium chloride",
    "steel",
    "iron",
    "galvanized steel",
    "centrifuge",
    "potassium hydroxide",
    "water",
    "zinc electrolyte solution",
    "zinc sulfate",
    "zinc cyanide",
    "metallic spraying",
    "molten zinc",
    "galvanic"
  ],
  "tyn_section":[

  ]
}