{
  "title":"How to Clean Your Rusty Garden Tools",
  "url":"https://www.wikihow.com/Clean-Your-Rusty-Garden-Tools",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening"
  ],
  "parts":[
    {
      "name":"Cleaning the Tools",
      "steps":[
        {
          "headline":"Clean your garden tools to prevent the spread of disease.",
          "description":"Cleaning your garden tools helps to prevent the spread of infection through the garden from one diseased plant to another. It also helps to keep them rust-free, as clean tools tend to be exposed to less moisture. It may seem fussy, but wiping your pruning blade with a full-strength household cleaner (such as Pine-Sol or Lysol) between cutting each piece of plant matter will help  to prevent the spread of infection. It’s especially important to clean your tools if they have been in contact with setting agents such as concrete that will dull the edge of spades and blades if left to harden."
        },
        {
          "headline":"Clean your garden tools to keep them sharp.",
          "description":"Keeping garden tools sharp will make them safer easier to use. Although it seems counterintuitive, a sharper blade can be safer as it requires less force and is less likely to slip. Additionally, when cutting through the cells on your plant with something like a pair of secateurs, a sharp blade will cause less cell damage and won’t crush as many cells as a blunt blade. This will help the plant heal faster, which lessens the risk of infection setting in from fungi or the weather."
        },
        {
          "headline":"Clean any dirt or debris from the tool.",
          "description":"First you need to remove any dirt or debris from the tool, especially the blade area or any fixings. Water and a fairly stiff brush should do fine for this. Don’t delay if you've been using the tool for any setting or drying agents such as cement, sealant or paint. If your tool has any setting agents on it then it will need to be cleaned quickly before these have a chance to dry. After using the brush to get the dirt off, rinse in running water and leave to dry. This can take as long as overnight if the tool has complicated surfaces which retain moisture. Afterwards you can wipe a light coating of mineral or motor oil over your tools."
        },
        {
          "headline":"Use a solvent to remove sap residue.",
          "description":"A solvent such as kerosene or a household cleaning agent such as Scrubbing Bubbles will work to clean off residue from sap – this is useful if you’ve been pruning evergreen trees and shrubs."
        },
        {
          "headline":"Inspect the tool for any damage.",
          "description":"As you're cleaning, it’s good practice to inspect the tool for any damage. In general, you should avoid using any damaged tools as these can be unsafe."
        }
      ]
    },
    {
      "name":"Removing Rust",
      "steps":[
        {
          "headline":"Soak rusty tools in a weak vinegar solution.",
          "description":"If your tools are rusty, try soaking the metal parts in a weak vinegar solution (1:1) for 24 hours. Try using a cheap distilled white vinegar from the grocery store for this. Remove them from the solution and wipe down with paper towel to dry them, then clean the rust off with steel wool. Heavily rusted blades may need a second soaking after the first layer of rust comes off."
        },
        {
          "headline":"Use a citric acid solution to remove rust.",
          "description":"Some gardeners swear by a 3 % citric acid solution instead of vinegar – this is good for making up large quantities for cleaning large parts and tools. Be sure to clean the residue away with plenty of clean water after soaking. Citric acid is available in small quantities in the grocery or winemaking store or try your local agricultural store as it’s used by pig keepers (and may be cheaper to buy in quantity there). Avoid this method if you are cleaning parts such as brakes or engine blocks as they can become brittle in the citric acid solution."
        },
        {
          "headline":"Alternatively, soak the tools in strong black tea or cola.",
          "description":"Other gardeners recommend using very strong black tea or even cola instead of vinegar to remove rust. Soak your tools in it, then rub them clean with a rag or wire wool to remove rust. You can also try using some scrunched aluminum cooking foil and a little water to take the rust off."
        },
        {
          "headline":"Try to minimize the amount of scraping you do when removing rust.",
          "description":"Light circular motions, repeated for as long as necessary, are the best way to remove rust without thinning or scratching the metal beneath. You are advised to wear protective gloves, eye wear and a face mask while doing this. It’s also a good idea to make sure your tetanus vaccination is still providing protection."
        },
        {
          "headline":"Sharpen your tools after removing rust.",
          "description":"After removing the rust, it’s a good idea to sharpen the tools. There are a few options for sharpening tools: you can use a whetstone, flat file or sharpening steel. If you are using a whetstone, start by wetting it thoroughly. You can use mineral/motor oil if you prefer instead of water. Without pressing especially hard, stroke the whetstone in one direction along the side of the edge. Replenish either oil or water as required if the stone surface dries out. You might like to switch to a finer grade of whetstone finish to get a final precision edge."
        },
        {
          "headline":"Test the sharpness of the tool.",
          "description":"Test the sharpness on a small piece of plant such as a stem from the bonfire heap (don’t use your finger!). If it’s sharp enough, lightly oil the tool making sure the oil transmits into any mechanism and store carefully away."
        }
      ]
    },
    {
      "name":"Preventing Your Tools From Becoming Rusty",
      "steps":[
        {
          "headline":"Clean your tools and prevent them from getting wet.",
          "description":"Cleaning your tools properly and regularly will stop rust from developing in the first place. It’s also important to prevent them from being wet for prolonged periods of time. Never leave tools outside as they’ll rust quickly if exposed to the elements."
        },
        {
          "headline":"Store your tools properly.",
          "description":"Once you've cleaned your tools, let them dry thoroughly before storing in a dry place such as a shed. Try to avoid congesting them together in a box or van as this can blunt the edges. It’s best to store them separately. Consider making a hanging rack in your shed."
        },
        {
          "headline":"Consider storing your tools in a bucket of sand and mineral oil.",
          "description":"Some gardeners recommend cleaning your tools in water, letting them dry, then plunging them into a bucket filled with a mix of sand and mineral oil to store them there. This is supposed to prevent them rusting."
        }
      ]
    }
  ],
  "text":" Cleaning the Tools Clean your garden tools to prevent the spread of disease. Cleaning your garden tools helps to prevent the spread of infection through the garden from one diseased plant to another. It also helps to keep them rust-free, as clean tools tend to be exposed to less moisture. It may seem fussy, but wiping your pruning blade with a full-strength household cleaner (such as Pine-Sol or Lysol) between cutting each piece of plant matter will help  to prevent the spread of infection. It’s especially important to clean your tools if they have been in contact with setting agents such as concrete that will dull the edge of spades and blades if left to harden. Clean your garden tools to keep them sharp. Keeping garden tools sharp will make them safer easier to use. Although it seems counterintuitive, a sharper blade can be safer as it requires less force and is less likely to slip. Additionally, when cutting through the cells on your plant with something like a pair of secateurs, a sharp blade will cause less cell damage and won’t crush as many cells as a blunt blade. This will help the plant heal faster, which lessens the risk of infection setting in from fungi or the weather. Clean any dirt or debris from the tool. First you need to remove any dirt or debris from the tool, especially the blade area or any fixings. Water and a fairly stiff brush should do fine for this. Don’t delay if you've been using the tool for any setting or drying agents such as cement, sealant or paint. If your tool has any setting agents on it then it will need to be cleaned quickly before these have a chance to dry. After using the brush to get the dirt off, rinse in running water and leave to dry. This can take as long as overnight if the tool has complicated surfaces which retain moisture. Afterwards you can wipe a light coating of mineral or motor oil over your tools. Use a solvent to remove sap residue. A solvent such as kerosene or a household cleaning agent such as Scrubbing Bubbles will work to clean off residue from sap – this is useful if you’ve been pruning evergreen trees and shrubs. Inspect the tool for any damage. As you're cleaning, it’s good practice to inspect the tool for any damage. In general, you should avoid using any damaged tools as these can be unsafe. Removing Rust Soak rusty tools in a weak vinegar solution. If your tools are rusty, try soaking the metal parts in a weak vinegar solution (1:1) for 24 hours. Try using a cheap distilled white vinegar from the grocery store for this. Remove them from the solution and wipe down with paper towel to dry them, then clean the rust off with steel wool. Heavily rusted blades may need a second soaking after the first layer of rust comes off. Use a citric acid solution to remove rust. Some gardeners swear by a 3 % citric acid solution instead of vinegar – this is good for making up large quantities for cleaning large parts and tools. Be sure to clean the residue away with plenty of clean water after soaking. Citric acid is available in small quantities in the grocery or winemaking store or try your local agricultural store as it’s used by pig keepers (and may be cheaper to buy in quantity there). Avoid this method if you are cleaning parts such as brakes or engine blocks as they can become brittle in the citric acid solution. Alternatively, soak the tools in strong black tea or cola. Other gardeners recommend using very strong black tea or even cola instead of vinegar to remove rust. Soak your tools in it, then rub them clean with a rag or wire wool to remove rust. You can also try using some scrunched aluminum cooking foil and a little water to take the rust off. Try to minimize the amount of scraping you do when removing rust. Light circular motions, repeated for as long as necessary, are the best way to remove rust without thinning or scratching the metal beneath. You are advised to wear protective gloves, eye wear and a face mask while doing this. It’s also a good idea to make sure your tetanus vaccination is still providing protection. Sharpen your tools after removing rust. After removing the rust, it’s a good idea to sharpen the tools. There are a few options for sharpening tools: you can use a whetstone, flat file or sharpening steel. If you are using a whetstone, start by wetting it thoroughly. You can use mineral/motor oil if you prefer instead of water. Without pressing especially hard, stroke the whetstone in one direction along the side of the edge. Replenish either oil or water as required if the stone surface dries out. You might like to switch to a finer grade of whetstone finish to get a final precision edge. Test the sharpness of the tool. Test the sharpness on a small piece of plant such as a stem from the bonfire heap (don’t use your finger!). If it’s sharp enough, lightly oil the tool making sure the oil transmits into any mechanism and store carefully away. Preventing Your Tools From Becoming Rusty Clean your tools and prevent them from getting wet. Cleaning your tools properly and regularly will stop rust from developing in the first place. It’s also important to prevent them from being wet for prolonged periods of time. Never leave tools outside as they’ll rust quickly if exposed to the elements. Store your tools properly. Once you've cleaned your tools, let them dry thoroughly before storing in a dry place such as a shed. Try to avoid congesting them together in a box or van as this can blunt the edges. It’s best to store them separately. Consider making a hanging rack in your shed. Consider storing your tools in a bucket of sand and mineral oil. Some gardeners recommend cleaning your tools in water, letting them dry, then plunging them into a bucket filled with a mix of sand and mineral oil to store them there. This is supposed to prevent them rusting.",
  "tyn_model":[
    "water",
    "tools",
    "garden tools",
    "vinegar",
    "citric acid",
    "oil",
    "– this",
    "black tea",
    "cola",
    "whetstone",
    "mineral oil",
    "pruning blade",
    "household cleaner",
    "pine-sol",
    "concrete",
    "secateurs",
    "mineral or motor oil",
    "household cleaning agent",
    "scrubbing bubbles",
    "distilled white vinegar",
    "paper towel",
    "steel wool",
    "acid",
    "wire wool",
    "face mask",
    "sharpening steel",
    "mineral/motor oil",
    "bucket",
    "sand"
  ],
  "tyn_section":[

  ]
}