{
  "title":"How to Make a Smooth Stone Doormat",
  "url":"https://www.wikihow.com/Make-a-Smooth-Stone-Doormat",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Nature Crafts"
  ],
  "steps":[
    {
      "headline":"Cut doormat to size.",
      "description":"The goal is to find a doormat that has no texture but an easy surface to hold the stones. Look for something with a sturdy backing as the stones will be heavy and you don’t want them to fall when moving the mat. Measure the size you desire and then mark with the pencil. If you are satisfied with the size, you don’t need to cut the mat."
    },
    {
      "headline":"Lay out stones on doormat.",
      "description":"Before adding a drop of glue you’ll need to position the stones so that they cover the mat. Make sure they work cohesively on the mat, fitting together like a puzzle. Check to ensure no spaces are between stones or that you can see the mat. Design the mat to create a shape that closely resembles the mat shape you cut."
    },
    {
      "headline":"Add glue to the back of each stone.",
      "description":"Without disturbing the layout add a layer of glue to the back of each stone and press into place. Work slowly so that you don’t disturb the other stones in the layout that haven’t been glued into place."
    },
    {
      "headline":"Allow for at least 24 hours of dry time before moving mat into place.",
      "description":"Consider using a piece of board to slide underneath the mat to make moving it into place a smooth transition. Use caution because although the stones are held by strong glue, they can still shift in transition so either use a hard surface to move the mat and/or slide it into place."
    }
  ],
  "text":" Cut doormat to size. The goal is to find a doormat that has no texture but an easy surface to hold the stones. Look for something with a sturdy backing as the stones will be heavy and you don’t want them to fall when moving the mat. Measure the size you desire and then mark with the pencil. If you are satisfied with the size, you don’t need to cut the mat. Lay out stones on doormat. Before adding a drop of glue you’ll need to position the stones so that they cover the mat. Make sure they work cohesively on the mat, fitting together like a puzzle. Check to ensure no spaces are between stones or that you can see the mat. Design the mat to create a shape that closely resembles the mat shape you cut. Add glue to the back of each stone. Without disturbing the layout add a layer of glue to the back of each stone and press into place. Work slowly so that you don’t disturb the other stones in the layout that haven’t been glued into place. Allow for at least 24 hours of dry time before moving mat into place. Consider using a piece of board to slide underneath the mat to make moving it into place a smooth transition. Use caution because although the stones are held by strong glue, they can still shift in transition so either use a hard surface to move the mat and/or slide it into place.",
  "tyn_model":[
    "mat",
    "doormat",
    "glue",
    "pencil",
    "board",
    "strong glue"
  ],
  "tyn_section":[

  ]
}