{
  "title":"How to Make Your Bathroom Comfortable in Winter",
  "url":"https://www.wikihow.com/Make-Your-Bathroom-Comfortable-in-Winter",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Seasonal Housekeeping"
  ],
  "steps":[
    {
      "headline":"Buy a rug to put down on the floor.",
      "description":"Make sure it's a rug made specifically for bathrooms, but not a plastic bathmat. Try to get a soft one, so it's comfortable to walk on. Make sure it's absorbent."
    },
    {
      "headline":"Purchase a wall coat rack to hang robes and dressing gowns on.",
      "description":"You can either get ones to drill onto a door or a wall, or stick-on ones which are less permanent. Try to put one up close to your bath / shower so you can grab your robe easily and put it on before getting out of the shower."
    },
    {
      "headline":"Get a shower radio.",
      "description":"Music will wake you up in the mornings, if you're the type of person who wakes up tired."
    },
    {
      "headline":"Light some scented candles.",
      "description":"It's essential to pick warm scents, as they smell better in winter. Try cinnamon, festive spice, wood, or berries. You could buy flameless candles for a safer option, which still give off scent and flicker, but aren't actually lit. Make sure you put any real candles on a safe, flat surface away from anything flammable."
    },
    {
      "headline":"Buy a chair if your bathroom is spacious enough.",
      "description":"Make sure it's comfortable, and place it in a place where it won't get wet. Showers can be pretty tiring in winter, especially if you've only just woken up, so sitting in a chair for a little while afterwards can be relaxing. But make sure you don't get too comfortable or go back to sleep if you have work or school."
    },
    {
      "headline":"Dry your towels in a tumble-dryer if possible, as leaving them outdoors in cold weather can make them crunchy and stiff.",
      "description":"If you do dry them outside, make sure you use a fabric conditioner when washing them, and heat them up on a heated towel rail before getting out of the bath or shower."
    },
    {
      "headline":"Place some flowers in your bathroom, either real or fake.",
      "description":"Flowers are nice in any season, but are particularly cheerful in the dull months."
    },
    {
      "headline":"Keep your towels in a linen box in your bathroom.",
      "description":"Purchase a small wicker basket with a lid, or decorative storage box. You could also keep a pair of comfortable socks or slippers in there to keep your feet warm when you get out of the bath or shower."
    }
  ],
  "text":" Buy a rug to put down on the floor. Make sure it's a rug made specifically for bathrooms, but not a plastic bathmat. Try to get a soft one, so it's comfortable to walk on. Make sure it's absorbent. Purchase a wall coat rack to hang robes and dressing gowns on. You can either get ones to drill onto a door or a wall, or stick-on ones which are less permanent. Try to put one up close to your bath / shower so you can grab your robe easily and put it on before getting out of the shower. Get a shower radio. Music will wake you up in the mornings, if you're the type of person who wakes up tired. Light some scented candles. It's essential to pick warm scents, as they smell better in winter. Try cinnamon, festive spice, wood, or berries. You could buy flameless candles for a safer option, which still give off scent and flicker, but aren't actually lit. Make sure you put any real candles on a safe, flat surface away from anything flammable. Buy a chair if your bathroom is spacious enough. Make sure it's comfortable, and place it in a place where it won't get wet. Showers can be pretty tiring in winter, especially if you've only just woken up, so sitting in a chair for a little while afterwards can be relaxing. But make sure you don't get too comfortable or go back to sleep if you have work or school. Dry your towels in a tumble-dryer if possible, as leaving them outdoors in cold weather can make them crunchy and stiff. If you do dry them outside, make sure you use a fabric conditioner when washing them, and heat them up on a heated towel rail before getting out of the bath or shower. Place some flowers in your bathroom, either real or fake. Flowers are nice in any season, but are particularly cheerful in the dull months. Keep your towels in a linen box in your bathroom. Purchase a small wicker basket with a lid, or decorative storage box. You could also keep a pair of comfortable socks or slippers in there to keep your feet warm when you get out of the bath or shower.",
  "tyn_model":[
    "candles",
    "chair",
    "towels",
    "flowers",
    "rug",
    "robe",
    "festive spice",
    "berries",
    "tumble-dryer",
    "fabric conditioner",
    "wicker basket"
  ],
  "tyn_section":[

  ]
}