{
  "title":"How to Make Chocolate Mousse",
  "url":"https://www.wikihow.com/Make-Chocolate-Mousse",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Mousses"
  ],
  "methods":[
    {
      "name":"Making a Classic Chocolate Mousse",
      "steps":[
        {
          "headline":"Beat 4 egg yolks with an electric mixer on high for about 3 minutes.",
          "description":"By the end, the egg yolks should appear thick and yellow colored. Set the bowl of egg yolks aside for future use. The eggs will act as a thickener for the sauce."
        },
        {
          "headline":"Heat 1 cup (240 mL) of heavy cream in a saucepan over medium heat.",
          "description":"Heat until the cream is hot to the touch. Use a wooden spoon to scoop some of the liquid up and test the temperature with your finger. You don't want the cream to boil, but if it does, immediately remove it from the heat."
        },
        {
          "headline":"Pour the heavy whipping cream into the bowl of yolks.",
          "description":"Pour slowly, stirring with a rubber spatula as you go. Scrape down the sides and fold the cream and yolks together gently. Mixing these two together prevents the egg yolks from being scrambled when you cook them next."
        },
        {
          "headline":"Return the mixture to the pan and cook it over low heat for 5 minutes.",
          "description":"Pour the mixture back into the saucepan and set the stove on low heat. Stir the mixture constantly so none of it burns, and turn down the heat if it starts to boil. The mixture should begin to thicken around 5 minutes."
        },
        {
          "headline":"Stir 1 cup (6 oz) of chocolate chips into the saucepan until melted.",
          "description":"The chocolate chips will melt relatively quickly without adding too much heat. Once the chocolate chips have melted into the mixture, remove the pan from the heat so as not to burn the chocolate."
        },
        {
          "headline":"Return the mixture to a bowl, cover it, and refrigerate it for 2 hours.",
          "description":"Use cling wrap or aluminum foil to cover and seal the mixture. Set a timer for an hour and 45 minutes, so you can come back and make the whipped cream just before the chocolate, egg, and cream mixture is ready."
        },
        {
          "headline":"Whip the remaining cream with an electric mixer on high for 7-9 minutes.",
          "description":"Put 1 ⁄2 cups (350 mL) of heavy whipping cream into a bowl. Whip on high until the cream forms stiff peaks, which will usually take around 8 minutes. To test for stiff peaks, dip a whisk into the cream and lift it out; if the peaks hold after 1 or 2 seconds you have achieved stiff peaks."
        },
        {
          "headline":"Fold the whipped cream and chocolate together with a rubber spatula.",
          "description":"Remove the chocolate cream from the refrigerator (after 2 hours has passed), and spoon some of the whipped cream onto the chocolate mixture. Dip the spatula down through the cream and fold it around and into the chocolate mixture. Repeat this process until all of the cream has been folded in, never stirring too hard. Stirring too much will knock out the air that gives mousse its light and fluffy texture, while calm, careful motions will protect the texture."
        },
        {
          "headline":"Spoon or pipe the mousse into 8 individual cups and serve.",
          "description":"If you want to add some extra flair and flavor, layer in fresh berries and whipped cream. If you have any leftovers, immediately refrigerate them."
        }
      ]
    },
    {
      "name":"Creating a Healthy, Dairy-Free Chocolate Mousse",
      "steps":[
        {
          "headline":"Place the cans of coconut milk in the freezer 2 hours before you begin.",
          "description":"Set a timer for 2 hours and remove them from the freezer so that they don't freeze solid. This will partially freeze the cream out of the liquid in the milk and allow you to use only the cream from the cans."
        },
        {
          "headline":"Measure out 2 full cups (16 oz) of solid coconut cream into a large bowl.",
          "description":"Spoon the cream out of the can and into a bowl or measuring cup. The liquid should rest on the bottom of the can after freezing, so it shouldn't be too hard to avoid the liquid parts."
        },
        {
          "headline":"Add honey, vanilla extract, and cocoa powder to the bowl.",
          "description":"Pour in 4 tablespoons (59 mL) of honey, 2 teaspoons (9.9 mL) of vanilla extract, and 4 tbsp (56 g) of cocoa powder on top of the coconut cream. Set aside extra honey to sweeten the mixture to taste, after whipping, if you like. Honey provides a nice sweetening alternative to granulated sugar"
        },
        {
          "headline":"Whip the ingredients for 3-5 minutes with an electric mixer on medium.",
          "description":"Whip continuously, using a rubber spatula to scrape down the sides periodically. Stop when the mixture begins to look smooth and creamy. If using a whisk to mix by hand, this will take much more time and effort."
        },
        {
          "headline":"Spoon or pipe the mousse into 8 individual cups and garnish.",
          "description":"Piping will give the mousse an extra sophisticated look, and you can garnish with fresh strawberries. You can refrigerate for longer at this point or serve the mousse as is. Enjoy!"
        }
      ]
    }
  ],
  "text":" Making a Classic Chocolate Mousse Beat 4 egg yolks with an electric mixer on high for about 3 minutes. By the end, the egg yolks should appear thick and yellow colored. Set the bowl of egg yolks aside for future use. The eggs will act as a thickener for the sauce. Heat 1 cup (240 mL) of heavy cream in a saucepan over medium heat. Heat until the cream is hot to the touch. Use a wooden spoon to scoop some of the liquid up and test the temperature with your finger. You don't want the cream to boil, but if it does, immediately remove it from the heat. Pour the heavy whipping cream into the bowl of yolks. Pour slowly, stirring with a rubber spatula as you go. Scrape down the sides and fold the cream and yolks together gently. Mixing these two together prevents the egg yolks from being scrambled when you cook them next. Return the mixture to the pan and cook it over low heat for 5 minutes. Pour the mixture back into the saucepan and set the stove on low heat. Stir the mixture constantly so none of it burns, and turn down the heat if it starts to boil. The mixture should begin to thicken around 5 minutes. Stir 1 cup (6 oz) of chocolate chips into the saucepan until melted. The chocolate chips will melt relatively quickly without adding too much heat. Once the chocolate chips have melted into the mixture, remove the pan from the heat so as not to burn the chocolate. Return the mixture to a bowl, cover it, and refrigerate it for 2 hours. Use cling wrap or aluminum foil to cover and seal the mixture. Set a timer for an hour and 45 minutes, so you can come back and make the whipped cream just before the chocolate, egg, and cream mixture is ready. Whip the remaining cream with an electric mixer on high for 7-9 minutes. Put 1 ⁄2 cups (350 mL) of heavy whipping cream into a bowl. Whip on high until the cream forms stiff peaks, which will usually take around 8 minutes. To test for stiff peaks, dip a whisk into the cream and lift it out; if the peaks hold after 1 or 2 seconds you have achieved stiff peaks. Fold the whipped cream and chocolate together with a rubber spatula. Remove the chocolate cream from the refrigerator (after 2 hours has passed), and spoon some of the whipped cream onto the chocolate mixture. Dip the spatula down through the cream and fold it around and into the chocolate mixture. Repeat this process until all of the cream has been folded in, never stirring too hard. Stirring too much will knock out the air that gives mousse its light and fluffy texture, while calm, careful motions will protect the texture. Spoon or pipe the mousse into 8 individual cups and serve. If you want to add some extra flair and flavor, layer in fresh berries and whipped cream. If you have any leftovers, immediately refrigerate them. Creating a Healthy, Dairy-Free Chocolate Mousse Place the cans of coconut milk in the freezer 2 hours before you begin. Set a timer for 2 hours and remove them from the freezer so that they don't freeze solid. This will partially freeze the cream out of the liquid in the milk and allow you to use only the cream from the cans. Measure out 2 full cups (16 oz) of solid coconut cream into a large bowl. Spoon the cream out of the can and into a bowl or measuring cup. The liquid should rest on the bottom of the can after freezing, so it shouldn't be too hard to avoid the liquid parts. Add honey, vanilla extract, and cocoa powder to the bowl. Pour in 4 tablespoons (59 mL) of honey, 2 teaspoons (9.9 mL) of vanilla extract, and 4 tbsp (56 g) of cocoa powder on top of the coconut cream. Set aside extra honey to sweeten the mixture to taste, after whipping, if you like. Honey provides a nice sweetening alternative to granulated sugar Whip the ingredients for 3-5 minutes with an electric mixer on medium. Whip continuously, using a rubber spatula to scrape down the sides periodically. Stop when the mixture begins to look smooth and creamy. If using a whisk to mix by hand, this will take much more time and effort. Spoon or pipe the mousse into 8 individual cups and garnish. Piping will give the mousse an extra sophisticated look, and you can garnish with fresh strawberries. You can refrigerate for longer at this point or serve the mousse as is. Enjoy!",
  "tyn_model":[
    "cream",
    "bowl",
    "chocolate",
    "whipped cream",
    "honey",
    "electric mixer",
    "saucepan",
    "rubber spatula",
    "chocolate chips",
    "egg yolks",
    "heavy whipping cream",
    "pan",
    "whisk",
    "coconut cream",
    "vanilla extract",
    "cocoa powder",
    "eggs",
    "heavy cream",
    "wooden spoon",
    "stove",
    "cling wrap",
    "aluminum foil",
    "egg",
    "chocolate cream",
    "refrigerator",
    "spatula",
    "berries",
    "coconut milk",
    "milk",
    "large bowl",
    "sugar",
    "strawberries"
  ],
  "tyn_section":[

  ]
}