{
  "title":"How to Use Teak Oil on Kitchen Cabinets",
  "url":"https://www.wikihow.com/Use-Teak-Oil-on-Kitchen-Cabinets",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "parts":[
    {
      "name":"Understanding How Teak Oil is Used",
      "steps":[
        {
          "headline":"Know what ingredients teak oil products contain.",
          "description":"First of all, there is very little oil in any of the commercial grade oil finishes. They are made up of a little oil mixed with mineral spirits and varnish. The lingo in the cabinetmaking trade is “wiping varnish” due to the primary content. You can define it as thinned out varnish with a little teak oil mixed in. This type of finish should be applied only to bare wood to achieve a nice finish. The wood can be stained as long as the stain is completely dry before you apply the oil."
        },
        {
          "headline":"Remove old finishes before applying the Teak oil.",
          "description":"Applying Teak oil finish over old finishes, such as varnish, lacquer, shellac, or polyurethane, is likely to result in a sticky finish that may take months to cure. If the old finish is completely removed down to bare wood, you’ll have much better results. Oil finishes are designed to penetrate the unfinished pores of wood. Applying over a finished surface, other than if original finish is Teak oil, is fruitless."
        },
        {
          "headline":"Don't believe the advertisements.",
          "description":"When you see a television commercial about a polish or oil product to be used to “nourish” or “revitalize” your furniture, it’s baloney! You cannot “nourish” finished wood with these products. They are surface products loaded with silicone to create a shiny slick surface."
        },
        {
          "headline":"Take the proper safety precautions.",
          "description":"Always use safety glasses for all home improvement projects. When using a solvent-based finish, use only in a very well-ventilated area and wear a painter’s mask when possible."
        },
        {
          "headline":"Gather the necessary materials.",
          "description":"To apply a Teak oil finish to your kitchen cabinets, you will needs:\nTeak oil finish (Enough for several coats for the entire project. See can for coverage details)\nVery fine (#0000) steel wool\nSeveral sheets of 600 grit silicone-carbide sandpaper (the dark gray stuff)\nDrop cloth or protective covering for work area\nA supply of clean rags (t-shirt material works best)\nLarge metal can or metal bucket about half full of water\nEmpty metal coffee can or similar\nCan of mineral spirits\nPhillips and flat head screwdrivers\nMasking or painters tape\nSaw horses or other elevated surface for the cabinet doors when finishing\nHousehold window cleaner"
        }
      ]
    },
    {
      "name":"Preparing the Cabinet Surface",
      "steps":[
        {
          "headline":"Remove the doors from their hinges.",
          "description":"If the cabinets are already installed, remove the cabinet doors by removing the hinges with a screwdriver. Set the doors aside. Since this is a wipe-on finish, it is easier to control its application. You may leave the doors on if you choose, but it’s much easier to work with them removed."
        },
        {
          "headline":"Apply masking tape to protect the paint around the cabinets.",
          "description":"Mask off the wall along the edge where the cabinet is attached to the wall to protect the paint on the wall one or two widths should be enough. If you do get some Teak oil on the painted wall, wipe it off immediately with a “dab” of mineral spirits."
        },
        {
          "headline":"Buff the surface of the cabinets with steel wool.",
          "description":"If the cabinets have been previously finished, take the #0000 steel wool and buff all surfaces to be finished. This will take some time, but be thorough. After buffing, clean the surface with household window cleaner and wipe dry."
        },
        {
          "headline":"Wipe down the surfaces with mineral spirits.",
          "description":"Take a cloth dampened with mineral spirits and wipe down the surfaces. Wipe dry and allow about 10 minutes for any remaining mineral spirits film on the surfaces to evaporate."
        }
      ]
    },
    {
      "name":"Applying the Teak Oil",
      "steps":[
        {
          "headline":"Pour about a pint of Teak oil into the metal coffee can.",
          "description":"Make sure it's the one without any water in it. Dip a clean rag into the oil. “Wipe” it out a bit along the inside of the can to avoid heavy drips."
        },
        {
          "headline":"Use an up and down wiping motion to apply the oil.",
          "description":"Starting at the top of the cabinet end and working toward the bottom, use an up and down wiping motion, starting nearest the wall. Wipe on vertical “rows” of finish, making sure to keep the wiping rag wet with Teak oil until your target surface is completely coated. Do only one cabinet at a time, starting on each exposed end. Then, do the face frames."
        },
        {
          "headline":"Check for drips then allow the first coat to dry.",
          "description":"After applying one coat to one entire cabinet, check for drips. If you spot any, blend them into the finish with the rag. Then, move on to the next cabinet until all cabinets have one coat. Allow to dry per the instructions on the can of Teak oil. If it calls for wiping off excess before drying, then follow the directions."
        },
        {
          "headline":"Use the same cleaning and application process for the doors.",
          "description":"The doors will take longer as there is an interior and exterior surface. Do not give in to the temptation of “skipping” the interior because “no one will see it.” An unfinished surface will absorb humidity from the air and can warp the doors. You can, however, get by with one base coat and one top coat on the interior for proper sealing of the wood."
        }
      ]
    },
    {
      "name":"Applying Subsequent Coats and Cleaning Up",
      "steps":[
        {
          "headline":"Apply subsequent coats as recommended on the Teak oil can.",
          "description":"This tutorial recommends three coats minimum, but no more than four when applying the oil finish. On the coat before the final coat, rub the entire surface with 600 grit silicone-carbide sandpaper while the finish is still very wet. You can dip the paper into the coffee can of Teak oil and “wet sand” that coat. Then, on the final coat, apply with a rag as before. You will have a glassy-smooth finish when dry."
        },
        {
          "headline":"Allow the cabinets to dry completely before replacing the doors.",
          "description":"Allow all cabinets and doors to dry completely before handling or you may leave fingerprints in the finish. When dry, carefully replace the doors."
        },
        {
          "headline":"Understand the importance of cleaning up properly afterwards.",
          "description":"Properly cleaning up after using Teak oil or any other “oil” finish is extremely important. These finishes have one unique characteristic: the rags used for applying the finish often spontaneously combust! Never throw old rags in the trash or on your floor when soaked with this product. Always put used rags into a metal can or bucket filled with water. Saturate the rags completely with water and set the bucket of water and rags in a safe place for several hours. Rinse the rags in clean water a second time and then safely dispose of them. This seems like a lot of work, but it will prevent a fire."
        }
      ]
    }
  ],
  "text":" Understanding How Teak Oil is Used Know what ingredients teak oil products contain. First of all, there is very little oil in any of the commercial grade oil finishes. They are made up of a little oil mixed with mineral spirits and varnish. The lingo in the cabinetmaking trade is “wiping varnish” due to the primary content. You can define it as thinned out varnish with a little teak oil mixed in. This type of finish should be applied only to bare wood to achieve a nice finish. The wood can be stained as long as the stain is completely dry before you apply the oil. Remove old finishes before applying the Teak oil. Applying Teak oil finish over old finishes, such as varnish, lacquer, shellac, or polyurethane, is likely to result in a sticky finish that may take months to cure. If the old finish is completely removed down to bare wood, you’ll have much better results. Oil finishes are designed to penetrate the unfinished pores of wood. Applying over a finished surface, other than if original finish is Teak oil, is fruitless. Don't believe the advertisements. When you see a television commercial about a polish or oil product to be used to “nourish” or “revitalize” your furniture, it’s baloney! You cannot “nourish” finished wood with these products. They are surface products loaded with silicone to create a shiny slick surface. Take the proper safety precautions. Always use safety glasses for all home improvement projects. When using a solvent-based finish, use only in a very well-ventilated area and wear a painter’s mask when possible. Gather the necessary materials. To apply a Teak oil finish to your kitchen cabinets, you will needs:\nTeak oil finish (Enough for several coats for the entire project. See can for coverage details)\nVery fine (#0000) steel wool\nSeveral sheets of 600 grit silicone-carbide sandpaper (the dark gray stuff)\nDrop cloth or protective covering for work area\nA supply of clean rags (t-shirt material works best)\nLarge metal can or metal bucket about half full of water\nEmpty metal coffee can or similar\nCan of mineral spirits\nPhillips and flat head screwdrivers\nMasking or painters tape\nSaw horses or other elevated surface for the cabinet doors when finishing\nHousehold window cleaner Preparing the Cabinet Surface Remove the doors from their hinges. If the cabinets are already installed, remove the cabinet doors by removing the hinges with a screwdriver. Set the doors aside. Since this is a wipe-on finish, it is easier to control its application. You may leave the doors on if you choose, but it’s much easier to work with them removed. Apply masking tape to protect the paint around the cabinets. Mask off the wall along the edge where the cabinet is attached to the wall to protect the paint on the wall one or two widths should be enough. If you do get some Teak oil on the painted wall, wipe it off immediately with a “dab” of mineral spirits. Buff the surface of the cabinets with steel wool. If the cabinets have been previously finished, take the #0000 steel wool and buff all surfaces to be finished. This will take some time, but be thorough. After buffing, clean the surface with household window cleaner and wipe dry. Wipe down the surfaces with mineral spirits. Take a cloth dampened with mineral spirits and wipe down the surfaces. Wipe dry and allow about 10 minutes for any remaining mineral spirits film on the surfaces to evaporate. Applying the Teak Oil Pour about a pint of Teak oil into the metal coffee can. Make sure it's the one without any water in it. Dip a clean rag into the oil. “Wipe” it out a bit along the inside of the can to avoid heavy drips. Use an up and down wiping motion to apply the oil. Starting at the top of the cabinet end and working toward the bottom, use an up and down wiping motion, starting nearest the wall. Wipe on vertical “rows” of finish, making sure to keep the wiping rag wet with Teak oil until your target surface is completely coated. Do only one cabinet at a time, starting on each exposed end. Then, do the face frames. Check for drips then allow the first coat to dry. After applying one coat to one entire cabinet, check for drips. If you spot any, blend them into the finish with the rag. Then, move on to the next cabinet until all cabinets have one coat. Allow to dry per the instructions on the can of Teak oil. If it calls for wiping off excess before drying, then follow the directions. Use the same cleaning and application process for the doors. The doors will take longer as there is an interior and exterior surface. Do not give in to the temptation of “skipping” the interior because “no one will see it.” An unfinished surface will absorb humidity from the air and can warp the doors. You can, however, get by with one base coat and one top coat on the interior for proper sealing of the wood. Applying Subsequent Coats and Cleaning Up Apply subsequent coats as recommended on the Teak oil can. This tutorial recommends three coats minimum, but no more than four when applying the oil finish. On the coat before the final coat, rub the entire surface with 600 grit silicone-carbide sandpaper while the finish is still very wet. You can dip the paper into the coffee can of Teak oil and “wet sand” that coat. Then, on the final coat, apply with a rag as before. You will have a glassy-smooth finish when dry. Allow the cabinets to dry completely before replacing the doors. Allow all cabinets and doors to dry completely before handling or you may leave fingerprints in the finish. When dry, carefully replace the doors. Understand the importance of cleaning up properly afterwards. Properly cleaning up after using Teak oil or any other “oil” finish is extremely important. These finishes have one unique characteristic: the rags used for applying the finish often spontaneously combust! Never throw old rags in the trash or on your floor when soaked with this product. Always put used rags into a metal can or bucket filled with water. Saturate the rags completely with water and set the bucket of water and rags in a safe place for several hours. Rinse the rags in clean water a second time and then safely dispose of them. This seems like a lot of work, but it will prevent a fire.",
  "tyn_model":[
    "teak oil",
    "mineral spirits",
    "water",
    "oil",
    "steel wool",
    "coffee can",
    "varnish",
    "“nourish",
    "” of",
    "“wiping",
    "” due",
    "lacquer",
    "polyurethane",
    "” or",
    "“revitalize",
    "” your",
    "” finished",
    "silicone",
    "painter’s mask",
    "600 grit silicone-carbide sandpaper",
    "drop cloth",
    "phillips and flat head screwdrivers",
    "painters tape",
    "window cleaner",
    "screwdriver",
    "masking tape",
    "“dab",
    "household window cleaner",
    "cloth",
    "“wipe",
    "” it",
    "“rows",
    "rag",
    "“skipping",
    "” the",
    "“no",
    "” an",
    "600 grit",
    "silicone-carbide sandpaper",
    "paper",
    "“wet",
    "” that",
    "“oil",
    "” finish",
    "bucket"
  ],
  "tyn_section":[

  ]
}