{
  "title":"How to Make Baked Parmesan Zucchini",
  "url":"https://www.wikihow.com/Make-Baked-Parmesan-Zucchini",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fruits and Vegetables"
  ],
  "steps":[
    {
      "headline":"Preheat your oven to 350 degrees.",
      "description":"Coat a wire rack with non-stick cooking spray. Place the rack on top of a baking sheet."
    },
    {
      "headline":"Wash and cut the zucchinis.",
      "description":"Make sure you dry them well so that your Parmesan mixture sticks."
    },
    {
      "headline":"Combine Parmesan cheese, thyme, oregano, basil and garlic powder together in a small bowl.",
      "description":"Sprinkle with salt and pepper to taste."
    },
    {
      "headline":"Line the wire rack with quartered zucchini.",
      "description":"Allow for some space between pieces, but place them close enough together so you can easily sprinkle the zucchini with the dry mixture."
    },
    {
      "headline":"Coat your zucchini with olive oil.",
      "description":"Use a baking brush to brush an even coat of oil onto each piece, or you can simply drizzle the oil over the zucchini."
    },
    {
      "headline":"Sprinkle the olive oil-coated zucchini with your Parmesan mixture.",
      "description":"Disperse the cheese mixture evenly so each piece receives the same amount of coating."
    },
    {
      "headline":"Bake for approximately 15 minutes.",
      "description":"Then turn your oven to broil and cook the zucchini for another two or three minutes. Keep an eye on the zucchini so it doesn't burn!"
    },
    {
      "headline":"Remove your baked Parmesan zucchini from the oven.",
      "description":"Sprinkle with parsley and accompany the dish with a dipping sauce such as marinara or ranch."
    }
  ],
  "text":" Preheat your oven to 350 degrees. Coat a wire rack with non-stick cooking spray. Place the rack on top of a baking sheet. Wash and cut the zucchinis. Make sure you dry them well so that your Parmesan mixture sticks. Combine Parmesan cheese, thyme, oregano, basil and garlic powder together in a small bowl. Sprinkle with salt and pepper to taste. Line the wire rack with quartered zucchini. Allow for some space between pieces, but place them close enough together so you can easily sprinkle the zucchini with the dry mixture. Coat your zucchini with olive oil. Use a baking brush to brush an even coat of oil onto each piece, or you can simply drizzle the oil over the zucchini. Sprinkle the olive oil-coated zucchini with your Parmesan mixture. Disperse the cheese mixture evenly so each piece receives the same amount of coating. Bake for approximately 15 minutes. Then turn your oven to broil and cook the zucchini for another two or three minutes. Keep an eye on the zucchini so it doesn't burn! Remove your baked Parmesan zucchini from the oven. Sprinkle with parsley and accompany the dish with a dipping sauce such as marinara or ranch.",
  "tyn_model":[
    "oven",
    "wire rack",
    "parmesan mixture",
    "olive oil",
    "non-stick cooking spray",
    "baking sheet",
    "parmesan cheese",
    "thyme",
    "oregano",
    "basil",
    "garlic powder",
    "small bowl",
    "salt and pepper",
    "zucchini",
    "baking brush",
    "oil",
    "cheese",
    "parmesan zucchini",
    "parsley",
    "ranch"
  ],
  "tyn_section":[

  ]
}