{
  "title":"How to Make Chocolate Chip Cookie Dough Ice Cream",
  "url":"https://www.wikihow.com/Make-Chocolate-Chip-Cookie-Dough-Ice-Cream",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Ice Cream and Frozen Desserts",
    "Chocolate Ice Cream"
  ],
  "methods":[
    {
      "name":"Basic Recipe",
      "steps":[
        {
          "headline":"Beat the sugar, vanilla, and egg substitutes in a medium-sized bowl.",
          "description":""
        },
        {
          "headline":"Pour in the half-and-half and beat again.",
          "description":""
        },
        {
          "headline":"Pour the cream mixture into a pitcher and close tightly.",
          "description":""
        },
        {
          "headline":"Chill the cream mixture in the fridge until cold.",
          "description":""
        },
        {
          "headline":"Pour the cream mixture into an ice cream maker.",
          "description":"Follow your ice cream maker's package instructions to make the ice cream."
        },
        {
          "headline":"Chop the cookie dough chunks.",
          "description":"While the ice cream maker is running, chop the cookie dough into smaller pieces."
        },
        {
          "headline":"Fold in the cookie dough bits into the ice cream.",
          "description":""
        },
        {
          "headline":"Pour in the ice cream into a freezer-proof container.",
          "description":""
        },
        {
          "headline":"Freeze the ice cream until cold and soft.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Scoop the ice cream into a serving bowl. Garnish with chocolate chips if desired. Enjoy!"
        }
      ]
    },
    {
      "name":"Pumpkin Chocolate Chip Recipe",
      "steps":[
        {
          "headline":"Beat both milks, heavy cream, and vanilla in a large bowl using an electric mixer.",
          "description":"Beat for about 5-6 minutes until smooth and creamy."
        },
        {
          "headline":"Pour the whipped topping and beat again.",
          "description":""
        },
        {
          "headline":"Pour the cream into a freezer-proof container and freeze for an hour.",
          "description":""
        },
        {
          "headline":"Make the pumpkin chocolate chip cookie dough.",
          "description":"While the ice cream freezes, prepare the pumpkin chocolate chip cookie dough. Cream the butter, sugar and vanilla until light and fluffy. Pour in the pumpkin, salt, flour, and pumpkin pie spice. Mix again and fold only ⁄4 cup (59 ml) of the chocolate chips."
        },
        {
          "headline":"Line a baking sheet with parchment paper.",
          "description":""
        },
        {
          "headline":"Roll the cookie dough into bite-sized balls and place them on the baking sheet.",
          "description":""
        },
        {
          "headline":"Allow the cookie dough balls to chill for about 20 minutes.",
          "description":""
        },
        {
          "headline":"Stir the cream mixture using a spoon and drop in the cookie dough balls and remaining chocolate chips.",
          "description":""
        },
        {
          "headline":"Freeze the ice cream for about 4 hours till overnight, stirring every hour or so with a spoon.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Scoop the ice cream into a serving bowl. Garnish with chocolate chips if desired. Enjoy!"
        }
      ]
    },
    {
      "name":"Mint Chocolate Chip Recipe",
      "steps":[
        {
          "headline":"Beat the sugar, 1 teaspoon of vanilla, and egg substitutes in a medium-sized bowl.",
          "description":""
        },
        {
          "headline":"Pour in the half-and-half and beat again.",
          "description":""
        },
        {
          "headline":"Pour the cream mixture into a pitcher and close tightly.",
          "description":""
        },
        {
          "headline":"Chill the cream mixture in the fridge until cold.",
          "description":""
        },
        {
          "headline":"Pour the cream mixture into an ice cream maker.",
          "description":"Follow your ice cream maker's package instructions to make the ice cream."
        },
        {
          "headline":"Make the mint chocolate chip cookie dough.",
          "description":"Cream the butter and sugar until light and fluffy. Add the rest of the vanilla and pour in the flour and yogurt. Fold in the chocolate chips."
        },
        {
          "headline":"Tear the cookie dough into bits and add them in the ice cream.",
          "description":""
        },
        {
          "headline":"Pour in the ice cream into a freezer-proof container.",
          "description":""
        },
        {
          "headline":"Freeze the ice cream until cold and soft.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Scoop the ice cream into a serving bowl. Garnish with chocolate chips or fresh mint if desired. Enjoy!"
        }
      ]
    },
    {
      "name":"Strawberry Chocolate Chip Recipe",
      "steps":[
        {
          "headline":"Combine the cake mix, oil, and chocolate chips together until well-combined.",
          "description":"This will form into strawberry cookie dough."
        },
        {
          "headline":"Beat the sugar, vanilla, and egg substitutes in a medium-sized bowl.",
          "description":""
        },
        {
          "headline":"Pour in the half-and-half and beat again.",
          "description":""
        },
        {
          "headline":"Pour the cream mixture into a pitcher and close tightly.",
          "description":""
        },
        {
          "headline":"Chill the cream mixture in the fridge until cold.",
          "description":""
        },
        {
          "headline":"Pour the cream mixture into an ice cream maker.",
          "description":"Follow your ice cream maker's package instructions to make the ice cream."
        },
        {
          "headline":"Chop the cookie dough chunks.",
          "description":"While the ice cream maker is running, chop the cookie dough into smaller pieces."
        },
        {
          "headline":"Fold in the cookie dough bits into the ice cream.",
          "description":""
        },
        {
          "headline":"Pour in the ice cream into a freezer-proof container.",
          "description":""
        },
        {
          "headline":"Freeze the ice cream until cold and soft.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Scoop the ice cream into a serving bowl. Garnish with chocolate chips if desired. Enjoy!"
        }
      ]
    },
    {
      "name":"Peanut Butter Chocolate Chip Recipe",
      "steps":[
        {
          "headline":"Blend the peanut butter, butter, brown sugar, vanilla, and salt together.",
          "description":""
        },
        {
          "headline":"Add the milk, flour and chocolate chips.",
          "description":"Blend until well-combined."
        },
        {
          "headline":"Beat the sugar, vanilla, and egg substitutes in a medium-sized bowl.",
          "description":""
        },
        {
          "headline":"Pour in the half-and-half and beat again.",
          "description":""
        },
        {
          "headline":"Pour the cream mixture into a pitcher and close tightly.",
          "description":""
        },
        {
          "headline":"Chill the cream mixture in the fridge until cold.",
          "description":""
        },
        {
          "headline":"Pour the cream mixture into an ice cream maker.",
          "description":"Follow your ice cream maker's package instructions to make the ice cream."
        },
        {
          "headline":"Chop the cookie dough chunks.",
          "description":"While the ice cream maker is running, chop the cookie dough into smaller pieces."
        },
        {
          "headline":"Fold in the cookie dough bits into the ice cream.",
          "description":""
        },
        {
          "headline":"Pour in the ice cream into a freezer-proof container.",
          "description":""
        },
        {
          "headline":"Freeze the ice cream until cold and soft.",
          "description":""
        },
        {
          "headline":"Serve.",
          "description":"Scoop the ice cream into a serving bowl. Garnish with chocolate chips if desired. Enjoy!"
        }
      ]
    }
  ],
  "text":" Basic Recipe Beat the sugar, vanilla, and egg substitutes in a medium-sized bowl.  Pour in the half-and-half and beat again.  Pour the cream mixture into a pitcher and close tightly.  Chill the cream mixture in the fridge until cold.  Pour the cream mixture into an ice cream maker. Follow your ice cream maker's package instructions to make the ice cream. Chop the cookie dough chunks. While the ice cream maker is running, chop the cookie dough into smaller pieces. Fold in the cookie dough bits into the ice cream.  Pour in the ice cream into a freezer-proof container.  Freeze the ice cream until cold and soft.  Serve. Scoop the ice cream into a serving bowl. Garnish with chocolate chips if desired. Enjoy! Pumpkin Chocolate Chip Recipe Beat both milks, heavy cream, and vanilla in a large bowl using an electric mixer. Beat for about 5-6 minutes until smooth and creamy. Pour the whipped topping and beat again.  Pour the cream into a freezer-proof container and freeze for an hour.  Make the pumpkin chocolate chip cookie dough. While the ice cream freezes, prepare the pumpkin chocolate chip cookie dough. Cream the butter, sugar and vanilla until light and fluffy. Pour in the pumpkin, salt, flour, and pumpkin pie spice. Mix again and fold only ⁄4 cup (59 ml) of the chocolate chips. Line a baking sheet with parchment paper.  Roll the cookie dough into bite-sized balls and place them on the baking sheet.  Allow the cookie dough balls to chill for about 20 minutes.  Stir the cream mixture using a spoon and drop in the cookie dough balls and remaining chocolate chips.  Freeze the ice cream for about 4 hours till overnight, stirring every hour or so with a spoon.  Serve. Scoop the ice cream into a serving bowl. Garnish with chocolate chips if desired. Enjoy! Mint Chocolate Chip Recipe Beat the sugar, 1 teaspoon of vanilla, and egg substitutes in a medium-sized bowl.  Pour in the half-and-half and beat again.  Pour the cream mixture into a pitcher and close tightly.  Chill the cream mixture in the fridge until cold.  Pour the cream mixture into an ice cream maker. Follow your ice cream maker's package instructions to make the ice cream. Make the mint chocolate chip cookie dough. Cream the butter and sugar until light and fluffy. Add the rest of the vanilla and pour in the flour and yogurt. Fold in the chocolate chips. Tear the cookie dough into bits and add them in the ice cream.  Pour in the ice cream into a freezer-proof container.  Freeze the ice cream until cold and soft.  Serve. Scoop the ice cream into a serving bowl. Garnish with chocolate chips or fresh mint if desired. Enjoy! Strawberry Chocolate Chip Recipe Combine the cake mix, oil, and chocolate chips together until well-combined. This will form into strawberry cookie dough. Beat the sugar, vanilla, and egg substitutes in a medium-sized bowl.  Pour in the half-and-half and beat again.  Pour the cream mixture into a pitcher and close tightly.  Chill the cream mixture in the fridge until cold.  Pour the cream mixture into an ice cream maker. Follow your ice cream maker's package instructions to make the ice cream. Chop the cookie dough chunks. While the ice cream maker is running, chop the cookie dough into smaller pieces. Fold in the cookie dough bits into the ice cream.  Pour in the ice cream into a freezer-proof container.  Freeze the ice cream until cold and soft.  Serve. Scoop the ice cream into a serving bowl. Garnish with chocolate chips if desired. Enjoy! Peanut Butter Chocolate Chip Recipe Blend the peanut butter, butter, brown sugar, vanilla, and salt together.  Add the milk, flour and chocolate chips. Blend until well-combined. Beat the sugar, vanilla, and egg substitutes in a medium-sized bowl.  Pour in the half-and-half and beat again.  Pour the cream mixture into a pitcher and close tightly.  Chill the cream mixture in the fridge until cold.  Pour the cream mixture into an ice cream maker. Follow your ice cream maker's package instructions to make the ice cream. Chop the cookie dough chunks. While the ice cream maker is running, chop the cookie dough into smaller pieces. Fold in the cookie dough bits into the ice cream.  Pour in the ice cream into a freezer-proof container.  Freeze the ice cream until cold and soft.  Serve. Scoop the ice cream into a serving bowl. Garnish with chocolate chips if desired. Enjoy!",
  "tyn_model":[
    "ice cream",
    "cream",
    "ice cream maker",
    "cookie dough",
    "chocolate chips",
    "vanilla",
    "sugar",
    "freezer-proof container",
    "medium-sized bowl",
    "half-and-half",
    "pitcher",
    "fridge",
    "serving bowl",
    "butter",
    "flour",
    "pumpkin chocolate chip cookie dough",
    "salt",
    "baking sheet",
    "spoon",
    "heavy cream",
    "large bowl",
    "electric mixer",
    "whipped topping",
    "pumpkin",
    "pumpkin pie spice",
    "parchment paper",
    "egg substitutes",
    "chocolate chip cookie dough",
    "yogurt",
    "cake mix",
    "oil",
    "strawberry cookie dough",
    "peanut butter chocolate chip",
    "peanut butter",
    "brown sugar",
    "milk"
  ],
  "tyn_section":[

  ]
}