{
  "title":"How to Make a Paper Pencil Christmas Tree",
  "url":"https://www.wikihow.com/Make-a-Paper-Pencil-Christmas-Tree",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids"
  ],
  "steps":[
    {
      "headline":"Cut the construction paper into squares, starting from about 4x4in.",
      "description":"and ending at about 1x1in., going in increments of about 1/2 in. There only needs to be 3-4 of each size square. Measurements do not have to be precise."
    },
    {
      "headline":"Cut each normal-sized pipe cleaner in to 3rds.",
      "description":""
    },
    {
      "headline":"Put your rubber band about 1in.",
      "description":"from the eraser end of the pencil and double it until it is tight."
    },
    {
      "headline":"Holding the eraser end of the pencil, poke the pencil through the middle of a paper square from the biggest group.",
      "description":""
    },
    {
      "headline":"Take on of your pipe cleaner sections and wrap it tightly around the pencil above the paper square.",
      "description":"Push it down against the paper."
    },
    {
      "headline":"Do the same with another square from the same group.",
      "description":""
    },
    {
      "headline":"When you have used all the squares from the biggest group, move on to the next smallest group.",
      "description":""
    },
    {
      "headline":"Keep alternating the pipe cleaners and the squares, until you have used up all the paper squares (There should not be a pipe cleaner after the last square).",
      "description":"The paper squares should have made a Christmas tree shape."
    },
    {
      "headline":"Squish everything down tight towards the rubber band (the eraser end of the pencil).",
      "description":""
    },
    {
      "headline":"Put the second rubber band around the top of the tree, up against the last paper square to keep it from falling off.",
      "description":""
    },
    {
      "headline":"The tip of the pencil should be sticking out.",
      "description":"you can cut it off, Pain it to match the rest of the tree or leave it to decorate with a star, bow, etc."
    },
    {
      "headline":"Using another pencil, make a hole through your candle just big enough for your pencil to fit through.",
      "description":"This will be the stand for your tree."
    },
    {
      "headline":"You can now  decorate your tree with - paint, paper clips, brass paper fasteners, glitter, etc.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Cut the construction paper into squares, starting from about 4x4in. and ending at about 1x1in., going in increments of about 1/2 in. There only needs to be 3-4 of each size square. Measurements do not have to be precise. Cut each normal-sized pipe cleaner in to 3rds.  Put your rubber band about 1in. from the eraser end of the pencil and double it until it is tight. Holding the eraser end of the pencil, poke the pencil through the middle of a paper square from the biggest group.  Take on of your pipe cleaner sections and wrap it tightly around the pencil above the paper square. Push it down against the paper. Do the same with another square from the same group.  When you have used all the squares from the biggest group, move on to the next smallest group.  Keep alternating the pipe cleaners and the squares, until you have used up all the paper squares (There should not be a pipe cleaner after the last square). The paper squares should have made a Christmas tree shape. Squish everything down tight towards the rubber band (the eraser end of the pencil).  Put the second rubber band around the top of the tree, up against the last paper square to keep it from falling off.  The tip of the pencil should be sticking out. you can cut it off, Pain it to match the rest of the tree or leave it to decorate with a star, bow, etc. Using another pencil, make a hole through your candle just big enough for your pencil to fit through. This will be the stand for your tree. You can now  decorate your tree with - paint, paper clips, brass paper fasteners, glitter, etc.  Finished. ",
  "tyn_model":[
    "pencil",
    "pipe cleaner",
    "rubber band",
    "eraser",
    "construction paper",
    "paper",
    "pipe cleaners",
    "candle",
    "paint",
    "brass paper fasteners",
    "glitter"
  ],
  "tyn_section":[

  ]
}