{
  "title":"How to Make Beef Wellington",
  "url":"https://www.wikihow.com/Make-Beef-Wellington",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Beef and Lamb"
  ],
  "parts":[
    {
      "name":"Searing the Beef",
      "steps":[
        {
          "headline":"Season the beef with salt and pepper.",
          "description":"Take out 1 center-cut beef tenderloin, making sure it’s been trimmed of all sinews and fat. Sprinkle salt and pepper on each side of the beef tenderloin so that it’s evenly coated. You can tie the tenderloin with kitchen twine in 4 places around its width to help keep its form."
        },
        {
          "headline":"Pour oil into a hot pan.",
          "description":"Choose a skillet big enough to hold the beef tenderloin, and then use canola oil or olive oil to coat the bottom. Set the skillet on the stovetop and turn the stove to high heat. 1–2 tablespoons (15–30 ml) of oil should work."
        },
        {
          "headline":"Add the beef to the pan and let it sear for roughly 3 minutes.",
          "description":"Once you set the beef tenderloin on the hot pan, avoid moving it while it sears. After 3 minutes have passed, the bottom of the tenderloin should be browned and ready to be flipped. Set a timer to help you remember when to flip the tenderloin."
        },
        {
          "headline":"Flip the beef every 3 minutes to sear all of the sides.",
          "description":"Use a pair of kitchen prongs to turn the tenderloin over to an uncooked side. Wait 3 minutes for that side to sear, and then continue turning the tenderloin on the hot skillet until all of the sides are nicely browned, including both ends of the tenderloin."
        },
        {
          "headline":"Remove the beef from the pan and cut the ties, if necessary.",
          "description":"Use the kitchen prongs to transfer the beef from the pan to a cutting board or similar tray. If you tied kitchen twine around your tenderloin, use scissors to cut the ties off carefully."
        },
        {
          "headline":"Brush mustard onto the beef while it’s still warm.",
          "description":"Use a basting brush to brush 0.25 cups (59 ml) of mustard onto the tenderloin, though you can add more mustard if desired. Use a mustard such as Dijon or English, and make sure that you brush the mustard onto every side of the tenderloin. If you don’t have a basting brush, you can use a spoon to spread the mustard onto the tenderloin."
        }
      ]
    },
    {
      "name":"Cooking the Duxelle",
      "steps":[
        {
          "headline":"Chop up or mince the shallots, mushrooms, and garlic.",
          "description":"Carefully mince 2 shallots, 2 pounds (910 g) of cremini mushrooms, and 5 cloves of garlic. You can also choose to add an herb such as thyme, chopping it up finely for a little added flavor. These ingredients are what make up a duxelle. You can add the ingredients to a food processor to chop them up finely, if preferred."
        },
        {
          "headline":"Set a pan to medium-high heat and coat it with butter.",
          "description":"Find a pan that’s big enough to hold all of the ingredients you just chopped up—a large skillet should work. Add 1 tablespoon (15 ml) of butter to the pan to coat it and wait for the pan to heat up."
        },
        {
          "headline":"Add the ingredients, cooking them until the liquid evaporates.",
          "description":"Stir the mushrooms, shallots, and garlic occasionally as they cook. When it’s done, the mixture should become thick and more like a dry paste, which takes roughly 25 minutes. If desired, add a sprinkle or two of salt and pepper to taste."
        },
        {
          "headline":"Remove the mixture from the pan and let it cool.",
          "description":"Once the duxelle cooks, turn off the stove and pour the mixture into a bowl. You can set this aside until you prepare the rest of the beef Wellington, or you can put it in the fridge to let it cool faster."
        }
      ]
    },
    {
      "name":"Wrapping the Beef",
      "steps":[
        {
          "headline":"Place overlapping strips of prosciutto on spread-out plastic wrap.",
          "description":"Spread a couple pieces of plastic wrap flat on your countertop so that it’s twice the length and width of the beef tenderloin. Place each strip of prosciutto on the plastic wrap, overlapping them slightly so that they’re all touching and will easily stick together. Your layer of prosciutto should create a square—using 4 or 5 strips works nicely."
        },
        {
          "headline":"Spread the duxelle onto the prosciutto.",
          "description":"Use a spoon to scoop the duxelle (the mushroom mixture) onto the strips of prosciutto. Spread it out evenly across all of the prosciutto, making sure there’s a flat layer on the entire square."
        },
        {
          "headline":"Wrap the beef in the prosciutto and set it in the fridge for 15 minutes.",
          "description":"Place the beef tenderloin in the center of the prosciutto and start wrapping the beef. By lifting up the ends of the plastic wrap, you’ll be able to cover the beef tenderloin with the prosciutto easily and tightly. Tie the ends of the plastic wrap together so they don’t come undone. Letting the beef sit in the fridge helps the prosciutto stick to the tenderloin, so you shouldn’t have any trouble removing the plastic wrap from the prosciutto-wrapped beef."
        },
        {
          "headline":"Preheat the oven to 400 °F (204 °C) and spread out the puff pastry.",
          "description":"While the oven is preheating, spread out plastic wrap on the counter just as you did for the prosciutto. Place the puff pastry on the plastic wrap, spreading it out so that it’s in a flat, even layer."
        },
        {
          "headline":"Roll the prosciutto-wrapped tenderloin in the puff pastry.",
          "description":"Unwrap the beef tenderloin from the plastic wrap and place it in the center of the puff pastry. Lift the plastic wrap to cover the tenderloin in puff pastry, making sure it’s nice and tight. Cut off any extra puff pastry so that none of it is overlapping. The beef Wellington should resemble a log once it’s all wrapped."
        },
        {
          "headline":"Use the plastic wrap to tie up the puff pastry and set it in the fridge for 15 minutes.",
          "description":"Once the tenderloin is wrapped in puff pastry, roll it up using the plastic wrap and tie the ends so that it stays together. Place the beef Wellington in the fridge for 15 minutes to let it set."
        }
      ]
    },
    {
      "name":"Baking the Beef Wellington",
      "steps":[
        {
          "headline":"Brush the beef Wellington with the beaten eggs.",
          "description":"Take the beef Wellington out of the fridge, remove the plastic wrap, and place it on a tray. Beat 2 eggs together until they’re a smooth consistency, and then use a basting brush to spread the egg onto the puff pastry evenly. The egg coat will give the puff pastry a golden shine once it’s cooked. You can also sprinkle salt on the puff pastry, if desired."
        },
        {
          "headline":"Set the beef on a lined baking sheet and put it in the oven.",
          "description":"Line a baking sheet with parchment paper or foil. Lift the beef Wellington onto the baking sheet and set the tray in the oven once the temperature reaches 400 °F (204 °C). If you don’t have parchment paper or foil, you can apply an even layer of cooking spray to the baking sheet so the beef Wellington doesn’t stick."
        },
        {
          "headline":"Bake the beef Wellington for about 40 minutes until it's golden brown.",
          "description":"Check on the beef Wellington periodically, especially once it reaches 30 minutes to see that it’s turning golden brown. The internal temperature of the beef should be 135 °F (57 °C) once it’s finished cooking. 135 °F (57 °C) will be medium-rare."
        },
        {
          "headline":"Remove the beef Wellington from the oven and serve.",
          "description":"Once the puff pastry is golden brown and the meat is cooked, turn off the oven and carefully take out the baking sheet. Your beef Wellington should be ready to slice and eat once you let it cool for a few minutes! Use a cutting knife sharp enough to slice through the meat easily. Store leftovers in a sealed container in the fridge and consume within 4-5 days."
        }
      ]
    }
  ],
  "text":" Searing the Beef Season the beef with salt and pepper. Take out 1 center-cut beef tenderloin, making sure it’s been trimmed of all sinews and fat. Sprinkle salt and pepper on each side of the beef tenderloin so that it’s evenly coated. You can tie the tenderloin with kitchen twine in 4 places around its width to help keep its form. Pour oil into a hot pan. Choose a skillet big enough to hold the beef tenderloin, and then use canola oil or olive oil to coat the bottom. Set the skillet on the stovetop and turn the stove to high heat. 1–2 tablespoons (15–30 ml) of oil should work. Add the beef to the pan and let it sear for roughly 3 minutes. Once you set the beef tenderloin on the hot pan, avoid moving it while it sears. After 3 minutes have passed, the bottom of the tenderloin should be browned and ready to be flipped. Set a timer to help you remember when to flip the tenderloin. Flip the beef every 3 minutes to sear all of the sides. Use a pair of kitchen prongs to turn the tenderloin over to an uncooked side. Wait 3 minutes for that side to sear, and then continue turning the tenderloin on the hot skillet until all of the sides are nicely browned, including both ends of the tenderloin. Remove the beef from the pan and cut the ties, if necessary. Use the kitchen prongs to transfer the beef from the pan to a cutting board or similar tray. If you tied kitchen twine around your tenderloin, use scissors to cut the ties off carefully. Brush mustard onto the beef while it’s still warm. Use a basting brush to brush 0.25 cups (59 ml) of mustard onto the tenderloin, though you can add more mustard if desired. Use a mustard such as Dijon or English, and make sure that you brush the mustard onto every side of the tenderloin. If you don’t have a basting brush, you can use a spoon to spread the mustard onto the tenderloin. Cooking the Duxelle Chop up or mince the shallots, mushrooms, and garlic. Carefully mince 2 shallots, 2 pounds (910 g) of cremini mushrooms, and 5 cloves of garlic. You can also choose to add an herb such as thyme, chopping it up finely for a little added flavor. These ingredients are what make up a duxelle. You can add the ingredients to a food processor to chop them up finely, if preferred. Set a pan to medium-high heat and coat it with butter. Find a pan that’s big enough to hold all of the ingredients you just chopped up—a large skillet should work. Add 1 tablespoon (15 ml) of butter to the pan to coat it and wait for the pan to heat up. Add the ingredients, cooking them until the liquid evaporates. Stir the mushrooms, shallots, and garlic occasionally as they cook. When it’s done, the mixture should become thick and more like a dry paste, which takes roughly 25 minutes. If desired, add a sprinkle or two of salt and pepper to taste. Remove the mixture from the pan and let it cool. Once the duxelle cooks, turn off the stove and pour the mixture into a bowl. You can set this aside until you prepare the rest of the beef Wellington, or you can put it in the fridge to let it cool faster. Wrapping the Beef Place overlapping strips of prosciutto on spread-out plastic wrap. Spread a couple pieces of plastic wrap flat on your countertop so that it’s twice the length and width of the beef tenderloin. Place each strip of prosciutto on the plastic wrap, overlapping them slightly so that they’re all touching and will easily stick together. Your layer of prosciutto should create a square—using 4 or 5 strips works nicely. Spread the duxelle onto the prosciutto. Use a spoon to scoop the duxelle (the mushroom mixture) onto the strips of prosciutto. Spread it out evenly across all of the prosciutto, making sure there’s a flat layer on the entire square. Wrap the beef in the prosciutto and set it in the fridge for 15 minutes. Place the beef tenderloin in the center of the prosciutto and start wrapping the beef. By lifting up the ends of the plastic wrap, you’ll be able to cover the beef tenderloin with the prosciutto easily and tightly. Tie the ends of the plastic wrap together so they don’t come undone. Letting the beef sit in the fridge helps the prosciutto stick to the tenderloin, so you shouldn’t have any trouble removing the plastic wrap from the prosciutto-wrapped beef. Preheat the oven to 400 °F (204 °C) and spread out the puff pastry. While the oven is preheating, spread out plastic wrap on the counter just as you did for the prosciutto. Place the puff pastry on the plastic wrap, spreading it out so that it’s in a flat, even layer. Roll the prosciutto-wrapped tenderloin in the puff pastry. Unwrap the beef tenderloin from the plastic wrap and place it in the center of the puff pastry. Lift the plastic wrap to cover the tenderloin in puff pastry, making sure it’s nice and tight. Cut off any extra puff pastry so that none of it is overlapping. The beef Wellington should resemble a log once it’s all wrapped. Use the plastic wrap to tie up the puff pastry and set it in the fridge for 15 minutes. Once the tenderloin is wrapped in puff pastry, roll it up using the plastic wrap and tie the ends so that it stays together. Place the beef Wellington in the fridge for 15 minutes to let it set. Baking the Beef Wellington Brush the beef Wellington with the beaten eggs. Take the beef Wellington out of the fridge, remove the plastic wrap, and place it on a tray. Beat 2 eggs together until they’re a smooth consistency, and then use a basting brush to spread the egg onto the puff pastry evenly. The egg coat will give the puff pastry a golden shine once it’s cooked. You can also sprinkle salt on the puff pastry, if desired. Set the beef on a lined baking sheet and put it in the oven. Line a baking sheet with parchment paper or foil. Lift the beef Wellington onto the baking sheet and set the tray in the oven once the temperature reaches 400 °F (204 °C). If you don’t have parchment paper or foil, you can apply an even layer of cooking spray to the baking sheet so the beef Wellington doesn’t stick. Bake the beef Wellington for about 40 minutes until it's golden brown. Check on the beef Wellington periodically, especially once it reaches 30 minutes to see that it’s turning golden brown. The internal temperature of the beef should be 135 °F (57 °C) once it’s finished cooking. 135 °F (57 °C) will be medium-rare. Remove the beef Wellington from the oven and serve. Once the puff pastry is golden brown and the meat is cooked, turn off the oven and carefully take out the baking sheet. Your beef Wellington should be ready to slice and eat once you let it cool for a few minutes! Use a cutting knife sharp enough to slice through the meat easily. Store leftovers in a sealed container in the fridge and consume within 4-5 days.",
  "tyn_model":[
    "plastic wrap",
    "puff pastry",
    "beef wellington",
    "prosciutto",
    "beef tenderloin",
    "mustard",
    "oven",
    "fridge",
    "baking sheet",
    "beef",
    "salt and pepper",
    "skillet",
    "pan",
    "basting brush",
    "garlic",
    "kitchen twine",
    "oil",
    "stove",
    "kitchen prongs",
    "spoon",
    "shallots",
    "mushrooms",
    "butter",
    "eggs",
    "tray",
    "parchment paper",
    "canola oil",
    "olive oil",
    "cutting board",
    "scissors",
    "dijon",
    "cremini mushrooms",
    "thyme",
    "food processor",
    "—a",
    "large skillet",
    "bowl",
    "—using",
    "mushroom",
    "prosciutto-",
    "salt",
    "cooking spray",
    "cutting knife"
  ],
  "tyn_section":[

  ]
}