{
  "title":"How to Have Fun at a Gaming Night",
  "url":"https://www.wikihow.com/Have-Fun-at-a-Gaming-Night",
  "category_hierarchy":[
    "Food and Entertaining",
    "Parties",
    "Theme Parties",
    "Gaming Parties"
  ],
  "methods":[
    {
      "name":"For Gamers",
      "steps":[
        {
          "headline":"Come prepared.",
          "description":"Gather everyone's gaming systems and all the necessary controllers, cords, etc, in one place. Depending on what systems you're using, make sure your devices are fully charged or you have outlets to plug them in, as well as any required televisions. Prepare some snacks to eat throughout the night, too."
        },
        {
          "headline":"Schedule the gaming night carefully.",
          "description":"For a full and fun gaming event, you'll probably want to game late into the night ,so make sure you don't have any big obligations like school or work the next day. Saturday nights are ideal."
        },
        {
          "headline":"Get any permission needed.",
          "description":"If you need parental permission to have your own solo gaming night, or host a gaming night with others, ask them. Make sure your friends get permission, too."
        },
        {
          "headline":"Figure out a rough schedule together.",
          "description":"Which games are you going to play first? How long are turns going to take? You don't need to stick to a rigid schedule, but getting some idea of whether each person can play for 20 minutes or 3 hours before switching will help things run smoothly."
        },
        {
          "headline":"Make sure you eat, sleep, and hang out, too.",
          "description":"All-night gaming can be a blast, but take the opportunity to relax with your friends, eat some good snacks, and get some rest, too."
        },
        {
          "headline":"Mix it up.",
          "description":"If you're bored with video games, try another kind of game: board games, card games, and so on can be just as fun, and more interactive. Take a break from the screen and dive into another kind of game."
        }
      ]
    },
    {
      "name":"For Non-Gamers",
      "steps":[
        {
          "headline":"Decide if you really want to attend.",
          "description":"A gaming night is, after all, about gaming. You can still have a good time hanging out with your friends regardless of whether or not you're a gamer, but know that they're going to want to play. If you hate all things gaming, it might not be the party for you."
        },
        {
          "headline":"Bring other activities.",
          "description":"You might want to bring along some books, some supplies for drawing, some music, or a device to surf the Internet. Whatever floats your boat, bring some entertainment and share it with your friends."
        },
        {
          "headline":"Try playing host or hostess.",
          "description":"If you're not super into gaming, you can take another role at the event. Make sure everyone has drinks and snacks, make sure everyone gets a turn, and generally be a good host."
        },
        {
          "headline":"Dive into gaming.",
          "description":"Okay, so you're not a gamer, but what if you just give it a go? Multiplayer games like racing can be really fun even if you don't know what you're doing. See if one of your friends is willing to teach you, and give it a go for a few minutes, even if you go back to another activity afterwards."
        }
      ]
    }
  ],
  "text":" For Gamers Come prepared. Gather everyone's gaming systems and all the necessary controllers, cords, etc, in one place. Depending on what systems you're using, make sure your devices are fully charged or you have outlets to plug them in, as well as any required televisions. Prepare some snacks to eat throughout the night, too. Schedule the gaming night carefully. For a full and fun gaming event, you'll probably want to game late into the night ,so make sure you don't have any big obligations like school or work the next day. Saturday nights are ideal. Get any permission needed. If you need parental permission to have your own solo gaming night, or host a gaming night with others, ask them. Make sure your friends get permission, too. Figure out a rough schedule together. Which games are you going to play first? How long are turns going to take? You don't need to stick to a rigid schedule, but getting some idea of whether each person can play for 20 minutes or 3 hours before switching will help things run smoothly. Make sure you eat, sleep, and hang out, too. All-night gaming can be a blast, but take the opportunity to relax with your friends, eat some good snacks, and get some rest, too. Mix it up. If you're bored with video games, try another kind of game: board games, card games, and so on can be just as fun, and more interactive. Take a break from the screen and dive into another kind of game. For Non-Gamers Decide if you really want to attend. A gaming night is, after all, about gaming. You can still have a good time hanging out with your friends regardless of whether or not you're a gamer, but know that they're going to want to play. If you hate all things gaming, it might not be the party for you. Bring other activities. You might want to bring along some books, some supplies for drawing, some music, or a device to surf the Internet. Whatever floats your boat, bring some entertainment and share it with your friends. Try playing host or hostess. If you're not super into gaming, you can take another role at the event. Make sure everyone has drinks and snacks, make sure everyone gets a turn, and generally be a good host. Dive into gaming. Okay, so you're not a gamer, but what if you just give it a go? Multiplayer games like racing can be really fun even if you don't know what you're doing. See if one of your friends is willing to teach you, and give it a go for a few minutes, even if you go back to another activity afterwards.",
  "tyn_model":[
    "televisions",
    "games",
    "gaming night",
    "books"
  ],
  "tyn_section":[

  ]
}