{
  "title":"How to Fix an Xbox 360 Wireless Controller That Keeps Shutting Off",
  "url":"https://www.wikihow.com/Fix-an-Xbox-360-Wireless-Controller-That-Keeps-Shutting-Off",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Xbox",
    "Xbox 360"
  ],
  "methods":[
    {
      "name":"Fixing Battery and Power Issues",
      "steps":[
        {
          "headline":"Remove the battery packs and batteries.",
          "description":"Dead batteries are by far the most common reason a controller turns off. Push the small button on the top of the battery pack to remove it and slide out the batteries."
        },
        {
          "headline":"Replace the batteries.",
          "description":"Use fresh AA batteries, and never mix and match old batteries and new batteries."
        },
        {
          "headline":"Recharge the controller if you are using a reusable battery pack.",
          "description":"Most rechargeable battery packs either plug into the Xbox with a USB cable or come with a small charging station. Plug in your battery pack and wait 1-3 hours before trying the controller again. If you are using the cable chargers, make sure you turn your Xbox on first. When attached with the charging cable you may keep playing your Xbox 360. If the pack is charging correctly then the cable or docking station light will glow red. When it turns green the pack is fully charged."
        },
        {
          "headline":"Use a light to inspect the metal contacts at the bottom of the battery pack.",
          "description":"If you still cannot get your controller to stay on, make sure that the metal contacts at the bottom are not dirty or rusted. If they are, you'll need to clean them or buy a new battery pack. To clean the contacts use several dry cotton swabs to lightly scrub away dirt and dust."
        },
        {
          "headline":"Secure your battery pack if it is loose or jiggling.",
          "description":"If you controller disconnects every time it rumbles or shakes, your battery pack may be loose. While the easiest way to fix this is to buy a new one, you can also use tape the secure it tightly to the back of your controller. Taping up your battery pack is usually a temporary solution, and makes it difficult to replace dead batteries."
        }
      ]
    },
    {
      "name":"Removing Connection Interferences",
      "steps":[
        {
          "headline":"Restart your console and reconnect your controller.",
          "description":"Turn your Xbox off and wait 5 seconds before turning it back on. When it boots up, reconnect your controller by performing the following steps:\nPress and hold the center \"X\" button to turn the controller on. Press and release the \"connect\" button on the front of your Xbox console. It is a small button underneath the \"Open Disc Tray\" button. Within 20 seconds, press the \"Connect\" button on your controller. It is on the top of the controller next to the battery pack. When the lights on your console stop blinking your controller should be attached."
        },
        {
          "headline":"Know that wireless devices might interfere with your controller.",
          "description":"While Xbox controllers typically reach over 30 ft, this range can be compromised by other machines that emit radio waves. Remove wireless devices from between you and the Xbox to establish a better connection. Machines that might interfere with your controller include:\nMicrowaves\nCordless phones\nWireless Routers\nLaptops"
        },
        {
          "headline":"Remove physical barriers between you and the Xbox.",
          "description":"While the wireless signal may pass easily through some materials, it can have trouble broadcasting through metal, chrome dividers, entertainment console doors, or shelves. Try placing your Xbox on the floor and connecting a controller from close range to make sure it can still connect without any interference."
        },
        {
          "headline":"Make sure there are not already 4 controllers connected.",
          "description":"The Xbox 360 can only accept four controllers at a time, so your wireless controller will not connect if there are already 4 controllers attached. This includes wired controllers, so detach those then try to reconnect. You can quickly disconnect controllers by removing the battery pack or restarting the Xbox."
        },
        {
          "headline":"Replace your controller.",
          "description":"If you know the batteries are good and you've tried removing all possible interferences, you may need to buy a new controller. Call the Xbox Service Center to see if you are eligible for a free replacement. Your console must be registered with Microsoft to be eligible for a replacement."
        }
      ]
    },
    {
      "name":"Resetting your Xbox 360",
      "steps":[
        {
          "headline":"If you are still having trouble you need to reset your Xbox.",
          "description":"While not a recommended fix by Microsoft, some people have had success \"rebooting\" their Xbox's controller set-up. Know, however, that you should contact Microsoft Support before trying this. These tips come from several online communities and forums, not Microsoft directly."
        },
        {
          "headline":"Hold the \"sync\" button on the front of the Xbox for 30 seconds.",
          "description":"Make sure the Xbox is on. The lights on the front of the Xbox will blink and spin, but eventually turn off. Hold the button until the lights are off."
        },
        {
          "headline":"Unplug everything.",
          "description":"Take out the power cord from the wall and the Xbox, remove the inputs, and detach the Xbox hard drive from the console."
        },
        {
          "headline":"Wait 5 minutes before turning everything back on.",
          "description":"After you've waited, plug everything back in and try to connect your controller using the steps discussed in method 2. If you still cannot connect controllers, you'll need to discuss the problem with Microsoft and potentially get a replacement Xbox 360."
        }
      ]
    }
  ],
  "text":" Fixing Battery and Power Issues Remove the battery packs and batteries. Dead batteries are by far the most common reason a controller turns off. Push the small button on the top of the battery pack to remove it and slide out the batteries. Replace the batteries. Use fresh AA batteries, and never mix and match old batteries and new batteries. Recharge the controller if you are using a reusable battery pack. Most rechargeable battery packs either plug into the Xbox with a USB cable or come with a small charging station. Plug in your battery pack and wait 1-3 hours before trying the controller again. If you are using the cable chargers, make sure you turn your Xbox on first. When attached with the charging cable you may keep playing your Xbox 360. If the pack is charging correctly then the cable or docking station light will glow red. When it turns green the pack is fully charged. Use a light to inspect the metal contacts at the bottom of the battery pack. If you still cannot get your controller to stay on, make sure that the metal contacts at the bottom are not dirty or rusted. If they are, you'll need to clean them or buy a new battery pack. To clean the contacts use several dry cotton swabs to lightly scrub away dirt and dust. Secure your battery pack if it is loose or jiggling. If you controller disconnects every time it rumbles or shakes, your battery pack may be loose. While the easiest way to fix this is to buy a new one, you can also use tape the secure it tightly to the back of your controller. Taping up your battery pack is usually a temporary solution, and makes it difficult to replace dead batteries. Removing Connection Interferences Restart your console and reconnect your controller. Turn your Xbox off and wait 5 seconds before turning it back on. When it boots up, reconnect your controller by performing the following steps:\nPress and hold the center \"X\" button to turn the controller on. Press and release the \"connect\" button on the front of your Xbox console. It is a small button underneath the \"Open Disc Tray\" button. Within 20 seconds, press the \"Connect\" button on your controller. It is on the top of the controller next to the battery pack. When the lights on your console stop blinking your controller should be attached. Know that wireless devices might interfere with your controller. While Xbox controllers typically reach over 30 ft, this range can be compromised by other machines that emit radio waves. Remove wireless devices from between you and the Xbox to establish a better connection. Machines that might interfere with your controller include:\nMicrowaves\nCordless phones\nWireless Routers\nLaptops Remove physical barriers between you and the Xbox. While the wireless signal may pass easily through some materials, it can have trouble broadcasting through metal, chrome dividers, entertainment console doors, or shelves. Try placing your Xbox on the floor and connecting a controller from close range to make sure it can still connect without any interference. Make sure there are not already 4 controllers connected. The Xbox 360 can only accept four controllers at a time, so your wireless controller will not connect if there are already 4 controllers attached. This includes wired controllers, so detach those then try to reconnect. You can quickly disconnect controllers by removing the battery pack or restarting the Xbox. Replace your controller. If you know the batteries are good and you've tried removing all possible interferences, you may need to buy a new controller. Call the Xbox Service Center to see if you are eligible for a free replacement. Your console must be registered with Microsoft to be eligible for a replacement. Resetting your Xbox 360 If you are still having trouble you need to reset your Xbox. While not a recommended fix by Microsoft, some people have had success \"rebooting\" their Xbox's controller set-up. Know, however, that you should contact Microsoft Support before trying this. These tips come from several online communities and forums, not Microsoft directly. Hold the \"sync\" button on the front of the Xbox for 30 seconds. Make sure the Xbox is on. The lights on the front of the Xbox will blink and spin, but eventually turn off. Hold the button until the lights are off. Unplug everything. Take out the power cord from the wall and the Xbox, remove the inputs, and detach the Xbox hard drive from the console. Wait 5 minutes before turning everything back on. After you've waited, plug everything back in and try to connect your controller using the steps discussed in method 2. If you still cannot connect controllers, you'll need to discuss the problem with Microsoft and potentially get a replacement Xbox 360.",
  "tyn_model":[
    "xbox",
    "controller",
    "xbox 360",
    "console",
    "battery pack",
    "dry cotton swabs",
    "tape",
    "xbox console",
    "wireless devices",
    "microwaves",
    "cordless phones",
    "wireless routers",
    "laptops",
    "entertainment console",
    "wireless controller",
    "xbox hard drive",
    "controllers"
  ],
  "tyn_section":[

  ]
}