{
  "title":"How to Make Dried Apricot and Walnut Tart",
  "url":"https://www.wikihow.com/Make-Dried-Apricot-and-Walnut-Tart",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies",
    "Tarts"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 180ºC/350ºF.",
      "description":""
    },
    {
      "headline":"Grease a pie mold or line it with baking paper.",
      "description":""
    },
    {
      "headline":"Place the pie dough into the mold.",
      "description":""
    },
    {
      "headline":"Blind bake it for 10 minutes.",
      "description":""
    },
    {
      "headline":"Cut the dried apricots in halves and chop the walnuts up roughly.",
      "description":""
    },
    {
      "headline":"Pour the honey into a frying pan, add the nuts and cook gently until golden.",
      "description":""
    },
    {
      "headline":"Add the apricots and stir well.",
      "description":"Cook for two minutes. Arrange the apricots and walnuts in the base of the tart."
    },
    {
      "headline":"In a bowl, combine the eggs, cornflour, fresh cream and vanilla essence.",
      "description":"Beat together well."
    },
    {
      "headline":"Pour the egg and cream mixture over the fruit and nuts.",
      "description":""
    },
    {
      "headline":"Place the tart in the oven for 15 minutes.",
      "description":""
    },
    {
      "headline":"Make the caramel as the tart cooks.",
      "description":"Use the sugar with a little bit of water and heat gradually in a saucepan on top of the stove. Stir constantly. When it has turned a golden color, add the lemon juice."
    },
    {
      "headline":"Pour the caramel sauce over the tart when you bring it out of the oven.",
      "description":""
    },
    {
      "headline":"Serve warm.",
      "description":"Accompany it with cream or sorbet, if desired."
    }
  ],
  "text":" Preheat the oven to 180ºC/350ºF.  Grease a pie mold or line it with baking paper.  Place the pie dough into the mold.  Blind bake it for 10 minutes.  Cut the dried apricots in halves and chop the walnuts up roughly.  Pour the honey into a frying pan, add the nuts and cook gently until golden.  Add the apricots and stir well. Cook for two minutes. Arrange the apricots and walnuts in the base of the tart. In a bowl, combine the eggs, cornflour, fresh cream and vanilla essence. Beat together well. Pour the egg and cream mixture over the fruit and nuts.  Place the tart in the oven for 15 minutes.  Make the caramel as the tart cooks. Use the sugar with a little bit of water and heat gradually in a saucepan on top of the stove. Stir constantly. When it has turned a golden color, add the lemon juice. Pour the caramel sauce over the tart when you bring it out of the oven.  Serve warm. Accompany it with cream or sorbet, if desired.",
  "tyn_model":[
    "oven",
    "apricots",
    "walnuts",
    "nuts",
    "cream",
    "pie mold",
    "baking paper",
    "pie dough",
    "honey",
    "frying pan",
    "bowl",
    "eggs",
    "cornflour",
    "fresh cream",
    "vanilla",
    "egg",
    "fruit",
    "sugar",
    "water",
    "saucepan",
    "stove",
    "lemon",
    "caramel sauce",
    "sorbet"
  ],
  "tyn_section":[

  ]
}