{
  "title":"How to Make Coffee Syrup",
  "url":"https://www.wikihow.com/Make-Coffee-Syrup",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Jams Preserves and Condiments",
    "Syrups"
  ],
  "methods":[
    {
      "name":"Simple Syrup",
      "steps":[
        {
          "headline":"Combine the sugar and water.",
          "description":"Pour the sugar and water into a small saucepan and stir the two together. The two won’t combine properly until the sugar dissolves in the water, which will happen when you add heat. To increase your simple syrup yield, increase the amount of sugar and water you use, sticking with the one-to-one ratio."
        },
        {
          "headline":"Heat the mixture.",
          "description":"To turn your sugar and water mixture into syrup, heat the mixture over medium-high heat to dissolve the sugar. Bring the mixture to a boil. When the syrup starts to boil, reduce the heat to medium and simmer it for three minutes. While the sugar will eventually dissolve in cold water, this can take hours or days to occur. Moreover, if you don’t add heat to the mixture, none of the water will boil off, so the syrup won’t be as thick."
        },
        {
          "headline":"Cool and bottle the syrup.",
          "description":"After simmering for three minutes, remove the syrup from the heat. Set it aside to cool for 30 minutes to an hour. Transfer the syrup into a sterilized storage jar with a lid and refrigerate it. Simple syrup will keep in the fridge for at least a month. Good storage containers for simple syrup include:\nPlastic squeeze bottles\nWine bottles with screw lids\nClean vinegar or oil jugs\nMaple syrup bottles"
        }
      ]
    },
    {
      "name":"Basic Simple Syrup Variations",
      "steps":[
        {
          "headline":"Try vanilla or almond simple syrup.",
          "description":"There are many simple syrup variations that use the same technique as simple syrup, but they include different ingredients. To make a vanilla or almond syrup, heat equal amounts of sugar and water in the saucepan and bring it to a boil on medium-high heat. Reduce the temperature to medium and simmer for three minutes. Remove the syrup from the heat and set it aside to cool for 10 minutes. Whisk in 2 teaspoons (10 ml) of vanilla or almond extract. Let the mixture cool completely before bottling."
        },
        {
          "headline":"Make coffee-flavored syrup.",
          "description":"Combine the sugar, water, and coffee in a saucepan. Bring the mixture to a boil over medium heat, stirring occasionally to prevent burning and to incorporate all the ingredients. When the mixture boils, remove it from the heat. Set the mixture aside and let it cool to room temperature before bottling."
        },
        {
          "headline":"Make a cinnamon dolce variety.",
          "description":"To make cinnamon dolce simple syrup, replace the white sugar with brown sugar and maple syrup, use half the water, and add a stick of cinnamon. Bring all the ingredients to a boil in a saucepan over medium heat. Boil for five minutes, then remove the pan from the heat. Leave the mixture to cool with the cinnamon stick for about 15 minutes. Remove the stick, and transfer the mixture to a bottle. Store in the refrigerator."
        },
        {
          "headline":"Make seasonal pumpkin simple syrup.",
          "description":"Whisk together all the ingredients in a small saucepan. Bring the mixture to a boil over medium-high heat, stirring regularly. When the mixture boils, reduce the heat to medium and simmer for 10 minutes. After 10 minutes remove the pan from the heat and let it cool. When the syrup reaches room temperature after about an hour, strain it through a strainer lined with cheesecloth to remove the pumpkin puree and spices. Transfer to a bottle and refrigerate."
        }
      ]
    },
    {
      "name":"Caramel Coffee Syrup",
      "steps":[
        {
          "headline":"Melt the sugars.",
          "description":"There are also other flavored coffee syrup variations that are a little more involved than just simple syrup, and they include caramel and hazelnut syrups. For the caramel, combine the sugar, corn syrup, and ¼ cup (59 ml) of the water in a small saucepan. Heat the mixture over medium-high heat and bring it to a boil. Cover the pan with a lid and boil for two to three minutes. Reserve ½ cup (119 ml) of water, because you will use this later to thin out the caramel sauce and turn it into syrup."
        },
        {
          "headline":"Uncover the pan and continue heating.",
          "description":"After boiling for two to three minutes, keep the pan on the heat and remove the lid. Continue heating and stirring the mixture until it becomes light amber in color. Remove the pan from the heat."
        },
        {
          "headline":"Add the remaining ingredients.",
          "description":"Slowly whisk in the remaining ½ cup (119 ml) of water, the vanilla, and the salt. Be very careful, as the hot caramel sauce may spatter when you add the water. Cool the mixture before serving or bottling. Store in the refrigerator."
        }
      ]
    },
    {
      "name":"Hazelnut Coffee Syrup",
      "steps":[
        {
          "headline":"Roast the hazelnuts.",
          "description":"Preheat your oven to 320°F (160°C). Spread the hazelnuts out on a baking sheet and bake them for 15 to 20 minutes, until golden brown. Remove the nuts from the oven and let them cool for 10 minutes."
        },
        {
          "headline":"Crush the nuts.",
          "description":"Transfer the nuts to a food processor and pulse them a few times. You want the hazelnuts to be in pea-sized chunks. If you don’t have a food processor, place the nuts in a clean tea towel or sealable plastic bag and roll over them with a rolling pin."
        },
        {
          "headline":"Make the syrup.",
          "description":"Combine the sugar, honey, and water in a saucepan. Bring them to a boil over medium heat. Add the nuts and boil the mixture for another five minutes, stirring regularly. Reduce the heat to medium¬-low and continue cooking for another five to 10 minutes, until the mixture reduces to about two-thirds of its original quantity."
        },
        {
          "headline":"Cool and strain the syrup.",
          "description":"Remove the pan from the heat and allow the syrup to cool to room temperature, about an hour. When it’s cool enough to bottle, strain the mixture through a fine-mesh strainer. Transfer the syrup to a bottle and store in the refrigerator."
        }
      ]
    }
  ],
  "text":" Simple Syrup Combine the sugar and water. Pour the sugar and water into a small saucepan and stir the two together. The two won’t combine properly until the sugar dissolves in the water, which will happen when you add heat. To increase your simple syrup yield, increase the amount of sugar and water you use, sticking with the one-to-one ratio. Heat the mixture. To turn your sugar and water mixture into syrup, heat the mixture over medium-high heat to dissolve the sugar. Bring the mixture to a boil. When the syrup starts to boil, reduce the heat to medium and simmer it for three minutes. While the sugar will eventually dissolve in cold water, this can take hours or days to occur. Moreover, if you don’t add heat to the mixture, none of the water will boil off, so the syrup won’t be as thick. Cool and bottle the syrup. After simmering for three minutes, remove the syrup from the heat. Set it aside to cool for 30 minutes to an hour. Transfer the syrup into a sterilized storage jar with a lid and refrigerate it. Simple syrup will keep in the fridge for at least a month. Good storage containers for simple syrup include:\nPlastic squeeze bottles\nWine bottles with screw lids\nClean vinegar or oil jugs\nMaple syrup bottles Basic Simple Syrup Variations Try vanilla or almond simple syrup. There are many simple syrup variations that use the same technique as simple syrup, but they include different ingredients. To make a vanilla or almond syrup, heat equal amounts of sugar and water in the saucepan and bring it to a boil on medium-high heat. Reduce the temperature to medium and simmer for three minutes. Remove the syrup from the heat and set it aside to cool for 10 minutes. Whisk in 2 teaspoons (10 ml) of vanilla or almond extract. Let the mixture cool completely before bottling. Make coffee-flavored syrup. Combine the sugar, water, and coffee in a saucepan. Bring the mixture to a boil over medium heat, stirring occasionally to prevent burning and to incorporate all the ingredients. When the mixture boils, remove it from the heat. Set the mixture aside and let it cool to room temperature before bottling. Make a cinnamon dolce variety. To make cinnamon dolce simple syrup, replace the white sugar with brown sugar and maple syrup, use half the water, and add a stick of cinnamon. Bring all the ingredients to a boil in a saucepan over medium heat. Boil for five minutes, then remove the pan from the heat. Leave the mixture to cool with the cinnamon stick for about 15 minutes. Remove the stick, and transfer the mixture to a bottle. Store in the refrigerator. Make seasonal pumpkin simple syrup. Whisk together all the ingredients in a small saucepan. Bring the mixture to a boil over medium-high heat, stirring regularly. When the mixture boils, reduce the heat to medium and simmer for 10 minutes. After 10 minutes remove the pan from the heat and let it cool. When the syrup reaches room temperature after about an hour, strain it through a strainer lined with cheesecloth to remove the pumpkin puree and spices. Transfer to a bottle and refrigerate. Caramel Coffee Syrup Melt the sugars. There are also other flavored coffee syrup variations that are a little more involved than just simple syrup, and they include caramel and hazelnut syrups. For the caramel, combine the sugar, corn syrup, and ¼ cup (59 ml) of the water in a small saucepan. Heat the mixture over medium-high heat and bring it to a boil. Cover the pan with a lid and boil for two to three minutes. Reserve ½ cup (119 ml) of water, because you will use this later to thin out the caramel sauce and turn it into syrup. Uncover the pan and continue heating. After boiling for two to three minutes, keep the pan on the heat and remove the lid. Continue heating and stirring the mixture until it becomes light amber in color. Remove the pan from the heat. Add the remaining ingredients. Slowly whisk in the remaining ½ cup (119 ml) of water, the vanilla, and the salt. Be very careful, as the hot caramel sauce may spatter when you add the water. Cool the mixture before serving or bottling. Store in the refrigerator. Hazelnut Coffee Syrup Roast the hazelnuts. Preheat your oven to 320°F (160°C). Spread the hazelnuts out on a baking sheet and bake them for 15 to 20 minutes, until golden brown. Remove the nuts from the oven and let them cool for 10 minutes. Crush the nuts. Transfer the nuts to a food processor and pulse them a few times. You want the hazelnuts to be in pea-sized chunks. If you don’t have a food processor, place the nuts in a clean tea towel or sealable plastic bag and roll over them with a rolling pin. Make the syrup. Combine the sugar, honey, and water in a saucepan. Bring them to a boil over medium heat. Add the nuts and boil the mixture for another five minutes, stirring regularly. Reduce the heat to medium¬-low and continue cooking for another five to 10 minutes, until the mixture reduces to about two-thirds of its original quantity. Cool and strain the syrup. Remove the pan from the heat and allow the syrup to cool to room temperature, about an hour. When it’s cool enough to bottle, strain the mixture through a fine-mesh strainer. Transfer the syrup to a bottle and store in the refrigerator.",
  "tyn_model":[
    "water",
    "sugar",
    "simple syrup",
    "saucepan",
    "pan",
    "small saucepan",
    "refrigerator",
    "hazelnuts",
    "oven",
    "food processor",
    "bottle",
    "plastic squeeze bottles",
    "wine bottles",
    "clean vinegar",
    "oil jugs",
    "maple syrup bottles",
    "vanilla or almond extract",
    "coffee",
    "cinnamon dolce variety",
    "cinnamon dolce simple syrup",
    "white sugar",
    "brown sugar",
    "maple syrup",
    "cinnamon",
    "cinnamon stick",
    "seasonal pumpkin simple syrup",
    "strainer",
    "caramel coffee syrup",
    "coffee syrup",
    "corn syrup",
    "vanilla",
    "salt",
    "caramel sauce",
    "hazelnut coffee syrup",
    "baking sheet",
    "tea towel",
    "rolling pin",
    "honey",
    "nuts",
    "fine-mesh strainer"
  ],
  "tyn_section":[

  ]
}