{
  "title":"How to Invite Players on Forge of Empires",
  "url":"https://www.wikihow.com/Invite-Players-on-Forge-of-Empires",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games"
  ],
  "parts":[
    {
      "name":"Getting to the \"Invite a Friend\" Menu",
      "steps":[
        {
          "headline":"Log into the game.",
          "description":"Click 'play' and click on one of the worlds you play in. Then, at the bottom of the screen, where all your neighbors are, there are 3 little buttons with symbols on them: the first one is your neighborhood list, the second one is for your guild and the third one is for your friends."
        },
        {
          "headline":"Click on the third button.",
          "description":"It will load up the friends list. It should be empty if you are doing this for the first time."
        },
        {
          "headline":"Find the square button that says, \"Invite a friend.\"",
          "description":"Click on it and it will load up the invitation menu."
        },
        {
          "headline":"Review the menu.",
          "description":"The first page of the menu tells you what you can get if your friend reaches a certain age/era. Click on the 'Invite friends' tab; there you can see multiple ways of sending your friend an invite!"
        },
        {
          "headline":"Click on the Facebook logo and it will open a new browser tab with your Facebook.",
          "description":""
        },
        {
          "headline":"Share the link on your Facebook and your friends and/or family can click it to start playing the game.",
          "description":""
        },
        {
          "headline":"Find the symbol of an envelope on the menu.",
          "description":"Click on it and unlike the Facebook method, it won't open up a new tab on your browser. Instead, it will appear like this."
        },
        {
          "headline":"Follow the instructions on the menu.",
          "description":"Type in the full name of your friend at the top, insert your friend's email address and then insert your full name (not your Forge of Empires username)."
        },
        {
          "headline":"Afterwards, click send email and it will reach your friend soon!",
          "description":""
        },
        {
          "headline":"Click on the Twitter logo from the \"Invite a Friend\" menu.",
          "description":"You might need to scroll down to see it."
        },
        {
          "headline":"Like with Facebook, it will open up a new browser tab.",
          "description":"Simply Tweet it and your followers and friends can see the link and click on it if they are interested."
        },
        {
          "headline":"Scroll down in the \"Invite a Friend menu\" to see the Google logo.",
          "description":"Click it."
        },
        {
          "headline":"Wait for it to open a new tab.",
          "description":"Below the link is a bar where you enter your friend's email addresses and it will send emails with the link on them from there instead of from the game."
        }
      ]
    },
    {
      "name":"Adding Friends",
      "steps":[
        {
          "headline":"Go back to your Friends list by clicking on the Friends tab.",
          "description":""
        },
        {
          "headline":"Click on the 'Add friends' tab.",
          "description":""
        },
        {
          "headline":"Insert the player's username into the search bar.",
          "description":""
        },
        {
          "headline":"Click on the orange button next to it with a magnifying glass on it.",
          "description":"The player's username, their profile picture and other information will appear below it."
        }
      ]
    }
  ],
  "text":" Getting to the \"Invite a Friend\" Menu Log into the game. Click 'play' and click on one of the worlds you play in. Then, at the bottom of the screen, where all your neighbors are, there are 3 little buttons with symbols on them: the first one is your neighborhood list, the second one is for your guild and the third one is for your friends. Click on the third button. It will load up the friends list. It should be empty if you are doing this for the first time. Find the square button that says, \"Invite a friend.\" Click on it and it will load up the invitation menu. Review the menu. The first page of the menu tells you what you can get if your friend reaches a certain age/era. Click on the 'Invite friends' tab; there you can see multiple ways of sending your friend an invite! Click on the Facebook logo and it will open a new browser tab with your Facebook.  Share the link on your Facebook and your friends and/or family can click it to start playing the game.  Find the symbol of an envelope on the menu. Click on it and unlike the Facebook method, it won't open up a new tab on your browser. Instead, it will appear like this. Follow the instructions on the menu. Type in the full name of your friend at the top, insert your friend's email address and then insert your full name (not your Forge of Empires username). Afterwards, click send email and it will reach your friend soon!  Click on the Twitter logo from the \"Invite a Friend\" menu. You might need to scroll down to see it. Like with Facebook, it will open up a new browser tab. Simply Tweet it and your followers and friends can see the link and click on it if they are interested. Scroll down in the \"Invite a Friend menu\" to see the Google logo. Click it. Wait for it to open a new tab. Below the link is a bar where you enter your friend's email addresses and it will send emails with the link on them from there instead of from the game. Adding Friends Go back to your Friends list by clicking on the Friends tab.  Click on the 'Add friends' tab.  Insert the player's username into the search bar.  Click on the orange button next to it with a magnifying glass on it. The player's username, their profile picture and other information will appear below it.",
  "tyn_model":[
    "facebook",
    "envelope",
    "twitter",
    "magnifying glass"
  ],
  "tyn_section":[

  ]
}