{
  "title":"How to Beat the New Super Mario Bros DS",
  "url":"https://www.wikihow.com/Beat-the-New-Super-Mario-Bros-DS",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo DS",
    "New Super Mario Bros DS"
  ],
  "steps":[
    {
      "headline":"Know the controls of the game in order to play.",
      "description":"Here are the basics:\nA=Jump\nY=Make Mario go faster. Control Pad= Makes Mario walk. Start= Pause."
    },
    {
      "headline":"There are 8 worlds and each world has a theme.",
      "description":"World 1 is mostly a grassland/calm world as it is were Princess Peaches Castle is."
    },
    {
      "headline":"After watching the intro you will have to play level 1.",
      "description":""
    },
    {
      "headline":"Walk along until you see four boxes.",
      "description":"A dark red mushroom will come along. These are goombas and they harm you. Jump on it in order to defeat it. Keep playing along. The rest will come naturally."
    },
    {
      "headline":"Keep practicing.",
      "description":"If you do then you will know the controls better and the enemies better as well."
    },
    {
      "headline":"As you progress you may notice random mushrooms along the map.",
      "description":"These are mushroom houses, each holding useful items for you. You must use star coins to unlock them. Star coins are found in levels and there is three per level. Here is a guide to the mushroom houses. Green mushrooms: 1-Ups, these will give you extra lives. Yellow mushrooms: These contain one giant mushroom which will make Mario a giant. Red mushroom: These hold miscellaneous power ups."
    },
    {
      "headline":"After a couple of levels you will have to play in a tower.",
      "description":"Towers have Bowser Junior. Bowser's son. The towers are full of traps and dangerous things. To defeat Bowser Jr. you must jump on him three times. Later in the game you must use shells to make him fall over before you can jump on him."
    },
    {
      "headline":"After a few levels you will come to a castle.",
      "description":"Again, these are full of traps and harder than towers. You will come across a different boss in each castle. Bowser however appears in the World 1 castle and world 8 castles."
    },
    {
      "headline":"As you keep progressing you'll notice that you don't go to World 4 or 7.",
      "description":"Here is the key to getting to those worlds. World 4: Defeat the World 2 boss as mini Mario. This will be hard however as if mini Mario is hit once, he dies. World 7: Defeat the World 5 boss as mini Mario. You can also get to World 7 by using the World 4 cannon."
    },
    {
      "headline":"The last World 8 castle is the hardest.",
      "description":"Its confusing and dangerous. Luckily there are guides online guiding you through the rest of the game and the castle."
    },
    {
      "headline":"If you make it then you will have to face Bowser and Bowser Junior.",
      "description":"The best method to defeat them is to get a mega mushroom which makes Mario giant."
    },
    {
      "headline":"Well done!",
      "description":"You've completed the game. Now you can get all the star coins, 99 lives and more."
    }
  ],
  "text":" Know the controls of the game in order to play. Here are the basics:\nA=Jump\nY=Make Mario go faster. Control Pad= Makes Mario walk. Start= Pause. There are 8 worlds and each world has a theme. World 1 is mostly a grassland/calm world as it is were Princess Peaches Castle is. After watching the intro you will have to play level 1.  Walk along until you see four boxes. A dark red mushroom will come along. These are goombas and they harm you. Jump on it in order to defeat it. Keep playing along. The rest will come naturally. Keep practicing. If you do then you will know the controls better and the enemies better as well. As you progress you may notice random mushrooms along the map. These are mushroom houses, each holding useful items for you. You must use star coins to unlock them. Star coins are found in levels and there is three per level. Here is a guide to the mushroom houses. Green mushrooms: 1-Ups, these will give you extra lives. Yellow mushrooms: These contain one giant mushroom which will make Mario a giant. Red mushroom: These hold miscellaneous power ups. After a couple of levels you will have to play in a tower. Towers have Bowser Junior. Bowser's son. The towers are full of traps and dangerous things. To defeat Bowser Jr. you must jump on him three times. Later in the game you must use shells to make him fall over before you can jump on him. After a few levels you will come to a castle. Again, these are full of traps and harder than towers. You will come across a different boss in each castle. Bowser however appears in the World 1 castle and world 8 castles. As you keep progressing you'll notice that you don't go to World 4 or 7. Here is the key to getting to those worlds. World 4: Defeat the World 2 boss as mini Mario. This will be hard however as if mini Mario is hit once, he dies. World 7: Defeat the World 5 boss as mini Mario. You can also get to World 7 by using the World 4 cannon. The last World 8 castle is the hardest. Its confusing and dangerous. Luckily there are guides online guiding you through the rest of the game and the castle. If you make it then you will have to face Bowser and Bowser Junior. The best method to defeat them is to get a mega mushroom which makes Mario giant. Well done! You've completed the game. Now you can get all the star coins, 99 lives and more.",
  "tyn_model":[
    "mushroom",
    "mushrooms",
    "bowser",
    "mushroom houses",
    "control pad=",
    "towers"
  ],
  "tyn_section":[

  ]
}