{
  "title":"How to Make Rose Madeleines With Glittered Honey Lemon Glaze",
  "url":"https://www.wikihow.com/Make-Rose-Madeleines-With-Glittered-Honey-Lemon-Glaze",
  "category_hierarchy":[
    "Food and Entertaining",
    "Herbs and Spices"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 200ºC/400ºF.",
      "description":"Lightly grease the two madeleine pans."
    },
    {
      "headline":"In a separate small bowl, combine the sifted flour and baking powder.",
      "description":"Set aside."
    },
    {
      "headline":"In a large bowl, combine the eggs, sugar and brown sugar.",
      "description":"Using a spatula, fold in the dry ingredients until just combined; the batter will be slightly stiff. Add the butter and rose water, mixing until just combined (do not over-mix). Cover and refrigerate for 30 minutes."
    },
    {
      "headline":"Spread a heaping tablespoon of the batter evenly into each madeleine cup and bake for 8 to 10 minutes, until a hunchback has formed on the cookies and they are golden brown.",
      "description":"Unmold them immediately onto a wire rack and allow them to cool completely."
    },
    {
      "headline":"While the madeleines are cooling, make the glaze: in a small bowl, combine the confectioners’ sugar, the lemon juice and  whisk until the mixture is smooth.",
      "description":""
    },
    {
      "headline":"Dip some glaze onto the ridged side of each madeleine, sprinkle the sparkling candy and let the glaze set for about 5 minutes before serving or storing.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 200ºC/400ºF. Lightly grease the two madeleine pans. In a separate small bowl, combine the sifted flour and baking powder. Set aside. In a large bowl, combine the eggs, sugar and brown sugar. Using a spatula, fold in the dry ingredients until just combined; the batter will be slightly stiff. Add the butter and rose water, mixing until just combined (do not over-mix). Cover and refrigerate for 30 minutes. Spread a heaping tablespoon of the batter evenly into each madeleine cup and bake for 8 to 10 minutes, until a hunchback has formed on the cookies and they are golden brown. Unmold them immediately onto a wire rack and allow them to cool completely. While the madeleines are cooling, make the glaze: in a small bowl, combine the confectioners’ sugar, the lemon juice and  whisk until the mixture is smooth.  Dip some glaze onto the ridged side of each madeleine, sprinkle the sparkling candy and let the glaze set for about 5 minutes before serving or storing. ",
  "tyn_model":[
    "oven",
    "madeleine pans",
    "flour",
    "baking powder",
    "eggs",
    "sugar",
    "brown sugar",
    "spatula",
    "butter",
    "rose water",
    "wire rack",
    "confectioners’ sugar",
    "lemon juice",
    "whisk"
  ],
  "tyn_section":[

  ]
}