{
  "title":"How to Make Apple Souffle",
  "url":"https://www.wikihow.com/Make-Apple-Souffle",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Fruit Desserts"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 180ºC/350ºF.",
      "description":""
    },
    {
      "headline":"Core the apples and cut them into thin slices.",
      "description":""
    },
    {
      "headline":"Melt the butter.",
      "description":"Add the honey, lemon juice, lemon peel, and apples."
    },
    {
      "headline":"Cook over a low heat until the apples turn tender and the liquid is absorbed.",
      "description":"Stir frequently to prevent sticking."
    },
    {
      "headline":"Put the cooked apple mixture into the base of a casserole dish.",
      "description":""
    },
    {
      "headline":"Separate the eggs.",
      "description":"Beat the whites until stiff. Beat the egg yolks, vanilla essence, sour cream, and honey or sugar. Gently fold the beaten egg whites into the egg yolk mixture."
    },
    {
      "headline":"Pour this mixture over the apples in the casserole dish.",
      "description":""
    },
    {
      "headline":"Place in the oven and bake for 20 minutes, until the souffle is puffy and lightly browned.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 180ºC/350ºF.  Core the apples and cut them into thin slices.  Melt the butter. Add the honey, lemon juice, lemon peel, and apples. Cook over a low heat until the apples turn tender and the liquid is absorbed. Stir frequently to prevent sticking. Put the cooked apple mixture into the base of a casserole dish.  Separate the eggs. Beat the whites until stiff. Beat the egg yolks, vanilla essence, sour cream, and honey or sugar. Gently fold the beaten egg whites into the egg yolk mixture. Pour this mixture over the apples in the casserole dish.  Place in the oven and bake for 20 minutes, until the souffle is puffy and lightly browned.  Finished. ",
  "tyn_model":[
    "apples",
    "oven",
    "honey",
    "casserole dish",
    "butter",
    "lemon juice",
    "lemon peel",
    "eggs",
    "vanilla essence",
    "sour cream",
    "sugar"
  ],
  "tyn_section":[

  ]
}