{
  "title":"How to Make Chocolate Cheesecake",
  "url":"https://www.wikihow.com/Make-Chocolate-Cheesecake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Dessert Pies",
    "Cheesecake"
  ],
  "steps":[
    {
      "headline":"Preheat your oven to 450 F (230 C, gas mark 8) and set aside a 9 to 12\" springform baking pan.",
      "description":""
    },
    {
      "headline":"Put the chocolate cookies in a plastic bag or a freezer bag and place it on a counter.",
      "description":""
    },
    {
      "headline":"Crush the cookies by pressing the base of a drinking glass into them.",
      "description":"The size of the crumbs is up to you."
    },
    {
      "headline":"Pour the crumbs into a medium bowl, along with the teaspoon of sugar and all of the melted butter.",
      "description":"Mix these together using a wooden spoon."
    },
    {
      "headline":"Pour the mixture into the pan you set aside earlier.",
      "description":""
    },
    {
      "headline":"Press the crust evenly into the base of the pan and up its sides using your fingers.",
      "description":""
    },
    {
      "headline":"Beat the cream cheese in a large bowl until it gets creamy.",
      "description":""
    },
    {
      "headline":"Add the almond extract and cup of sugar to the cheese and mix them in until they're incorporated.",
      "description":""
    },
    {
      "headline":"One at a time, mix each egg into the cheese mixture.",
      "description":""
    },
    {
      "headline":"Add the coffee powder, sour cream, and melted chocolate to the bowl.",
      "description":""
    },
    {
      "headline":"Mix everything together until the batter becomes a rich dark color.",
      "description":""
    },
    {
      "headline":"Pour the batter onto the cookie crust and use a spatula to even out the top.",
      "description":""
    },
    {
      "headline":"Bake the cake for 10 minutes.",
      "description":"After the 10 minutes, reduce the oven temperature to 300 F (140 degrees C, gas mark 1) and bake it for another hour. Turn off the heat after the cheesecake is done baking."
    },
    {
      "headline":"Cool the cake in the oven for about 3 hours.",
      "description":"Leaving it in the oven will keep it from cracking when you place it in the refrigerator."
    },
    {
      "headline":"Place the cake in the refrigerator after it's had a chance to thoroughly cool.",
      "description":"The colder the cheesecake gets, the firmer it will become."
    },
    {
      "headline":"Gently remove the cheesecake from the pan when you're ready to plate it.",
      "description":""
    },
    {
      "headline":"Cut the cheesecake into individual slices, serve them on dessert plates and drizzle leftover or additional melted chocolate over the top of the slices for an additional treat.",
      "description":""
    }
  ],
  "text":" Preheat your oven to 450 F (230 C, gas mark 8) and set aside a 9 to 12\" springform baking pan.  Put the chocolate cookies in a plastic bag or a freezer bag and place it on a counter.  Crush the cookies by pressing the base of a drinking glass into them. The size of the crumbs is up to you. Pour the crumbs into a medium bowl, along with the teaspoon of sugar and all of the melted butter. Mix these together using a wooden spoon. Pour the mixture into the pan you set aside earlier.  Press the crust evenly into the base of the pan and up its sides using your fingers.  Beat the cream cheese in a large bowl until it gets creamy.  Add the almond extract and cup of sugar to the cheese and mix them in until they're incorporated.  One at a time, mix each egg into the cheese mixture.  Add the coffee powder, sour cream, and melted chocolate to the bowl.  Mix everything together until the batter becomes a rich dark color.  Pour the batter onto the cookie crust and use a spatula to even out the top.  Bake the cake for 10 minutes. After the 10 minutes, reduce the oven temperature to 300 F (140 degrees C, gas mark 1) and bake it for another hour. Turn off the heat after the cheesecake is done baking. Cool the cake in the oven for about 3 hours. Leaving it in the oven will keep it from cracking when you place it in the refrigerator. Place the cake in the refrigerator after it's had a chance to thoroughly cool. The colder the cheesecake gets, the firmer it will become. Gently remove the cheesecake from the pan when you're ready to plate it.  Cut the cheesecake into individual slices, serve them on dessert plates and drizzle leftover or additional melted chocolate over the top of the slices for an additional treat. ",
  "tyn_model":[
    "oven",
    "sugar",
    "chocolate",
    "refrigerator",
    "springform baking pan",
    "plastic bag",
    "freezer bag",
    "drinking glass",
    "medium bowl",
    "butter",
    "wooden spoon",
    "cream cheese",
    "large bowl",
    "almond extract",
    "coffee powder",
    "sour cream",
    "bowl",
    "cookie crust",
    "spatula",
    "dessert plates"
  ],
  "tyn_section":[

  ]
}