{
  "title":"How to Play Snowball Tag",
  "url":"https://www.wikihow.com/Play-Snowball-Tag",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Backyard Games",
    "Tag and Chasing Games"
  ],
  "steps":[
    {
      "headline":"Create your \"ammo\" snow.",
      "description":"Set the amount of snowballs per round that each team gets, whether it's 2, 8, or infinite. You can also have the option of having teams create snowballs while playing."
    },
    {
      "headline":"Pick teams of two.",
      "description":"It can be a mix-match of kids and adults, adults and adults, or kids and kids."
    },
    {
      "headline":"Have the teams \"link\" together.",
      "description":"They must be together at all times of the rounds - holding hands, running around in a piggyback style way, hugging each other, etc."
    },
    {
      "headline":"\"Tag\" another team with the snowballs to get them eliminated.",
      "description":"At the same, teams must avoid being hit themselves."
    },
    {
      "headline":"Move to the next round when everyone is out of snowballs.",
      "description":"The teams that were untouched (didn't get hit) advance on. The last untouched team wins the game. If the rules include infinite snowballs, \"rounds\" don't apply for this."
    }
  ],
  "text":" Create your \"ammo\" snow. Set the amount of snowballs per round that each team gets, whether it's 2, 8, or infinite. You can also have the option of having teams create snowballs while playing. Pick teams of two. It can be a mix-match of kids and adults, adults and adults, or kids and kids. Have the teams \"link\" together. They must be together at all times of the rounds - holding hands, running around in a piggyback style way, hugging each other, etc. \"Tag\" another team with the snowballs to get them eliminated. At the same, teams must avoid being hit themselves. Move to the next round when everyone is out of snowballs. The teams that were untouched (didn't get hit) advance on. The last untouched team wins the game. If the rules include infinite snowballs, \"rounds\" don't apply for this.",
  "tyn_model":[
    "snowballs"
  ],
  "tyn_section":[

  ]
}