{
  "title":"How to Rejuvenate Tapestry Furniture",
  "url":"https://www.wikihow.com/Rejuvenate-Tapestry-Furniture",
  "category_hierarchy":[
    "Home and Garden",
    "Furniture",
    "Upholstery"
  ],
  "steps":[
    {
      "headline":"Dampen some salt.",
      "description":"Do not make it wet, just moist."
    },
    {
      "headline":"Using a soft cloth, rub the dampened salt across the tapestry surface of the piece of furniture.",
      "description":"Rub it in well, all over the tapestry covering."
    },
    {
      "headline":"Leave the salt there for half an hour.",
      "description":""
    },
    {
      "headline":"Brush the salt off using a soft brush.",
      "description":"Brush it into a duster pan and have the vacuum handy to catch salt from the floor. If you have a soft brush attachment to your vacuum and a very gentle sucking mode, you might be able to use the vacuum direct on the tapestry but it is a good idea to be cautious of using such power around delicate threads."
    },
    {
      "headline":"Stand back and admire.",
      "description":"The salt should have removed the dust and will have refreshed the colours of the tapestry like new."
    }
  ],
  "text":" Dampen some salt. Do not make it wet, just moist. Using a soft cloth, rub the dampened salt across the tapestry surface of the piece of furniture. Rub it in well, all over the tapestry covering. Leave the salt there for half an hour.  Brush the salt off using a soft brush. Brush it into a duster pan and have the vacuum handy to catch salt from the floor. If you have a soft brush attachment to your vacuum and a very gentle sucking mode, you might be able to use the vacuum direct on the tapestry but it is a good idea to be cautious of using such power around delicate threads. Stand back and admire. The salt should have removed the dust and will have refreshed the colours of the tapestry like new.",
  "tyn_model":[
    "salt",
    "vacuum",
    "duster pan"
  ],
  "tyn_section":[

  ]
}