{
  "title":"How to Choose and Use Doormats",
  "url":"https://www.wikihow.com/Choose-and-Use-Doormats",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Decoration Projects"
  ],
  "steps":[
    {
      "headline":"Mat all outside entrances, especially those with heavy traffic.",
      "description":"Depending on your living situation, you may have doors to the back or side yards in addition to just the front. Make sure all have doormats. Also mat entrances to the main part of your house from messier or unfinished areas such as a basement, workshop or garage."
    },
    {
      "headline":"Mat inside and outside.",
      "description":"Having two mats gives you a second chance to catch whatever is on the bottom of shoes."
    },
    {
      "headline":"Try to mat at least four steps.",
      "description":"Use longer mats inside and outside so that most people who enter will end up stepping on each mat at least once with each foot."
    },
    {
      "headline":"Scrape off large debris.",
      "description":"For outside mats, choose something that has loops, brush-like fibers, or a bit of grit in it to remove and trap large debris. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/02\\/Boot-Scraper-7180.jpg\\/460px-Boot-Scraper-7180.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/02\\/Boot-Scraper-7180.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image from: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/www.flickr.com\\/photos\\/35034359460@N01\\/55993396\\\">Flickr<\\/a> <br>Taken by: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/www.flickr.com\\/people\\/35034359460@N01\\\">Peter Kaminski<\\/a><br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-sa\\/2.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}  A boot scraper. Mount a boot scraper for entrances where you have (or expect) a lot of mud or snow, and encourage people to use it if they accumulate heavy soil on their shoes."
    },
    {
      "headline":"Absorb moisture.",
      "description":"Indoor mats often look a little more like carpet. Choose fibers that will absorb moisture. In wet or heavy traffic areas, make sure that moisture is also contained. Some mats are hybrids, providing both absorbency and scraping functions. Use these instead of a purely absorbent second stage or as the second stage of three if you have a larger entrance or garage or mud room to mat."
    },
    {
      "headline":"Choose mats according to whether they will be indoors or outdoors.Choose outdoor mats that are designed as such, built to take weather and temperature changes.",
      "description":"If outdoor mats will be in an uncovered area, choose an open style that will drain out water quickly. Choose indoor mats that won't damage or discolor the floor underneath and that fit with the style of the room. Choose colors that don't show dirt. Dark and mottled colors are good choices. Remember, if you choose good doormats, they will collect lots of dirt."
    },
    {
      "headline":"Choose mats according to traffic and use.",
      "description":"How often does an entrance get used? Does the mat need to be decorative in addition to being functional?"
    },
    {
      "headline":"Clean your mats periodically.",
      "description":"It is possible for doormats to get so full of dirt, debris, or moisture that they no longer clean shoes very much. Shake, vacuum, or sweep out loose debris. If the mat is fairly dry, this may be all you need to do. It's a good first step for wet cleaning. Check washing instructions for indoor throw rugs. Many can be washed in a machine and line dried. Spray down outdoor mats with a nozzle on a garden hose."
    }
  ],
  "text":" Mat all outside entrances, especially those with heavy traffic. Depending on your living situation, you may have doors to the back or side yards in addition to just the front. Make sure all have doormats. Also mat entrances to the main part of your house from messier or unfinished areas such as a basement, workshop or garage. Mat inside and outside. Having two mats gives you a second chance to catch whatever is on the bottom of shoes. Try to mat at least four steps. Use longer mats inside and outside so that most people who enter will end up stepping on each mat at least once with each foot. Scrape off large debris. For outside mats, choose something that has loops, brush-like fibers, or a bit of grit in it to remove and trap large debris. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/0\\/02\\/Boot-Scraper-7180.jpg\\/460px-Boot-Scraper-7180.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/02\\/Boot-Scraper-7180.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>Image from: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/www.flickr.com\\/photos\\/35034359460@N01\\/55993396\\\">Flickr<\\/a> <br>Taken by: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/www.flickr.com\\/people\\/35034359460@N01\\\">Peter Kaminski<\\/a><br>\\nLicense: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-sa\\/2.0\\/\\\">Creative Commons<\\/a>\\n<\\/p><\\/div>\"}  A boot scraper. Mount a boot scraper for entrances where you have (or expect) a lot of mud or snow, and encourage people to use it if they accumulate heavy soil on their shoes. Absorb moisture. Indoor mats often look a little more like carpet. Choose fibers that will absorb moisture. In wet or heavy traffic areas, make sure that moisture is also contained. Some mats are hybrids, providing both absorbency and scraping functions. Use these instead of a purely absorbent second stage or as the second stage of three if you have a larger entrance or garage or mud room to mat. Choose mats according to whether they will be indoors or outdoors.Choose outdoor mats that are designed as such, built to take weather and temperature changes. If outdoor mats will be in an uncovered area, choose an open style that will drain out water quickly. Choose indoor mats that won't damage or discolor the floor underneath and that fit with the style of the room. Choose colors that don't show dirt. Dark and mottled colors are good choices. Remember, if you choose good doormats, they will collect lots of dirt. Choose mats according to traffic and use. How often does an entrance get used? Does the mat need to be decorative in addition to being functional? Clean your mats periodically. It is possible for doormats to get so full of dirt, debris, or moisture that they no longer clean shoes very much. Shake, vacuum, or sweep out loose debris. If the mat is fairly dry, this may be all you need to do. It's a good first step for wet cleaning. Check washing instructions for indoor throw rugs. Many can be washed in a machine and line dried. Spray down outdoor mats with a nozzle on a garden hose.",
  "tyn_model":[
    "mats",
    "mat",
    "boot scraper",
    "grit",
    "boot-scraper-7180.jpg\",\"bigurl\":\"https:\\/\\/www.wikihow.com\\/images\\/0\\/02\\/boot",
    "parser",
    "water",
    "vacuum",
    "outdoor mats",
    "garden hose"
  ],
  "tyn_section":[

  ]
}