{
  "title":"How to Block Crocheted Articles",
  "url":"https://www.wikihow.com/Block-Crocheted-Articles",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Needlework",
    "Knitting and Crochet",
    "Crochet"
  ],
  "steps":[
    {
      "headline":"Spread a pad on a table or on the floor.",
      "description":"The pad needs to be one that you can pin the article to and stretch the article over."
    },
    {
      "headline":"Turn the crocheted article wrong side up.",
      "description":""
    },
    {
      "headline":"Pin the article onto the pad.",
      "description":"Use rust-proof pins. Place a pin about every inch / 2.5 centimeter (1.0 in), stretching the crocheted garment to the original measurements. Keep the pins close together to avoid creating a scalloped edge."
    },
    {
      "headline":"Lay a damp cloth over the article.",
      "description":""
    },
    {
      "headline":"Hover a hot iron lightly over the cloth, allowing the steam to go through the article, but do not let the weight of the iron rest or press on it.",
      "description":"If the yarn is smooth and flat, a fast press is permissible but do not do this for any fluffy or bumpy yarn and never with synthetic threads or yarns."
    },
    {
      "headline":"Leave the article pinned to the pad until it is dry.",
      "description":""
    },
    {
      "headline":"Remove once dry and the article should be successfully blocked.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Spread a pad on a table or on the floor. The pad needs to be one that you can pin the article to and stretch the article over. Turn the crocheted article wrong side up.  Pin the article onto the pad. Use rust-proof pins. Place a pin about every inch / 2.5 centimeter (1.0 in), stretching the crocheted garment to the original measurements. Keep the pins close together to avoid creating a scalloped edge. Lay a damp cloth over the article.  Hover a hot iron lightly over the cloth, allowing the steam to go through the article, but do not let the weight of the iron rest or press on it. If the yarn is smooth and flat, a fast press is permissible but do not do this for any fluffy or bumpy yarn and never with synthetic threads or yarns. Leave the article pinned to the pad until it is dry.  Remove once dry and the article should be successfully blocked.  Finished. ",
  "tyn_model":[
    "pins",
    "pin",
    "cloth",
    "hot iron",
    "iron"
  ],
  "tyn_section":[

  ]
}