{
  "title":"How to Unclog a Toilet",
  "url":"https://www.wikihow.com/Unclog-a-Toilet",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Home Repairs"
  ],
  "methods":[
    {
      "name":"Plunging the Toilet",
      "steps":[
        {
          "headline":"Keep the toilet from overflowing.",
          "description":"If your toilet doesn't flush properly after one flush, don't flush again. This will cause more water to be pumped into the toilet bowl. Instead, take the lid off of the toilet tank and close the toilet flapper. Closing the flapper will keep more water from entering the bowl. The flapper looks like a circular drain stopper attached to a chain. The water in the tank isn't dirty, so it's fine to stick your hand inside to close the flapper."
        },
        {
          "headline":"Prepare the bathroom.",
          "description":"In case splashing occurs, place newspapers or paper towels on the floor to soak up liquid. The paper will make for easier cleanup later. You should also turn on the ventilation fan or open a window to rid the area of foul odors. If the clog is serious, put on a pair of rubber gloves. Toilets are unsanitary, but a good pair of rubber cleaning gloves will protect you from any germs within. Choose gloves that reach up to your elbows. You may also want to put on an old set of clothing, just in case things get messy."
        },
        {
          "headline":"See if you can clear the obstruction.",
          "description":"If you can see the cause of the clog, reach in and remove it from the toilet if possible. If you can't clear it with your hands, but you know there's an object (such as a child's toy) causing the clog, skip the plunging and go straight to another method."
        },
        {
          "headline":"Use a high quality plunger.",
          "description":"It is important to use a large heavy-duty rubber plunger, either the ball-shaped type or one with a fold-out rubber flange on the bottom which forms a seal. Do not use the small cheap suction-cup type of plunger. These will often not work. Run the plunger under hot water before using it. This will soften it up, which will help with create a seal."
        },
        {
          "headline":"Insert the plunger into the bowl.",
          "description":"Make sure the plunger completely covers the hole. The plunger should be submerged in water to be effective. It is important to be pushing and pulling water through the opening, not air. Add water from the sink to the bowl if necessary. Pump the plunger over the hole. Start slowly at first, since the first plunge will push air into the bowl. Push down, then pull up sharply to disturb the clog and loosen it. Continue vigorously pushing and pulling until the water begins to drain. It may take 15 to 20 cycles before the toilet unclogs. Be patient. As long as you're sure there's no hard object, plunging alone often suffices. It might not work immediately but will often work after a few repeated efforts and flushings, with each effort consisting of dozens of plunge cycles."
        },
        {
          "headline":"Flush the toilet to check the drainage.",
          "description":"If the plunging eventually drains the bowl, but the clog is still blocking a free flow down the drain, leave the plunger in the bowl and fill the bowl with water again. Fill it to the point it is normally after a regular flush, then plunge again. Stubborn clogs might require you to do this a number of times."
        }
      ]
    },
    {
      "name":"Using an Enzyme Product",
      "steps":[
        {
          "headline":"Purchase an enzyme waste removal product.",
          "description":"Look for a product that contains a mixture of enzymes that liquify waste materials. These enzymes are used in septic systems to break down waste. Products of this sort can be usually be purchased at home improvement stores in or near the plumbing aisle. Enzyme waste removal is preferable to using a drain-clearing chemical because it will not harm your pipes or the environment. This method will only work on organic waste, not toys or other objects."
        },
        {
          "headline":"Follow the instructions on the container.",
          "description":"Pour the recommended amount of the enzyme product into the toilet bowl. You will typically be instructed to wait overnight for the enzymes to go to work on the clog. The toilet should drain once the clog has cleared."
        }
      ]
    },
    {
      "name":"Making a Drain Cleaner",
      "steps":[
        {
          "headline":"Heat half a gallon of water.",
          "description":"If the toilet tends to clog easily as the result of trying to flush too much waste, using a combination of hot water, baking soda and vinegar will often do the job as well as a commercial drain cleaner. Boil half a gallon of water, then let it cool for a moment while you add other ingredients to the toilet bowl. Use at least half a gallon. A small amount of water won't work, since it won't have enough force to push through the clog. The water should be no hotter than a hot tea you can drink comfortably. It should not be boiling, since very hot water can crack porcelain. You want to raise the temperature of the water passing around or pressing on the clog."
        },
        {
          "headline":"Pour 1 cup baking soda and 2 cups vinegar into the toilet.",
          "description":"The baking soda and vinegar create a chemical process that help to dissolve clogs. Distilled white vinegar is commonly used, but any type of vinegar will work. The mixture will fizz a great deal. If you don't have baking soda and vinegar on hand, try adding a few squirts of dish soap to the toilet bowl. The soap may help to loosen the clog. This method isn't likely to work for clogs caused by a hard obstruction, such as a toy."
        },
        {
          "headline":"Pour the hot water into the bowl.",
          "description":"Pour it from waist level, rather than right near the rim. The force of the water falling into the bowl can help to clear the clog."
        },
        {
          "headline":"Let the mixture stand overnight.",
          "description":"In the morning, the water should have drained. This homemade drain cleaner should successfully clear clogs caused by organic material. If the water won't flush on your second try, you may have hard obstruction causing the clog. Try using a wire coat hanger or a drain snake."
        }
      ]
    },
    {
      "name":"Using a Plumbing Snake",
      "steps":[
        {
          "headline":"Purchase or borrow a plumbing snake.",
          "description":"A plumbing snake (also sometimes called a \"flexible cleaning tool\" or \"auger\") is a flexible coil of wire that can \"snake\" through the curves of a drain and get deeper than a wire can. The best snake is a \"closet auger\" which is designed specifically to clear toilet clogs without damaging or staining the bowl. A plumber would likely use a closet auger."
        },
        {
          "headline":"Insert one end of the snake into the drain.",
          "description":"Push down, feeding the snake further into the drain until you feel an obstruction."
        },
        {
          "headline":"Twist and push the snake through the obstruction.",
          "description":"The goal is to break up the obstruction into smaller pieces that can move through the pipes. It may take a few minutes of maneuvering to clear the obstruction. Once the water drains, flush the toilet to see whether it drains as quickly as normal."
        },
        {
          "headline":"Snake in reverse.",
          "description":"It may become necessary to remove the toilet and run the snake through in the opposite direction. This is especially true with hard obstructions that may have been flushed by a curious child. If the obstruction is known to be hard and you are not comfortable removing and replacing the toilet, contact a plumber."
        }
      ]
    },
    {
      "name":"Fashioning a Wire Coat Hanger",
      "steps":[
        {
          "headline":"Unravel and straighten a wire coat hanger.",
          "description":"Then wrap the end of the wire with a rag. Use duct tape to keep the rag in place. This will prevent the sharp end from damaging the porcelain in your toilet. The wire hanger method will generally work only if there is an obstruction in the first few inches of the drain."
        },
        {
          "headline":"Stick the wrapped end of the wire into the drain.",
          "description":"Once the wire is in the drain, twist it, push it, and maneuver it in a circular motion to clear the drain. If you can feel the obstruction, push against it. Keep going until the water begins to drain. Make sure you're wearing rubber gloves as you do this. You may get splashed as you move the wire around. If you can't feel an obstruction, and the toilet won't drain, the clog must be out of reach of the hanger. Try the plumbing snake method to clear it."
        },
        {
          "headline":"Flush the toilet once the water has drained.",
          "description":"The obstruction and dirty water should now be able to flow through the drain like normal. If the toilet is still slow to drain, the obstruction may have gotten pushed further back, out of reach of the hanger. In this case you'll need to use a plumbing snake to clear it."
        }
      ]
    },
    {
      "name":"Using a Chemical Drain Cleaner",
      "steps":[
        {
          "headline":"Purchase a chemical drain cleaner.",
          "description":"They're available at most grocery, hardware, and \"big box\" stores. Use this method only as a last resort. The chemicals used in drain cleaners are toxic to people and pets, corrosive to pipes. Also, chlorinated drain cleaner are very damaging to the environment. If you suspect that there is a hard obstruction, do not use a chemical solution. Instead, use a snake or call a plumber. Only use chemicals that are specifically made for toilets. Using other drain cleaners may damage your toilet."
        },
        {
          "headline":"Pour the specified amount into the toilet.",
          "description":"Be sure you follow the manufacturer's instructions. Keep the lid down to prevent toxic fumes from filling your bathroom. Never use a plunger right after adding the drain-cleaning chemicals. The chemicals could possibly shoot back up onto your skin. Make sure the bathroom is well ventilated so you won't inhale the chemicals."
        }
      ]
    },
    {
      "name":"Utilizing a Wet\\/Dry Vacuum",
      "steps":[
        {
          "headline":"Buy or borrow a wet/dry vacuum.",
          "description":"If you have tried plunging and snaking to no avail, consider using a wet/dry vacuum. Do not use an ordinary vacuum cleaner––it must be the wet/dry variety that can cope with water."
        },
        {
          "headline":"Empty the water out of the bowl using the vacuum.",
          "description":"The bowl must be free of water and any other debris in order to vacuum out the obstruction."
        },
        {
          "headline":"Place the end of the vacuum hose into the drain.",
          "description":"Push it into the toilet bowl a few inches into the hole. Use just the flexible hose, rather than an attachment. Coil an old towel around the hole to create a seal around the drain."
        },
        {
          "headline":"Turn on the vacuum.",
          "description":"Use one hand to put pressure on the towels to create a good seal. Wait a moment or two for the vacuum to work. There's a good chance the vacuum can suck out the clog."
        }
      ]
    }
  ],
  "text":" Plunging the Toilet Keep the toilet from overflowing. If your toilet doesn't flush properly after one flush, don't flush again. This will cause more water to be pumped into the toilet bowl. Instead, take the lid off of the toilet tank and close the toilet flapper. Closing the flapper will keep more water from entering the bowl. The flapper looks like a circular drain stopper attached to a chain. The water in the tank isn't dirty, so it's fine to stick your hand inside to close the flapper. Prepare the bathroom. In case splashing occurs, place newspapers or paper towels on the floor to soak up liquid. The paper will make for easier cleanup later. You should also turn on the ventilation fan or open a window to rid the area of foul odors. If the clog is serious, put on a pair of rubber gloves. Toilets are unsanitary, but a good pair of rubber cleaning gloves will protect you from any germs within. Choose gloves that reach up to your elbows. You may also want to put on an old set of clothing, just in case things get messy. See if you can clear the obstruction. If you can see the cause of the clog, reach in and remove it from the toilet if possible. If you can't clear it with your hands, but you know there's an object (such as a child's toy) causing the clog, skip the plunging and go straight to another method. Use a high quality plunger. It is important to use a large heavy-duty rubber plunger, either the ball-shaped type or one with a fold-out rubber flange on the bottom which forms a seal. Do not use the small cheap suction-cup type of plunger. These will often not work. Run the plunger under hot water before using it. This will soften it up, which will help with create a seal. Insert the plunger into the bowl. Make sure the plunger completely covers the hole. The plunger should be submerged in water to be effective. It is important to be pushing and pulling water through the opening, not air. Add water from the sink to the bowl if necessary. Pump the plunger over the hole. Start slowly at first, since the first plunge will push air into the bowl. Push down, then pull up sharply to disturb the clog and loosen it. Continue vigorously pushing and pulling until the water begins to drain. It may take 15 to 20 cycles before the toilet unclogs. Be patient. As long as you're sure there's no hard object, plunging alone often suffices. It might not work immediately but will often work after a few repeated efforts and flushings, with each effort consisting of dozens of plunge cycles. Flush the toilet to check the drainage. If the plunging eventually drains the bowl, but the clog is still blocking a free flow down the drain, leave the plunger in the bowl and fill the bowl with water again. Fill it to the point it is normally after a regular flush, then plunge again. Stubborn clogs might require you to do this a number of times. Using an Enzyme Product Purchase an enzyme waste removal product. Look for a product that contains a mixture of enzymes that liquify waste materials. These enzymes are used in septic systems to break down waste. Products of this sort can be usually be purchased at home improvement stores in or near the plumbing aisle. Enzyme waste removal is preferable to using a drain-clearing chemical because it will not harm your pipes or the environment. This method will only work on organic waste, not toys or other objects. Follow the instructions on the container. Pour the recommended amount of the enzyme product into the toilet bowl. You will typically be instructed to wait overnight for the enzymes to go to work on the clog. The toilet should drain once the clog has cleared. Making a Drain Cleaner Heat half a gallon of water. If the toilet tends to clog easily as the result of trying to flush too much waste, using a combination of hot water, baking soda and vinegar will often do the job as well as a commercial drain cleaner. Boil half a gallon of water, then let it cool for a moment while you add other ingredients to the toilet bowl. Use at least half a gallon. A small amount of water won't work, since it won't have enough force to push through the clog. The water should be no hotter than a hot tea you can drink comfortably. It should not be boiling, since very hot water can crack porcelain. You want to raise the temperature of the water passing around or pressing on the clog. Pour 1 cup baking soda and 2 cups vinegar into the toilet. The baking soda and vinegar create a chemical process that help to dissolve clogs. Distilled white vinegar is commonly used, but any type of vinegar will work. The mixture will fizz a great deal. If you don't have baking soda and vinegar on hand, try adding a few squirts of dish soap to the toilet bowl. The soap may help to loosen the clog. This method isn't likely to work for clogs caused by a hard obstruction, such as a toy. Pour the hot water into the bowl. Pour it from waist level, rather than right near the rim. The force of the water falling into the bowl can help to clear the clog. Let the mixture stand overnight. In the morning, the water should have drained. This homemade drain cleaner should successfully clear clogs caused by organic material. If the water won't flush on your second try, you may have hard obstruction causing the clog. Try using a wire coat hanger or a drain snake. Using a Plumbing Snake Purchase or borrow a plumbing snake. A plumbing snake (also sometimes called a \"flexible cleaning tool\" or \"auger\") is a flexible coil of wire that can \"snake\" through the curves of a drain and get deeper than a wire can. The best snake is a \"closet auger\" which is designed specifically to clear toilet clogs without damaging or staining the bowl. A plumber would likely use a closet auger. Insert one end of the snake into the drain. Push down, feeding the snake further into the drain until you feel an obstruction. Twist and push the snake through the obstruction. The goal is to break up the obstruction into smaller pieces that can move through the pipes. It may take a few minutes of maneuvering to clear the obstruction. Once the water drains, flush the toilet to see whether it drains as quickly as normal. Snake in reverse. It may become necessary to remove the toilet and run the snake through in the opposite direction. This is especially true with hard obstructions that may have been flushed by a curious child. If the obstruction is known to be hard and you are not comfortable removing and replacing the toilet, contact a plumber. Fashioning a Wire Coat Hanger Unravel and straighten a wire coat hanger. Then wrap the end of the wire with a rag. Use duct tape to keep the rag in place. This will prevent the sharp end from damaging the porcelain in your toilet. The wire hanger method will generally work only if there is an obstruction in the first few inches of the drain. Stick the wrapped end of the wire into the drain. Once the wire is in the drain, twist it, push it, and maneuver it in a circular motion to clear the drain. If you can feel the obstruction, push against it. Keep going until the water begins to drain. Make sure you're wearing rubber gloves as you do this. You may get splashed as you move the wire around. If you can't feel an obstruction, and the toilet won't drain, the clog must be out of reach of the hanger. Try the plumbing snake method to clear it. Flush the toilet once the water has drained. The obstruction and dirty water should now be able to flow through the drain like normal. If the toilet is still slow to drain, the obstruction may have gotten pushed further back, out of reach of the hanger. In this case you'll need to use a plumbing snake to clear it. Using a Chemical Drain Cleaner Purchase a chemical drain cleaner. They're available at most grocery, hardware, and \"big box\" stores. Use this method only as a last resort. The chemicals used in drain cleaners are toxic to people and pets, corrosive to pipes. Also, chlorinated drain cleaner are very damaging to the environment. If you suspect that there is a hard obstruction, do not use a chemical solution. Instead, use a snake or call a plumber. Only use chemicals that are specifically made for toilets. Using other drain cleaners may damage your toilet. Pour the specified amount into the toilet. Be sure you follow the manufacturer's instructions. Keep the lid down to prevent toxic fumes from filling your bathroom. Never use a plunger right after adding the drain-cleaning chemicals. The chemicals could possibly shoot back up onto your skin. Make sure the bathroom is well ventilated so you won't inhale the chemicals. Utilizing a Wet\\/Dry Vacuum Buy or borrow a wet/dry vacuum. If you have tried plunging and snaking to no avail, consider using a wet/dry vacuum. Do not use an ordinary vacuum cleaner––it must be the wet/dry variety that can cope with water. Empty the water out of the bowl using the vacuum. The bowl must be free of water and any other debris in order to vacuum out the obstruction. Place the end of the vacuum hose into the drain. Push it into the toilet bowl a few inches into the hole. Use just the flexible hose, rather than an attachment. Coil an old towel around the hole to create a seal around the drain. Turn on the vacuum. Use one hand to put pressure on the towels to create a good seal. Wait a moment or two for the vacuum to work. There's a good chance the vacuum can suck out the clog.",
  "tyn_model":[
    "water",
    "toilet",
    "plunger",
    "vacuum",
    "vinegar",
    "toilet bowl",
    "baking soda",
    "plumbing snake",
    "bowl",
    "drain cleaner",
    "wire coat hanger",
    "rubber gloves",
    "enzymes",
    "drain cleaners",
    "toilet tank",
    "toilet flapper",
    "drain stopper",
    "newspapers",
    "toilets",
    "gloves",
    "enzyme product",
    "enzyme waste removal product",
    "enzyme waste removal",
    "enzyme",
    "hot water",
    "dish soap",
    "soap",
    "drain snake",
    "auger",
    "closet auger",
    "plumber",
    "rag",
    "duct tape",
    "porcelain",
    "wire hanger",
    "chemical drain cleaner",
    "vacuum cleaner––it",
    "vacuum hose",
    "flexible hose",
    "towel",
    "towels"
  ],
  "tyn_section":[

  ]
}