{
  "title":"How to Place Tables and Figures in Manuscripts",
  "url":"https://www.wikihow.com/Place-Tables-and-Figures-in-Manuscripts",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Decoupage and Antique Paper"
  ],
  "methods":[
    {
      "name":"Tables and Figures Basics",
      "steps":[
        {
          "headline":"Decide whether or not the table and figure is really necessary.",
          "description":"Make sure your table or figure is really needed. Does it add anything to the paper? Does it make the information clearer? If it is just taking up space, delete it."
        },
        {
          "headline":"Make sure the table or figure stands alone with its caption and title.",
          "description":"The reader should not need to refer to the text to understand it. Place any tables or figures as close to the relevant text as possible. Always introduce the graph or figure in the text."
        },
        {
          "headline":"Keep it stylistically simple.",
          "description":"Graphs, tables, and figures do not need to be overly complicated to be effective. In fact, they are probably more effective with a simple design, as the date or information is the star of the show."
        },
        {
          "headline":"Use appendices.",
          "description":"Use appendices for related information that does not directly correspond to the text. For instance, if a graph provides population information from the last ten years but you are focusing on the last year primarily, the graph doesn’t necessarily need to be in the text. Place it at the end of the paper, and reference it as needed."
        },
        {
          "headline":"Limit your tables and figures to the body of your manuscript.",
          "description":"Most of the time, you will place graphs and figures in the main body of the text only, not in the introduction or conclusion. That’s because your introduction and conclusion provide an overview of what you are saying, not the nitty-gritty details that graphs and figures provide."
        }
      ]
    },
    {
      "name":"Inserting Tables and Figures in an MLA-Style Essay",
      "steps":[
        {
          "headline":"Place the table close to the text that describes it.",
          "description":"When referring to it, use the table number: “table 1.”\nDouble-space all text corresponding to the table, including the reference information and the caption. Align the table to the left."
        },
        {
          "headline":"Number the tables consecutively.",
          "description":"The table number goes above the table. The caption goes below the table number."
        },
        {
          "headline":"Cite the table.",
          "description":"If you are pulling the table from another source, place the source information below the table. Use a full reference citation under the table. Use the author’s name (inverted, followed by a period), the title in italics (period), the location (colon), the publisher (comma), the year (period), and the medium (period).”\nFor example: “Red, Jay. Art for Art’s Sake. Alabama, Georgia: Art Publishers, 2004. Print.”\nUse hanging indention (indent the lines after the first line). You don’t need to repeat this information on the reference page."
        },
        {
          "headline":"Number figures, and label them “Figure” or “Fig.” Figures can be any illustration that are not tables, including charts and diagrams.",
          "description":"Label it underneath, with capitalization: “Figure 1” or “Fig. 1.” Right after that (on the same line), write a caption or title to describe it. Follow it with source information if it came from another source. Align them the best way for the text. Some illustrations may fit better with text to the left or right, and MLA permits that usage."
        }
      ]
    },
    {
      "name":"Inserting Tables and Figures in an APA-Style Essay",
      "steps":[
        {
          "headline":"Place the table or figure near the paragraph that introduces it.",
          "description":"Number the figures and tables separately, with each set using consecutive numbers:\n“Table 1, Figure 1, Figure 2, Table 2, Table 3, Table 4, Figure 5.”"
        },
        {
          "headline":"Keep it simple.",
          "description":"Don’t make the design overly complicated. Use a sans-serif font. Fonts should be 8 to 14 point."
        },
        {
          "headline":"Label your table or figure.",
          "description":"Place the figure or table number in italics, and then write a title and caption. Both will be in sentence case, meaning only the first word is capitalized. The caption should be a short description of what is in the figure. Use a legend to explain any symbols."
        },
        {
          "headline":"Make sure your table or figure is the correct size.",
          "description":"Create figures that are 2 to 3.25 inches (5.1 to 8.3 cm) in width for one column; for two columns, they can be 4.25 to 6.875 inches (10.8 to 17.5 cm)."
        }
      ]
    },
    {
      "name":"Inserting Tables and Figures in an Chicago-Style Essay",
      "steps":[
        {
          "headline":"Cite your table or figure.",
          "description":"If the table comes from another source (meaning you didn’t create it) you need to create a source line below the figure. You’ll place the word “Sources:” first, then make a regular Chicago reference. That is, the author’s name (inverted), the title in italics (period), the city and state of publication (colon), the publisher (comma), and the year (period). For example: “Red, Jay. Art for Art’s Sake. Alabama, Georgia: Art Publishers, 2004.”\nAlso include this information on your reference page."
        },
        {
          "headline":"Number your tables.",
          "description":"Number your tables from the beginning of the paper to the end in order; figures should have their own series of consecutive numbers. ."
        },
        {
          "headline":"Describe your table or figure.",
          "description":"Create a descriptive title for the table. Write the description in the paragraph before introducing the table. Refer to the table by its number, such as “table 1.”"
        }
      ]
    }
  ],
  "text":" Tables and Figures Basics Decide whether or not the table and figure is really necessary. Make sure your table or figure is really needed. Does it add anything to the paper? Does it make the information clearer? If it is just taking up space, delete it. Make sure the table or figure stands alone with its caption and title. The reader should not need to refer to the text to understand it. Place any tables or figures as close to the relevant text as possible. Always introduce the graph or figure in the text. Keep it stylistically simple. Graphs, tables, and figures do not need to be overly complicated to be effective. In fact, they are probably more effective with a simple design, as the date or information is the star of the show. Use appendices. Use appendices for related information that does not directly correspond to the text. For instance, if a graph provides population information from the last ten years but you are focusing on the last year primarily, the graph doesn’t necessarily need to be in the text. Place it at the end of the paper, and reference it as needed. Limit your tables and figures to the body of your manuscript. Most of the time, you will place graphs and figures in the main body of the text only, not in the introduction or conclusion. That’s because your introduction and conclusion provide an overview of what you are saying, not the nitty-gritty details that graphs and figures provide. Inserting Tables and Figures in an MLA-Style Essay Place the table close to the text that describes it. When referring to it, use the table number: “table 1.”\nDouble-space all text corresponding to the table, including the reference information and the caption. Align the table to the left. Number the tables consecutively. The table number goes above the table. The caption goes below the table number. Cite the table. If you are pulling the table from another source, place the source information below the table. Use a full reference citation under the table. Use the author’s name (inverted, followed by a period), the title in italics (period), the location (colon), the publisher (comma), the year (period), and the medium (period).”\nFor example: “Red, Jay. Art for Art’s Sake. Alabama, Georgia: Art Publishers, 2004. Print.”\nUse hanging indention (indent the lines after the first line). You don’t need to repeat this information on the reference page. Number figures, and label them “Figure” or “Fig.” Figures can be any illustration that are not tables, including charts and diagrams. Label it underneath, with capitalization: “Figure 1” or “Fig. 1.” Right after that (on the same line), write a caption or title to describe it. Follow it with source information if it came from another source. Align them the best way for the text. Some illustrations may fit better with text to the left or right, and MLA permits that usage. Inserting Tables and Figures in an APA-Style Essay Place the table or figure near the paragraph that introduces it. Number the figures and tables separately, with each set using consecutive numbers:\n“Table 1, Figure 1, Figure 2, Table 2, Table 3, Table 4, Figure 5.” Keep it simple. Don’t make the design overly complicated. Use a sans-serif font. Fonts should be 8 to 14 point. Label your table or figure. Place the figure or table number in italics, and then write a title and caption. Both will be in sentence case, meaning only the first word is capitalized. The caption should be a short description of what is in the figure. Use a legend to explain any symbols. Make sure your table or figure is the correct size. Create figures that are 2 to 3.25 inches (5.1 to 8.3 cm) in width for one column; for two columns, they can be 4.25 to 6.875 inches (10.8 to 17.5 cm). Inserting Tables and Figures in an Chicago-Style Essay Cite your table or figure. If the table comes from another source (meaning you didn’t create it) you need to create a source line below the figure. You’ll place the word “Sources:” first, then make a regular Chicago reference. That is, the author’s name (inverted), the title in italics (period), the city and state of publication (colon), the publisher (comma), and the year (period). For example: “Red, Jay. Art for Art’s Sake. Alabama, Georgia: Art Publishers, 2004.”\nAlso include this information on your reference page. Number your tables. Number your tables from the beginning of the paper to the end in order; figures should have their own series of consecutive numbers. . Describe your table or figure. Create a descriptive title for the table. Write the description in the paragraph before introducing the table. Refer to the table by its number, such as “table 1.”",
  "tyn_model":[
    "”\n",
    "“table",
    "table",
    "graphs",
    "“red",
    "“figure",
    "” or",
    "“fig",
    "paper",
    "tables",
    "graph",
    "mla-style essay",
    "print",
    "” figures",
    "” right",
    "” keep",
    "sans-serif font",
    "“sources",
    "” first",
    "art publishers"
  ],
  "tyn_section":[

  ]
}