{
  "title":"How to Bake a Cake Inside an Egg",
  "url":"https://www.wikihow.com/Bake-a-Cake-Inside-an-Egg",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes"
  ],
  "parts":[
    {
      "name":"Preparing the Eggs",
      "steps":[
        {
          "headline":"Using the knife, cut a hole in the egg.",
          "description":"This is so you can put the batter in."
        },
        {
          "headline":"Pour all of the yolk out.",
          "description":"This is so you won't have a yolky cake in the egg. Pour out as much yolk as possible."
        },
        {
          "headline":"Rinse the egg.",
          "description":"This is so more yolk cleans out of the egg and to clean the egg."
        },
        {
          "headline":"Look inside.",
          "description":"Has all the yolk cleaned out? Did you rinse well?"
        },
        {
          "headline":"Rinse the egg in saltwater.",
          "description":""
        }
      ]
    },
    {
      "name":"Setting the Egg",
      "steps":[
        {
          "headline":"Use the muffin tin.",
          "description":"Use aluminum foil, and don't forget to lock the roll!"
        },
        {
          "headline":"Remember, the batter has to be in the egg.",
          "description":"Otherwise, there will be no cake in the egg. Be sure to keep a knife with you, because you will need it for later."
        },
        {
          "headline":"Set the egg in the \"nest\" and make batter.",
          "description":"Put it in the Ziploc bag, then put it inside the egg for the cake to come in the egg."
        }
      ]
    },
    {
      "name":"Baking the Egg",
      "steps":[
        {
          "headline":"Bake the egg for 12-14 minutes.",
          "description":"The cake has to come in the egg, taking this long."
        },
        {
          "headline":"Let the egg cool, then take out the extra cake.",
          "description":""
        },
        {
          "headline":"Put the egg back in the carton.",
          "description":"Now, you have a cakey egg!"
        }
      ]
    }
  ],
  "text":" Preparing the Eggs Using the knife, cut a hole in the egg. This is so you can put the batter in. Pour all of the yolk out. This is so you won't have a yolky cake in the egg. Pour out as much yolk as possible. Rinse the egg. This is so more yolk cleans out of the egg and to clean the egg. Look inside. Has all the yolk cleaned out? Did you rinse well? Rinse the egg in saltwater.  Setting the Egg Use the muffin tin. Use aluminum foil, and don't forget to lock the roll! Remember, the batter has to be in the egg. Otherwise, there will be no cake in the egg. Be sure to keep a knife with you, because you will need it for later. Set the egg in the \"nest\" and make batter. Put it in the Ziploc bag, then put it inside the egg for the cake to come in the egg. Baking the Egg Bake the egg for 12-14 minutes. The cake has to come in the egg, taking this long. Let the egg cool, then take out the extra cake.  Put the egg back in the carton. Now, you have a cakey egg!",
  "tyn_model":[
    "egg",
    "knife",
    "saltwater",
    "muffin tin",
    "aluminum foil",
    "ziploc bag",
    "cake",
    "carton"
  ],
  "tyn_section":[

  ]
}