{
  "title":"How to Make Roast Beef Sirloin",
  "url":"https://www.wikihow.com/Make-Roast-Beef-Sirloin",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Beef and Lamb"
  ],
  "steps":[
    {
      "headline":"Preheat the oven.Before cooking this dish, you will need to preheat the oven to 245 °C (473 °F) or gas mark 9.",
      "description":""
    },
    {
      "headline":"Prepare the meat.",
      "description":"Remove fat or sinew. Then, leave the beef to reach room temperature for at least two hours prior to cooking. Mix the mustard, olive oil, and herbs in a bowl. Then smear it all over the surface of the meat until evenly covered. Season the beef with salt and freshly ground black pepper."
    },
    {
      "headline":"Place the beef in the oven.Place the roasting tin in the middle of the oven and leave it for 15 minutes.",
      "description":"Make sure the meat is above the tray, so the juices collect in the tray underneath."
    },
    {
      "headline":"Test to see if your beef is ready.",
      "description":"For a rare roast, after 15 minutes take the temperature of the meat. It should be around 54 °C (129 °F). For medium rare take the temperature after 20 minutes, it should be around 60 °C (140 °F). For medium , wait 30 minutes and test for 65 °C (149 °F). For well done, 40 minutes and 75 °C (167 °F)."
    },
    {
      "headline":"Let the meat sit.Take the beef out and let it sit at room temperature for 15 minutes on the rack.",
      "description":"Don't worry, it won't cool down during this time! This is to allow the juices to seep back into the meat and make it that bit more succulent."
    },
    {
      "headline":"Carve and serve the roast beef.The time has arrived to carve and serve.",
      "description":"Remember to use a good, sharp carving knife to cut the meat properly."
    },
    {
      "headline":"Complete your roast dinner.To complete your traditional roast, we suggest you add the following: Yorkshire pudding is a typical companion to roast beef; roast potatoes; a variety of vegetables such as steamed carrots, roast parsnips or whichever take your fancy, and of course, gravy.",
      "description":""
    }
  ],
  "text":" Preheat the oven.Before cooking this dish, you will need to preheat the oven to 245 °C (473 °F) or gas mark 9.  Prepare the meat. Remove fat or sinew. Then, leave the beef to reach room temperature for at least two hours prior to cooking. Mix the mustard, olive oil, and herbs in a bowl. Then smear it all over the surface of the meat until evenly covered. Season the beef with salt and freshly ground black pepper. Place the beef in the oven.Place the roasting tin in the middle of the oven and leave it for 15 minutes. Make sure the meat is above the tray, so the juices collect in the tray underneath. Test to see if your beef is ready. For a rare roast, after 15 minutes take the temperature of the meat. It should be around 54 °C (129 °F). For medium rare take the temperature after 20 minutes, it should be around 60 °C (140 °F). For medium , wait 30 minutes and test for 65 °C (149 °F). For well done, 40 minutes and 75 °C (167 °F). Let the meat sit.Take the beef out and let it sit at room temperature for 15 minutes on the rack. Don't worry, it won't cool down during this time! This is to allow the juices to seep back into the meat and make it that bit more succulent. Carve and serve the roast beef.The time has arrived to carve and serve. Remember to use a good, sharp carving knife to cut the meat properly. Complete your roast dinner.To complete your traditional roast, we suggest you add the following: Yorkshire pudding is a typical companion to roast beef; roast potatoes; a variety of vegetables such as steamed carrots, roast parsnips or whichever take your fancy, and of course, gravy. ",
  "tyn_model":[
    "oven",
    "beef",
    "roast beef",
    "mustard",
    "olive oil",
    "herbs",
    "bowl",
    "salt",
    "black pepper",
    "roasting tin",
    "carving knife",
    "yorkshire pudding",
    "roast potatoes",
    "vegetables",
    "carrots",
    "roast parsnips",
    "gravy"
  ],
  "tyn_section":[

  ]
}