{
  "title":"How to Download Grand Theft Auto",
  "url":"https://www.wikihow.com/Download-Grand-Theft-Auto",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Grand Theft Auto"
  ],
  "methods":[
    {
      "name":"Buying a GTA Digital Copy from Xbox Live Marketplace",
      "steps":[
        {
          "headline":"Switch on your Xbox console.",
          "description":"Wait for it to finish booting up and display the home screen."
        },
        {
          "headline":"Go to Games.",
          "description":"Select “Games” using the navigational keys on your controller. Open it by pressing the “A” button."
        },
        {
          "headline":"Find Grand Theft Auto.",
          "description":"Select “Browse Games” from the menu tiles and look for Grand Theft Auto game under the “Action and Adventure” category."
        },
        {
          "headline":"Start purchasing the game.",
          "description":"Press the “A” button to open the Overview screen of the game and select the “Download” tile to start purchasing the game."
        },
        {
          "headline":"Choose your payment method.",
          "description":"Select “Change Payment Options” and press the “X” button on your controller to buy the game using either Microsoft Points or a Credit Card. If you’re going to choose credit card as a mode of payment, you need to enter the card details on the text field provided."
        },
        {
          "headline":"Confirm your purchase.",
          "description":"Select “Confirm Download” and press the “A” button again to begin. The Active Downloads window will appear showing the progress of the file."
        },
        {
          "headline":"Wait for the download process to finish.",
          "description":"Once it’s done, the digital copy of GTA should be available in the Home screen."
        }
      ]
    },
    {
      "name":"Buying a GTA Digital Copy from Playstation Store",
      "steps":[
        {
          "headline":"Switch on your Playstation console.",
          "description":"Wait for it to finish booting up and display the home screen."
        },
        {
          "headline":"Go to the Store.",
          "description":"Scroll to the right side of the screen using the navigational keys on your controller and select “Playstation Store”."
        },
        {
          "headline":"Go to Games.",
          "description":"Scroll down the left menu panel and select “Games” by pressing the “X” button on your controller."
        },
        {
          "headline":"Select Grand Theft Auto.",
          "description":"Look for the Grand Theft Auto game listed inside. Press the “X” button again to open its game overview screen."
        },
        {
          "headline":"Purchase the game.",
          "description":"Select “Add to Cart” from the left side of the screen to buy the game. Click the “Proceed to Checkout” button once the cart preview window appears on the screen to start processing your order."
        },
        {
          "headline":"Finalize your order.",
          "description":"Do this by selecting “Confirm Purchase” using your controller’s “X” button. You’ll be redirected to the purchase summary screen."
        },
        {
          "headline":"Download the game.",
          "description":"Press the controller’s “X” button on “Download” and the download progress screen will appear, showing the status of your purchase."
        },
        {
          "headline":"Wait for the download to finish.",
          "description":"Once done GTA should appear inside your console’s Game section."
        }
      ]
    },
    {
      "name":"Downloading a GTA Digital Copy on Your PC",
      "steps":[
        {
          "headline":"Go to Amazon.",
          "description":"Open a web browser on your computer and go to the Amazon website (https://www.amazon.com)."
        },
        {
          "headline":"Sign in.",
          "description":"Click the “Sign In” button at the top-right corner of the page and enter your Amazon account details to login."
        },
        {
          "headline":"Go to the Electronics and Computers section.",
          "description":"Click on “Shop by Department” at the top left and select “Electronics and Computers” from the drop-down list."
        },
        {
          "headline":"Go to Digital Games.",
          "description":"Select “Video Games” under this category and click “Digital Games” under “Quick Links” located on the left menu panel. This section contains all the games that have a digital copy."
        },
        {
          "headline":"Select the GTA series you want from the list of games.",
          "description":"Click its title to open the item overview."
        },
        {
          "headline":"Purchase the game.",
          "description":"Click the “Buy and Download” button at the upper-rright corner of the page to purchase the game."
        },
        {
          "headline":"Confirm your purchase.",
          "description":"Enter your payment details (credit, debit card or PayPal) when prompted to confirm purchasing the game."
        },
        {
          "headline":"Find the game in your account.",
          "description":"Click the “Your Account” button at the upper-right corner and select “Your Games & Software Library” from the drop-down list. This section contains all the digital copies of games and software you’ve purchased from Amazon."
        },
        {
          "headline":"Download Grand Theft Auto.",
          "description":"Select the Grand Theft Auto copy you purchased to start downloading the item to your computer."
        }
      ]
    }
  ],
  "text":" Buying a GTA Digital Copy from Xbox Live Marketplace Switch on your Xbox console. Wait for it to finish booting up and display the home screen. Go to Games. Select “Games” using the navigational keys on your controller. Open it by pressing the “A” button. Find Grand Theft Auto. Select “Browse Games” from the menu tiles and look for Grand Theft Auto game under the “Action and Adventure” category. Start purchasing the game. Press the “A” button to open the Overview screen of the game and select the “Download” tile to start purchasing the game. Choose your payment method. Select “Change Payment Options” and press the “X” button on your controller to buy the game using either Microsoft Points or a Credit Card. If you’re going to choose credit card as a mode of payment, you need to enter the card details on the text field provided. Confirm your purchase. Select “Confirm Download” and press the “A” button again to begin. The Active Downloads window will appear showing the progress of the file. Wait for the download process to finish. Once it’s done, the digital copy of GTA should be available in the Home screen. Buying a GTA Digital Copy from Playstation Store Switch on your Playstation console. Wait for it to finish booting up and display the home screen. Go to the Store. Scroll to the right side of the screen using the navigational keys on your controller and select “Playstation Store”. Go to Games. Scroll down the left menu panel and select “Games” by pressing the “X” button on your controller. Select Grand Theft Auto. Look for the Grand Theft Auto game listed inside. Press the “X” button again to open its game overview screen. Purchase the game. Select “Add to Cart” from the left side of the screen to buy the game. Click the “Proceed to Checkout” button once the cart preview window appears on the screen to start processing your order. Finalize your order. Do this by selecting “Confirm Purchase” using your controller’s “X” button. You’ll be redirected to the purchase summary screen. Download the game. Press the controller’s “X” button on “Download” and the download progress screen will appear, showing the status of your purchase. Wait for the download to finish. Once done GTA should appear inside your console’s Game section. Downloading a GTA Digital Copy on Your PC Go to Amazon. Open a web browser on your computer and go to the Amazon website (https://www.amazon.com). Sign in. Click the “Sign In” button at the top-right corner of the page and enter your Amazon account details to login. Go to the Electronics and Computers section. Click on “Shop by Department” at the top left and select “Electronics and Computers” from the drop-down list. Go to Digital Games. Select “Video Games” under this category and click “Digital Games” under “Quick Links” located on the left menu panel. This section contains all the games that have a digital copy. Select the GTA series you want from the list of games. Click its title to open the item overview. Purchase the game. Click the “Buy and Download” button at the upper-rright corner of the page to purchase the game. Confirm your purchase. Enter your payment details (credit, debit card or PayPal) when prompted to confirm purchasing the game. Find the game in your account. Click the “Your Account” button at the upper-right corner and select “Your Games & Software Library” from the drop-down list. This section contains all the digital copies of games and software you’ve purchased from Amazon. Download Grand Theft Auto. Select the Grand Theft Auto copy you purchased to start downloading the item to your computer.",
  "tyn_model":[
    "” button",
    "“x",
    "” from",
    "“a",
    "” and",
    "“games",
    "” using",
    "grand theft auto game",
    "“download",
    "“confirm",
    "gta",
    "” under",
    "“your",
    "grand theft auto",
    "grand theft auto.",
    "“browse",
    "“action",
    "” category",
    "” tile",
    "“change",
    "microsoft points",
    "credit card",
    "playstation store",
    "“playstation",
    "”.",
    "games",
    "” by",
    "“add",
    "“proceed",
    "controller",
    "“sign",
    "amazon account",
    "“shop",
    "” at",
    "“electronics and computers",
    "“video",
    "“digital",
    "“quick",
    "” located",
    "“buy"
  ],
  "tyn_section":[

  ]
}