{
  "title":"How to Get Faster at Cooking",
  "url":"https://www.wikihow.com/Get-Faster-at-Cooking",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation",
    "Basic Cooking Skills"
  ],
  "methods":[
    {
      "name":"Doing Prep Work",
      "steps":[
        {
          "headline":"Cut or chop your ingredients before you start cooking.",
          "description":"If you're new to following recipes, get out all of the ingredients you'll need and prepare them. If a recipe calls for dicing, mincing, or slicing ingredients, for instance, do all of the prep work first so you can start making the food. If you already feel comfortable doing prep work while you cook food, read through the recipe to see when to do specific prep. For example, if you're caramelizing onions, they'll probably take a long time. Get them cooking and then prep the rest of the ingredients while they're caramelizing."
        },
        {
          "headline":"Cut food into smaller pieces.",
          "description":"Instead of roasting large chunks of vegetables or boiling entire potatoes, chop them into smaller pieces than you usually do. Vegetables that are ⁄2 to 1 inch (1.3 to 2.5 cm) in size will cook much faster than 2 to 3 in (51 to 76 mm) pieces. If you're really short on time, try dicing or grating the food. For example, instead of cooking chunks of home fries, grate the potatoes to make hashbrowns. You can even cut meat and seafood into smaller pieces. Slice a large roast or fillet into smaller and thinner pieces to cut down on cooking time."
        },
        {
          "headline":"Grate your butter so you don’t have to wait for it to soften.",
          "description":"A lot of cooking and baking recipes direct you to use softened butter instead of cold butter from the fridge or freezer. Although you could warm the butter in the microwave, you might accidentally melt it. Try grating the butter against the coarse side of a box grater before using it in the recipe. This works best if the butter is very cold or frozen. Try this trick the next time you're baking biscuits or scones. It's much easier than rubbing or cutting chunks of butter into the dry mixture!"
        },
        {
          "headline":"Prep food for several meals at once.",
          "description":"The time you spend washing, chopping, and preparing ingredients adds up if you're cooking every day. To save on some of this prep time, consider what you'll be cooking for the week and prep the ingredients at the same time. Then, you can just pull what you need out of the refrigerator when you're ready to cook.Tip: Many food blogs offer weekly meal plans that you can print off and follow. These will also list ingredients that you need to buy for the week, which can cut down on your food prep time. For example, if you need diced onion for 2 meals, chop the onion and store them in separate containers in the refrigerator. If you're making rice for dinner and you also plan to serve it in a few days, make a double batch and refrigerate half of it."
        },
        {
          "headline":"Plan the cooking order for a meal.",
          "description":"If you're making a few different things to serve, think about which dishes take the longest to cook and which can be prepared right before serving. If it helps you stay organized, write down a timeline of when to prep and cook each dish. Your list might look like this:\nMarinate chicken for 3 hours\nStart the grill 30 minutes before dinner time\nRemove the chicken and thread it onto skewers\nPut the chicken skewers on the grill\n\nBring a pot of water to boil and cook rice noodles\nRemove the chicken from the grill\nMake a tossed salad to serve with the chicken and rice noodles"
        },
        {
          "headline":"Preheat your oven while you prep the food.",
          "description":"Your food will cook evenly if the oven is already at the recommended temperature when you put the food in. If you put food into a cold oven while it's heating up, it will take longer to cook and the bottom or outside of the food could overcook before the center is done.Tip: If you need to use an appliance instead of an oven, get it out and set it up if necessary. If you're using a griddle or waffle iron, for instance, you'll need to turn it on so it heats up. For example, if you toss a frozen pizza into a cold oven that's heating up, the bottom may burn while the center only becomes warm. If you put it into a hot oven, the whole pizza will cook within the recommended time."
        }
      ]
    },
    {
      "name":"Trying Faster Cooking Techniques",
      "steps":[
        {
          "headline":"Cook food on a gas grill.",
          "description":"Turn on a gas grill and toss thin pieces of meat or vegetables on the grate. You can usually cook an entire meal within minutes, as long as you have space on the grill. For example, grill shrimp skewers and place a basket of asparagus and peppers to one side of the grill. Although you can cook food on a charcoal grill, it will take time to light the grill and heat the briquettes."
        },
        {
          "headline":"Blanch or steam food on the stovetop.",
          "description":"Water and stock conduct heat so pour enough liquid to barely cover the bottom of the pan. Once it starts simmering, add your food and put the lid on. The food will become tender once it's finished cooking. Then if you want to blanch it, you can scoop out the food and submerge it in ice water to stop it from cooking further. To practice this technique, heat chopped vegetables in a skillet over medium heat. Add a splash of vegetable or chicken stock along with a drizzle of oil or melted butter and seasoning. Once the stock has cooked off, the vegetables should be tender."
        },
        {
          "headline":"Stir-fry food instead of roasting or braising.",
          "description":"Chop food into bite-sized pieces and cook it over high heat on the stove instead of sticking it in a low-temperature oven. Stir-frying will give the food a rich flavor and you can easily throw together a one-pot meal. For example, instead of roasting an entire chicken, use boneless skinless chicken pieces and stir fry them with veggies."
        },
        {
          "headline":"Use your microwave to cook, reheat, or toast food.",
          "description":"The microwave isn't just for reheating leftovers. You can quickly cook side dishes or toast nuts for a small meal. This can also free up space on your stove so you can work on other parts of a meal. For example, cook broccoli florets in the microwave while you grill chicken tenders."
        },
        {
          "headline":"Make meals in a slow cooker or pressure cooker for a hands-off method.",
          "description":"Although a slow cooker isn't fast, it does free you up to do other things while your meal is cooking. If you like the convenience of a one-pot meal, try making it in a pressure cooker, since this dramatically cuts down on cooking time.Tip: Use other time-saving appliances such as a rice cooker or toaster oven too! Some pressure-cookers have delayed start options, so you can program it to start cooking when you're not home. Always read the manufacturer's directions when cooking with your appliances."
        },
        {
          "headline":"Use a lid when you're heating water, soup, or sauce.",
          "description":"If you put a lid on your dish, you'll trap hot air in the pan and prevent cooler air from coming into contact with the food. This will help your water boil faster or make your soups and sauces heat quickly.Tip: If you'd like to thicken the sauce or soup, keep the lid on until the food starts bubbling and then remove the lid. Continue to cook the food with the lid off so some of the moisture evaporates. If you want to see what's going on inside the dish while the lid is on, use a clear, glass lid."
        },
        {
          "headline":"Cook food in shallow pans to help it cook faster.",
          "description":"If you crowd a skillet or pan with too many ingredients, they'll take longer to cook. Try to use a wide or shallow pan so more of the food is exposed to the heat source. If you're cooking something on a baking sheet, consider dividing the food between 2 sheets so heat can circulate between the food better. This is especially important if you're cooking something that releases moisture, such as mushrooms. They need room in the pan for moisture to evaporate or else they'll become mushy."
        }
      ]
    },
    {
      "name":"Spending Less Time in the Kitchen",
      "steps":[
        {
          "headline":"Organize your kitchen so you know where everything is at.",
          "description":"You'll waste valuable time in the kitchen if you're taking everything out of the pantry to find an ingredient. Find a storage system that works for you so you know what's in your pantry and refrigerator and where to find it quickly. You should also organize the cooking tools that you use frequently. Keep pots, baking sheets, kitchen tools, and knives in easy to access places in your kitchen."
        },
        {
          "headline":"Cook with a storebought product if it saves you time.",
          "description":"Don't feel like you always have to make every single ingredient from scratch. If you can buy a high-quality ingredient that saves you time and cuts down on your cleanup, you'll probably be more likely to cook in the first place. Look for time-saving items like these that you can buy instead of make:\nPesto\nPasta or enchilada sauce\nSalsa\nBeans\nParcooked grains\nPrepared or frozen vegetables"
        },
        {
          "headline":"Make large batches of food to save or freeze for later.",
          "description":"If you're making a meal that you can easily double, make an extra portion and stick it in the freezer. You could also use the extra food as the start of another meal. For example, if you're making meat sauce, double the batch so you can eat it with pasta the first night and then spread it over flatbread for the next night.Tip: Remember to label food that you freeze so you can easily find it and use it before it develops freezer burn."
        },
        {
          "headline":"Use leftovers to create a whole new meal.",
          "description":"Take a look in your refrigerator to see what you already have to cook with. Leftovers are a speedy way to get a meal on the table since they're already cooked. For example, take leftover rice and add veggies with protein to make quick stir-fried rice. You could also leftover pasta sauce or pesto as the base for a pizza. Then, top it with leftover roasted vegetables and bake it. Try mixing up leftovers to serve in a wrap, pasta, salad, or soup."
        },
        {
          "headline":"Cook with friends or family.",
          "description":"Ask friends if they'd like to come over and cook meals with you or enlist the help of your family to get dinner on the table. If you're asking your kids to help you, try to think of cooking tasks that are suited for their age. For example, your 9-year old might be able to put together a garden salad while your 5-year old could peel vegetables. If your friends come over to do large-batch cooking, ask them to bring their own storage containers so they can take meals home with them."
        },
        {
          "headline":"Clean your space as you go.",
          "description":"If you don't have any counter space because you've been setting dirty dishes aside, you'll run out of room for cooking or you won't be able to find kitchen tools that you need. Try to wash dishes as you cook so they don't pile up. For example, if you're baking something, wash the dishes while the food is in the oven. Then, you'll have a clean kitchen by the time the food is done."
        }
      ]
    }
  ],
  "text":" Doing Prep Work Cut or chop your ingredients before you start cooking. If you're new to following recipes, get out all of the ingredients you'll need and prepare them. If a recipe calls for dicing, mincing, or slicing ingredients, for instance, do all of the prep work first so you can start making the food. If you already feel comfortable doing prep work while you cook food, read through the recipe to see when to do specific prep. For example, if you're caramelizing onions, they'll probably take a long time. Get them cooking and then prep the rest of the ingredients while they're caramelizing. Cut food into smaller pieces. Instead of roasting large chunks of vegetables or boiling entire potatoes, chop them into smaller pieces than you usually do. Vegetables that are ⁄2 to 1 inch (1.3 to 2.5 cm) in size will cook much faster than 2 to 3 in (51 to 76 mm) pieces. If you're really short on time, try dicing or grating the food. For example, instead of cooking chunks of home fries, grate the potatoes to make hashbrowns. You can even cut meat and seafood into smaller pieces. Slice a large roast or fillet into smaller and thinner pieces to cut down on cooking time. Grate your butter so you don’t have to wait for it to soften. A lot of cooking and baking recipes direct you to use softened butter instead of cold butter from the fridge or freezer. Although you could warm the butter in the microwave, you might accidentally melt it. Try grating the butter against the coarse side of a box grater before using it in the recipe. This works best if the butter is very cold or frozen. Try this trick the next time you're baking biscuits or scones. It's much easier than rubbing or cutting chunks of butter into the dry mixture! Prep food for several meals at once. The time you spend washing, chopping, and preparing ingredients adds up if you're cooking every day. To save on some of this prep time, consider what you'll be cooking for the week and prep the ingredients at the same time. Then, you can just pull what you need out of the refrigerator when you're ready to cook.Tip: Many food blogs offer weekly meal plans that you can print off and follow. These will also list ingredients that you need to buy for the week, which can cut down on your food prep time. For example, if you need diced onion for 2 meals, chop the onion and store them in separate containers in the refrigerator. If you're making rice for dinner and you also plan to serve it in a few days, make a double batch and refrigerate half of it. Plan the cooking order for a meal. If you're making a few different things to serve, think about which dishes take the longest to cook and which can be prepared right before serving. If it helps you stay organized, write down a timeline of when to prep and cook each dish. Your list might look like this:\nMarinate chicken for 3 hours\nStart the grill 30 minutes before dinner time\nRemove the chicken and thread it onto skewers\nPut the chicken skewers on the grill\n\nBring a pot of water to boil and cook rice noodles\nRemove the chicken from the grill\nMake a tossed salad to serve with the chicken and rice noodles Preheat your oven while you prep the food. Your food will cook evenly if the oven is already at the recommended temperature when you put the food in. If you put food into a cold oven while it's heating up, it will take longer to cook and the bottom or outside of the food could overcook before the center is done.Tip: If you need to use an appliance instead of an oven, get it out and set it up if necessary. If you're using a griddle or waffle iron, for instance, you'll need to turn it on so it heats up. For example, if you toss a frozen pizza into a cold oven that's heating up, the bottom may burn while the center only becomes warm. If you put it into a hot oven, the whole pizza will cook within the recommended time. Trying Faster Cooking Techniques Cook food on a gas grill. Turn on a gas grill and toss thin pieces of meat or vegetables on the grate. You can usually cook an entire meal within minutes, as long as you have space on the grill. For example, grill shrimp skewers and place a basket of asparagus and peppers to one side of the grill. Although you can cook food on a charcoal grill, it will take time to light the grill and heat the briquettes. Blanch or steam food on the stovetop. Water and stock conduct heat so pour enough liquid to barely cover the bottom of the pan. Once it starts simmering, add your food and put the lid on. The food will become tender once it's finished cooking. Then if you want to blanch it, you can scoop out the food and submerge it in ice water to stop it from cooking further. To practice this technique, heat chopped vegetables in a skillet over medium heat. Add a splash of vegetable or chicken stock along with a drizzle of oil or melted butter and seasoning. Once the stock has cooked off, the vegetables should be tender. Stir-fry food instead of roasting or braising. Chop food into bite-sized pieces and cook it over high heat on the stove instead of sticking it in a low-temperature oven. Stir-frying will give the food a rich flavor and you can easily throw together a one-pot meal. For example, instead of roasting an entire chicken, use boneless skinless chicken pieces and stir fry them with veggies. Use your microwave to cook, reheat, or toast food. The microwave isn't just for reheating leftovers. You can quickly cook side dishes or toast nuts for a small meal. This can also free up space on your stove so you can work on other parts of a meal. For example, cook broccoli florets in the microwave while you grill chicken tenders. Make meals in a slow cooker or pressure cooker for a hands-off method. Although a slow cooker isn't fast, it does free you up to do other things while your meal is cooking. If you like the convenience of a one-pot meal, try making it in a pressure cooker, since this dramatically cuts down on cooking time.Tip: Use other time-saving appliances such as a rice cooker or toaster oven too! Some pressure-cookers have delayed start options, so you can program it to start cooking when you're not home. Always read the manufacturer's directions when cooking with your appliances. Use a lid when you're heating water, soup, or sauce. If you put a lid on your dish, you'll trap hot air in the pan and prevent cooler air from coming into contact with the food. This will help your water boil faster or make your soups and sauces heat quickly.Tip: If you'd like to thicken the sauce or soup, keep the lid on until the food starts bubbling and then remove the lid. Continue to cook the food with the lid off so some of the moisture evaporates. If you want to see what's going on inside the dish while the lid is on, use a clear, glass lid. Cook food in shallow pans to help it cook faster. If you crowd a skillet or pan with too many ingredients, they'll take longer to cook. Try to use a wide or shallow pan so more of the food is exposed to the heat source. If you're cooking something on a baking sheet, consider dividing the food between 2 sheets so heat can circulate between the food better. This is especially important if you're cooking something that releases moisture, such as mushrooms. They need room in the pan for moisture to evaporate or else they'll become mushy. Spending Less Time in the Kitchen Organize your kitchen so you know where everything is at. You'll waste valuable time in the kitchen if you're taking everything out of the pantry to find an ingredient. Find a storage system that works for you so you know what's in your pantry and refrigerator and where to find it quickly. You should also organize the cooking tools that you use frequently. Keep pots, baking sheets, kitchen tools, and knives in easy to access places in your kitchen. Cook with a storebought product if it saves you time. Don't feel like you always have to make every single ingredient from scratch. If you can buy a high-quality ingredient that saves you time and cuts down on your cleanup, you'll probably be more likely to cook in the first place. Look for time-saving items like these that you can buy instead of make:\nPesto\nPasta or enchilada sauce\nSalsa\nBeans\nParcooked grains\nPrepared or frozen vegetables Make large batches of food to save or freeze for later. If you're making a meal that you can easily double, make an extra portion and stick it in the freezer. You could also use the extra food as the start of another meal. For example, if you're making meat sauce, double the batch so you can eat it with pasta the first night and then spread it over flatbread for the next night.Tip: Remember to label food that you freeze so you can easily find it and use it before it develops freezer burn. Use leftovers to create a whole new meal. Take a look in your refrigerator to see what you already have to cook with. Leftovers are a speedy way to get a meal on the table since they're already cooked. For example, take leftover rice and add veggies with protein to make quick stir-fried rice. You could also leftover pasta sauce or pesto as the base for a pizza. Then, top it with leftover roasted vegetables and bake it. Try mixing up leftovers to serve in a wrap, pasta, salad, or soup. Cook with friends or family. Ask friends if they'd like to come over and cook meals with you or enlist the help of your family to get dinner on the table. If you're asking your kids to help you, try to think of cooking tasks that are suited for their age. For example, your 9-year old might be able to put together a garden salad while your 5-year old could peel vegetables. If your friends come over to do large-batch cooking, ask them to bring their own storage containers so they can take meals home with them. Clean your space as you go. If you don't have any counter space because you've been setting dirty dishes aside, you'll run out of room for cooking or you won't be able to find kitchen tools that you need. Try to wash dishes as you cook so they don't pile up. For example, if you're baking something, wash the dishes while the food is in the oven. Then, you'll have a clean kitchen by the time the food is done.",
  "tyn_model":[
    "butter",
    "grill",
    "oven",
    "vegetables",
    "microwave",
    "refrigerator",
    "water",
    "dishes",
    "potatoes",
    "onion",
    "rice",
    "chicken",
    "rice noodles",
    "gas grill",
    "skillet",
    "stove",
    "slow cooker",
    "pressure cooker",
    "kitchen tools",
    "pasta",
    "onions",
    "seafood",
    "box grater",
    "tossed salad",
    "griddle",
    "waffle iron",
    "asparagus",
    "peppers",
    "charcoal grill",
    "stovetop",
    "stock",
    "ice water",
    "vegetable or chicken stock",
    "oil",
    "broccoli",
    "rice cooker",
    "toaster oven",
    "pressure-",
    "pans",
    "baking sheet",
    "mushrooms",
    "pots",
    "knives",
    "salsa",
    "beans",
    "meat sauce",
    "pasta sauce",
    "pizza",
    "garden salad"
  ],
  "tyn_section":[

  ]
}