{
  "title":"How to Make Lemon Pudding Cakes",
  "url":"https://www.wikihow.com/Make-Lemon-Pudding-Cakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Fruit Cakes"
  ],
  "steps":[
    {
      "headline":"Pre-heat your oven to 350 degrees F, 175 degrees C, or on gas mark 4.",
      "description":""
    },
    {
      "headline":"Pre-grease the ramekins with non-stick cooking spray or wipe with a buttered kitchen paper/towel.",
      "description":""
    },
    {
      "headline":"Get a medium bowl and mix the flour and sugar together.",
      "description":""
    },
    {
      "headline":"Get another bowl and mix the softened butter with the egg yolks.",
      "description":""
    },
    {
      "headline":"Measure and pour the lemon juice, milk, and lemon zest into the egg/butter bowl.",
      "description":"Stir everything together."
    },
    {
      "headline":"Pour the egg bowl into the sugar bowl and use a whisk to mix thoroughly.",
      "description":""
    },
    {
      "headline":"Get a third bowl and whip the salt and egg whites together.",
      "description":"Wait until it peaks foam."
    },
    {
      "headline":"Fold the whites in the lemon mixture bowl with a rubber spatula.",
      "description":""
    },
    {
      "headline":"Spoon the mixture into the individual ramekins and then put the ramekins into a roasting pan.",
      "description":""
    },
    {
      "headline":"Pour hot water into the roasting pan so that it covers the bottom halves of the ramekins.",
      "description":""
    },
    {
      "headline":"Bake the ramekins for 35 minutes.",
      "description":""
    },
    {
      "headline":"Transfer the ramekins with tongs to a cooling rack and leave it on the side for about 20 minutes to cool down.",
      "description":""
    },
    {
      "headline":"Remove the cakes from the ramekins or serve in them.",
      "description":"Garnish with fresh berries."
    }
  ],
  "text":" Pre-heat your oven to 350 degrees F, 175 degrees C, or on gas mark 4.  Pre-grease the ramekins with non-stick cooking spray or wipe with a buttered kitchen paper/towel.  Get a medium bowl and mix the flour and sugar together.  Get another bowl and mix the softened butter with the egg yolks.  Measure and pour the lemon juice, milk, and lemon zest into the egg/butter bowl. Stir everything together. Pour the egg bowl into the sugar bowl and use a whisk to mix thoroughly.  Get a third bowl and whip the salt and egg whites together. Wait until it peaks foam. Fold the whites in the lemon mixture bowl with a rubber spatula.  Spoon the mixture into the individual ramekins and then put the ramekins into a roasting pan.  Pour hot water into the roasting pan so that it covers the bottom halves of the ramekins.  Bake the ramekins for 35 minutes.  Transfer the ramekins with tongs to a cooling rack and leave it on the side for about 20 minutes to cool down.  Remove the cakes from the ramekins or serve in them. Garnish with fresh berries.",
  "tyn_model":[
    "ramekins",
    "lemon",
    "roasting pan",
    "oven",
    "non-stick cooking spray",
    "buttered kitchen paper",
    "flour",
    "sugar",
    "bowl",
    "butter",
    "egg yolks",
    "milk",
    "egg/butter",
    "sugar bowl",
    "whisk",
    "salt",
    "lemon mixture",
    "rubber spatula",
    "water",
    "tongs",
    "berries"
  ],
  "tyn_section":[

  ]
}