{
  "title":"How to Keep Ants Away From Cat Food",
  "url":"https://www.wikihow.com/Keep-Ants-Away-From-Cat-Food",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Pest Control",
    "Ant and Termite Control"
  ],
  "methods":[
    {
      "name":"Preventing Ants from Invading",
      "steps":[
        {
          "headline":"Keep food in an airtight plastic container.",
          "description":"Instead of keeping cat food in the bag, move the food from the bag to the plastic container after opening the bag. There are many of these available that are designed for pet food."
        },
        {
          "headline":"Wash the food bowls.",
          "description":"Ants are attracted to crumbs and any food left behind. Wash the bowls at least once every two days, or more if possible. This is extremely important if you have an ant problem. Use a cat safe detergent and rinse thoroughly with fresh, clean water."
        },
        {
          "headline":"Keep the feeding area clean.",
          "description":"Deter ants from getting interested in the food area in the first place by keeping it clean. Sweep up any crumbs or leftover food after your cat has finished eating. Mop the floor with vinegar or lemon mixtures to help dissuade ants from approaching. You may consider moving the bowl off the floor when your cat is not eating, or leaving it out during certain hours, but picking it up at night."
        },
        {
          "headline":"Shift the feeding area.",
          "description":"You can also try to move the bowl to another place. This way the ants may not be able to find it. If you have ants coming into the room, move the bowl away from the ant colony."
        },
        {
          "headline":"Make a boundary around the food.",
          "description":"Try making a boundary around your cat's food bowl that ants can't cross. There are certain substances that will help repel ants. Draw a line around the bowl with chalk. Place a newspaper under the bowl and surround the bowl with a line of ground cinnamon, coffee grounds, chili powder, or ash. Surround the edge of the food container with petroleum jelly. Spray vinegar or lemon on the floor around your pet's bowl. Mix 1 part vinegar or lemon juice to 1 part water. Place in a spray bottle and spray around the bowl, creating a boundary."
        },
        {
          "headline":"Cover the outside of the bowl with petroleum jelly.",
          "description":"A messy method to prevent ants from reaching the food is to smear the outside of the food bowl with petroleum jelly. The ants have trouble walking up the slippery surface. You can also place this on the outside of the moat container as an extra line of defense."
        },
        {
          "headline":"Use essential oils safely.",
          "description":"Many essential oils can help repel ants. Try wiping down the floor around your cat's bowl with a damp cloth that contains a few drops of peppermint oil. Ants are repelled by the strong smell. You can also use lemon, orange, or grapefruit oil to repel ants. Try wiping the floor around the bowl with a cotton ball covered in the oil. Essential oils are natural products and do not contain chemicals; however, make sure your cat never ingests undiluted essential oils as these can be toxic. Any essential oil that is applied where a cat might accidentally lick should be well-diluted."
        },
        {
          "headline":"Use a lure to attract the ants.",
          "description":"A good way to keep the ants far from the bowl is to place commercial ant bait (under a cat-safe box) in the general area. Make sure that there is just a small hole for the ants to get in and eat the poison. At the same time, make sure your pet cannot access the bait. One way might be to screw a box directly into the floor or deck. It might be possible to jamb the cover box behind a stove or refrigerator, but only if the space is excessively narrow for your cat to access it. Just remember that cats are curious and can get into unimaginable places."
        }
      ]
    },
    {
      "name":"Making a Food Bowl Moat",
      "steps":[
        {
          "headline":"Remove any ants already in your cat's food bowl.",
          "description":"Dump out the ants and remaining contaminated food. Immediately close the bag and take outside. This helps keep the ants from crawling back out and getting back into the food."
        },
        {
          "headline":"Wash the bowl.",
          "description":"Ants leave pheromones behind that attract more ants, so make sure to thoroughly wash out the bowl with hot water and detergent. If the bowl is dishwasher friendly, you can put it through your dishwasher."
        },
        {
          "headline":"Clean the food area.",
          "description":"After removing the ants, clean the area around the food. You have to remove the pheromone trail so ants from the colony won't return. Try using vinegar or lemon juice to erase the scent and deter future ants from approaching. You can also mop the area around the food container, or the entire kitchen floor. You can use what you normally use to mop, or use dish soap."
        },
        {
          "headline":"Find a moat container.",
          "description":"Look for a shallow container that is wider than the cat food bowl. You can use a silver tray, a cake pan, a pie pan, a roasting tray, or anything else that will fit the cat bowl in. Make sure the container you put the cat bowl in isn't too big. However, there should be about an inch between the edge of the moat and the food bowl. This distance helps keep ants away. Some companies manufacture bowls that already incorporate the moat around the bowl's edge. These are great and easy to use and the entire bowl can be picked up and cleaned in one go. However, if you don't want to spend the money on that before seeing if it works, you can try this DIY method."
        },
        {
          "headline":"Fill the container with water.",
          "description":"Place a small amount of water in the moat container. You don't want to fill it too high so it spills into the food, but want enough water to provide a barrier for the ants. Ants aren't good swimmers, so it should drown or deter the ants from crossing. To help keep ants from crossing the water, try placing some vegetable oil, lemon essential oil, or dishwashing soap into the moat water. But only add dishwashing liquid if the space between the moat and food bowl is too small for the cat to drink from."
        },
        {
          "headline":"Place the food bowl in the moat container.",
          "description":"Put the food bowl in the water. Make sure there is at least a 1-inch space between the edge of the moat and the food bowl. Fill the food bowl with fresh food. If the container is extra large, put the food bowl close enough to its edge so your cat will be able to reach the food without difficulty, but far enough from the edge the ants won't be able to hop across. If the food bowl is too short, use a block or other item to raise the food bowl above the edge of the moat container."
        },
        {
          "headline":"Empty the moat container as needed.",
          "description":"The water may contain some drowned ants or spilled food. It will need refreshing as it begins to evaporate."
        },
        {
          "headline":"Keep up this process.",
          "description":"Eventually, the ants will stop coming. In some places, like in warmer climates, you may have to feed your cat in this manner persistently as the ants never go away."
        }
      ]
    }
  ],
  "text":" Preventing Ants from Invading Keep food in an airtight plastic container. Instead of keeping cat food in the bag, move the food from the bag to the plastic container after opening the bag. There are many of these available that are designed for pet food. Wash the food bowls. Ants are attracted to crumbs and any food left behind. Wash the bowls at least once every two days, or more if possible. This is extremely important if you have an ant problem. Use a cat safe detergent and rinse thoroughly with fresh, clean water. Keep the feeding area clean. Deter ants from getting interested in the food area in the first place by keeping it clean. Sweep up any crumbs or leftover food after your cat has finished eating. Mop the floor with vinegar or lemon mixtures to help dissuade ants from approaching. You may consider moving the bowl off the floor when your cat is not eating, or leaving it out during certain hours, but picking it up at night. Shift the feeding area. You can also try to move the bowl to another place. This way the ants may not be able to find it. If you have ants coming into the room, move the bowl away from the ant colony. Make a boundary around the food. Try making a boundary around your cat's food bowl that ants can't cross. There are certain substances that will help repel ants. Draw a line around the bowl with chalk. Place a newspaper under the bowl and surround the bowl with a line of ground cinnamon, coffee grounds, chili powder, or ash. Surround the edge of the food container with petroleum jelly. Spray vinegar or lemon on the floor around your pet's bowl. Mix 1 part vinegar or lemon juice to 1 part water. Place in a spray bottle and spray around the bowl, creating a boundary. Cover the outside of the bowl with petroleum jelly. A messy method to prevent ants from reaching the food is to smear the outside of the food bowl with petroleum jelly. The ants have trouble walking up the slippery surface. You can also place this on the outside of the moat container as an extra line of defense. Use essential oils safely. Many essential oils can help repel ants. Try wiping down the floor around your cat's bowl with a damp cloth that contains a few drops of peppermint oil. Ants are repelled by the strong smell. You can also use lemon, orange, or grapefruit oil to repel ants. Try wiping the floor around the bowl with a cotton ball covered in the oil. Essential oils are natural products and do not contain chemicals; however, make sure your cat never ingests undiluted essential oils as these can be toxic. Any essential oil that is applied where a cat might accidentally lick should be well-diluted. Use a lure to attract the ants. A good way to keep the ants far from the bowl is to place commercial ant bait (under a cat-safe box) in the general area. Make sure that there is just a small hole for the ants to get in and eat the poison. At the same time, make sure your pet cannot access the bait. One way might be to screw a box directly into the floor or deck. It might be possible to jamb the cover box behind a stove or refrigerator, but only if the space is excessively narrow for your cat to access it. Just remember that cats are curious and can get into unimaginable places. Making a Food Bowl Moat Remove any ants already in your cat's food bowl. Dump out the ants and remaining contaminated food. Immediately close the bag and take outside. This helps keep the ants from crawling back out and getting back into the food. Wash the bowl. Ants leave pheromones behind that attract more ants, so make sure to thoroughly wash out the bowl with hot water and detergent. If the bowl is dishwasher friendly, you can put it through your dishwasher. Clean the food area. After removing the ants, clean the area around the food. You have to remove the pheromone trail so ants from the colony won't return. Try using vinegar or lemon juice to erase the scent and deter future ants from approaching. You can also mop the area around the food container, or the entire kitchen floor. You can use what you normally use to mop, or use dish soap. Find a moat container. Look for a shallow container that is wider than the cat food bowl. You can use a silver tray, a cake pan, a pie pan, a roasting tray, or anything else that will fit the cat bowl in. Make sure the container you put the cat bowl in isn't too big. However, there should be about an inch between the edge of the moat and the food bowl. This distance helps keep ants away. Some companies manufacture bowls that already incorporate the moat around the bowl's edge. These are great and easy to use and the entire bowl can be picked up and cleaned in one go. However, if you don't want to spend the money on that before seeing if it works, you can try this DIY method. Fill the container with water. Place a small amount of water in the moat container. You don't want to fill it too high so it spills into the food, but want enough water to provide a barrier for the ants. Ants aren't good swimmers, so it should drown or deter the ants from crossing. To help keep ants from crossing the water, try placing some vegetable oil, lemon essential oil, or dishwashing soap into the moat water. But only add dishwashing liquid if the space between the moat and food bowl is too small for the cat to drink from. Place the food bowl in the moat container. Put the food bowl in the water. Make sure there is at least a 1-inch space between the edge of the moat and the food bowl. Fill the food bowl with fresh food. If the container is extra large, put the food bowl close enough to its edge so your cat will be able to reach the food without difficulty, but far enough from the edge the ants won't be able to hop across. If the food bowl is too short, use a block or other item to raise the food bowl above the edge of the moat container. Empty the moat container as needed. The water may contain some drowned ants or spilled food. It will need refreshing as it begins to evaporate. Keep up this process. Eventually, the ants will stop coming. In some places, like in warmer climates, you may have to feed your cat in this manner persistently as the ants never go away.",
  "tyn_model":[
    "water",
    "bowl",
    "food bowl",
    "vinegar",
    "essential oils",
    "lemon",
    "petroleum jelly",
    "food",
    "bowls",
    "airtight plastic container",
    "cat food",
    "food bowls",
    "cat safe detergent",
    "chalk",
    "newspaper",
    "coffee grounds",
    "chili powder",
    "lemon juice",
    "spray bottle",
    "peppermint oil",
    "cotton ball",
    "essential oil",
    "lure",
    "refrigerator",
    "hot water",
    "detergent",
    "dish soap",
    "cat food bowl",
    "silver tray",
    "cake pan",
    "pie pan",
    "roasting tray",
    "vegetable oil",
    "lemon essential oil",
    "dishwashing soap",
    "dishwashing liquid",
    "cat",
    "ants"
  ],
  "tyn_section":[

  ]
}