{
  "title":"How to Make Lyric Art",
  "url":"https://www.wikihow.com/Make-Lyric-Art",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing",
    "Drawing Text and Lettering"
  ],
  "methods":[
    {
      "name":"Learning How to Letter",
      "steps":[
        {
          "headline":"Make your own stencil.",
          "description":"Select your favorite computer font and print out the letters you need for your project. Make sure you print the letters in size 72 or above. Once you have your letters, cut around them to create a box shape. Glue the letter onto a piece of cardstock. Wait for the glue to dry, then use an Xacto knife to remove the white border from your letter so only the letter remains. Fonts with straight lines work better than fonts with lots of intricate details. Use your letter stencils to trace letters onto a piece of canvas and paint the letters different colors for a cool piece of lyric art."
        },
        {
          "headline":"Freehand your letters.",
          "description":"To do this, you will need a pencil, an eraser, a ruler and some black markers of varying thicknesses. Using your ruler, draw three lines on your paper: a baseline, an x-height and a cap height. The base line is where you’d like your letters to sit. The x-height is how tall you’d like your lower case letters to be and your cap height is how tall you’d like your capital letters to be. Once your guidelines are drawn, make a rough sketch of all your letters. Do multiple drafts until you like the way one of them looks. When you land on a draft you like, use your pencil to flesh out all the letters. Make sure you make each letter the same thickness. Go over your letters with your black markers. Use your eraser to wipe away any remaining pencil lines."
        },
        {
          "headline":"Cut letters out of fabric.",
          "description":"Start by finding an alphabet template online. Print out the letters and cut each letter with scissors or an Xacto knife. Trace each letter onto a piece of fabric. Cut the fabric letters out using fabric scissors or pinking shears. Pin your fabric to a piece of cardboard to keep it from moving while you trace and cut. If you make your letters big enough, you can use the letters to create a banner."
        }
      ]
    },
    {
      "name":"Making Art You Can Hang",
      "steps":[
        {
          "headline":"Cut your lyrics out of felt.",
          "description":"To complete this project, you’ll need a picture frame, poster board, glue, scissors and different colored sheets of felt. Pick your favorite line from a song. Then trace the words onto the pieces of felt. Glue the letters in the correct order onto your poster board, then frame and hang the picture. Try to create some variety in the colors you use for each letter. Shorter lines from songs generally work better. Try “Home is Wherever I’m With You” or “All the Single Ladies.”\nTo make your felt letters as uniform as possible, remember to use an alphabet template to create the letters."
        },
        {
          "headline":"Paint your favorite lyrics on a canvas.",
          "description":"For this project, you’ll need black acrylic paint, small paint brushes and a white canvas. Freehand your favorite lyrics on the canvas using your paintbrush and being cognizant of spacing. After the art dries, hang it or prop it up against a wall. The bigger the canvas, the more impactful the art, but you can do this project with any size canvas. If you have bad handwriting, ask a friend to paint the lyrics for you. You can also try using a stencil."
        },
        {
          "headline":"Use stickers to create your lyrics.",
          "description":"For this project you’ll need a square canvas, 2 inch vinyl alphabet stickers, a small paintbrush and white acrylic wall paint. Once you’ve selected your song lyrics, position your stickers to spell out the lyrics on your canvas. Lightly brush your canvas with the paint. When the paint has dried, peel the letters off and hang the canvas. You can use a ruler to help center the letters or do it by hand for a more casual look. If you need assistance peeling the letters off your canvas, use tweezers. Double check to make sure you have all the letters you need before beginning to paint."
        }
      ]
    },
    {
      "name":"Making Art Using Household Objects",
      "steps":[
        {
          "headline":"Paint a globe.",
          "description":"For this project you’ll need a globe, black and aqua acrylic paint, gold spray paint and a gold pen. Use a thin paintbrush to outline all the continents in black. Then use a larger paintbrush to fill in the oceans with black paint. Paint the continents using aqua paint. Allow the globe to dry, then remove it from its stand and balance it on a bowl so you can paint Antarctica and the North Pole. While your globe is drying, spruce up the stand using the spray paint. When the globe is dry, reattach it to its stand and use your sharpie to freehand your song lyrics across the globe. Depending on your globe, you may need more than one coat of paint. You can substitute these colors for other colors if you prefer."
        },
        {
          "headline":"Decorate a pillow with your favorite song lyrics.",
          "description":"For this project, you will need a freshly washed and ironed white pillowcase and a black Sharpie fabric pen. Choose a song lyric that is particularly meaningful to you and using your Sharpie pen, write it across both sides of the pillowcase. Place a sheet of cardboard between the pillowcase to keep the words from bleeding onto the other side. Depending on your preferences, you can use a ruler to center the words, or freehand it. Give your pillowcase 24 hours to dry before washing."
        },
        {
          "headline":"Write your favorite song lyrics on a coffee cup.",
          "description":"For this project, all you’ll need is a white coffee mug and food safe permanent markers. Wipe down your coffee mug, then use your favorite lyrics to create a design on your cup. Bake your mug at 375 degrees for 40 minutes. Be careful not to smudge your design; the marker will still be wet until after your bake your mug. To keep your mug from cracking, allow it to heat up and cool down in the oven."
        }
      ]
    },
    {
      "name":"Making Art Using Your Computer",
      "steps":[
        {
          "headline":"Type your favorite lyrics in Word.",
          "description":"Open a Word document and type in your favorite song lyrics. Play around with font, size, color and spacing until you find a design you like. Print your document on cardstock before framing and hanging it on your wall. If you’re familiar with Photoshop, you can work inside this program. Experiment with layering your text over pictures. If you decide not to print professionally, make sure to utilize a high-resolution printer. Otherwise, your art will come out looking grainy."
        },
        {
          "headline":"Use an app.",
          "description":"Download Word Swag or a similar app on your phone or iPad. Select a photo or background from their selection, or upload your own from your photo library. Type your lyrics on top of the picture and use the app’s features to edit your design. When you’re happy with your final product, print it out and hang it up. Try sending your art off to be printed on something fun like a magnet or t-shirt. You can also use your art as the background on your phone or computer."
        },
        {
          "headline":"Look for art online.",
          "description":"Depending on what your lyrics are, there may already be free art available for you on the Internet. Google the lyrics you intend to use to see if there is a free art print download. If so, download the print, frame it and display it in your home. This method is most effective if you are looking for lyrics like, “You are my sunshine” or “Shake it off.”\nIt is not legal to make money off of someone else’s work, so do not sell the art to anyone else."
        }
      ]
    }
  ],
  "text":" Learning How to Letter Make your own stencil. Select your favorite computer font and print out the letters you need for your project. Make sure you print the letters in size 72 or above. Once you have your letters, cut around them to create a box shape. Glue the letter onto a piece of cardstock. Wait for the glue to dry, then use an Xacto knife to remove the white border from your letter so only the letter remains. Fonts with straight lines work better than fonts with lots of intricate details. Use your letter stencils to trace letters onto a piece of canvas and paint the letters different colors for a cool piece of lyric art. Freehand your letters. To do this, you will need a pencil, an eraser, a ruler and some black markers of varying thicknesses. Using your ruler, draw three lines on your paper: a baseline, an x-height and a cap height. The base line is where you’d like your letters to sit. The x-height is how tall you’d like your lower case letters to be and your cap height is how tall you’d like your capital letters to be. Once your guidelines are drawn, make a rough sketch of all your letters. Do multiple drafts until you like the way one of them looks. When you land on a draft you like, use your pencil to flesh out all the letters. Make sure you make each letter the same thickness. Go over your letters with your black markers. Use your eraser to wipe away any remaining pencil lines. Cut letters out of fabric. Start by finding an alphabet template online. Print out the letters and cut each letter with scissors or an Xacto knife. Trace each letter onto a piece of fabric. Cut the fabric letters out using fabric scissors or pinking shears. Pin your fabric to a piece of cardboard to keep it from moving while you trace and cut. If you make your letters big enough, you can use the letters to create a banner. Making Art You Can Hang Cut your lyrics out of felt. To complete this project, you’ll need a picture frame, poster board, glue, scissors and different colored sheets of felt. Pick your favorite line from a song. Then trace the words onto the pieces of felt. Glue the letters in the correct order onto your poster board, then frame and hang the picture. Try to create some variety in the colors you use for each letter. Shorter lines from songs generally work better. Try “Home is Wherever I’m With You” or “All the Single Ladies.”\nTo make your felt letters as uniform as possible, remember to use an alphabet template to create the letters. Paint your favorite lyrics on a canvas. For this project, you’ll need black acrylic paint, small paint brushes and a white canvas. Freehand your favorite lyrics on the canvas using your paintbrush and being cognizant of spacing. After the art dries, hang it or prop it up against a wall. The bigger the canvas, the more impactful the art, but you can do this project with any size canvas. If you have bad handwriting, ask a friend to paint the lyrics for you. You can also try using a stencil. Use stickers to create your lyrics. For this project you’ll need a square canvas, 2 inch vinyl alphabet stickers, a small paintbrush and white acrylic wall paint. Once you’ve selected your song lyrics, position your stickers to spell out the lyrics on your canvas. Lightly brush your canvas with the paint. When the paint has dried, peel the letters off and hang the canvas. You can use a ruler to help center the letters or do it by hand for a more casual look. If you need assistance peeling the letters off your canvas, use tweezers. Double check to make sure you have all the letters you need before beginning to paint. Making Art Using Household Objects Paint a globe. For this project you’ll need a globe, black and aqua acrylic paint, gold spray paint and a gold pen. Use a thin paintbrush to outline all the continents in black. Then use a larger paintbrush to fill in the oceans with black paint. Paint the continents using aqua paint. Allow the globe to dry, then remove it from its stand and balance it on a bowl so you can paint Antarctica and the North Pole. While your globe is drying, spruce up the stand using the spray paint. When the globe is dry, reattach it to its stand and use your sharpie to freehand your song lyrics across the globe. Depending on your globe, you may need more than one coat of paint. You can substitute these colors for other colors if you prefer. Decorate a pillow with your favorite song lyrics. For this project, you will need a freshly washed and ironed white pillowcase and a black Sharpie fabric pen. Choose a song lyric that is particularly meaningful to you and using your Sharpie pen, write it across both sides of the pillowcase. Place a sheet of cardboard between the pillowcase to keep the words from bleeding onto the other side. Depending on your preferences, you can use a ruler to center the words, or freehand it. Give your pillowcase 24 hours to dry before washing. Write your favorite song lyrics on a coffee cup. For this project, all you’ll need is a white coffee mug and food safe permanent markers. Wipe down your coffee mug, then use your favorite lyrics to create a design on your cup. Bake your mug at 375 degrees for 40 minutes. Be careful not to smudge your design; the marker will still be wet until after your bake your mug. To keep your mug from cracking, allow it to heat up and cool down in the oven. Making Art Using Your Computer Type your favorite lyrics in Word. Open a Word document and type in your favorite song lyrics. Play around with font, size, color and spacing until you find a design you like. Print your document on cardstock before framing and hanging it on your wall. If you’re familiar with Photoshop, you can work inside this program. Experiment with layering your text over pictures. If you decide not to print professionally, make sure to utilize a high-resolution printer. Otherwise, your art will come out looking grainy. Use an app. Download Word Swag or a similar app on your phone or iPad. Select a photo or background from their selection, or upload your own from your photo library. Type your lyrics on top of the picture and use the app’s features to edit your design. When you’re happy with your final product, print it out and hang it up. Try sending your art off to be printed on something fun like a magnet or t-shirt. You can also use your art as the background on your phone or computer. Look for art online. Depending on what your lyrics are, there may already be free art available for you on the Internet. Google the lyrics you intend to use to see if there is a free art print download. If so, download the print, frame it and display it in your home. This method is most effective if you are looking for lyrics like, “You are my sunshine” or “Shake it off.”\nIt is not legal to make money off of someone else’s work, so do not sell the art to anyone else.",
  "tyn_model":[
    "glue",
    "ruler",
    "fabric",
    "paint",
    "xacto knife",
    "pencil",
    "eraser",
    "scissors",
    "cardboard",
    "poster board",
    "felt",
    "” or",
    "”\n",
    "acrylic paint",
    "stickers",
    "coffee mug",
    "art",
    "stencil",
    "letter stencils",
    "black markers",
    "paper",
    "markers",
    "fabric scissors",
    "picture frame",
    "“home",
    "“all",
    "paint brushes",
    "paintbrush",
    "white acrylic wall paint",
    "tweezers",
    "globe",
    "gold spray paint",
    "gold pen",
    "aqua paint",
    "bowl",
    "spray paint",
    "sharpie",
    "pillow",
    "sharpie fabric pen",
    "sharpie pen",
    "coffee cup",
    "food safe permanent markers",
    "marker",
    "mug",
    "oven",
    "word document",
    "photoshop",
    "printer",
    "word swag",
    "art print",
    "“you",
    "“shake"
  ],
  "tyn_section":[

  ]
}