{
  "title":"How to Make a Photograph Look Like a Sketch with the Minimum Filter",
  "url":"https://www.wikihow.com/Make-a-Photograph-Look-Like-a-Sketch-with-the-Minimum-Filter",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photography Genres",
    "Art Photography"
  ],
  "steps":[
    {
      "headline":"Open your image in Photoshop.",
      "description":""
    },
    {
      "headline":"Duplicate the background (your image).",
      "description":""
    },
    {
      "headline":"Desaturate the layer.",
      "description":"To do this, simply select Image >> Adjustments >> Desaturate. You can also press Shift + Ctrl + U instead."
    },
    {
      "headline":"Duplicate the background again and desaturate it as well.",
      "description":"You want to have 2 desaturated layers when you are done."
    },
    {
      "headline":"Invert the second desaturated layer (the top one).",
      "description":"You can do this by going to Image >> Adjustments >> Invert."
    },
    {
      "headline":"Change the blend mode of that layer to Color Dodge.",
      "description":"Don't be alarmed at the result."
    },
    {
      "headline":"Set your pixel value.",
      "description":"Go to Filter >> Other >> Minimum and set a value of about 2 or 3 pixels."
    },
    {
      "headline":"If you want your 'sketch' to have a stronger look, then you should set a higher value of pixels.",
      "description":"This image is using a setting of 4."
    }
  ],
  "text":" Open your image in Photoshop.  Duplicate the background (your image).  Desaturate the layer. To do this, simply select Image >> Adjustments >> Desaturate. You can also press Shift + Ctrl + U instead. Duplicate the background again and desaturate it as well. You want to have 2 desaturated layers when you are done. Invert the second desaturated layer (the top one). You can do this by going to Image >> Adjustments >> Invert. Change the blend mode of that layer to Color Dodge. Don't be alarmed at the result. Set your pixel value. Go to Filter >> Other >> Minimum and set a value of about 2 or 3 pixels. If you want your 'sketch' to have a stronger look, then you should set a higher value of pixels. This image is using a setting of 4.",
  "tyn_model":[
    "photoshop"
  ],
  "tyn_section":[

  ]
}