{
  "title":"How to Make a Hummingbird Cake",
  "url":"https://www.wikihow.com/Make-a-Hummingbird-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Fruit Cakes"
  ],
  "steps":[
    {
      "headline":"Pre-heat the oven to 350 degrees F or 175 degrees C.",
      "description":""
    },
    {
      "headline":"Get 1 to 3 9-inch cake pans, depending on how many layers you want.",
      "description":"Grease the cake pans and sprinkle a thin layer of flour on the bottom of them."
    },
    {
      "headline":"Make the batter.",
      "description":"In a large bowl, mix the cinnamon, sugar, flour, salt, and baking soda. Add the oil and eggs in the bowl and stir everything together. Add and stir in the mashed bananas, pineapple, vanilla, and pecans. Mix everything thoroughly."
    },
    {
      "headline":"Pour the batter into the cake pans.",
      "description":"Skim with a rubber spatula to make it evenly."
    },
    {
      "headline":"Bake the cakes for 22-24 minutes.",
      "description":"You can tell if the cake is done by inserting a toothpick in the center. If it comes out clean, the cake is done. If there's batter on the toothpick or crumbs come up with it, then put it back in the oven for another minute or so each time you check."
    },
    {
      "headline":"Place the pans on cooling racks for about 10-12 minutes.",
      "description":"Remove the cake layers from the pans and then put the cakes back on the racks so that they can be cooled completely."
    },
    {
      "headline":"Frost each cake layer with cream cheese frosting and decorate the top layer and sides with pineapple flowers.",
      "description":""
    }
  ],
  "text":" Pre-heat the oven to 350 degrees F or 175 degrees C.  Get 1 to 3 9-inch cake pans, depending on how many layers you want. Grease the cake pans and sprinkle a thin layer of flour on the bottom of them. Make the batter. In a large bowl, mix the cinnamon, sugar, flour, salt, and baking soda. Add the oil and eggs in the bowl and stir everything together. Add and stir in the mashed bananas, pineapple, vanilla, and pecans. Mix everything thoroughly. Pour the batter into the cake pans. Skim with a rubber spatula to make it evenly. Bake the cakes for 22-24 minutes. You can tell if the cake is done by inserting a toothpick in the center. If it comes out clean, the cake is done. If there's batter on the toothpick or crumbs come up with it, then put it back in the oven for another minute or so each time you check. Place the pans on cooling racks for about 10-12 minutes. Remove the cake layers from the pans and then put the cakes back on the racks so that they can be cooled completely. Frost each cake layer with cream cheese frosting and decorate the top layer and sides with pineapple flowers. ",
  "tyn_model":[
    "cake pans",
    "oven",
    "flour",
    "large bowl",
    "cinnamon",
    "sugar",
    "salt",
    "baking soda",
    "oil",
    "eggs",
    "bowl",
    "bananas",
    "pineapple",
    "vanilla",
    "pecans",
    "rubber spatula",
    "pans",
    "cream cheese",
    "pineapple flowers"
  ],
  "tyn_section":[

  ]
}