{
  "title":"How to Build a Tunnel",
  "url":"https://www.wikihow.com/Build-a-Tunnel",
  "category_hierarchy":[
    "Home and Garden",
    "Yard and Outdoors",
    "Earthworks"
  ],
  "parts":[
    {
      "name":"Factors to Consider in Building a Tunnel",
      "steps":[
        {
          "headline":"Consider where the tunnel will be built.",
          "description":"The proposed tunnel’s location will determine what tools and techniques are necessary to construct it and prepare it for its intended use. Tunnels can be divided into 3 types:\nSoft-ground tunnels. These tunnels require support at the openings to keep the tunnel from collapsing. These tunnels are usually shallow and used for subways, water delivery, and wastewater removal systems. Rock tunnels. Because they are excavated from solid rock, these tunnels require little added support or none at all. Train and car tunnels are usually of this variety. Underwater tunnels. As the name indicates, these tunnels go under rivers, lakes, canals, and in the case of the “Chunnel,” straits such as the English Channel. These are the hardest tunnels to build, as water has to be kept away from the tunnel during and after construction. Building a tunnel under a city offers problems similar to an underwater tunnel, in that the ground around the tunnel tends to sag under the weight of the buildings above it. A knowledge of the area’s geology helps predict how much the ground will sag and suggests what methods can minimize the sagging."
        },
        {
          "headline":"Consider the tunnel’s path.",
          "description":"A tunnel with a long, single, straight path is comparatively easy to bore with a tunnel boring machine. Tunnels that differ from this design offer problems that make constructing them more complex. Short tunnels aren’t bored with tunnel boring machines because it isn’t cost-efficient to do so. Tunnels that require different bore diameters at different parts of their routes also make the use of a tunnel boring machine impractical because of delays in adjusting the bore diameter. Tunnels that turn sharp corners or have intersecting shafts also make use of a boring machine impractical."
        },
        {
          "headline":"Consider the tunnel’s purpose.",
          "description":"What the tunnel will be used for determines what additional work besides making the tunnel itself will be necessary before putting it into service. Tunnels that carry passengers require some form of ventilation. For roadway tunnels, this usually means ventilation shafts to prevent buildup of carbon monoxide. For railway tunnels, this can mean forced-air ventilation to remove diesel engine exhaust. Both feature supplemental methods to deal with the smoke created should a fire break out in the tunnel. Heavily-used tunnels, such as the Big Dig in Boston, may feature continuously manned operations centers with video equipment to monitor traffic within the tunnel and deal with emergencies. Long roadway tunnels, such as the Eisenhower Tunnel in Colorado, may be lit with overhead lights for the convenience of drivers and passengers. Other roadway tunnels, such as those in Zion National Park in Utah, may feature scenic cutouts to allow natural light to enter the tunnel in places and provide passengers glimpses of the surrounding scenery. Some tunnels, such as the Queensway Tunnel between Liverpool and Birkenhead, England and the Lion Rock Tunnel between Sha Tin and New Kowloon in Hong Kong, combine an upper passenger traffic deck with a lower service deck for water, pipes, or cables. Other tunnels, such as Malaysia’s SMART Tunnel can be used for either traffic or flood control."
        }
      ]
    },
    {
      "name":"Using the Cut-and-Cover Method",
      "steps":[
        {
          "headline":"Dig a trench.",
          "description":"The area where the tunnel will be is dug out completely, with the tunnel roof to be created and covered over when the tunnel is completed. This type of tunnel is constructed in one of two ways:\nBottom-up: Ground support is created first, then the tunnel is built up around it. Top-down: The tunnel’s sides and roof are constructed at ground level, and the tunnel trench is dug out under it. Both methods are used primarily for shallower tunnels, although the top-down method allows for digging deeper tunnels than the bottom-up method. Deeper tunnels are often excavated with the assistance of a tunneling shield, a box-like structure with small shutters opened to dig through. Once the dirt in front of the shield is removed, the shield is moved forward to continue digging."
        },
        {
          "headline":"Create the tunnel walls and roof.",
          "description":"The tunnel walls and roof can be built as the tunnel is being dug or may be pre-constructed and put into place as the tunnel is being dug. Materials today include the following:\nCorrugated steel arches. Precast concrete arches. Precast concrete walls. Poured or sprayed concrete. Often, this is used in conjunction with one of the formed-arch methods."
        },
        {
          "headline":"Complete the tunnel.",
          "description":"How this is done depends on whether the bottom-up or top-down method was used. Tunnels created with the bottom-up method must be back-filled to cover over the tunnel roof and any surface that is to exist above the tunnel roof is then built or rebuilt. Tunnels created with the top-down method are dug out below where the tunnel walls and roof were erected, and then a base slab, which serves as the tunnel floor, is created."
        }
      ]
    },
    {
      "name":"Using Immersed Tubes",
      "steps":[
        {
          "headline":"Dredge a trench when the tunnel will go.",
          "description":"This method is similar to the cut-and-cover method, but is used for digging underwater tunnels. The trench needs to run the length the tunnel will run underwater."
        },
        {
          "headline":"Lay a series of steel tubes along the length of the trench.",
          "description":"Each tube is sealed at either end with a bulkhead. If the tube is for a car tunnel, as in the case of the Ted Williams Tunnel in Boston, the tubes include pre-built road sections."
        },
        {
          "headline":"Encase the tube with enough backfill to withstand the water pressure above it.",
          "description":"For the Ted Williams Tunnel, this was a 5-foot-thick (1.5 m-thick) layer of rock."
        },
        {
          "headline":"Connect the tubes by removing the intervening bulkheads.",
          "description":"Any road or rail segments built into the tubes would be connected at this time as well."
        }
      ]
    },
    {
      "name":"Using a Tunnel Boring Machine",
      "steps":[
        {
          "headline":"Choose the right tunneling machine for the job.",
          "description":"Tunnel boring machines, called TBMs for short or “moles,” feature circular plates on the front called shields. Disc-shaped cutters on the shield tear through rock and dirt, which passes through openings in the shield onto a conveyor belt inside the TBM that deposit it behind the machine. The types of TBM shields vary according to whether the mole is to dig into soft, wet ground or hard rock. Shield diameters range from Aker Wirth’s 26.3-foot (8.03 m) shield on its TBM used for Switzerland’s Linth-Limmern power stations to Hitachi Zosen’s “Big Bertha,” with its diameter of 57.5 feet (17.5 m). Moles designed to dig tunnels below the water table also feature chambers at the front to pressurize the ground being dug through. For large jobs, multiple TBMs may be called for. The Channel Tunnel required 11."
        },
        {
          "headline":"Get the machine into position.",
          "description":"For a surface level tunnel, this is no problem. If the tunnel is to be bored deep underground, an access shaft, usually circular, is drilled and lined with concrete. The TBM is lowered into it, and the tunnel is excavated from that point. For long tunnels, multiple access shafts are drilled. When the tunnel is finished, the access shafts may become ventilation shafts and/or emergency exits. If they are not so employed, they are left in place for the life of the tunnel."
        },
        {
          "headline":"Erect tunnel supports as the machine bores through.",
          "description":"Segments of pre-cast concrete are erected behind the TBM to form a ring at pre-determined intervals."
        },
        {
          "headline":"Spray concrete on the excavated walls between the support rings.",
          "description":"The sprayed concrete, or shotcrete, coats and stabilizes the tunnel walls. The shotcrete may include steel or polypropylene fibers to strengthen it, much the way steel rebar is used to strengthen cast concrete. The shotcrete also contains an accelerant to help it stick to the tunnel walls and dry quickly."
        }
      ]
    }
  ],
  "text":" Factors to Consider in Building a Tunnel Consider where the tunnel will be built. The proposed tunnel’s location will determine what tools and techniques are necessary to construct it and prepare it for its intended use. Tunnels can be divided into 3 types:\nSoft-ground tunnels. These tunnels require support at the openings to keep the tunnel from collapsing. These tunnels are usually shallow and used for subways, water delivery, and wastewater removal systems. Rock tunnels. Because they are excavated from solid rock, these tunnels require little added support or none at all. Train and car tunnels are usually of this variety. Underwater tunnels. As the name indicates, these tunnels go under rivers, lakes, canals, and in the case of the “Chunnel,” straits such as the English Channel. These are the hardest tunnels to build, as water has to be kept away from the tunnel during and after construction. Building a tunnel under a city offers problems similar to an underwater tunnel, in that the ground around the tunnel tends to sag under the weight of the buildings above it. A knowledge of the area’s geology helps predict how much the ground will sag and suggests what methods can minimize the sagging. Consider the tunnel’s path. A tunnel with a long, single, straight path is comparatively easy to bore with a tunnel boring machine. Tunnels that differ from this design offer problems that make constructing them more complex. Short tunnels aren’t bored with tunnel boring machines because it isn’t cost-efficient to do so. Tunnels that require different bore diameters at different parts of their routes also make the use of a tunnel boring machine impractical because of delays in adjusting the bore diameter. Tunnels that turn sharp corners or have intersecting shafts also make use of a boring machine impractical. Consider the tunnel’s purpose. What the tunnel will be used for determines what additional work besides making the tunnel itself will be necessary before putting it into service. Tunnels that carry passengers require some form of ventilation. For roadway tunnels, this usually means ventilation shafts to prevent buildup of carbon monoxide. For railway tunnels, this can mean forced-air ventilation to remove diesel engine exhaust. Both feature supplemental methods to deal with the smoke created should a fire break out in the tunnel. Heavily-used tunnels, such as the Big Dig in Boston, may feature continuously manned operations centers with video equipment to monitor traffic within the tunnel and deal with emergencies. Long roadway tunnels, such as the Eisenhower Tunnel in Colorado, may be lit with overhead lights for the convenience of drivers and passengers. Other roadway tunnels, such as those in Zion National Park in Utah, may feature scenic cutouts to allow natural light to enter the tunnel in places and provide passengers glimpses of the surrounding scenery. Some tunnels, such as the Queensway Tunnel between Liverpool and Birkenhead, England and the Lion Rock Tunnel between Sha Tin and New Kowloon in Hong Kong, combine an upper passenger traffic deck with a lower service deck for water, pipes, or cables. Other tunnels, such as Malaysia’s SMART Tunnel can be used for either traffic or flood control. Using the Cut-and-Cover Method Dig a trench. The area where the tunnel will be is dug out completely, with the tunnel roof to be created and covered over when the tunnel is completed. This type of tunnel is constructed in one of two ways:\nBottom-up: Ground support is created first, then the tunnel is built up around it. Top-down: The tunnel’s sides and roof are constructed at ground level, and the tunnel trench is dug out under it. Both methods are used primarily for shallower tunnels, although the top-down method allows for digging deeper tunnels than the bottom-up method. Deeper tunnels are often excavated with the assistance of a tunneling shield, a box-like structure with small shutters opened to dig through. Once the dirt in front of the shield is removed, the shield is moved forward to continue digging. Create the tunnel walls and roof. The tunnel walls and roof can be built as the tunnel is being dug or may be pre-constructed and put into place as the tunnel is being dug. Materials today include the following:\nCorrugated steel arches. Precast concrete arches. Precast concrete walls. Poured or sprayed concrete. Often, this is used in conjunction with one of the formed-arch methods. Complete the tunnel. How this is done depends on whether the bottom-up or top-down method was used. Tunnels created with the bottom-up method must be back-filled to cover over the tunnel roof and any surface that is to exist above the tunnel roof is then built or rebuilt. Tunnels created with the top-down method are dug out below where the tunnel walls and roof were erected, and then a base slab, which serves as the tunnel floor, is created. Using Immersed Tubes Dredge a trench when the tunnel will go. This method is similar to the cut-and-cover method, but is used for digging underwater tunnels. The trench needs to run the length the tunnel will run underwater. Lay a series of steel tubes along the length of the trench. Each tube is sealed at either end with a bulkhead. If the tube is for a car tunnel, as in the case of the Ted Williams Tunnel in Boston, the tubes include pre-built road sections. Encase the tube with enough backfill to withstand the water pressure above it. For the Ted Williams Tunnel, this was a 5-foot-thick (1.5 m-thick) layer of rock. Connect the tubes by removing the intervening bulkheads. Any road or rail segments built into the tubes would be connected at this time as well. Using a Tunnel Boring Machine Choose the right tunneling machine for the job. Tunnel boring machines, called TBMs for short or “moles,” feature circular plates on the front called shields. Disc-shaped cutters on the shield tear through rock and dirt, which passes through openings in the shield onto a conveyor belt inside the TBM that deposit it behind the machine. The types of TBM shields vary according to whether the mole is to dig into soft, wet ground or hard rock. Shield diameters range from Aker Wirth’s 26.3-foot (8.03 m) shield on its TBM used for Switzerland’s Linth-Limmern power stations to Hitachi Zosen’s “Big Bertha,” with its diameter of 57.5 feet (17.5 m). Moles designed to dig tunnels below the water table also feature chambers at the front to pressurize the ground being dug through. For large jobs, multiple TBMs may be called for. The Channel Tunnel required 11. Get the machine into position. For a surface level tunnel, this is no problem. If the tunnel is to be bored deep underground, an access shaft, usually circular, is drilled and lined with concrete. The TBM is lowered into it, and the tunnel is excavated from that point. For long tunnels, multiple access shafts are drilled. When the tunnel is finished, the access shafts may become ventilation shafts and/or emergency exits. If they are not so employed, they are left in place for the life of the tunnel. Erect tunnel supports as the machine bores through. Segments of pre-cast concrete are erected behind the TBM to form a ring at pre-determined intervals. Spray concrete on the excavated walls between the support rings. The sprayed concrete, or shotcrete, coats and stabilizes the tunnel walls. The shotcrete may include steel or polypropylene fibers to strengthen it, much the way steel rebar is used to strengthen cast concrete. The shotcrete also contains an accelerant to help it stick to the tunnel walls and dry quickly.",
  "tyn_model":[
    "concrete",
    "water",
    "shotcrete",
    "tunnels",
    "tunnel boring machines",
    "tunnel boring machine",
    "trench",
    "tbm",
    "“chunnel",
    "” straits",
    "tunnel boring",
    "boring machine",
    "ventilation",
    "pipes",
    "cables",
    "tunneling shield",
    "rock",
    "tunneling machine",
    "“moles",
    "” feature",
    "shields",
    "mole",
    "“big",
    "bertha",
    "” with",
    "tbms"
  ],
  "tyn_section":[

  ]
}