{
  "title":"How to Make Moist Banana Bread",
  "url":"https://www.wikihow.com/Make-Moist-Banana-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Fruit Breads"
  ],
  "parts":[
    {
      "name":"Making Moist, Classic Banana Bread",
      "steps":[
        {
          "headline":"Grease a 9-inch loaf pan, preheat the oven to 350°F and begin combining wet ingredients.",
          "description":"Beat the sugar and butter with a stand mixer or handheld mixer until fluffy. Add the vanilla, eggs and bananas, then beat the mixture until smooth. Though ripe bananas will work, overripe bananas are usually best for baking. They're easier to mash and they're typically more flavorful than green or young bananas."
        },
        {
          "headline":"In a medium sized mixing bowl, mix flour, salt, cinnamon and baking powder together.",
          "description":"Make sure all the dry ingredients are thoroughly mixed and the flour has little to no clumps."
        },
        {
          "headline":"Prepare the marzipan and then add it to the flour mixture.",
          "description":"Marzipan is great for adding moisture to baked fruit dishes because it's an almond paste that melts into the mashed fruit, making it extra gooey. If you've put the marzipan into the freezer overnight, chop the marzipan up and put it in the bowl. If you've left the marzipan at room temperature, you can break it into small pieces with your hands and drop those into the mixture. To keep the marzipan pieces from sticking together, coat every piece with some flour before adding them to the mixing bowl."
        },
        {
          "headline":"Mix the butter/sugar mixture with the flour mixture and stir it up until well combined.",
          "description":"If you would like to add chocolate chips to the recipe, now would be the time. Stir them into mixture, then pour the batter into the greased pan."
        },
        {
          "headline":"Put the pan into the oven and bake for about 45 to 60 minutes.",
          "description":"You will be able to tell when the banana bread is done when the top is a golden brown. To test if it's been properly cooked on the inside, put a toothpick into the center of the loaf and pull it out. If the toothpick comes out clean (meaning free of any sticky crumbs), then it's finished. If not, put it back into the oven for a few minutes, then take it out again to check on its progress."
        },
        {
          "headline":"Cool the banana bread by taking out the pan and sitting it on the stove or cooling rack for 10 minutes.",
          "description":"Once it's cooled, slice and serve. Leftover banana bread can be stored for up to a few days in foil or plastic wrap at room temperature."
        }
      ]
    },
    {
      "name":"Making Moist, Gluten-Free Banana Bread",
      "steps":[
        {
          "headline":"Gather the ingredients.",
          "description":"3 overripe bananas, mashed\n3 eggs\n1/4 cup grapeseed oil (or olive or coconut oil)\n1 teaspoon vanilla extract\n1 cup almond meal\n1/2 cup brown rice flour\n1 teaspoon baking powder\n1/4 teaspoon salt\n2 teaspoons ground cinnamon\n2 tablespoons honey\n6 dates, pitted and chopped"
        },
        {
          "headline":"Preheat the oven to 350°F and grease a 9-inch loaf pan with a tablespoon of butter.",
          "description":"Peel the bananas, then mash them together in a mixing bowl. Once they're adequately mashed, add vanilla extract, oil and eggs and whisk the ingredients together."
        },
        {
          "headline":"Add baking powder, almond meal, cinnamon, salt and brown rice flour to the banana mixture, then stir together to combine.",
          "description":"After these are mixed, add chopped dates and honey to the mixture and stir those in. Almond meal has a tendency to clump, so take extra care to mash it with a fork or whisk."
        },
        {
          "headline":"Pour the mixture into the 9-inch loaf pan and bake for 45 to 50 minutes.",
          "description":"Put a toothpick into the center of the bread to see if it comes out clean upon removal. This means the banana bread is done. Even though this recipe calls for 45-50 minutes of baking, keep in mind that anything gluten-free tends to take longer to cook. If you need to put the banana bread back in the oven for a few extra minutes, this is not unusual."
        },
        {
          "headline":"Allow the bread to cool for 15 minutes before serving, then remove it from the pan.",
          "description":"Run a butter knife around the edges of the bread and then flip the pan over onto a cutting board or flat surface. This will remove the bread cleanly and in one piece."
        }
      ]
    },
    {
      "name":"Making Moist, Vegan Banana Bread",
      "steps":[
        {
          "headline":"Gather the ingredients.",
          "description":"1 1/2 cups mashed overripe bananas (about 4 medium bananas)\n2 tablespoons flax meal\n6 tablespoons water\n1/3 melted vegetable oil\nCoconut oil\n1 teaspoon vanilla extract\n1/2 cup light brown sugar\n1/2 cup applesauce\n1 cup whole-wheat flour (can substitute all-purpose flour)\n1 cup all-purpose flour\n1 teaspoon baking soda\n1/4 teaspoon salt"
        },
        {
          "headline":"While preheating the oven to 350°F, cover the bottom of a 9-inch loaf pan with coconut oil.",
          "description":"When selecting a pan to use, keep in mind that dark, metal pans are best for banana bread (rather than glass or stoneware). Dark metal pans cook things more evenly and ensure that the banana bread will be cooked all the way through. Banana bread is meant to be moist — but not gooey and undercooked in the center."
        },
        {
          "headline":"Mix the flax meal and water together in a medium sized bowl, then let the mixture sit for five minutes until it thickens.",
          "description":"The flaxseed meal is meant to replace the crucial egg ingredient in a classic banana bread recipe. Why is egg usually so important to banana bread? Because eggs contain ovalbumin — a protein that forms web-like strands when exposed to heat, thus creating a structure to hold the ingredients together and give banana bread that soft, cakey texture in your mouth. In a vegan recipe, flaxseed is a good replacement for egg because it contains hydrocolloids — substances that form a gel when combined with water. This gel creates a structure for the banana bread in the same way eggs do."
        },
        {
          "headline":"In a large bowl, whisk the flour, salt and baking soda together.",
          "description":"In another medium bowl, mash the bananas, then stir in the brown sugar, applesauce, vanilla extract and vegetable oil."
        },
        {
          "headline":"Add the oil flax/water combination to the mixture in the medium bowl.",
          "description":"Pour the wet ingredients into the dry ingredients and stir. The batter will be thick and chunky."
        },
        {
          "headline":"Pour the batter into the oiled 9-inch pan and bake for 20-25 minutes.",
          "description":"It's usually best to put the banana bread on the middle or lower oven rack for ample heat. Because whole wheat flour is being used, this banana bread tends to cook quicker than other recipes, which usually take 40-60 minutes to bake. You will know the banana bread is done when you put a toothpick through it's center and it comes out clean."
        },
        {
          "headline":"Once the banana bread is finished baking, leave it on the rack to cool for 5-10 minutes.",
          "description":"The banana bread should keep for about five days in a plastic bag."
        }
      ]
    }
  ],
  "text":" Making Moist, Classic Banana Bread Grease a 9-inch loaf pan, preheat the oven to 350°F and begin combining wet ingredients. Beat the sugar and butter with a stand mixer or handheld mixer until fluffy. Add the vanilla, eggs and bananas, then beat the mixture until smooth. Though ripe bananas will work, overripe bananas are usually best for baking. They're easier to mash and they're typically more flavorful than green or young bananas. In a medium sized mixing bowl, mix flour, salt, cinnamon and baking powder together. Make sure all the dry ingredients are thoroughly mixed and the flour has little to no clumps. Prepare the marzipan and then add it to the flour mixture. Marzipan is great for adding moisture to baked fruit dishes because it's an almond paste that melts into the mashed fruit, making it extra gooey. If you've put the marzipan into the freezer overnight, chop the marzipan up and put it in the bowl. If you've left the marzipan at room temperature, you can break it into small pieces with your hands and drop those into the mixture. To keep the marzipan pieces from sticking together, coat every piece with some flour before adding them to the mixing bowl. Mix the butter/sugar mixture with the flour mixture and stir it up until well combined. If you would like to add chocolate chips to the recipe, now would be the time. Stir them into mixture, then pour the batter into the greased pan. Put the pan into the oven and bake for about 45 to 60 minutes. You will be able to tell when the banana bread is done when the top is a golden brown. To test if it's been properly cooked on the inside, put a toothpick into the center of the loaf and pull it out. If the toothpick comes out clean (meaning free of any sticky crumbs), then it's finished. If not, put it back into the oven for a few minutes, then take it out again to check on its progress. Cool the banana bread by taking out the pan and sitting it on the stove or cooling rack for 10 minutes. Once it's cooled, slice and serve. Leftover banana bread can be stored for up to a few days in foil or plastic wrap at room temperature. Making Moist, Gluten-Free Banana Bread Gather the ingredients. 3 overripe bananas, mashed\n3 eggs\n1/4 cup grapeseed oil (or olive or coconut oil)\n1 teaspoon vanilla extract\n1 cup almond meal\n1/2 cup brown rice flour\n1 teaspoon baking powder\n1/4 teaspoon salt\n2 teaspoons ground cinnamon\n2 tablespoons honey\n6 dates, pitted and chopped Preheat the oven to 350°F and grease a 9-inch loaf pan with a tablespoon of butter. Peel the bananas, then mash them together in a mixing bowl. Once they're adequately mashed, add vanilla extract, oil and eggs and whisk the ingredients together. Add baking powder, almond meal, cinnamon, salt and brown rice flour to the banana mixture, then stir together to combine. After these are mixed, add chopped dates and honey to the mixture and stir those in. Almond meal has a tendency to clump, so take extra care to mash it with a fork or whisk. Pour the mixture into the 9-inch loaf pan and bake for 45 to 50 minutes. Put a toothpick into the center of the bread to see if it comes out clean upon removal. This means the banana bread is done. Even though this recipe calls for 45-50 minutes of baking, keep in mind that anything gluten-free tends to take longer to cook. If you need to put the banana bread back in the oven for a few extra minutes, this is not unusual. Allow the bread to cool for 15 minutes before serving, then remove it from the pan. Run a butter knife around the edges of the bread and then flip the pan over onto a cutting board or flat surface. This will remove the bread cleanly and in one piece. Making Moist, Vegan Banana Bread Gather the ingredients. 1 1/2 cups mashed overripe bananas (about 4 medium bananas)\n2 tablespoons flax meal\n6 tablespoons water\n1/3 melted vegetable oil\nCoconut oil\n1 teaspoon vanilla extract\n1/2 cup light brown sugar\n1/2 cup applesauce\n1 cup whole-wheat flour (can substitute all-purpose flour)\n1 cup all-purpose flour\n1 teaspoon baking soda\n1/4 teaspoon salt While preheating the oven to 350°F, cover the bottom of a 9-inch loaf pan with coconut oil. When selecting a pan to use, keep in mind that dark, metal pans are best for banana bread (rather than glass or stoneware). Dark metal pans cook things more evenly and ensure that the banana bread will be cooked all the way through. Banana bread is meant to be moist — but not gooey and undercooked in the center. Mix the flax meal and water together in a medium sized bowl, then let the mixture sit for five minutes until it thickens. The flaxseed meal is meant to replace the crucial egg ingredient in a classic banana bread recipe. Why is egg usually so important to banana bread? Because eggs contain ovalbumin — a protein that forms web-like strands when exposed to heat, thus creating a structure to hold the ingredients together and give banana bread that soft, cakey texture in your mouth. In a vegan recipe, flaxseed is a good replacement for egg because it contains hydrocolloids — substances that form a gel when combined with water. This gel creates a structure for the banana bread in the same way eggs do. In a large bowl, whisk the flour, salt and baking soda together. In another medium bowl, mash the bananas, then stir in the brown sugar, applesauce, vanilla extract and vegetable oil. Add the oil flax/water combination to the mixture in the medium bowl. Pour the wet ingredients into the dry ingredients and stir. The batter will be thick and chunky. Pour the batter into the oiled 9-inch pan and bake for 20-25 minutes. It's usually best to put the banana bread on the middle or lower oven rack for ample heat. Because whole wheat flour is being used, this banana bread tends to cook quicker than other recipes, which usually take 40-60 minutes to bake. You will know the banana bread is done when you put a toothpick through it's center and it comes out clean. Once the banana bread is finished baking, leave it on the rack to cool for 5-10 minutes. The banana bread should keep for about five days in a plastic bag.",
  "tyn_model":[
    "banana bread",
    "bananas",
    "oven",
    "flour",
    "marzipan",
    "salt",
    "eggs",
    "vanilla extract",
    "water",
    "9-inch loaf pan",
    "butter",
    "mixing bowl",
    "baking powder",
    "pan",
    "almond meal",
    "sugar",
    "cinnamon",
    "brown rice flour",
    "honey",
    "dates",
    "vegetable oil",
    "coconut oil",
    "applesauce",
    "all-purpose flour",
    "baking soda",
    "stand mixer",
    "handheld mixer",
    "vanilla",
    "freezer",
    "bowl",
    "chocolate chips",
    "toothpick",
    "stove",
    "grapeseed oil",
    "olive or coconut oil",
    "ground cinnamon",
    "oil",
    "banana",
    "fork or whisk",
    "butter knife",
    "cutting board",
    "flax meal",
    "light brown sugar",
    "whole-wheat flour",
    "loaf pan",
    "— but",
    "flaxseed meal",
    "egg",
    "— a",
    "flaxseed",
    "— substances",
    "large bowl",
    "brown sugar",
    "oil flax",
    "medium bowl",
    "9-inch pan",
    "oven rack",
    "whole wheat flour",
    "plastic bag"
  ],
  "tyn_section":[

  ]
}