{
  "title":"How to Make Colored Rice for Sensory Play",
  "url":"https://www.wikihow.com/Make-Colored-Rice-for-Sensory-Play",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Toys",
    "Special Needs Toys"
  ],
  "parts":[
    {
      "name":"Using Vinegar to Make Colored Rice",
      "steps":[
        {
          "headline":"Gather your supplies.",
          "description":"You will need a pack of white rice - ideally you would use one that is almost or at its expiration date, but otherwise you can just purchase the cheapest pack of rice you can find. You will need one cup of rice per color of your choice. You will also need\nWhite vinegar – ½ a teaspoon per color. So if you're making five colors then that’s 2.5 tablespoons of vinegar. Variety of food colors – red, green, blue, yellow and orange\nEssential oils (lavender, eucalyptus or tea tree oil) to neutralize the scent of vinegar. Reusable plastic containers – empty ice cream tubs or empty cookie containers with lids from the grocery store will do. An empty, flat space in your house where you can spread the rice out for drying. You can use shallow cardboard boxes, shoe boxes or empty baking trays."
        },
        {
          "headline":"Pour a cup of rice into a container with lid.",
          "description":"Put a couple of drops of food coloring in a small bowl then add ½ a teaspoon of vinegar. Add the food coloring and vinegar to the rice, then add a couple of drops of the essential oil of your choice. Alternatively, you could color the rice using Colorations Liquid Watercolors. Add these liquid watercolors directly to the rice and shake it well. You don't need to leave the rice to dry when using this product."
        },
        {
          "headline":"Put the lid on the container and shake vigorously.",
          "description":"Then remove the lid and pour the rice onto an empty baking tray and leave in the open to dry for a day. Proceed to coloring your next batch of rice."
        }
      ]
    },
    {
      "name":"Using Rubbing Alcohol to Make Colored Rice",
      "steps":[
        {
          "headline":"Gather your supplies.",
          "description":"You will need a pack of white rice - ideally you would use one that is almost or at its expiration date, but otherwise you can just purchase the cheapest one you can find. You will need one cup of rice per color. Rubbing alcohol or hand sanitizer – ½ a teaspoon for every cup of rice. So if you want to make five colors then that’s 2.5 tablespoons of rubbing alcohol or hand sanitizer. Variety of food colors – red, green, blue, yellow and orange\nReusable plastic containers –  empty ice cream tubs or empty cookie containers with lids from the grocery store will do. An empty, flat space in your house where you can spread the rice out for drying. You can use shallow cardboard boxes, shoe boxes or empty baking trays."
        },
        {
          "headline":"Pour a cup of rice into a container with lid.",
          "description":"Put a couple of drops of food coloring in a small bowl then add ½ a teaspoon of rubbing alcohol. Pour the contents of the bowl onto the rice in the container. Since you’re using rubbing alcohol, there’s no need to use any essential oils. Some parents shy away from using rubbing alcohol because kids may accidentally place the rice in their mouth. Rubbing alcohol and hand sanitizers technically make the rice inedible as opposed to using vinegar."
        },
        {
          "headline":"Put the lid back on and shake vigorously.",
          "description":"Then remove the lid and pour the rice onto an empty baking tray and leave in the open to dry for a day. Proceed to coloring your next batch of rice."
        },
        {
          "headline":"Know that there is a time limit for rice mixed with rubbing alcohol.",
          "description":"Colored rice that's been made with rubbing alcohol usually lasts for 6 to 7 months, provided it's been stored in a sealed container without moisture seeping in. Colored rice made with vinegar usually lasts up to 4 months."
        }
      ]
    },
    {
      "name":"Playing with the Rice",
      "steps":[
        {
          "headline":"Create colorful shakers out of the rice.",
          "description":"You can scoop a handful of each of the different colors of rice into separate clear plastic bottles with screw caps on. Kids can then shake these bottles to stimulate their hearing as well as coordination of their hands and arm muscles."
        },
        {
          "headline":"Stimulate your child’s senses by mixing the rice with other toys.",
          "description":"You can pour a few scoops of each color of rice into a box or bin and add different kinds of materials, from miniature toys, to felt shapes, to colored balls and fabric pompoms that you can find at most craft stores. The idea is to bombard your child’s sense of sight and touch with colors, shapes and textures, with the colored rice serving as a backdrop."
        },
        {
          "headline":"Have your child play with a shovel and the rice.",
          "description":"Place each color of rice in a separate container and give your child a shovel or a small scoop and her own container. Ask her to pour the colored rice from the main containers into her own, where she can mix the colors as she likes"
        },
        {
          "headline":"Use labels to teach your child about colors.",
          "description":"Place the different colored rice in small ziplock bags and label each bag with their corresponding color. This will teach the child about colors and at the same time, stimulate her sense of touch."
        },
        {
          "headline":"Use the rice for an arts and crafts project.",
          "description":"For older kids, use the colored sensory rice as the backdrop for a little craft project. You can pour the colored rice into a shoebox and add some miniature things to make it look like a small beach or a small underwater “aquarium” with miniature plastic fish and corals."
        }
      ]
    },
    {
      "name":"Storing the Rice",
      "steps":[
        {
          "headline":"Consider what kind of container you would like to use.",
          "description":"Listed below are some tried and tested containers for storing the colored rice:\nA shallow container with lid\nCardboard box\nLarge plastic salad bowl\nFoil roasting pan"
        },
        {
          "headline":"Look for a lid.",
          "description":"Storing rice in a container with a lid is preferable and recommended as it will prevent moisture in the air from spoiling the texture and color of the rice. By using the lid you can store the colored rice for a longer time as compared to storing without a lid."
        },
        {
          "headline":"Be aware that the color of the rice might fade over time.",
          "description":"You don’t have to worry about coloring the rice over and over again, as colored rice will stay for as long as you need it. The color might fade a bit over time but it won't disappear completely."
        }
      ]
    }
  ],
  "text":" Using Vinegar to Make Colored Rice Gather your supplies. You will need a pack of white rice - ideally you would use one that is almost or at its expiration date, but otherwise you can just purchase the cheapest pack of rice you can find. You will need one cup of rice per color of your choice. You will also need\nWhite vinegar – ½ a teaspoon per color. So if you're making five colors then that’s 2.5 tablespoons of vinegar. Variety of food colors – red, green, blue, yellow and orange\nEssential oils (lavender, eucalyptus or tea tree oil) to neutralize the scent of vinegar. Reusable plastic containers – empty ice cream tubs or empty cookie containers with lids from the grocery store will do. An empty, flat space in your house where you can spread the rice out for drying. You can use shallow cardboard boxes, shoe boxes or empty baking trays. Pour a cup of rice into a container with lid. Put a couple of drops of food coloring in a small bowl then add ½ a teaspoon of vinegar. Add the food coloring and vinegar to the rice, then add a couple of drops of the essential oil of your choice. Alternatively, you could color the rice using Colorations Liquid Watercolors. Add these liquid watercolors directly to the rice and shake it well. You don't need to leave the rice to dry when using this product. Put the lid on the container and shake vigorously. Then remove the lid and pour the rice onto an empty baking tray and leave in the open to dry for a day. Proceed to coloring your next batch of rice. Using Rubbing Alcohol to Make Colored Rice Gather your supplies. You will need a pack of white rice - ideally you would use one that is almost or at its expiration date, but otherwise you can just purchase the cheapest one you can find. You will need one cup of rice per color. Rubbing alcohol or hand sanitizer – ½ a teaspoon for every cup of rice. So if you want to make five colors then that’s 2.5 tablespoons of rubbing alcohol or hand sanitizer. Variety of food colors – red, green, blue, yellow and orange\nReusable plastic containers –  empty ice cream tubs or empty cookie containers with lids from the grocery store will do. An empty, flat space in your house where you can spread the rice out for drying. You can use shallow cardboard boxes, shoe boxes or empty baking trays. Pour a cup of rice into a container with lid. Put a couple of drops of food coloring in a small bowl then add ½ a teaspoon of rubbing alcohol. Pour the contents of the bowl onto the rice in the container. Since you’re using rubbing alcohol, there’s no need to use any essential oils. Some parents shy away from using rubbing alcohol because kids may accidentally place the rice in their mouth. Rubbing alcohol and hand sanitizers technically make the rice inedible as opposed to using vinegar. Put the lid back on and shake vigorously. Then remove the lid and pour the rice onto an empty baking tray and leave in the open to dry for a day. Proceed to coloring your next batch of rice. Know that there is a time limit for rice mixed with rubbing alcohol. Colored rice that's been made with rubbing alcohol usually lasts for 6 to 7 months, provided it's been stored in a sealed container without moisture seeping in. Colored rice made with vinegar usually lasts up to 4 months. Playing with the Rice Create colorful shakers out of the rice. You can scoop a handful of each of the different colors of rice into separate clear plastic bottles with screw caps on. Kids can then shake these bottles to stimulate their hearing as well as coordination of their hands and arm muscles. Stimulate your child’s senses by mixing the rice with other toys. You can pour a few scoops of each color of rice into a box or bin and add different kinds of materials, from miniature toys, to felt shapes, to colored balls and fabric pompoms that you can find at most craft stores. The idea is to bombard your child’s sense of sight and touch with colors, shapes and textures, with the colored rice serving as a backdrop. Have your child play with a shovel and the rice. Place each color of rice in a separate container and give your child a shovel or a small scoop and her own container. Ask her to pour the colored rice from the main containers into her own, where she can mix the colors as she likes Use labels to teach your child about colors. Place the different colored rice in small ziplock bags and label each bag with their corresponding color. This will teach the child about colors and at the same time, stimulate her sense of touch. Use the rice for an arts and crafts project. For older kids, use the colored sensory rice as the backdrop for a little craft project. You can pour the colored rice into a shoebox and add some miniature things to make it look like a small beach or a small underwater “aquarium” with miniature plastic fish and corals. Storing the Rice Consider what kind of container you would like to use. Listed below are some tried and tested containers for storing the colored rice:\nA shallow container with lid\nCardboard box\nLarge plastic salad bowl\nFoil roasting pan Look for a lid. Storing rice in a container with a lid is preferable and recommended as it will prevent moisture in the air from spoiling the texture and color of the rice. By using the lid you can store the colored rice for a longer time as compared to storing without a lid. Be aware that the color of the rice might fade over time. You don’t have to worry about coloring the rice over and over again, as colored rice will stay for as long as you need it. The color might fade a bit over time but it won't disappear completely.",
  "tyn_model":[
    "rice",
    "rubbing alcohol",
    "vinegar",
    "container",
    "food coloring",
    "white rice",
    "– ½",
    "– red",
    "ice cream tubs",
    "small bowl",
    "baking tray",
    "hand sanitizer",
    "shovel",
    "tea tree oil",
    "– empty",
    "baking trays",
    "essential oil",
    "colorations liquid watercolors",
    "liquid watercolors",
    "–  ",
    "bowl",
    "essential oils",
    "hand sanitizers",
    "clear plastic bottles",
    "shoebox",
    "“aquarium",
    "” with",
    "containers",
    "salad bowl",
    "foil roasting pan",
    "colored rice"
  ],
  "tyn_section":[

  ]
}