{
  "title":"How to Make Apricot Surprise Cupcakes",
  "url":"https://www.wikihow.com/Make-Apricot-Surprise-Cupcakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Cupcakes"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 160ºC/325ºF (fan bake), about 10-20ºC higher for conventional.",
      "description":""
    },
    {
      "headline":"Line the muffin pan with paper cupcake cases.",
      "description":""
    },
    {
      "headline":"Mix the butter, sugar and vanilla in a bowl.",
      "description":"Beat well using an electric mixer or a wooden spoon. It is ready when it turns pale and creamy."
    },
    {
      "headline":"Add the eggs one at a time and fold in the sifted dried ingredients.",
      "description":"Add the milk gradually to liquefy. The batter is ready when it is creamy."
    },
    {
      "headline":"Fill each cupcake case three quarters of the way with the batter.",
      "description":"Drop a teaspoonful of apricot jam into each cupcake and finish of with the last quarter of batter for each cupcake."
    },
    {
      "headline":"Place in the oven.",
      "description":"Bake for 20-25 minutes. The cake is ready when a toothpick inserted into comes out clean but avoid the jammy centre."
    },
    {
      "headline":"Remove from the oven.",
      "description":"Place on a wire cooling rack. Ice if wished."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Preheat the oven to 160ºC/325ºF (fan bake), about 10-20ºC higher for conventional.  Line the muffin pan with paper cupcake cases.  Mix the butter, sugar and vanilla in a bowl. Beat well using an electric mixer or a wooden spoon. It is ready when it turns pale and creamy. Add the eggs one at a time and fold in the sifted dried ingredients. Add the milk gradually to liquefy. The batter is ready when it is creamy. Fill each cupcake case three quarters of the way with the batter. Drop a teaspoonful of apricot jam into each cupcake and finish of with the last quarter of batter for each cupcake. Place in the oven. Bake for 20-25 minutes. The cake is ready when a toothpick inserted into comes out clean but avoid the jammy centre. Remove from the oven. Place on a wire cooling rack. Ice if wished. Finished. ",
  "tyn_model":[
    "oven",
    "muffin pan",
    "cupcake cases",
    "butter",
    "sugar",
    "vanilla",
    "bowl",
    "electric mixer",
    "wooden spoon",
    "eggs",
    "milk",
    "cupcake case",
    "apricot jam",
    "ice"
  ],
  "tyn_section":[

  ]
}