{
  "title":"How to Make Indian Falooda",
  "url":"https://www.wikihow.com/Make-Indian-Falooda",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Indian Desserts"
  ],
  "methods":[
    {
      "name":"Making Falooda",
      "steps":[
        {
          "headline":"Get hard-to-find ingredients at an Indian grocery store.",
          "description":"Milk, sugar, and ice cream should be available at almost any supermarket, but basil seeds, rose syrup, and falooda sev will not usually be. For these, you'll need to visit an Indian or South Asian grocer. You may be able to find them at certain non-Indian specialty grocers' as well. Most of these ingredients are also available for order online if you do not have a place to buy them near you. Falooda sev is a type of Indian noodle somewhat similar to vermicelli. You can buy dry falooda or make it yourself from scratch. A good falooda sev recipe is available here."
        },
        {
          "headline":"Soak the basil seeds.",
          "description":"In a cup, cover the basil seeds with an inch of water. Stir once, then let them soak for 30 minutes. After soaking, drain them in a fine mesh strainer and set aside. While you wait for the seeds to soak, feel free to proceed to the next few steps."
        },
        {
          "headline":"Heat milk and sugar.",
          "description":"Pour the two ingredients into a medium saucepan and bring to a gentle boil, stirring occasionally. Lower the heat and let simmer for 5-7 minutes. Pour the thickened milk into separate container and let it chill in the fridge."
        },
        {
          "headline":"Make the falooda sev.",
          "description":"Follow the instructions on the packaging for best results. If you made your own falooda sev or your packaging doesn't have instructions, follow these steps:\nBring water to a boil in a small pot. Add falooda sev and cook for about 4-5 minutes. Drain the falooda in a strainer, rinsing it with cold water to stop the cooking process. Use a knife or pair of scissors to cut the noodles into small pieces."
        },
        {
          "headline":"Layer the falooda ingredients in a glass.",
          "description":"Grab two tall, decorative glasses to serve your beverages in. Add ingredients to each glass in the following order (use half of each ingredient per glass):\nBasil seeds\nCooked falooda sev\nRose syrup\nMilk — it's OK if basil seeds or falooda sev float to the top at this point."
        },
        {
          "headline":"Top each glass with a generous scoop of vanilla ice-cream.",
          "description":"If you want, you can mash the ice cream into the drink to dissolve it, but you don't need to. If you leave the ice cream alone, dunk it into the milk at least once to give it some of the rose flavor."
        },
        {
          "headline":"Garnish before serving, if desired.",
          "description":"The falooda is ready to drink at this point. If you wish, you can add a handful of chopped pistachios and rose petals to the top of the drink as a garnish, though this is not needed. Serve the falooda immediately. It does not keep if allowed to sit or stored in the refrigerator. Enjoy!"
        }
      ]
    },
    {
      "name":"Trying Different Serving Suggestions",
      "steps":[
        {
          "headline":"Use different flavors of ice cream.",
          "description":"With its smooth, creamy flavor, vanilla ice cream goes especially well with the rose syrup in falooda, but it's not the only choice available. Other sweet, mild ice cream flavors like strawberry, raspberry, and pistachio make for interesting choices as well. Some may even enjoy the taste of chocolate ice cream. Avoid ice creams with \"sharp\" flavors (like citrus), which can overpower the rose in the drink."
        },
        {
          "headline":"Top with nuts and dried fruits.",
          "description":"Pistachios and rose petals aren't the only ingredients you can use as garnish. Most nuts and dried fruits taste well on top of a delicious falooda drink. For instance, golden raisins and chopped almonds make a good choice. Craisins and dried berries can also work well."
        },
        {
          "headline":"Try fruit as a topping.",
          "description":"The nice thing about falooda is that all you need to do to put a new spin on it is drop a slice or two of your favorite fruit into the drink before you add the ice cream. Mango, strawberries, and other sweet fruits make the best choices. Tart fruits like citrus don't always pair well with the creaminess of the other ingredients, however."
        },
        {
          "headline":"Make a falooda-flavored smoothie if you're on the go.",
          "description":"If you love falooda but don't have time to layer the ingredients, simply toss them in the blender and pulse a few times to get a smoothie. Pour the smoothie into a bottle and you now have a portable falooda drink. You can even add ice cubes to the blender to give the smoothie a slushier texture without affecting the taste. The smoothie may separate somewhat if you keep it in the refrigerator, but it will not be unsafe to drink."
        }
      ]
    }
  ],
  "text":" Making Falooda Get hard-to-find ingredients at an Indian grocery store. Milk, sugar, and ice cream should be available at almost any supermarket, but basil seeds, rose syrup, and falooda sev will not usually be. For these, you'll need to visit an Indian or South Asian grocer. You may be able to find them at certain non-Indian specialty grocers' as well. Most of these ingredients are also available for order online if you do not have a place to buy them near you. Falooda sev is a type of Indian noodle somewhat similar to vermicelli. You can buy dry falooda or make it yourself from scratch. A good falooda sev recipe is available here. Soak the basil seeds. In a cup, cover the basil seeds with an inch of water. Stir once, then let them soak for 30 minutes. After soaking, drain them in a fine mesh strainer and set aside. While you wait for the seeds to soak, feel free to proceed to the next few steps. Heat milk and sugar. Pour the two ingredients into a medium saucepan and bring to a gentle boil, stirring occasionally. Lower the heat and let simmer for 5-7 minutes. Pour the thickened milk into separate container and let it chill in the fridge. Make the falooda sev. Follow the instructions on the packaging for best results. If you made your own falooda sev or your packaging doesn't have instructions, follow these steps:\nBring water to a boil in a small pot. Add falooda sev and cook for about 4-5 minutes. Drain the falooda in a strainer, rinsing it with cold water to stop the cooking process. Use a knife or pair of scissors to cut the noodles into small pieces. Layer the falooda ingredients in a glass. Grab two tall, decorative glasses to serve your beverages in. Add ingredients to each glass in the following order (use half of each ingredient per glass):\nBasil seeds\nCooked falooda sev\nRose syrup\nMilk — it's OK if basil seeds or falooda sev float to the top at this point. Top each glass with a generous scoop of vanilla ice-cream. If you want, you can mash the ice cream into the drink to dissolve it, but you don't need to. If you leave the ice cream alone, dunk it into the milk at least once to give it some of the rose flavor. Garnish before serving, if desired. The falooda is ready to drink at this point. If you wish, you can add a handful of chopped pistachios and rose petals to the top of the drink as a garnish, though this is not needed. Serve the falooda immediately. It does not keep if allowed to sit or stored in the refrigerator. Enjoy! Trying Different Serving Suggestions Use different flavors of ice cream. With its smooth, creamy flavor, vanilla ice cream goes especially well with the rose syrup in falooda, but it's not the only choice available. Other sweet, mild ice cream flavors like strawberry, raspberry, and pistachio make for interesting choices as well. Some may even enjoy the taste of chocolate ice cream. Avoid ice creams with \"sharp\" flavors (like citrus), which can overpower the rose in the drink. Top with nuts and dried fruits. Pistachios and rose petals aren't the only ingredients you can use as garnish. Most nuts and dried fruits taste well on top of a delicious falooda drink. For instance, golden raisins and chopped almonds make a good choice. Craisins and dried berries can also work well. Try fruit as a topping. The nice thing about falooda is that all you need to do to put a new spin on it is drop a slice or two of your favorite fruit into the drink before you add the ice cream. Mango, strawberries, and other sweet fruits make the best choices. Tart fruits like citrus don't always pair well with the creaminess of the other ingredients, however. Make a falooda-flavored smoothie if you're on the go. If you love falooda but don't have time to layer the ingredients, simply toss them in the blender and pulse a few times to get a smoothie. Pour the smoothie into a bottle and you now have a portable falooda drink. You can even add ice cubes to the blender to give the smoothie a slushier texture without affecting the taste. The smoothie may separate somewhat if you keep it in the refrigerator, but it will not be unsafe to drink.",
  "tyn_model":[
    "ice cream",
    "milk",
    "rose syrup",
    "water",
    "sugar",
    "basil",
    "falooda sev",
    "pistachios",
    "rose petals",
    "nuts",
    "blender",
    "fine mesh strainer",
    "medium saucepan",
    "small pot",
    "strainer",
    "knife",
    "glass",
    "basil seeds",
    "— it",
    "vanilla ice-cream",
    "vanilla ice cream",
    "pistachio",
    "chocolate ice cream",
    "ice creams",
    "citrus",
    "raisins",
    "almonds",
    "craisins",
    "berries",
    "strawberries",
    "ice cubes"
  ],
  "tyn_section":[

  ]
}