{
  "title":"How to Install Minecraft Maps on an Xbox 360",
  "url":"https://www.wikihow.com/Install-Minecraft-Maps-on-an-Xbox-360",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games",
    "Minecraft",
    "Minecraft for Consoles"
  ],
  "steps":[
    {
      "headline":"Acquire a thumb drive that has at least 2GB free storage space, and preferably nothing already on it.",
      "description":"Insert it into any available USB port on your Xbox 360, and head to System Settings > Storage."
    },
    {
      "headline":"Look for options.",
      "description":"Several should be displayed. Select the option USB Storage Drive and then select Customize."
    },
    {
      "headline":"Determine the amount of space on the thumb drive you wish to use by sliding left and right with the Left Thumbstick.",
      "description":"You'll want to select most of the storage capacity available if you're downloading multiple maps at once."
    },
    {
      "headline":"Press A to configure the thumb drive to work with your Xbox 360.",
      "description":"This may take a few moments, depending on the amount of space you have allocated. You will then receive a message showing if the process was successful or not. If it was, proceed to the next step; if not, go back to the beginning and make sure the drive has enough capacity and is compatible."
    },
    {
      "headline":"Select the main storage drive for your Xbox 360 (hard drive) and go to Gamer Profiles.",
      "description":"Select your active profile and click Copy. This will now show the different drives available. Select your USB pen drive, and wait until the transfer is complete. Don't worry, you're not modifying profile content, but you will need some information from it later."
    },
    {
      "headline":"Type in the following URL into the address bar of your computer.",
      "description":"Download the program Horizon by following the appropriate links: https://www.horizonmb.com/. Be aware that your anti-virus software may display a warning saying the new software downloaded may be dangerous. Due to the nature of the program, Horizon will often do this, especially for AVG and McAfee. Click to ignore this, and follow the installation instructions by double-clicking on the downloaded .exe file."
    },
    {
      "headline":"Plug your newly configured thumb drive into an available USB port on your computer.",
      "description":"Open Horizon, if it isn't already open."
    },
    {
      "headline":"Head over to any website that allows free downloading of Xbox 360 Minecraft maps.",
      "description":"For example: Planet Minecraft, MCDN360, XPGamesaves and Minecraft Forum."
    },
    {
      "headline":"Find a map you like.",
      "description":"Download it, and locate it on your desktop. It will likely be zipped up in a ZIP folder, so extract it using a tool such as WinRAR or WinZip. The extracted file should be a .bin file, and be called whatever the name of the map is. Click and drag this into the large, gray pane of the Horizon program, and a window will appear showing information such as 'Profile ID', 'Display Name', and other pieces of information. To the right of the gray pane there should be a pane that says \"Device Explorer\": click on the two little arrows at the top, and it should show the USB pen drive. Double-click the USB pen drive option, and then double-click your profile that should appear."
    },
    {
      "headline":"Choose Profile ID.",
      "description":"In the large, gray pane a new window should appear with familiar information relating to your profile. You only need to concentrate on 'Profile ID', 'Device ID', and 'Console ID'. On your profile window, highlight the text in the box next to 'Profile ID' and copy it. Then paste this into the Profile ID text box of the Minecraft map window."
    },
    {
      "headline":"Repeat the prior step for Device ID and Console ID.",
      "description":"Then click Save, Rehash, and Resign at the top of the window (orange button)."
    },
    {
      "headline":"Right at the top-right of the Minecraft map window should be a 'Save to Device' option.",
      "description":"Click on this and a dropdown menu will appear; click on the thumb drive that you have configured, and you will transfer the map to the drive. You may be asked to save it again, so click \"Okay\"."
    },
    {
      "headline":"Safely remove the thumb drive from the computer and reinsert it into an available USB port on your Xbox 360.",
      "description":"Head back to System Settings > Storage > USB Storage Device."
    },
    {
      "headline":"Look for the new file present here showing an icon from Minecraft, as well as a thumbnail image of the map.",
      "description":"Select this, and then select Move. Once again you will be shown a list of available devices; select Hard Drive and the map will be transferred."
    },
    {
      "headline":"Load up Minecraft and look for the file carrying the name of the download, and load it up.",
      "description":"It is likely to be near the bottom of the map list. You will continue from where the original owner left off as if it was your own world."
    }
  ],
  "text":" Acquire a thumb drive that has at least 2GB free storage space, and preferably nothing already on it. Insert it into any available USB port on your Xbox 360, and head to System Settings > Storage. Look for options. Several should be displayed. Select the option USB Storage Drive and then select Customize. Determine the amount of space on the thumb drive you wish to use by sliding left and right with the Left Thumbstick. You'll want to select most of the storage capacity available if you're downloading multiple maps at once. Press A to configure the thumb drive to work with your Xbox 360. This may take a few moments, depending on the amount of space you have allocated. You will then receive a message showing if the process was successful or not. If it was, proceed to the next step; if not, go back to the beginning and make sure the drive has enough capacity and is compatible. Select the main storage drive for your Xbox 360 (hard drive) and go to Gamer Profiles. Select your active profile and click Copy. This will now show the different drives available. Select your USB pen drive, and wait until the transfer is complete. Don't worry, you're not modifying profile content, but you will need some information from it later. Type in the following URL into the address bar of your computer. Download the program Horizon by following the appropriate links: https://www.horizonmb.com/. Be aware that your anti-virus software may display a warning saying the new software downloaded may be dangerous. Due to the nature of the program, Horizon will often do this, especially for AVG and McAfee. Click to ignore this, and follow the installation instructions by double-clicking on the downloaded .exe file. Plug your newly configured thumb drive into an available USB port on your computer. Open Horizon, if it isn't already open. Head over to any website that allows free downloading of Xbox 360 Minecraft maps. For example: Planet Minecraft, MCDN360, XPGamesaves and Minecraft Forum. Find a map you like. Download it, and locate it on your desktop. It will likely be zipped up in a ZIP folder, so extract it using a tool such as WinRAR or WinZip. The extracted file should be a .bin file, and be called whatever the name of the map is. Click and drag this into the large, gray pane of the Horizon program, and a window will appear showing information such as 'Profile ID', 'Display Name', and other pieces of information. To the right of the gray pane there should be a pane that says \"Device Explorer\": click on the two little arrows at the top, and it should show the USB pen drive. Double-click the USB pen drive option, and then double-click your profile that should appear. Choose Profile ID. In the large, gray pane a new window should appear with familiar information relating to your profile. You only need to concentrate on 'Profile ID', 'Device ID', and 'Console ID'. On your profile window, highlight the text in the box next to 'Profile ID' and copy it. Then paste this into the Profile ID text box of the Minecraft map window. Repeat the prior step for Device ID and Console ID. Then click Save, Rehash, and Resign at the top of the window (orange button). Right at the top-right of the Minecraft map window should be a 'Save to Device' option. Click on this and a dropdown menu will appear; click on the thumb drive that you have configured, and you will transfer the map to the drive. You may be asked to save it again, so click \"Okay\". Safely remove the thumb drive from the computer and reinsert it into an available USB port on your Xbox 360. Head back to System Settings > Storage > USB Storage Device. Look for the new file present here showing an icon from Minecraft, as well as a thumbnail image of the map. Select this, and then select Move. Once again you will be shown a list of available devices; select Hard Drive and the map will be transferred. Load up Minecraft and look for the file carrying the name of the download, and load it up. It is likely to be near the bottom of the map list. You will continue from where the original owner left off as if it was your own world.",
  "tyn_model":[
    "thumb drive",
    "xbox 360",
    "usb pen drive",
    "horizon",
    "minecraft",
    "usb storage drive",
    "anti-virus",
    "xbox 360 minecraft maps",
    "minecraft forum",
    "computer",
    "usb storage device"
  ],
  "tyn_section":[

  ]
}