{
  "title":"How to Make Panko Fried Shrimp",
  "url":"https://www.wikihow.com/Make-Panko-Fried-Shrimp",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Prawns and Shrimp"
  ],
  "steps":[
    {
      "headline":"Defrost shrimp if it is frozen.",
      "description":"Soak it in hot or warm water so it could defrost faster."
    },
    {
      "headline":"Take out shrimp shells and throw them in the garbage.",
      "description":""
    },
    {
      "headline":"Season shrimp with salt and pepper, making sure all sides are seasoned well.",
      "description":""
    },
    {
      "headline":"Heat oil in skillet to 350 °F (177 °C).",
      "description":""
    },
    {
      "headline":"Add Panko crumbs to a large plastic food storage bag.",
      "description":"Shake well."
    },
    {
      "headline":"Butterfly shrimp by cutting vertically down the back of the shrimp.",
      "description":""
    },
    {
      "headline":"Beat the eggs and water together until yolks are broken.",
      "description":""
    },
    {
      "headline":"Dip the shrimp in the egg-water mixture.",
      "description":""
    },
    {
      "headline":"Add the shrimp to the Panko crumbs.",
      "description":""
    },
    {
      "headline":"Toss to coat.",
      "description":""
    },
    {
      "headline":"Remove shrimp from bag and dip again in egg-water mixture.",
      "description":""
    },
    {
      "headline":"Return to Panko crumbs in bag.",
      "description":""
    },
    {
      "headline":"Toss again.",
      "description":""
    },
    {
      "headline":"Fry in hot oil at 350 °F (177 °C) until golden, about 3 minutes.",
      "description":"You may have to turn the shrimp to evenly brown them."
    },
    {
      "headline":"Drain the fried shrimp on paper towels.",
      "description":""
    },
    {
      "headline":"Keep shrimp warm while frying batches of shrimp.",
      "description":""
    },
    {
      "headline":"Serve with lemon wedges, cocktail sauce or tartar sauce.",
      "description":""
    }
  ],
  "text":" Defrost shrimp if it is frozen. Soak it in hot or warm water so it could defrost faster. Take out shrimp shells and throw them in the garbage.  Season shrimp with salt and pepper, making sure all sides are seasoned well.  Heat oil in skillet to 350 °F (177 °C).  Add Panko crumbs to a large plastic food storage bag. Shake well. Butterfly shrimp by cutting vertically down the back of the shrimp.  Beat the eggs and water together until yolks are broken.  Dip the shrimp in the egg-water mixture.  Add the shrimp to the Panko crumbs.  Toss to coat.  Remove shrimp from bag and dip again in egg-water mixture.  Return to Panko crumbs in bag.  Toss again.  Fry in hot oil at 350 °F (177 °C) until golden, about 3 minutes. You may have to turn the shrimp to evenly brown them. Drain the fried shrimp on paper towels.  Keep shrimp warm while frying batches of shrimp.  Serve with lemon wedges, cocktail sauce or tartar sauce. ",
  "tyn_model":[
    "shrimp",
    "panko crumbs",
    "egg-water",
    "shrimp shells",
    "salt and pepper",
    "oil",
    "skillet",
    "large plastic food storage bag",
    "eggs",
    "water",
    "hot oil",
    "paper towels",
    "lemon wedges",
    "cocktail sauce",
    "tartar sauce"
  ],
  "tyn_section":[

  ]
}