{
  "title":"How to Make Chicken Sukka",
  "url":"https://www.wikihow.com/Make-Chicken-Sukka",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Indian Chicken Dishes"
  ],
  "parts":[
    {
      "name":"Preparing the Spices and Seeds",
      "steps":[
        {
          "headline":"Add chilies, cumin seeds, coriander seeds, fenugreek seeds, turmeric stick, and sesame seeds in a kadai (high-sided frying pan).",
          "description":"Fry them with a little bit of coconut oil."
        },
        {
          "headline":"Grind the fried spices and seeds into a coarse powder without adding water.",
          "description":"Use a blender/processor with a fine grinding setting, spice grinder or a mortar and pestle."
        },
        {
          "headline":"Add the tamarind ball and ginger.",
          "description":"Blend or grind into a fine powder."
        }
      ]
    },
    {
      "name":"Making the Fried Grated Coconut Mixture",
      "steps":[
        {
          "headline":"Going back to the kadai or frying pan, add a teaspoon of coconut oil.",
          "description":""
        },
        {
          "headline":"Add some cumin seeds, 2 to 3 cloves of garlic, bay leaves, 2 finely chopped onions, and add the grated coconut.",
          "description":""
        },
        {
          "headline":"Fry these ingredients until the onions turn golden brown, then keep the fried grated coconut mixture aside.",
          "description":""
        }
      ]
    },
    {
      "name":"Cooking the Chicken",
      "steps":[
        {
          "headline":"Drop 1 tablespoon of coconut oil into the pressure cooker.",
          "description":""
        },
        {
          "headline":"Add cinnamon stick, cloves, 2 finely chopped onions, medium sized chicken cubes, the spice powder which has already been prepared, and salt to taste.",
          "description":""
        },
        {
          "headline":"Mix the ingredients gently and add the fried grated coconut mixture.",
          "description":""
        },
        {
          "headline":"Close the lid and leave it to cook until a whistle blows (see How to use a pressure cooker for more details.",
          "description":""
        },
        {
          "headline":"Garnish it with coriander leaves and mix it well.",
          "description":""
        },
        {
          "headline":"Plate up.",
          "description":"The delicious chicken sukka is ready to serve. Add rice for completeness."
        }
      ]
    }
  ],
  "text":" Preparing the Spices and Seeds Add chilies, cumin seeds, coriander seeds, fenugreek seeds, turmeric stick, and sesame seeds in a kadai (high-sided frying pan). Fry them with a little bit of coconut oil. Grind the fried spices and seeds into a coarse powder without adding water. Use a blender/processor with a fine grinding setting, spice grinder or a mortar and pestle. Add the tamarind ball and ginger. Blend or grind into a fine powder. Making the Fried Grated Coconut Mixture Going back to the kadai or frying pan, add a teaspoon of coconut oil.  Add some cumin seeds, 2 to 3 cloves of garlic, bay leaves, 2 finely chopped onions, and add the grated coconut.  Fry these ingredients until the onions turn golden brown, then keep the fried grated coconut mixture aside.  Cooking the Chicken Drop 1 tablespoon of coconut oil into the pressure cooker.  Add cinnamon stick, cloves, 2 finely chopped onions, medium sized chicken cubes, the spice powder which has already been prepared, and salt to taste.  Mix the ingredients gently and add the fried grated coconut mixture.  Close the lid and leave it to cook until a whistle blows (see How to use a pressure cooker for more details.  Garnish it with coriander leaves and mix it well.  Plate up. The delicious chicken sukka is ready to serve. Add rice for completeness.",
  "tyn_model":[
    "coconut oil",
    "coconut",
    "cumin",
    "coriander",
    "onions",
    "pressure cooker",
    "chilies",
    "fenugreek seeds",
    "turmeric stick",
    "sesame seeds",
    "high-sided frying pan",
    "spices",
    "water",
    "blender",
    "spice grinder",
    "mortar",
    "ginger",
    "frying pan",
    "garlic",
    "bay leaves",
    "cinnamon stick",
    "spice powder",
    "salt",
    "chicken sukka",
    "rice"
  ],
  "tyn_section":[

  ]
}