{
  "title":"How to Move to California",
  "url":"https://www.wikihow.com/Move-to-California",
  "category_hierarchy":[
    "Home and Garden",
    "Moving and Removals",
    "Planning to Move"
  ],
  "parts":[
    {
      "name":"Choosing an Area to Live",
      "steps":[
        {
          "headline":"Move to Los Angeles for warm weather and the entertainment industry.",
          "description":"Los Angeles is a hub for many industries, from entertainment to tech. It’s the biggest city in California, which is great if you’re looking for an area with great weather, lots of people, and tons of things to do. California is notorious for its high cost of living. In Los Angeles, the average rent is $2,265 and the median home price is $799,000."
        },
        {
          "headline":"Choose the San Diego area for a more laid-back attitude.",
          "description":"San Diego is known for its warm weather, great beaches, and relaxed atmosphere. Although not as high-energy or as central to industry as LA, San Diego is consistently ranked as one of the happiest cities in the country. The average rent in San Diego is about $1,887, while the median home cost is $629,000."
        },
        {
          "headline":"Consider the Bay Area for tech industry jobs and a high-energy atmosphere.",
          "description":"California’s Bay Area, which includes cities like San Francisco, San Jose, and Oakland, is famous for being a hotbed of tech companies. It’s the perfect place to live if you’re looking for a job and want to experience a unique, beautiful area, but it’s also the most expensive place to live in the country. Make sure to do your research beforehand and figure out what quality of life you can afford here. Bay Area rents can range from $2,900 in San Francisco to $1,952 in Oakland. It typically costs about $900,000 for a home."
        },
        {
          "headline":"Go north or inland for a smaller town feel and lower costs.",
          "description":"For cheaper prices and a more suburban or even rural atmosphere, many people choose to move inland or north of the Bay Area. The weather will still be relatively warm year-round, and although you’ll be farther from the beaches and the convenience of the big cities, you’ll be able to get by on a lower income and have a less hectic, urban lifestyle. For a cheaper cost and a suburban or smaller town feel, look at places like:\nIrvine\nOxnard\nVacaville\nFresno\nRoseville"
        }
      ]
    },
    {
      "name":"Finding a House or Apartment",
      "steps":[
        {
          "headline":"Decide on a rental budget.",
          "description":"As you consider locations and housing options, it’s best to settle on a rental or buying budget that you know you can stick to. Check out the average cost of renting or buying a home in the area you’re interested in, then look at your savings, salary, and current budget to see what you can afford. If an area seems out of your price range, try looking for a different form of housing. It might be cheaper to rent an apartment rather than buy, or to simply rent a room in a house that’s already occupied. Take transportation into account when you’re deciding on an area. If living directly in a city is out of your budget, see whether you could live farther out but close to a metro line or bus stop."
        },
        {
          "headline":"Look for apartments and homes online for the best deals.",
          "description":"If you’re hunting for homes from outside of California, going online will likely be your best bet. Do a Google search for the city and type of housing you’re looking for, like “Irvine apartments,” then try a couple of different websites. Filter by different criteria, like the size and cost, to narrow down your options. Make sure to only look on legitimate websites, which will be well put together and have security measures, like outside checks on listings. If you use a less-vetted website, like Craigslist, keep an eye out for scams. Never send a seller money through Western Union or a prepaid credit card, and be cautious if they seem to be pushing you to take the rental quickly and without much information. You can also use a realtor or rental agent to help you with your search."
        },
        {
          "headline":"Compare properties to make sure you’re getting the best place for you.",
          "description":"Even if you think you’ve found the perfect spot, come up with a list of at least 3 or 4 possible housing options. Weigh different aspects, like the size, cost, neighborhood, and amenities like an in-complex gym or in-unit laundry. This is also important in case the place you were looking at gets taken before you can contact the seller about it."
        },
        {
          "headline":"Contact a landlord or seller as soon as you can.",
          "description":"Properties in California don’t stay on the market long, so it’s important to get in touch with the landlord or seller quickly once you’ve found a good place. If you’ve been hunting on the Internet, contact information should be listed on the website. If you’re going through an agency or a realtor, ask them what your next step will be. If you can, try to visit the place before you sign for it so you know exactly what condition it’s in. If you can’t get to California for an in-person visit, ask the seller or landlord to take you on a video tour of it."
        },
        {
          "headline":"Search for roommates online or through your friend network.",
          "description":"California rental costs can be a little more manageable with a roommate—or a few—alongside you! Post on social media to see if any of your friends and acquaintances are looking for someone to live with, or go on roommate and rental sites. When you’re looking for a roommate, use the same caution as you would when finding an apartment or house. You’ll be living with this person, so don’t be afraid to ask them questions about their lifestyle and habits."
        }
      ]
    },
    {
      "name":"Moving Your Possessions",
      "steps":[
        {
          "headline":"Move only items you know you’ll need.",
          "description":"Take stock of your big items, like furniture, appliances, and large electronics like a TV. Do some research and calculations to see which possessions are more cost-effective to move to California, and which could be sold and re-purchased. If you’re moving on a budget, bring only things that you can’t do without. Sell or give away anything you don’t use anymore, like old clothing, electronics, or books. The less you move, the more you’ll save on shipping or moving costs. Check what your new apartment or home comes furnished with. If it comes with a refrigerator, microwave, bed, or other essentials, those are all things you don’t have to move. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCindy Hofen, MBA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organizer & Home Staging Specialist\t\t\t\t\t\t\t\tCindy Hofen is a Certified Relocation Specialist and the founder of Managing Moves & More, a San Francisco Bay Area-based professional move management company specializing in start-to-finish moving solutions, home clearouts, estate sales, and home staging. Since 2009, her team has helped over 2,500 clients to simplify their transitions. Cindy has over 10 years of professional moving and organizing experience, is a member of the National Association of Senior Move Managers (NASMM), holds an A+ Accreditation, and belongs to the Diamond Society. She has a Master of Business Administration from Arizona State University and a BA in Business Economics from the University of California, Santa Barbara. Cindy Hofen, MBA\t\t\tProfessional Organizer & Home Staging Specialist\t\t\t\tOur Expert Agrees: When you're getting ready to move, use it as an opportunity to downsize and purge all the stuff you've accumulated over the years. That way, you don't waste time and energy moving stuff you don't really want anymore."
        },
        {
          "headline":"Use a moving or shipping container company if you’re transporting a large amount.",
          "description":"Hiring professionals to move your things is a good idea if you have a lot to move or just don’t have time to make sure it gets there. Professional moving companies will pack, load, ship, and unpack all of your things for you, while shipping container companies will give you a storage container to pack up yourself, then do the shipping for you. A professional moving company will be more expensive, but you likely won’t know the full cost until after an evaluation. Shipping container costs vary by destination and container size."
        },
        {
          "headline":"Rent a truck to save money and move your things yourself.",
          "description":"If you don’t trust your belongings to a moving company or want to save money by transporting them yourself, a truck rental might be the option for you. You’ll pack up and move everything yourself, arranging vehicle pickup and return with the company beforehand. Only use a rental truck if you’re comfortable driving a big vehicle without using a rearview mirror—most only have side mirrors. The cost of renting a truck will depend on the size of the truck, the distance you’re traveling, and the amount of time you’re renting for."
        },
        {
          "headline":"Ship your belongings by mail or in your car if you don’t have much to move.",
          "description":"This is the cheapest option, but it’s only viable if you don’t have very many possessions to send on. Shipping through the mail can be expensive, especially with heavier items, and it might be difficult to drive your belongings yourself if your car is small. If you’re on a tight budget, though, this method can save you a lot of money. You can also see if any friends or family will help you drive your things to California. Packing up 2 cars will give you twice as much space for your belongings."
        },
        {
          "headline":"Double check that your things will get there on the right day.",
          "description":"Check with your landlord or seller to see when you can officially move into your new place, or when your belongings can start arriving. Confirm the arrival date with your shipping company, or plan out your route so that you don’t arrive too early. You should also make sure to bring the essential items you’ll need in the meantime before your belongings arrive, like some clean clothes and toiletries."
        }
      ]
    },
    {
      "name":"Becoming a Resident",
      "steps":[
        {
          "headline":"Get a California driver’s license within 10 days of your move.",
          "description":"Getting your California driver’s license or state ID is the first step towards becoming an official resident, and the state requires you to do it within 10 days of moving there. If you already have a license or ID card from another state, complete an online application and visit a DMV office to confirm your identity and residency. You’ll also take a few examinations to test your vision and knowledge of California road laws. To verify your residency, provide an official document that states your new California address. This could be your rental or lease agreement, mortgage bill, or employment documentation, among other options."
        },
        {
          "headline":"Transfer your car’s title and registration within 20 days.",
          "description":"To start the process of applying for a California title, your car will need to pass a smog inspection and a vehicle verification, either at the DMV or a licensed vehicle verifier. Once your car passes both exams, complete an online application and take the vehicle to the DMV with your vehicle’s out-of-state title, registration, and license plates, as well as other documentation. You’ll need to pay a $21 title fee to complete the transfer. For links and more information, go to https://www.dmv.org/ca-california/title-transfers.php. Start this process no later than 20 days after your move, as required by the state of California."
        },
        {
          "headline":"Open or transfer your bank account to California, if necessary.",
          "description":"Contact your bank about your move and ask what steps you’ll need to take to transfer your account to California. It might be as simple as changing your address, or you might have to meet with or call a bank representative to make a full account transfer.Did you know? When you move states, it’s important to see what steps you need to take to keep your bank account active. States often have different banking laws that your bank will need to comply with when you move."
        },
        {
          "headline":"Register to vote in California.",
          "description":"Registering to vote in your new state and city will ensure that you have a voice in local policies, and it’s a relatively simple process to complete. You can fill out an application online, send one through the mail, or register in-person at the DMV. To register to vote, you’ll need to be 18 years old as of the next election. You’ll also need to provide proof of your identity, such as your driver’s license or the last 4 digits of your Social Security number, and your address."
        }
      ]
    }
  ],
  "text":" Choosing an Area to Live Move to Los Angeles for warm weather and the entertainment industry. Los Angeles is a hub for many industries, from entertainment to tech. It’s the biggest city in California, which is great if you’re looking for an area with great weather, lots of people, and tons of things to do. California is notorious for its high cost of living. In Los Angeles, the average rent is $2,265 and the median home price is $799,000. Choose the San Diego area for a more laid-back attitude. San Diego is known for its warm weather, great beaches, and relaxed atmosphere. Although not as high-energy or as central to industry as LA, San Diego is consistently ranked as one of the happiest cities in the country. The average rent in San Diego is about $1,887, while the median home cost is $629,000. Consider the Bay Area for tech industry jobs and a high-energy atmosphere. California’s Bay Area, which includes cities like San Francisco, San Jose, and Oakland, is famous for being a hotbed of tech companies. It’s the perfect place to live if you’re looking for a job and want to experience a unique, beautiful area, but it’s also the most expensive place to live in the country. Make sure to do your research beforehand and figure out what quality of life you can afford here. Bay Area rents can range from $2,900 in San Francisco to $1,952 in Oakland. It typically costs about $900,000 for a home. Go north or inland for a smaller town feel and lower costs. For cheaper prices and a more suburban or even rural atmosphere, many people choose to move inland or north of the Bay Area. The weather will still be relatively warm year-round, and although you’ll be farther from the beaches and the convenience of the big cities, you’ll be able to get by on a lower income and have a less hectic, urban lifestyle. For a cheaper cost and a suburban or smaller town feel, look at places like:\nIrvine\nOxnard\nVacaville\nFresno\nRoseville Finding a House or Apartment Decide on a rental budget. As you consider locations and housing options, it’s best to settle on a rental or buying budget that you know you can stick to. Check out the average cost of renting or buying a home in the area you’re interested in, then look at your savings, salary, and current budget to see what you can afford. If an area seems out of your price range, try looking for a different form of housing. It might be cheaper to rent an apartment rather than buy, or to simply rent a room in a house that’s already occupied. Take transportation into account when you’re deciding on an area. If living directly in a city is out of your budget, see whether you could live farther out but close to a metro line or bus stop. Look for apartments and homes online for the best deals. If you’re hunting for homes from outside of California, going online will likely be your best bet. Do a Google search for the city and type of housing you’re looking for, like “Irvine apartments,” then try a couple of different websites. Filter by different criteria, like the size and cost, to narrow down your options. Make sure to only look on legitimate websites, which will be well put together and have security measures, like outside checks on listings. If you use a less-vetted website, like Craigslist, keep an eye out for scams. Never send a seller money through Western Union or a prepaid credit card, and be cautious if they seem to be pushing you to take the rental quickly and without much information. You can also use a realtor or rental agent to help you with your search. Compare properties to make sure you’re getting the best place for you. Even if you think you’ve found the perfect spot, come up with a list of at least 3 or 4 possible housing options. Weigh different aspects, like the size, cost, neighborhood, and amenities like an in-complex gym or in-unit laundry. This is also important in case the place you were looking at gets taken before you can contact the seller about it. Contact a landlord or seller as soon as you can. Properties in California don’t stay on the market long, so it’s important to get in touch with the landlord or seller quickly once you’ve found a good place. If you’ve been hunting on the Internet, contact information should be listed on the website. If you’re going through an agency or a realtor, ask them what your next step will be. If you can, try to visit the place before you sign for it so you know exactly what condition it’s in. If you can’t get to California for an in-person visit, ask the seller or landlord to take you on a video tour of it. Search for roommates online or through your friend network. California rental costs can be a little more manageable with a roommate—or a few—alongside you! Post on social media to see if any of your friends and acquaintances are looking for someone to live with, or go on roommate and rental sites. When you’re looking for a roommate, use the same caution as you would when finding an apartment or house. You’ll be living with this person, so don’t be afraid to ask them questions about their lifestyle and habits. Moving Your Possessions Move only items you know you’ll need. Take stock of your big items, like furniture, appliances, and large electronics like a TV. Do some research and calculations to see which possessions are more cost-effective to move to California, and which could be sold and re-purchased. If you’re moving on a budget, bring only things that you can’t do without. Sell or give away anything you don’t use anymore, like old clothing, electronics, or books. The less you move, the more you’ll save on shipping or moving costs. Check what your new apartment or home comes furnished with. If it comes with a refrigerator, microwave, bed, or other essentials, those are all things you don’t have to move. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tCindy Hofen, MBA\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organizer & Home Staging Specialist\t\t\t\t\t\t\t\tCindy Hofen is a Certified Relocation Specialist and the founder of Managing Moves & More, a San Francisco Bay Area-based professional move management company specializing in start-to-finish moving solutions, home clearouts, estate sales, and home staging. Since 2009, her team has helped over 2,500 clients to simplify their transitions. Cindy has over 10 years of professional moving and organizing experience, is a member of the National Association of Senior Move Managers (NASMM), holds an A+ Accreditation, and belongs to the Diamond Society. She has a Master of Business Administration from Arizona State University and a BA in Business Economics from the University of California, Santa Barbara. Cindy Hofen, MBA\t\t\tProfessional Organizer & Home Staging Specialist\t\t\t\tOur Expert Agrees: When you're getting ready to move, use it as an opportunity to downsize and purge all the stuff you've accumulated over the years. That way, you don't waste time and energy moving stuff you don't really want anymore. Use a moving or shipping container company if you’re transporting a large amount. Hiring professionals to move your things is a good idea if you have a lot to move or just don’t have time to make sure it gets there. Professional moving companies will pack, load, ship, and unpack all of your things for you, while shipping container companies will give you a storage container to pack up yourself, then do the shipping for you. A professional moving company will be more expensive, but you likely won’t know the full cost until after an evaluation. Shipping container costs vary by destination and container size. Rent a truck to save money and move your things yourself. If you don’t trust your belongings to a moving company or want to save money by transporting them yourself, a truck rental might be the option for you. You’ll pack up and move everything yourself, arranging vehicle pickup and return with the company beforehand. Only use a rental truck if you’re comfortable driving a big vehicle without using a rearview mirror—most only have side mirrors. The cost of renting a truck will depend on the size of the truck, the distance you’re traveling, and the amount of time you’re renting for. Ship your belongings by mail or in your car if you don’t have much to move. This is the cheapest option, but it’s only viable if you don’t have very many possessions to send on. Shipping through the mail can be expensive, especially with heavier items, and it might be difficult to drive your belongings yourself if your car is small. If you’re on a tight budget, though, this method can save you a lot of money. You can also see if any friends or family will help you drive your things to California. Packing up 2 cars will give you twice as much space for your belongings. Double check that your things will get there on the right day. Check with your landlord or seller to see when you can officially move into your new place, or when your belongings can start arriving. Confirm the arrival date with your shipping company, or plan out your route so that you don’t arrive too early. You should also make sure to bring the essential items you’ll need in the meantime before your belongings arrive, like some clean clothes and toiletries. Becoming a Resident Get a California driver’s license within 10 days of your move. Getting your California driver’s license or state ID is the first step towards becoming an official resident, and the state requires you to do it within 10 days of moving there. If you already have a license or ID card from another state, complete an online application and visit a DMV office to confirm your identity and residency. You’ll also take a few examinations to test your vision and knowledge of California road laws. To verify your residency, provide an official document that states your new California address. This could be your rental or lease agreement, mortgage bill, or employment documentation, among other options. Transfer your car’s title and registration within 20 days. To start the process of applying for a California title, your car will need to pass a smog inspection and a vehicle verification, either at the DMV or a licensed vehicle verifier. Once your car passes both exams, complete an online application and take the vehicle to the DMV with your vehicle’s out-of-state title, registration, and license plates, as well as other documentation. You’ll need to pay a $21 title fee to complete the transfer. For links and more information, go to https://www.dmv.org/ca-california/title-transfers.php. Start this process no later than 20 days after your move, as required by the state of California. Open or transfer your bank account to California, if necessary. Contact your bank about your move and ask what steps you’ll need to take to transfer your account to California. It might be as simple as changing your address, or you might have to meet with or call a bank representative to make a full account transfer.Did you know? When you move states, it’s important to see what steps you need to take to keep your bank account active. States often have different banking laws that your bank will need to comply with when you move. Register to vote in California. Registering to vote in your new state and city will ensure that you have a voice in local policies, and it’s a relatively simple process to complete. You can fill out an application online, send one through the mail, or register in-person at the DMV. To register to vote, you’ll need to be 18 years old as of the next election. You’ll also need to provide proof of your identity, such as your driver’s license or the last 4 digits of your Social Security number, and your address.",
  "tyn_model":[
    "truck",
    "“irvine",
    "” then",
    "western union",
    "realtor",
    "—or",
    "—alongside",
    "roommate",
    "refrigerator",
    "microwave",
    "relocation specialist",
    "shipping container",
    "storage container",
    "moving company",
    "—most",
    "dmv",
    "social security number"
  ],
  "tyn_section":[

  ]
}