{
  "title":"How to Make Coconut Sweets",
  "url":"https://www.wikihow.com/Make-Coconut-Sweets",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets"
  ],
  "methods":[
    {
      "name":"Making Kashaato",
      "steps":[
        {
          "headline":"Boil the milk and sugar.",
          "description":"Pour the milk into a 3 quart pot. Add the sugar and stir to combine. Cook on medium heat. Once the mixture starts to boil, stir it more. Continue to let it boil up and then stir for 8 minutes. If you find that your mixture begins to burn, remove your pot from the heat for a moment and turn down the heat. Continue to stir it and it should not stick anymore."
        },
        {
          "headline":"Integrate the coconut and mint.",
          "description":"Once 8 minutes has passed, add the coconut to the mixture. Stir it in fully. Once it is combined, add the mint extract."
        },
        {
          "headline":"Finish the mixture.",
          "description":"Once the mint has been added, the mixture should continue to boil. Stir the mixture continuously as it cooks. Cook it for about 7 minutes. The color of the mixture should start to change, getting slightly darker. Once this happens, the mixture is almost ready. Once it is foamy and the darker color, your mixture is ready. Your total cooking time should be 15 minutes."
        },
        {
          "headline":"Set the coconut sweets.",
          "description":"Grease a cookie sheet or baking dish. Pour the mixture out of the pot onto the pan. Shake the pan to even out the mixture. Take your sprinkles and scatter them around the top of the sweets."
        },
        {
          "headline":"Serve the sweets.",
          "description":"Let the mixture sit for at least 2 minutes. Cut the sweets into the shape that you want them to be in. Serve and enjoy."
        },
        {
          "headline":"Make crumblier sweets.",
          "description":"If you want your treats to be more crumbly than smooth, cook the mixture for 2-3 additional minutes. Stir it continuously. The mixture will get darker and foamier as you let it cook. Once the time is over, pour it over a greased pan. Instead of adding sprinkles, add 2 more tablespoons of coconut to the top of the mixture. Let sit and cut as you would the others."
        }
      ]
    },
    {
      "name":"Making Kashata",
      "steps":[
        {
          "headline":"Wet the coconut.",
          "description":"Place your shredded coconut in a bowl. Add the coconut milk to the coconut. Take a spoon and gently stir the milk into the coconut. Make sure that all the coconut is wet and covered with the milk. It will start to soak into the coconut. If you do not like coconut milk, you can add regular milk instead."
        },
        {
          "headline":"Add the powdered milk.",
          "description":"To your wet coconut, add the powdered milk. Stir it evenly to coat all the coconut with the powdered milk. This will make your mixture extra creamy."
        },
        {
          "headline":"Make the syrup.",
          "description":"Add your water and sugar to a saucepan. Do not stir your mixture. You do not want crystals to form in the mixture from the sugar. Take the handle of the saucepan and gently swirl the mixture to stir it. Place it over medium heat. Let it start to boil. Continue to swirl the mixture as the mixture turns into syrup. Not stirring the mixture helps give you a thinner, less granulated syrup. Crystals can form in the mixture if you stir it instead of swirling the pan."
        },
        {
          "headline":"Integrate the other ingredients.",
          "description":"Once it starts to thicken, add the salt and cardamon. Grab the handle and swirl the mixture to combine those into the syrup. Once those are combined, add your food coloring. Put the food coloring gel on the end of a teaspoon and lightly swirl it around the top of the syrup mixture. Make sure you get it all off the spoon. Swirl the syrup again the mix in the coloring. You can add more coloring if you want a darker color sweet as your final product. The food coloring is not necessary, but it adds a nice, playful color to your sweets. Traditional colors for these treats are blue and pink, but you can use any color you like."
        },
        {
          "headline":"Prepare your pan.",
          "description":"As you are waiting for the syrup to cook, grab a baking dish. Lightly grease the bottom of the pan. Set it on the counter beside you. You can use a long baking pan to make your sweets thinner. You can also use a shorter loaf pan if you want thicker pieces."
        },
        {
          "headline":"Finish your syrup.",
          "description":"Once you notice your mixture thickening, you need to check the consistency. Take a teaspoon and dip it in the mixture. Dab your pointer finger in the syrup on the end of the spoon. Press your thumb and pointer finger together. If the syrup is sticky but doesn't make strings between your fingers, it needs to cook more. If your the syrup strings between your fingers, it is ready. Make sure you don't stick your finger directly into the pan. The syrup will be very hot."
        },
        {
          "headline":"Mix the sweets.",
          "description":"Once your syrup is the right consistency, pour the coconut into the pan. Take a wooden spoon and stir the mixture together immediately. The coconut will soak in the syrup as you continue to stir the mixture over the heat. Continue to stir until the moisture has disappeared and the coconut pulls away from the sides of the pan. This may take a few minutes. If the mixture is a little wet, turn the pan up to medium high heat to help dry out the extra syrup. If you see the mixture turning slightly brown, you need to remove it from heat. The syrup is starting to caramelize."
        },
        {
          "headline":"Set the sweets.",
          "description":"Once the mixture is dry enough, pour it into the prepared baking pan. Spread it out with the wooden spoon to make an even layer. Make sure your spread it all the way to the corners of the pan. Let it sit for at least 5-8 minutes to cool."
        },
        {
          "headline":"Cut the sweets.",
          "description":"Once the sweets are cooled, you can cut them into any shape you want. Instead of using a sharp knife, use the flat, non-serrated side of a butter knife. The serrations will rip apart the sweets. Once they are cut, serve and enjoy. Try not to make too many back and forth motions when you cut the sweets. This will cause them to fall apart. If the edges start to merge back together, the sweets are not cooled enough. Let them set for a while longer before you cut."
        }
      ]
    }
  ],
  "text":" Making Kashaato Boil the milk and sugar. Pour the milk into a 3 quart pot. Add the sugar and stir to combine. Cook on medium heat. Once the mixture starts to boil, stir it more. Continue to let it boil up and then stir for 8 minutes. If you find that your mixture begins to burn, remove your pot from the heat for a moment and turn down the heat. Continue to stir it and it should not stick anymore. Integrate the coconut and mint. Once 8 minutes has passed, add the coconut to the mixture. Stir it in fully. Once it is combined, add the mint extract. Finish the mixture. Once the mint has been added, the mixture should continue to boil. Stir the mixture continuously as it cooks. Cook it for about 7 minutes. The color of the mixture should start to change, getting slightly darker. Once this happens, the mixture is almost ready. Once it is foamy and the darker color, your mixture is ready. Your total cooking time should be 15 minutes. Set the coconut sweets. Grease a cookie sheet or baking dish. Pour the mixture out of the pot onto the pan. Shake the pan to even out the mixture. Take your sprinkles and scatter them around the top of the sweets. Serve the sweets. Let the mixture sit for at least 2 minutes. Cut the sweets into the shape that you want them to be in. Serve and enjoy. Make crumblier sweets. If you want your treats to be more crumbly than smooth, cook the mixture for 2-3 additional minutes. Stir it continuously. The mixture will get darker and foamier as you let it cook. Once the time is over, pour it over a greased pan. Instead of adding sprinkles, add 2 more tablespoons of coconut to the top of the mixture. Let sit and cut as you would the others. Making Kashata Wet the coconut. Place your shredded coconut in a bowl. Add the coconut milk to the coconut. Take a spoon and gently stir the milk into the coconut. Make sure that all the coconut is wet and covered with the milk. It will start to soak into the coconut. If you do not like coconut milk, you can add regular milk instead. Add the powdered milk. To your wet coconut, add the powdered milk. Stir it evenly to coat all the coconut with the powdered milk. This will make your mixture extra creamy. Make the syrup. Add your water and sugar to a saucepan. Do not stir your mixture. You do not want crystals to form in the mixture from the sugar. Take the handle of the saucepan and gently swirl the mixture to stir it. Place it over medium heat. Let it start to boil. Continue to swirl the mixture as the mixture turns into syrup. Not stirring the mixture helps give you a thinner, less granulated syrup. Crystals can form in the mixture if you stir it instead of swirling the pan. Integrate the other ingredients. Once it starts to thicken, add the salt and cardamon. Grab the handle and swirl the mixture to combine those into the syrup. Once those are combined, add your food coloring. Put the food coloring gel on the end of a teaspoon and lightly swirl it around the top of the syrup mixture. Make sure you get it all off the spoon. Swirl the syrup again the mix in the coloring. You can add more coloring if you want a darker color sweet as your final product. The food coloring is not necessary, but it adds a nice, playful color to your sweets. Traditional colors for these treats are blue and pink, but you can use any color you like. Prepare your pan. As you are waiting for the syrup to cook, grab a baking dish. Lightly grease the bottom of the pan. Set it on the counter beside you. You can use a long baking pan to make your sweets thinner. You can also use a shorter loaf pan if you want thicker pieces. Finish your syrup. Once you notice your mixture thickening, you need to check the consistency. Take a teaspoon and dip it in the mixture. Dab your pointer finger in the syrup on the end of the spoon. Press your thumb and pointer finger together. If the syrup is sticky but doesn't make strings between your fingers, it needs to cook more. If your the syrup strings between your fingers, it is ready. Make sure you don't stick your finger directly into the pan. The syrup will be very hot. Mix the sweets. Once your syrup is the right consistency, pour the coconut into the pan. Take a wooden spoon and stir the mixture together immediately. The coconut will soak in the syrup as you continue to stir the mixture over the heat. Continue to stir until the moisture has disappeared and the coconut pulls away from the sides of the pan. This may take a few minutes. If the mixture is a little wet, turn the pan up to medium high heat to help dry out the extra syrup. If you see the mixture turning slightly brown, you need to remove it from heat. The syrup is starting to caramelize. Set the sweets. Once the mixture is dry enough, pour it into the prepared baking pan. Spread it out with the wooden spoon to make an even layer. Make sure your spread it all the way to the corners of the pan. Let it sit for at least 5-8 minutes to cool. Cut the sweets. Once the sweets are cooled, you can cut them into any shape you want. Instead of using a sharp knife, use the flat, non-serrated side of a butter knife. The serrations will rip apart the sweets. Once they are cut, serve and enjoy. Try not to make too many back and forth motions when you cut the sweets. This will cause them to fall apart. If the edges start to merge back together, the sweets are not cooled enough. Let them set for a while longer before you cut.",
  "tyn_model":[
    "coconut",
    "sweets",
    "milk",
    "sugar",
    "mint",
    "spoon",
    "powdered milk",
    "pan",
    "food coloring",
    "syrup",
    "pot",
    "baking dish",
    "coconut milk",
    "saucepan",
    "baking pan",
    "wooden spoon",
    "3 quart pot",
    "coconut sweets",
    "cookie sheet",
    "bowl",
    "regular milk",
    "water",
    "salt",
    "cardamon",
    "loaf pan",
    "butter knife"
  ],
  "tyn_section":[

  ]
}