{
  "title":"How to Make Spicy Mexican Eggs",
  "url":"https://www.wikihow.com/Make-Spicy-Mexican-Eggs",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy"
  ],
  "steps":[
    {
      "headline":"Crack the eggs into a mixing bowl and with a fork or whisk, and beat them until they are combined.",
      "description":""
    },
    {
      "headline":"Add the spices, milk, salt and pepper and beat the eggs again.",
      "description":""
    },
    {
      "headline":"Preheat a small frying pan on medium heat.",
      "description":""
    },
    {
      "headline":"Add a bit of butter or oil to the pan, once it is warm.",
      "description":""
    },
    {
      "headline":"Add the chorizo to the pan and cook it if necessary.",
      "description":"If the chorizo does not need cooking, toss it in the pan by itself for a moment to heat it through."
    },
    {
      "headline":"Pour the egg mixture over the chorizo.",
      "description":""
    },
    {
      "headline":"Cook, stirring occasionally, until the eggs reach the desired consistency.",
      "description":""
    },
    {
      "headline":"Serve with salsa on or in tortillas, if desired.",
      "description":"Shredded cheese would make a good topping, too."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Crack the eggs into a mixing bowl and with a fork or whisk, and beat them until they are combined.  Add the spices, milk, salt and pepper and beat the eggs again.  Preheat a small frying pan on medium heat.  Add a bit of butter or oil to the pan, once it is warm.  Add the chorizo to the pan and cook it if necessary. If the chorizo does not need cooking, toss it in the pan by itself for a moment to heat it through. Pour the egg mixture over the chorizo.  Cook, stirring occasionally, until the eggs reach the desired consistency.  Serve with salsa on or in tortillas, if desired. Shredded cheese would make a good topping, too. Finished. ",
  "tyn_model":[
    "eggs",
    "chorizo",
    "mixing bowl",
    "fork or whisk",
    "spices",
    "milk",
    "salt",
    "pepper",
    "small frying",
    "butter",
    "oil",
    "egg",
    "salsa",
    "tortillas"
  ],
  "tyn_section":[

  ]
}