{
  "title":"How to Make Fall Pumpkin Bread",
  "url":"https://www.wikihow.com/Make-Fall-Pumpkin-Bread",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Breads",
    "Vegetable Bread"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 350ºF (175ºC).",
      "description":"Place rack in the center of the oven."
    },
    {
      "headline":"Grease and flour two 9 x 5 inch loaf pans.",
      "description":"Flouring a loaf pan ensures that your finished bread will release from the pan perfectly. Even nonstick pans needs to greased and floured. No crumb left behind!"
    },
    {
      "headline":"Whisk together flour, baking powder, baking soda, salt, and spices.",
      "description":"Whisking the dry ingredients thoroughly will produce a smooth, even batter."
    },
    {
      "headline":"In a large bowl, add the eggs, the canned pumpkin puree, vegetable oil, sugar, and water.",
      "description":"Use a hand mixer to combine the wet ingredients."
    },
    {
      "headline":"With a hand mixer on low, blend the dry ingredients into the wet ingredients.",
      "description":"Add 1/3 of your dry ingredients at a time to ensure the batter is well combined."
    },
    {
      "headline":"Pour batter into baking pans.",
      "description":"If you would like, sprinkle roasted pumpkin seeds on top of the prepared pans. Bake for 50 to 60 minutes or until a toothpick inserted into the center of the bread comes out clean."
    },
    {
      "headline":"After removing the loaves from the oven, let the bread cool for ten minutes.",
      "description":"Once ten minutes is up, remove the pumpkin bread from the baking pans and place on a cooling rack for another fifteen minutes."
    },
    {
      "headline":"After bread has cooled, slice 1.5 inch (3.8 cm) slices and serve with fresh, salted butter.",
      "description":"Enjoy!"
    },
    {
      "headline":"Finished!",
      "description":""
    }
  ],
  "text":" Preheat the oven to 350ºF (175ºC). Place rack in the center of the oven. Grease and flour two 9 x 5 inch loaf pans. Flouring a loaf pan ensures that your finished bread will release from the pan perfectly. Even nonstick pans needs to greased and floured. No crumb left behind! Whisk together flour, baking powder, baking soda, salt, and spices. Whisking the dry ingredients thoroughly will produce a smooth, even batter. In a large bowl, add the eggs, the canned pumpkin puree, vegetable oil, sugar, and water. Use a hand mixer to combine the wet ingredients. With a hand mixer on low, blend the dry ingredients into the wet ingredients. Add 1/3 of your dry ingredients at a time to ensure the batter is well combined. Pour batter into baking pans. If you would like, sprinkle roasted pumpkin seeds on top of the prepared pans. Bake for 50 to 60 minutes or until a toothpick inserted into the center of the bread comes out clean. After removing the loaves from the oven, let the bread cool for ten minutes. Once ten minutes is up, remove the pumpkin bread from the baking pans and place on a cooling rack for another fifteen minutes. After bread has cooled, slice 1.5 inch (3.8 cm) slices and serve with fresh, salted butter. Enjoy! Finished! ",
  "tyn_model":[
    "oven",
    "flour",
    "hand mixer",
    "baking pans",
    "loaf pans",
    "loaf pan",
    "baking powder",
    "baking soda",
    "salt",
    "spices",
    "eggs",
    "canned pumpkin puree",
    "vegetable oil",
    "sugar",
    "water",
    "pumpkin seeds",
    "pumpkin bread",
    "salted butter"
  ],
  "tyn_section":[

  ]
}