{
  "title":"How to File",
  "url":"https://www.wikihow.com/File",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping",
    "Home Organization",
    "Household Filing and Paper Organization"
  ],
  "methods":[
    {
      "name":"Handling Your Daily Influx of Paper",
      "steps":[
        {
          "headline":"Create a central in-box to hold papers until you can sort them.",
          "description":"A central in-box is where you put all of the papers that come across your desk or through your mailbox each day. This may help you to stay organized until you have time to sort and handle each item. You can use a small cardboard box as your central in-box, or get a special box, basket, or tray for this purpose. Place the box on the corner of your desk, on a table near your front door, or somewhere else visible so that you will not forget about it."
        },
        {
          "headline":"Go through the in-box daily and set aside important items.",
          "description":"Look at each of the items in your in-box once per day to look for items that require your immediate attention. These may include bills that are due soon, party invitations, or time-sensitive forms. Set these items aside so that you can take care of them immediately. You may want to get a second box in a different color than the first box to put urgent items into. For example, you could get a red box to indicate that these are urgent items."
        },
        {
          "headline":"Place items that you want to file in a filing box.",
          "description":"Keep a third box next to the central in-box and urgent box. Use this as your collection point for items you want to file. This will help you to keep them organized until you are ready to file them. Make sure this box is a different color than the other boxes. Otherwise, you may get the boxes mixed up."
        },
        {
          "headline":"Toss unneeded items into a paper recycling bin.",
          "description":"Any junk mail or other non-essential items that end up in your in-box can go straight into the recycling bin. Identify these items as you sift through the documents and move them to the bin right away to help keep your in-box clutter free. Keep your recycling bin on the floor so that you will not confuse it with your other boxes. If any of the unneeded items contain personal information, shred them before disposing of them. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristel Ferguson\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organizer\t\t\t\t\t\t\t\tChristel Ferguson is the owner of Space to Love, a de-cluttering and organization service. Christel is certified in Advanced Feng Shui for Architecture, Interior Design & Landscape and has been a member of the Los Angeles chapter of the National Association of Productivity & Organizing Professionals (NAPO) for over five years. Christel Ferguson\t\t\tProfessional Organizer\t\t\t\tAt the end of the year, go through your papers and see what you need to keep. Recycle anything you no longer need and file the essential documents for future reference. This way, you don't end up with years and years worth of paperwork. You can also minimize your papers by going paperless and doing everything online."
        }
      ]
    },
    {
      "name":"Choosing a Filing System",
      "steps":[
        {
          "headline":"Designate a monthly and daily file if you have a lot of tasks to manage.",
          "description":"This is known as the Tickler filing system and it is a great way to keep track of what you need to do each day. Designate a file folder for each month and a folder for each day of the month. Then, insert items into the files. File the items according to the dates you need to work on them. For example, if you need to pay a bill on September 23rd, then insert the bill into the folder for that date."
        },
        {
          "headline":"File folders alphabetically to keep important documents handy.",
          "description":"Alphabetical filing is useful for finding files for individual people, businesses, or subjects. This may be ideal if you have lots of customers and you want to keep a file on each one, or if you want a simple way to manage your home filing. Make sure to place the last name of individuals first on files labels, such as, “Jones, Susan” or “Watson, David.”\nIgnore words like “The,” “A,” and “An” when filing by business name. For example, if you have a client whose business is called “The Cake Goddess,” then file according to the “C” in “Cake,” and ignore the “T” in “The” when filing."
        },
        {
          "headline":"Choose a numerical filing system for short term filing needs.",
          "description":"If you have a short term project that you want to maintain records for, then a numerical filing system may work best. This is when you assign a number to each document and file it according to number. However, keep in mind that you will also have to keep track of which document corresponds to which number, such as by using a spreadsheet. For example, you might assign all of the items you received during the week of March 14th to a file folder labeled 1, then all the items for the week of March 21st in a file labeled 2, and so on. Another option is to label the files by date and organize them chronologically. For example, items received on May 2nd, 2018 could be kept in a file labeled 5/2/2018."
        },
        {
          "headline":"Color-code your files to make finding items quick and easy.",
          "description":"Designate a color to each category of your files. This will help you to locate a category of files at a glance. For example, use red for medical bills, blue for taxes, and green for insurance. To color-code numerical or alphabetical files, assign a color to a numerical or alphabetical range, such as making files 1-25 or A-G green, 25-50 or H-M purple, and 50-75 or N-R yellow."
        },
        {
          "headline":"Include additional relevant information on the file folder.",
          "description":"Adding additional information to describe the contents of the file or any action required will also help to make your filing system more efficient. To do this, you may want to add 1 or more of the following items:\nFile number or name\nFile title\nDate the file was opened and closed\nName of the department or team\nComputer record number\nDisposal date and method of disposal"
        }
      ]
    },
    {
      "name":"Organizing Papers into Files",
      "steps":[
        {
          "headline":"Place the most recent document on top of the file.",
          "description":"Use the date that is listed on the document to help you do this. After you have your papers ready to file and your filing system set up, you can begin placing items into files. Always make sure to keep the most recent documents for each file right on top so they will be easy to access. For example, if you have a file for your homeowner’s insurance, then you would want to place the most recent record of your paid homeowner’s insurance on the top of the file."
        },
        {
          "headline":"Keep attachments with the documents they relate to.",
          "description":"If you have any relevant receipts or other documents that need to be kept along with another document, make sure to keep them together in the same file. You may even want to staple or paperclip attachments to the back of the document. For example, if you have a receipt for paying your electric bill, staple it behind the bill in case you need to reference it."
        },
        {
          "headline":"Place large documents into separate envelopes.",
          "description":"You can file these envelopes behind the files that they are related to. Make sure to include a description of the contents on the front of the envelope. This will help to eliminate clutter in your files and improve the efficiency of your filing system. For example, if you have the blueprints for a project you are working on, you could place these into a large envelope."
        },
        {
          "headline":"File the original document and dispose of any copies.",
          "description":"Not filing duplicates will help to prevent confusion when you are looking for an item in your files. If you come across any duplicates, dispose of these and only file the original document. If you are unsure which document is the original, then you might need to file both items to be sure you have the original. However, try not to do this too often or your files will bulk up quickly!"
        }
      ]
    }
  ],
  "text":" Handling Your Daily Influx of Paper Create a central in-box to hold papers until you can sort them. A central in-box is where you put all of the papers that come across your desk or through your mailbox each day. This may help you to stay organized until you have time to sort and handle each item. You can use a small cardboard box as your central in-box, or get a special box, basket, or tray for this purpose. Place the box on the corner of your desk, on a table near your front door, or somewhere else visible so that you will not forget about it. Go through the in-box daily and set aside important items. Look at each of the items in your in-box once per day to look for items that require your immediate attention. These may include bills that are due soon, party invitations, or time-sensitive forms. Set these items aside so that you can take care of them immediately. You may want to get a second box in a different color than the first box to put urgent items into. For example, you could get a red box to indicate that these are urgent items. Place items that you want to file in a filing box. Keep a third box next to the central in-box and urgent box. Use this as your collection point for items you want to file. This will help you to keep them organized until you are ready to file them. Make sure this box is a different color than the other boxes. Otherwise, you may get the boxes mixed up. Toss unneeded items into a paper recycling bin. Any junk mail or other non-essential items that end up in your in-box can go straight into the recycling bin. Identify these items as you sift through the documents and move them to the bin right away to help keep your in-box clutter free. Keep your recycling bin on the floor so that you will not confuse it with your other boxes. If any of the unneeded items contain personal information, shred them before disposing of them. EXPERT TIP\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tChristel Ferguson\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tProfessional Organizer\t\t\t\t\t\t\t\tChristel Ferguson is the owner of Space to Love, a de-cluttering and organization service. Christel is certified in Advanced Feng Shui for Architecture, Interior Design & Landscape and has been a member of the Los Angeles chapter of the National Association of Productivity & Organizing Professionals (NAPO) for over five years. Christel Ferguson\t\t\tProfessional Organizer\t\t\t\tAt the end of the year, go through your papers and see what you need to keep. Recycle anything you no longer need and file the essential documents for future reference. This way, you don't end up with years and years worth of paperwork. You can also minimize your papers by going paperless and doing everything online. Choosing a Filing System Designate a monthly and daily file if you have a lot of tasks to manage. This is known as the Tickler filing system and it is a great way to keep track of what you need to do each day. Designate a file folder for each month and a folder for each day of the month. Then, insert items into the files. File the items according to the dates you need to work on them. For example, if you need to pay a bill on September 23rd, then insert the bill into the folder for that date. File folders alphabetically to keep important documents handy. Alphabetical filing is useful for finding files for individual people, businesses, or subjects. This may be ideal if you have lots of customers and you want to keep a file on each one, or if you want a simple way to manage your home filing. Make sure to place the last name of individuals first on files labels, such as, “Jones, Susan” or “Watson, David.”\nIgnore words like “The,” “A,” and “An” when filing by business name. For example, if you have a client whose business is called “The Cake Goddess,” then file according to the “C” in “Cake,” and ignore the “T” in “The” when filing. Choose a numerical filing system for short term filing needs. If you have a short term project that you want to maintain records for, then a numerical filing system may work best. This is when you assign a number to each document and file it according to number. However, keep in mind that you will also have to keep track of which document corresponds to which number, such as by using a spreadsheet. For example, you might assign all of the items you received during the week of March 14th to a file folder labeled 1, then all the items for the week of March 21st in a file labeled 2, and so on. Another option is to label the files by date and organize them chronologically. For example, items received on May 2nd, 2018 could be kept in a file labeled 5/2/2018. Color-code your files to make finding items quick and easy. Designate a color to each category of your files. This will help you to locate a category of files at a glance. For example, use red for medical bills, blue for taxes, and green for insurance. To color-code numerical or alphabetical files, assign a color to a numerical or alphabetical range, such as making files 1-25 or A-G green, 25-50 or H-M purple, and 50-75 or N-R yellow. Include additional relevant information on the file folder. Adding additional information to describe the contents of the file or any action required will also help to make your filing system more efficient. To do this, you may want to add 1 or more of the following items:\nFile number or name\nFile title\nDate the file was opened and closed\nName of the department or team\nComputer record number\nDisposal date and method of disposal Organizing Papers into Files Place the most recent document on top of the file. Use the date that is listed on the document to help you do this. After you have your papers ready to file and your filing system set up, you can begin placing items into files. Always make sure to keep the most recent documents for each file right on top so they will be easy to access. For example, if you have a file for your homeowner’s insurance, then you would want to place the most recent record of your paid homeowner’s insurance on the top of the file. Keep attachments with the documents they relate to. If you have any relevant receipts or other documents that need to be kept along with another document, make sure to keep them together in the same file. You may even want to staple or paperclip attachments to the back of the document. For example, if you have a receipt for paying your electric bill, staple it behind the bill in case you need to reference it. Place large documents into separate envelopes. You can file these envelopes behind the files that they are related to. Make sure to include a description of the contents on the front of the envelope. This will help to eliminate clutter in your files and improve the efficiency of your filing system. For example, if you have the blueprints for a project you are working on, you could place these into a large envelope. File the original document and dispose of any copies. Not filing duplicates will help to prevent confusion when you are looking for an item in your files. If you come across any duplicates, dispose of these and only file the original document. If you are unsure which document is the original, then you might need to file both items to be sure you have the original. However, try not to do this too often or your files will bulk up quickly!",
  "tyn_model":[
    "papers",
    "filing system",
    "“the",
    "” and",
    "” when",
    "” in",
    "paper",
    "tray",
    "paper recycling",
    "documents",
    "space",
    "de-cluttering and organization service",
    "feng shui for architecture, interior design & landscape and has been",
    "productivity & organizing professionals",
    "file folder",
    "“jones",
    "” or",
    "“watson",
    "”\n",
    "” “",
    "“an",
    "” then",
    "“c",
    "“cake",
    "“t",
    "numerical filing system",
    "spreadsheet",
    "color"
  ],
  "tyn_section":[

  ]
}