{
  "title":"How to Cook Gulai Salai Ikan Khas Palembang (Smoked Fish Curry)",
  "url":"https://www.wikihow.com/Cook-Gulai-Salai-Ikan-Khas-Palembang-(Smoked-Fish-Curry)",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Indonesian Dishes"
  ],
  "steps":[
    {
      "headline":"Heat 2 teaspoons of coconut oil in a wok or a cooking pot over medium-high heat.",
      "description":""
    },
    {
      "headline":"Grind the spices.",
      "description":"Sauté the ground spices, along with 3 fresh lime leaves until well-cooked and they release a fragrant scent."
    },
    {
      "headline":"Add a half liter of coconut milk to the previous ingredients.",
      "description":""
    },
    {
      "headline":"Add the 14 pieces of smoked fish and stir-fry.",
      "description":""
    },
    {
      "headline":"Add a glass of water.",
      "description":""
    },
    {
      "headline":"Make sure that the 14 pieces of smoked fish are perfectly cooked.",
      "description":""
    },
    {
      "headline":"Add the rest of coconut milk along with eggplants and beans.",
      "description":"Stir-fry until hot and well combined."
    },
    {
      "headline":"Add salt and sugar.",
      "description":"Add a sufficient amount according to your own taste."
    },
    {
      "headline":"Cook until the spices are absorbed.",
      "description":""
    },
    {
      "headline":"Serve straight away.",
      "description":"This food is usually eaten with rice."
    }
  ],
  "text":" Heat 2 teaspoons of coconut oil in a wok or a cooking pot over medium-high heat.  Grind the spices. Sauté the ground spices, along with 3 fresh lime leaves until well-cooked and they release a fragrant scent. Add a half liter of coconut milk to the previous ingredients.  Add the 14 pieces of smoked fish and stir-fry.  Add a glass of water.  Make sure that the 14 pieces of smoked fish are perfectly cooked.  Add the rest of coconut milk along with eggplants and beans. Stir-fry until hot and well combined. Add salt and sugar. Add a sufficient amount according to your own taste. Cook until the spices are absorbed.  Serve straight away. This food is usually eaten with rice.",
  "tyn_model":[
    "coconut milk",
    "smoked fish",
    "coconut oil",
    "wok",
    "cooking pot",
    "ground spices",
    "water",
    "eggplants",
    "beans",
    "salt",
    "sugar",
    "rice"
  ],
  "tyn_section":[

  ]
}