{
  "title":"How to Make Esau's Pottage Lentil Stew",
  "url":"https://www.wikihow.com/Make-Esau%27s-Pottage-Lentil-Stew",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Meat Substitutes"
  ],
  "steps":[
    {
      "headline":"Set up your crock pot and plug it in.",
      "description":""
    },
    {
      "headline":"Rinse the lentils to remove dirt or stones.",
      "description":""
    },
    {
      "headline":"Put the lentils into the crock pot and cover them with at least 2 inches (5.1 cm) of water.",
      "description":""
    },
    {
      "headline":"Set the crock pot on high",
      "description":""
    },
    {
      "headline":"Chop the onion finely and put it in.",
      "description":""
    },
    {
      "headline":"Chop the celery and put it in.",
      "description":""
    },
    {
      "headline":"Add the Olive Oil, Salt and broth, stock or herbs and spices.",
      "description":""
    },
    {
      "headline":"Add the Textured Vegetable Protein if desired.",
      "description":""
    },
    {
      "headline":"Allow the stew to cook overnight (around 8 hours, or until the lentils are soft enough to squeeze between your thumb and forefinger).",
      "description":"Add water if necessary to prevent drying out or burning."
    },
    {
      "headline":"Add the diced tomatoes half an hour before serving for best texture and flavor.",
      "description":""
    }
  ],
  "text":" Set up your crock pot and plug it in.  Rinse the lentils to remove dirt or stones.  Put the lentils into the crock pot and cover them with at least 2 inches (5.1 cm) of water.  Set the crock pot on high  Chop the onion finely and put it in.  Chop the celery and put it in.  Add the Olive Oil, Salt and broth, stock or herbs and spices.  Add the Textured Vegetable Protein if desired.  Allow the stew to cook overnight (around 8 hours, or until the lentils are soft enough to squeeze between your thumb and forefinger). Add water if necessary to prevent drying out or burning. Add the diced tomatoes half an hour before serving for best texture and flavor. ",
  "tyn_model":[
    "crock pot",
    "water",
    "onion",
    "celery",
    "olive oil",
    "salt",
    "broth",
    "stock",
    "herbs",
    "spices",
    "lentils",
    "tomatoes"
  ],
  "tyn_section":[

  ]
}