{
  "title":"How to Train Your Dog in Nosework",
  "url":"https://www.wikihow.com/Train-Your-Dog-in-Nosework",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "steps":[
    {
      "headline":"Pick out a treat for your dog.",
      "description":"It should be an extra special treat, something your dog LOVES."
    },
    {
      "headline":"Set out three (3) containers.",
      "description":"Small cardboard boxes are ideal but any container will work. Place the boxes on the ground. The environment should be free of other dogs or distractions."
    },
    {
      "headline":"Restrain your dog.",
      "description":"Having a friend here is helpful, they are going to hold your dog on leash. Or if you are alone, you can tie the dog back. Pick up one of the boxes and  make a show of putting the treats in there, once the dog shows interest, put the box down among the other boxes."
    },
    {
      "headline":"Release your dog to search Follow your dog to the boxes, keeping the leash loose.",
      "description":"Because you made it clear that the hide (treat) is in one of the boxes, your dog should check the containers. As a handler, your biggest job is to stay out of the dogs' way and let them search."
    },
    {
      "headline":"Reward at Source.",
      "description":"Once your dog finds the correct box, reward with more food. Feed right next to 'source', where the odor/food is."
    },
    {
      "headline":"Shuffle Boxes.",
      "description":"Once your dog has eaten all of their food, you are going to restrain them again, add more treats to the box and shuffle the boxes around (like a shell game). Release your dog to search again."
    },
    {
      "headline":"Make the puzzle harder.",
      "description":"After the dog starts to understand the game, add a level of difficulty. You can try stacking the boxes, adding a few boxes, moving to a new location or closing the containers part of the way (making sure the dog can still get to the treats in the box). Be creative!"
    },
    {
      "headline":"Add odor.",
      "description":"Once the dog really starts to understand the game and is hunting independently, you can progress to adding a target odor. This is clove (Syzygium Aromaticum) essential oil on a q-tip, an odor used in the sport of K9 Nose work. But you can use any scent you want your dog to find! Put the odor in the box and tape it down, pair the odor with treats (this is to create a positive association)."
    },
    {
      "headline":"Rinse and Repeat.",
      "description":"Follow steps 1-8 again with the paired odor."
    }
  ],
  "text":" Pick out a treat for your dog. It should be an extra special treat, something your dog LOVES. Set out three (3) containers. Small cardboard boxes are ideal but any container will work. Place the boxes on the ground. The environment should be free of other dogs or distractions. Restrain your dog. Having a friend here is helpful, they are going to hold your dog on leash. Or if you are alone, you can tie the dog back. Pick up one of the boxes and  make a show of putting the treats in there, once the dog shows interest, put the box down among the other boxes. Release your dog to search Follow your dog to the boxes, keeping the leash loose. Because you made it clear that the hide (treat) is in one of the boxes, your dog should check the containers. As a handler, your biggest job is to stay out of the dogs' way and let them search. Reward at Source. Once your dog finds the correct box, reward with more food. Feed right next to 'source', where the odor/food is. Shuffle Boxes. Once your dog has eaten all of their food, you are going to restrain them again, add more treats to the box and shuffle the boxes around (like a shell game). Release your dog to search again. Make the puzzle harder. After the dog starts to understand the game, add a level of difficulty. You can try stacking the boxes, adding a few boxes, moving to a new location or closing the containers part of the way (making sure the dog can still get to the treats in the box). Be creative! Add odor. Once the dog really starts to understand the game and is hunting independently, you can progress to adding a target odor. This is clove (Syzygium Aromaticum) essential oil on a q-tip, an odor used in the sport of K9 Nose work. But you can use any scent you want your dog to find! Put the odor in the box and tape it down, pair the odor with treats (this is to create a positive association). Rinse and Repeat. Follow steps 1-8 again with the paired odor.",
  "tyn_model":[
    "treats",
    "containers",
    "food",
    "cardboard",
    "container",
    "q-tip"
  ],
  "tyn_section":[

  ]
}