{
  "title":"How to Make Gandus Cake",
  "url":"https://www.wikihow.com/Make-Gandus-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes"
  ],
  "steps":[
    {
      "headline":"Prepare the utensils",
      "description":""
    },
    {
      "headline":"Prepare the cake and topping ingredients",
      "description":""
    },
    {
      "headline":"Slice the shallots ,cut the celery and then cut the chilies on the cutting board.",
      "description":""
    },
    {
      "headline":"Heat the amount of vegetable oil on a fraying pan, fry until it sets.",
      "description":""
    },
    {
      "headline":"When the topping ingredients are ready, mix it one by one in a bowl starts from the chilies, then dried shrimp , celery, and last the fried shallots.",
      "description":""
    },
    {
      "headline":"Measure 350 ml coconut milk (out of 850 ml) on a measuring glass then boil it.",
      "description":"Do not forget to stir the coconut milk as you boil it , so it will not ruined."
    },
    {
      "headline":"In a different bowl mix the rice starch and salt.",
      "description":"Add the heated coconut milk(350ml) and the rest of the coconut milk (500ml) little by little and stir it with balloon whisk slowly until it is perfectly mixed."
    },
    {
      "headline":"Pour the dough in a baking pan which is already spread with some oil.",
      "description":"Steam it in a steamer  about 15 minutes in medium heat."
    },
    {
      "headline":"Pour the half of the  topping on the top of the dough, then steam again for another 15 minutes until it sets.",
      "description":""
    },
    {
      "headline":"Gandus cake is ready to serve.",
      "description":""
    }
  ],
  "text":" Prepare the utensils  Prepare the cake and topping ingredients  Slice the shallots ,cut the celery and then cut the chilies on the cutting board.  Heat the amount of vegetable oil on a fraying pan, fry until it sets.  When the topping ingredients are ready, mix it one by one in a bowl starts from the chilies, then dried shrimp , celery, and last the fried shallots.  Measure 350 ml coconut milk (out of 850 ml) on a measuring glass then boil it. Do not forget to stir the coconut milk as you boil it , so it will not ruined. In a different bowl mix the rice starch and salt. Add the heated coconut milk(350ml) and the rest of the coconut milk (500ml) little by little and stir it with balloon whisk slowly until it is perfectly mixed. Pour the dough in a baking pan which is already spread with some oil. Steam it in a steamer  about 15 minutes in medium heat. Pour the half of the  topping on the top of the dough, then steam again for another 15 minutes until it sets.  Gandus cake is ready to serve. ",
  "tyn_model":[
    "coconut milk",
    "celery",
    "chilies",
    "shallots",
    "vegetable oil",
    "fraying pan",
    "bowl",
    "shrimp",
    "measuring glass",
    "rice starch",
    "salt",
    "coconut milk(350ml",
    "balloon whisk",
    "baking pan",
    "oil",
    "steamer"
  ],
  "tyn_section":[

  ]
}