{
  "title":"How to Make Steamed Srikaya Cake",
  "url":"https://www.wikihow.com/Make-Steamed-Srikaya-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes"
  ],
  "parts":[
    {
      "name":"Preparing the coconut milk",
      "steps":[
        {
          "headline":"Choose the source of the coconut milk.",
          "description":"You can either buy it ready-made from a store or make it yourself at home. If making it yourself, just scrape the coconut out of the inside of the shell and mix with water, then squeeze out the coconut milk into a bowl."
        },
        {
          "headline":"Boil the coconut milk in a pan with salt and water until it starts bubbling.",
          "description":"Then remove from the heat and set aside to cool slightly."
        }
      ]
    },
    {
      "name":"Making the cake",
      "steps":[
        {
          "headline":"Beat the eggs and sugar until the sugar has dissolved.",
          "description":"Beat until the solution turns fluffy."
        },
        {
          "headline":"Pour the slightly cooled coconut milk into the egg and sugar mixture.",
          "description":""
        },
        {
          "headline":"Mix all of the ingredients together using a ladle or spoon.",
          "description":"Stir until it thickens."
        },
        {
          "headline":"Once it thickens, pour in the food coloring (green).",
          "description":"Mix well so that the mixture is evenly colored."
        },
        {
          "headline":"Pour the mixture into a mold or pan.",
          "description":"It is now ready for steaming."
        },
        {
          "headline":"Steam the cake in its mold or pan for 30 minutes.",
          "description":""
        },
        {
          "headline":"Finally, you can take out the cake.",
          "description":"Unmold with care, by tipping the cake onto a plate. Slice it into diamond or similar shapes, to make it easy for guests to serve themselves."
        }
      ]
    }
  ],
  "text":" Preparing the coconut milk Choose the source of the coconut milk. You can either buy it ready-made from a store or make it yourself at home. If making it yourself, just scrape the coconut out of the inside of the shell and mix with water, then squeeze out the coconut milk into a bowl. Boil the coconut milk in a pan with salt and water until it starts bubbling. Then remove from the heat and set aside to cool slightly. Making the cake Beat the eggs and sugar until the sugar has dissolved. Beat until the solution turns fluffy. Pour the slightly cooled coconut milk into the egg and sugar mixture.  Mix all of the ingredients together using a ladle or spoon. Stir until it thickens. Once it thickens, pour in the food coloring (green). Mix well so that the mixture is evenly colored. Pour the mixture into a mold or pan. It is now ready for steaming. Steam the cake in its mold or pan for 30 minutes.  Finally, you can take out the cake. Unmold with care, by tipping the cake onto a plate. Slice it into diamond or similar shapes, to make it easy for guests to serve themselves.",
  "tyn_model":[
    "coconut milk",
    "sugar",
    "water",
    "cake",
    "coconut",
    "bowl",
    "pan",
    "salt",
    "eggs",
    "food coloring",
    "plate"
  ],
  "tyn_section":[

  ]
}