{
  "title":"How to Make Ragit Palembang",
  "url":"https://www.wikihow.com/Make-Ragit-Palembang",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Indonesian Dishes"
  ],
  "parts":[
    {
      "name":"Making the Ragit Batter",
      "steps":[
        {
          "headline":"Mix all the Ragit batter ingredients together.",
          "description":"Mix until thoroughly combined."
        },
        {
          "headline":"Scoop up the batter into a ladle with a pouring edge.",
          "description":"Drizzle the batter onto a non-stick frying pan, criss-crossing back and forth to form a shape like a spiderweb. See the image for details."
        }
      ]
    },
    {
      "name":"Making the Coconut Milk Soup for the Ragit",
      "steps":[
        {
          "headline":"Sauté all the ingredients for the soup, apart from the potatoes and coconut milk.",
          "description":"Cook over a low to medium heat until it smells fragrant."
        },
        {
          "headline":"Pour the coconut milk into the sauteed ingredients.",
          "description":"Continue cooking gently."
        },
        {
          "headline":"Add the parboiled potato pieces to the Ragit dressing.",
          "description":"Continue cooking gently."
        },
        {
          "headline":"Stir little by little until the potato pieces are cooked.",
          "description":""
        },
        {
          "headline":"Serve Ragit with Kare while the dressing is still warm.",
          "description":"Either roll up the Ragit and place it in the soup bowl for serving, or place it on a side dish and eat it alongside the soup."
        }
      ]
    }
  ],
  "text":" Making the Ragit Batter Mix all the Ragit batter ingredients together. Mix until thoroughly combined. Scoop up the batter into a ladle with a pouring edge. Drizzle the batter onto a non-stick frying pan, criss-crossing back and forth to form a shape like a spiderweb. See the image for details. Making the Coconut Milk Soup for the Ragit Sauté all the ingredients for the soup, apart from the potatoes and coconut milk. Cook over a low to medium heat until it smells fragrant. Pour the coconut milk into the sauteed ingredients. Continue cooking gently. Add the parboiled potato pieces to the Ragit dressing. Continue cooking gently. Stir little by little until the potato pieces are cooked.  Serve Ragit with Kare while the dressing is still warm. Either roll up the Ragit and place it in the soup bowl for serving, or place it on a side dish and eat it alongside the soup.",
  "tyn_model":[
    "coconut milk",
    "ragit batter",
    "ladle",
    "non-stick frying pan",
    "potatoes",
    "potato",
    "ragit dressing",
    "ragit",
    "soup bowl"
  ],
  "tyn_section":[

  ]
}