{
  "title":"How to Cook Kumbu Palembang",
  "url":"https://www.wikihow.com/Cook-Kumbu-Palembang",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Indonesian Dishes"
  ],
  "methods":[
    {
      "name":"Dough",
      "steps":[
        {
          "headline":"Wash the peas and soak them in water for about 3 hours  to soften the texture.",
          "description":""
        },
        {
          "headline":"Boil the green peas in the medium heat for 30 minutes and add ½ tsp of salt.",
          "description":""
        },
        {
          "headline":"After it has been boiled, mash the green peas and add 200 grams of grounded coconut pulp and 200 grams of sugar and mix them together.",
          "description":""
        },
        {
          "headline":"Sauté the mixture of ingredients for 20 minutes to reduce water caused by the addition of sugar and let it for a moment.",
          "description":""
        },
        {
          "headline":"Fill a molt with the dough, put it to the cutting board and slice it.",
          "description":"It’s ready to serve, or if you want another variant of Kumbu you can make it into different shape and fry it."
        }
      ]
    },
    {
      "name":"Fried Kumbu",
      "steps":[
        {
          "headline":"Prepare the plastic wrap to form the dough.",
          "description":"Grab 2 tbsp of the dough, whirl and press it to be an oval. There will be ± 31 pieces of Kumbu from this ingredients."
        },
        {
          "headline":"Prepare 200 grams of wheat flour, add ¼ tbsp of salt, some water and stir them.",
          "description":""
        },
        {
          "headline":"Put the Kumbu one by one into the mixture of wheat flour and water.",
          "description":""
        },
        {
          "headline":"Get the frying pan ready, set the heat to the medium level and fry them.",
          "description":""
        },
        {
          "headline":"Finally, it's ready to be served..",
          "description":""
        }
      ]
    }
  ],
  "text":" Dough Wash the peas and soak them in water for about 3 hours  to soften the texture.  Boil the green peas in the medium heat for 30 minutes and add ½ tsp of salt.  After it has been boiled, mash the green peas and add 200 grams of grounded coconut pulp and 200 grams of sugar and mix them together.  Sauté the mixture of ingredients for 20 minutes to reduce water caused by the addition of sugar and let it for a moment.  Fill a molt with the dough, put it to the cutting board and slice it. It’s ready to serve, or if you want another variant of Kumbu you can make it into different shape and fry it. Fried Kumbu Prepare the plastic wrap to form the dough. Grab 2 tbsp of the dough, whirl and press it to be an oval. There will be ± 31 pieces of Kumbu from this ingredients. Prepare 200 grams of wheat flour, add ¼ tbsp of salt, some water and stir them.  Put the Kumbu one by one into the mixture of wheat flour and water.  Get the frying pan ready, set the heat to the medium level and fry them.  Finally, it's ready to be served.. ",
  "tyn_model":[
    "water",
    "green peas",
    "salt",
    "sugar",
    "wheat flour",
    "peas",
    "coconut pulp",
    "plastic wrap",
    "frying pan"
  ],
  "tyn_section":[

  ]
}