{
  "title":"How to Make Otak Otak Iwak",
  "url":"https://www.wikihow.com/Make-Otak-Otak-Iwak",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Indonesian Dishes"
  ],
  "parts":[
    {
      "name":"Preparing the spicy fish filling",
      "steps":[
        {
          "headline":"Chop the kucai leaves.",
          "description":"Chop them into small pieces  These leaves are added as the herbs as well as the garnish. If it is difficult to find these leaves, you can substitute them with scallions."
        },
        {
          "headline":"Put the blended/milled fish into the bowl.",
          "description":""
        },
        {
          "headline":"Add the ground garlic and onion.",
          "description":""
        },
        {
          "headline":"Add the salt and the turmeric powder.",
          "description":""
        },
        {
          "headline":"Mix the ingredients together.",
          "description":"This will ensure that the flavors spread evenly throughout the dish."
        },
        {
          "headline":"Place the chopped kucai leaves into the bowl.",
          "description":""
        },
        {
          "headline":"Pour in the coconut milk.",
          "description":""
        },
        {
          "headline":"Add the starch flour little by little.",
          "description":""
        },
        {
          "headline":"Mix the flour.",
          "description":"The spicy fish filling is ready to cook."
        }
      ]
    },
    {
      "name":"Making the banana leaf packages",
      "steps":[
        {
          "headline":"Prepare the banana leaves.",
          "description":"The size of the leaves should be around 20 centimeter (7.9 in) x 20 centimeter (7.9 in). Clean the leaves before use."
        },
        {
          "headline":"Place two large spoonfuls of the spicy fish filling on the banana leaf.",
          "description":""
        },
        {
          "headline":"Roll up the leaf.",
          "description":""
        },
        {
          "headline":"Roll up the opposite side.",
          "description":""
        },
        {
          "headline":"Secure the leaf together at the final open edge by using a toothpick.",
          "description":"Do this for each roll."
        },
        {
          "headline":"The otak-otak iwak packages are ready to steam.",
          "description":""
        }
      ]
    },
    {
      "name":"Steaming",
      "steps":[
        {
          "headline":"Steam the packages in the medium heat for 30 minutes.",
          "description":""
        },
        {
          "headline":"Remove the packages from the steamer when done.",
          "description":""
        },
        {
          "headline":"Put the packages into the pan.",
          "description":""
        },
        {
          "headline":"Grill the packages on low heat for 40 minutes.",
          "description":""
        },
        {
          "headline":"If the leaves have dried and are turning brown, take the packages from the pan.",
          "description":"It's ready."
        },
        {
          "headline":"Plate up.",
          "description":"You should find that you get around 15 pieces to share around."
        },
        {
          "headline":"Serve.",
          "description":"The otak-otak iwak is ready to serve."
        }
      ]
    }
  ],
  "text":" Preparing the spicy fish filling Chop the kucai leaves. Chop them into small pieces  These leaves are added as the herbs as well as the garnish. If it is difficult to find these leaves, you can substitute them with scallions. Put the blended/milled fish into the bowl.  Add the ground garlic and onion.  Add the salt and the turmeric powder.  Mix the ingredients together. This will ensure that the flavors spread evenly throughout the dish. Place the chopped kucai leaves into the bowl.  Pour in the coconut milk.  Add the starch flour little by little.  Mix the flour. The spicy fish filling is ready to cook. Making the banana leaf packages Prepare the banana leaves. The size of the leaves should be around 20 centimeter (7.9 in) x 20 centimeter (7.9 in). Clean the leaves before use. Place two large spoonfuls of the spicy fish filling on the banana leaf.  Roll up the leaf.  Roll up the opposite side.  Secure the leaf together at the final open edge by using a toothpick. Do this for each roll. The otak-otak iwak packages are ready to steam.  Steaming Steam the packages in the medium heat for 30 minutes.  Remove the packages from the steamer when done.  Put the packages into the pan.  Grill the packages on low heat for 40 minutes.  If the leaves have dried and are turning brown, take the packages from the pan. It's ready. Plate up. You should find that you get around 15 pieces to share around. Serve. The otak-otak iwak is ready to serve.",
  "tyn_model":[
    "spicy fish",
    "kucai leaves",
    "bowl",
    "banana leaf",
    "pan",
    "herbs",
    "scallions",
    "garlic",
    "onion",
    "salt",
    "turmeric powder",
    "coconut milk",
    "starch flour",
    "flour",
    "banana leaves",
    "spicy fish filling",
    "toothpick",
    "steamer",
    "otak-otak iwak"
  ],
  "tyn_section":[

  ]
}