{
  "title":"How to Make Model Gandum Khas Palembang",
  "url":"https://www.wikihow.com/Make-Model-Gandum-Khas-Palembang",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Indonesian Dishes"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Boil  the water",
          "description":""
        },
        {
          "headline":"Put the wheat flour into the bowl, add the salt and flavouring,",
          "description":""
        },
        {
          "headline":"Take the warm water into batter and broke the egg and mixing it all together until it’s mix",
          "description":""
        },
        {
          "headline":"Prepare the frying pan",
          "description":""
        },
        {
          "headline":"Make the small shape and cook it until brown",
          "description":""
        },
        {
          "headline":"Take it and serve in the plate",
          "description":"The Pempek Gandum are ready to serve together with Kuah Model."
        }
      ]
    },
    {
      "name":"Making the Soup of “Model”",
      "steps":[
        {
          "headline":"Be sure that you have the ground spices: Five cloves garlic and 4 cloves small onion ( crashed)",
          "description":""
        },
        {
          "headline":"Boiled the water in the pan",
          "description":""
        },
        {
          "headline":"Cook the ground spices  until its flavored .",
          "description":"( around 3-5 minutes)"
        },
        {
          "headline":"Pour the fried ground spices into the pan and stir it well",
          "description":""
        },
        {
          "headline":"Add the slices’s chives, celery and dried mushroom.",
          "description":""
        },
        {
          "headline":"Add the soya’s sauce  and one teaspoon of salt, ½ sugar and flavouring.",
          "description":""
        },
        {
          "headline":"Waits until 5 minutes and the soup is ready.",
          "description":""
        },
        {
          "headline":"Garnish Step for making Model Gandum Khas Palembang",
          "description":""
        },
        {
          "headline":"Slices the wheat’s pempek",
          "description":""
        },
        {
          "headline":"put the pempek into the bowl serving",
          "description":""
        },
        {
          "headline":"Add the sohun, cucumber and fried onion on the top of it",
          "description":""
        },
        {
          "headline":"Pour the soup of model",
          "description":""
        },
        {
          "headline":"Now the Model Gandum is ready to serve",
          "description":""
        },
        {
          "headline":"It is better to serve with kemplang or kerupuk",
          "description":""
        }
      ]
    }
  ],
  "text":" Steps Boil  the water  Put the wheat flour into the bowl, add the salt and flavouring,  Take the warm water into batter and broke the egg and mixing it all together until it’s mix  Prepare the frying pan  Make the small shape and cook it until brown  Take it and serve in the plate The Pempek Gandum are ready to serve together with Kuah Model. Making the Soup of “Model” Be sure that you have the ground spices: Five cloves garlic and 4 cloves small onion ( crashed)  Boiled the water in the pan  Cook the ground spices  until its flavored . ( around 3-5 minutes) Pour the fried ground spices into the pan and stir it well  Add the slices’s chives, celery and dried mushroom.  Add the soya’s sauce  and one teaspoon of salt, ½ sugar and flavouring.  Waits until 5 minutes and the soup is ready.  Garnish Step for making Model Gandum Khas Palembang  Slices the wheat’s pempek  put the pempek into the bowl serving  Add the sohun, cucumber and fried onion on the top of it  Pour the soup of model  Now the Model Gandum is ready to serve  It is better to serve with kemplang or kerupuk ",
  "tyn_model":[
    "water",
    "bowl",
    "salt",
    "wheat flour",
    "frying pan",
    "“model",
    "” be",
    "garlic",
    "small onion",
    "ground spices",
    "slices’s chives",
    "celery",
    "dried mushroom",
    "soya’s sauce",
    "sugar",
    "wheat’s pempek",
    "cucumber",
    "fried onion"
  ],
  "tyn_section":[

  ]
}