{
  "title":"How to Get More Coins in Bejeweled Blitz",
  "url":"https://www.wikihow.com/Get-More-Coins-in-Bejeweled-Blitz",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games"
  ],
  "methods":[
    {
      "name":"Buying Coins",
      "steps":[
        {
          "headline":"Run Bejeweled Blitz.",
          "description":"The game link or shortcut can be accessed from your Facebook News Feed page under the Apps section. Click on the link for the game to load it."
        },
        {
          "headline":"View Coin Balance.",
          "description":"On the header menu of the game, you can see your current Coin Balance. It’s located on the leftmost corner, identified with the gold coin engraved with a diamond."
        },
        {
          "headline":"Select Coins package.",
          "description":"If you’d like to buy some more coins, there are some packages available for purchase using real money. Click on the plus (+) sign beside the Coin Balance menu. The Shop window will appear. Select the Coins tab. Various packages of coins will be displayed together with their corresponding prices. Packages range from 100,000 coins to 9,300,000 coins. Click on the package you want to buy, and then click the “Buy” button below."
        },
        {
          "headline":"Pay your order.",
          "description":"A Facebook window will appear; Facebook is the one that processes your payments. A list of payment options will be displayed, ranging from credit card to PayPal to online banking. Select your payment option and click the “Buy” button. A confirmation message will be displayed by Bejeweled Blitz after your transaction. You should be able to see your coins increased."
        }
      ]
    },
    {
      "name":"Doing the Daily Spin",
      "steps":[
        {
          "headline":"Run Bejeweled Blitz.",
          "description":"The game link or shortcut can be accessed from your Facebook News Feed page under the Apps section. Click on the link for the game to load it."
        },
        {
          "headline":"View Coin Balance.",
          "description":"On the header menu of the game, you can see your current Coin Balance. It’s located on the leftmost corner, identified with the gold coin engraved with a diamond."
        },
        {
          "headline":"Go to Daily Spin.",
          "description":"The Daily Spin is a virtual slot machine that rewards with coins for the game. You are given free turns at it at regular time intervals. From the header menu, look for the Daily Spin menu identified by the name and a picture of a slot machine window; click on this. The Daily Spin window will appear."
        },
        {
          "headline":"Take the Free Spins.",
          "description":"If you have a free spin available, click on the “Free Spin” button that appears. The slot machine will spin. Your updated Coin Balance will be reflected right below it. The time for the next Free spin will be shown. Come back when the time comes to take another spin at it."
        },
        {
          "headline":"Buy Spins.",
          "description":"If you don’t want to wait and want to do some more spins at the virtual slot machine, you can buy Spins. From the Daily Spin window, after taking your free spin, click the “Shop Spin Deals” button. You will be taken to the Shop window, with the Daily Spins tab open. Select the spin deal or package you want to buy, and then click the “Buy” button below."
        },
        {
          "headline":"Pay your order.",
          "description":"A Facebook window will appear; Facebook is the one that processes your payments. A list of payment options will be displayed, ranging from credit card, to PayPal, to online banking. Select your payment option and click the “Buy” button. A confirmation message will be displayed by Bejeweled Blitz after your transaction."
        },
        {
          "headline":"Use your spins.",
          "description":"Go back to the Daily Spin window and use the spins you’ve just bought to increase your Coin Balance."
        }
      ]
    },
    {
      "name":"Playing the Game",
      "steps":[
        {
          "headline":"Run Bejeweled Blitz.",
          "description":"The game link or shortcut can be accessed from your Facebook News Feed page under the Apps section. Click on the link for the game to load it."
        },
        {
          "headline":"Select “Standard.” Once the game loads, you will have to choose the game mode between Standard and Party.",
          "description":"Click on the “Play” button under the Standard mode."
        },
        {
          "headline":"Play now.",
          "description":"When you’re ready, click the “Play Now” button to begin your game. Your game board will load."
        },
        {
          "headline":"Play the game.",
          "description":"Play your game by matching at least three gems in a row. You have one minute to make the highest score you can."
        },
        {
          "headline":"Match special yellow gems.",
          "description":"Once in a while, when you make some good combos and cascades, special yellow gems will appear. You can identify these by the gold coin engraved with a diamond on top of them. When you make matches containing these, 100 coins per special yellow gem matched will be added to your Coin Balance."
        },
        {
          "headline":"Receive coins.",
          "description":"Once you finish a game, depending on your score, you will be awarded with coins. The number of coins awarded will be displayed on the summary screen after your game ends."
        },
        {
          "headline":"Keep on playing.",
          "description":"Continue playing to gain more experience, increase your rankings, and earn more coins."
        }
      ]
    }
  ],
  "text":" Buying Coins Run Bejeweled Blitz. The game link or shortcut can be accessed from your Facebook News Feed page under the Apps section. Click on the link for the game to load it. View Coin Balance. On the header menu of the game, you can see your current Coin Balance. It’s located on the leftmost corner, identified with the gold coin engraved with a diamond. Select Coins package. If you’d like to buy some more coins, there are some packages available for purchase using real money. Click on the plus (+) sign beside the Coin Balance menu. The Shop window will appear. Select the Coins tab. Various packages of coins will be displayed together with their corresponding prices. Packages range from 100,000 coins to 9,300,000 coins. Click on the package you want to buy, and then click the “Buy” button below. Pay your order. A Facebook window will appear; Facebook is the one that processes your payments. A list of payment options will be displayed, ranging from credit card to PayPal to online banking. Select your payment option and click the “Buy” button. A confirmation message will be displayed by Bejeweled Blitz after your transaction. You should be able to see your coins increased. Doing the Daily Spin Run Bejeweled Blitz. The game link or shortcut can be accessed from your Facebook News Feed page under the Apps section. Click on the link for the game to load it. View Coin Balance. On the header menu of the game, you can see your current Coin Balance. It’s located on the leftmost corner, identified with the gold coin engraved with a diamond. Go to Daily Spin. The Daily Spin is a virtual slot machine that rewards with coins for the game. You are given free turns at it at regular time intervals. From the header menu, look for the Daily Spin menu identified by the name and a picture of a slot machine window; click on this. The Daily Spin window will appear. Take the Free Spins. If you have a free spin available, click on the “Free Spin” button that appears. The slot machine will spin. Your updated Coin Balance will be reflected right below it. The time for the next Free spin will be shown. Come back when the time comes to take another spin at it. Buy Spins. If you don’t want to wait and want to do some more spins at the virtual slot machine, you can buy Spins. From the Daily Spin window, after taking your free spin, click the “Shop Spin Deals” button. You will be taken to the Shop window, with the Daily Spins tab open. Select the spin deal or package you want to buy, and then click the “Buy” button below. Pay your order. A Facebook window will appear; Facebook is the one that processes your payments. A list of payment options will be displayed, ranging from credit card, to PayPal, to online banking. Select your payment option and click the “Buy” button. A confirmation message will be displayed by Bejeweled Blitz after your transaction. Use your spins. Go back to the Daily Spin window and use the spins you’ve just bought to increase your Coin Balance. Playing the Game Run Bejeweled Blitz. The game link or shortcut can be accessed from your Facebook News Feed page under the Apps section. Click on the link for the game to load it. Select “Standard.” Once the game loads, you will have to choose the game mode between Standard and Party. Click on the “Play” button under the Standard mode. Play now. When you’re ready, click the “Play Now” button to begin your game. Your game board will load. Play the game. Play your game by matching at least three gems in a row. You have one minute to make the highest score you can. Match special yellow gems. Once in a while, when you make some good combos and cascades, special yellow gems will appear. You can identify these by the gold coin engraved with a diamond on top of them. When you make matches containing these, 100 coins per special yellow gem matched will be added to your Coin Balance. Receive coins. Once you finish a game, depending on your score, you will be awarded with coins. The number of coins awarded will be displayed on the summary screen after your game ends. Keep on playing. Continue playing to gain more experience, increase your rankings, and earn more coins.",
  "tyn_model":[
    "” button",
    "bejeweled blitz",
    "“buy",
    "slot machine",
    "spins",
    "“play",
    "coins",
    "daily spin",
    "“free",
    "“shop",
    "“standard",
    "” once",
    "game board",
    "gems"
  ],
  "tyn_section":[

  ]
}