{
  "title":"How to Make Butternut Squash Puree",
  "url":"https://www.wikihow.com/Make-Butternut-Squash-Puree",
  "category_hierarchy":[
    "Food and Entertaining",
    "Cooking for Children",
    "Baby Recipes"
  ],
  "methods":[
    {
      "name":"Boiling",
      "steps":[
        {
          "headline":"Cut the squash in half using a strong knife.",
          "description":"Remove the seeds, peel, and dice into even-sized pieces."
        },
        {
          "headline":"Boil the squash in a saucepan filled about halfway with water.",
          "description":"Bring the water back to a boil after the squash has been added. Simmer for about 8 to 10 minutes or until the squash is soft. Remove the pan from the heat and drain the water."
        },
        {
          "headline":"Use a fork to mash the squash with some unsalted butter.",
          "description":""
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    },
    {
      "name":"Baking",
      "steps":[
        {
          "headline":"Cut the squash in half using a strong knife.",
          "description":"Remove the seeds with a spoon."
        },
        {
          "headline":"Bake the squash in the oven at 380°F (190°C) for about 1 hour until browned, for a more intense and caramelized flavor.",
          "description":""
        },
        {
          "headline":"Using a spoon, scoop squash in a food processor and process until smooth.",
          "description":"You can add salt to taste and 1 teaspoon brown sugar (optional)."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Boiling Cut the squash in half using a strong knife. Remove the seeds, peel, and dice into even-sized pieces. Boil the squash in a saucepan filled about halfway with water. Bring the water back to a boil after the squash has been added. Simmer for about 8 to 10 minutes or until the squash is soft. Remove the pan from the heat and drain the water. Use a fork to mash the squash with some unsalted butter.  Finished.  Baking Cut the squash in half using a strong knife. Remove the seeds with a spoon. Bake the squash in the oven at 380°F (190°C) for about 1 hour until browned, for a more intense and caramelized flavor.  Using a spoon, scoop squash in a food processor and process until smooth. You can add salt to taste and 1 teaspoon brown sugar (optional). Finished. ",
  "tyn_model":[
    "water",
    "spoon",
    "squash",
    "saucepan",
    "pan",
    "fork",
    "unsalted butter",
    "oven",
    "food processor",
    "salt",
    "brown sugar"
  ],
  "tyn_section":[

  ]
}