{
  "title":"How to Contact Sony About PlayStation 3 Problems",
  "url":"https://www.wikihow.com/Contact-Sony-About-PlayStation-3-Problems",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PlayStation Video Game Consoles",
    "PlayStation 3"
  ],
  "steps":[
    {
      "headline":"Call Sony over the phone.",
      "description":"If you live within the United States, you'll need to call 1-800-345-7669(or in the United Kingdom, feel free to call 0207 365 2810. For countries outside the US, you'll need to look a little harder, as support numbers vary. Open this support page find your country, then look over to the right of the web form to find your contact numbers for Sony Support for your product."
    },
    {
      "headline":"Contact Sony through one of the other methods from the PlayStation website.",
      "description":"They have a chat feature, and a self-help feature for finding answers to your questions without getting needless others involved when they shouldn't be involved."
    },
    {
      "headline":"Contact Sony through one of the two main social media platforms they own.",
      "description":"Tweet your issue directly to Sony. It is also worth messaging them on Facebook although response time is generally slower there than it is on Twitter."
    },
    {
      "headline":"Browse the PlayStation forum for answers and help with your issue.",
      "description":"This is where PlayStation users come to discuss problems they have had so you may well be able to find help from someone who has had the same issue as you."
    }
  ],
  "text":" Call Sony over the phone. If you live within the United States, you'll need to call 1-800-345-7669(or in the United Kingdom, feel free to call 0207 365 2810. For countries outside the US, you'll need to look a little harder, as support numbers vary. Open this support page find your country, then look over to the right of the web form to find your contact numbers for Sony Support for your product. Contact Sony through one of the other methods from the PlayStation website. They have a chat feature, and a self-help feature for finding answers to your questions without getting needless others involved when they shouldn't be involved. Contact Sony through one of the two main social media platforms they own. Tweet your issue directly to Sony. It is also worth messaging them on Facebook although response time is generally slower there than it is on Twitter. Browse the PlayStation forum for answers and help with your issue. This is where PlayStation users come to discuss problems they have had so you may well be able to find help from someone who has had the same issue as you.",
  "tyn_model":[
    "sony",
    "playstation forum"
  ],
  "tyn_section":[

  ]
}