{
  "title":"How to Set Up a Basic C1 or C2 Wormhole Camp in EVE Online",
  "url":"https://www.wikihow.com/Set-Up-a-Basic-C1-or-C2-Wormhole-Camp-in-EVE-Online",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Role Playing Games"
  ],
  "methods":[
    {
      "name":"Scouting",
      "steps":[
        {
          "headline":"Grab a covert ops, such as a Helios or Anathema, and place a combat probe launcher in one of the high slots.",
          "description":""
        },
        {
          "headline":"Scan down a wormhole, preferably in low sec.",
          "description":"High security systems tend to have a lot of traffic, and can have unwanted visitors and/or inhabitants in their wormholes. Look at the color of the wormhole on the inside. If it's red, leave it behind, but if it's a blue-green, then it may be a C1 or C2."
        },
        {
          "headline":"Enter the wormhole and bookmark it.",
          "description":"This is very important! After bookmarking the wormhole, warp to a planet (do not warp to a moon because an inhabitant may have a POS located on it) and drop a bookmark halfway. Warp to the bookmark, launch probes, and cloak; remember to run d-scans as you travel through the system."
        },
        {
          "headline":"Run a system-wide sweep with your probes and see what kinds of results you return.",
          "description":"Watch out for ships and POS modules. If you locate a POS, check if it is online or not by turning force fields on on your overview and running a d-scan within range of the tower. There should be no force field and no inhabitants. If there is someone living inside, then quickly hop out and find another hole."
        }
      ]
    },
    {
      "name":"Setting Up Base",
      "steps":[
        {
          "headline":"Grab a set of specialized industrials and a POS tower.",
          "description":"For a C1 wormhole, you should use a small tower, and for a C2 a medium, or if you've got loads of extra money, a large faction should do fine, such as minmatar or amarr towers. Have your scout remain in the hole and direct the industrials to a fresh moon and have them cloak when it's not their shift. For equipment, bring the following:\nCorporate Hangar Array\nDefense batteries (don't bother with e-war batteries unless you know what you're doing with them.) Ship Assembly Array\nAround two sleeper site running ships\nGas ventures and replacements\nScout ships with strong probes for tracking down intruders\nCombat ships (t2/faction cruisers with frig support. Try the Deimos, Vigilant, Ashimmu, Curse, Zealot, and Gila.) Industrials\nPI equipment"
        },
        {
          "headline":"Drop the tower and have the industrials re-cloak.",
          "description":"Begin onlining the tower and have your scout continue to run sweeps. Fuel it and set a force field password."
        },
        {
          "headline":"Have the other industrials unload and anchor the remaining modules.",
          "description":""
        },
        {
          "headline":"Before running sites or doing anything outside of the bubble, have each member remain online and in the bubble for another 2 hours or so.",
          "description":"This is to ensure that you didn't stumble into someone's trap; some WH dwellers will wait for a tower to online only to hold the inhabitants hostage for a payment. Do not give into the payment unless it vastly under the prices of your tower and module cost. If you get caught, simply haul your equipment away when they go offline. (Use your watchlist!)"
        }
      ]
    }
  ],
  "text":" Scouting Grab a covert ops, such as a Helios or Anathema, and place a combat probe launcher in one of the high slots.  Scan down a wormhole, preferably in low sec. High security systems tend to have a lot of traffic, and can have unwanted visitors and/or inhabitants in their wormholes. Look at the color of the wormhole on the inside. If it's red, leave it behind, but if it's a blue-green, then it may be a C1 or C2. Enter the wormhole and bookmark it. This is very important! After bookmarking the wormhole, warp to a planet (do not warp to a moon because an inhabitant may have a POS located on it) and drop a bookmark halfway. Warp to the bookmark, launch probes, and cloak; remember to run d-scans as you travel through the system. Run a system-wide sweep with your probes and see what kinds of results you return. Watch out for ships and POS modules. If you locate a POS, check if it is online or not by turning force fields on on your overview and running a d-scan within range of the tower. There should be no force field and no inhabitants. If there is someone living inside, then quickly hop out and find another hole. Setting Up Base Grab a set of specialized industrials and a POS tower. For a C1 wormhole, you should use a small tower, and for a C2 a medium, or if you've got loads of extra money, a large faction should do fine, such as minmatar or amarr towers. Have your scout remain in the hole and direct the industrials to a fresh moon and have them cloak when it's not their shift. For equipment, bring the following:\nCorporate Hangar Array\nDefense batteries (don't bother with e-war batteries unless you know what you're doing with them.) Ship Assembly Array\nAround two sleeper site running ships\nGas ventures and replacements\nScout ships with strong probes for tracking down intruders\nCombat ships (t2/faction cruisers with frig support. Try the Deimos, Vigilant, Ashimmu, Curse, Zealot, and Gila.) Industrials\nPI equipment Drop the tower and have the industrials re-cloak. Begin onlining the tower and have your scout continue to run sweeps. Fuel it and set a force field password. Have the other industrials unload and anchor the remaining modules.  Before running sites or doing anything outside of the bubble, have each member remain online and in the bubble for another 2 hours or so. This is to ensure that you didn't stumble into someone's trap; some WH dwellers will wait for a tower to online only to hold the inhabitants hostage for a payment. Do not give into the payment unless it vastly under the prices of your tower and module cost. If you get caught, simply haul your equipment away when they go offline. (Use your watchlist!)",
  "tyn_model":[
    "probes",
    "scout",
    "combat probe",
    "e-war batteries",
    "industrials",
    "tower",
    "equipment"
  ],
  "tyn_section":[

  ]
}