{
  "title":"How to Manage Albums in Canon Image Gateway",
  "url":"https://www.wikihow.com/Manage-Albums-in-Canon-Image-Gateway",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photographs",
    "Photo Albums"
  ],
  "parts":[
    {
      "name":"Creating an Album",
      "steps":[
        {
          "headline":"Log into your CIG account.",
          "description":"Go to Canon’s website and log into Canon Image Gateway."
        },
        {
          "headline":"Go to Album.",
          "description":"On the header of the Canon Image Gateway Photo Album are two buttons, for Library and for Album. Click the “Album” button, and you will be brought to the Albums page."
        },
        {
          "headline":"Create an album.",
          "description":"Click the “Create Album” button on the subheader menu to create a new album. You will be brought to a blank template for an Album."
        },
        {
          "headline":"Name the album.",
          "description":"On the left side of the page are the album details. Enter the album’s title on the first field with the red asterisk."
        },
        {
          "headline":"Enter a comment.",
          "description":"Under the album’s title is a big blank text field. Enter your notes or comments for the album here. This is optional."
        }
      ]
    },
    {
      "name":"Populating the Album",
      "steps":[
        {
          "headline":"Identify the album space.",
          "description":"On the right side of the page is where you put the photos to be included in this album."
        },
        {
          "headline":"Select photos.",
          "description":"All the photos in your library can be found on the bottom panel. Use the horizontal scroll bar to go left and right through the photos. Click the ones you want to be added to the album. The selected photos will appear inside a highlighted box."
        },
        {
          "headline":"Add photos to the album.",
          "description":"Drag the selected photos upward to the empty space, and drop them there. The photos will now show inside the album space in thumbnails."
        },
        {
          "headline":"Set the album cover.",
          "description":"If you want to set an album cover from one of the album photos, select the photo, drag it over to the box on the topmost left of the page, and drop it there. The photo will now appear inside the box and will be used as the album cover photo."
        },
        {
          "headline":"Save the album.",
          "description":"Click the red “Create” button on the bottom middle bar to create the album, along with all the photos you’ve put inside it."
        }
      ]
    },
    {
      "name":"Uploading Photos to the Album",
      "steps":[
        {
          "headline":"Go to Album.",
          "description":"On the header of the Canon Image Gateway Photo Album are two buttons, for Library and for Album. Click the “Album” button, and you will be brought to the Albums page."
        },
        {
          "headline":"Select the album.",
          "description":"From the list of albums, click the one where you want put the uploaded photos. The album will load with all the pictures inside it in thumbnails."
        },
        {
          "headline":"Add images to this album.",
          "description":"On the album header are three buttons. Click the one on the right titled “Add images to this album.” A new window will be opened in your web browser."
        },
        {
          "headline":"Select the photos to upload.",
          "description":"Go to the section titled “Upload without the utility (Still images only).” Click the “Upload” button under it, and a file explorer window will open with your file directory. Navigate through your files and select the photos you’d like to upload. The selected photos will be listed in the box below the “Upload” button."
        },
        {
          "headline":"Start the upload.",
          "description":"Scroll to the bottom of the page and click the “Start Upload” button. The selected photos will be uploaded. You can view the upload progress on the screen."
        },
        {
          "headline":"View photos.",
          "description":"Once the upload is completed, you can now see the uploaded photos inside the selected album."
        }
      ]
    },
    {
      "name":"Editing the Album",
      "steps":[
        {
          "headline":"Go to Album.",
          "description":"On the header of the Canon Image Gateway Photo Album are two buttons, for Library and for Album. Click the “Album” button, and you will be brought to the Albums page."
        },
        {
          "headline":"Select the album.",
          "description":"From the list of albums, click the one where you want put the uploaded photos. The album will load with all the pictures inside it in thumbnails."
        },
        {
          "headline":"Edit the album.",
          "description":"On the album header are three buttons. Click the one on the left titled “Edit Album.” The selected album will be opened for editing."
        },
        {
          "headline":"Change the album title.",
          "description":"On the left side of the page are the album details. Modify the album’s title on the first field with the red asterisk."
        },
        {
          "headline":"Change the comment.",
          "description":"Under the album’s title is the comment field. Modify your notes or comments for the album here. This is optional."
        },
        {
          "headline":"Change the album cover.",
          "description":"If you want to change the album cover, select the photo from the right, drag it over to the box on the topmost left of the page, and drop it there. The new photo will appear inside the box and will be used as the album cover photo. If you want to remove the album cover totally, click the “Clear Cover Image” link beside the album cover. The album cover will become empty."
        },
        {
          "headline":"Delete photos from the album.",
          "description":"On the right side of the page is where all the photos under the album are displayed in thumbnails. Hover over the photo you’d like to remove from the album, and a small red circle with an “X” will appear on the upper right corner of the photo. Click on this icon to remove the photo."
        },
        {
          "headline":"Add more photos to the album.",
          "description":"All the photos in your library can be found on the bottom panel. Use the horizontal scroll bar to go left and right through the photos. Click the ones you want to be added to the album. Selected photos will appear inside a highlighted box. Drag the selected photos upward to the album area and drop them there. The new photos will now be added to the album and will be displayed in thumbnails."
        },
        {
          "headline":"Delete the whole album.",
          "description":"If you want to delete this album, click on the trash bin icon beside the album cover area on the upper left corner of the page. The whole album will be deleted and you will be brought back to the Albums page. Skip this step if you don’t need to delete the album."
        }
      ]
    },
    {
      "name":"Downloading the Album",
      "steps":[
        {
          "headline":"Go to Album.",
          "description":"On the header of the Canon Image Gateway Photo Album are two buttons, for Library and for Album. Click the “Album” button, and you will be brought to the Albums page."
        },
        {
          "headline":"Select the album.",
          "description":"From the list of albums, click the one where you want put the uploaded photos. The album will load with all the pictures inside it in thumbnails."
        },
        {
          "headline":"Download the album.",
          "description":"On the album header are three buttons. Click the one in the middle titled “Download Album.”"
        },
        {
          "headline":"Select photos to download.",
          "description":"The Album Plugin Utility will load, and the selected album and all its photos will be shown. Ensure that the photos you want to be downloaded are ticked."
        },
        {
          "headline":"Download images.",
          "description":"Once your selection is complete, click the “Download images” button on the lower right corner. Identify the destination folder on your computer then wait for the download to finish. A progress dialog box will appear."
        },
        {
          "headline":"View photos.",
          "description":"Once the download is completed, you can now access your photos directly from your computer."
        }
      ]
    }
  ],
  "text":" Creating an Album Log into your CIG account. Go to Canon’s website and log into Canon Image Gateway. Go to Album. On the header of the Canon Image Gateway Photo Album are two buttons, for Library and for Album. Click the “Album” button, and you will be brought to the Albums page. Create an album. Click the “Create Album” button on the subheader menu to create a new album. You will be brought to a blank template for an Album. Name the album. On the left side of the page are the album details. Enter the album’s title on the first field with the red asterisk. Enter a comment. Under the album’s title is a big blank text field. Enter your notes or comments for the album here. This is optional. Populating the Album Identify the album space. On the right side of the page is where you put the photos to be included in this album. Select photos. All the photos in your library can be found on the bottom panel. Use the horizontal scroll bar to go left and right through the photos. Click the ones you want to be added to the album. The selected photos will appear inside a highlighted box. Add photos to the album. Drag the selected photos upward to the empty space, and drop them there. The photos will now show inside the album space in thumbnails. Set the album cover. If you want to set an album cover from one of the album photos, select the photo, drag it over to the box on the topmost left of the page, and drop it there. The photo will now appear inside the box and will be used as the album cover photo. Save the album. Click the red “Create” button on the bottom middle bar to create the album, along with all the photos you’ve put inside it. Uploading Photos to the Album Go to Album. On the header of the Canon Image Gateway Photo Album are two buttons, for Library and for Album. Click the “Album” button, and you will be brought to the Albums page. Select the album. From the list of albums, click the one where you want put the uploaded photos. The album will load with all the pictures inside it in thumbnails. Add images to this album. On the album header are three buttons. Click the one on the right titled “Add images to this album.” A new window will be opened in your web browser. Select the photos to upload. Go to the section titled “Upload without the utility (Still images only).” Click the “Upload” button under it, and a file explorer window will open with your file directory. Navigate through your files and select the photos you’d like to upload. The selected photos will be listed in the box below the “Upload” button. Start the upload. Scroll to the bottom of the page and click the “Start Upload” button. The selected photos will be uploaded. You can view the upload progress on the screen. View photos. Once the upload is completed, you can now see the uploaded photos inside the selected album. Editing the Album Go to Album. On the header of the Canon Image Gateway Photo Album are two buttons, for Library and for Album. Click the “Album” button, and you will be brought to the Albums page. Select the album. From the list of albums, click the one where you want put the uploaded photos. The album will load with all the pictures inside it in thumbnails. Edit the album. On the album header are three buttons. Click the one on the left titled “Edit Album.” The selected album will be opened for editing. Change the album title. On the left side of the page are the album details. Modify the album’s title on the first field with the red asterisk. Change the comment. Under the album’s title is the comment field. Modify your notes or comments for the album here. This is optional. Change the album cover. If you want to change the album cover, select the photo from the right, drag it over to the box on the topmost left of the page, and drop it there. The new photo will appear inside the box and will be used as the album cover photo. If you want to remove the album cover totally, click the “Clear Cover Image” link beside the album cover. The album cover will become empty. Delete photos from the album. On the right side of the page is where all the photos under the album are displayed in thumbnails. Hover over the photo you’d like to remove from the album, and a small red circle with an “X” will appear on the upper right corner of the photo. Click on this icon to remove the photo. Add more photos to the album. All the photos in your library can be found on the bottom panel. Use the horizontal scroll bar to go left and right through the photos. Click the ones you want to be added to the album. Selected photos will appear inside a highlighted box. Drag the selected photos upward to the album area and drop them there. The new photos will now be added to the album and will be displayed in thumbnails. Delete the whole album. If you want to delete this album, click on the trash bin icon beside the album cover area on the upper left corner of the page. The whole album will be deleted and you will be brought back to the Albums page. Skip this step if you don’t need to delete the album. Downloading the Album Go to Album. On the header of the Canon Image Gateway Photo Album are two buttons, for Library and for Album. Click the “Album” button, and you will be brought to the Albums page. Select the album. From the list of albums, click the one where you want put the uploaded photos. The album will load with all the pictures inside it in thumbnails. Download the album. On the album header are three buttons. Click the one in the middle titled “Download Album.” Select photos to download. The Album Plugin Utility will load, and the selected album and all its photos will be shown. Ensure that the photos you want to be downloaded are ticked. Download images. Once your selection is complete, click the “Download images” button on the lower right corner. Identify the destination folder on your computer then wait for the download to finish. A progress dialog box will appear. View photos. Once the download is completed, you can now access your photos directly from your computer.",
  "tyn_model":[
    "” button",
    "photos",
    "“album",
    "album",
    "canon image gateway photo album",
    "images",
    "“upload",
    "“create",
    "“download",
    "canon image gateway",
    "“add",
    "” a",
    "web browser",
    "” click",
    "file explorer window",
    "“start",
    "“edit",
    "” the",
    "“clear",
    "” link",
    "“x",
    "” will",
    "” select",
    "album plugin utility"
  ],
  "tyn_section":[

  ]
}