{
  "title":"How to Make Halloween Eyeball Cupcakes",
  "url":"https://www.wikihow.com/Make-Halloween-Eyeball-Cupcakes",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Cupcakes"
  ],
  "steps":[
    {
      "headline":"Begin by finding a recipe for plain cupcakes or buns.",
      "description":"Add in red, yellow, black and/or orange food colouring to the mixture before you bake them, so that they're a Halloween colour."
    },
    {
      "headline":"Make the cupcakes and leave to cool.",
      "description":""
    },
    {
      "headline":"Put the cooled cupcakes on a tray you don't mind getting dirty (you can always wash off the icing).",
      "description":""
    },
    {
      "headline":"Cut the white fondant into the shape of a circle.",
      "description":"This circle should be large enough to cover the top of the cupcake."
    },
    {
      "headline":"Cut the black fondant into a smaller circle.",
      "description":"This completes the eyeball pieces."
    },
    {
      "headline":"Place the fondant pieces on top of each other and press them together.",
      "description":""
    },
    {
      "headline":"Stick the fondant circles onto your cupcake.",
      "description":"Use icing to attach the fondant to the cupcake."
    },
    {
      "headline":"Repeat for each cupcake.",
      "description":""
    },
    {
      "headline":"Draw red lines from the red writing icing.",
      "description":"Draw the lines extending from the black fondant \"pupil\" circle to the edge of the white fondant. These are \"bloody\" lines on the eyeball to represent some Halloween gore. Repeat for each cupcake."
    },
    {
      "headline":"Add your own personal decorations.",
      "description":"This might be edible or plastic cupcake toppers themed in a Halloween way. Or, the cupcakes are fine as they are, just plain eyeballs. Spooky Halloween treat completed."
    },
    {
      "headline":"Serve and enjoy!",
      "description":""
    }
  ],
  "text":" Begin by finding a recipe for plain cupcakes or buns. Add in red, yellow, black and/or orange food colouring to the mixture before you bake them, so that they're a Halloween colour. Make the cupcakes and leave to cool.  Put the cooled cupcakes on a tray you don't mind getting dirty (you can always wash off the icing).  Cut the white fondant into the shape of a circle. This circle should be large enough to cover the top of the cupcake. Cut the black fondant into a smaller circle. This completes the eyeball pieces. Place the fondant pieces on top of each other and press them together.  Stick the fondant circles onto your cupcake. Use icing to attach the fondant to the cupcake. Repeat for each cupcake.  Draw red lines from the red writing icing. Draw the lines extending from the black fondant \"pupil\" circle to the edge of the white fondant. These are \"bloody\" lines on the eyeball to represent some Halloween gore. Repeat for each cupcake. Add your own personal decorations. This might be edible or plastic cupcake toppers themed in a Halloween way. Or, the cupcakes are fine as they are, just plain eyeballs. Spooky Halloween treat completed. Serve and enjoy! ",
  "tyn_model":[
    "fondant",
    "icing",
    "food colouring",
    "tray",
    "red writing"
  ],
  "tyn_section":[

  ]
}