{
  "title":"How to Make Cinnamon Apple Strips",
  "url":"https://www.wikihow.com/Make-Cinnamon-Apple-Strips",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Desserts and Sweets",
    "Fruit Desserts"
  ],
  "steps":[
    {
      "headline":"Purchase your ingredients.",
      "description":"Choose your apple wisely. Make sure none of the apples are bruised. Look closely for any bumps or blemishes. Damaged apples may affect the taste of your finished product. Make sure that your cinnamon is of good quality and is in good condition."
    },
    {
      "headline":"Remove the apple skin.",
      "description":"The apple skin is unneeded for this recipe. Throw the apple skin away or eat it as a snack while you cook."
    },
    {
      "headline":"Wash the peeled apples.",
      "description":"Place them under the tap and turn on the cold water only. If you use hot water, your apples may disintegrate. Rinse for 1-2 minutes and then place them in your work area."
    },
    {
      "headline":"Cut your apples into strips.",
      "description":"Remember you want your apple slices to be thick. Cut them approximately 1–2 centimeters (0.4–0.8 in) thick until you reach the core. Then start on another apple."
    },
    {
      "headline":"Place your apple strips into a cooking pot.",
      "description":"Add 100 ml of water into the pot. Stir for half a minute."
    },
    {
      "headline":"Turn on the heat.",
      "description":"Turn to gas mark 130. While stirring add 2-4 teaspoons of cinnamon, depending on personal preference. Also, add 2 tablespoons of sugar to the mixture. Cook until golden brown."
    },
    {
      "headline":"Put everything in a bowl and leave to cool.",
      "description":"Empty the contents of the pot into a bowl and leave to cool for 5 more minutes."
    },
    {
      "headline":"Eat and enjoy!",
      "description":"When cool, get a fork and tuck into your delicious Cinnamon Apple Strips!"
    }
  ],
  "text":" Purchase your ingredients. Choose your apple wisely. Make sure none of the apples are bruised. Look closely for any bumps or blemishes. Damaged apples may affect the taste of your finished product. Make sure that your cinnamon is of good quality and is in good condition. Remove the apple skin. The apple skin is unneeded for this recipe. Throw the apple skin away or eat it as a snack while you cook. Wash the peeled apples. Place them under the tap and turn on the cold water only. If you use hot water, your apples may disintegrate. Rinse for 1-2 minutes and then place them in your work area. Cut your apples into strips. Remember you want your apple slices to be thick. Cut them approximately 1–2 centimeters (0.4–0.8 in) thick until you reach the core. Then start on another apple. Place your apple strips into a cooking pot. Add 100 ml of water into the pot. Stir for half a minute. Turn on the heat. Turn to gas mark 130. While stirring add 2-4 teaspoons of cinnamon, depending on personal preference. Also, add 2 tablespoons of sugar to the mixture. Cook until golden brown. Put everything in a bowl and leave to cool. Empty the contents of the pot into a bowl and leave to cool for 5 more minutes. Eat and enjoy! When cool, get a fork and tuck into your delicious Cinnamon Apple Strips!",
  "tyn_model":[
    "water",
    "apples",
    "cinnamon",
    "bowl",
    "apple",
    "tap",
    "cooking pot",
    "sugar",
    "pot",
    "fork",
    "cinnamon apple strips"
  ],
  "tyn_section":[

  ]
}