{
  "title":"How to Make Fisherman's Pie",
  "url":"https://www.wikihow.com/Make-Fisherman%27s-Pie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood"
  ],
  "steps":[
    {
      "headline":"Cook the fish.",
      "description":"Stud the onion with the cloves. Put it into a large pan with the bay leaf, 450ml of the milk, the cream and the cod. Place the pan on the stove bring to the boil and simmer for 8 minutes."
    },
    {
      "headline":"Remove the fish from the pan.",
      "description":"Lift it out of the pan with a slotted spoon and place it on a plate for it to cool. Strain the liquid through a sieve into a bowl or jug."
    },
    {
      "headline":"Break the fish up into large flakes.",
      "description":"Discard the bones and skin of the fish."
    },
    {
      "headline":"Sprinkle the fish pieces over the bottom of the oven proof dish.",
      "description":""
    },
    {
      "headline":"Slice the eggs and place them on top of the fish.",
      "description":""
    },
    {
      "headline":"Melt the butter in a pan and add the flour to the pan.",
      "description":"Cook both ingredients together for a minute."
    },
    {
      "headline":"Make the sauce by adding the milk mixture into the pan.",
      "description":"Stir at a constant rate to avoid lumps forming. Let it cook for about 5 to 6 minutes."
    },
    {
      "headline":"Add chopped parsley, nutmeg, and salt & pepper to the pan to finish the sauce.",
      "description":""
    },
    {
      "headline":"Pour the sauce over the fish and egg mixture.",
      "description":"Leave it alone for it to cool."
    },
    {
      "headline":"Cook the potatoes.",
      "description":"Place the peeled potatoes in a pan, cover with water, add salt, bring it to a boil, and simmer for about 20 minutes or until the potatoes are soft."
    },
    {
      "headline":"Drain and mash the potatoes until there are no lumps.",
      "description":""
    },
    {
      "headline":"Add the rest of the butter, egg yolk, salt, and pepper to the potatoes.",
      "description":"Gradually add the rest of the milk until you have a soft and spreadable mixture."
    },
    {
      "headline":"Pre-heat the oven to 200 °C (392 °F) or on gas mark 6.",
      "description":""
    },
    {
      "headline":"Spoon the potato mixture over the fish mixture and spread it with a fork.",
      "description":""
    },
    {
      "headline":"Bake the mixture for 35 to 40 minutes or until golden brown.",
      "description":""
    },
    {
      "headline":"Serve and enjoy.",
      "description":""
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Cook the fish. Stud the onion with the cloves. Put it into a large pan with the bay leaf, 450ml of the milk, the cream and the cod. Place the pan on the stove bring to the boil and simmer for 8 minutes. Remove the fish from the pan. Lift it out of the pan with a slotted spoon and place it on a plate for it to cool. Strain the liquid through a sieve into a bowl or jug. Break the fish up into large flakes. Discard the bones and skin of the fish. Sprinkle the fish pieces over the bottom of the oven proof dish.  Slice the eggs and place them on top of the fish.  Melt the butter in a pan and add the flour to the pan. Cook both ingredients together for a minute. Make the sauce by adding the milk mixture into the pan. Stir at a constant rate to avoid lumps forming. Let it cook for about 5 to 6 minutes. Add chopped parsley, nutmeg, and salt & pepper to the pan to finish the sauce.  Pour the sauce over the fish and egg mixture. Leave it alone for it to cool. Cook the potatoes. Place the peeled potatoes in a pan, cover with water, add salt, bring it to a boil, and simmer for about 20 minutes or until the potatoes are soft. Drain and mash the potatoes until there are no lumps.  Add the rest of the butter, egg yolk, salt, and pepper to the potatoes. Gradually add the rest of the milk until you have a soft and spreadable mixture. Pre-heat the oven to 200 °C (392 °F) or on gas mark 6.  Spoon the potato mixture over the fish mixture and spread it with a fork.  Bake the mixture for 35 to 40 minutes or until golden brown.  Serve and enjoy.  Finished. ",
  "tyn_model":[
    "potatoes",
    "milk",
    "fish",
    "butter",
    "pan",
    "salt",
    "onion",
    "cloves",
    "large pan",
    "bay leaf",
    "cream",
    "cod",
    "stove",
    "slotted spoon",
    "plate",
    "sieve",
    "bowl",
    "jug",
    "oven proof dish",
    "eggs",
    "flour",
    "parsley",
    "nutmeg",
    "salt & pepper",
    "water",
    "egg",
    "pepper",
    "oven",
    "potato",
    "fork"
  ],
  "tyn_section":[

  ]
}