{
  "title":"How to Make Crayon Candles Using the Microwave",
  "url":"https://www.wikihow.com/Make-Crayon-Candles-Using-the-Microwave",
  "category_hierarchy":[
    "Home and Garden",
    "Lighting",
    "Candles"
  ],
  "steps":[
    {
      "headline":"Take a wick.",
      "description":"Tie it onto a thin dowel or long matchstick and dangle it down into the glass candle jar."
    },
    {
      "headline":"Grab the colored crayons, stubs and all.",
      "description":"Peel off their covers. Break each crayon into four pieces, if they're not already stubs. Sort into their respective colors."
    },
    {
      "headline":"Set up a row of disposable cups.",
      "description":"In each cup, put the four pieces of crayon of the same color. Then, fill up each cup with the candle wax."
    },
    {
      "headline":"Place the first cup in the microwave.",
      "description":"Set the time for 2 minutes and 20 seconds. Do the same with the rest of the cups."
    },
    {
      "headline":"Carefully take out the cup from microwave.",
      "description":"It will be very hot and hot wax spilled on skin can burn, so take great care. Stir the mixture with a craft or popsicle stick."
    },
    {
      "headline":"Allow  the wax to cool down for a little, then pour it into the candle holder.",
      "description":"Check that the wick has stayed centered."
    },
    {
      "headline":"Let the waxes set in the jar.",
      "description":"Do the same with the other waxes, adding the next layer after the former one has properly set. As you go, each layer will form a beautiful layered effect, creating a rainbow style candle. Once you have added all of the wax and the layers are stuck together, the candle is almost ready."
    },
    {
      "headline":"Snip off the wick to a suitable height and remove the stick holding it.",
      "description":"Discard the leftover wick piece."
    },
    {
      "headline":"Done.",
      "description":"The candle can now be used or given as a gift."
    }
  ],
  "text":" Take a wick. Tie it onto a thin dowel or long matchstick and dangle it down into the glass candle jar. Grab the colored crayons, stubs and all. Peel off their covers. Break each crayon into four pieces, if they're not already stubs. Sort into their respective colors. Set up a row of disposable cups. In each cup, put the four pieces of crayon of the same color. Then, fill up each cup with the candle wax. Place the first cup in the microwave. Set the time for 2 minutes and 20 seconds. Do the same with the rest of the cups. Carefully take out the cup from microwave. It will be very hot and hot wax spilled on skin can burn, so take great care. Stir the mixture with a craft or popsicle stick. Allow  the wax to cool down for a little, then pour it into the candle holder. Check that the wick has stayed centered. Let the waxes set in the jar. Do the same with the other waxes, adding the next layer after the former one has properly set. As you go, each layer will form a beautiful layered effect, creating a rainbow style candle. Once you have added all of the wax and the layers are stuck together, the candle is almost ready. Snip off the wick to a suitable height and remove the stick holding it. Discard the leftover wick piece. Done. The candle can now be used or given as a gift.",
  "tyn_model":[
    "candle",
    "crayon",
    "microwave",
    "candle jar",
    "crayons",
    "candle wax",
    "popsicle stick",
    "candle holder",
    "wax"
  ],
  "tyn_section":[

  ]
}