{
  "title":"How to Make a Patterned Layer Cake",
  "url":"https://www.wikihow.com/Make-a-Patterned-Layer-Cake",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes"
  ],
  "methods":[
    {
      "name":"Steps",
      "steps":[
        {
          "headline":"Gather your ingredients and supplies.",
          "description":""
        },
        {
          "headline":"Make sure your oven is preheated to the specified temperature that it says in the recipe.",
          "description":"If your batter is not divvied into two bowls, do that now. For a larger cake, you could make two batches."
        },
        {
          "headline":"Add your food coloring to both batches.",
          "description":"In order to make the patterns, the colors have to be different, but in order to make a really impressive cake and really bring out the patterns, the colors should be very contrasting, like purple and yellow. Or make a white /yellow batter, and add 1/4 cup cocoa powder to half of the batter for the contrasting color. Be aware that food coloring does not work on darker colored cake batter, for example, chocolate cake batter could not be colored. Line both of your pans with parchment paper and/or spray with cooking oil."
        }
      ]
    },
    {
      "name":"Radial Pattern (also known as Zebra Cake)",
      "steps":[
        {
          "headline":"Set out your two spoons.",
          "description":"You do not want to use the same spoon for both batters, as it will become mixed up and the pattern will not be clear."
        },
        {
          "headline":"Take a large spoonful of one of the batches and pour it in the middle of the pan.",
          "description":"You should use about 1/4 cup per scoop, so it is extremely important to pour in the middle. If you want it offset, then pour at the top or bottom, but the middle is best."
        },
        {
          "headline":"Using your other spoon, take about the same amount from the other batch (which should be a different color), and pour in the middle of that circle, so you have sort of a target effect.",
          "description":""
        },
        {
          "headline":"Keep alternating colors and pouring in the middle until about half of each batch is in the cake pan.",
          "description":"Place it in the oven and bake for the required time."
        }
      ]
    },
    {
      "name":"Making the Mismatch Pattern",
      "steps":[
        {
          "headline":"Fill your frosting bags or plastic bags with the rest of your batter.",
          "description":""
        },
        {
          "headline":"Put one color in one bag, and the other color in the other.",
          "description":"The best way to think of it is that your two bags are two different colored crayons."
        },
        {
          "headline":"Take one of the bags and \"scribble\" around the cake pan, creating a scribbly effect.",
          "description":""
        },
        {
          "headline":"Repeat with other color, and keep alternating colors until the batter from both bags is gone.",
          "description":""
        },
        {
          "headline":"Do this until you run out of batter.",
          "description":""
        },
        {
          "headline":"Take your first layer cake (radial pattern) out of the oven and put it in the freezer for 30 min to 1 hour.",
          "description":"This speeds up the cooling process. Do not let the cake get completely frozen."
        },
        {
          "headline":"When the mismatch pattern comes out of the oven, do the same thing.",
          "description":""
        },
        {
          "headline":"Make sure that your cakes are completely cooled before leveling them.",
          "description":"Use your cake leveler or a sharp knife to level the cake. A serrated bread knife works best. Eat the scraps."
        },
        {
          "headline":"Use your black or white frosting to frost the top of one cake.",
          "description":""
        },
        {
          "headline":"Place the other cake on top of that cake.",
          "description":"Use that same frosting to completely cover the sides. Make sure it is very well covered. Place in the refrigerator for about 30 minutes to set."
        },
        {
          "headline":"Use your decorating frosting to frost the cake using your frosting tips.",
          "description":"Decorate the cake any way you want."
        },
        {
          "headline":"Place the cake in the fridge for another 30 minutes to set",
          "description":""
        },
        {
          "headline":"Congratulations!!",
          "description":"You have finished your cake. Cut open to reveal two impressive(but now you know easy) patterns with delicious frosting! !"
        }
      ]
    }
  ],
  "text":" Steps Gather your ingredients and supplies.  Make sure your oven is preheated to the specified temperature that it says in the recipe. If your batter is not divvied into two bowls, do that now. For a larger cake, you could make two batches. Add your food coloring to both batches. In order to make the patterns, the colors have to be different, but in order to make a really impressive cake and really bring out the patterns, the colors should be very contrasting, like purple and yellow. Or make a white /yellow batter, and add 1/4 cup cocoa powder to half of the batter for the contrasting color. Be aware that food coloring does not work on darker colored cake batter, for example, chocolate cake batter could not be colored. Line both of your pans with parchment paper and/or spray with cooking oil. Radial Pattern (also known as Zebra Cake) Set out your two spoons. You do not want to use the same spoon for both batters, as it will become mixed up and the pattern will not be clear. Take a large spoonful of one of the batches and pour it in the middle of the pan. You should use about 1/4 cup per scoop, so it is extremely important to pour in the middle. If you want it offset, then pour at the top or bottom, but the middle is best. Using your other spoon, take about the same amount from the other batch (which should be a different color), and pour in the middle of that circle, so you have sort of a target effect.  Keep alternating colors and pouring in the middle until about half of each batch is in the cake pan. Place it in the oven and bake for the required time. Making the Mismatch Pattern Fill your frosting bags or plastic bags with the rest of your batter.  Put one color in one bag, and the other color in the other. The best way to think of it is that your two bags are two different colored crayons. Take one of the bags and \"scribble\" around the cake pan, creating a scribbly effect.  Repeat with other color, and keep alternating colors until the batter from both bags is gone.  Do this until you run out of batter.  Take your first layer cake (radial pattern) out of the oven and put it in the freezer for 30 min to 1 hour. This speeds up the cooling process. Do not let the cake get completely frozen. When the mismatch pattern comes out of the oven, do the same thing.  Make sure that your cakes are completely cooled before leveling them. Use your cake leveler or a sharp knife to level the cake. A serrated bread knife works best. Eat the scraps. Use your black or white frosting to frost the top of one cake.  Place the other cake on top of that cake. Use that same frosting to completely cover the sides. Make sure it is very well covered. Place in the refrigerator for about 30 minutes to set. Use your decorating frosting to frost the cake using your frosting tips. Decorate the cake any way you want. Place the cake in the fridge for another 30 minutes to set  Congratulations!! You have finished your cake. Cut open to reveal two impressive(but now you know easy) patterns with delicious frosting! !",
  "tyn_model":[
    "oven",
    "frosting",
    "spoon",
    "cake pan",
    "food coloring",
    "cocoa powder",
    "chocolate cake batter",
    "parchment paper",
    "cooking oil",
    "spoons",
    "frosting bags",
    "crayons",
    "freezer",
    "sharp knife",
    "refrigerator",
    "decorating frosting",
    "frosting tips",
    "fridge"
  ],
  "tyn_section":[

  ]
}