{
  "title":"How to Eat Dove or Pigeon",
  "url":"https://www.wikihow.com/Eat-Dove-or-Pigeon",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes"
  ],
  "steps":[
    {
      "headline":"Doves or pigeons can be killed with a spring-loaded BB pistol, an air rifle, a small crossbow (50 pound pull, using 6-inch plastic bolts), or any larger weapon.",
      "description":"They can also be netted, baited and trapped, or snared with a variety of other methods."
    },
    {
      "headline":"Once caught, they should be killed quickly to avoid their unnecessary suffering.",
      "description":"A BB through the brain will work, or a simple cutting off of the head."
    },
    {
      "headline":"The head, wings, and feet may be cut off prior to plucking, or it can be done at any point in the process.",
      "description":""
    },
    {
      "headline":"Pluck all the feathers from the bird.",
      "description":"It may be easier to skin some birds, but you will lose the layer of fat just under the skin."
    },
    {
      "headline":"Starting from just below the rib cage, cut up through the bird's breast meat, holding the bird in one hand around its back, and pushing the knife away from you to avoid risk of cutting yourself.",
      "description":"There is a hard plate that must be cut through, so a sharp knife helps."
    },
    {
      "headline":"Empty or cut off the crop: the part of the throat that pre-processes its food.",
      "description":""
    },
    {
      "headline":"Cut down to the anus so that the complete intestine can be removed all at once.",
      "description":"Pulling the cut breast apart, pull out its entrails starting with the gizzard. If you wish, you can cut open and clean out the gizzard, so you can eat its meat also."
    },
    {
      "headline":"You can also remove what is left of the trachea if you wish; part of it came off with the head.",
      "description":"It looks something like a worm; it's edible but tough and probably hard to digest."
    },
    {
      "headline":"Cook the bird.",
      "description":"The easiest ways are probably pan frying or boiling. Make sure it's \"well done\" to avoid risk of parasites."
    },
    {
      "headline":"Eat and enjoy.",
      "description":"Though the taste will vary according to their diet, pigeon meat can be comparable to duck. One bird can be a satisfying meal for one person."
    }
  ],
  "text":" Doves or pigeons can be killed with a spring-loaded BB pistol, an air rifle, a small crossbow (50 pound pull, using 6-inch plastic bolts), or any larger weapon. They can also be netted, baited and trapped, or snared with a variety of other methods. Once caught, they should be killed quickly to avoid their unnecessary suffering. A BB through the brain will work, or a simple cutting off of the head. The head, wings, and feet may be cut off prior to plucking, or it can be done at any point in the process.  Pluck all the feathers from the bird. It may be easier to skin some birds, but you will lose the layer of fat just under the skin. Starting from just below the rib cage, cut up through the bird's breast meat, holding the bird in one hand around its back, and pushing the knife away from you to avoid risk of cutting yourself. There is a hard plate that must be cut through, so a sharp knife helps. Empty or cut off the crop: the part of the throat that pre-processes its food.  Cut down to the anus so that the complete intestine can be removed all at once. Pulling the cut breast apart, pull out its entrails starting with the gizzard. If you wish, you can cut open and clean out the gizzard, so you can eat its meat also. You can also remove what is left of the trachea if you wish; part of it came off with the head. It looks something like a worm; it's edible but tough and probably hard to digest. Cook the bird. The easiest ways are probably pan frying or boiling. Make sure it's \"well done\" to avoid risk of parasites. Eat and enjoy. Though the taste will vary according to their diet, pigeon meat can be comparable to duck. One bird can be a satisfying meal for one person.",
  "tyn_model":[
    "pigeons",
    "bb pistol",
    "air rifle",
    "bb",
    "feathers",
    "birds",
    "knife",
    "plate",
    "sharp knife",
    "pigeon meat",
    "duck"
  ],
  "tyn_section":[

  ]
}