{
  "title":"How to Prepare for a Brush Fire",
  "url":"https://www.wikihow.com/Prepare-for-a-Brush-Fire",
  "category_hierarchy":[
    "Home and Garden",
    "Disaster Preparedness"
  ],
  "steps":[
    {
      "headline":"Know if you want to stay and defend your house or go somewhere safe.",
      "description":"If you want to stay and defend your house, let the local fire brigade or police know, so that if the bush fire strikes, they can come and help save your house, or help to keep you safe. Remember that this is not recommended and very unsafe, so if you are going to stay, make sure any young children/seniors/pregnant women leave."
    },
    {
      "headline":"If you want to go somewhere safe, pack up all the necessary possessions like family valuables, photo albums, and bring your pets.",
      "description":"Also round up as much money as you can."
    },
    {
      "headline":"Listen to the local radio station/television station, as they will have updates on the condition of the bushfire.",
      "description":"It is a good idea to have a hand-cranked or battery operated radio. Use your cell phone too, to keep in touch with people and let them know how events are unfolding for you."
    },
    {
      "headline":"Ask the local fire brigade/police what will happen after the fire, for example, if they will have medical stations for check-ups, and if so, where they'll be.",
      "description":""
    },
    {
      "headline":"If possible, make sure the local seniors know what's happening and offer for them to come and stay/leave with you.",
      "description":""
    },
    {
      "headline":"Arrange with a friend to check up on them after the fire.",
      "description":"That way you can make sure everyone is safe."
    },
    {
      "headline":"Educate children about brush fires, and answer all their questions.",
      "description":"Answer their questions honestly, but don't be too emotional when you speak to them, as this can make them sad and scared."
    },
    {
      "headline":"Have a horn in every room in the house, so that if the fire is in the house, you can blow the horn and the fire crew can come and help you.",
      "description":"But make sure you tell neighbors/emergency services that you have the horn, so that they know what the horn means."
    },
    {
      "headline":"If you are staying to defend your house, and you know that your house can no longer be saved, go and help somebody else save their house or leave the area immediately.",
      "description":""
    }
  ],
  "text":" Know if you want to stay and defend your house or go somewhere safe. If you want to stay and defend your house, let the local fire brigade or police know, so that if the bush fire strikes, they can come and help save your house, or help to keep you safe. Remember that this is not recommended and very unsafe, so if you are going to stay, make sure any young children/seniors/pregnant women leave. If you want to go somewhere safe, pack up all the necessary possessions like family valuables, photo albums, and bring your pets. Also round up as much money as you can. Listen to the local radio station/television station, as they will have updates on the condition of the bushfire. It is a good idea to have a hand-cranked or battery operated radio. Use your cell phone too, to keep in touch with people and let them know how events are unfolding for you. Ask the local fire brigade/police what will happen after the fire, for example, if they will have medical stations for check-ups, and if so, where they'll be.  If possible, make sure the local seniors know what's happening and offer for them to come and stay/leave with you.  Arrange with a friend to check up on them after the fire. That way you can make sure everyone is safe. Educate children about brush fires, and answer all their questions. Answer their questions honestly, but don't be too emotional when you speak to them, as this can make them sad and scared. Have a horn in every room in the house, so that if the fire is in the house, you can blow the horn and the fire crew can come and help you. But make sure you tell neighbors/emergency services that you have the horn, so that they know what the horn means. If you are staying to defend your house, and you know that your house can no longer be saved, go and help somebody else save their house or leave the area immediately. ",
  "tyn_model":[
    "horn",
    "radio",
    "cell phone",
    "fire crew"
  ],
  "tyn_section":[

  ]
}