{
  "title":"How to Complete the First Level in Slender: the Arrival",
  "url":"https://www.wikihow.com/Complete-the-First-Level-in-Slender:-the-Arrival",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "steps":[
    {
      "headline":"On starting the game you will see a cutscene.",
      "description":"After this you will be standing beside your crashed car, which you can't get past. Instead of trying to walk behind the car, continue walking down the path. At this point Slender won't even try to catch you, so be happy to just take in the sights."
    },
    {
      "headline":"As you get further down the path it will get darker, and you will see a radio tower, a staple place in the story.",
      "description":"If you want to get to the house you are going to faster, though, you can take an early shortcut down a steep path. Please note that this will make it get darker quicker. Once you reach the house, turn right and look for the tree with a missing sign. Once you find it pick the sign up."
    },
    {
      "headline":"Now go into the house garden, and you will notice two playsets.",
      "description":"The first is a swingset that if you touch you will get a message. The second is a slide. Climb to the top of the slide and you will find a note marked as (3). Pick it up. You do not need to pick it up at this point, though it is probably the best time as Slenderman is less likely to catch you."
    },
    {
      "headline":"Now you have two things in your scrapbook- a missing poster and a note.",
      "description":"Before we go any further please note that scrapbook parts are not required and only there to enhance your gaming experience. Do not worry if you do not collect them all."
    },
    {
      "headline":"Now go inside.",
      "description":"There are two possible entrances; the front door and the garage door. It doesn't matter which door you go in, as they both lead you inside! Now that you are inside there are multiple things to do, but the first and most important thing is locating the torch!"
    },
    {
      "headline":"After finding the torch, there are 5 scrapbook pieces downstairs to find.",
      "description":"To give exact locations would take too long, so I will just give a basic idea. There is a funeral note in the kitchen, alongside a marker board on the fridge. There are also two notes and a thank you card. Next head upstairs and look for a key in one of the rooms."
    },
    {
      "headline":"After finding the key, head to the farthest room in the corridor and unlock it.",
      "description":"After picking up a note that is inside, you will hear a girl screaming and your mission will change. Head outside and run outside the now unlocked back gate."
    },
    {
      "headline":"Head down the hill, picking up any scrapbook pieces you find.",
      "description":"There are two. There are also generators that will turn on some lights that will lighten the way. Turn them on if you wish, though they are not essential.Slender will appear on the hills every once in a while though will not chase you aggressively."
    },
    {
      "headline":"There is a house at the end of the path.",
      "description":"Inside is a weeping boy, later found out to be Charlie. If you get too close he will jump out on you, so be careful.You do not need to go inside, though there is a scrapbook piece."
    },
    {
      "headline":"Finally, walk up the hill/road until you reach a cabin.",
      "description":"After heading inside and picking up the book, you have completed the level."
    }
  ],
  "text":" On starting the game you will see a cutscene. After this you will be standing beside your crashed car, which you can't get past. Instead of trying to walk behind the car, continue walking down the path. At this point Slender won't even try to catch you, so be happy to just take in the sights. As you get further down the path it will get darker, and you will see a radio tower, a staple place in the story. If you want to get to the house you are going to faster, though, you can take an early shortcut down a steep path. Please note that this will make it get darker quicker. Once you reach the house, turn right and look for the tree with a missing sign. Once you find it pick the sign up. Now go into the house garden, and you will notice two playsets. The first is a swingset that if you touch you will get a message. The second is a slide. Climb to the top of the slide and you will find a note marked as (3). Pick it up. You do not need to pick it up at this point, though it is probably the best time as Slenderman is less likely to catch you. Now you have two things in your scrapbook- a missing poster and a note. Before we go any further please note that scrapbook parts are not required and only there to enhance your gaming experience. Do not worry if you do not collect them all. Now go inside. There are two possible entrances; the front door and the garage door. It doesn't matter which door you go in, as they both lead you inside! Now that you are inside there are multiple things to do, but the first and most important thing is locating the torch! After finding the torch, there are 5 scrapbook pieces downstairs to find. To give exact locations would take too long, so I will just give a basic idea. There is a funeral note in the kitchen, alongside a marker board on the fridge. There are also two notes and a thank you card. Next head upstairs and look for a key in one of the rooms. After finding the key, head to the farthest room in the corridor and unlock it. After picking up a note that is inside, you will hear a girl screaming and your mission will change. Head outside and run outside the now unlocked back gate. Head down the hill, picking up any scrapbook pieces you find. There are two. There are also generators that will turn on some lights that will lighten the way. Turn them on if you wish, though they are not essential.Slender will appear on the hills every once in a while though will not chase you aggressively. There is a house at the end of the path. Inside is a weeping boy, later found out to be Charlie. If you get too close he will jump out on you, so be careful.You do not need to go inside, though there is a scrapbook piece. Finally, walk up the hill/road until you reach a cabin. After heading inside and picking up the book, you have completed the level.",
  "tyn_model":[
    "slender",
    "slide",
    "torch",
    "tree",
    "swingset",
    "scrapbook parts",
    "scrapbook pieces",
    "marker board",
    "generators",
    "book"
  ],
  "tyn_section":[

  ]
}