{
  "title":"How to Win Every Beginner Track (and Some Advanced Tracks) on BTD5 for Mobile",
  "url":"https://www.wikihow.com/Win-Every-Beginner-Track-(and-Some-Advanced-Tracks)-on-BTD5-for-Mobile",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games"
  ],
  "steps":[
    {
      "headline":"Start by placing a Ninja Monkey where he can see as much as possible.",
      "description":"Take into consideration the fact that we will be increasing his range two times, so give a little extra space where needed. Eventually, the Ninja will be (4,1)."
    },
    {
      "headline":"After Round 2 on Impoppable, you should be able to afford the first upgrade, Ninja Discipline.",
      "description":"Buy that."
    },
    {
      "headline":"After Round 4, you should be able to by Seeking Shuriken.",
      "description":"Do that too."
    },
    {
      "headline":"After Round 7, buy Sharp Shurikens.",
      "description":"You should be able to comfortably coast from Round 7 to the end of 15. If something gets scary, press the pause button and return to the main menu. Open up the save file and play in regular speed, holding road spikes at the ready for some stray bloons."
    },
    {
      "headline":"Assuming you lived until after Round 15, place a Monkey Village to where it can see the Ninja Monkey and a space suitable to put a glue gunner.",
      "description":"I suggest stretching the distance between the Glue Gunner and the Ninja Monkey as much as possible, so try to account for that when placing the village. Eventually, the village will be (2,2)."
    },
    {
      "headline":"After Round 19, buy Double Shot for the Ninja.",
      "description":""
    },
    {
      "headline":"As soon as you can, buy the mentioned Glue Gunner and place him within sight of the village, but as close to the beginning of the track as possible.",
      "description":"Give the Gunner Bloon Soak, Stickier Glue, and the Acid Upgrade(2,1). Change the Gunner's priority to Strongest. Give the Monkey Village the Monkey Beacon upgrade and Monkey Fort. Eventually, the Glue Gunner will be (3,2)."
    },
    {
      "headline":"After Round 34, buy Glue Splatter for your Glue Gunner.",
      "description":""
    },
    {
      "headline":"By Round 40, you should upgrade the village.",
      "description":"Buy Jungle Drums and Radar Scanner. We are now done upgrading the village."
    },
    {
      "headline":"You should, at this point, be able to buy a Bloonchipper.",
      "description":"Place one next to the Glue Gunner. Make sure the chipper is within the Village's range. Upgrade at your leisure for the next few rounds to get the chipper to (4,2). Set the Bloonchipper's priority to Strongest."
    },
    {
      "headline":"By Round 46, you should have a (4,2) Bloonchipper.",
      "description":"There's a MOAB coming soon, but don't be afraid. That's what the chipper is for."
    },
    {
      "headline":"After Round 46, buy Bloonjitsu for the Ninja Monkey.",
      "description":"We are now done upgrading the Ninja."
    },
    {
      "headline":"After Round 48, buy Bloon Dissolver for the Glue Gunner.",
      "description":"We are done upgrading the Gunner."
    },
    {
      "headline":"Now start buying Banana Farms like there's no tomorrow.",
      "description":"Literally. You should be safe until Round 60. If you can afford it, buy some Banana Farmers. If you get the Farmers, give them a range-boost with another village. Make sure to put as many of the farms within the village radius as possible to make them cheaper. You could make sure to buy all of the farms, you would be using first, and then upgrade them. Start with (2,0) farms, and once they are all (2,0), make one of them (4,2). After that, work at getting them all (4,2) one at a time. *Note*- When I was taking screenshots, I accidentally set my towers to Last instead of Strongest. That will cause many problems, especially when you have to face the Regen Rainbows of Round 56."
    },
    {
      "headline":"After Round 60, hover your finger over your home/pause button.",
      "description":"Keep upgrading farms, and if you need to, sell one of them temporarily to build more Bloonchippers set to Strongest. This will get you through Round 84."
    },
    {
      "headline":"Before you start Round 85, sell everything.",
      "description":"Yeah, you read it right, sell it all. Count to five: [1. Supermonkeys 2. Bomb Towers 3. Glue Gunners 4. Monkey Apprentices 5. Ice Towers]. Build one village, and within it's radius, place two of each of the mentioned towers. Upgrade one super monkey to (3,2) and the other to (2,4). For the rest of the towers, buy the most expensive upgrades. Once all of the towers are upgraded, buy the Temple of the Monkey God."
    }
  ],
  "text":" Start by placing a Ninja Monkey where he can see as much as possible. Take into consideration the fact that we will be increasing his range two times, so give a little extra space where needed. Eventually, the Ninja will be (4,1). After Round 2 on Impoppable, you should be able to afford the first upgrade, Ninja Discipline. Buy that. After Round 4, you should be able to by Seeking Shuriken. Do that too. After Round 7, buy Sharp Shurikens. You should be able to comfortably coast from Round 7 to the end of 15. If something gets scary, press the pause button and return to the main menu. Open up the save file and play in regular speed, holding road spikes at the ready for some stray bloons. Assuming you lived until after Round 15, place a Monkey Village to where it can see the Ninja Monkey and a space suitable to put a glue gunner. I suggest stretching the distance between the Glue Gunner and the Ninja Monkey as much as possible, so try to account for that when placing the village. Eventually, the village will be (2,2). After Round 19, buy Double Shot for the Ninja.  As soon as you can, buy the mentioned Glue Gunner and place him within sight of the village, but as close to the beginning of the track as possible. Give the Gunner Bloon Soak, Stickier Glue, and the Acid Upgrade(2,1). Change the Gunner's priority to Strongest. Give the Monkey Village the Monkey Beacon upgrade and Monkey Fort. Eventually, the Glue Gunner will be (3,2). After Round 34, buy Glue Splatter for your Glue Gunner.  By Round 40, you should upgrade the village. Buy Jungle Drums and Radar Scanner. We are now done upgrading the village. You should, at this point, be able to buy a Bloonchipper. Place one next to the Glue Gunner. Make sure the chipper is within the Village's range. Upgrade at your leisure for the next few rounds to get the chipper to (4,2). Set the Bloonchipper's priority to Strongest. By Round 46, you should have a (4,2) Bloonchipper. There's a MOAB coming soon, but don't be afraid. That's what the chipper is for. After Round 46, buy Bloonjitsu for the Ninja Monkey. We are now done upgrading the Ninja. After Round 48, buy Bloon Dissolver for the Glue Gunner. We are done upgrading the Gunner. Now start buying Banana Farms like there's no tomorrow. Literally. You should be safe until Round 60. If you can afford it, buy some Banana Farmers. If you get the Farmers, give them a range-boost with another village. Make sure to put as many of the farms within the village radius as possible to make them cheaper. You could make sure to buy all of the farms, you would be using first, and then upgrade them. Start with (2,0) farms, and once they are all (2,0), make one of them (4,2). After that, work at getting them all (4,2) one at a time. *Note*- When I was taking screenshots, I accidentally set my towers to Last instead of Strongest. That will cause many problems, especially when you have to face the Regen Rainbows of Round 56. After Round 60, hover your finger over your home/pause button. Keep upgrading farms, and if you need to, sell one of them temporarily to build more Bloonchippers set to Strongest. This will get you through Round 84. Before you start Round 85, sell everything. Yeah, you read it right, sell it all. Count to five: [1. Supermonkeys 2. Bomb Towers 3. Glue Gunners 4. Monkey Apprentices 5. Ice Towers]. Build one village, and within it's radius, place two of each of the mentioned towers. Upgrade one super monkey to (3,2) and the other to (2,4). For the rest of the towers, buy the most expensive upgrades. Once all of the towers are upgraded, buy the Temple of the Monkey God.",
  "tyn_model":[
    "glue gunner",
    "bloonchipper",
    "chipper",
    "ninja monkey",
    "shuriken",
    "shurikens",
    "stickier glue",
    "acid",
    "glue splatter",
    "glue",
    "jungle drums",
    "radar scanner",
    "bloonjitsu",
    "bloon dissolver",
    "banana farms",
    "banana farmers",
    "towers",
    "bloonchippers",
    "glue gunners"
  ],
  "tyn_section":[

  ]
}