{
  "title":"How to Make a Traditional South American Frog Smoothie",
  "url":"https://www.wikihow.com/Make-a-Traditional-South-American-Frog-Smoothie",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Smoothies Shakes and Milk",
    "Smoothies"
  ],
  "steps":[
    {
      "headline":"Source the traditional ingredients.",
      "description":"Finding some of the South American ingredients is a challenge, since they are not readily available. It is best to go to traditional South American markets, visit specialty health food stores, and shop online. If you can't find the original ingredients, do your best to substitute for them."
    },
    {
      "headline":"Chop up the Aloe vera, maca, and frog into smaller pieces.",
      "description":""
    },
    {
      "headline":"Place all the ingredients into the food processor.",
      "description":"Add them in the order they are listed  and always add the ice last. Otherwise your blender will chop up the ice more than the other ingredients, and you will end up with a watery smoothie."
    },
    {
      "headline":"Pulse until you get a smooth texture.",
      "description":"You can even add some salt and pepper to mask the taste of the frogs."
    },
    {
      "headline":"Pour into a glass.",
      "description":"This recipe makes one 250mL glass, but you can scale the ingredients by the number of people you are serving."
    }
  ],
  "text":" Source the traditional ingredients. Finding some of the South American ingredients is a challenge, since they are not readily available. It is best to go to traditional South American markets, visit specialty health food stores, and shop online. If you can't find the original ingredients, do your best to substitute for them. Chop up the Aloe vera, maca, and frog into smaller pieces.  Place all the ingredients into the food processor. Add them in the order they are listed  and always add the ice last. Otherwise your blender will chop up the ice more than the other ingredients, and you will end up with a watery smoothie. Pulse until you get a smooth texture. You can even add some salt and pepper to mask the taste of the frogs. Pour into a glass. This recipe makes one 250mL glass, but you can scale the ingredients by the number of people you are serving.",
  "tyn_model":[
    "ice",
    "aloe vera",
    "maca",
    "food processor",
    "blender",
    "salt and pepper",
    "glass"
  ],
  "tyn_section":[

  ]
}