{
  "title":"How to Make Bangladeshi Rasmalai",
  "url":"https://www.wikihow.com/Make-Bangladeshi-Rasmalai",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Indian Cuisine",
    "Indian Desserts"
  ],
  "methods":[
    {
      "name":"Preparing Chhana",
      "steps":[
        {
          "headline":"Line a colander with cheesecloth that has been folded over 3-4 times.",
          "description":""
        },
        {
          "headline":"Place the lined colander in the sink.",
          "description":""
        },
        {
          "headline":"Mix 4 tablespoons of white vinegar with 4 tablespoons of water, and set aside.",
          "description":""
        },
        {
          "headline":"Pour milk into a large saucepan, and bring to a boil.",
          "description":""
        },
        {
          "headline":"Stir the milk periodically and scrape the sides and bottom of the pan to prevent scorching.",
          "description":""
        },
        {
          "headline":"Turn off the heat and allow the boiled milk to cool for 5 minutes.",
          "description":""
        },
        {
          "headline":"Add the diluted vinegar to the milk in increments of 2 tablespoons, and stir.",
          "description":""
        },
        {
          "headline":"Add ½ cup of ice to cool the curdling milk.",
          "description":""
        },
        {
          "headline":"Ladle the curds into the cheesecloth-lined colander.",
          "description":""
        },
        {
          "headline":"Wrap the cloth around the cheese, and rinse under cool running water without applying any pressure.",
          "description":""
        },
        {
          "headline":"Tie the ends of the cheesecloth into a knot, and allow the cheese to drain and cool overnight at room temperature.",
          "description":""
        },
        {
          "headline":"Knead the chhana, using the heel of your hand, with 1 teaspoon of flour and ½ teaspoon of cornstarch until a dough forms.",
          "description":""
        },
        {
          "headline":"Roll the dough into balls of roughly 1 inch in diameter.",
          "description":"Make sure there are no cracks."
        },
        {
          "headline":"Mix 6 cups of sugar with 5 cups of water in a large, clean saucepan.",
          "description":""
        },
        {
          "headline":"Boil the sugar-water mixture until the sugar has dissolved completely.",
          "description":""
        },
        {
          "headline":"Add 3 cardamom pods to the boiling sugar syrup.",
          "description":""
        },
        {
          "headline":"Drop the chhana pieces into the boiling sugar syrup.",
          "description":""
        },
        {
          "headline":"Cook the chhana for about 15 minutes, or until the texture is firm and springy.",
          "description":""
        },
        {
          "headline":"Remove the chhana with a slotted spoon, and drain on a wire rack over a large tray.",
          "description":""
        }
      ]
    },
    {
      "name":"Preparing Cream",
      "steps":[
        {
          "headline":"Carefully open three 12 oz.",
          "description":"cans of evaporated milk."
        },
        {
          "headline":"Pour the 36 oz.",
          "description":"of evaporated milk into a clean saucepan."
        },
        {
          "headline":"Heat the milk until it is boiling.",
          "description":""
        },
        {
          "headline":"Stir 1 cup of Sugar Syrup and 5 drops of kewra essence into the boiling milk.",
          "description":""
        },
        {
          "headline":"Add 2 cardamom pods to the boiling milk mixture.",
          "description":""
        },
        {
          "headline":"Allow the milk to simmer until it has reduced in volume by 1/3.",
          "description":""
        },
        {
          "headline":"Scrape the bottom and sides of the pan periodically to prevent scorching.",
          "description":""
        },
        {
          "headline":"Add the cooked chhana pieces to the cream.",
          "description":""
        },
        {
          "headline":"Simmer for an additional 5 minutes.",
          "description":""
        },
        {
          "headline":"Carefully pour the rasmalai into a serving dish.",
          "description":""
        },
        {
          "headline":"Chop ½ cup of blanched almonds, and sprinkle on top of the rasmalai to garnish.",
          "description":""
        },
        {
          "headline":"Refrigerate the rasmalai overnight, and serve the next day.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preparing Chhana Line a colander with cheesecloth that has been folded over 3-4 times.  Place the lined colander in the sink.  Mix 4 tablespoons of white vinegar with 4 tablespoons of water, and set aside.  Pour milk into a large saucepan, and bring to a boil.  Stir the milk periodically and scrape the sides and bottom of the pan to prevent scorching.  Turn off the heat and allow the boiled milk to cool for 5 minutes.  Add the diluted vinegar to the milk in increments of 2 tablespoons, and stir.  Add ½ cup of ice to cool the curdling milk.  Ladle the curds into the cheesecloth-lined colander.  Wrap the cloth around the cheese, and rinse under cool running water without applying any pressure.  Tie the ends of the cheesecloth into a knot, and allow the cheese to drain and cool overnight at room temperature.  Knead the chhana, using the heel of your hand, with 1 teaspoon of flour and ½ teaspoon of cornstarch until a dough forms.  Roll the dough into balls of roughly 1 inch in diameter. Make sure there are no cracks. Mix 6 cups of sugar with 5 cups of water in a large, clean saucepan.  Boil the sugar-water mixture until the sugar has dissolved completely.  Add 3 cardamom pods to the boiling sugar syrup.  Drop the chhana pieces into the boiling sugar syrup.  Cook the chhana for about 15 minutes, or until the texture is firm and springy.  Remove the chhana with a slotted spoon, and drain on a wire rack over a large tray.  Preparing Cream Carefully open three 12 oz. cans of evaporated milk. Pour the 36 oz. of evaporated milk into a clean saucepan. Heat the milk until it is boiling.  Stir 1 cup of Sugar Syrup and 5 drops of kewra essence into the boiling milk.  Add 2 cardamom pods to the boiling milk mixture.  Allow the milk to simmer until it has reduced in volume by 1/3.  Scrape the bottom and sides of the pan periodically to prevent scorching.  Add the cooked chhana pieces to the cream.  Simmer for an additional 5 minutes.  Carefully pour the rasmalai into a serving dish.  Chop ½ cup of blanched almonds, and sprinkle on top of the rasmalai to garnish.  Refrigerate the rasmalai overnight, and serve the next day. ",
  "tyn_model":[
    "milk",
    "colander",
    "water",
    "cheesecloth",
    "sugar",
    "cardamom",
    "boiling sugar",
    "cream",
    "evaporated milk",
    "white vinegar",
    "large saucepan",
    "vinegar",
    "ice",
    "flour",
    "cornstarch",
    "large, clean saucepan",
    "sugar-water",
    "slotted spoon",
    "wire rack",
    "saucepan",
    "sugar syrup",
    "kewra essence",
    "pan",
    "serving dish",
    "almonds"
  ],
  "tyn_section":[

  ]
}