{
  "title":"How to Carve a Chicken",
  "url":"https://www.wikihow.com/Carve-a-Chicken",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Meat",
    "Poultry Recipes",
    "Chicken"
  ],
  "methods":[
    {
      "name":"Cutting the Legs",
      "steps":[
        {
          "headline":"Place the chicken, breast up, on cutting board.",
          "description":"It is important that it is breast up so that you can see what you are doing. If you have just taken the chicken out of the oven, let it cool for 10 to 15 minutes."
        },
        {
          "headline":"Hold the chicken steady with a carving fork.",
          "description":"Using a large carving  knife, cut through the skin between the leg and the body."
        },
        {
          "headline":"Cut through the meat between the tail and hip joint.",
          "description":"Cut as closely as possible to the backbone. Bend the leg back until the hip joint pops out."
        },
        {
          "headline":"Continue to cut around the bone.",
          "description":"Pull the leg from the body until the meat is separated from bone. Cut through the remaining skin. Repeat on the other side. If you are having trouble cutting through the skin, try using a serrated knife. Work the knife back and forth until the skin is cut."
        }
      ]
    },
    {
      "name":"Separating Thighs from Drumsticks",
      "steps":[
        {
          "headline":"Place the leg skin side down on the cutting board.",
          "description":"It is easiest to cut through the meat first and then work your way towards the skin, which may need to be cut with a serrated knife."
        },
        {
          "headline":"Make a cut about ⁄8 inch (0.3 cm) from the fat line toward the drumstick.",
          "description":"The drumstick is the smaller part of the leg that is attached to the end of the leg bone. There is a thin, white fat line that runs along the joint between the drumstick and thigh."
        },
        {
          "headline":"Cut through the joint connecting the drumstick and thigh.",
          "description":"Repeat this process with the remaining leg."
        }
      ]
    },
    {
      "name":"Removing the Breast Meat",
      "steps":[
        {
          "headline":"Cut along the breast bone.",
          "description":"Start at the back of the bird and work towards the front (the end with the wings still attached.)"
        },
        {
          "headline":"Cut through the wishbone when you get to it.",
          "description":"Angle the knife and cut down along the wishbone toward the wing. Make a cut between the breast and the wing. Another option is to bend the breast halves back to pop out the keel bone and then remove the keel bone. Using poultry shears or a knife, cut the breast into halves through the wishbone. Cut each breast half into halves."
        },
        {
          "headline":"Pull back on the breast meat.",
          "description":"Pull it away from the body while simultaneously cutting the meat away from the bone. Cut through the skin holding the breast to the body. If you want to cut the breast up further, lay the breast on the cutting board. Place your knife at a 45 degree angle from the board and slice through the meat."
        }
      ]
    },
    {
      "name":"Cutting the Wings",
      "steps":[
        {
          "headline":"Bend the wing away from the body.",
          "description":"Doing this will make it easier to see the joint."
        },
        {
          "headline":"Cut into the wing joint with the carving knife.",
          "description":"Roll the knife along the joint so as to let the knife curve along the joint. Repeat with the remaining wing."
        },
        {
          "headline":"Finished.",
          "description":""
        }
      ]
    }
  ],
  "text":" Cutting the Legs Place the chicken, breast up, on cutting board. It is important that it is breast up so that you can see what you are doing. If you have just taken the chicken out of the oven, let it cool for 10 to 15 minutes. Hold the chicken steady with a carving fork. Using a large carving  knife, cut through the skin between the leg and the body. Cut through the meat between the tail and hip joint. Cut as closely as possible to the backbone. Bend the leg back until the hip joint pops out. Continue to cut around the bone. Pull the leg from the body until the meat is separated from bone. Cut through the remaining skin. Repeat on the other side. If you are having trouble cutting through the skin, try using a serrated knife. Work the knife back and forth until the skin is cut. Separating Thighs from Drumsticks Place the leg skin side down on the cutting board. It is easiest to cut through the meat first and then work your way towards the skin, which may need to be cut with a serrated knife. Make a cut about ⁄8 inch (0.3 cm) from the fat line toward the drumstick. The drumstick is the smaller part of the leg that is attached to the end of the leg bone. There is a thin, white fat line that runs along the joint between the drumstick and thigh. Cut through the joint connecting the drumstick and thigh. Repeat this process with the remaining leg. Removing the Breast Meat Cut along the breast bone. Start at the back of the bird and work towards the front (the end with the wings still attached.) Cut through the wishbone when you get to it. Angle the knife and cut down along the wishbone toward the wing. Make a cut between the breast and the wing. Another option is to bend the breast halves back to pop out the keel bone and then remove the keel bone. Using poultry shears or a knife, cut the breast into halves through the wishbone. Cut each breast half into halves. Pull back on the breast meat. Pull it away from the body while simultaneously cutting the meat away from the bone. Cut through the skin holding the breast to the body. If you want to cut the breast up further, lay the breast on the cutting board. Place your knife at a 45 degree angle from the board and slice through the meat. Cutting the Wings Bend the wing away from the body. Doing this will make it easier to see the joint. Cut into the wing joint with the carving knife. Roll the knife along the joint so as to let the knife curve along the joint. Repeat with the remaining wing. Finished. ",
  "tyn_model":[
    "knife",
    "chicken",
    "serrated knife",
    "cutting board",
    "meat",
    "oven",
    "carving fork",
    "carving  knife",
    "drumsticks",
    "drumstick",
    "bird",
    "poultry shears",
    "carving knife"
  ],
  "tyn_section":[

  ]
}