{
  "title":"How to Buy Rose Bushes",
  "url":"https://www.wikihow.com/Buy-Rose-Bushes",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Flowers",
    "Roses"
  ],
  "methods":[
    {
      "name":"Finding Rose Bushes for Sale",
      "steps":[
        {
          "headline":"Go to a local nursery to purchase common rose varieties.",
          "description":"Visiting a local nursery is the easiest way to find rose bushes to buy. You can see the plants up close, talk to professionals about your needs, and inspect the tags on the bushes for information about how large the roses will grow to be.Tip: If you are not sure what type of rose you want to purchase, you could also visit a botanical garden. You can look at different types of roses and get ideas for your garden. You might even be able to purchase a plant to take home."
        },
        {
          "headline":"Browse online nurseries for a wider selection.",
          "description":"Nurseries only carry top-selling plants, so they are unlikely to have rare varieties of rose bushes. If you want something special that you cannot find in a nursery, then check online. You can go through a major home improvement store or check out a company that specializes in heirloom roses. Buying online may also save you money in some cases. Make sure to check your hardiness zone before you buy and only purchase roses that will thrive in your zone. Hardiness zones are divided by the average minimum temperature in winter. Look online for a map that shows what zone you are in."
        },
        {
          "headline":"Look into local gardening clubs and organizations.",
          "description":"Sometimes local gardening groups will do seed swaps and hold events where you can purchase plants. Check into your local gardening clubs and horticulture organizations to see if they have any events planned. This is also a great opportunity to learn more about what grows best in your region and to get some helpful tips for growing rose bushes."
        },
        {
          "headline":"Determine the type and number of plants you will need.",
          "description":"You can grow rose bushes from seed or plant bushes depending on your needs. Consider how many bushes you want to plant, and whether you want to buy bushes that are already growing, or start your own bushes from seeds. Planting bushes is an easier process than starting new rose bushes from seeds, but growing rose bushes from seed is more economical if you want to plant several rose bushes."
        }
      ]
    },
    {
      "name":"Choosing Rose Bushes for Growing Features",
      "steps":[
        {
          "headline":"Choose shrub roses to fill in empty spaces in your garden.",
          "description":"If you want rose bushes that will fill in some of the space in your garden without getting too big, then shrub rose bushes might be a good option. You can find rose bushes that only grow to be 2 ft (0.61 m) or ones that will get up to 5 ft (1.5 m) if you want something taller. Choose a Dunwich rose bush for a plant that only grows to about 2 ft (0.61 m). Opt for a Lady of Shallot or Queen of Sweden for a bush that will grow to about 4 ft (1.2 m). Go with a Madame Hardy or Penelope for a bush that will grow to about 5 ft (1.5 m) tall. Try a Variegata de Bologna for a rose bush that will grow up to 6.5 ft (2.0 m)."
        },
        {
          "headline":"Select hedge roses to add privacy to your garden.",
          "description":"If you want something tall as a fence and that will grow well in a row, then a hedge rose might be the best choice for you. These rose bushes are dense enough to provide some privacy while still adding beauty to your garden. Go with a Cornelia or Hyde Hall for something that will reach about 5 ft (1.5 m). Try an Agnes or Roseraie de l’Hay for a 6.5 ft (2.0 m) rose bush hedge. Opt for a Nevada or Rugosa for a 7 ft (2.1 m) hedge."
        },
        {
          "headline":"Try climbing roses if you want them to grow up a wall or archway.",
          "description":"If you have a wall, archway, or other feature in your garden that you’d like to train roses to grow onto, then select a climbing rose. You may have to install a trellis to give the roses something to grow through and hold onto. Some popular climbing rose varieties include:\nAlister Stella Grey\nBush Rambler\nDublin Bay\nLaura Ford\nSchoolgirlTip: Climbing roses can grow anywhere from 7 to 30 ft (2.1 to 9.1 m). There are even some varieties that will grow up and around the trunk and branches of a tree."
        },
        {
          "headline":"Go with ground cover roses to fill in bare patches with attractive foliage.",
          "description":"If you want roses that will fill in bare patches in your garden or that will accent other types of shrubs and flowers, then a ground cover rose bush might be a good choice. These grow no more than 2 ft (0.61 m) off the ground, but they sprawl outward by 3 to 6.5 feet (0.91 to 1.98 m). Ground cover roses come in a wide range of colors, but some popular varieties include:\nMagic Carpet (bright, lavender-pink flowers)\nSnow Carpet (white flowers)\nRaubritter (pink flowers)\nMax Graf (deep pink flowers)\nNozomi (pink flowers)"
        }
      ]
    },
    {
      "name":"Selecting Roses for Appearance and Scent",
      "steps":[
        {
          "headline":"Choose roses in colors that will complement your garden.",
          "description":"Opt for a rose bush with flowers that will complement the wall or other features of your property. Stick with warm tones to complement warm colors such as red, brown, orange, and yellow. Go with cool tones to complement cool toned features, such a blue, grey, and lavender. For example, you can go with red, yellow, peach, or orange roses if you want to grow them up against a brick house or a house that is painted red, brown, or yellow. Try lavender, white, or pink roses if you want to grow them near a grey or blue house or fence.Tip: Although it is not common, there are some roses that feature blue and green flowers. Check an online supplier if you want roses in an unusual color."
        },
        {
          "headline":"Look into roses with ornamental stems, leaves, and thorns.",
          "description":"If you want something exotic, try selecting a rose bush that will develop some unique foliage. You can find varieties with ornate leaves, thorns, stems, and other interesting features beyond the flowers. For example, you can find rose bush varieties with glossy leaves, like Cooperi and Lutea. Choose rosebushes with fern-like foliage, such as Multibracteata and Primula. Opt for extra thorny stems, like Canary Bird and Primula. Select bushes with leaves that change from green to a rich crimson in the fall like Nitida."
        },
        {
          "headline":"Choose roses with a strong scent if you want to be able to smell them.",
          "description":"Not all roses have a noticeable scent, which is fine if you only want to look at them. However, if you want to be able to smell the roses as soon as you walk near them, go with an extra aromatic variety of rose bush. Some highly aromatic roses include:\nCharles de Milles\nDouble Delight\nGertrude Jekyll\nJude the Obscure\nPap Meilland"
        },
        {
          "headline":"Select a miniature or tea rose variety for smaller flowers.",
          "description":"Miniature and tea roses are often easier to care for, smaller overall, and they come in lots of different colors. You can even grow these varieties in a container if you do not want to plant them in your garden. Some popular tea rose varieties include:\nBaby Boomer\nBlack Jade\nCarrot Top\nDancing Flame\nGourmet Popcorn"
        }
      ]
    }
  ],
  "text":" Finding Rose Bushes for Sale Go to a local nursery to purchase common rose varieties. Visiting a local nursery is the easiest way to find rose bushes to buy. You can see the plants up close, talk to professionals about your needs, and inspect the tags on the bushes for information about how large the roses will grow to be.Tip: If you are not sure what type of rose you want to purchase, you could also visit a botanical garden. You can look at different types of roses and get ideas for your garden. You might even be able to purchase a plant to take home. Browse online nurseries for a wider selection. Nurseries only carry top-selling plants, so they are unlikely to have rare varieties of rose bushes. If you want something special that you cannot find in a nursery, then check online. You can go through a major home improvement store or check out a company that specializes in heirloom roses. Buying online may also save you money in some cases. Make sure to check your hardiness zone before you buy and only purchase roses that will thrive in your zone. Hardiness zones are divided by the average minimum temperature in winter. Look online for a map that shows what zone you are in. Look into local gardening clubs and organizations. Sometimes local gardening groups will do seed swaps and hold events where you can purchase plants. Check into your local gardening clubs and horticulture organizations to see if they have any events planned. This is also a great opportunity to learn more about what grows best in your region and to get some helpful tips for growing rose bushes. Determine the type and number of plants you will need. You can grow rose bushes from seed or plant bushes depending on your needs. Consider how many bushes you want to plant, and whether you want to buy bushes that are already growing, or start your own bushes from seeds. Planting bushes is an easier process than starting new rose bushes from seeds, but growing rose bushes from seed is more economical if you want to plant several rose bushes. Choosing Rose Bushes for Growing Features Choose shrub roses to fill in empty spaces in your garden. If you want rose bushes that will fill in some of the space in your garden without getting too big, then shrub rose bushes might be a good option. You can find rose bushes that only grow to be 2 ft (0.61 m) or ones that will get up to 5 ft (1.5 m) if you want something taller. Choose a Dunwich rose bush for a plant that only grows to about 2 ft (0.61 m). Opt for a Lady of Shallot or Queen of Sweden for a bush that will grow to about 4 ft (1.2 m). Go with a Madame Hardy or Penelope for a bush that will grow to about 5 ft (1.5 m) tall. Try a Variegata de Bologna for a rose bush that will grow up to 6.5 ft (2.0 m). Select hedge roses to add privacy to your garden. If you want something tall as a fence and that will grow well in a row, then a hedge rose might be the best choice for you. These rose bushes are dense enough to provide some privacy while still adding beauty to your garden. Go with a Cornelia or Hyde Hall for something that will reach about 5 ft (1.5 m). Try an Agnes or Roseraie de l’Hay for a 6.5 ft (2.0 m) rose bush hedge. Opt for a Nevada or Rugosa for a 7 ft (2.1 m) hedge. Try climbing roses if you want them to grow up a wall or archway. If you have a wall, archway, or other feature in your garden that you’d like to train roses to grow onto, then select a climbing rose. You may have to install a trellis to give the roses something to grow through and hold onto. Some popular climbing rose varieties include:\nAlister Stella Grey\nBush Rambler\nDublin Bay\nLaura Ford\nSchoolgirlTip: Climbing roses can grow anywhere from 7 to 30 ft (2.1 to 9.1 m). There are even some varieties that will grow up and around the trunk and branches of a tree. Go with ground cover roses to fill in bare patches with attractive foliage. If you want roses that will fill in bare patches in your garden or that will accent other types of shrubs and flowers, then a ground cover rose bush might be a good choice. These grow no more than 2 ft (0.61 m) off the ground, but they sprawl outward by 3 to 6.5 feet (0.91 to 1.98 m). Ground cover roses come in a wide range of colors, but some popular varieties include:\nMagic Carpet (bright, lavender-pink flowers)\nSnow Carpet (white flowers)\nRaubritter (pink flowers)\nMax Graf (deep pink flowers)\nNozomi (pink flowers) Selecting Roses for Appearance and Scent Choose roses in colors that will complement your garden. Opt for a rose bush with flowers that will complement the wall or other features of your property. Stick with warm tones to complement warm colors such as red, brown, orange, and yellow. Go with cool tones to complement cool toned features, such a blue, grey, and lavender. For example, you can go with red, yellow, peach, or orange roses if you want to grow them up against a brick house or a house that is painted red, brown, or yellow. Try lavender, white, or pink roses if you want to grow them near a grey or blue house or fence.Tip: Although it is not common, there are some roses that feature blue and green flowers. Check an online supplier if you want roses in an unusual color. Look into roses with ornamental stems, leaves, and thorns. If you want something exotic, try selecting a rose bush that will develop some unique foliage. You can find varieties with ornate leaves, thorns, stems, and other interesting features beyond the flowers. For example, you can find rose bush varieties with glossy leaves, like Cooperi and Lutea. Choose rosebushes with fern-like foliage, such as Multibracteata and Primula. Opt for extra thorny stems, like Canary Bird and Primula. Select bushes with leaves that change from green to a rich crimson in the fall like Nitida. Choose roses with a strong scent if you want to be able to smell them. Not all roses have a noticeable scent, which is fine if you only want to look at them. However, if you want to be able to smell the roses as soon as you walk near them, go with an extra aromatic variety of rose bush. Some highly aromatic roses include:\nCharles de Milles\nDouble Delight\nGertrude Jekyll\nJude the Obscure\nPap Meilland Select a miniature or tea rose variety for smaller flowers. Miniature and tea roses are often easier to care for, smaller overall, and they come in lots of different colors. You can even grow these varieties in a container if you do not want to plant them in your garden. Some popular tea rose varieties include:\nBaby Boomer\nBlack Jade\nCarrot Top\nDancing Flame\nGourmet Popcorn",
  "tyn_model":[
    "roses",
    "rose bushes",
    "rose bush",
    "rose",
    "plants",
    "botanical garden",
    "gardening clubs",
    "horticulture organizations",
    "bushes",
    "penelope",
    "hedge roses",
    "hedge rose",
    "hyde hall",
    "rugosa",
    "climbing rose",
    "ground cover rose bush",
    "raubritter",
    "flowers",
    "lavender",
    "tea rose",
    "popcorn"
  ],
  "tyn_section":[

  ]
}