{
  "title":"How to Make Scallop and Corn Gyoza",
  "url":"https://www.wikihow.com/Make-Scallop-and-Corn-Gyoza",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Japanese Dishes"
  ],
  "steps":[
    {
      "headline":"Discard small tough muscle from side of each scallop and in a food processor puree half scallops with sea salt.",
      "description":"With motor running add tofu in a stream and blend until just combined. Be careful not to over blend."
    },
    {
      "headline":"Transfer scallop mousse to a small bowl.",
      "description":"Chop fine remaining scallops and stir into mousse with white corn, red bell pepper, scallion, and coriander."
    },
    {
      "headline":"Put about 1 tablespoon filling in center of 1 wrapper and moisten edge of wrapper.",
      "description":"Gather edge of wrapper up and around filling, pleating edge. Gently squeeze middle of gyoza to form a waist, keeping filling level with top of wrapper."
    },
    {
      "headline":"Make 17 more gyozas in same manner and arrange on a tray dusted lightly with cornstarch.",
      "description":"Gyozas may be made up to this point 1 day ahead and chilled, covered with plastic wrap."
    },
    {
      "headline":"Heat oil in a large skillet over moderately high heat until hot but not smoking and fry gyoza bottoms until golden, about 1 minute.",
      "description":"Add water and steam gyozas, covered, 3 to 4 minutes, or until filling is springy to touch. Remove lid and cook the gyozas until liquid is evaporated and bottoms are crisped."
    },
    {
      "headline":"Serve gyozas with vinaigrette and garnish with coriander.",
      "description":""
    }
  ],
  "text":" Discard small tough muscle from side of each scallop and in a food processor puree half scallops with sea salt. With motor running add tofu in a stream and blend until just combined. Be careful not to over blend. Transfer scallop mousse to a small bowl. Chop fine remaining scallops and stir into mousse with white corn, red bell pepper, scallion, and coriander. Put about 1 tablespoon filling in center of 1 wrapper and moisten edge of wrapper. Gather edge of wrapper up and around filling, pleating edge. Gently squeeze middle of gyoza to form a waist, keeping filling level with top of wrapper. Make 17 more gyozas in same manner and arrange on a tray dusted lightly with cornstarch. Gyozas may be made up to this point 1 day ahead and chilled, covered with plastic wrap. Heat oil in a large skillet over moderately high heat until hot but not smoking and fry gyoza bottoms until golden, about 1 minute. Add water and steam gyozas, covered, 3 to 4 minutes, or until filling is springy to touch. Remove lid and cook the gyozas until liquid is evaporated and bottoms are crisped. Serve gyozas with vinaigrette and garnish with coriander. ",
  "tyn_model":[
    "coriander",
    "food processor",
    "sea salt",
    "tofu",
    "scallop",
    "small bowl",
    "scallops",
    "white corn",
    "red bell pepper",
    "scallion",
    "plastic wrap",
    "oil",
    "large skillet",
    "water"
  ],
  "tyn_section":[

  ]
}