{
  "title":"How to Measure Bends when Bending Pipes",
  "url":"https://www.wikihow.com/Measure-Bends-when-Bending-Pipes",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "steps":[
    {
      "headline":"Estimate the overall length of the pipe.",
      "description":"Depending on the length of the bends and the length of the spaces between them, determine the total length of pipe or tubing you require. Ensure that a couple of inches (or centimeters) of margin is available to accommodate any errors in calculation or judgment."
    },
    {
      "headline":"Measure the distance for the first bend.",
      "description":"From one end of the tube, mark the point for the first bend. Here, you need to carefully mark the beginning and the end of the bend. You also need to measure the distance between the bends."
    },
    {
      "headline":"Measure the distance for the second bend.",
      "description":"Repeat the previous step, but use the vertex of the first bend as the reference/ starting point instead of the end of the tube or pipe. The vertex is the exact point where the two legs of an angle intersect. Alternatively, you can use the initial reference point (the end of the tube) to measure the distance for all bends."
    },
    {
      "headline":"Measure more bends.",
      "description":"Repeat the previous step for measuring more bends. Always mark the exact spots as you go along."
    },
    {
      "headline":"Measure reverse bends.",
      "description":"Repeat step 2, but mark the direction of the bend. It is the same process except that the direction of the bend differs. You also need to deduct the gain."
    },
    {
      "headline":"Compensate for spring back when measuring.",
      "description":"All tubes and pipes, irrespective of material, experience some amount of spring back. It is dependent on the material, the angle of the bend, and the radius of the bend. This can be compensated for by using two methods:\nWith experience and the right methods, you can estimate the amount of spring back and over bend the tube; or\nYou can wait for the spring back to occur, measure the angle and then bend the tube accordingly."
    }
  ],
  "text":" Estimate the overall length of the pipe. Depending on the length of the bends and the length of the spaces between them, determine the total length of pipe or tubing you require. Ensure that a couple of inches (or centimeters) of margin is available to accommodate any errors in calculation or judgment. Measure the distance for the first bend. From one end of the tube, mark the point for the first bend. Here, you need to carefully mark the beginning and the end of the bend. You also need to measure the distance between the bends. Measure the distance for the second bend. Repeat the previous step, but use the vertex of the first bend as the reference/ starting point instead of the end of the tube or pipe. The vertex is the exact point where the two legs of an angle intersect. Alternatively, you can use the initial reference point (the end of the tube) to measure the distance for all bends. Measure more bends. Repeat the previous step for measuring more bends. Always mark the exact spots as you go along. Measure reverse bends. Repeat step 2, but mark the direction of the bend. It is the same process except that the direction of the bend differs. You also need to deduct the gain. Compensate for spring back when measuring. All tubes and pipes, irrespective of material, experience some amount of spring back. It is dependent on the material, the angle of the bend, and the radius of the bend. This can be compensated for by using two methods:\nWith experience and the right methods, you can estimate the amount of spring back and over bend the tube; or\nYou can wait for the spring back to occur, measure the angle and then bend the tube accordingly.",
  "tyn_model":[
    "tube",
    "pipe",
    "tubing",
    "tubes",
    "pipes"
  ],
  "tyn_section":[

  ]
}