{
  "title":"How to Prepare Escargot Puff Pastries Using Wild Snails",
  "url":"https://www.wikihow.com/Prepare-Escargot-Puff-Pastries-Using-Wild-Snails",
  "category_hierarchy":[
    "Food and Entertaining",
    "Food Preparation"
  ],
  "parts":[
    {
      "name":"Preparation",
      "steps":[
        {
          "headline":"Collect the snails from your garden or in the wild.",
          "description":"Choose a day there has been no rain for a long time and a downpour has just taken place; you will find snails in ditches and tall grasses."
        },
        {
          "headline":"Make the snails fast for three days.",
          "description":"This will cause them to empty their bowels. Snails should not eat in order to empty their bowels of all their excrement."
        },
        {
          "headline":"Rinse the snails under cold water mixed with vinegar and salt to remove debris or excrement on the snails’ shells",
          "description":""
        },
        {
          "headline":"Boil the snails for 20 minutes in a pot of boiling water.",
          "description":""
        },
        {
          "headline":"Remove, drain and rinse.",
          "description":""
        },
        {
          "headline":"Remove the cooked snails from their shells with a toothpick.",
          "description":""
        },
        {
          "headline":"Cut out the intestine using a chisel or with your hands.",
          "description":"Keep the slug and corolla, bearing in mind that the intestine begins where the colour turns to black."
        },
        {
          "headline":"Scrape the remaining part (the slug) with your fingernail under a clear stream of water.",
          "description":"This will help to remove the slime that could be found on the bottom."
        }
      ]
    },
    {
      "name":"Cooking the escargots in pastry",
      "steps":[
        {
          "headline":"Boil water to make a broth.",
          "description":"Add thyme, bay leaves, onions and 1 teaspoon of fish stock."
        },
        {
          "headline":"Once the water is boiling, cook the snails for 1 hour 20 minutes.",
          "description":""
        },
        {
          "headline":"Prepare the garlic butter.",
          "description":"Mix together the butter, garlic, shallots and parsley."
        },
        {
          "headline":"Mix the garlic butter and the escargots together.",
          "description":"Arrange them inside puff pastry shells, as many as needed until the snail mixture is finished. Lay in rows on a baking sheet for cooking."
        },
        {
          "headline":"Bake in the oven for 20 minutes or until the pastry looks cooked and golden.",
          "description":""
        },
        {
          "headline":"Remove from the oven.",
          "description":"It's ready to serve. Enjoy your meal!"
        }
      ]
    }
  ],
  "text":" Preparation Collect the snails from your garden or in the wild. Choose a day there has been no rain for a long time and a downpour has just taken place; you will find snails in ditches and tall grasses. Make the snails fast for three days. This will cause them to empty their bowels. Snails should not eat in order to empty their bowels of all their excrement. Rinse the snails under cold water mixed with vinegar and salt to remove debris or excrement on the snails’ shells  Boil the snails for 20 minutes in a pot of boiling water.  Remove, drain and rinse.  Remove the cooked snails from their shells with a toothpick.  Cut out the intestine using a chisel or with your hands. Keep the slug and corolla, bearing in mind that the intestine begins where the colour turns to black. Scrape the remaining part (the slug) with your fingernail under a clear stream of water. This will help to remove the slime that could be found on the bottom. Cooking the escargots in pastry Boil water to make a broth. Add thyme, bay leaves, onions and 1 teaspoon of fish stock. Once the water is boiling, cook the snails for 1 hour 20 minutes.  Prepare the garlic butter. Mix together the butter, garlic, shallots and parsley. Mix the garlic butter and the escargots together. Arrange them inside puff pastry shells, as many as needed until the snail mixture is finished. Lay in rows on a baking sheet for cooking. Bake in the oven for 20 minutes or until the pastry looks cooked and golden.  Remove from the oven. It's ready to serve. Enjoy your meal!",
  "tyn_model":[
    "water",
    "snails",
    "escargots",
    "garlic butter",
    "oven",
    "vinegar",
    "salt",
    "’ shells",
    "pot",
    "chisel",
    "thyme",
    "bay",
    "onions",
    "fish stock",
    "butter",
    "garlic",
    "shallots",
    "parsley",
    "puff pastry",
    "snail",
    "baking sheet"
  ],
  "tyn_section":[

  ]
}