{
  "title":"How to Select Units to Play in Great Little War Game 2",
  "url":"https://www.wikihow.com/Select-Units-to-Play-in-Great-Little-War-Game-2",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games"
  ],
  "methods":[
    {
      "name":"Selecting Infantry",
      "steps":[
        {
          "headline":"Select the Barracks.",
          "description":"Infantry units are the soldiers and personnel units in the game. They are made in the Barracks. Tap on the Barracks to see what units are available. Not all units are available at all times. The units’ availability may depend on the mission, on your Battle Stars, or on your available gold coins."
        },
        {
          "headline":"Know the Infantry.",
          "description":"There are seven different Infantry units in the game. A unit can be a combat or a non-combat unit. Combat units are those that can fight, attack, and defend themselves. Non-combat units are those that cannot fight, but have specialized purposes. A Grunt is identified by the rifle it carries. It is the basic unit for combat. It costs 75 gold coins. A Bazooka is identified by the bazooka it carries. It is a powerful anti-tank and anti-ship combat unit. It costs 125 gold coins. An Engineer is identified by the wrench it carries. It is used to take over empty or enemy structures. It is a non-combat unit, but highly essential. When you use an Engineer, you should escort it with at least another combat unit. It costs 100 gold coins. A Grenadier is identified by the grenade it carries. It is a powerful combat unit against infantry and vehicles, causing a splashed damaged across all units nearby. It costs 200 gold coins. A Sniper is identified by the sniper rifle it carries and is always lying on the ground. It is a powerful combat unit against infantry, able to take an enemy out with just one shot. It costs 200 gold coins. A Commando is identified by the turban on its head. It is a powerful combat unit against infantry and cannot be easily taken down. It costs 650 gold coins. A Medic is identified by the med kit it carries. It is a non-combat unit, but highly essential. When you use a Medic, you should escort it with at least another combat unit. It costs 200 gold coins."
        },
        {
          "headline":"Buy the unit.",
          "description":"Tap on the unit you want to build then tap the “Buy” button. The selected unit will immediately be generated from the Barracks, ready for use. You can only buy a unit that you can afford."
        }
      ]
    },
    {
      "name":"Selecting Vehicles",
      "steps":[
        {
          "headline":"Select the Factory.",
          "description":"Vehicle units are the land-based transportation and attack vehicles. They are made in the Factory. Tap on the Factory to see what units are available. Not all units are available at all times. The units’ availability may depend on the mission, on your Battle Stars, or on your available gold coins."
        },
        {
          "headline":"Know the Vehicles.",
          "description":"There are nine different Vehicle units in the game. A Jeep can transport infantry quickly to different locations on the map. It is a non-combat unit. It costs 75 gold coins. An Anti-Air Vehicle is a good combat unit against airborne units. It can’t attack other types of units though. It costs 150 gold coins. A Recon Tank is a fast vehicle, but doesn’t do much damage. It costs 100 gold coins. A Battle Tank is the main and basic battle tank, good against other vehicles. It costs 250 gold coins. A Tank Killer is a tougher version of the basic Battle Tank. It can take out most vehicles with just one shot. It costs 250 gold coins. A Behemoth is the toughest vehicle around. It can withstand some damage, and it can deliver great damage to enemy infantry, vehicles, ships, and buildings. It costs 500 gold coins. A Flame Tank is a new anti-infantry vehicle, able to take most out with just one shot at near-range. It costs 200 gold coins. An Artillery is your best anti-infantry vehicle, able to take most out with just one shot at a wider range. It costs 400 gold coins. A MLRS is your best anti-vehicle vehicle, able to deliver a lot of damage to vehicles and ships in one shot. It costs 400 gold coins."
        },
        {
          "headline":"Buy the unit.",
          "description":"Tap on the unit you want to build then tap on the “Buy” button with the amount of gold coins needed to make it. The selected unit will immediately be generated from the Factory, ready for use. You can only buy a unit that you can afford."
        }
      ]
    },
    {
      "name":"Selecting Airborne Units",
      "steps":[
        {
          "headline":"Select the Airbase.",
          "description":"Airborne units are the air-based transportation and attack units. They are made in the Airbase. Tap on the Airbase to see what units are available. Not all units are available at all times. The units’ availability may depend on the mission, on your Battle Stars, or on your available gold coins."
        },
        {
          "headline":"Know the Airborne units.",
          "description":"There are four different Airborne units in the game. A Sky Hook can transport infantry and vehicles quickly to different locations on the map. It is a non-combat unit. It costs 100 gold coins. A Chopper is the most flexible airborne unit available, able to attack all types of targets within its range. It costs 300 gold coins. A Fighter is the ultimate anti-air unit, able to attack and take down all types of airborne units. It can only attack airborne units. It costs 200 gold coins. A Bomber is the ultimate air unit against all types of units, except for airborne units. It’s basically the opposite of a Fighter. It costs 350 gold coins."
        },
        {
          "headline":"Buy the unit.",
          "description":"Tap on the unit you want to build then tap on the “Buy” button with the amount of gold coins needed to make it. You can only buy a unit that you can afford. The selected unit will immediately be generated from the Airbase, ready for use."
        }
      ]
    },
    {
      "name":"Selecting Ships",
      "steps":[
        {
          "headline":"Select the Shipyard.",
          "description":"Ships are the sea-based transportation and attack units. They are made in the Shipyard. Tap on the Shipyard to see what units are available. Not all units are available at all times. The units’ availability may depend on the mission, on your Battle Stars, or on your available gold coins."
        },
        {
          "headline":"Know the Ships.",
          "description":"There are four different Ship units in the game. A Ferry can transport infantry and vehicles quickly across the water. It is a non-combat unit. It costs 50 gold coins. A Destroyer is the ultimate anti-ship unit, able to attack and take down all types of ship units. It can only attack ships and is vulnerable to Bombers. It costs 250 gold coins. An Aegis is the only ship that can attack airborne units. It can’t attack other types of units though. It costs 125 gold coins. A Cruiser is the best ship to attack land-based units, such as infantry and vehicles, able to deliver much damage to them. It costs 400 gold coins."
        },
        {
          "headline":"Buy the unit.",
          "description":"Tap on the unit you want to build then tap on the “Buy” button with the amount of gold coins needed to make it. The selected unit will immediately be generated from the Shipyard, ready for use. You can only buy a unit that you can afford."
        }
      ]
    }
  ],
  "text":" Selecting Infantry Select the Barracks. Infantry units are the soldiers and personnel units in the game. They are made in the Barracks. Tap on the Barracks to see what units are available. Not all units are available at all times. The units’ availability may depend on the mission, on your Battle Stars, or on your available gold coins. Know the Infantry. There are seven different Infantry units in the game. A unit can be a combat or a non-combat unit. Combat units are those that can fight, attack, and defend themselves. Non-combat units are those that cannot fight, but have specialized purposes. A Grunt is identified by the rifle it carries. It is the basic unit for combat. It costs 75 gold coins. A Bazooka is identified by the bazooka it carries. It is a powerful anti-tank and anti-ship combat unit. It costs 125 gold coins. An Engineer is identified by the wrench it carries. It is used to take over empty or enemy structures. It is a non-combat unit, but highly essential. When you use an Engineer, you should escort it with at least another combat unit. It costs 100 gold coins. A Grenadier is identified by the grenade it carries. It is a powerful combat unit against infantry and vehicles, causing a splashed damaged across all units nearby. It costs 200 gold coins. A Sniper is identified by the sniper rifle it carries and is always lying on the ground. It is a powerful combat unit against infantry, able to take an enemy out with just one shot. It costs 200 gold coins. A Commando is identified by the turban on its head. It is a powerful combat unit against infantry and cannot be easily taken down. It costs 650 gold coins. A Medic is identified by the med kit it carries. It is a non-combat unit, but highly essential. When you use a Medic, you should escort it with at least another combat unit. It costs 200 gold coins. Buy the unit. Tap on the unit you want to build then tap the “Buy” button. The selected unit will immediately be generated from the Barracks, ready for use. You can only buy a unit that you can afford. Selecting Vehicles Select the Factory. Vehicle units are the land-based transportation and attack vehicles. They are made in the Factory. Tap on the Factory to see what units are available. Not all units are available at all times. The units’ availability may depend on the mission, on your Battle Stars, or on your available gold coins. Know the Vehicles. There are nine different Vehicle units in the game. A Jeep can transport infantry quickly to different locations on the map. It is a non-combat unit. It costs 75 gold coins. An Anti-Air Vehicle is a good combat unit against airborne units. It can’t attack other types of units though. It costs 150 gold coins. A Recon Tank is a fast vehicle, but doesn’t do much damage. It costs 100 gold coins. A Battle Tank is the main and basic battle tank, good against other vehicles. It costs 250 gold coins. A Tank Killer is a tougher version of the basic Battle Tank. It can take out most vehicles with just one shot. It costs 250 gold coins. A Behemoth is the toughest vehicle around. It can withstand some damage, and it can deliver great damage to enemy infantry, vehicles, ships, and buildings. It costs 500 gold coins. A Flame Tank is a new anti-infantry vehicle, able to take most out with just one shot at near-range. It costs 200 gold coins. An Artillery is your best anti-infantry vehicle, able to take most out with just one shot at a wider range. It costs 400 gold coins. A MLRS is your best anti-vehicle vehicle, able to deliver a lot of damage to vehicles and ships in one shot. It costs 400 gold coins. Buy the unit. Tap on the unit you want to build then tap on the “Buy” button with the amount of gold coins needed to make it. The selected unit will immediately be generated from the Factory, ready for use. You can only buy a unit that you can afford. Selecting Airborne Units Select the Airbase. Airborne units are the air-based transportation and attack units. They are made in the Airbase. Tap on the Airbase to see what units are available. Not all units are available at all times. The units’ availability may depend on the mission, on your Battle Stars, or on your available gold coins. Know the Airborne units. There are four different Airborne units in the game. A Sky Hook can transport infantry and vehicles quickly to different locations on the map. It is a non-combat unit. It costs 100 gold coins. A Chopper is the most flexible airborne unit available, able to attack all types of targets within its range. It costs 300 gold coins. A Fighter is the ultimate anti-air unit, able to attack and take down all types of airborne units. It can only attack airborne units. It costs 200 gold coins. A Bomber is the ultimate air unit against all types of units, except for airborne units. It’s basically the opposite of a Fighter. It costs 350 gold coins. Buy the unit. Tap on the unit you want to build then tap on the “Buy” button with the amount of gold coins needed to make it. You can only buy a unit that you can afford. The selected unit will immediately be generated from the Airbase, ready for use. Selecting Ships Select the Shipyard. Ships are the sea-based transportation and attack units. They are made in the Shipyard. Tap on the Shipyard to see what units are available. Not all units are available at all times. The units’ availability may depend on the mission, on your Battle Stars, or on your available gold coins. Know the Ships. There are four different Ship units in the game. A Ferry can transport infantry and vehicles quickly across the water. It is a non-combat unit. It costs 50 gold coins. A Destroyer is the ultimate anti-ship unit, able to attack and take down all types of ship units. It can only attack ships and is vulnerable to Bombers. It costs 250 gold coins. An Aegis is the only ship that can attack airborne units. It can’t attack other types of units though. It costs 125 gold coins. A Cruiser is the best ship to attack land-based units, such as infantry and vehicles, able to deliver much damage to them. It costs 400 gold coins. Buy the unit. Tap on the unit you want to build then tap on the “Buy” button with the amount of gold coins needed to make it. The selected unit will immediately be generated from the Shipyard, ready for use. You can only buy a unit that you can afford.",
  "tyn_model":[
    "’ availability",
    "“buy",
    "” button",
    "infantry",
    "ships",
    "bazooka",
    "engineer",
    "medic",
    "vehicles",
    "tank",
    "fighter",
    "grunt",
    "rifle",
    "wrench",
    "grenadier",
    "grenade",
    "sniper",
    "sniper rifle",
    "commando",
    "vehicle",
    "jeep",
    "battle tank",
    "tank killer",
    "behemoth",
    "artillery",
    "air-based transportation and attack units",
    "sky hook",
    "chopper",
    "bomber",
    "ferry",
    "water",
    "destroyer",
    "bombers",
    "aegis",
    "cruiser"
  ],
  "tyn_section":[

  ]
}