{
  "title":"How to Make Candy Clay",
  "url":"https://www.wikihow.com/Make-Candy-Clay",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy",
    "Sugar Treats"
  ],
  "steps":[
    {
      "headline":"Place the 4 cups of powdered sugar into a bowl.",
      "description":""
    },
    {
      "headline":"Pour the 4 tablespoons of water into the bowl, with the powdered sugar.",
      "description":"Stir the ingredients together until combined."
    },
    {
      "headline":"Knead the candy clay until it turns soft and clay-like.",
      "description":""
    },
    {
      "headline":"Break the candy clay into four evenly-sized pieces.",
      "description":""
    },
    {
      "headline":"Add 2 drops of any color of food coloring onto each of the pieces of candy clay.",
      "description":"Mix with the spoon. If you don't want to use food coloring, you can use vanilla extract for a cream color, a small sprinkling of liquid made with cocoa powder for brown/chocolate brown or a little fruit juice for a red, orange, yellow, etc., depending on which juice you've used. Note that these will also flavor the candy clay."
    },
    {
      "headline":"Make any shape you want.",
      "description":""
    },
    {
      "headline":"Let dry and harden.",
      "description":"When done, the candy clay is ready to be eaten."
    }
  ],
  "text":" Place the 4 cups of powdered sugar into a bowl.  Pour the 4 tablespoons of water into the bowl, with the powdered sugar. Stir the ingredients together until combined. Knead the candy clay until it turns soft and clay-like.  Break the candy clay into four evenly-sized pieces.  Add 2 drops of any color of food coloring onto each of the pieces of candy clay. Mix with the spoon. If you don't want to use food coloring, you can use vanilla extract for a cream color, a small sprinkling of liquid made with cocoa powder for brown/chocolate brown or a little fruit juice for a red, orange, yellow, etc., depending on which juice you've used. Note that these will also flavor the candy clay. Make any shape you want.  Let dry and harden. When done, the candy clay is ready to be eaten.",
  "tyn_model":[
    "candy clay",
    "powdered sugar",
    "bowl",
    "food coloring",
    "water",
    "spoon",
    "vanilla extract",
    "cocoa powder",
    "fruit juice"
  ],
  "tyn_section":[

  ]
}