{
  "title":"How to Make Vegetable and Egg Bean Burritos",
  "url":"https://www.wikihow.com/Make-Vegetable-and-Egg-Bean-Burritos",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian"
  ],
  "parts":[
    {
      "name":"Cutting the Veggies",
      "steps":[
        {
          "headline":"Wash your hands.",
          "description":"Clean your counter and set out a kitchen knife and a cutting board. Gather all the ingredients you will need. Make sure to have the proper equipment to stir and cook with."
        },
        {
          "headline":"Set the red bell pepper on the cutting board.",
          "description":"Using the kitchen knife, dice the red bell peppers carefully."
        },
        {
          "headline":"Set the green pepper on the cutting board.",
          "description":"Dice the green peppers carefully."
        },
        {
          "headline":"Set the tomato on the cutting board.",
          "description":"Be careful not to get too much pulp everywhere. Dice the tomatoes carefully."
        },
        {
          "headline":"Combine the vegetables into a bowl.",
          "description":"Set aside for later. Wash hands."
        }
      ]
    },
    {
      "name":"Cooking the Eggs",
      "steps":[
        {
          "headline":"Turn on the burner to low heat.",
          "description":""
        },
        {
          "headline":"Crack all of the desired eggs into the bowl.",
          "description":"Using the whisk, stir for about 1-2 minutes. Make sure the eggs get lots of air. Then after stirring add, 1/2 teaspoon salt and a pinch of pepper into the egg mixture."
        },
        {
          "headline":"Using a wooden spoon, carefully scrape the egg mixture into a saucepan on the burner.",
          "description":"Let the eggs sit for a few moments."
        },
        {
          "headline":"Wash your hands.",
          "description":"Using the wooden spoon, push the egg mixture to the sides of the pan slowly until they become scrambled. Then, flip the eggs and listen for a sizzle."
        },
        {
          "headline":"Sprinkle cheddar cheese on top of the eggs.",
          "description":"Melt the cheese. Turn off the burner. Let sit aside until ready to be used."
        }
      ]
    },
    {
      "name":"Preparing the Beans",
      "steps":[
        {
          "headline":"Open the can of beans.",
          "description":"Drain any excess water with a colander. Rinse the beans."
        },
        {
          "headline":"Put the beans into a frying pan.",
          "description":"Turn on the burner to medium heat. Stir the beans with a wooden spoon."
        },
        {
          "headline":"Once the beans look about ready, scrape the beans into a bowl with the wooden spoon.",
          "description":""
        },
        {
          "headline":"Turn off the burner, wash your hands, and go to your eggs.",
          "description":""
        }
      ]
    },
    {
      "name":"Combining the Foods",
      "steps":[
        {
          "headline":"Stir the eggs just a little bit.",
          "description":"Get the bowl of veggies and the cooked beans."
        },
        {
          "headline":"Add the vegetables.",
          "description":"Turn on the burner to medium heat. Then stir for about 1 minute."
        },
        {
          "headline":"Push the eggs and veggies into sections.",
          "description":"Turn off the burner and prepare the beans and tortillas."
        },
        {
          "headline":"Put 1 egg and a veggie section on the tortilla.",
          "description":"Spread the ingredients across the tortilla. Add 2 cups of beans onto the tortilla."
        },
        {
          "headline":"Fold the tortilla into a burrito.",
          "description":"Do the same until all the eggs and veggie sections are used. Then, enjoy!"
        }
      ]
    }
  ],
  "text":" Cutting the Veggies Wash your hands. Clean your counter and set out a kitchen knife and a cutting board. Gather all the ingredients you will need. Make sure to have the proper equipment to stir and cook with. Set the red bell pepper on the cutting board. Using the kitchen knife, dice the red bell peppers carefully. Set the green pepper on the cutting board. Dice the green peppers carefully. Set the tomato on the cutting board. Be careful not to get too much pulp everywhere. Dice the tomatoes carefully. Combine the vegetables into a bowl. Set aside for later. Wash hands. Cooking the Eggs Turn on the burner to low heat.  Crack all of the desired eggs into the bowl. Using the whisk, stir for about 1-2 minutes. Make sure the eggs get lots of air. Then after stirring add, 1/2 teaspoon salt and a pinch of pepper into the egg mixture. Using a wooden spoon, carefully scrape the egg mixture into a saucepan on the burner. Let the eggs sit for a few moments. Wash your hands. Using the wooden spoon, push the egg mixture to the sides of the pan slowly until they become scrambled. Then, flip the eggs and listen for a sizzle. Sprinkle cheddar cheese on top of the eggs. Melt the cheese. Turn off the burner. Let sit aside until ready to be used. Preparing the Beans Open the can of beans. Drain any excess water with a colander. Rinse the beans. Put the beans into a frying pan. Turn on the burner to medium heat. Stir the beans with a wooden spoon. Once the beans look about ready, scrape the beans into a bowl with the wooden spoon.  Turn off the burner, wash your hands, and go to your eggs.  Combining the Foods Stir the eggs just a little bit. Get the bowl of veggies and the cooked beans. Add the vegetables. Turn on the burner to medium heat. Then stir for about 1 minute. Push the eggs and veggies into sections. Turn off the burner and prepare the beans and tortillas. Put 1 egg and a veggie section on the tortilla. Spread the ingredients across the tortilla. Add 2 cups of beans onto the tortilla. Fold the tortilla into a burrito. Do the same until all the eggs and veggie sections are used. Then, enjoy!",
  "tyn_model":[
    "eggs",
    "burner",
    "bowl",
    "wooden spoon",
    "beans",
    "kitchen knife",
    "cutting board",
    "vegetables",
    "red bell pepper",
    "red bell peppers",
    "green pepper",
    "green peppers",
    "tomato",
    "tomatoes",
    "whisk",
    "salt",
    "pepper",
    "saucepan",
    "cheddar cheese",
    "water",
    "colander",
    "frying pan",
    "veggies",
    "tortillas",
    "egg"
  ],
  "tyn_section":[

  ]
}