{
  "title":"How to Change Your Minecraft Username",
  "url":"https://www.wikihow.com/Change-Your-Minecraft-Username",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games",
    "Online Games",
    "Minecraft"
  ],
  "steps":[
    {
      "headline":"Understand the limitations.",
      "description":"You cannot change your name if you created the account within the last 30 days, nor can you change your name more than once every 30 days. You also must change your name to a name that hasn't been chosen by someone else at this point. Your name must be longer than 2 characters and can only use underscores, letters, and numbers. Changing your in-game username does not change your Minecraft website profile name."
    },
    {
      "headline":"Open the Mojang site.",
      "description":"Go to https://www.mojang.com/ in your browser."
    },
    {
      "headline":"Click ACCOUNT.",
      "description":"This tab is in the upper-right side of the page."
    },
    {
      "headline":"Click Log in.",
      "description":"It's in the upper-right side of the page. If you're already logged in, skip this step and the next two steps."
    },
    {
      "headline":"Enter your login information.",
      "description":"Type your email address and password into the labeled fields on this page."
    },
    {
      "headline":"Click Log in.",
      "description":"It's a green button near the bottom of the page."
    },
    {
      "headline":"Find the \"Profile Name\" section.",
      "description":"It is located near the middle of the page."
    },
    {
      "headline":"Click Change.",
      "description":"It's a link to the right of your current username."
    },
    {
      "headline":"Enter a new profile name.",
      "description":"In the text field near the top of the page, type in the username that you want to use."
    },
    {
      "headline":"Click Check availability.",
      "description":"It's a grey button to the right of the profile name text field. This will check your username to see if it's already taken; if not, you'll see a green \"username is available\" message appear. If the username is already taken, you'll see a red \"username is in use\" message appear. If so, try a different username, or try spelling your selected username differently, and then click Check availability again."
    },
    {
      "headline":"Enter your password.",
      "description":"In the \"Password\" text field near the bottom of the page, type in the password that you use to log into your Minecraft account."
    },
    {
      "headline":"Click Change name.",
      "description":"It's at the bottom of the page. Doing so will change your current username to your new username immediately; you should see this change reflected the next time that you log into Minecraft on your Windows or Mac computer. After a successful name change, you won't be able to change your name for another 30 days. Your old username will be available for 7 days, meaning that you'll have a week to change your new username back to your old one if you decide to do so."
    }
  ],
  "text":" Understand the limitations. You cannot change your name if you created the account within the last 30 days, nor can you change your name more than once every 30 days. You also must change your name to a name that hasn't been chosen by someone else at this point. Your name must be longer than 2 characters and can only use underscores, letters, and numbers. Changing your in-game username does not change your Minecraft website profile name. Open the Mojang site. Go to https://www.mojang.com/ in your browser. Click ACCOUNT. This tab is in the upper-right side of the page. Click Log in. It's in the upper-right side of the page. If you're already logged in, skip this step and the next two steps. Enter your login information. Type your email address and password into the labeled fields on this page. Click Log in. It's a green button near the bottom of the page. Find the \"Profile Name\" section. It is located near the middle of the page. Click Change. It's a link to the right of your current username. Enter a new profile name. In the text field near the top of the page, type in the username that you want to use. Click Check availability. It's a grey button to the right of the profile name text field. This will check your username to see if it's already taken; if not, you'll see a green \"username is available\" message appear. If the username is already taken, you'll see a red \"username is in use\" message appear. If so, try a different username, or try spelling your selected username differently, and then click Check availability again. Enter your password. In the \"Password\" text field near the bottom of the page, type in the password that you use to log into your Minecraft account. Click Change name. It's at the bottom of the page. Doing so will change your current username to your new username immediately; you should see this change reflected the next time that you log into Minecraft on your Windows or Mac computer. After a successful name change, you won't be able to change your name for another 30 days. Your old username will be available for 7 days, meaning that you'll have a week to change your new username back to your old one if you decide to do so.",
  "tyn_model":[
    "minecraft website profile name",
    "minecraft account",
    "minecraft"
  ],
  "tyn_section":[

  ]
}