{
  "title":"How to Draw Miss La Sen's Head",
  "url":"https://www.wikihow.com/Draw-Miss-La-Sen%27s-Head",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Drawing"
  ],
  "steps":[
    {
      "headline":"Draw an oval for Miss La Sen's head.",
      "description":""
    },
    {
      "headline":"Add two half circles on the sides of her head for the ears.",
      "description":""
    },
    {
      "headline":"Sketch in a headband.",
      "description":"Draw the hairband in lightly; the middle of the headband will be erased next."
    },
    {
      "headline":"Erase the middle of the headband.",
      "description":"Draw a dotted bow."
    },
    {
      "headline":"Draw a five-petaled flower on her right ear.",
      "description":"This should be positioned about a third of the way down her ear."
    },
    {
      "headline":"Sketch in two ovals for the eyes.",
      "description":"Draw two white dots within each eye, with one of the dots being bigger than the other. Make the dots inside the eyes symmetrical."
    },
    {
      "headline":"Add the eyelids to the top insides of the eyes.",
      "description":""
    },
    {
      "headline":"Accentuate the finished eyes with eyelashes and eyebrows.",
      "description":"Draw three eyelashes for each eye."
    },
    {
      "headline":"Draw the nose right in the middle of her face, a little off to the left side.",
      "description":"Keep it rather small compared to the rest of Miss La Sen's face."
    },
    {
      "headline":"Draw a perfectly round cheek on each side of her face.",
      "description":"Make it so that the left one isn't complete."
    },
    {
      "headline":"Draw her smiling mouth.",
      "description":"Don't forget to add the tongue!"
    },
    {
      "headline":"Color in the drawing.",
      "description":"Use pencils, paints, markers or other coloring tools to complete the image."
    }
  ],
  "text":" Draw an oval for Miss La Sen's head.  Add two half circles on the sides of her head for the ears.  Sketch in a headband. Draw the hairband in lightly; the middle of the headband will be erased next. Erase the middle of the headband. Draw a dotted bow. Draw a five-petaled flower on her right ear. This should be positioned about a third of the way down her ear. Sketch in two ovals for the eyes. Draw two white dots within each eye, with one of the dots being bigger than the other. Make the dots inside the eyes symmetrical. Add the eyelids to the top insides of the eyes.  Accentuate the finished eyes with eyelashes and eyebrows. Draw three eyelashes for each eye. Draw the nose right in the middle of her face, a little off to the left side. Keep it rather small compared to the rest of Miss La Sen's face. Draw a perfectly round cheek on each side of her face. Make it so that the left one isn't complete. Draw her smiling mouth. Don't forget to add the tongue! Color in the drawing. Use pencils, paints, markers or other coloring tools to complete the image.",
  "tyn_model":[
    "flower",
    "eyebrows",
    "sen",
    "paints",
    "markers",
    "coloring tools"
  ],
  "tyn_section":[

  ]
}