{
  "title":"How to Cook a Nutritious Low Cost Rice Vegetable Side Dish",
  "url":"https://www.wikihow.com/Cook-a-Nutritious-Low-Cost-Rice-Vegetable-Side-Dish",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Vegetarian",
    "Meat Substitutes"
  ],
  "steps":[
    {
      "headline":"Decide what you want to add to the dish.",
      "description":"Clean out the refrigerator, and use up those 1/2 filled bags of mixed vegetables in the freezer. This example will make use of 1/2 an onion, one medium carrot, and 1/2 bag of frozen cut green beans."
    },
    {
      "headline":"Dice the onion into small (3 mm - 1/8\" ) pieces.",
      "description":"Scrub, carefully peel, then quarter  and cut the carrot into 6 mm -1/4\" sections."
    },
    {
      "headline":"Place the onions, carrots, 1/4 teaspoon of nutmeg, 1/2 teaspoon cumin, and 1/2 teaspoon of turmeric into a saucepan.",
      "description":"Add 6 milliliters (0.20  fl oz) - 2 tablespoons of cooking oil."
    },
    {
      "headline":"Heat the pan until the onion absorbs the oil, do not soften or brown.",
      "description":""
    },
    {
      "headline":"Turn off the heat, and add 2 cups of white rice.",
      "description":"Stir the mixture until the rice is coated with oil."
    },
    {
      "headline":"If you use the stove top, add 500 milliliters (16.9  fl oz) (about 2 cups) of cold  water to the saucepan.",
      "description":"Place the green beans on top of the mixture. Heat covered until the water is absorbed and the rice and vegetables are cooked. This takes about twenty minutes."
    },
    {
      "headline":"If you use a rice cooker, put the contents of the saucepan into the cooker, and add 360 milliliters (12.2  fl oz) (about 3 cups) of cold water.",
      "description":"Place the green beans on top of the mixture. Cover and wait until the cooker finishes. Ours takes about fifteen minutes."
    },
    {
      "headline":"Enjoy.",
      "description":""
    }
  ],
  "text":" Decide what you want to add to the dish. Clean out the refrigerator, and use up those 1/2 filled bags of mixed vegetables in the freezer. This example will make use of 1/2 an onion, one medium carrot, and 1/2 bag of frozen cut green beans. Dice the onion into small (3 mm - 1/8\" ) pieces. Scrub, carefully peel, then quarter  and cut the carrot into 6 mm -1/4\" sections. Place the onions, carrots, 1/4 teaspoon of nutmeg, 1/2 teaspoon cumin, and 1/2 teaspoon of turmeric into a saucepan. Add 6 milliliters (0.20  fl oz) - 2 tablespoons of cooking oil. Heat the pan until the onion absorbs the oil, do not soften or brown.  Turn off the heat, and add 2 cups of white rice. Stir the mixture until the rice is coated with oil. If you use the stove top, add 500 milliliters (16.9  fl oz) (about 2 cups) of cold  water to the saucepan. Place the green beans on top of the mixture. Heat covered until the water is absorbed and the rice and vegetables are cooked. This takes about twenty minutes. If you use a rice cooker, put the contents of the saucepan into the cooker, and add 360 milliliters (12.2  fl oz) (about 3 cups) of cold water. Place the green beans on top of the mixture. Cover and wait until the cooker finishes. Ours takes about fifteen minutes. Enjoy. ",
  "tyn_model":[
    "onion",
    "saucepan",
    "carrot",
    "green beans",
    "cooker",
    "refrigerator",
    "mixed vegetables",
    "frozen cut green beans",
    "onions",
    "carrots",
    "nutmeg",
    "cumin",
    "turmeric",
    "cooking oil",
    "pan",
    "white rice",
    "oil",
    "stove top",
    "cold  water",
    "water",
    "rice",
    "rice cooker",
    "cold water"
  ],
  "tyn_section":[

  ]
}