{
  "title":"How to Create Scissor Cutting Skills Activities for Kids",
  "url":"https://www.wikihow.com/Create-Scissor-Cutting-Skills-Activities-for-Kids",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Craft for Kids"
  ],
  "methods":[
    {
      "name":"Collage Making",
      "steps":[
        {
          "headline":"Cut a sheet of colored paper into small shapes of squares or triangles.",
          "description":""
        },
        {
          "headline":"Repeat the above step for other colored sheets.",
          "description":""
        },
        {
          "headline":"Draw an outline of the collage image onto the background paper.",
          "description":"Start pasting on the cut colored papers, piece by piece, staying within the boundary of the image."
        },
        {
          "headline":"Ask your child to repeat the aforementioned steps until the collage has been completed.",
          "description":"Or, make more to continue the cutting skills practice."
        }
      ]
    },
    {
      "name":"Plastic Straw Bracelets\\/Necklaces",
      "steps":[
        {
          "headline":"Cut a straw into equal parts.",
          "description":"Cut each part at a measurement of approximately 1-2 cm. (You can cut the first one as a guidance for your child to follow.)"
        },
        {
          "headline":"Repeat the above step with the remaining straws.",
          "description":""
        },
        {
          "headline":"Arrange the cut straws (by color).",
          "description":"They can be put together depending on the pattern or color assembly the child likes the most."
        },
        {
          "headline":"Take a strand of thread.",
          "description":"It needs to be long enough to make a bracelet or a necklace, so measure the child's wrist or neck before cutting."
        },
        {
          "headline":"Have the child thread the cut straw pieces onto the strand of thread.",
          "description":""
        },
        {
          "headline":"Knot the ends of the strand.",
          "description":"You may need to help with this part."
        },
        {
          "headline":"Ask your child to repeat the aforementioned steps and make more necklaces.",
          "description":""
        }
      ]
    },
    {
      "name":"Colorful Window Hangings",
      "steps":[
        {
          "headline":"Use this method for teaching clean cutting.",
          "description":"Let your kids make vibrant window hangings for their room by following the steps below. This craft will teach your children to cleanly cut across an image boundary."
        },
        {
          "headline":"Find some outline prints of fun shapes.",
          "description":"Choose images such as animals, cartoon characters or vehicles. Print off the image on paper."
        },
        {
          "headline":"Neatly color the image.",
          "description":""
        },
        {
          "headline":"Cut around the outline of the image.",
          "description":""
        },
        {
          "headline":"Punch a hole on the top of the cut image.",
          "description":""
        },
        {
          "headline":"Tie a strand of thread to the image.",
          "description":"Tie it around a window pelmet or other suitable place for hanging."
        },
        {
          "headline":"Ask your child to repeat the aforementioned steps with the other images.",
          "description":"Practice hones the cutting skills."
        }
      ]
    },
    {
      "name":"Shapes Chart",
      "steps":[
        {
          "headline":"On the colored paper, outline a shape using a stencil.",
          "description":"Or, draw it with a free hand."
        },
        {
          "headline":"Cut around the outline of the shape drawn.",
          "description":""
        },
        {
          "headline":"Paste the shape onto chart/graph paper.",
          "description":"Label it."
        },
        {
          "headline":"Ask your child to repeat the aforementioned steps for the remaining shapes.",
          "description":""
        }
      ]
    },
    {
      "name":"Lion Face On Paper Plates",
      "steps":[
        {
          "headline":"Using crayons, color the entire centre portion of a thermocol or paper plate.",
          "description":"Stick to colors such as yellow and orange, to match the colors of the lion."
        },
        {
          "headline":"Color the side boundary of the plate.",
          "description":"Use such colors as brown and red."
        },
        {
          "headline":"Draw the eyes and the nose of the lion.",
          "description":""
        },
        {
          "headline":"Cut fringes across the sides of the plate.",
          "description":"Show the child how to to do this gently, leaving a distance of 1 cm between each of the cuts. (This is also helping your child to learn to judge equal distances.)"
        },
        {
          "headline":"Ask your child to repeat the aforementioned steps until the fringe has been completed.",
          "description":""
        },
        {
          "headline":"Hang or lean the lion somewhere to display it.",
          "description":""
        }
      ]
    }
  ],
  "text":" Collage Making Cut a sheet of colored paper into small shapes of squares or triangles.  Repeat the above step for other colored sheets.  Draw an outline of the collage image onto the background paper. Start pasting on the cut colored papers, piece by piece, staying within the boundary of the image. Ask your child to repeat the aforementioned steps until the collage has been completed. Or, make more to continue the cutting skills practice. Plastic Straw Bracelets\\/Necklaces Cut a straw into equal parts. Cut each part at a measurement of approximately 1-2 cm. (You can cut the first one as a guidance for your child to follow.) Repeat the above step with the remaining straws.  Arrange the cut straws (by color). They can be put together depending on the pattern or color assembly the child likes the most. Take a strand of thread. It needs to be long enough to make a bracelet or a necklace, so measure the child's wrist or neck before cutting. Have the child thread the cut straw pieces onto the strand of thread.  Knot the ends of the strand. You may need to help with this part. Ask your child to repeat the aforementioned steps and make more necklaces.  Colorful Window Hangings Use this method for teaching clean cutting. Let your kids make vibrant window hangings for their room by following the steps below. This craft will teach your children to cleanly cut across an image boundary. Find some outline prints of fun shapes. Choose images such as animals, cartoon characters or vehicles. Print off the image on paper. Neatly color the image.  Cut around the outline of the image.  Punch a hole on the top of the cut image.  Tie a strand of thread to the image. Tie it around a window pelmet or other suitable place for hanging. Ask your child to repeat the aforementioned steps with the other images. Practice hones the cutting skills. Shapes Chart On the colored paper, outline a shape using a stencil. Or, draw it with a free hand. Cut around the outline of the shape drawn.  Paste the shape onto chart/graph paper. Label it. Ask your child to repeat the aforementioned steps for the remaining shapes.  Lion Face On Paper Plates Using crayons, color the entire centre portion of a thermocol or paper plate. Stick to colors such as yellow and orange, to match the colors of the lion. Color the side boundary of the plate. Use such colors as brown and red. Draw the eyes and the nose of the lion.  Cut fringes across the sides of the plate. Show the child how to to do this gently, leaving a distance of 1 cm between each of the cuts. (This is also helping your child to learn to judge equal distances.) Ask your child to repeat the aforementioned steps until the fringe has been completed.  Hang or lean the lion somewhere to display it. ",
  "tyn_model":[
    "thread",
    "colored paper",
    "paper",
    "plate",
    "lion",
    "colored papers",
    "plastic straw bracelets\\/necklaces",
    "straw",
    "stencil",
    "chart/graph paper",
    "crayons",
    "thermocol or paper plate"
  ],
  "tyn_section":[

  ]
}