{
  "title":"How to Save Tomato and Pepper Seeds from a Garden",
  "url":"https://www.wikihow.com/Save-Tomato-and-Pepper-Seeds-from-a-Garden",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Planting and Growing",
    "Growing Vegetables"
  ],
  "methods":[
    {
      "name":"Saving Tomato Seeds",
      "steps":[
        {
          "headline":"Realize that not every seed saved will produce the same plant next year.",
          "description":"For example if you grow \"Beefsteak\" tomatoes and harvest seeds, more than likely they will produce some different, inferior tomato the following year. With tomatoes, the seeds you want to harvest are \"Heirloom\" tomatoes. Heirloom seeds are simply a variety where the seed can be harvested form a plant, saved, replanted, and the same variety will regrow the following year."
        },
        {
          "headline":"Collect a ripe tomato.",
          "description":"Often you can simply scoop of the seeds from the tomato that you are about to eat. Collecting seeds from overly ripe fruit is also a great idea too. So, collect your seeds depending on what works best for you."
        },
        {
          "headline":"Separate the gel from the seed.",
          "description":"There are methods out there for fermenting the seeds to achieve this. However, you can also simply to put the seeds in a fine mesh colander, and run water over them. Maybe run your fingers over them to help the little fellas out. You know when you are done, because the seeds should stop clumping in a big messy mass."
        },
        {
          "headline":"Let the seeds drip dry for a little bit.",
          "description":"Then place them between a couple of sheets of paper towels for a day or until completely dry."
        },
        {
          "headline":"Date, label the seeds in a ziplock (resealable) baggy and store in a cool dark spot.",
          "description":"Keep them in a place you'll remember easily, so that you can plant them next season."
        }
      ]
    },
    {
      "name":"Saving Pepper Seeds",
      "steps":[
        {
          "headline":"Select a ripe pepper.",
          "description":""
        },
        {
          "headline":"Cut the fruit off from the stem so that you are left with just the stem and seeds.",
          "description":""
        },
        {
          "headline":"Remove the seeds with your fingers from the stem of the fruit.",
          "description":""
        },
        {
          "headline":"Place in a dry open area away from direct light.",
          "description":"Allow the seeds to completely dry. If you are not sure how long is long enough, longer is always better."
        },
        {
          "headline":"Once completely dry, date and store the seeds in a sandwich baggy in a cool, dry, dark area.",
          "description":""
        }
      ]
    }
  ],
  "text":" Saving Tomato Seeds Realize that not every seed saved will produce the same plant next year. For example if you grow \"Beefsteak\" tomatoes and harvest seeds, more than likely they will produce some different, inferior tomato the following year. With tomatoes, the seeds you want to harvest are \"Heirloom\" tomatoes. Heirloom seeds are simply a variety where the seed can be harvested form a plant, saved, replanted, and the same variety will regrow the following year. Collect a ripe tomato. Often you can simply scoop of the seeds from the tomato that you are about to eat. Collecting seeds from overly ripe fruit is also a great idea too. So, collect your seeds depending on what works best for you. Separate the gel from the seed. There are methods out there for fermenting the seeds to achieve this. However, you can also simply to put the seeds in a fine mesh colander, and run water over them. Maybe run your fingers over them to help the little fellas out. You know when you are done, because the seeds should stop clumping in a big messy mass. Let the seeds drip dry for a little bit. Then place them between a couple of sheets of paper towels for a day or until completely dry. Date, label the seeds in a ziplock (resealable) baggy and store in a cool dark spot. Keep them in a place you'll remember easily, so that you can plant them next season. Saving Pepper Seeds Select a ripe pepper.  Cut the fruit off from the stem so that you are left with just the stem and seeds.  Remove the seeds with your fingers from the stem of the fruit.  Place in a dry open area away from direct light. Allow the seeds to completely dry. If you are not sure how long is long enough, longer is always better. Once completely dry, date and store the seeds in a sandwich baggy in a cool, dry, dark area. ",
  "tyn_model":[
    "tomatoes",
    "tomato",
    "fine mesh colander",
    "water",
    "paper towels",
    "ziplock (resealable) baggy",
    "pepper",
    "sandwich baggy"
  ],
  "tyn_section":[

  ]
}