{
  "title":"How to Photograph Underwater",
  "url":"https://www.wikihow.com/Photograph-Underwater",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Photography",
    "Photography Genres",
    "Outdoor Photography",
    "Water Photography"
  ],
  "parts":[
    {
      "name":"Obtaining a Waterproof Camera",
      "steps":[
        {
          "headline":"Purchase a waterproof point-and-shoot camera to take basic pictures.",
          "description":"Point-and-shoot cameras are great for beginners because you don’t have to change many settings. They come with automatic settings you can experiment with, but for the most part these cameras are very straightforward and easy to use. You can purchase either a digital waterproof camera or a disposable point-and-shoot. Popular camera brands like Olympus and Nikon make point-and-shoot cameras for underwater photography."
        },
        {
          "headline":"Try using a GoPro to easily take underwater photos and videos.",
          "description":"The GoPro brand makes simple video cameras that can also shoot photos. Some models require an additional waterproof housing, while advanced models are made out of waterproof materials. If you are looking for an introduction to underwater photography, consider investing in a GoPro. GoPros can shoot awesome video and pictures above water as well."
        },
        {
          "headline":"Use waterproof plastic pouches and cases to protect your camera.",
          "description":"If you want to take pictures underwater with your existing camera, choose between a hardshell protective case or a waterproof, sealable plastic pouch. You can shop online or at most electronic or photo stores. Both options work great for underwater photography."
        },
        {
          "headline":"Invest in a hardshell underwater housing to protect your DSLR camera.",
          "description":"If you have a professional camera already and would like to try shooting underwater, purchase an underwater housing for your camera and lens. In addition, you need to purchase a waterproof port system to protect the inner workings of your camera. Some popular underwater housing brands include Ikelite, Nimar, and Ewa Marine, to name a few. The underwater housing comes in 2 parts, 1 for your camera body and 1 for the lens. The housing lets you still control the camera settings from outside. The housing units in total cost between $1,850 - $2,400 (£1,307.21 - 1,695.84)."
        }
      ]
    },
    {
      "name":"Preparing Your DSLR Camera",
      "steps":[
        {
          "headline":"Use your factory lens to shoot pictures underwater if you are a beginner.",
          "description":"You can take great photos underwater with just about any lens. If you are just getting started, use the lens that you bought with your DSLR camera. You can add on accessory lenses after you nail the basics. Just make sure you have a protective housing!"
        },
        {
          "headline":"Try using a macro lens to shoot close-up subjects in full detail.",
          "description":"If you feel comfortable shooting underwater and want to take your pictures to the next level, invest in a macro lens. Macro lenses provide amazing, clear details that other lenses may not capture. They have great zoom capabilities and are best to capture details up close. Macro lenses are great to shoot close-ups of fish and coral, for example. Look for small objects and focus your camera directly at your subject. You can also use a wide angle lens for great underwater photography."
        },
        {
          "headline":"Turn on your flash if shooting within 3–4 ft (0.91–1.22 m) of your subject.",
          "description":"Set your flash mode to “Forced flash” rather than “Auto-flash” to connect your camera to your flash. Having a bit of additional lighting adds color and detail to your picture. If you don’t use a flash at take a close-up shot, your image may look mostly blue. The closer you are to your image, the more color, contrast, and sharpness your image will have. You can shoot without a flash if you are more than about 5 ft (1.5 m) away from your subject."
        },
        {
          "headline":"Set your white balance to automatic if you are using a flash.",
          "description":"Flashes will provide additional lighting to your underwater image. Because of this, use the auto white balance setting so your pictures don’t look too bright. To do this, look for your camera’s white balance, and select “Auto.”\nIf you are having trouble locating the settings, review your camera’s owners manual."
        },
        {
          "headline":"Program your camera to underwater mode if you are not using a flash.",
          "description":"Most modern cameras come with an automatic setting option to shoot underwater. Use this if you don’t plan on using external lighting. Typically, the underwater setting provides adequate color balancing when shooting underwater. If your images look dark, consider adjusting your white balance to manual."
        },
        {
          "headline":"Set your aperture priority to F8 or program mode if shooting close up.",
          "description":"If your camera has an F8 option, use this when shooting animal or human portraits. If you do not have F8, then select the program mode in your aperture settings. F8 and program mode both help take clear, detailed pictures from only a few feet away."
        },
        {
          "headline":"Select an aperture priority of F2 or F3 when taking scenic pictures.",
          "description":"If you want to take pictures of coral reefs or wide-angled shots of your subject, use a low F stop. For best results, go with F2.8 if available. If your camera does not offer these F stops, you can shoot in program mode. Using these F stops helps your camera capture as much light as possible from a wide, large foreground."
        }
      ]
    },
    {
      "name":"Taking Quality Pictures",
      "steps":[
        {
          "headline":"Set up your camera and housing inside and take some practice shots.",
          "description":"Before you go near your body of water, place your camera inside its housing so it is secure. Adjust your settings for underwater photos before you submerge your camera, so you won't have to make many adjustments from underwater. Snap a couple of shots to get a sense of your settings, even though they will look different above water. This will make sure your camera is in proper working order and is totally protected before you submerge it in water."
        },
        {
          "headline":"Take your pictures on bright, sunny days between 8-11am.",
          "description":"When shooting underwater, you want to take advantage of as much natural light as possible. You will get the clearest, brightest underwater images if you shoot during bright days when the sun is at its peak. You can also try shooting at different times of the day to play with various levels of light, but shoot in the morning to take your best pictures."
        },
        {
          "headline":"Stay 1–5 ft (0.30–1.52 m) below the surface, especially if taking portraits.",
          "description":"If you aren’t familiar with scuba diving, it is best to stay at the surface of the water. For taking pictures of human subjects, you can best capture their skin tones within the first few feet of the surface. Taking your pictures from this level is helpful because you can utilize both reflections and direct lighting since you are near the surface. Once you go below 5 ft (1.5 m), you lose the warmth and color of an individual’s skin tone."
        },
        {
          "headline":"Learn to scuba dive if you want to take pictures in deep water.",
          "description":"If you want to take more advanced photos underwater, learn to scuba dive so you can reach deeper depths. You can learn about scuba diving by researching online, and take lessons when you are ready to learn."
        },
        {
          "headline":"Take close-ups of people or animals from no more than 6 ft (1.8 m) away.",
          "description":"When taking pictures underwater, your camera has a difficult time focusing on the image since there is limited lighting. Because of this, get as close as possible to your subjects when shooting underwater. The photos you take from over 6 ft (1.8 m) away may turn out blurry."
        },
        {
          "headline":"Photograph upwards or from eye level instead of from above.",
          "description":"The subject of your image may look distorted or out of proportion if you shoot from above, because of the way the water refracts the image. To avoid this, get 1–2 ft (0.30–0.61 m) below your subject and point your camera upwards. You can also shoot from eye level and point your camera straight ahead."
        },
        {
          "headline":"Shoot in clean and clear water for best results.",
          "description":"To get the most detailed and crystal-clear images, avoid taking photos in murky, dark water. If you can see through the water easily, then your camera can easily take your shot. Your camera will have a hard time focusing and taking clear photos if the water is very dark and hard to see through."
        }
      ]
    }
  ],
  "text":" Obtaining a Waterproof Camera Purchase a waterproof point-and-shoot camera to take basic pictures. Point-and-shoot cameras are great for beginners because you don’t have to change many settings. They come with automatic settings you can experiment with, but for the most part these cameras are very straightforward and easy to use. You can purchase either a digital waterproof camera or a disposable point-and-shoot. Popular camera brands like Olympus and Nikon make point-and-shoot cameras for underwater photography. Try using a GoPro to easily take underwater photos and videos. The GoPro brand makes simple video cameras that can also shoot photos. Some models require an additional waterproof housing, while advanced models are made out of waterproof materials. If you are looking for an introduction to underwater photography, consider investing in a GoPro. GoPros can shoot awesome video and pictures above water as well. Use waterproof plastic pouches and cases to protect your camera. If you want to take pictures underwater with your existing camera, choose between a hardshell protective case or a waterproof, sealable plastic pouch. You can shop online or at most electronic or photo stores. Both options work great for underwater photography. Invest in a hardshell underwater housing to protect your DSLR camera. If you have a professional camera already and would like to try shooting underwater, purchase an underwater housing for your camera and lens. In addition, you need to purchase a waterproof port system to protect the inner workings of your camera. Some popular underwater housing brands include Ikelite, Nimar, and Ewa Marine, to name a few. The underwater housing comes in 2 parts, 1 for your camera body and 1 for the lens. The housing lets you still control the camera settings from outside. The housing units in total cost between $1,850 - $2,400 (£1,307.21 - 1,695.84). Preparing Your DSLR Camera Use your factory lens to shoot pictures underwater if you are a beginner. You can take great photos underwater with just about any lens. If you are just getting started, use the lens that you bought with your DSLR camera. You can add on accessory lenses after you nail the basics. Just make sure you have a protective housing! Try using a macro lens to shoot close-up subjects in full detail. If you feel comfortable shooting underwater and want to take your pictures to the next level, invest in a macro lens. Macro lenses provide amazing, clear details that other lenses may not capture. They have great zoom capabilities and are best to capture details up close. Macro lenses are great to shoot close-ups of fish and coral, for example. Look for small objects and focus your camera directly at your subject. You can also use a wide angle lens for great underwater photography. Turn on your flash if shooting within 3–4 ft (0.91–1.22 m) of your subject. Set your flash mode to “Forced flash” rather than “Auto-flash” to connect your camera to your flash. Having a bit of additional lighting adds color and detail to your picture. If you don’t use a flash at take a close-up shot, your image may look mostly blue. The closer you are to your image, the more color, contrast, and sharpness your image will have. You can shoot without a flash if you are more than about 5 ft (1.5 m) away from your subject. Set your white balance to automatic if you are using a flash. Flashes will provide additional lighting to your underwater image. Because of this, use the auto white balance setting so your pictures don’t look too bright. To do this, look for your camera’s white balance, and select “Auto.”\nIf you are having trouble locating the settings, review your camera’s owners manual. Program your camera to underwater mode if you are not using a flash. Most modern cameras come with an automatic setting option to shoot underwater. Use this if you don’t plan on using external lighting. Typically, the underwater setting provides adequate color balancing when shooting underwater. If your images look dark, consider adjusting your white balance to manual. Set your aperture priority to F8 or program mode if shooting close up. If your camera has an F8 option, use this when shooting animal or human portraits. If you do not have F8, then select the program mode in your aperture settings. F8 and program mode both help take clear, detailed pictures from only a few feet away. Select an aperture priority of F2 or F3 when taking scenic pictures. If you want to take pictures of coral reefs or wide-angled shots of your subject, use a low F stop. For best results, go with F2.8 if available. If your camera does not offer these F stops, you can shoot in program mode. Using these F stops helps your camera capture as much light as possible from a wide, large foreground. Taking Quality Pictures Set up your camera and housing inside and take some practice shots. Before you go near your body of water, place your camera inside its housing so it is secure. Adjust your settings for underwater photos before you submerge your camera, so you won't have to make many adjustments from underwater. Snap a couple of shots to get a sense of your settings, even though they will look different above water. This will make sure your camera is in proper working order and is totally protected before you submerge it in water. Take your pictures on bright, sunny days between 8-11am. When shooting underwater, you want to take advantage of as much natural light as possible. You will get the clearest, brightest underwater images if you shoot during bright days when the sun is at its peak. You can also try shooting at different times of the day to play with various levels of light, but shoot in the morning to take your best pictures. Stay 1–5 ft (0.30–1.52 m) below the surface, especially if taking portraits. If you aren’t familiar with scuba diving, it is best to stay at the surface of the water. For taking pictures of human subjects, you can best capture their skin tones within the first few feet of the surface. Taking your pictures from this level is helpful because you can utilize both reflections and direct lighting since you are near the surface. Once you go below 5 ft (1.5 m), you lose the warmth and color of an individual’s skin tone. Learn to scuba dive if you want to take pictures in deep water. If you want to take more advanced photos underwater, learn to scuba dive so you can reach deeper depths. You can learn about scuba diving by researching online, and take lessons when you are ready to learn. Take close-ups of people or animals from no more than 6 ft (1.8 m) away. When taking pictures underwater, your camera has a difficult time focusing on the image since there is limited lighting. Because of this, get as close as possible to your subjects when shooting underwater. The photos you take from over 6 ft (1.8 m) away may turn out blurry. Photograph upwards or from eye level instead of from above. The subject of your image may look distorted or out of proportion if you shoot from above, because of the way the water refracts the image. To avoid this, get 1–2 ft (0.30–0.61 m) below your subject and point your camera upwards. You can also shoot from eye level and point your camera straight ahead. Shoot in clean and clear water for best results. To get the most detailed and crystal-clear images, avoid taking photos in murky, dark water. If you can see through the water easily, then your camera can easily take your shot. Your camera will have a hard time focusing and taking clear photos if the water is very dark and hard to see through.",
  "tyn_model":[
    "camera",
    "water",
    "gopro",
    "dslr camera",
    "underwater housing",
    "lenses",
    "“auto",
    "scuba diving",
    "scuba dive",
    "point-and-shoot camera",
    "point-and-shoot cameras",
    "point-and-shoot.",
    "waterproof port",
    "lens",
    "macro lens",
    "“forced",
    "” rather",
    "” to",
    "flash",
    "”\n",
    "cameras"
  ],
  "tyn_section":[

  ]
}