{
  "title":"How to Make Sesame Ginger Salmon",
  "url":"https://www.wikihow.com/Make-Sesame-Ginger-Salmon",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Fish and Seafood",
    "Salmon"
  ],
  "steps":[
    {
      "headline":"Preheat an oven to 400 °F (about 200 °C).",
      "description":"Adjust the rack to its middle position."
    },
    {
      "headline":"Make a marinade by combining the ingredients in a medium bowl.",
      "description":"Use a whisk to stir."
    },
    {
      "headline":"Place the salmon filets in a large bowl or Ziploc bag and pour the marinade over them.",
      "description":"Seal and let stand for at least 30 minutes (up to overnight), turning the bag or flipping over the filets occasionally."
    },
    {
      "headline":"Lightly grease a 9x13 baking dish with cooking spray.",
      "description":"If you don't have cooking spray, coat the dish with butter using a paper towel."
    },
    {
      "headline":"Transfer the filets, along with the marinade, into the baking dish.",
      "description":""
    },
    {
      "headline":"Bake for 20 minutes until the fish easily flakes with a fork.",
      "description":""
    },
    {
      "headline":"Prepare the glaze while the fish is cooking.",
      "description":"Combine all of the ingredients in a small bowl and set aside."
    },
    {
      "headline":"Serve the fish over a bed of rice and spoon the glaze over.",
      "description":""
    }
  ],
  "text":" Preheat an oven to 400 °F (about 200 °C). Adjust the rack to its middle position. Make a marinade by combining the ingredients in a medium bowl. Use a whisk to stir. Place the salmon filets in a large bowl or Ziploc bag and pour the marinade over them. Seal and let stand for at least 30 minutes (up to overnight), turning the bag or flipping over the filets occasionally. Lightly grease a 9x13 baking dish with cooking spray. If you don't have cooking spray, coat the dish with butter using a paper towel. Transfer the filets, along with the marinade, into the baking dish.  Bake for 20 minutes until the fish easily flakes with a fork.  Prepare the glaze while the fish is cooking. Combine all of the ingredients in a small bowl and set aside. Serve the fish over a bed of rice and spoon the glaze over. ",
  "tyn_model":[
    "baking dish",
    "oven",
    "medium bowl",
    "whisk",
    "large bowl",
    "ziploc bag",
    "cooking spray",
    "butter",
    "paper towel",
    "fork",
    "small bowl",
    "rice"
  ],
  "tyn_section":[

  ]
}