{
  "title":"How to Eat Ghosts in Pacman Without Being Caught",
  "url":"https://www.wikihow.com/Eat-Ghosts-in-Pacman-Without-Being-Caught",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Arcade Games"
  ],
  "steps":[
    {
      "headline":"The ghosts go in different directions, so try to remember their movement patterns.The Red ghost always goes around the whole screen from right to left to make its way to you.",
      "description":"The Pink Ghost always goes after you by going from any direction except the bottom. The Light Blue Ghost comes from sides of you and will always go through the tunnels that take you to the opposite direction (if the Pac-Man you are playing has tunnels) The Orange ghost also goes any direction, but except the right side of you, and most likely to catch you from the left."
    },
    {
      "headline":"The place where you have started, go the opposite direction and DON'T go down(instead go up).",
      "description":""
    },
    {
      "headline":"Keep going up until you have reached the top aisle on the drawing.",
      "description":""
    },
    {
      "headline":"The red ghost will be the last one to chase you, and the blue one will be the first because you are at the very top.",
      "description":"Eat the Power Pellet for the points, so go after all the ghosts, because by then all the ghosts are close to you."
    },
    {
      "headline":"Go down and eat the fruit in the middle because you have time before they regrow.",
      "description":""
    },
    {
      "headline":"Whenever you see the Pink or Blue ghost coming for you, go into the tunnels or just eat all the small dots on the bottom of the screen.",
      "description":"This way, the Pink and Blue ghosts will take at least 15-20 seconds to chase you again. When you have eaten all the bottom dots, and go through the tunnel, they both go around the screen and they don't chase you for a period of time."
    },
    {
      "headline":"To escape Orange Ghosts, you have to always eat the fruit in the middle to make him stunned and he won't chase after you.",
      "description":"Note that the Orange ghost will start chasing you quick because they go buy the points, and divide the number of the 1st number on your score=that's how much time they don't chase you(eg. you have 500 points=2.5 seconds they don't chase you. )so it is only on luck because low points can be good or bad and high points can be good or bad."
    },
    {
      "headline":"To escape Red ghost, just eat the Power Pellet, because even if they have regrown, they run away for 8 seconds, and start chasing you again.",
      "description":""
    }
  ],
  "text":" The ghosts go in different directions, so try to remember their movement patterns.The Red ghost always goes around the whole screen from right to left to make its way to you. The Pink Ghost always goes after you by going from any direction except the bottom. The Light Blue Ghost comes from sides of you and will always go through the tunnels that take you to the opposite direction (if the Pac-Man you are playing has tunnels) The Orange ghost also goes any direction, but except the right side of you, and most likely to catch you from the left. The place where you have started, go the opposite direction and DON'T go down(instead go up).  Keep going up until you have reached the top aisle on the drawing.  The red ghost will be the last one to chase you, and the blue one will be the first because you are at the very top. Eat the Power Pellet for the points, so go after all the ghosts, because by then all the ghosts are close to you. Go down and eat the fruit in the middle because you have time before they regrow.  Whenever you see the Pink or Blue ghost coming for you, go into the tunnels or just eat all the small dots on the bottom of the screen. This way, the Pink and Blue ghosts will take at least 15-20 seconds to chase you again. When you have eaten all the bottom dots, and go through the tunnel, they both go around the screen and they don't chase you for a period of time. To escape Orange Ghosts, you have to always eat the fruit in the middle to make him stunned and he won't chase after you. Note that the Orange ghost will start chasing you quick because they go buy the points, and divide the number of the 1st number on your score=that's how much time they don't chase you(eg. you have 500 points=2.5 seconds they don't chase you. )so it is only on luck because low points can be good or bad and high points can be good or bad. To escape Red ghost, just eat the Power Pellet, because even if they have regrown, they run away for 8 seconds, and start chasing you again. ",
  "tyn_model":[
    "power pellet",
    "fruit",
    "pac-man",
    "orange ghost"
  ],
  "tyn_section":[

  ]
}