{
  "title":"How to Make No‐Bake Brownies",
  "url":"https://www.wikihow.com/Make-No%E2%80%90Bake-Brownies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Baking",
    "Cakes",
    "Brownies"
  ],
  "steps":[
    {
      "headline":"Ground the flax seed.",
      "description":"Place the flaxseeds in a coffee grinder or food processor and grind until a powder is formed."
    },
    {
      "headline":"Make the batter.",
      "description":"Once the flaxseeds are processed add cocoa powder, salt, almond/peanut flour, vanilla extract and dates. Process until the dough becomes sticky."
    },
    {
      "headline":"Grease paper.",
      "description":"Line a baking pan with parchment paper and grease it with some oil such as coconut oil."
    },
    {
      "headline":"Scoop the dough into the baking tray.",
      "description":"Using a spoon place the dough into the baking tray and press down on it with your hands to shape it into the tray."
    },
    {
      "headline":"Make the chocolate glaze.",
      "description":"Add agave syrup/maple syrup, peanut flour and cocoa powder in a small bowl and whisk together."
    },
    {
      "headline":"Drizzle the chocolate glaze over the brownies.",
      "description":"Pour the glaze over the brownies and spread it around evenly."
    },
    {
      "headline":"Freeze the brownies.",
      "description":"Place in the freezer for 1-2 hours."
    },
    {
      "headline":"Slice it up.",
      "description":"Cut into 16 pieces and serve."
    }
  ],
  "text":" Ground the flax seed. Place the flaxseeds in a coffee grinder or food processor and grind until a powder is formed. Make the batter. Once the flaxseeds are processed add cocoa powder, salt, almond/peanut flour, vanilla extract and dates. Process until the dough becomes sticky. Grease paper. Line a baking pan with parchment paper and grease it with some oil such as coconut oil. Scoop the dough into the baking tray. Using a spoon place the dough into the baking tray and press down on it with your hands to shape it into the tray. Make the chocolate glaze. Add agave syrup/maple syrup, peanut flour and cocoa powder in a small bowl and whisk together. Drizzle the chocolate glaze over the brownies. Pour the glaze over the brownies and spread it around evenly. Freeze the brownies. Place in the freezer for 1-2 hours. Slice it up. Cut into 16 pieces and serve.",
  "tyn_model":[
    "cocoa powder",
    "baking tray",
    "chocolate glaze",
    "coffee grinder",
    "food processor",
    "salt",
    "almond/peanut flour",
    "vanilla extract",
    "dates",
    "baking pan",
    "parchment paper",
    "coconut oil",
    "spoon",
    "agave syrup",
    "maple syrup",
    "peanut flour",
    "small bowl",
    "freezer"
  ],
  "tyn_section":[

  ]
}