{
  "title":"How to Uninstall a Part from a Car in Need for Speed",
  "url":"https://www.wikihow.com/Uninstall-a-Part-from-a-Car-in-Need-for-Speed",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Need for Speed"
  ],
  "methods":[
    {
      "name":"Uninstalling Car Parts in Need for Speed: Underground 2 (PC)",
      "steps":[
        {
          "headline":"Launch the game.",
          "description":"You can launch the game from the Start Menu (Start Button >> All Programs >> Electronic Arts >> Need for Speed Underground 2) or from the desktop by double-clicking its icon."
        },
        {
          "headline":"Press Enter to display the Main Menu once the game loads.",
          "description":"You’ll see several game options here."
        },
        {
          "headline":"Press Enter to enter Career mode.",
          "description":"Career mode is a mode in NFS where one works towards attaining a main goal by systematically completing milestones. It is the first option on the menu."
        },
        {
          "headline":"Press Enter to choose the “Resume Career” option.",
          "description":"It is also the first option on the menu, and will bring up the Garage menu. The Garage in NFSU2 is a place where you can view the map of the game world and tune up your car."
        },
        {
          "headline":"Scroll to the right using the Right Arrow key and select “Change Parts.” This will take you to the Parts Storage menu.",
          "description":"On the Parts Storage menu you will find three options: Change Body Parts, Change Performance Parts, and Change Interiors. “Change Body Parts” allows you to uninstall parts like body kits and roof scoops while “Change Performance Parts” deals with engine modifications. “Change Interiors” allows you to remove such things as car speakers."
        },
        {
          "headline":"Select the option of the car part you want to uninstall.",
          "description":"For instance, if you want to uninstall an ECU upgrade from your car, scroll rightwards and select “Change Performance Parts.”"
        },
        {
          "headline":"Scroll left or right, and select the part to uninstall.",
          "description":"For example, on the “Change Performance Parts” menu, scroll to ECU (using the Right or Left Arrow keys) and press Enter."
        },
        {
          "headline":"Scroll to the right until “Return to Stock” is highlighted, and press Enter.",
          "description":"This will uninstall the selected part. Using the ECU upgrade as an example, once you select “Return to Stock,” this will remove all installed ECU upgrades and return your engine to factory configuration."
        }
      ]
    },
    {
      "name":"Uninstalling Car Parts in Need for Speed: Carbon (PC)",
      "steps":[
        {
          "headline":"Launch the game.",
          "description":"You can launch the game from the Start Menu (Start Button >> All Programs >> Electronic Arts >> Need for Speed Carbon) or from the desktop by double-clicking its icon."
        },
        {
          "headline":"Press Enter to display the Main Menu once the game loads.",
          "description":"You’ll see several game options here."
        },
        {
          "headline":"Press Enter to enter Career mode.",
          "description":"Career mode is a mode in NFS where one works towards attaining a main goal by systematically completing milestones. It is the first option on the menu."
        },
        {
          "headline":"Press Enter to choose the “Resume Career” option.",
          "description":"It is also the first option on the menu. This will take you to the Safe House you accessed most recently, or the one nearest to the point you last were in the game world. A Safe House is a hideout in the game world that offers respite from the cops and where you can customize your car(s) and manage your racing crew. Depending on your career progress, there may one or several Safe Houses scattered all over the game world (a fictional city called Palmont)."
        },
        {
          "headline":"Scroll to the right and choose “Customization by pressing “Enter.” On the Customization menu, you will find the following car part category: Performance, Autosculpt, Aftermarket, and Shopping Cart.",
          "description":"“Performance” allows you to install or uninstall engine parts. while “Autosculpt” deals with Autosculpt parts. “Aftermarket” deals with removal or addition of Aftermarket parts. “Shopping Cart” allows you to pay (where applicable) for your parts and install/uninstall on the car."
        },
        {
          "headline":"Select the category of the car part you wish to uninstall.",
          "description":"For instance, to remove all transmission upgrades installed on your ride, click on “Performance.”"
        },
        {
          "headline":"Select the part to uninstall.",
          "description":"For instance, in the Performance menu, click “Transmission.”"
        },
        {
          "headline":"Select “Stock.” This will add the Stock car part to your shopping cart but at no cost.",
          "description":"Repeat Steps 6 to 8 for other parts you wish to uninstall."
        },
        {
          "headline":"Bring up the Shopping Cart by pressing the Spacebar and press Enter.",
          "description":"A dialog box will appear, asking you to confirm the uninstallation of the parts."
        },
        {
          "headline":"Click “OK.” The Stock car parts you placed in your Shopping Cart will be uninstalled.",
          "description":""
        }
      ]
    }
  ],
  "text":" Uninstalling Car Parts in Need for Speed: Underground 2 (PC) Launch the game. You can launch the game from the Start Menu (Start Button >> All Programs >> Electronic Arts >> Need for Speed Underground 2) or from the desktop by double-clicking its icon. Press Enter to display the Main Menu once the game loads. You’ll see several game options here. Press Enter to enter Career mode. Career mode is a mode in NFS where one works towards attaining a main goal by systematically completing milestones. It is the first option on the menu. Press Enter to choose the “Resume Career” option. It is also the first option on the menu, and will bring up the Garage menu. The Garage in NFSU2 is a place where you can view the map of the game world and tune up your car. Scroll to the right using the Right Arrow key and select “Change Parts.” This will take you to the Parts Storage menu. On the Parts Storage menu you will find three options: Change Body Parts, Change Performance Parts, and Change Interiors. “Change Body Parts” allows you to uninstall parts like body kits and roof scoops while “Change Performance Parts” deals with engine modifications. “Change Interiors” allows you to remove such things as car speakers. Select the option of the car part you want to uninstall. For instance, if you want to uninstall an ECU upgrade from your car, scroll rightwards and select “Change Performance Parts.” Scroll left or right, and select the part to uninstall. For example, on the “Change Performance Parts” menu, scroll to ECU (using the Right or Left Arrow keys) and press Enter. Scroll to the right until “Return to Stock” is highlighted, and press Enter. This will uninstall the selected part. Using the ECU upgrade as an example, once you select “Return to Stock,” this will remove all installed ECU upgrades and return your engine to factory configuration. Uninstalling Car Parts in Need for Speed: Carbon (PC) Launch the game. You can launch the game from the Start Menu (Start Button >> All Programs >> Electronic Arts >> Need for Speed Carbon) or from the desktop by double-clicking its icon. Press Enter to display the Main Menu once the game loads. You’ll see several game options here. Press Enter to enter Career mode. Career mode is a mode in NFS where one works towards attaining a main goal by systematically completing milestones. It is the first option on the menu. Press Enter to choose the “Resume Career” option. It is also the first option on the menu. This will take you to the Safe House you accessed most recently, or the one nearest to the point you last were in the game world. A Safe House is a hideout in the game world that offers respite from the cops and where you can customize your car(s) and manage your racing crew. Depending on your career progress, there may one or several Safe Houses scattered all over the game world (a fictional city called Palmont). Scroll to the right and choose “Customization by pressing “Enter.” On the Customization menu, you will find the following car part category: Performance, Autosculpt, Aftermarket, and Shopping Cart. “Performance” allows you to install or uninstall engine parts. while “Autosculpt” deals with Autosculpt parts. “Aftermarket” deals with removal or addition of Aftermarket parts. “Shopping Cart” allows you to pay (where applicable) for your parts and install/uninstall on the car. Select the category of the car part you wish to uninstall. For instance, to remove all transmission upgrades installed on your ride, click on “Performance.” Select the part to uninstall. For instance, in the Performance menu, click “Transmission.” Select “Stock.” This will add the Stock car part to your shopping cart but at no cost. Repeat Steps 6 to 8 for other parts you wish to uninstall. Bring up the Shopping Cart by pressing the Spacebar and press Enter. A dialog box will appear, asking you to confirm the uninstallation of the parts. Click “OK.” The Stock car parts you placed in your Shopping Cart will be uninstalled. ",
  "tyn_model":[
    "“change",
    "” allows",
    "” this",
    "” deals",
    "electronic arts",
    "“resume",
    "” option",
    "“return",
    "“performance",
    "” select",
    "speakers",
    "” scroll",
    "” menu",
    "” is",
    "“customization",
    "“enter",
    "” on",
    "autosculpt",
    "“autosculpt",
    "“aftermarket",
    "“shopping",
    "“transmission",
    "“stock",
    "shopping cart",
    "“ok",
    "” the"
  ],
  "tyn_section":[

  ]
}