{
  "title":"How to Summon a Helicopter in GTA",
  "url":"https://www.wikihow.com/Summon-a-Helicopter-in-GTA",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Grand Theft Auto"
  ],
  "methods":[
    {
      "name":"Summoning a Helicopter in GTA: San Andreas",
      "steps":[
        {
          "headline":"Ready your controllers.",
          "description":"After launching the game, have your console controllers or computer keyboard ready. Do not push any buttons and remain still right where your game character is standing. Do not pause the game or otherwise disrupt it."
        },
        {
          "headline":"Type in the cheat codes.",
          "description":"All you need to do is type a specific set of cheat codes, depending on the platform you’re playing the game on, in order to summon a helicopter. PS2 - Press the following buttons on your PS2 controller in this order: Circle, X, L1, Circle, Circle, L1, Circle, R1, R2, L2, L1, L1. Xbox - Press the following buttons on your Xbox controller in this order: B, A, left trigger, B, B, left trigger, B, right trigger, Black, White, left trigger, left trigger. PC - Type “OHDUDE” using your keyboard."
        },
        {
          "headline":"Ride the helicopter.",
          "description":"Right after typing in the cheat codes, the helicopter will appear right in front of you. Approach it and press the player-assigned \"Ride Vehicle\" button."
        }
      ]
    },
    {
      "name":"Summoning a Helicopter in GTA 4",
      "steps":[
        {
          "headline":"Pull out your character’s cellphone.",
          "description":"After loading the game and taking control of your character, press the UP button on the directional buttons on your PS3 or Xbox, or the arrow keys on your keyboard, to pull out the in-game mobile phone. A small cellphone will then appear on the right-hand side of your game screen."
        },
        {
          "headline":"Type in the cheat code on the phone.",
          "description":"Using the directional keys on your controller, dial 359 555 0100 and press the A button (Xbox) or X button (PS3) to start calling the number.If you’re playing the game on PC, you can dial the numbers using the numerical keypad on the right-hand side and press the Enter button to call the number. You’ll hear a short ring."
        },
        {
          "headline":"Ride the helicopter.",
          "description":"Right after the short ring, the helicopter will appear right in front of you. Approach it and press the player-assigned \"Ride Vehicle\"."
        }
      ]
    },
    {
      "name":"Summoning a Helicopter in GTA 5",
      "steps":[
        {
          "headline":"Ready your controllers.",
          "description":"After launching the game, have your console controllers or computer keyboard ready. Do not push any buttons and remain still right where your game character is standing. Do not pause the game or otherwise disrupt it."
        },
        {
          "headline":"Start typing in the cheat codes.",
          "description":"All you need to do is enter a specific set of cheat code, depending on whether you’re playing the game on PS3/4, Xbox 360, or PC, in order to summon a helicopter. PS3/PS4 - Press the following buttons on your controller in correct and exact order:  Circle, Circle, L1, Circle, Circle, Circle, L1, L2, R1, Triangle, Circle, Triangle. Xbox 360 - Press the following buttons on your Xbox controller in this order: B, B, LB, B, B, B, LB, left trigger, right trigger, Y, B, Y.\n\nPC - Press the tilde (~) button on your keyboard, and then type \"BUZZOFF\"."
        },
        {
          "headline":"Ride the helicopter.",
          "description":"Right after typing in the cheat codes, the helicopter will appear right in front of you. Approach it and press the player-assigned \"Ride Vehicle\" button."
        }
      ]
    }
  ],
  "text":" Summoning a Helicopter in GTA: San Andreas Ready your controllers. After launching the game, have your console controllers or computer keyboard ready. Do not push any buttons and remain still right where your game character is standing. Do not pause the game or otherwise disrupt it. Type in the cheat codes. All you need to do is type a specific set of cheat codes, depending on the platform you’re playing the game on, in order to summon a helicopter. PS2 - Press the following buttons on your PS2 controller in this order: Circle, X, L1, Circle, Circle, L1, Circle, R1, R2, L2, L1, L1. Xbox - Press the following buttons on your Xbox controller in this order: B, A, left trigger, B, B, left trigger, B, right trigger, Black, White, left trigger, left trigger. PC - Type “OHDUDE” using your keyboard. Ride the helicopter. Right after typing in the cheat codes, the helicopter will appear right in front of you. Approach it and press the player-assigned \"Ride Vehicle\" button. Summoning a Helicopter in GTA 4 Pull out your character’s cellphone. After loading the game and taking control of your character, press the UP button on the directional buttons on your PS3 or Xbox, or the arrow keys on your keyboard, to pull out the in-game mobile phone. A small cellphone will then appear on the right-hand side of your game screen. Type in the cheat code on the phone. Using the directional keys on your controller, dial 359 555 0100 and press the A button (Xbox) or X button (PS3) to start calling the number.If you’re playing the game on PC, you can dial the numbers using the numerical keypad on the right-hand side and press the Enter button to call the number. You’ll hear a short ring. Ride the helicopter. Right after the short ring, the helicopter will appear right in front of you. Approach it and press the player-assigned \"Ride Vehicle\". Summoning a Helicopter in GTA 5 Ready your controllers. After launching the game, have your console controllers or computer keyboard ready. Do not push any buttons and remain still right where your game character is standing. Do not pause the game or otherwise disrupt it. Start typing in the cheat codes. All you need to do is enter a specific set of cheat code, depending on whether you’re playing the game on PS3/4, Xbox 360, or PC, in order to summon a helicopter. PS3/PS4 - Press the following buttons on your controller in correct and exact order:  Circle, Circle, L1, Circle, Circle, Circle, L1, L2, R1, Triangle, Circle, Triangle. Xbox 360 - Press the following buttons on your Xbox controller in this order: B, B, LB, B, B, B, LB, left trigger, right trigger, Y, B, Y.\n\nPC - Press the tilde (~) button on your keyboard, and then type \"BUZZOFF\". Ride the helicopter. Right after typing in the cheat codes, the helicopter will appear right in front of you. Approach it and press the player-assigned \"Ride Vehicle\" button.",
  "tyn_model":[
    "helicopter",
    "computer keyboard",
    "xbox controller",
    "cellphone",
    "console controllers",
    "“ohdude",
    "” using",
    "mobile phone",
    "xbox 360"
  ],
  "tyn_section":[

  ]
}