{
  "title":"How to Dismantle the Blocking Totem in Virtual Villagers 5",
  "url":"https://www.wikihow.com/Dismantle-the-Blocking-Totem-in-Virtual-Villagers-5",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games"
  ],
  "steps":[
    {
      "headline":"Before starting, be sure to have:",
      "description":"600 energy (not any less). The Lightning Power unlocked\n3-4 or more Master Builders\nUnoccupied Villagers."
    },
    {
      "headline":"Once you have these things, drop as many master builders on the blocking totem as you can.",
      "description":"The Blocking Totem can be found on the lower left hand corner, in the area where the heathen master builder is (or once was). It is recommended to have the heathen master builder already converted; that way, he can help with the dismantling process."
    },
    {
      "headline":"Once the totem is dismantled at 2%, the heathens from the mausoleum will move in on your builders in order to \"repair the totem\".",
      "description":"As soon as they start moving towards it, use the lighting power on the heathens to scare them off. The blue and red masked heathens will proceed to hide in the bush. The orange masked heathens, however, will become distracted by other villagers along the way, and will quickly return to the totem..."
    },
    {
      "headline":"Keep dragging villagers to the group of orange masks in order to lure them away.",
      "description":"In the meantime, keep your master builders on task and do not use any energy for other powers. Lure the orange masks to the other heathens in order to group them all together."
    },
    {
      "headline":"Once the heathens reach the food bin area, use the lighting power on them again.",
      "description":"By having them grouped together, it will ensure that all the heathens run off. (If one were to not be affected by the lightning, this whole plan would not function properly)."
    },
    {
      "headline":"Repeat the process of dragging unoccupied villagers to the orange masks, using the lighting power to scare off the heathens, and keeping their master builders on the task of dismantling.",
      "description":""
    },
    {
      "headline":"Once the blocking totem has been completely dismantled, your villagers will celebrate and be able to restore the mausoleum freely.",
      "description":""
    }
  ],
  "text":" Before starting, be sure to have: 600 energy (not any less). The Lightning Power unlocked\n3-4 or more Master Builders\nUnoccupied Villagers. Once you have these things, drop as many master builders on the blocking totem as you can. The Blocking Totem can be found on the lower left hand corner, in the area where the heathen master builder is (or once was). It is recommended to have the heathen master builder already converted; that way, he can help with the dismantling process. Once the totem is dismantled at 2%, the heathens from the mausoleum will move in on your builders in order to \"repair the totem\". As soon as they start moving towards it, use the lighting power on the heathens to scare them off. The blue and red masked heathens will proceed to hide in the bush. The orange masked heathens, however, will become distracted by other villagers along the way, and will quickly return to the totem... Keep dragging villagers to the group of orange masks in order to lure them away. In the meantime, keep your master builders on task and do not use any energy for other powers. Lure the orange masks to the other heathens in order to group them all together. Once the heathens reach the food bin area, use the lighting power on them again. By having them grouped together, it will ensure that all the heathens run off. (If one were to not be affected by the lightning, this whole plan would not function properly). Repeat the process of dragging unoccupied villagers to the orange masks, using the lighting power to scare off the heathens, and keeping their master builders on the task of dismantling.  Once the blocking totem has been completely dismantled, your villagers will celebrate and be able to restore the mausoleum freely. ",
  "tyn_model":[
    "heathens",
    "heathen",
    "lightning power",
    "lightning"
  ],
  "tyn_section":[

  ]
}