{
  "title":"How to Save Money After Moving into a New Home",
  "url":"https://www.wikihow.com/Save-Money-After-Moving-into-a-New-Home",
  "category_hierarchy":[
    "Home and Garden",
    "Housekeeping"
  ],
  "methods":[
    {
      "name":"Preventing Energy and Utility Waste",
      "steps":[
        {
          "headline":"Check your insulation.",
          "description":"If you purchased an older home with minimal upgrades, chances are you have old insulation. You may find a few inches of wood chip or newspaper-like material in your attic. Wood chip and that newsprint-type insulation have an R value of 4 to 8. Your R value should be R50. If you’re not sure if that is what you have, contact a professional to inspect it for you. Contact an insulation installer and they will blow new, environmentally-friendly, highly efficient insulation into your attic. This will drastically change your energy bill. In the worst-case scenario, you've inherited Zonolite or vermiculite insulation which contains asbestos and will need to be removed immediately. Consider the insulation in your outer walls as well."
        },
        {
          "headline":"Make your home air tight.",
          "description":"If you have leaky windows and drafty doors, then you are losing energy. Check the seals on all your windows and doors. If needed, install new weather stripping and caulking. You can find supplies for this at any home improvement store. If your window frames are warped, beyond repair, or incredibly old, it might be time to install new, energy efficient windows. You may also consider adding energy efficient doors to keep in heat and avoid energy loss. Placing heavy curtains over some of the windows in your home may also help to prevent energy loss and they can also keep your home cooler during hot months by blocking out the sun."
        },
        {
          "headline":"Check your hot water heater.",
          "description":"Your hot water heater should be set at 55℃ or 130℉. This temperature should allow you a sufficiently high water temperature for showers without wastefully overheating the water. Check the pipes and knobs on the heater as well. If they are loose, it may be leaking water or heat or it may be prone to bursting."
        },
        {
          "headline":"Check for leaky plumbing.",
          "description":"Check under sinks, toilets and along the water lines in your basement looking for leaks. If your toilet is running constantly or you find a leaky faucet you should call a plumber to repair or replace them. Use a dye test to test for leaks in your toilet tank. You can purchase the dye at any home improvement store. Drop a single tablet into the tank and wait 10 minutes. If you see colored water in the bowl, you have a leak and need a plumber. Leaking pipes cause mold to develop in addition to wasting water. If you do find leaking pipes, you may also want to get a professional mold inspection. This should have been done prior to closing during house inspection process. It is required for FHA financing\nCheck underground for leaking pipes as well. You can also check the water municipality for history of use and external leaks."
        },
        {
          "headline":"Install a programmable thermostat.",
          "description":"A thermostat you can program allows you to change the temperature in your home automatically. This will allow you to save a significant amount of energy. You can also get a “smart” thermostat that learns to adjust the temperature automatically based on your preferences. During cold months, set the temperature lower at night and when you are out of the house. Adjust the program to turn up the heat at times when you are actively using your home. Reverse that during warm months. Using an air conditioning unit during hot months may help you to cope with the heat, but it can also be expensive. You can also use fans and humidifiers for comfort during hot months."
        },
        {
          "headline":"Install energy efficient light bulbs.",
          "description":"Energy efficient LED or CFL light bulbs are more expensive than incandescent light bulbs. Make the initial investment, however, and you’ll save money in the long run. They have longer lives, burn on less energy, and provide the same amount of light as incandescent bulbs. They can be found at any home improvement store or online. The energy cost savings of a single lightbulb are relatively small, but when you factor in all the lightbulbs in your home over a long period of time, the savings are significant. An incandescent lightbulb’s energy will cost $201 over 23 years while an Light Emitting Diode (LED) bulb will be $38 over that period."
        },
        {
          "headline":"Install energy efficient appliances.",
          "description":"Major appliances like a refrigerator, washing machine, water heater, and dishwasher will usually be included in in the purchase of a new home. If they are not, spend extra upfront to get energy efficient models that will save you in electricity costs over time. You can also consider upgrading older appliances if they are included. Look for the Energy Star logo on appliances to tell if they are energy efficient. They will include an Energy Guide label to tell you approximately how much energy the appliance should cost you annually. You might also consider installing motion sensors that will automatically turn off lights when no one is in the room. Your utility company may offer a credit or rebate for upgrading appliances. Contact them for details."
        }
      ]
    },
    {
      "name":"Applying for Tax Breaks and Mortgage Adjustments",
      "steps":[
        {
          "headline":"Apply for federal energy efficiency benefits.",
          "description":"If you purchase new energy efficient appliances in the U.S., you can qualify for a tax credit for 10% of costs up to $500 or a specific amount from $50-$300. This only applies for an existing home that is your principal residence. New construction and rentals do not apply. Relevant appliances include stoves, heat pumps, air conditioning, water heaters, furnaces, fans, insulation, roofs, windows, doors, and skylights. You can apply for these credits on the Department of Energy’s website. The site will also inform you about local and state benefits you can apply for. These benefits apply to the U.S. Look for similar programs if you live in a different country. You might also look into installing solar panels. Using solar energy may provide you with some utility savings and tax credits."
        },
        {
          "headline":"Research tax deductions.",
          "description":"You can receive tax deductions for mortgage interest, lender points, mortgage insurance premiums, home improvements, home equity loans, and being a first-time buyer. You can indicate your qualification for these breaks on the appropriate federal tax form in January and receive information about your deduction a few weeks later. Look for similar tax-incentive programs at the state and local level in the U.S., and in other nations as well."
        },
        {
          "headline":"Pay off private mortgage insurance.",
          "description":"If your home is purchased with less than twenty percent paid down, your lender will require private mortgage insurance. PMI can add significant costs to your mortgage and you’ll want to pay enough of the principal to remove it as soon as possible. If you’d like to remove your PMI before you can pay off a sufficient amount of the principal, you can also remodel to increase your house’s market value, refinance, or get a new appraisal. Remodeling can increase the equity of your home. This is because the additions you make add value greater than the cost of the additions and this will reflect in the equity to meet the 20% level."
        },
        {
          "headline":"Talk to the experts.",
          "description":"Figuring out how to save money on your mortgage or maximize your tax savings can be tricky, especially when you're trying to settle in to a new house. Consult with your mortgage lender, an accountant or tax advisor, an attorney, and so on to discuss your options and opportunities for savings. The initial costs of a consultation will likely be a drop in the bucket in comparison to the significant savings you can accumulate for years to come. Refinancing your mortgage or appealing your property tax assessment, to name a few examples, can easily save you thousands of dollars in the years to come. However, this is not usually something you would consider right after purchasing a home. It might just be something to consider later on."
        }
      ]
    },
    {
      "name":"Saving Money in Additional Ways",
      "steps":[
        {
          "headline":"Save money before and during your move as well.",
          "description":"Don't wait until after your move to think about saving money. Start the process of saving well before you take ownership of your new home. Get rid of junk beforehand. If you are using a moving company, they may charge based on cargo weight. Go around your house and get rid of unneeded items before you start packing. Hold a garage sale or donate items to charity (and earn a tax deduction). Find free boxes. When you order something over the internet, save the box instead of throwing it away. You can also go around to local businesses, especially liquor stores, groceries, and drugstores and ask for spare boxes. Try to move during the off-season. If you are hiring movers, try to schedule your move between September and May and on a weekday instead of weekend. Movers tend to charge less during these less busy times. Ask your employer about moving assistance. Some businesses offer their employees financial assistance when they move to a new city. Speak to your Human Resources office or your supervisor to learn if this is available."
        },
        {
          "headline":"Create a household budget.",
          "description":"Take the opportunity of starting your new life in your new home to closely evaluate your spending habits and financial standing. Use a spreadsheet, program, or notebook to list your income and expenses, track what you spend your money on, and determine what is essential and not-so-essential. Once you've identified your expenses, look for ways to severely trim or eliminate the non-essentials ($5 coffees, for instance) and reduce the amount you spend on essentials (by calling your phone provider and seeking a discount, for example)."
        },
        {
          "headline":"Get in the habit of saving money.",
          "description":"Re-train yourself to save more and spend less. Automatically deduct contributions to savings and retirement accounts from your paycheck, before you ever even see the money (just like the IRS does). Focus on paying down any credit card debts and paying on time all the time. Pay for everything with whole dollars and immediately save all your change to deposit in your savings account later."
        },
        {
          "headline":"Be a savvy shopper.",
          "description":"If you're willing to put in just a bit of effort, you can save a great deal of money on groceries and other household items. Use coupons, seek out sales, plan out your shopping lists and plan of attack in advance, and look for secondhand and/or \"scratch and dent\" options. Remember:  thriftiness never goes out of style."
        }
      ]
    }
  ],
  "text":" Preventing Energy and Utility Waste Check your insulation. If you purchased an older home with minimal upgrades, chances are you have old insulation. You may find a few inches of wood chip or newspaper-like material in your attic. Wood chip and that newsprint-type insulation have an R value of 4 to 8. Your R value should be R50. If you’re not sure if that is what you have, contact a professional to inspect it for you. Contact an insulation installer and they will blow new, environmentally-friendly, highly efficient insulation into your attic. This will drastically change your energy bill. In the worst-case scenario, you've inherited Zonolite or vermiculite insulation which contains asbestos and will need to be removed immediately. Consider the insulation in your outer walls as well. Make your home air tight. If you have leaky windows and drafty doors, then you are losing energy. Check the seals on all your windows and doors. If needed, install new weather stripping and caulking. You can find supplies for this at any home improvement store. If your window frames are warped, beyond repair, or incredibly old, it might be time to install new, energy efficient windows. You may also consider adding energy efficient doors to keep in heat and avoid energy loss. Placing heavy curtains over some of the windows in your home may also help to prevent energy loss and they can also keep your home cooler during hot months by blocking out the sun. Check your hot water heater. Your hot water heater should be set at 55℃ or 130℉. This temperature should allow you a sufficiently high water temperature for showers without wastefully overheating the water. Check the pipes and knobs on the heater as well. If they are loose, it may be leaking water or heat or it may be prone to bursting. Check for leaky plumbing. Check under sinks, toilets and along the water lines in your basement looking for leaks. If your toilet is running constantly or you find a leaky faucet you should call a plumber to repair or replace them. Use a dye test to test for leaks in your toilet tank. You can purchase the dye at any home improvement store. Drop a single tablet into the tank and wait 10 minutes. If you see colored water in the bowl, you have a leak and need a plumber. Leaking pipes cause mold to develop in addition to wasting water. If you do find leaking pipes, you may also want to get a professional mold inspection. This should have been done prior to closing during house inspection process. It is required for FHA financing\nCheck underground for leaking pipes as well. You can also check the water municipality for history of use and external leaks. Install a programmable thermostat. A thermostat you can program allows you to change the temperature in your home automatically. This will allow you to save a significant amount of energy. You can also get a “smart” thermostat that learns to adjust the temperature automatically based on your preferences. During cold months, set the temperature lower at night and when you are out of the house. Adjust the program to turn up the heat at times when you are actively using your home. Reverse that during warm months. Using an air conditioning unit during hot months may help you to cope with the heat, but it can also be expensive. You can also use fans and humidifiers for comfort during hot months. Install energy efficient light bulbs. Energy efficient LED or CFL light bulbs are more expensive than incandescent light bulbs. Make the initial investment, however, and you’ll save money in the long run. They have longer lives, burn on less energy, and provide the same amount of light as incandescent bulbs. They can be found at any home improvement store or online. The energy cost savings of a single lightbulb are relatively small, but when you factor in all the lightbulbs in your home over a long period of time, the savings are significant. An incandescent lightbulb’s energy will cost $201 over 23 years while an Light Emitting Diode (LED) bulb will be $38 over that period. Install energy efficient appliances. Major appliances like a refrigerator, washing machine, water heater, and dishwasher will usually be included in in the purchase of a new home. If they are not, spend extra upfront to get energy efficient models that will save you in electricity costs over time. You can also consider upgrading older appliances if they are included. Look for the Energy Star logo on appliances to tell if they are energy efficient. They will include an Energy Guide label to tell you approximately how much energy the appliance should cost you annually. You might also consider installing motion sensors that will automatically turn off lights when no one is in the room. Your utility company may offer a credit or rebate for upgrading appliances. Contact them for details. Applying for Tax Breaks and Mortgage Adjustments Apply for federal energy efficiency benefits. If you purchase new energy efficient appliances in the U.S., you can qualify for a tax credit for 10% of costs up to $500 or a specific amount from $50-$300. This only applies for an existing home that is your principal residence. New construction and rentals do not apply. Relevant appliances include stoves, heat pumps, air conditioning, water heaters, furnaces, fans, insulation, roofs, windows, doors, and skylights. You can apply for these credits on the Department of Energy’s website. The site will also inform you about local and state benefits you can apply for. These benefits apply to the U.S. Look for similar programs if you live in a different country. You might also look into installing solar panels. Using solar energy may provide you with some utility savings and tax credits. Research tax deductions. You can receive tax deductions for mortgage interest, lender points, mortgage insurance premiums, home improvements, home equity loans, and being a first-time buyer. You can indicate your qualification for these breaks on the appropriate federal tax form in January and receive information about your deduction a few weeks later. Look for similar tax-incentive programs at the state and local level in the U.S., and in other nations as well. Pay off private mortgage insurance. If your home is purchased with less than twenty percent paid down, your lender will require private mortgage insurance. PMI can add significant costs to your mortgage and you’ll want to pay enough of the principal to remove it as soon as possible. If you’d like to remove your PMI before you can pay off a sufficient amount of the principal, you can also remodel to increase your house’s market value, refinance, or get a new appraisal. Remodeling can increase the equity of your home. This is because the additions you make add value greater than the cost of the additions and this will reflect in the equity to meet the 20% level. Talk to the experts. Figuring out how to save money on your mortgage or maximize your tax savings can be tricky, especially when you're trying to settle in to a new house. Consult with your mortgage lender, an accountant or tax advisor, an attorney, and so on to discuss your options and opportunities for savings. The initial costs of a consultation will likely be a drop in the bucket in comparison to the significant savings you can accumulate for years to come. Refinancing your mortgage or appealing your property tax assessment, to name a few examples, can easily save you thousands of dollars in the years to come. However, this is not usually something you would consider right after purchasing a home. It might just be something to consider later on. Saving Money in Additional Ways Save money before and during your move as well. Don't wait until after your move to think about saving money. Start the process of saving well before you take ownership of your new home. Get rid of junk beforehand. If you are using a moving company, they may charge based on cargo weight. Go around your house and get rid of unneeded items before you start packing. Hold a garage sale or donate items to charity (and earn a tax deduction). Find free boxes. When you order something over the internet, save the box instead of throwing it away. You can also go around to local businesses, especially liquor stores, groceries, and drugstores and ask for spare boxes. Try to move during the off-season. If you are hiring movers, try to schedule your move between September and May and on a weekday instead of weekend. Movers tend to charge less during these less busy times. Ask your employer about moving assistance. Some businesses offer their employees financial assistance when they move to a new city. Speak to your Human Resources office or your supervisor to learn if this is available. Create a household budget. Take the opportunity of starting your new life in your new home to closely evaluate your spending habits and financial standing. Use a spreadsheet, program, or notebook to list your income and expenses, track what you spend your money on, and determine what is essential and not-so-essential. Once you've identified your expenses, look for ways to severely trim or eliminate the non-essentials ($5 coffees, for instance) and reduce the amount you spend on essentials (by calling your phone provider and seeking a discount, for example). Get in the habit of saving money. Re-train yourself to save more and spend less. Automatically deduct contributions to savings and retirement accounts from your paycheck, before you ever even see the money (just like the IRS does). Focus on paying down any credit card debts and paying on time all the time. Pay for everything with whole dollars and immediately save all your change to deposit in your savings account later. Be a savvy shopper. If you're willing to put in just a bit of effort, you can save a great deal of money on groceries and other household items. Use coupons, seek out sales, plan out your shopping lists and plan of attack in advance, and look for secondhand and/or \"scratch and dent\" options. Remember:  thriftiness never goes out of style.",
  "tyn_model":[
    "insulation",
    "water",
    "hot water heater",
    "plumber",
    "thermostat",
    "air conditioning",
    "fans",
    "energy efficient appliances",
    "wood chip",
    "insulation installer",
    "vermiculite insulation",
    "weather stripping",
    "caulking",
    "windows",
    "curtains",
    "℃ or",
    "℉.",
    "heater",
    "“smart",
    "” thermostat",
    "humidifiers",
    "energy efficient light bulbs",
    "bulbs",
    "incandescent light bulbs",
    "incandescent bulbs",
    "lightbulb",
    "lightbulbs",
    "incandescent lightbulb",
    "light emitting diode (led) bulb",
    "refrigerator",
    "water heater",
    "energy efficient models",
    "energy star",
    "utility company",
    "energy efficiency benefits",
    "stoves",
    "heat pumps",
    "water heaters",
    "furnaces",
    "energy",
    "solar panels",
    "home equity loans",
    "property tax assessment",
    "movers",
    "spreadsheet",
    "notebook",
    "coupons"
  ],
  "tyn_section":[

  ]
}