{
  "title":"How to Make Chirashi Sushi",
  "url":"https://www.wikihow.com/Make-Chirashi-Sushi",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "World Cuisines",
    "Asian Cuisine",
    "Japanese Dishes",
    "Sushi"
  ],
  "steps":[
    {
      "headline":"Cook the egg.",
      "description":"Whip the egg and pour it into a pre-heated pan with some vegetable oil. Move the pan around to evenly distribute the egg and make it very thin. Once both sides are cooked, remove the egg and leave to cool."
    },
    {
      "headline":"Cut the cooked egg.",
      "description":"Cut the egg into thin slices and then set aside."
    },
    {
      "headline":"Add the rice.",
      "description":"Fill a bowl with about five ounces of rice and make it nice and flat in the bowl."
    },
    {
      "headline":"Add seaweed and cut egg.",
      "description":"Place a bed of sliced nori seaweed onto the rice, followed by a similar bed of the sliced cooked egg. Spread these both evenly as they will serve as the foundation for more yummy things to come."
    },
    {
      "headline":"Back of the bowl Take about a half a cup of shredded daikon and place it in the back of the bowl, making it look like a little mountain.",
      "description":"Now take a single shiso leaf and artfully lean it against the daikon mound."
    },
    {
      "headline":"Middle of the bowl Time now to focus on the middle area of the salad.",
      "description":"Place the sliced mackerel on the left side of the dish, followed by putting the sliced kani-kami crab sticks on top of it. Now take the shrimp and center it on top of the shiso leaf. On the right side, place the slice of salmon and then partially cover it with the slice of tuna."
    },
    {
      "headline":"Front of the bowl And now for the finishing touches, the front of the salad.",
      "description":"First, thinly slice about five slices of a cucumber, and arrange them in a cascade fashion over the bottom of the shrimp and tuna on the right bottom side of the bowl. Now put a little pickled ginger and salmon fish eggs on the bottom right area of the bowl. Finally, place a spoonful of tobiko (flying fish eggs) where the kani-kami, shrimp and cucumbers meet, putting a small bunch of white radish baby sprouts (or kaiware) to the left of the tobiko and small ball of wasabi on the right side of the tobiko."
    }
  ],
  "text":" Cook the egg. Whip the egg and pour it into a pre-heated pan with some vegetable oil. Move the pan around to evenly distribute the egg and make it very thin. Once both sides are cooked, remove the egg and leave to cool. Cut the cooked egg. Cut the egg into thin slices and then set aside. Add the rice. Fill a bowl with about five ounces of rice and make it nice and flat in the bowl. Add seaweed and cut egg. Place a bed of sliced nori seaweed onto the rice, followed by a similar bed of the sliced cooked egg. Spread these both evenly as they will serve as the foundation for more yummy things to come. Back of the bowl Take about a half a cup of shredded daikon and place it in the back of the bowl, making it look like a little mountain. Now take a single shiso leaf and artfully lean it against the daikon mound. Middle of the bowl Time now to focus on the middle area of the salad. Place the sliced mackerel on the left side of the dish, followed by putting the sliced kani-kami crab sticks on top of it. Now take the shrimp and center it on top of the shiso leaf. On the right side, place the slice of salmon and then partially cover it with the slice of tuna. Front of the bowl And now for the finishing touches, the front of the salad. First, thinly slice about five slices of a cucumber, and arrange them in a cascade fashion over the bottom of the shrimp and tuna on the right bottom side of the bowl. Now put a little pickled ginger and salmon fish eggs on the bottom right area of the bowl. Finally, place a spoonful of tobiko (flying fish eggs) where the kani-kami, shrimp and cucumbers meet, putting a small bunch of white radish baby sprouts (or kaiware) to the left of the tobiko and small ball of wasabi on the right side of the tobiko.",
  "tyn_model":[
    "bowl",
    "rice",
    "shrimp",
    "daikon",
    "shiso leaf",
    "tuna",
    "tobiko",
    "vegetable oil",
    "seaweed",
    "egg",
    "nori seaweed",
    "mackerel",
    "salmon",
    "cucumber",
    "pickled ginger",
    "flying fish eggs",
    "cucumbers",
    "white radish",
    "wasabi"
  ],
  "tyn_section":[

  ]
}