{
  "title":"How to Make Vanilla Butter",
  "url":"https://www.wikihow.com/Make-Vanilla-Butter",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Eggs and Dairy",
    "Butter and Ghee"
  ],
  "steps":[
    {
      "headline":"Know the history of butter.",
      "description":"The making of butter goes back thousands of years. During the summer months, cattle herds were often taken to hills and mountain pastures by women who herded and milked the cows and lived in 'booley huts’. They stayed in these huts throughout the summer months, only coming down for Mass and to bring the butter in firkins (barrels). In time the kitchen became the traditional place for housing and using the churn."
    },
    {
      "headline":"Pour single cream into a churn/bowl.",
      "description":"A churn is a special type of gadget made specifically for churning butter. Though you can just use electronic whisks (or your arms) instead, churns are still used by many dairy lovers. The traditional type of Irish churn, the dash churn, was a strong vessel, stave-built, with a conical body and splayed top into which fitted the lid."
    },
    {
      "headline":"Add vanilla essence.",
      "description":"This is the secret to making the butter taste sweeter and like vanilla. The recommended amount would be 2 1/2 tsp for maximum flavour, but you may alter it depending on how sweet/strong the vanilla will be."
    },
    {
      "headline":"Churn the butter.",
      "description":"If you are an experienced butter-churner, you will know what to do from here, but for the beginner you either use the churn (if that is what you have chosen) or use a whisk to churn the cream. It may take a few minutes with an electric whisk, but it will take a little bit longer if you use your arm and a plain whisk."
    },
    {
      "headline":"Shape the butter.",
      "description":"After you're happy with the product and removing it from the churn/bowl, shape it however you like. A plain rectangle is fine, but use your imagination. Once done, wrap up with kitchen paper, place in a plastic container and store in refrigerator for later use."
    }
  ],
  "text":" Know the history of butter. The making of butter goes back thousands of years. During the summer months, cattle herds were often taken to hills and mountain pastures by women who herded and milked the cows and lived in 'booley huts’. They stayed in these huts throughout the summer months, only coming down for Mass and to bring the butter in firkins (barrels). In time the kitchen became the traditional place for housing and using the churn. Pour single cream into a churn/bowl. A churn is a special type of gadget made specifically for churning butter. Though you can just use electronic whisks (or your arms) instead, churns are still used by many dairy lovers. The traditional type of Irish churn, the dash churn, was a strong vessel, stave-built, with a conical body and splayed top into which fitted the lid. Add vanilla essence. This is the secret to making the butter taste sweeter and like vanilla. The recommended amount would be 2 1/2 tsp for maximum flavour, but you may alter it depending on how sweet/strong the vanilla will be. Churn the butter. If you are an experienced butter-churner, you will know what to do from here, but for the beginner you either use the churn (if that is what you have chosen) or use a whisk to churn the cream. It may take a few minutes with an electric whisk, but it will take a little bit longer if you use your arm and a plain whisk. Shape the butter. After you're happy with the product and removing it from the churn/bowl, shape it however you like. A plain rectangle is fine, but use your imagination. Once done, wrap up with kitchen paper, place in a plastic container and store in refrigerator for later use.",
  "tyn_model":[
    "butter",
    "churn",
    "cream",
    "bowl",
    "vanilla",
    "’.",
    "churns",
    "vanilla essence",
    "whisk",
    "electric whisk",
    "plain whisk",
    "kitchen paper",
    "refrigerator"
  ],
  "tyn_section":[

  ]
}