{
  "title":"How to Make Cookies on Harvest Moon DS",
  "url":"https://www.wikihow.com/Make-Cookies-on-Harvest-Moon-DS",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Harvest Moon Series"
  ],
  "steps":[
    {
      "headline":"Buy a kitchen and make sure you have an oven in it.",
      "description":"If you don't have an oven or kitchen, you can't make cookies."
    },
    {
      "headline":"Milk your cows, and get some milk",
      "description":""
    },
    {
      "headline":"Go to your chicken coop and get some eggs.",
      "description":"It doesn't matter if they are duck or chicken eggs."
    },
    {
      "headline":"Buy some flour from the supermarket.",
      "description":""
    },
    {
      "headline":"Go into your house and walk up to your kitchen.",
      "description":"Make sure you aren't holding anything, or you won't be able to cook."
    },
    {
      "headline":"Press A in front of your kitchen and select cook.",
      "description":""
    },
    {
      "headline":"Scroll through the ingredients and select eggs, flour, and milk.",
      "description":""
    },
    {
      "headline":"Press OK, and then select the oven.",
      "description":""
    },
    {
      "headline":"Press cook, and there you have it, COOKIES!!",
      "description":"!"
    }
  ],
  "text":" Buy a kitchen and make sure you have an oven in it. If you don't have an oven or kitchen, you can't make cookies. Milk your cows, and get some milk  Go to your chicken coop and get some eggs. It doesn't matter if they are duck or chicken eggs. Buy some flour from the supermarket.  Go into your house and walk up to your kitchen. Make sure you aren't holding anything, or you won't be able to cook. Press A in front of your kitchen and select cook.  Scroll through the ingredients and select eggs, flour, and milk.  Press OK, and then select the oven.  Press cook, and there you have it, COOKIES!! !",
  "tyn_model":[
    "oven",
    "milk",
    "eggs",
    "flour"
  ],
  "tyn_section":[

  ]
}