{
  "title":"How to Defeat an Emperor Bulblax in Pikmin",
  "url":"https://www.wikihow.com/Defeat-an-Emperor-Bulblax-in-Pikmin",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Nintendo Video Game Consoles",
    "Nintendo Gamecube"
  ],
  "steps":[
    {
      "headline":"Gather an army of the allotted Pikmin.",
      "description":""
    },
    {
      "headline":"Head towards the area where the Bulblax is hiding – it is dome-shaped.",
      "description":""
    },
    {
      "headline":"Walk past the Bulblax, but do not touch him.",
      "description":"Move your Pikmin up onto the corner of the arena."
    },
    {
      "headline":"Grab your yellows and guide them over to the bomb rock cans.",
      "description":"Have them pick up as many as possible."
    },
    {
      "headline":"Wake up the Bulblax by throwing a Pikmin at him or running into him.",
      "description":"Running into him won't hurt you. Set out all the yellows with bomb rocks and let him swallow them. There should be a loud boom, and then he will drop to the ground."
    },
    {
      "headline":"Quickly get your reds and throw them at his eyes.",
      "description":""
    },
    {
      "headline":"Continue throwing reds and dodging his tongue and jumping attacks until his health is gone.",
      "description":""
    }
  ],
  "text":" Gather an army of the allotted Pikmin.  Head towards the area where the Bulblax is hiding – it is dome-shaped.  Walk past the Bulblax, but do not touch him. Move your Pikmin up onto the corner of the arena. Grab your yellows and guide them over to the bomb rock cans. Have them pick up as many as possible. Wake up the Bulblax by throwing a Pikmin at him or running into him. Running into him won't hurt you. Set out all the yellows with bomb rocks and let him swallow them. There should be a loud boom, and then he will drop to the ground. Quickly get your reds and throw them at his eyes.  Continue throwing reds and dodging his tongue and jumping attacks until his health is gone. ",
  "tyn_model":[
    "pikmin",
    "– it",
    "bomb rock",
    "bomb rocks"
  ],
  "tyn_section":[

  ]
}