{
  "title":"How to Make Your Room a Place to Be Proud of",
  "url":"https://www.wikihow.com/Make-Your-Room-a-Place-to-Be-Proud-of",
  "category_hierarchy":[
    "Home and Garden",
    "Home Maintenance",
    "Bedrooms"
  ],
  "methods":[
    {
      "name":"Clean up",
      "steps":[
        {
          "headline":"Start by cleaning up your floor.",
          "description":"You can break it up even further (like clothes, books, school stuff, etc) if you need to, but the overall goal is to get the floor picked up and everything out away. This will make the room look a lot better."
        },
        {
          "headline":"Clean up your bed.",
          "description":"Take all the sheets off, flip the mattress, and put clean sheets on it. Take the time to really make the bed. Use hospital corners, they really help."
        },
        {
          "headline":"Clean out underneath all the furniture in your room, including your bed, dresser, any bedside tables and anything else you have.",
          "description":"Then put the stuff away."
        },
        {
          "headline":"Clean off all your furniture.",
          "description":"Put everything away that isn't where it belongs. Don't organize anything just yet, that's coming soon. For right now, just get everything cleaned off."
        }
      ]
    },
    {
      "name":"Organize",
      "steps":[
        {
          "headline":"Organize your closet.",
          "description":"Usually the most unorganized place in the room is the closet. Take everything out, try it on if you're not sure it will fit, and put everything away in an organized fashion. Donate anything that doesn't fit or you don't wear anymore."
        },
        {
          "headline":"Organize your desk.",
          "description":"All the shelves, drawers, everything. Take everything out, throw out old papers, donate or sell old books. Then put everything back. Make sure you know what's in each drawer, if you want you could label them."
        },
        {
          "headline":"Organize your dresser.",
          "description":"If you don't have one, you can skip this part. Do the same thing you did for the closet- take everything out, try on as necessary, and put everything away."
        },
        {
          "headline":"Organize anything else you have, such as your bedside table(s) and your bookshelf.",
          "description":"Just organize them in a way that makes sense to you-everybody has a different way that works for them."
        }
      ]
    },
    {
      "name":"Decorate\\/Repaint",
      "steps":[
        {
          "headline":"If it's OK with your parents or whoever owns your room, you can go ahead and paint your room a different color.",
          "description":"It is their house though, so make sure to ask first. Before you do any painting, make sure you really like the color. You could buy a sample, paint a posterboard, and hang it on your wall to leave there for a few days, just to be sure you like it before you make any commitments."
        },
        {
          "headline":"Decorate!",
          "description":"Only you know your style. If you don't have a ton of money to spend, check out garage sales or thrift shops. Usually they can have some nice stuff for a lot less money then it would be to buy it new."
        }
      ]
    }
  ],
  "text":" Clean up Start by cleaning up your floor. You can break it up even further (like clothes, books, school stuff, etc) if you need to, but the overall goal is to get the floor picked up and everything out away. This will make the room look a lot better. Clean up your bed. Take all the sheets off, flip the mattress, and put clean sheets on it. Take the time to really make the bed. Use hospital corners, they really help. Clean out underneath all the furniture in your room, including your bed, dresser, any bedside tables and anything else you have. Then put the stuff away. Clean off all your furniture. Put everything away that isn't where it belongs. Don't organize anything just yet, that's coming soon. For right now, just get everything cleaned off. Organize Organize your closet. Usually the most unorganized place in the room is the closet. Take everything out, try it on if you're not sure it will fit, and put everything away in an organized fashion. Donate anything that doesn't fit or you don't wear anymore. Organize your desk. All the shelves, drawers, everything. Take everything out, throw out old papers, donate or sell old books. Then put everything back. Make sure you know what's in each drawer, if you want you could label them. Organize your dresser. If you don't have one, you can skip this part. Do the same thing you did for the closet- take everything out, try on as necessary, and put everything away. Organize anything else you have, such as your bedside table(s) and your bookshelf. Just organize them in a way that makes sense to you-everybody has a different way that works for them. Decorate\\/Repaint If it's OK with your parents or whoever owns your room, you can go ahead and paint your room a different color. It is their house though, so make sure to ask first. Before you do any painting, make sure you really like the color. You could buy a sample, paint a posterboard, and hang it on your wall to leave there for a few days, just to be sure you like it before you make any commitments. Decorate! Only you know your style. If you don't have a ton of money to spend, check out garage sales or thrift shops. Usually they can have some nice stuff for a lot less money then it would be to buy it new.",
  "tyn_model":[
    "sheets",
    "dresser"
  ],
  "tyn_section":[

  ]
}