{
  "title":"How to Make Irish Potato Candies",
  "url":"https://www.wikihow.com/Make-Irish-Potato-Candies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Recipes",
    "Chocolate and Candy"
  ],
  "steps":[
    {
      "headline":"Cream together the butter and cream cheese in a large mixing bowl.",
      "description":"For this recipe, it is very important to use regular cream cheese -- the reduced fat kind won't give your candies the right consistency in addition to not tasting great. Softened is key here. If your ingredients aren't, they won't combine nicely. That goes for too cold or too melted, for the record."
    },
    {
      "headline":"Add the vanilla and powdered sugar and beat until the mixture forms a ball.",
      "description":"Be careful not to over beat the mixture -- once it's in ball shape, it's good to go."
    },
    {
      "headline":"Add the coconut and stir with a spoon.",
      "description":"Use your hands if it doesn't seem to be combining quickly enough. You want the coconut dispersed evenly throughout the mixture."
    },
    {
      "headline":"Roll the mixture between your hands to shape the candies like potatoes.",
      "description":"Or roll into small balls, if that suits your fancy. For bite-sized pieces, this recipe should yield about 40."
    },
    {
      "headline":"Put some cinnamon in a shallow bowl.",
      "description":"Throw in a few potatoes and roll them around in it like jumping beans. Then place them on a different plate or baking sheet and place them in the fridge for an hour or until firm. If \"dirtier\" potatoes are more your thing, roll them in a second coating of cinnamon. Or if cinnamon isn't your favorite, dip them in melted chocolate -- great for making Easter eggs."
    },
    {
      "headline":"Finished.",
      "description":""
    }
  ],
  "text":" Cream together the butter and cream cheese in a large mixing bowl. For this recipe, it is very important to use regular cream cheese -- the reduced fat kind won't give your candies the right consistency in addition to not tasting great. Softened is key here. If your ingredients aren't, they won't combine nicely. That goes for too cold or too melted, for the record. Add the vanilla and powdered sugar and beat until the mixture forms a ball. Be careful not to over beat the mixture -- once it's in ball shape, it's good to go. Add the coconut and stir with a spoon. Use your hands if it doesn't seem to be combining quickly enough. You want the coconut dispersed evenly throughout the mixture. Roll the mixture between your hands to shape the candies like potatoes. Or roll into small balls, if that suits your fancy. For bite-sized pieces, this recipe should yield about 40. Put some cinnamon in a shallow bowl. Throw in a few potatoes and roll them around in it like jumping beans. Then place them on a different plate or baking sheet and place them in the fridge for an hour or until firm. If \"dirtier\" potatoes are more your thing, roll them in a second coating of cinnamon. Or if cinnamon isn't your favorite, dip them in melted chocolate -- great for making Easter eggs. Finished. ",
  "tyn_model":[
    "potatoes",
    "cinnamon",
    "cream cheese",
    "coconut",
    "butter",
    "large mixing bowl",
    "vanilla",
    "powdered sugar",
    "spoon",
    "bowl",
    "baking sheet",
    "fridge",
    "chocolate"
  ],
  "tyn_section":[

  ]
}