{
  "title":"How to Make an Ancient Letter",
  "url":"https://www.wikihow.com/Make-an-Ancient-Letter",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Decoupage and Antique Paper"
  ],
  "methods":[
    {
      "name":"Tea-Dipped Letter",
      "steps":[
        {
          "headline":"Take a piece of paper and write an old fashioned letter written in extremely small cursive.",
          "description":""
        },
        {
          "headline":"Write something like this or something else you want to write:",
          "description":"January 3rd, 1843 Dearest Mother, Against your wishes, Benjamin and I have married. Give my best hope to Papa and Mary and to the new baby boy. I hope he gets well soon. Your daughter, Amelia Jane"
        },
        {
          "headline":"Use a pan that you would make brownies in.",
          "description":"Fill it with hot water."
        },
        {
          "headline":"Take strong black tea.",
          "description":"Fill the pan deep enough to cover the paper."
        },
        {
          "headline":"Let the tea cool almost to room temperature.",
          "description":"Hot water will make the paper curl. That's not a bad thing, because it will infuse the color into the paper better."
        },
        {
          "headline":"Put a paper clip on each side of the paper to hold it under.",
          "description":"You may have to move the paper clips occasionally to keep them from leaving stray marks. You don't want to go through all the effort of making paper to look old, and end up with paper clip shadows on it. Leave it in overnight."
        },
        {
          "headline":"Take it out and dry.",
          "description":""
        }
      ]
    },
    {
      "name":"Painted Tea Letter",
      "steps":[
        {
          "headline":"Prepare the letter first.",
          "description":"Write whatever you need on a piece of blank paper. Add an old date."
        },
        {
          "headline":"Boil a little bit of water a small transparent pot.",
          "description":"The transparency will allow you to see the depth of the color and you can add more tea if wished."
        },
        {
          "headline":"When the water starts to bubble and starts to dry, put in 2 tablespoons of tea.",
          "description":"If it doesn't seem dark enough, add more."
        },
        {
          "headline":"Take the water off the stove.",
          "description":"Pour it into a pan."
        },
        {
          "headline":"Hover the letter just slightly over the water.",
          "description":"Do not dip it in completely. Instead, use a paintbrush to brush on texture. Dip in the tea tray and paint over the paper."
        },
        {
          "headline":"Allow to dry on a towel.",
          "description":"When dried, the letter is ready for use. Touch-ups can be made using the paintbrush."
        }
      ]
    }
  ],
  "text":" Tea-Dipped Letter Take a piece of paper and write an old fashioned letter written in extremely small cursive.  Write something like this or something else you want to write: January 3rd, 1843 Dearest Mother, Against your wishes, Benjamin and I have married. Give my best hope to Papa and Mary and to the new baby boy. I hope he gets well soon. Your daughter, Amelia Jane Use a pan that you would make brownies in. Fill it with hot water. Take strong black tea. Fill the pan deep enough to cover the paper. Let the tea cool almost to room temperature. Hot water will make the paper curl. That's not a bad thing, because it will infuse the color into the paper better. Put a paper clip on each side of the paper to hold it under. You may have to move the paper clips occasionally to keep them from leaving stray marks. You don't want to go through all the effort of making paper to look old, and end up with paper clip shadows on it. Leave it in overnight. Take it out and dry.  Painted Tea Letter Prepare the letter first. Write whatever you need on a piece of blank paper. Add an old date. Boil a little bit of water a small transparent pot. The transparency will allow you to see the depth of the color and you can add more tea if wished. When the water starts to bubble and starts to dry, put in 2 tablespoons of tea. If it doesn't seem dark enough, add more. Take the water off the stove. Pour it into a pan. Hover the letter just slightly over the water. Do not dip it in completely. Instead, use a paintbrush to brush on texture. Dip in the tea tray and paint over the paper. Allow to dry on a towel. When dried, the letter is ready for use. Touch-ups can be made using the paintbrush.",
  "tyn_model":[
    "water",
    "paper",
    "pan",
    "tea",
    "old fashioned letter",
    "paper clip",
    "painted tea",
    "transparent pot",
    "stove",
    "tea tray",
    "paint"
  ],
  "tyn_section":[

  ]
}