{
  "title":"How to Get the Arms Dealer in Terraria",
  "url":"https://www.wikihow.com/Get-the-Arms-Dealer-in-Terraria",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Terraria"
  ],
  "methods":[
    {
      "name":"Gaining Ammo",
      "steps":[
        {
          "headline":"Find Ammo for a gun.",
          "description":"You can rarely find these in chests scattered around the world."
        },
        {
          "headline":"Once you find Ammo for a gun, keep it in your inventory.",
          "description":"Then, wait patiently till the Arms Dealer shows up!"
        }
      ]
    },
    {
      "name":"Getting a Gun",
      "steps":[
        {
          "headline":"This method is easier, since it's less difficult to find a Gun than it is to find Ammo by itself.",
          "description":""
        },
        {
          "headline":"Explore the Corruption.",
          "description":"Go deep underground until you find a Shadow Orb. A Musket will most likely drop out, allowing you to get the Arms Dealer."
        },
        {
          "headline":"Explore the Crimson.",
          "description":"There's a 100% chance of The Undertaker (a kind of pistol) dropping out of every first Crimson Heart you destroy."
        },
        {
          "headline":"Defeat Skeletron.",
          "description":"Then, explore the Dungeon until you find the Handgun. The Handgun is slightly more difficult to obtain than the two guns mentioned above."
        },
        {
          "headline":"Get the Phoenix Blaster.",
          "description":"The Phoenix Blaster is obtained by combining the Handgun and a few Hellstone bars at the Iron/Lead anvil."
        },
        {
          "headline":"Kill Golem in the Lizard Temple.",
          "description":"There's a 20% chance that he'll drop the Stinger."
        },
        {
          "headline":"Once you get one of the guns mentioned above (or any unmentioned guns that fire bullets), the Arms Dealer will appear!",
          "description":""
        }
      ]
    }
  ],
  "text":" Gaining Ammo Find Ammo for a gun. You can rarely find these in chests scattered around the world. Once you find Ammo for a gun, keep it in your inventory. Then, wait patiently till the Arms Dealer shows up! Getting a Gun This method is easier, since it's less difficult to find a Gun than it is to find Ammo by itself.  Explore the Corruption. Go deep underground until you find a Shadow Orb. A Musket will most likely drop out, allowing you to get the Arms Dealer. Explore the Crimson. There's a 100% chance of The Undertaker (a kind of pistol) dropping out of every first Crimson Heart you destroy. Defeat Skeletron. Then, explore the Dungeon until you find the Handgun. The Handgun is slightly more difficult to obtain than the two guns mentioned above. Get the Phoenix Blaster. The Phoenix Blaster is obtained by combining the Handgun and a few Hellstone bars at the Iron/Lead anvil. Kill Golem in the Lizard Temple. There's a 20% chance that he'll drop the Stinger. Once you get one of the guns mentioned above (or any unmentioned guns that fire bullets), the Arms Dealer will appear! ",
  "tyn_model":[
    "ammo",
    "arms dealer",
    "gun",
    "musket",
    "crimson",
    "pistol",
    "guns",
    "phoenix blaster",
    "handgun",
    "golem",
    "stinger"
  ],
  "tyn_section":[

  ]
}