{
  "title":"How to Unlock the Master of Disguise Achievement in Team Fortress 2",
  "url":"https://www.wikihow.com/Unlock-the-Master-of-Disguise-Achievement-in-Team-Fortress-2",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Team Fortress 2"
  ],
  "steps":[
    {
      "headline":"Find a Ranked or Player match to take part in on Team Fortress 2.",
      "description":"Although either will suffice, Player matches do not record your rankings, so any failed attempts will not go against your name. Of course, Team Fortress 2 is an online, multiplayer game, so your Xbox LIVE membership will need to be activated first."
    },
    {
      "headline":"Play as a spy.",
      "description":"This is the only character you can play as to get the achievement. Try practicing using your spy before attempting this achievement in order to perfect your skill."
    },
    {
      "headline":"Disguise yourself as an enemy player and blend into the enemy team's ranks.",
      "description":"This may take several attempts, which will only get harder to pull off if you're uncovered to be a spy several times, so be patient and skillful in your attempts. The trick is to look natural and not panic."
    },
    {
      "headline":"Attract the attention of a nearby enemy medic, either by walking near one or by pressing the Right Joystick on your Xbox 360 controller to call for one.",
      "description":"Make sure you don't put yourself at risk of being uncovered by calling out for a medic - remember, it'll only get harder to unlock the achievement if you are uncovered."
    },
    {
      "headline":"Let the medic heal you.",
      "description":"You don't even have to have taken damage. Only a small amount of healing is required for you to unlock the achievement. You may dispose of the medic as you wish after you are done with him."
    },
    {
      "headline":"Check your Xbox 360 gamerscore and achievement statistics and you will see that the Master of Disguise achievement has been unlocked for 15 gamerscore.",
      "description":"It is represented by a face with a Groucho Marx disguise."
    }
  ],
  "text":" Find a Ranked or Player match to take part in on Team Fortress 2. Although either will suffice, Player matches do not record your rankings, so any failed attempts will not go against your name. Of course, Team Fortress 2 is an online, multiplayer game, so your Xbox LIVE membership will need to be activated first. Play as a spy. This is the only character you can play as to get the achievement. Try practicing using your spy before attempting this achievement in order to perfect your skill. Disguise yourself as an enemy player and blend into the enemy team's ranks. This may take several attempts, which will only get harder to pull off if you're uncovered to be a spy several times, so be patient and skillful in your attempts. The trick is to look natural and not panic. Attract the attention of a nearby enemy medic, either by walking near one or by pressing the Right Joystick on your Xbox 360 controller to call for one. Make sure you don't put yourself at risk of being uncovered by calling out for a medic - remember, it'll only get harder to unlock the achievement if you are uncovered. Let the medic heal you. You don't even have to have taken damage. Only a small amount of healing is required for you to unlock the achievement. You may dispose of the medic as you wish after you are done with him. Check your Xbox 360 gamerscore and achievement statistics and you will see that the Master of Disguise achievement has been unlocked for 15 gamerscore. It is represented by a face with a Groucho Marx disguise.",
  "tyn_model":[
    "medic",
    "team fortress 2",
    "xbox 360",
    "spy",
    "groucho marx"
  ],
  "tyn_section":[

  ]
}