{
  "title":"How to Make Chocolate Chip Pancake Cookies",
  "url":"https://www.wikihow.com/Make-Chocolate-Chip-Pancake-Cookies",
  "category_hierarchy":[
    "Food and Entertaining",
    "Breakfast",
    "Pancakes"
  ],
  "steps":[
    {
      "headline":"Preheat the oven to 160ºC/320ºF.",
      "description":"Cover the cookie tray/sheet in foil for baking. Smooth butter over the foil, using the back of a tablespoon."
    },
    {
      "headline":"Add butter, sugar, and vanilla extract to bowl.",
      "description":"Beat until smooth."
    },
    {
      "headline":"Crack an egg into the batter when smooth.",
      "description":"Stir in."
    },
    {
      "headline":"Add half the amount (1/4 cup) of flour into the bowl.",
      "description":"Mix in until the batter is thoroughly smooth."
    },
    {
      "headline":"Tip the chocolate bits into the batter.",
      "description":"Stir until evenly distributed."
    },
    {
      "headline":"Place the remaining quarter of flour into the batter.",
      "description":"Beat until the batter is lump-free. The mixture should now be sticky."
    },
    {
      "headline":"Use the same wooden spoon used for preparing the batter to pour small amounts of the batter onto the tray/sheet.",
      "description":"Do not worry about the batter oozing over the tray/sheet. The butter will prevent the batter from sticking to the tray. Arrange the dough into a cookie shape on your tray/sheet during cooking."
    },
    {
      "headline":"Place in oven for 10 to 15 minutes.",
      "description":""
    },
    {
      "headline":"Cut out the pancake cookies shapes.The batter will have spread over the tray/sheet.",
      "description":"Despite there being only one pancake cookie in the oven, there will be lines showing where the batter has mixed together. Use a kitchen knife to cut the these lines, creating a rough shape of a round pancake/cookie. Transfer to a wire cooling rack to cool."
    },
    {
      "headline":"Serve.",
      "description":"Once cooled down, the chocolate chip pancake cookies are ready to serve. They will have hardened nicely."
    }
  ],
  "text":" Preheat the oven to 160ºC/320ºF. Cover the cookie tray/sheet in foil for baking. Smooth butter over the foil, using the back of a tablespoon. Add butter, sugar, and vanilla extract to bowl. Beat until smooth. Crack an egg into the batter when smooth. Stir in. Add half the amount (1/4 cup) of flour into the bowl. Mix in until the batter is thoroughly smooth. Tip the chocolate bits into the batter. Stir until evenly distributed. Place the remaining quarter of flour into the batter. Beat until the batter is lump-free. The mixture should now be sticky. Use the same wooden spoon used for preparing the batter to pour small amounts of the batter onto the tray/sheet. Do not worry about the batter oozing over the tray/sheet. The butter will prevent the batter from sticking to the tray. Arrange the dough into a cookie shape on your tray/sheet during cooking. Place in oven for 10 to 15 minutes.  Cut out the pancake cookies shapes.The batter will have spread over the tray/sheet. Despite there being only one pancake cookie in the oven, there will be lines showing where the batter has mixed together. Use a kitchen knife to cut the these lines, creating a rough shape of a round pancake/cookie. Transfer to a wire cooling rack to cool. Serve. Once cooled down, the chocolate chip pancake cookies are ready to serve. They will have hardened nicely.",
  "tyn_model":[
    "butter",
    "oven",
    "bowl",
    "flour",
    "cookie tray",
    "foil",
    "sugar",
    "vanilla extract",
    "egg",
    "chocolate",
    "wooden spoon",
    "pancake cookies",
    "kitchen knife",
    "chocolate chip pancake cookies"
  ],
  "tyn_section":[

  ]
}