{
  "title":"How to Calculate Board Feet",
  "url":"https://www.wikihow.com/Calculate-Board-Feet",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Woodworking"
  ],
  "methods":[
    {
      "name":"Finding the Volume of Boards",
      "steps":[
        {
          "headline":"Use the rough size of the boards rather than the actual size.",
          "description":"The rough, or nominal, size of a board refers to the dimensions the manufacturer will supply you with, such as “2 x 4” which means 2 inches by 4 inches. However, after processing, the board’s actual measurements are closer to 1.5 inches by 3.5 inches. When calculating board feet, always use the rough size to get an accurate result."
        },
        {
          "headline":"Measure the thickness and width in inches and the length in feet.",
          "description":"Use your measuring tape to find both the thickness and the width of the board in inches. Then, find the length in feet rather than inches, since that is how lumber is typically measured. If you know the size of the boards you’ll be using, you can use the provided dimensions instead of measuring the boards. For example, a 4 x 4 has a thickness of 4 inches and a width of 4 inches. If the board is 10 feet long, that’s the length."
        },
        {
          "headline":"Multiply the thickness by the width by the length and divide the result by 12.",
          "description":"Start by taking all 3 measurements and multiplying them together. For this example, 4 x 4 x 10 = 160. To finish the calculation, just divide by 12. In this case, 160 ÷ 12 = 13.33, so you need 13.33 board feet of lumber.Variation: If you measured the length in inches rather than feet, such as if you have a very short board, multiply the dimensions of the board together as usual but divide the result by 144 instead of 12. If you have multiple boards that are the same size, do the entire calculation for a single board and multiply it by the number of boards you need. For instance, if you have 20 boards that are 2 inches by 6 inches by 8 feet, multiply 2 by 6 by 8, which equals 96. Divide 96 by 12, which is 8 (the number of board feet in a single board of this size). Multiply 8 by 20, which is 160, to find the total board feet."
        },
        {
          "headline":"Convert board feet to square feet by dividing by the thickness in inches.",
          "description":"If you’re given the volume of lumber in board feet, you can easily figure out the square footage the boards will cover. Remember that volume is a three-dimensional measurement while square footage is a two-dimensional measurement. Take the total board feet and divide it by the thickness, in inches, of the boards. For example, say you have 1,500 board feet of lumber. If the boards are 3 inches thick, divide 1,500 by 3, which is equal to 500. So, 1,500 board feet is equivalent to 500 square feet."
        }
      ]
    },
    {
      "name":"Estimating Board Feet in a Tree or Log",
      "steps":[
        {
          "headline":"Measure the diameter of the tree or the log inside the bark.",
          "description":"Use a flexible measuring tape, tree diameter tape, tree caliper, or Biltmore stick to find the diameter of the tree at breast height (DBH), or about 4.5 feet above the ground. If you’re working with a cut log, measure the diameter inside the bark (DIB) at the small end of the log.Tip: If you’re using a flexible measuring tape, find the circumference of the tree, then divide the circumference by π (3.14) to calculate the diameter."
        },
        {
          "headline":"Find the height of the tree or the length of the log in feet.",
          "description":"Use your measuring device to find the height or length. Tree height is generally measured in 16-foot increments in order to estimate board feet. Log length is typically measured in 2-foot increments, such as 6 feet, 8 feet, 10 feet, and so on."
        },
        {
          "headline":"Plug your measurements into the Doyle scale.",
          "description":"The Doyle scale is most often used to calculate board feet in a tree or log. All you need to do is plug in the diameter at breast height (DBH) and number of 16-foot logs in a tree or the diameter inside the bark (DIB) at the small end of the log and the log length in feet to figure out the volume in board feet. You can find the Doyle scale table here: https://nfs.unl.edu/documents/ruralforestry/tree%20and%20log%20scale%20Doyle%20WEB.pdf\n\nSay the DBH is 22 and the height is 32 feet, or that there are 2 16-foot logs in the tree. Using the Doyle scale, you'd find that there are 295 board feet in the tree. Alternatively, say that the DIB is 35 and the log is 10 feet long. Based on the Doyle scale, the volume in board feet for the log is 601."
        }
      ]
    }
  ],
  "text":" Finding the Volume of Boards Use the rough size of the boards rather than the actual size. The rough, or nominal, size of a board refers to the dimensions the manufacturer will supply you with, such as “2 x 4” which means 2 inches by 4 inches. However, after processing, the board’s actual measurements are closer to 1.5 inches by 3.5 inches. When calculating board feet, always use the rough size to get an accurate result. Measure the thickness and width in inches and the length in feet. Use your measuring tape to find both the thickness and the width of the board in inches. Then, find the length in feet rather than inches, since that is how lumber is typically measured. If you know the size of the boards you’ll be using, you can use the provided dimensions instead of measuring the boards. For example, a 4 x 4 has a thickness of 4 inches and a width of 4 inches. If the board is 10 feet long, that’s the length. Multiply the thickness by the width by the length and divide the result by 12. Start by taking all 3 measurements and multiplying them together. For this example, 4 x 4 x 10 = 160. To finish the calculation, just divide by 12. In this case, 160 ÷ 12 = 13.33, so you need 13.33 board feet of lumber.Variation: If you measured the length in inches rather than feet, such as if you have a very short board, multiply the dimensions of the board together as usual but divide the result by 144 instead of 12. If you have multiple boards that are the same size, do the entire calculation for a single board and multiply it by the number of boards you need. For instance, if you have 20 boards that are 2 inches by 6 inches by 8 feet, multiply 2 by 6 by 8, which equals 96. Divide 96 by 12, which is 8 (the number of board feet in a single board of this size). Multiply 8 by 20, which is 160, to find the total board feet. Convert board feet to square feet by dividing by the thickness in inches. If you’re given the volume of lumber in board feet, you can easily figure out the square footage the boards will cover. Remember that volume is a three-dimensional measurement while square footage is a two-dimensional measurement. Take the total board feet and divide it by the thickness, in inches, of the boards. For example, say you have 1,500 board feet of lumber. If the boards are 3 inches thick, divide 1,500 by 3, which is equal to 500. So, 1,500 board feet is equivalent to 500 square feet. Estimating Board Feet in a Tree or Log Measure the diameter of the tree or the log inside the bark. Use a flexible measuring tape, tree diameter tape, tree caliper, or Biltmore stick to find the diameter of the tree at breast height (DBH), or about 4.5 feet above the ground. If you’re working with a cut log, measure the diameter inside the bark (DIB) at the small end of the log.Tip: If you’re using a flexible measuring tape, find the circumference of the tree, then divide the circumference by π (3.14) to calculate the diameter. Find the height of the tree or the length of the log in feet. Use your measuring device to find the height or length. Tree height is generally measured in 16-foot increments in order to estimate board feet. Log length is typically measured in 2-foot increments, such as 6 feet, 8 feet, 10 feet, and so on. Plug your measurements into the Doyle scale. The Doyle scale is most often used to calculate board feet in a tree or log. All you need to do is plug in the diameter at breast height (DBH) and number of 16-foot logs in a tree or the diameter inside the bark (DIB) at the small end of the log and the log length in feet to figure out the volume in board feet. You can find the Doyle scale table here: https://nfs.unl.edu/documents/ruralforestry/tree%20and%20log%20scale%20Doyle%20WEB.pdf\n\nSay the DBH is 22 and the height is 32 feet, or that there are 2 16-foot logs in the tree. Using the Doyle scale, you'd find that there are 295 board feet in the tree. Alternatively, say that the DIB is 35 and the log is 10 feet long. Based on the Doyle scale, the volume in board feet for the log is 601.",
  "tyn_model":[
    "doyle scale",
    "lumber",
    "boards",
    "flexible measuring tape",
    "logs",
    "board",
    "“2",
    "” which",
    "measuring tape",
    "4 x 4",
    "÷ 12",
    "tree diameter tape",
    "tree caliper",
    "biltmore stick",
    "π (",
    "log"
  ],
  "tyn_section":[

  ]
}