{
  "title":"How to Fold a Square of Paper Into Thirds",
  "url":"https://www.wikihow.com/Fold-a-Square-of-Paper-Into-Thirds",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts",
    "Paper Craft",
    "Origami"
  ],
  "steps":[
    {
      "headline":"Fold the template square in half horizontally and open up again.",
      "description":""
    },
    {
      "headline":"Fold the lower edge up to meet the crease in the middle and unfold.",
      "description":""
    },
    {
      "headline":"Repeat with the upper edge.",
      "description":""
    },
    {
      "headline":"Lie the square in front of you so that it looks like a diamond.",
      "description":"The template is finished."
    },
    {
      "headline":"Take the square meant for the actual model and place it so its top right corner meets the template's right corner.",
      "description":""
    },
    {
      "headline":"Turn the model square slightly, so that its top left corner meets the left quarter line of the template.",
      "description":"There is only one place where the model square can meet both the corner and the line."
    },
    {
      "headline":"Hold both papers steady with your left hand and then fold the right-hand side of the model square over to meet the middle-line of the template.",
      "description":"Unfold it again."
    },
    {
      "headline":"Fold the left-hand side over to meet the fold line on the model that you just created in the previous step.",
      "description":"Unfold it again. (If you want the paper divided into thirds the other way as well, continue on. If not, you're finished.)"
    },
    {
      "headline":"Rotate the model square 90 degrees left.",
      "description":""
    },
    {
      "headline":"Lie it again so that the model's top right corner meets the the template's right corner and the top left corner meets the left quarter line.",
      "description":""
    },
    {
      "headline":"Repeat steps 7 and 8 on this side of the model.",
      "description":""
    },
    {
      "headline":"You're done!",
      "description":"Now you have got a square divided into perfect thirds both ways."
    }
  ],
  "text":" Fold the template square in half horizontally and open up again.  Fold the lower edge up to meet the crease in the middle and unfold.  Repeat with the upper edge.  Lie the square in front of you so that it looks like a diamond. The template is finished. Take the square meant for the actual model and place it so its top right corner meets the template's right corner.  Turn the model square slightly, so that its top left corner meets the left quarter line of the template. There is only one place where the model square can meet both the corner and the line. Hold both papers steady with your left hand and then fold the right-hand side of the model square over to meet the middle-line of the template. Unfold it again. Fold the left-hand side over to meet the fold line on the model that you just created in the previous step. Unfold it again. (If you want the paper divided into thirds the other way as well, continue on. If not, you're finished.) Rotate the model square 90 degrees left.  Lie it again so that the model's top right corner meets the the template's right corner and the top left corner meets the left quarter line.  Repeat steps 7 and 8 on this side of the model.  You're done! Now you have got a square divided into perfect thirds both ways.",
  "tyn_model":[
    "papers",
    "paper"
  ],
  "tyn_section":[

  ]
}