{
  "title":"How to Make Beet Lemonade",
  "url":"https://www.wikihow.com/Make-Beet-Lemonade",
  "category_hierarchy":[
    "Food and Entertaining",
    "Drinks",
    "Citrus Based Drinks",
    "Lemonade Drinks"
  ],
  "steps":[
    {
      "headline":"Blend together beets, sugar, and lemon juice for about one minute or until the mixture is bright pink.",
      "description":"Note that the beet will never be smooth. Do not panic if it does not blend well."
    },
    {
      "headline":"Place a large bowl on your counter.",
      "description":"Put a strainer into it. Strain your lemonade, pressing on any remaining grated beet."
    },
    {
      "headline":"Throw grated beet pieces in trash.",
      "description":"Transfer your lemonade to a pitcher."
    },
    {
      "headline":"Pour the six cups of water into the pitcher.",
      "description":"Stir using a wooden spoon."
    },
    {
      "headline":"Add more lemon or sugar to taste.",
      "description":""
    },
    {
      "headline":"Store in the fridge.",
      "description":"Have it chill from 4 hours to overnight."
    },
    {
      "headline":"Decorate with mint leaves and a straw.",
      "description":"Add a few ice cubes."
    },
    {
      "headline":"Enjoy!",
      "description":""
    }
  ],
  "text":" Blend together beets, sugar, and lemon juice for about one minute or until the mixture is bright pink. Note that the beet will never be smooth. Do not panic if it does not blend well. Place a large bowl on your counter. Put a strainer into it. Strain your lemonade, pressing on any remaining grated beet. Throw grated beet pieces in trash. Transfer your lemonade to a pitcher. Pour the six cups of water into the pitcher. Stir using a wooden spoon. Add more lemon or sugar to taste.  Store in the fridge. Have it chill from 4 hours to overnight. Decorate with mint leaves and a straw. Add a few ice cubes. Enjoy! ",
  "tyn_model":[
    "sugar",
    "pitcher",
    "beets",
    "lemon juice",
    "bowl",
    "strainer",
    "lemonade",
    "water",
    "wooden spoon",
    "lemon",
    "fridge",
    "mint leaves",
    "straw",
    "ice cubes"
  ],
  "tyn_section":[

  ]
}