{
  "title":"How to Play Town of Salem",
  "url":"https://www.wikihow.com/Play-Town-of-Salem",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "PC Games"
  ],
  "parts":[
    {
      "name":"Creating an Account",
      "steps":[
        {
          "headline":"Search \"Town of Salem\" using your search engine.",
          "description":"Alternatively, go to blankmediagames.com. Click on the link."
        },
        {
          "headline":"Click \"Register\".",
          "description":""
        },
        {
          "headline":"Fill out the information as required.",
          "description":"Verify your email address if you want to receive a bonus."
        },
        {
          "headline":"Go to the Town of Salem website.",
          "description":""
        },
        {
          "headline":"Log in using your chosen username and password.",
          "description":""
        }
      ]
    },
    {
      "name":"Customizing Your Character and Other Aspects",
      "steps":[
        {
          "headline":"Click on your avatar's head on the left below \"Home.\"",
          "description":""
        },
        {
          "headline":"Click your avatar to change your appearance.",
          "description":""
        },
        {
          "headline":"Click the text box above your character to change your name.",
          "description":"#* This can be changed before every game when you get to the \"Name Choosing\" part."
        },
        {
          "headline":"Click on the building behind your character to change the house.",
          "description":""
        },
        {
          "headline":"Click on the map to change the look of the town.",
          "description":""
        },
        {
          "headline":"Click the \"No Pet\" to change your pet.",
          "description":"These can be bought in the Shop after you get coins for playing the game."
        },
        {
          "headline":"Click on the hung person on the right to change the death animation.",
          "description":""
        },
        {
          "headline":"Click on the picture of the bearded man on the right to change your icon in the lobby menu.",
          "description":"You have to donate to do this."
        },
        {
          "headline":"Click on the man on the sign to go to \"Customization Settings\".",
          "description":""
        },
        {
          "headline":"Click \"Save\" to save your choices.",
          "description":""
        }
      ]
    },
    {
      "name":"Learning About the Roles",
      "steps":[
        {
          "headline":"Click the role card next to the bug at the top.",
          "description":""
        },
        {
          "headline":"Scroll through the wiki page to find out all about the different roles in the game.",
          "description":""
        }
      ]
    },
    {
      "name":"Using the Shop",
      "steps":[
        {
          "headline":"Click the treasure chest on the left.",
          "description":""
        },
        {
          "headline":"Click each category to browse through the shop items.",
          "description":""
        },
        {
          "headline":"Click \"Buy\" underneath the items to buy them with in-game coins.",
          "description":""
        },
        {
          "headline":"Click the treasure chest again to get rid of the Shop screen.",
          "description":""
        },
        {
          "headline":"Look for purchase discounts.",
          "description":"If a pop-up shows up, it is a Town of Salem purchase discount. They are available for a short amount of time! If you don't want to buy this, close it with the [X] button. If you do happen to want to buy this, then press the [BUY NOW] button. It will give you directions for what to do next."
        }
      ]
    },
    {
      "name":"Gaining Achievements",
      "steps":[
        {
          "headline":"Click the medal icon below the treasure chest on the left.",
          "description":""
        },
        {
          "headline":"Click each role to see what achievements there are for each one.",
          "description":""
        }
      ]
    },
    {
      "name":"Choosing Playing Modes",
      "steps":[
        {
          "headline":"Click \"Play\".",
          "description":""
        },
        {
          "headline":"Click \"Classic\".",
          "description":""
        },
        {
          "headline":"Click \"Join Queue\".",
          "description":""
        },
        {
          "headline":"Wait for the queue timer to run out.",
          "description":"Once it does, click join."
        },
        {
          "headline":"Click \"Play\".",
          "description":""
        },
        {
          "headline":"Click \"(BETA) Ranked\".",
          "description":"(Note: must have played at least 50 games to unlock ranked mode)"
        },
        {
          "headline":"Click \"Join Lobby\".",
          "description":""
        },
        {
          "headline":"Wait for the game to start.",
          "description":"If you don't click the accept button within 10 seconds of its appearance, you will be taken off of the game queue."
        },
        {
          "headline":"Click \"Play\".",
          "description":""
        },
        {
          "headline":"Click \"Custom\".",
          "description":""
        },
        {
          "headline":"Click \"Join Lobby\".",
          "description":""
        },
        {
          "headline":"Play the role of the host:",
          "description":"Choose roles on the right menu. (Mandatory: Godfather)\nClick \"Start\" when there are enough people and you have filled out the chart. Make a name at the next screen."
        },
        {
          "headline":"Play when you are not hosting.",
          "description":"If you are not the host:\nWait for the game to start. Request roles by typing in chat. At the next screen, type a name to use during the game."
        },
        {
          "headline":"Click \"Play\", then \"All Any\".",
          "description":""
        },
        {
          "headline":"Click \"Join Lobby\".",
          "description":""
        },
        {
          "headline":"Wait for the game to start when there are enough people in the lobby, as the host does not pick the roles.",
          "description":"The roles are random."
        },
        {
          "headline":"Make a name on the next screen.",
          "description":""
        },
        {
          "headline":"Click \"Play\", \"Rapid Mode\", and \"Join Lobby\".",
          "description":""
        },
        {
          "headline":"Wait for the game to start.",
          "description":"In this mode, the discussion and night phases are faster."
        },
        {
          "headline":"Click \"Play\", \"Vigilantics\", and \"Join Lobby\".",
          "description":""
        },
        {
          "headline":"Wait for the game to start.",
          "description":"This game mode has only witches and vigilantes."
        }
      ]
    },
    {
      "name":"Linking with Friends",
      "steps":[
        {
          "headline":"Click the \"Friends\" button at the bottom right corner.",
          "description":""
        },
        {
          "headline":"Click \"Add Friend\".",
          "description":""
        },
        {
          "headline":"Type in your friend's username",
          "description":""
        },
        {
          "headline":"Click the plus button.",
          "description":""
        }
      ]
    },
    {
      "name":"Throwing Parties",
      "steps":[
        {
          "headline":"Click \"Play\".",
          "description":""
        },
        {
          "headline":"Click \"Create a Party\".",
          "description":""
        },
        {
          "headline":"Click \"Invite\" to add people to the party.",
          "description":""
        },
        {
          "headline":"Wait for them to accept.",
          "description":""
        },
        {
          "headline":"Click the mode you want to play in the top right corner.",
          "description":""
        },
        {
          "headline":"Click \"Start\".",
          "description":""
        }
      ]
    },
    {
      "name":"Using General Features",
      "steps":[
        {
          "headline":"Click the social media icons to go to Blank Media Games' social media.",
          "description":"The messages above \"Follow Us\" are the latest tweets from Blank Media Games."
        },
        {
          "headline":"Change your settings.",
          "description":"Click the gear at the top of the screen to go to \"Settings\". Click \"Chat Filter\" to filter out the swear words if preferred. Click \"Save\" to save changes."
        },
        {
          "headline":"Report a bug.",
          "description":"Click the bug icon next to the gear. On the forum, log in and make a thread about the bug."
        },
        {
          "headline":"Get help.",
          "description":"Click the question mark icon next to the role card. Read the threads on the forum."
        },
        {
          "headline":"Get notifications.",
          "description":"When you get a notification, click the \"Notifications\" button at the bottom right corner. If it is an invite to play a game, click either \"Join\" or \"Ignore\"."
        }
      ]
    }
  ],
  "text":" Creating an Account Search \"Town of Salem\" using your search engine. Alternatively, go to blankmediagames.com. Click on the link. Click \"Register\".  Fill out the information as required. Verify your email address if you want to receive a bonus. Go to the Town of Salem website.  Log in using your chosen username and password.  Customizing Your Character and Other Aspects Click on your avatar's head on the left below \"Home.\"  Click your avatar to change your appearance.  Click the text box above your character to change your name. #* This can be changed before every game when you get to the \"Name Choosing\" part. Click on the building behind your character to change the house.  Click on the map to change the look of the town.  Click the \"No Pet\" to change your pet. These can be bought in the Shop after you get coins for playing the game. Click on the hung person on the right to change the death animation.  Click on the picture of the bearded man on the right to change your icon in the lobby menu. You have to donate to do this. Click on the man on the sign to go to \"Customization Settings\".  Click \"Save\" to save your choices.  Learning About the Roles Click the role card next to the bug at the top.  Scroll through the wiki page to find out all about the different roles in the game.  Using the Shop Click the treasure chest on the left.  Click each category to browse through the shop items.  Click \"Buy\" underneath the items to buy them with in-game coins.  Click the treasure chest again to get rid of the Shop screen.  Look for purchase discounts. If a pop-up shows up, it is a Town of Salem purchase discount. They are available for a short amount of time! If you don't want to buy this, close it with the [X] button. If you do happen to want to buy this, then press the [BUY NOW] button. It will give you directions for what to do next. Gaining Achievements Click the medal icon below the treasure chest on the left.  Click each role to see what achievements there are for each one.  Choosing Playing Modes Click \"Play\".  Click \"Classic\".  Click \"Join Queue\".  Wait for the queue timer to run out. Once it does, click join. Click \"Play\".  Click \"(BETA) Ranked\". (Note: must have played at least 50 games to unlock ranked mode) Click \"Join Lobby\".  Wait for the game to start. If you don't click the accept button within 10 seconds of its appearance, you will be taken off of the game queue. Click \"Play\".  Click \"Custom\".  Click \"Join Lobby\".  Play the role of the host: Choose roles on the right menu. (Mandatory: Godfather)\nClick \"Start\" when there are enough people and you have filled out the chart. Make a name at the next screen. Play when you are not hosting. If you are not the host:\nWait for the game to start. Request roles by typing in chat. At the next screen, type a name to use during the game. Click \"Play\", then \"All Any\".  Click \"Join Lobby\".  Wait for the game to start when there are enough people in the lobby, as the host does not pick the roles. The roles are random. Make a name on the next screen.  Click \"Play\", \"Rapid Mode\", and \"Join Lobby\".  Wait for the game to start. In this mode, the discussion and night phases are faster. Click \"Play\", \"Vigilantics\", and \"Join Lobby\".  Wait for the game to start. This game mode has only witches and vigilantes. Linking with Friends Click the \"Friends\" button at the bottom right corner.  Click \"Add Friend\".  Type in your friend's username  Click the plus button.  Throwing Parties Click \"Play\".  Click \"Create a Party\".  Click \"Invite\" to add people to the party.  Wait for them to accept.  Click the mode you want to play in the top right corner.  Click \"Start\".  Using General Features Click the social media icons to go to Blank Media Games' social media. The messages above \"Follow Us\" are the latest tweets from Blank Media Games. Change your settings. Click the gear at the top of the screen to go to \"Settings\". Click \"Chat Filter\" to filter out the swear words if preferred. Click \"Save\" to save changes. Report a bug. Click the bug icon next to the gear. On the forum, log in and make a thread about the bug. Get help. Click the question mark icon next to the role card. Read the threads on the forum. Get notifications. When you get a notification, click the \"Notifications\" button at the bottom right corner. If it is an invite to play a game, click either \"Join\" or \"Ignore\".",
  "tyn_model":[
    "chat",
    "blank media games"
  ],
  "tyn_section":[

  ]
}