{
  "title":"How to Find Your Way Around the Summer Night Sky",
  "url":"https://www.wikihow.com/Find-Your-Way-Around-the-Summer-Night-Sky",
  "category_hierarchy":[
    "Hobbies and Crafts"
  ],
  "steps":[
    {
      "headline":"Look for three bright stars.",
      "description":"The chart below represents a typical summer night (in this case July 14th at 9pm local/10pm local DST) at roughly 35° north (close to the latitude for the cities of Memphis, Tennessee (USA), Tokyo (Japan) and Tehran (Iran)). Looking straight up, facing south, you'll notice three bright stars to your left (the east). These stars are Vega, Altair and Deneb. They form a large asterism known as the Summer Triangle."
    },
    {
      "headline":"Go for the three constellations.",
      "description":"After locating the Summer Triangle, you can identify the three constellations associated with those stars: Lyra the Harp, Aquila the Eagle and Cygnus the Swan."
    },
    {
      "headline":"Spot an orange star.",
      "description":"To your right (the west), and a little further north, you will find the Big Dipper also known as the Plough. The plough is actually another asterism. Follow the curve of the handle south towards a very bright star; \"arc to Arcturus\", the brilliant orange star that marks the constellation Boötes the Herdsman."
    },
    {
      "headline":"Locate another bright constellation.",
      "description":"This one is perhaps the best looking summer constellation, Scorpius the Scorpion, which lies due south. The brightest star in Scorpius is Antares, a red giant."
    },
    {
      "headline":"Use the brighter constellations to locate some of the fainter constellations.",
      "description":"Draw an invisible line from Deneb through Vega and a little further west. This will lead you to the constellation Hercules the Hero."
    },
    {
      "headline":"Move west and back to the bright star Arcturus.",
      "description":"Since you have already followed the \"arc to Arcturus\", you can now \"spike to Spica\", which is the brightest star in the constellation Virgo the Maiden."
    },
    {
      "headline":"Look for the Teapot.",
      "description":"Moving back to the south and Scorpius, locate the \"Teapot\" asterism. It is made up of the brightest members of the constellation Sagittarius the Archer. An interesting fact; the area just above the \"spout\" and between Scorpius marks the direction of the center of the Milky Way, our galactic home."
    },
    {
      "headline":"Find the Big Bear.",
      "description":"Move back north now. The Big Dipper (the Plough) mentioned before as an asterism is actually part of a large constellation known as Ursa Major, the Big Bear. If you follow an invisible line from the two stars opposite the handle (the \"pointers\"), you'll find that they point almost directly towards Polaris, the North Star, which is at the end of the handle of the Little Dipper, another asterism. This is actually Ursa Minor, the Little Bear."
    },
    {
      "headline":"Go for Cassiopeia, the queen.",
      "description":"If you continue to follow the line through Polaris, you will come to a constellation that lies almost directly opposite the sky of Ursa Major. This is Cassiopeia the Queen, one of the major autumn constellations."
    },
    {
      "headline":"Locate one of the smallest of the 88 official constellations, just to the east of the Summer Triangle.",
      "description":"This is Delphinus the Dolphin which truly looks like its namesake."
    }
  ],
  "text":" Look for three bright stars. The chart below represents a typical summer night (in this case July 14th at 9pm local/10pm local DST) at roughly 35° north (close to the latitude for the cities of Memphis, Tennessee (USA), Tokyo (Japan) and Tehran (Iran)). Looking straight up, facing south, you'll notice three bright stars to your left (the east). These stars are Vega, Altair and Deneb. They form a large asterism known as the Summer Triangle. Go for the three constellations. After locating the Summer Triangle, you can identify the three constellations associated with those stars: Lyra the Harp, Aquila the Eagle and Cygnus the Swan. Spot an orange star. To your right (the west), and a little further north, you will find the Big Dipper also known as the Plough. The plough is actually another asterism. Follow the curve of the handle south towards a very bright star; \"arc to Arcturus\", the brilliant orange star that marks the constellation Boötes the Herdsman. Locate another bright constellation. This one is perhaps the best looking summer constellation, Scorpius the Scorpion, which lies due south. The brightest star in Scorpius is Antares, a red giant. Use the brighter constellations to locate some of the fainter constellations. Draw an invisible line from Deneb through Vega and a little further west. This will lead you to the constellation Hercules the Hero. Move west and back to the bright star Arcturus. Since you have already followed the \"arc to Arcturus\", you can now \"spike to Spica\", which is the brightest star in the constellation Virgo the Maiden. Look for the Teapot. Moving back to the south and Scorpius, locate the \"Teapot\" asterism. It is made up of the brightest members of the constellation Sagittarius the Archer. An interesting fact; the area just above the \"spout\" and between Scorpius marks the direction of the center of the Milky Way, our galactic home. Find the Big Bear. Move back north now. The Big Dipper (the Plough) mentioned before as an asterism is actually part of a large constellation known as Ursa Major, the Big Bear. If you follow an invisible line from the two stars opposite the handle (the \"pointers\"), you'll find that they point almost directly towards Polaris, the North Star, which is at the end of the handle of the Little Dipper, another asterism. This is actually Ursa Minor, the Little Bear. Go for Cassiopeia, the queen. If you continue to follow the line through Polaris, you will come to a constellation that lies almost directly opposite the sky of Ursa Major. This is Cassiopeia the Queen, one of the major autumn constellations. Locate one of the smallest of the 88 official constellations, just to the east of the Summer Triangle. This is Delphinus the Dolphin which truly looks like its namesake.",
  "tyn_model":[
    "plough",
    "vega",
    "teapot",
    "altair",
    "little dipper",
    "polaris"
  ],
  "tyn_section":[

  ]
}