{
  "title":"How to Control Grassy Weeds",
  "url":"https://www.wikihow.com/Control-Grassy-Weeds",
  "category_hierarchy":[
    "Home and Garden",
    "Gardening",
    "Garden Pests and Weeds"
  ],
  "parts":[
    {
      "name":"Preventing grassy weed growth",
      "steps":[
        {
          "headline":"Take a preventative approach to grassy weed control.",
          "description":"Most often the best defense against weeds is to make sure that your lawn is healthy and strong enough to ward of the weeds before they even surface. This includes ensuring that you are using the correct types of seeds when planting parts of the lawn."
        },
        {
          "headline":"Maintain your yard so that it is up to date with all of the necessary treatments.",
          "description":"For example, check to make sure that you are fertilizing and watering regularly and properly. Read the instructions for fertilizing the type of lawn you have and mark dates for addition of fertilizer on your calendar."
        },
        {
          "headline":"After regular ongoing yard maintenance, apply a pre-emergent weed control treatment to your lawn.",
          "description":"This will help prevent any weeds from sprouting out before they surface."
        }
      ]
    },
    {
      "name":"Removing grassy weeds from your lawn",
      "steps":[
        {
          "headline":"If all the above fails and weeds have already started attacking your yard, use a grassy weed control application.",
          "description":"There are two types of chemical weed control––one for pre-emergent weeds and one for post-emergent weeds. Ask for advice at your local hardware store, based on the identification of the weeds in your yard."
        },
        {
          "headline":"If you don't want to use chemicals but don't mind manual work, you can also try removing the weeds by pulling them out.",
          "description":"Be careful to make sure you are removing the entire weed if you decide to pull it out, getting all of the root as well. If hand pulling, do so before the seeds emerge, to ensure that the plant is not more widely distributed as you carry it about while clearing."
        },
        {
          "headline":"Apply additional (and regular) yard care and weed control treatments to prevent the grassy weeds from coming back.",
          "description":"It is only with persistent and consistent care that you can keep grassy weeds at bay. It will only take a season of not caring for the yard for the weeds to re-invade the area, so if you're not able to undertake maintenance when needed, get in someone who can do it for you."
        }
      ]
    }
  ],
  "text":" Preventing grassy weed growth Take a preventative approach to grassy weed control. Most often the best defense against weeds is to make sure that your lawn is healthy and strong enough to ward of the weeds before they even surface. This includes ensuring that you are using the correct types of seeds when planting parts of the lawn. Maintain your yard so that it is up to date with all of the necessary treatments. For example, check to make sure that you are fertilizing and watering regularly and properly. Read the instructions for fertilizing the type of lawn you have and mark dates for addition of fertilizer on your calendar. After regular ongoing yard maintenance, apply a pre-emergent weed control treatment to your lawn. This will help prevent any weeds from sprouting out before they surface. Removing grassy weeds from your lawn If all the above fails and weeds have already started attacking your yard, use a grassy weed control application. There are two types of chemical weed control––one for pre-emergent weeds and one for post-emergent weeds. Ask for advice at your local hardware store, based on the identification of the weeds in your yard. If you don't want to use chemicals but don't mind manual work, you can also try removing the weeds by pulling them out. Be careful to make sure you are removing the entire weed if you decide to pull it out, getting all of the root as well. If hand pulling, do so before the seeds emerge, to ensure that the plant is not more widely distributed as you carry it about while clearing. Apply additional (and regular) yard care and weed control treatments to prevent the grassy weeds from coming back. It is only with persistent and consistent care that you can keep grassy weeds at bay. It will only take a season of not caring for the yard for the weeds to re-invade the area, so if you're not able to undertake maintenance when needed, get in someone who can do it for you.",
  "tyn_model":[
    "seeds",
    "fertilizer",
    "weed control treatment",
    "weed control application",
    "weeds",
    "yard care and weed control treatments"
  ],
  "tyn_section":[

  ]
}