{
  "title":"How to Get the Xenotech Expert Perk in Fallout 3",
  "url":"https://www.wikihow.com/Get-the-Xenotech-Expert-Perk-in-Fallout-3",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Fallout"
  ],
  "steps":[
    {
      "headline":"Download the Mothership Zeta DLC.",
      "description":"Alternatively, you can play the game of the year edition, which has all 4 DLC's pre-installed."
    },
    {
      "headline":"Mark the Not of This World quest.",
      "description":"Follow the marker to the downed alien ship."
    },
    {
      "headline":"Go into space.",
      "description":"You will be abducted, and have to fight the aliens to make it back to the Capitol Wasteland."
    },
    {
      "headline":"Play through the quest as you normally would.",
      "description":"Collect alien weaponry as you go along."
    },
    {
      "headline":"Locate the Weapons Lab.",
      "description":"This will be shortly after you blow up the three generators."
    },
    {
      "headline":"Kill the aliens inside the first part of the Weapons lab.",
      "description":"Do not leave."
    },
    {
      "headline":"Look for the shooting range.",
      "description":"It is located on a balcony immediately next to where you first enter."
    },
    {
      "headline":"Press the button at the shooting range.",
      "description":"Targets will teleport within the range."
    },
    {
      "headline":"Using an alien weapon (preferably the Alien Disintegrator), shoot the targets.",
      "description":"They will include Brahmin, Raiders, and Radscorpions."
    },
    {
      "headline":"Get in around ten hits; you will have the Xenotech Expert perk.",
      "description":"You now do 20% extra damage with alien weapons."
    }
  ],
  "text":" Download the Mothership Zeta DLC. Alternatively, you can play the game of the year edition, which has all 4 DLC's pre-installed. Mark the Not of This World quest. Follow the marker to the downed alien ship. Go into space. You will be abducted, and have to fight the aliens to make it back to the Capitol Wasteland. Play through the quest as you normally would. Collect alien weaponry as you go along. Locate the Weapons Lab. This will be shortly after you blow up the three generators. Kill the aliens inside the first part of the Weapons lab. Do not leave. Look for the shooting range. It is located on a balcony immediately next to where you first enter. Press the button at the shooting range. Targets will teleport within the range. Using an alien weapon (preferably the Alien Disintegrator), shoot the targets. They will include Brahmin, Raiders, and Radscorpions. Get in around ten hits; you will have the Xenotech Expert perk. You now do 20% extra damage with alien weapons.",
  "tyn_model":[
    "shooting range",
    "aliens",
    "weaponry",
    "raiders"
  ],
  "tyn_section":[

  ]
}