{
  "title":"How to Get Power Armor Training Without Joining the Brotherhood of Steel in Fallout 3",
  "url":"https://www.wikihow.com/Get-Power-Armor-Training-Without-Joining-the-Brotherhood-of-Steel-in-Fallout-3",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "Fallout"
  ],
  "steps":[
    {
      "headline":"Download the Operation: Anchorage DLC.",
      "description":"Alternatively, you can play the game of the year edition, which has all 4 DLC's pre-installed."
    },
    {
      "headline":"Mark the Aiding the Outcasts quest.",
      "description":"Follow the marker to Bailey Crossroads Metro."
    },
    {
      "headline":"Talk to Defender Morrill.",
      "description":"He will tell you to stay out of their way or help them. Join them as they attack Super Mutants."
    },
    {
      "headline":"Kill all Super Mutants in the surrounding area.",
      "description":"Locate Defender Morrill, if he survived, and talk to him. He will send you to Protector McGraw. If he did not survive, you are free to pass anyway."
    },
    {
      "headline":"Talk to Protector McGraw.",
      "description":"He will request that you go through the Anchorage simulator in order to open the door leading to the armory."
    },
    {
      "headline":"Accept the quest.",
      "description":"Talk to Specialist Olin to receive the Neural Interface Suit."
    },
    {
      "headline":"Enter the simulation pod.",
      "description":"Complete the three Anchorage quests inside."
    },
    {
      "headline":"Finish your mission, and exit the pod.",
      "description":"Open the door to the armory, and enjoy your spoils (including the Power Armor Training perk)."
    }
  ],
  "text":" Download the Operation: Anchorage DLC. Alternatively, you can play the game of the year edition, which has all 4 DLC's pre-installed. Mark the Aiding the Outcasts quest. Follow the marker to Bailey Crossroads Metro. Talk to Defender Morrill. He will tell you to stay out of their way or help them. Join them as they attack Super Mutants. Kill all Super Mutants in the surrounding area. Locate Defender Morrill, if he survived, and talk to him. He will send you to Protector McGraw. If he did not survive, you are free to pass anyway. Talk to Protector McGraw. He will request that you go through the Anchorage simulator in order to open the door leading to the armory. Accept the quest. Talk to Specialist Olin to receive the Neural Interface Suit. Enter the simulation pod. Complete the three Anchorage quests inside. Finish your mission, and exit the pod. Open the door to the armory, and enjoy your spoils (including the Power Armor Training perk).",
  "tyn_model":[
    "morrill",
    "anchorage simulator",
    "neural interface suit",
    "power armor"
  ],
  "tyn_section":[

  ]
}