{
  "title":"How to Rough Plumb a Basement Bathroom",
  "url":"https://www.wikihow.com/Rough-Plumb-a-Basement-Bathroom",
  "category_hierarchy":[
    "Home and Garden",
    "DIY"
  ],
  "parts":[
    {
      "name":"Preliminary Thinking",
      "steps":[
        {
          "headline":"Gather your materials:",
          "description":"Metal detector Scratch paper Tape measure"
        },
        {
          "headline":"Identify the main waste stack that goes from the upstairs bathroom to the sewer.",
          "description":"This will be a vertical cast iron pipe, more than likely 4\" in diameter."
        },
        {
          "headline":"Detect the cast iron pipe leading from the main waste stack to the sewer using a metal detector.",
          "description":"This is the pipe in the ground that the new toilet and sink will flow in to."
        },
        {
          "headline":"Identify where you want the sink and the toilet to be placed in the basement.",
          "description":"A crude drawing may be helpful to visualize where the you want the new sink and toilet in relation to the existing pipe. This will also help you when you measure out the length of PVC you'll need."
        },
        {
          "headline":"Plan the location of the new PVC pipe that will connect the new toilet and sink to the cast iron pipe in the ground.",
          "description":"It is recommended that it be a 45 degree PVC pipe that attaches to the existing cast iron to help with the flow of waste. Be sure to note that the PVC setup will vary depending on where the sink and toilet will be placed."
        }
      ]
    },
    {
      "name":"Breaking the Floor",
      "steps":[
        {
          "headline":"Prepare your materials:",
          "description":"Box cutter knife/chisel Safety Glasses Chalk/tape Jackhammer Bucket/spade Plastic curtain"
        },
        {
          "headline":"Remove any tile/carpeting/etc to expose the concrete above the spot you chose to place the new pipe.",
          "description":""
        },
        {
          "headline":"Draw an outline in chalk or tape on the concrete floor where you will need break it, based on where you decided the new toilet and sink will go.",
          "description":"Hanging a plastic curtain around the work area can help contain dust!"
        },
        {
          "headline":"Break the floor to expose the necessary section of the cast iron pipe as well as the path that the new pipe will lay for the toilet and sink.",
          "description":"This can be done with a jackhammer which can be rented at a home improvement store. Safety glasses should be worn when using tools!"
        },
        {
          "headline":"Clear out the concrete debris and dig out the sand so the new pipe has a place to lay.",
          "description":""
        }
      ]
    },
    {
      "name":"Assembling the New Pipe",
      "steps":[
        {
          "headline":"Collect the needed materials:",
          "description":"Necessary sections of PVC as determined in Part 1 PVC primer and cement Saw (hand or electric) for cutting PVC into shape Angle grinder Band-seal couplings and screwdriver"
        },
        {
          "headline":"Purchase the necessary length of PVC pipe that the new toilet and sink will flow into.",
          "description":""
        },
        {
          "headline":"Connect the pipe together in the shape that fits your design.",
          "description":"Use PVC primer and cement to fasten the sections together\nDue to chemical fumes, make sure the area is well ventilated!"
        },
        {
          "headline":"Cut an appropriate section of the cast iron pipe so the new PVC will fit in it.",
          "description":"This can be done with a high speed angle grinder\nThe angle grinder will make sparks, be sure to wear safety glasses!"
        },
        {
          "headline":"Attach the new PVC to the cast iron with band-seal couplings.",
          "description":"Make sure that there is enough PVC on either side of the wye so that the band-coupling has enough of both PVC and cast iron pipe to attach to! Cleaning the cast iron pipe makes for a tighter seal!"
        }
      ]
    },
    {
      "name":"Rebuilding the Floor",
      "steps":[
        {
          "headline":"Prepare the materials you'll need:",
          "description":"Bags of sand Bags of Ready Mix concrete Mason trowels"
        },
        {
          "headline":"Cover over the pipe over with sand.",
          "description":"Make sure the new pipe has a slope of at least 1/4\" every foot flowing into the cast iron pipe."
        },
        {
          "headline":"Cover over the sand with approx.",
          "description":"4\" of concrete so that just the pipes that the toilet will sit on and the sink will connect to are exposed."
        },
        {
          "headline":"Smooth out the concrete with the mason trowel so that new flooring can be added later.",
          "description":""
        }
      ]
    }
  ],
  "text":" Preliminary Thinking Gather your materials: Metal detector Scratch paper Tape measure Identify the main waste stack that goes from the upstairs bathroom to the sewer. This will be a vertical cast iron pipe, more than likely 4\" in diameter. Detect the cast iron pipe leading from the main waste stack to the sewer using a metal detector. This is the pipe in the ground that the new toilet and sink will flow in to. Identify where you want the sink and the toilet to be placed in the basement. A crude drawing may be helpful to visualize where the you want the new sink and toilet in relation to the existing pipe. This will also help you when you measure out the length of PVC you'll need. Plan the location of the new PVC pipe that will connect the new toilet and sink to the cast iron pipe in the ground. It is recommended that it be a 45 degree PVC pipe that attaches to the existing cast iron to help with the flow of waste. Be sure to note that the PVC setup will vary depending on where the sink and toilet will be placed. Breaking the Floor Prepare your materials: Box cutter knife/chisel Safety Glasses Chalk/tape Jackhammer Bucket/spade Plastic curtain Remove any tile/carpeting/etc to expose the concrete above the spot you chose to place the new pipe.  Draw an outline in chalk or tape on the concrete floor where you will need break it, based on where you decided the new toilet and sink will go. Hanging a plastic curtain around the work area can help contain dust! Break the floor to expose the necessary section of the cast iron pipe as well as the path that the new pipe will lay for the toilet and sink. This can be done with a jackhammer which can be rented at a home improvement store. Safety glasses should be worn when using tools! Clear out the concrete debris and dig out the sand so the new pipe has a place to lay.  Assembling the New Pipe Collect the needed materials: Necessary sections of PVC as determined in Part 1 PVC primer and cement Saw (hand or electric) for cutting PVC into shape Angle grinder Band-seal couplings and screwdriver Purchase the necessary length of PVC pipe that the new toilet and sink will flow into.  Connect the pipe together in the shape that fits your design. Use PVC primer and cement to fasten the sections together\nDue to chemical fumes, make sure the area is well ventilated! Cut an appropriate section of the cast iron pipe so the new PVC will fit in it. This can be done with a high speed angle grinder\nThe angle grinder will make sparks, be sure to wear safety glasses! Attach the new PVC to the cast iron with band-seal couplings. Make sure that there is enough PVC on either side of the wye so that the band-coupling has enough of both PVC and cast iron pipe to attach to! Cleaning the cast iron pipe makes for a tighter seal! Rebuilding the Floor Prepare the materials you'll need: Bags of sand Bags of Ready Mix concrete Mason trowels Cover over the pipe over with sand. Make sure the new pipe has a slope of at least 1/4\" every foot flowing into the cast iron pipe. Cover over the sand with approx. 4\" of concrete so that just the pipes that the toilet will sit on and the sink will connect to are exposed. Smooth out the concrete with the mason trowel so that new flooring can be added later. ",
  "tyn_model":[
    "cast iron",
    "pvc",
    "concrete",
    "sand",
    "angle grinder",
    "metal detector",
    "cast iron pipe",
    "toilet",
    "pvc pipe",
    "pvc primer",
    "cement",
    "sink",
    "box cutter knife",
    "chisel",
    "spade",
    "plastic curtain",
    "chalk",
    "tape",
    "jackhammer",
    "screwdriver",
    "ready mix concrete",
    "mason trowels",
    "mason trowel"
  ],
  "tyn_section":[

  ]
}