{
  "title":"How to Defeat Like Likes in the Legend of Zelda",
  "url":"https://www.wikihow.com/Defeat-Like-Likes-in-the-Legend-of-Zelda",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Games",
    "Video Games",
    "Multi Platform Games",
    "The Legend of Zelda Series"
  ],
  "methods":[
    {
      "name":"Defeating Like Likes Using a Sword",
      "steps":[
        {
          "headline":"Have your sword ready.",
          "description":"Like Likes can only be damaged by your sword, arrows, and bombs. All other weapons, like the Boomerang or the Hookshot, is useless against these creatures and will simply bounce off of its body. If you want to use a sword on Like Likes, have it ready."
        },
        {
          "headline":"Don’t get too close.",
          "description":"Once the monster approaches you (don’t worry, it moves really slowly), quickly take a step back away from its range. If you get too close to it, a Like Like will spring towards you and suck you inside its body. You’ll stay inside it for a second or two until it regurgitates you out, dealing damage and stripping you off of your shield or tunic (if you have any)."
        },
        {
          "headline":"Attack the Like Like.",
          "description":"Draw out your sword and take a slash at the monster. It doesn’t have any defensive move so your strike will directly hit it without effort. It takes around two or three blows of your sword before the monster can be killed."
        },
        {
          "headline":"Get your items back.",
          "description":"If the Like Like did manage to devour you, the shield or tunic it stole from you will drop to the ground once you defeat it. Walk towards the items it dropped to take back your precious items."
        }
      ]
    },
    {
      "name":"Defeating Like Likes Using Bombs",
      "steps":[
        {
          "headline":"Have your bombs ready.",
          "description":"Once you spot a Like Like, press the Action button on your controller where the bomb is equipped to take out a bomb."
        },
        {
          "headline":"Throw the bomb.",
          "description":"Once the monster approaches you, press the Action button again to throw one directly at the monster, and it will suck the bomb."
        },
        {
          "headline":"Wait for a few seconds.",
          "description":"The bomb will go off inside the Like Like’s body, killing it. As you wait for the bomb to go off, it’s best that you back away from the monster to avoid being sucked in."
        },
        {
          "headline":"Get your items back.",
          "description":"If the Like Like did manage to devour you, the shield or tunic it stole from you will drop to the ground once you defeat it. Walk towards the items it dropped to take back your precious items."
        }
      ]
    },
    {
      "name":"Defeating Like Likes with Your Bow and Arrows",
      "steps":[
        {
          "headline":"Have your bow and arrow ready.",
          "description":"Once you spot a Like Like, find a safe spot a great distance away from where the monster is."
        },
        {
          "headline":"Shoot the Like Like.",
          "description":"Press and hold the Action button where you currently have the bow and arrow equipped. Adjust your aim using the control keys on your controller, and release the Action button to shoot the monster. It takes two or three shots of arrow to kill the monster."
        },
        {
          "headline":"Get your items back.",
          "description":"If the Like Like did manage to devour you, the shield or tunic it stole from you will drop to the ground once you defeat it. Walk towards the items it dropped to take back your precious items."
        }
      ]
    }
  ],
  "text":" Defeating Like Likes Using a Sword Have your sword ready. Like Likes can only be damaged by your sword, arrows, and bombs. All other weapons, like the Boomerang or the Hookshot, is useless against these creatures and will simply bounce off of its body. If you want to use a sword on Like Likes, have it ready. Don’t get too close. Once the monster approaches you (don’t worry, it moves really slowly), quickly take a step back away from its range. If you get too close to it, a Like Like will spring towards you and suck you inside its body. You’ll stay inside it for a second or two until it regurgitates you out, dealing damage and stripping you off of your shield or tunic (if you have any). Attack the Like Like. Draw out your sword and take a slash at the monster. It doesn’t have any defensive move so your strike will directly hit it without effort. It takes around two or three blows of your sword before the monster can be killed. Get your items back. If the Like Like did manage to devour you, the shield or tunic it stole from you will drop to the ground once you defeat it. Walk towards the items it dropped to take back your precious items. Defeating Like Likes Using Bombs Have your bombs ready. Once you spot a Like Like, press the Action button on your controller where the bomb is equipped to take out a bomb. Throw the bomb. Once the monster approaches you, press the Action button again to throw one directly at the monster, and it will suck the bomb. Wait for a few seconds. The bomb will go off inside the Like Like’s body, killing it. As you wait for the bomb to go off, it’s best that you back away from the monster to avoid being sucked in. Get your items back. If the Like Like did manage to devour you, the shield or tunic it stole from you will drop to the ground once you defeat it. Walk towards the items it dropped to take back your precious items. Defeating Like Likes with Your Bow and Arrows Have your bow and arrow ready. Once you spot a Like Like, find a safe spot a great distance away from where the monster is. Shoot the Like Like. Press and hold the Action button where you currently have the bow and arrow equipped. Adjust your aim using the control keys on your controller, and release the Action button to shoot the monster. It takes two or three shots of arrow to kill the monster. Get your items back. If the Like Like did manage to devour you, the shield or tunic it stole from you will drop to the ground once you defeat it. Walk towards the items it dropped to take back your precious items.",
  "tyn_model":[
    "sword",
    "shield",
    "bombs",
    "bomb",
    "bow and arrow",
    "arrows",
    "tunic"
  ],
  "tyn_section":[

  ]
}