{
  "title":"How to Make Soap On A Rope",
  "url":"https://www.wikihow.com/Make-Soap-On-A-Rope",
  "category_hierarchy":[
    "Hobbies and Crafts",
    "Crafts"
  ],
  "methods":[
    {
      "name":"From scratch",
      "steps":[
        {
          "headline":"Finely grate the soap into a large bowl.",
          "description":""
        },
        {
          "headline":"Fill the jug with warm water.",
          "description":"If you want to make coloured soap, add a few drops of your chosen food colouring to the water. (Don’t overdo it though, or you’ll find your skin changing colour as you wash!)"
        },
        {
          "headline":"Add drops of warm water slowly to the soap flakes until it’s the consistency of thick porridge.",
          "description":""
        },
        {
          "headline":"Pull on the rubber gloves and mix well with your hands.",
          "description":""
        },
        {
          "headline":"Cut the rope, ribbon or twine into your chosen length (30-40 cm/11-15 in is ideal).",
          "description":"Lay onto the waxed paper."
        },
        {
          "headline":"Pat the soap mixture around one end of the rope in a ball shape.",
          "description":"Make sure the rope is in the centre of the ball."
        },
        {
          "headline":"Once happy with the shape, leave the soap to dry for around 24 hours.",
          "description":""
        },
        {
          "headline":"Tie a loop in the other end of the rope so that you can hang it up in the shower.",
          "description":""
        }
      ]
    },
    {
      "name":"Using existing soap",
      "steps":[
        {
          "headline":"Choose a suitable soap that has already been made.",
          "description":"It should be a large soap, with a good firmness but not brittle. Old soap will likely break, so only use new soaps bought freshly from the store. Any fragrance or color is fine. Get a few, as some may break when drilling."
        },
        {
          "headline":"Drill a hole down the center of the soap.",
          "description":"Use a fine drill bit to drill straight down the center of the soap. Do this gently and slowly."
        },
        {
          "headline":"Thread a ribbon, string or cord through the hole.",
          "description":"Tie a knot. To help, tie the cord, ribbon, etc. onto a toothpick to pull through the soap. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2b\\/Make-Soap-On-A-Rope-Step-11Bullet1.jpg\\/v4-460px-Make-Soap-On-A-Rope-Step-11Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2b\\/Make-Soap-On-A-Rope-Step-11Bullet1.jpg\\/v4-760px-Make-Soap-On-A-Rope-Step-11Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"}"
        },
        {
          "headline":"Hang the soap in the shower.",
          "description":"Instant soap-on-a-rope without too much effort."
        }
      ]
    }
  ],
  "text":" From scratch Finely grate the soap into a large bowl.  Fill the jug with warm water. If you want to make coloured soap, add a few drops of your chosen food colouring to the water. (Don’t overdo it though, or you’ll find your skin changing colour as you wash!) Add drops of warm water slowly to the soap flakes until it’s the consistency of thick porridge.  Pull on the rubber gloves and mix well with your hands.  Cut the rope, ribbon or twine into your chosen length (30-40 cm/11-15 in is ideal). Lay onto the waxed paper. Pat the soap mixture around one end of the rope in a ball shape. Make sure the rope is in the centre of the ball. Once happy with the shape, leave the soap to dry for around 24 hours.  Tie a loop in the other end of the rope so that you can hang it up in the shower.  Using existing soap Choose a suitable soap that has already been made. It should be a large soap, with a good firmness but not brittle. Old soap will likely break, so only use new soaps bought freshly from the store. Any fragrance or color is fine. Get a few, as some may break when drilling. Drill a hole down the center of the soap. Use a fine drill bit to drill straight down the center of the soap. Do this gently and slowly. Thread a ribbon, string or cord through the hole. Tie a knot. To help, tie the cord, ribbon, etc. onto a toothpick to pull through the soap. {\"smallUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2b\\/Make-Soap-On-A-Rope-Step-11Bullet1.jpg\\/v4-460px-Make-Soap-On-A-Rope-Step-11Bullet1.jpg\",\"bigUrl\":\"https:\\/\\/www.wikihow.com\\/images\\/thumb\\/2\\/2b\\/Make-Soap-On-A-Rope-Step-11Bullet1.jpg\\/v4-760px-Make-Soap-On-A-Rope-Step-11Bullet1.jpg\",\"smallWidth\":460,\"smallHeight\":345,\"bigWidth\":760,\"bigHeight\":570,\"licensing\":\"<div class=\\\"mw-parser-output\\\"><p>License: <a rel=\\\"nofollow\\\" class=\\\"external text\\\" href=\\\"https:\\/\\/creativecommons.org\\/licenses\\/by-nc-sa\\/3.0\\/\\\">Creative Commons<\\/a><br>\\n<\\/p><p><br \\/>\\n<\\/p><\\/div>\"} Hang the soap in the shower. Instant soap-on-a-rope without too much effort.",
  "tyn_model":[
    "soap",
    "water",
    "ribbon",
    "large bowl",
    "jug",
    "rubber gloves",
    "rope",
    "twine",
    "waxed paper",
    "soaps",
    "drill bit",
    "toothpick"
  ],
  "tyn_section":[

  ]
}